{
  "title": "Alcaraz races into US Open third round as Djokovic, Sabalenka advance - Sport - DAWN.COM",
  "author": null,
  "content": "Carlos Alcaraz stormed into the third round of the US Open with a blistering straight-sets victory on Wednesday as Novak Djokovic overcame an early scare to advance.\n\nAlcaraz, who could meet Djokovic in the semi-finals at Flushing Meadows if the draw follows the seedings, blew away Italy’s Mattia Bellucci 6-1, 6-0, 6-3 in just one hour 36 minutes on the Arthur Ashe Stadium main court.\n\nThe 22-year-old Spanish second seed unfurled a stream of 32 winners in a dominant display against the 65th-ranked Bellucci, whose best performance in a Grand Slam came with a run to the third round at Wimbledon earlier this year.\n\n“I played great to be honest, from the beginning until the last ball,” said Alcaraz, who will face another Italian, 32nd seed Luciano Darderi, in the next round.\n\n“The less time I spend on court the better for me, to go to bed early,” he added.\n\nElsewhere on Wednesday, Serbian legend Djokovic kept his dream of a record 25th Grand Slam singles title alive after a four-set defeat of American qualifier Zachary Svajda.\n\nDjokovic though was forced to dig deep after losing the first set before claiming a 6-7 (5/7), 6-3, 6-3, 6-1 win.\n\nDjokovic, 38, said that while not at his best, he is hoping to play himself into form as the tournament progresses.\n\n“That’s what I’m hoping, the deeper I go into the tournament the better I feel about my game,” he said.\n\nDjokovic’s victory sees him into the third round at the US Open for a record-equalling 19th time, where he will face Britain’s Cameron Norrie, who defeated Argentina’s Francisco Comesana 7-6 (7/5), 6-3, 6-7 (0/7), 7-6 (7/4).\n\nIn other men’s action on Wednesday, Norwegian 12th seed Casper Ruud, the 2022 US Open finalist, exited to Belgium’s Raphael Collignon, losing 6-4, 3-6, 3-6, 6-4, 7-5.\n\nFourth seed Taylor Fritz advanced safely, beating South Africa’s Lloyd Harris 4-6, 7-6 (7/3), 6-2, 6-4, while American compatriot Frances Tiafoe, seeded 17, also progressed with a four-set defeat of qualifier Martin Damm.\n\nTiafoe won 6-4, 7-5, 6-7 (8/10), 7-5.\n\nIn the women’s draw, meanwhile, defending champion and world number one Aryna Sabalenka moved into the next round with a workmanlike display to dispatch unseeded Russian Polina Kudermetova 7-6 (7/4), 6-2.\n\nSabalenka started slowly but after taking the first set on a tie-break, asserted her control to pull away in the second. The Belarusian will play Canada’s Leylah Fernandez in the third round.\n\n“The first set was super-tight, super-aggressive. I was glad I was able to handle that pressure and put it back to her. In the second set I felt much better in the return game.”\n\nElsewhere Wednesday’s Latvia’s 25th seed Jelena Ostapenko was upset 7-5, 6-1 by Taylor Townsend before unleashing a furious on-court tirade at the American.\n\nTownsend said Ostapenko accused her of lacking “class” during her rant.\n\n“She told me I have no education, no class, and to see what happens if we play each other outside of the US,” Townsend said.\n\n“It was unfortunate, but, you know, it’s something I can put on my Tiktok.”\n\nOstapenko said on Instagram she had been angered by Townsend’s failure to acknowledge a net cord in her favour during the match.\n\nIn other matches, Britain’s Emma Raducanu continued her solid start to the tournament after dispatching Indonesian qualifier Janice Tjen in straight sets, winning 6-2, 6-1.\n\nTjen had become the first Indonesian player to reach the main draw of a Grand Slam in 21 years and followed that up with a first round upset of 24th seed Veronika Kudermetova.\n\nBut she was beaten comfortably by Raducanu, who is aiming to recapture the US Open title she won as an 18-year-old qualifier in 2021. Raducanu will face ninth seed Elena Rybakina in the next round.\n\nWhile Tjen headed for the exit, another player from Southeast Asia, the Philippines’ Alexandra Eala, also saw her tournament come to an end.\n\nEala, the first player from the Philippines to win a Grand Slam singles match with her defeat of 14th seed Clara Tauson on Sunday, was beaten 6-4, 6-3 by Spain’s Cristina Bucsa.\n\nFourth seed Jessica Pegula is also into the third round after beating Russian Anna Blinkova 6-1, 6-3.\n\nThere was a win too for veteran Victoria Azarenka, the 36-year-old two-time Australian Open champion from Belarus, who defeated Russia’s Anastasia Pavlyuchenkova 6-3, 6-3.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/28105400874151e.webp",
  "retrievedAt": "2025-09-06T09:50:23.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937845/alcaraz-races-into-us-open-third-round-as-djokovic-sabalenka-advance",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T05:59:31.000Z"
}
