{
  "title": "Canada, India appoint new envoys to each other’s countries in sign of improving ties - World - DAWN.COM",
  "author": null,
  "content": "Canada and India announced new high commissioners to each other’s countries on Thursday, in the latest sign of improving ties frayed by former Prime Minister Justin Trudeau’s allegation that India was linked to the killing of a Sikh separatist leader on Canadian soil.\n\nIndia’s previous high commissioner left Canada in October. Ottawa said he was among six diplomats who were expelled after they were linked to the murder of separatist Hardeep Singh Nijjar, while India said it had withdrawn the envoy.\n\nIndia also said that same day that it had ordered the expulsion of six high-ranking Canadian diplomats, including the then-acting high commissioner.\n\nTrudeau’s successor, Mark Carney, and Indian Prime Minister Narendra Modi agreed to reinstate senior diplomats when they held their first bilateral meeting in Canada in June.\n\nCanada’s foreign ministry said in a statement on Thursday that veteran diplomat Christopher Cooter would take up the post, which had been vacant since the previous incumbent left last year.\n\n“The appointment of a new high commissioner reflects Canada’s step-by-step approach to deepening diplomatic engagement and advancing bilateral cooperation with India,” Foreign Minister Anita Anand said in a statement.\n\nIndia’s foreign ministry said its new high commissioner, Dinesh K Patnaik, was “expected to take up the assignment shortly”.\n\nNijjar, who was designated a terrorist by India in 2020, was shot dead outside a Sikh temple in June 2023.\n\nTrudeau in September of that year said Canada was pursuing “credible allegations” linking Indian government agents to his murder, but India dismissed the claims and accused Canada of providing a safe haven for Sikh separatists.\n\nCanada has the largest population of Sikhs outside India’s Punjab. India is Canada’s top source of temporary foreign workers and international students, as well as an important market for pulses such as lentils and yellow peas.\n\nCanadian Prime Minister Carney has stressed the importance of diversifying trade away from the United States.\n\nThe appointment of a new high commissioner came a day after United States President Donald Trump’s doubling of tariffs on imports from India to as much as 50 per cent took effect, delivering a serious blow to ties.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/28204902782bf11.webp",
  "retrievedAt": "2025-09-06T09:50:18.373Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937945/canada-india-appoint-new-envoys-to-each-others-countries-in-sign-of-improving-ties",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T15:52:14.000Z"
}
