{
  "title": "2 suspects allegedly involved in Raiwind brothers’ murder case killed in CCD ‘encounter’: lawyer - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two men arrested for torturing two brothers in a Rs30 dispute with street vendors in Raiwind were killed in an “encounter” with the Crimes Control Department (CCD), the victims’ lawyer said on Thursday.\n\nThe incident came to light after a video clip showing street vendors subjecting both brothers to torture went viral on social media. The suspected attackers were spotted holding clubs in their hands and beating the victims at a public place in Raiwind. One brother died of severe torture marks at the spot, while the other succumbed to his injuries on Sunday.\n\nAli Ahmed Awan, the lawyer representing the victims’ father, told Dawn.com a day prior that a total of six suspects were named in the case, out of which three — including the main suspect — had been arrested.\n\n“Two of the suspects, Owais and Shahzad, were killed in a police encounter after their accomplices attempted to attack the police,” Awan said today. “The CCD is still searching for the rest of the suspects.”\n\nNo case has been registered regarding the police encounter yet, he said.\n\nOn August 22, a first information report (FIR) was filed on the complaint of the victims’ father at the Raiwind City Police Station under Sections 147 (punishment for rioting), 149 (unlawful assembly) and 302 (murder) of the Pakistan Penal Code.\n\nAccording to the FIR, the incident occurred on August 21 at 5:45pm when the brothers were returning home and stopped to buy some fruit.\n\n“Due to a dispute over money, the owner of the fruit cart … and his brother … began beating my sons and called some other people,” the complainant said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:50:21.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937863/2-suspects-allegedly-involved-in-raiwind-brothers-murder-case-killed-in-ccd-encounter-lawyer",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T08:16:19.000Z"
}
