{
  "title": "KP launches polio immunisation drive, aims to target 5.7m children - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Khyber-Pakhtunkhwa government on Thursday launched an anti-polio drive, aiming to immunise 5.7 million children in the province amid security risks.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Challenges such as security issues, vaccine hesitancy, and misinformation have slowed the progress of eradication efforts. The vaccinators, who go door-to-door to inoculate children, are frequently targeted by militants, esp­e­cially in KP and Balochistan. In 2024 alone, 20 people were killed and 53 were injured during anti-polio campaigns in the KP.\n\nOn August 26, two new cases were reported in the south of the province, taking KP’s total polio cases for this year to 15, while the nationwide tally stands at 23.\n\nThe immunisation campaign was formally launched today at Peshawar Police Services Hospital, where the KP Adviser on Health Ehtesham Ali, while speaking to the media, said, “We have developed a more organised and strategic approach this time, especially in areas where cases have recently been reported.”\n\nHe noted that out of 15 polio cases in KP, 13 were reported in the south of the province. Detailing the campaign, Ali shared that it will be conducted in two phases.\n\nThe first phase of the immunisation campaign will run for four days, starting from September 1, and is set to fully cover Peshawar, Mardan, Swabi, Nowshera, and Charsadda, including 16 other districts, while another three districts will be covered partially, according to data provided by the KP health department.\n\nThe second phase will run for three days and is set to begin from Sept 15, aiming to target Bannu, Bajaur, and seven districts of the Dera Ismail Khan division.\n\nThe seven-day campaign — which aims to immunise 5.7m children — will engage 27,000 polio teams, while 40,000 security personnel are to be deployed for their protection.\n\nAli highlighted that, “While the world has largely eradicated polio, we are still facing challenges in Khyber Pakhtunkhwa.“\n\n“Committees have been formed to engage and convince reluctant parents, and efforts are underway to address local resistance,“ he added.\n\nThe health adviser cited misinformation, refusal by parents to vaccinate their children, and particularly security risks as reasons for the slow progress of eradication efforts.\n\n“Insecurity in certain districts has made it difficult to consistently run successful campaigns,” the advisor said, adding that while teams may be facing security issues, the government has planned strategies accordingly.\n\nOn that note, he said that the KP government had launched a polio campaign in South Waziristan after two years, adding that the merged districts and the south were regions where polio teams faced the most resistance.\n\nEchoing similar concerns, KP Chief Secretary Shahab Ali Shah, who was also present at the event, noted that merged districts and the south of the province are where polio teams face the most resistance.\n\n“Our teams are facing real challenges, but the government and the Pakistan Army are actively helping to maintain law and order in these sensitive areas,” he said.\n\nStressing the importance of routine immunisations, Shah said, “Strengthening overall healthcare services is essential to controlling not just polio, but other preventable diseases as well.”\n\n“When one child contracts polio, the entire family suffers — both emotionally and economically,” he remarked.\n\nPolio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine (OPV) for every child under five during each campaign, along with the timely completion of all essential immunisations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/28152002fd85d4f.webp",
  "retrievedAt": "2025-09-06T09:50:20.948Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937899/kp-launches-polio-immunisation-drive-aims-to-target-57m-children",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T10:36:07.000Z"
}
