{
  "title": "Afghanistan have no ‘specific targets’, says captain Rashid ahead of tri-series - Sport - DAWN.COM",
  "author": null,
  "content": "Afghanistan captain Rashid Khan says his team have no “specific targets” despite producing groundbreaking performances in recent ICC global events, ahead of a T20 international tri-series starting on Friday.\n\nRashid’s men face Pakistan in the opening game in Sharjah, with the United Arab Emirates the other side taking part in the event which serves as a warm-up for next month’s Asia Cup, also in the UAE.\n\nAfghanistan reached the semi-finals of last year’s T20 World Cup in the United States and the Caribbean, and narrowly missed out on reaching the last four at the ODI Champions Trophy in Pakistan earlier in 2025.\n\nThose performances followed an impressive showing at the 2023 one-day World Cup, when the Afghans produced statement wins over England, Pakistan and Sri Lanka.\n\n“We do not have specific targets, and we do not want to put extra pressure on our players,” Rashid said Thursday when asked if Afghanistan are targeting the Asia Cup title.\n\n“Our target is to play the brand of cricket we have played over the years.\n\n“For us the main target is to put in 200 per cent effort on the ground.\n\n“I think we have been doing well in the ICC events and although we haven’t played T20I cricket over the last few months, the guys have been playing in T20 leagues around the world and that has helped.”\n\nAfghanistan beat Pakistan 2-1 in a T20I series at the same venue in 2023.\n\nThe 16-man Afghan squad for the tri-series includes fast-rising mystery spinner AM Ghazanfar along with fellow spin bowlers Noor Ahmad, Mohammad Nabi, Mujeeb Ur Rahman and Rashid.\n\nThe trophy for the tri-series was unveiled earlier today.\n\nThe Asia Cup gets under way on September 9, as teams ramp up their preparations for the 2026 T20 World Cup in India and Sri Lanka.\n\nContrary to Afghanistan, Pakistan’s fortunes are dipping after they crashed out of the last T20 World Cup in the group stage before failing to win a match at the Champions Trophy.\n\nThis year they lost a T20 series in Bangladesh 2-1 but overcame the West Indies by the same margin.\n\nUnder new captain Salman Agha, Pakistan are going through a transition with former skippers Babar Azam and Mohammad Rizwan out of the T20 squad.\n\n“We are trying to build a team and this tri-series and then the Asia Cup will be a good opportunity to achieve that,” said Agha.\n\n“We know both these events will be challenging but we are ready.” All three teams in the tri-series will play each other twice, with the top two to face off in a final on September 7.\n\nBesides Afghanistan, Pakistan and the UAE, the Asia Cup will also include defending champions India, Sri Lanka, Bangladesh, Oman and Hong Kong.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:50:18.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937930/afghanistan-have-no-specific-targets-says-captain-rashid-ahead-of-tri-series",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T13:25:06.000Z"
}
