{
  "title": "IHC chief justice ‘lacks’ financial powers vested in LHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: While the Lahore High Court has defended the exclusive authority of its chief justice to grant pecuniary benefits to court officials, the rules governing the service conditions of Islamabad High Court staff have curtailed this power.\n\nThe LHC’s stance came in response to a petition filed in the Supreme Court against the grant of advance increments by former chief justice Mohammad Ameer Bhatti. The high court defended the discretionary powers of the chief justice in this regard.\n\nHowever, the High Court Establishment (Appointment and Conditions of Service) Rules, 2025, framed by former IHC chief justice Aamer Farooq-led administration committee, days before his elevation to the Supreme Court, had restricted such powers and made them subject to the approval of the committee.\n\nThese rules also substantially reduced the authority of the senior puisne judge.\n\nSub-rule 3 of Rule 13 of the IHC Establishment (Appointment and Conditions of Service), dealing with terms and conditions of IHC staff, states: “The chief justice in his discretion may, on recommendations of the administrative committee, grant any allowance including performance allowance or advance increments to any or all the staff.”\n\nPreviously, the chief justice alone was empowered to grant such allowances. The amendment was introduced after the Supreme Court admitted a petition challenging the advance increments awarded to LHC officials by its former chief justice shortly before his retirement.\n\nAdvocate Mian Daud, who filed the petition, described the grant of increments as a “colorful exercise of discretion”. A five-judge SC constitutional bench admitted the plea, observing that “the issue involved in this matter relates to the public exchequer,” and also issued notice to the LHC.\n\nIn its reply, the LHC argued before the Supreme Court that the chief justice is entitled to grant increments or any other allowance to officials. Advocate Daud, however, submitted a list of officials who had received advance increments, some of them were now serving in the IHC.\n\nThe petitioner questioned the discretionary authority of the chief justice to grant financial benefits to court and judicial officers, arguing that such powers, when exercised without a transparent mechanism, violate the principles of equality and accountability enshrined in the Constitution.\n\nPublished in Dawn, August 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:50:54.951Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937785/ihc-chief-justice-lacks-financial-powers-vested-in-lhc",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T00:01:04.000Z"
}
