{
  "title": "Saudi Aramco, Iraq’s SOMO halt crude sales to Indian refiner Nayara, sources say - World - DAWN.COM",
  "author": null,
  "content": "Saudi Aramco and Iraq’s state oil company SOMO have stopped selling crude oil to India’s Nayara Energy in the aftermath of sanctions imposed in July by the European Union on the Russian-backed refiner, three sources familiar with the matter said.\n\nThe halting of supply from the two Gulf exporters means Nayara, majority-owned by Russian entities including oil major Rosneft, relied entirely on Russia for its crude oil imports in August, according to sources and LSEG shipping data.\n\nNayara typically receives around two million barrels of Iraqi crude and 1m barrels of Saudi crude each month, but did not receive shipments from either of the two suppliers during August, shipping data from Kpler and LSEG showed.\n\nSOMO and Nayara did not respond to requests for comment. Saudi Aramco declined to comment.\n\nTwo of the sources said that the sanctions had created payment problems for Nayara’s purchases from SOMO, without providing further details.\n\nThe most recent cargo of Basra crude from SOMO was discharged for Nayara by the Kalliopi, a very large crude carrier (VLCC), at Vadinar port on July 29, according to Kpler and LSEG data as well as data obtained from industry sources.\n\nThe private refiner received 1m barrels of Arab Light carried by the VLCC Georgios co-loaded with a similar quantity of Basrah heavy on July 18, its last Saudi delivery, according to LSEG data.\n\nNayara is receiving direct supplies from Rosneft, an official from the Russian Embassy in New Delhi said last month.\n\nThe private company is operating its 400,000 barrel-per-day refinery at Vadinar in western India at about 70-80 per cent capacity due to difficulties in selling its products resulting from the sanctions, sources have said.\n\nNayara Energy, which controls about 8pc of India’s 5.2m barrel-per-day refining capacity, has been struggling to transport fuel since the EU sanctions, relying on so-called dark fleet vessels after other shippers backed out, according to shipping reports and LSEG data.\n\nThe company’s CEO resigned in July. Last week, Nayara announced the appointment of a senior executive from Azerbaijan’s national oil company SOCAR as its chief executive.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/022147458fee31d.webp",
  "retrievedAt": "2025-10-12T03:54:57.955Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939200/saudi-aramco-iraqs-somo-halt-crude-sales-to-indian-refiner-nayara-sources-say",
  "dateList": "2025-08-28",
  "date_published": "2025-09-02T17:18:59.000Z"
}
