{
  "title": "Irsa ‘turns off’ tap at Tarbela as Sindh prepares for surge - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Lower riparian takes measures to tackle inflows from swollen Indus tributaries at Guddu Barrage\n• Irsa director says flood of about 650,000 cusecs likely at Guddu if current situation persists\n\nHYDERABAD: As Sindh anticipates a very high flood between Sept 1 and 3 at Guddu Barrage — its first barrage on the Indus River — due to the swollen eastern rivers currently wreaking havoc in Punjab, the downstream province has asked the authorities to reduce outflows from Tarbela Dam to help it manage the deluge.\n\nAs multiple rivers submerge Punjab, Sindh has reached out to the Indus River System Authority (Irsa) to reduce outflows from Tarbela and retain water at Chashma Barrage — a request accepted by the authority.\n\nThe provincial irrigation authorities are keeping an eye on flows generated in the Chenab, Sutlej, and Ravi rivers, as all these rivers converge in the Indus at Mithankot after passing the Panjnad Barrage built over the Jhelum River. At Panjnad, all tributaries of the Indus meet on their way to the sea through Sindh.\n\n“As of today, I foresee a flow of between 650,000 and 700,000 cusecs at Guddu Barrage once the flows start reaching here from the eastern rivers,” Jam Khan, Sindh’s irrigation minister, told Dawn on the phone from Karachi. “Right now it is a guessing game because nobody knows how the rainfall pattern behaves but we are making full preparations and accordingly managing staff at the dykes,” he added.\n\nZarif Kharif, the Sindh irrigation secretary, said a similar situation was witnessed in 2014 when Khanki Barrage on Chenab reported 947,000 cusecs flow on Sept 7, 2014 and Sindh had received about 475,000 cusecs.\n\n“This time, the situation is a bit different because Guddu passed a high flood of 510,798 cusecs on Aug 24. As of Wednesday, Guddu was still showing an upstream discharge of 335,196 cusecs, he said, adding that the flows would increase once water from Punjab reached the barrage.\n\nIn order to manage the surge, the secretary confirmed that they reached out to Irsa Director Operations Khalid Idrees Rana for controlling outflows at Tarbela. An outflow of 154,500 cusecs was recorded at Tarbela at 6am on Wednesday, which notably increased to 256,200 cusecs at 6pm. This, coupled with the Kabul River, will reach Sindh’s barrages within a few days.\n\nTarbela Dam had attained the maximum storage level of 1,550 feet on Aug 21. After Irsa started discharging flows, the dam’s level stood at 1549.66ft on Wednesday at 6pm. Against this backdrop, the irrigation secretary asked Irsa to retain water at Chashma so that Sindh could manage its flows from the swollen eastern rivers.\n\n“Yes, we have reduced flows from Tarbela (at Sindh’s request), where 155,000 cusecs outflow was recorded at 8pm Wednesday,” the Irsa operations director told Dawn. He also confirmed that “storage can be taken slightly higher than maximum storage of 1,550 feet. We can take it to 1550.2 or 1550.3 feet for now,” he argued.\n\nHe said that a positive sign was that there were no back-up flows in the Chenab. “We are observing nullahs like Palkhu, Basantpur and Bhimber currently,” he said. He pointed out that in view of the current situation, a flood of 650,000 cusecs or so was likely at Guddu and that too may last five to six hours. “We are struggling to manage flows in a way that Guddu’s discharge should remain below 600,000 cusecs.”\n\nPublished in Dawn, August 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:55:33.289Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937787/irsa-turns-off-tap-at-tarbela-as-sindh-prepares-for-surge",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T00:01:04.000Z"
}
