{
  "title": "Foreign firm shows interest in introducing hybrid corn seeds - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A Singa­pore-based hybrid seed company has shown keen interest in introducing climate-resilient hybrid corn seeds in Pakistan, finding the country having the po­­tential to get high yields.\n\n“Our latest hybrid corn seed technology has sho­wn the potential to incre­ase yields by up to 32 per cent, offering farmers higher productivity and improved profitability,” said Commercial Director for Southeast Asian Mar­kets of Corteva Agrisci­en­­ce (Singapore), Mr Bryce Sturgess, during a meeting with Minister for Nat­ional Food Security and Research Rana Tanveer Hussain in Islamabad on Wednesday.\n\nMr Sturgess informed the minister that by introducing climate-resilient hybrid corn seeds in Pakistan, “we aim to support farmers in overcoming challenges such as water scarcity and changing weather patterns”.\n\nCorteva is committed to working alongside the Pa­­kistan government to stre­ngthen food security thro­ugh innovative corn hyb­rids that are both sustainable and farmer-friendly, Mr Sturgess maintained.\n\nThe Singa­porean delegation head said with the adoption of advanced hybrid corn seeds, Pakistan’s farming community would not only achieve higher yields but also contribute to the country’s long-term agricultural sustainability. He also shared details of initiatives and investment plans in Pakistan’s agriculture sector.\n\nMr Hussain said that Pakistan’s agriculture sector requires modernisation and innovative appro­aches to meet challenges. He emphasised hybrid seed technology, along with improved agronomic practices, can substantially increase farmers’ income, reduce crop losses, and improve natio­nal food self-sufficiency.\n\nPublished in Dawn, August 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:50:54.831Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937783/foreign-firm-shows-interest-in-introducing-hybrid-corn-seeds",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T00:01:04.000Z"
}
