{
  "title": "Constable martyred in Bannu gunfight with terrorists - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT / KHYBER: A police official embraced martyrdom in a gunfight with terrorists in the Havaid area of Bannu district late Tuesday night.\n\nAlso, a bridge was partially damaged as an improvised explosive device went off in Tirah valley of Khyber tribal district on Wednesday.\n\nA police official said that around 30 terrorists carried out a late night attack on the house of constable Rafidullah in the Havaid rural area.\n\nHe said at the time of attack, Rafidullah was present at home and he refused to surrender.\n\n“The police constable fought bravely and saved all his family members from harm by laying down his own life,” he said.\n\nThe official said that the exchange of fire continued for quite some time before the assailants fled.\n\nHe said that a heavy police contingent led by DPO Saleem Abbas Kulachi reached the site and launched a search for attackers.\n\nThe body of the martyred policeman was taken to the police lines after medico-legal formalities were fulfilled at the hospital. His funeral prayer was offered later.\n\nRPO Sajjad Khan, SP (CTD) Fazal Wahid, SP (City) Tauheed Khan, SP (Investigation) Sajid Mumtaz, local elders and relatives of the deceased attended the last rites. A police contingent presented the final salute to their fallen colleague.\n\nThe regional police chief placed wreaths on the coffin and paid tribute to him for exhibiting unprecedented bravery in fighting terrorists.\n\nHe said that the martyred policeman was the real hero of the nation as he sacrificed his life to save his family and other people from the terrorist attack.\n\n“The supreme sacrifice offered by Rafidullah will be written with golden words in the history of our police department,” he said, vowing to bring attackers to justice.\n\nBRIDGE DAMAGED: Terrorists partially damaged a bridge by blasting an improvised explosive device in Tirah area on the night between Tuesday and Wednesday.\n\nLocal sources said the IED exploded at midnight, causing partial damage to a bridge. However, nobody was hurt.\n\nThe incident took place in the main road in Zakhakhel area which was under the control of 31 Baluch of 27 Brigade of the army.\n\nSources said that security forces cordoned the area immediately after the IED and conducted a search operation. No arrests were however made as miscreants had fled the area soon after the blast.\n\nTwo security personnel of the 31 Baluch regiment were martyred four days ago in a nearby locality when armed militants attacked a security checkpost at night.\n\nHELD: The police on Wednesday arrested three people for killing a man, his mother and niece in the Zafranabad area of Serai Naurang town.\n\nAn official said that on Aug 10, Khalil, along with three other people, shot down Noman, 26, his mother Malakia, 50, and niece Sahiba, 5, inside their house and fled.\n\nHe also said that Noman’s brother Luqman, 24, and daughters Saima, 3, Mahnoor, 7 and sister Shazia, 30 were injured in the attack.\n\nThe official said RPO Bannu Sajjad Khan directed Lakki Marwat DPO Nazir Khan to arrest the killers.\n\n“A special team comprising police experts found a clue about the gunmen with the help of advanced technology and human intelligence and captured three of them during a raid,” he said.\n\nThe official identified detainees as Hafizussalam of Sarwar Mamakhel, Najibullah of Behramkhel Naurang and Suleman of Nar Sher Khan and said efforts were under way to arrest the fourth accused, Khalil.\n\nHe said that the cops also seized an assault rifle used in the crime and a motorcar from them.\n\n“During initial interrogation, the detainees confessed to having committed the crime over a domestic dispute,” he said.\n\nPublished in Dawn, August 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:55:12.885Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937695/constable-martyred-in-bannu-gunfight-with-terrorists",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T00:02:10.000Z"
}
