{
  "title": "CDA plans to bring improvement in emergency services - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The city managers on Wednesday decided to bring improvement in emergency services besides setting up 12 rescue stations equipped with 50 motorbikes for rapid response.\n\nThe decision was made by the Capital Development Authority (CDA) board, which met here with CDA Chief Mohammad Ali Randhawa in the chair.\n\nThe CDA board also gave approval to filling vacant positions, training emergency staff and providing modern equipment to upgrade the Capital Emergency Services in Islamabad.\n\nIt was also decided to seek support regarding vetting of the equipment from the National Disaster Management Authority (NDMA) in this regard.\n\n12 rescue stations equipped with 50 motorbikes to be established\n\n“The board approved the recruitment process for various positions in the Capital Emergency Services. A state-of-the-art Emergency Operations Center (EOC) will be established for improved monitoring and tracking of all emergency operations.\n\n“Besides, 12 rescue stations will be set up across Islamabad for rapid response along with the launch of a motorbike rescue service comprising approximately 50 motorcycles,” read a press release issued by CDA after the board meeting.\n\nIt said that the approval was granted to finalise the Capital Emergency Service Regulations.\n\nA briefing was also given on the provision of modern equipment for Capital Emergency Services, including water rescue vans, advanced tools, and the purchase of rescue vehicles.\n\nThe CDA chairman directed that all available resources be utilised to equip Capital Emergency Services with modern facilities leaving no stone unturned to ensure that citizens receive the best possible services.\n\nMeanwhile, the board also approved hiring a consultant to pursue carbon credit acquisition for projects in Islamabad. The press release said that during the meeting, CDA chief said that primary objective of this initiative is to promote environmentally friendly development projects and reduce carbon emissions in Islamabad.\n\n“The consultant’s services will help CDA obtain carbon credits in line with international standards, thereby promoting environmental protection,” read the press release.\n\nQuoting the CDA chairman, the press release said that acquiring carbon credits will internationally recognise CDA’s efforts in forest conservation, afforestation, reducing air pollution and sustainable development projects.\n\nThe meeting was informed that practical steps in accordance with international conventions for carbon credit acquisition will be taken soon after the appointment of the consultant.\n\nThe board also approved amendments to the committee formed for hiring an evaluator firm to assess land and properties in Islamabad. The committee will include officers from the Finance, Estate, Planning Wing, Building Control and Engineering wings with the Member Finance serving as its head.\n\nThe board also discussed hiring of consultants for reviewing the detailed design, professional technical services and comprehensive planning of the first phase of the Jinnah Medical Complex and Research Centre, Islamabad.\n\nIt was decided that, after international tendering, the lowest bidders would be recommended for consultancy services in accordance with PPRA rules and these recommendations would be presented to the Steering Committee for approval.\n\nThe board further decided to allocate land to Aga Khan University as per the Islamabad Land Disposal Regulations for the establishment of a teaching hospital in Islamabad.\n\nSwift Water Rescue Training Program\n\nMember Finance CDA Tahir Naeem inaugurated a three-day Swift Water Rescue Training Programme organised in collaboration with a team of International Chinese experts from Blue Sky Rescue International. The event was attended by senior officers and staff from Emergency and Disaster Management, Fire Brigade and Rescue 1122.\n\nThe Swift Water Rescue Training Programme featured a seven-member team of Chinese experts, led by Commander Zhong Yang of the Blue Sky Rescue Team, imparting training to enhance the rescue operational capabilities of local personnel.\n\nThe three-day training session, from August 27 to 29, will focus specifically on rapid response techniques in light of the monsoon season and potential urban flooding and emergency like situations.\n\nPublished in Dawn, August 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:55:15.740Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937753/cda-plans-to-bring-improvement-in-emergency-services",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T00:02:03.000Z"
}
