{
  "title": "PM Shehbaz, President Putin share desire to bolster Pak-Russia bilateral cooperation - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif and Russian President Vladimir Putin on Tuesday agreed to further enhance the bilateral ties and cooperation between their countries in diverse fields.\n\nIn recent years, Russia and Pakistan have engaged in strengthening bilateral ties with each other. In July, Russia’s Deputy Prime Minister Alexei Overchuk said Islamabad and Moscow were “natural allies”. On June 3, Russian Foreign Minister Sergey Lavrov, in a meeting with PM’s aide Syed Tariq Fatemi, reaffirmed Russia’s desire to expand cooperation with Pakistan, following a memorandum of understanding (MoU) signed last September on multi-sector collaboration.\n\nThe meeting between the two leaders took place in Beijing today amid their visit to China for the Shanghai Cooperation Organisation (SCO) Council of Heads of States (CHS) summit a day ago.\n\nAddressing the Russian president, PM Shehbaz said: “Relations between the two countries have improved in recent years due to your personal commitment and interest.”\n\nHe expressed the resolve that Pakistan was also keen to strengthen the bilateral relations further, adding that they were moving in the right direction.\n\nThe premier added that after their meeting in Astana last year, both countries witnessed a flurry of delegation visits at the higher level, adding they also signed protocols to promote the agriculture, iron, steel, energy and transport sectors.\n\nThe prime minister also underlined the significance of the trade corridor connecting Belarus, Russia, Kazakhstan, Uzbekistan, Afghanistan and Pakistan, noting that this initiative would boost regional connectivity and prosperity.\n\nExpressing his satisfaction, he said both sides were keenly committed to building their relations.\n\nThe prime minister also expressed gratitude to the Russian president for supporting Pakistan, which was viewed as “a balancing act in the region”.\n\nHe said Pakistan respected Russia’s ties with India and wanted to establish very strong relations of its own, which would be “supplementary and complementary”.\n\nPM Shehbaz expressed that these beneficial ties would add to the progress and prosperity of the region and assured President Putin of working closely in this context, as he had found him to be a “dynamic leader”.\n\nResponding to Putin’s invitation to attend the SCO Heads of Government Summit in November, the premier replied that he was looking forward to it.\n\nMeanwhile, President Putin said, “Pakistan has always been a traditional partner and remains as such in Asia, and we cherish these ties,” adding that both sides had agreed to intensify their bilateral relations.\n\nThe president noted that their bilateral trade needed to be enhanced and stressed taking steps to address the issue.\n\nHe also expressed his grief and extended his condolences to the people and the government of Pakistan on the losses suffered from catastrophes and natural disasters, including the recent flooding.\n\nPresident Putin expressed optimism that Pakistan would overcome such challenges under the current leadership.\n\nHe also opined that the two countries kept cooperating at the inter-parliamentary levels, adding, “Pakistan is a non-permanent member of the United Nations Security Council and both countries are keeping contacts within the framework of the United Nations, which is an important platform.”\n\nPrior to their meeting, the prime minister appreciated Putin’s leadership for making sincere efforts to promote bilateral relations with Pakistan.\n\nHe observed that after their meeting in Astana during last year’s SCO-CHS summit, they had agreed to work closely to bolster the bilateral cooperation.\n\nPM Shehbaz expressed confidence that together, both countries would make further efforts to promote bilateral ties and cooperation, particularly in commerce and trade.\n\nHe added that Pakistan-Russia bilateral trade witnessed a spike as Islamabad imported oil from Moscow last year that led to an increase in the trade volume.\n\nSeparately, PM Shehbaz met Tajikistan’s president and both leaders expressed their satisfaction with the ongoing cooperation between their countries in all areas of mutual interest.\n\nThe two leaders agreed to enhance collaboration in diverse fields, including trade and investment, connectivity, energy, regional security, culture, and people-to-people exchanges.\n\nBoth also reaffirmed their commitment to further strengthening bilateral relations rooted in shared cultural, historical, and religious ties.\n\nThey further shared perspectives on regional and global issues of common concern.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/021740415a69989.webp",
  "retrievedAt": "2025-10-12T03:54:58.528Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939178/pm-shehbaz-president-putin-share-desire-to-bolster-pak-russia-bilateral-cooperation",
  "dateList": "2025-08-28",
  "date_published": "2025-09-02T12:42:35.000Z"
}
