{
  "title": "What do ‘medium’ and ‘exceptionally high’ floods really mean? - Pakistan - DAWN.COM",
  "author": null,
  "content": "When officials warn of a “medium”, “high”, “very high” or “exceptionally high” flood, what does that actually mean?\n\nOver the past week, as Punjab’s rivers have swollen, these technical terms have dominated official updates. Behind these terms lies a simple story about water, river capacity and the limits of infrastructure.\n\nFlood levels are measured in cusecs — short for “cubic feet per second“.\n\nOne cusec equals the flow of one cubic foot of water every second, or about 28 litres.\n\nPut simply, a flow of 100,000 cusecs means nearly 2,830,000 litres of water rushing past in just one second. On Wednesday, the Ravi at Jassar was recorded at 229,000 cusecs at one point — enough to overwhelm the river’s safe capacity.\n\nHowever, flood intensity is not judged by one number alone. It depends on the size of each river and how much water it can normally carry. Smaller rivers such as the Ravi and Sutlej reach critical levels quickly — 200,000 cusecs here is already “very high flood”.\n\nLarger rivers such as the Chenab or the Indus can hold far more. At Head Marala, the Chenab swelled to over 750,000 cusecs this week and was declared in “very high flood”. By contrast, the Indus at Chashma carried 284,000 cusecs but remained below flood level, thanks to its massive capacity.\n\nOfficials use categories to describe the severity of flooding:\n\nHeadworks and barrages are built across rivers to regulate flow, divert water into canals and maintain levels for irrigation. Each has a design limit for maximum water passage.\n\nIf inflows exceed those limits, all gates are opened — but if pressure still builds, authorities may deliberately cut embankments or canals to protect the structure, even if that means sacrificing farmland or nearby villages.\n\nHeader image: Commuters wade past the water in the flooded area of Narowal, a town of Punjab, on August 27, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/280918400821e2c.webp",
  "retrievedAt": "2025-09-06T09:50:24.093Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937820/what-do-medium-and-exceptionally-high-floods-really-mean",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T02:40:18.000Z"
}
