{
  "title": "Trump moves to limit US stays of students, journalists - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump’s administration moved on Thursday to impose stricter limits on how long foreign students and journalists can stay in the United States, the latest bid to tighten legal immigration in the country.\n\nUnder a proposed change, foreigners would not be allowed to stay for more than four years on student visas in the US.\n\nForeign journalists would be limited to stays of just 240 days, although they could apply to extend by additional 240-day periods — except for Chinese journalists who would get just 90 days.\n\nThe US, until now, has generally issued visas for the duration of a student’s educational programme or a journalist’s assignment, although no non-immigrant visas are valid for more than 10 years.\n\nThe proposed changes were published in the Federal Register, initiating a short period for public comment before they can go into effect.\n\nTrump’s Department of Homeland Security alleged that an unspecified number of foreigners were indefinitely extending their studies so they could remain in the country as “‘forever’ students.”\n\n“For too long, past administrations have allowed foreign students and other visa holders to remain in the US virtually indefinitely, posing safety risks, costing untold amount of taxpayer dollars and disadvantaging US citizens,” the department said in a press statement Wednesday.\n\nThe department did not explain how US citizens and taxpayers were hurt by international students, who according to Commerce Department statistics contributed more than $50 billion to the US economy in 2023.\n\nThe United States welcomed more than 1.1 million international students in the 2023-24 academic year, more than any other country, providing a crucial source of revenue as foreigners generally pay full tuition.\n\nA group representing leaders of US colleges and universities denounced the latest move as a needless bureaucratic hurdle that intrudes on academic decision-making and could further deter potential students who would otherwise contribute to research and job creation.\n\n“This proposed rule sends a message to talented individuals from around the world that their contributions are not valued in the United States,” said Miriam Feldblum, president and CEO of the Presidents’ Alliance on Higher Education and Immigration.\n\n“This is not only detrimental to international students — it also weakens the ability of US colleges and universities to attract top talent, diminishing our global competitiveness.”\n\nThe announcement came as universities were starting their academic years with many reporting lower enrollments of international students after earlier actions by the Trump administration.\n\nBut Trump also heard rare criticism within his base when he mused Monday that he would like to double the number of Chinese students in the United States to 600,000 as he hailed warm relations with counterpart Xi Jinping.\n\nHis remarks marked a sharp departure from Secretary of State Marco Rubio’s earlier vow to “aggressively” rescind visas of Chinese students.\n\nThe State Department said last week it had overall revoked 6,000 student visas since Trump took office, in part due to Rubio’s targeting of campus activists who led demonstrations against Israel.\n\nTrump has also suspended billions of dollars in federal research funds to universities, with his administration contending they have not acted against antisemitism, and Congress has sharply raised taxes on private universities’ endowments.\n\nIn a speech before he was elected, Vice President JD Vance said conservatives must attack universities, which he described as “the enemy.”\n\nTrump, at the end of his first term, had proposed curbing the duration of journalist visas, but his successor Joe Biden scrapped the idea.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/28115550f586d10.webp",
  "retrievedAt": "2025-09-06T09:50:21.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937854/trump-moves-to-limit-us-stays-of-students-journalists",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T06:56:37.000Z"
}
