{
  "title": "Iran vows response to ‘unjustified and illegal’ sanctions snapback by European powers - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Foreign Minister Abbas Araghchi said on Thursday that Tehran would respond to a decision by France, Britain and Germany to trigger a mechanism reimposing UN sanctions under a moribund 2015 nuclear deal.\n\n“The Islamic Republic of Iran will respond appropriately to this illegal and unjustified action by the three European countries, in order to protect and guarantee its national rights and interests,” Araghchi told his French, British and German counterparts in a phone call, according to a statement from his ministry.\n\nHe called on the three countries to “appropriately correct this wrong decision in the coming days”.\n\nWhile Araghchi did not specify what retaliatory measures Iran might take, Tehran has previously warned that such a move could lead to the exclusion of the European powers from any future negotiations on Iran’s nuclear programme.\n\nIn a statement, the Iranian foreign ministry said: “This decision by the three European countries will seriously undermine the ongoing process of interaction and cooperation between Iran and the International Atomic Energy Agency (IAEA),” the foreign ministry said in a statement, calling the move a “provocative and unnecessary escalation”.\n\nThe move by the European trio — known as the E3 — took place just days after Iranian and European diplomats held talks in Geneva, the second since Israel’s attack on Iran that started a 12-day war in June.\n\nThe E3 had been threatening in recent weeks to activate the so-called “snapback” mechanism, citing Iran’s continued non-compliance with its commitments under the 2015 nuclear agreement.\n\nThe three powers launched a 30-day process to reimpose sanctions, fearing they would otherwise lose the prerogative in mid-October to restore them.\n\nFrench Foreign Minister Jean-Noel Barrot said the decision did not signal the end of diplomacy, while his German counterpart, Johann Wadephul, urged Iran to now fully cooperate with the UN nuclear watchdog agency and commit to direct talks with the United States over the next month.\n\nThat deal was torpedoed in 2018 when Donald Trump, during his first term as president, unilaterally withdrew the United States and slapped crippling sanctions on Iran.\n\nTehran and Washington had begun nuclear talks in April with the aim of reaching another deal, but these negotiations were derailed by the war with Israel, during which the United States also struck Iranian nuclear sites.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:50:18.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937957/iran-vows-response-to-unjustified-and-illegal-sanctions-snapback-by-european-powers",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T18:20:55.000Z"
}
