{
  "title": "Pulwama: India’s claim of finding ‘money trail’ falls flat on its face",
  "link": "https://www.app.com.pk/national/pulwama-indias-claim-of-finding-money-trail-falls-flat-on-its-face/",
  "date_published": "2020-09-01T10:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 01 (APP): India’s baseless propaganda against Pakistan has once again been exposed as its claim of finding trail of money allegedly used by main accused in Pulwama attack case has fallen flat on its face.\nOn August 28, India claimed to find a trail of Rs 1.043 million allegedly used for terror-financing in Pulwama incident, saying that two accounts of Pulwama attack accused Muhammad Umer Farooq were allegedly being maintained in Peshawar and Khyber Agency banks. India’s National Investigation Agency had claimed that the money used for terrorism was credited into these accounts.\nTwo cheques of Umer Farooq were also shown on Indian media, one each from Meezan Bank and Allied Bank. In another Indian media report, the alleged CNIC of Umer Farooq was also displayed.\nOn receipt of information, the authorities concerned in Pakistan immediately sought information from banks about the alleged accounts, including the CNIC of account holders, account statements and other relevant details.\nIndia failed to provide any credible evidence for its invective and has instead been using the attack for its malicious propaganda campaign against Pakistan\nRegarding the Meezan Bank account, it was said that one Umer Farooq opened individual Rupee current account in Peshawar on January 18, 2017 for spare parts business.\nMajority of online receipts are from Quetta, Rawalpindi and Islamabad. Moreover, at the time of account opening, the biometric verification was carried out, which is mandatory for any account opening in Pakistan.\nRegarding Allied Bank account, it was claimed that a personal account was opened by one Umer Farooq on March 31, 2018 in Khyber Agency for scrap business. Majority of credits into the account came through online cash deposit.\nCash withdrawals were done from where the bank is located as well as through ATM. At the time of account opening, biometric verification of the account holder was also carried out.\nIt is pertinent to mention here that the CNIC shown by Indian media is different than that held with above-mentioned banks against the said accounts. During the investigation, difference in complete name, CNIC number, father’s name as well as date of birth came to surface.\nThe NDTV declared Umer Farooq as dead while a representative of Allied Bank talked to the account holder on phone during the investigation process. India has claimed that Umer Farooq entered Jammu in April 2018, whereas the cheque image of Meezan Bank is of August 2018. The bank confirmed that Umer Farooq is available at his place in Peshawar since a bank representative visited him and a certified visit report in this regard was also provided by the bank.\nThe Foreign Office in Islamabad has already rejected the charge sheet filed by India’s National Investigation Agency (NIA) in the Pulwama attack case, stating that the fabrications in the report are designed to further the Bharatiya Janata Party’s (BJP) anti-Pakistan rhetoric and its narrow domestic political interests.\nIn a statement last week, Foreign Office spokesperson Zahid Chaudhri had said that Islamabad categorically rejected the so-called charge sheet by the NIA which mischievously attempted to implicate Pakistan in the Pulwama attack.\n“India failed to provide any credible evidence for its invective and has instead been using the attack for its malicious propaganda campaign against Pakistan,” he had said.",
  "retrievedAt": "2025-08-11T19:45:15.005Z"
}
