{
  "title": "PM for early completion of Lahore’s Ravi Riverfront project on int’l construction standards",
  "link": "https://www.app.com.pk/national/pm-for-early-completion-of-lahores-ravi-riverfront-project-on-intl-construction-standards/",
  "date_published": "2020-09-01T16:37:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 01 (APP): Prime Minister Imran Khan on Tuesday terming Ravi Riverfront Urban Development Project a “masterpiece for the residents of Lahore and overseas Pakistanis” called for its early completion ensuring international standards of construction.\nChairing a review meeting on progress of the said project in Lahore, the prime minister directed to keep in view the aspects including environmental protection, permanent solution of water scarcity and water pollution while carrying out construction work.\nThe prime minister expressed satisfaction that construction sector in the country had witnessed growth and encouraging trend following the incentives offered by the government.\nHe also lauded the interest shown by foreign investment companies in Ravi Riverfront project, which he said would prove to be a landmark construction site equipped with modern amenities.\nThe prime minister issued directive to monitor the project on daily basis and remove administrative impediments in way of its smooth implementation.\nHe also asked the concerned authorities to keep him updated about the progress of the project.\nThe meeting was attended by Chief Minister Punjab Sardar Usman Buzdar, Adviser to PM Barrister Shahzad Akbar, Special Assistant Syed Zulfikar Abbas Bukhari, Provincial Minister Fayyaz ul Hassan Chauhan, Chairman Naya Pakistan Housing Authority Lt Gen (retd) Anwar Ali Haider, Chairman Ravi River Front Urban Development Project Rashid Aziz and senior government officials.\nEarlier, the Chairman Ravi Riverfront Urban Development gave a detailed briefing on project timelines and apprised the meeting about the interest of foreign investment companies in the project, infrastructure regulations and other administrative matters.",
  "retrievedAt": "2025-08-11T19:45:14.311Z"
}
