{
  "title": "Sino-Pak agrees for JVs in value added agriculture,other sector’s: Razak Dawood",
  "link": "https://www.app.com.pk/national/sino-pak-agrees-for-jvs-in-value-added-agricultureother-sectors-razak-dawood/",
  "date_published": "2020-07-05T01:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP):The Advisor to the Prime Minister on Commerce and Investment, Abdul Razak Dawood said on Sunday that China and Pakistan have agreed on some proposals for Joint Ventures between Chinese and Pakistani companies, particularly in the value added agriculture sector.\nThe Joint Venture with Chinese would benefit Pakistan because of its export potential not only in China but elsewhere as well, the advisor Razak Dawood told APP here.\nReplying to a question, he said that Pakistan’s exports increased in value terms by 2.2 percent in the first seven months in the July-Jan period, of this fiscal year.\nThe advisor said that Joint Ventures with the Chinese companies would allow Pakistan to have improved technology and enhanced capacity for production and exports.\nHe said that both sides were reviewing the plans to enhance bilateral trade and investment for future Sino-Pak economic and trade connectivity.\nRazak Dawood said that China was moving fast on some of the construction projects in Pakistan, which would create a number of jobs for the local population.\nThe opportunities and ongoing projects of the China Pakistan Economic Corridor (CPEC) were also discussed in a recent meeting with the top leadership of both sides.\nThe Advisor Commerce emphasized the need to start industrial activity through development of Special Economic Zones(SEZs).\nThe meat and poultry exports of Pakistan have risen by more than 50% in the fiscal year 2019-20, with market accessibility to China and different potential markets of the world.\nAbdul Razak underscored that the exports of Pakistan were beginning to gain momentum after a slow down caused by COVID-19 outbreak and subsequent lockdowns.\nNow China and Pakistan need to sit together again and discuss issues related to bilateral trade with efforts to further diversify the products being exported from Pakistan, with a specific focus on value-addition, under the China Pakistan Free Trade Agreement(FTA) Phase II, he added.\nReplying to another question on recent trade connectivity China through the Khunjerab border,Razak Dawood said that “We had discussed the opening of Khunjerab border as well as strategies to exploit bilateral trade and investment opportunities in the wake of the Corona pandemic.\nHe said that around 186 containers were stuck at the Khunjerab border which is a cause of great concern especially among small businesses.\nThe advisor said that temporary opening of the border was under consideration in order to clear the backlog of containers.\nBoth sides agreed to finalize the modalities in this regard to resolve the issue on priority.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:27:12.460Z"
}
