{
  "title": "129,830 COVID-19 patients recovered so far: NCOC",
  "link": "https://www.app.com.pk/national/129830-covid-19-patients-recovered-so-far-ncoc/",
  "date_published": "2020-07-05T02:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP):National Command and Operation Centre (NCOC) on Sunday said that 129,830 patients recovered from Corona so far while 25,527 tests were conducted in last 24 hours.\nIt said that 3,191 new cases reported across Pakistan and 93 people died during last 24 hours taking the total death rate to 4,712. It said 467 people are on ventilators.\nThe data released by the NCOC said that since 26 February, 228,474 COVID-19 positive cases were detected across till date. 129,830 COVID-19 positive people recovered across Pakistan.\nIt said that total active COVIED-19 cases in Pakistan at the moment is 93,932 with 3,191 new positive COVID cases detected on July 4 and 93 people lost lives due to due to the pandemic during last 24 hours.\nThough Implementation on the smart lockdown in the country has significantly reduced the number of deaths due to novel coronavirus (COVID-19) in the country, however again 3,191 cases were tested positive.\nAccording to the National Command and Operation Centre (NCOC) only 93 people lost their lives in the country due to COVID-19 in the previous 24 hours.\nIt said that 129,830 people recovered so far across Pakistan making it a significant count and 467 ventilators are occupied across Pakistan out of 1,525 ventilators allocated for COVID-19.\nIt said that total active Covid cases in Pakistan are 93,932 ). A total of 228,474 cases detected so far (AJK 1288, Balochistan 10766, GB 1545, ICT 13409, KP 27843, Punjab 81317 and Sindh 92306).\nAbout the deaths the official data said that 4712 have died including 1501 from Sindh , Punjab 1871, KP 1020, ICT 134, Balochistan 123, GB 28 and AJK 35. So far 1,398,352 tests have been conducted and 792 hospitals with covid facilities with 5,130 patients admitted across the country.",
  "retrievedAt": "2025-08-11T19:27:04.065Z"
}
