{
  "title": "192 martyred, 1326 injured by Indian troops during 11-month siege",
  "link": "https://www.app.com.pk/national/192-martyred-1326-injured-by-indian-troops-during-11-month-siege/",
  "date_published": "2020-07-05T02:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 5 (APP):In Indian occupied Kashmir, unrelenting military siege and crippling lockdown imposed by the fascist Modi government of India on August 5, last year, have completed 11 months, today.\nA report released by the Research Section of Kashmir Media Service, today, said, the life of Kashmiris has been made a miserable by the Indian authorities since New Delhi illegally abrogated Article 370 of its constitution on August 5, 2019, to revoke the special status of Jammu and Kashmir.\nThe move, it added, was aimed at snatching away the identity of the Kashmiris through changing the Muslim-majority status of the occupied territory into a minority.\nThe report revealed that Indian troops had martyred 192 Kashmiris including 4 women during the period. It said that at least 1326 people were critically injured due to the use of brute force including firing of bullets, pellets and teargas shells by Indian military, paramilitary and police personnel on peaceful demonstrators and mourners in the territory.\nThe report said that these killings rendered 9 women widowed and 22 children orphaned. “The troops damaged over 935 houses and structures and molested or disgraced 77 women during cordon and search operations across the occupied territory in the period.\nWhile the entire occupied Kashmir has been turned into an open-air prison, thousands of Hurriyat leaders, political and human rights activists, religious heads, journalists, businessmen, lawyers and civil society members including Muhammad Yasin Malik, Shabbir Ahmad Shah, Masarrat Aalam Butt, Syeda Aasiya Andrabi, Nahida Nasreen, Fahmida Sofi, Mian Abdul Qayoom, Nayeem Ahmad Khan, Mohammad Aiyaz Akbar, Altaf Ahmad Shah, Peer Saifullah, Mehrajudin Kalwal, Farooq Ahmad Dar, Dr Abdul Hameed Fayaz, Maulana Mushtaq Veeri,Abdul Samad Inqilabi, Abdul Ahad Parra, Muhammad Yosuf Mir, Muhammad Rafiq Gania, Feroz Ahmad Khan, Dr Qasim Fakhtoo, Muhammad Ahsan Untoo, Zahoor Watali, Syed Shahid Yousuf Shah, Syed Shakeel Yousuf Shah, Maulana Sarjan Barkati, Bashir Ahmad Querishi, Hayat Ahmad and Asif Sultan, who were arrested after or before 5 August 2019, continue to remain in Tihar and other jails of India and occupied Kashmir.\nWhile senior Hurriyet leaders Syed Ali Gilani and Mirwaiz Umar Farooq continue to remain under house detention in Srinagar.\nIn violation of the international guidelines, the continued ban on high-speed internet has deprived Kashmiris of useful local and world information regarding education, business, and coronavirus, the report said. India had suspended the internet 4G services in occupied Kashmir on August 05, 2019.\nThe report said, Indian troops are committing grave human rights violations in the occupied territory to suppress the Kashmiris’ ongoing struggle for securing their inalienable right to self-determination. Indian military siege has created a sense of fear and terror among the inhabitants of the territory, it said.\nThe report said that the crippling military siege coupled with coronavirus lockdown had multiplied the sufferings of the Kashmiris as Indian troops had intensified their brutalities. The double lockdown has destroyed the economy of occupied Kashmir to the tune of billions of rupees.\nThe report pointed out that India is carrying out genocide of the Kashmiri youth particularly, after August 05, last year, and destruction of houses and harassment of residents is the new norm in occupied Kashmir. “Modi regime is engaged in changing the Muslim majority status of occupied Kashmir. For this purpose, it has granted domicile certificates to over 400,000 Indians,” it added.\nThe report deplored that press freedom is under a constant threat in occupied Kashmir where journalists are detained and harassed. It said that in modern age, internet had become an inseparable part of life but the Kashmiris had been living without this basic facility that too during the coronavirus pandemic when it was needed the most to get health guidelines. “Cruel military lockdown has pushed occupied Kashmir into the stone age. Communications blockade has made the Kashmiris’ lives miserable,” it added.\nThe report, however, maintained that the worst siege of the last 11 months had failed to subdue the freedom sentiment of the Kashmiri people and they are determined to keep fighting for their rights, including the right to self-determination. It said that New Delhi must realize the fact that it would not be able to silence the Kashmiris and must listen to voices seeking lifting of siege in occupied Kashmir.\nThe report urged the world community to take cognizance of India’s brutal actions in the occupied territory and force it to resolve the Kashmir dispute in accordance with the Kashmiris’ aspirations and the relevant UN resolutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:27:05.851Z"
}
