{
  "title": "Pakistan’s exports to Japan jumps by 40 percent during January to March",
  "link": "https://www.app.com.pk/national/pakistans-exports-to-japan-jumps-by-40-percent-during-january-to-march/",
  "date_published": "2021-05-02T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP): Pakistan’s exports to Japan have jumped by 40% in the first quarter (Jan – Mar) during the current year as compared with the last quarter of 2020 i.e. (Oct – Dec).\nAccording to trade figures released by Japan’s Ministry of Finance, the increase is more than 47% when compared to the same period last year i.e. Jan – Mar 2020, Pakistan embassy in Japan said in a press release on Sunday.\nThis trend highlights that Pakistan is coming out of the challenges to international trade posed by the current pandemic.\nCovid related limitations had brought a slight negative impact on trade between Pakistan and Japan towards the end of last year; however, Pakistan’s exports to Japan bounced back in high numbers.\nAs compared to exports of US$ 61.6 million in the last quarter of 2020, Pakistan has exported goods worth of US$ 86.1 million to Japan from January to March 2021, whereas exports in the same quarter last year stood at US$ 58.7 million.\nThis multiplying trend observed in bilateral trade is mainly associated with focused efforts of the mission to diversify the export mix of Pakistan for Japan.\nPakistani Mission in Tokyo, through its Trade and Investment Wing, devised an export diversification strategy ‘Option Pakistan’ last year with a focused layout plan – reaching out to all major business chambers and trade associations in Japan, introducing a range of Pakistani exportable products.\nAmbassador Imtiaz Ahmad along Trade and Investment Consular Tahir Cheema held meetings with local government trade departments, regional JETROs and Chambers of Business in Osaka, Kobe, Kyoto, Nara, Sendai, Aomori and other important business hubs.\nThis high-level interaction with the Japanese business community resulted in raising the confidence of Japanese importers in Pakistani goods.\nAugmenting these efforts, the Mission through its Trade Consular Mr Cheema participated in almost all major trade fairs and exhibitions held in and around Tokyo since resumption of such events since September last year in a hybrid mode as international exporters are unable to enter Japan to display their goods for such promotional activities.\nThe strategy not only resulted in spreading information about Pakistan and its trade potential but also helped in providing Japanese companies with an attractive source of procurement for their businesses that are facing serious issues of depleting stocks due to travel restrictions.\nIn the recent months, seafood products, petroleum, dry fruits, spices and minerals have contributed to Pakistan’s rising exports to Japan; whereas, a considerable increase has been noticed in export of woven fabric, knitted garments, honey, sports goods, cutlery, socks, gloves, gems & jewelry and dates.\nTrade Development Authority of Pakistan (TDAP) is also partnering with the Mission to increase presence of Pakistani companies and products in the upcoming events to be held in Japan as the pandemic prolongs, adding to the challenges of manufacturers and exporters. This support will come in the form of enhanced subsidy by TDAP for priority sectors.\nIn the coming months, TDAP, JETRO and Pakistan’s Trade Mission at the Embassy will further strengthen plans to increase Pak-Japan trade.",
  "retrievedAt": "2025-08-11T20:41:22.514Z"
}
