{
  "title": "Prudent policies adopted to control corona: Farrukh Habib",
  "link": "https://www.app.com.pk/national/prudent-policies-adopted-to-control-corona-farrukh-habib/",
  "date_published": "2021-05-02T11:35:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, May 02 (APP):State Minister for Information and Broadcasting Farrukh Habib said on Sunday that COVID-19 had not only emerged as a grave threat to human health but it had also shattered the world economy badly.\nHowever, he added, the Pakistan Tehreek-e-Insaf (PTI) government had adopted prudent policies to control it through sincere efforts and smart lockdown.\nTalking to the media after his visit to a vaccination centre at Samanabad here, he expressed his satisfaction over the arrangements made for vaccination of elderly people. He said that now registration of people above 40 years had also been started.\nHe said that 17 vaccination centres were already working in Faisalabad.\nHowever, in view of expected rush at these centres, five new centres would also be established in the city.\nAfter that, daily 20,000 vaccine shots would be dispensed, he added. The state minister for information said that the government had sufficient stock of vaccine, and 25 million dozes would be available till next May-June.\nHe appreciated the National Command Operation Centre (NCOC) for properly handling the pandemic and enhancing the capacity of corona-related facilities. He said the country had the capacity of conducting only 400 corona tests daily when the pandemic broke out. But then the capacity was enhanced and now we are conducting 50,000 corona tests daily, he added.\nPakistan has also started producing persobal protective equipment (PPEs) and highly technical ventilators for corona patients, Farrukh said and called upon people to observe the standard operating procedures (SOPs) to keep themselves safe from the deadly disease.\nHe said that particularly during the Eid holidays, people must act on the SOPs to keep themselves safe. He appreciated the vision of Prime Minister Imran Khan and said that he introduced most practicable strategy of smart lockdown, which played a key role in saving people from corona and helping the industry to keep its wheel going after adoption of proper SOPs.\nRegarding e-voting, he said that a bill was introduced in the National Assembly in October 2020 and now it was pending before a standing committee and four amendments had so far been proposed to the draft law.\nNow it is the responsibility of the opposition to sit with the treasury benches and settle down the issue once and for all, he added.\nAbout Bashir Memon, he said that he had hatched a conspiracy to create a rift between the government and the judiciary. Now he had backed out from his earlier stand that Prime Minister Imran Khan told him anything about the Supreme Court judge. But he must face defamation cases which would end the chances of such conspiracies in future.\nHe said that it is an open secret that Bashir Memon was playing into the hands of the PML-N, but his conspiracy had been exposed now.\nHe said that being a true representative of people of Pakistan, the PTI government would continue to serve people with a commitment and zeal.\nEarlier, he also visited the vaccination centre and checked arrangements and facilities for the visitors.",
  "retrievedAt": "2025-08-11T20:41:19.066Z"
}
