{
  "title": "All Brick Kilns in Punjab Shifted to Eco-Friendly Technology",
  "link": "https://www.app.com.pk/national/all-brick-kilns-in-punjab-shifted-to-eco-friendly-technology/",
  "date_published": "2021-05-02T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP):In yet another milestone in the fight against air pollution and smog, the present government has converted all brick kilns in Punjab to zig-zag technology.\nDue to Prime Minister Imran Khan’s personal attention and encouragement, the country is making some major and important strides to deal with the bigger issue of climate change.\nThese efforts focusing on clean energy and nature based solutions were also being applauded at the international level, said a press release issued here on Sunday.\nWhilst no attention was paid to it in the past, the government achieved the target of converting all the 7896 brick kilns in Punjab to the eco friendly technology in a record period of just six months, proving true the maxim that when there is a will there is also a way.\nMinister of State for Climate Change Zartaj Gul and Special Assistant to Prime Minister (SAPM) on Climate Change Amin Aslam are at the forefront to turn the vision of Clean and Green Pakistan into a reality, which indeed will go a long way in cutting down emissions and deal with the issue of global warming.\nIn a video message, Amin Aslam said Lahore faced serious issue of smog and the best tool to tackle it was to shift the brick kilns to the zig-zag technology.\nExpressing his pleasure over the conversion of the brick kilns in Punjab to zig-zag technology, he said this would help reduce emissions by sixty percent whilst also reduce the operation cost of brick kilns by thirty percent. He also appealed the other provinces to introduce the zig-zag technology in their areas to fight the issue of smog.\nPakistan is ranked amongst the countries most vulnerable to the climate change. The major concerns include increased variability of monsoons, the likely impact of receding Himalayan glaciers on the Indus River system, decreased capacity of water reservoirs, and extreme events including floods and droughts.\nTo cope with the serious challenge, the present government has undertaken a series of initiatives including that of the ten billion tree tsunami project under which the target of planting one billion trees is reportedly to be achieved by end of next month. Other initiatives include shifting towards electric vehicles and renewable energy.",
  "retrievedAt": "2025-08-11T20:41:13.619Z"
}
