{
  "title": "Ordinance to be presented before federal cabinet for informal labourers inclusion in EOBI pension net : Zulfi Bukhari",
  "link": "https://www.app.com.pk/national/ordinance-to-be-presented-before-federal-cabinet-for-informal-labourers-inclusion-in-eobi-pension-net-zulfi-bukhari/",
  "date_published": "2021-05-02T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 02 (APP):Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (OPHRD) Sayed Zulfikar Abbas Bukhari on Sunday said that effort were afoot to amend the Employees Old-Age Benefits Institution’s (EOBI) laws for for inclusion of the informal workers in its pension net.\nThe OPHRD ministry would present an ordinance before the federal cabinet in the coming days to bring majority of the country’s informal employment under the government’s pension scheme, the SAPM told an online session hosted by the Corporate Pakistan Group (CPG) and Nutshell Group on social networking sites such as FaceBook and Twitter.\nHe said the ordinance, once approved, would also enable the overseas Pakistani workers to become registered pensioners through submission of self-contributions to the EOBI.\nZulfikar Bukhari told the forum that revenue generation of the EOBI had surged significantly as its structural flaws were rectified completely during the two and half year tenure of the present government.\n“When our government took over, the monthly pension amount was stood at Rs 5,250; within about 18 months, we took that up to Rs 8,500, with a 62 per cent increase ,” he maintained.\nThe SAPM said his goal was to bring the monthly pension of EOBI pensioners at par with minimum wage by improving the organization’s assets that had been dormant for the past 15 years and worth trillions of rupees.\nHighlighting the present government’s pro-expatriates initiatives, he said before the Pakistan Tehreek-e-Insaf government came into the power, only blue-collar workers were considered under the OPHRD ministry domain.\nNow it had been changed as all overseas Pakistanis including the citizens of second and third generations of Pakistani origin families were taken care of by the ministry, he added.\nHe said prior to the coronavirus pandemic, the OPHRD ministry set a record by sending around a million people abroad for the various job assignments. “It is a record in itself if we analyze the data from the last 20 years in comparison, and this is happened due to the good-will of Prime Minister Imran Khan and his relationship with other countries.”\nHe pointed out that problems of overseas Pakistanis were being resolved on fast-track basis as lands worth billions of rupees had been handed over to them after retrieving it from ‘land mafia’.\nHe also mentioned his ministry’s efforts for ensuring full-fledged participation of the Pakistani expatriates in the electoral process.\nReferring to success of the Roshan Digital Account, he said the ultimate aim was to transform it into a digital challenger bank by adding more incentives for the overseas Pakistanis. Several incentives for the expats were on the cards to boost remittances by curbing the Huwala and Hundi.\nTo a query, he said the government was now imparting only trainings in demand-driven trades instead of traditional ones. An agreement with Japan had been signed to export Pakistani manpower.\nAs regards tourism promotion, a National Tourism Coordination Board had been set up that took numerous steps including a 5-year action plan and 10-year tourism policy.\n“The plan is to have Integrated Tourism Zones in each province where all tourism related infrastructure and facilities are available. We have asked each province to make at least 10 ITZs in each province”.\nHe said in next 5 to 7 years, tourism sector of Pakistan would emerge as the biggest industry of the country. Public Private Partnership for tourism industry was being promoted to attract investments. Massive investments had already been coming into the sector, he added.\nHe mentioned that in the next two years, before the term of this government ends, he was expecting establishment of another 26 to 32 new big three to five stars hotels.\nHe said in September this year, to further promote tourism in country, a worldwide campaign ‘Brand Pakistan’ would be launched with a dedicated web portal that would have all the required information about tourism in Pakistan including a calendar of all the festival events.",
  "retrievedAt": "2025-08-11T20:41:16.055Z"
}
