{
  "title": "Next budget should focus development works, inflation control: PM",
  "link": "https://www.app.com.pk/national/next-budget-should-focus-development-works-inflation-control-pm/",
  "date_published": "2021-05-02T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP): Prime Minister Imran Khan Sunday instructed his economic team to give a special focus on the development projects and measures to control the inflation while formulating the upcoming annual budget.\nChairing a meeting to discuss the next annual budget and national economy, the prime minister said that besides ensuring the completion of ongoing development projects, new projects should also be designed in accordance with the public needs.\nNational Assembly Speaker Asad Qaiser, federal ministers Shah Mahmood Qureshi, Pervaiz Khattak, Shafqat Mahmood, Asad Umar and Fawad Chaudhry, KP Givernor Shah Farman, KP Chief Minister Mahmood Khan, provincial ministers Hashim Jawan Bakht, Taimur Saleem Jhagra, and relevant senior officers attended the meeting.\nThe prime minister also sought proposals from the senior party leadership regarding the next budget.\nhttp://https://youtu.be/6-_XfdCqVc8\nThe meeting also discussed in detail the national economy, strategy to control inflation, and development projects for the next fiscal year.\nThe participants were told that the next budget would be development-oriented with full attention towards improvement of growth ratio. By expediting the development work, new projects would be launched to enhance economic activities, GDP growth and revenue collection besides begetting jobs.\nThe meeting was told that the pandemic had impacted the economies globally; however the economic activity was going on in Pakistan owing to government’s prudent policies.\nIt was told that despite COVID-19 situation, revenue collection had been recorded at almost double before the current lockdown comparing April last year.\nMoreover, the prime minister was also briefed about the comprehensive strategy devised to control the inflation.",
  "retrievedAt": "2025-08-11T20:41:16.057Z"
}
