{
  "title": "PDM’s artificial alliance rejected by masses, Open ballot in Senate election to end horse trading: Defence Minister",
  "link": "https://www.app.com.pk/national/pdms-artificial-alliance-rejected-by-masses-open-ballot-in-senate-election-to-end-horse-trading-defence-minister/",
  "date_published": "2021-01-30T17:10:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 30 (APP): Defence Minister, Pervez Khattak on Saturday said that artificial alliance of Pakistan Democratic Movement (PDM) has been rejected by masses due to its negative and personal interest politics and will soon meet its logical end.\nHe was addressing a public meeting at Manki Sharif in Nowshera district where noted political worker Zainullah along with hunderds of supporters and friends joined Pakistan Tahreek-e-Insaf and expressed confidence in the leadership of Prime Minister Imran Khan and Defence Minister Pervez Khattak.\nDr Imran Khattak, Chairman National Assembly Committee for Energy and Natural Resources was also present on the occasion.\nThe Defence Minister said PDM artificial alliance had been formed by the rejected political parties to protect their corruption.\nHe said people knew that who had looted the country’s exchequer for personal gains in the past and who put Pakistan on road to progress and development today.\nHe said the country was plunged into heavy loans and gas, electricity prices went up due to wrong polices of PPP and PML-N regimes. He said the today’s price hike was due to wrong polices of the past regimes.\nHe said PDM leadership was in panic and this unnatural politico-religious alliance would soon meet its logical end.\nThe Defence Minister said when PTI Government took over, the country’s total reserve was only $ 5 billion and today it reached to about $20 billion because our prudent economic and pro exports policies.\nUnder the leadership of Prime Minister Imran Khan, he said the country’s exports has increased and industrial production was moving upward.\nHe said the government would complete its five years term and election would be held in 2023. He said Senate election through open ballot procedure would end horse trading.\nPervez Khattak said local governments at districts, tehsils and village councils would be setup and draft for amendment in LG Amended Act 2019 would soon be passed from the Assembly.\nHe said Nowshera district was a stronghold of PTI and all political parties if get united, even can not defeat it. He said every village and union council would get gas facilities by 2023 in Nowshera.",
  "retrievedAt": "2025-08-11T20:17:50.019Z"
}
