{
  "title": "Pakistan Navy gets newly built second T-054 frigate",
  "link": "https://www.app.com.pk/national/pakistan-navy-gets-newly-built-second-t-054-frigate/",
  "date_published": "2021-01-30T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP): Pakistan Navy on Saturday inducted newly built second T-054 ship in the national fleet during a launching ceremony of the second ship of Type-054 Class Frigate constructed for Pakistan Navy, held at Hudong Zhonghua Shipyard Shanghai, China.\nThe ceremony was graced by Chief Naval Overseer, China (CNO) Commodore Azfar Humayun as Chief Guest, said a Pakistan Navy press release received here.\nLaunching ceremony of 2nd Type-054 Class Frigate for #PakNavy held at Hudong Zhonghua Shipyard, China. Chief Guest, Cdre Azfar Humayun (Chief Naval Overseer) while addressing, highlighted that induction of  warship will enhance Pak maritime defence & detterence  capibilities(1/2) pic.twitter.com/LEDR4sQdNT\n— DGPR (Navy) (@dgprPaknavy) January 30, 2021\nWhile addressing the ceremony, CNO highlighted that induction of these warships would significantly enhance Pakistan’s maritime defence and deterrence capabilities.\nHe also acknowledged the commitment, hard work and timely completion of this important milestone project by China Shipbuilding Trading Company (CSTC) and HZ Shipyard, Shanghai despite ongoing global pandemic.\nType-054 Frigates will be one of the most technologically advanced surface platforms of Pakistan Navy Fleet, fitted with latest surface, subsurface and anti-air weapon systems.\nThe ships will be fitted with a range of electronic warfare, air and surface surveillance and acoustic sensors integrated through state of the art Combat Management System.\nPakistan Navy ordered four Type-054A/P Frigates in 2017 where all of the ships are being delivered as per planned schedule.\nThe occasion of launching ceremony also coincides with the completion of 70 years of Pak-China diplomatic relations built upon historic bonds of friendship and mutual trust.\nThe ceremony was also attended by various high level Chinese officials including representatives of China Shipbuilding Trading Company (CSTC) and HZ Shipyard.",
  "retrievedAt": "2025-08-11T20:17:53.391Z"
}
