{
  "title": "Indonesian embassy to establish ‘facilitation corner’ in Peshawar University: Envoy",
  "link": "https://www.app.com.pk/national/indonesian-embassy-to-establish-facilitation-corner-in-peshawar-university-envoy/",
  "date_published": "2022-04-05T15:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 5 (APP): Indonesian Ambassador to Pakistan, Adam Mulawarman Tugio Tuesday said his embassy would establish a ‘facilitation corner’ on the premises of the Peshawar University aimed at facilitating students and enhancing people-to-people contact.\nAddressing an online internship programme titled “Contemporary Dynamics of Indonesia,” he said the facility would also share Indonesia’s social, cultural, and economic information with students.\nHe expressed his gratitude to the faculty of Peshawar University for providing space for the establishment of the facilitation corner.\nThe Vice-Chancellor of the University and a large number of students attended the event.\nHe said the objective of the online internship program was to increase a better understanding of modern Indonesia through dialogues with experts or scholars of different studies on Indonesia.\nIt is expected to enhance the knowledge and awareness of the participants about the existing potential and opportunities for development in the two countries by sharing lessons from the past and modern eras.\nThe envoy said his country had provided 500 scholarships to Pakistani students to study at top Indonesian universities.\nHe said his government was looking to facilitate students to students exchange programs, and the University of Peshawar was a one-stop in this regard.\n“Pakistan and Indonesia are enjoying cordial ties and people-to-people contact will further enhance bilateral and brotherly relations between two countries,” he added.\nHe said Indonesia and Pakistan were blessed with rich cultural heritage and traditions carrying interesting and attractive similarities. Both the countries cherish various traditions and share many similarities from nature to culture and preserving (Islamic) tradition being two of the most populous Muslim countries in the world, embracing modernity.\nHe said his embassy was planning to arrange a “Museum program” during the current year to exhibit the strong Islamic and Buddhism civilization in Peshawar city.\nRenowned Indonesian scholar Abdul Ghaffar Karim informed the participants that Indonesia has 17000 islands and 273 million populations and is the fourth most populous country.\nHe said that the country had 87.2 percent Muslims including hundreds of ethnic groups and religious groups.",
  "retrievedAt": "2025-08-11T14:39:37.312Z"
}
