{
  "title": "September 6: a historic day of courage and bravery, when nation made Pakistan invincible: Mohsin Naqvi",
  "author": null,
  "content": "ISLAMABAD, Sep 06 (APP):Interior Minister Mohsin Naqvi, in his special message on Defence and Martyrs Day, on Saturday said that September 6 was a historic day of courage and bravery, when the martyrs, the veterans and the nation together made Pakistan invincible. Mohsin Naqvi paid glowing tribute to the eternal sacrifices of the martyrs. He said that those who laid down their lives for the defense of the homeland were our pride and honor.\nThe interior minister said that Defence and Martyrs Day was a living legacy of determination, courage and sacrifice. He added that the idols of treacherous conspiracies were shattered by the faith, passion, and bravery of the armed forces and the nation. He highlighted that the enemy who dreamt of having tea at Gymkhana ran away empty-handed after a humiliating defeat.\nMohsin Naqvi said that from Kasur to Lahore and from Sialkot to Kashmir, the Pakistan Army gave a befitting response to the enemy at every front with unmatched courage and unwavering resolve. He further said that the Battle of Chawinda has been written in golden words in history, where young soldiers tied explosives to their bodies and destroyed enemy tanks. The sacrifice of those brave sons of soil turned the enemy’s tanks into a graveyard and set an everlasting example of valor that will always be remembered.\nMohsin Naqvi said, “Salute to those brave soldiers who sacrificed their lives, made our borders impenetrable, and forced the enemy to retreat. They are the valiant personnel who, with their supreme sacrifice, gifted future generations with freedom, peace, and dignity.”\nThe interior minister emphasized that the strength, passion, and courage derived from the legacy of martyrs and veterans is our real power. He said that the great success of Defence and Martyrs Day found its continuation in the historic victory of Operation Bunyan Al Marsoos. He underscored that September 6 is the renewal of the pledge that the sanctity of the motherland will never be compromised, and the flame of ultimate sacrifice for the homeland will forever remain alight.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:21:39.433Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/september-6-a-historic-day-of-courage-and-bravery-when-nation-made-pakistan-invincible-mohsin-naqvi/",
  "dateList": "2025-09-06",
  "date_published": "2025-09-06T15:04:00.000Z"
}
