{
  "article_id": "2025-03-26_d12b5cc8ea2136cb429d73cc899c3413",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-hails-successful-imf-staff-level-agreement-for-new-1-3-bn-arrangement/",
    "retrieved_at": "2025-08-27T14:01:45.581Z"
  },
  "metadata": {
    "title": "PM hails successful IMF staff level agreement for new $1.3 bn arrangement",
    "author": null,
    "date_published": "2025-03-26T10:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 584,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 26 (APP): Prime Minister Shehbaz Sharif on Wednesday hailed the successful conclusion of a staff-level agreement with the International Monetary Fund (IMF) for a new US$ 1.3 billion arrangement, commending the government economic team for their tireless efforts in securing the deal. Chairing the Cabinet Committee meeting here, the prime minister commended the collective efforts of the Deputy Prime Minister, Finance Minister, Planning Minister, Commerce Minister, Economic Affairs Minister, FBR Chairman and other key members of the economic team for their diligent work in securing the IMF agreement. He reflected on the skepticism from opponents, who had predicted that a mini-budget would be necessary to secure the deal. However, the prime minister asserted that the agreement was achieved without the need for additional taxation measures, proving the government's resolve and planning. The prime minister also acknowledged the hardships faced by the common people who bore the burden of price hike during the process of achieving economic stability. Besides, he paid tribute to the salaried persons who contributed a major portion in tax collection. The government will receive $1.3 billion from the IMF, which will bolster Pakistan's foreign reserves to $8.3 billion, the prime minister said terming it a big achievement to stabilize the county's economy. He also highlighted the contributions of all the provincial governments and their relevant chief ministers in supporting the the federal government in securing the IMF agreement. Highlighting the government's success in surpassing tax collection targets, he said the IMF had aimed for a 10.2% tax-to-GDP ratio, but with strong performance from the economic team, the tax-to-GDP ratio had reached 10.6%, marking the highest achievement in the last four years. \"This performance reflects a 26% increase in tax collection so far\", he added. \"Pakistan's tax collection target for the year 2024-25 was set at Rs 12.9 trillion, and despite the IMF initially suggesting a downward revision of this target, I personally insisted on maintaining the original figure. Following successful negotiations, the target which was initially revised down to Rs 12.1 trillion was adjusted to Rs 12.3 trillion,\" the prime minister added. He underscored that the government had planned to fast-track the cases relating to taxes pending in the tribunals worth billions of rupees and informed that as a result of this decision, the government had recovered Rs 34 billion. Similarly, he said the faceless interaction in Karachi was successfully ongoing while process of hiring of international corporate lawyers was underway. Due to the government's reforms in sugar sector, the prime minister said Rs 12 billion more taxes were collected this year as compared to the last year and hoped that Rs 60 billion in total will be collected this year. \"This model will be replicated in cement, tobacco and textile sectors soon,\" he added. As regards, Ramazan Package, the prime minister emphasized that unlike in the past, the government had introduced a new digital wallet system to disburse amount to the deserving families through a transparent way. PM Shehbaz Sharif emphasized the importance of maintaining peace and eradicating terrorism as key pillars for the country's development. He underlined that peace was directly linked with economic progress and prosperity. He also hailed the conferment of Nishan-i-Pakistan by President Asif Ali Zardari to Shaheed Zulfikar Ali Bhutto, recognizing his significant contributions to the nation. The prime minister also expressed condolences over the demise of the mother of Chief of Army Staff General Syed Asim Munir, praying for eternal peace of the departed soul. The cabinet offered Fateha for the deceased.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}