{
  "article_id": "2025-03-26_a2388f043f312c57f4ee320825822ab0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iranian-envoy-calls-for-global-solidarity-on-intl-quds-day/",
    "retrieved_at": "2025-08-27T14:01:40.808Z"
  },
  "metadata": {
    "title": "Iranian envoy calls for global solidarity on Intâl Quds Day",
    "author": null,
    "date_published": "2025-03-26T15:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 388,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 26 (APP): Ambassador of Iran to Pakistan, Dr. Reza Amiri Moghaddam on Wednesday reiterated Iranas unwavering support for the Palestinian cause, calling upon the global community to unite against occupation and oppression. Addressing an Iftar dinner in connection with the International Quds Day, observed annually on the last Friday of Ramazan, the Iranian envoy emphasized that the day symbolizes Muslim unity in support of the Palestinian people and their right to self-determination. aInternational Quds Day, designated in 1979 by the late founder of Iran, Imam Khomeini (RA), serves as a powerful reminder of the continued struggle of Palestinians against occupation,a Dr. Moghaddam added. He condemned the ongoing violence in Gaza, attributing it to what he termed as the aaggression of the Zionist regime,a and accused certain global powers of supporting actions that have led to immense civilian casualties. aOver the past year and a half, the relentless attacks on Gaza have resulted in the martyrdom of more than 55,000 innocent children, women, and men, along with large-scale displacement and destruction of vital infrastructure,a he said. Dr. Moghaddam also highlighted recent developments, including prisoner exchanges as the afalsehoods propagated by the occupying forces.a aThe resilience of the Palestinian resistance remains unbroken. Resistance against occupation has always been a legitimate right, and history has shown that struggles for freedom only strengthen in the face of oppression,a he remarked. The Iranian envoy further accused Israel of escalating regional tensions through military actions in Gaza and Yemen, asserting that such measures serve to divert attention from the astrategic failurea of the occupation. Commending Pakistanas steadfast stance on the issue, Dr. Moghaddam expressed appreciation for the government and people of Pakistan for their unwavering support of Palestine. aPakistanas principled position against oppression and its advocacy for Palestinian rights serve as a beacon of hope for justice,a he added. He reiterated for the establishment of a sovereign Palestinian state through democratic elections with full participation from all indigenous Palestinian residents. aInternational Quds Day is more than a commemoration; it is a global movement against occupation, mass killings, and discrimination, advocating for the restoration of Palestinian rights,a he concluded. The Iranian envoy urged Muslim nations and justice-seekers worldwide to stand in solidarity and actively participate in the International Quds Day movement to amplify the call for a just resolution to the Palestinian issue.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}