{
  "title": "Shazia Marri, Siraj Raisani condemn Balochistan terror attacks, call for national unity",
  "author": null,
  "content": "ISLAMABAD, May 21 (APP):Pakistan Peoples Party (PPP) lawmakers Shazia Marri and Nawabzada Siraj Raisani on Wednesday strongly condemned the recent terrorist attacks in Balochistan and called for unity among political parties to deal with the terrorism.\nSpeaking in the National Assembly, Shazia Marri blamed India for sponsoring terrorism and trying to destabilize Pakistan.\nShe said “This once again confirms India’s role in promoting terrorism inside Pakistan,” she said.\nShe also raised concerns over reports linking India with Taliban groups, saying these connections show the deeper reasons behind the violence. “These groups work not only against Pakistan but also against peace in the whole region,” she added.\nExpressing deep worry for the country’s youth, she said the terrorists do not care about the future generations. “Our children are growing here — we care about their safety. Those who spread terror only think about their own gains,” she said emotionally.\nShe urged all political parties to put aside their differences for national security. “We in Parliament are also targets of terrorism. We must stay united and keep fighting extremism until it is fully defeated,” she stressed.\nMarri warned that political divisions only help those who threaten Pakistan’s peace and future. “We should work together to make Pakistan a center of peace and regional leadership,” she added.\nMeanwhile, MNA Nawabzada Siraj Raisani also condemned the attacks, calling the fight against terrorism a struggle that affects all of Pakistan, not just Balochistan or the armed forces.\n“This is a war against terrorism for the whole nation,” Raisani said. He stressed that all political parties, including PPP and PTI, must stand together against this threat. “We must face this menace united,” he said.\nIn an emotional message, Raisani criticized those calling for talks with terrorists. “It hurts me to hear calls for dialogue with those who kill our children and deny education to our youth. How can we negotiate with those who killed leaders like Shaheed Benazir Bhutto?” he asked.\nHe also recalled his father’s sacrifice for peace, saying, “We cannot sit with those who have innocent blood on their hands,” he said firmly.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:44:18.015Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/shazia-marri-siraj-raisani-condemn-balochistan-terror-attacks-call-for-national-unity/",
  "dateList": "2025-05-21",
  "date_published": "2025-05-21T11:05:00.000Z"
}
