{
  "title": "ISPR refutes baseless allegations, hints at Indian-backed militants’ involvement in N-Waziristan tragedy",
  "author": null,
  "content": "RAWALPINDI, May 21 (APP): The Inter-Services Public Relations (ISPR) on Wednesday strongly denied allegations circulating in the wake of a tragic incident that occurred on May 19 in the general area of Mir Ali, North Waziristan District, which resulted in civilian casualties.\nIt described the claims implicating security personnel as entirely unfounded and part of a deliberate disinformation campaign, an ISPR news release said.\n“Following a tragic incident on 19 May 2025 in the general area of Mir Ali, North Waziristan District, which regrettably resulted in civilian casualties, unfounded and misleading allegations have been circulated by certain quarters, falsely implicating Pakistan’s security forces,” it said.\nIt said these claims were “entirely baseless” and “part of a coordinated disinformation campaign” aimed at discrediting the security forces’ steadfast efforts in ongoing counter-terrorism operations.\nIn response to these accusations, it said a comprehensive investigation was promptly initiated, adding, “Initial findings have established that this heinous act has been orchestrated and executed by Indian sponsored Fitna Al Khwarij.”\nThe ISPR said it was evident that these elements, acting on behest of their Indian Masters, continued to exploit civilian areas and vulnerable populations as shields to conduct their reprehensible acts of terrorism.\n“Such tactics aim to unsuccessfully sow discord between the local population and the security forces, who together remain resolute to uproot menace of terrorism,” it added.\nThe security forces, it said, reaffirmed their commitment to ensuring that the perpetrators of this inhuman act were brought to justice.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:43:50.338Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ispr-refutes-baseless-allegations-hint-at-indian-backed-militants-involvement-in-n-waziristan-tragedy/",
  "dateList": "2025-05-21",
  "date_published": "2025-05-21T11:51:00.000Z"
}
