{
  "title": "Aleem Khan meets ambassador Khazar Farhadov, expresses solidarity with Azerbaijan",
  "author": null,
  "content": "ISLAMABAD, May 21 (APP):To express strong solidarity with Azerbaijan, amid of India’s boycott campaign, the Government of Pakistan has reaffirmed its support for Azerbaijan following India’s hostile actions against the country for standing with Pakistan.\nFederal Minister for Communications Abdul Aleem Khan on Wednesday visited the Embassy of Azerbaijan here and held a cordial meeting with Ambassador H.E. Khazar Farhadov.\nDuring the meeting, Federal Minister Abdul Aleem Khan expressed gratitude to Azerbaijan for once again supporting Pakistan by saying “Thank you for standing with Pakistan once again,” said a press release.\nAbdul Aleem Khan also reaffirmed that Pakistan will continue to stand shoulder to shoulder with Azerbaijan at every step. He condemned India’s cancellation of tourist visas and the launch of a one-sided negative propaganda campaign on social media against Azerbaijan, stating that such actions reflect India’s frustration. He further emphasized that Azerbaijan is being targeted solely for its friendship with Pakistan.\nAmbassador of Azerbaijan in Pakistan H.E. Khazar Farhadov, while expressing his appreciation for the Federal Minister’s visit, stated that Azerbaijan adopted a principled stance during the Pakistan-India conflict by choosing to stand with Pakistan. He added that the people of Azerbaijan were highly enthusiastic celebrating Pakistan’s success on May 10. The Ambassador highlighted the deep-rooted religious, cultural and fraternal ties between the two nations and said both countries take pride in supporting each other. He also pointed out that the Indian Government has started to use its film industry as a tool to propagate anti-Azerbaijan sentiment and despite that Azerbaijan remains firm on its position.\nFederal Minister for Communications Abdul Aleem Khan pointed out that the launch of direct flights between Pakistan and Azerbaijan will have a positive impact on tourism for both countries. He also shared that Pakistan has established Islamabad Chamber of Commerce for Azerbaijan paving the way for enhanced bilateral cooperation and people-to-people connections. The visit concluded with a warm exchange of pleasantries and flowers between Federal Minister Abdul Aleem Khan and Ambassador H.E. Khazar Farhadov, symbolizing the strong and growing ties between Pakistan and Azerbaijan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:43:21.735Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aleem-khan-meets-ambassador-khazar-farhadov-expresses-solidarity-with-azerbaijan/",
  "dateList": "2025-05-21",
  "date_published": "2025-05-21T14:21:00.000Z"
}
