{
  "title": "Chinese ambassador reaffirms strong support for Pakistan’s sovereignty, stability",
  "author": null,
  "content": "ISLAMABAD, May 21 (APP): Chinese Ambassador Jiang Zaidong on Wednesday said that China has always resolutely supported Pakistan in safeguarding its national sovereignty and territorial integrity.\nAddressing the 74th anniversary ceremony of the establishment of China-Pakistan diplomatic relations, the ambassador said China also backs Pakistan’s efforts to pursue a development path suited to its national conditions, combating terrorism with determination, and maintaining unity and stability to achieve development and prosperity.\nHe said on May 21, 1951, China and Pakistan established the diplomatic relations, ushering in a new era in the millennia-old exchanges between the two peoples.\nAmbassador said that over the past 74 years, under the care and guidance of successive generations of leaders, and nurtured by the peoples from both countries, China and Pakistan have forged an all-weather friendship, achieved comprehensive cooperation, and set a shining example for state-to-state relations.\nHe said over the past 74 years, we have adhered to the original aspiration of establishing diplomatic relations, supported each other unwaveringly. “Our two nations enjoy a high level of mutual trust, with leaders maintaining close interactions.”\nChinese Ambassador said within just eight months starting from June last year, the prime ministers of both countries exchanged visits, and Pakistan’s president Zardari successfully visited China.\nSuch close high-level exchanges vividly demonstrate the extraordinary friendship between our nations. The important consensus reached by Chinese President Xi Jinping with Pakistani leaders, has injected strong impetus into advancing China-Pakistan all-weather strategic cooperation under new circumstances.\nHe said that Pakistan has consistently adhered to the one-China principle, standing firmly with China on issues concerning our core interests. “When confronting challenges like earthquakes, floods, and pandemic, we have repeatedly written heartwarming stories of solidarity and mutual assistance.”\nAmbassador said that the unbreakable iron-clad friendship between China and Pakistan has withstood the test of global uncertainties, and witnessing new chapter in building an even closer China-Pakistan community with a shared future.\nThe ambassador said that over the past 74 years, we have advocated the Silk Road Spirit and joined hands in pursuing common development. The Silk Road Culture Center where we stand today reminds us of the Silk Road Spirit, characterized by peace and cooperation, openness and inclusiveness, mutual learning and benefit.\nHe said that the CPEC and BRI have fully reflected this spirit. China has been Pakistan’s largest trading partner for ten consecutive years, consistently serving as the largest source of imports, the second-largest export destination, and also the primary source of foreign investment.\nHe said that after 12 years of development, CPEC has entered a new phase of “upgraded version”, making significant contributions to Pakistan’s economic and social development.\nChinese Ambassador said that since the end of last year, the Gwadar New International Airport has commenced commercial operations, the Khunjerab Pass has achieved all-year round opening, the first batch of 1,000 Pakistani agricultural professionals are enjoy training in China, 278 sets of advanced agricultural machinery worth 30 million yuan in aid have been allocated to local people, and 50,000 health kits have been successfully distributed to the needed.\n“We will promote the implementation of the eight major steps on high-quality Belt and Road cooperation in Pakistan, in line with Pakistan’s 5Es framework, to seize new priorities such as agricultural and industrial cooperation, create new highlights in mining and new energy sectors, foster growth points like B2B and cross-border e-commerce, implement more “small and beautiful” livelihood projects, and ensure that China-Pakistan cooperation delivers more tangible benefits to people of both countries.”\nHe said that as key members of the Global South and important forces for safeguarding fairness and justice, China and Pakistan have maintained close coordination within multilateral mechanisms such as the United Nations and the Shanghai Cooperation Organization.\nChinese Ambassador said, “We stand ready to deepen high-level interactions with Pakistan, safeguard the common interests of developing countries, promote the mutual learning and flourishing of Chinese and Islamic civilizations, and advance an equal and orderly multipolar world and a universally beneficial and inclusive economic globalization.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:44:45.832Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chinese-ambassador-reaffirms-strong-support-for-pakistans-sovereignty-stability/",
  "dateList": "2025-05-21",
  "date_published": "2025-05-21T18:44:00.000Z"
}
