{
  "title": "U.S. condemns attack on school bus in Balochistan",
  "author": null,
  "content": "ISLAMABAD, May 21 (APP):The United States has strongly condemned the recent attack on a school bus in Khuzdar, Balochistan, which claimed the lives of innocent children and left others injured.\nThe brutal incident has shocked the nation and drawn international condemnation, with U.S. Chargé d’Affaires Natalie Baker expressing deep sorrow and solidarity with the victims.\nIn an official statement issued by the U.S. Embassy in Islamabad, Baker said, “We join Pakistan’s leaders in condemning the brutal, unconscionable attack on a school bus in Khuzdar, Balochistan. The murder of innocent children is beyond comprehension. We grieve with the families who lost loved ones, and our thoughts are with those recovering.”\nThe attack, which targeted a vehicle carrying school children, has been described as a heinous act against the most vulnerable members of society. While investigations are still ongoing, authorities believe it may be linked to ongoing unrest in the province.\n“No child should ever fear going to school,” Baker emphasized in her statement. “We stand with those in Pakistan working to end this violence.”\nThe incident has sparked outrage and mourning across Pakistan, with government officials, civil society, and international partners calling for justice and increased protection for schoolchildren in conflict-affected regions.\nThe U.S. Embassy’s statement reflects growing global concern over violence targeting educational institutions and children, and reaffirms the international community’s support for Pakistan in its fight against terrorism and extremism.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:43:53.149Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/u-s-condemns-attack-on-school-bus-in-balochistan/",
  "dateList": "2025-05-21",
  "date_published": "2025-05-21T12:48:00.000Z"
}
