{
  "article_id": "2025-05-09_a9bc185a621f3dc5945ce91e1cc2fb0b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nelson-assures-full-support-of-christian-community-to-pakistan-armed-forces/",
    "retrieved_at": "2025-08-27T15:17:47.411Z"
  },
  "metadata": {
    "title": "Nelson assures full support of Christian community to Pakistan armed forces",
    "author": null,
    "date_published": "2025-05-09T11:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 09 (APP):Parliamentary Secretary for National Health Services, Regulation and Coordination Nelson Azeem Friday said that the Christian community stands firmly with the Pakistan armed forces and is ready to contribute to any capacity if tensions with India escalate further. Speaking in the National Assembly, he said that the Christian community has consistently stood by Pakistan in times of wars and remains prepared to do so again. He said that if war is imposed on the country, Christians-like all other citizens-are ready to stand alongside the armed forces in defense of the motherland. He highlighted the historical contributions of the Christian community during previous conflicts, including the wars of 1965 and 1971. Nelson Azeem recalled his own family's military background, mentioning that his father served on the front lines during those wars and returned victorious. \"The entire nation, including our youth, is united today,\" he said. \"We are not looking for war, but if it is imposed upon us, the response will be strong and collective.\" He lauded armed forces, PAF on swift and timely response, downing of enemy's five aircraft and dozens of drones. Nelson Azeem said that such actions reflect the army's preparedness and commitment to national security. He called for unity and focus, urging all citizens to set aside personal and political differences in favor of national integrity. \"Our only priority must be to protect and serve Pakistan,\" he said. Nelson Azeem said that Christian-run hospitals across the country are ready to offer medical services if conflict breaks out. \"Our institutions stand ready to treat anyone in need, as part of our contribution to the country's defense,\" he added. He reiterated his support for the armed forces and expressed confidence in the unity and resolve of the people of Pakistan during challenging times.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}