{
  "article_id": "2025-05-09_74ab48af6065017fce54ef798317462b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ministry-launches-special-flights-for-pilgrims-amid-airport-disruptions/",
    "retrieved_at": "2025-08-27T15:16:56.005Z"
  },
  "metadata": {
    "title": "Ministry launches special flights for pilgrims amid airport disruptions",
    "author": null,
    "date_published": "2025-05-09T12:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 235,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 09 (APP): The Ministry of Religious Affairs and Interfaith Harmony on Friday said several Hajj flights from across the country faced cancellations and delays due to intermittent suspensions in airport operations, affecting the travel plans of thousands of pilgrims. In an exclusive talk with APP, ministry's spokesperson Muhammad Umar Butt informed that a total of 13 Hajj flights were disrupted between May 7 and 9, with four flights cancelled and nine delayed. He said two Saudi Airlines Hajj flights each from Islamabad and Lahore were cancelled. Among the delayed flights, three originated from Lahore, two each from Islamabad and Quetta, and one each from Multan and Karachi, he added. The spokesperson confirmed that the temporary flight suspensions affected the schedules of approximately 3,080 Hajj pilgrims. However, he said most of the delayed flights eventually departed after a few hours' postponement. To accommodate those left behind due to the cancellations, Umar Butt said the ministry arranged a special Pakistan International Airlines (PIA) flight from Islamabad, which transported 345 pilgrims. An additional 540 pilgrims will be flown out on special flights from Islamabad and Lahore in the coming days, he maintained. To assist pilgrims in staying informed, he said the ministry has launched a dedicated helpline at 051-9216980, offering real-time updates on flight schedules and departure information. He further advised the pilgrims to stay in contact with their respective Haji camps for the latest details.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}