{
  "article_id": "2025-05-09_94c6af66fe5a3b807ebc566e600fa8f6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/religious-affairs-minister-congratulates-global-christian-community-on-election-of-pope-robert-prevost/",
    "retrieved_at": "2025-08-27T15:17:03.661Z"
  },
  "metadata": {
    "title": "Religious affairs minister congratulates global Christian community on election of Pope Robert Prevost",
    "author": null,
    "date_published": "2025-05-09T12:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 177,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 09 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Friday extended heartfelt congratulations to the global Christian community on the election of Pope Robert Prevost, calling it a moment of profound spiritual significance for millions around the world. The minister said the election of the new pontiff comes at a time when the world is grappling with serious challenges, underscoring the need for strong moral and spiritual leadership. \"Today, the world needs the most powerful voices to speak for peace, social justice, human dignity, and compassion,\" said Sardar Yousaf. He reaffirmed Pakistan's commitment to promoting interfaith harmony, mutual respect, and peaceful coexistence. \"We deeply value our relationship with the Christian community and are dedicated to strengthening these ties,\" he said. Highlighting the symbolic weight of the papal conclave, the minister said, \"This new chapter brings hope and renewed expectations for millions across the globe.\" Expressing optimism for the future, Sardar Muhammad Yousaf expressed hope that Pope Robert Prevost would play a pivotal role in advancing interfaith harmony and global peace.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}