{
  "title": "Huawei’s deep learning data lake storage solution launched at GITEX GLOBAL 2023",
  "link": "https://www.app.com.pk/national/huaweis-deep-learning-data-lake-storage-solution-launched-at-gitex-global-2023/",
  "date_published": "2023-10-17T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Huawei’s OceanStor A310 addresses critical industry challenges and expands the horizons of AI as it provides optimal storage capability for basic model training, industry model training, and inference in segmented scenario models, unleashing new AI capabilities.\nThe launch demonstrates Huawei’s alignment with the latest trends of AI development in the era of large models.\nThe OceanStor A310 deep learning data lake storage caters to different industries and scenarios in large AI model applications mitigating the most significant challenges enterprises face in the development and implementation of large model applications.\nCurrently, pre-processing about a hundred terabytes of data takes around ten days as data preparation takes a long time, with dispersed data sources and slow aggregation.\nMoreover, for multi-modal large models using massive text and images as training sets, the current loading speed for a large number of small files is less than 100MB/s, resulting in low efficiency in loading training sets. Further delays occur because of the frequent tuning of large model parameters and instability in the training platform leading to training interruptions and recovery processes.\nThe high threshold for large model implementation, complex system construction, difficult resource scheduling, and GPU resource utilization is usually below 40%.\nMeanwhile, the Huawei OceanStor A310’s deep learning data lake storage caters to different industries and scenarios in large model applications.\nIn the context of basic/industry large model scenarios, OceanStor A310 is a deep learning data lake storage solution that offers unlimited horizontal scalability and high performance for mixed workloads.\nIt enables end-to-end massive data storage management for AI processes, including data collection, preprocessing, training, and inference. It possesses data analysis capabilities consistent with HPC and big data, allowing for the processing of data from similar sources.\nPeter Zhou, President of Data Storage Product Line, Huawei said, “With the OceanStor A310, we are bringing our customers and partners a cutting-edge AI storage solution to unleash new AI capabilities and create value for various industries.\nVisitors to our GITEX stand can witness how Huawei is committed to accelerating the intelligent era, leveraging a trusted, secure, and reliable OceanStor platform used by some of the leading businesses in the world.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:07:24.829Z"
}
