{
  "title": "Pakistan’s to learn from Malaysia’s innovative approach, policies regarding rollout of 5G: Minister",
  "link": "https://www.app.com.pk/national/pakistans-to-learn-from-malaysias-innovative-approach-policies-regarding-rollout-of-5g-minister/",
  "date_published": "2023-10-17T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Caretaker Federal Minister for IT and Telecom, Dr. Umar Saif, on Tuesday, expressed Pakistan’s intention to learn from Malaysia’s innovative approach and policies regarding the rollout of 5G.\n“Malaysia has rolled out 5G at a lightning pace using a very innovative Spectrum Sharing policy. We will work with our Malaysian counterparts to learn about their innovative approach and policies” the minister said.\nHe was talking to a high-level delegation led by Fahmi Fadzi minister for IT, Communication & Digital Economy of Malaysia here in Dubai at the GITEX-23 Sidelines meeting.\nThe meeting encompassed crucial technology topics with the objective of strengthening collaboration between the two nations.\nDuring the meeting, Dr Umar Saif explored the realm of financial technology (Fintech) and touched upon Starlink, the satellite internet company, making inroads into Malaysia.\nThe discussion extended to the potential implementation of LYNC, with a commitment to sharing experiences and knowledge.\nDr. Umar Saif drew attention to Pakistan’s network coverage challenges, underscoring the importance of adopting best practices from the Malaysian Regulator.\nBoth ministers engaged in a dialogue regarding Pakistan’s path to adopting 5G technology and the challenges impeding this transition.\nThe Malaysian minister pledged to share best practices to facilitate this transition.\nThe meeting also featured a discussion on the International Telecommunication Union (ITU) and its potential benefits for both Pakistan and Malaysia in the technology sector.\nThe meeting involved a commitment to enhance coordination and discussions in the forthcoming months, signifying the growing partnership between the two countries.\nAdditionally, the minister also informed about recent policy changes in Pakistan aimed at supporting the IT and telecom sectors.\nDr. Umar Saif said, the State Bank of Pakistan (SBP) has authorized a 50% retention of IT export remittances in foreign currency (FCY) accounts.\nPolicies have been implemented to ensure smooth and hassle-free cash flows for IT exporters through online banking and corporate debit cards, he added.\nThese developments also encompass various initiatives aimed at simplifying Right of Way (ROW) charges, boosting infrastructure sharing, advancing the 5G spectrum, and enhancing IT export retention.\nDr. Saif said the federal cabinet granted approval for an advisory Committee for Pakistan’s 5G Spectrum auction a major step toward digital Pakistan.\nIn a related context, Dr. Umar Saif visited Expand North Star, an international showcase of innovation and cultural exchange.\nThe Pakistan Pavilion was thoughtfully designed to encapsulate the country’s progress and potential, welcoming visitors with open arms.",
  "retrievedAt": "2025-08-11T10:07:00.596Z"
}
