{
  "title": "Pakistan envoy emphasises science diplomacy to solve global problems",
  "link": "https://www.app.com.pk/national/pakistan-envoy-emphasises-science-diplomacy-to-solve-global-problems/",
  "date_published": "2023-10-17T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Ambassador of Pakistan in Belgium Amna Baloch on Tuesday underscored the need for science diplomacy and cooperation for solving global problems inclding food security and climate change.\nThe ambassador said this in an information session on Horizon Europe grant scheme held as part of science diplomacy initiative held by the embassy and Directorate General of Research and Innovation of the EU Commission (DG RTD), according to a press release.\nAmbassador of Pakistan Amna Baloch and EU Head of Delegation Ambassador Riina Kiona emphasized the need to foster research collaboration in order to address emerging global challenges and attain sustainable development goals.\nHead of Unit (Global Approach and International Cooperation in Asia) Nienke Buisman, in her opening remarks, shared the theme specific approach of Horizon Europe and the strategic focus of international cooperation.\nHorizon Europe is the European Union’s flagship funding program for research and innovation. It has a substantial budget of €95.5 billion and aims to support various areas of research and innovation to address challenges such as climate change and contribute to achieving the United Nations’ Sustainable Development Goals.\nThis program spans a seven-year period (2021-2027) and is a successor to the Horizon 2020 program.\nDuring the information session, the audience was also briefed on modalities of participation from Pakistani entities in the Horizon Europe grant scheme by Senior Policy Officer Tania Friederichs.\nSubsequently, experts from the European Commission shared details regarding diverse grants calls in the themes of agriculture, circular economy including sustainable textiles and disaster management.\nThe participants were also informed on the scholar mobility options and funding available under the Marie Skłodowska-Curie Actions.\nIn his closing remarks, Additional Secretary (United Nations) Ambassador Syed Haider Shah highlighted the global need for leveraging science, technology and innovation for socio-economic development.\nHe emphasized that such events would further enable deepening of research linkages between Pakistan and the EU.\nThe event was attended by policy and academic stakeholders in Pakistan as well as by scientific diaspora in the EU.",
  "retrievedAt": "2025-08-11T10:07:00.197Z"
}
