{
  "title": "Afghan education delegation visits IIUI",
  "link": "https://www.app.com.pk/national/afghan-education-delegation-visits-iiui/",
  "date_published": "2023-10-17T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): An official Afghan delegation headed by Dr. Nazar Muhammad Irfan, Director of Foreign Affairs and Scholarships, Ministry of Higher Education, Afghanistan, visited International Islamic University (IIU) on Tuesday where it discussed bilateral cooperation in education and also met with Afghan students.\nThe delegation also included Dr. Rafiullah Ata, Chancellor of Afghan International Islamic University (AIIU), Abdul Hai Kaiwaan, Dean of Engineering Faculty AIIU, Nisar Ahmed Zahid Dean of Agriculture Faculty AIIU who was accompanied by Jehanzeb, Project Director HEC and Waqar Khan, Project Manager, HEC, said a press release.\nThe delegation was given a detailed briefing about the IIUI’s profile, vision and future goals by Director Academics and Examination Prof. Dr. Muhammad Khan.\nOn this occasion, possibilities of the joint faculty exchange and research programs were discussed. It was agreed that ways to exchange experiences and training-related projects shall be deliberated.\nOn the occasion, Dr Nazar Muhammad Irfan said that education is the top priority of the Afghan government and it is working day and night to improve higher education.\nHe said the Afghan government is eager to welcome capable faculty members who can help in building recently established departments in various fields of education.\nDr. Rafiullah Atta, Chancellor of AIIU said, the visit is aimed at building institutional linkages with the leading Pakistani universities and IIUI has a very noble name across the Muslim world as most of the IIUI Afghan graduates are on the key posts in Afghanistan.\nThe delegates opined that collaboration with IIUI will help in broadening the exposure of Afghan students. They showed satisfaction and happiness that a large number of Afghan students were acquiring quality education at IIUI.\nThe meeting was also attended by the Dean Arabic Dr. Fazal ullah, Dean of Faculty of Shariah and Law Dr. Attaullah Faizi, Students Advisor male Dr. Hafiz Ghufran Ali khan and Afghan students at IIU.\nIn his vote of thanks, Dr. Fazlullah said that IIUI is always open to promoting education and it has faculties that are idealized across the world by the students.\nHe thanked the Afghan delegation for their keen interest in IIUI and mutual cooperation in education.",
  "retrievedAt": "2025-08-11T10:06:58.391Z"
}
