{
  "title": "Kashmir to remain cornerstone of Pakistan foreign policy: Qureshi",
  "link": "https://www.app.com.pk/national/kashmir-to-remain-cornerstone-of-pakistan-foreign-policy-qureshi/",
  "date_published": "2020-02-09T01:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP):Minister for Foreign Affairs Shah Mahmood Qureshi held consultative meetings with the Kashmiri leadership wherein he reiterated that Kashmir would continue to remain the cornerstone of Pakistan’s foreign policy.\nThe meetings were in fact the follow-up to Prime Minister Imran Khan’s meeting with the Kashmiri leadership and his address to the Legislative Assembly of Azad Jammu and Kashmir (AJK) on Kashmir Solidarity Day on February 5, a Foreign Office press release received Sunday.\nAmong those whom the foreign minister met included Heads of parliamentary parties in AJK, led by Prime Minister Raja Muhammad Farooq Haider Khan, as well as with representatives of the All Parties Hurriat Conference (APHC) leadership.\nThese meetings were also attended by Federal Minister for Kashmir Affairs and Gilgit-Baltistan Muhammad Amin Gandapur.\nThe purpose of the meetings was to exchange views on the continuing dire situation in Indian Occupied Jammu and Kashmir and consult about the ongoing international campaign to further advance the Kashmiri cause.\nThe participants acknowledged the sacrifices made by the Kashmiri people for the realization of their inalienable right to self-determination.\nThey appreciated the indomitable resilience of Kashmiri people in withstanding the new wave of Indian atrocities following India’s illegal and unilateral actions of August 5, 2019.\nThe gross human rights violations perpetrated by Indian occupation forces in complete disregard of international human rights laws were strongly condemned.\nThe participants stressed that India’s continued belligerence and aggressive measures posed a serious threat to regional peace and security.\nThey reiterated that India must immediately end the continuing lockdown, communications blockade and media blackout in Indian occupied Jammu and Kashmir, and release the incarcerated Kashmiri leadership and innocent Kashmiri youth, many of whom were held at undisclosed locations away from their families.\nThe participants underscored that the only solution to the Jammu and Kashmir dispute was in the full implementation of the relevant United Nations Security Council Resolutions.\nThe non-implementation of these Resolutions, despite a lapse of more than seven decades, remained a scar on the collective conscience of the international community, they maintained.\nThe Kashmiri leadership acknowledged Pakistan’s unwavering support to the Kashmiri people and appreciated its efforts for effectively raising the Kashmir dispute and highlighting gross human rights violations in IOJK at all international forums.\nThe foreign minister reiterated Pakistan’s firm resolve to stand with the Kashmiris till the realization of their right to self-determination as promised by the international community.\nHe stressed that solution of the Kashmir dispute in accordance with the UN Security Council Resolutions and the wishes of the Kashmiri people was imperative and association of the Kashmiris in this process of advancing the resolution was indispensable.\nHe underscored that a just and lasting solution to the Kashmir dispute was also essential for durable peace and stability in South Asia.",
  "retrievedAt": "2025-08-11T18:46:09.995Z"
}
