{
  "title": "MNC, PCB join hands to sensitize cricket enthusiasts about drugs effects at PSL-5",
  "link": "https://www.app.com.pk/national/mnc-pcb-join-hands-to-sensitize-cricket-enthusiasts-about-drugs-effects-at-psl-5/",
  "date_published": "2020-02-09T05:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP):Ministry of Narcotics Control (MNC) and Pakistan Cricket Board (PCB) Sunday have joined hands to sensitize the cricket enthusiasts about hazardous effects of drugs at the 5th edition of the Pakistan Super League (PSL-5), scheduled to be kicked off on February 20.\nBoth the government departments formally developed the consensus in a meeting between Minister for Narcotics Control Shehryar Khan Afridi and Chairman of PCB Ehsan Mani and Chief Executive Officer (CEO) PCB Wasim Khan for launching the massive drive during the mega national event.\nThe PCB CEO apprised the meeting participants regarding the strategy to materialize the idea of launching an awareness drive on drugs at the PSL-5, a press release said.\nCongratulating Ehsan Mani and Wasim Khan for joining hands with the MNC for a national cause, Shehryar Afridi said apart from launching crackdown against drugs peddlers, sensitization of general public about drugs ramifications was the best tool to help reduce drugs demand in the country.\nThe minister said he was happy that the PSL-5 would act as a launching pad for the awareness campaign on drugs.\nEhsan Mani said it was a great feeling to be a partner in saving the youth from the drugs. He said the PCB was ready to act as a partner to help deliver a national service.\n“Under our Corporate Social Responsibility domain, we are ready to work with partners and collaborators to do social service. Raising awareness among the general public would be a sacred cause for which PCB would always be ready to contribute,” he added.\nShehryar Afridi briefed the PCB leadership on the measures adopted by the MNC for public awareness to promote healthy lifestyle among the Pakistani people under the vision of Prime Minister Imran Khan.\nHe said the MNC was working with dedication on a multi-pronged strategy to help save the country from the menace of drugs.\nHe said the MNC was working to launch a crackdown on big fish involved in illicit business of drugs, rehabilitate drugs victims and reduce demand of drugs by convincing youth on hazardous effects of drugs on humans.\n“We have been taking unprecedented measures against drug traffickers and action is being taken to net big fish involved in illicit business of drugs. Prime Minister Imran Khan has specially instructed me not to spare anyone involved in drugs. We will not sit idle until we eradicate this menace from Pakistan,” he said.\n“This is the vision of Prime Minister Imran Khan that not only we have to save our youth from drugs, but we have to act as a responsible global partner to save the world from drugs too. Since 85 percent of heroine is produced in Afghanistan, as first line of defence, we are working with our partners to ensure that the world is saved,” he added.\nAfridi told the meeting that Pakistan was also working in close coordination with Afghan, Iran and other neighbours to help choke the supply of drugs in the country.\n“We are taking strong decisions against drugs. As per modern trends worldwide, we are working on structural reforms and legislation too that would take time,” he said.\nAfridi also congratulated Ehsan Mani and his team for bringing back international cricket in Pakistan and appreciated the efforts of PCB CEO in implementation of the prime minister’s vision.\nHe told the PCB chief that the ideas of PCB CEO Wasim Khan of carrying out bold structural reforms under a multi pronged strategy to help revive Pakistan cricket was in line with vision of Prime Minister Imran Khan.",
  "retrievedAt": "2025-08-11T18:46:06.555Z"
}
