{
  "title": "Tendering of PWD underpass, Korang bridg, fish-belly in two months",
  "link": "https://www.app.com.pk/national/tendering-of-pwd-underpass-korang-bridg-fish-belly-in-two-months/",
  "date_published": "2020-02-09T00:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 09 (APP):The tendering for construction of PWD underpass, widening of Korang bridge and converting Khokar Hotel U-Turn into fish-belly at Islamabad Expressway would be conducted within the next few months.\nChairman National Assembly Standing Committee on Interior Raja Khurram Shahzad Nawaz said while talking to APP said, over Rs 450 million would be spent on these projects.\nThe inter-provincial traffic congestion at the expressway would be reduced significantly with these measures.\nLast year, the Capital Developed Authority (CDA) had asked the government for Rs 10 billion to widen the expressway from Koral to G.T. Road but the government had only allocated Rs 450 million in the 2019-20 budget.\nAs per law a society having over 1,000 Kanal of land is bound to construct service areas along main highways, he said adding that the surrounding housing societies should construct the service areas along with the expressway in their respective jurisdictions to ease traffic congestion.\nResponding to a question regarding stoppage of the construction at Khokar Hotel U-Turn, he said, CBR society had started the construction work on converting the U-Turn into fish-belly, but CDA stopped the work however, the construction work  at the U-Turn will be resumed soon.\nThe rupees six billion budget of Islamabad was being spent in 200 schools of federal capital while 600 schools situated in rural areas lack basic facilities.\nCriticising mayor Islamabad Sheikh Ansar Aziz, he said Islamabad Metropolitan Corporation has been made ineffective.\nA mega centre of National Database and Registration Authority (NADRA) would\nbe set up at Tarlai area.\nRs 200 billion water supply project from Ghazi Brotha to Islamabad will be executed soon.\nHe said tendering of Rs 350 million uplift projects in his constituency has already been advertised. He started construction work on Burma bridge. He even launched development projects near the house of Dr Tariq Fazal Chaudhry, his opponent and former MNA and federal minister.Several up gradation projects of electricity, gas infrastructure in the constituency has already been continuing.\nIslamabad has the special status and its aboriginal inhabitants had been deprived from their constitutional rights especially in government jobs in education and health sector.\nGovernment jobs from grade 1 to 15 was the right of the natives of Islamabad but they were being deprived from their basic rights.\nAbout the performance of National Assembly Standing Committee on Interior, he said the committee was performing its duties of keeping political differences aside. The committee has already passed Islamabad Rent Control Act 2019, Islamabad Food Authority Bill and couple of other bills which will be tabled in the National Assembly.\nA fraud of Rs 7.5 billion was committed by the housing society supposed to provide plots to the employees of National Assembly whereas the allottees paid Rs 430.70 million for getting plots in the society.\nThe fraud case will be sent to FIA for probe.Billion of rupees looted on fake promise of giving plots to people would be recovered from the fraudsters.\nResponding to a question, he said former Prime Minister Muhammad Nawaz Sharif was a technical thief while former President Asif Ali Zardari is a dacoit.\nHe said the failure of Prime Minister Imran Khan will trigger a sense of despondency among country’s 45 percent youth.\nHe said social media has become important tool for disseminating latest news items.",
  "retrievedAt": "2025-08-11T18:46:13.722Z"
}
