{
  "title": "President felicitates organizers for holding successful winter sports at Malam Jabba",
  "link": "https://www.app.com.pk/national/president-felicitates-organizers-for-holding-successful-winter-sports-at-malam-jabba/",
  "date_published": "2020-02-09T09:45:00.000Z",
  "source": "APP",
  "content": "MALAM JABBA, Feb 9 (APP):President Dr Arif Alvi Sunday appreciated the efforts of Pakistan Air Force (PAF) and Winter Sports Federation of Pakistan (WSFP) for the promotion of winter sports in Pakistan and congratulated all the stakeholders for successfully holding mega events featuring international skiers.\nHe was addressing a prize distribution ceremony of 3rd Malam Jabba International Alpine Ski Cup, 4th CAS Karakoram International Alpine Ski Cup and 27th National Ski Championship held at Malam Jabba ski resort.\nThe president was the chief guest on the occasion. Air Marshal Ahmer Shehzad, Vice Chief of Air Staff, who is also President Winter Sports Federation of Pakistan, was also present in the ceremony, a press release of PAF said.\nEarlier, Air Vice Marshal Moeed Khan, Air Officer Commanding Northern Air Command, in his welcome address said PAF was fully committed not only to promote skiing in Pakistan but also to train budding players for participation at the international winter sports events.\nThe president also awarded medals among the winning players. The PAF team was awarded the winner trophy of 27th National Ski Championship.\nFollowing were the top winners in the events:-\n3rd Malam Jabba International Alpine Ski Cup:\nMen’s Giant Slalom: Nazarity Petruk (Gold) Ivan Kravchuk (Silver) and Vitalii Aib (Bronze)\nMen’s Slalom:\nVitalii Aib (Gold) Karim (Silver) NazarityPetruk(Bronze).\nWomen’s Giant Slalom:\nKhushim Sahiba(gold) Elvira Zakrayeva(Silver) Umamma Wali(Bronze).\nWomen’s Slalom:\nKhushim Sahiba(Gold) Umama Wali (Silver) Nazima Khairzad (Bronze)\n4th CAS Karakoram International Alpine Ski Cup:\nMen’s Giant Slalom:\nKarim (Gold) Nazarity Petruk (Silver) Ivan Kravchuk (Bronze).\nMen’s Slalom:\nVitalii Aib( Gold) Nazarity Petruk (Silver) Mykola Dichuk(Bronze).\nWomen’s Giant Slalom:\nKhushim Sahiba(Gold) Umama Wali (Silver) Jia Ali (Bronze)\nWomen’s Slalom: Khushim Sahiba(Gold) Umamma Wali (Silver) Elvira Zakrayeva (Bronze)\n27th National Ski Championship:\nGiant Slalom:\nKarim (Gold) Mir Nawaz (Silver) Zahid Abbas (Bronze).\nSlalom event:\nKarim (Gold) Mir Nawaz (Silver) Liaqat Ali (Bronze).",
  "retrievedAt": "2025-08-11T18:46:04.753Z"
}
