{
  "title": "FM, UK ministers discuss bilateral ties",
  "link": "https://www.app.com.pk/national/fm-uk-ministers-discuss-bilateral-ties/",
  "date_published": "2024-03-22T15:41:00.000Z",
  "source": "APP",
  "content": "LONDON, Mar 22 (APP): Foreign Minister Mohammad Ishaq Dar held separate meetings with the UK Minister of State for South Asia and Commonwealth, Lord Tariq Ahmad, and with the Minister of State for Development, Andrew Mitchell at the Foreign Commonwealth and Development Office in London on Friday.\nPakistan-UK relations, regional and global security, Pakistan’s role at the UN and other multilateral forums as well as Pakistan’s economic and development vision came under discussion.\nLord Ahmad felicitated Foreign Minister Dar on assuming the position of Foreign Minister, and expressed the desire to work closely with the new government going forward.\nThe two sides underscored the deep bonds of friendship and amity that exist between Pakistan and the UK. Next steps for further deepening of relations including leveraging the untapped potential of the British Pakistani diaspora to further expand trade and investment opportunities, were also discussed.\nIn response to Foreign Minister Dar’s call for early resumption of PIA flights to the UK, the UK side assured that it was working closely with Pakistan at the technical level to support resumption of flights at the earliest possible. The Foreign Minister assured the UK side that all technical issues on Pakistan’s side would be resolved at the earliest, enabling PIA to resume flights to the UK.\nDiscussing Afghanistan, the Minister of State for South Asia thanked the Foreign Minister for Pakistan’s continued support on resettlement of Afghan nationals. The Foreign Minister apprised him about the current situation.\nForeign Minister Dar expressed wishes for complete health and recovery for His Majesty, King Charles III as well as the Princess of Wales.\nThe Foreign Minister extended cordial invitations to Foreign Secretary Lord Cameron, Minister Lord Ahmad and Minister Mitchell to visit Pakistan, which were received with appreciation.",
  "retrievedAt": "2025-08-11T01:29:52.048Z"
}
