{
  "title": "President felicitates nation on Pakistan Day",
  "link": "https://www.app.com.pk/national/president-felicitates-nation-on-pakistan-day/",
  "date_published": "2024-03-22T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): President Asif Ali Zardari felicitated the nation on Pakistan Day urging people to reflect on journey of the nation while celebrating their achievements.\nIn a message, he said, “On this auspicious occasion of Pakistan Day, I extend heartfelt greetings and best wishes to each one of you.”\n“Today, as we commemorate the historic passage of the Pakistan Resolution on 23rd March 1940, a day that laid the foundation for the creation of our beloved nation and an independent homeland, let us reflect on our journey, celebrate our achievements, and reaffirm our commitment to a prosperous and united Pakistan,” he added.\nHe said, “As we revisit the pages of history, we are reminded of the vision and determination of our forefathers. The Pakistan Resolution of 1940 marked a crucial turning point, setting the course for the establishment of Pakistan on 14th August 1947. Today, we honour the commitment and sacrifices made by the Quaid-i-Azam Mohammad Ali Jinnah and his companions, who worked tirelessly towards transforming Allama Dr Muhammad Iqbal’s dream into reality.”\n“The journey since our independence has been marked by significant achievements across various domains. Our armed forces, civil administration, police, and law enforcement agencies have, with unwavering commitment, ensured the safety, security, and sovereignty of our nation. Their triumphant role in the two-decade-long war against terrorism, rapid response to the call of duty in times of natural disasters, and contribution to peacekeeping missions worldwide stand out as our unflinching commitment to global peace and peaceful coexistence,” he remarked.\nThe President said, “Let us also recognize the unparalleled sacrifices of our Kashmiri brethren, both during the Pakistan Movement and in the ongoing struggle for the freedom of Indian Illegally Occupied Jammu & Kashmir (IIOJK). The people of IIOJK are enduring the worst form of repression and state-sponsored terrorism at the hands of Indian occupation forces, aggravated by the Hindutva agenda, exemplified by the unilateral revocation of Article 370 and 35A.”\n“The key to durable peace in South Asia is the resolution of the dispute in accordance with the United Nations Security Council Resolutions. Pakistan, on its part, stands committed to extending all kinds of moral and diplomatic support until the oppressed people get their right to self-determination.”\nHe said, “Similarly, Pakistan is deeply concerned over the indiscriminate killing of innocent Palestinians and persistent attacks on educational institutions and hospitals by the Israeli forces. Pakistan remains steadfast in its principled support for the establishment of an independent, viable, and contiguous state of Palestine, based on the pre-1967 borders, with Al-Quds Al-Sharif as its capital.”\n“In the spirit of Pakistan Day, let us reaffirm our commitment to democracy, justice, and equality. I urge each one of you to participate in the nation-building process actively; embracing the values of hard work, integrity, and compassion. Together, united, we shall overcome obstacles and chart a course towards a better and brighter future for our beloved Pakistan,” the President concluded.",
  "retrievedAt": "2025-08-11T01:29:49.482Z"
}
