{
  "title": "VCs call for immediate suspension of new university creations",
  "link": "https://www.app.com.pk/national/vcs-call-for-immediate-suspension-of-new-university-creations/",
  "date_published": "2024-03-22T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Vice Chancellors Committee while recognizing the detrimental impact of proliferation in the number of institutions on the quality of education, advocated for an immediate halt to the establishment of new universities.\nThey also underscored the importance of consolidating existing institutions to enhance efficiency and optimize resource allocation.\nIn a concerted effort to address the pressing challenges faced by the higher education sector, the Vice Chancellors’ Committee was convened for a two-day meeting in Islamabad with the participation of more than 160 public and private universities from across the country.\nThe gathering provided a platform for the university heads to engage in comprehensive discussions and formulate strategic initiatives to navigate the turbulent landscape of the country’s tertiary education.\nThe meeting was presided over by the Chairperson of VCs’ Committee Dr. Iqrar Ahmad Khan and was also attended by Chairman Higher Education Commission (HEC) Dr. Mukhtar Ahmad, Executive Director HEC Dr. Zia Ul-Qayyum and divisional heads of HEC.\nThe Vice Chancellors of public sector universities unanimously voiced their concern over the financial challenges being faced by the universities. Emphasizing the pivotal role of financial resources in sustaining academic excellence, they called for immediate corrective actions by the government as well as by the management of the universities.\nFurthermore, to streamline resource utilization, they stressed the need to curtail new development projects and redirect focus towards completing the ongoing projects particularly those in advanced stages of their completion.\nWhile appreciating the Sindh government for a considerable increase in the budgetary allocation for higher education, the participants emphasized the significance of sustained financial support from provincial governments and urged other provinces to follow suit.\nWith a firm commitment to fiscal prudence, the Vice Chancellors resolved to implement stringent measures aimed at cutting unnecessary expenditure within universities. The proposal to appoint financial experts as Treasurers in universities, instead of officers from the general cadre or faculty members, was also agreed upon.\nThe meeting also highlighted the importance of embracing e-governance solutions to streamline administrative processes, enhance transparency, and facilitate data-driven decision-making.\nAcknowledging the need for diversification in revenue streams, the university heads underscored the importance of exploring novel approaches for resource generation. They emphasized the potential of public-private partnerships, alumni engagement, and other possible initiatives to augment financial sustainability.\nThere was also a consensus on the transformative impact of endowment funds in fostering academic excellence.\nThe participants agreed that the selection process for Vice Chancellors as well as faculty appointment criteria need to be thoroughly reviewed and that it should be aligned with the international best practices. Similarly, there was a consensus on transition towards non-pensionable recruitments in the universities, aimed at mitigating long-term financial liabilities.\nConsidering the challenges being faced by HEC and the universities due to the functioning of two parallel systems of Tenure Track Statutes (TTS) and Basic Pay Scale (BPS) for faculty appointments, the meeting recommended that there is a dire need to develop a standardized performance-based faculty appointment service structure. Under this proposed system, the appointments should be made exclusively through open competition and the performance of the faculty should be evaluated every year for monetary incentives.\nThe participants also acknowledged the fact that the research quality at MS and PhD levels requires special attention.\nThey expressed concern over instances of unethical practices that compromise the validity and credibility of research. They emphasized the importance of robust institutional frameworks for research ethics oversight, stringent anti-plagiarism measures, and programmes to raise awareness about the importance of academic honesty and adherence to ethical standards.\nSimilalrly, the funding mechanism for research initiatives, role of Offices of Research, Innovation and Commercialization (ORICs) and Business Incubation Centers (BICs) for promoting innovation and commercialization, the Triple Helix initiative and categorization of research journals were also extensively discussed.\nThe meeting also debated the new Institutional Affiliation Policy, which aims to uphold academic standards and safeguard future of the students. Likewise, the Vice Chancellors emphasized the need for a comprehensive Trans-national Education (TNE) Policy framework to regulate and promote international collaborations, exchange programmes, and offshore campuses.\nRecognizing the transformative potential of digital technologies in education, the Vice Chancellors emphasized the importance of harnessing digital library resources, research networks, and IT facilities to enhance teaching, learning, and research outcomes.\nAddressing the forum, Dr. Mukhtar Ahmed said that HEC and all other stakeholders of the higher education sector have the shared objective of uplifting the standards of tertiary education and collectively addressing the challenges hindering its progress.\nHe appreciated the role of university heads in the sector’s uplift and termed the universities as beacons of hope for society.\nDr. Zia Ul-Qayyum said that HEC formulates policies in consultation with all the stakeholders and consolidation of such policies and standards is a must for a strong higher education sector.\nDr. Iqrar Ahmad Khan thanked the participants for their proactive involvement in formulating recommendations for the betterment of the higher education sector as well as for their commitment to implement the same at their respective institutions.",
  "retrievedAt": "2025-08-11T01:29:52.051Z"
}
