{
  "title": "Dar advocates “aggressive” financing to developing world for nuclear energy projects",
  "link": "https://www.app.com.pk/national/dar-advocates-aggressive-financing-to-developing-world-for-nuclear-energy-projects/",
  "date_published": "2024-03-22T08:56:00.000Z",
  "source": "APP",
  "content": "BRUSSELS, Mar 22 (APP): Minister for Foreign Affairs Ishq Dar on Friday called for “aggressive” financing by International Financial Institutions and multilateral development organisations for developing countries to help them launch nuclear energy projects.\nThe foreign minister, in a video message after attending the First Nuclear Energy Summit held by the Blegian government and the International Atomic Energy Agency (IAEA), said the developing countries could not benefit from nuclear energy for being costly.\nHe said after hydropower, nuclear energy was considered the safest and most cost-effective energy source that should be utilised by the world, especially the developing countries.\nThe foreign minister said that many leaders at the summit echoed the same sentiments, emphasizing the role of IFIs and multilateral development institutions for financing the projects.\nLauding the Belgian government and the IAEA for holding the summit, he called the event a pleasing development, given Pakistan’s vulnerability to climate change, having already faced immense losses due to the 2022 floods.\nDar said that Pakistan had installed nuclear energy projects of around 3,000MW capacity and the incumbent government was about to initiate work on Chashma Nuclear Plant-V after it was approved by PDM government.\nThe minister also recounted his sideline interactions with the counterparts from Turkiye, UAE and Belgium besides the Chinese Vice Premier and the Director General of the IAEA.\nThe foreign minister particularly lauded Pakistan Ambassador in Brussels Amna Baloch and Aftab Khokhar in Vienna for the active role played by them and their respective teams during the brief visit.",
  "retrievedAt": "2025-08-11T01:30:15.636Z"
}
