{
  "title": "PM, Saudi Fund delegation discuss development projects",
  "link": "https://www.app.com.pk/national/pm-saudi-fund-delegation-discuss-development-projects/",
  "date_published": "2024-03-22T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):A delegation of Saudi Fund for Development (SFD), led by Sultan Bin Abdul Rehman Al Marshad, Chief Executive Officer (CEO), SFD, during its visit to Pakistan called on Prime Minister Muhammad Shehbaz Sharif here on Friday and discussed its ongoing projects in Pakistan.\nThe Prime Minister welcomed the delegation and appreciated the long-standing friendship between the Kingdom of Saudi Arabia and Pakistan and the efforts of SFD for providing financing to Pakistan in the fields of Health, Energy, infrastructure and Education as well the recent floods. The CEO, SFD thanked the Prime Minister and Government of Pakistan for the warm welcome and hospitality as well as the conferment of the National Civil Award, Hilal-e-Quaid-e-Azam.\nThe Prime Minister also appreciated the signing of Financial Agreements, early today, between SFD and the Government of Pakistan worth US$ 107 million for construction of Hydropower stations in AJK, which would not only provide clean energy but would also help eradicate the menace of deforestation, besides providing job opportunities to the local population.\nThe CEO, SFD shared updates with the Prime Minister about the ongoing projects including Mohmand Multi-purpose Hydropower Project, Golan Gol Hydropower Project, Malakand Regional Development Project, and other projects funded through Saudi grants.\nThe Prime Minister, while appreciating the support of the SFD, highlighted the need to expedite the processing of the new projects, shared with SFD, in the field of green energy and infrastructure, which once implemented, would go a long way in the economic revival of the country, besides serving the needs of the local communities.\nThe CEO, SFD assured early processing of the shared projects and also reiterated that the Kingdom of Saudi Arabia, under the leadership of the Royal Family, would extend all possible assistance and continued support to Pakistan. The Prime Minster thanked the CEO and members of the delegation and conveyed his best wishes to all the members of the Royal Family, especially the Khadim-e-Harmain Sharifain.",
  "retrievedAt": "2025-08-11T01:29:49.477Z"
}
