{
  "title": "ECP sets April 2 deadline for by-election postal ballot requests",
  "link": "https://www.app.com.pk/national/ecp-sets-april-2-deadline-for-by-election-postal-ballot-requests/",
  "date_published": "2024-03-22T10:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): The Election Commission of Pakistan (ECP) has set April 2 as the last day to apply for postal ballots for the upcoming by-elections in Punjab, Sindh, Khyber Pakhtunkhwa, and Baluchistan.\nAn ECP spokesman stated that according to the law, this service has been expanded to individuals in government positions, members of the armed forces, their spouses, and their eligible children residing with them, given they are registered voters and typically reside away from their constituency location.\nPeople with physical disabilities who are unable to travel and possess a national identity card with a physical disability logo issued by the National Database and Registration Authority (NADRA) can also vote via postal ballot, the poll body spokesman stated.\nAdditionally, individuals who are detained in prison or held in custody are also eligible to vote by postal ballot.\nThe ECP advised that individuals appointed by the returning officers, including police personnel, to perform duties at polling stations other than where they are eligible to vote, should apply for a postal ballot to the returning officers within three days of their appointment.\nApplications for a postal ballot must be submitted using the designated form to the returning officer responsible for the respective constituency. Additionally, it was mentioned that application forms for postal ballots are available from the respective returning officers and the ECP’s website.\nThe ECP stated that individuals issued postal ballots will not have the right to vote in person at polling stations. Finally, it emphasized that the application must be forwarded and endorsed by the office or department of the voter to prevent unauthorized persons from applying for a postal ballot.\nThe by-elections will be held in 23 constituencies of National and Provincial assemblies, including NA-8 Bajaur, NA-44 Dera Ismail Khan-I, NA-119 Lahore-III, NA-132 Kasur-II, NA-196 Kamber Shahadkot-I, and NA-207 Shaheed Benazirabad-I.\nThe Punjab Assembly constituencies consist of PP-22 Chakwal-Cum-Talagang, PP-32 Gujrat-VI, PP-36 Wazirabad-II, PP-54 Narowal-I, PP-93 Bhakkar-V, PP-139 Sheikhupura-IV, PP-147 Lahore-III, PP-149 Lahore V, PP-158 Lahore-XIV, PP-164 Lahore XX, PP-266 RY Khan-XII, and PP-290 DG Khan-V.\nSindh’s provincial assembly constituencies comprise PS-80 Dadu-I.\nIn Khyber Pakhtunkhwa, assembly constituencies include PK-22 Bajaur-IV and PK-91 Kohat-II.\nBalochistan’s provincial assembly constituencies consist of PB-20 Khuzdar-III and PB-22 Lasbela.",
  "retrievedAt": "2025-08-11T01:29:58.972Z"
}
