{
  "title": "Interior Minister gave deadline to illegal foreigners ‘Leave Pakistan’ by Oct 31st",
  "link": "https://www.app.com.pk/national/interior-minister-gave-deadline-to-illegal-foreigners-leave-pakistan-by-oct-31st/",
  "date_published": "2023-10-03T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 03 (APP): Caretaker Interior Minister Sarfaraz Bugti on Tuesday gave a deadline to all Illegal foreigners in Pakistan to voluntarily leave the country by October 31st or the law enforcement agencies will deport them on November 1st.\nAddressing a press conference after the Apex Committee meeting chaired by the Prime Minister Anwar-ul-Haq Kakar at the Ministry of Interior, Bugti said that no foreigner will be allowed to enter Pakistan on fake documents or no without visa documents.\nHe said, the apex committee meeting decided November 1st as deadline for passport and visa renewal for all foreigners living illegally in Pakistan.\nThere is no country in the world which allows foreigners to enter on any other document then visa but unfortunately, our country is the only one where anyone can come without a passport or visa, said the minster adding that after November 1st, no person, resident of any other country, will be able to enter Pakistan without passport and visa.\nHe said a task force has been constituted in the ministry of interior to dig out the properties of people who illegally entered Pakistan for confiscation and the operation would be started after November 1st.\n“Our intelligence agencies and law enforcement agencies will find them and we will confiscate these businesses and properties, and any Pakistani involved in facilitating them will be punished according to Pakistani law” Bugti said.\nFor Afghan residents the minster said that that the government will be issuing e-tazkira to Afghan citizens from October 10 to October 31, to their convenience.\nThis e-Tazkira will be computerized after which paper Tazkira will not work and after the deadline passport and visa policy will be applicable for them too, said the minster.\nHe said many irregularities were found in the issuance of ID cards and many fake ID card were made and on the basis of those fake ID cards, fake ravel documents and passports were made.\nHe said people on the basis of these fake ID cards and documents travel to foreign countries and in many cases these people were found to be involved in terrorist activities and those caught were not Pakistani citizens but they had Pakistani passports which they got from NADRA.\nIn such a situation, the appointment of an expert military officer as Chairman NADRA is a welcoming step said the minister adding that those involved in illegal issuance of identity cards will also be brought to justice soon.\nHe said that NADRA has a family tree in which it is possible that any one of us can enter the family tree and become a Pakistani citizen.\n“We have got the DNA test facility and we will also conduct DNA test for those who are Pakistani ID card holders but are not Pakistanis, apart from this we are building a web portal and a UAN number, we are encouraging all Pakistanis to contact us through the web portal and this number will give us information regarding illegal identity card, illegal immigrants and will give information regarding illegal activities like smuggling, hoarding” said the minister.\nHe said the name of such whistleblower will be kept confidential and reward money will be kept for them, the Ministry of Interior will give that information to all its departments and they should take immediate action.\nHe said government’s crackdown against illegal business of “Hundi & Hawala” and electricity theft is continued and the government will be more strict on it in coming days’\nHe said that the government will not allow anyone to establish a monopoly against extremism because this power belongs to the state, be it in the name of political extremism, terrorism, nationalism or religion or in any name, violence will not be tolerated.\nIf someone wants to impose their agenda at gunpoint, it will not be allowed and the government will follow the constitution and law, said the minister.\nHe said any group or organization that targets minorities in the name of Islam or against the teachings of Islam, the state not allow any such group to flourish in Pakistan.",
  "retrievedAt": "2025-08-11T09:55:48.372Z"
}
