{
  "title": "Senate body irked over vacant Pakistan’s chairs abroad",
  "link": "https://www.app.com.pk/national/senate-body-irked-over-vacant-pakistans-chairs-abroad/",
  "date_published": "2023-03-28T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):The Senate Standing Committee on Federal Education and Professional Training on Tuesday expressed displeasure over the vacant Pakistan chairs abroad since 2008.\nThe Committee which met here with Irfan-ul-Haque Siddiqui in the chair was apprised that a total of 14 Chairs had been vacant since 2008 under different nomenclatures such as the Quaid-i-Azam Chair and Allama Iqbal Chair, Chairs in Urdu and Pakistan Studies.\nThe Chairman Committee deemed the matter ‘criminal negligence’ and stressed the need for an in-depth probe of the matter, so that those responsible for this apathetic attitude may be taken to task.\nThe Committee was informed that out of the 14 just six Chairs were advertised due to budgetary constraints and the selection process was completed in 2021 wherein a panel of three scholars was selected for Cambridge University.\nThe process was terminated by the University and the Ministry was directed to re-advertise the position as per their set of procedures.\nThe Committee was informed that Chairs for Urdu and Pakistan Studies are currently vacant in China, Egypt, Germany, USA, UK, Turkey, Hong Kong, Iran, Jordan, Nepal and Kazakhhstan.\nThe Committee stressed the need for stringent action against this negligence that has held back the softer side of the country. Deliberating over the matter, Chairman Committee Senator Irfanul Haque Siddiqui directed that the Ministry submit a comprehensive report regarding the issue in the next meeting.\nDiscussing the recent clashes between student groups at Quaid-i-Azam University in light of the briefing by Dr. Niaz Ahmed Akhtar, Vice Chancellor of the said university, the Committee stressed the need to investigate the matter in detail and ensure that the root cause be ascertained.\nChairman Committee Senator Irfanul Haque Siddiqui welcomed the newly appointed Vice Chancellor of Quaid-i-Azam University and assured him of the Committee’s all out support.\nDeeming the need for the revival of Student Unions in Universities, Chairman Committee Senator Irfanul Haque Siddiqui was of the view that grouping must be based related to educational interests and on national heroes in place of ethnicity.\nThis he said would play an important role in diffusing ethnic fault lines and infusing in students a sense of national unity.Chairman Committee Senator Irfanul Haque Siddiqui directed Dr. Niaz Ahmed Akhtar to formulate a Commission and submit a detailed report to the Committee on the causes of the issue and recommendations of ways that it can be curbed.\nThe need for the construction of a boundary wall around the University Campus was stressed by Dr. Niaz Ahmed Akhtar to ensure security. The Committee recommended that a letter be sent to the CDA to submit its report regarding construction of a boundary wall.\nTaking up the matter related to the appointment and posting of junior lady teachers in Public Schools in Islamabad, the Committee condemning the delay in resolving the matter asserted that all out efforts must be made to regularize the teachers that fall in this category.\nIt was recommended that the Ministry of Education should take up the issue once again and approach the Cabinet to reconsider its previous decision so that the matter is reviewed minutely on humanitarian grounds.\nWhile considering the private member bills, the International Islamic University (Amendment) Bill, 2023 was approved with minor amendments.\nThe International Institute of Technology, Culture and Health Sciences Bill, 2022, introduced by Senator Kamran Murtaza and Senator Fawzia Arshad was pended due to further probe of the matter.\nA visit of the facility will be conducted by a three-member committee comprising Senator Rana Maqbool Ahmed(Convener), Senator Fawzia Arshad and a senior member of HEC. A report regarding the matter will be submitted to the Committee within 10 days.\nThe meeting was attended by Senators including Dr. Mehr Taj Roghani, Fawzia Arshad, Rana Maqbool Ahmed, Jam Mahtab Hussain Dahar, Mushtaq Ahmed Khan, Molvi Faiz Muhammad, Kamran Murtaza, Molana Abdul Ghafoor Haideri and Senior officers of the Ministry of Federal Education and Professional Training and HEC.\nChairman HEC, Dr. Mukhtar Ahmed and newly appointed Vice Chancellor Quaid-i-Azam University Dr. Niaz Ahmed Akhtar were present as well.",
  "retrievedAt": "2025-08-11T08:08:32.516Z"
}
