{
  "title": "‘Rule of law’ essential for functioning of democracy in country: CJP",
  "link": "https://www.app.com.pk/national/rule-of-law-essential-for-functioning-of-democracy-in-country-cjp/",
  "date_published": "2023-03-28T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):Chief Justice of Pakistan Justice Umar Ata Bandial on Tuesday remarked that rule of law was essential for democracy to function in the country.\nHe said the “problems may arise if the political temperature remained the same”, adding that “holding elections is also necessary for the functioning of democracy”.\nA five-member bench headed by Chief Justice Umar Ata Bandial heard the petition filed by Pakistan Tehreek-e-Insaf (PTI)\nagainst the delay of elections in the provinces of Khyber Pakhtunkhwa and Punjab.\nAt the outset of the hearing, the new Attorney General of Pakistan Mansoor Usman Awan contested that if the court’s decision [on March 1] was passed by a four-three majority, then there was no order that stood violated.\n“If there is no court order then the president also can’t give the election date,” he said and prayed the court to firstly settle the matter of that order.\nThe chief justice said that the court was hearing the matter only pertaining to the cancellation of the election schedule. The CJP remarked that the two judges had given dissenting notes as per their own opinion but it had no connection with this case.\nThe CJP observed that if the AGP wanted clarification on the judgment of March 1, then they could file a separate petition in this regard.\nThe chief justice remarked that the bench was viewing the questions raised in the petition, adding that the jurisdiction of the top court was not limited to the extent of a petition.\nThe AGP responded that the current case was related to the implementation of the decision dated March 1.\nThe attorney general of Pakistan said that it was an important matter and the court could form a full bench if it considers it appropriate. Justice Mandokhail asked whether the constitution demands elections within 90 days after the dissolution of assemblies and can the Election Commission of Pakistan (ECP) could cancel the polls’ schedule.\nJustice Mandokhail remarked that there was no doubt that now elections couldn’t take place within 90 days. The question was whether this matter could be addressed democratically or not, he said. He asked who was authorized to extend the election date, adding that there was also a question that whether an assembly could be dissolved on the will of one person.\nJustice Jamal Khan remarked that the Parliament should review the law regarding the authority of one person to dissolve the assembly.\nPTI’s lawyer Barrister Ali Zafar said that the parliament could hold a debate on the powers of the prime minister and chief ministers. “The constitution does not grant permission to delay the elections at any cost,” he said.\nJustice Ijaz ul Ahsan remarked that the order of this court had already been implemented by the issuance of the election schedule.\nJustice Mandokhail observed that the ECP had given reasons for not being able to render its constitutional responsibility. What would have happened if the ECP had not announced the date of October 8, he asked.\nJustice Ahsan remarked that the ECP could have approached the president to change the election date if it had solid reasons to convince him.\n“All the institutions and federal authorities are responsible to cooperate with the ECP in implementing the latter’s orders,” he said. He said that the court could pass an order if the elections were not possible in 90 days practically.\nJustice Jamal Khan Mandokhail said that the president had also given an election date. Justice Munib Akhtar remarked that the ECP should have approached the SC if the elections were not possible within the said time period.\nJustice Munib Akhtar observed that if the “ECP can delay the polls for six months then it can also delay it for six years”.\nJustice Mandokhail said the constitution was silent over the authority to delay the elections. Whether the Parliament shouldn’t introduce an amendment regarding this matter, he asked.\nJustice Munib asked that “if there is a matter of funds then how an interim government would be able to issue it”? Justice Ahsan said that whether the “country wouldn’t be facing the same challenges on October 8” if elections were deferred by citing security, and financial issues.\nDuring the hearing, the CJP said that there was no need for a complete budget for it, adding that the “salaries of the judges can be deducted to generate Rs20 billion for the elections”. “The government can also manage Rs20 billion by reducing its expenditures,” he added.\nThe chief justice remarked that the reality of the economic crisis couldn’t be ignored, adding that elections funds could be collected with a “deduction of five percent of salary”. He observed that the “law enforcement agencies of KP have conducted operations against terrorists more than any province, adding that Punjab has done only 61 operations while Sindh did 367”.\nTo a question, Barrister Ali Zafar said that the “ECP can issue instructions to the institutions and federal authorities, and if they refuse to lend support, the ECP can approach the court”.\nMeanwhile, the attorney general argued that there was a target of collecting Rs170 billion in taxes till June 30. The domestic debt had increased due to the rise in interest rates following the demand of the IMF, he said.\nHe said the federation became “financially weak after the 18th amendment of the constitution while the provinces became stronger”. He said that he would apprise the court regarding the financial state of the country.\nPML-N’s lawyer Akram Sheikh said that this court had also expressed willingness to hear the political parties. He prayed the court to make them respondents in this case, adding that how the “court can hear arguments without seeking written answers”?\nThe chief justice remarked that first, the legal points needed to be settled then the court would give the opportunity to the political parties to present their cases.\nJustice Ahsan remarked that it was the “responsibility of the federal government to issue funds for the elections”. Justice Munib said that a “supplementary grant can be issued” as per the constitution.\nThe AGP argued that the matter was related to the “shortage of resources instead of the permissibility in the constitution”.\nThe defence ministry. he said, had stated that security couldn’t be provided due to the current security situation. To a question, he said that maybe the ECP had thought that the tenure of other assemblies would also be completed in October, so the elections could be held simultaneously across the country.\nThe chief justice said that the expenditures were also required for the movement of the army, adding that the country was facing security issues since 1990. The CJP observed that the elections had been taking place “despite the surge of terrorism incidents and for that matter politicians have rendered sacrifices for it”.\nJustice Munib observed the government could “bind the army under article 245 of the Constitution” to extend their support in providing security for holding polls.\nThe AGP recalled that the elections of 1988 were supposed to be held in August but it was held in November due to the death of the then president Ziaul Haq. The then-acting president had announced the new election date, he said. He further said that the ECP itself had announced the date of the election in 2008 after the assassination of Benazir Bhutto.\nThe AGP argued that the government staff was also busy conducting the national census across the country, adding that the number of constituencies may also get changed after it.\nThe attorney general said that the elections would be held on the basis of the fresh census results. He contended that the results of the census would have an impact on the increase/decrease of seats in the national and provincial assemblies in the country.\nThe CJP said that the elections were delayed for only 40 days after the assassination of Benazir Bhutto. He wondered how the “ECP can delay the elections for a long time?”\nThe AGP said the ECP’s decision had been challenged to the extent of only Punjab. However, the matter of governor KP was separately challenged in SC, he added. He said that only the ECP’s lawyers would defend the decision of the electoral body.\nMeanwhile, the court adjourned further hearing of the case till tomorrow.",
  "retrievedAt": "2025-08-11T08:08:32.548Z"
}
