{
  "title": "Ministry rules out possibility in last date extension of Hajj applications",
  "link": "https://www.app.com.pk/national/ministry-rules-out-possibility-in-last-date-extension-of-hajj-applications/",
  "date_published": "2023-03-28T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 28 (APP):The Ministry of Religious Affairs and Interfaith Harmony on Tuesday ruled out the possibility of last date extension for Hajj applications.\nThe Ministry’s Spokesperson Muhammad Umar Butt, talking to APP, urged the aspirant pilgrims to submit their Hajj applications and dues in time.\nGiving a break-up of the Hajj applications, he informed that the ministry had received 44, 621 Hajj applications through designated banks so far.\nHe said it had received 40,313 applications under Government Hajj Scheme while 4,308 applications under Sponsorship Hajj Scheme.\nHe said the designated banks remained open across the country for the collection of Hajj applications and dues to facilitate the intending pilgrims on the weekend.\nOn Saturday, the ministry scored a total of 4,468 Hajj applications of which 3,960 applications were received under the Government Hajj Scheme and 508 under the Sponsorship Hajj Scheme, he said adding that on Sunday the ministry collected a total of 2,679 Hajj applications out of which 2,371 applications received under Government Hajj Scheme while 308 applications under Sponsorship Hajj Scheme.\nUmar Butt further said Meezan Bank had topped by collecting 9,142 Hajj applications including 940 applications under Sponsorship Hajj Scheme to date.\nHe said the overseas Pakistanis could submit a health certificate issued from abroad in the bank or they could furnish a medical fitness certificate before their Hajj flight.\nHe said those who had not yet received the coronavirus vaccine, could also submit the application.\n“However, they will have a full dose of the vaccine and submit the certificate to the banks before their departure to Saudi Arabia. Apart from NADRA [National Database and Registration Authority], a foreign vaccine certificate will also be acceptable,” he maintained.\nHe clarified that it was not necessary for the person sending sponsorship to have a blood relation with the pilgrim. But it was essential to send the name, Computerized National Identity Card number, and contact number of the pilgrim along with the money, he added.\nAccording to other official sources in the ministry, a reduction of Rs.45,000 was expected in the Hajj expenses under the Government Hajj Scheme.\nIf the Pakistani currency did not fall further, the benefit would be transferred to pilgrims by the ministry, they added.\nThey said the ministry was trying to make the Hajj package cheaper as the negotiation with the Saudi government was underway.\nThey said after the reduction, the Government Hajj Scheme for the northern region would be from Rs.1,175,000 to Rs.1,130,000 while it would be from Rs.1,1 65,000 to Rs.1,120,000 for the southern region.",
  "retrievedAt": "2025-08-11T08:08:41.781Z"
}
