{
  "article_id": "2025-04-11_0fcbe975c62fbaa0976e46b3f5a3e62d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/qalam-karwan-hosts-online-session-of-aalmi-halqa-tassawuf-zikr-o-fikr/",
    "retrieved_at": "2025-08-27T14:23:52.077Z"
  },
  "metadata": {
    "title": "Qalam Karwan hosts online session of Aalmi Halqa Tassawuf Zikr-o-Fikr",
    "author": null,
    "date_published": "2025-04-11T16:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 268,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 11 (APP):Qalam Karwan, a renowned literary organization, recently hosted an engaging online session of the \"Aalmi Halqa Tassawuf Zikr-o-Fikr\". This thought-provoking event brought together individuals from diverse backgrounds to explore the realms of spirituality, self-reflection, and personal growth. Through insightful discussions and reflections, the session aimed to foster a deeper understanding of oneself and the world around us. The session was presided over by the renowned legal scholar and expert in Islamic Shariah, Advocate Fareeduddin Masood Burhani (Supreme Court) from Sialkot. The speaker included Allama Muhammad Kashif Noor, a scholar from Al-Azhar University, Cairo, Egypt. He delivered a talk on the topic of \"Love for the Ahl al-Bayt\" (the family of the Prophet Muhammad (PBUH) The esteemed scholar emphasized that love for the Ahl al-Bayt was, by consensus, an integral part of Islamic teachings. He stated that the virtues of the Prophet's family (Ahl al-Bayt) were revealed by Allah Almighty in the holy Qur'an and that their purity and righteousness were testified by divine revelation. He asserted that respect, reverence, and love for the Prophet's family are considered essential to faith, and that without invoking blessings (salutations) upon them, even a noble act of worship like prayer remains incomplete. He shared references from the Qur'an and Hadith, along with incidents from the lives of the Companions-especially the Rightly Guided Caliphs-that were filled with deep love for the Ahl al-Bayt at the end of the his session. Participants from across the country and even from abroad attended this online session. A question-and-answer segment followed, along with comments from the audience. The session concluded after the presidential address.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}