{
  "article_id": "2025-04-11_baf6a4f1c3b9a93fe23b4fc3a3b2319a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-regrets-opposition-walkout-quorum-pointing/",
    "retrieved_at": "2025-08-27T14:25:10.306Z"
  },
  "metadata": {
    "title": "NA Speaker regrets opposition walkout, quorum pointing",
    "author": null,
    "date_published": "2025-04-11T09:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 260,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 11 (APP):Speaker National Assembly Sardar Ayaz Sadiq on Friday expressed regret over the opposition's walkout and the subsequent pointing out of quorum during the session. He said most of the questions on the day's agenda were submitted by opposition members, making their absence all the more unfortunate. \"It is disappointing that the opposition chose to walk out during proceeding when was discussing important national issues,\" he added. Referring to recent discussions in the House, the Speaker said that 30 members had participated in a debate on water canals earlier, while most opposition parties-except JUI-were absent on that day. He clarified that the Pakistan People's Party (PPP) had submitted a resolution on canals issue on April 7, and the matter was discussed in detail on same day. However, another similar resolution was again submitted by the opposition on April 10. Addressing broader concerns raised by opposition parties, Ayaz Sadiq said that those who frequently speak out on issues such as Palestine and border security often fail to show up when these matters are scheduled for debate in the House. \"It is regrettable that the opposition distances itself from the Parliament's core responsibilities,\" he added. Due to a lack of quorum, Deputy Speaker Syed Ghulam Mustafa Shah adjourned the session until Monday at 4 PM. Earlier, the sitting-chaired by Speaker Ayaz Sadiq-started but was interrupted when Iqbal Afridi of the Sunni Ittehad Council pointed out the lack of quorum. A headcount followed, and although the session was briefly suspended for 30 minutes, it was later adjourned due to insufficient attendance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}