{
  "article_id": "2025-04-11_b3357a7da31508c670b3bfdcf0febc05",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dr-bakht-rawan-appointed-as-new-head-of-mass-communication-department-at-aiou/",
    "retrieved_at": "2025-08-27T14:24:43.643Z"
  },
  "metadata": {
    "title": "Dr. Bakht Rawan appointed as new head of Mass Communication Department at AIOU",
    "author": null,
    "date_published": "2025-04-11T10:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 203,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 11 (APP):Prof. Dr. Nasir Mahmood, Vice Chancellor Allama Iqbal Open University has appointed Dr. Bakht Rawan, a senior faculty member and Associate Professor in the Department of Mass Communication, as the new head of the department. The appointment has been made under the university's transparent and merit-based policy and is being regarded as a significant and positive step towards the promotion of academic, research, and professional activities. Dr. Bakht Rawan possesses decades of extensive experience in teaching, research, and practical journalism. He has been serving as an Associate Professor in the Department of Mass Communication and is also fulfilling additional responsibilities as Director of Public Relations with great dedication and efficiency. Entrusting him with the leadership of the department is a recognition of his academic excellence, professional competence, strong commitment to the institution, and unwavering integrity. It is expected that under his leadership, the Department of Mass Communication will reach new academic horizons and achieve greater heights in research. Faculty members, researchers, and administrative officials of the university have extended their heartfelt congratulations to Dr. Bakht Rawan on his new role and have termed his appointment a welcome development that will play a pivotal role in the progress of the department.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}