{
  "article_id": "2025-04-11_3efdfad6981bf125b6483ce66a53b38e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/talal-lauds-security-forces-intelligence-for-eliminating-high-value-target/",
    "retrieved_at": "2025-08-27T14:24:03.505Z"
  },
  "metadata": {
    "title": "Talal lauds security forces, intelligence for eliminating high-value target",
    "author": null,
    "date_published": "2025-04-11T12:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 218,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 11 (APP): The Minister of State for Interior Talal Chaudhry Friday praised the intelligence and armed forces for their successful operation, highlighting the government's commitment to combating terrorism, following the elimination of high-value target Kharji Hafeezullah. The intelligence department's ability to gather and analyze critical information played a pivotal role in the success of this operation,\" Chaudhry said while talking to a private news channel. \"Their expertise in surveillance, intelligence gathering and analysis enabled our armed forces to plan and execute a precise and effective strike,\" he further added. He said, 'This war is Pakistan's war, and every day is a step closer to success.\" He said the Pakistani government and security forces are jointly standing against terrorism and will soon eliminate this menace, showcasing their united front and determination to ensure national security and stability. He highlighted that the security forces are engaged in a massive effort, conducting around 150 to 180 operations daily, showcasing their relentless pursuit of combating terrorism and ensuring national security. Responding to a query, the minister replied that Pakistan's government and security forces are committed to combating terrorism, despite facing challenges from neighbouring countries that allegedly fund and support extremist groups. Minister Talal Chaudhry emphasized the nation's collective resolve against terrorism, stating that every day brings them closer to success.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}