{
  "article_id": "2025-04-11_7b68dcc7c16521ec418afd4e0e3ac47e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/belarus-offers-to-host-150000-skilled-pakistani-workers-pm/",
    "retrieved_at": "2025-08-27T14:24:20.842Z"
  },
  "metadata": {
    "title": "Belarus offers to host 150,000 skilled Pakistani workers: PM",
    "author": null,
    "date_published": "2025-04-11T11:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 386,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "MINSK, Apr 11 (APP): Prime Minister Shehbaz Sharif on Friday said that Belarus had extended a generous offer to invite over 150,000 young, highly skilled Pakistani workers to contribute to the nation-building efforts of Belarus. Calling it a \"gift\" for the people of Pakistan, the prime minister expressed deep gratitude for the opportunity, highlighting that this initiative will not only benefit the Belarusian economy but also provide meaningful livelihoods to Pakistani youth. \"I assure you that the skilled Pakistani workforce, duly certified both by international standards and through national accreditation, will serve as a valuable asset to Belarus,\" the prime minister said while speaking at a joint press stakeout with President of Belarus Aleksandr Lukashenko. Recalling the visit of Aleksandr Lukashenko to Pakistan in 2015-16, the prime minister said this visit laid the foundation of long journey of friendship and cooperation in areas of mutual interests. The prime minister expressed the government's interest in benefiting from the experience of Belarus in various areas especially the agriculture. \"Pakistan is an agrarian country and 65% population reside in rural areas. We need your expertise to increase our per acre yield by utilizing the modern methodologies in the sector,\" he said adding that Pakistan needed to have joint ventures between Pakistan and Belarus companies. \"The companies from both Pakistan and Belarus will have a win win situation in this regard.\" The prime minister also highlighted the Belarusian expertise in manufacturing equipments of mining sector, saying that Pakistan had mineral deposits worth of trillions of dollars and both countries could become great partners in this sector. President of Belarus Aleksandr Lukashenko on the occasion emphasized the importance his country placed on fostering strong ties with Pakistan. He said that Belarus attached great significance to its relations with Pakistan and looked forward to deepening cooperation on multiple fronts. Welcoming the Pakistani premier, President Lukashenko highlighted the potential for expanding bilateral collaboration in diverse sectors, including trade, industry, agriculture, and technology. He expressed confidence that the high-level engagement would pave the way for long-term strategic partnership and mutual growth. The president noted that the visit of PM Shehbaz Sharif would serve as a catalyst for opening new avenues of cooperation between the two nations. He stressed the need to explore untapped areas of partnership and to build upon the existing friendly relations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}