{
  "article_id": "2025-04-11_e8df513aa821a3de8ca3aecaf950a691",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-railways-ensures-hygienic-food-for-passengers-through-surprise-inspections/",
    "retrieved_at": "2025-08-27T14:23:55.116Z"
  },
  "metadata": {
    "title": "Pakistan Railways ensures hygienic food for passengers through surprise inspections",
    "author": null,
    "date_published": "2025-04-11T15:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 400,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 11 (APP): Railway Food Safety Teams conducted joint inspections at Rawalpindi and Lahore railway stations under the special directives of Federal Minister for Railways Muhammad Hanif Abbasi, as part of a broader initiative to ensure passengers nationwide receive clean, hygienic, and high-standard food during their travels. At Rawalpindi Railway Station, inspections were carried out across 15 food premises, including 4 restaurants, 3 food points/tea stalls, and 8 tuck shops. The checks were conducted jointly by the Potohar Food Safety Team along with the Divisional Superintendent of Railways Rawalpindi and his team. The overall hygiene standards at these locations were deemed satisfactory, and all staff members possessed valid medical fitness certificates. However, the inspection identified several areas requiring improvement: some workers were wearing jewelry during food handling, dishwashing was being performed using the unhygienic dip method, and food items were improperly stored on newspaper sheets. Based on these observations, the following recommendations were issued: jewelry should not be worn during food handling, only plain white paper should be used for food placement, utensils must be washed under running water, covered dustbins should be used, and food items must be properly covered to prevent contamination. While the tuck shops were also found to be maintaining satisfactory hygiene standards with no expired items reported, improvements were suggested, including ensuring traceability of all food purchases, avoiding placement of food in direct sunlight, and establishing a clearly marked 'Expiry Section' at each shop. At Lahore Railway Station, a joint inspection was carried out by the Punjab Food Authority and Railway officials. The inspection covered hygiene conditions, food quality, and expiration dates of edible items. During the inspection, three food stalls faced heavy fines, one stall was sealed, unauthorized items were confiscated, and expired food products were immediately discarded on-site. Divisional Medical Officer Dr. Saima Mumtaz and Divisional Commercial Officer Ghulam Fareed Asad accompanied the Punjab Food Authority team during the inspection. Authorities emphasized that the sale of substandard food items will not be tolerated, and repeated violations may result in contract termination of the concerned vendors. Federal Minister Muhammad Hanif Abbasi expressed satisfaction with the inspection campaign and reiterated that such efforts will continue in phases across all railway stations nationwide. He reaffirmed the Ministry's commitment to providing safe, hygienic food and ensuring the highest standards of cleanliness for passengers. He added that ensuring passenger well-being remains the top priority of Pakistan Railways.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}