{
  "title": "Noor Qadri hails religious leaders’ role for supporting govt on Coronavirus",
  "link": "https://www.app.com.pk/national/noor-qadri-hails-religious-leaders-role-for-supporting-govt-on-coronavirus/",
  "date_published": "2020-03-18T23:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP):Minister for Religious Affairs and Interfaith Harmony Sahibzada Noor-ul-Haq Qadri Thursday appreciated the role of religious leaders and appealed them to increase more awareness about hygiene and healthy behaviors among nationals to keep the virus at bay.\nTalking to private news channel , as part of government’s preventive measures against the novel coronavirus (Covid-19), religious minister urged citizens and worshipers to avoid physical contact and practice good hygiene following the Covid-19 in the country.\n“This is the time to show resilience and get closer to God,” he added.\nHe said,”The religious leaders can play an important role to spread awareness regarding Covid-19, adding, it is appreciable that religious leaders are cooperating with the government and following its advisories regarding religious gatherings and daily prayers.”\n“The Coronavirus can only be defeated with unity and integrity,” he mentioned.\n“Government want a secure and healthy future for our new generation and it could be achieved through a cooperation from our religious leadership in the awareness campaigns, we request and urged the Ulema to play their due role in controlling the spread of disease”, minister said.\nHe further said spreading the Islamic message of cleanliness being half the faith needed to be spread.\nHe said that frequent hand washing should be encouraged by everyone and social gatherings should be avoided under the present circumstances.\nMinister said that practical steps have been taken against the hoarding of masks and other medical equipment. He said the government was also focusing on the training of doctors and other paramedical staff.",
  "retrievedAt": "2025-08-11T18:58:30.173Z"
}
