{
  "title": "Unified educational system to equip students to cope with modern day’s challenges: PM",
  "link": "https://www.app.com.pk/national/unified-educational-system-to-equip-students-to-cope-with-modern-days-challenges-pm/",
  "date_published": "2020-03-19T10:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP):Prime Minister Imran Khan on Thursday said the aim behind enforcement of unified educational curriculum was to equip the young generation to cope with challenges of technological age and to instill in them social values that highlighted distinct national character.\nThe prime minister said this while chairing a high-level meeting to review progress on the implementation of unified educational curriculum across the country. The meeting was attended by Minister for Education and Professional Training Shafqat Mahmood, secretary education and high officials.\nPrime Minister Imran Khan emphasized that the teachings of Holy Prophet Hazrat Muhammad (Peace Be Upon Him), guidelines of Father of the Nation Quaid-e-Azam Muhammad Ali Jinnah and philosophy of Allama Muhammad Iqbal should be made part of the curriculum. He also highlighted that the curriculum should cater to the needs of modern times.\nThe prime minister directed that the mafias’ role should be eliminated during publication of unified curriculum textbooks. He assured full support of the Federal Government in implementation of the uniform education system in the country.\nThe meeting was told that the present class-based education system had not only divided the educational institutions, education standard, teachers and students but it had also created a system based on the whole social and economic structure, which was serving the interests of a particular class. The system was creating a diverging mind-set in the society, which had caused a divided national consciousness and psyche.\nThe meeting was informed that the present government after coming into power formed the National Curriculum Council, comprising representatives from all the federating unites, besides famous personalities from the private sector and religious seminaries.\nIt was briefed that implementation of the unified curriculum for educational institutions and its evaluation had remained one of the important elements of the Pakistan Tehreek-e-Insaf’s election manifesto. The rationale behind the decision was to eliminate the disparity between curriculum, facilities, mediums of instruction, teachers and students’ performance, which had resulted into differing mindsets causing a fractured national psyche.\nWorking groups were also established wherein technical input was provided by a dedicated team of professionals and subject specialists. World renowned educational assessment institutions including Cambridge, Agha Khan University’s Institute of Educational Development and LUMS also contributed to formulation of evaluation systems.\nThe prime minister was apprised that under Phase-I, unified curriculum for class one to 5th had been developed and its implementation would be completed by March 2021. Phase-II curriculum for Class 6th to 8th would be ready by March 2021 and implemented by March 2022, while Phase-III curriculum for Class 9th to 12th would be ready by March 2022 and enforced by March 2023.\nThe prime minister was told that among extensive stakeholders’ consultations, four-day workshops were conducted in all the provinces in which more than 400 experts participated including “Itehad Tanzeem-ul-Madaris”.\nHe was also briefed regarding measures taken in wake of COVID-19 for educational institutions. It was informed that special educational transmission of seven hours duration, in collaboration with Pakistan Television, had been arranged to be broadcast so that students could continue education at home.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:58:25.657Z"
}
