{
  "title": "JUI leader among 3 killed by landmine in Balochistan’s Kalat: provincial govt spokesperson - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Jamiat Ulema-i-Islam (JUI) leader was among three people killed on Thursday when their vehicle drove over a landmine in Balochistan’s Kalat district, according to provincial government spokesperson Shahid Rind.\n\nBalochistan and Khyber Pakhtunkhwa have faced increasing attacks by militants and terrorists.\n\nIn a statement, Rind said that three people were killed and five people were injured in the incident.\n\n“A private vehicle hit a landmine in the Chori Bur Kaputo area of ​​​​Kalat,” Rind was quoted as saying. “Levies personnel reached the scene and carried out rescue operations.\n\n“JUI leader and ward councillor Abdullah is among the deceased,” the government spokesperson added.\n\nAccording to Rind, the government condemned the “terrorist incident” and added that the injured have been transported to the District Headquarters Hospital in Kalat.\n\n“The incident is being investigated. The law and order situation will be ensured at all costs,” the spokesperson added.\n\nThree policemen were martyred and at least 16 others were injured on April 15 as a blast targeted a vehicle of the Balochistan Constabulary on Mastung district’s Dasht Road.\n\nMilitant violence and security operations intensified in the country in March, with the number of militant attacks surpassing 100 for the first time since November 2014, according to a report by the Pakistan Institute for Conflict and Security Studies.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/04222224c231bdd.jpg?r=222400",
  "retrievedAt": "2025-08-25T14:32:30.182Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906342/jui-leader-among-3-killed-by-landmine-in-balochistans-kalat-provincial-govt-spokesperson",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T18:53:10.000Z"
}
