{
  "title": "Held Kashmir attack timed to defame Pakistan: leaders - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Asif says Pakistan will respond to any Indian aggression ‘in befitting manner’\n• Insists India can’t suspend Indus Waters Treaty unilaterally\n• PPP says all indications point to a ‘false flag operation’ by India\n• PTI says Imran, his party ‘firmly stand with armed forces’\n• AJK leaders term attack ‘sinister ploy’ by Indian agencies\n\nISLAMABAD / MUZAFFARABAD: As the Indian government severed diplomatic and other links with Pakistan over the Pahalgam attack, Pakistan’s mainstream political parties on Wednesday branded the attack in Indian-occupied Kashmir a “false flag operation” desig­ned to malign Islamabad internationally.\n\nThey also believed that India’s aggression and illegal occupation of Kashmir had resulted in the Pahalgam attack.\n\nThe armed attack on tourists in the Pahalgam town left 26 people dead. The incident occurred amid a high-level visit by US Vice President J.D. Vance to India.\n\nSenator Irfan Siddiqui, parliamentary leader of the PML-N in the Senate, termed the incident a “well-planned conspiracy” aimed at defaming Pakistan.\n\nSpeaking to the media, he said India had a history of staging such incidents whenever a foreign dignitary visits the country. “The Pahalgam drama was orchestrated deliberately during the US Vice President’s visit to India to serve their propaganda objectives against Pakistan,” he added.\n\nDefence Minister Khawaja Asif said the Indian government should first thorou­ghly investigate the incident before levelling false allegations against Pakistan.\n\nHe noted India’s decades-long military presence in held Kashmir and its rights violations were fuelling unrest. He also alleged Indian involvement in terrorism inside Pakistan, including the recent Jaffar Express attack in Balochistan.\n\nAs it is feared that India could attack Pakistan against the backdrop of the Pahalgam incident, Mr Asif said: “Pak­istan is capable of responding to any In­­dian aggression in a befitting manner.”\n\nTalking to a private TV channel, the minister said that India’s suspension of the Indus Waters Treaty — that allows for sharing the waters of the Indus River system between the two countries — is a violation of international laws. “India cannot take unilateral decisions regarding the Indus Waters Treaty,” he said. “We will give a comprehensive re­­sponse to India after holding the Nat­ional Security Committee’s meeting, which is being called on Thursday (today).”\n\nPunjab Information Minister Azma Bokhari also warned in a video statement that any “misadventure by India under the pretext of a false-flag operation will have dire consequences”.\n\nCondemning the “shocking terror attack”, PPP Senator Sherry Rehman said, “Unfortunately, the reflexive finger-pointing already at play against Pakistan has become the boilerplate response for a New Delhi that was unable to contain its own spectacular failures amidst a fundamentalist meltdown.”\n\nRegarding India’s decision to suspend the Indus Waters Treaty, she said India could not suspend the treaty unilaterally.\n\n“Stridency-on-steroids is not a foreign policy,” she said, adding that all indications of the Pahalgam attacks go towards a “false flag operation” of India.\n\nJUI-F chief Maulana Fazlur Rehman also strongly criticised attempts to link Pakistan with unrest in Indian-occupied Kashmir, calling such accusations “baseless” and asking India to introspect on its internal failures instead of blaming its neighbour. “It’s convenient for India to blame Pakistan, but that doesn’t change the ground realities,” he said.\n\nPTI also denounced the attack, describing terrorism as a “shared enemy of the civilised world”. In its statement, the PTI warned that any adventurism against Pakistan would be met with a united national response, reaffirming support for the armed forces. “Founding Chairman Imran Khan and PTI firmly stand with the armed forces and the people in their inalienable resolve to blunt any such aggression by the Indian government against Pakistan,” it added.\n\nFormer minister Saad Rafique condemned Indian media’s atte­mpt to blame Pakistan for the attack “without any evidence”. Majlis Wahdat-i-Muslimeen chief Alla­­ma Raja Nasir expressed condolences, called for dialogue for regional peace and warned that escalating tensions could endanger South Asia’s stability.\n\n‘Sinister ploy’\n\nIn Azad Jammu and Kashmir (AJK), political and resistance leaders unanimously condemned the Pahalgam attack, terming it a sinister ploy by Indian agencies to discredit the Kashmir freedom struggle and falsely implicate Pakistan.\n\nExtending condolences and sympathy to the families of the victims, they called for international accountability to bring the real culprits to justice, while making it clear that no amount of violence could shake the Kashmiri people’s resolve for their right to self-determination.\n\nIn his statement, AJK President Bar­rister Sultan Mahmood Chaudhry called the massacre “condemnable,” accusing the Narendra Modi-led regime of staging another false flag operation, especially timed with the visit of US Vice President J.D. Vance to India, and likened it to India’s habitual blaming of Pakistan, as seen after the 2019 Pulwama incident.\n\nAJK Information Minister Pir Mazhar Saeed maintained the “Pahalgam false flag operation had flopped even before the script could unfold.”\n\nThe AJK chapter of the All Parties Hurriyat Conference (APHC) echoed similar concerns. “We firmly believe Indian agencies are involved in this heinous act… to destabilise the region and malign the peaceful freedom movement,” said APHC convener Ghulam Muhammad Safi.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/24091853534ebe4.jpg",
  "retrievedAt": "2025-08-25T14:33:18.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906207/held-kashmir-attack-timed-to-defame-pakistan-leaders",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:20:40.000Z"
}
