{
  "title": "Infant dies, seven hurt as water tanker hits van in Karachi’s Gulshan-i-Hadeed - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: An infant boy was killed while seven others, including six women, were injured when a water tanker hit a van in Gulshan-i-Hadeed on Wednesday evening, police and rescue services officials said.\n\nSteel Town SHO Alan Khan Abbasi told Dawn that the heavy vehicle hit the van near Aljannat marriage hall.\n\nThe killed child was identified as one-and-a-half-year-old Sahil Naeem. The injured were Asif Barkat, 30, Bakhtawar Faisal, 17, Erum, 26, Aziza Ghazi Khan, 50, Kamala Husain, 50, Sakeena Naeem, 35, and Naeema, 22.\n\nThe officer said that the accident occurred apparently due to speeding. However, the police were further investigating the case.\n\nThe SHO claimed that the driver responsible for the incident was arrested and the tanker seized.\n\nThe body and injured were shifted to the Jinnah Postgraduate Medical Centre.\n\nPolice Surgeon Dr Summaiya Syed told Dawn that the condition of two women was critical as they had sustained serious injuries.\n\nMeanwhile, police on Wednesday claimed to have arrested a man and his daughter for their alleged involvement in a robbery case.\n\nCentral SSP Zeeshan Shafiq Siddiqi said the New Karachi police arrested a suspect who used his daughter to snatch a motorcycle at gunpoint. He added that they were arrested with the help of CCTV footage.\n\nThe suspect was identified as Bilal Siraj and his daughter as Shumaila.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:33:02.787Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906139/infant-dies-seven-hurt-as-water-tanker-hits-van-in-karachis-gulshan-i-hadeed",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:21:03.000Z"
}
