{
  "title": "NA panel voices alarm over water availability, related risks - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Committee chairman notes agriculture, once contributing 35pc to Pakistan’s GDP, now accounts for only 20pc\n• Directs Ministry of National Food Security to present comprehensive 20-year roadmap\n\nISLAMABAD: The National As­­sembly Standing Committee on National Food Security and Resea­rch on Wednesday has expressed concern over the declining per capita water availability, rapid population growth, and the impact of climate change factors which are posing significant threats to national food security.\n\nThe committee meeting under the chairmanship of Syed Tariq Hussain directed the Ministry of National Food Security to present a comprehensive 20-year roadmap at the next meeting together with clear targets, plans, deadlines and implementation strategies.\n\nDespite major investments, the declining yields in major crops like cotton, wheat and rice were labelled as a failure by the ministry and the Pakistan Agricultural Research Council (Parc) with ineffective seed research identified as a core issue.\n\nThe ministry was asked to submit a performance report on Parc over the past decade within one month, identifying those responsible for poor outcomes and any disciplinary actions taken.\n\nThe ministry was also instructed to ensure the distribution of imported seeds across all provinces, accompanied by proper awareness campaigns and cultivation in controlled environments to assess yield variations and achieve a competitive advantage.\n\nRana Muhammad Hayat Khan, convener of the sub-committee, submitted a report regarding the sale of counterfeit seeds and delays in wheat procurement and import. The committee agreed to forward the report’s recommendations to the ministry for immediate implementation.\n\nAccording to the ministry, lice­nses of 392 out of 1,200 registered seed companies have been cancel­led. A Radio-Frequency Identifi­cat­ion (RFID) track-and-trace system has been introduced to enhance transparency in seed sales. The committee demanded that accountability measures be extended not only to fraudulent companies but also to officials responsible for their registration.\n\nThe committee resolved to invite officials of the newly formed National Seed Development and Regulatory Auth­ority to its next meeting for a progress update. Legal action, the pan­el emphasised, must be taken against those selling counterfeit seeds.\n\n“Just issuing challans is not enough,” the committee stated.\n\nThe committee also recommen­ded the announcement of a minimum support price to safeguard farmers from exploitation by middlemen. Additional measures incl­uded compensation for farmers, educational campaigns, enforcement of penalties — including up to 10 years’ imprisonment — development of heat-resistant seeds, improvement in sowing methods, and enhanced quality testing.\n\nA complete ban on wheat import and export was also proposed.\n\nThe ministry briefed the committee on the Punjab government’s introduction of an Electronic Warehouse Receipts (EWRs) system. Under this initiative, farmers can store their crops for up to four months with financial backing from private banks, while the government subsidises 50pc of the loan mark-up, enabling farmers to wait for favourable rates rather than being forced to sell.\n\nInter-provincial and inter-district movement of crops has also been permitted to improve market access, officials said. During the briefing, the ministry also presented updates on wheat-related research through its affiliated research institutes. The committee’s chairman noted that agriculture — once contributing 35 per cent to Pakistan’s GDP — now accounts for only 20pc.\n\nA ministry official reported that wheat yield per acre has increased from 27 to 33 maunds over the past decade. However, the committee deemed the progress insufficient.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/240924416b83159.jpg",
  "retrievedAt": "2025-10-12T02:42:03.934Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906205/na-panel-voices-alarm-over-water-availability-related-risks",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:20:40.000Z"
}
