{
  "title": "‘Sindh Katcha area specialist’ to combat gangs in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government has appointed a grade-19 police officer of Sindh in one of the ‘troubled’ districts of south Punjab – Rahim Yar Khan – to combat the hardened criminals.\n\nThere were reports that Irfan Somro had served the Kashmore-Kandhkot as SSP, a district plagued by violent crimes.\n\nHe was given a chance to lead the district police recognising his deep understanding of intelligence-led policy against the notorious gangs operating in the Katcha belt of upper Sindh, particularly in Kashmore.\n\nThe Sindhi officer was recommended by a senior police officer serving against a key position in Punjab as ‘the best choice’ to hit the criminals of the Katcha areas of Rahim Yar Khan keeping in view his past experience.\n\nOn Tuesday, Mr Somro replaced Rahim Yar Khan District Police Officer (DPO) Rizwan Omer Gondal who was given the chance twice to lead the district police keeping in view the ability to fight hardened criminals.\n\nAs per the reports, the Punjab government has changed many times the command of the district police to fight against the Katcha area criminals.\n\nIt has provided long-range weapons, bullet-proof vehicles and other logistic support to the Rahim Yar Khan police to eliminate the criminals.\n\nDuring the police operation in 2024, reportedly, over 70 criminals were allegedly killed while 19 police officials were martyred in Rahim Yar Khan.\n\nAn official privy to the development said the government abandoned the past practice of making appointments of the police officers serving in Punjab.\n\nIn a recent meeting, he said, it took a final decision to launch the first Sindhi police officer as head of the Rahim Yar Khan police force.\n\nMr Somro was among 10 officers who were transferred and posted as DPOs and against other positions across Punjab.\n\nThe official said the appointment of the police officer from Sindh came under discussion in many references when it transpired that additional IG of recently raised Crime Control Department (CCD) Punjab Sohail Zafar Chatha introduced him (Mr Somro) to Chief Minister Maryam Nawaz as a brave cop for fighting criminals of riverine belt of Sindh.\n\nAbout other postings, he said, grade-19 police officer Hassan Iqbal was posted as DPO Bahawalpur vice Asad Sarfraz Khan.\n\nMr Khan was transferred as he had got promotion to the rank of DIG, he said adding that Mohammad Afzal, another grade-19 officer, was transferred and posted as DPO Vehari against an existing vacancy.\n\nSimilarly, the Punjab government transferred grade-18 police officer retired Capt Mohammad Ajmal and posted him as DPO Mianwali vice Akhtar Farooq.\n\nFaisalabad Investigation SSP Ali Bin Tariq was transferred and posted as DPO Lodhran vice Kamran Mumtaz who was transferred and posted as investigation branch Punjab SSP.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:32:37.298Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906259/sindh-katcha-area-specialist-to-combat-gangs-in-punjab",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T04:10:21.000Z"
}
