{
  "title": "Criminals, individuals on Fourth Schedule to wear tracking devices: Punjab Home Dept - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Punjab Home Department on Thursday announced that habitual criminals and individuals whose names are included in the Fourth Schedule will wear tracking devices and will be monitored round the clock.\n\nIncluding a name in the Fourth Schedule under the Anti-Terrorism Act (ATA) means the person concerned has become a proscribed person. Restrictions impo­sed on such persons include passport embargo, freezing of bank accounts, a ban on financial support and credit, arms licence embargo, and employment clearance restrictions.\n\nToday’s meeting was chaired by Punjab Home Secretary Noorul Amin Mengal and attended by Special Home Secretary Home Fazlur Rehman, Additional Inspector General (IG) of Crime Control Department Sohail Zafar Chatha, Deputy IG Operations Punjab Waqas Nazir, Additional Secretary Police Dr Zeeshan Hanif and other relevant officers of the law and treasury departments.\n\n“To monitor criminals and maintain law and order, the Punjab Home Department took a historic decision, mandating habitual criminals and individuals on the Fourth Schedule to wear tracking devices,” a statement from the Punjab Home Department said.\n\nIt said that tracking devices will be provided to the Counter-Terrorism Department (CTD), Parole Department, and Crime Control Department.\n\n“The Punjab Home Department is initially distributing 1,500 tracking devices to law enforcement agencies, of which 500 tracking devices will be given to the recently formed Crime Control Department, 900 to the CTD, and 100 to the Parole Department.\n\n“The movement of those wearing tracking devices will be monitored 24/7,” the statement said.\n\nMengal has directed relevant authorities to import tracking devices equipped with modern technology for the second phase.\n\n“Globally, accepted methods will be adopted to keep criminals under surveillance.\n\n“It should be noted that experts have recommended implanting micro-tracking chips in the bodies of criminals for uninterrupted surveillance,” the statement said.\n\nIn July 2023, Punjab police unveiled an artificial intelligence-powered “facial recognition system” aimed at enhancing accountability, reliability, and efficiency in tracing and apprehending suspects and wanted criminals.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:32:29.735Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906316/criminals-individuals-on-fourth-schedule-to-wear-tracking-devices-punjab-home-dept",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T13:21:24.000Z"
}
