{
  "title": "3,171 complaints of tech-facilitated gender-based violence reported in 2024: DRF - Pakistan - DAWN.COM",
  "author": null,
  "content": "A total of 3,171 complaints of tech-facilitated gender-based violence (TFGBV) were received from across the country in 2024, the Digital Rights Foundation (DRF) said in a press release on Thursday.\n\nA large number of women in the country across all age groups and classes continue to face violence and endure sexual, mental, and physical abuse despite improvements in education, according to a 2023 report by the United Nations Population Fund (UNFPA).\n\nThe rising number of such cases shows that society is still falling short of actively safeguarding women.\n\nAccording to the foundation’s eighth annual report, the helpline received a total of 3,171 complaints from across the country in 2024 alone.\n\nThe helpline addresses TFGBV and other online harms throughout the week, from 9am to 5pm, “with holistic support services that prioritise gender-sensitivity, confidentiality, accessibility and psychosocial wellbeing”, the press release said.\n\nAccording to the report, the largest number of calls that were received by the foundation was in May, a total of 386 reports. March and July also had a higher number of cases reported, with 312 and 354, respectively.\n\nCyber harassment was the most reported type of case, with a total number of 2,741, the report said, of which only 36 per cent of the “cases originated from cities where a Federal Investigation Agency cybercrime wing is operational”.\n\nJournalists and minorities were also targeted, with a total number of 121 and 124 cases, respectively, reported.\n\nAdults between the ages of 18 and 30 were the most targeted group according to age, with a total of 1,774 cases reported.\n\nAccording to the report, Punjab continued to report the highest number of cases, 2,277, reflecting both the province’s larger population and greater awareness of the helpline.\n\nSindh reported the second highest number of cases with a total of 301.\n\nIn terms of the breakdown of cases by gender, the report said, a total of 1,772 cases were reported by women, whereas 1,365 cases were reported by men.\n\nAccording to the press release, the helpline received an average of 264 new cases every month.\n\nIt said, “Given that survivors face considerable logistical, financial and cultural barriers when seeking redressal, and women survivors even more so, this lack of accessibility must be addressed to ensure equitable access to justice.”\n\nIt highlighted the evolving nature of digital threats among the populace and the security regime that is ill-equipped to navigate them.\n\nDRF Executive Director Nighat Dad noted that it was incumbent upon the state and platforms to responsibly tackle AI-related harms to create safer online spaces: “In a time where AI and automation are hailed as the future, it’s important to remember that trust, safety and digital security are deeply contextual.”\n\n“Cultural nuance, emotional intelligence, and lived experience cannot be programmed. Tech companies and state actors must recognise the limits of automation–this is not a space for cost-cutting at the expense of human safety,” Dad was quoted as saying in the press release.\n\nThe data indicated that women were disproportionately targeted through non-consensual intimate images (NCII) and image-based abuse (IBA), “with 85pc of NCII cases and 81pc of IBA cases recorded targeting women to coerce, blackmail or inflict reputational damage”.\n\n“The report further highlighted an alarming 51pc jump in cases involving children and youth under the age of 18 this year compared to cases in 2023,” the press release said.\n\nAccording to the helpline’s manager Hyra Basit, “Certain communities and professions are disproportionately vulnerable to coordinated digital hate campaigns, doxxing, harassment and misogynistic abuse, but these groups often lack institutional protection, making the Digital Security Helpline’s role ever more critical.”\n\nThe report recommended policymakers to “adopt consistency and clarity when introducing changes to Peca legislation and enforcement; invest in digital literacy initiatives to address TFGBV; bridge the digital gender divide to enable women to access the Internet freely; integrate gender-sensitive training for LEAs; strengthen data protection laws to safeguard citizens’ digital security and privacy; and support digital rights advocacy by civil society groups.”\n\nIn its recommendation to LEAs, the press release called on it to include “enhancing accessibility, increasing financial and technical capacity, ensuring survivors’ confidentiality, implementing a case tracking system, and providing much-needed psychological support services”.\n\nAccording to a ‘Mapping Gender-Based Violence (GBV) 2024’ report released by the Sustainable Social Development Organisation, conviction rates for gender-based violence in Pakistan were extremely low.\n\nIn Punjab, domestic violence cases stood at 1,167, with just three convictions, whereas Khyber Pakhtunkhwa totalled 446 cases of domestic violence, but no convictions were recorded.\n\nSindh registered 375 cases of domestic violence, but no justice was served in terms of convictions.\n\nBalochistan had the highest conviction count among all provinces for the category, with 25 convictions out of 160 cases.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/04/242248235070f6a.png",
  "retrievedAt": "2025-08-25T14:32:28.956Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906339/3171-complaints-of-tech-facilitated-gender-based-violence-reported-in-2024-drf",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T18:32:26.000Z"
}
