{
  "title": "Trump slams Harvard as funding fight heads to court - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump on Thursday bashed Harvard as an “anti-Semitic, far left institution”, as the prestigious university battles his administration’s funding freeze in court.\n\nSince returning to the White House, Trump has sought to bring several universities to heel over claims they tolerated anti-Semitism on their campuses, threatening their budgets, tax-exempt status and the enrollment of foreign students.\n\nBut Harvard has refused to bow, and on Monday filed suit against the Trump administration.\n\nThe lawsuit calls for a funding freeze and conditions imposed on federal grants to be declared unlawful, arguing the measures amount to political interference aimed at compromising the Ivy League institution’s independence.\n\n“The place is a liberal mess,” Trump wrote on his Truth Social platform, also complaining that it has admitted students “from all over the world that want to rip our country apart”.\n\nHis broadside came a day after he issued an executive order targeting higher education, upending how federal authorities decide which universities and colleges can access billions of dollars from certain grants and student loans.\n\nThe executive order seeks to clamp down on what Trump brands “unlawful discrimination” — that is, any measures that seek to promote the representation of “racial and ethnic minority individuals”.\n\nTrump and his White House team have publicly justified their campaign against universities as a reaction to what they say is uncontrolled “anti-Semitism” and a need to reverse diversity programmes aimed at addressing historical oppression of minorities.\n\nThe administration claims protests against Israel’s military campaign in Gaza that swept across US college campuses last year were rife with anti-Semitism.\n\nMany US universities, including Harvard, cracked down on the protests over the allegations at the time, with the Cambridge-based institution placing 23 students on probation and denying degrees to 12 others, according to protest organisers.\n\nHarvard President Alan Garber said that Trump’s administration had launched “numerous investigations” into the university’s operations.\n\nTrump’s claims about diversity tap into long-standing conservative complaints that US university campuses are too liberal, shutting out right-wing voices and favouring minorities.\n\nIn the case of Harvard, the White House is seeking unprecedented levels of government control over the inner workings of the country’s oldest and wealthiest university — and one of the most respected educational and research institutions in the world.\n\nHarvard has rejected the government’s supervision demands, prompting the Trump administration to freeze $2.2 billion in funding.\n\nIn Wednesday’s executive order, Trump decreed that “American students and taxpayers deserve better, and my Administration will reform our dysfunctional accreditation system so that colleges and universities focus on delivering high-quality academic programmes at a reasonable price.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/242148113330726.jpg",
  "retrievedAt": "2025-08-25T14:32:30.803Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906337/trump-slams-harvard-as-funding-fight-heads-to-court",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T16:52:16.000Z"
}
