{
  "title": "Pahalgam attack - Newspaper - DAWN.COM",
  "author": null,
  "content": "IN the aftermath of Tuesday’s militant attack on tourists in India-held Kashmir’s Pahalgam area, South Asia once again stands on a knife’s edge.\n\nDisplaying a knee-jerk reaction to the tragedy, in which over 25 people were killed, the Indian foreign secretary has highlighted the alleged “cross-border linkages of the terrorist attack”, dragging Pakistan into this deplorable episode.\n\nNew Delhi has responded by suspending the Indus Waters Treaty, which has survived wars and periods of tension, further downgrading diplomatic relations, and closing the Attari border crossing. Pakistan, which had initially expressed concern and condolences over the attack, will calibrate its response today, as the prime minister has convened a meeting of the National Security Committee to review the situation.\n\nThe assault has been claimed by ‘The Resistance Front’, a hitherto unknown entity; media reports have quoted the outfit as claiming the attack to protest against demographic changes in the disputed region. This is probably the biggest attack targeting civilians in IHK in 25 years. Defence Minister Khawaja Asif has termed the assault as a possible “false flag operation”. No cause can justify the targeting of innocent non-combatants, and the incident must be roundly condemned.\n\nHowever, India must also look inwards and review its brutal rule in held Kashmir, which has bred immense discontent. And when all peaceful avenues for a just resolution to the Kashmir dispute are blocked, it is not surprising that some inside the occupied territory take up guns to express their anger. Ever since doing away with the disputed region’s limited autonomy in August 2019, the BJP-led government has pretended that ‘all is well’ in IHK. That is not the case. Even voices within India are questioning the government’s claims of having established calm. For example, India’s opposition leader, Rahul Gandhi, has asked the rulers to move beyond “hollow claims” of peace in occupied Kashmir.\n\nGenuine peace can only come to Kashmir — and the rest of South Asia — when this nearly eight-decade-old dispute is resolved as per the wishes of the Kashmiris, with buy-in from Pakistan and India. If the Hindu nationalist government in New Delhi thinks it can stamp out all peaceful calls for freedom and justice through brute force and intimidation, then there will be no end to blood-soaked episodes.\n\nThe tragic events in Pahalgam should serve as a wake-up call for India’s rulers: if they want peace in IHK, and peace between Pakistan and India, then sincere efforts must be made to resolve the Kashmir question at the negotiating table, involving the Kashmiris as well as Pakistan.\n\nFrom here, Pakistan must proceed with caution and prepare a calm yet firm response to India’s allegations, and threats. While de-escalation is the preferred course of action, India should also know that any misadventure will be met by Pakistan resolutely.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:42:25.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906230",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:27:26.000Z"
}
