{
  "title": "Reforms needed to ensure sustainable growth: Aurangzeb - Business - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Finance Minister Muhammad Aurangzeb on Wednesday said that the country has achieved economic stability through “tough decisions and ongoing economic reforms over the past year”, emphasising that the objective was not stabilisation alone but “sustainable and inclusive growth”.\n\nHe was speaking at a forum hosted by the Centre for Global Development (CGD) during the IMF-World Bank Spring Meetings.\n\nIn a separate engagement on the sidelines of the meetings, the finance minister met Sultan bin Abdulrahman Al-Murshid, the top official at the Saudi Fund for Development (SFD), and requested expedited disbursements under the Saudi oil facility.\n\nThe facility, agreed earlier this year, enables Pakistan to defer up to $1.2 billion in oil import payments, providing vital support for the country’s foreign reserves during its fragile economic recovery.\n\n“The minister requested expedited disbursements under the Saudi oil facility and assured the provision of evidence of oil shipments,” the finance ministry said in a statement.\n\nAt the CGD forum, Mr Aurangzeb underscored his government’s commitment to structural reforms. “Reforms in taxation, privatisation, energy, governance and other sectors will continue with full commitment,” he said.\n\nHe stressed the importance of increasing exports and foreign investment: “To move our economy forward, we must increase exports and attract foreign investment into export-oriented sectors.”\n\nMr Aurangzeb also explained the rationale behind overhauling the country’s tax policy: “To broaden financial resources, our top priority is to reduce reliance on the manufacturing sector and salaried class and bring other sectors into the tax net.”\n\nOn international trade, Mr Aurangzeb said that a “high-level Pakistani delegation will visit the United States for constructive talks on tariff issues”.\n\nHe also welcomed the “strong participation of the US delegation in the minerals and mining conference held in Pakistan two weeks ago”, calling it “encouraging” and reflective of the direction of future economic and trade relations.\n\nMr Aurangzeb also participated in the 13th Ministerial meeting of the Coalition of Finance Ministers for Climate Action (CFMCA), where he delivered a statement emphasising that “the country was developing a Climate Prosperity Plan (CPP) and Climate Finance Strategy”.\n\nSeparately, Mr Aurangzeb also met with Moody’s commercial team in Washington, DC, where he briefed them on Pakistan’s macroeconomic outlook.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:32:49.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906238/reforms-needed-to-ensure-sustainable-growth-aurangzeb",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:38:24.000Z"
}
