{
  "title": "Our friend Sabeen - Newspaper - DAWN.COM",
  "author": null,
  "content": "IN March, the founder of OpenAI, Sam Altman, announced his company had trained a new model that was “good at creative writing”. It was asked to write a metafictional literary short story about AI and grief.\n\nThe AI produced a technically correct piece of writing; writers and proponents of AI debated its literary merit and its usefulness to humanity for a week on social media. In my opinion, the piece was devoid of human emotion, merely a paean to the cleverness of machines and those who build them.\n\nBut the person who would have been able to give the most considered view because she was as great a humanist as she was a tech evangelist, was not available for comment. She had died 10 years ago, and all of us who loved her are still grieving her loss.\n\nSabeen Mahmud was killed on this day in 2015. She was the founder of Karachi’s cultural centre The Second Floor; she led a social and cultural renaissance in a country pulverised by political and ethnic violence and suffocated by religious intolerance. In a city where it was often difficult to breathe, the Second Floor was where breathing was not just encouraged, it was mandatory — along with thinking. Perhaps this kind of haven is hard to imagine today, when everyone has the world on a computer in their pocket.\n\nBut Sabeen lived in a moment when we were not encouraged to think for ourselves or express our individuality. This was the early 2000s, when dictatorship was benevolent and moderation was enlightened. Under the platitudes festered the same hard hatred and extremism that has shaped our country ever since its inception.\n\nAlthough Sabeen’s murder was a great shock, it was no surprise that the person who robbed our friend of her life was an educated man, who adopted the guise of a man of faith with the soul of a killer. We Pakistanis live and die by our hypocrisies and contradictions. We take cover in the grey spaces that exist between the black and white of right and wrong. We think that by fulfilling the technicalities of morality, we can dupe God.\n\nKilling someone is allowed if it is done in the name of the right ‘cause’. This was the bargain Sabeen’s killer made with the devil: it stole Sabeen, just like thousands of Pakistanis with hopes, dreams, aspirations, everything they could have achieved and contributed, experienced and enjoyed, unfulfilled, incomplete.\n\nSabeen was someone this country needed then and now.\n\nSabeen accomplished a great deal in the short 40 years she lived on this planet. Everyone who knew her has a different story to tell about her optimism, her courage, her encouragement, her empathy. It’s important that we pass on that knowledge to others who didn’t know her, and who may not have even heard of her. This especially applies to young people, who Sabeen loved to guide and support, who are looking for role models and real-life inspiration. They can’t find it in our society among those they interact with every day.\n\nInstead, they find it on a phone screen, written by an influencer, or a machine. What Sabeen gave us all, far more valuable than any money or assets, was hope that we could change for the better in whatever we aspired to do and be. She was an activator of dreams, a catalyst for action, a living example of love and solidarity.\n\nIf it were up to me, I would rewrite the history books to include Sabeen’s name among those we revere. I would award her the Sitara-i-Imtiaz posthumously, so that her contribution to Pakistan would be properly recognised by each and every citizen of this nation. I would name roads and schools after her. I would write her name in the sky every year on her birthday. She would probably not have wanted any of those accolades; she would have found them cumbersome and strange. She would still deserve them. Sabeen was someone this country needed then, and now more than ever: a mentor and a friend, not necessarily in that order.\n\nI may not be as eloquent as an AI machine, but I do think often about grief when it comes to remembering Sabeen. Losing her brought me face to face with how it feels to lose a loved one — heavy, hopeless, unmoored from everything I thought was certain in this world, anchored to the temporality of our physical bodies, unable to escape the finality of our mortal end.\n\nI miss her terribly — her laugh, her smile, her irritations, her craziness. I would not want to resurrect her with AI, as is the fad these days in those strange ghostly clips which re-animate dead celebrities; I’ll leave resurrection up to the Divine.\n\nWhat I will do, though, is use my human gifts — remembrance, emotion, longing, love — to evoke the memories of what Sabeen was like, as a revolutionary and as a friend. And I’ll use my abilities as a writer — a human one — to make sure you know all about her too, long after both of us are gone.\n\nThe writer is an author. Her latest novel is The Monsoon War.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6809afce20129.jpg",
  "retrievedAt": "2025-10-12T02:42:54.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906231",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:29:10.000Z"
}
