{
  "title": "12 US states sue over Trump’s tariffs - World - DAWN.COM",
  "author": null,
  "content": "A coalition of 12 American states filed a lawsuit on Wednesday to challenge the Trump administration’s tariffs, saying the president cannot institute the levies without the approval of Congress.\n\n“[US President Donald Trump]’s insane tariff scheme is not only economically reckless — it is illegal,” Arizona Attorney General Kris Mayes said in a statement.\n\nThe southwestern state is joined by Democratic-led Minnesota, New York, Oregon and others in the filing. Separately, California filed a similar suit a week ago.\n\nTrump has sent markets into tumult in his second term, turning decades of free trade policy on its head with his “Liberation Day” announcements of new tariffs against numerous countries.\n\nTrump has imposed an additional 145 per cent import duties on China, and Beijing responded with its own 125pc tariffs on US goods. On Wednesday, Trump told reporters he’s working on a “fair deal with China”.\n\nMeanwhile, he has imposed 10pc tariffs on other trade partners — and he is threatening more punishing levies.\n\nIn the lawsuit filed Wednesday, the states argue that the 1977 law invoked by Trump does not allow him to use emergency measures to impose tariffs, a power constitutionally reserved for Congress.\n\n“By claiming the authority to impose immense and ever-changing tariffs on whatever goods entering the United States he chooses, for whatever reason he finds convenient to declare an emergency, the president has upended the constitutional order and brought chaos to the American economy,” the lawsuit alleges.\n\nTrump has said his protectionist policy will return manufacturing jobs to the United States.\n\n“No matter what the White House claims, tariffs are a tax that will be passed on to Arizona consumers,” Mayes said.\n\nOn Wednesday, The New York Times reported that Trump’s approval rating has fallen steadily during his first three months in office, hitting a low of 44pc this week.\n\nDemocrats are seizing the opportunity to illustrate how his policies are hurting pocketbooks.\n\nLast week, California Governor Gavin Newsom called Trump’s tariff policy “the worst own-goal in the history of this country”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:32:35.724Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906297/12-us-states-sue-over-trumps-tariffs",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T08:01:42.000Z"
}
