{
  "title": "Trade, ties and flights off-limits as Pakistan retaliates to India’s moves - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan on Thursday announced the suspension of trade and the closure of airspaces with India, among other moves, as it retaliated to New Delhi’s slew of aggressive measures against the country in the wake of a deadly attack in India-held Kashmir.\n\nThe attack took place in Pahalgam, a tourist hotspot in India-occupied Kashmir that draws thousands of visitors every summer. Gunmen opened fire on visitors, killing at least 26 people — all men from across India except one from Nepal — and injuring 17 others. It was the region’s deadliest attack on civilians since 2000. A hitherto unknown group, named by several Indian outlets as ‘The Resistance Front’, is said to have claimed responsibility for the attack.\n\nAmong India’s actions was the unilateral move to suspend the 1960 Indus Waters Treaty, which was brokered by the World Bank and has endured through wars and decades of hostility.\n\nPakistan made the retaliatory decisions during a meeting of the National Security Committee (NSC) in Islamabad today, convened to formulate a response to India. Chaired by Prime Minister Shehbaz Sharif, the meeting was attended by top government and military officials, including the defence minister, foreign minister, interior minister, national security adviser, and the chiefs of armed forces, among others.\n\nAccording to a statement issued by the Prime Minister’s Office (PMO), the participants of the meeting discussed the national security environment and the regional situation, particularly in the wake of the Pahalgam attack.\n\n“Expressing concern over the loss of tourists’ lives, the committee reviewed the Indian measures announced on 23rd April 2025 and termed them unilateral, unjust, politically motivated, extremely irresponsible and devoid of legal merit,” the statement added.\n\nThe full text of the statement can be read here.\n\nWhat we know so far:\n\nThe NSC announced a series of measures in retaliation to the “reckless and irresponsible behaviour of India, which disregards international conventions, UN Security Council Resolutions and international obligations at will”.\n\nPakistan also announced closing the Wagah Border with India.\n\n“Pakistan shall exercise the right to hold all bilateral agreements with India including but not limited to Simla Agreement in abeyance, till India desists from its manifested behaviour of fomenting terrorism inside Pakistan; trans-national killings; and non-adherence to international law and UN Resolutions on Kashmir,” the PMO statement said.\n\n“Pakistan shall close down the Wagah Border Post, with immediate effect. All cross-border transit from India through this route shall be suspended, without exception,” the NSC decided, giving an April 30 deadline to those who crossed with “valid endorsements” to return through that route.\n\n“Pakistan vehemently rejects the Indian announcement to hold the Indus Waters Treaty in abeyance,” the PMO statement said, noting the pact was a binding international agreement that contained no provision for unilateral suspension.\n\n“Water is a vital national interest of Pakistan, a lifeline for its 240 million people and its availability will be safeguarded at all costs,” the NSC stressed.\n\n“Any attempt to stop or divert the flow of water belonging to Pakistan as per the Indus Waters Treaty and the usurpation of the rights of lower riparian will be considered as an Act of War and responded with full force across the complete spectrum of national power.”\n\nAs done by India, Pakistan also suspended all visas under the Saarc Visa Exemption Scheme (SVES) issued to Indian nationals and deemed them cancelled with immediate effect, except for Sikh religious pilgrims.\n\nSikh devotees regularly travel to Pakistan to offer religious rituals under the 1974 Pakistan-India Protocol on Visits to Religious Shrines, under which Pakistan issues 3,000 visas every year.\n\n“Indian nationals currently in Pakistan under SVES are instructed to exit within 48 hours, less Sikh pilgrims,” it added.\n\nPakistan also declared the Indian defence, naval and air advisers in Islamabad persona non grata, directing them to leave “immediately but not later than 30 April 2025”. In diplomacy, a persona non grata is a foreign diplomat who is asked by the host country to be recalled to their home country.\n\n“These posts in the Indian High Commission are deemed annulled. The support staff of these advisers are also directed to return to India,” it said, stating that the strength of the Indian High Commission in Islamabad will be reduced to 30 diplomats and staff members from April 30.\n\nIn another step, Pakistan announced the closure of its airspace to all India-owned or Indian-operated airlines with immediate effect.\n\nPakistan further announced the suspension of “all trade with India, including to and from any third country through Pakistan”.\n\nThe NSC underscored that Pakistan and its armed forces “remain fully capable and prepared to defend its sovereignty and territorial integrity against any misadventure, as clearly demonstrated by its measured yet resolute response to India’s reckless incursion in February 2019”, the PMO statement added.\n\n“The Pakistani nation remains committed to peace, but will never allow anyone to transgress its sovereignty, security, dignity and their inalienable rights,” the country’s top leadership asserted.\n\nOn the recent allegations by India, the NSC said: “In the absence of any credible investigation and verifiable evidence, attempts to link the Pahalgam attack with Pakistan are frivolous, devoid of rationality and defeat logic.”\n\nIt added that Indian “attempts to inject volatility in the environment along Pakistan’s eastern borders are aimed at distracting Pakistan’s counterterrorism efforts”.\n\n“India’s worn-out narrative of victimhood cannot obfuscate its own culpability in fomenting terrorism on Pakistan’s soil, nor can it distract attention from its systematic and state-sponsored oppression and human rights violations” in occupied Kashmir, the statement said.\n\n“Any threat to Pakistan’s sovereignty and to the security of its people will be met with firm reciprocal measures in all domains,” it warned.\n\nThe NSC also recalled “India’s state-sponsored extraterritorial assassinations” reported widely previously, vowing to “pursue all those responsible, planners and perpetrators alike”, involved in those.\n\nThe committee called on India to “refrain from its reflexive blame game and cynical, staged managed exploitation of incidents like Pahalgam to further its narrow political agenda”.\n\nIt added that such tactics served only to “inflame tensions and obstruct the path to peace and stability in the region.”\n\n“Extremely irresponsible warmongering Indian state-controlled media, fueling volatility in the regional calculus is reprehensive [sic], which requires serious introspection,” it noted.\n\nMeanwhile, New Delhi’s foreign ministry announced today that all Pakistani citizens in India must leave the country by April 29.\n\n“In the wake of the Pahalgam terror attack, the Government of India has decided to suspend visa services to Pakistani nationals with immediate effect,” AFP reported.\n\n“All Pakistani nationals currently in India must leave India before the expiry of visas, as now amended.”\n\nIt will not impact Pakistani diplomats in New Delhi, although their numbers were reduced by Indian orders a day earlier.\n\nA day ago, India shut borders, downgraded diplomatic ties and, in an unprecedented move, unilaterally announced the suspension of the Indus Waters Treaty (IWT) over what the BJP government and media claimed — without offering any evidence — was Islamabad’s alleged support for cross-border terrorism.\n\nToday, Indian and international media, quoting India-held Kashmir’s Anantnag Police, reported that two of the suspected attackers were Pakistani and belonged to the banned Lashkar-i-Taiba (LeT).\n\nAccording to the Indian publication The Wire, India’s Congress Working Committee (CWC) on Thursday adopted a resolution in the wake of the Pahalgam attack, saying that “questions must be raised” on Indian intelligence failures and security lapses.\n\nThe committee also questioned Modi’s BJP for “exploiting this grave tragedy through official and proxy social media platforms to sow further discord”. It also followed the Indian government’s narrative and accused Pakistan of “masterminding” the attack.\n\nAccording to the Hindustan Times, Congress leader Rahul Gandhi said today that the opposition extended its full support to the government.\n\n“Everyone condemned the Pahalgam terrorist attack. The opposition has given full support to the government to take any action,” Gandhi told the media after an all-party meeting.\n\nCongress President Mallikarjun Kharge said all parties condemned the dastardly attack and that efforts should be made to maintain peace.\n\nWhipping up rhetoric against Pakistan, Aam Aadmi Party MP Sanjay Singh said: “We have demanded that accountability needs to be fixed and action should be taken as to why there was a security lapse.”\n\nPakistan has denied any role in the attack and offered condolences for the loss of lives.\n\nOn Thursday morning, Indian media reported that the Modi-led regime had blocked the Pakistani government’s X account in the country and summoned the Pakistani charge d’affaires in New Delhi.\n\nIndia further downgraded diplomatic ties by closing down the main border transit point, framing the attack as a grave provocation that warranted significant diplomatic, economic, and logistical pressure on Pakistan.\n\nOn the other hand, India has summoned Saad Ahmad Warraich, the top Pakistani diplomat in New Delhi, the Hindustan Times reported on Thursday, citing sources.\n\nAmid rising tensions, India has withheld access to the official X account of the Government of Pakistan, NDTV reported.\n\nIndia’s PM Narendra Modi has also called for a multi-party meeting with opposition parties to brief them on the government’s response to the attack.\n\nDeputy PM Dar, appearing on Dunya TV late last night, had lashed out at India’s approach, calling it “immature” and “hasty”.\n\n“India has not given any evidence. They have not shown any maturity in their response,” Dar said. “This is a non-serious approach. They started creating hype immediately after the incident.”\n\nDiplomatic observers warn that the Indian response and Pakistan’s counter-messaging could push bilateral relations to new lows, further widening a rift that has persisted since the 2019 Pulwama-Balakot crisis. The treaty suspension, in particular, risks sparking long-term water disputes, while the downgrading of diplomatic ties could hinder any future de-escalation efforts.\n\nAnalyst Michael Kugelman said the attack posed a “very serious risk of a new crisis between India and Pakistan, and probably the most serious risk of a crisis since the brief military conflict that happened in 2019”.\n\nKugelman called India’s actions “highly consequential retaliations”, highlighting that “in 2019, India threatened to suspend IWT but didn’t follow through”.\n\nPakistan’s Foreign Office had yesterday expressed concern and condolences over the loss of tourists’ lives. The Indian government had vowed that a “loud and clear” response would be delivered to the attack.\n\nTuesday’s attack is seen as a setback to what Modi and his Hindu nationalist Bharatiya Janata Party have projected as a major achievement in revoking the special status occupied Jammu and Kashmir enjoyed and bringing peace and development to the long-troubled Muslim-majority region.\n\nPower Minister Sardar Awais Leghari said suspending the water treaty “in haste and without regard for its consequences amounts to water warfare”.\n\nIn a statement issued by the Ministry of Power Division, the minister said: “India’s reckless suspension of the Indus Waters Treaty is an act of water warfare; a cowardly, illegal move. Every drop is ours by right and we will defend it with full force — legally, politically and globally”.\n\nFederal Minister for Water Resources Mian Moeen Wattoo said India could not take a unilateral decision on the IWT because it had the endorsement of international organisations.\n\nWattoo asserted that Pakistan would not succumb to “external pressure and any aggression from the Indian side would be responded to in a befitting manner”, according to a statement carried by the Associated Press of Pakistan.\n\nFormer railways minister Khawaja Saad Rafique noted that India took the measures “without proof or evidence”, terming the move “sad and unwise”.\n\n“The Indus Waters Treaty is not just an agreement between Pakistan and India, it was arbitrated by the World Bank and it has international guarantees,” he said in a televised statement.\n\nHe added: “It would have been better if they (India) had any evidence, they should have brought it forward or taken it to an international forum, but levelling allegations like this does not suit any government.”\n\nRafique highlighted that either of the two sides cannot unilaterally suspend the pact. “For a long time, Indian leaders were trying to break free from the treaty but this could not be possible,” he said.\n\n“By disrupting the treaty, India has fanned the flames of tensions in the region,” the former minister noted.\n\nMaleeha Lodhi, Pakistan’s former ambassador to the US, also highlighted that the move was not under the treaty.\n\n“This is always the stance India takes whenever such incidents happen. Without any investigation or evidence, they single out Pakistan as the culprit,” she told Geo News.\n\nShe stressed that the defence minister had clarified that Pakistan had “nothing to do with the attack”.\n\n“Indian media is calling for revenge and military action, which in my opinion will be extremely dangerous,” she warned.\n\nMeanwhile, in India, Modi vowed to punish all those responsible.\n\n“I say to the whole world: India will identify, track and punish every terrorist and their backer,” he said today in his first speech since Tuesday’s attack in the Himalayan region.\n\n“We will pursue them to the ends of the Earth”, he added, without naming any entity.\n\nModi, who was speaking in Bihar state to launch development projects, first led two minutes of silence in memory of those killed.\n\n“I say this unequivocally: whoever has carried out this attack, and the ones who devised it, will be made to pay beyond their imagination”, he said, speaking in Hindi in front of a large crowd.\n\n“They will certainly pay. Whatever little land these terrorists have, it’s time to reduce it to dust. The willpower of 1.4 billion Indians will break the backbone of these terrorists.”\n\n“Terrorism will not go unpunished,” Modi said. “Every effort will be made to ensure that justice is done.”\n\nHe finished his speech with rare comments in English, directing them to an audience abroad.\n\nHundreds of Pakistanis joined protests across the country on Thursday, including in Kashmir, to rage against Indian threats following the Pahalgam attack.\n\n“If India wants to go to war, then come forward openly,” businessman Ajmal Baloch told AFP at a protest called by a religiopolitical party and attended by around 700 people in Lahore.\n\nHowever, protesters, including Baloch, raged against the “unacceptable” threat.\n\n“Water is our right and, God willing, we will reclaim it, even if that means through war. We will not back down,” 25-year-old Muhammad Owais said.\n\nAround 300 people brandishing placards carrying anti-India slogans marched through the city of Muzaffarabad in Azad Kashmir.\n\n“If India makes the mistake of attacking, the Pakistani Kashmiris will fight on the frontline, we’re ready to die for Pakistan,” said Shoukat Javed Mir, a senior PPP leader of the region.\n\nIn Quetta, around 150 people staged a protest.\n\nIn a related development, supporters of the political party Pakistan Markazi Muslim League (PMML) took to the streets in Islamabad and Lahore in protest against India’s suspension of the IWT.\n\nPlacards said India’s suspension of the treaty was “cruelty and crime”. Other banners described it as a “declaration of war”.\n\nSeparately, dozens of protesters gathered outside the Pakistan embassy in New Delhi’s diplomatic enclave today, shouting slogans and pushing against police barricades.\n\nThe announcement of punitive measures came after Tuesday’s meeting of India’s Cabinet Committee on Security (CCS), chaired by PM Narendra Modi.\n\nAmong the measures, the CCS said the Attari border checkpoint was closed; Pakistanis in India under the Saarc Visa Exemption Scheme (SVES) had 48 hours to leave the country, while others could return by May 1; defence personnel at the Pakistani High Commission in India had a week to leave the country and staff at the high commissions would be reduced as well.\n\n“The CCS was briefed in detail on the terrorist attack on 22 April 2025 in Pahalgam, in which 25 Indians and one Nepali citizen were killed. Several others sustained injuries. The CCS condemned the attack in the strongest terms and expressed its deepest condolences to the families of the victims and hoped for the early recovery of the injured,” Foreign Secretary Vikram Misri told a press conference after the CCS meeting.\n\nThe statement said: “Recognising the seriousness of this terrorist attack, the CCS decided upon the following measures,” detailing how the Indus Waters Treaty of 1960 will be held in abeyance “with immediate effect, until Pakistan credibly and irrevocably abjures its support for cross-border terrorism”.\n\n“The Integrated Check Post Attari will be closed with immediate effect. Those who have crossed over with valid endorsements may return through that route before May 1, 2025,” it said.\n\nAdditionally, Pakistani nationals will not be permitted to travel to India under the Saarc visa scheme. “Any SVES visas issued in the past to Pakistani nationals are deemed cancelled. Any Pakistani national currently in India under SVES visa has 48 hours to leave India.”\n\nFurthermore, defence attaches and advisers at the Pakistani High Commission in New Delhi were declared ‘Persona Non Grata’ and given a week to leave India.\n\n“India will be withdrawing its own Defence/Navy/Air Advisers from the Indian High Commission in Islamabad… The overall strength of the High Commissions will be brought down to 30 from the present 55 through further reductions,” Misri said.\n\nThe statement also said that security forces had been put on high alert. “As with the recent extradition of Tahawwur Rana, India will be unrelenting in the pursuit of those who have committed acts of terror, or conspired to make them possible,” the foreign ministry statement said, referring to a suspect in the 2008 Mumbai attacks.\n\nIn the wake of a search operation launched by India yesterday, students from occupied Kashmir have reported harassment and intimidation in other cities, AFP quoted a student association as saying.\n\nKashmiri students in states including Uttarakhand, Uttar Pradesh and Himachal Pradesh were allegedly asked to leave their rented apartments or university hostels yesterday, Jammu and Kashmir Students Association convenor Nasir Khuehami said.\n\nAt a university in Himachal Pradesh, students were harassed and physically attacked after hostel doors were broken, Khuehami said.\n\nThe students were allegedly called “terrorists”, he added.\n\n“This is not just a security issue”, he said. “It is a deliberate and targeted campaign of hate and vilification against students from a particular region and identity”.\n\nIn Uttarakhand’s capital Dehradun, around 20 students fled to the airport yesterday following warnings from Hindu Raksha Dal, a fringe right-wing group.\n\nThe students said that the group threatened Kashmiri Muslim students with dire consequences if they did not leave town at the earliest.\n\nA day ago, India’s Defence Minister Rajnath Singh vowed a swift response to those who carried out and planned the Pahalgam attack.\n\n“Those responsible and behind such an act will very soon hear our response, loud and clear,” Singh said in a speech in New Delhi, a day after the attack.\n\n“We won’t just reach those people who carried out the attack. We will also reach out to those who planned this from behind the scenes on our land.” Singh did not identify those he believes are responsible for the killings, but said that “India’s government will take every step that may be necessary and appropriate”.\n\nA hospital list verified by police recorded 26 men who were killed on Tuesday afternoon, when gunmen burst out of forests at a popular tourist spot in Pahalgam, and raked crowds of visitors with automatic weapons. All those killed were listed as residents of India, except one man from Nepal.\n\nSeparately, an encounter was reportedly underway bet­ween Indian security forces and suspected militants in the Tan­gmarg area abutting Pah­algam, at the time of going to press.\n\nIn a separate incident in Baramulla on Wednesday, the army killed two people after a “heavy exchange of fire”, saying the gunmen were part of an “infiltration bid”, AFP reported.\n\nAdditional reporting by Anushe Engineer\n\nHeader image: An Indian paramilitary trooper patrols on the shores of Dal Lake in occupied Srinagar on April 24, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/241414218115e3f.jpg",
  "retrievedAt": "2025-08-25T14:32:35.369Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906284/trade-ties-and-flights-off-limits-as-pakistan-retaliates-to-indias-moves",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T06:47:23.000Z"
}
