{
  "title": "Russia allows Taliban to have ambassador in Moscow - World - DAWN.COM",
  "author": null,
  "content": "MOSCOW: Russia said on Wednesday it will allow the Taliban authorities in Afghanistan to have an ambassador in Moscow, in a symbolic move days after it lifted a “terrorist” designation for the group.\n\nMoscow has taken steps to normalise relations with the Taliban administration since the group seized power in Afghanistan in 2021 after the withdrawal of US troops. The Russian foreign ministry said Russian officials had held talks with Afghanistan’s foreign and internal ministers.\n\n“The representatives of the Afghan leadership were informed that, following the decision announced by the Supreme Court of Russia to suspend the ban on the Taliban movement, the Russian side has decided to upgrade the diplomatic mission of Afghanistan in Moscow to the level of ambassador,” it said in a statement. It added the Afghan side “expressed their deep gratitude for this step”. Russia sees a potential economic partner in the Taliban authorities, who praised Moscow for scrapping the “terrorism” label last week.\n\nTaliban officials have visited Russia for high-profile events in recent years. Russia’s decision to suspend the ban on the group does not equal a formal recognition for the Taliban authorities, which are seeking international legitimacy.\n\nRussian Foreign Minister Sergei Lavrov said on Wednesday that “the new authorities in Kabul are a reality”. “We need to take this into account in order to carry out pragmatic, not ideologised policy,” the minister told journalists. The Afghan government is not officially recognised by any country or world body and the United Nations refers to the administration as the “Taliban de facto authorities”.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/180832485bfe999.jpg?r=083408",
  "retrievedAt": "2025-08-25T14:33:03.887Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906189/russia-allows-taliban-to-have-ambassador-in-moscow",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:20:57.000Z"
}
