{
  "title": "Sindh protests take a toll on national supply chain - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Fertiliser makers sound alarm; ministry warns against possible fallout if urea doesn’t reach farmers during peak Kharif season\n• Industry stakeholders urge govt to resolve issue as soon as possible\n\nLAHORE / KARACHI: The national fertiliser supply chain is facing severe disruptions as ongoing sit-ins and road blockades in Sindh have choked critical transport routes, stranding thousands of trucks and halting industrial operations.\n\nThe blockades have been holding up traffic for a week now, particularly in the Sukkur-Larkana division, leading to alarm among government officials and stakeholders in the business community.\n\nThe disruption comes at a critical moment in the agricultural calendar. The Kharif season, which includes crops like cotton, sugarcane, and rice, depends heavily on timely access to urea.\n\nDelays in distribution may cause lower yields, higher food prices, and added financial pressure on farmers, whose economics have already deteriorated over the past year.\n\nThe Ministry of National Food Security and Research (MNFSR) has also raised the issue with the Sindh government, saying that with Kharif season in full swing across the country, the non-availability of urea and DAP at this juncture may affect production and impact national food security.\n\nThe MNFSR letter to Sindh Chief Secretary Asif Hyder Shah, seen by Dawn, notes that fertiliser makers apprehend that the persistence of this situation may lead to forced shutdown of fertiliser plants, compromising its availability for Kharif crops.\n\nBoth inbound and outbound logistics for the fertiliser industry have slowed dramatically.\n\nAmong the hardest hit are the country’s two major fertiliser producers — Fauji Fertiliser in Mirpur Mathelo and Engro Fertilisers in Daharki — whose operations are now under significant strain.\n\nAccording to retired Brig Sher Shah Malik, executive director of the Fertiliser Manufacturers of Pakistan Advisory Council (FMPAC), over 600 fertiliser-laden trucks are currently stranded at plant sites, including Daharki, Mirpur Mathelo, and Port Qasim.\n\nAround 100,000 to 150,000 tonnes of compost is produced daily at these units, but the blockades have stranded around half a million tonnes at the factories, or on various roads.\n\nSince these factories have limited warehousing capacity, they cannot store any more fertiliser, an official from a compost plant told Dawn.\n\nHe said that it would take three days to bring production to a halt, and just as many days to restart production, as these factories work round the clock.\n\n“This isn’t just a Sindh issue — it’s becoming a problem with national-level effects,” the official said.\n\nThe FMPAC, too, has requested the Sindh government’s support in mobilising the relevant administrative and law enforcement authorities to ensure the safe and unimpeded movement of fertiliser across Sindh.\n\nGoods unable to reach destinations\n\nBeyond fertiliser, the bro­ader economic fallout is also mounting. Over 3,500 trucks — many loaded with export consignments, perishable goods, and critical industrial materials — remain stranded across northern Sindh, especially near Sukkur. With containers piling up and goods unable to reach their destinations, the supply chain is rapidly becoming gridlocked.\n\nRaw materials are also being held up at Karachi Port, resulting in many manufacturers facing the possibility of production delays. Exporters are missing delivery deadlines, potentially weakening confidence among international partners and affecting future trade prospects.\n\nAccording to M. Abdul Aleem, secretary general of the Overseas Investors Chambers of Commerce Industry (OICCI), the nearly week-long blockade of the National Highway in Sindh has brought local trade and industrial activity to a grinding halt, paralysing supply chains and sending shockwaves through the national economy.\n\n“Over 3,500 vehicles remain stranded near Sukkur, many carrying export consignments, perishable items, and critical industrial inputs. The complete halt in goods movement is already affecting market supplies, with shortages looming,” he said.\n\nMeanwhile, Khalid Tawab, regional chairman of the United Business Group (UBG), has also appealed to Prime Minister Shehbaz Sharif to take immediate action to resolve the ongoing protests and end the road blockades in Sindh, which have brought economic activities to a grinding halt.\n\nHe claimed that approximately 800 tank lorries were currently stranded en route, severely hampering the industry’s ability to ensure uninterrupted fuel supplies.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2409343549754f9.jpg",
  "retrievedAt": "2025-10-12T02:42:53.051Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906219/sindh-protests-take-a-toll-on-national-supply-chain",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T02:44:44.000Z"
}
