{
  "title": "Sindh reports year’s ninth rabies case amid vaccine shortage, rise in canine population - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Amid government failure to address vaccine shortage and control canine population, the number of rabies cases recorded this year in the province rose to nine on Wednesday when a man affected by the deadly virus was brought to the Jinnah Postgraduate Medical Centre (JPMC). Six of the nine patients hailed from the interior parts of Sindh, sources said.\n\nThey added that the patient with a history of dog-bite was brought to the emergency department with hydrophobia — a clinical sign of human rabies.\n\n“He was bitten by a dog over a month back in Qambar. The family told us that the patient couldn’t get vaccinated in their hometown. This was the sixth rabies case at the hospital,” a JPMC doctor told Dawn on the condition of anonymity.\n\nThe patient briefly remained in the isolation ward before the family took him away against the doctors’ advice, he added.\n\nAround 5,400 dog-bite patients treated at two Karachi hospitals, officials say\n\nSources said another patient with a history of dog-bite was brought dead to the hospital the same day. “Since the cause of death wasn’t known, we can’t say he died of rabies,” an official said.\n\nThe sources said six rabies’ patients who had arrived at the JPMC hailed from Badin, Sukkur, Ghotki, Qambar, Mowach Goth in Karachi and Hub Chowki.\n\nOfficials said the JPMC and Indus Hospital treated over 5,400 victims of dog bite — 2,400 and over 3,000 — during the current year.\n\nSources said the Indus Hospital has seen three rabies’ cases this year. Of them, two patients hailed from the interior areas of Sindh. Last year, over 15,000 dog-bite cases were treated at the hospital, which also saw eight deaths caused by rabies.\n\nThe Civil Hospital Karachi has seen over 16,000 dog-bite cases last year with no death from rabies.\n\nAccording to sources, dozens of dog-bite victims daily report at the city’s tertiary care hospitals.\n\nA majority of them are brought with deep wounds requiring immediate administration of life-saving rabies immunoglobulin (RIG) along with the vaccine. Unfortunately, the required medicines are available at a few hospitals in the province, leading to death in several cases.\n\nPeople’s misery is compounded by the fact that the provincial government has failed to put in place a humane system — mass dog vaccination and sterilisation — to control growing canine population despite the loss of so many precious lives every year.\n\nAccording to experts, deaths from rabies infection are preventable with prompt post-exposure prophylaxis (PEP) by stopping the virus from reaching the central nervous system.\n\nRabies can be completely prevented if the wound is immediately and thoroughly flushed and washed with soap and flowing water, followed by an effective anti-rabies vaccine series and RIG injection into each bite wound.\n\nPublished in Dawn, April 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:32:51.080Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906135/sindh-reports-years-ninth-rabies-case-amid-vaccine-shortage-rise-in-canine-population",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T03:21:03.000Z"
}
