{
  "title": "Shares at PSX plunge 2,200 points as India-Pakistan tensions simmer - Business - DAWN.COM",
  "author": null,
  "content": "Bearish sentiment continued on the trade floor at the Pakistan Stock Exchange on Thursday with shares plunging more than 2,000 points, a day after India announced a slew of diplomatic measures targeting Pakistan following a deadly attack in occupied Kashmir that resulted in the deaths of over two dozen tourists.\n\nThe benchmark KSE-100 index declined by 1,086.51, or 0.93 per cent, to stand at 116,139.63 from the previous close at 11:13am.\n\nAt 2:56pm, the index plunged 2,116.92, or 1.81pc, to stand at 115,109.22.\n\nFinally, the index closed at 115,019.81, down by 2206.33 points or 1.88pc, from the last close.\n\nYousuf M. Farooq, director research at Chase Securities, said, “The market opened lower amid fears of escalating tensions between Pakistan and India.\n\n“However, positive corporate earnings have supported a partial recovery,” he noted.\n\n“Going forward, investor sentiment will hinge on the trajectory of India-Pakistan relations, upcoming corporate results, and the monetary policy decision expected in early May.”\n\nOn macroeconomic indicators, he highlighted that inflation was at a record low — with the the monthly current account at a record surplus, and the real effective exchange rate (REER) stood “at a stable 101”.\n\nSana Tawfik, head of research at Arif Habib Limited, attributed the negative momentum primarily to tensions between India and Pakistan.\n\nIn other factors, she noted that the International Monetary Fund (IMF) had also lowered the country’s economic growth target.\n\n“However, the major reason behind the momentum remains tensions between India and Pakistan — although, on the economic front, our inflation numbers are expected to be low,” she said, adding that Fitch had also highlighted concern that the rupee may slide to Rs285 against the US dollar by June and likely fall further to Rs295 by the next fiscal year’s end.\n\n“However, it was more or less expected — we expect it to reach Rs283,” she stated.\n\nIn a major escalation of regional geopolitical tensions, India suspended the Indus Waters Treaty (IWT) with Pakistan with immediate effect in the wake of an attack in occupied Kashmir’s Pahalgam a day ago. Pakistan, in response, has convened a meeting of the National Security Committee to deliberate the resulting situation.\n\nThe attack took place in Pahalgam — a tourist hotspot in the scenic Muslim-majority territory that draws thousands of visitors every summer — and at least 26 people were killed, all men, while police said another 17 people were injured, when gunmen opened fire on visitors in the popular destination.\n\nShahbaz Ashraf, chief investment officer at FRIM ventures, noted that the market had recovered slightly from the early drop of 2pc “amid heightened tensions” following the Pahalgam attack.\n\n“Investors remain cautious, weighing potential additional responses from India and Pakistan,” he highlighted.\n\nHowever, he observed that the macroeconomic context was “far more resilient” now than in 2019 during the Pulwama attack, which had led to a sharp 5pc decline.\n\n“Back in FY2019, Pakistan faced high inflation, a widening current account deficit, and fiscal stress,” he stated. “In contrast, FY2025 is marked by relative stability and stronger fundamentals.”\n\nGiven this backdrop, he said that any short-term dip of 2pc to 4pc could actually “offer a compelling buying opportunity”.\n\n“In my view, such pullbacks should be seen as accumulation windows for long-term investors,” he said.\n\nMohammed Sohail, chief executive of Topline Securities, echoed the same sentiments. He said that geopolitical tensions continued to impact market sentiments.\n\nEarlier, the International Monetary Fund (IMF) also lowered Pakistan’s economic growth forecast to 2.6pc, raising concerns over its economic outlook.\n\nIn its latest update, the IMF slashed the growth estimate to 2.6pc for the current fiscal year and 3.6 for the next fiscal year. It also put the inflation estimate at 5.1pc and 7.7pc for the current and next fiscal years.\n\nThe increase in trade tariffs on Pakistani products could have a devastating impact on Pakistan’s important exports and serves as a wake-up call for diversification, according to a state-owned think tank.\n\nYesterday, the index fell below the 118,000 barriers on renewed concerns about Pakistan’s economic outlook and rising geopolitical tensions caused a wave of panic selling by cautious investors.\n\nIndia’s foreign exchange and interest rate traders have turned cautious on fears of a possible escalation in tensions between New Delhi and Islamabad following the attack.\n\nA day after the attack, the Indian rupee recorded its worst performance in two weeks. The currency continued to weaken on Thursday, falling to 85.6625 against the US dollar.\n\nWorries about New Delhi’s response to the attack are leading to some unease, according to three bankers.\n\nThe attack has played a role in the rupee’s weakness, coupled with the recovery in the dollar index, a senior treasury official at a bank said.\n\nHowever, it is difficult to quantify the exact impact of each factor on the rupee’s decline, said the banker, who asked not to be identified as he is not permitted to speak to media.\n\nDollar/Indian rupee forward premiums rose alongside the Indian rupees decline. Indian bonds fell and interest rate swaps hardened.\n\nWhile the size of the moves “is not big by any measure”, it reflects the uncertainty on what could unfold next, a forex and swap trader at a bank said.\n\nIndia’s 5-year overnight index swap rate has risen 12 basis points from Wednesday’s low, while the 1-year OIS is up by about half that amount.\n\nMeanwhile, the 10-year India benchmark bond yield climbed to 6.36pc on Wednesday and held near that level on Thursday.\n\nAlok Sharma, head of treasury at ICBC, anticipates the 10-year yield will stay above 6.30pc because of the caution following the attack. This sentiment is driving “more paying interest” in OIS and forward premiums, he said.\n\nThe market was “reacting to uncertainty, not fundamentals,” Manish Bhargava, CEO of Straits Investment Management, said.\n\n“The path forward depends on how the situation unfolds.”\n\nAdditional info taken from Reuters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/241111428c20e7a.jpg",
  "retrievedAt": "2025-10-12T02:42:18.153Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906281/shares-at-psx-plunge-2200-points-as-india-pakistan-tensions-simmer",
  "dateList": "2025-04-24",
  "date_published": "2025-04-24T06:29:36.000Z"
}
