{
  "title": "AIOU publishes first Algerian novel in Urdu by Dr. Fadila Melhag",
  "link": "https://www.app.com.pk/national/aiou-publishes-first-algerian-novel-in-urdu-by-dr-fadila-melhag/",
  "date_published": "2024-10-21T07:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): For the first time in the history of cultural relations between Algeria and Pakistan, Allama Iqbal Open University (AIOU) has published the first Algerian novel in Urdu by the writer Dr Fadila Melhag, in a second edition titled (When Life Desires You), with an introduction by the university Vice Chancellor, Professor Nasir Mahmood.\nThe novel (When Life Desires You), a joint translation by Dr Abdul Majeed Baghdadi, Head of the Department of Language and Literature at AIOU and Dr Lubna Farah, Director of the Translation Department at the National University of Modern Languages (NUML).\nIt is pertinent to mention here, this novel was published in 2023 in a first edition by the “Pen League of Karachi,” along with two short story collections, “Outside the Field of Discovery” and “For Display Unpaintable,” translated by Dr. Lubna Farah.\nCommenting on the initiative to publish this pioneering literary work, VC AIOU Prof. Nasir Mahmood said in the introduction of the novel, “A desire to enhance cultural cooperation between Pakistan and Algeria, which had enjoyed good historical relations since the fifties, when Pakistan was one of the countries that supported the glorious revolution of November 1, 1954, and supported the Algerian interim government in 1958″.\nIn this context, Professor Nasir Mahmood said, “The translation and publication of Dr. Fadhila Melhag’s literary works in Pakistan represents a historical precedent and a pioneering step in introducing Algerian literature in Pakistan and all of South Asia. It is considered a valuable achievement that encourages the translation and publication of Arabic literary works in Urdu and the translation and publication of Pakistani literary works in Arabic”.\nProf Nasir said, the novel (When Life Desires You) is worthy of reading and study by a brilliant writer who deserves admiration and appreciation.\nIt is a distinguished creative experience in presenting the issue of illegal “secret” immigration to the north in its current manifestations, with its complex ideological, economic, historical and cultural dimensions.\nDr. Fadila Melhag is distinguished by her high and diverse education, abundant intellectual production, and creativity in multiple literary genres (poetry, novels, and stories).\nShe holds a PhD in law and national and foreign certificates in the judiciary, law, diplomacy, information technology, and foreign languages.\nDr. Fadila Melhag has published several books in legal studies, political science, and literature (novel, poetry, story). Her books have been published in Algeria, Egypt, France, and Pakistan and have been translated into French, English, Spanish, and Urdu. She received the Genius Award from the Ministry of Culture and Arts in Algeria this year.",
  "retrievedAt": "2025-08-10T20:12:14.683Z"
}
