{
  "title": "Minister, UN INSARAG secretary inaugurate International Rescue Challenge",
  "link": "https://www.app.com.pk/national/minister-un-insarag-secretary-inaugurate-international-rescue-challenge/",
  "date_published": "2024-10-21T17:15:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 21 (APP):A total of 274 delegates from 23 countries participated in the International Rescue Challenge and the UN INSARAG exercise.\nProvincial Minister for Health and Emergency Services, Khawaja Salman Rafique, welcomed the international rescue teams and representatives of the United Nations INSARAG Secretariat, as well as United Nations agencies participating in the International Rescue Challenge in Pakistan.\nSpeaking on behalf of the Punjab government, Khawaja Salman Rafique, said  that it is a matter of great pride for Pakistan that its rescue team has become the first United Nations INSARAG-certified rescue team in South Asia. Due to this certification, the Pakistan rescue team is organizing two international events, the “International Rescue Challenge” and the “Asia-Pacific Earthquake Response Exercise 2024,” in Lahore. Twenty-three countries participating in this exercise, and 274 international delegates are attending. Such international events are always helpful in enhancing professionalism and synergy among professional teams globally, he added.\nUnited Nations INSARAG Secretary Winston Chang Yun expressed his happiness at the progress made by the Pakistan Rescue Team under the dynamic leadership of Khawaja Salman Rafique. He acknowledged that organizing such a mega event is not an easy task. Mr. Winston Chang Yun added that the determination and dedication of the Pakistan Rescue Team made it possible to host this event in Pakistan. He appreciated all the participating teams and their management for their involvement in this international challenge and wished them the best of luck.\nSecretary of Emergency Services, Dr. Rizwan Naseer, said that the International Rescue Challenge provides an excellent platform to improve emergency preparedness and response coordination between national and international agencies. He recalled that when the Emergency Service Rescue 1122 was started, there was no emergency response system in Pakistan. Dr. Rizwan Naseer mentioned that during the International Rescue Challenge, from October 21 to 22 at the Emergency Services Academy, rescue teams from China, Great Britain, South Korea, Malaysia, the Philippines, Nepal, Thailand, and Pakistan will participate in the Height Rescue Challenge, Deep Well Rescue Challenge, Evacuation Challenge from confined spaces, Trauma Challenge, and Fire Fitness Challenge. This challenge will be followed by the United Nations INSARAG Asia-Pacific Earthquake Response Exercise in Lahore from October 23 to 26, 2024.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:11:40.081Z"
}
