{
  "title": "Bukhari praises Bilawal’s key role in passing 26th Constitutional Amendment",
  "link": "https://www.app.com.pk/national/bukhari-praises-bilawals-key-role-in-passing-26th-constitutional-amendment/",
  "date_published": "2024-10-21T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP):Pakistan People’s Party (PPP) Secretary General Syed Nayyar Hussain Bukhari on Monday commended party chairman Bilawal Bhutto Zardari for his relentless efforts and pivotal role in the approval of the 26th Constitutional Amendment by the parliament.\nBukhari, in a news statement, lauded Bilawal’s hard work, describing him as a “strong and effective voice for upholding the Constitution both inside and outside the Parliament.”\nBukhari expressed pride in Bilawal’s leadership, stating that his commitment to constitutional supremacy reflects the core values of the PPP.\nHe further acknowledged the contributions of other key leaders, including Prime Minister Shehbaz Sharif, Mian Nawaz Sharif, Maulana Fazlur Rahman, and others, for achieving another milestone in Pakistan’s democratic journey.\nThe 26th Amendment, approved by both the Senate and National Assembly, he said was presented by a special parliamentary committee, a mandatory part of the parliamentary process.\nBukhari congratulated the government’s coalition partners and other political parties for their collective success in passing the amendment.\n“This amendment marks a significant step toward improving the judicial system, ensuring faster justice delivery, and promoting equal representation,” Bukhari noted.\nHe emphasized that the judicial reforms, a promise made in Benazir Bhutto’s Charter of Democracy, are now coming to fruition.\nAdditionally, he mentioned that the Pakistan Bar will also have representation in the commission for appointing judges in higher courts, alongside members of Parliament and judiciary.\nBukhari also appreciated Bilawal’s facilitation of the PTI’s negotiation delegation during their meeting in jail, showcasing the PPP’s commitment to maintaining a flexible and cooperative political approach.\nHe urged opposition members to adopt a responsible attitude for the betterment of the nation.\nHe remarked that the amendment was passed with a two-thirds majority, signaling broad political support for judicial reforms aimed at improving Pakistan’s justice system.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:12:27.225Z"
}
