{
  "title": "26th constitutional amendment to safeguard country’s future; ascertains parliament supremacy: PM",
  "link": "https://www.app.com.pk/national/26th-constitutional-amendment-to-safeguard-countrys-future-ascertains-parliament-supremacy-pm/",
  "date_published": "2024-10-21T00:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): Prime Minister Shehbaz Sharif on Monday said that the 26th Constitutional Amendment Bill passed by the parliament would prove to be a milestone in the country’s history besides safeguarding its future.\n“This is a historic day. The 26th constitutional amendment is not just an amendment but another magnificent example of national solidarity and unity. Today a new dawn will usher in and a new sun will rise which will brighten the whole country,” the prime minister said addressing the National Assembly after the House passed the legislation in the early hours of Monday.\nEarlier Law Minister Azam Nazeer Tarar presented the 26th Constitutional Amendment Bill in the National Assembly which was passed by a two-thirds majority after its passage by the Senate with the similar required majority.\nUnder the amendment, the term for the Chief Justice of Pakistan has been set at three years. A 12-member parliamentary committee will select the new Chief Justice from a panel of the three most senior judges. This committee, consisting of eight members from the National Assembly and four from the Senate, will propose the name to the Prime Minister, who will then forward it to the President for final approval.\nBesides, a Judicial Commission of Pakistan, led by the Chief Justice and including three senior judges, two members each from the National Assembly and Senate, the federal minister for law and justice, the attorney general and a legal expert with at least 15 years of Supreme Court experience, will oversee judicial appointments.\nPrime Minister Shehbaz said that the new constitutional amendment would also help end the palatial conspiracies to oust the governments and remove the prime ministers besides ensuring the riddance from the verdicts like Reko Diq and Karkey which cost the country billions of dollars.\nBesides, this will also address the sufferings of the millions of people who had to wait for years to seek justice from the Supreme Court, he added.\nThe prime minister said that with the passage of the 26th Constitutional Amendment Bill, the unfulfilled dream of the Charter of Democracy had been realized which was signed by Shaheed Benazir Bhutto and Mian Nawaz Sharif in 2006 and also endorsed by Maulana Fazlur Rehman.\nResponding to criticism by an opposition member, the prime minister said the legislation was made by the votes of allied parties and the independent candidates, not by any turncoats.\nHe said the country had witnessed great judges like Justice Kiani and Justice Robert Cornelius but there were also some others who sacked two prime ministers with one on the basis of Iqama, when nothing was found in the Panama case.\nHe told the members that the 26th constitutional amendment had ascertained the supremacy of the parliament.\nThe prime minister, who earlier went to the seats of the parties’ leaders to thank them, particularly mentioned President Asif Ali Zardari, Bilawal Bhutto Zardari, JUI-F’s Maulana Fazlur Rehman, Khalid Maqbool Siddiqui, Salik Hussain, Abdul Aleem Khan, Sardar Khalid Magsi, Aimal Wali Khan, Abdul Malik Baloch, Ijazul Haq, Professor Sajid Mir and others and expressed gratitude for their support to make such an amendment in the constitution that would “strengthen and safeguard the country’s future.”\nPrime Minister Shehbaz wished the PTI would have joined the legislation process but he said that despite their absence, the parliament gave a message that the political parties and their leaders set aside their personal interests and went ahead to pass the amendment “which will become a milestone in the country’s history.\nLater, the prime minister signed the advice and sent to the President of Pakistan for his signing of the 26th Constitutional Amendment Bill into law after its passage by both houses of the parliament.",
  "retrievedAt": "2025-08-10T20:12:16.583Z"
}
