{
  "title": "Media role crucial in fight against polio: Ayesha Raza",
  "link": "https://www.app.com.pk/national/media-role-crucial-in-fight-against-polio-ayesha-raza/",
  "date_published": "2024-10-21T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP): The Prime Minister’s Focal Person for Polio Eradication Ms. Ayesha Raza Farooq on Monday urged to strengthen collaboration and foster media engagement in the ongoing fight against polio.\nShe was addressing a group of health journalists at media engagement session at the National Emergency Operations Centre for Polio Eradication (NEOC), organized by the Pakistan Polio Eradication Programme.\nThe event brought together health reporters from various print, electronic, and online media outlets, aiming to provide them with accurate data, present the programme’s current strategy to fight poliovirus, and address media questions ahead of the nationwide polio vaccination campaign set to begin on October 28, 2024.\nMs. Ayesha Raza provided journalists with critical updates on the current status of the polio programme efforts in the country.\nNEOC Coordinator Anwarul Haq presented the key challenges facing the eradication efforts, including persistent vaccine hesitancy, population movement, and security concerns in high-risk areas that affect consistent access to children with the vaccine.\nMs. Ayesha Raza emphasized the government’s strong commitment to polio eradication from the highest office of PM to the provincial and district levels.\nShe said that polio eradication is being taken forward as national priority agenda with a consensus roadmap being implemented to interrupt virus transmission by mid-2025.\nSpeaking about the resurgence of poliovirus this year, she said that 39 polio cases have been reported this year which highlights that the Programme is maintaining effective disease surveillance and not missing the virus anywhere in the country.\n“Protecting our children from the scourge of polio remains our collective topmost priority,” she said.\n“While we are concerned about the surge, every new virus detection is taken as an opportunity to better understand the current dynamics of virus transmission which in turn helps us in refining the response and curb its further spread.”\nThe Prime Minister’s Focal Person said the upcoming nationwide campaign, scheduled to begin on October 28, is a significant step towards countering the spread of poliovirus.\nShe highlighted the media’s role in creating a positive environment for vaccine acceptance.\nMs Ayesha Raza said, “The media has traditionally been a great ally of the Polio Programme and plays an essential role in shaping public perception and ensuring accurate information is disseminated.”\n“To defeat polio, we need your continued help in promoting vaccination and good hygiene practices, enhancing the risk perception about polio as a devastating disease and combatting misinformation about the vaccine which is a real challenge in the age of digital media and causes parents to refuse the vaccine or hide their children from vaccinators.”\nNEOC Coordinator Muhammed Anwarul Haq highlighted the programme’s roadmap, a strategic roadmap made in consultation with the provinces and aimed at interrupting poliovirus transmission by mid-2025.\n“With the government’s backing, we are implementing multiple high-quality vaccination campaigns and outbreak responses while improving routine immunization and addressing vaccine hesitancy.\n“Surveillance has been enhanced to track the virus, and we expect more cases to emerge in the coming months as we continue to detect the virus in the environment,” he said.\nThe NEOC Coordinator said that the Programme is planning two more polio vaccination campaigns before the end of December to boost children’s immunity against polio.\n“With the upcoming polio campaigns, the support of the media will remain essential for us to help create a conducive environment for vaccination and build community trust.”\nThe session underscored the need for national media outlets to play an active role in covering vaccination campaigns, promoting accurate narratives, and countering misinformation.\nThe Polio Programme aims to work closely with journalists to ensure that the importance of vaccination is effectively communicated to the public.",
  "retrievedAt": "2025-08-10T20:11:44.864Z"
}
