{
  "title": "Pakistan, World Bank agree to New Partnership Framework for reforms, development",
  "link": "https://www.app.com.pk/national/pakistan-world-bank-agree-to-new-partnership-framework-for-reforms-development/",
  "date_published": "2024-05-08T13:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP): Pakistan and the World Bank on Wednesday agreed to collaborate on a new, robust and ambitious Country Partnership Framework (CPF) to carry forward the country’s reform and development agenda.\nThe agreement was reached during a meeting between Prime Minister Muhammad Shehbaz Sharif and a delegation led by Regional Vice President of the World Bank for South Asia Martin Raiser.\nWelcoming Martin Raiser, Prime Minister Shehbaz lauded the contribution of the World Bank to the development of Pakistan.\nThe prime minister appreciated the support extended by the Bank for building the climate resilient infrastructure in the wake of 2022 floods in Pakistan. He briefed the delegation on the reform agenda of the government including digitization of the entire tax system, power sector reforms, enhancing per acre yield in the agriculture sector, addressing the issue of child stunting, etc.\nAppreciating Pakistan’s aggressive reforms agenda, Martin Raiser said the World Bank was ready to collaborate with the country in its journey of transformation of the economy aimed at sustainable development.\nBoth sides agreed to engage in a long-term, focused partnership under a new Country Partnership Framework with an annual review mechanism to assess progress and ensure that results are achieved. The strategy will include flexibility for future course correction. The new partnership will have the ambition to achieve transformational impacts over a decade on a selective set of critical development priorities for Pakistan.\nThe initial set of priorities that were discussed in the meeting included structural economic reforms including domestic resource mobilization, particularly via digitalization and tax policy reforms.\nHuman capital development, specifically addressing child stunting and improving foundational learning was also discussed.\nLikewise, the energy sector reforms, including increased participation of the private sector in transmission and distribution, and transition to green energy to make energy cheaper, cleaner and financially sustainable also came under discussion.\nIn order to better cope with the increased water scarcity and climate-related shocks, both sides emphasized collaboration in climate adaptation.\nFor increasing economic opportunities, including in the agriculture sector, Pakistan will benefit from the Bank’s expertise in mobilizing global expertise and best practices, institutional capacity building, leveraging digital transformation and private sector participation, including via the World Bank’s private sector arm, the International Finance Corporation and the Multilateral Investment Guarantee Agency.\nThe two sides agreed that the process for preparation of the new Country Partnership Framework will consist of consultations with the federal and provincial governments as well as academia, parliamentarians, civil society, development partners and the private sector.\nThe World Bank will coordinate with stakeholders to discuss the partnership priorities duly aligned with the key development priorities and strategy of the Government of Pakistan.\nThe prime minister witnessed the signing of a joint communique in this respect by the World Bank’s Country Representative Najy Benhassine and Secretary of Economic Affairs Division Dr. Kazim Niaz.\nEconomic Affairs Minister Ahad Khan Cheema, Finance Minister Muhammad Aurangzeb, Petroleum Minister Dr. Musadik Malik, Minister of State for IT Shaza Fatima Khawaja, Deputy Chairman of Planning Commission Dr. Jehanzeb Khan and senior government officials also attended the meeting.",
  "retrievedAt": "2025-08-11T02:22:44.544Z"
}
