{
  "title": "Collaborations, all-inclusive policy interventions pertinent to reliable energy access in Pakistan: Experts",
  "link": "https://www.app.com.pk/national/collaborations-all-inclusive-policy-interventions-pertinent-to-reliable-energy-access-in-pakistan-experts/",
  "date_published": "2024-05-08T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 08 (APP): The experts at the stakeholder dialogue on energy transition in textile sector underscored the need to establish multi-sectoral collaborations and all-inclusive interventions to ensure just energy transition in Pakistan.\nPakistan-German Climate and Energy Partnership (PGCEP) and Sustainable Development Policy Institute (SDPI) jointly organized the symposium on Energy Transition in the Textile Sector: The way Forward through Electricity Market Reforms and Green Financing.\nAddressing the symposium, Romina Khurshid Alam, Coordinator to Prime Minister on Climate Change said that there is a broader consensus on the subject matter and issues related to the textile industry, whereas market reforms and green financing mechanisms are underway along with detailed interactions and consultations of relevant sectors in the pipeline.\nShe added that Pakistan’s textile and other industries would face challenges due to upcoming Carbon Border Adjustment Mechanism (CBAM) and that’s why the government is actively engaging with relevant stakeholders to facilitate the process and combat with its looming risks.\n“Pakistan has great potential in carbon markets whereas national level policies and frameworks are almost there. Moreover, Prime Minister’s Committee on Climate Change is focused on enhancing dialogue on war footing to shift towards green energy, green financing and climate resilient development,” she said.\nShe noted that collaborations and consultations with relevant partners are the most important part of the process, whereas sensitization of small and medium enterprises and associated industries linked to exports needed to be apprised on the CBAM. She mentioned that the Ministry of Climate Change and Environmental Coordination’s role is crucial in this regard and it is engaging with other ministries relevant to this subject including Ministries of Economic Affairs, Commerce, Power, Planning, Development & Special Initiatives.\nDr Abid Qaiyum Suleri, Executive Director SDPI said that the country was at crossroads as at one hand it has to improve its competitiveness and economic growth and on the other hand the economic crunch, increased interest rate and impending risks due to CBAM.\nHe informed that the government is mindful of all these crises, whereas the Prime Minister had constituted committees on climate governance and finance review along with a high-powered committee co-chaired by Deputy Chairman Planning Commission and PM’s Coordinator on Climate Change. Dr Suleri said that the industries would have to come up with renewable energy sources otherwise it would have to pay carbon tax levied in EU if not done in Pakistan.\n“The profitability and competitiveness need to be promoted to achieve green energy transition. However, the country needs to converge all its sectors on one point and provide level playing field for its industries to choose clean and green energy and invest in just energy transition,” he said.\nIn her opening remarks, Sobiah Becker, Advisor, Pakistan-German Climate & Energy Partnership (PGCEP) highlighted the need for candid discourse for way forward and solutions to the challenges faced by the Textile Sector of Pakistan. The She highlighted the development support provided by German Development Cooperation through Pakistan-German Climate and Energy Partnership that was launched in 2021 with an aim to help Pakistan achieve its climate related targets and commitments Stakeholder engagement is one of the key pillars of this partnership whereas a whole of a society approach is needed to address the climate change related challenges in Pakistan, she added.\nHelene Paust, Deputy Head of Development Cooperation, German Embassy in Pakistan said that the energy sector is continuously shifting to sustainable modes. “Pakistan textile industry as a main export driver stands at the forefront of its paradigm shift in energy transition. The companies are incorporating solar-based solutions in their energy mix in Pakistan and around the world due to its resilience and reliability,” she said.\nShe said that the just energy transition was based on two crucial pillars of electricity market reforms and green financing streams, whereas the role of the latter was crucial in stimulating green energy transition.\n“Germany is committed to support Pakistan in its efforts towards just energy transition which is important as economic prosperity must converge with environmental sustainability. We stand shoulder to shoulder with Pakistan in its progress towards this transition” she said.\nYulia Bazhenova, Project Lead, Textiles extended her gratitude for the governments of Germany and Pakistan for providing support to develop synergies for dialogue among the public and private sector of Pakistan.\nShe said that it was important to know about regulations and demands in the realm of energy supply, emissions reduction and sustainability. However, value chain demand is growing for sustainable power and carbon free products that requires time and capital to shift towards green and just energy.\nZainab Naeem, Associate Research Fellow, SDPI moderated the first panel on energy transition in textile sector opportunities and challenges.\nSheikh Muhammad Iqbal, CEO Pakistan Textile Council briefed on the textile industry structure and value chain. He said that Pakistan’s textile industry is committed for just energy transition because its customers demand carbon free or ecofriendly products. However, there has been no policy on climate finance and energy transition amid absence of any baseline data at the national level.\nShahid Sattar, Secretary General, All Pakistan Textile Manufacturing Association (APTMA) said that until the power distribution companies (DISCOs) and government had a strong hold of the energy sector, the room for improvement is very low whereas under the Competitive Trading Bilateral Contracts Market (CTBCM), the energy tariff offered was not competitive with the regional players.\nAqeel Hussain Jaafri, Private Power and Infrastructure Board (PPIB), Ministry of Energy said that energy is the main component that brings competitiveness in the export products. However, solar energy provides an opportunity to reduce cost of electricity and production for industry, which is part of the solution, he said and added that the voluntary carbon markets in the country are gaining momentum that can provide the industry to explore new opportunities.\nEngr. Ubaid ur Rehman Zia, Head of Energy Unit at SDPI moderated the second panel on energy transition in textile sector opportunities and challenges. Ubaid highlighted that market liberalization under the Competitive Trading Bilateral Contracts Market (CTBCM) is essential to ensure availability of affordable and clean energy to the consumers.\nAfia Malik, Senior Economist, Pakistan Institute of Development Economics (PIDE) said that the hurdle to competitive market is inefficiency in supply chain of distribution sectors which was further aggravated by tariff design of electricity in Pakistan, issue of cross-subsidies, and the already installed surplus capacity.\n“A competitive market is the way forward but we need to decide between the free and regulated market, as free market is fair and competitive,” she added.\nThe third session discussed mobilizing finance for Energy Transition: Opportunities and Challenges. Dr. Khalid Waleed Research Fellow at SDPI mentioned that the energy transition needs a carrot approach where analyzing the alternate economic engines is of paramount importance.",
  "retrievedAt": "2025-08-11T02:22:59.062Z"
}
