{
  "title": "Art exhibition showcases abstract expressionist paintings by Sherzada Khalid Iqbal",
  "link": "https://www.app.com.pk/national/art-exhibition-showcases-abstract-expressionist-paintings-by-sherzada-khalid-iqbal/",
  "date_published": "2024-05-08T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 08 (APP):The highly anticipated art exhibition titled “Dances with Colors,” featuring the abstract expressionist paintings of the prominent artist Sherzada Khalid Iqbal, opened at the Pakistan National Council of the Arts (PNCA) on Wednesday.\nThe exhibition was inaugurated by the Ambassador of the Hashemite Kingdom of Jordan, Dr. Maen Khreasat, and the Director General of the of the PNCA, Muhammad Ayoub Jamali.\nSherzada Khalid Iqbal’s journey into the world of art was as remarkable as his creations. Despite his professional background as a chartered accountant, Iqbal’s life took a transformative turn following a brain hemorrhage in 1997.\nThis pivotal event unlocked a portal in his mind, igniting an insatiable desire to paint.\nWith colors streaming through his consciousness, Iqbal embarked on a creative exploration, delving into the intricate relationships between materials, aesthetics, and perceptions.\n“We are delighted by the overwhelming response to Dances with Colors, an art exhibition,” said Director General of PNCA, M. Ayuob Jamali.\nHe highlighted the PNCA’s commitment to promoting cultural diversity and artistic expression, stating, “PNCA is honored to showcase the exceptional talent of Sherzada Khalid Iqbal and to provide a platform for artists to share their unique perspectives with the world.”\nKhalid’s works were bold, bright, and expressed explosive movement. Layers of liquid enamel formed a shifting surface that appeared to be in a constant state of flux, juxtaposed in complex patterns.\nEschewing traditional tools, Khalid employed his hands to create original works of art based purely on his streams of consciousness. Refusing external influences, he adamantly isolated himself from established techniques, maintaining the purity of his work.\nConstantly evolving, Khalid experimented with various mediums, including metal, glass, wood, board, and canvas. His paintings invited viewers to interpret and engage with them as they took on a life of their own, developing and evolving until they were complete.\n“Sherzada Khalid Iqbal’s artwork transcends boundaries and speaks to the universal language of the human experience,” remarked Ambassador Dr. Khreasat.\nHe continued, “Through exhibitions like ‘Dances with Colors,’ we strive to foster an environment where creativity thrives and where art serves as a bridge connecting people across borders and cultures.”\nThe exhibition will be open for viewing from May 8–15 from 10:00 a.m. to 6:00 p.m. daily, with the exception of Saturdays, when the gallery will be closed.\nArt enthusiasts and connoisseurs were cordially invited to witness the unveiling of Sherzada Khalid Iqbal’s masterpieces and immerse themselves in the transcendent world of “Dances with Colors.”\nThe exhibition celebrated the power of abstract expressionism and the boundless creativity of Sherzada Khalid Iqbal.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:23:00.394Z"
}
