{
  "title": "Naqvi visits CDA for briefing on administration, management, development",
  "link": "https://www.app.com.pk/national/naqvi-visits-cda-for-briefing-on-administration-management-development/",
  "date_published": "2024-05-08T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP): Interior Minister Mohsin Naqvi on Wednesday visited Capital Development Authority (CDA) for briefing on the administration, management and development of Islamabad. Chairman CDA Mohammad Ali Randhawa welcomed the minister.\nThe minister directed to immediately start development work in sectors which were not developed for 20 years and also to allot plots to the allottees who have not received, despite paying the amount for years.\nHe also directed to formulate a comprehensive strategy for early possession of the plot because despite paying money, no possession of the plot is an insult of the citizens which is definitely not acceptable.\nMohsin Naqvi’s order to digitization of land records of Islamabad and in this regard CDA tasked for computerising land records in 6 months.\nIt was decided in the meeting that CDA will have a fast one-window system which is a major initiative for the convenience of the citizens of Islamabad.\nCDA should ensure the provision of services without delay to the citizens of Islamabad so that there is no hassle of waiting, Mohsin Naqvi directed.\nThe Minister ordered to provide more services online and enable CDA’s smart app within three months.\nHe also Instructed to ensure availability of call centre facility at all times and construction of cycling and walking tracks on green balance should be completed soon.\nNaqvi asked for a landscaping and beautification plan in Islamabad and the Diplomatic Enclave will be made the most beautiful area of the city in 3 months.\nCDA should start work on opening new sectors, Mohsin Naqvi directed adding that he will not tolerate any further delay in the sectors which have not yet been given possession to the people.\nAfter introduction with the senior officers of CDA the minister planted a sapling in the lawn of CDA head office.\nFederal Interior Secretary Khurram Agha, IG Islamabad Police Ali Nasir Rizvi, Deputy Commissioner Islamabad Irfan Memon, Director Admin ICT Attendance of all CDA members in the meeting.",
  "retrievedAt": "2025-08-11T02:22:14.505Z"
}
