{
  "title": "Pakistan attaches high importance to its ties with Iran: Pirzada",
  "link": "https://www.app.com.pk/national/pakistan-attaches-high-importance-to-its-ties-with-iran-pirzada/",
  "date_published": "2024-05-08T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 08 (APP): Federal Minister for Housing and Works Mian Riaz Hussain Pirzada on Wednesday said that Pakistan attached high importance to its brotherly ties with Iran.\nHe was talking to Iranian Ambassador to Pakistan Reza Amiri Moghaddam, who called on him.\nPirzada said that it was an honour for him to meet and welcome Iranian President Ayatollah Ibrahim Raisi and accompany him during his visit to Pakistan.\nThe minister acknowledged the ambassador’s tireless efforts for strengthening the two countries’ relationship.\nDuring the meeting, the two sides discussed various bilateral issues.\nThey emphasized the shared commitment of Iran and Pakistan to standing up for the rights of the people of Kashmir and Palestine.\nThey noted that the two countries had been resolute in their support for the two long-standing conflicts.\nMinister Pirzada lauded the stance taken by Iran on the ongoing humanitarian crisis in Palestine, where the world had witnessed a concerning silence from so-called human rights advocates. He highlighted the importance of Iran’s principled position in the face of grave injustice.\nThe minister informed the ambassador that the message of the Iranian President for the Prime Minister of Pakistan had been duly conveyed. Moreover, he himself delivered the Iranian President’s message to the people of Pakistan through a speech in the National Assembly, he added.\nAmbassador Moghaddam commended the efforts and arrangements made by the government to facilitate the visit of the Iranian President, underscoring the importance of such high-level exchanges in strengthening bilateral ties.\nHe expressed appreciation for Minister Pirzada about his speech in the National Assembly upon the Iranian President’s recent visit to Pakistan.\nMoghaddam also highlighted the positive outcomes of the visit, including the release and transfer of Pakistani prisoners held in Iran, as per mutual understanding. He expressed the hope for similar reciprocal actions by Pakistan regarding Iranian prisoners in Pakistan.\nThe ambassador extended full support to facilitate Pakistani pilgrims visiting holy sites in Iran, emphasizing that they were allowed to travel using their buses and security.",
  "retrievedAt": "2025-08-11T02:22:15.129Z"
}
