{
  "title": "9th May to be remembered as a dark day in Pakistan’s history: President Zardari",
  "link": "https://www.app.com.pk/national/9th-may-to-be-remembered-as-a-dark-day-in-pakistans-history-president-zardari/",
  "date_published": "2024-05-08T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP):President Asif Ali Zardari has said that 9th May 2023, will always be remembered as a dark day in Pakistan’s history when a politically instigated mob ran amok across the country, damaging public property and military installations.\nCondemning the violence, he said that the unfortunate incidents severely tarnished the country’s image, which only served the interests of Pakistan’s enemies.\nThe president, in his message, termed the mob attacks an attempt to challenge the writ of the state, undermine the rule of law and weaken the institutions.\nHe said that peaceful demonstrations and constructive criticism were the essence of democracy, emphasizing that Pakistan’s Constitution enshrined the fundamental rights of assembly and expression.\nNonetheless, he stressed the vital importance of exercising “these rights with utmost responsibility, adhering strictly to the bounds of constitutional and legal provisions”.\nHe affirmed that any attempt to misuse “these rights to incite violence will never be tolerated. We have never seen such vandalism in responsible democracies, with violent mobs wreaking havoc on state properties for political gains.”\nThe president expressed pride in Pakistan’s Armed Forces and its institutions, which had been a vanguard in defending the nation against various threats.\nHe emphasised that those responsible for the May 9 violence should be held accountable according to the law.\nPresident Zardari observed that Pakistan faced numerous challenges, and such irresponsible acts by political forces not only hindered the progress achieved as a nation but further exacerbated socio-economic challenges.\n“The current political situation demands that all political parties work towards promoting tolerance, democratic values, and political dialogue, and provide a clear direction to the nation.”\nThe president urged political parties, the Parliament, the media, and civil society to strengthen democracy by upholding the rule of law, and fostering a culture of tolerance, political dialogue and inclusivity.\nHe also condemned the malicious social media campaign against state institutions, saying that a mechanism should be evolved to check and counter such disinformation campaigns.\nThe president highlighted the need to harness the potential of youth for the country’s benefit, rather than instigating them against state institutions. He also called for collective efforts to build a better future for generations to come and putting an end to political polarization and hatred.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:22:33.265Z"
}
