{
  "title": "Experts on ‘Thalassemia Day’ urges youth to take an active part in awareness drives for protecting humanity",
  "link": "https://www.app.com.pk/national/experts-on-thalassemia-day-urges-youth-to-take-an-active-part-in-awareness-drives-for-protecting-humanity/",
  "date_published": "2024-05-08T06:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP):Health experts on World Thalassemia Day appealed to people that every single drop of blood could save precious lives, urging youngsters to take an active part in awareness campaigns through social media forums to protect humanity.\n“Prevention is better than cure. Every member of society must be screened for thalassemia through a simple blood test before marriage,” the World Health Organization (WHO) Advisor on Blood Regulation, Availability and Safety Prof Hassan Abbas Zaheer talking to PTV news channel said.\nThis year’s theme is “Empowering Lives, Embracing Progress: Equitable and Accessible Thalassemia Treatment for All’’.\nInternational Thalassemia Day is a powerful call to raise awareness about this condition and its impact while celebrating the solidarity of the resilient Thalassemia community worldwide, he mentioned.\nHe also highlighted the need for raising public awareness campaigns regarding blood disorders across the\ncountry, adding, students asked to regularly donate blood for thalassemia patients.\nThe main reason behind the spread of Thalassemia in Pakistan is lack of awareness and holding such events may create awareness among people to respond appropriately for prevention and protection from the horrible disorder, he added.\nRaising awareness about Thalassemia and its prevention through premarital screening of individuals can prove helpful in reducing the chances of its transmission to the next generation, he further stressed.\nAnother expert of disease Dr Saqib Ansari emphasized that the screening test plays a vital role in identifying the disorder and enabling preventive measures to combat its spread.\nHe explained that Thalassemia is an inherited blood disorder that causes an abnormal or inadequate amount of hemoglobin.\nHaemoglobin is the protein in red blood cells that carries oxygen. In most countries where thalassemia exists, patients with Beta-thalassemia major do not reach or surpass the age of 20 years. As they require regular blood infusions to survive.\nHe said that during blood shortage, such patients face serious life threats, as blood makes only a few healthy red blood cells which even do not ensure a life cycle for a long time.\nHe said that collecting blood donations daily for children battling Thalassemia, hemophilia, and blood cancer diseases and providing free quality blood to deserving patients was indeed great work.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:23:57.475Z"
}
