{
  "title": "Indian Ocean region witnesses geopolitical changes adding to responsibilities of PN: CNS",
  "link": "https://www.app.com.pk/national/indian-ocean-region-witnesses-geopolitical-changes-adding-to-responsibilities-of-pn-cns/",
  "date_published": "2022-06-27T14:40:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 27 (APP):Chief of the Naval Staff (CNS), Admiral Muhammad Amjad Khan Niazi on Monday visited Pakistan Navy War College (PNWC) Lahore and addressed the course participants of 51st PN Staff Course.\nAddressing the course participants, the Naval Chief said, “Indian Ocean region is witnessing geopolitical changes of seismic nature and it adds to the responsibilities of Pakistan Navy”.\nOn arrival at War College, the Naval Chief was received by Commandant PN War College Rear Admiral Shifaat Ali Khan, said a Pakistan Navy media release here received.\nWhile addressing the course participants, Chief of the Naval Staff highlighted evolving geo-strategic milieu and its interplay with prevalent security dynamics focused on maritime security challenges.\nWhile focusing on threat perception, the Naval Chief underscored Pakistan Navy’s capabilities to deal with this paradigm shift in combating traditional and non-traditional security challenges. Naval Chief appraised upon various initiatives and developmental plan in line with his vision for Pakistan Navy to be a formidable regional maritime power.\nThe Chief of the Naval Staff also advised the course participants to instill Pakistan Navy’s core value of faith, character, courage and commitment in their noble and demanding profession and draw inspiration from true Islamic values and Ideology of Pakistan.\nEarlier, a panel of course participants presented the research paper. The Admiral appreciated the efforts of Pakistan Navy War College for inculcating professional staff & military training to officers of Pakistan Navy, Sisters Services and friendly countries for assuming future key Command and Staff appointments.",
  "retrievedAt": "2025-08-11T15:09:42.299Z"
}
