{
  "title": "Pakistan survives bankruptcy; prosperity next target: PM",
  "link": "https://www.app.com.pk/national/pakistan-survives-bankruptcy-prosperity-next-target-pm/",
  "date_published": "2022-06-27T18:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP): Prime Minister Shehbaz Sharif Monday said that having steered Pakistan out of the verge of bankruptcy, the coalition government was now striving to bring prosperity through dedicated efforts and exploiting all of its energies.\n“The previous government had pushed Pakistan to the verge of bankruptcy. Alhamdulillah, it has survived now thanks to Allah Almighty’s blessings and consultation of the coalition partners,” the prime minister said addressing a reception hosted by him for the parliamentarians of the ruling coalition.\nHe told the gathering that the agreement with the International Monetary Fund (IMF) was about to reach containing “very tough” conditionalities.\nHe said despite its tall claims of building a Naya Pakistan, the previous government could not tax the affluent class. However, the incumbent government put that class under direct tax to make them share burden of the poor people.\nCalling it a revolutionary step, he said imposing a direct tax on the rich class would bring in Rs200 billion to the national kitty.\n“This is Quaid Azam’s Pakistan who wanted to see it as a welfare state. This is a direct tax, not on sugar, iron or textile which could be passed on (to consumers). This is on the owners of the businesses and their income,” he explained.\nHe said considering inflation, the government provided relief to the poor people through Benazir Income Support Program. He also hinted at launching a program to promote solar energy in the country.\nSimilarly, he said the government also averted the crisis of edible oil by timely importing the commodity from Indonesia.\nHe told the parliamentarians that despite a price hike in oil and gas, the government was striving to tackle the situation to meet country’s energy needs.\nHe said in order to ensure low-cost power generation, the government would import high-quality coal from Afghanistan which would save $2 billion in foreign exchange. Through a series of meetings, the government had formulated a mechanism for transportation of coal from Afghanistan to the power plants through tucks and trains, he added.\nThe prime minister said the government was also strategizing to enhance indigenous production of edible oil to save $4 billion. Similarly, the enhancement of cotton and wheat production was also on our agenda to support and stabilize the national economy, he added.\nHe said in order to achieve the said goals, Pakistan would seek technical support from the friendly countries, instead of seeking aid from them.\n“Begging should come to an end. This will come to an end. A new era will usher in. In 14 months of our term, we will change fate of the country, he resolved.",
  "retrievedAt": "2025-08-11T15:09:38.123Z"
}
