{
  "title": "Defence Minister condemns Canadian parliamentarian’s remarks against Pakistani military leadership",
  "link": "https://www.app.com.pk/national/defence-minister-condemns-canadian-parliamentarians-remarks-against-pakistani-military-leadership/",
  "date_published": "2022-06-27T15:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP): Minister for Defence Khawaja Muhammad Asif on Monday strongly condemned Canadian parliamentarian’s remarks against Pakistan’s military leadership and urged the Canadian government to take notice of irresponsible statement.\nSpeaking in the National Assembly he said, “Pakistan and military leadership wascriticized by a Canadian parliamentarian, which is deplorable, the Canadiangovernment should take action on irresponsible statement.”\nHe said that a protest had also been registered through diplomatic channel against the remarks but it was necessary to debate the issue in Pakistan’s Parliament too.\nPakistan is enjoying cordial ties with Canada but the remarks againstthe Pakistan state and its institution cannot be tolerated, he said.\nHe alleged that PTI chief Imran Khan is involved in an anti-state campaign outside the country.\nHe said that the government in Pakistan had been changed through legal process andaccording to the constitution.\nThe Minister said that change of government had also been endorsed by Pakistan judiciary and the majority supported the move.\nHe said that, in the incident of Isamophobia in Canada, Muslims from 2017 to 2022 were targeted and killed in various incidents.”During the last five years, Canada is leading in the cases of Isamophobia in G-7 countries.\nThe human rights violations are on the rise in Canada” he added.\nHe expressed displeasure over the silence in human rights violations in Indian IllegallyOccupied Jammu Kashmir, Palestine and against the Muslim living in India.\nThe Defence Minister said what an irony it is that western countries always exercise selective sense of justice and look aside when there is a matter of the rights of Muslims in Kashmir, Palestine and Myanmar.\nHe said it was unfortunate, when the issue of targeting Muslim come, the international human rights institutions showed criminal silence.\nKhawaja Asif said that Pakistan Tehreek-e-Insaf leadership had divided the Pakistan society and overseas Pakistanis.\n“9.5 million Overseas Pakistanis are assets of the country” he added.\nHe alleged that PTI chief Imran Khan had promoted hate inside Pakistan and outside Pakistan. He said that all the country’s institutions had been used by Imran Khan for political victimization.\nLeader of opposition in National Assembly Raja Riaz Ahmed Khan has also condemned parliamentarian remarks against military leadership.\n“The house strongly condemned Canadian parliamentarians remarks against Pakistan institutions and its leadership.”\nFederal Minister for Poverty Alleviation and Social Safety Shazia Marri also called upon the Canadian government to take notice of the irresponsible statement given by a Canadian Parliamentarian against the democratic system of Pakistan.\n“I am truly offended as a Pakistani to hear such an irresponsible statement made on the floor of the Canadian Parliament,” she added.\nShe said the Pakistan government sees the bilateral relationship with Canada as a respect but it does not mean that its parliament should raise questions over the Pakistan’s democratic government and the security institutions.\n“Pakistan is a sovereign nation, Pakistan is a nuclear state, and Pakistan has true democratic system that has to be respected”, she added.\nShe said such statements on the international level are being made only due to the former Prime Minister Imran Khan’s anti-Pakistan and anti-democratic behavior who is telling blatant lies in his interviews with the international media.\nResponding to the grievances expressed by the Muhammad Aslam Bhootani, the minister added that the issues and the grievances of Balochistan needed to be addressed by action not by words.\nShe said the model of Aghaz-e-Huqooq Balochistan introduced by the PPP President Asif Ali Zardari can be adopted to minimize the deprivation of the province.",
  "retrievedAt": "2025-08-11T15:09:40.104Z"
}
