{
  "title": "Promoting Quranic teachings can help build a peaceful society: moot",
  "link": "https://www.app.com.pk/national/promoting-quranic-teachings-can-help-build-a-peaceful-society-moot/",
  "date_published": "2020-11-06T15:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): Speakers at a conference on Friday said the narratives of extremism, hate and terrorism can’t be defeated nor peace and stability can be promoted without adhering to the teachings of Holy Prophet (Peace Be Upon Him).\nThe teachings of Holy Prophet Muhammad (PHUH) are a complete guidance as well as a source of inspiration for every Muslim irrespective of his age, creed or geographical background, they added.\nThe Paigham-e-Pakistan Conference held at Markaz Ahle Sunnat, Jamia Sofia, Planadri, Azad Jammu and Kashmir was organized by MLA AJK and Sajjada Nasheen of Dargah Basahan Sharif Pir Syed Ali Raza Bukhari.\nA number of Ulema, religious scholars and intellectuals also participated in the conference.\nAddressing the event, Pir Syed Ali Raza Bukhari underlined the role of the mosques, prayer leaders and religious scholars, they can play in inculcating the spirit of peaceful coexistence, tolerance and interfaith as well as inter-sect harmony among different segments of the society.\nHe said Islamic culture is based on the Holy Quran, and emphasized the need to promote Quranic teachings to build a peaceful society.\nThe Holy Prophet Muhammad (PBUH in his last sermon preached the lesson of basic human rights, he said, and called for reviewing the curricula to include human rights, which will help counter the trends of violence, extremism and hatred in the society.\nHe said Paigham-e-Pakistan initiative, which was based on a consensus decree by 5,000 clerics with the aim of establishment of peace in the country and eradication of extremism and terrorism in the light of Quran, Sunnah and social principles of Islamic Shariah, was a beacon of hope for all segments of the society and the way forward for the country to march on the path of peace and prosperity.\nOther speakers called for promoting the true message of humanity given in the ‘Charter of Madina’ for salvage of the society caught up in the clash of interests.\nThey called for unity as well as collective measures to counter the growing radical narratives since extremism posed the greatest threat to the peace and stability, social harmony and economic and social development of the country.\nThey stressed that Islam was the religion of peace and those propagating hatred, violence and extremism in the society had nothing to do with the religion.\nThey also called for strengthening religious seminaries in the country by equipping those with state-of-the-art technology and modern education system with a view to make Madaris a place to spread the message of equality, justice, peace and harmony.",
  "retrievedAt": "2025-08-11T19:58:59.476Z"
}
