{
  "title": "November 6,1947 remains as a blot on humanity: President AJK",
  "link": "https://www.app.com.pk/national/november-61947-remains-as-a-blot-on-humanity-president-ajk/",
  "date_published": "2020-11-06T18:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): President Azad Jammu and Kashmir Sardar Masood Khan on Friday said on November 6, remains a blot on humanity, as 73 years ago on this day, tens of thousands of men, women and even children were callously butchered for demanding freedom and liberty.\nOn this day and in the months of October and November 1947, the Dogra Army, Rashtriya Swayamsevak Sangh and the Indian National Army massacred 237,000 Muslims,” he said while talking to PTV.\nReferring to frightening killings carried out by extremist Hindus and RSS goons, aided and abetted by the forces of Maharaja Hari Singh and Indian National Army, the president said it was the first genocide after the Second World War on such a massive scale.\n“From November 4 to 6, Muslim population of Jammu, Kathua, Udhampur and Reasi were viciously targeted. Tens of thousands of people were duped into believing that they were being transported to Pakistan but near Sanba, at the Jammu Sialkot Road, they were all butchered,” he said.\nHe said that Muslims in Jammu were first disarmed, and then killed by marauding hordes in their homes, in the streets and on the roads. Their houses were burnt and businesses destroyed as a result of which 61 per cent Muslim population in Jammu was reduced to 33 per cent.\nReplying to a question, he said Pakistan’s need to expedite its political and diplomatic efforts to make them effective for highlighting Indian atrocities and barbarism which it had adopted against innocent people of Kashmir.\nHe said that The Times of London, at that time, verified that 237,000 Muslims were exterminated in Jammu.\nThe editor of the Statesmen, Ian Stephen, in his book Horned Moon, confirmed the murder of more than 200,000 Muslims in Jammu and historian Horace Alexander confirmed consent of the State authorities for these operations.\n” We will not rest on our oars until we win freedom for Kashmiris and the mission of Jammu martyrs is accomplished,” he said.\nThe AJK president said that India had started vicious terrorism in 1947, and since then the Kashmiri people are being killed for demanding their inalienable right of freedom and living in dignity.",
  "retrievedAt": "2025-08-11T19:58:53.973Z"
}
