{
  "title": "Qureshi urges world community’s role to address HR abuses in IIOJK",
  "link": "https://www.app.com.pk/national/qureshi-urges-world-communitys-role-to-address-hr-abuses-in-iiojk/",
  "date_published": "2020-11-06T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): Foreign Minister Shah Mahmood Qureshi Friday urged the international community to take urgent steps to help address the grave human rights and humanitarian situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“The international community must take urgent steps to help address the grave human rights and humanitarian situation in IIOJK and urge India to comply with its international obligations with regard to the rights of Kashmiri people,” the foreign minister said in his message on the Day marking the Jammu Massacre.\nNovember 6 marks the darkest day in the history of Jammu and Kashmir. On this day, 73 years ago, the Dogra Army backed by the Rashtriya Swayamsevak Sangh (RSS) and the Indian occupation forces systematically martyred more than 237,000 Muslims in the first massive genocide in the post-World War II period in a premeditated effort to exterminate the muslim population of the region and change its demographic structure.\nThe foreign minister said India’s illegal and unilateral actions of August 05, 2019 were a sad continuation of the murderous intent of the Jammu massacre since they were also aimed at reducing the Muslim majority of IIOJK into a minority.\nThey represent a blatant violation of the United Nations Security Council Resolutions and the 4th Geneva Convention.\nHe said during the past seven decades, Indian occupation forces had tried every possible tool of oppression and violated every single right of the Kashmiri people.\nThe foreign minister said IIOJK was faced with the gravest humanitarian crisis anywhere in the world.\nHowever, the foreign minister said that history stood witness to the fact that unabated Indian oppression had failed to break the will of the Kashmiri people.\nThe indomitable spirit and unshakable resolve of the Kashmiri people had only gained in strength as a result of the serious crimes being perpetrated against them by the Indian occupation forces, he added.\n“On this day, as we pay profound respect to the memory of the Kashmiri martyrs of the genocide in Jammu, we call upon the world community to commit to never allow such despicable atrocity to take place again,” he remarked.\nHe resolved that Pakistan would not relent in its support until the Kashmiris realized their legitimate right to self-determination in accordance with the relevant UNSC Resolutions, which called for a free and impartial plebiscite under the UN auspices.",
  "retrievedAt": "2025-08-11T19:59:01.987Z"
}
