{
  "title": "SAPM Dar discusses Kamyab Jawan, Tiger Force initiatives with CM Buzdar",
  "link": "https://www.app.com.pk/national/sapm-dar-discusses-kamyab-jawan-tiger-force-initiatives-with-cm-buzdar/",
  "date_published": "2020-11-06T15:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 06 (APP): Special Assistant to Prime Minister (SAPM) on Youth Affairs Usman Dar called on Punjab Chief Minister Sardar Usman Buzdar at his office on Friday and discussed matters relating to ‘Kamyab Jawan Programme’ and Tiger Force.\nThe chief minister said that youth had been empowered by the PTI government to brighten the future of the country.\nThe past rulers ignored the youth and no large investment was made for their empowerment as being done by the incumbent government, he added.\nHe said Kamyab Jawan Programme would alleviate poverty and more job opportunities would be created as well.\nSimilarly, it was sanguine that the Tiger Force was earnestly engaged in public service.\nHe declared that the opposition’s treacherous narrative had been badly failed.\nThe opposition’s alliance was withering away due to its unbecoming approach of reviling the national integrity.\nUsman Buzdar made it clear that those speaking against the institutions have faced defeat in the past and would meet the same fate in future.\nThe opposition was engaged in a preposterous agenda of weakening the country as it had no other program for the masses, he slammed.\nHe insisted that nobody can look at Pakistan with a malicious eye. Prime Minister Imran Khan was the strong voice of 220 million people of Pakistan and the opposition would have to be answerable for every loot and plunder.\nThe accountability of the thieves and looters was imperative for developing the country, the CM asserted.\nUsman Dar said the Kamyab Jawan Program was going on well while the Tigers Force was leading the mission of public service.\nThe unnatural collusion of opposition parties would soon meet its logical end, he maintained.\nA prescient leader like Imran Khan was imperative for the survival of the country.\nOn the other side, the opposition leaders had a corrupt past, he added.",
  "retrievedAt": "2025-08-11T19:58:59.992Z"
}
