{
  "title": "Overseas Pakistanis pivotal for development of country: NA speaker",
  "link": "https://www.app.com.pk/national/overseas-pakistanis-pivotal-for-development-of-country-na-speaker/",
  "date_published": "2023-02-21T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): National Assembly (NA) Speaker Raja Pervaiz Ashraf on Tuesday said the role of overseas Pakistanis in the socio-economic development of the country was pivotal.\nHe expressed these views during his meeting with a delegation of overseas Pakistanis led by the Minister for Overseas Pakistanis and Human Resource Development Sajid Hussain Turi.\nThe speaker appreciated the hard work and dedication of overseas Pakistanis who were playing important role to keep the country intact on the path of development.\nHe said the incumbent parliament was taking all measures for the welfare of overseas Pakistanis adding that incentivizing skilled labour force to work in other countries would not only contribute to socio-economic development of the host countries but also for Pakistan.\nHe stressed on the need to provide opportunities of learning skills especially in the field of modern technology to people so that they could find suitable jobs in foreign countries.\nThe speaker also said resolving issues of overseas Pakistanis had been the priority of incumbent parliament as “remittances sent by overseas Pakistani bring economic stability in the country.”\nThe minister lauded the concern and support of the NA speaker for the welfare of overseas Pakistanis.\nHe also briefed about important initiatives of government for the facilitation of overseas Pakistanis and to enhance skill laboured force.\nHe said the incumbent government would continue to strive hard for facilitating and resolving the challenges faced by overseas Pakistanis.\nThe delegation was comprised of Shaoquett Moselamane, Dr Muhammad Shahbaz, Chaudhry Rana Iftikhar and Nadeem Ahmad.",
  "retrievedAt": "2025-08-11T06:08:53.774Z"
}
