{
  "title": "ANF seizes over 1679 kg drugs; arrests 34 peddlers",
  "link": "https://www.app.com.pk/national/anf-seizes-over-1679-kg-drugs-arrests-34-peddlers/",
  "date_published": "2023-02-21T08:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): Anti-Narcotics Force (ANF) Pakistan seized 1679.947 kg of drugs and 586.800 liters of hydrochloric Acid (HCL) worth US$ 57.941 million internationally, arrested 34 persons including three women, impounded 13 vehicles while conducting 38 counter-narcotics operations throughout the country during last week.\nANF spokesman said that the seized drugs comprised 97.351 kg heroin, 1404.696 kg hashish, 22.600 kg opium, 154.150 kg methamphetamine (Ice), one kg crystal and 0.150 kg weed.\nANF Balochistan recovered 902 kg of drugs and 586.800 liters of hydrochloric acid (HCL) in nine operations and impounded a vehicle. The seized drugs comprised 70 kg heroin, 682 kg hashish and 150 kg methamphetamine (Ice).\nANF Punjab recovered 13.393 kg of drugs in three operations while arrested three persons involved in drug smuggling and impounded a vehicle.\nThe seized drugs comprised 9.593 kg heroin, 1.800 kg hashish and two kg methamphetamine (Ice).\nANF KPK recovered 621.059 kg of drugs in seven operations while arrested five persons involved in drug smuggling and impounded two vehicles.\nThe seized drugs comprised 621.059 kg of hashish.\nANF Sindh recovered 19.918 kg drugs in six operations while arrested 11 persons including a woman involved in drug smuggling and impounded four vehicles. The seized drugs comprised 0.868 kg heroin, 16 kg hashish, 1.900 kg methamphetamine (Ice), 0.150 kg weed and one kg crystal.\nANF North recovered 123.577 kg of drugs in 13 operations, arrested 15 persons including two women in drug smuggling and impounded five vehicles.\nThe seized drugs comprised 16.890 kg heroin, 83.837 kg hashish, 22.600 kg opium and 0.250 kg methamphetamine (Ice).\nAll cases have been registered at respective ANF Police Stations under CNS Act 1997 (Amended 2022) and further investigations were under process, the spokesman added.",
  "retrievedAt": "2025-08-11T06:09:04.005Z"
}
