{
  "title": "Killing of any non-Muslim cannot be justified under any circumstances: Tahir Ashrafi",
  "link": "https://www.app.com.pk/national/killing-of-any-non-muslim-cannot-be-justified-under-any-circumstances-tahir-ashrafi/",
  "date_published": "2023-02-21T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Tuesday said the protection of non-Muslim holy places was the responsibility of Muslims as well as the state in a Muslim-majority country.\nAshrafi who is also the chairman of Pakistan Ulema Council, in a joint statement, said, “Similarly, it is also the responsibility of non-Muslims to follow the Constitution and laws of land accordingly.” The Constitution and laws of Pakistan had clearly determined the rights of Muslims and non-Muslims therefore, no individual, group, or organization should cross their constitutional parameters, he added.\nHe said killing of any non-Muslim could not be justified under any circumstances nor such action could be supported or endorsed in anyway.\nHe said it was not lawful to build or demolish any worship place without seeking legal permission, adding that some incidents publicized in a section of media were meant to defame Pakistan in the comity of nations.\nAshrafi proposed the government to take immediate action against those individuals, groups or organizations that challenged the writ of the state.\nHe said the PUC leadership strongly condemned the killing of a minority person in Sarai Alamgir (Jhelum) in recent days and urged the Punjab government to fulfil its constitutional responsibility in bringing out the facts into the matter.\nHe said harassment of an individual or minority group could not be allowed as the Constitution and Islamic teachings were clear in this regard.\nAshrafi, during the joint statement, was flanked by Allama Abdul Haq Mujahid, Maulana Muhammad Rafiq Jami, Maulana Asad Zakaria Qasmi, Maulana Nauman Hasher, Maulana Muhammad Shafi Qasmi, Allama Zubair Abid, Maulana Asadullah Farooq, Maulana Haq Nawaz Khalid, Maulana Ubaidullah Gormani, Maulana Muhammad Ashfaq Patafi, Maulana Tahir Aqeel Awan, Maulana Abu Bakr Hameed Sabri, Allama Tahir Al Hasan, Maulana Aziz Akbar Qasmi, Maulana Abdul Sattar, Maulana Aslam Siddiqui, and Maulana Saad Ullah Shafiq.\\932",
  "retrievedAt": "2025-08-11T06:08:48.712Z"
}
