{
  "title": "Steps being taken to empower youth under PMYP: Shaza Fatima",
  "link": "https://www.app.com.pk/national/steps-being-taken-to-empower-youth-under-pmyp-shaza-fatima/",
  "date_published": "2023-02-21T18:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):Special Assistant to the Prime Minister (SAPM) on Youth Affairs Shaza Fatima Khawaja on Tuesday said the incumbent government has initiated a number of programmes to provide favourable business opportunities to the youth, who were a great asset to the country.\nAddressing a ceremony of young start-ups, titled “Future Builder’s Contest”, arranged in collaboration with the UAE embassy, the SAPM said under the Prime Minister Youth Program (PMYP), traditional and non-traditional skills were being provided to the youth aiming at enabling them to play an active role in the development of the country.\n“Youth and women have an important role to play in the development and prosperity of the country as a large part of the country’s population consists of youth and women”, she added.\nHighlighting the role of social media, she said, “this platform is playing an important role in the promotion of constructive activities among the youth.”\nUnder the PMYP, she added, a talent hunt programme had been started across the country and 12,000 youths have participated in the hockey trial held recently.\nShe informed that football and volleyball trials would start across the country on Wednesday and youth should take part in these talent hunts to explore their abilities.\nShe said that Green Youth Clubs have been established in all public sector universities with a special focus on achieving sustainable development goals and promoting innovative ideas among the youth.\nThe SAPM said that under the National Innovation Awards, about 1,000 young start-ups have registered themselves out of which 50 best youngsters will be selected. Ten youngsters will be awarded Rs 1 million while 40 youngsters will be awarded Rs 0.5 million, she added.\nShaza Fatima informed that 100 start-ups will be selected and provided facilities in two phases.\nBesides, she said, a number of other programmes were introduced under PMYP for the welfare of the youth. Laptops were being provided to the youth to equip them with the latest technologies so that they could meet the challenges of the modern world and the use of information technology could be promoted in the country.\nThe SAPM said a mobile application for the youth programme had also been launched to provide information about all the facilities provided under PMYP. Agriculture loans and loans for businesses can also be submitted through this app, she added.\nShe expressed her gratitude towards UAE for their support in the PM youth programme and hoped that the support would continue in the future.\nShe urged the youth of the country to provide a safe working environment to the women, saying that this gesture will help to bring 50% of the country’s population into the mainstream and will also encourage more women to take part in the development of the country.\nAddressing the ceremony as chief guest, Special Assistant to the Prime Minister Ata Tarar said that youth is our real asset but unfortunately their potential was ignored in the past.\nHe said that when budgets are made, our priorities are often misplaced as the political governments gives priorities to the political people and see how a particular project suits and benefit the party.\nWhen the PML-N government started the laptop scheme, there was a lot of opposition; no one agreed that government procure laptops from public funds, but the leadership is all about taking the right decisions at the right time.\nThe current prime minister and the then chief minister Punjab Shehbaz Sharif put his foot down and introduced a scheme that went a long way and everyone realize its importance during the Covid-19 pandemic.\nDuring that time, easy access to the internet was ensured at all the public places of Punjab including schools, colleges, and parks “as we believe that without technology we are nowhere in the world”.\nThese initiatives eventually took the shape and were replicated in the form of the Prime Minister’s Youth Programme that helps to promote and develop the real potential of the youth, he added.\nAta Tarar said that in the recent past, Pakistani start-ups have done a remarkable job and made Pakistan proud in front of the world.\nHe said that Pakistani youth have a lot of potentials and they are earning huge foreign exchange through Amazon and other platforms.",
  "retrievedAt": "2025-08-11T06:08:49.089Z"
}
