{
  "title": "Turkiye thanks Pakistan for humanitarian assistance in wake of earthquake",
  "link": "https://www.app.com.pk/national/turkiye-thanks-pakistan-for-humanitarian-assistance-in-wake-of-earthquake/",
  "date_published": "2023-02-21T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): Turkish Ambassador Dr Mehmet Paçaci on Tuesday expressed gratitude to the leadership and the people of Pakistan for extending humanitarian assistance in the aftermath of the massive earthquake in his country.\nAddressing a news conference, he said the earthquake, centred in the Kahramanmaras province, jolted the southern Türkiye and affected more than 13 million people across 11 provinces, including Adana, Adiyaman, Diyarbakir, Gaziantep, Hatay, Kilis, Malatya, Osmaniye, Sanliurfa and Elazig.\n“It was one of the biggest earthquake disasters in the last century. Many buildings collapsed and the damage was huge,” he said. Neighbouring countries, including Syria and Lebanon were also affected by the earthquakes, he added.\nThe ambassador said yesterday, two more major earthquakes of 6-4 and 5-8 magnitude hit the Hatay province again, resulting in new losses and injuries. To date at least 41,000 people had lost their lives and 105,000 people injured due to the massive earthquakes.\nHe said more than 250,000 search and rescue personnel were currently in the field, whose work was coordinated by the Turkish Disaster and Emergency Management Presidency-AFAD.\nAs regards the international help, Dr Mehmet Paçaci said as many as 102 countries offered assistance while nearly 5,000 personnel from 59 countries were on the ground for search and rescue operations.\nHe said the Government of Pakistan and its people were among the very first responders to the earthquake disaster. From the very beginning, Prime Minister Shehbaz Sharif got in touch with the Turkish authorities, and his recent visit to Adiyaman meant a lot for the people of Turkiye.\nThe PM also announced that every possible support and aid would be provided to Türkiye to heal the wounds of the people of its earthquake-affected areas, the ambassador added.\nLauding other initiatives of the Government of Pakistan, he said the opening of a bank account to collect relief funds for Turkiye and the initial dispatch of some 8,000 blankets and 4,000 winterised tents to the earthquake-hit areas were commendable steps.\nNearly 3,000 winterised tents and 25,000 blankets were on the way to Türkiye by road, he added. “This week and next week more than 4,000 winterised tents will be sent to Türkiye in chartered cargo flights.”\nIn addition to the airway and roadway, he said, a maritime bridge would also be established. A Pakistani Navy ship with 3,500 tents would start its journey from the Karachi Port in the first week of March and arrive at Türkiye-Mersin Port in 13 days.\nDr Mehmet Paçaci expressed the hope that Pakistan, being the leading tent-producing country in the world, would be providing the most needed winterised tents to his country.\nHe said the USAR (Urban Search and Rescue) teams of 84 staff, including army personnel and 1122 rescue teams, were dispatched to Türkiye on the first day of the disaster, and they were among the very first USAR teams to reach the earthquake-affected areas.\n“They have saved many lives, and retrieved 28 people alive from the rubble, including a 10-year-old boy after 137 hours,” he noted.\n“We are receiving hundreds of support messages and calls from also all provinces and walks of Pakistani society. Pakistani NGOs (non-governmental organisations), including Pakistan Red Crescent and universities are also in contact with our embassy and with our consulates-general.\n“We feel their prayers deep in our hearts and we believe that we will overcome this disaster with their invaluable support.”",
  "retrievedAt": "2025-08-11T06:08:48.728Z"
}
