{
  "title": "Nepal, Pakistan  to expand relations for mutual benefit: Envoy",
  "link": "https://www.app.com.pk/national/nepal-pakistan-to-expand-relations-for-mutual-benefit-envoy/",
  "date_published": "2023-02-21T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):Ambassador of Nepal to Pakistan Tapas Adhikari on Tuesday said that Nepal and Pakistan had a huge prospect of further expanding and diversifying relations for the mutual benefit of the two countries and peoples.\nAddressing an event arranged to celebrate the 260th Raising Day of the Nepali Army, he said, “One important facet of the Nepal-Pakistan relations is military-to-military cooperation between the armies. Both the army have close and friendly relations. They support each other in peacekeeping operations.”\nHe said that Nepal and Pakistan enjoyed excellent bilateral relations.\nThe establishment of formal relations in 1960 between the two neighbouring countries had further strengthened it, he added.\nThe envoy said the bilateral relations were based on goodwill, mutual trust and cooperation. He said “Both countries hold similar views on many issues of common interests. People-to-people contacts, trade and economic cooperation are part of bilateral relations.”\nThe ambassador said Nepali Embassy in Islamabad had been working closely to expand and deepen our relations.\nAbout the Nepal Army, he informed the audience that, established in 1762 AD, Nepali Army was one of the oldest and continuously serving army institutions in the world with a rich history of dedication and bravery.\nNepali Army was the main organ of the national security of Nepal and the first standing army in Asia which had a continued and unbroken history since its establishment, he added.\nThe Nepali army is renowned for its professionalism. Over the centuries, Nepali Army has embraced the change in accordance with the change of time and political will of the country and taken up new and emerging roles.\nIn addition to its regular responsibility of national security, the Army is also involved in non-traditional jobs such as disaster risk management, and nature conservation as well as in various infrastructure developmental works.\nAs part of Nepal’s commitments to global peace and security, the Nepali Army has regularly contributed to UN peacekeeping operations around the world since 1958.\nIn the last 65 years, more than 145,000 army personnel have contributed to global peace and order. 72 Nepali peacekeepers have made the ultimate sacrifice in the line of duty while serving the United Nations peacekeeping operations.",
  "retrievedAt": "2025-08-11T06:08:57.909Z"
}
