{
  "title": "Defamation case: SC dismisses Imran appeal against striking out of right of defence",
  "link": "https://www.app.com.pk/national/defamation-case-sc-dismisses-imran-appeal-against-striking-out-of-right-of-defence/",
  "date_published": "2023-02-21T15:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): The Supreme Court (SC) on Tuesday announced its detailed verdict on Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan’s appeal against striking out his right of defence in a defamation suit filed by Prime Minister Shehbaz Sharif against him.\nThe three-member bench had heard the appeal and dismissed it with a 2-1 majority while upholding the trial court orders.Justice Syed Mansoor Ali Shah, who was heading the bench, and Justice Amin Uddin Khan dismissed the appeal, whereas Justice Ayesha A Malik dissented with their verdict.\nThe 28-page judgment authored by Justice Syed Mansoor Ali Shah stated that before parting with the order, “We find it necessary to observe that interrogatories serve as a useful tool to shorten litigation and reduce litigational expenses. However, the process of interrogatories has unfortunately been abused in the present case and in fact misused to prolong the trial and add to the expenses. Such an abuse of the process of interrogatories has to be curbed with a heavy hand.\n“The fair use of the process of interrogatories, as said by Justice Walsh,18 should be encouraged, for it would result in considerable saving of time and money and thus be beneficial to the parties of the case as well as to the administration of justice in general. It is high time that our civil courts prove Justice Walsh right!\n“Having examined the contentions of the parties in the light of the record of the case, we find that the contentions of the learned counsel for the respondent are correct, that the conduct of the petitioner has remained willfully contumacious and disobedient throughout the proceedings of the case in the trial court, and that the trial court had not committed any illegality or material irregularity in the exercise of its jurisdiction by making the orders dated 20.10.2022 and 24.11.2022, therefore, the High Court has rightly declined to interfere with them in its revisional jurisdiction under Section 115, CPC.\n“In addition to the said conduct of the petitioner that disentitles him for the indulgence of this Court in its discretionary jurisdiction under Article 185(3) of the Constitution, we find his petitions are without substance on merits as well. The present petitions are, therefore, dismissed and the leave to appeal, declined,” read the judgment.\nThe order further stated, ” This Court has observed in the said case that the practice of granting adjournments in this manner amounts to making a mockery of the law and the court orders, and that such practice must be discontinued. We cannot, by accepting the submission, create a double standard: one for this Court and the other for the trial courts.”\nJustice Ayesha A Malik in her dissented note stated that in a case plagued by adjournments since 2017, the court must weigh the balance between a fair trial and the legitimate grounds for the latest request for adjournment.\n“The courts are entrusted with the responsibility to dispense justice, for which they are under a duty to ensure a timely trial, which duty may have been overlooked in some of the previous instances of adjournment where requests were granted mechanically and without due consideration. However, the petitioner’s recent public shooting and injury at a political rally justified the grant of an adjournment for a reasonable time under the circumstances.\n“The right to defence cannot be struck out without considering all relevant factors, and the court must weigh the balance between a fair trial and the circumstances at hand. The order sheet shows that the court proceeded in a mechanical manner with the case, and granted numerous adjournments without so much as imposing cost so as to discourage the same.\n“No doubt that the courts are overburdened with work and judges are faced with the daunting task of handling a vast number of cases every day, nevertheless, it is the court’s responsibility to manage each case before it diligently by applying the provisions of the procedural law. The striking out of the petitioner’s right to defence, at this stage, while ignoring the legitimate factors in play, would be a gross injustice. The balancing act of justice must be upheld, and under these circumstances, the right to a fair defence must prevail.”\nShe further stated that accordingly, the impugned order dated 07.12.2022 of the High Court and order dated 24.11.2022 of the trial court are set aside; the case is remanded to the trial court to grant reasonable opportunity to the petitioner to file answers to the interrogatories in compliance with the order of 20.10.2022 and thereafter to proceed with the case in accordance with the law.",
  "retrievedAt": "2025-08-11T06:08:48.786Z"
}
