{
  "title": "IHC maintains objections on Imran Khan’s petition against FIR",
  "link": "https://www.app.com.pk/national/ihc-maintains-objections-on-imran-khans-petition-against-fir/",
  "date_published": "2023-02-21T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): The Islamabad High Court (IHC) on Tuesday directed Imran Khan’s legal team to remove the objections of Registrar office in a petition seeking to exclude the terrorism clauses from a FIR against him.\nJustice Mohsin Akhter Kayani, hearing the case, remarked that PTI’s chief Imran Khan had to appear before the court for biometric verification. The court couldn’t trust this petition as well as a fake petition, linked with him which surfaced last day.\nA two-judge bench, comprising Justice Mohsin Akhter Kayani and Justice Tariq Mehmood Jahangiri, heard the case along with the objections of the Registrar office.\nAt the outset of hearing, Justice Kayani remarked that petitioner should move to the anti-terrorism court for the relief. At this, Imran’s lawyer Faisal Chaudhry Advocate said that they had already filrd application to the prosecutor seeking to delete the Anti-Terrorism Act (ATC) sections from the FIR. Justice Kayani asked that whether the court would issue instructions to the prosecutor against the petition.\nThe lawyer said that it was the duty of prosecutor to view that whether the incident fell under ATA sections. He said that the case challan had not been submitted so far as the investigation into the matter was still underway.\nThe court questioned that whether the prosecutor had the authority to remove the ATA clauses from FIR. The court, therefor, maintained the objections of Registrar office and instructed the petitioner to rectify the same.\nThe court said that first the accused should get bail from the trial court, then the high court would view this matter.\nIt may be mentioned that the Registrar office of IHC had raised objections against the petition regarding the lack of biometric verification, missing of verified documents and filling the case with skipping relevant forum.\nThe capital police had registered FIR against Imran Khan and others with regard to the protest outside the building of ECP after decision in Toshakhana case.",
  "retrievedAt": "2025-08-11T06:08:53.295Z"
}
