{
  "title": "Skilled overseas Pakistanis crucial for socio-economic development of country: NA speaker",
  "link": "https://www.app.com.pk/national/skilled-overseas-pakistanis-crucial-for-socio-economic-development-of-country-na-speaker/",
  "date_published": "2023-02-21T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):National Assembly Speaker Raja Pervez Ashraf on Tuesday said the role of overseas Pakistanis in the socio-economic development of the country was crucial.\nTalking to a delegation of Overseas Pakistanis, led by Minister for Overseas Pakistanis and Human Resource Development Sajid Hussain Turi, in Islamabad, he appreciated the hard work and dedication of overseas Pakistanis who were playing an important role to keep the country intact on the path of development and progress.\nWhile appreciating the contribution of overseas Pakistanis, he said that the incumbent Parliament was taking all measures for the welfare of overseas Pakistanis.\nHe also said that incentivizing the skilled labour force to work in other countries would not only contribute to the socio-economic development of the host countries but also to Pakistan.\nHe stressed the need to provide youth with opportunities for learning skills especially in the field of modern technology so that they could find suitable jobs in foreign countries.\nThe speaker also said that resolving issues of overseas Pakistanis have been the priority of the incumbent Parliament.\nHe also said that remittances sent by overseas Pakistani bring economic stability to the country.\nSajid Hussain Turi appreciated the concern and support of Raja Pervez Ashraf for the welfare of overseas Pakistanis.\nHe also briefed the speaker about important initiatives of the government for the facilitation of overseas Pakistanis initiatives of the government to enhance skill laboured force. He said that the incumbent government would continue to strive hard for facilitating and resolving the challenges faced by overseas Pakistanis.\nThe delegation of Overseas Pakistanis was comprised of Shaoquett Moselamane, Dr Muhammad Shahbaz, Ch Rana Iftikhar Nadeem Ahmad, and others.",
  "retrievedAt": "2025-08-11T06:08:48.666Z"
}
