{
  "title": "Speakers urge int’l community to stand with Kashmiri people for self-determination right",
  "link": "https://www.app.com.pk/national/speakers-urge-intl-community-to-stand-with-kashmiri-people-for-self-determination-right/",
  "date_published": "2024-02-04T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP): The speaker at a seminar held by Pakistan’s Embassy in Norway on Sunday urged the international community to stand with the people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) in solidarity with their just struggle for exercise of their fundamental right to self-determination.\nHeld in connection with the Kashmir Solidarity Day observed annually on February 5, the event was attended by Norwegian political figures, academician, religious scholars, social workers, media and members of the Pakistani as well as Kashmiri communities in Norway, according to a press release.\nAmong others also included former politician and Head of Norwegian Immigrants Forum Athar Ali Chaudhary, Associate Professor at University of Oslo, Writer, Researcher and Social Anthropologist Torunn Arntsen Sajjad, Professor Oslo Metropolitan University, journalist & author of multiple books Elisabeth Eide, former politician and Kashmiris’ human rights defendant Lars Rise and former politician, writer and a staunch supporter of Kashmir Cause in Norway, Khalid Mahmood.\nThe speakers also criticized India’s arbitrary laws in IIOJK and highlighted ongoing egregious violations of the human rights of Kashmiris including extrajudicial killings, invasive surveillance, curbs on civil and political rights, suppression of freedom of expression, extraction of resources, ecological destruction, displacement of local residents and forced demographic changes in sheer contravention of international law and 4th Geneva Convention.\nIn their remarks, the speakers shared their reflections on various dimensions of the Kashmir issue.\nIn her remarks, Ambassador of Pakistan Saadia Altaf Qazi thanked the speakers and guests for attending the event and raising their voices in solidarity with the people of IIOJK.\nShe highlighted the role of the international civilian community as an important source of spreading awareness among masses about the IIOJK dispute, which is one of the oldest, unresolved international dispute and has been on the agenda of UN Security Council since 1948.\nShe underscored the continued validity of UNSC resolutions on Kashmir issue and sensitized the participants about the untenability of Indian Supreme Court’s verdict of 11 December 2023 validating Indian illegal actions of 5 August 2019 in utter violation of international law.\nBesides speeches, a song on Kashmir and a micromentary on the plight of Kashmiris incarcerated in IIOJK was also shown to the participants of the seminar.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:14:37.281Z"
}
