{
  "title": "Caretakers leaving, new govt coming after Feb 8 elections: PM",
  "link": "https://www.app.com.pk/national/caretakers-leaving-new-govt-coming-after-feb-8-elections-pm/",
  "date_published": "2024-02-04T18:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar Sunday said the caretaker government would be leaving and the new government would be formed after the elections on February 8, putting behind all the speculation and conspiracy theories of the past months.\nIn an interview with a private television, he said from day one there was no doubt that the elections would be held on time and now this would be happening in coming days after all the speculations.\nThe caretaker government performed its duties according to the constitutional mandate and he would take responsibility for all the decisions taken during its tenure, he added.\nTo a question, he said, “Our democracy is evolving and we are a transitional democracy with all its flaws and weaknesses.”\nParliament would be formed after the polls and it would take up necessary constitutional and legal reforms to strengthen democracy according to suggestions from different strata of society, he remarked.\nThe prime minister said terrorism was a serious issue and its surge happened due to withdrawal of the United States and NATO forces from Afghanistan, who left behind modern weapons which came in possession of terrorist groups.\n“We have taken up a clear position against the terrorist groups and the law enforcement agencies are steadfastly taking on the terrorists with bravery,” he observed.\nThe prime minister said during his tenure, he represented Pakistan at the United Nations and interacted with the world leaders and explained Pakistan’s perspective to them.\nHe said he also met with the Chinese leadership, policymakers and think tanks at the Belt and Road Forum in China to exchange ideas on achieving shared prosperity for humanity.\n“We signed 10 memorandums of understanding with China on increasing cooperation especially on the projects of China-Pakistan Economic Corridor (CPEC).”\nHe appreciated the army chief for the swift, appropriate and measured response in the aftermath of the attack on the Pakistani soil from Iran.\nPakistan de-escalated the situation with Iran and now there was realization that both countries could not afford deterioration in the bilateral relations, he added.\nTo a question, he said his government increased aid to Gaza threefold and with the institutional input, advocated the cause of Palestine from the platform of Organization of Islamic Cooperation (OIC).\nThe Islamic world should unite behind the people of Palestine and the Palestinians should decide for themselves their future course, he opined.\nHe said Pakistan categorically told the European Union countries that the situation in the Gaza would have a long time effect in the arena of international affairs.\nHe said, “After I assumed charge, the biggest crises before me were economy, rising inflation, volatile exchange rate, tax collection, spending of the government and circular debt.”\nHis government stabilized the economy with the crackdown on smuggling and illegal trade of dollars, he told.\n“We kept dollar at Rs 180 and the level of inflation was kept stable and now the economic indicators are better. We took steps for simplification of tax collection system.”\nAbout 35 billion dollars worth of MOUs were signed with the United Arab Emirates and Qatar, he said adding Special Investment Facilitation Council (SIFC) took concrete measures for attracting investment.\nHe said his government in the last cabinet meeting would take up the privatization of Pakistan International Airlines, the First Women Bank and some other state owned entities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:14:20.272Z"
}
