{
  "title": "Right to self determination, a cardinal principle of int’l law: President",
  "link": "https://www.app.com.pk/national/right-to-self-determination-a-cardinal-principle-of-intl-law-president/",
  "date_published": "2024-02-04T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP): President Dr Arif Alvi has said that the right to self-determination is a cardinal principle of international law but regrettably, the Kashmiri people have not been able to exercise this inalienable right.\n“The UN General Assembly annually adopts a resolution expressing unequivocal support for the realization of the right to self-determination for people under foreign occupation,” the president said in a message on the occasion of Kashmir Solidarity Day being observed on February 5.\nHe said the people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) had been struggling to realise their right to self-determination for the last seventy-six years.\n“Today, IIOJK is one of the most militarized zones in the world. Kashmiris are living in an environment of fear and intimidation,” President Secretariat Press Wing, in a press release, quoted the president as saying.\nThe president reiterated that on the Kashmir Solidarity Day, the government and people of Pakistan renewed their unflinching support for their just and legitimate struggle.\nThe Indian occupation forces were engaged in indiscriminate use of force against civilians, he said, adding political activists and human rights defenders faced arbitrary detention and confiscation of properties.\nThe political parties, he said, representing the genuine aspirations of the Kashmiri people, were being banned. These oppressive measures were aimed at crushing dissent in IIOJK.\nThe president noted that India was also taking steps to consolidate its occupation of IIOJK.\nFollowing its illegal and unilateral actions of 5 August 2019, India’s efforts have been aimed at engineering demographic and political changes so that the Kashmiris were transformed into a disempowered community in their own land, he added.\nThe president said the Indian Supreme Court’s judgment of 11 December 2023 was yet another manifestation of India’s desire to undermine the right to self-determination of the Kashmiri people.\nThe president demanded that India must end its gross human rights violations in IIOJK; reverse its unilateral and illegal actions of 5 August 2019; repeal draconian laws; allow UN-mandated investigations into cases of human rights violations, and implement the relevant UN Security Council resolutions on Jammu and Kashmir.\n“I wish to reiterate that seeking a just resolution of the Jammu and Kashmir dispute will remain a key pillar of our foreign policy,” he added.\nThe president further reaffirmed that Pakistan would continue to lend unstinted moral, diplomatic and political support to the Kashmiri people till the realisation of their right to self-determination, as enshrined in the relevant UN Security Council resolutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:14:37.478Z"
}
