{
  "title": "No zoo in Islamabad violating IHC verdict please: Experts",
  "link": "https://www.app.com.pk/national/no-zoo-in-islamabad-violating-ihc-verdict-please-experts/",
  "date_published": "2024-02-04T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP): The concerned citizens and experts have urged the Capital Development Authority (CDA) to refrain from violating the Islamabad High Court (IHC) verdict on the Islamabad Zoo.\nMoving a summary to the Federal Cabinet to reestablish the zoo in Islamabad will be a sheer violation of the IHC verdict, and it should be challenged in the court.\nThey said CDA will be opposed for its connivance to cage the wild animals or to chain them again. It is the worst form of cruelty in the absence of technical and financial capacity of the CDA to regain the land to establish the zoo.\nAn online discussion on the subject was organized by the Devcom-Pakistan (Development Communications Network) and DTN on Saturday afternoon, a news release said.\nThe well-known biodiversity expert Z B Mirza Said: CDA cannot fool the cabinet to take a favourable decision on its summary in the presence of IHC verdict that had clearly asked “to end the cruelty against the animals, and free the animals in their habitats”.\nHe said the CDA attempt to reestablish the zoo in Islamabad and grabbing the land is “mischievous by the dishonest officials”. They know they cannot do it but only after misguiding the Federal Cabinet. The biodiversity lovers will not support any uncalled-for decision by the CDA Board or the Federal Cabinet.\nAnother senior biodiversity expert Dr. Ejaz Ahmed said: Though zoos play an important role in education and awareness regarding different species and their behavior, if animals are kept with care.\nBut we have seen that due to poor management and care, the majority of species are depressed and kept in a very unhygienic environment which results in their poor health conditions and strange behavior.\nWe have seen that in the past animals like elephants in Karachi, Lahore and Islamabad were not treated well, they were tied with chains resulting in permanent injury and ultimately had to be sent out of Pakistan for treatment.\nRina Saeed Khan, Islamabad Wildlife Management Board chairperson, said:  The reopening of Islamabad zoo should not be brought onto agenda of last cabinet meeting without thoroughly consulting law and climate change ministries. The now-closed Islamabad zoo was handed over to Islamabad Wildlife Management Board in July 2019 by the Federal Cabinet following the Islamabad High Court orders given all the deaths of animals inside the old zoo.\nShe said, “In 2020 when the Islamabad Zoo was shut down by the landmark judgment of the IHC under the writ petition number 1155/2019 which was not challenged, the IWMB converted the site into the only wildlife rescue center of its kind in Pakistan, helping all species of wild animals in distress.\nSince its formal inception in 2021, the centre has successfully rescued and rehabilitated approximately 381 animals. IWMB rescues orphaned and injured wildlife in order to implement the IHC order in the judgment of WP 1155/2019 which specifically states that “No animal is treated in a manner that subjects it to unnecessary pain and suffering”.\nShe said the IWMB Board has also approved detailed plans, in consultation with international experts of Join Hands, an INGO, to open a Visitor Information Centre for the public as part of the Margalla Wildlife Centre. On January 29th 2024, without consulting or informing IWMB, CDA Board decided to “reclaim” the Islamabad zoo and re-open it as a zoo “of international standards” during their meeting.\nThe CDA Board was misinformed that “IWMB had failed to make use of the facility”. The CDA Board has now approved the proposal and asked officials concerned to approach the federal government with their request to take back administrative control of the now closed zoo. This is clearly against the IHC orders.\nAn environmentalist and Devcom-Pakistan Executive Director Munir Ahmed said: IHC verdict cannot be violated in any case by anyone, the concerned citizens will protest against it if done by the CDA or the Federal Cabinet. In the past, we have seen caged animals living in miserable conditions. CDA had failed to impart any wildlife education previously, and it has no technical, managerial or financial capacity to run the zoo again. So, citizens will not allow CDA to repeat the same misery again.\nIWMB can do the children’s learning about the wild animals through screening of films and pictorial lectures once the government gives funds to make the new Visitors Centre at the location of the old zoo. It has turned into a wonderful park now where relevant tableaus can also be staged.\nAn environmental journalist Afia Salam said: Make wildlife learning centres not zoos. Things change, people and their opinions change. What was ok then, may NOT be right now. Like many other things, this goes for the question of having a zoo or not. There is a resurgence of conversation about ‘recreating’ a zoo in Islamabad. This after the previous one had to be closed due to the ignominy it earned for the terrible conditions for animals which garnered international attention through ‘Save Kavaan’ campaign.\nShe said Zoos are so last century. The way they are in our country, we have not moved out of that century. We have wild animals living in pathetic conditions, mostly malnourished, oftentimes diseased, with not enough trained caregivers. So, no zoos please.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:14:59.805Z"
}
