{
  "title": "Two more test positive for mpox in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa health department has detected two more mpox cases in the provincial capital, taking the total number of patients infected with zoonotic ailment in the province this year to five.\n\nBoth cases, one aged 42 and the other 20, were admitted to the dermatology OPD of the Khyber Teaching Hospital a few days ago after doctors suspected them of having mpox symptoms, officials told Dawn.\n\nThey said chairman of the dermatology ward Dr Mehran Khan sent samples from the suspects for examination to the public health reference lab where they were found to be suffering from the zoonotic disease.\n\nThe officials said the directorate of public health at the directorate-general (health services) had started screening of their closest contacts to find if the infection had been transmitted to others.\n\nScreening of their closest contacts begins, say officials\n\nThey said the 42-year-old had arrived from Saudi Arabia a few days ago and visited the hospital for skin problems, while the other had contracted the disease from someone who had come in from Dubai.\n\nThe officials said the person suspected of transmitting mpox was tested but was found to be negative.\n\n“Both cases have been isolated and their contacts are being traced by testing,” Dr Mussawir Manzoor, deputy director (public health), told Dawn. He said both patients had been infected from sources abroad and had nothing to do with local infection.\n\nThe official said all aspects were being checked to ensure that the infection doesn’t spread.\n\n“We have altered the relevant health authorities to contact the families of cases and test them in case they are symptomatic,” he said.\n\nDr Mussawir said that the province had recorded 14 mpox cases, including five in 2025, seven in 2024 and two in 2023.\n\nHe said due to a strong surveillance system, the infection hadn’t spread to the local population.\n\n“As per protocol, all patients are isolated and released only when their tests emerge negative,” he said.\n\nThe official said most cases had been identified at the Bacha Khan International airport on arrival from the Middle East and the suspected ones were isolated after screening and subsequent testing at the public health reference lab (PHRL) at the Khyber Medical University.\n\nHe said all cases, including the fresh ones, had epidemiological connection with the Middle East but the department had already introduced a surveillance system at the district level to ensure that the disease doesn’t spread.\n\nDr Mussawir said the latest patients belonged to Peshawar district.\n\nHe said that the department had written a letter to the airport manager seeking details of the passengers who sat close to the 42-year-old in the airplane so they could be screened and tested for mpox.\n\nHe said that there was a lot of awareness among people as they kept distance from the patients due to which the chances of local spread of the infection were zero.\n\nDr Mussawir said that the Khyber Teaching Hospital had played a vital role in identification of patients and their testing.\n\nHe said the first mpox case in the province was examined and identified by Dr Mehran Khan at KTH in 2023.\n\n“Our province also has the advantage of PHRL where tests are processed in 24 hours’ time. Prior to establishment of PHRL, we used to send specimens to the National Institute of Health, Islamabad which took longer to provide results,” he said.\n\nThe official said the department had already issued guidelines to all district headquarters hospitals regarding the signs and symptoms of mpox patients and collection of specimens from them.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:50:50.678Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896475/two-more-test-positive-for-mpox-in-kp",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:23:07.000Z"
}
