{
  "title": "Digital Confusion Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ON Jan 29, 2025, Pakistan enacted the Digital Nation Pakistan Act, 2025, with the avowed aim of transforming Pakistan into a “digital nation” by enabling a digital society, digital economy, and digital governance.\n\nThe Act was immediately hailed by sections of the Pakistani media as a “legislative milestone” and a “ground-breaking initiative”, and for laying out “a structured approach” for redefining Pakistan’s digital landscape and thereby accelerating economic development, enhancing public service efficiency, and fostering citizen well-being. These laudable aims invite a closer look at the Act, to discover the provisions that give rise to these heightened expectations of imminent progress.\n\nWhile the preamble of the Act confirms these aspirations, the 30 sections that follow achieve little more than the setting up of three distinct yet overlapping regulatory bodies to bring about this digital transformation. The first of these is the National Digital Commission, which has the mandate of approving the substance and strategy for delivery of the National Digital Masterplan; to ensure coordination amongst federal, provincial and sectoral bodies; and to review cases of non-compliance.\n\nThe second is the Pakistan Digital Authority, whose task is to develop, update and implement the Masterplan; and the third is an Oversight Committee, established to independently review the performance of the Pakistan Digital Authority and to report to the Commission.\n\nThese bodies themselves are dominated by the government and the bureaucracy. The 18-member Commission is essentially a ministerial coordination body, comprising the prime minister, provincial chief ministers, and ministers in charge of IT and telecom, planning and development, commerce, interior, economic affairs, and information and broadcasting. Chairpersons of FBR, Nadra, PTA, SECP, State Bank and the proposed Pakistan Digital Authority are also permanently represented on the Commission, whilst the Commission has the power to invite others it deems necessary.\n\nThe proposed Authority appears to be the operational arm of the Commission; however, in actual fact, it seems to be an extension of the prime minister, who has the exclusive authority to appoint, and remove, its three members. The Oversight Committee, comprising mainly of secretaries from the IT, finance, and planning ministries already represented at the Commission, comes across as a subset of the Commission.\n\nThe Digital Nation Pakistan Act hides more than it reveals.\n\nOnly two points in this elaborate, and expensive, regulatory framework suggest that this structure is actually linked with digitalisation of the society and economy of the country. The first is in the inclusion of chairpersons of certain regulatory authorities in the list of permanent members of the Commission, and the second is in the requirement that members of the Authority be “eminent professionals with recognised expertise and integrity”, with at least a Bachelor’s degree and a minimum of 10 years of experience “in digital transformation, technology policy, and governance”.\n\nHowever, even these two points are weak. Firstly, the failure to include the chairperson of the Competition Commission of Pakistan (CCP) as a permanent member of the National Digital Commission suggests that the drafters are unaware of the critical need to balance competition and innovation in the digital economy. Secondly, the vague eligibility requirements for members of the Authority hints at a fundamental lack of clarity as to the specific mandate of the Authority.\n\nThis focus on bureaucracy over the substantive objectives of digitalisation is all the more surprising given that in its 2018 Digital Pakistan Policy, the IT and telecom ministry had not only clearly identified the policy objectives, laid out the legislative, infrastructure development and education strategy, and indicated the socioeconomic sectors that would be the focus of digitalisation, but had also emphasised the importance of fostering a competitive digital economy.\n\nHowever, the Act seems to be motivated by the need to consolidate the government’s ownership and control of the digitalisation process rather than on building on the clarity of the 2018 policy and providing appropriate legal frameworks for implementing the digital policy goals already articulated in it.\n\nThe champions of the Act may well argue that it is only intended to establish the infrastructure for the cohesive digital transformation of the country rather than to provide granular details of how this transformation may be carried out.\n\nHowever, they would be unable to explain why in the presence of a comprehensive infrastructure of state — also headed by the prime minister — it is necessary to establish a parallel set-up which is not made answerable either to the legislature or the judiciary. They would also not be able to clarify how an authority comprising only three members of unspecified expertise will have the capacity to define the strategic framework and priority areas for digital transformation, let alone monitoring compliance with the Masterplan and sanctioning non-compliance.\n\nMost importantly, these champions will not be able to explain the shortcomings of the Act in respect of the digital economy. For instance, how, in the absence of any guidance in the Act, would the Masterplan devised by the Authority balance the competing priorities of integrating Pakistan into the international digital economy while fostering domestic innovation and protecting data privacy of Pakistani citizens?\n\nThey will also not be able to clarify what value even the most well-crafted domestic policy would have against the ever-increasing momentum of the global digital economy or dismiss the considerable regulatory burden that the slow-moving, top-down, and bureaucratic procedures prescribed in the Act would place on emerging Pakistani platforms as they try to gain a foothold in the rapidly evolving global digital space.\n\nHowever, the aim of this discussion is not to argue that the Digital Nation Pakistan Act should not have been enacted but to highlight that the Act hides more than it reveals.\n\nTherefore, even as the National Digital Commission, the Pakistan Digital Authority and the Oversight Committee enter the Pakistani regulatory landscape, which already has such well-established regulators as the SECP, Nepra, Pemra, Ogra, and CCP, not only do their activities remain opaque but also, and more worryingly, beyond legislative and judicial accountability.\n\nThe writer is a barrister, an advocate of the Supreme Court of Pakistan and holds a PhD in law from University College London. She presently teaches competition law at the University of Manchester.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cb98f770cbc.jpg",
  "retrievedAt": "2025-08-25T15:02:30.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896580/digital-confusion-pakistan",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:23:14.000Z"
}
