{
  "title": "Senate chairman vexed over PTI lawmaker’s absence despite production orders - Pakistan - DAWN.COM",
  "author": null,
  "content": "Senate Chairman Yousuf Raza Gilani on Saturday expressed his displeasure as only PTI Senator Aon Abbas Bappi was presented in the parliament, despite him also issuing production orders for incarcerated PTI Senator Ejaz Chaudhry, and referred the matter to the Privileges Committee.\n\nChairman Gilani had issued production orders for senators Bappi and Chaudhry yesterday, instructing authorities to ensure their presence in today’s Senate session.\n\nIn a ruling issued today, Gilani stated: “Such disregard for parliamentary authority cannot be allowed to persist unchecked, as it threatens the institutional integrity of the Senate and the broader democratic framework.\n\n“I hereby refer the matter of non-implementation of the production orders concerning Senator Ejaz Chaudhry to the Privileges Committee for its consideration and report,” he added.\n\nStating that Senator Abbas was presented, Gilani ruled: “However, yet again, the directives concerning Senator Ejaz Chaudhry have not been fulfilled, amounting to non-compliance with the lawful orders of the Chair.”\n\nThe ruling further noted that disobedience of the Senate chairman’s orders constituted a “breach of privilege” as per rule 71 of the Rules of Procedure and Conduct of Business in the Senate 2012.\n\n“This is not an unprecedented situation,” Gilani said, recalling that he was “compelled” to refer the matter to the Privileges Committee when a similar situation arose during his tenure as the National Assembly speaker from October 1993 to February 1997.\n\n“As chairman [of the] Senate, my only endeavour is to uphold the supremacy of Parliamentarian, Rule of Law and Constitutional dictates,” he stated.\n\nYesterday’s production order issued for Chaudhry, who is imprisoned at Lahore’s Kot Lakhpat Jail, was the third one. None of the previous two orders could be implemented.\n\nIn January, Gilani issued a production order for the PTI senator, who has been incarcerated for around 20 months, so that he could attend the Senate session on January 14. However, Chaudhry failed to appear in the Senate session, where opposition lawmakers held placards with pictures of the missing senator.\n\nChaudhry was arrested for the first time on May 11, 2023. He was taken into custody under Section 3 of the Maintenance of Public Order in connection with May 9 violence. The Islamabad High Court had declared his detention under the MPO invalid, following which he was re-arrested on May 25 and taken to Lahore.\n\nSpeaking on the floor of the House today after he was presented there on Gilani’s order, Senator Bappi presented his version of his arrest made on March 6 from his residence in Multan.\n\nDuring Thursday’s Senate session, PTI lawmakers had registered a strong protest as Opposition Leader Syed Shibli Faraz raised the issue of Bappi’s arrest and alleged manhandling.\n\nSubsequently, the law minister informed the upper house of parliament that the PTI senator had been arrested by the Bahawalpur police in a case registered by the Punjab Wildlife Department for illegally hunting Chinkara deer in Cholistan.\n\nAt the outset of his speech today, Bappi thanked Gilani for his “principled stance”, noting that the Senate chairman had said not to preside over the proceedings if both PTI senators were not produced before the House today.\n\nThe PTI legislator also appreciated Law Minister Azam Nazeer Tarar for his “stand”, saying “some of the hardships and oppression” against him started easing after that.\n\nHe recalled that a Senate session had been summoned for Thursday but he had other engagements planned prior. Hence, he had requested that Agenda No.14 that he was to present be deferred to the next day.\n\n“Maybe if I had attended the session, this incident [arrest] would not have taken place and I would be sitting here […] but it happened that I was at home that day,” the PTI senator recalled.\n\nBappi said that around 20 individuals came at his house at around 8:30am on March 6. “They first broke my front door, then they tied up all my houseworkers at one place,” he alleged.\n\nWithout naming any law enforcement agency, the PTI senator claimed that a “joint operation” was conducted as his factory was raided as well. He added he was sleeping in his room with his wife when “they banged the door so forcefully that the lock broke and they just entered”.\n\nBappi said his mobile phones were sought but as he did not remember where he had kept them, the individuals had threatened to jail his 16-year-old son along with him if the devices were not handed over. However, his son was let go once a houseworker gave his mobile phones, he added.\n\nDetailing his subsequent court appearance, Bappi said he was then sent on a one-day remand. Comparing the case against him to older ones filed against Fawad Chaudhry and Shehryar Afridi, he termed the hunting charges “respectable FIR”.\n\nThe PTI senator went on to say that his “fault” was running a campaign against inflation in south Punjab, “staying loyal to [PTI Founder] Imran Khan”, and raising his voice for incarcerated PTI leaders.\n\n“These are my faults for which I have faced punishment for two days and might face it in the future as well.”\n\nIn his ruling issued today, Gilani noted there had been no intimation of the case against Bappi as provided under Rule 79 of the Rules of Procedure and Conduct of Business in the Senate 2012, reflecting a “clear violation of established parliamentary procedures and disregard for institutional protocol”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/081504516679f6d.png",
  "retrievedAt": "2025-08-25T15:02:30.691Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896617/senate-chairman-vexed-over-pti-lawmakers-absence-despite-production-orders",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T08:33:20.000Z"
}
