{
  "title": "PM Shehbaz assures businesspersons of favourable environment - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Mi­nister Shehbaz Sharif on Fri­day said his government was working to provide a conducive environment for investment and business in Pakistan.\n\nIn a meeting with leading businesspersons of the country, the PM commended their efforts for the country’s development.\n\nHe also acknowledged their role in creating employment opportunities in Pakistan.\n\nThe prime minister said the journey towards economic improvement and reforms in all sectors will continue in consultation with business leaders. He emphasised that the consultative process with the business community was aimed at further accelerating economic development.\n\nThe businesspersons exp­ressed their “complete confidence” in the government’s policies, according to an official statement released after the meeting.\n\nSays govt will celebrate 10 years of President Xi’s ‘historic’ 2015 visit\n\nThey commended the government for establishing the National Seed Development Authority to provide quality seeds for the development of the agriculture sector.\n\nThe participants also lau­ded the Green Pakistan Initi­ative, the statement said. They no­­ted that Pakistan’s IT industry was making its mark on the international stage due to the government’s policies.\n\nThe businessperson presented their suggestions and proposals regarding various sectors. The prime minister direc­ted the relevant ministries to consult businesspersons to prepare for the sector-specific meeting to be held next week.\n\nMeeting with Chinese envoy\n\nThe ambassador of China to Pakistan, Jiang Zaidong, met Prime Minister Sharif.\n\nThe PM conveyed his greetings and good wishes to Chin­ese President Xi Jinping and Premier Li Qiang. He congratulated the Chinese leadership for successfully convening the “Two Sessions” of the National People’s Cong­­re­­ss and the Chinese People’s Political Consultative Conference.\n\nThe “two sessions” are the annual meetings of China’s top legislature, the National People’s Congress and the top political advisory body, the National Committee of the Chinese People’s Political Consultative Conference.\n\nWhile expressing his satisfaction over the positive trajectory of Pakistan-China bilateral strategic relations, the PM thanked China for its longstanding and steadfast support to Pakistan on all core issues.\n\nHe also reaffirmed Pakis­tan’s “consistent and unflinching support to China” and said that the leadership and people of both countries were “determined in their shared resolve to further strengthen the Pakistan-China ‘All Wea­ther Strategic Cooperative Partnership’.”\n\nThe progress on security and counter-terrorism cooperation between both countries was also discussed.\n\nThe PM said this year mar­ked the tenth anniversary of President Xi Jinping’s “histo­ric” visit to Pakistan in 2015.\n\nIn this regard, the prime minister issued directions to ensure that this occasion was celebrated in Pakistan. He also invited President Xi Jinping to visit Pakistan.\n\nWhile praising the government’s achievements in imp­roving the macroeconomic situation, the ambassador affirmed Beijing’s commitment to extend full support and cooperation to Pakistan.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/081030461bb585f.jpg",
  "retrievedAt": "2025-08-25T15:03:02.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896533/pm-shehbaz-assures-businesspersons-of-favourable-environment",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:22:02.000Z"
}
