{
  "title": "3 terrorists killed in intelligence-based operation in KP’s Tank district: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security personnel killed three terrorists in an intelligence-based operation in Khyber Pakhtunkhwa’s Tank district on Saturday, according to a statement from the military’s media wing.\n\nAccording to the Inter-Services Public Relations (ISPR), security personnel conducted the operation upon the reported presence of terrorists in the area.\n\nIt added that the security forces “effectively engaged” the terrorists at their location, due to which three were “sent to hell”.\n\nThe ISPR said weapons and ammunition were also recovered from them, adding that they were actively involved in numerous terrorist activities against the security forces, as well as innocent civilians.\n\nThe ISPR said a sanitisation operation was being conducted to eliminate any other terrorists found in the area. “Security forces of Pakistan are determined to wipe out the menace of terrorism from the country,” the statement concluded.\n\nPresident Asif Ali Zardari lauded the security forces for carrying out the operation.\n\nHe said operations against terrorists would continue till the complete eradication of the menace from the country.\n\nHe said the whole nation stood with the security forces in the war against terrorism.\n\nPrime Minister Shehbaz Sharif similarly appreciated the security forces and paid tribute to them.\n\n“We are fully determined to completely root out terrorism from the country,” he said.\n\nInterior Minister Mohsin Naqvi praised the timely action of the security forces, stating that they demonstrated professional expertise by eliminating three terrorists.\n\nNaqvi commended the security forces for their successful operation and said the nation took pride in their professional capabilities.\n\nHe said security forces deserved appreciation for thwarting the nefarious intentions of terrorists, adding that their efforts to maintain peace and stability were commendable and the entire nation stood with them in the fight against terrorism.\n\nNaqvi reaffirmed that operations would continue until the complete elimination of terrorists.\n\nEarlier this week, 16 terrorists were killed while five soldiers were martyred as security forces responded to a terrorist attack on the Bannu Cantonment in KP’s namesake district.\n\nTe­r­rorists had rammed two exp­losives-laden vehicles into the perimeter of the Bannu Cantonment in an attempt to enter the high-security zone on Tuesday evening. Thirteen civilians lost their lives, while another 32 were injured as a result of a mosque and a residential building suffering “severe destruction” due to the suicide blasts, causing the perimeter wall to partially collapse.\n\nFebruary saw a marginal increase in terrorist attacks but a sharp surge in civilian casualties, according to a report published by the Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (PICSS).\n\nThe report tallying terrorist attacks across Pakistan in February was published after a suicide bomber rammed an explosive-laden vehicle into a military convoy in North Waziristan last week, martyring two soldiers and injuring 10 others.\n\nAccording to PICSS, the country witnessed 79 terrorist attacks last month, resulting in the deaths of 55 civilians and 47 security personnel, while 45 civilians and 81 security personnel were injured. Security forces, meanwhile, intensified counter-terrorism operations, eliminating 156 terrorists, injuring 20, and arresting 66, it said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:02:25.701Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896641/3-terrorists-killed-in-intelligence-based-operation-in-kps-tank-district-ispr",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T17:41:06.000Z"
}
