{
  "title": "532 Alawites killed by Syrian security forces, allies: monitor - World - DAWN.COM",
  "author": null,
  "content": "A Syrian war monitor on Saturday said security forces and allied groups killed 532 Alawite civilians over the past days, revising a previous toll of 340.\n\nRestoring security has been one of the most complex tasks for Syria’s new authorities, installed after forces ousted Assad — himself an Alawite — in a lightning offensive in December.\n\nThey are now facing their fiercest attacks yet by members of the Assad clan’s Alawite minority and have launched a major counter-operation in the ethnic group’s Mediterranean heartland.\n\nThe Syrian Observatory for Human Rights reported that “532 Alawite civilians were killed in the Syrian coastal areas and the Latakia mountains at the hands of security forces and allied groups” since Thursday, when deadly clashes broke out between security forces and gunmen loyal to toppled president Bashar al-Assad.\n\nEarlier on Saturday, the monitor reported that more than 300 civilians from the Alawite minority were killed in recent days by security forces and their allies in the clashes.\n\nThe Observatory indicated they were killed in “executions” carried out by security personnel or pro-government fighters and accompanied by “looting of homes and properties”.\n\nThe killings followed clashes sparked by the arrest of a wanted individual by security forces in a predominantly Alawite village, the Observatory reported.\n\nThe monitor said there had been a “relative return to calm” in the region on Saturday but that security forces were continuing sweeping operations and deploying reinforcements.\n\nEarly on Saturday, state news agency SANA reported that the security forces had repelled an “attack by remnants of the ousted regime” on the national hospital in the coastal city of Latakia.\n\nIn an address on Friday, Syria’s interim President Ahmed al-Sharaa urged the insurgents to “lay down your weapons and surrender before it’s too late”.\n\nWestern powers and Syria’s neighbours have emphasised the need for unity in the new Syria, which is seeking funds for reconstructing a nation ravaged by years of civil war under Assad.\n\nThe coastal region has been gripped by fears of reprisals against Alawites for the Assad family’s brutal rule, which included widespread torture and disappearances.\n\nThe Britain-based Observatory has reported multiple “massacres” in recent days, with women and children among the dead.\n\n“The vast majority of the victims were summarily executed by elements affiliated to the Ministry of Defence and the Interior,” the rights group said on Friday.\n\nThe Observatory and activists released footage showing dozens of bodies in civilian clothing piled outside a house, with blood stains nearby and women wailing.\n\nOther videos appeared to show men in military garb shooting people at close range.\n\nAFP could not independently verify the images.\n\nThe United Nations envoy for Syria, Geir Pedersen, decried “very troubling reports of civilian casualties”.\n\nHe called on all sides to refrain from actions which could “destabilise Syria, and jeopardise a credible and inclusive political transition”.\n\nAron Lund of the Century International think tank said the violence was “a bad omen”. The new government lacks the tools, incentives and local base of support to engage with disgruntled Alawites, he said.\n\n“All they have is repressive power, and a lot of that […] is made up of jihadist zealots who think Alawites are enemies of God. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/08165337c3e2818.jpg",
  "retrievedAt": "2025-08-25T15:02:26.806Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896628/532-alawites-killed-by-syrian-security-forces-allies-monitor",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T11:54:56.000Z"
}
