{
  "title": "Wheat crop at risk as dams nearly dry - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Tarbela, Mangla reservoirs rapidly approaching dead levels\n• Breadbaskets of Punjab, Sindh warned of 35pc water shortage\n• Irsa hopes more rain in coming days will help improve situation\n\nISLAMABAD: With the Tarbela and Mangla dams rapidly approaching their dead levels, the Indus River System Authority (Irsa) on Friday warned Punjab and Sindh — the two major bread baskets — to brace for up to 35 per cent water shortages in the last leg of the current crop season.\n\nIn a letter to irrigation secretaries, the water regulator told the four provinces that both reservoirs were close to their dead levels.\n\n“There is the likelihood that provinces of Punjab and Sindh may face a shortfall of 30-35pc while operating the reservoirs on run-of-the-river mode at or around dead levels,” wrote Irsa’s Director of Regulation Khalid Idrees Rana.\n\nAccording to Irsa’s latest data, Tarbela Dam had only 73,000 acre-feet of water storage, with its level recorded at 1,409 feet, just nine feet above its dead level of 1,400 feet.\n\nThe dam, which has a maximum storage level of 1,550 feet, was receiving 17,000 cusecs of inflow against an outflow of 20,000 cusecs on Friday.\n\nMangla Dam had a live storage of 235,000 acre-feet, with its level at 1,088 feet, just 28 feet above its dead level of 1,060 feet. The dam, whose maximum conservation level is 1,242 feet, was receiving 16,400 cusecs while releasing 18,000 cusecs on Friday.\n\nThis suggests that both reservoirs are depleting fast.\n\nIrsa told the provinces that it was evident from daily discharge data that the Tarbela and Mangla reservoirs “may touch their dead levels in the next few days”, as Irsa had already anticipated at the start of the Rabi season on Oct 2, 2024, when it estimated the storage reaching dead level in first 10 days of March 2025.\n\nDepletion of reservoirs to dead level is a usual phenomenon and could happen twice a year. However, the wheat crop, already faced with lower-than-targeted sowing due to changing government policies, is currently at a critical stage of last watering and should be readying for harvest by the end of this month.\n\nRecent rains\n\nIrsa, however, noted that recent rains had a positive impact on standing crops. “Fortunately, the recent rain spell contributed positively to the Indus Basin Irrigation System (IBIS) and currently, supplies close to the indents are being released for the provinces, keeping in view the water shortages accounted for in the Water Accounts Report,” it said.\n\nThe authority said that as per the Water Accounts Report for the period Oct 01, 2024, to Feb 28, 2025, Punjab faced a shortfall of 20pc, while Sindh, during a similar period, faced a shortfall of 14pc against the anticipated shortfall of 16pc approved by the Irsa Advisory Committee on Oct 2, 2024.\n\nTherefore, the water regulator hoped that more upcoming rain spells would positively contribute to the system. It has asked the provinces to take necessary precautionary measures to avoid any untoward situation.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cb66edb7c98.jpg",
  "retrievedAt": "2025-10-12T01:51:28.970Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896559/wheat-crop-at-risk-as-dams-nearly-dry",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:21:49.000Z"
}
