{
  "title": "10 terrorists arrested as Punjab CTD conducts 73 operations - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab’s Counter-Terrorism Department (CTD) has arrested 10 terrorists following 73 intelligence-based operations (IBOs) across the province, the law enforcement agency said in a statement on Saturday.\n\nThe CTD regularly carries out operations across the province to prevent and investigate terrorism-related activities and gather intelligence. Operating under the provincial police department, the Punjab CTD plays a key role in maintaining internal security and countering terrorism within the country.\n\nThe statement quoted a CTD spokesperson as saying, “The CTD conducted 73 IBOs in different cities of Punjab due to the terror threat.”\n\n“10 terrorists arrested during the intelligence-based operation[s].”\n\nThe operations were conducted in Rawalpindi, Toba Tek Singh, Khushab, Bahawalnagar, Rahim Yar Khan, Rajanpur, Bhakkar and Jalam, according to the spokesperson.\n\nTwo dangerous terrorists, affiliated with the proscribed Tehreek-i-Taliban Pakistan (TTP), were arrested from Khushab and Jhelum, the statement said.\n\nThe CTD recovered explosives, an IED bomb, a detonator, 35 feet safety fuse wire, pamphlets, cash and mobile phones.\n\nThe terrorists were identified as Riaz, Shafiq, Rashid, Javed, Zaheer, Zaheeruddin, Hafeez, Wazir, Asif and Waheed.\n\nThe statement further said, “The terrorists wanted to spread fear and panic among the people by carrying out operations at different places.”\n\nIt added that 107 suspects were arrested during 758 combing operations and 30,394 people were questioned in those conducted in the past week.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in Khyber Pakhtunkhwa and Balochistan, after the TTP ended its ceasefire with the government in November 2022.\n\nFebruary saw a marginal increase in terrorist attacks but a sharp surge in civilian casualties, according to a report published by the Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (PICSS).\n\nAccording to PICSS, the country witnessed 79 terrorist attacks last month, resulting in the deaths of 55 civilians and 47 security personnel, while 45 civilians and 81 security personnel were injured. Security forces, meanwhile, intensified counter-terrorism operations, eliminating 156 terrorists, injuring 20, and arresting 66, it said.\n\nInterior Minister Mohsin Naqvi appreciated the police for foiling an attack by Fitna al Khawarij terrorists on Dera Ghazi Khan’s border check post. The government refers to the TTP and its affiliates as Fitna al Khawarij.\n\n“Dera Ghazi Khan police bravely confronted Khawarij terrorists and repelled the attack … We commend the police team for thwarting the attack of the Fitna-ul-Khawarij terrorists,” Naqvi said in a statement.\n\nHe praised the “brave sons of Dera Ghazi Khan police” for their professional response against the terrorists. “Proud of the brave and professional sons of Punjab police,” he added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:02:26.974Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896618/10-terrorists-arrested-as-punjab-ctd-conducts-73-operations",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T09:06:47.000Z"
}
