{
  "title": "SC Constitutional Bench perturbed by lack of progress in Arshad Sharif murder probe - Pakistan - DAWN.COM",
  "author": null,
  "content": "• MLA treaty with Kenya yet to be ratified, law officer tells court\n• Bench asks why govt isn’t helping journalist’s widow pursue case\n\nISLAMABAD: The federal government on Friday told the Supreme Court’s Constitutional Bench (CB) that it was still awaiting ratification of the Mutual Legal Assistance (MLA) treaty — signed by Pakistan and Kenya on Dec 12, last year for investigations into the tragic killing of journalist Arshad Sharif.\n\nThe six-judge bench, headed by Justice Aminuddin Khan, expressed annoyance over slow progress in the journalist’s murder case when AAG Chaudhry Aamir Rehman sought another month, and said the interior ministry was told on Feb 27 to take with some necessary steps to implement the agreement.\n\nThe law officer said the MLA agreement was designed to seek formal assistance from Keny­­a to gain access to murder suspe­cts, but its ratification could not be secured to date.\n\nThe court was assured that President Asif Ali Zardari would sanction the agreement in a month or so, adding that the necessary process was underway. Ex-CJP Umar Ata Bandial had taken suo motu notice of the murder and initiated proceedings in 2022.\n\nThe bench regretted that the agreement was signed in Dec 2024, even then its ratification was awaited. “Should the court seek a progress report on a daily basis in the matter,” Justice Jamal Khan Mandokhail asked.\n\nJustice Muhammad Ali Mazhar wondered why more time is being sought, when three mon­­ths had already passed since the last hearing.\n\nJustice Syed Hasan Azhar Rizvi also questioned why the government was not supporting the family of the journalist, who was brutally murdered in Kenya.\n\nJustice Mandokhail asked why the interior ministry was approached on Feb 27, when the case was last heard in December. At this, the joint secretary of the interior ministry told the court that it had written a note to the foreign ministry for mutual legal cooperation.\n\nAt the previous hearings, the court was told that an MLA agreement was being developed at the request of the Kenyan government, after which a visit of the special JIT would be fruitful, as officials could have access to the suspects believed to be behind the assassination.\n\nJustice Aminuddin Khan observed that the court was concerned about further delays in the investigation, when so much time had already been wasted.\n\nWhen Justice Mazhar asked who would send the summary to the president, the AAG said the interior ministry would furnish the summary after cabinet’s approval, but that he had been unable to approach the interior ministry.\n\nAn interior ministry representative then explained that after cabinet approval on Feb 27, the interior ministry had already sent a formal note to the Foreign Office. When Justice Mazhar asked if the president could also reject the summary for ratification, a legal adviser to the foreign ministry said he could not comment on this.\n\nAppeal against Kenyan court decision\n\nAppearing before the bench, Javeria Siddi­que, the second widow of the journalist, highlighted that the Kenyan High Court had already issued an order for action against the officials involved in the murder of her husband.\n\nThe Kenyan government later moved an appeal against the decision, whereas the Pakistan government had not become a party in the case, she said.\n\nJustice Mandokhail observed that a woman was fighting a case alone in Kenya, and asked what kept the Pakistani government from supporting her.\n\nThe AAG explained that the problem would not be solved by becoming party to the case, as access to the crime-scene was necessary for the probe and the government was not getting access to the crime-scene. Access would only be possible through an MLA, he said, reminding the court that statements of more than 30 individuals had already been recorded in Pakistan.\n\nThe case was then adjourned for another month.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/081022470221ee1.jpg",
  "retrievedAt": "2025-10-12T01:50:53.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896534/sc-constitutional-bench-perturbed-by-lack-of-progress-in-arshad-sharif-murder-probe",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:22:02.000Z"
}
