{
  "title": "US pushes India to lower tariffs, end defence purchases from Russia - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India needs to buy more defence products from the United States, shift defence equipment purchases away from Russia and lower its tariffs on US products for the two countries to be able to sign a “grand” bilateral deal, US Commerce Secretary Howard Lutnick told India Today television on Friday.\n\nIndia’s import tariffs, among the highest in the world, warrant a reassessment of its “special relationship” with the United States, Lutnick said, speaking from Washington.\n\nLutnick’s remarks come weeks ahead of President Donald Trump’s planned reciprocal tariffs early next month on trading partners, including India, which are worrying exporters across sectors ranging from autos to electronics.\n\n“We would like to focus on a bilateral conversation just between India and the United States — bring down the tariff levels that India has, that protects some of its areas,” Lutnick said.\n\nFor sensitive industries like agriculture, which India has long shielded to support its small farmers, Lutnick suggested a trade agreement with quotas and limits, but emphasised that India must open up the sector.\n\nAfter a meeting between Trump and Indian Prime Minister Narendra Modi last month, the two countries agreed to resolve tariff rows and work on the first segment of a deal by the fall of 2025, aiming for bilateral trade worth $500 billion by 2030.\n\nIndian Trade Minister Piyush Goyal has been on a nearly week-long trip to the United States and on Tuesday met Lutnick to pursue trade talks.\n\n“Maybe certain products have quotas. Maybe certain products have limits…And then we do the same thing on the other side and craft an agreement that makes sense for both of us,” Lutnick said.\n\n“The Indian agriculture market has to open up. It can’t just stay closed,” he added. Referring to India’s high tariffs, Lutnick called them among the steepest globally.\n\nWashington wants New Delhi to bring tariffs down to zero or negligible in most sectors, except agriculture, under the bilateral trade deal.\n\nThe US has a $45.6 billion trade deficit with India. Overall, the US trade-weighted average tariff rate has been about 2.2 per cent, according to World Trade Organisation, compared with India’s 12pc.\n\nDefence purchases\n\nLutnick also asked India to shift defence equipment purchases from Russia to sophisticated US products.\n\n“India has historically bought significant amounts of its military equipment from Russia, and we think that is something that needs to end,” he said.\n\nThe US will increase military sales to India starting this year and eventually provide F-35 fighter jets, Trump announced last month after meeting Modi in Washington. India has agreed to buy more than $20bn of US defence products since 2008.\n\nOn the impact of tariffs on inflation, Lutnick dismissed concerns, saying: “Inflation only comes from running deficits and printing money. Tariffs have not created inflation in India, so that argument is nonsense.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/080956431808ac9.jpg",
  "retrievedAt": "2025-08-25T15:02:48.641Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896546/us-pushes-india-to-lower-tariffs-end-defence-purchases-from-russia",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:22:34.000Z"
}
