{
  "title": "Baloch women are leading the struggle for their rights, not just supporting it - Pakistan - DAWN.COM",
  "author": null,
  "content": "In Balochistan, where pain has long been a cornerstone of its identity, a struggle led by women is taking root.\n\nWhile women have been involved in the campaign for Baloch rights since the early 2000s, like most political movements, it has been largely dominated by men. Feminist scholars have written extensively about the patriarchal nature of most nationalist movements, which frame women according to their biological role as reproducers of the nation. At most, nationalist movements offer women a fleeting sense of empowerment during the struggle, only to re-legitimatise their return to the private sphere once its goals are achieved.\n\nWhat sets this movement apart, however, is the women-centric leadership in groups like the Baloch Yakjehti Committee (BYC). These women appear to be leading the struggle, rather than merely supporting their male comrades. They not only use the language of kinship, invoking their roles as mothers, daughters, and sisters in the fight, but also go beyond this framing by asserting their equal roles as political actors and celebrating the fact that women are at the forefront of the struggle.\n\nBaloch women’s involvement in protests began during the 2000s, largely in response to the practice of enforced disappearances. Mothers, wives, sisters, and daughters of abducted men began appearing at protests and marches, holding photos of their disappeared kin — a phenomenon witnessed across the world where this form of state violence is practiced.\n\nThus, the large-scale participation of women in protests today is not a spontaneous occurrence. In fact, the groundwork for women’s leadership has been gradually developed over the past two decades. Much of this is attributed to the proscribed Baloch Students Organisation-Azad (BSO-Azad), which actively recruited female students throughout the 2000s and included discussions about gender and women’s participation within their study circles. The BSO-Azad, founded by Dr Allah Nazar, was one of the many factions that split from the BSO after disagreements over the state’s actions.\n\nWomen have also been active in the Baloch Student Action Committee, which was founded in 2008 and has focused on advocating for the rights of Baloch students.\n\nFarzana Majeed was one of the first women to rise to prominence in 2009 after her brother, Zakir Majeed, who was vice-president of the BSO-Azad, was allegedly abducted. Farzana spent the next several years leading protests along with missing persons activist Mama Qadeer, demanding the release of all missing persons and an end to the practice of enforced disappearances.\n\nIn discussions with Baloch activists, two women were cited most often as being pioneers of women’s political participation: Shakkar Bibi and Karima Baloch. Shakkar Bibi, an advocate based in Quetta, founded the Baloch Khawateen Panel, which was active between 2003 and 2008, with the aim of motivating Baloch women to join the nationalist struggle. While Shakkar Bibi is no longer publicly active, she continues to be remembered as a leading figure in the nationalist cause, particularly in terms of mobilising Baloch women.\n\nHowever, the woman most often cited as the pioneer of women’s involvement in the movement is Karima Baloch. Referred to respectfully as ‘Banuk Karima’ or simply as ‘Lumma’ (mother in Brahui) by many, Karima has inspired a new generation of women activists through her years of organising and struggle. Many of the activists I interviewed told me how Karima would travel across Balochistan from village to village on the back of a motorcycle, holding political circles and encouraging women to participate in the struggle for their rights.\n\nApart from grassroots organising, Karima Baloch also wrote regularly in Urdu, with many of her writings translated into Balochi and Brahui and circulated among Baloch students and activists. Some of her writings focused on the need for women’s participation in the struggle. In an article titled, ‘Women’s Struggle from a Historical Perspective’, Karima wrote:\n\n“Throughout history, in every national struggle, whether past or ongoing, women have played an equally significant role alongside men. Women make up half of every country and nation’s population. When half of the population is prepared and involved in a struggle, victory is achieved much sooner. If a movement is driven by the sacrifices of men alone, its pace toward success is halved. But when the efforts of women are added, the struggle doubles in strength and momentum.”\n\nAs a result of increasing threats, Karima Baloch sought exile in Canada in 2015 and was granted asylum in 2016. In December 2020, Karima’s body was found by the waterfront in Toronto. While the Canadian authorities concluded that there was no foul play involved, many Baloch still have questions regarding the circumstances that led to her death.\n\nWhen her remains were flown back to Pakistan, authorities initially refused to release her body to the family. This sparked protests across Balochistan, with the matter even being raised in Parliament where the Balochistan National Party-Mengal’s (BNP-M) Senator Dr Jahanzeb Jamaldini remarked: “The security agencies are afraid of a dead body … of a graveyard.”\n\nProtesters called for justice and defiantly chanted, ‘Tum kitne Karima maaroge? Har ghar se Karima niklegee’ (How many Karima’s will you kill? A Karima will emerge from every home.) She was eventually buried in her hometown of Tump amid tight security, with women leading the funeral procession.\n\nDespite the presence of a few prominent women in the Baloch nationalist struggle since the 2000s, the scale of women’s participation over the past year and the fact that there are now several women leading the movement is something markedly new.\n\nToday, social media is flooded with videos and reels of Baloch women, particularly young women, mostly demanding the release of their disappeared loved ones but also giving public speeches, calling out the authorities for the myriad of issues faced by the people of Balochistan. While some of these women appear with their faces covered, many choose to show their faces — an act that is both courageous given the security threats and defiance of patriarchal norms.\n\nThe call for women’s participation and for men’s support is framed as part of the nationalist struggle to demonstrate that the Baloch people are distinct in their progressive and secular character — with patriarchy viewed as a reality, but one that has been imposed on the Baloch people through centuries of colonisation. In an interview Mahrang gave to Jamhoor magazine, she described the dual oppression being faced by Baloch women:\n\n“There is dual oppression on us — on the one hand, women are not being allowed to come to the forefront [of society]. Baloch society is being transformed from its secular roots towards extremism, and there are restrictions on women’s education, there are other social issues … Altogether, women are being suppressed to such an extent that they face state oppression on the one hand, and social oppression on the other, and the social oppression is because of the state … because they want to rule over us in such a way that 51 per cent of our population does not even participate [politically].”\n\nThe BYC represents the recent surge in the struggle for Baloch rights, with a notable feature being the leadership of relatively young women. Dr Mahrang Baloch, Sammi Deen Baloch, and Dr Sabiha Baloch have emerged as prominent figures within the movement, steering it forward with their activism.\n\nA significant portion of the support for the movement has also come from women, as evidenced by the colourful photos and reels of their protests shared widely on social media during the Baloch Raaji Muchi (Baloch national gathering) last year. While women have long played a role in the Baloch struggle for rights and the parallel fight against enforced disappearances, the scale and nature of their involvement in this latest wave appears to be different. This increased participation signals a new chapter in the endeavour, driven by fresh energy and visibility.\n\nHowever, as stated above, the current upsurge in political activism among Baloch women did not come out of nowhere; rather, it has emerged from decades of state violence and a conscious effort to engage women in political struggle. Much of the fascination with Baloch women’s leadership is rooted in Orientalist stereotypes that exist about the Baloch among non-Baloch Pakistanis, portraying them as ‘tribal’ and ‘backwards’, and therefore more patriarchal than the rest of the country.\n\nHaving said that, the participation and leadership of Baloch women is, in fact, remarkable — not only in the context of South Asia but also globally, where the vast majority of nationalist movements have, in fact, been dominated by men.\n\nThe BYC was founded in 2020 under the name ‘Bramsh Yakjehti Committee’ and expanded over the next three years. However, it emerged on the national scene in December 2023, when a long march was organised from Turbat to Islamabad following the alleged extrajudicial killing of Balaach Mola Baksh. The 20-year-old from Turbat was allegedly abducted from his home by law enforcement agencies on October 29, presented in court on November 21, and his family was informed that he had been killed in an encounter just two days later.\n\nThe long march, which began in December 2023 and continued till January 2024, was reminiscent of the long march held almost a decade earlier led by Mama Qadeer and the Voice for Baloch Missing Persons (VBMP) from Quetta to Islamabad. However, this march was also different in some key respects.\n\nWhile women like Farzana Majeed and Sammi Deen Baloch — who was a child at the time and whose father, Dr Deen Mohammad, has been missing for the past 15 years — participated back then, the scale and intensity of this march, particularly in terms of women’s involvement, were unprecedented.\n\nDr Mahrang Baloch quickly emerged as the leader of the movement —embodying both the suffering of the Baloch people and the hope for change. Mahrang is a 31-year-old doctor who has been a prominent activist around Baloch human rights since she took a leading role in the protests organised against the sexual harassment of female students in Balochistan University in 2019.\n\nWhile Mahrang took a leading role in the long march and the month-long sit-in in front of the National Press Club in Islamabad, she was formally elected as the chairperson of the BYC in June 2024.\n\nThe Baloch Raaji Muchi, which was supposed to be a one-day event held on July 28, 2024, grew into a series of protests over the span of several weeks, further amplifying the movement and solidifying Mahrang as the movement’s undisputed leader. Alongside Mahrang, other women, many of whom are also direct victims of state violence such as Sammi Deen, have risen as leaders in the movement.\n\nThe emergence of young women as leaders in the movement reflects the changing character of the Baloch nationalist movement, which has shifted from being led by older, tribal male leaders to being dominated by younger, middle-class activists drawn largely from non-tribal areas of Balochistan such as the Makran division.\n\nWhile some see the participation of women as a product of necessity, given the state’s systematic violence against Baloch men, Baloch women activists see their involvement as a reflection of the progressive character of Baloch society itself, which they argue has been corrupted by centuries of colonial rule. Thus, the leadership and mobilisation of women are viewed as a means of recuperating the Baloch people, which is framed as being both secular and egalitarian at its roots.\n\nDespite challenging traditional gender roles, many Baloch women express a sense of alienation from the Pakistani feminist movement. They perceive it as antagonistic towards men and believe that Pakistani feminists have not adequately supported Baloch women, particularly on the critical issue of enforced disappearances. Dr Shalee Baloch articulated this sentiment during her speech at the Saryab Literary Festival:\n\n“So-called feminists claim that men exploit women, but in Baloch society, it is not the men — it’s the state that exploits them. The Baloch case is entirely different from other feminist movements. Our men have never exploited us; it is the state that has done so. Today, when a man is abducted from a household, it is the women who suffer the most.”\n\nFor these women, their struggle is deeply intertwined with that of their men, who often bear the brunt of direct state violence.\n\nHowever, this does not mean that they are uncritical of their men either. Mahrang appealed to the men in the audience to support their women both in acquiring education, which is viewed as essential to the process of nation-building, and in participating in politics.\n\n“I appeal to all my brothers to recognise that just as this land is yours, it also belongs to Baloch women. Just as you have the right to participate in politics and be involved in the nationalist movement, Baloch women have the same right to be involved in politics … I say to you all, give your women all those basic rights. Do not prevent them from getting an education. Do not stop them from doing anything, and prove to this state that we are amongst the free and civilised nations that exist on this land. For us, women and men are equal. Both are part of the nation,” said Mahrang in a speech delivered at the closing rally of the long march held in Quetta.\n\nShe frames the empowerment of women as part of the nationalist struggle; men must prove that the Baloch people are civilised by allowing their women to obtain an education and take part in politics.\n\nWhile many feminist movements in the Global South emerged alongside anti-colonial struggles, mobilising for women’s rights within and alongside struggles for national liberation, women’s participation in the Baloch struggle is viewed as being part of the wider nationalist struggle. While they may not identify as ‘feminist’, Baloch women activists challenge gender roles through their political participation and emphasis on women’s education, arguing that women’s empowerment will and is happening through the struggle for Baloch rights.\n\n“If you want women’s empowerment, you will have to involve women in the main change that is taking place in society to address the national question. Until and unless you are involved in that change, women’s struggle for gender-based change will remain at the margins. You have to tell [men] that women’s rights are the basic rights, and you will have to include that as part of your wider national plan,” said Mahrang, underscoring the shift from women’s participation behind men to women now being at the forefront of the movement.\n\nWhile it is possible to argue that the BYC’s discourse regarding women’s empowerment falls into the trap of instrumentalising women, I argue that something more significant is taking place. By celebrating women’s leadership as a marker of progress and by practically challenging patriarchal restrictions through their leadership and organising, the BYC pushes us to think of nationalist movements not only as patriarchal constructs but as spaces of possibility to imagine and enact a more egalitarian future.\n\nIn a context where feminist and leftist movements are struggling to survive and remain relevant, nationalist-oriented movements have emerged from the direct experiences of state brutality, offering spaces of hope for marginalised groups, particularly those on Pakistan’s peripheries.\n\nWhile nationalism has generally been understood by feminist theorists as a patriarchal project, the women involved in the movement present a challenge to such narrow conceptions. Rather, they imagine the Baloch society as anti-patriarchal — a people that honour and respects women not only as mothers, daughters, and sisters but also as political leaders. While largely rejecting the feminism of the Pakistani women’s movement, Baloch women challenge patriarchal norms through their activism and aim to demonstrate and revive what they see as the progressive character of Baloch society through their participation in politics.\n\nFurthermore, while women have historically been told by men in nationalist movements that their rights must wait until their larger goals are achieved, leaders of groups like BYC are integrating women’s rights into the broader nationalist agenda. In their view, it is impossible to separate women’s liberation from the struggle. They believe that their empowerment as women will only come through their active participation in the struggle for the rights of all.\n\nWhether they will succeed in this project remains to be seen, but the broad acceptance of women’s leadership and the growing numbers of women engaging in the public sphere demonstrate that a significant shift is taking place across Balochistan, both in terms of the nature of political organising and of gender relations more generally.\n\nHazaran Rahim Dad assisted with research and translation for this article.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/241204591a8a428.jpg",
  "retrievedAt": "2025-08-25T15:02:28.203Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883689/baloch-women-are-leading-the-struggle-for-their-rights-not-just-supporting-it",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T05:12:38.000Z"
}
