{
  "title": "UN rues 30 years of uneven progress for women, girls’ rights - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Released ahead of International Women’s Day, two UN reports warn that women and girls’ rights are facing growing, unprecedented threats worldwide — from higher levels of discrimination to weaker legal protections, as well as dwindling funding for programmes and institutions that support and protect women.\n\nA new report Girl Goals: What has changed for girls? Adolescent girls’ rights over 30 years — launched by Unicef, Plan International and UN Women ahead of International Women’s Day — reviews how adolescent girls’ lives have changed in the last 30 years.\n\nAnother UN Women report released a day earlier, Women’s Rights in Review 30 Years After Beijing, shows that in 2024 nearly a quarter of governments worldwide reported a backlash on women’s rights.\n\nThe first report notes that since the 1995 Beijing Declaration and Platform for Action, more girls are in school than ever before, global child marriage rates have declined, and adolescent pregnancy has decreased in many regions.\n\nNew reports reveal unprecedented threats to women, seek action on six goals to turn dream of empowerment into reality\n\nBut the progress is uneven. “Girls in conflict zones, marginalised communities, and those living in poverty still face significant barriers to education, healthcare, and economic empowerment. The climate crisis and the Covid-19 pandemic have exacerbated inequalities, increasing school dropout rates and vulnerability to gender-based violence. Moreover, while digital access has created opportunities, it has also introduced new threats, including online harassment and exploitation.”\n\nAccording to the report’s findings, nearly 1 in 4 adolescent girls who have been married or partnered have experienced intimate partner violence worldwide, and 50 million girls alive today have experienced sexual violence.\n\nMeanwhile, more than a third of adolescent girls and boys aged 15-19 globally consider a husband to be justified in hitting his wife under certain circumstances, the report says.\n\n“There is much to celebrate — but at the same time, this progress is fragile, uneven, and constantly under threat. Too many girls continue to face discrimination and abuse every day, simply for being young and female. Our work to achieve equality for girls must continue, working with girls, women and their allies around the world,” said Kathleen Sherwin of Plan International, one of the organisations involved in preparing the report.\n\n“We have come a long way, but we have miles to go before every girl’s potential is recognised and protected,” said UN Women Executive Director Sima Bahous.\n\nBacklash on women’s rights\n\nUN Women’s other report notes that insecurity, crises and democratic decay have created a perfect storm of backlash against women’s rights. Nearly three quarters of the world’s population are living under autocratic rule that have curtailed rights and freedoms, and over 600 million women and girls lived in conflict-affected countries in 2022.\n\nDespite important progress, only 87 countries have ever been led by a woman, and a woman or girl is killed every 10 minutes by a partner or member of her own family. Digital technology and artificial intelligence spread harmful stereotypes, while the digital gender gap limits women’s opportunities.\n\nIn the past decade, the world registered a disturbing 50 per cent increase in the number of women and girls living in conflict, and women’s rights defenders confront daily harassment, personal attacks and even death.\n\nAs per the Beijing+30 Action Agenda, six actions are advocated: a digital revolution for all women and girls; freedom from poverty; zero violence; full and equal decision-making power; peace and security; and, climate justice.\n\nPM’s message\n\nMeanwhile, in his message on International Women’s Day, Prime Minister Shehbaz Sharif acknowledged that Pakistan’s journey towards true gender equality was far from over.\n\n“Empowering women is no longer an option; it is now an imperative for the prosperity and progress of Pakistan. When we invest in women’s education, health, and economic independence, we uplift not just individuals but generations,” the prime minister said in his message.\n\nPM Shehbaz called for reaffirming collective resolve to intensify efforts to further advance respect for women’s rights and build a Pakistan where every woman’s potential is realised and every daughter’s dream is within her reach.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:50:34.037Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896549/un-rues-30-years-of-uneven-progress-for-women-girls-rights",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:21:57.000Z"
}
