{
  "title": "Trump’s controversial Gaza Riviera AI video was meant as satire, creator says - World - DAWN.COM",
  "author": null,
  "content": "The creator of a controversial AI-generated video depicting battle-ravaged Gaza rebuilt into a seaside resort, shared by US President Donald Trump’s official social media accounts, has said that the video was meant to be a “satire about this megalomaniac idea about putting statues” in the territory, British news outlet The Guardian reports.\n\nIn February, the US president proposed for the US to take over Gaza and create a “Riviera of the Middle East” after resettling Palestinians elsewhere, sparking widespread condemnation. Arab leaders adopted an Egyptian reconstruction plan for Gaza earlier this week that would avoid resettling Palestinians, in contrast to Trump’s “Middle East Riviera” vision.\n\nLast week, Trump posted an AI-generated video on social media, depicting Gazans’ living in the bombarded territory coming out of caves to a beach with skyscrapers, with cameos from the president himself and Elon Musk, who is leading Trump’s federal cost-cutting efforts, both enjoying life in “Trump Gaza”.\n\nThe video, which racked up more than 15 million views on Instagram and was shared thousands of times on Trump’s Truth Social network, prompted some commenters to question whether the president’s accounts had been hacked.\n\nSpeaking to British news outlet The Guardian on Thursday, the creator of the video, Solo Avital — a Los Angeles-based filmmaker — said he had decided to create “satire about this megalomaniac idea about putting statues [in Gaza]” while he was experimenting with the Arcana AI platform.\n\nIn an interview with BBC, Avital said he and his business partner — filmmaker and screenwriter Ariel Vromen — came across a new technology by an LA-based company called Arcana Labs, which had given them access to test the speed and quality of their latest AI model.\n\nHe said that the idea was to make something within eight hours, “one shift, kind of like one seat between two cups of coffee”.\n\n“My partner […] was in Las Vegas as the news broke out [of Trump’s Gaza plan], literally at the same time, and he was just taking his phone, pointing it out to the Las Vegas Strip, and said, Las Vegas Strip, Gaza Strip,” he said, gesturing to his phone as a camera.\n\nTalking to NBC News last week about the initial conception, Vromen said: “The idea was like, how Trump wants to turn Gaza into Vegas. We wanted to have an internal laugh about it. It was a joke.”\n\nHe further added: “With humor, there is truth, you know, but it was not our intention to be a propaganda machine.”\n\nThe report said that for the pair, the video was about “taking Trump’s proposal and pushing it to an extreme level of imagination”.\n\nMeanwhile, Avital told BBC: “We test, we share [it with our] friends and colleagues and, you know, the reaction was, obviously, everybody realised that it’s satire,” adding that his partner then posted the video from his Instagram account, which had over 130,000 followers.\n\n“It took me two hours to catch it, and seeing that he posted, and I called him, I said, ‘Ariel, please take it down.’ We thought that we were going to get into trouble with the president,” he said.\n\n“I thought it was going to […] offend the White House […] so he took it down, but I think by that time it was too late,” he said.\n\nHe said that the “danger point” regarding the video was how they had only put in eight hours of effort, adding that if they had spent a week on the video, one “wouldn’t be able to tell if it was AI or a video that was filmed”.\n\nAccording to The Guardian, Avital said that he found out about the video after he woke up to “thousands of messages” on his phone regarding the president’s post.\n\nHe said that they took down the video on the grounds that “it might be a little insensitive, and we don’t want to take sides”. Avital said that he was surprised by the reaction to the video, stating that if it were a skit for the show Saturday Night Live, the reaction would have been the opposite.\n\n“Look how wild this president is and his ideas, everyone would think it’s a joke,” he said.\n\nHe said the experience reinforced “how fake news spreads when every network takes what they want and shoves it down their viewers with their narratives attached” and “spark[s] a public debate about rights and wrongs” of generative AI.\n\n“We are storytellers, we’re not provocateurs, we sometimes do satire pieces such as this one was supposed to be. This is the duality of the satire: it depends what context you bring to it to make the punchline or the joke. Here there was no context and it was posted without our consent or knowledge,” Avital was quoted as saying.\n\nThe video was slammed by UN Special Rapporteur on Palestinian human rights Francesca Albanese as “absurd” in a post on X.\n\n“What the new US administration is doing is very clear and strategic: it is called psychological overwhelming. Hitting us every day with XXL doses of baffling rhetoric and erratic policies serves to ‘control the script’, distracting and disorienting us, normalising the absurd, all while disrupting global stability (and consolidating US control).”\n\nAmnesty International Secretary General Agnes Callamard had said she had “no words indeed. Beyond indecency?”\n\nIn Gaza, people who had watched the video were in disbelief.\n\n“This video of Trump is full of fallacies and shows a lack of cultural awareness … Gaza won’t become a tourist spot like Italy or Spain,” Nasser Abu Hadaid, a 60-year-old resident of Khan Younis in southern Gaza, had said.\n\n“What I know about Trump is that he is a strange but bold president who does what he says he will do. What matters to him is money and investments — there is no humanity,” Manal Abu Seif, a 23-year-old lawyer in Gaza City, had said.\n\n“Gaza needs freedom, open border crossings and jobs for young people, and is not a playground for tourism and investment,” she had added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/07210809353cd3c.jpg",
  "retrievedAt": "2025-10-12T01:51:26.850Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896431/trumps-controversial-gaza-riviera-ai-video-was-meant-as-satire-creator-says",
  "dateList": "2025-03-08",
  "date_published": "2025-03-07T19:38:52.000Z"
}
