{
  "title": "No US defence for non-paying Nato members: Trump - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US President Donald Trump has cast doubt on his willingness to defend Washington’s Nato allies, saying he would not do so if they are not paying enough for their own defence.\n\n“It’s common sense, right,” Trump told reporters in the Oval Office on Thursday. “If they don’t pay, I’m not going to defend them. No, I’m not going to defend them.”\n\nTrump said he has been of this view for years and shared it with Nato allies during his 2017-2021 presidential term. Those efforts prompted more spending from other members of the 75-year-old transatlantic alliance, he said, but “even now, it’s not enough”. He added: “They should be paying more.”\n\nA mutual assistance clause lies at the heart of the Nato alliance, which was formed in 1949 with the primary aim of countering the risk of a Soviet attack on allied territory.\n\nOpen nuclear talks or face possible military action, US president warns Iran\n\nTrump’s remarks could trigger alarm bells in capitals from Europe to Asia, where leaders were already worried about a withdrawal of US security support after Trump clashed with Ukrainian President Volodymyr Zelensky and showed greater willingness to deal with Russian President Vladimir Putin.\n\nEarlier on Thursday, concerned European leaders backed plans to spend more on defence and pledged to continue to stand by Ukraine. “I know some may have concerns about Nato’s future,” Nato Secretary General Mark Rutte said earlier on Thursday. “So let me be clear, the Transatlantic relationship and the Transatlantic partnership remains the bedrock of our Alliance. President Trump has made clear the commitment of the US and his commitment personally to Nato, and it has also made clear the expectation that we in Europe must do more in terms of defence spending.”\n\nIn the Oval Office, Trump said Nato members were friends of his but questioned whether France or a “couple of others” would protect the United States in a moment of crisis.\n\n“You think they’re going to come and protect us? They’re supposed to,” Trump said. “I’m not so sure.” Trump said he viewed Nato as “potentially good” if what he saw as the spending issue could be fixed. “They’re screwing us on trade,” he said of the security alliance.\n\nTrump had affirmed the United States’ commitments to the mutual defence of Nato as recently as last week during a press conference alongside British Prime Minister Keir Starmer.\n\nNuclear talks\n\nThe US president said he has written to Iran pressing it to open talks on preventing the development of nuclear weapons or face possible military action.\n\n“I’ve written them a letter, saying I hope you’re going to negotiate because if we have to go in militarily, it’s going to be a terrible thing for them,” Trump told Fox Business in a clip broadcast on Friday. “You can’t let them have a nuclear weapon.”\n\nMeanwhile, Iran’s mission to the United Nations in New York said on Friday that Tehran has not yet received such a letter.\n\nA landmark 2015 deal — known as the Joint Comprehensive Plan of Action (JCPOA) — imposed curbs on Iran’s nuclear program in return for sanctions relief.\n\nIt fell apart after Trump withdrew the United States from the agreement in 2018 in his first presidential term.\n\nTehran adhered to the deal until a year after Washington pulled out, but then began rolling back its commitments.\n\nTrump reinstated his “maximum pressure” policy of sanctions against Iran over allegations the country is seeking nuclear weapons capability.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:03:02.117Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896550/no-us-defence-for-non-paying-nato-members-trump",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:21:56.000Z"
}
