{
  "title": "Iran’s Khamenei says Tehran will not negotiate under US ‘bully’ pressure - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Supreme Leader Ayatollah Ali Khamenei said on Saturday that Tehran will not be bullied into negotiations, a day after US President Donald Trump said he had sent a letter to the country’s top authority to negotiate a nuclear deal.\n\nIn an interview with Fox Business, Trump said “there are two ways Iran can be handled: militarily, or you make a deal” to prevent Tehran from acquiring nuclear weapons.\n\nIn a meeting with senior Iranian officials, Khamenei said the aim of Washington’s offer for negotiations was to “impose their own expectations”, Iranian state media reported.\n\n“The insistence of some bully governments on negotiations is not to resolve issues, but to dominate and impose their own expectations.”\n\n“Talks for them is a path to have new expectations, it is not only about Iran’s nuclear issue. Iran will definitely not accept their expectations.”\n\nWhile expressing an openness to a deal with Tehran, Trump has reinstated a “maximum pressure” campaign that was applied during his first term to isolate Iran from the global economy and drive its oil exports to zero.\n\nDuring his first 2017-2021 term as president, Trump withdrew the United States from a landmark deal between Iran and major powers that placed strict limits on Tehran’s nuclear activities in exchange for sanctions relief.\n\nAfter Trump pulled out in 2018 and re-imposed sanctions, Iran breached and far surpassed those limits.\n\nUN nuclear watchdog chief Rafael Grossi has said time is running out for diplomacy to impose new restrictions on Iran’s activities, as Tehran continues to accelerate its enrichment of uranium to near weapons-grade.\n\nTehran insists its nuclear work is solely for peaceful purposes.\n\nQatar’s Prime Minister Sheikh Mohammed bin Abdulrahman bin Jassim Al-Thani has warned that an attack on Iran’s Gulf coast nuclear facilities would leave countries across the region without water.\n\nIn an interview with right-wing United States media personality Tucker Carlson, who is close to US President Donald Trump, the premier said Doha had simulated the effects of an attack. The sea would be “entirely contaminated” and Qatar would “run out of water in three days”, he said.\n\nThe construction of reservoirs since then had increased water capacity, he added, but the risk remained for “all of us” in the region.\n\n“No water, no fish, nothing … no life,” Sheikh Mohammed added in the interview published on Friday, the same day that Trump said he had invited Iran to nuclear talks.\n\nQatar, which sits 190 kilometres south of Iran, relies heavily on desalination for its water supply, as do other Gulf Arab countries in the arid desert region.\n\nIran has a nuclear power plant at Bushehr on the Gulf coast, though its uranium enrichment facilities, key to building atomic weapons, are located hundreds of kilometres inland.\n\nReferring to sites “on the other side of the coast”, Sheikh Mohammed said Qatar had “not only military concerns, but also security and … safety concerns”.\n\nHe said Qatar opposed military action against Iran and that it would “not give up until we see a diplomatic solution between the US and Iran”.\n\nTehran was “willing to engage”, he said. “They are willing to get to a level that creates comforts for everybody.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/08204505e1abbcf.jpg",
  "retrievedAt": "2025-08-25T15:02:25.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896652/irans-khamenei-says-tehran-will-not-negotiate-under-us-bully-pressure",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T15:46:09.000Z"
}
