{
  "title": "Project launched in GB to boost capacity to fight climate change - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The United Nations Develop­ment Programme (UNDP) and the Chinese government have officially laun­ched a project to stren­gthen Pakistan’s capacity to anticipate and respond to climate change impacts.\n\nThe Tailored Intelli­­gence for Actionable Early Warning Systems (TIAEWS) project in Pakistan will be supported by China Inte­rnational Develop­ment Cooperation Agency thro­ugh its Global Devel­opment and South-South Cooperation Fund (GDF).\n\nThe TIAEWS project will strengthen the resilience of vulnerable communities in Gilgit-Baltistan by improving their ability to anticipate and respond to natural hazards. It will establish 70 Automatic Weather Stations, 70 Hydrometric Stations, and 70 Warning Posts, creating a robust early warning infrastructure.\n\nThe project will focus on three key areas: developing an integrated data management system for early warnings, strengthening community awareness and disaster preparedness, and improving governance and coordination for effective dissemination of critical warnings.\n\nMore than seven million people in Gilgit-Baltistan and Khyber Pakhtunkhwa remain at risk, making robust early warning systems (EWS) an urgent priority for protecting communities, livelihoods, and critical infrastructure.\n\nSpeaking at the project launch in Islamabad, Minister Counselor Yang Guangyuan at the Chinese Embassy emphasised the role of international partnerships in tackling climate change. He said that China recognises its historical responsibility in addressing the climate change crisis and has consistently taken the lead in supporting our partners.\n\nPublished in Dawn, March 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:02:49.510Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896523/project-launched-in-gb-to-boost-capacity-to-fight-climate-change",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T01:22:02.000Z"
}
