{
  "title": "PM expresses satisfaction at economic stability, inflow of foreign investment",
  "link": "https://www.app.com.pk/national/pm-expresses-satisfaction-at-economic-stability-inflow-of-foreign-investment/",
  "date_published": "2024-11-04T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 04 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday expressed his satisfaction over the economic stability in the country and the inflow of foreign investment.\nHe said that the State Bank of Pakistan had reduced the policy rate by 250 basis points and with its reduction, the interest rate had been brought down to 15 percent from 17 percent, adding that it would increase the business activities, boost exports and generate employment opportunities.\nAddressing a meeting of PML-N parliamentary party at the Parliament House, the prime minister said that due to government’s efforts, the inflation rate was also reduced from 38 percent to 7 percent and observed that all the global and national institutions were projecting economic stability in the country.\n“The evil machinations of those who were out to create chaos and those who pushed the country to verge of default have been foiled,” PM Office Media Wing, in a press release quoted the prime minister as saying.\nHe further said that the history would always remember those who had staked their politics for the sake of country’s survival, adding the historians would always wrote about those who worked for the sake of the country and those elements who addressed letter to International Monetary Fund (IMF) to halt country’s financial programme.\nThe prime minister also lauded the members of parliament belonging to PML-N for sacrificing their politics for the sake of country and said that they had thought about 240 million people.\nHe said that during his recent visits to the Kingdom of Saudi Arabia, a new chapter of economic partnership between the two countries had been added.\nDuring the participation in the Future Investment Initiative, he held detailed meeting with Saudi Crown Prince Mohammed bin Salman, adding Saudi Arabia was a close friend and partner of Pakistan and its leadership had assured all kind of assistance to support economic stability and country’s development.\nHe said that volume of Saudi’s investment would increase from $2.2 billion to $2.8 billion.\nThe prime minister said that during his visit to Qatar, its leadership also assured investment in Pakistan and in the bilateral meeting with its leadership, they discussed shaping worth $3 billion projects in this regard.\nQatar would invest in aviation, hotling, IT, energy and other sectors, he said, adding that the government was taking all steps on priority basis to facilitate and encourage the foreign investment.\nThe prime minister maintained that they had been enforcing reforms agenda in every sector of the country.\nHe said that he had directed FBR to accord respect to those who paid taxes as they were the ambassadors of Pakistan.\nThose who evaded paying taxes despite eligible to pay such and those officers who facilitated them, should be proceeded against, he stressed.\nIn the meeting, the parliamentary party members were also taken into confidence over the proposed legislation in the parliament.",
  "retrievedAt": "2025-08-10T15:02:43.279Z"
}
