{
  "title": "‘Pakistan most deserving country for climate grants ’: Justice Jawad",
  "link": "https://www.app.com.pk/national/pakistan-most-deserving-country-for-climate-grants-justice-jawad/",
  "date_published": "2024-11-04T17:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 04 (APP):Justice Jawad Hassan of the Lahore High Court in a high-level plenary titled ‘Legal Framework of Climate Finance’ at the 27th Sustainable Development Conference (SDC) here on Monday said Pakistan was the most deserving country for climate grants.\nHe said it was important to know what climate financing law was in Pakistan and what the legal framework Pakistan had offered, said a press release.\nJustice Jawad Hassan said local and international donors had raised three questions during the last COP28. The questions were whether there was any legal framework financing law in Pakistan, how climate was financing protected in Pakistan, and third whether there was any dispute in it and how the courts would look into it.\nHe emphasised the critical need for a comprehensive legal and regulatory framework to enhance climate finance initiatives in Pakistan, particularly in response to the severe impacts of climate change the country faces.\nHe highlighted the necessity of establishing clear mechanisms for climate adaptation and mitigation financing, especially as Pakistan engages with the Loss and Damage Fund, while also addressing challenges such as defining eligibility for vulnerable communities and ensuring equitable access to funds.\nOther panelists were Syed Blunet Sohail, Advocate High Court and Managing Partner, Sohail and Partners, LLP; Professor Dr Christian Tietje, Martin Luther University Halle Wittenberg, Germany; Petra Minnerop, professor of international law, University of Durham, UK.\nDr Christian Tietje said increased access to finance could build capacity and address soft limits to adaption and avert rising risks, especially for developing countries, vulnerable groups, regions, and sectors.\nPublic finance is an important enabler for adaptation and mitigation and can also leverage private finance, Dr Tietje said.\nPetra Minnerop talked about Article 6 of Paris Agreement and said it took three years to negotiate the Paris Agreement rulebook, consisting of 20 decisions, and adopt several sets of guidance and rules of modalities.\nShe further said existing market mechanisms under the Kyoto Protocol have resulted in verifiable emission reductions that would not have occurred without these instruments. Market approaches permit countries to identify and enable the most cost-effective options to meet mitigation challenges, she added.\nSyed Blunet Sohail proposed several options including incentives from the State Bank of Pakistan and Security Exchange Commission of Pakistan, tax incentives from the Federal Board of Revenue and inclusion of carbon credits in the export control list under the import and export control Act.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:02:39.455Z"
}
