{
  "title": "Pakistan’s first judicial protection unit established",
  "link": "https://www.app.com.pk/national/pakistans-first-judicial-protection-unit-established/",
  "date_published": "2023-07-17T07:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP): In response to the growing need for improved security measures, the security division of Islamabad police has been revamped along with the setting up of the first Judicial Protection Unit to enhance judges’ security.\nSpearheaded by the Islamabad Capital City Police Officer (ICCPO) Dr Akbar Nasir Khan, the Security Division underwent a comprehensive reorganization to fortify the security of judges’ offices, court premises, and residences.\nThis development comes as a result of special directives from Prime Minister Muhammad Shehbaz Sharif, and the dedicated efforts of Interior Minister Rana Sanaullah Khan, reflecting the government’s commitment to safeguarding judicial authorities.\nThe newly formed Judicial Protection Unit will be placed under the vigilant supervision of the SSP Security Division, a police spokesman said. To ensure enhanced surveillance, a standard operating procedure (SOP) has been issued, along with the installation of over 500 high-tech security cameras within court premises.\nThese cameras are integrated with the advanced surveillance system of the Safe City Islamabad project, allowing for real-time monitoring of court premises.\nRecognizing the importance of adequate personnel, the Ministry of Interior has received a request for the recruitment of 550 individuals to further bolster the security of residences and courts. Once the necessary financial resources are allocated, the performance of this unit is expected to improve significantly.\nPreviously, the Islamabad Capital Police established various units to address specific security concerns in the federal capital. Among them are the Diplomatic Protection Unit (DPU), tasked with safeguarding foreign diplomats and delegations in Islamabad, and the Special Protection Unit (SPU), responsible for ensuring the safety of Chinese nationals and other foreigners residing and working in the city.\nFurthermore, the VVIP Protection Unit focuses on providing comprehensive security measures for the President and Prime Minister of the Islamic Republic of Pakistan. Lastly, the High-Security Zone Protection Unit (HSZPU) is entrusted with protecting members of the National Assembly, federal ministers, high-ranking officials, ministries, and civil offices.\nICCPO Dr. Akbar Nasir Khan emphasized that the restructuring of the Security Division is motivated by the objective of ensuring the safety of foreign embassies and diplomats in the federal capital, along with safeguarding national dignitaries and important offices. This significant step marks a critical milestone in Pakistan’s efforts to enhance security and uphold the rule of law.",
  "retrievedAt": "2025-08-11T08:56:11.389Z"
}
