{
  "title": "Cancer hospital project inaugurated at PIMS",
  "link": "https://www.app.com.pk/national/cancer-hospital-project-inaugurated-at-pims/",
  "date_published": "2023-07-17T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP): Minister for National Health Services, Regulations, and Coordination Abdul Qadir Patel on Monday inaugurated the 200-bed cancer hospital project at the Pakistan Institute of Medical Sciences (PIMS).\nAddressing the ceremony, the minister said that a large number of people living in surrounding areas and other cities will get direct benefits from this hospital with having all the necessary medical services for cancer patients.\nHe said that an amount of Rs one billion has been proposed initially to utilize for the construction of this modern hospital, where all concerned necessary services will be provided.\nHe said that besides initiating new projects in major hospitals, the government has upgraded the basic health units and rural health centres where daily several hundred patients can visit for the treatment of various diseases and added that more such modern centres will be established in the federal capital.\nوفاقی وزیر صحت عبدالقادر پٹیل نے پمز اسلام آباد میں نیشنل کینسر اسپتال کا سنگ بنیاد رکھ دیا\nکینسر ہسپتال کی عمارت پر 30 فیصد کے قریب کام مکمل ہو چکا ہے، منصوبہ جون 2025 میں مکمل ہو گا۔\nوزیراعظم کے حکم پر اسپتال کا سنگ بنیاد رکھاعبدالقادر پٹیل pic.twitter.com/cx50HPvKp9\n— Ministry of National Health Services, Pakistan (@nhsrcofficial) July 17, 2023\nHe said that the aim of the government was to provide all basic health services in every place and village so that citizens have all such services at their doorsteps.\nHe said that the major hospitals of the federal capital have been facing a burden of patients and with the setting of new basic health centers, this burden will gradually decrease.\nHe said that several innovative steps have been taken to make improvements in the health sector and to ensure the provision of all basic health facilities to the country’s people.\nHe said that the government was making efforts to improve access to quality health services, increase budget allocations for health, and invest in infrastructure to meet the health needs of the people of Pakistan.",
  "retrievedAt": "2025-08-11T08:56:04.546Z"
}
