{
  "title": "PM, Sri Lankan President reaffirm to continue long-standing cooperation in diverse fields",
  "link": "https://www.app.com.pk/national/pm-sri-lankan-president-reaffirm-to-continue-long-standing-cooperation-in-diverse-fields/",
  "date_published": "2023-07-17T07:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP): Prime Minister Muhammad Shehbaz Sharif and President of Sri Lanka Ranil Wickremesinghe on Monday agreed to continue the long-standing cooperation in areas of mutual interest and further strengthen the bilateral ties between the two countries.\nThe prime minister held a telephone call with the Sri Lankan president.\nThe prime minister emphasized the need to work together to fight poverty and promote economic growth and development for the benefit of the entire region, PM Office Media Wing said in a press release.\nHe also expressed his desire to promote peace and enhance connectivity through regional cooperation.\n​The two leaders fondly recalled the close and cordial relations and immense goodwill between the people of the two countries.\n​The president of Sri Lanka thanked the prime minister for conveying warm sentiments on behalf of the people of Pakistan.\nSeparately on his Twitter handle, the prime minister said that the bilateral ties between Pakistan and Sri Lanka were underpinned by reservoirs of goodwill and good neighbourliness between our two countries.\n“I had the pleasure of speaking to H.E. Ranil Wickremesinghe, President of Sri Lanka, earlier today to thank him for his support to Pakistan during my meeting with MD IMF,” he added.\nOver the decades, the prime minister further said that Pakistan and Sri Lanka had been close allies and friends and stood by each other through thick and thin.\n“I remember how a team of Sri Lankan doctors stayed in Lahore and helped the Punjab government deal with dengue epidemic which was devouring precious human lives in Lahore,” the prime minister said in a tweet.\nHe also expressed his desire to working with the Sri Lankan president to further build on the friendly relations between the two countries.",
  "retrievedAt": "2025-08-11T08:56:11.360Z"
}
