{
  "title": "More monsoon rains expected this week: PMD",
  "link": "https://www.app.com.pk/national/more-monsoon-rains-expected-this-week-pmd/",
  "date_published": "2023-07-17T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP): Pakistan Meteorological Department (PMD) has forecast more monsoon rains in different parts of the country during this week.\nThe monsoon currents from the Arabian sea are likely to penetrate in upper and central parts of the country from July 18 (night) which are likely to intensify on July 19.\nUnder the influence of these weather systems, rain/wind-thundershower with heavy falls are expected in Kashmir, (Neelum valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur), Gilgit Baltistan (Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar), Murree, Galliyat, Islamabad, Rawalpindi, Attock, Chakwal, Jhelum, Mandi Bahauddin, Sialkot, Narowal, Lahore, Gujranwala, Gujrat, Kasur, Mianwali, Sargodha, Faisalabad, Toba Tek Singh, Jhang, Sahiwal, Bahawalnagar, Okara, Chitral, Dir, Swat, Shangla, Buner, Mansehra, Kohistan, Abbottabad, Haripur, Peshawar, Mardan, Swabi, Nowshera, Kurram, Lakki Marwat, Kohat, Dera Ismail Khan, Bannu, Karak and Waziristan from July 18 (night) to 23 with occasional gaps.\nRain/wind-thundershower is also expected in Barkhan, Loralai, Kalat, Khuzdar, Zhob, Lasbela, Awaran, Musakhel, Dera Ghazi Khan, Rajanpur, Multan, Bhakkar, Layyah, Kot Addu, Bahawalpur, Rahim Yar Khan, Sukkur, Larkana and Jacobabad from July 19 (night) to 21 with occasional gaps.\nDust-thunderstorm/rain with isolated heavy falls likely in Tharparkar, Umerkot, Mirpurkhas, Sukkur, Larkana, Jacobabad, Dadu districts from July 19 (evening/night) to 23. Dust-thunderstorm/rain with isolated heavy falls likely in Shaheed Benazirabad, Hyderabad, Sanghar, Badin, Thatta and Karachi districts from July 20-22 with occasional gaps.\nAbout the impacts, the PMD warned that heavy rain may cause urban flooding in low-lying areas of Islamabad/Rawalpindi, Peshawar, Gujranwala, Lahore from July 18 (night) to July 22 and may trigger landslides in the vulnerable areas of Murree, Galliyat, Kashmir, Gilgit Baltistan and hilly areas of Khyber Pakhtunkhwa during the period.\nFarmers have been advised to manage their activities keeping in view the weather forecast.\nTourists and travelers are advised to remain extra cautious to avoid any untoward situation during the wet spell.\nDust storm/wind-thunderstorm may damage loose structures like electric poles, solar panels.\nThe general public is advised to stay at safe places during wind-storm/heavy rains.\nAll authorities concerned are advised to remain alert and to take necessary precautionary measures during the forecast period.",
  "retrievedAt": "2025-08-11T08:56:03.248Z"
}
