{
  "title": "Govt  launches crackdown against illegal loan application: Amin",
  "link": "https://www.app.com.pk/national/govt-launches-crackdown-against-illegal-loan-application-amin/",
  "date_published": "2023-07-17T10:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 17 (APP):Federal Minister for Information Technology and Telecommunication, Amin-ul-Haque Monday said in a decisive move to combat fraudulent loan applications, the government initiated a crackdown against illegal loan providers .\nIn a statement, he said, that Chairman Pakistan Telecommunication Authority (PTA) Major General (r) Hafeezur Rehman directed immediately to take swift action on the illegal loan applications.\nUnder the orders issued, 43 loan applications had already been blocked, said Amin-ul-Haque. The targeted companies, operating within the lending industry, were registered with the Securities and Exchange Commission, he added.\nHighlighting the severity of the issue, Amin-ul-Haque shed light on the involvement of mafia groups operating through social media platforms, particularly Facebook.\nThese unscrupulous entities have resorted to blackmailing innocent individuals, exploiting their financial vulnerabilities.\nTo raise awareness and safeguard the public, a comprehensive public awareness campaign has been launched.\nThe citizens are urged to report any suspicious loan applications or incidents involving the loan mafia groups to the PTA, the Federal Investigation Agency’s (FIA) Cybercrime wing, or their local police stations.\nThe collaborative efforts of various law enforcement agencies aimed to address the increasing cybercrime wave in the country.\nTo ensure effective coordination, the minister has a direct contact with the Director-General of FIA, providing regular briefings on the progress of the operation.\nAmin emphasized the need for proactive measures, rather than waiting for complaints to accumulate, against those involved in fraudulent loan schemes.\nHe stressed the importance of protecting the public from financial exploitation and curbing such illegal practices within the lending industry.\nThe minister condemned the tactics employed by loan mafia groups, including threats of violence, blackmail, and misuse of personal data.\nHe reaffirmed that these actions were in clear violation of the law and must be halted immediately.\nThe citizens are advised to exercise caution when engaging in online financial transactions and refrain from sharing personal information with unknown parties.\nThe ministry has noted the prevalence of online posts promoting money-making schemes, urging individuals not to respond to such advertisements and avoid sharing sensitive data or money.\nThe government’s crackdown aims to safeguard the interests of the public and maintain a secure online environment for all citizens.\nAs the operation progresses, the authorities remain vigilant in their efforts to bring the culprits to justice and protect the citizens from falling victim to fraudulent loan schemes.",
  "retrievedAt": "2025-08-11T08:56:11.374Z"
}
