{
  "title": "PM Shehbaz orders 50% Public cargo shift to Gwadar Port",
  "link": "https://www.app.com.pk/national/pm-shehbaz-orders-50-public-cargo-shift-to-gwadar-port/",
  "date_published": "2024-08-19T18:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Prime Minister Shehbaz Sharif on Monday explicitly instructed the concerned authorities to bring 50 percent of all public sector cargo inland via sea through Gwadar port.\nShehbaz issued these directives while chairing a review meeting on Chinese investment in Islamabad, where he was briefed on the Chinese experts’ delegation visit to Pakistan from July 30 to August 6, 2024.\nThe forum was told that the Chinese delegation met with representatives from various ministries, who offered suggestions to enhance cooperation in their respective fields. The visit resulted in significant progress in cooperation and investment across trade, energy, agriculture, information technology, communication, and infrastructure.\nThe forum was informed that the Chinese delegation engaged with top leaders of the Chamber of Commerce and Industry during their visit. It was briefed that Chinese experts would be enlisted for technology transfer, removing non-trade barriers, and boosting the country’s exports.\nThe meeting was informed that sectoral roadshows would be organized in various Chinese cities to boost exports of Pakistani products. Additionally, Chinese experts will be engaged for technology transfer, upgrading electric vehicles, electro-medical devices, and other sectors.\nThe meeting was told that a Chinese auto spare parts company has recently advanced significantly in establishing its plant in Pakistan. Efforts are underway to facilitate land leasing for special economic zones. Additionally, Pakistani students and researchers will receive agricultural training in China, with 572 applications already received.\nThe prime minister instructed that students from all provinces should have equal opportunities to participate in this training.\nThe prime minister directed the creation of a committee, chaired by Federal Minister for Planning, Development, and Reform Ahsan Iqbal, to oversee the transparent selection of Pakistani students and researchers for agricultural training in China.\nFederal Minister for Planning and Development Ahsan Iqbal, Federal Minister for Investment and Privatization Abdul Aleem Khan, Federal Minister for Economic Affairs Ahad Khan Cheema, Federal Minister for Industry and Production Rana Tanveer Hussain, Federal Minister for Commerce Jam Kamal, Federal Minister for Energy Awais Ahmed Khan Leghari, Federal Minister of Maritime Affairs Qaiser Ahmed Sheikh and relevant senior government officials attended.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:46:55.763Z"
}
