{
  "title": "Senate body takes notice of alleged malpractices in housing scheme",
  "link": "https://www.app.com.pk/national/senate-body-takes-notice-of-alleged-malpractices-in-housing-scheme-3/",
  "date_published": "2024-08-19T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP):The Senate Functional Committee on Problems of Less Developed Areas has ordered an inquiry into widespread power theft across Pakistan and took notice of alleged malpractice by a NESPAK consultant involved in the Park Road Housing Scheme under the Federal Government Employees Housing Authority (FGEHA).\nThe meeting, chaired by Senator Agha Shahzaib Durrani, scrutinized both the ongoing electricity theft concerns and the alleged corruption within the housing project.\nDuring the session, the Committee reviewed the implementation of recommendations from previous meetings, particularly focusing on actions taken against corrupt officials of the Quetta Electric Supply Company (QESCO) over the past five years.\nSenator Shahzaib Durrani highlighted discrepancies in QESCO’s disciplinary actions, criticizing the seemingly inconsistent grounds for the termination of certain individuals.\nHe noted that while some individuals were dismissed for not showing enough interest in anti-theft initiatives, others received only minor penalties for more serious misconduct and corruption.\nDespite the removal of these allegedly corrupt officials, power theft in QESCO’s jurisdiction persists. Consequently, the Chairman directed the Power Division to conduct a thorough examination of QESCO’s disciplinary actions and submit a detailed report within 30 days.\nThe Committee also received updates on ongoing projects in less-developed areas.\nManaging Director NESPAK, Muhammad Zargham Eshaq Khan, briefed the Committee on NESPAK’s supervision of the construction of 83 roads across 11 districts in Khyber Pakhtunkhwa, including seven districts in the former FATA region. The total length of these roads is approximately 872.65 km, with an estimated cost of Rs. 25.7 billion. The Committee instructed NESPAK to provide comprehensive details of projects related to the rehabilitation of Internally Displaced Persons (IDPs).\nThe meeting also addressed allegations of malpractice by a NESPAK consultant in the Park Road Housing Scheme of FGEHA. MD NESPAK disclosed that a Fact-Finding Committee had been formed to investigate the allegations, resulting in show-cause notices being issued to three officers and the suspension of four others pending the inquiry’s completion.\nSenator Shahzaib Durrani questioned whether the Ministry of Housing had conducted an independent inquiry into the matter.\nThe Director General of FGEHA informed the Committee that an internal investigation had been conducted, leading to the termination of the Project Director found guilty of the fraud. The case has since been forwarded to the Federal Investigation Agency (FIA).\nSenator Shahzaib Durrani expressed concern that a single individual could orchestrate a fraud of Rs. 1.4 billion, suggesting that other officials might also be implicated. The Committee directed the Ministry of Housing to submit a full report of its internal inquiry.\nThe Committee expressed dissatisfaction with the briefing provided by the Sukkur Electric Power Company (SEPCO) and instructed both SEPCO and the Hyderabad Electric Supply Company (HESCO) to present a detailed report on unannounced load shedding and power theft in their respective areas, along with a comprehensive plan to address these issues, at the next meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:46:32.343Z"
}
