{
  "title": "Senate body on S&T deliberates on PHA (Amendment) Bill, 2023′",
  "link": "https://www.app.com.pk/national/senate-body-on-st-deliberates-on-pha-amendment-bill-2023/",
  "date_published": "2024-08-19T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP):The Senate Standing Committee on Science and Technology on Monday deliberated on the Private Member’s Bill titled “Pakistan Halal Authority (Amendment) Bill, 2023.”\nThe meeting was chaired by Senator Kamil Ali Agha. Senator Dr. Zarqa Suharwardhy, the bill’s mover, explained that the bill aims to strengthen the Pakistan Halal Authority (PHA) by providing guidelines for the enforcement of Halal standards.\nOfficials from the Ministry of Science and Technology (MoST) informed the committee that the proposed amendments are part of the Pakistan Halal Authority (PHA) Act.\nDuring the meeting, Senator Kamil Ali Agha inquired about the current staffing and recruitment criteria at PHA.\nOfficials revealed that a total of 100 posts are sanctioned, but PHA is currently operating with only 38 officials, including six inspectors. The process of filling the remaining sanctioned posts is underway.\nThe committee recommended that relevant experience, along with a diploma in Halal certification, should be required for the posts of inspectors.\nPHA has registered 16 local Halal certification bodies, one foreign certification body, and several slaughterhouses, primarily in Punjab.\nThe committee was also briefed on the role and performance of the National Institute of Electronics (NIE).\nActing Director General Zawar Hussain apprised the committee that NIE’s major role is in design and development, including the preparation of prototypes in vital areas of electronics.\nNIE has developed several prototypes, including processor chips, an electric vehicle kit for small cars, and various other devices. NIE offers testing, capacity evaluation, and calibration services for electronic devices to both government and private institutions at minimal cost.\nThe committee appreciated NIE’s contributions and recommended that the institute shift its focus toward the commercialization of its inventions to benefit the masses. Additionally, the committee suggested that NIE revise its service fees to help the institution become self-sufficient.\nThe economic potential of cannabis was also discussed. Chairman of PCSIR, Dr. Syed Hussain Abidi, informed the committee that medicinal cannabis has a $30 billion market worldwide and is in high demand.\nPCSIR has successfully developed various cannabis products, including hemp cinnamon tea, hemp ginger tea, hemp jams, hemp cookies, and hemp curative oil and shampoo. Cannabis has applications in textiles, food, and the construction industry, with a market potential of $4 to $5 billion.\nGiven its economic significance, Pakistan has established the Cannabis Control and Regulatory Authority (CCRA). The Board of Governors for CCRA has been finalized, with the Secretary of the Defence Division serving as chairperson and the Chief Secretaries of each province as members. The committee recommended that two Senators also be included in the Board.\nThe committee also discussed the performance of the Science, Technology, Engineering, and Mathematics (STEM) program under the Pakistan Science Foundation (PSF).\nSenator Kamil Ali Agha, expressed concern that PSF has utilized only 10% of its allocated funds for the STEM project. Dr. Saqib Nasir, Project Director of STEM, informed the committee that 50 labs have been established in public schools for Rs. 50 million under the STEM project.\nHowever, a significant portion of the funds remained unused due to a ban on the purchase of equipment. PSF is collaborating with China on the Pak-China Joint Working Group to further integrate STEM into the national curriculum.\nThe committee decided to have a detailed briefing on STEDEC, which is undergoing restructuring as IRADA, in the next meeting.",
  "retrievedAt": "2025-08-11T04:45:46.357Z"
}
