{
  "title": "Solar energy: A key solution to Pakistan’s energy woes",
  "link": "https://www.app.com.pk/national/solar-energy-a-key-solution-to-pakistans-energy-woes/",
  "date_published": "2024-08-19T15:30:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 19 (APP):As Pakistan grapples with an increasing demand for electricity especially for industries and agriculture amid a growing supply deficit, Khyber Pakhtunkhwa started leading the way with a surge in solar energy adoption.\nBeing a home to nearly 41 million people, Khyber Pakthunkhwa has seen a significant rise in solar panel installations, driven by the need for affordable and reliable power solutions in the wake of rising supply-demand gap of electricity in recent years that affected common man.\nWhile travelling on GT Road, a visitor can witness abundance of solar panels adorning the rooftops of buildings in Nowshera, Peshawar, Mardan and Swabi. The affordability of solar technology, coupled with its ability to ensure uninterrupted power supply, has made it a popular choice among the residents of KP.\nRiaz Khan, a retired government employee who recently installed seven solar panels, shared with APP that solar energy has proven to be both cost-effective and dependable, particularly during the scorching summer.\nGlobally, the energy landscape is shifting, and Pakistan is no exception. The country’s power production capacity has expanded significantly, with the State Bank of Pakistan (SBP) reporting a total installed capacity of approximately 43,775 megawatts (MW) for the fiscal year 2022-23.\nWhile fossil fuels still dominate the energy mix—comprising around 26,683 MW—the spotlight is increasingly on renewable sources, especially solar and wind having great scope in Pakistan.\nThe coastal areas of Balochistan and Sindh provinces were most suited for wind energy where a substantial investment in wind would help make Pakistan’s self sufficient in energy.\n“Solar energy’s prominence is evident in its growing installed capacity, which reached over 2,368 MW by the end of Financial Year 2022-23. This tremendous growth is fueled by both domestic and international investments in solar projects, said Professor Dr Muhammad Naeem Khattak, ex Chairman, Economics Department, University of Peshawar told APP.\nAppreciating State Bank of Pakistan for facilitating this expansion by providing Rs74 billion (about $400 million) in financing to over 1,175 renewable energy projects, which collectively contribute 1,375 MW of capacity, he said such favorable policy would help turnaround in solar energy especially in Pakistan.\nThe World Bank estimated that Pakistan has the potential to generate up to 40 gigawatts (GW) of solar power and aims to source 20% of its electricity from renewables by 2025.\nHistorically reliant on fossil fuels—63% of total power generation in 2020—the country is gradually diversifying its energy sources. Hydropower, nuclear energy, and renewables each contribute varying proportions to the energy mix, with solar energy gaining an increasing share, he said.\nEmphasizing that Pakistan’s abundant sunshine makes it a prime destination for solar energy development, he said this potential has been recognized in Pakistan by the respective governments that helped introduction of favorable policies and incentives to boost solar energy investments in all provinces.\nHe said that Alternative Energy Development Board (AEDB) supported this key initiative with net metering and feed-in tariffs, encouraging both residential and commercial solar installations for agriculture and economic growth.\nAccording to Dr. Naeem Khattak, the growing appeal of solar energy is likely to attract more capital investment, bolstered by foreign direct investment (FDI) and collaborative projects like those under the China-Pakistan Economic Corridor (CPEC).\nDespite the promising outlook, he said that several challenges remain before our policy makers to addressed on priority basis such as high initial costs, limited financing options, lack of awareness, and inadequate grid infrastructure hinder broader adoption.\nHe commended the current government efforts for addressing these issues through a 25-year energy policy aimed at achieving 20-30% renewable energy by 2030 and reducing reliance on imported fuels.\nDr Naeem said the recently approved Alternative and Renewable Energy Policy provided an additional incentives for renewable projects, while efforts are underway to address the challenges faced by previous policies, including the National Electricity Policy 2021.\nHe said this policy, although intended to ensure affordable and reliable electricity, encountered resistance over tariff determinations and sector governance.\nBy leveraging its abundant solar resources, he said the country has the opportunity to reduce its dependence on fossil fuels, enhance energy security, and contribute to environmental sustainability.\nTo fully capitalize on solar energy’s benefits, he said we must overcome existing challenges related to financing, awareness, and grid infrastructure. Encouraging private sector involvement, improving access to financing, and investing in grid upgrades and energy storage solutions are crucial for integrating solar power into the national grid effectively.\nHe underscored the need for shifting all tubewells, mosques and government offices in districts on solar energy besides giving soft loans to underprivileged and poor segment of the society.\nThe spokesman of KP Energy Department told APP that 6,500 mosques across the province would be solarized while conversion of 10,000 more mosques to solar energy has been in the pipe- line.\nA model design and online application system for the CM Khyber Pakhtunkhwa Solarization Scheme has been inaugurated and solar panels on soft loans would be provided to over 130,000 households, with 30,000  from the Merged Districts.\nThe spokesman said the project will provide complete 2kV solar systems to underprivileged households across the province.\nHe said the solarization scheme is part of the provincial government’s broader efforts to address energy needs in communities where access to electricity remains a challenge, particularly in backward and remote areas of KP.\nBy prioritizing the most vulnerable populations, he said the scheme aims to reduce the energy burden on families, enhance living standards, and promote the use of clean energy solutions in the province.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:47:17.750Z"
}
