{
  "title": "Provinces should follow Center, Punjab to ensure substantive relief  to masses : Tarar",
  "link": "https://www.app.com.pk/national/provinces-should-follow-center-punjab-to-ensure-substantive-relief-to-masses-tarar/",
  "date_published": "2024-08-19T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Minister for Information, Broadcasting, Culture and National Heritage Attaullah Tarar on Monday brushed aside the undue criticism about relief initiative of Federal and Punjab governments in power bills, and called upon other provinces to follow suit for ensuring instant relief to the masses during summer season.\nTalking to the media, he said it was the foremost priority of the government to provide substantive relief to the masses, reduce price of the electricity and bring down the inflation in the country.\n“Provision of the relief to the people by the federal and Punjab governments during the summer season is a good move which should be welcomed by all,” he added.\nHe said the federal government had already given upto Rs 5 per unit relief to all the protected and non-protected consumers in three months’ electricity bills (June to August) with a generous allocation of a subsidy of 50 billion rupees.\nTarar pointed out that all those consumers who used upto 200 units of the electricity per month, had already received the relief across the country.\nLikewise, the Punjab government allocated Rs 45 billion from its own funds to give subsidy to those who were using 200 units to 500 units per month.\nCumulatively, the relief initiatives of both the governments did provide the much-needed relief to the masses, he said, adding now it was up to other provincial governments to take identical steps to ensure relief for the masses.\nHe said these relief steps ought to be fully appreciated and called for discarding criticism to work together for collective welfare and betterment of people.\nHe said the federal government had taken optimum measures to pass on substantial relief to the masses in the given circumstances and available resources. Similarly, it was prerogative of the Punjab government to take relief initiative for its residents, he added.\nThe minister said the government was fully committed to improving the living standards of people, citing the recent significant reduction in the petroleum prices on the eve of August 14 on the directives of Prime Minister Shehbaz\nSharif.\nHe said advertisements have been published the newspapers to privatize the electricity distribution companies while a\ncrackdown against the power theft was already underway. A Task Force has been formed to find out a long-term solution for reducing the electricity prices, he added.\nSubstantive steps and measures had been taken to contain the inflation, he said, highlighting its marked reduction from 23 per cent to 11 per cent.\nHe expressed the confidence that the government’s pragmatic approach and people-friendly policies would further curb inflationary trend in the country.",
  "retrievedAt": "2025-08-11T04:47:02.873Z"
}
