{
  "title": "Romina for mobilizing resources to introduce Urban Environmental Initiatives, AE sources in rural areas",
  "link": "https://www.app.com.pk/national/romina-for-mobilizing-resources-to-introduce-urban-environmental-initiatives-ae-sources-in-rural-areas/",
  "date_published": "2024-08-19T12:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): PM’s Coordinator on Climate Change and Environmental Coordination, Romina Khursheed Alam on Monday stated that she was mobilizing resources for ongoing projects by engaging bilateral and multilateral donors as well as major banks to introduce Urban Environmental Initiatives and alternate energy sources in rural areas of Pakistan.\nShe made these remarks during a meeting with United Nations Development Program (UNDP) delegation here at the Ministry of Climate Change and Environmental Coordination, a news release said.\nIn view of proactive communication and coordination, the PM’s aide emphasized on setting up a dashboard that would also be linked with PM office, to review the progress and address the challenges to ensure fast tracking the projects & achieve objectives.\nTo battle against air pollution, the Ministry is kicking off Montreal Protocol Project nationwide in collaboration with UNDP that would fix out ozone and Hydro Chloro floro carbon( HCFC) . This project is funded by Multilateral Fund Secretariat with budget worth $594,748 and would be completed in 2027.\nThe meeting also discussed the GLOF-II project which was focusing on 10 districts of Gilgit-Baltistan and 08 districts of Khyber Pakhtunkhah with budget worth $37 million being funded by Green Climate Fund (GCF). This project is aimed to reduce flood risks and 696,000 community members are direct beneficiaries of the project.\nTo combat climate change by reducing greenhouse gases emissions, the ministry is also initiating a fresh project ” Promotion and Application of Sustainable Biomass Energy Technologies (PASBET) in the country with cost US$ 28,724,726. This project will be completed in 2028.\nTo promote environmental sustainability and building climate resilience at both national and sub-national levels the ministry is working on its flagship “Climate Resilience Program”. This climate promise initiative aims to enhance cooperation and resilience among local and regional stakeholders to address climate change threats and risks.\nThe meeting also discussed ” Global Shield Against Climate Risks” Project that was aimed to increase protection for vulnerable people by providing and facilitating substantially more and better pre-arranged finance against disasters.\nWhile assuring her fullest support to UNDP, PM’s aide Ms. Alam directed the senior officers of the ministry to convene monthly progress review meeting about these projects adding that this government under the leadership of PM was committed to make the country climate resilient.",
  "retrievedAt": "2025-08-11T04:45:46.362Z"
}
