{
  "title": "Nation to celebrate Quaid-e-Azam’s birth anniversary with traditional zeal",
  "link": "https://www.app.com.pk/national/nation-to-celebrate-quaid-e-azams-birth-anniversary-with-traditional-zeal/",
  "date_published": "2020-12-24T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):The nation would celebrate the birth anniversary of founder of Pakistan Quaid-e-Azam Muhammad Ali Jinnah today (Friday) across the country with traditional zeal and fervour.\nQuaid-e-Azam Muhammad Ali Jinnah was born on December 25, 1876 in Karachi. The birthday is a public holiday and the national flag will be hoisted on principal government buildings throughout the country.\nThe day will dawn with special prayers for the security, progress and prosperity of the country. Special events will be arranged on the day to highlight and promote ideas and views of the Quaid-e-Azam.\nVarious activities will be held in government and private organizations to shed light on Quaid-e-Azam’s lifelong political struggle and his guiding principles of unity, faith and discipline.\nThe celebrations would be aimed at educating the youth about the Quaid’s vision and Pakistan’s ideology. Quran Khawani would be held at the Mazar-e-Quaid in Karachi while change of guards ceremony would also take place.\nA large number of people from all walks of life would visit the tomb to pay tribute to Quaid-e-Azam for his services he rendered for the creation of a separate homeland for the Muslims of the Sub continent.\nMuhammad Ali Jinnah was a lawyer and politician and served as leader of the All-India Muslim League from 1913 until Pakistan’s independence on 14 August 1947, and then as Pakistan’s first Governor-General until his death on September 11, 1948.\nPakistan National Council of the Arts (PNCA) will hold grand programme titled “Millat ka Pasban” aimed to shed light on Quaid’s teachings for youth about what they need to do for their country to become a healthy nation.\nMoreover, PNCA has scheduled various events including cultural, puppet show and national songs to celebrate the Quaid’s day with zeal and passion.\nPhotographic exhibition will also be held to pay homage to Quaid-e-Azam and the services he rendered for the creation of a separate homeland for the Muslims of the Sub-continent.\nStrict SOPs will be followed with participants bound by rules to practice social distancing, use face masks and hand sanitizers.",
  "retrievedAt": "2025-08-11T20:11:01.348Z"
}
