{
  "title": "International Cricket Players to show real picture of Kashmir to the world : Sheheryar Afridi",
  "link": "https://www.app.com.pk/national/international-cricket-players-to-show-real-picture-of-kashmir-to-the-world-sheheryar-afridi/",
  "date_published": "2020-12-24T17:39:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 24 (APP):Chairman Kashmir Committee Sheheryar Khan Afridi Thursday said the international cricket players would be playing in the Kashmir Premier League (KPL) matches in Azad Jammu and Kashmir (AJK), and they would show the true picture of AJK to the globe.\nHe said this in his address to a ceremony organized in connection with the KPL at the Governor’s House here.\nTerming the KPL as a first initiative, he said that the KPL would further strengthen the cultural front in line with the steps to support the Kashmir cause and the youths of AJK would get the opportunities to show their skills and talent to the world.\nShehryar Khan Afridi said that we will also promote the values, culture and talent of the youths of AJK.\nSpeaking about the mandate of Kashmir Committee, he said it was a 28-member committee having members from all political parties and provinces of Pakistan, got the mandate to make decisions to support the Kashmir cause.\nHe pointed out that AJK President Sardar Masood Khan, will lead the KPL as its Chief Patron.\nHe called upon the business community, people from all walks of life including those belonged to performing arts, media and artists to come forward and support as well as promote the KPL.\nOn this occasion, Sindh Governor Imran Ismail, while comparing the situation of Indian Illegally Occupied Jammu and Kashmir (IIOJK) with AJK, said that the people of IIOJK could not play cricket even in their localities while the international cricket mega event “KPL” is going to be held AJK. The world will watch the difference between the two parts of Kashmir, he added.\nImran Ismail said the youths of the AJK will show their talent to the world from the KPL platform and expressed confidence that the players of AJK will share dressing rooms with the international players which will help them boosting their confidence.\nHe said that today’s ceremony was organized under the COVID-19 standard operating procedures (SOPs) and limited number of guests were invited.\nHe invited all political parties of Pakistan, artists and people from different walks of life to attend the opening ceremony of the KPL to be held in the AJK.\nSpeaking on the occasion, CEO of KPL Shehzad Akhtar shared the names of the six teams of IPL.\nHe said that Kotli Panthers, Muzafarabad Tigers, Mirpur Royal, Bagh Stallions, Rawlakot Hawks and Overseas Warriors will be in action in the mega sports event.\nHe said the KPL was going to become an international brand and we are in dialogue process with broadcasters to show the matches of the KPL all over the world through media.\nKPL President Arif Malik said that we are going to diversify different areas of the Azad Kashmir in the event. Total 18 matches of the KPL will be played in AJK including seven in Mirpur and 11 in Muzafarabad.",
  "retrievedAt": "2025-08-11T20:10:55.943Z"
}
