{
  "title": "Rashid announces extension in passport validity for 10 years",
  "link": "https://www.app.com.pk/national/rashid-announces-extension-in-passport-validity-for-10-years/",
  "date_published": "2020-12-24T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP): Interior Minister Sheikh Rashid Ahmed on Thursday announced an extension of the passport validity from five years to 10 years without any additional fee aimed at facilitating the country’s labour community working abroad especially in Middle East countries.\n“The new passport will be issued at the previous fee of Rs 3,000 and this decision will be implemented from January 1. It is a gift from Prime Minister Imran Khan for all the Pakistani labour community especially in the Middle East,” he told media persons after visiting the office of Directorate General of Immigration and Passport.\nHe clarified that the decision would not be applicable on ‘official and red’ passports; as the facility was only meant for Pakistan’s labour class.\nThe minister said a new E-passport would be launched from April 28 next year and it would help maintain data on modern lines and improve the country’s image abroad.\nSheikh Rashid said an express service was being launched across the country under which home delivery of Passports would be provided to citizens. “The facility has been activated in Islamabad and will soon be available in Rawalpindi,” he added.\nHe said an SMS service had also been started from today (December 24) with the basic aim to inform the passport holders six-month before expiry of their passports.\nFrom January 1, he said, the ‘E-service’ was being initiated in 191 countries.\nHe said as many as 64 officers of the Passport and Immigration Department were overstaying in different countries, adding they all would be called back and new officers would be posted there at the earliest.\nHe said the passport and immigration department was short of funds and assured that their financial matters would be resolved at the earliest.\nSheikh Rashid said a one-week ultimatum had been given to the elements involved in sale and purchase of smuggled petroleum products in the country to end their illegal activities.\nHe said the petrol pumps selling smuggled and substandard fuel would be shut down.\nOn expiry of the dead-line, he warned that punitive action would be taken against all those involved in the illegal trade undermining the national economy.\nAnswering a question, the minister said the visa process for the Chinese engineers, working on different projects of the China Pakistan Economic Corridor (CPEC), would be made more easy.\nTo another question, he said necessary directives had been issued to review the existing Exit Control List (ECL), adding as many as 66,000 people were on the black list of the Federal Investigation Agency and 44, 000 on the passport department’s list.\nSheikh Rashid said he had been made incharge of the committee looking into the ECL related matters.\nHe said only such persons should be on the ECL who had criminal records or found involved in anti-state activities. The ECL should be brought down to 25,000.\nResponding to a question, he said Maulana Fazl-ur-Rehman was on top of the list of 20 politicians facing life threat from terrorists, and rejected the impression of withdrawing security of any such politician.\nThe minister said Maulana Fazl was using the platform of Pakistan Democratic Movement (PDM) and wanted to create anarchy in the country for personal gains.\nAs per his political analysis, the minister said opposition parties would not tender resignations of their parliamentarians; rather they would participate in the upcoming Senate elections.\nReplying to another question, Sheikh Rashid said Muttahida Qaumi Movement-Pakistan (MQM) was an important ally of the Pakistan Tehreek-i-Insaf (PTI) government and he would meet its leadership during his visit to Karachi.",
  "retrievedAt": "2025-08-11T20:11:03.791Z"
}
