{
  "title": "Ahsan Iqbal stresses need for establishing digital corridor",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-stresses-need-for-establishing-digital-corridor/",
  "date_published": "2024-05-03T19:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 04 (APP): Minister for Planning Development and Special Initiatives Professor Ahsan Iqbal on Friday stressed the need for establishing a digital corridor, acknowledging Pakistan’s role as a prime ground for digital economic expansion.\nDuring a meeting with the delegation of Huawei Pakistan including Chief Executive Officer of the company Ethan Sun, CEO Huawei Pakistan; Ahmed Bilal Masood, Director Subsidiary Board & Deputy CEO; Mr. Yushaoning, Vice CEO; Ahmad Mehboob, Senior Manager Government Affairs, the minister emphasized the pivotal role of digital advancement in shaping the future of the national economy, said a press release.\n“Pakistanis are the second biggest nationality employed in Huawei,” said the delegation to highlight Pakistan’s potential to emerge as a key player in the competitive digital economy. It is projected that developed economies will witness a significant surge in their Gross Domestic Product (GDP) stemming from digital advancements. According to leading experts, more than 30% of the GDP of developed nations is expected to be driven by digital innovation and infrastructure by the coming decade, as expressed by CEO Huawei Pakistan.”\nDuring the meeting, discussions revolved around various projects to be included within the China-Pakistan Economic Corridor (CPEC) Phase II project list, along with collaboration opportunities concerning Pakistan’s Digital Economy Strategy. Both parties explored future ventures in digital economy transformation under CPEC, recognizing Pakistan’s significant potential for growth in this sector.\nAs Pakistan’s digital landscape is evolving rapidly, both parties shared views on the requirements for fostering a conducive environment for sustainable growth. Four key pillars were identified for establishing a robust digital corridor: connectivity, data centers, firewall protection, and smart governance. “These elements are essential to fueling economic growth and ensuring global competitiveness in the digital age,” the minister said.\nAhmed Bilal Masood Deputy CEO of Huawei Pakistan assured Pakistan can become a big trading zone for the large user base of Middle Eastern countries.\nEmphasizing the pivotal role of digital advancement in shaping the future of Pakistan’s economy, the minister asserted, “The only path to sustained economic progress for our nation is through comprehensive digital transformation. Embracing digital technologies and infrastructure is not just an option; it’s a necessity if we are to thrive in the global marketplace.”\nMoreover, notable investments are already underway to bolster the digital infrastructure and technological capabilities of Pakistan. The introduction of low prices for smartphones in the Pakistani market was also discussed. It will not only encourage users to experience mobile networks, like 4G but also will contribute to telecom market development.\nThe minister proposed to initiate Islamabad as a model smart city, emphasizing the importance of digital infrastructure provision for the new-age economy.\nAhsan Iqbal highlighted the establishment of an Innovation Center at UET Narowal, inviting Huawei to be a technology partner in this endeavor.\nEthan expressed Huawei’s keen interest in collaborating with Pakistan on the proposed initiatives, reaffirming Huawei’s dedication to fostering technological innovation and economic growth in Pakistan.",
  "retrievedAt": "2025-08-11T02:17:47.062Z"
}
