{
  "title": "Rain, thunderstorms expected in parts of country",
  "author": null,
  "content": "ISLAMABAD, Mar 12 (APP): The weather is expected to remain partly cloudy and dry in most parts of the country on Thursday, according to the Pakistan Meteorological Department (PMD).\nHowever, rain-wind/thunderstorm, with snowfall over high mountains, is likely at isolated places in Khyber Pakhtunkhwa, Kashmir, Gilgit-Baltistan, Islamabad, and upper Punjab.\nPartly cloudy weather with a 60 percent chance of rain-wind/thunderstorm is expected in Islamabad and its surroundings.\nIn Khyber Pakhtunkhwa, rain-wind/thunderstorm with snowfall over high mountains is expected in Chitral, Dir, Swat, Kohistan, Shangla, Battagram, Mansehra, Abbottabad, Nowshera, Swabi, Mardan, Buner, Peshawar, Kohat, Karak, Bannu, Bajaur, Mohmand, Kurram, Khyber, and Waziristan. Most districts of Punjab will experience dry and partly cloudy weather; however, rain-wind/thunderstorm is likely in Rawalpindi, Attock, Jhelum, Chakwal, Mandi Bahauddin, Sargodha, Mianwali, Khushab, Gujrat, Sialkot, Narowal, Lahore, Gujranwala, Faisalabad, and Sheikhupura.\nMurree and Galliyat may see rain with light snowfall. Sindh will remain dry, with hot weather expected in the lower districts.\nIn Balochistan, dry conditions will prevail in most areas, while northern parts may experience partly cloudy weather.\nCloudy conditions with rain-wind/thunderstorm and snowfall over the hills are expected in Kashmir and Gilgit-Baltistan.\nPartly cloudy weather prevailed across most regions in the past 24 hours, with rain-wind/thunderstorms recorded at isolated locations in upper Khyber Pakhtunkhwa, Kashmir, Gilgit-Baltistan, Islamabad, and the Pothohar region.\nThe rainfall recorded in millimeters was Cherat 14, Dir Upper 12, Kakul 09, Peshawar Airport 9, Balakot 06, Muzaffarabad City 07, Garhi Dopatta 07, Rawalakot 03, Murree 04, Islamabad Zero Point 03, Attock 03, Rawalpindi Shamsabad 2, Skardu 05, Astore 03, Chilas 02, and Nokkundi 01.\nThe lowest recorded temperatures today in degrees Celsius were Leh (-3), Gupis (-1), and Parachinar (-1).\nA high pollen count of 10,494 particles per cubic meter was recorded, which may impact individuals with allergies.\nResidents in affected areas are advised to stay updated on weather conditions and take necessary precautions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:39:59.233Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rain-thunderstorms-expected-in-parts-of-country/",
  "dateList": "2025-03-13",
  "date_published": "2025-03-12T19:31:00.000Z"
}
