{
  "title": "NTDC commits Rs.781 million to local power industry",
  "author": null,
  "content": "ISLAMABAD, Mar 13 (APP): The National Transmission and Despatch Company (NTDC), the backbone of Pakistan’s power sector, has continued the initiative to promote local industry and indigenization by placing educational orders worth approximately Rs. 781 million with the domestic manufacturers.\nThese orders encompass transmission towers, high-accuracy energy meters, monitoring devices for autotransformers and conductors, said a press release issued here on Thursday.\nAs part of this effort, a five member committee led by General Manager (Design and Engineering), Engr. Dr. Khawaja Riffat Hassan, accompanied by General Manager (Asset Management) North, Engr. Muhammad Mustafa, Chief Engineer (Transmission Line Design), Engr. Shahid Shafi Sial and Chief Engineer (Material Procurement and Management) Engr. Zahid Iqbal visited the premises of M/s Siddique Sons in Lahore to evaluate the quality of their manufacturing processes and equipment.\nThis initiative builds upon NTDC’s indigenization efforts that began in 2017 during the present Chairman Board of Directors, Dr. Fiaz Ahmed Chaudhry’s tenure as Managing Director.\nSubsequent managing directors and board of directors have continued to support this cause. Managing Director NTDC, Engr. Muhammad Waseem Younas approved the award of Educational Order to local manufacturers of Energy Meters.\nWith the execution of this order, local industry will have sufficient capability of manufacture Energy Meters of 0.2s class accuracy for the first time in Pakistan.\nEducational orders are issued, pursuant to SRO 827 issued by the Ministry of Commerce, to encourage new entrants who otherwise do not fulfill the regular bidding qualification criteria. This strategic approach has resulted in contracts worth billions of rupees being awarded to local industries, helping to save precious foreign exchange while ensuring timely delivery of crucial project material and better after-sale services.\nSeveral firms, including manufacturers of transformers and high-voltage transmission towers, have already been registered under this initiative, with more companies presently under consideration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:38:38.190Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ntdc-commits-rs-781-million-to-local-power-industry/",
  "dateList": "2025-03-13",
  "date_published": "2025-03-13T18:57:00.000Z"
}
