{
  "title": "Woman held for ‘killing’ second wife of husband in Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Police arrested a woman on Monday for allegedly killing her husband’s second wife and dumping the body in a quarter adjacent to her house in Liaquatabad area of the city.\n\nAccording to a police official, some locals witnessed a woman dumping a sack in a quarter adjacent to her house. Finding the woman’s activity suspicious, they reported the matter to the police, he said.\n\nA police team arriving at the scene, recovered the sack, finding the body of a woman packed in it.\n\nHe said the murdered woman, identified as Tayyaba, turned out to be the second wife of a local resident, Imran.\n\nHe said when the police interrogated Imran’s first wife Sadia, she confessed to have killed Tayyaba for contracting marriage with Imran.\n\nIn her confessional statement, Tayyaba said she first hit Sadia’s head with a heavy object, leaving her unconscious and then slit her wrists with a knife. Sadia died of excessive bleeding, she added.\n\nThe police later lodged a murder case against the suspect and shifted the body to the city morgue for autopsy.\n\nTo a question, the police official said they were also questioning Imran to determine his role in the murder of Sadia.\n\nIn another incident took place in Harbanspura area, a 65-year-old woman, Fazeela, was found dead in her house under mysterious circumstances.\n\nThe police said the woman was a widow and residing alone in her house.\n\nApparently, there were no torture marks on the body.\n\nHowever, according to a police official, the body was shifted to the city morgue for a postmortem examination to find out the cause of her death.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:45:11.323Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895701/woman-held-for-killing-second-wife-of-husband-in-lahore",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T03:05:10.000Z"
}
