{
  "title": "Inflation drops to lowest in nearly a decade - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Consumer Price Index eases 0.8pc month-on-month; falls to 1.5pc year-on-year\n• Falling food prices contribute to slowdown; decline exceeds even ministry’s expectations\n• PM credits economic team, says macroeconomic gains reaching people\n\nISLAMABAD: Annual inflation continued its downward trend, falling to a nearly decade-low of 1.5 per cent year-on-year in February, primarily driven by a decline in perishable food prices, especially wheat flour.\n\nThe decline even exceeded the Ministry of Finance’s expectations, which had projected inflation to remain between 2pc and 3pc. In its February report, the ministry also predicted that the figure would rise to between 3pc and 4pc by March.\n\nThe slowdown in inflation is primarily driven by lower prices of wheat and its by-products, perishable items like onions, certain pulses, and a slight reduction in electricity charges. These products hold significant weight in inflation calculations, making even minor price changes impactful in reducing the overall inflation rate.\n\nIn contrast, sugar and edible oil pri­ces are rising in the domestic market despite their declining rates globally. The government has permitted sugar exports, particularly to Afghan­is­tan, citing surplus stock as the reason.\n\nThe headline inflation, measured by Consumer Price Index (CPI), eased by 0.8pc in February on a month-on-month basis, according to data released by the Pakistan Bureau of Statistics on Monday.\n\nThe inflation rate in February 2025 was the lowest since November 2015, mainly due to the high base effect from the previous year (February 2024 — 23.1pc). The CPI inflation dropped to 9.6pc in August 2024, marking the first single-digit figure in over three years, and the downward trend continued in the following months.\n\nThe CPI inflation surged above 10pc in November 2021 and remained in double digits for 33 consecutive months until July 2024. In between, it peaked at 38pc in May 2023, driven by unprecedented food and energy prices.\n\nPakistan is currently experiencing disinflation, indicating a slowdown in inflation. In contrast, deflation refers to a decline in overall price levels.\n\nAccording to the Pakistan Bureau of Statistics (PBS), average cumulative inflation over the past 49 months increased by 83pc, impacting the retail prices of all consumer items. This decline in inflation does not indicate a reduction in the cost of living.\n\n‘Economic team’s efforts’\n\nIn a statement, Prime Minister Shehbaz Sharif expressed satisfaction over the continuous decline in the CPI inflation. “This is very good news on this occasion as the current government completes its first year,” the premier remarked.\n\nHe attributed the decline to his economic team’s efforts, saying that economic indicators are improving with each passing day. He claimed that the benefits of macroeconomic improvement have started reaching the people. “I strongly hope that inflation will decrease further.”\n\nIn the first eight months of FY25 (July-February), inflation averaged 5.85pc compared to 27.96pc during the same period last year. Analysts attributed the decline to lower global commodity prices, stable exchange rates, higher base effect and better agricultural outputs.\n\nThe IMF has revised its inflation forecast for FY25 down to 9.5pc from the previous estimate of 12.7pc.\n\nIn February, urban inflation stood at 1.8pc year-on-year, while rural inflation was recorded at 1.1pc.\n\nFood, core inflation\n\nFood inflation for February recorded a negative growth of 0.9pc in urban areas and -4.3pc in rural areas, whereas non-food inflation was 3.6pc in urban areas and 6.6pc in rural areas. Food inflation was 9.4pc in October 2021. Since then, it has progressively increased, with a record 48.1pc reported in May 2023.\n\nInterestingly, the PBS index indicates a decline in food prices. However, in the open market, retail prices of most food products — except wheat, wheat flour, and a few vegetables like onions and tomatoes — have not decreased for consumers.\n\nCore inflation, which excludes volatile food and energy prices, was recorded at 7.8pc in urban areas and 10.4pc in rural areas in February. Over the past 13 months, urban core inflation peaked at 18.4pc in July 2023 and remained at the previous month’s level.\n\nAs a result, the State Bank of Pakistan lowered the interest rate to 12pc in its last monetary policy review. The next meeting on March 10 will decide the new policy rate.\n\nMain contributors\n\nIn urban areas, the food items whose prices saw the month-on-month (MoM) decline in February included tomatoes (56.76pc), onions (31.49pc), potatoes (20.10pc), fresh vegetables (16.73pc), eggs (14.23pc), pulse gram (10.21pc), tea (10.03pc), besan (8.68pc), gram whole (5.46pc), wheat (2.97pc), pulse mash (2.82pc), wheat flour (2.23pc), chicken (1.51pc), pulse masoor (1.49pc), pulse moong (1.33pc), wheat products (1.25pc), mustard oil (1.19pc), fish (0.12pc) and milk products (0.10pc).\n\nThe MoM increase was recorded in prices of fresh fruits (14.99pc), sugar (9.35pc), butter (5.61pc), condiments and spices (1.59pc), bakery and confectionary (1.19pc), beverages (1.16pc), honey (1.12pc), vegetable ghee (0.66pc), meat (0.46pc), rice (0.39pc), cooking oil (0.35pc), readymade food (0.33pc), beans (0.21pc) and milk powder (0.03pc).\n\nThe MoM increase was also recorded in non-food items, including accommodation services (5.07pc), major tools & equipment (1.16pc), mechanical services (0.89pc), doctor (MBBS) clinic fee (0.80pc), motor fuel (0.75pc), construction wage (0.74pc), plastic products (0.63pc), dental services (0.51pc) and furniture & furnishing (0.48pc).\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:57:34.440Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895622/inflation-drops-to-lowest-in-nearly-a-decade",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:49:01.000Z"
}
