{
  "title": "Yasmin Rashid flays law minister for ‘lies’ at UN moot - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Berating Federal Law, Justice and Human Rights Minister Azam Nazeer Tarar for giving wrong information at the 58th session of UN Human Rights Council, PTI Punjab incarcerated President Dr Yasmin Rashid has demanded that the amended PECA Act should be invoked against him for ‘fake news’.\n\nIn a letter written from jail on Monday, Dr Rashid criticized Mr Tarar for saying that Pakistan was committed to upholding human rights and claiming that the 26th Amendment had been passed to protect human rights. She asked whether suppression and oppression being practised against the opposition since 2022 was a part of your human rights campaign.\n\nThe PTI Punjab president explained nine points, highlighting atrocities being committed against people of Pakistan. She wrote the concept of ‘Chaddar and Char Diwari’ was no longer valid as police had barged into homes without warrants and harassed women and children. She said women were dragged by hair in the streets, battered and imprisoned for protests.\n\nDespite all atrocities, she said, the PTI won the general election with the largest number of seats but the government was formed by the PML-N and PPP in connivance with the election commission. She said the election tribunals did not respond to the petitions by the Form-47 affectees.\n\nMs Rashid alleged that the sitting government ordered the killing of the PTI workers in Islamabad on Nov 26 last year and the law minister had the audacity to claim that there were no human rights violations.\n\nShe said the political workers had been tried and punished by the army courts and more than 5,000 workers had been languishing in jails since the government came while Imran Khan was imprisoned along with his spouse on frivolous charges.\n\nDr Rashid pointed out that she, along with her colleagues, had been incarcerated for the last 22 months despite the fact that they were not convicted and not given bails. She added that journalists had been harassed for speaking truth and put off air.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:57:00.214Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895687/yasmin-rashid-flays-law-minister-for-lies-at-un-moot",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T02:42:09.000Z"
}
