{
  "title": "FIA arrests 6 fugitives in UAE wanted in cases of terrorism, murder - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Federal Investigation Agency (FIA) on Tuesday arrested six fugitives from the UAE — wanted in cases of terrorism, murder, attempted murder, robbery and fraud.\n\nA spokesperson for the FIA said that the arrests were made through major operations led by the agency’s National Central Bureau (NCB) Interpol.\n\nThe arrested individuals — identified as Sufyan Ali, Akasha Iqbal, Zohaib Shehzad, Abdul Latif, Muhammad Jaleel, and Muhammad Ramiz Ashraf — were wanted by Punjab police in various criminal cases.\n\nAli was wanted in a terrorism and attempted murder case registered at the Wazirabad city police station in 2022 in Sialkot, while Shehzad was involved in a robbery case at the Satrah police station.\n\nMeanwhile, Latif was wanted in a murder case by the Airport police station in Rahim Yar Khan.\n\nJaleel, who was a fugitive for nine years, was wanted by Dera Ghazi Khan police in a robbery case.\n\nRamiz was wanted in an attempted murder case by the Sadiqabad police station in Rawalpindi. Similarly, Iqbal was facing charges of fraud, registered in 2023, at the Civil Lines police station in Sialkot.\n\nThe FIA confirmed that red notices were issued through the NCB Interpol to facilitate the arrests.\n\nThe fugitives are being transferred from the UAE to the Lahore Airport, where they will be handed over to the Punjab police.\n\nThe FIA officials emphasised that these arrests were made possible through close coordination between the Interpol Islamabad and Interpol Abu Dhabi.\n\nThey reiterated that the NCB Interpol, equipped with modern technology, operated 24/7 to track and apprehend fugitives globally.\n\nThe agency reaffirmed its commitment to bringing fugitives to justice, stating that all available resources were being utilised to apprehend criminals evading the law, according to a spokesperson.\n\nIn April 2023, Punjab police arrested 10 proclaimed offenders from Gulf states and other countries in cases lodged against them at various police stations of the province.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:56:46.063Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895762/fia-arrests-6-fugitives-in-uae-wanted-in-cases-of-terrorism-murder",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T10:24:28.000Z"
}
