{
  "title": "Shehbaz to review govt’s one-year performance today - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PM content with team’s performance, steep decline in inflation; UK diplomat calls on premier\n• Tarar says govt didn’t just stabilise economy, but charted path to growth\n\nISLAMABAD: The federal government will hold a special gathering at the Jinnah Convention Centre today, where Prime Minister Shehbaz Sharif is expected to review the performance of his cabinet members upon completing one year in power.\n\nThe Shehbaz administration took office after the Feb 8 polls, following a power-sharing agreement between the PML-N and the PPP.\n\n“On the completion of one year of the government, the prime minister along with his cabinet members will present one-year performance of different ministries and divisions in a special moot today to review the performance account of the government during the last year,” said a press release issued by the Prime Minister’s Office (PMO) on Monday.\n\nThe moot will be attended by businessmen, media persons, and high-achieving youth. A source close to the premier told Dawn that during the briefing, the PM could randomly ask a minister to present the performance of their ministry.\n\nIn an earlier statement, the premier expressed satisfaction with the government’s one-year performance.\n\nThe PM said due to the government’s efforts, the economic indicators were improving with every passing day. The continuous improvement in the economy was the result of diligent teamwork, he added. The prime minister said all the institutions were working together for the betterment of the economy and for promoting business and investment.\n\nUK envoy\n\nLater, High Commissioner of the United Kingdom Jane Marriott called on PM Shehbaz. The prime minister conveyed his greetings to His Majesty King Charles III and wished him a quick recovery to full health. He also reiterated the invitation to his majesty for undertaking a visit to Pakistan at his earliest convenience.\n\nWhile discussing the global situation, the prime minister emphasised the need for collective efforts to build lasting peace in Gaza and Ukraine. The high commissioner said the UK was committed to strengthening its ties with Pakistan and to continuing to partner in the country’s national progress and development.\n\n‘Art of governance’\n\nSeparately, Information Minister Attaul­lah Tarar said PM Shehbaz had steered the country out of economic crises, restored Pakistan’s reputation at the international level, and brought prosperity and development to the country within one year of his government.\n\nIn a press conference, Mr Tarar said on the completion of one year in power, PM Shehbaz would take a cabinet review and share with the public the overall performance of every ministry. Journalists will be invited to share the facts and figures in this regard, he added.\n\n“What seemed an insurmountable challenge just twelve months ago has yielded a remarkable turnaround. We have not simply stabilised the economy but also charted the path of growth,” he claimed.\n\nWhile pointing out the speculations made about the economy and future of the country one year ago, he called out the PTI “which yearned for economic instability and bankruptcy of the country and even wrote a letter to the IMF to disrupt its bailout programme”.\n\nOn the other hand, the PML-N had taken tough decisions and sacrificed its politics over national interest. “PM Shehbaz Sharif is a reformist leader who knows the art of governance. It is no less than a miracle that the inflation has come down to 1.5 per cent, which last year was recorded at 23.1 per cent,” he added.\n\nThe national economy showed positive indicators, he said, while noting the current account surplus and substantial increase in the exports.\n\nThe minister also criticised the PTI for engaging in ‘politics of chaos and anarchy’.\n\n“There is a feel-good factor of Pakistan within the country and abroad,” he said while criticising the PTI regime which failed to provide the masses proper infrastructure, health and education systems, and other facilities.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:57:21.284Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895662/shehbaz-to-review-govts-one-year-performance-today",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:49:13.000Z"
}
