{
  "title": "Robbers have a field day in Islamabad - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Robbers and thieves looted cash and valuables, including five motorcycles in 10 separate strikes in the capital, police said on Monday.\n\nA gang of three robbers looted a motorcycle and mobile phones from three different people in Dhok Abbasi.\n\nThe robbers first intercepted Aftab Khan when he was going to market to buy dairy products and snatched a motorcycle from him. The gunmen then intercepted Quaid Rahimzada and looted a mobile phone from him at gunpoint.\n\nThey also snatched a mobile phone from another man and escaped.\n\nLikewise, a gunman looted cash and gold worth Rs500,000 from a man at Saon Garden.\n\nSimilarly, a gang of three robbers looted a motorcycle and a mobile phone from a man at Iqbal Town. They came on a motorcycle and intercepted Irfan Masih when he turned his two-wheeler towards Iqbal Town from Expressway and held him at gunpoint.\n\nLater, the gunmen escaped with a motorcycle and a mobile phone worth Rs170,000.\n\nMoreover, a gang of two robbers looted a motorcycle and a mobile phone from a man at the Expressway. The robbers intercepted Rahmat Khan and held him up at gunpoint when he reached near a pedestrian bridge on the Expressway.\n\nLater, the gunmen snatched a motorcycle and two mobile phones worth Rs130,000 from him.\n\nFurthermore, a group of two robbers looted three mobile phones from Umair Ahmed and his two friends on the Srinagar Highway.\n\nLater, the gunmen looted three mobiles worth Rs170,00 from them and escaped.\n\nBesides, another gang of four robbers looted a motorcycle and a mobile worth Rs215,000 from Syed Haider Ali at Khuta Road. Another gang of three robbers looted a Suzuki 150 worth Rs200,000 from Hamza Jamshid at the Expressway.\n\nMeanwhile, thieves stole cash and valuables worth over Rs1million from a house at Chatha Bakhtawar. The incident took place when the residents of the house were away.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:56:48.694Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895602",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:50:00.000Z"
}
