{
  "title": "UN rights chief worried about ‘direction’ of US policy - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: The United Nations rights chief expressed deep concern on Monday about a “fundamental shift in direction” by the United States under President Donald Trump, warning that divisive rhetoric is being used to deceive and polarise people.\n\n“We have enjoyed bipartisan support from the US on human rights over many decades … I am now deeply worried by the fundamental shift in direction that is taking place domestically and internationally,” the UN High Commissioner for Human Rights, Volker Turk, said in a speech which did not mention Trump by name.\n\n“Policies intended to protect people from discrimination are now labelled as discriminatory … Divisive rhetoric is being used to distort, deceive and polarise. This is generating fear and anxiety among many,” he said.\n\nTurk’s speech to the UN Human Rights Council in Geneva — a body which Trump disengaged from in February — are his strongest remarks so far on the impact of the new US administration’s policies.\n\nSince taking office on Jan 20, Trump has issued a series of executive orders aimed at dismantling diversity, equity and inclusion programmes across the federal government and the private sector. USAID programmes were also paused for 90 days, while his administration reviews if they align with its ‘America first’ policy.\n\nThe UN human rights office’s chronic funding shortages may be exacerbated by US foreign aid cuts. The United States donated $35 million last year which accounted for about 15 per cent of the total voluntary contributions received in 2024.\n\n“Sweeping cuts to domestic social safety nets, climate finance and foreign aid signal a massive setback for human rights protection, for conflict prevention, and for global stability”, Turk said.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:45:12.299Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895673/un-rights-chief-worried-about-direction-of-us-policy",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:49:41.000Z"
}
