{
  "title": "PM Shehbaz forms Dar-led body for ‘early realisation’ of accords with Azerbaijan - Business - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Tuesday formed a committee to ensure the early realisation of memorandums of understanding (MoUs) and agreements signed with Azerbaijan during his recent visit to the country.\n\nDuring PM Shehbaz’s visit to Azerbaijan last week, the two sides had finalised matters related to $2 billion investment by Baku in Pakistan, as well as agreed to expand bilateral trade volume and promote joint defence production.\n\nDeputy PM Ishaq Dar, who also serves as the foreign minister, will head the committee, the Associated Press of Pakistan reported, quoting a press release issued by the Prime Minister’s Office (PMO) today.\n\nThe decision to form the panel — tasked with preparing agreements in the energy and infrastructure sectors — came as PM Shehbaz chaired a meeting to review the implementation of the accords signed with Azerbaijan.\n\nThe premier directed the authorities to present an action plan to increase the country’s trade volume with Azerbaijan to $2bn.\n\nHe further ordered that all preparations be completed “on a priority basis” ahead of the expected visit of Azerbaijan President Ilham Aliyev to the country in April.\n\nDuring PM Shehbaz’s two-day official visit to the Central Asian state, President Aliyev had also assured the premier that he would visit Islamabad this April to formalise the $2bn agreements for investment in Pakistan.\n\nThe prime minister today also “instructed the appointment of trade officers in Azerbaijan and other countries with a significant potential for trade with Pakistan”, the statement read.\n\nPM Shehbaz underscored the “longstanding brotherly relations between Pakistan and Azerbaijan”, adding that the government was taking measures to “capitalise on the vast trade and investment potential between Pakistan and Central Asian states”.\n\nThe participants of the meeting were informed that 83 Pakistani and 101 Azerbaijani companies participated in the Pakistan-Azerbaijan Business Forum held in Baku last week, which was attended by the premier.\n\nDuring the prime minister’s visit, 13 MoUs and agreements were signed between Pakistan and Azerbaijan to promote bilateral cooperation, according to APP.\n\nOut of those, four MoUs pertained to oil that involved Pakistan State Oil Company Ltd (PSO) and State Oil Company of Azerbaijan Republic (Socar).\n\nAnother pact was an ame­ndment agreement for the Sale and Purchase of LNG cargoes related to the Master LNG Sale and Purchase Agreement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/041438189e2db80.jpg",
  "retrievedAt": "2025-08-25T14:56:46.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895759/pm-shehbaz-forms-dar-led-body-for-early-realisation-of-accords-with-azerbaijan",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T10:53:50.000Z"
}
