{
  "title": "Gambling with World War III - World - DAWN.COM",
  "author": null,
  "content": "TOO many opposite and unyielding opinions are ranged on the subject, which requires an explanatory note before coming to the point. The ungainly White House spat between Donald Trump and Volodymyr Zelensky has gripped everyone’s attention. But let me make a small point here.\n\nIf anything, the wordy duel reminds one of an old Chinese saying: ‘Don’t interrupt the enemy if he is making a mistake.’ Think about it. If Trump’s controversial actions at home help to dismantle the global snooping menace of Five Eyes — the sobriquet for the dark club of intelligence agencies of the US, UK, Australia, Canada and New Zealand, is it not a matter of relief for the rest of the world?\n\nCynics may consider the views of Edward Snowden on the subject. It was his revelations about the Five Eyes intelligence alliance that exposed how the US and its allies spy on citizens and share their information.\n\nOn the diplomatic circuit, if Trump’s actions in the war in Ukraine stop the meat grinder from wasting more human lives and also helps undermine the corrosive transatlantic military alliance of old colonial powers, should the rest of the world rejoice or go into depression?\n\nSome discussants on the subject see Vladimir Putin as a greater threat to peace. Zelensky calls him a terrorist. Ukraine’s constitution forbids him to talk to Putin. Airy-fairy duels don’t lead anywhere. In fact, a most crucial observation that was made in the Oval Office on Friday has been buried in the rush to take sides between Zelensky and his host and Putin.\n\nThe point we may have missed was Trump’s sound advice to Zelensky showing him the door.\n\nThe point we may have missed was Trump’s sound advice to Zelensky showing him the door: “You are gambling with World War III.” It’s hard to remember an American president confessing to an ally he had been arming in a brutal war to be wary of the conflict turning into a nuclear war.\n\nAnyone can describe Trump as a threat to America, to democracy and so forth. No one is taking away the import of that criticism. But valid as it is, the timing of the criticism masks the distress of Jack Nicholson’s complaint in As Good As It Gets. “I am drowning here, and you are describing the water.”\n\nTrump, in fact, made another self-appraisal for Zelensky to ponder. He said the Ukraine-Russia war should never have happened. It is a fratricidal war, indeed, just as the Afghans were made to range against each other with this or that ruse, only to be abandoned because of imperialism’s attention deficit.\n\nWe saw pretty much the same thing in Vietnam, pitting brother against brother. The Iraq war was as contrived as the Ukrainian conflict. The modus operandi was also the same: give the quarry the kiss of death. April Glaspie did to Saddam Hussein what years later Victoria Nuland would do to Zelensky. Both were seduced into ruinous wars and then presented with the bill for reparations.\n\nBefore the current stand-off, ordinary Russians and Ukrainians were invested in each other as members of a larger Slavic family. They shared a common history, most notably of jointly defeating Hitler, although Ukraine had its own variants of Nazi sympathisers too. The two peoples shared the same church, their cuisine, and much of their culture. Ironically, powerful Soviet leaders had Ukrainian links. Nikita Khrushchev, Leonid Brezhnev, and Konstantin Chernenko were born or raised in Ukraine.\n\nWhy was Trump speaking to Zelensky about the spectre of a nuclear holocaust should Ukraine continue to rib Russia with foreign weapons? It’s possible, as some analysts believe, that he was warning European partners as much as Zelensky about the perils of persisting with a fruitless and calamitous conflict. Now that Russia and the US appear to be on the same page in the stand-off, where could the trigger for a catastrophe be lying?\n\nThere are several triggers, not least in the Middle East, while the South China Sea continues to be another volatile region. But the real Russian roulette that Trump was cautioning about is being played out in London by none other than the usual suspects.\n\nA ‘coalition of the willing’ is being hustled together. Keir Starmer and Emmanuel Macron, both struggling with terrible popularity ratings at home, insist they want to put ‘boots on the ground’ in Ukraine, ostensibly to strengthen Zelensky’s hand in the event of a ceasefire. Credible analysts see this as a poisoned chalice for Putin. After all, Russia waded into Ukraine to vacate the possibility of having Nato members on its borders. European leaders know Putin would never accept them as neighbours.\n\nMoreover, as implied by Trump in his second term in office, the West, more specifically Nato, had deliberately provoked Putin. The UK has been stressing that a Russian victory would pose a threat to Europe. Does the claim have any basis in fact? Or is it rooted in Britain’s history of Russophobia?\n\nEver since Churchill’s iron curtain speech and the rise of James Bond, Russophobia has only prospered. The chorus in the Biden days was that Russia had lost the war. Trump pooh-poohed the claim and effectively said it isn’t happening. His predatory fangs are out for Ukrainian minerals instead. He won’t be unaware that the Ukraine war is also known as Hillary Clinton’s revenge for Putin’s indiscretion of stalling her dismantling of Syria à la Libya in Antony Blinken’s company.\n\nThe businessman in Trump makes him instinctively averse to needless risks. He should have been rattled last month when a military helicopter crashed midair into a commercial airliner over Washington airport. The helicopter was carrying out a mock drill to evacuate an imaginary POTUS to safety during an imaginary nuclear attack.\n\nTo make it eerier, Annie Jacobsen, in her insightful book called Nuclear War, had only recently described a helicopter crash involving the US president who was being rescued to a safehouse but ended up with multiple fractures and no one alive to help.\n\nThe writer is Dawn’s correspondent in Delhi.\n\njawednaqvi@gmail.com\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c6674707eef.png",
  "retrievedAt": "2025-08-25T14:57:00.580Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895684/gambling-with-world-war-iii",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T02:38:12.000Z"
}
