{
  "title": "29 booked for killing six; one of accomplices found shot dead in Gujrat - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: Police claimed on Monday that an accomplice of the assailants who had gunned down at least six people in an ambush near Dinga, was also found shot dead in firing by his own accomplices.\n\nThe case of murdering the six individuals has also been lodged against at least 29 people, including 21 nominated and seven unidentified suspects.\n\nKharian circle DSP Shahid Mehmood Gujjar said Zahoor alias Joori of Randheer village who had been wanted to police in a number of murder and other cases, was found shot dead from the area by the alleged firing of his own accomplices who managed to flee the scene soon after killing the six people in Mina Chak Bhargran of Dinga police precincts.\n\nMeanwhile, the bodies of victims of the firing by rival Akhtar group were handed over to the heirs after autopsy at Kharian Tehsil Headquarter hospital and they were laid to rest after offering funeral prayers in Dinga Khurd village on Monday.\n\nDinga police registered the case against Chaudhry Akhtar, Usman, Zohaib, Zahoor alias Joori, 18 nominated and 7/8 unidentified suspects under sections 302, 440, 404, 148, 149 and 109 of Pakistan Penal Code on the report of Muhammad Rasib, the brother of deceased Rukhsaar, and started investigation.\n\nThe Kharian DSP said Gujrat DPO Dr Mustansar Atta Bajwa had constituted at least three teams under Gujrat SP investigation Riaz Ahmed Naz to trace and arrest the suspects involved in the incident.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:45:28.806Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895702/29-booked-for-killing-six-one-of-accomplices-found-shot-dead-in-gujrat",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T03:05:51.000Z"
}
