{
  "title": "Day-long rain in twin cities increases water level in Rawal Dam - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Light to heavy rain on Monday created a slushy mess on roads and streets in the twin cities of Rawalpindi and Islamabad, but increased the water level in the reservoirs.\n\nIn Murree, 3.5 inches of snowfall was recorded which brought down the temperature in the hill station while the administration was working to keep the roads open. The Met Office predicted cloudy weather and isolated rain on Tuesday (today).\n\nResidents of the federal capital and the garrison city woke up to a chilly morning with temperature dropped to seven degrees Celsius as the rain started in the early hours. The Met Office predicted moderate to heavy rain and snowfall in Murree, Galliyat, Naran, Kaghan, Chitral, Dir, Swat, Kohistan, Mansehra, Abbottabad, Shangla, Astore, Hunza, Skardu, Neelum Valley, Bagh, Poonch and Haveli.\n\nIt stated that there was the possibility of landslides and avalanches in hilly areas of Khyber Pakhtunkhwa, Gilgit-Baltistan and Kashmir. It asked tourists and travellers in these areas to remain cautious.\n\nWater-storage has improved, supply to Wasa will continue without any hurdle till monsoon, says official\n\nIt said a westerly wave was affecting the upper and central parts of the country and may persist in upper parts till Tuesday morning (today).\n\nThe Met Office recorded 31mm rain at the Islamabad airport, 20mm at Bokra, 22mm at Zero Point, 28mm at Golra and 23mmat Saidpur in Islamabad; 21mmrainat Shamsabad, 25mm at Kutchery and 35mm at Chaklala in Rawalpindi.\n\nThe rain inundated the underpass of Committee Chowk and low-lying areas of the garrison city. The Water and Sanitation Agency cleaned the areas with heavy machinery.\n\nIt was a bad day for motorists as they had to steer through puddles on roads especially in cantonment areas and face worst traffic jams on Murree Road, The Mall, Bank Road, Rashid Minhas Road, Ammar Chowk, Chaklala Scheme-II and Rawal Road.\n\nThe fruit and vegetable markets at I-11, I-9, I-10 and G-9 presented a sorry state of affairs of the civic body of the capital city. Water remained accumulated on roads and created problems for pedestrians and motorists.\n\nOn the other hand, the water level in Rawal Lake was recorded at 1747 feet while the spillways are open when the water level increases to1752feet. Officials said the water storage had improved and supply will continue to Wasa without any hurdle till the next monsoon.\n\nRawal Dam is supplying 28 million gallon daily (MGD) water to Rawalpindi city and cantonment areas through the Rawal filtration plant.\n\nWasa spokesman Umer Farooq said the agency canceled the holidays of its staff and put them on alert to avoid any untoward situation in the city. He said Wasa teams drained out rainwater with the help of heavy machinery from Committee Chowk underpass, Liaquat Bagh, Asghar Mall Chowk and Murree Road.\n\nThe district administration and the meteorological department are in touch and are ready to deal with any kind of emergency. He asked people not to leave their homes unnecessarily and stay away from electricity lines and poles. However, he said water level in Leh Nullah was normal at 8.5 feet recorded at Kattarian bridge and 6.5 feet at Gawalmandi.\n\nIt may be mentioned that the pre-alert situation for a flood in the nullah starts from 11.5 feet and the dangerous level from 22 feet with a spillover starting at 30 feet.\n\nIn Murree, 3.5 inches of snowfall was recorded on The Mall, Kashmir Point, Kuldana, Sunny Bank, Kali Miti and other area.\n\nDeputy Commissioner Agha Zaheer Shirazi said the district administration was working actively to keep the roads open and snow was being removed using machinery.\n\nHowever, he said there was no report about blockade of any road in the district.\n\n“Monitoring is being conducted through close circuit TV cameras.” He advised visitors to check the weather situation before travelling to the area.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c61dad60728.jpg",
  "retrievedAt": "2025-10-12T01:45:07.895Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895617/day-long-rain-in-twin-cities-increases-water-level-in-rawal-dam",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:50:00.000Z"
}
