{
  "title": "Is all well? - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT’S been a good week for the government.\n\nIt truly has.\n\nIt completed a year with great fanfare (and advertising). There seems to be no immediate threat on the horizon, leading everyone in power or close to them to boast of a long run. No wonder, then, that the federal government has also expanded the cabinet, inducting friends, allies, and enemies alike. The parliamentarians also gave themselves a pat on the back and a raise to ensure everyone realised how happy they were with their own performance.\n\nThere was criticism here and there — of the raise, of the advertising that was excessive, and the expansion that seemed to have nothing to do with governance. This was water off a duck’s back. After all, the IMF programme is on track, the rupee is stable, inflation is slowing down, and there has been no call from the US either. The horse and cattle show was also a success.\n\nIt truly is a case of ‘aall izz well, array chachu, aall izz well’.\n\nAnd why wouldn’t it be well? Not just for the successes recounted above but also the victory on the judicial front. The new judges have been inducted and, by ‘coincidence’, their placements — be they in the Supreme Court or the Islamabad High Court — will ensure that none of the ‘difficult’ judges will get to dominate now. There is now little chance of any instability due to judgements as such.\n\nThe government let its jitters turn a low-profile event into a successful effort of resistance.\n\nElsewhere, too, another institution, has been tamed. For why else would government officials, while pitching Peca, claim that the law would only target those working on social media?\n\nIn this assurance is the assumption that mainstream media is hardly a challenge (or dare one say a threat). It’s only the ‘out of control’ social media which has to be tamed. And for this, Peca is simply the newest tool in the government’s hand; it also has the defamation law passed by Punjab and the mythical firewall handy.\n\nBut if aall izz well, and we believe the government when it says aall izz well, then why was a vanilla event of the opposition stopped?\n\nFor once, the PTI wasn’t protesting. It wasn’t threatening to march on to Islamabad. It wasn’t promising a never-ending dharna (which would end in a trek by a health-conscious chief minister). This time around, there were no claims or slogans or preparations. In fact, the PTI was doing what everyone has been advising them to — talk to and with other politicos.\n\nAnd hence, the PTI and other senior, old-style politicians were going to sit in an auditorium in Islamabad and give speeches. It doesn’t get more vanilla than this. And it doesn’t get more routine than this because Islamabad is just not the seat of government but also the capital of NGOs. Everyone in this town has attended a seminar and/or spoken at one. The hotels in Islamabad run on the gas produced by the long speeches everyone gives.\n\nIndeed, seminars are about as common in Islamabad as the boars that populate it. (The four-legged ones have kind of disappeared, but I’m sure most readers know what I mean.) But someone, somewhere got hot under their collar at the thought of speeches, despite the rains.\n\nSo, the opposition kept getting ditched by the people whose venues it had booked. The first venue, it was told, was too close to the route cricketers took as they went to play their matches. The second one wasn’t going to cross the cricketers’ path but apparently a kaali billi (black cat) did, because the security precautions were just as stringent everywhere in the city — people cannot collect in a group because the cricketers were going back and forth in some part of the city. The third also changed its mind (do the reasons even matter?).\n\nFinally, the fourth one turned out to be a charm. But only for a day — by the second day, the management had a change of heart leading to the NGO-type event taking inspiration from the Occupy Wall Street event — they climbed gates, forced open doors, and delivered thundering speeches. All in the hotel lobby because the Asma Jahangir Auditorium had been locked to keep the politicians out. The irony of something named after Asma Jahangir being inaccessible to politicians hasn’t been lost on anyone.\n\nAnd in the process, the politicos got much projection.\n\nSo the confident government let its jitters turn a low-profile event into a successful effort of resistance, and frankly, no one was surprised because shooting themselves in the foot is what those on Constitution Avenue excel at.\n\nBut was it just a jittery government?\n\nAs an aside, most journalists in Pakistan do turn into conspiracy theorists at the best of times. So one wonders if the Noonies got jittery, or did someone else just want them to appear jittery? And embarrass it?\n\nOr worse still, the objective wasn’t to make the government look jittery but just to make it look bad. In the latter case, the PML-N should be worried, very worried. The time to look over their shoulder has begun.\n\nPostscript: It’s been five days since the cabinet expansion happened and the sherwanis were taken out of the closets and donned so that the oaths could be taken. But the portfolios have yet to be made official. The new contingent of ministers, which we were told was needed to run the country, is here, but it seems no one knows what tasks it is to perform. Pervez Khattak, Mustafa Kamal and the less important Noonies are still waiting — as are we.\n\nIs it because there is much lobbying and jockeying at play or is there more at play? Two plus two is not adding up to four. But then, politics is not math, is it?\n\nThe writer is a journalist.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c667c61d7a2.png",
  "retrievedAt": "2025-10-12T01:45:37.610Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895685",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T02:40:21.000Z"
}
