{
  "title": "Gas supply ‘improved’ in Karachi after PM Shehbaz takes notice - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: People in most parts of the city on Monday heaved a sigh of relief as the Sui Southern Gas Company (SSGC) finally improved the gas supply during Sehri and Iftar after the intervention of Prime Minister Shehbaz Sharif.\n\nThe gas utility said that it had increased gas pressure by average 10 per cent to improve gas flow and started opening gas distribution centers 30 to 45 minutes before Sehri and Iftar timings to improve system pressure in the areas with low network capacity.\n\nHowever, suffering of people in some parts of the city could not come to an end despite the prime minister’s directive to improve the gas supply during Ramazan.\n\nThough the gas utility claimed to have improved the gas supply, several areas still faced severe low pressure which, the gas utility officials said, was due to excessive use of compressors by domestic consumers.\n\nAn SSGC press release said the prime minister had taken immediate notice of the complaints on Sunday regarding gas supply to domestic customers during Sehri and Iftar.\n\nIt said that responding to the domestic customer complaints and directives of the PM to address these complaints regarding ensuring provision of gas during Sehri & Iftari times, emergency meetings were held at both the secretary and minister levels with the managing directors and senior management of the gas companies.\n\nThe press release said it was arranging an additional 20 MMCFD gas to enhance transmission line pack to meet the rising demand.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:57:06.665Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895639/gas-supply-improved-in-karachi-after-pm-shehbaz-takes-notice",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:49:49.000Z"
}
