{
  "title": "IPPs can opt for audit or arbitration, lenders told - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan on Monday assured major international lenders, including the International Monetary Fund, World Bank, and Asian Development Bank, that independent power producers (IPPs) unwilling to renegotiate contracts could opt for either a forensic audit or international arbitration, following recent protests over ‘forced contract revisions’.\n\nPower Minister Awais Ahmad Khan Leghari also informed the lenders during a meeting that the government would soon ‘rationalise’ solar net metering while also offering cheaper electricity to select consumers for incremental consumption at ‘marginal cost’ to boost faltering demand.\n\nA couple of weeks ago, a group of international lenders, excluding the IMF, sent a joint letter to the government expressing concern over what they described as non-consultative revisions to IPP contracts, in which they had invested billions of dollars. They warned that such actions could negatively impact the investment climate at a time when Pakistan is seeking further investment in the power sector’s transmission network and privatisation programme.\n\nMinister says govt to rationalise solar net metering, offer cheaper power to select consumers\n\nThe Power Division arranged a special meeting with the lenders and financiers of IPPs which was also attended by IMF resident representative Mahir Binici. Mr Leghari told the power sector international development partners that negotiations with the IPPs were free, fair and transparent, with the option to walk away or seek arbitration and a forensic audit, an official statement said.\n\nThe lenders’ delegation, led by World Bank’s Country Director Najy Benhassine, included representatives from the IMF, ADB, International Finance Corporation, German bank KfW and its embassy, Foreign, Commonwealth and Development Office, United Nations Development Programme and Asian Infrastructure Investment Bank.\n\nThe minister briefed the delegation on the government’s reforms aimed at improving efficiency and discipline in the power sector, with a focus on making electricity prices more competitive and affordable for all consumers, particularly the industry.\n\nExplaining the importance of efforts to rationalise power tariff for the national economy, Mr Leghari assured the participants that negotiations with the IPPs are being held as per the terms of their agreements.\n\nLast week, the government claimed to have secured about Rs1.571 trillion in future payment savings through negotiations with 27 IPPs, while another unwilling producer would undergo a forensic audit. These savings included Rs411 billion from terminating contracts with five IPPs, Rs238bn from revising tariff contracts with eight bagasse-based IPPs, and Rs922bn from tariff revisions with 14 thermal IPPs.\n\nMr Leghari said the government was actively engaging its development partners through an inclusive approach in policy formulation and execution. He emphasised that\n\nmaintaining transparency had allowed the government to reduce approximately 7,000MW from the Indicative Generation Capacity Expansion Plan (IGCEP) out of a total committed 17,000MW, resulting in significant cost savings on expensive power generation.\n\nMr Leghari also informed the participants about key power sector reforms, including the transition from ‘Take or Pay’ to ‘Take and Pay’ contracts, the elimination of furnace oil-based plants, and the conversion of imported coal to local coal. He said an extensive study of power generation revealed that Pakistan had not previously followed a least-cost policy. Moving forward, he emphasised, least-cost generation would be the guiding principle.\n\nAbout circular debt, the minister informed the delegation that the government aimed to eliminate it within the next five to eight years. He said that eliminating electricity duties and rationalising subsidies were key reform measures to control rising electricity tariffs. “Rationalisation of net metering is also on the cards which is adding Rs150bn burden on the rest of the consumers.”\n\nThe minister emphasised the urgent need for long-term packages to support long-term planning and induce incremental demand through marginal pricing, as surplus power remained unused, adding to capacity charges. He also updated the participants on the wholesale electricity market, stating that the government had decided not to purchase any additional power in the future.\n\nHe also apprised the delegation of the privatisation of power distribution companies, efforts to improve Discos’ board governance, and reforms at the Power Planning and Management Company. They were also briefed on measures to remove transmission constraints through the construction of new lines, reactive power compensation devices, battery storage systems, etc.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:45:14.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895649/ipps-can-opt-for-audit-or-arbitration-lenders-told",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:49:21.000Z"
}
