{
  "title": "Zelensky says ‘will not be simple’ to replace him - World - DAWN.COM",
  "author": null,
  "content": "• Truce will test Russia’s commitment to end war, says France\n• UK asserts ‘no agreement’ on partial truce yet\n\nLONDON: Volodymyr Zelen­sky told British media on Sunday it would not be easy to replace him as Ukraine’s president, but repeated his offer to step down in exchange for Nato membership for his country.\n\nUS Republicans had suggested he may have to resign after US President Donald Trump dramatically turned against him during a contentious Oval Office meeting about the war with Russia on Friday.\n\n“If they replace me, given what is going on, given the support, simply replacing me will not be simple,” Zelensky said.\n\n“It’s not enough to just hold an election. You need to also not let me run. This will be a bit more difficult. Looks like you will have to negotiate with me,” he added.\n\n“And I said that I am exchanging for Nato. Then I fulfilled my mission.”\n\nWhile European leaders rallied around Ukraine, Republican officials appeared on news programmes questioning whether any deal could be reached with Russia so long as Zelensky remains.\n\n“We need a leader that can deal with us, eventually deal with the Russians, and end this war,” National Security Adviser Mike Waltz told CNN.\n\n“And if it becomes apparent that President Zelensky’s either personal motivations or political motivations are divergent from ending the fighting in this country, then I think we have a real issue.”\n\nRepublican Mike Johnson, speaker of the House of Representatives, also questioned whether Zelensky was fit for the job.\n\n“Either he needs to come to his senses and come back to the table in gratitude, or someone else needs to lead the country.” Senior Democrats have angrily pushed back since the debacle on Friday, saying Trump has come dangerously close to an all-out embrace of Russia.\n\nOn Monday, Zelensky said he would work with Europe to set terms for a possible peace deal to present to the United States, after allies gathered in London pledged to spend more on security and assemble a coalition to defend any truce in Ukraine.\n\nEuropean leaders closed ranks in support of Kyiv, with Zelensky saying afterwards the summit cemented their commitment to work towards peace.\n\n“We need peace, not endless war,” he said on Telegram.\n\n“In the near future, all of us in Europe will shape our common positions — the lines we must achieve and the lines we cannot compromise on,” he added.\n\n“These positions will be presented to our partners in the United States.”\n\nUK Prime Minister Keir Starmer likewise said that Britain, France “and others” would work with Ukraine on a plan to stop the fighting, which they would then put to Washington.\n\nAnd French President Emmanuel Macron, flying back from the summit, told Le Figaro newspaper that France and Britain wanted to propose a partial one-month truce.\n\nStarmer and Macron have said they are prepared to deploy British and French troops to Ukraine to help preserve any truce.\n\nWith no guarantee of US involvement, “Europe must do the heavy lifting”, Starmer said.\n\nTest for Russia\n\nFrance said the plan for the one-month truce would test Moscow’s commitment to ending the war.\n\nA day after the London summit, French Foreign Minister Jean-Noel Barrot also warned that the Ukraine “front line keeps getting closer to us”.\n\nMacron said the one-month truce in Ukraine “in the air, at sea and on energy infrastructure” although not, initially at least, covering ground fighting.\n\nSuch a move “would allow to prove the good will of (Russian President) Vladimir Putin if he commits to a truce,” Barrot told France Inter radio.\n\n“And it’s then that real peace negotiations would start. We want a solid peace and a durable peace,” he added.\n\nIn an initial phase it is “a way of verifying that Russia is willing to end this war,” Barrot said, emphasising that no withdrawal of Russian troops on the ground was envisaged during the truce.\n\nHowever, UK armed forces minister Luke Pollard said “no agreement has been made on what a truce looks like”.\n\n“But we are working together with France and our European allies to look at what is the path to how… we create a lasting and durable peace in Ukraine,” Pollard told Times Radio.\n\nSpeaking on condition of anonymity, a UK government official added: “There are various options on the table, subject to further discussions with the US and European partners but a one-month truce has not been agreed.”\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c61764c7fae.jpg",
  "retrievedAt": "2025-08-25T14:57:21.745Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895580/zelensky-says-will-not-be-simple-to-replace-him",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:49:06.000Z"
}
