{
  "title": "Link roads blocked as several parts of KP receive heavy rain, snowfall - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Heavy rains and snowfall were reported in several parts of the Khyber Pakhtunkhwa province on Monday.\n\nHowever, no damage to public life and property was reported.\n\nThe provincial capital received heavy rains, which started around midnight and continued until the afternoon, with the Pakistan Meteorological Department recording 19mm of rainfall.\n\nThe Peshawar Electric Supply Company said that most of its feeders were affected due to the heavy rains. However, the power utility said the power supply was restored on most of the affected feeders after the rain stopped.\n\nIt said its workers were striving to ensure uninterrupted power supply during Iftar.\n\nNo damage to public life, property reported\n\nAbbottabad, Thandiani, Nathiagali, Donga Gali, Ayubia and other hilly areas of the Abbottabad district received the heaviest snowfall of the current winter season. Temperatures in Galiyat and Abbottabad dropped below freezing point.\n\nOne to two feet of snow fell in Thandiani and upper areas of Galiyat, leaving almost all link roads in Galiyat blocked. The main Abbottabad-Murree Road was closed due to heavy snowfall at different points. However, they’re later cleared by the Galiyat Development Authority.\n\n“The road from Bara Gali to Nathiagali has been cleared to traffic,” said Ahsan Hameed of the GDA.\n\nHe said two feet snowfall was reported in Thandiani and one feet in Galiyat region, including Donga Gali, Changla Gali, Ayubia and Bara Gali.\n\nThe official said snow-removing machines were used on the road to Ayubia and the one from Barain to Murree, while two machines were working down from Barain to Nathiagali and Bara Gali.\n\nHe said snow was also being removed from the main Abbottabad-Murree Road, with all main and link roads already cleared by the GDA and Rescue1122.\n\nTraffic police and staff of 1122 set up information centres to help and guide tourists.\n\nAbbottabad traffic police have closed the road at Harno and Barain points, informing tourists and residents about the weather situation and safety measures.\n\nOn the instructions of SSP (traffic) Tariq Mehmood Khan, additional personnel have been deployed at various places in Galiyat to help tourists and local people.\n\nGaliyat police rescued a woman teacher from Middle School Khaira Gali, Jandala, along with her husband and children during heavy snowfall and shifted them to a safe place.\n\nDue to snowfall and severe cold weather, the teacher was trapped in the school along with the little girls who called the police for help. The police moved the schoolteacher along with her family to safety in a mobile van and then allowed them to return to their home.\n\nThe Karakoram Highway on Monday remained blocked to all sorts of traffic after a heavy landslide in Kohistan, as a fresh spell of snowfall and rainfall began in the upper parts of the Hazara division.\n\n“The massive mass of land, which detached from a cracked portion of the mountain along the Karakoram Highway, blocked traffic between Khyber Pakhtunkhwa and Gilgit-Baltistan,” deputy commissioner of Upper Kohistan Tariq Ali Khan said.\n\nUpper parts of the Hazara division have recorded the first spell of heavy snowfall and rainfall since the start of Ramazan a few days ago, leading to the blockade of the Karakoram Highway and other major roads.\n\nThe deputy commissioner said that the continuous rain had hampered efforts to remove the mass of land from the KKH’s blocked section.\n\n“We had deployed heavy machinery to clear the landslide near the Bypass area, but the operation was halted amid heavy rainfall as work could be dangerous for labourers and machine operators,” he said.\n\nMr Khan added that the blocked section would be reopened to traffic once the weather cleared.\n\nMotorists and passengers travelling between Khyber Pakhtunkhwa and Gilgit-Baltistan were stranded on both sides of the highway in long queues of vehicles.\n\nThe heavy downpour, which began early in the morning, continued throughout the day in Mansehra, Torghar, Upper and Lower Kohistan and Kolai-Palas.\n\nTemperatures dropped as the snowfall lashed Kaghan Valley, the tourist resort of Shogran, and other high-altitude areas throughout the day.\n\nPolice personnel deployed in Shogran and the lower parts of Kaghan valley restricted motorists from proceeding further over fears of mishaps due to the heavy snowfall.\n\n“We are only allowing four-wheelers and locals to travel to snowbound areas of Kaghan and Shogran after ensuring compliance with all protocols set by the police for hilly areas during such rough weather,” SHO of Pars in Kaghan Valley Tasweer Hussain Shah told reporters.\n\nA new spell of snowfall started on Sunday’s night and continued until Monday’s evening as the district’s most parts witnessed heavy snowfall, which blocked major and link roads.\n\nHeavy snowfall was reported in almost all areas except Bisham tehsil where rain continued to lash for a second consecutive day, causing landslides in its upper areas. The Karakoram Highway was also blocked near the Batkot area of Bisham. However, it was later opened to traffic.\n\nDeputy commissioner of Shangla Mohammad Fawad visited Machar area and examined snow removal from the Bisham-Swat Road. He said the continued snowfall hampered that work. He, however, said the administration would continue striving to keep the road open to all types of vehicular traffic.\n\nA recent spell of rain and snowfall brought much-needed relief from the dry spell to Battagram and surrounding areas. The rain, which was accompanied by cold winds, hit Battagram, Ajmera and Chappargram, with substantial snowfall in Allai, Gantar and Roopkanai.\n\nThe snowfall enveloped the hilltops surrounding Battagram and Allai tehsils, bringing joy to the local population.\n\nAccording to the district administration, all link roads in the area remained accessible to traffic and no damage to public life or property was reported.\n\nThe local residents, who previously complained about the shortage of rainfall and snowfall during the current winter season, hoped that the rain and snowfall would increase water level in the district, mitigating the drought-like situation.\n\nThe Pakistan Meteorological Department recorded 59mm rain in Malam Jabba,45mm in Kakul, 36mm inKalam, 31mm in Balakot, 30mm in Pattan, 28mm in Cherat, 24mm in Upper Dir and16 in Lower Dir, 18mm in Takhtbhai, 15mm in Bannu, 11mm in Chitral, 7mm in Mirkhani, 6mm in Droshand 2mm in Dera Ismail Khan.\n\nPublished in Dawn, March 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c61a0e28bf4.jpg",
  "retrievedAt": "2025-08-25T14:57:03.956Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895597/link-roads-blocked-as-several-parts-of-kp-receive-heavy-rain-snowfall",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T00:50:07.000Z"
}
