{
  "title": "Champions Trophy: Kohli leads India to final with victory over Australia - Sport - DAWN.COM",
  "author": null,
  "content": "Veteran batsman Virat Kohli rolled back the years with a polished 84 as India pulled off a tense chase to beat Australia by four wickets in the first semi-final of the Champions Trophy on Tuesday.\n\nSet 265 for victory, India lost the 36-year-old Kohli in the closing overs, but KL Rahul’s unbeaten 42 steered the team home with 11 balls to spare at the Dubai International Stadium.\n\nThey will face South Africa or New Zealand in the final on Sunday in Dubai, with India playing all their matches at the venue after they refused to tour hosts Pakistan for the eight-nation event.\n\nLahore was the alternate venue for the final had India missed out.\n\nAustralia elected to bat and posted the highest total of 264 all out at Dubai International Cricket Stadium in this tournament after key knocks from skipper Steve Smith, who made 73, and Alex Carey, who hit 61.\n\nIn reply, India lost two early wickets before Kohli and Shreyas Iyer, who made 45, put the chase back on track in their partnership of 91.\n\nCooper Connolly, making the team in place of injured Matthew Short, who was forced out of the tournament on Monday, trapped skipper Rohit Sharma lbw on 28 for his first ODI wicket.\n\nKohli and Iyer then took stock against an inexperienced Australian attack missing their top fast bowlers, including Pat Cummins and Josh Hazlewood to injuries.\n\nBut the next line of bowlers stood up as leg spinner Adam Zampa bowled Iyer before pace bowler Nathan Ellis rattled the stumps of Axar Patel for 27.\n\nKohli, known as a master chaser who recently hit an unbeaten 100 in India’s win over arch-rivals Pakistan on February 23, stood firm in another stand with wicketkeeper-batsman Rahul.\n\nKohli was dropped by Glenn Maxwell off Connolly on 51, but Zampa denied him another ton when he clubbed a googly to Ben Dwarshuis at long-on to leave India at 225-5, and Australia were still hoping.\n\nBut Rahul kept calm and, with Hardik Pandya, who hit three sixes in his 28, put on 34 off 31 balls to ease the pressure.\n\nEllis removed Pandya, another catch at long-on, but Rahul hit the winning six as a largely Indian crowd roared in delight.\n\nEarlier, Australia lost regular wickets but kept coming back with partnerships, including 50-plus stands between Smith and Labuschagne, who made 29, and then the captain and the left-handed Carey.\n\nIndia pace spearhead Mohammed Shami stood out with figures of 3-48 as Australia’s innings lasted 49.3 overs.\n\nSpinners Varun Chakravarthy and Ravindra Jadeja took two wickets each.\n\nLeft-handed opener Travis Head gave the team a quick start with his 39 after losing his partner Connolly for a duck.\n\nIndia’s victory is a reversal of their last match against Australia, when they lost in the 2023 ODI World Cup final in Ahmedabad.\n\nThe second semi-final is on Wednesday in Lahore.\n\nTeams\n\nAustralia: Cooper Connolly, Travis Head, Steven Smith (capt), Marnus Labuschagne, Josh Inglis (wk), Alex Carey, Glenn Maxwell, Ben Dwarshuis, Nathan Ellis, Adam Zampa, Tanveer Sangha.\n\nIndia: Rohit Sharma (capt), Shubman Gill, Virat Kohli, Shreyas Iyer, Axar Patel, KL Rahul (wk), Hardik Pandya, Ravindra Jadeja, Mohammed Shami, Kuldeep Yadav, Varun Chakravarthy.\n\nUmpires: Chris Gaffaney (NZL), Richard Illingworth (ENG) TV Umpire: Michael Gough (ENG) Match Referee: Andy Pycroft (RSA)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/04212052c482384.jpg",
  "retrievedAt": "2025-08-25T14:56:47.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895745/champions-trophy-kohli-leads-india-to-final-with-victory-over-australia",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T08:02:10.000Z"
}
