{
  "title": "AJK President calls youths for vibrant role to expose India’s sordid designs",
  "link": "https://www.app.com.pk/national/ajk-president-calls-youths-for-vibrant-role-to-expose-indias-sordid-designs/",
  "date_published": "2020-09-05T14:49:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Sep 05 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan has urged upon the youth to revive the spirit of 1965 war to frustrate India’s evil designs and to raise Kashmir issue at international level.\n“Narendra Modi and the RSS by settling five million Hindus in occupied Jammu and Kashmir are hell-bent on expelling the Muslims from the state and to remove Kashmir from the world map,” he maintained.\nSpeaking as chief guest at a ceremony hosted to mark the Defence Day of Pakistan, falling on September 06 (Sunday) by the Youth Forum for Kashmir, he said that the Pakistani and the Kashmiri youth need to promptly rise up to foil this Satanic plan and defeat India on political, diplomatic, media, and if needed, on the military fronts.\nThe AJK president said that Pakistan had certainly fought the wars of 1947, 1948, 1965, 1971 and 1999 for the cause of Kashmir, and similarly, the youth of Azad Kashmir by joining Pakistan Army have also been defending the motherland for the last seven decades.\nHe said that a 23 years old young army officer Lt. Nasir Khalid, who embraced martyrdom the other day, was also belonged to Azad Kashmir. “This was neither the first nor the last sacrifice by any Kashmiri youth, but thousands of youth have sacrificed their lives while thousands more are prepared to sacrifices their lives for the supreme cause,” he added.\nSardar Masood Khan said that in 1947, our elders through their sacrifices had provided us with an opportunity to breathe in an environment of freedom and it is our sacred duty now to protect this liberty by all means.\nKhan regretted that on the other side of the Line of Control, under foreign occupation, the life of a 10 years old child to 80 years old man is at constant risk of being killed, maimed or blinded by Indian occupation forces. The innocent women are being dishonoured while the youth are subjected to target killings in fake encounters.\nThe AJK president said that we have no hope from the international community or the United Nations, and we are to do on our own what we can to get freedom. However, he added that we can enhance pressure on the international community and the United Nations to resolve the Kashmir issue by turning our struggle into a global movement.\nAddressing the function, Executive Director of Youth Forum for Kashmir Maria Iqbal Tarana paid great homage to the martyrs of 1965 war, and said that these martyrs inflicted a severe blow on enemy’s five times big army, and defended every inch of Pakistan.\nThe function was attended by prominent journalists Syed Arif Bihar, Wahid Iqbal Butt, Imtiaz Awan, Aljazeera TV’s Asim Khan, Ashfaq Shah and a large number of other journalists. Later, the state president conferred Youth Forum for Kashmir Awards on more than one dozen journalists who have been reporting the situation erupted because of Indian Army firing at the Line of Control.",
  "retrievedAt": "2025-08-11T19:46:12.789Z"
}
