{
  "title": "Shireen felicitates PM, Foreign Office for organizing 7th Int’l seminar on combating corruption",
  "link": "https://www.app.com.pk/national/shireen-felicitates-pm-foreign-office-for-organizing-7th-intl-seminar-on-combating-corruption/",
  "date_published": "2022-01-07T17:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 07 (APP): Federal Minister for Human Rights Dr Shrieen M Mazari on Friday congratulated the Prime Minister and Foreign office for arranging the 7th international seminar on  Combating Corruption- a prerequisite for the full realization of all Human Rights under Independent Permanent Human Rights Commission (IPHRC) of the Organization of Islamic Cooperation (OIC).\nThe international seminar was held in partnership with the government of Pakistan, the Office of the United Nations High Commissioner for Human Rights (OHRCHR), United Nations Office on Drugs and Crime(UNODC) and United Nations Development Programme (UNDP).\nIn her exclusive talk with Media, she stated that Pakistan’s credibility to organize the seminar in Pakistan to counter corruption was the manifestation of Prime Minister Imran Khan’s vision. “We have seen corruption impede reform system of the society and even in prisons Ministry of Human Rights is undergoing to further reforms that the Islamabad High Court observed itself.”She added that the government have repeatedly tried to implement the policies to counter corruption as it was seen that a limited segment of the society we as involved in driving misappropriation not the entire community.\nDr Mazari also stressed that FATF also played its role to address the anti-corruption efforts and to address the injustices and illicit financial flows and for effective resource mobilization.\nShe also said that the developing countries have been facing corruption which was the antithesis of the core Human Rights principal of the transparency.\nShe added that a vulnerable segment of the society was being exploited and victimised and it was the violation of Human Rights by Mafias and corrupt people’s practices.\nShe further added that corruption existed at every level and most corrupt people were living and transferring their money in safe havens.\nDr Mazari stressed that the Financial Action Task Force (FATF) should play its role to aliment the corruption and Money laundering more than pursuing political motives.\nShe also added that it was needed to implement the National Action Plan that guaranteed transparency in Business and the protection of Human Rights .",
  "retrievedAt": "2025-08-11T14:02:15.770Z"
}
