{
  "title": "Govt ensures uninterrupted gas supply to fertilizer industry to promote agriculture production: Khusro",
  "link": "https://www.app.com.pk/national/govt-ensures-uninterrupted-gas-supply-to-fertilizer-industry-to-promote-agriculture-production-khusro/",
  "date_published": "2022-01-07T12:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): Federal Minister for Industries and Production Khusro Bakhtyar Friday said the government had provided Rs 400 billion subsidy for the development of agriculture sector and ensured uninterrupted gas supply to the fertilizer industry to help promote agriculture production in the country.\nAddressing a press conference along with the owners of fertilizer industries, the federal minister said the government had also launched a web portal to monitor urea production and supply.\nHe said dealers’ names, locations and truck numbers had entered in the ‘tracing system’ by the manufacturers in real time to help monitor the fertilizer transport. The government was taking all these steps to control smuggling of urea bags, he added.\n“All Deputy Commissioners have access to data of their districts and ground staff approaches the dealers and verifies the amount on arrival. Once Urea arrives, it is sold at controlled rate by the dealers under supervision of district/Agri administration,” he added.\nHe said in the international market, urea was being sold at the rate of Rs11,000 per bag whereas in Pakistan, the price per bag was only Rs1,800.\nThe minister said two million bags of urea fertilizer had already arrived at port and if needed, more fertilizer would be imported.\nHe said tender in compliance to the import decision by the government was issued by the Trading Corporation of Pakistan on October 22, 2021 and opened on November 22, 2021.\nHe said the government of China had offered supply of 100,000 tons of urea on government to government basis.\n“The Economic Coordination Committee of the Cabinet has approved import which would arrive from 10th to 25th of February 2022 and resultantly, there will be an ample inventory in February-March 2022.”\nKhusro said due to effective actions and prompt management there was no stress on prices of urea as it would remain stable, adding sowing of wheat had been completed in irrigated areas of Punjab and Sindh.\nThe minister said due to the prevailing rain spell, demand was expected to be on the lower side till January 9, 2022 and during rain period from January 6 to 9, daily dispatch of the fertilizer remained at 19,000 tons.\nHe said the supply would be increased from 10th to 31st January up to 22,000 tons on daily bais.\nHe said the current demand was mostly panic driven and fueled by middle man which was not historically a part of supply chain of Urea.\nHe said the farmers should make sure that they would get adequate urea at controlled price in January, February and March.\n“Farmers are requested not to engage in panic buying and avoid purchasing of urea to be used in February and March as this would save the country from price hike and unnecessary struggle to get urea in long queue,” he added.\nMeanwhile, Minister for Energy Hammad Azhar said this year, the PTI government ensured the provision of uninterrupted gas supply to the urea plants that led to achieving the country’s highest-ever production in the fertilizer sector.\n“Since the government changed the priority order for gas dispatch, the urea plants, which always remained closed in November every year, got uninterrupted gas supply in abundance and are getting even to-date,” he said.\nWith historic gas supply at the cheapest rate, the minister said the urea plants brought their production to the record highest level of 25,000 tons per day.\nHammad said the government was providing urea to the farming community at Rs 1800-1900 per ton, which was being sold at around Rs 11,000 per ton in the international market.\n“Provision of inexpensive gas to urea plants has the key role in the availability of fertilizer at the reduced rate as compared to the international market,” he said.\nThis big difference in rate, he said, was one of the main reasons behind the shortage and smuggling of the urea. He assured that the authorities concerned were making all-out efforts to prevent its smuggling.\nHammad said as per the projection of owners of fertilizer plants, millions of tons of urea would be available in February with ‘stock inventory’ building up.\nThe fertilizer mill owners said the production of wheat, corn and sugarcane witnessed a record increase during this season.\nThey said due to gas shortage, gas supply to the mills was usually halted in the past but for the first time, the government has ensured uninterrupted gas supply to all fertilizer industries during the whole winter season.\nHe said due to positive policies of the government, production of the crops was increasing and per acre yield was also being raised.",
  "retrievedAt": "2025-08-11T14:02:27.619Z"
}
