{
  "title": "PDMA Balochistan expedites relief activities in flood, snow affected areas",
  "link": "https://www.app.com.pk/national/pdma-balochistan-expedites-relief-activities-in-flood-snow-affected-areas/",
  "date_published": "2022-01-07T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP):The Provincial Disaster Management Authority (PDMA) Balochistan on Friday expedited its relief and rescue activities in the flood and snow-affected areas of the province to ensure proper rehabilitation facilities and minimize damage in emergency situations.\nThe PDMA Balochistan in collaboration with other authorities concerned was carrying out relief operations to protect precious lives and properties in snow and rain hit areas of Kanmehtarzai, Ziarat, Muslim Bagh, Kalat, Mastung, Quetta and Makran Division.\nTalking to APP, an official of PDMA said that the Authority was providing all necessary assistance to the victims of heavy rain and snow hit areas of the province.\nHe said the officials of PDMA timely responded on local administration and DDMA’s demand and dispatched relief items including 400 plastic mats, 628 kitchen set, 400 charpoy, 1,600 quilts, 600 solar light, 2,200 tarpaulin plastic and others items to the people of areas mostly affected by flood and snowfall.\n“However, damages will be shared timely after completion of initial damage assessment report,” he added.\nThe departments concerned including Rescue 1122, Health, Revenue, Police, Livestock and others were directed to remain on alert during this period, he said.\nHe added that heavy snowfall in the areas of Ziarat, Kanmehtarzai and Muslim Bagh choked the major thoroughfares causing heavy traffic jams. However, heavy machinery was deployed that helped to evacuate vehicles stuck in the snow, the PDMA official said.\n“Roads are now clear and open for light vehicles whereas PDMA and Levies teams are spraying de-icing salt to ensure unimpeded traffic flow,” he added.\nHe informed that the affected families were also being provided food, blankets, and medicine.He also advised people, particularly tourists, to avoid unnecessary travel in snowbound and landslide-prone areas during the prevailing weather conditions and observe caution as roads were slippery.\nHe said the provincial emergency center at PDMA office Quetta is working round the clock and directed to coordinate with local administration and other departments concerned for timely response.",
  "retrievedAt": "2025-08-11T14:02:28.010Z"
}
