{
  "title": "Sufi festival held to celebrate rich culture of Sufism",
  "link": "https://www.app.com.pk/national/sufi-festival-held-to-celebrate-rich-culture-of-sufism/",
  "date_published": "2022-01-07T11:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 7 (APP): A Sufi festival held here at F-9 Park on Friday, with the aim of celebrating rich culture and wonderful teaching of Sufism with talks, featuring practices and Sufi performances.\nAccording to organizer Murtaza Khan this was an opportunity to experience Sohbat Zikr and Sama for the Sufi aspirants novices and people who want to learn about Sufism.\nAt speakers circle participants have met with scholars,discuss and hear their personal stories of self discovery and growth on the path of spirituality and healing.\nA poetess, artist and a writer of a book “The Burning Champa by Zuka” Dewan e Zahra shared her story about how her favourite sufi poets and saint like Rabia Basri and Rumi, literature, art, music and intentional creativity helped her in her 25 year struggle with Bipolar 2.\nThe in-charge of the Center of Excellence in Gender Studies at Quaid-i-Azam University Fatimah Ihsan shed light on some core teaching of Shaykh Ebrahim.\nA French cultural anthropologist Laurence Zahara Lecuyer also participated in the festival. She has done PhD in anthropology and her fields of research cover Sufi practices in South Asia and comparative religions.\nA visual artist Amira Farooq told about the power of crystals and how they could aid in healing and her own journey of self-healing. She has organized multiple solos and group shows in Lahore, Karachi and Melbourne.\nA specialist in Neuro Linguistic Programing and author of Pakistan’s first ever Energy Healing Cards Deck, “Raise Your Vibration” Aiysha Mirza also participated in the event.\nSufi artists, performers, Dhool and Dhamaal by Wajdani Nasir Sain, Qawali by the Saami brothers presented at the event to give the real feel of sufi culture.",
  "retrievedAt": "2025-08-11T14:02:29.916Z"
}
