{
  "title": "UNHCR, PPAF launch livelihood project to help refugees, host communities",
  "link": "https://www.app.com.pk/national/unhcr-ppaf-launch-livelihood-project-to-help-refugees-host-communities/",
  "date_published": "2020-01-08T01:08:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 08 (APP):UN Refugee Agency (UNHCR) and Pakistan Poverty Alleviation Fund (PPAF) Wednesday launched a livelihood project aimed at providing sustainable livelihood opportunities for both Afghan refugees and Pakistani communities.\nAccording to a press release issued here, the livelihood project is estimated to be worth Rs 320 million and, in addition to the 3,000 Pakistani households benefiting from PPAF’s regular livelihood programme, this new project will help a further 3,000 households.\nIt will be mainly implemented in Mansehra and Peshawar districts in Khyber Pakhtunkhwa and Chaghi in Balochistan.\nUnder the project, the most vulnerable households will be provided with intensive coaching in the area of agriculture and entrepreneurship, various packages, including livestock, to support such initiatives, as well as access to financial services.\nThe UNHCR project is complementing government’s flagship programme – Ehsaas and benefiting the people targeted by the government for poverty alleviation and their economic development.\nSpeaking on the occasion, UNHCR Representative in Pakistan, Ruvendrini Menikdiwela, said that such projects will have a significant impact in the lives of the vulnerable people living in extreme poverty.\nShe said this initiative will help lift the Afghan refugee population and members of the host community out of poverty and provide them with sustainable livelihoods.\n“Once refugees have acquired a set of skills, they can work to build their self-reliance and be empowered. They will not only give back here but also play an important role in the economy when they return to Afghanistan,” she said.\nThe Chief Executive Officer of PPAF, Qazi Azmat Isa, emphasized how this project would benefit thousands of Afghan refugees residing in Pakistan.\nHe said, “In order to graduate vulnerable households out of extreme poverty, sustainable livelihoods are essential. This will improve their overall capacity and enable them to become financially independent.”\nThe poverty graduation approach targets families living in on less than USD 1.25 a day and with no access to basic services. It brings innovative and market-based methods together to help people become self-reliant by providing them with livelihood opportunities.\nLast year, UNHCR and PPAF launched a pilot project– worth USD 1.2 million – in Swabi, Khyber Pakhtunkhwa and Pishin, Balochistan. The project benefitted 2,000 households, of which 70 per cent were Afghan refugees and 30 per cent were Pakistani host communities.\nPPAF’s poverty graduation approach merges elements of social mobilization, livelihood development and financial inclusion, combining support for immediate needs with longer term support for the development of human capital and assets.\nPPAF is the lead institution for community-driven development in Pakistan. It is a private sector organization supporting public policy that provides an array of financial and non-financial services to the poorest and most marginalized rural households and communities. PPAF’s investments in building the capacities of partner organizations and community institutions have resulted in poverty alleviation in vulnerable and remote areas across Pakistan.",
  "retrievedAt": "2025-08-11T18:35:51.148Z"
}
