{
  "title": "PM stresses upon need to de-escalate tensions in Gulf",
  "link": "https://www.app.com.pk/national/omans-religious-minister-calls-on-pm/",
  "date_published": "2020-01-08T04:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 8 (APP):Expressing Pakistan’s deep concern over the evolving situation in the Gulf and Middle East, Prime Minister Imran Khan Wednesday underlined the imperative of avoiding any further escalation.\nThe prime minister stressed that war was in nobody’s interest and called for immediate measures for de-escalation.\nHe was was talking to Minister for Endowment and Religious Affairs of Oman Sheikh Abdullah bin Muhammad bin Abdullah Assalami here, PM Office Media Wing in a press release said.\nRecalling that Pakistan had suffered greatly due to earlier regional conflicts, the prime minister made it clear that it would not be part of any conflict in the region.\nHe also recalled his earlier efforts for facilitation of contacts between the United States and Iran as well as Iran and Saudi Arabia for peaceful resolution of differences and disputes.\nHe said Pakistan would always be a partner for peace and in that regard, it would continue to play its role in seeking to defuse tensions, prevent a conflict, and preserve the peace.\nDuring the meeting, the recent developments in the Middle East and Gulf region were discussed.\nThe prime minister also highlighted the dire human rights and humanitarian situation arising out from the inhuman lockdown in the Indian Occupied Jammu and Kashmir (IOJK) for over five months and noted the discriminatory policies of the Bharatiya Janata Party government against minorities, especially Muslims.\nHe stressed upon the international community to take urgent steps to address this situation.\nThe prime minister while noting the traditionally close fraternal ties between Pakistan and Oman, expressed the desire to further strengthen the bilateral cooperation in all fields.\nHe also extended cordial greetings and best wishes for Sultan Qaboos bin Said Al-Said.",
  "retrievedAt": "2025-08-11T18:35:34.176Z"
}
