{
  "title": "Faisal Javed urges opposition to maintain constructive attitude in parliament",
  "link": "https://www.app.com.pk/national/faisal-javed-urges-opposition-to-maintain-constructive-attitude-in-parliament/",
  "date_published": "2020-01-08T02:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 8 (APP):Pakistan Tehreek-e-Insaf (PTI), Senator Faisal Javed Wednesday urged opposition to play their constructive role in the parliament to maintain consensus politics with government for the great interest of the public and bright future of the country.\nTalking to private news channel, Faisal Javed hailed the political parties role in parliament for Army chief’s extension bill, that the support of all political parties was a positive step and this unity among parties were given a soft image of the country to the world that all institutions including opposition are on same page.\nHe expressed that this issue was related to national interest and legislation on it was made with the consensus of all the political parties in Parliament and hoped that this same spirit and unity of all political parties would continue in future for the welfare of the state and to give relief to the common people.\nHe said some of the opposition parties who used to make hue and cry for their personal interests should refrain from the undue criticism to the government.\nFaisal said this same unity was required for the matters of public issues ,adding, opposition should criticized government with their democratic right for the intrests of common people in the parliament as some of the bills were delaying in the parliament due to undue criticism of the opposition.\nHe also hailed the role of some of parliamentarians who are playing positive role and showing seriousness over the issues of public.\nSenator said last year government was targeted only economy and PTI led government under the leadership of Imran Khan has achieved this target goals of economic stability in the country successfully.\nHe said in 2020, Imran Khan’s government was targeted common man’s relief , so inshAllah under the visionary and sincere leadership we will provide relief to the poor segment of society with launching different social welfare programmes including 180 shelter homes, Sahat Insaf Cards, Rashan Cards, Ahsas poverty program, utility stores subsidies and with launching different digital apps for the welfare of the people.\nHe explained that these digital app would help people in daily life and social welfare related programs would be\nimplemented soon in the year 2020 , where a poor person would get speedy relief.",
  "retrievedAt": "2025-08-11T18:35:51.192Z"
}
