{
  "title": "ECP asks parliamentarians to submit their statements of assets/liabilities for FY 2023-24 by Dec 31",
  "link": "https://www.app.com.pk/national/ecp-asks-parliamentarians-to-submit-their-statements-of-assets-liabilities-for-fy-2023-24-by-dec-31/",
  "date_published": "2024-08-05T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):The Election Commission of Pakistan (ECP) on Monday drew the attention of the Members of the Parliament and Provincial Assemblies to submit to the Election Commission by  December 31, yearly statements of assets and liabilities including their spouse and dependent children.\nProvision of statements of assets/liabilities as on the preceding thirtieth day of June on Form-B for the financial year 2023-24 is a mandatory requirement under Section 137 of the Elections Act, 2017, which is reproduced below:- “137. Submission of statement of assets and liabilities.—\n(1) Every Member of an Assembly and Senate shall submit to the Commission, on or before 31st December each year, a copy of his statement of assets and liabilities including assets and liabilities of his spouse and dependent children as on the preceding thirtieth day of June on Form B.\n(2) The Commission, on the first day of January each year through a press release, shall publish the names of Members who failed to submit the requisite statement of assets and liabilities within the period specified under sub-section (1).\n(3) The Commission shall, on the sixteenth day of January, by an order suspend the membership of a Member of an Assembly and Senate who fails to submit the statement of assets and liabilities by the fifteenth day of January and such Member shall cease to function till he files the statement of assets and liabilities.\n(4) Where a Member submits the statement of assets and liabilities under this section which is found to be false in material particulars, he may, within one hundred and twenty days from the date submission of the statement, be proceeded against for committing the offence of corrupt practice.”\nThe prescribed Form-B along with instructions / guidelines prepared in this regard can be obtained free of cost from the Election Commission Secretariat, Islamabad, offices of Provincial Election Commissioners of respective Province, Senate Secretariat, National Assembly Secretariat and Secretariats of concerned Provincial Assemblies. Moreover, Form-B can also be downloaded from the ECP’s Website i.e. www.ecp.gov.pk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:24:02.691Z"
}
