{
  "title": "India’s revocation of Kashmir status is serious violation of UN resolutions: Rana Tanveer",
  "link": "https://www.app.com.pk/national/indias-revocation-of-kashmir-status-is-serious-violation-of-un-resolutions-rana-tanveer/",
  "date_published": "2024-08-05T11:09:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 05 (APP):Federal Minister for Industries & Production Rana Tanveer Hussain on Monday expressed solidarity with the Kashmiri people and termed India’s decision of revocation of the special status of Jammu and Kashmir a serious violation of United Nations Security Council resolutions.\nHe stated this in an exclusive talk with APP on the occasion of “Youm-e-Istehsal (Day of Exploitation), being observed in Pakistan against India’s illegal and unilateral actions of revocation of Kashmir’s special status on August 5, 2019.\nOn this significant occasion, Rana Tanveer Hussain commended the sacrifices made by the Kashmiri people in their struggle for self-determination, emphasizing that unilateral and illegal action taken by India is clear violation of multiple United Nations Security Council resolutions which called for a final decision on the future of Jammu and Kashmir to be made according to the will of the Kashmiri people through a free, impartial, and UN-supervised referendum.\nHussain further stated that the Kashmiri people have been making great sacrifices against India’s illegal and oppressive occupation. India, through its brutal actions in the Indian-occupied Jammu and Kashmir, is violating international laws, which have serious implications for South Asia and the region at large.\nHe highlighted that the resolution of the Jammu and Kashmir dispute, in accordance with the UN Security Council resolutions and the aspirations of the Kashmiri people, is the only path to ensuring sustainable peace and stability in the region.\nRana Tanveer Hussain paid tribute to all the martyrs of occupied Kashmir for their timeless sacrifices and expressed admiration for their families for their determination and courage. He assured that Pakistan will continue to voice concerns of its Kashmiri brothers and sisters and provide every possible support in their pursuit of their legitimate rights.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:24:28.091Z"
}
