{
  "title": "Hindu extremist faces 10 years in US prison for threatening to kill Sikhs",
  "link": "https://www.app.com.pk/national/hindu-extremist-faces-10-years-in-us-prison-for-threatening-to-kill-sikhs/",
  "date_published": "2024-08-05T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): A staunch follower of Hindutva ideology and Bhartiya Janta Party (BJP) activist from New Jersey may face around 10 years in prison after being charged by the United States’ Federal Bureau of Investigation (FBI) for threatening to kill and behead a number American Sikhs –  just a day ahead of Khalistan Referendum voting in Brampton, Canada on Sept 18, 2022.\nAgitated by the publicity around the Khalistan Referendum campaign in Canada in September 2022, Bhushan Athale, 48, from the County of Burlington and the District of New Jersey, sent out several voice notes and texts to a non-profit US Sikh organisation and its three Sikh employees and threatened to behead them with a razor and lynch them publicly for allegedly supporting the Khalistan movement.\nHe issued threats to kill three Sikhs including a female worker and two men. Using the anti-Sikh religion slurs often employed by the Hindutva supporters of BJP and RSS, Bhushan Athale abused Sikhs and their religious beliefs, calling them inferior and worthy of punishment.\nBhushan Athale also threatened to kill a Pakistani origin Muslim, according to the unsealed US indictment received here.\nHe has been charged with one count of interfering with federally protected activities through the threatened use of a dangerous weapon and one count of transmitting an interstate threat to injure another person.\nThe FBI’s investigation revealed that this was not the only time that Athale had targeted individuals based on his hatred of their religion, In November 2021, Athale had sent hate messages to his Muslim co-worker in Nebraska expressing his animosity to Muslims.\nAccording to the criminal complaint, on or about Sept. 17, 2022, Athale Bhushan called the main number of a Sikh organization that advocates for the civil rights of Sikh individuals within the United States. Over the next hour, Athale left seven voicemails expressing extreme hatred toward Sikh individuals working at the NGO and threatening to injure or kill these individuals with a razor.\nAthale’s voicemails, which were filled with violent imagery and obscenity, contained references to places, people and tenets that are particularly significant within the Sikh religion.\nThe threats continued till March 2024. In another threatening voice note, he praised Indian PM Modi and urged him to cease properties of Sikhs so “they can make Khalistan in Canada”. He called on Modi to kill both Muslims and Sikhs.\nIn March 2023, Athale again called the same Sikh organization and left two more voicemails. In these voicemails, Athale again used violent imagery to express his hatred toward Sikhs as well as Muslims, suggesting, among other things, that the Indian Government and Mumbai Police should “catch them, beat them and rape their family members.”\nThe Sikhs for Justice (SFJ) founder and leader and Khalistan Referendum campaign’s main coordinator Gurpatwant Singh Pannun said Bhushan Athale is a follower of Modi’s violent Hindutva ideology arrested and indicted in New Jersey for threatening American Sikhs on account of religious and political opinion of Khalistan.\nPannun said, “Threats Initiated just a day before Khalistan Referendum voting in Canada. This once again proves that Modi’s India uses violent transnational repression to suppress dissenting political opinion while Sikhs believe in democratic process of voting to liberate Punjab from Indian occupation”.\nAthale now faces a maximum penalty of 10 years in prison for interfering with federally protected activities and a maximum penalty of five years in prison for transmitting an interstate threat. Both charges also carry a penalty of up to a $250,000 fine.\nA federal district court judge will determine any sentence after considering the U.S. Sentencing Guidelines and other statutory factors.",
  "retrievedAt": "2025-08-11T04:24:04.433Z"
}
