{
  "title": "UN monitoring Bangladesh crisis ‘very closely’ as PM Sheikh Hasina resigns & flees",
  "link": "https://www.app.com.pk/national/un-monitoring-bangladesh-crisis-very-closely-as-pm-sheikh-hasina-resigns-flees/",
  "date_published": "2024-08-05T18:37:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Aug 5 (APP):The United Nations is following the situation in Bangladesh “very closely” after Prime Minister Sheikh Hasina resigned and fled the country Monday in the face of massive anti-Government protests, which claimed the lives of hundreds of demonstrators in recent weeks.\n“We continue to call for calm and restraint and urge all parties to respect the right to peaceful assembly and expression,” Farhan Aziz Haq, UN Deputy Spokesperson, told the daily briefing at UN Headquarters in New York.\n“We urge security forces to protect those out on the streets in Dhaka and other cities of Bangladesh,” he added.\nFarhan Haq  also emphasized the importance of a peaceful, orderly and democratic transition, adding that the UN stands in full solidarity with the people of Bangladesh at this time.\n“We call for the full respect of their democratic and human rights,” he said, noting also the need for a full, independent, impartial and transparent investigation into all acts of violence.\nMore than 300 people, including many children, are said to have been killed since student-led protests erupted, and more than 20,000 injured. The bloodshed was among the worst ever witnessed in Bangladesh.\nThe unrest began in July with protests by students against civil service job quotas. Though the scheme was withdrawn, protests erupted again last week, with the key demand for Prime Minister Sheikh Hasina to quit and for those responsible for the violent suppression of demonstrations to be held accountable.\nMs. Hasina had been in power since January 2009, having earlier led the country from 1996 to 2001.\nMedia reports suggest her departure from Bangladesh was met with widespread jubilation across much of the country.\nThere were also reports of ransacking and arson at the Prime Ministerial residence; a museum commemorating the country’s first President and Ms. Hasina’s father, Sheikh Mujibur Rahman; and homes of senior government officials.\nBangladesh’s army chief announced in a televised national address following her departure that an interim government would be formed, although no further details were provided.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:22:48.472Z"
}
