{
  "title": "Granting due rights to people of Kashmir, Palestine, only way to maintain peace in region: PM",
  "link": "https://www.app.com.pk/national/granting-due-rights-to-people-of-kashmir-palestine-only-way-to-maintain-peace-in-region-pm/",
  "date_published": "2024-08-05T11:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday emphasized that granting due rights to the people of Kashmir and Palestine was the only way to maintain peace and stability in the region.\nIn his televised address to the Azad Jammu & Kashmir Legislative Assembly on Youm-e-Istehsal, the prime minister said the day was not far away when both India and Israel will be bound to give due rights to the people of Palestine and Indian Illegally Occupied Jammu and Kashmir (IIOJK) as all ways other than this lead to total destruction.\nHe said Pakistan was a nuclear power and that was part of its defence. However, he said Pakistan had never thought of aggression with regard to its nuclear power. “Therefore the better option is to adopt the peaceful way and sit together to find out the peaceful solution to the Kashmir dispute.”\nThe prime minister pointed out that this occasion reminded us of the grave consequences of India’s illegal actions of 5 August 2019 vis-à-vis Indian Ilegally Occupied Jammu and Kashmir (IIOJK).\nEver since, he said today, in IIOJK, efforts were being made to silence the genuine leadership of the Kashmiri people and muzzle the media. The number of political prisoners remain in the thousands, while 14 political organizations have been outlawed.”\nHarassment of innocent people, arbitrary detentions, and the so-called ‘cordon and search operations have become a matter of routine. The Indian forces are operating with impunity, according to them under different draconian laws, he added.\nPM Shehbaz Sharif vowed that until the Kashmiris get the basic rights and freedom, Pakistan will continue to extend the moral support and will continue to knock the doors of all the international institutions.\nPaying tributes to the people of Kashmir, he said “we salute to their struggle for freedom who had been bearing the atrocities and cruelties of the Indian armed forces for 77 years”.\nHe also paid tributes the Hurriyat leaders including Chaudhry Ghulam Abbas, Sardar Ibrahim Khan, Mirwaiz Muhammad Yousuf, Syed Ali Gilani, Muhammad Ashraf Sehrai, Altaf Ahmed Shah, Moulana Abbas Ansari and all the young workers and leaders who raised their voices against the Indian atrocities.\n“We salute to Asiya Andrabi, Yaseen Malik, Mirwaiz Umar Farooq, Shabbir Ahmed Shah, Mussarat Alam Butt, and Burhan Wani for their struggle for freedom.\nAs regards, the Palestine situation, the prime minister said more than 40,000 Palestinians had been martyred so far including thousands of children. The unarmed Palestinians were still being martyred everyday, he said.\nIsrael’s Prime Minister Natenyahu through his army have broken the records of barbarism in Palestinians, he said adding that recently, in Tehran, Hamas Leader Ismail Haniyeh was martyred.\nIn Pakistan, he said a day of mourning was observed and funeral prayers in absentia was performed across the country.\nHe said the Imam of Aqsa Mosque, who talked about Ismail Haniyeh’ martyrdom had also been arrested.",
  "retrievedAt": "2025-08-11T04:24:06.271Z"
}
