{
  "title": "Political leaders, workers, govt officials hold walk on Youm-e-Istehsal",
  "link": "https://www.app.com.pk/national/political-leaders-workers-govt-officials-hold-walk-on-youm-e-istehsal/",
  "date_published": "2024-08-05T09:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): Leaders and workers of all political, religious and social organizations of Pakistan, as well as students and large number of people from the Foreign Office here on Monday held a walk from the Foreign Office to Parliament House to express solidarity with the people of Indian illegally occupied Jammu and Kashmir (IIOJK) on “Youm-e-Istehsal Kashmir”.\nThe walk was led by Federal Minister of Kashmir Affairs Amir Muqam and was addressed by notables, including Deputy Prime Minister and Foreign Minister Ishaq Dar, Minister of State for Kashmir Affairs Amir Muqam, former Prime Minister of Azad Kashmir Tanveer Ilyas. Besides others, the entire Hurriyat leaders.\nThe speakers condemned India’s unilateral abrogation of Article 370 and 35A on August 5, 2019, calling it a violation of international norms and a threat to global peace. They expressed support for the Kashmiri people’s freedom movement and criticized India’s human rights violations in occupied Jammu and Kashmir.\nSimilar protests were also held in other parts of Pakistan, including a torch-carrying rally in Jhelum Valley, Azad Kashmir, organized by Tehreek Shabab Muslimeen Jammu and Kashmir Student Wing.\nThe observance of Youm-e-Istehsal Kashmir is a testament to Pakistan’s unwavering support for the Kashmiri people’s right to self-determination and their struggle for freedom.\nA rally was also taken out in Samahni, Azad jammu and Kashmir. Led by Hurriyat leader Imtiaz Ahmed Butt, the rally was attended by a large number of people, including Jamaat-e-Islami Tehsil Samahni’s Amir Abdul Karim, Assistant Commissioner of Tehsil Samahni Omar Tariq, Ghazi Dilawar, Abrar Kashmiri, Kamran and Umair Al-Salam.",
  "retrievedAt": "2025-08-11T04:24:13.857Z"
}
