{
  "title": "More rain-windstorm/thundershower likely at various parts of country: PMD",
  "link": "https://www.app.com.pk/national/more-rain-windstorm-thundershower-likely-at-various-parts-of-country-pmd/",
  "date_published": "2024-08-05T16:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): Pakistan Meteorological Department (PMD) has forecast more rain-windstorm/thundershower in Sindh, Balochistan, Khyber-Pakhtunkhwa, south/upper Punjab, Pothohar region, Kashmir and Gilgit-Baltistan.\nHeavy falls are likely at isolated places in northeastern/south Balochistan, upper Sindh, Upper Khyber Pakhtunkhwa, Northeast Punjab, Pothohar region and Kashmir.\nAs per synoptic situation, strong monsoon currents,continuously penetrating from Arabian Sea in central and southern parts of the country, entered into the upper parts.\nTorrential rains may generate flash flooding in local nullahs/streams of Hilly areas of Dera Ghazi Khan, Zhob, Barkhan, Musa Khel, Loralai, Sibbi, Harnai, Kohlu, Dera Bugti, Jhal Magsi, Nasirabad, Jaffarabad, Kalat, Khuzdar, Lasbella, Awaran, Kech, Panjgur, Jacobabad, Qamber Shahdad Kot, Larkana, Dadu, Jamshoro, Murree, Galliyat, Mansehra, Dir, Swat, Shangla, Nowshera, Swabi, Islamabad/Rawalpindi, Sialkot, Narowal, Jhelum, Gujrat and Kashmir on 05th and 06th August.\nHeavy downpour may cause urban flooding in low lying areas of Islamabad/Rawalpindi, Gujranwala, Sialkot, Bahawalnagar, Bahawalpur, Rajanpur, Rahim Yar Khan, Sukkur, Kashmore, Ghotki, Shikarpur and Khairpur.\nLandslides may cause road closure at the vulnerable hilly areas of Khyber Pakhtunkhwa, Murree, Galliyat, Kashmir and Gilgit-Baltistan during the wet period.\nDuring the last 24 hours, rain-wind/thundershower occurred in Punjab, Sindh, eastern/southeast Balochistan, Khyber-Pakhtunkhwa, Kashmir and Gilgit-Baltistan.\nThe rainfall recorded was Sindh: Karachi (Nazimabad 77mm, Surjani Town 72, Quaidabad 61, Malir Halt 54, MOS 49, Jinnah Terminal, Orangi Town 42, University Road 40, Faisal Base 37, Gulshan-e-Hadeed 35, North Karachi 34, Ibrahim Hydari 13, Gulshan-e-Maymar 12, Kemari 07, Masroor Base 05, Korangi 04, Sadar, DHA 02), Dadu 26, Mirpur Khas 22, Tharparkar (Chachro 11, Delhi 07, Islamkot 05), Hyderabad (Air Port 09, City 07), Tando Jam 09, Jacobabad 05, Mohenjo-Dahru 04, Larkana 03, Thatta 01, Punjab: Kot Addu 32, Bhakkar 31, Murree 22, Chakwal 13, Khanpur 10, Bahawalpur (Airport 05, City 01), Dera Ghazi Khan, Okara 03, Multan (City 02, Airport 01), Gujranwala, Toba Tek Singh, Islamabad (Golra) 02, Jhang, Karoor (Layyah), Mangla 01, Balochistan: Khuzdar 21, Lasbela 20, Panjgur 06 , Barkhan 05, Kalat 01, Khyber Pakhtunkhwa: Cherat 42, Kakul 31, Malam Jabba 05, Kakul, Patan 02, Saidu Sharif 01, Gilgit-Baltistan: Astore 01mm.\nThe highest maximum temperatures recorded were Chilas 43C, Nokkundi, Bunji 42 and Dalbandin 41C.",
  "retrievedAt": "2025-08-11T04:22:29.161Z"
}
