{
  "title": "ISSI holds seminar on “India’s Illegal and Unilateral Actions in IIJOK: Five Years On” August 5, 2024",
  "link": "https://www.app.com.pk/national/issi-holds-seminar-on-indias-illegal-and-unilateral-actions-in-iijok-five-years-on-august-5-2024/",
  "date_published": "2024-08-05T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): The India Study Centre (ISC) at the Institute of Strategic Studies Islamabad (ISSI) hosted a seminar, titled “India’s Illegal and Unilateral Actions in IIOJK: Five Years On.”\nThe purpose of the seminar was to commemorate struggle and sacrifices of the Kashmiri people, especially in the backdrop of India’s illegal and unilateral actions of August 5, 2019 in IIOJK, a news release said.\nDr. Khurram Abbas, Director ISC, delivered introductory remarks. Speakers included Ambassador Sohail Mahmood, Director General ISSI; Ambassador Khalid Mahmood, Chairman BoG, ISSI; Ambassador Mumtaz Zahra Baloch, Spokesperson and Additional Foreign Secretary, Ministry of Foreign Affairs (MOFA), Pakistan; Ambassador Riffat Masood, Pakistan’s Former Ambassador to Iran; Dr. Asma Shakir Khawaja, Executive Director, CISS, AJK; Mr. Altaf Hussain Wani, Chairman Kashmir Institute of International Relations (KIIR); and Mr. Mahmood Saghar, Leader All Parties Hurriyat Conference.\nIn his remarks, Dr. Khurram Abbas noted that India not only unilaterally changed the status of Jammu and Kashmir five years ago, but has also been seeking to alter its demographic structure in order to turn the Muslim majority into a minority. It was the sacrifices made by the Kashmiri people and diplomatic efforts by Pakistan that have kept the Kashmir issue fully alive. Citing the need for more productive contributions on the academic and literary fronts and effective global outreach, he announced that the ISSI’s India Study Centre would establish a Kashmir Resource Centre in order to facilitate students, researchers, and academics working on different dimensions of the Jammu and Kashmir dispute.\nDG ISSI Ambassador Sohail Mahmood stated that today was an appropriate occasion to evaluate the role of India, Pakistan, Kashmiris and the world community, since India’s illegal and unilateral actions of 5 August 2019. He elaborated that, on India’s part, this period of 5 years has been marked by unabated repression, deceit, manipulation and misrepresentation. While IIOJK had remained the world’s ‘most militarized zone’ as it was in 2019 , the BJP government had peddled the falsehoods of ‘normalcy’ and ‘progress’ returning to the Valley. Ambassador Sohail Mahmood added that India’s state-terrorism stretched beyond IIOJK as Indian state agents were found involved in extrajudicial killings and assassinations in Pakistan and parts of AJK. As for the Kashmiris, he commended them for writing yet another unforgettable chapter in their epic struggle for the right to self-determination in the face of India’s brutal and inhuman occupation. Despite imposing prolonged curfews, information blockade, arbitrary arrests, indiscriminate use of force, custodial killings and torture, heavy economic losses, psychological traumas, and denial of academic activities, India had not been able to break the will of the Kashmiri people.\nOn Pakistan’s part, Ambassador Sohail Mahmood highlighted its steadfast support for the just cause of the Kashmiri people and the extensive diplomatic and outreach efforts to mobilize the international community to play its role in conflict resolution. He said that Pakistan remains determined to extend all possible support to the Kashmiris in their struggle for the right to self-determination. “Besides being a historic obligation, this is a moral and strategic imperative for Pakistan,” he said. While noting that the international community could ignore the simmering situation in IIOJK only at its own peril, he advised to draw lessons from the Palestinian issue and take concrete steps to resolve the Jammu & Kashmir dispute in a timely manner. He concluded by stressing that there could be no peace in South Asia without justice for the Kashmiris. For this, faithful implementation of the UN Security Council resolutions was indispensable.\nDr. Asma Shakir Khawaja shared a rich academic perspective on India’s illegal actions in IIOJK and how they have affected the already deteriorating state of human rights in the Valley. She particularly highlighted the implications of non-resolution of the Jammu and Kashmir dispute on strategic stability in South Asia.\nMr. Altaf Hussain Wani reflected on the historical pattern of youth’s engagement in the struggle for Kashmir’s freedom. He noted that young researchers and artists need to be encouraged and facilitated to approach global conscience using nontraditional, peaceful means. He called upon the youth of AJK and Pakistan to make sustained efforts to reinforce the valiant endeavors of the Kashmiri youth in IIOJK.\nMr. Mahmood Saghar of the APHC reaffirmed commitment of the Kashmiri leadership and masses to reunite with Pakistan. He also underscored that Kashmiris will never accept any proposal to turn the LoC into a permanent border as a solution to the longstanding dispute.\nAmbassador Riffat Masood highlighted the efforts made by Pakistan on the diplomatic front and emphasized that a stable and prosperous Pakistan could do more for the Kashmir cause and a just solution of the dispute. She advised that serious work must be done by all segments including the young generation for the realization of the inalienable rights of Kashmiris.\nIn her address, chief guest Ambassador Mumtaz Zahra Baloch reiterated Pakistan’s commitment to support Kashmiris’ right to self-determination. She noted that India’s actions of 5 August 2019 were aimed at further consolidating Indian control over the occupied territory, which the Kashmiris have practically neutralized with their unmatched resistance. Further, India’s concerted campaign to change the demographic realities in the disputed territory is another manifestation of New Delhi’s intransigence and its disregard for international law and Security Council resolutions. She added that Pakistan demands that for any fruitful dialogue and constructive peace process, India must revoke all illegal steps taken before and on 5 August 2019; immediately stop demographic changes in the area; withdraw military forces; release political prisoners; normalize communication routes; stop sexual oppression; and provide immediate access to the UN High Commission for Human Rights, OIC, and humanitarian groups to occupied Jammu and Kashmir.\nThe seminar concluded with remarks by Ambassador Khalid Mahmood, Chairman BoG, ISSI, during which he dilated on the historical perspective of the Jammu and Kashmir dispute and highlighted its legal aspects in light of international law, UN Charter, and relevant Security Council resolutions.",
  "retrievedAt": "2025-08-11T04:23:13.268Z"
}
