{
  "title": "DTI provides top-quality technical skills training free of cost to underprivileged youth",
  "link": "https://www.app.com.pk/national/dti-provides-top-quality-technical-skills-training-free-of-cost-to-underprivileged-youth/",
  "date_published": "2024-08-05T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):The primary goal of Descon Technical Institute (DTI) is to provide top-quality technical skills training free of cost to underprivileged youth seeking employment in technical trades. The DTI offers a variety of scholarships and a promise of facilitating employment. Leveraging donor support, DTI is committed to providing equitable access to training and employment opportunities for students of all backgrounds and is a strong supporter of inclusivity, said a news release issued here on Monday.\nOperating since 1998, the DTI has distinguished itself by training over 35,000+ youth in diverse professional trades, with many graduates having gotten the opportunity to work overseas. DTI is currently offering 60+ technical courses.\nThe institute’s mission to help underprivileged youth earn a respectful income for themselves and their families is executed through a strategic, multifaceted approach designed to provide practical skills, support, and opportunities.\nDTI also prioritizes women’s empowerment by developing and implementing specialized programs that cater specifically to women, including training in traditionally male-dominated trades like welding and electrical work.\nHighlighting DTI’s vision, the General Manager Murtaza Ali said, ‘Our vision is to enable our youth to become competent to come at par with international standards. Our focus has been to facilitate our alumni in local and international job market placements. These empowered individuals play a pivotal role in the uplifting of their families, while also contributing to the national exchequer through foreign remittance.’\nDTI’s slogan “Skills for Livelihood” embodies a commitment to empowering underprivileged youth by equipping them with practical and marketable skills. In addition to technical skills, the institute emphasizes the importance of soft skills and life skills including Health, Safety & Environment, Communication Skills, Problem-solving etc.\nFurthermore, DTI also offers technical training programs to the corporate sector for their organizational employees, focusing on health and safety while enhancing their technical skills.\nSeveral major corporations, including Coca-Cola Pakistan, OGDCL, and Engro, have entrusted DTI with the technical training of their employees over the years.\nWith campuses located in Lahore and Sadiqabad, DTI provides state-of-the-art infrastructure and equipment and seasoned instructors, many of whom possess decades of experience in their respective fields, ensuring that students receive international standard training to build respectful careers.\nDTI also takes pride in being a certified trainer for some international certification bodies like IOSH and NEBOSH. DTI is the only institute in Pakistan to hold Gold Status by NEBOSH.\nWith a capacity to cater to over 1000 students at any given time, DTI has technically trained more than 35,000 individuals, including both men and women and facilitated about 1000 graduates to find job opportunities overseas.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:23:37.913Z"
}
