{
  "title": "PNCA marks Youm-e-Istehsal to show solidarity with Kashmiri people",
  "link": "https://www.app.com.pk/national/pnca-marks-youm-e-istehsal-to-show-solidarity-with-kashmiri-people/",
  "date_published": "2024-08-05T09:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): Pakistan National Council of the Arts (PNCA) in collaboration with the Ministry of Kashmir and Gilgit Baltistan arranged a ceremony to mark Youm-e-Istehsal Kashmir on Monday, showing solidarity with the Kashmiri people.\nThe ceremony began with special prayers for the martyrs of Indian Illegally occupied Jammu and Kashmir (IIoJK) and the success of the freedom struggle, expressing solidarity with the Kashmiri people.\nThe ceremony was attended by students from twin cities of Islamabad and Rawalpindi, Kashmiri leaders and civil society representatives in a large number.\nThe ceremony features, various competitions, tableaus, puppet show, painting exhibition and other activities to mark the Youm-e-Istehsal Kashmir Day.\nStudents from the educational institutions of the twin cities participated in various competitions held on the occasion.\nThe participants of the event carried flags and banners inscribed with “Watan-e- Aziz Pakistan” and “Jannat-e-Nazir Kashmir” while children carried placards depicting Indian atrocities.\nThe students presented various tableaus highlighting different aspects of Kashmiri culture while some others tableaus depicted the ongoing aggressions by Indian forces against the oppressed Kashmiri people.\nThe students also exhibited extraordinary oratorical skills in the speech competitions through which the children exposed ongoing Indian brutality in Kashmir, making it clear that India is actually a cruel and oppressive state.\nA puppet show was also organized during the ceremony depicting the plight of Kashmiri people and their just struggle for achieving right to self determination.\nThe students pledged solidarity with the Kashmiri brothers and sisters and paid tribute to their sacrifices.\nAccordingly, the Pakistan National Council of the Arts also organized an important exhibition of paintings in which artists portrayed the Indian atrocities in IIoJK in their art works.\nThe artists skillfully depicted the struggle of brave Kashmiri men and women through their paintings, attracting a number of visitors.\nEarlier, the employees of PNCA participated in the rally held at the D-Chowk in connection with the Youm-e-Istehsal Kashmir. The rally was held under the leadership of Director General, PNCA Muhammad Ayoub Jamali.\nOn behalf of the participants of the rally, a minute of silence was observed in D Chowk to express solidarity with Kashmiris.\nThe rally was also addressed by Deputy Prime Minister and Foreign Minister, Senator Mohammad Ishaq Dar, Federal Minister for Kashmir and Gilgit-Baltistan Affairs Engineer Amir Maqam and other speakers.\nThe participants carried banners to condemn the serious violations of human rights in IIoJK and the unilateral and illegal actions of India since August 5, 2019.",
  "retrievedAt": "2025-08-11T04:24:12.693Z"
}
