{
  "title": "Front-runner Zahir banned ahead of Pakistan Football Federation election - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Syed Zahir Ali Shah, widely considered the front-runner in the upcoming elections of the Pakistan Football Federation, was on Sunday night handed a 10-year ban by the disciplinary committee of the country’s football governing body for breaching several clauses of the PFF Constitution; the move throwing wide open the long-awaited May 20 polls.\n\nAfter another ban had been revoked on appeal last year, Zahir had won the elections of the Khyber Pakhtunkhwa Football Association and was heading towards the presidential elections with strong support of the PFF Congress.\n\nHowever, the PFF disciplinary committee had opened proceedings against him on two cases for which complaints had been filed last year and earlier this year.\n\nIn this year’s complaint, Zahir had been accused of opposing the constitutional amendments to the PFF Constitution by pressuring congress members to vote against them — the PFF was suspended by FIFA as a result — while also for colluding with banned officials.\n\nThe complaint filed last year had alleged Zahir of forming a parallel body in 2015 and subsequently misappropriating funds for a provincial tournament. He was also held responsible for the failure of the FIFA Goal Project in Peshawar.\n\nZahir had been the senior vice-president of the PFF when it broke into two factions in 2015, eventually leading to the appointment of a Nor­malisation Committee to oversee the federation’s affa­irs by FIFA four years later.\n\nThe NC had on Sunday announced that the elections of the PFF will be held next month after over five years at the helm.\n\nZahir was last year elected KPFA president in the second phase of elections before the elections of the PFF executive committee hit a roadblock when the congress did not accept the constitutional ame­ndments proposed by FIFA.\n\nIt prompted the global football body to suspend Pakis­tan’s membership and it was only lifted once the congress accepted the amendments.\n\n“In light of the foregoing findings and having regard to the seriousness, magnitude, and consequences of the violations established against the Respondent — particul­arly his role in obstructing reforms mandated by FIFA and AFC, his breach of a solemn undertaking, and his repeated conduct incompatible with the core principles of integrity, compliance, and good governance—the Com­mi­ttee is of the considered view that a substantial sanction is not only warranted but imperative,” the disciplinary committee said announcing a 10-year ban on Zahir.\n\nZahir told Dawn on Monday that he planned to file an appeal with the PFF appeals committee over the decision while also adding that he hadn’t been given proper time to appear before the disciplinary committee.\n\n“I was travelling and had sent my itinerary to the disciplinary committee that I wouldn’t be available, yet they held the hearing on the said date and passed the judgment,” he said.\n\nZahir added that he will attempt to invoke a clause in the PFF Constitution that all­ows “an independent and duly convened national arbitration to deal with all nati­onal disputes against final decisions of the PFF when all the internal channels have been exha­usted”.\n\nPublished in Dawn, April 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:03:57.806Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902798/front-runner-zahir-banned-ahead-of-pakistan-football-federation-election",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T03:01:20.000Z"
}
