{
  "title": "Govt yet to finalise policy to counter US tariffs - Business - DAWN.COM",
  "author": null,
  "content": "• Exporters apprehensive of commerce ministry’s ‘lack of readiness’ to address situation\n• Expert calls for preferential trade deals with countries, including US\n\nISLAMABAD: As the government considers its options, the private sector views the Trump administration’s reciprocal tariffs as a strategic manoeuvre to compel Islamabad to engage in discussions for better access to the Pakistani market.\n\nThe tariffs have also impacted Pakistan’s three main competitors in the US market — India, Vietnam, and Bangladesh. However, New Delhi and Hanoi have already prepared in advance, while Pakistan’s commerce ministry remains in the early stages of discussions.\n\nDespite maintaining the lowest tariffs on US products, Bangladesh has requested a three-month extension from Washington. In contrast, Vietnam has proposed a zero-duty policy for US goods. However, Washington seeks to bring these countries, including Pakistan, to the negotiating table.\n\nCommerce Minister Jam Kamal convened a meeting on Monday with textile exporters to deliberate on Pakistan’s strategic approach and response to US tariffs. “Our trade officers and ambassador in the US maintain ongoing communication with the relevant authorities to ensure that Pakistan’s concerns are conveyed,” the minister stated.\n\nExporters expressed their apprehensions regarding the ministry’s lack of readiness to address the post-US tariff situation. The ministry refrained from disclosing its strategy, and the meeting appears to be limited to superficial discussions, one of the participants told Dawn.\n\nHowever, the ministry’s announcement termed the meeting a proactive measure.\n\nImpact evaluation\n\nMeanwhile, the Policy Research and Advisory Council (PRAC) of the Karachi Chamber of Commerce and Industries has conducted an in-depth examination of the US tariffs impacting Pakistan’s products, particularly in the textile sector and its competitors.\n\nThis report is the initial effort to underscore the real effects, as the commerce ministry has not yet released any analysis regarding Pakistani exports to the US.\n\nPRAC Chairman Younus Dagha emphasised the urgency for Pakistan to finalise its response promptly. This is crucial for the country to extend reciprocal tariff reductions to the US on key strategic products such as soyabean, machinery, and cotton.\n\nHe stated that Pakistan must implement a zero duty on all products provided to China and Gulf Cooperation Council (GCC) countries as part of its preferential trade agreements.\n\nHe stated that this is the sole method to obtain some reprieve from the US regarding textile products.\n\nHe suggested engaging proactively with US trade officials to discuss potential tariff adjustments, which are critical in safeguarding Pakistan’s market share in the US.\n\nTextiles account for 77pc of the total export volume to the US. The total value of textile and textile articles exported amounts to $4.18bn, making it by far the most significant category in terms of trade value.\n\nPakistan’s imports from the US are more diversified across various sectors, with textile (38pc), base metals (22pc), machinery and mechanical appliances (9pc), chemical and allied industries (6pc) and transport equipment (5pc).\n\nPrioritising imports\n\nPakistan Textile Exporters Association Patron-in-Chief Khurram Mukhtar said that the US tariffs may not appear definitive and the disruption appears strategic.\n\nHe asserted that Pakistan will persist in holding a competitive advantage over leading textile-exporting nations to the US owing to its comprehensive supply chain, commitment to quality standards, and robust trade relationships.\n\nPakistan has played a significant role as a major importer of US cotton, bolstering American farmers and enhancing bilateral trade relations. The US is called upon to acknowledge this enduring partnership and to implement equitable trade policies that do not unduly impact Pakistan’s exports.\n\nHe stated that Pakistan should prioritise importing vital US commodities like cotton, soybean, scrap, and petroleum products. By lowering tariffs on these crucial imports from the US, he said Pakistan can effectively advocate for reciprocal preferential tariffs on its exports.\n\nAddressing a seminar at the Sustainable Development Policy Institute (SDPI), Pakistan’s former ambassador to the World Trade Organisation Dr Manzoor Ahmed said the current global environment requires bold recalibrations. “We need free and preferential trade agreements, especially with the US,” he remarked.\n\nHe stressed that Pakistan’s exports make up only 10pc of GDP, starkly contrasting to Vietnam’s 100pc, highlighting the urgency for reforms.\n\nM Hassan Shafqaat, CEO of the Pakistan Textile Council, urged the government to view the situation as both a short-term threat and a long-term opportunity, especially as China appears most affected.\n\nMr. Samir S. Amir of the Pakistan Business Council noted inefficiencies in Pakistan’s manufacturing sector, citing high yarn waste in towel production and low per-unit apparel prices.\n\n“Instead of blanket subsidies, we need targeted reforms. Let’s shift the conversation from trade threats to trade potential within South and Southeast Asia.”\n\nPublished in Dawn, April 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/080821556ade92d.png",
  "retrievedAt": "2025-08-25T14:04:05.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902831/govt-yet-to-finalise-policy-to-counter-us-tariffs",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T03:01:03.000Z"
}
