{
  "title": "Microplastic pollution in Europe’s great rivers alarms scientists - World - DAWN.COM",
  "author": null,
  "content": "PARIS: “Alarming” levels of microplastic have been found in major rivers across Europe according to scientists in 14 studies published simultaneously on Monday.\n\n“The pollution is present in all European rivers” studied, said French scientist Jean-Franois Ghiglione, who coordinated the large-scale operation across nine major rivers from the Thames to the Tiber.\n\n“Alarming” pollution of on average “three microplastics per cubic metre of water” was observed in all of them, according to the results published in the journal of Environmental Science and Pollution Research.\n\nThis is far from the 40 microplastics per cubic metre recorded in the world’s 10 most polluted rivers — the Yellow River, Yangtze, Mekong, Ganges, Nile, Niger, Indus, Amur, Pearl and Hai — which irrigate countries where most plastic is produced or plastic waste is processed. But this does not take into account the volume of water flowing.\n\n3,000 particles per second\n\nOn the Rhone in Valence, France, the fast flow means there are “3,000 plastic particles every second”, said Ghiglione. The Seine in Paris has around 900 per second.\n\n“The mass of microplastics invisible to the naked eye is more significant than that of the visible ones,” said Ghiglione — a result that “surprised” researchers. This was\n\nconfirmed by analytical advances made during the studies, which began in 2019.\n\n“Large microplastics float and are collected at the surface, while invisible ones are distributed throughout the water column and are ingested by many animals and organisms,” said Ghiglione, head of research in marine microbial ecotoxicology at the French National Centre for Scientific Research (CNRS).\n\nSamples were collected from the mouths of the rivers Elbe, Ebro, Garonne, Loire, Rhone, Rhine, Seine, Thames and the Tiber by some 40 chemists, biologists and physicists from 19 research laboratories.\n\nThe researchers then made their way upstream until they reached the first major city on each of the waterways. “Microplastics are smaller than a grain of rice,” said Alexandra Ter Halle, a chemist at the CNRS in Toulouse, who took part in the analysis.\n\n‘Mermaid tears’\n\nThe particles are less than five millimetres in size, with the smallest invisible to the naked eye. These include synthetic textile fibres from washing clothes and microplastics released from car tyres or when unscrewing plastic bottle caps.\n\nResearchers also found virgin plastic pellets, the raw granules used to manufacture plastic products.\n\nOne of the studies identified a virulent bacterium on a microplastic in the Loire in France, capable of causing infections in humans.\n\nAnother unexpected finding was that a quarter of microplastics discovered in rivers are not derived from waste but come from industrial plastic pellets.\n\nThese granules, dubbed “mermaid tears”, can also sometimes be found scattered along beaches after maritime incidents. “What we see is the pollution is diffuse and established” and “comes from everywhere” in the rivers, he added.\n\n“The international scientific coalition we are part of (as part of international UN negotiations on reducing plastic pollution) is calling for a major reduction in the production of primary plastic because we know that plastic production is directly linked to pollution,” he said.\n\nPublished in Dawn, April 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:26:15.512Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902815/microplastic-pollution-in-europes-great-rivers-alarms-scientists",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T03:01:39.000Z"
}
