{
  "title": "Hostile wireless message lands SSP in hot water - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad police chief ordered the senior superintendent of police (investigation) to clarify his position on a threatening message sent to subordinates on the police radio.\n\nIn the message, SSP Usman Tariq Butt threatened the subordinates by saying he would “behead” the subordinates himself, who will disobey his order. Besides, he also threatened the officers – superintendents of police, sub-divisional police officers and station house officers – to “take care of their subordinates (wireless operators)”.\n\nInspector General of Police Islamabad Syed Ali Nasir Rizvi, when contacted for comments over the matter, said that the SSP was asked to officially clear his position in writing over airing such a message. The officer was also called into the office and reprimanded over the message, he added.\n\n“Being a police chief, I also condemned such a message and the use of such language by a senior officer for subordinates,” Mr Rizvi said, adding that no one was allowed to treat their subordinates in such a manner, and such acts would not be tolerated.\n\nA wireless message of SSP Usman Tariq Butt for all zonal superintendents, sub-divisional police officers, and station house officers said: “If I am speaking on wireless, using my own wireless, then no operator of any officer should answer on wireless.” Instead, all officers should respond on wireless themselves, the message added.\n\n“If I hear the operator of any officer speaking on the wireless, then I will cut off the head of the operator myself. All the officers concerned should take care of their own operators,” he said in the message.\n\nDirector General Safe City Islamabad Authority Shakir Dawar, who has the acting charge of Deputy Inspector General (Operations), said the message was a “slip of tongue”.\n\n“It’s a mistake by the operator of the officer and a slip of the tongue. All the wireless operators are once again instructed to follow the SOP of the police radio wireless communication and to refrain from using useless, unwanted and illegal conjectures on the official police radio.”\n\nIt may be noted that there is a proper post in the police for wireless operators, who attend and reply to messages on the wireless sets on behalf of the officer with whom they are deployed. The police officials also showed displeasure over the emerging attitude of the senior officers towards their subordinates.\n\nLast month, a physical confrontation between the two policemen – an assistant inspector general (investigation and complaint) and an assistant sub-inspector – had a fight after the AIG slapped the ASI in his office, located in the building housing the offices of the Islamabad police chief and the DIG headquarters.\n\nThe AIG had called the ASI to his office for an inquiry several times, but did not meet him. In the first week of March, the AIG again called him to the office and again ‘humiliated’ him by not allowing him to enter his office for the inquiry.\n\nThe ASI asked the AIG staff to let him inside the office room, but they refused, saying that he was not allowed to enter the office as per the order of the AIG. After getting the response, the ASI entered the room without permission. At this, the AIG got annoyed and started using obnoxious language despite requests by the ASI to stop using such language.\n\nLater, the ASI responded in the same manner. As a result, the AIG lost his temper and slapped the ASI, and the subordinate reacted in the same manner.\n\nOver the matter, IGP Syed Ali Nasir Rizvi ordered a high-powered inquiry, comprising a DIG headquarters, the Safe City director general, and the AIG legal, to probe the incident. The inquiry into the matter is still pending.\n\nPublished in Dawn, April 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:26:11.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902769/hostile-wireless-message-lands-ssp-in-hot-water",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T03:02:28.000Z"
}
