{
  "title": "Senior PPP leader Senator Taj Haider passes away after battling cancer - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP stalwart Senator Taj Haider passed away in Karachi on Tuesday, his party and family confirmed. He was 83 years of age.\n\nHis wife Naheed Wasi confirmed the death in a post on Facebook. She said details of the funeral would be provided later.\n\nSenator Zamir Ghumro told Dawn.com that Haider died after battling cancer.\n\nNazakat Ali, Haider’s staff director, said the senator was admitted to Karachi’s Ziauddin Hospital’s intensive care unit for the last two days.\n\nHaider served as a senator for the party from March 2012-2018 and was currently again serving in the position from March 2021-2027. He was chairman of the Senate Standing Committee on Rules of Procedure and Privileges and the PPP’s central secretary general.\n\nPresident Asif Ali Zardari expressed his grief over the death and paid tribute to the deceased’s services to the PPP and democracy.\n\n“Taj Haider was an important asset of the PPP. He was one of the ideological workers of the PPP. With the demise of Taj Haider, the PPP has lost an important political leader,” the president was quoted as saying in a statement.\n\nPPP Chairman Bilawal Bhutto-Zardari said that Haider’s decades-long political, social and literary services “will never be forgotten”, adding that the PPP leader was a dignified figure of culture and politeness.\n\n“He was a creative mind,” Bilawal said, adding that Haider’s struggle and sacrifices for democracy served as a beacon of hope for younger generations.\n\n“Taj Haider was a symbol of conscientiousness and intellect in Pakistani politics,” he said, adding that the leader’s demise caused deep sorrow and shock to the party.\n\nSindh Chief Minister Syed Murad Ali Shah also expressed grief over the death.\n\n“The death of the deceased has deeply shocked all the workers, including myself,” CM Shah said, adding that the death was an irreparable loss which could not be compensated.\n\n“Taj Haider was a smart, thoughtful and determined political leader,” CM Shah said. “He always struggled for democracy and public service,” Shah said, adding that he shared the grief of the deceased’s family.\n\nSindh Governor Kamran Khan Tesori extended his condolences on the PPP senator’s passing, saying that his political and public services would always be remembered.\n\n“May Allah grant the deceased a high place in paradise and grant patience to the bereaved family,” he said, according to a statement from the chief minister.\n\nThe Human Rights Commission of Pakistan praised him as “among the few politicians who stood uncompromisingly for economic justice, cultural rights and democratic governance in the country”.\n\nPPP Senator Sherry Rehman said the deceased was an asset to the party and that his services would always be remembered.\n\n“The deceased was a true soldier of democracy, a religious and a true man of knowledge and action,” she said.\n\nHe rendered invaluable services to democracy, Pakistan, Sindh’s rights and the welfare of the people, Rehman said.\n\nKarachi Press Club President Fazil Jamili said the death was a “profound grief”.\n\n“He was a true comrade, a dedicated democrat and a committed political worker — a rare breed in today’s hypocritical political landscape. My deepest condolences to all who still believe in honesty and integrity,” he said.\n\nPML-N Senator Afnanullah Khan also offered well wishes for the deceased in a post on X.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/082215582a63e5b.png",
  "retrievedAt": "2025-08-25T14:03:27.135Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902949/senior-ppp-leader-senator-taj-haider-passes-away-after-battling-cancer",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T16:59:34.000Z"
}
