{
  "title": "New US tariffs on China to hit 104pc on Wednesday as Beijing vows to fight back ‘blackmail’ - World - DAWN.COM",
  "author": null,
  "content": "Additional US tariffs on Chinese imports are set to reach 104 per cent on Wednesday, the White House told AFP, as Washington doubles down on planned action after Beijing vowed a “fight to the end” on levies.\n\nUS President Donald Trump had vowed a further 50pc tariff on goods from China if Beijing did not retract upcoming retaliation — and the White House confirmed that Trump will proceed with this action, taking the overall added duties this year to 104pc.\n\nChina vowed to “fight to the end” against the fresh tariffs of 50pc threatened by Trump, further aggravating a trade war that has already wiped trillions off global markets.\n\nTrump has upended the world economy with sweeping tariffs that have raised the spectre of an international recession but has ruled out any pause in his aggressive trade policy despite a dramatic market sell-off.\n\nBeijing — Washington’s major economic rival but also a key trading partner — responded by announcing its own 34pc duties on US goods to come into effect on Thursday, deepening a showdown between the world’s two largest economies.\n\nThe swift retaliation from China sparked a fresh warning from Trump that he would impose additional levies if Beijing refused to stop pushing back against his barrage of tariffs — a move that would drive the overall levies on Chinese goods to 104pc.\n\n“I have great respect for China but they can not do this,” Trump said in the White House.\n\n“We are going to have one shot at this … I’ll tell you what, it is an honour to do it.”\n\nChina swiftly hit back, blasting what it called “blackmailing” by the US and saying it would “never accept” those tariffs.\n\n“If the US insists on going its own way, China will fight it to the end,” a spokesperson for Beijing’s commerce ministry said on Tuesday.\n\n“If the US escalates its tariff measures, China will resolutely take countermeasures to safeguard its own rights and interests,” the ministry said.\n\nBut Beijing also reiterated that it sought “dialogue” with Washington — and its view that there were “no winners in a trade war”.\n\nTrump’s tariffs have rocked global markets.\n\nHong Kong’s Hang Seng collapsed by 13.2pc on Monday — its worst day since the Asian financial crisis — before paring back some of those losses in opening trade on Tuesday.\n\nWall Street stocks finished lower following a volatile session, with both the Dow and S&P 500 ending down.\n\nStocks in Thailand, Indonesia and Vietnam — a key export hub — also sank on opening on Tuesday.\n\nAnd in financial powerhouse Singapore, Prime Minister Lawrence Wong told parliament his government was “very disappointed by the US move”.\n\n“These are not actions one does to a friend.”\n\nTrillions of dollars have been wiped off combined stock market valuations in recent sessions.\n\nTrump doubled down Monday, saying he was “not looking” at any pause in tariff implementation.\n\nHe also scrapped any meetings with China over tariffs, but said the US was ready for talks with any country willing to negotiate.\n\nAfter equities took a hammering in Shanghai, China’s central bank issued a statement before trading resumed Tuesday to underline it was standing behind a sovereign fund as it buys up exchange traded funds to stabilise the market.\n\nWith investors seeking any relief from the ruinous trade war, stocks in Tokyo leapt Tuesday after Treasury Secretary Scott Bessent suggested in an interview with Fox News that Japan would get “priority” in negotiations over the US tariffs “just because they came forward very quickly”.\n\nA 10pc “baseline” tariff on US imports from around the world took effect Saturday, and a slew of countries will be hit by higher duties from Wednesday, including the levy of 34pc for Chinese goods as well as 20pc for EU products.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:03:30.663Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902901/new-us-tariffs-on-china-to-hit-104pc-on-wednesday-as-beijing-vows-to-fight-back-blackmail",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T07:08:13.000Z"
}
