{
  "title": "US, Iran to begin direct talks over nuclear plan on April 12 - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: President Donald Trump said on Monday that the United States and Iran were beginning direct talks on Tehran’s nuclear programme, a surprise announcement after Iranian officials had appeared to rebuff US calls for such negotiations.\n\nIran had pushed back against Trump’s demands that it directly negotiate over its nuclear programme or be bombed, though it had initially left the door open to indirect discussions.\n\n“We’re having direct talks with Iran, and they’ve started. It’ll go on Saturday (April 12). We have a very big meeting, and we’ll see what can happen,” Trump told reporters in the Oval Office during talks with visiting Israeli Prime Minister Benjamin Netanyahu.\n\n“And I think everybody agrees that doing a deal would be preferable,” Trump said. He declined to say where the talks would take place.\n\nWarnings by Trump of military action against Iran had jangled already tense nerves across the Middle East. Trump has said he would prefer a deal over Iran’s nuclear programme to a military confrontation and he said on March 7 he had written to Supreme Leader Ayatollah Ali Khamenei to suggest talks. Iranian officials said at the time that Tehran would not be bullied into negotiations.\n\nDuring his 2017-2021 term, Trump withdrew the US from a 2015 deal between Iran and world powers designed to curb Iran’s sensitive nuclear work in exchange for sanctions relief. Trump also reimposed sweeping US sanctions.\n\nSince then, Iran has far surpassed that deal’s limits on uranium enrichment.\n\nWestern powers accuse Iran of having a clandestine agenda to develop nuclear weapons capability by enriching uranium to a high level of fissile purity, above what they say is justifiable for a civilian atomic energy programme.\n\nTehran says its nuclear programme is wholly for civilian energy purposes.\n\nLike US presidents before him, Trump has said that Iran cannot be allowed to develop a nuclear weapon.\n\nHe told reporters that Saturday’s talks with Iran would be at a very high level and he held out the possibility that a deal could be reached. “We have a very big meeting on Saturday and we’re dealing with them directly,” Trump said.\n\nThe White House National Security Council did not immediately respond to a request for details.\n\nPublished in Dawn, April 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:03:45.852Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902809/us-iran-to-begin-direct-talks-over-nuclear-plan-on-april-12",
  "dateList": "2025-04-08",
  "date_published": "2025-04-08T03:01:39.000Z"
}
