{
  "title": "COMSTECH Webinar on ‘Armed Conflicts, War and Brain Health’ held",
  "link": "https://www.app.com.pk/national/comstech-webinar-on-armed-conflicts-war-and-brain-health-held/",
  "date_published": "2024-05-24T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Speakers at a webinar on “Armed Conflicts, War and Brain Health” held on Friday emphasized that the countries must expand their disaster management systems to cope up with the challenges faced to the people during time of crisis.\nThe webinar, arranged by COMSTECH, was moderated by Prof. Dr. Wasay, Professor Neurology, Aga Khan University.\nProf. Wasay said that the topic of webinar is very important as this issue is not only affecting the people in the war zones but the entire humanity around the world.\nProf. Dr. Foad Abdallah, former President, African Academy of Neurology, and Professor of Neurology and Stroke Medicine at Cairo University, Egypt.\nHe talked about the genocide and its effect on brain health and also discussed about genocide, examples of recent genocide, the brain behind the genocide act, the brain of genocide observers, and the effect of genocide on the brain.\nHe said genocide is an act of evil and termed on developing plans for improving health infrastructure during conflict and post-conflict time as crucial.\nProf. Abdallah concluded that “we need to initiate collective efforts to end this genocide now and live together”.\nProf. Dr. Adel Musk from Gaza highlighted the topic of the regional impact of the Palestine war.\nHe gave comprehensive account of the genocide impact on Gaza strip and said Gaza hospitals have been targeted intentionally and many times during the aggression.\nHe said 147 media workers have been killed with the majority being Palestinians.\nHe said reports indicate that 38 journalists have been arrested since the start of the war and several journalists have lost family members.\nHe said that currently 100 percent of Gazans are facing a crisis of food security and the entire infrastructure has been completely destroyed.\nProf. Dr. Mian Afzal Javed, former President, World Psychiatry Association, talked on the topic of global mental health impact of armed conflicts.\nHe talked about the importance of mental health and recommended that countries expand disaster management systems to cope with such calamities.\nProf. Dr. Serefnur Ozturk, Environment Neurology Group, World Federation of Neurology, Professor, Department of Neurology, Konya -Turkey discussed the topic of environmental impact of war.\nThe webinar was attended by the participants across OIC member states online.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:42:20.520Z"
}
