{
  "title": "PM seeks Chinese expertise to boost exports, promote IT industry",
  "link": "https://www.app.com.pk/national/pm-seeks-chinese-expertise-to-boost-exports-promote-it-industry/",
  "date_published": "2024-05-24T17:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday said that Pakistan wanted to benefit from the Chinese experiences to promote its Information Technology sector and boost exports.\nHe was talking to a delegation of the representatives of the Chinese companies which called on him at the PM House.\nThe prime minister, while welcoming the delegation, said China and Pakistan enjoyed long-standing brotherly relations that were further strengthening with the passage of time.\n“China has an important role in Pakistan’s development. It has always helped Pakistan in difficult times for which the entire nation, including me, is grateful to the Chinese leadership and the people,” he said.\nHe emphasized that the security and protection of the Chinese workers and citizens was the top priority of the government. “The government has taken all possible measures to ensure foolproof security of the Chinese citizens in Pakistan,” he said, adding that in that regard a comprehensive plan had been prepared.\nAs regards the China Pakistan Economic Corridor (CPEC), the prime minister said that his upcoming visit to China would be fully focused on the second phase of the mega project, besides further promoting bilateral economic relations.\nPM Shehbaz pointed out that China was the second largest economy in the world, which was a source of great satisfaction for Pakistan.\n“The way China lifted 700 million people out of poverty is a beacon for us.”\nThe prime minister said Pakistan was an agriculture country and it wanted to utilize modern technology in the sector.\nHe informed the delegation that the government was taking measures on priority to increase the foreign direct investment in the country. Reforms were being introduced at the government level to expand the tax net, discourage tax leakages and stop tax theft from the system.\nHe also invited the Chinese companies to invest in Pakistan’s electric and hybrid auto sector.\nThe prime minister also directed the authorities concerned to resolve all the issues of the Chinese companies in Pakistan.\nDuring the meeting, Minister for Planning and Development Ahsan Iqbal briefed the prime minister about meeting of the Joint Coordination Committee of CPEC.\nHe said it was agreed in the meeting that the up-gradation of the Pakistan Railways Main Line 1 (ML-1), realignment of Karakoram Highway, establishment of Special Economic Zones, Gwadar port and Agriculture Demonstration Zones would be the prioritized projects of the second phase of CPEC.\nThe representatives of the Chinese companies, while terming Pakistan their second home, expressed their resolve to further expand their businesses and investment in the country.\nCommerce Minister Jam Kamal Khan, Economic Affairs Minister Ahad Khan Cheema, Finance Minister Muhammad Aurangzeb, Planning Minister Ahsan Iqbal, Industries Minister Rana Tanveer Hussain, Interior Minister Syed Mohsin Raza Naqvi, Minister for Power Awais Ahmed Khan Leghari, Minister for Ports and Shipping Musdik Malik, PM’s Special Assistant Tariq Fatemi, Chinese Ambassador to Pakistan and other officials concerned also attended the meeting.",
  "retrievedAt": "2025-08-11T02:41:35.846Z"
}
