{
  "title": "Pakistan leading world in community-based conservation of Markhor: Romina",
  "link": "https://www.app.com.pk/national/pakistan-leading-world-in-community-based-conservation-of-markhor-romina/",
  "date_published": "2024-05-24T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Prime Minister’s Coordinator on Climate Change, Romina Khurshid Alam on Friday announced that Pakistan was the leading the world in community-based conservation of Markhor and other wild goats and sheep that were thriving in population across the northern region of the country.\nAddressing a press conference, flanked by Inspector General of Forest, Ministry of Climate Change and Environmental Coordination, Ghulam Qadir Shah on the occasion of International Markhor Day, the PM’s Coordinator mentioned that the country along with the rest of the world was celebrating its national animal’s day under the ambit of the United Nations to raise awareness on its conservation and significance in the ecology.\nRomina Khurshid said the United Nations General Assembly on May 2nd approved the resolution to celebrate global Markhor Day to highlight that it was an important member of the natural ecosystem facing existential threats due to irresponsible attitude and anthropogenic activities of mankind.\nThe mountainous region of the country particularly Gilgit Baltistan, Chitral, Kohistan, Swat, Dir, and Balochistan were the habitats of more than a dozen of wild goats and sheep including Ibex, Markhor, Urial, Himalayan Gorel, Blue Sheep and Marcopolo Sheep, she added.\n“Markhor is an enchanting tough and highly impressive wild Capra that resides in the harsh mountainous terrain and its not only important part of the natural food chain but also a major source of livelihood for the local populace,” she said.\nShe underlined that the sports hunting meant for conservation through trophy hunting was criticized by the masses but it was a complete conservation programme under the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES).\n“Under this programme, only 12 out of 4500 total markhors existing in our mountains are picked who are mainly aged for trophy hunting whereas the massive amount garnered from this activity is mostly spent on the improvement of their breeding spaces and habitats,” Romina Khursheed Alam said.\nIn her message, on the occasion, to the world, the PM’s Coordinator said that the government of Pakistan was proud to reckon that the people of Pakistan, public and private organisations, and professional associated to forests and wildlife especially Markhor were committed to ensure the conservation of the biodiversity and wild species.\nMoreover, she said the country was also welcoming the entire world to learn from its experiences in the this regard and would share its knowledge to the countries willing to learn. She prayed to the Almighty for progress and prosperity in the efforts to conserve wildlife and forests and other sectors of the country.\nIn his remarks, IG Forest, Ghulam Qadir Shah mentioned that the population of Markhor had witnessed growth that had further increased the responsibility in the community. Shah added that the data pertaining to the snake-horned wild goat was available with the Ministry.\nHowever, it had a specific territory that also includes other wild animals as well, he said. “In the 1990s, Markhor’s numbers had plummeted to a drastic level whereas 18% area of Pakistan is for Markhor and snow leopard. Some 3,000-5,000 Markhors are present in Pakistan.\nIn 2000, a policy was made for trophy hunting that allowed a quota initially of 6 and later 12 Markhors to be hunted in a season whereas this hunting quota is extended to the international level,” he explained. Shah informed that during the past year, the most expensive hunting permit was sold for USD186,000, whereas 20% of this amount went to the wildlife department and rest to the community.",
  "retrievedAt": "2025-08-11T02:42:21.042Z"
}
