{
  "title": "Sarai Gambila-Kohat road to be completed by end of June: Minister",
  "link": "https://www.app.com.pk/national/sarai-gambila-kohat-road-to-be-completed-by-end-of-june-minister/",
  "date_published": "2024-05-24T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Minister for Law and Justice Azam Nazeer Tarar Friday informed the Senate that the 128-kilometer Sarai Gambila-Kohat Road in Khyber Pakhtunkhwa would be completed by the end of June, at a cost of Rs 30 billion.\nDuring the question hour in the House, he said that the Muzaffarabad to Mansehra motorway would be constructed with the support of Saudi funds.\nHe also mentioned that a dual carriageway was currently under construction to connect Kohat to Jand Road with Motorway M-14, linking Islamabad and Dera Ismail Khan.\nThis project, costing Rs 18.7 billion, is also expected to be completed by the end of June.\nThe minister provided updates on the ongoing construction of the old Bannu Road, slated for completion by September at a cost exceeding Rs 17 billion.\nHe further informed the House about the challenges encountered in the Peshawar Northern Bypass project, with a budget of Rs 27 billion, primarily related to land acquisition.\nDespite these challenges, the project is anticipated to be completed by December.\nTarar also highlighted the completion of the Chakdara-Fatehpur section at a cost of Rs 7 billion and mentioned that the Pezu to Tank Road was scheduled for completion by June 2024.\nRegarding the Khyber Pass Economic Corridor, aimed at serving as an international trade route, Tarar stated that the project would cost approximately $460 million.\nHe confirmed the finalization of the agreement and announced that the bidding process would commence soon.\nHe mentioned the construction of the Chakdara-Chitral, N-95 road in three phases with the assistance of the Korean Exim Bank. Financial arrangements for the first phase of the 130-kilometer project have already been secured.\nHe addressed the transportation difficulties faced by local residents during winter and announced that the Malakand Tunnel project, costing $23 million, is set to be completed to alleviate these challenges.",
  "retrievedAt": "2025-08-11T02:42:22.931Z"
}
