{
  "title": "LHC CJ urges judges to work without fear",
  "link": "https://www.app.com.pk/national/lhc-cj-urges-judges-to-work-without-fear/",
  "date_published": "2024-05-24T18:11:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 24 (APP):Lahore High Court (LHC) Chief Justice Malik Shahzad Ahmad Khan has asked judges of the district judiciary to work without any fear and greed.\nAddressing the concluding ceremony of a pre-service training program for newly appointed judges at Punjab Judicial Academy on Friday, he appreciated the district judiciary for its hard work despite a shortage of judges.\nHe stated that 1.4 million cases were pending in the district judiciary of the province, whereas the number of serving judicial officers was 1,760, adding that there was a shortage of 800 judicial officers. He said that within the past three months, about 816,000 new cases were filed, whereas 825,000 cases were decided in the same period, which shows the judges’ performance despite limited resources.\nHe mentioned that it was necessary to utilize “video link” technology to reduce the number of pending cases. He said that soon video technology would be used for proceedings and recording of evidence in courts across Punjab, and judges should gain complete command over the use of information technology.\nHe further stated that the alternate dispute resolution system was not fully utilized in the country, emphasizing the importance of making more use of it.\nThe chief justice said that the strike culture was a big reason for delays in cases. He mentioned that the district courts in Lahore were closed for 78 days following lawyers’ strikes in the recent past, which badly affected people’s right to justice. He said that all judges of the Lahore High Court agreed that no more lockdowns of courts would be tolerated.\nHe noted that 90 percent of the lawyers were professional and supported ending the strike culture. He said that the Chief Justice of Pakistan and judges of the Supreme Court played a leading role in discouraging the strike culture. He expressed hope that the strike culture would end.\nLater, the chief justice gave certificates to the judicial officers upon completion of their pre-service training.\nDirector General Punjab Judicial Academy Abdul Sattar also addressed the ceremony.\nLHC Registrar Abdul Rasheed Abid, Director General Judicial and Case Management Tanvir Akbar, Sessions Judge Human Resource Majid Ali Awan, Director General District Judiciary Abher Gul Khan, and others also attended the ceremony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:41:55.563Z"
}
