{
  "title": "E-Scooters: Empowering women, transforming eco-friendly transportation in Islamabad",
  "link": "https://www.app.com.pk/national/e-scooters-empowering-women-transforming-eco-friendly-transportation-in-islamabad/",
  "date_published": "2024-05-24T10:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):: E-vehicles, especially e-scooters, are gaining popularity worldwide for their environmental and economic benefits. In Islamabad, e-scooters are transforming urban mobility and empowering women. With zero emissions and low costs, they offer a sustainable solution to traffic congestion and provide freedom to female commuters. As Islamabad embraces this trend, the city is moving towards a cleaner, more inclusive future.\nE-scooters are also dismantling barriers for women in the federal capital, providing them with the means to commute to classes, offices, and other engagements without having to rely on time-consuming public transport or costly ride-hailing services.\nAccording to data shared with this news agency by the Excise and Taxation Department, from May 2023 to May 2024, a total of 62,397 motorbikes have been registered. Interestingly, out of this figure, 780 motorbikes were registered under the names of women. This surge in registrations among women marks a notable shift in transportation trends, reflecting a growing interest and participation in motorbike ownership among women in this era.\nA student of Riphah University Zainab, who commutes on her new electric scooter, shared her experience with APP. She said, “With the increase in petrol prices and the high cost of car maintenance, I was finally allowed to buy an e-scooter after months of arguments with my family.”\nZainab shared her satisfaction, saying that instead of going to gas stations and waiting for the tank to fill up, she now plugs in her e-scooter at home. She expressed how this change has made her life easier and more convenient, allowing her to reach all her destinations on time without the frustration of waiting long at bus stops for local transport. This newfound independence has brought her a sense of freedom and relief.\nSimilarly, a working journalist Farah Naz, who is using E-Scooter for over the years now said ,working professionals, especially women, e-scooters provide a practical solution to the daily commute. They bypass long waits at bus stops and congested traffic, saving time and money. This newfound mobility isn’t just about reaching destinations; it’s about empowerment and autonomy.\nKashif Javed, Business Development Manager of Metro E-Vehicles, talking to this scribe highlighted the rapid transition from petrol bikes to e-vehicles, with their market share steadily rising. He noted a growing interest among people, particularly students and professionals, in purchasing e-scooters as a means to save money and contribute to a cleaner environment. The conversion of traditional fuel bikes to electric scooter was also growing, he further remarked.\n“As the city grapples with air pollution and environmental degradation, transitioning to electric vehicles becomes imperative. E-scooters emit zero tailpipe emissions, helping improve air quality and mitigate the impacts of climate change. This move is certainly poised to contribute to Islamabad’s efforts towards a cleaner, more sustainable future,” a climate expert Dr Ejaz Ahmed, a former Director of WWF talking to this agency appreciating this change said.\nDr. Khalid Walid, Head of the Energy Unit at the Sustainable Development Program (SDP), along with Tuaha Adil, Research Economist at the Policy Research Institute of Market Economy (PRIME), in response to a question collectively emphasized the economic and environmentally friendly advantages of electric vehicles (EVs). They pointed out that in the fiscal year 2022, the transportation sector devoured a staggering 17.4 million tons of oil and 21,945 million cubic feet (mmcft) of gas, constituting a whopping 76% of the nation’s total oil consumption. This underscores the immense pressure on foreign exchange reserves, with Pakistan’s import bill for petroleum products soaring to approximately $18 billion.\nE-scooters aren’t just transport; they’re changing how we navigate cities. In Islamabad, they empower women, save money, and promote eco-friendliness. With more adopting this electric trend, the capital’s transportation future looks brighter and cleaner.",
  "retrievedAt": "2025-08-11T02:42:22.375Z"
}
