{
  "title": "Benefits of uplift projects must reach people without delay: Gilani",
  "link": "https://www.app.com.pk/national/benefits-of-uplift-projects-must-reach-people-without-delay-gilani/",
  "date_published": "2024-05-24T17:58:00.000Z",
  "source": "APP",
  "content": "MULTAN, May 24 (APP): Acting President Syed Yusuf Raza Gilani on Friday directed the local administration to complete the ongoing projects in time so that the people could enjoy the benefits of development without delay.\nThe Acting President was presiding over a meeting at the Circuit House where Deputy Commissioner Multan Captain (Retd) Rizwan Qadeer gave him a detailed briefing about the ongoing development projects.\nIt was informed that development projects related to health, education, infrastructure and sports were in progress in Multan. Many projects, including Nawabpur Road, Nadirabad Flyover, Matti Tal Road to Kabirwala Road, Shershah Road, hockey stadium, and Women University were nearing completion.\nThe Acting President was further apprised that the 5-kilometre long Nawabpur Road at the cost of Rs 270 million would be completed by June 15, 2024.\nActing President Gilani instructed the officials to ensure that the projects are completed within the stipulated period. He asked them to inform him about any financial or technical hurdles in the way of projects’ execution so that he might take them up with the prime minister for redressal.\nHe desired that the projects should be completed timely so that the people could start benefitting from upgraded facilities without any delay.\n“We have always served the people of Multan and South Punjab,” he added.\nCity Police Officer Sadiq Ali also gave a detailed briefing to the Acting President on the overall law and order situation in the district, and the steps being taken to bring the crime ratio down further.\nWasa Managing Director Chaudhry Muhammad Danish, Executive Engineer Highways Ghulam Nabi and other officials were present.",
  "retrievedAt": "2025-08-11T02:41:33.560Z"
}
