{
  "title": "Action against political party office taken in accordance with law: Minister",
  "link": "https://www.app.com.pk/national/action-against-political-party-office-taken-in-accordance-with-law-minister/",
  "date_published": "2024-05-24T08:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Federal Minister for Parliamentary Affairs, Azam Nazeer Tarar, informed the Senate that action against a political party office had been taken in accordance with the law and for violating building bylaws.\nResponding to a point of order raised by opposition leader Shibli Faraz, he further explained that the first notice was issued to the political party in 2020 for violating building bylaws. Notices were repeatedly issued from 2020 to 2024 at six-month intervals, with the final notice given on May 10 for ongoing violations.\n“In view of the last notice dated May 10, the action is in accordance with the law,” the minister said.\nHe elaborated that he had talked to the chairman of the Capital Development Authority (CDA), who confirmed that the process had been ongoing for the past four years due to the violations. The final notice was issued to ensure compliance with CDA directions, he added.\nThe minister further explained that reminders were issued to the political party regarding two floors constructed without CDA approval and the misuse of a public place for parking containers.  He said that the party had constructed illegal parking sheds.\nHe said that despite repeated requests, the party did not remove the illegal structures or vacate the public space, causing problems for the public. He informed that the Senate Committee on Interior, headed by Mohsin Aziz, had also directed the CDA to take action against the encroachments and violations of building laws.\nIn compliance with these directions, the CDA launched a campaign against such encroachments, he maintained.\nEarlier, opposition leader Shibli Faraz raised objections over the closure of the PTI central office in Islamabad. He also criticised the lack of consultation in forming the Senate Finance Committee.\nHe said that political stability is essential for economic stability. Faraz urged all political parties to work together to achieve common goals.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:42:47.082Z"
}
