{
  "title": "Sindh’s economic terrorists cannot inherit Shaheed Bhutto’s party: Haleem Adil",
  "link": "https://www.app.com.pk/national/sindhs-economic-terrorists-cannot-inherit-shaheed-bhuttos-party-haleem-adil/",
  "date_published": "2021-10-18T12:32:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 18 (APP):Leader of Opposition in Sindh Assembly Haleem Adil Sheikh Monday said that Sindh’s economic terrorists cannot inherit Shaheed Zulfiqar Ali Bhutto’s party.\nAddressing a press conference in Sindh Assembly, Haleem said that the meetingof PPP held on October 17 at Mazar-e-Quaid ground, was not a public meeting but a gathering of government employees, said a statement.\nThough the government resources were extensively used for the event of October 17, everybody noticed the empty seats and empty vehicles, he added.\nHaleem said that people from Korangi, Orangi, West, East, South, Keamari, and Lyari did not participate in Sunday’s event and Karachiites once against rejected the rejected person.\nHe said that the PPP has mistreated the families of the martyrs of the Karsaz twin-blasts tragedy and these families are forced to suffer hunger. Instead of paying tributes to martyrs of the Karsaz tragedy, Bilawal Zardari was performing the Bhangra dance in yesterday’s meeting.\nHe said that Bilawal Zardari should clarify that when his party has been in government for the last 13 years, then why the assassins of Benazir Bhutto and other martyrs were not arrested.\nHe pointed out that there were even more visitors at the mausoleum of Quaid-e-Azam as compared to the PPP yesterday’s event. He said that today there was only a difference of 13 seats and we are close to forming a government in Sindh.\nHe said that fluctuation in petrol prices is are a result of the prices in the international market, but Bilawal should tell why flour, vegetables, and other basic items are expensive in Sindh.\nSindh Assembly member Saeed Afridi ,Advocate Tanveer Zaidi and other notables were also present on the occasion.",
  "retrievedAt": "2025-08-11T21:29:23.421Z"
}
