{
  "article_id": "2025-05-28_62162cbc34f6c7965d779108b40afbc5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-emerge-as-economic-power-with-same-resolve-as-nuclear-achievement-ahsan-iqbal/",
    "retrieved_at": "2025-08-27T15:58:57.458Z"
  },
  "metadata": {
    "title": "Pakistan to emerge as economic power with same resolve as nuclear achievement: Ahsan Iqbal",
    "author": null,
    "date_published": "2025-05-28T17:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 558,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 28 (APP):Federal Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Wednesday vowed that Pakistan would become an economic power with the same determination with which it achieved nuclear capability. Addressing a ceremony to commemorate Youm-e-Takbeer, he called for greater national unity and resolve to transform Pakistan into an economic power, just as it became a nuclear power 27 years ago. Extending congratulations to the nation, Ahsan Iqbal highlighted the significance of May 28, 1998, when the then Prime Minister Nawaz Sharif, backed by the unified will of the Pakistani people, conducted nuclear tests in response to Indiaas provocations, asserting the countryas strategic independence. aThat historic decision proved that when we stand united, no power on Earth can stop us,a he said. Had Nawaz Sharif not made that decision at the time, the minister said, Pakistan would not be standing with its head held high today. Referring to the May 6-7, 2025 incident of Indian aggression, he praised Pakistanas decisive military response, saying that the downing of six Indian aircraft sent a strong global message about the strength of Pakistanas air force. aUnder the leadership of Field Marshal Syed Asim Munir, Chief of Army Staff (COAS), our armed forces responded in such a way that even Washington heard the echoes,a he added. He said Youm-e-Takbeer was not only a commemoration of nuclear tests but a turning point in regional history. aWe achieved nuclear capability despite international pressure; now is the time to become an economic force with the same determination.a Ahsan Iqbal stressed that economic strength was as vital as military defence. aNations survive and thrive not only on the battlefield but in laboratories, universities and industries,a he remarked, calling for a national focus on modern technology, exports and productivity. Addressing the challenges in education, he pointed out that nearly 25 million Pakistani children were out of school, calling it a collective failure. He vowed to raise the literacy rate to 90 per cent and higher education enrollment from the current 13 per cent to 40 per cent, noting that India stood at 30 per cent and China at 50 per cent. He also emphasized digital inclusion as a pillar of future growth, asserting that every citizen from Balochistan to Gilgit-Baltistan must be connected in the digital economy. Speaking about the aUraan Pakistana program, Ahsan Iqbal highlighted Rs54 billion worth of new development projects, including a national campaign to eliminate hepatitis. He said Pakistanas low tax-to-GDP ratio of 10.5 per cent and said this must improve if development goals were to be achieved. aWe must either pay taxes or stop tax evasion. Every citizen must become an economic soldier,a he declared. Looking ahead to 2047, the centenary of Pakistanas independence, Ahsan Iqbal laid out an ambitious national goal surpassing India economically. aWe led the region economically for 50 years, but political instability pulled us back. Itas time to reclaim our lost standing.a The minister praised the sacrifices of scientists, engineers and the armed forces for successfully securing the countryas defense and called on the nation that aIf Pakistan is to stand tall in history, every citizen must play their part.a He paid tribute to Nawaz Sharif for his historic leadership in 1998, saying aUnder his leadership, Pakistan became an unassailable nuclear power. Now, with the same spirit, we must win on the economic front.a",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}