{
  "article_id": "2025-05-28_6e2acfa99ef1519892689db098aa449e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-pays-tributes-to-leaders-scientists-forces-for-making-countrys-defence-indomitable/",
    "retrieved_at": "2025-08-27T15:59:57.989Z"
  },
  "metadata": {
    "title": "PM pays tributes to leaders, scientists, forces for making country’s defence indomitable",
    "author": null,
    "date_published": "2025-05-28T06:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 229,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 28 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday joined the nation in celebrating Youm-e-Takbeer by paying tributes to the former prime ministers, scientists, engineers and valiant armed forces who made the country's defence invincible. On X handle, the prime minister said \"As the nation celebrates Youm-e-Takbeer, we thank Allah Almighty for His countless blessings and for granting us yet another glorious victory in the face of recent Indian aggression.\" Twenty-seven years ago, on this historic day, he said former Prime Minister Mian Nawaz Sharif made Pakistan's defence invincible with his bold and courageous decision in 1998 to go ahead with a peaceful nuclear test, in the face of strong opposition from many powerful countries. Thus this historic decision gave Pakistan the status of a nuclear power. \"I join the nation in paying tribute to Shaheed Zulfikar Ali Bhutto for his visionary leadership. We also honour our brilliant scientists and engineers who turned the vision and aspirations of the entire nation into reality,\" he added. https://x.com/CMShehbaz/status/1927598634952200309 The prime minister further said that they commended their valiant armed forces for their unwavering resolve and determination to defend the nation's frontiers against all external and internal threats. \"In the same spirit of unity and resolve, we pledge to build Pakistan into a strong economic power that would become the envy of the world. InshaAllah!\" the prime minister further posted.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}