{
  "article_id": "2025-05-28_700ccf3b670485ddf18d98ff4c12b5ed",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dera-motorway-police-form-joint-unit-for-cpec-security/",
    "retrieved_at": "2025-08-27T16:00:14.973Z"
  },
  "metadata": {
    "title": "Dera, motorway police form joint unit for CPEC’ security",
    "author": null,
    "date_published": "2025-05-28T07:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 220,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "DERA ISMAIL KHAN, May 28 (APP):Dera police and Motorway have decided to set up a joint unit to ensure security and safety of passengers travelling on the China-Pakistan Economic Corridor (CPEC) Motorway. The decision to this effect was taken in a meeting held here with Regional Police Officer Dera range Syed Ashfaq Anwar. According to RPO's spokesman, the meeting was convened on the special directives of the Inspector General of Police, Khyber Pakhtunkhwa, Zulfiqar Hameed and was attended by District Police Officer (DPO) Dera, Sahibzada Sajjad Ahmed, SP Motorway Police Atique-ur-Rehman, SP Paharpur, and SDPOs from the Paharpur Circle, along with other senior officers. During the meeting, RPO Dera emphasized that it was a top priority of the police to ensure the security of the CPEC motorway and the safety of its travelers. He was of the view that all available resources should be utilized to fulfill the responsibility. As part of efforts, it was decided that a joint unit comprising motorway and district police would be formed to effectively respond to any emergency situation in a timely manner. Moreover, repair work would be initiated on the fencing along both sides of the motorway to prevent potential accidents and improve overall security. The participants reiterated to make the CPEC Motorway fully secure and ensure uninterrupted traffic flow at all times.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}