{
  "article_id": "2025-05-28_a7298951ad05f6f36950fe100a815bf7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pakistan-desires-peace-in-region-not-to-allow-iwt-violation/",
    "retrieved_at": "2025-08-27T15:59:25.080Z"
  },
  "metadata": {
    "title": "Pakistan always desires peace in region; not to allow IWT violation",
    "author": null,
    "date_published": "2025-05-28T12:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 449,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 28 (APP):Prime Minister Muhammad Shehbaz Sharif on Wednesday reiterated that Pakistan always wanted peace in the region and was willing to discuss all the bilateral issues with India on the negotiation table if India showed sincerity of purpose and cooperation. Addressing the second Trilateral Summit in Lachin city of Azerbaijan, the prime minister referred to the recent aggression of India and said that with Allah Almighty's infinite blessings and kindness, with the support of people of Pakistan, and friendly countries, and resolute response of the armed forces, they emerged victorious. In his speech, telecast live on national Tv channels, the prime minister further said that Pakistan wanted peace in the region and that required talks on the table to discuss the issues that needed urgent attention and amicable solution like the issue of Kashmir which should be resolved according to the UNSC resolutions and as per aspiration of the people of Kashmir. The prime minister said unfortunately, India tried to weaponize the Indus Waters Treaty which was a lifeline for the 240 million population of Pakistan that used the water for agriculture, drinking and other purposes. \"It is most unfortunate that India tired to threaten to stop the flow of water into Pakistan. This is not possible, this is never possible and will not be possible Insha'Allah. We are making proper arrangements to ensure that India never ever does it,\" he emphatically maintained. Prime Minister said if India wanted to talk on countering terrorism with sincerity of purpose, Pakistan would be willing to talk to them on this issue as well. \"We are the biggest victim of terrorism around the globe and lost 90,000 valuable lives and suffered 150 billion dollars worth of economic losses over the last many decades. There can be no bigger manifestation of our commitment and intention to beat this menace for all times to come,\" he added. If India showed serious and honest cooperation, he said Pakistan would be willing to discuss all the issues, including promotion of trade with India, on the negotiation table. The prime minister also appreciated the role of Field Marshal Syed Asim Munir who he said led the armed forces of Pakistan to fight with great bravery and the highest level of professional acumen while the entire nation was standing behind them. The prime minister said that during the conflict with India, he found the Field Marshal as 'God-fearing, fearless, firm with iron resolve, patience and fortitude to face that aggression.' He reiterated that during the recent conflict, India failed to bring out any credible evidences against Pakistan and rejected their sincere offer for a neutral and transparent investigation into so-called Pahalagam incident by any international body.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}