{
  "title": "Global warlords - Newspaper - DAWN.COM",
  "author": null,
  "content": "WARLORDS illegally control lawless regions via private armies. Their key traits include callous intentions, disregard of ethics and the law, and a record of abuses.\n\nWarlords have a long history. But this hitherto local threat has now morphed into a global one, posed — oddly enough — by modern states. America and Israel are separate states, but with near-identical aims. In fact, some see them as a conjoint, two-headed entity called ‘USrael’, which works in unison and vividly displays warlord-like traits despite their ‘championing’ of the law and ethics.\n\nUnfortunately, the global arena today is as lawless as warlord zones, with aggressive powers such as the US, Russia, Israel, etc, violating weak global laws at will. ‘USrael’ has broken them most in attacking Afghanistan, Iraq, Lebanon, Palestine, Libya, Syria and now Iran, with forays into Pakistan, Yemen and Somalia. UN law lets states use force in self-defence, including pre-emptively against imminent attacks. But both the US and Israel have illegally expanded the law to use force for even minor or faraway threats that could have been tackled peacefully.\n\nIsrael could have foiled future Hamas attacks just by beefing up its border security and intelligence, which its media says had shortcomings. It could have even taken revenge via its illegal tactics of killing top foes at will. But it chose wild attacks on civilians, killing tens of thousands of people, but neither rescuing the hostages nor felling Hamas.\n\nMany Israelis rejoice at the horrific and wretched misery of the Gazans beamed globally; even key Western leaders show inhuman apathy by backing Israel’s genocide, exposing the hypocrisy of their moral claims. The same is true for Iran now.\n\nThe US and IAEA officials do not have proof before them of Iran’s intent to acquire nukes. Even if Iran does, the aim would arguably be deterrence and not to use them against nuclear foes that can flatten the country in return. But both the US and Israel have attacked Iran to make it a failed state like Libya, as pointed out by many. And we naïvely nominated Trump for a Nobel prize as he was about to bomb our neighbour.\n\nSuccess feeds evil ambition doubly fast.\n\nWarlords thrive via pillage, and not fair competition and creativity. Once an economic titan, the US is now a second-rate industrial power against China. Its financial juggernaut still runs the world, but it has spawned inequality that rewards billionaires and supports instability, which harms the masses. Its science and military lead the world, but the science flexes its military muscles more than the economic ones. Thus, the US now thrives less via fair competition and creativity and more by bullying.\n\nIsrael plays the role of its able evil partner, which can act more quickly due to its small size and weaker democracy to undertake vile actions that the large and clumsy US itself cannot due to its bureaucratic and democratic constraints. In fact, Israel has now morphed into the main mastermind plotting the use of America’s huge powers to overcome foes, much like the less strong but seductive Rasputin, who mesmerised and controlled the mighty Russian empire, only to cause its fall.\n\nSuccess feeds evil ambition doubly fast. If they defeat Iran, they may soon plot to bring down bigger foes such as Russia and China (and maybe the latter’s ‘all-weather’ friend and neighbour too); not militarily, obviously, but via new high-tech templates based on economic, intelligence and cyber sabotage.\n\nChina dwarfs the US industrially and in terms of America’s ruthless military-intelligence machine. It lacks the strategic intent and mu­­­­­scle to co-shape eve­­­nts globally, but still aims to rise economically within a US-led world. This gap between the two keeps China away from global dominance. Meanwhile, ugly American neo-conservatism is turning nastier fast and is bent on halting China’s rise unfairly. China, along with other anti-US states such as Russia, Iran and perhaps even South Africa, Brazil and its own ‘all-weather friend’, must create a bipolar world where US and its allies don’t run amok as global warlords.\n\nThis means mapping major American weaknesses, such as political gridlock, crumbling infrastructure, low education quality, twin deficits and debt, rampant greed and inequality, porous borders, a large army of aliens and the limited long-term intellect of its elites, to develop cutting-edge strategies to checkmate lawlessness. Otherwise, all states daring to irk the US can wait like sitting ducks for their turn to be swallowed like the hapless victims of a Komodo dragon.\n\nThe writer has a PhD from the University of California, Berkeley, in political economy and 25 years of grassroots to senior-level experiences across 50 countries.\n\nmurtazaniaz@yahoo.com\n\nX: @NiazMurtaza2\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6859ee823cf50.jpg",
  "retrievedAt": "2025-08-20T04:25:29.851Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919545",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:32:15.000Z"
}
