{
  "title": "India’s subsidised rice fails to dent Pakistan’s exports - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Despite India’s heavy subsidies on exports, Pakistan’s rice shipments remained largely unaffected due to a strategy adopted by local exporters that prioritised agility and quality.\n\nIndia recently re-entered the international rice market after a two-year hiatus imposed to ensure domestic food security. The lifting of export bans by New Delhi generated considerable excitement in Indian media, which predicted a significant economic blow to Pakistan’s rice exports, which had been performing robustly in the interim.\n\nFor the three months preceding India’s return (July to September 2024), Pakistan’s rice exports averaged a strong 550,000 tonnes per month. Indian officials, trade bodies, and think tanks anticipated that a surge in cheaper Indian rice would undercut Pakistan’s global market share.\n\nHowever, Pakistani exporters countered with a swift, quality-centric strategy, avoiding a direct price war and instead focusing on premium offerings. According to sector expert Hamid Malik, this approach paid off as India’s re-entry failed to significantly disrupt Pakistan’s rice trade in the following six months (October 2024 to March 2025).\n\nNew Delhi’s cheap rice strategy faces WTO heat, market blowback\n\nPakistan retained its foothold in high-end markets such as the United Kingdom and European Union while also serving price-sensitive African destinations through a calibrated quality approach. Data from the Pakistan Bureau of Statistics shows rice exports for the first 11 months of FY25 stood at 5.544 million tonnes, compared to 5.593m tonnes a year earlier — a marginal decline of just 0.87pc.\n\nYet, a new challenge looms. A 3.7pc drop in rice output during Kharif 2024 has led to rapid depletion of stocks since April 2025. As a result, rice exports for the final quarter (April–June 2025) are projected to fall by around 15pc due to tight inventory.\n\nMeanwhile, India continues to offer both Basmati and non-Basmati rice at what industry insiders describe as “throwaway” prices. At $349 per tonne (FOB), India is currently the cheapest exporter of 25pc broken non-Basmati rice — undercutting Thailand ($376), Vietnam ($362), and Pakistan ($365).\n\nThis aggressive pricing has raised eyebrows, given India’s government-set Minimum Support Price (MSP) for non-Basmati paddy stands at $265 per tonne. With a 66pc milling recovery, the ex-mill cost comes to $330 per tonne, and when factoring in transportation, port handling, packaging and wharfage — around $55 — the actual FOB cost is closer to $385. This discrepancy suggests deep, potentially WTO-incompatible subsidies.\n\nIn fact, the United States, Canada, Australia and New Zealand have lodged complaints with the World Trade Organisation (WTO), alleging that India’s export strategy violates the Doha Agreement by exceeding the allowed 10pc subsidy threshold.\n\nDespite its subsidised push, India’s rice exports declined sharply in April and May 2025 — falling 50pc year-on-year. The downturn has drawn criticism from within India. Prominent voices such as rice historian and author Chandrasakhran, as well as exporters, have questioned the government’s policy, pointing to rice diversion for ethanol, swelling stocks at the Food Corporation of India (39m tonnes of rice and 19.5m tonnes of paddy), inefficiencies in the Public Distribution System, and the removal of the Minimum Export Price (MEP).\n\nAs global scrutiny of India’s subsidy-driven strategy intensifies, Pakistan’s exporters are cautiously monitoring developments — focused on safeguarding their gains through quality, adaptability, and disciplined market targeting.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:44:37.662Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919523/indias-subsidised-rice-fails-to-dent-pakistans-exports",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:31:49.000Z"
}
