{
  "title": "America’s (many) wars in the Middle East - Prism - DAWN.COM",
  "author": null,
  "content": "The year 1990 marked the beginning of America’s “endless wars” in the Middle East. It commenced with the Iraqi invasion of Kuwait — before that, US military operations in the region had been short-term or temporary. In the years that followed, ‘coming back home’ for the superpower has become increasingly difficult.\n\nOver two decades on, the US once again stood at one of its “biggest and riskiest foreign policy gamble”, as Reuters described it. On June 21, the US military bombed Iran’s nuclear sites on the orders of President Donald Trump, directly joining Israel’s war on its regional arch-nemesis.\n\n“Tonight, I can report to the world that the strikes were a spectacular military success,” Trump said in a televised address from the White House, adding that they targeted the crucial underground nuclear enrichment plant of Fordow along with facilities at Natanz and Isfahan.\n\n“Iran’s key nuclear enrichment facilities have been completely and totally obliterated. Iran, the bully of the Middle East, must now make peace,” he added.\n\nAmerica’s B-2 bombers were involved in the strikes, a US official told Reuters, speaking on condition of anonymity after reports earlier in the day said B-2 bombers — which carry so-called “bunker buster” bombs — were headed out of the US.\n\nTehran termed the US attacks a violation of international law, adding that it was “resolved to defend Iran’s territory, sovereignty, security and people by all force”.\n\nAfter 12 days of war, Trump, in a post on X last night, announced that a ceasefire had been reached between Iran and Israel. The Islamic Republic’s foreign minister said, however, that there would be no cessation of hostilities unless Israel stopped its attacks.\n\nThese recent developments have pushed the Middle East to the edge. The region holds its breath, waiting to see if the US move marks the end of the conflict or the beginning of the third world war. But the US is no stranger to such situations.\n\nWar on Lebanon (1982-83)\n\nIn 1982, Israel invaded Lebanon while the latter was embroiled in a civil war. According to various reports, Tel Aviv’s military operation was designed to militarily and politically debilitate the Palestine Liberation Organisation (PLO). The group’s leader, Yasir Arafat, was based in Beirut at the time.\n\nThe war was immensely destructive, killing thousands of civilians and fighters.\n\nBy September, the US had entered the war, dispatching battleships USS John Rodgers and nuclear cruiser USS Virginia to the Lebanese shores. American gunboats engaged in the bombing of several targets, including the town of Suk Al-Gharb. The mission stretched for 17 months and left 262 US servicemen dead. The first US Marine to die during the war was killed while defusing a bomb in the same month.\n\n“If Washington had been clearer-headed and braver, it could have prevented Mr Begin’s [then-Israel prime minister] adventure and saved thousands of lives,” wrote the Guardian.\n\nOn February 7, 1984, President Ronald Reagan announced the end of US participation in the peacekeeping force.\n\n“Reagan’s decision to withdraw the Marines remains controversial. Supporters argue that it did not make sense to sacrifice American lives and resources to help resolve a conflict where the parties involved showed little interest in working toward US goals. Critics, however, claim that Reagan failed to stand firm against terrorism and demonstrated that the United States was an undependable ally,” according to the US Office of the Historian, Foreign Service Institute.\n\nWar on Libya (1986 and 2011)\n\nIn April 1986, the United States launched air strikes on Libya against ‘‘terrorist centres’’ and military bases, the New York Times reported. In a speech broadcast nationally, Reagan said the American forces had “succeeded” in retaliating against Libya for what he called the “reign of terror” waged by Muammar Gaddafi, the Libyan leader.\n\nThe American attacks were mounted by 14 A-6E Navy attack jets based in the Mediterranean and 18 F-111 bombers from bases in England. In the months that followed, US air and naval forces carried out a series of strikes on the Libyan capital, Tripoli, resulting in the deaths of at least 40 civilians, including Gaddafi’s daughter.\n\nOne of the targets was Colonel Gaddafi’s personal residential compound on the grounds of the Bab al-Aziziya army barracks. Forewarned, Colonel Gaddafi escaped unharmed, according to the New York Times.\n\nOperation El Dorado Canyon, as it was code-named, was deemed a success by US officials. In subsequent years, America continued to keep a close eye on Libya, targeting it again.\n\nIn 2011, a Nato military coalition led by the US, Britain and France intervened in the Libyan civil war with airstrikes and a naval blockade. The objective? To protect civilian lives. But as the New York Times reported, “ […] the effect was to tip the balance in the fighting in favour of anti-Gaddafi forces, who ultimately drove him from power and killed him“.\n\nSubsequent attempts to form a civilian government in Libya failed, with another civil war breaking out in 2014. Over the next two years, American warplanes carried out a series of strikes to target “Islamic state leader and Tunisian terrorists taking refuge in the anarchy of post-Gaddafi Libya”.\n\nThe Iraq War (1991-2011)\n\nThe Persian Gulf War, codenamed Operation Desert Storm, began in 1991 after Iraqi President Saddam Hussein ordered the invasion and occupation of Kuwait in August 1990. This prompted neighbouring Arab countries to call for US intervention.\n\nThe Iraqi invasion was immediately condemned by then-President George HW Bush. A few months on, a fleet of US Air Force fighter jets, accompanied by Nato troops, began arriving in Saudi Arabia. By September, the UN Security Council authorised the use of “all necessary means” of force against Iraq if it failed to withdraw from Kuwait by January 1991.\n\nOn January 17, 1991, a massive US-led air offensive hit Iraq. The war resulted in the deaths of tens of thousands and the establishment of US military bases in the Gulf. It also sowed the seeds of many other military interventions in the following years, the impact of which can be felt in the region even today.\n\nWith the Iraqi resistance collapsing, Bush declared a ceasefire in February, ending the Persian Gulf War. In all, an estimated 8,000 to 10,000 Iraqi forces were killed.\n\nHowever, following the 9/11 attacks, the US once again fixated its guns on Iraq with President George W Bush calling for the return of weapons inspectors to Iraq in 2002. The US claimed it had intelligence that the country possessed or was developing weapons of mass destruction. By the next year, Bush demanded that Saddam Hussein step down from power and leave Iraq within 48 hours. Hussein’s refusal to do so led to the second Persian Gulf War, popularly known as the Iraq War.\n\nSaddam Hussein was captured by US forces on December 13, 2003, and executed on December 30, 2006, for “committing crimes against humanity”. The United States would not formally withdraw from Iraq until December 2011.\n\nWar on Afghanistan (2001-2021)\n\nAfter the 9/11 attacks, the US announced its war on terror, and Afghanistan was its biggest target. On October 7, 2001, a US-led coalition began attacks on Afghanistan with an intense bombing campaign by American and British forces — a conflict that would span two decades and become the longest war in US history.\n\nCodenamed “Operation Enduring Freedom”, the invasion of Afghanistan was aimed at targeting Osama bin Laden’s al-Qaeda. The invasion began with the bombardment of Taliban and al-Qaeda installations in Kabul, Kandahar, Jalalabad, Konduz and Mazar-i-Sharif.\n\nThe aerial attacks were followed by a ground invasion. On November 12, Taliban officials and their forces retreated from Kabul, and a month later, the last Taliban stronghold, Kandahar, too, had fallen. By 2002, a transitional government led by Hamid Karzai was established in Kabul.\n\nHowever, as the US focus from Afghanistan shifted to Iraq, the Taliban got a chance to regroup. Subsequently, in 2008, Bush decided to send additional soldiers to Afghanistan, with the number of US troops rising to 48,500 by mid-2008.\n\nWhen Barack Obama assumed the presidency, this number reached an all-time high of 100,000. However, after the killing of Osama bin Laden in 2011, Obama announced that the US would begin withdrawing troops from Afghanistan. However, some back and forth was seen regarding the same in the following years until 2021, when the Taliban and the Trump administration reached an agreement for US troops to fully withdraw by 2021 in exchange for stopping attacks against US forces and cutting ties with al-Qaeda.\n\nBy August of the same year, the Taliban entered Kabul, and all US troops exited Afghanistan.\n\nSyrian war (2011)\n\nIn 2011, what started as a protest movement spiralled into a civil war in Syria against the regime of President Bashar al-Assad. When the situation worsened, the US intervened, with President Obama and Western allies explicitly calling on Assad to stand down.\n\nWhat followed were sanctions on the Syrian government and the US ambassador leaving the country.\n\nIn 2013, Washington said that the Assad regime had carried out a chemical attack near Damascus that killed more than 1,400 people. The attack prompted Obama to mull striking Syria, but he pulled out last minute and instead agreed to a deal with Moscow, which was aimed at dismantling Syria’s chemical weapons arsenal, according to Al Jazeera.\n\nA year later, however, US and Arab allies launched air raids in Syria against the Islamic State of Iraq and the Levant (ISIL or ISIS) group, expanding a campaign underway in neighbouring Iraq at the time. In 2017, when Trump came to power, US forces fired a barrage of missiles at the Shayrat airbase, which was said to be the launch site of a chemical attack that resulted in the killing of 88 people.\n\nA year later, the US launched fresh attacks after an alleged Syrian government chemical attack on the then-rebel-held town of Douma killed 40 people.\n\nThen, in 2018, Trump announced the withdrawal of the roughly 2,000 US troops in Syria because ISIL had been “defeated”. However, a year later, a suicide attack claimed by ISIL killed four US servicemen and 15 others at a restaurant in northern Syria in what was termed as the deadliest attack on US forces.\n\nLater the same year, the US announced that its forces would withdraw from Syria to make way for a “long-planned operation” by Turkish forces — a decision that caused an uproar in Washington.\n\nWar on Yemen\n\nYemen has remained a Western target for a while now. But drone strikes on Yemen became frequent under the Obama and Trump administrations, according to the Middle East Eye.\n\nThese attacks often took place through the use of the US military drone programme, and were justified as part of the US ‘war on terror’, particularly to target al-Qaeda operatives. The US also aided Saudi Arabia in its bombing of the Houthis.\n\nIn December 2023, the US initiated Operation Prosperity Guardian in response to Houthi attacks on ships in the Red Sea, which began following Israel’s invasion of Gaza. By 2024, the Biden administration re-designated the Houthis as a Specially Designated Global Terrorist (SDGT) group.\n\nHeader image: A US army soldier stands with his weapon at a military base in the Makhmour area near Mosul during an operation to attack Islamic State militants in Mosul, Iraq, October 18, 2016. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2313420739af6f8.jpg",
  "retrievedAt": "2025-08-20T04:25:26.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919034/americas-many-wars-in-the-middle-east",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T06:18:38.000Z"
}
