{
  "title": "Four men shot dead for ‘honour’ in Khairpur - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Four young men were shot dead over an ‘honor’ related dispute between two rival groups of Khushhalanis and Thaaranis of the Jagirani clan, in Kot Bridge area near Pir Jo Goth, Khairpur district, on Monday.\n\nWhen the victims were returning to their village on motorcycles from Pir Jo Goth, some armed persons stopped them near the Bagh Ali Shah Bukhari graveyard in Wada Machhiyoon and opened indiscriminate fire with modern weapons on them and fled.\n\nThree — identified as Aftab aka Sohail, son of Qaiser Khan Jagirani; Sanaullah, son of Habibullah Jagirani, and Zubair Ahmed Jagirani — died on the spot whereas the fourth named as Yasin Jagirani sustained fatal gunshot injuries.\n\nUpon receiving the news of the incident, the victims’ families and local police rushed to the scene and transported the bodies and wounded youth to a Khairpur hospital.\n\nYasin, son of Lal Bakhsh, was referred to Larkana due to his precarious condition, but he could not survive and succumbed to his injuries.\n\nMeanwhile, three bodies were handed over to their families after the completion of a medico-legal examination.\n\nCarrying the three bodies, the families, including a large number of women, blocked the Shah Hussain Bypass and staged a sit-in on its both sides.\n\nKhairpur SSP Hassan Sardar Niazi arrived at the protest site and negotiated with the enraged protesters to help reopen the road.\n\nLater, two dead bodies were taken to the Sobal Khan Jagirani village and as many were brought to the Thaaro Khan Jagirani village for burial.\n\nAt the Wada Machhiyoon police station in the presence of SSP Hassan Sardar Niazi two separate cases were lodged.\n\nOne case was filed on the complaint of Hayat Khatoon, mother of Sanaullah Jagirani, and the other on the complaint of Musmat Sanam Jagirani, mother of Aftab.\n\nIn both cases, 46 known suspects, including Jani Khan Jagirani, Dilbar, Babal Khan, Rehmatullah, Naban, Subhan Ali, Rashid, Sajjid, Irfan, Gulsher, and Usman and others, along with 12 unknown men, were nominated.\n\nThe dispute between these two rival groups began three months ago over a matter of honor, which led to killing of a couple.\n\nOn Monday, the armed persons from the Khushhalani group (from the alleged kari-side) attacked and killed four young men of the Thaarani group.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:37.925Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919494/four-men-shot-dead-for-honour-in-khairpur",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:32:09.000Z"
}
