{
  "title": "Budget debate ends with Murad seeking cooperation from the opposition - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sindh Chief Minister Syed Murad Ali Shah on Monday defended the provincial government’s budget for 2025-26 and stressed the necessity of collaboration between the government and opposition for the development of the province.\n\nWinding up the seven-day general discussion on the budget, he also criticised the opposition’s conduct during protests, calling it disorderly and disrespectful.\n\n“Lawmakers should move past the incidents that occurred during the budget session,” he said, and asked them to forget what had happened and focus on the future.\n\nHe said that if all parties can work together for the province’s benefit, they should do so without hesitation.\n\nThe CM also thanked members from both sides of the aisle for their patience in listening to him.\n\nCM says erroneous tax policies may necessitate wheat imports this year, announces Rs8bn target for agriculture tax\n\nHe also lauded Pakistan’s unified response during the recent conflict with India and highlighted the crucial diplomatic and political role played by Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto-Zardari.\n\nThe CM congratulated the services chiefs, armed forces, president, prime minister, provincial governments, media and political workers for their collective and coordinated effort. “Our national unity led us to success,” he said.\n\nMr Shah highlighted that the province’s development budget which constitutes approximately 30pc of the total budget.\n\nHe pointed out that the federal government had initially promised Rs1.9 trillion for the year but subsequently revised it to Rs1.796 trillion, resulting in a shortfall of Rs100 billion. He expressed concern over the low revenue collection thus far and urged the federal government to release at least Rs237bn.\n\nDespite the federal government collecting 13pc more in taxes, the CM stated, Sindh’s revenue growth outpaces it, with a 16pc increase in provincial collections. He outlined the revenue targets for the upcoming budget, emphasising the need for equitable tax rates across the province, from Karachi to rural areas like Dadu.\n\nCM Shah noted that the erroneous tax policies might lead to wheat imports this year and announced a target of Rs8bn for agricultural tax next year, equating to a tax of Rs1,052 per acre. He contrasted this with Punjab’s target of Rs372 per acre and Khyber Pakhtunkhwa’s target of only Rs57 per acre for their cultivated land.\n\nHe affirmed that Rs500m has been allocated for each constituency, with members required to propose schemes within this budget.\n\nThe CM said a total of Rs254bn had been earmarked for the city, with the possibility of further increases.\n\nIn terms of minimum wage, the current rate in Sindh stands at Rs37,000, with proposals from Punjab and Khyber Pakhtunkhwa advocating for an increase to Rs40,000. The CM argued for a minimum wage of Rs42,000 to better support workers.\n\nHe clarified that the budget allocation of Rs12bn for flood relief pertained to recovery from the 2022 floods, not for new calamities.\n\nHe said that Sindh is on track to complete 1,460 schemes this year, setting a record and urged assembly members to move past the incidents that occurred during the budget session, stating, “Let us forget what happened on budget day and focus on the future.”\n\nLeader of the Opposition in the Sindh Assembly, Ali Khurshidi, harshly criticised the performance of the provincial government in the last 17 years and said that the increase in the seats of the PPP in the Sindh Assembly had not been due to any performance, rather to something else.\n\nHe said that public problems had become bigger and multiplied instead of being solved, adding that many schemes across the province, including Karachi and Sukkur, had been running since 2017 but would not be completed next year either.\n\nThe opposition leader said that several schemes of the education department of 2008 were still incomplete, adding that old schemes were a burden on the annual development programme and urged the government for their abolishment.\n\nHe also shared that the cadet colleges of Khairpur, Kashmore and Jacobabad had been under construction for the past several years.\n\nMr Khurshidi said that the people in Karachi did not get even basic civic facilities, including that of proper garbage disposal.\n\nHe also pointed out that the earthquakes were constantly occurring in Karachi and emphasised the need to find out the reasons behind the natural phenomena.\n\nHe said that the federation was doing “excesses” to the province and the MQM-P was not silent on this. “It is a matter of great regret that the federation does not give its due share to Sindh,” he said.\n\nHe said that Karachi’s civic issues were still there, though the mayor had full support of the chief minister and the local government minister.\n\nThe opposition leader also demanded solution to the water shortage issue in Hyderabad.\n\nSenior Minister of Sindh Sharjeel Inam Memon said that the provincial information department launched the “I Work for Sindh” app on March 14, 2025. “So far, 7.2 million people have registered on the app, including 127,012 job seekers, out of whom 12,310 have secured employment,” he added.\n\nMr Memon said that the Sindh government had provided grants amounting to Rs297m to various journalist organisations. “The Sindh government has also allocated funds in the budget for film production,” he added.\n\nHe said that after the Green Line BRT was handed over to the Sindh government, its ridership increased by 15,000, and efforts are underway to raise this number to 100,000.\n\nThe minister said that Pakistan’s first electric vehicle (EV) bus service was launched by the Sindh government, while the Pink Bus Service is the first women-exclusive service not only in Pakistan but in the entire region.\n\nHe added that the government is providing 1,000 pink EV scooters to women, for which 8,000 applications were initially received and licenses have already been issued to 145 women.\n\nSpeaker Syed Awais Shah adjourned the house for the day.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6859e15cac860.gif",
  "retrievedAt": "2025-10-12T13:04:13.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919500/budget-debate-ends-with-murad-seeking-cooperation-from-the-opposition",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:32:09.000Z"
}
