{
  "title": "Flights in disarray - Newspaper - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: In light of the escalating military situation in Gulf countries, Pakistan International Airlines (PIA) on Monday cancelled its flight operations to Qatar, Bahrain, Kuwait, and Dubai.\n\nThe move came as several Middle Eastern and international carriers suspended their operations across the Gulf region.\n\nThe announcement follows a closure of airspace by Qatar and Bahrain as Iran attacked the Al-Udeid US military base in Doha.\n\nHowever, Qatar reopen­­ed its airspace early on Tuesday. Qatar Airways said that it had temporarily cancelled flights to and from Iraq, Iran and Syria.\n\nAirspace over the UAE — a hub for airlines such as Emirates, Etihad and flydubai — is also closed based on flight paths and air traffic control audio, according to a post by FlightRadar.\n\nEmirates said that it had temporarily suspen­ded flights to and from Tehran and Iraq (Baghdad and Basra) until June 30. Etihad said that it had cancelled flights between Abu Dhabi and Tel Aviv until July 15.\n\nFlydubai said that it had temporarily suspended flights to and from Iran, Iraq, Israel and Syria until June 30.\n\nKuwait Airways also suspended flight departures from the country due to regional developments, it said in a post on X.\n\nRussia’s Aeroflot said that it had cancelled flights between Moscow and Tehran, and made changes to other routes in the Middle East.\n\nLufthansa said that it had suspended all flights to and from Beirut until and including June 30 and to and from Tel Aviv and Tehran until and including July 31.\n\nThe Turkish airline Pega­sus said that it had cancelled flights to Iran until July 30 and flights to Iraq, Lebanon and Jordan until June 30.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:52.889Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919532",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:31:36.000Z"
}
