{
  "title": "PSX plunges 3,855 points on geopolitical jitters - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakis­tan Stock Exchange (PSX) endured a sharp sell-off on Monday, as escalating geopolitical tensions in the Middle East—sparked by reported US airstrikes on Iranian nuclear facilities and Tehran’s threat to close the Strait of Hormuz—sent shockwaves through global markets, triggering panic selling and wiping out more than 3,800 points from the benchmark KSE-100 index.\n\nAccording to Topline Securities Ltd, the index plunged by as much as 4,135 points during intraday trade before recovering slightly to close at 116,167 — a net loss of 3,855 points or 3.21pc. The index now sits below the key 120,000 threshold, a level considered critical by technical analysts.\n\nInvestor sentiment was severely dented by rising fears of a broader regional conflict after the United States reportedly struck multiple Iranian nuclear sites over the weekend. Tehran’s subsequent warning of a potential closure of the Strait of Hormuz—a vital global oil transit chokepoint—further stoked risk aversion across global financial markets.\n\n“The week kicked off with a sharp sell-off triggered by geopolitical tensions in the Middle East,” said Ali Najib, Deputy Head of Trading at Arif Habib Ltd, noting that the market was responding to external shocks rather than domestic developments.\n\nIndex-heavyweights bore the brunt of the decline. Engro Holdings, Pakistan Petroleum Ltd, Lucky Cement, Oil and Gas Development Comp­any, and Mari Petroleum collectively dragged the index down by 1,054 points, reflecting investor flight from energy and industrial sectors directly exposed to global commodity price risks.\n\nDespite the steep fall, trading activity remained robust. Total traded volume rose by 41.1pc to 595.01 million shares, while the traded value jumped 50.06pc to Rs23.48bn. Worldcall Telecom Ltd topped the volume chart with 53.3 million shares changing hands.The breach of the 120,000 mark is seen by analysts as a major technical breakdown, with caution likely to dominate the near-term outlook. Market watchers say investor behaviour will remain closely tied to unfolding geopolitical developments. However, they add that any signal of de-escalation could swiftly trigger a relief rally.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6859e50941acf.gif",
  "retrievedAt": "2025-10-12T03:44:39.751Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919518/psx-plunges-3855-points-on-geopolitical-jitters",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:31:49.000Z"
}
