{
  "title": "India aviation regulator says multiple defects reappearing on aircraft - World - DAWN.COM",
  "author": null,
  "content": "India’s aviation regulator said on Tuesday it had found multiple instances of aircraft defects reappearing “many times” at Mumbai and Delhi airports, two of the country’s busiest, indicating what it said were inadequate checks on jetliners.\n\nThe findings were part of a special audit being carried out by the Directorate General of Civil Aviation (DGCA) to strengthen safety in the wake of a deadly Air India crash that killed 271 people earlier this month.\n\nThe regulator did not name the airlines where the defects were found or detail the type of defects. The two airports in the world’s third-largest aviation market serve major Indian airlines such as IndiGo, Air India and Air India Express, as well as many international carriers.\n\nThe repeated instances of defects indicated “ineffective monitoring and inadequate rectification action”, the DGCA said.\n\nThe government body also found other violations such as an aircraft maintenance engineer not taking prescribed safety precautions, not addressing defects in some places and work order not being followed in jet maintenance.\n\nAt one airport that the DGCA did not name, the regulator found no survey had been conducted despite new construction around the vicinity, an issue now under scrutiny after the Air India jet crashed into a doctors’ hostel, killing dozens.\n\nThe findings have been communicated to the concerned operators so they can take corrective measures within seven days, the DGCA said.\n\nThe shortcomings were found as part of a “comprehensive surveillance” during night and early morning hours at major airports including those at Delhi and Mumbai.\n\nAfter the June 12 crash, the regulator ordered renewed checks on Air India’s Boeing 787 fleet, but it said these did not reveal any major safety concerns.\n\nReuters reported, citing sources, that the DGCA cancelled its planned visit to Air India headquarters on Tuesday for an annual regulatory audit as the airline was tackling the fallout from several Middle Eastern countries temporarily closing their airspaces due to the Israel-Iran conflict.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:25:21.875Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919782/india-aviation-regulator-says-multiple-defects-reappearing-on-aircraft",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T13:08:50.000Z"
}
