{
  "title": "Khawaja Asif’s ‘hybrid regime’ remarks draw flak - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Incarcerated PTI leaders have said that Defence Minister Khawaja Asif’s calling the current dispensation a “hybrid model” speaks volumes about the “sham democracy” in Pakistan.\n\n“Khawaja Asif’s statement about the hybrid regime is a slur on democracy,” said a joint letter written by former foreign minister Shah Mahmood Qureshi, former Punjab ministers Dr Yasmin Rashid and Mian Mahmoodur Rasheed, Senator Ejaz Chaudhry and ex-Punjab governor Omar Sarfraz Cheema from Kot Lakhpat jail.\n\nThey stated that they supposed the PML-N would have to support it since he (Asif) was their major spokesman. They stated that the people of Pakistan did not agree with his statement as they believe in true democracy. On Feb 8 last year, the PTI leaders said the people of Pakistan had given a clear mandate to their party.\n\n“However, the lust for power was too much for PML-N and in connivance with the ECP and interim government a ‘fraudulent Form-47 government’ came into being — now being called as a hybrid form of government.”\n\nIncarcerated PTI leaders pen joint letter from Kot Lakhpat jail\n\nAs though this insult were not enough, they stated, the prime minister in a hurry recommended the American president for a Nobel peace prize.\n\nThe very next day of the recommendation, Iran was bombarded by the Americans on the orders of Donald Trump.\n\nThey said Americans knew Pakistan’s stance as the Foreign Office had given a statement: “Pakistan condemns the genocide in Gaza and the war imposed by Israel on Iran.” The people of Pakistan are standing today with Gaza and Iran.\n\n“Today, we are sure everybody regrets what has happened. The Americans are rubbing salt into our wounds and the condemnation being given by the Pakistan government is merely an eyewash. It is just to pacify the people. Is it really so? If it is, we should be ashamed of ourselves,” the letter said.\n\nThe incarcerated leaders hoped that Pakistan would not become a frontline state again.\n\n“We have already suffered exte­nsively during the Zia and Mush­arraf regimes in the Afgha­nistan war,” they said and made it clear that they were standing with the people of Gaza and Iran.\n\n“We believe in dialogue, de-escalation and peaceful coexistence,” the statement said.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:57.453Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919575/khawaja-asifs-hybrid-regime-remarks-draw-flak",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T02:02:18.000Z"
}
