{
  "title": "PTI warns budget will only deepen public suffering - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Omar Ayub claims budget will be disastrous for public, leading to increased inflation • Accuses Bilawal of politicising Sindh water issue\n• Condemns ban on meetings with Imran Khan in Adiala Jail\n• Barrister Gohar regrets opposition is being sidelined\n\nISLAMABAD: Leaders of the main opposition party PTI on Monday claimed that the sufferings of the masses will further increase after passage of the budget for fiscal year 2025-26.\n\nThey were speaking at a news conference held at the Parliament House. Those who spoke to the media included Leader of the Opposition in National Assembly Omar Ayub Khan, former NA speaker Asad Qaiser, PTI Chairman Barrister Gohar Ali Khan and others.\n\nMr Ayub warned that the budget will be a disaster for the masses and inflation will further increase after the passage of the proposed budget. He warned that the prices of petroleum products will also increase due to prevailing international situation.\n\nHe criticised the government for imposing a ban on meetings with PTI Patron-in-Chief Imran Khan in Adiala Jail.\n\nThe PTI leader said that during the budget debate he wanted to speak after Bilawal Bhutto-Zardari’s speech as he (ex-FM) tried to glamourise his foreign tour. He also alleged that the PPP was in a state of panic, adding Bilawal was supporting the budget despite the fact that the purchasing power of masses has decreased.\n\nHe alleged that Bilawal was not even aware whether he was part of the government or the opposition, accusing him of playing politics over the issue of water for Sindh.\n\nHe said that sugar price has reached Rs200 per kg due to policies of the government.\n\nBarrister Gohar Khan said that it was unfortunate that politics was being played at the cost of Pakistan. He said that India had formed six delegations, having representation of opposition, which were sent to 49 countries. However, the opposition was ignored in Pakistan, despite the fact that it stood with the government and has been trying to make the country strong.\n\nThe PTI chairman, however, said that the opposition will continue playing its role for the sovereignty of the country.\n\nAsad Qaiser, speaking on the occasion, said that Bilawal did not speak the truth about Imran Khan, claiming that good English cannot make a person a great leader. He alleged that President Zardari was the “most corrupt” person, which is why he was referred to as “Mr. 10 Percent”.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:42.396Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919576/pti-warns-budget-will-only-deepen-public-suffering",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T02:02:18.000Z"
}
