{
  "title": "Budget 2025-26: Working class not given any incentive in budget, say speakers - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Speakers from various labour unions, advocacy groups, and policy think-tank expressed concern over the continued marginalisation of Pakistan’s 76 million-strong labour force in Budget 2025-26, calling for urgent reforms and a unified national strategy to secure their rights.\n\nThe speakers, gathered at the Sustainable Development Policy Institute (SDPI) seminar criticised the budget for ignoring labour rights.\n\nEditor Publications at SDPI Saleem Khilji opened the dialogue by contextualising the historical trajectory of labour rights, stating that while the communist revolution had historically secured major gains for the working class, such momentum has long eroded.\n\n“There is now a dire need for new strategies, unity among unions, and an openhearted review of the current state of labour issues,” he emphasized. Dr Shafqat Munir, Deputy Executive Director of SDPI, pointed out a stark disconnect between government revenue goals and social justice, noting that “the working class has once again been ignored in the budget”.\n\nSay govt failed to announce minimum wage in budget\n\nHe highlighted critical issues such as unregistered daily wage workers, gender wage gaps, and the absence of basic protections for millions of labourers, especially women.\n\n“The women in industry are not even paid the minimum daily wage, and daily wage workers are not part of any formal system. The budget has completely overlooked these concerns,” Dr Munir added.\n\nAsad Mehmood, General Secretary of the Pakistan Workers Federation (PWF), criticised the federal government for not announcing a minimum wage in the budget and bypassing labour representatives in decision-making. He revealed that only 1–2 per cent of workers are unionised and stressed that 75pc of the informal labour force remains unprotected.\n\n“The ILO conventions require a minimum wage aligned with a living wage, yet employers are litigating to avoid implementing wage increases, especially in Sindh,” he said. He also called for the registration and legal protection of all 76 million labourers, demanding more inclusive and institutionalized social dialogue.\n\nQuratulaain Waheed of the PWF Women’s Wing highlighted the plight of home-based and rural female workers. She urged the government to integrate digital skills training, daycare centers, workplace safety, and financial support through soft loans in future fiscal plans.\n\n“Domestic and informal sector female workers have no legislative protection, and most don’t even have access to essential information,” she said.\n\nAsad Zubair Khan, General Secretary of the All Pakistan Clerks Association, lamented the voicelessness of labourers in society and in policymaking. He criticized the government’s aggressive tax expansion while neglecting job creation, youth training, and protections for contract workers. “The Finance Minister is targeting freelancers for tax without offering them support or education. There is no mention of creating new jobs—only downsizing and third-party outsourcing,” said Mr. Naveed from PIMS Employees Union.\n\nShafqat Warraich, Secretary General of the State Bank of Pakistan Labour Association, pointed out institutional discrimination, where officers are hired on permanent contracts while lower staff are hired through third-party contracts. He called for ending this dual system and including women and youth in the budget-making process.\n\nCh. Muhammad Yasin of the CDA Employees and Mazdoor Union showcased achievements made through persistent union advocacy, such as heat, cool, and security allowances, as well as special quotas for Hajj. However, he also criticized the weak enforcement of labour laws—even in the federal capital—and urged greater unity among trade unions for meaningful progress.\n\nDr. Sajid Amin Javed, Deputy Executive Director at SDPI, emphasised the need for labour unions to become more proactive and forward-thinking. “Unions globally are now consulting market experts to anticipate policy changes. Pakistani labour movements must also upscale and participate in systematic policy dialogues,” he said.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:43:37.235Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919612/budget-2025-26-working-class-not-given-any-incentive-in-budget-say-speakers",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T03:06:55.000Z"
}
