{
  "title": "Earth’s satellites at risk if asteroid smashes into Moon: study - World - DAWN.COM",
  "author": null,
  "content": "PARIS: If a huge asteroid smashes into the Moon in 2032, the gigantic explosion would send debris streaming towards Earth that would threaten satellites and create a spectacular meteor shower, according to researchers.\n\nEarlier this year there were briefly fears that the 60-metre-wide (200-foot-wide) asteroid called 2024 YR4, which is big enough to level a city, would strike Earth on Dec 22, 2032.\n\nIt was given the highest chance — 3.1 percent — of hitting our home planet that scientists have ever measured for such a giant space rock. Subsequent observations from telescopes definitively ruled out a direct hit on Earth.\n\nHowever, the odds that it will crash into the Moon have risen to 4.3pc, according to data from the James Webb space telescope in May. A new preprint study, which has not been peer-reviewed, is the first to estimate how such a collision could affect Earth.\n\nIt would be the largest asteroid to hit the Moon in around 5,000 years, lead study author Paul Wiegert of Canada’s University of Western Ontario said. The impact would be “comparable to a large nuclear explosion in terms of the amount of energy released”, he added.\n\nUp to 100 million kilograms (220 million pounds) of material would shoot out from the Moon’s surface, according to a series of simulations run by the researchers. If the asteroid hit the side of the Moon facing Earth — which is roughly a 50-pc chance — up to 10pc of this debris could be pulled in by Earth’s gravity over the following days, they said.\n\nEarth’s atmosphere would protect the surface from the millimetre- to centimetre-sized lunar rocks, Weigert said. 0.04-2.54 But these meteors could be capable of destroying some satellites — and there are expected to be a lot more of those orbiting the planet by 2032. “A centimetre-sized rock travelling at tens of thousands of metres per second is a lot like a bullet,” Wiegert said.\n\nIn the days after the impact, there could be more than 1,000 times the normal number of meteors threatening Earth’s satellites, he added. Meanwhile, those of us on the ground would be treated to a “spectacular” meteor shower lighting up the night sky, the study said.\n\nBut the current odds of a direct hit on the near side of the Moon remain at just two percent, Wiegert emphasised. The asteroid is not expected to be visible again until 2028, so the world will have to wait to find out more.\n\nIf a direct hit is eventually found to be likely, humanity probably has enough time to plan a mission to spare the Moon. “I’m sure it will be considered,” Wiegert said. The asteroid is half as wide and has 10pc of the mass of Dimorphos, which Nasa’s DART mission smashed into in 2022, successfully changing its trajectory.\n\nIf 2024 YR4 is on a collision course with the Moon, it would be “a good target” for another test of our planetary defences, Wiegert said. But if not, trying to deflect something zooming so close to Earth could be a little “dangerous”, he added. The preprint study, which published on the arXiv database last week, has been submitted to the Astrophysical Journal Letters.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:25:55.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919561/earths-satellites-at-risk-if-asteroid-smashes-into-moon-study",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T00:32:03.000Z"
}
