{
  "title": "NAB to use AI to trace suspicious financial transactions - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In an effort to enhance the efficiency and transparency of its operations, National Accountability Bureau (NAB) Islamabad/Rawalpindi chapter has begun integrating cutting-edge artificial intelligence (AI) technology into its investigative processes.\n\nAccording to the NAB, the initiative marked a significant leap forward in tackling complex financial crimes.\n\nThe NAB Islamabad/Rawalpindi (region) has started deploying advanced AI systems to analyse banking records, trace financial transactions, and detect money trails in high-profile financial cases.\n\n“With these tools, investigators are now able to identify hidden connections and suspicious transactions with unprecedented speed and accuracy,” an official source said. As part of this strategic initiative, a NAB team recently visited the National Centre of Artificial Intelligence (NCAI).\n\nThe two sides held in-depth discussions on aligning NAB’s investigation mechanisms with international best practices, developing AI-based investigative modules, and receiving continued technical support.\n\nNCAI head Dr Ayaz appreciated NAB’s efforts to incorporate modern technology in accountability processes and assured full cooperation.\n\nThe NCAI assured NAB to extend every possible technical assistance to help transform NAB into Pakistan’s most technologically advanced law enforcement institution.\n\nMoreover, the NAB’s spokesperson emphasised that the bureau was committed to recovering public funds and taking decisive action against corrupt elements through the adoption of state-of-the-art tools.\n\nThe use of AI, he said, was already making investigations faster, more transparent, and result-oriented.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:25:31.204Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919603/nab-to-use-ai-to-trace-suspicious-financial-transactions",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T03:00:07.000Z"
}
