{
  "title": "Law ministry probes marriage contract ambiguities - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Law and Justice convened high-stakes meeting on Monday, following a Lahore High Court directive, to address systemic errors in marriage contracts that are causing nationwide property disputes, particularly impacting women.\n\nThe crisis stems from inconsistent Urdu-English translations in Column 13, regarding the dower amount, and Column 16, concerning dowry items, of the standard Nikahnama or marriage contract.\n\nLHC Rawalpindi Bench’s Justice Jawad Hassan highlighted in a June 18 order that vague property descriptions have “led to confusion, extensive litigation and severe hardships for female litigants.”\n\nIn response to the court’s directive, the government has initiated a “dual-track response.”\n\nLahore High Court ordered action on Nikahnama errors\n\nA technical committee meeting, to be chaired by Dr Zulfiqar Hussain Awan, Senior Joint Secretary, is scheduled for 2:00pm.\n\nThe session will audit transcription errors in Nikahnama forms per the Punjab Muslim Family Rules, 1961, and review the 2025 Pakistan Child Maintenance Rules draft by court-appointed advisors.\n\nParticipants includes Additional Attorney General Haseeb Shakoor Paracha, amici curiae Barrister Fai­­­­­za Asad and Ms. Huma Ejaz Za­­man, and advocates for linked cases.\n\nSeparately, a high-level stakeholder meeting is scheduled for 2:30pm, chaired by the Federal Law Secretary.\n\nThis will include Punjab Law and Islamic Ideology Council secretaries, the National Commission on Status of Women chairperson, Pak­istan Bar Council and academic reps.\n\nThis committee will formulate policy reforms for nationwide implementation.\n\nCourt documents reveal years of disputes arising from ambiguous marital contracts, leaving women entangled in legal battles over rightful property claims.\n\nThe LHC emphasised “settling this once for all” through legislative intervention and Dr Awan is required to submit a compliance report to the LHC.\n\nAlso, an eight-member committee, led by the Federal Law Secretary, is tasked by the LHC to review proposed amendments to Pakistan’s Muslim Family Laws Ordinance, focusing on the contentious Section 10A regarding matrimonial property rights.\n\nThe committee comprises provincial law secretaries, reps from Council of Islamic Ideology (CII), National Commission on Status of Women (NCSW), Pakistan Bar Council (PBC), Federal Ombuds­person Secretariat (FOSPAH), a civil society NGO nominee, and Shifa Tameer-e-Millat University’s Law Department Chairperson Prof Muhammad Mushtaq\n\nThe Ministry of Law and Justice, however, opposed judicial intervention in legislative processes.\n\nIt asserted existing bodies like the CII, parliamentary commit-tees and ministries ensure laws adhere to Islamic principles (Articles 227–228) and constitutional safeguards.\n\nThe ministry warned that pre-legislative judicial review could “undermine the democratic process.”\n\nThe court directed the panel to assess amendments for compli-ance with the Constitution (Articles 2A, 20, 25, 227), alignment with Islamic principles guided by CII, gender justice under CEDAW and practicality of property rights enforcement.\n\nThe committee must hold public consultations, analyse internatio­n­­al models such as Malay-sia’s Islamic Family Law, draft court procedure reforms, and propose gender-sensitivity training for judges.\n\nIts first meeting is scheduled for June 24, 2024, with a report to be submitted under the “Doctrine of Continuing Mandamus.”\n\nThe committee’s recommendations—including any dissenting opinions—will be presented to the LHC for further directives.\n\nPublished in Dawn, June 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:44:34.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919572/law-ministry-probes-marriage-contract-ambiguities",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T02:02:18.000Z"
}
