{
  "title": "TDCP generates over Rs 467 mln from Patriata Chairlift, Glamping Pods",
  "link": "https://www.app.com.pk/national/tdcp-generates-over-rs-467-mln-from-patriata-chairlift-glamping-pods/",
  "date_published": "2024-07-14T09:22:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 14 (APP):Tourism Development Corporation of Punjab (TDCP) earned over Rs 467 million in the fiscal year 2023-24 from Patriata Chairlift and glamping pods, marking a\nsignificant achievement in promoting tourism in the Galyat region of Murree.\nEstablished four years ago, the glamping pods at the scenic Patriata Top in New Murree have become a major attraction for tourists. TDCP spokesperson said here on Sunday the pods cater to the area’s specific weather conditions, offering modern residential facilities that draw numerous visitors, thereby contributing significantly to revenue generation. Nestled in the middle of a forest, these luxury glamping pods provide a unique\nblend of glamour and camping on one of the highest peaks of the Himalayas.\nThey offer a charming and healthy environment, appealing to those seeking natural recreation. The pods come in two configurations: double-bed pods for two people and four-bed pods for four people. All are equipped with comfortable beds, blankets, tables, modern facilities, and hot water, he added.\nIn addition to the glamping pods, he said the TDCP restaurant at Patriata Top attracts  tourists by offering delicious, hygienic food at reasonable rates. The restaurant features a large hall for seating and dining tables set under umbrellas among tall,\nUnder TDCP management, there are five two-bed pods and three four-bed pods available, accommodating a total of 22 people. The nightly rent is Rs 6000 for a four-bed pod and Rs 4000 for a two-bed pod.\nThe TDCP has also developed a beautiful walking track for tourists, and there are\nshops featuring regional products and a mosque. Security guards and TDCP staff\nare on duty 24/7 to ensure the safety and comfort of guests, with iron fences and\nbarbed wire enclosures protecting tourists from wildlife.\nUnder the supervision of General Manager Operations TDCP, Wahid Arjumand Zia,\nthe glamping pods, located 40 kilometers from Islamabad and at an altitude of 7500 feet\nin the Himalayas, could be accessed via land route, chairlift, and cable car. This initiative\nnot only offers a unique recreational opportunities but also generates departmental\nrevenue and provides a vital source of income for thousands of residents in nearby\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:55:06.204Z"
}
