{
  "title": "Wani for establishing scout units in all private, govt. educational institutions",
  "link": "https://www.app.com.pk/national/wani-for-establishing-scout-units-in-all-private-govt-educational-institutions/",
  "date_published": "2024-07-14T12:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP):Federal Secretary of Ministry of Federal Education and Professional Training Mohyuddin Ahmad Wani on Sunday called for establishing scout units in all private and government educational institutions to make children good citizens.\n“There is no better forum for training the new generation than scouting around the world” he added.\nMuhyiddin Ahmad Wani while addressing the opening ceremony of the one-day commissioner forum organized by Islamabad Boys Scout Association (IBSA) said that children should be made good citizens by establishing scout units in all private and public educational institutions.\nHe said that ending of exams up to fifth grade in the federal capital was to bring out the children from the fear of exams and “Ratta” system and teach them the life skills that will make them useful and useful in the society.\nHe was of the view that after adopting this, the students can become useful and useful citizens of the society.\nHe also gave instructions to join all the senior scouts in the federal capital who are now responsible for different sectors.\nIBSA Provincial Commissioner Tariq Aleem Gul presented his welcome speech and presented the four-year report in which scouts mentioned camping, hiking, emergency response, tree plantation, first aid and self-defense training, hospital service, traffic control and other activities.\nTariq Aleem Gul emphasized that now all these activities will be done by forming scout units in every educational institution.\nThe chief guest Muhyiddin Ahmad Wani inaugurated the plantation drive at the IBSA headquarters and also visited the campus planted by around 200 Boy and Girl Scouts.\nFormer National Secretary and Senior Scout Qazi Zahoorul Hasan presented the painting made by his hand to the Chief Guest.\nSenior Assistant Provincial Commissioner Najamuddin Qureshi, Provincial Secretary Muhammad Younis Bajwa, Divisional Commissioner and Central President Private Schools Network Dr. Muhammad Afzal Babar, Director Federal College of Education Dr. Samia were present in the conference.  Rehman Dogar, Co-ordinating Commissioner Forum Zahid Mehboob, Abdul Sattargil, all district commissioners and other scouts leaders also participated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:54:24.116Z"
}
