{
  "title": "Information Minister vows to revive PTV’s lost glory",
  "link": "https://www.app.com.pk/national/information-minister-vows-to-revive-ptvs-lost-glory/",
  "date_published": "2024-11-01T18:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): Federal Minister for Information, Broadcasting, National Heritage Attaullah Tarar on Friday expressed his resolve to restore the lost legacy of the Pakistan Television (PTV) by revitalizing its workforce, operations and reputation.\nThe minister, in an exclusive interview with the national broadcaster, highlighted the persistence of corruption within PTV, where, according to him, some employees have been drawing salaries for decades without fulfilling their duties.\n“There are mafias in PTV for over 30 years, with people being paid while staying at home,” he said, while pledging “zero tolerance against corruption”.\nTarar said he would not bow to any pressure and would continue his mission to carry out the reform agenda that included recruitment of highly qualified professionals across all departments, especially anchorpersons, IT specialists, and engineers.\nThe minister said he had a mission to transform the PTV that only reflects excellence and integrity.\nA significant step in this direction has already been taken, with a fresh look and new anchors introduced to the channel, he said, adding the deserving people who are working with the national broadcaster professionally would be given opportunities.\nHe also expressed his commitment to address issues faced by pensioners, who have reportedly struggled with irregular payments.\nThe minister said he faced malicious campaigns in the media to deter him from taking these much-needed reforms.\nHowever, he affirmed that his mission to revive the glory of PTV would continue uninterruptedly.\n“I want people to feel pride in PTV,” he said, expressing his intention to giving space to the opposition on the national TV where they would be allowed to do constructive criticism against the government.\nHowever, nobody will be allowed to cross the red line,” he noted.\nWith financial reforms underway, particularly within the finance department, the minister has emphasized that every aspect of PTV’s operations would be scrutinized. Unnecessary expenditures and inflated salaries, especially in cases with little or no performance, would be curbed.\n“This is my mission to revive the legacy of PTV, and if I am unable to achieve it, I will consider myself a failure,” he remarked, reiterating his dedication to establishing a corruption-free, people-centric, and high-standard national institution.",
  "retrievedAt": "2025-08-10T14:55:24.728Z"
}
