{
  "title": "43 NUST researchers ranked among world’s top 2% scientists",
  "link": "https://www.app.com.pk/national/43-nust-researchers-ranked-among-worlds-top-2-scientists/",
  "date_published": "2024-11-01T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP): In a significant achievement, 43 researchers from Pakistan’s National University of Sciences & Technology (NUST) have earned spots among the world’s top 2% of scientists, according to a 2024 report by Stanford University and Elsevier.\nThis marks a growing international recognition for NUST’s research contributions, spanning fields like artificial intelligence, engineering, and cyber security.\nThe prestigious ranking, which places NUST researchers among 100,000 top scientists worldwide, reflects the university’s steady climb in global research standings.\nCurrently ranked 353rd globally and 64th in Asia by the QS University Rankings, NUST has distinguished itself as a leading institution in Pakistan’s higher education sector. This achievement is also part of a positive trend: NUST’s representation among the world’s top 2% scientists has steadily increased, with 9 researchers making the list in 2021, followed by 23 in 2022 and 31 in 2023.\nThe data for the ranking is compiled by Stanford University and published by Elsevier, using a composite index that considers a range of bibliometric factors. These include citation counts, the Hirsch index (a measure of an individual scientist’s productivity and impact), and citations across various authorship positions.\nThe 43 NUST scientists who achieved this rank come from a wide array of fields. Their areas of expertise cover disciplines like artificial intelligence, materials science, biomedical research, mechanical and civil engineering, nanotechnology, physics, cyber security, computer science, humanities, mathematics, and fluid mechanics.\nA significant 23 of these scientists have appeared consistently in the top 2% category over the years. The recognition highlights NUST’s supportive environment for research, enabling its faculty to contribute significantly across diverse and evolving scientific fields.\nThe researchers are Dr Muhammad Shahid, Dr Noreen Sher Akbar, Dr Meraj Mustafa Hashmi, Dr Iftikhar Ahmad, Dr Rizwan Ul Haq, Dr Irfan Ahmad Rana, Dr Syed Shoaib Ahmad Shah, Dr Asim Shahzad, Dr Mubasher Jamil, Dr Faisal Shafait, Dr Shahzad Adeeb, Dr Tayyaba Noor, Dr Muhammad Usman Akram, Dr Safia Akram, Dr Hassan Elahi, Dr Asif Hussain Khoja, Dr Furqan Farooq, Dr Hassan Ali Khattak, Dr Muhammad Bilal Khan Niazi, Dr Naim Rashid, Dr Iftikhar Hussain Gul, Dr Adeel Waqas, Dr Muhammad Khursheed,  Dr Zaib Jahan, Dr Nisar Ahmed, Dr Wajid Mumtaz, Dr Muhammad Taqi Mehran, Dr Shahid Ali Khan, Dr Ghulam Ali, Dr Syed Ali Hassan, Dr Haider Abbas, Dr Muhammad Yasin, Dr Mudassir Iqbal, Dr Arshad Khan, Dr Tahir Mehmood, Dr Syed Rizwan Hussain, Dr Javaria Akram, Dr Muhammad Umar Khan, Dr Asad Waqar Malik, Dr Uferah Shafi, Dr Imran Makhdoom, Dr Imran Akhtar, and Dr Imran Mir.\nThis accomplishment reflects NUST’s growing impact in advancing research and education in Pakistan. Through ongoing efforts, NUST continues to support researchers and students, providing a foundation for further advancements and recognition in the global academic community.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:55:46.372Z"
}
