{
  "title": "Qatar’s $3bln investment to have significant impact on Pakistan economy: Tarar",
  "link": "https://www.app.com.pk/national/qatars-3bln-investment-to-have-significant-impact-on-pakistan-economy-tarar-2/",
  "date_published": "2024-11-01T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP):Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Friday said Qatar would make an investment of $3 billion in diverse sectors which would have a significant impact on the national economy and ultimately benefit the masses.\nA delegation from Qatar would soon visit Pakistan to materialize the investment pledge, said the minister while addressing a news conference which mainly highlighted the substantive economic gains, achieved by Pakistan with the recent visit of Prime Minister Shehbaz Sharif to Saudi Arabia and Qatar.\nHe congratulated the whole nation on the foreign policy and economic achievements made by Pakistan under the leadership of Prime Minister of Shehbaz Sharif who charted the country on path of economic progress.\nThe minister recalled signing of 27 Memoranda of Understanding (MoUs), amounting to $2.2 billion investment, during the successful visit of a high-level Saudi delegation, led by Minister for Investment Sheikh Khalid Bin Abdul Aziz Al Faleh, a few weeks ago which included fruitful government-to-government and business-to-business meetings.\n“In a follow-up of that visit, the prime minister has had very productive meetings in Saudi Arabia that also included his meeting with Saudi Crown Prince Mohammed bin Salman on the sidelines of the eighth session of the Future Investment Initiative (FII) in Riyadh,” Tarar noted.\nHe said during the meeting, both sides reiterated to further strengthen the bilateral relations and enhance trade and investment in Pakistan.\nBoth countries have longstanding people-to-people relations which spanned over decades, he said lauding the hospitality extended by Saudi Arabia to the pilgrims from Pakistan during Umrah and Hajj.\nHe said the prime minister had thanked Saudi Arabia for hosting Pakistanis for Hajj and its crucial role for Pakistan’s deal with the International Monetary Fund (IMF).\nDuring the recent visit of the prime minister, he said, delegation level talks were also held between both the sides that led to increase in the number of MoUs from 27 to 34, while volume of investment has also been enhanced to $2.8 billion.\nThe minister said an additional investment of $600 million would have a positive impact on the economy, and “we believe this is a major step towards attracting the foreign investment in mining, energy, agriculture, livestock, IT and Human Resource Development sectors of the economy.”\nHe said the prime minister also spoke about the issue of Palestine at the conference in Riyadh, and condemned the oppression of unarmed Palestinians by Israel. PM Shehbaz Sharif had underlined the need for peace in Palestine\nThe prime minister has been fighting for the Palestinian cause at international level which is being acknowledged domestically and globally, the minister noted.\nAs regards the visit of the prime minister and his delegation to Qatar, he said this has great importance for the bilateral relations of the two countries which was reflected by the joint statement issued upon conclusion of the visit.\nHe said Qatar had hosted an art exhibition celebrating Pakistani artwork, putting up the masterpieces of Pakistani art on display from 1947 to the present. The exhibition featured renowned Pakistani artists and painters, including the acclaimed architect Nayar Ali Dada.\nThe prime minister, he said, had expressed his gratitude for Amir of Qatar Sheikh Tamim Bin Hamad Al-Thani and his sister Sheikha Al-Mayassa bint Hamad bin Khalifa al-Thani for organizing such an exhibition in the honor of Pakistan.\nThe relationship between Prime Minister Shehbaz Sharif and the Emir of Qatar was further emphasized by the warm reception he received during his visit.\nTo a query, the minister said Pakistan’s economy is on the path to stabilization, adding inflation has come down to 6.9 per cent.\nThe country had received record remittances, while the Interest rate have also been reduced with the investment was pouring in.\nPakistan had achieved fiscal surplus after 24 years, he noted.\nOn a question, hesaid Khyber Pakhtunkhwa had a non-serious government, pointing out their misadventures of the past, and asked about their performance in health, infrastructure and other sectors.\nHe said the KP government had not taken any public service initiatives, for which the public would soon hold them accountable.\nTo another query, he said meetings were held under the National Action Plan recently as the prime minister has been paying serious attention on the initiatives required to curb terrorism in the country.\nOn the other hand, the PTI government had brought back the Taliban in the country and now its government in KP was not paying any attention to law and order.\nKhyber Pakhtunkhwa Chief Minister was not qualified to run the provincial affairs, he stressed.\n“Eradication of terrorism is the responsibility of the government and we are committed to eradicating terrorism,” he remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:56:21.972Z"
}
