{
  "title": "Events like Freej Art and Design Festival help bring nations closer: Tarar",
  "link": "https://www.app.com.pk/national/events-like-freej-art-and-design-festival-help-bring-nations-closer-tarar/",
  "date_published": "2024-11-01T06:33:00.000Z",
  "source": "APP",
  "content": "DOHA, Qatar, Nov 01 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar said on Friday that Pakistan and Qatar enjoyed historical, cultural, and religious bonds and cultural cooperation between the two countries had increased significantly.\nThis he said during his participation in the Freej Art and Design Festival on the special invitation of Qatar’s Minister of Culture Abdulrahman bin Hamad Al-Thani.\nAttaullah Tarar congratulated Qatar’s Ministry of Culture and Minister of Culture Abdulrahman bin Hamad Al-Thani for making the best arrangements for the festival.\nThe urge and dedication to preserve and promote Qatar’s cultural heritage was an honour, he said adding events like Freej Art and Design Festival were an expression of the importance of cultural exchanges.\n“Strengthening cultural ties with is the vision of Pakistan Prime Minister Shehbaz Sharif,” Attaullah Tarar remarked.\nHe opined that such events help bring nations closer to each other, increase mutual respect, and share a common heritage.\nThe minister appreciated the valuable role of Freej Art Festival in presenting traditional and modern Qatari art to the world art scene.\nHe said that Pakistan’s Ministry of Culture and National Heritage will support initiatives such as the promotion of cultural cooperation and in future friendship and cultural exchanges between Pakistan and Qatar will deepen.\nOn the occasion of the festival, Tarar also met with the Minister of Culture of Tajikistan Matlubakhon Sattoriyen, and the Minister of Culture of Iraq, Dr. Ahmad Al-Fakkak Al-Badrani.\nIt should be noted that Pakistan and Qatar recently signed an agreement to promote cooperation in the field of culture.\nUnder this agreement, 132 works of art have been sent to Qatar to be exhibited in Qatar Museum under the name of ” Manzar: Art and Architecture of Pakistan from 1940 till date”.\nShowcasing Qatar’s diverse contemporary arts, the Freej Art Festival, will run to November 6.\nIn this festival, artists from all over the world were invited to participate in workshops and seminars.",
  "retrievedAt": "2025-08-10T14:58:01.229Z"
}
