{
  "title": "Acting president for adopting international best practices to improve governance",
  "link": "https://www.app.com.pk/national/acting-president-for-adopting-international-best-practices-to-improve-governance/",
  "date_published": "2024-11-01T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): Acting President Syed Yousuf Raza Gilani on Friday called for adopting international best practices, focusing on innovation, and using the latest technology to improve governance in Pakistan.\nHe expressed these views while talking to the participants of the 36th Senior Management Course of the National Institute of Public Administration, Karachi, who called on him, at Aiwan-e-Sadr, here.\nThe acting president underscored the need for embracing digital governance, data-driven decision-making, and using artificial intelligence to improve service delivery.\nAddressing the participants, he highlighted that Pakistan faced multiple challenges, including economic issues, high inflation, rising population, unemployment, climate change, and social injustice.\nHe said that bureaucracy needed to play a proactive and constructive role to help address various challenges faced by the country.\nHe emphasised the need to position Pakistan internationally as a competitive and forward-thinking nation, while also ensuring that every citizen benefitted from the fruits of our policies.\nSyed Yousuf Raza Gilani said that bureaucracy should build strong networks, both within the government and with external stakeholders, to find sustainable solutions to Pakistan’s socio-economic problems.\nHe stated that civil servants were required to be the problem solvers, innovators, and leaders who could help the governments steer the country out of its present socio-economic and governance challenges.\nThe acting president advised the bureaucrats to adopt a service-oriented attitude, adding that government service required empathy, humility, and a genuine desire to improve the lives of others.\nHe said that the world was constantly evolving, and civil servants needed to evolve with it.\nHe said that civil servants should seek out knowledge, equip themselves with the latest skills and tools, stay informed about global trends and developments, and continue refining their skills.\n“You must adopt ethical governance and treat the public humanely”, he added.\nReplying to a question, the acting president said that provinces had been given more rights and funds after the 18th Amendment and the NFC Award.\nAsked about the 26th Constitutional Amendment, he said that it was the prerogative of the Parliament to amend the Constitution keeping in view the best interest of the country. He added that it was not appropriate for any other country to comment upon and interfere in our internal matters.\nTalking about terrorist incidents in Balochistan, Acting President Gilani said that anti-Pakistan elements were against the development and prosperity of the province and were making deliberate efforts to discourage investors from investing in Pakistan.\nHe further stated that Balochistan was an important province and during his tenure as the Prime Minister of Pakistan, he initiated the Aaghaz-e-Huqooq-e-Balochistan and ensured its implementation in the province.\nHe added that Balochistan was given more funds and royalties during his tenure.",
  "retrievedAt": "2025-08-10T14:56:36.890Z"
}
