{
  "title": "Snowfall, avalanches wreak havoc on Astore - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Thousands of people are stranded in the upper areas of Astore, as most parts of the district remained disconnected from other areas of Gilgit-Baltistan after heavy snowfall and avalanches blocked roads and damaged a bridge.\n\nAstore has received plenty of snow in recent days, with some areas such as Burzil Top, Chillum Daskhiram, Mirmalik and other localities receiving up to six inches of snow.\n\nLocals said many areas in Astore are without power supply and phone communication, while connecting roads were also inaccessible, leaving the population without medicine, groceries and access to hospital even in cases of emergency.\n\nAccording to officials, Manimarg, Gultari, Trishang, Shankargarh areas of Astore district have been cut off for past several days.\n\nResidents struggle to access medical care, basic necessities\n\nA resident, Aqil Hussain Baqiri, told Dawn that the land connection of Dasakhrim-Chillum had been completely cut off for past many days. “People are confined to their homes,” he said.\n\nAn avalanche that recently hit Mirmalik Batwash village, near Shuntar Pass, destroyed not only a major portion of their house but also a connecting bridge. Although the residents survived, their house and lifetime savings were destroyed.\n\nAt the start of Ramazan, the resident added, there was a severe food crisis in the area.\n\nAs medical facilities and staff were not available at government health units, many patients, including elderly people, pregnant women and children, face difficulties to get emergency medical care, the locals said. In absence of doctors at the Chillum Government Hospital and severe shortage of medicines, people were compelled to carry patients on their shoulders and sometimes travel to the military camp or the district headquarters.\n\nThey demanded immediately start of medical camps, evacuations by helicopter and snow-clearing operations on an emergency basis. In the long term, it is crucial to build sustainable roads, permanent hospitals, and infrastructure to ensure access to basic human rights for the people of Astore.\n\n“People are facing shortage of medical facilities and food. Locals carried a patient on their shoulders and walked up to 10 kilometres for emergency medical treatment,” a resident said.\n\nBoband village, which is 45km from the district headquarters also remained disconnected for several days.\n\nA video showing locals carrying a patient on their shoulders to the district headquarters hospital also went viral on social media.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c4cf9fd6365.jpg",
  "retrievedAt": "2025-08-25T14:55:53.881Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895453/snowfall-avalanches-wreak-havoc-on-astore",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:05:10.000Z"
}
