{
  "title": "Industry in jeopardy as importers bypass anti-dumping tariffs - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: In spite of a robust legal anti-dumping framework to protect the domestic manufacturers from an unfair competition from outside and consequent harmful effects of cheaper imports at below the fair market value, the importers continue to bypass anti-dumping tariffs with the help of liberal court interventions and lax interpretation of the provisions of the Anti-Dumping Duties Act, 2015 by the customs authorities.\n\nEffective enforcement of anti-dumping tariffs or duties in Pakistan faces significant hurdles despite a strong framework established by the National Tariff Commission (NTC), jeopardising domestic industries and causing substantial revenue losses to the exchequer, industry sources argue.\n\nAn anti-dumping duty is a tariff that a government imposes on foreign imports to shield domestic industries from unfair competition posed by foreign producers selling goods at below fair market value prices. Dumping is a process wherein a company exports a product at a price that is significantly lower than the rate it normally charges in its home or its domestic market.\n\nIn recent years, the National Tariff Commission (NTC), entrusted with the responsibility of investigating dumping allegations and imposing duties to counteract such practices, has been pivotal in fostering a fair-trade environment to ensure viability of and a level playing field for local industries such as paper and board, chemicals, textiles, and steel.\n\nIndustry sources maintain that importers mostly exploit legal loopholes to bypass anti-dumping tariffs by obtaining stay orders from courts. Besides, they say, the Finance Act 2020 led to amendments to the Anti-Dumping Duties Act, 2015, to allow provisional release of goods, subject to such duties against a bank guarantee or pay order along with an indemnity bond equal to the duty amount, but the goods are released by the customs on simple undertakings.\n\nAnother prevalent issue is the circumvention of anti-dumping duty with intentional misdeclaration or modification of imported goods.\n\n“Importers falsely categorize products to evade applicable duties, making it challenging for authorities to accurately assess and impose correct tariffs. Such practices have often led to the deliberate overlooking of dumping activities, allowing violators to operate with impunity,” an industry source said.\n\n“Although precise figures are difficult to ascertain, full compliance and collection of anti-dumping duties could significantly bolster Pakistan’s tax revenues.”\n\nHe cited the example of Indonesia for effectively employing anti-dumping measures to safeguard its domestic industries.\n\n“The Indonesian Anti-Dumping Committee (KADI), established in 1996, has been proactive in investigating unfair trade practices and implementing remedial actions. As of 2010, KADI had investigated 38 cases of dumping, resulting in the imposition of anti-dumping duties on 16 commodities originating from countries such as China, Russia, India, Thailand, and Taiwan.\n\n“These duties ranged from 0pc to 153pc effectively deterring unfair competition and supporting local industries. In recent years, KADI has intensified its efforts; for instance, in December 2024, it initiated an anti-dumping investigation into imports of polypropylene homopolymer from eight countries, including Saudi Arabia, China, and Thailand.”\n\nBrazil also stands out for effective implementation of anti-dumping measures on a range of products, particularly in sectors like steel and aluminum, to protect local industries from underpriced foreign competition. In 2018, Brazil’s enforcement actions on dumped steel imports not only helped stabilize the domestic market but also generated estimated additional revenue of around $500 million.\n\n“The success of Indonesia and Brazil underscores that robust policy frameworks and strict enforcement anti-dumping measures can yield significant economic dividends. These examples are instructive for Pakistan, highlighting that the effectiveness of policies hinges on diligent execution and the elimination of legal and other loopholes,” the source concluded.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:55:39.793Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895401/industry-in-jeopardy-as-importers-bypass-anti-dumping-tariffs",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:05:56.000Z"
}
