{
  "title": "French ex-surgeon says ‘ready to admit’ to some rapes at mass abuse trial - World - DAWN.COM",
  "author": null,
  "content": "A former French surgeon on trial on charges of sexually abusing almost 300 patients, mostly children, said on Monday that he was “done with lying” and “ready to admit” to some rapes.\n\nJoel Le Scouarnec, 74, has been on trial in the western city of Vannes since last week in one of the country’s largest child sex abuse cases. He is believed to have assaulted or raped 299 patients, most while they were waking up from anaesthetic or during post-op checkups, at a dozen hospitals between 1989 and 2014.\n\nTwo hundred and fifty-six of the victims were under 15, with the youngest aged one and the oldest aged 70.\n\n“Today I feel ready to admit to some acts of rape that I have wanted to hide, deny. I’m ready to admit to them. I’m done with lying,” Le Scouarnec told the court after an investigator’s testimony about meticulous records the doctor kept of the abuse.\n\nDuring the investigation, Le Scouarnec had admitted to the rape of boys under the guise of rectal examinations, the lead investigator told the court. He had confessed to sexually assaulting girls but called his written accounts of rapes of young female patients “exaggeration” or “fantasy”.\n\nThe surgeon was never investigated during his career despite a 2005 sentence for owning sexually abusive images of children and some of his colleagues sounding the alarm over suspicious behaviour.\n\nHe continued to practice until his retirement in 2017, after which a six-year-old accused him of rape and police discovered diary accounts of abuse against his patients stored on his computers.\n\nVictims and child rights advocates say the case highlights systemic failures that allowed Le Scouarnec to repeatedly commit sexual crimes. He has been jailed since being found guilty in 2020 of abusing four children, including the six-year-old and two of his nieces.\n\nIn his notes, the doctor describes himself as a “major pervert” and a “paedophile”. Police also found around 30,000 images and videos on his hard drives.\n\nThe court today heard how in addition to sexually abusive images of children, he also owned photos and videos “of all kinds”, according to the lead investigator.\n\n“He would watch very violent images, of hangings, beheadings of human beings,” he told the court, adding that there were “acts of cruelty to animals”.\n\nLe Scouarnec sat hunched in the dock with only his balding head of white hair visible.\n\nSpeaking in court on Friday, he had confessed to also sexually abusing the 12-year-old daughter of his eldest son, who was present in court.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/0321301284bd3c5.jpg",
  "retrievedAt": "2025-08-25T14:55:23.108Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895573/french-ex-surgeon-says-ready-to-admit-to-some-rapes-at-mass-abuse-trial",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T17:30:07.000Z"
}
