{
  "title": "Challenges to export-led growth - Business - DAWN.COM",
  "author": null,
  "content": "Our economic managers frequently assert that the country needs export-driven growth. Finance Minister Muhammad Aurangzeb emphasises that this will be possible only if each export sector performs well and realises its full potential. However, achieving this in the short and medium term is a significant challenge.\n\nThe fact is that most Pakistani exporters have only recently begun to learn, through tough lessons, how a lack of competitiveness can drive them out of business. Until recently, they benefited from state patronage and were shielded by protectionist policies.\n\nHowever, under the ongoing $7 billion International Monetary Fund lending programme, the space for government support is shrinking, and protectionist measures, particularly in the import regime, are being lifted. This raises a critical question: how will each export sector maximise its performance and unlock its full potential in this evolving landscape?\n\nAll traditional export sectors — including textiles, food, leather and leather products, petroleum and chemicals, engineering, and sports and surgical goods — currently require substantial capital investment in varying amounts before they can operate at their best.\n\nIf Pakistan wants to achieve export-driven economic growth, the government must gradually reduce its reliance on bank borrowings, and banks must enhance private sector lending\n\nIn 2021, Arif Habib Limited analyst Arsalan Hanif estimated that an investment of $5bn in the textile sector would increase textile exports to $25bn by 2025. Unfortunately, textile exports do not look like they are heading towards $25bn any time soon (in seven months of this fiscal year, between July 2024 and January 2025, the textile sector earned only $10.22bn).\n\nAnother major challenge facing Pakistan’s export sector is its weak small and medium scale enterprises (SMEs). Multiple issues, including inadequate and expensive financing, high energy costs, and deficiencies in physical infrastructure and law and order weaken the linkage between SMEs and textile exporting companies. This is also true for other export sectors including food, engineering, leather and leather products and sports and surgical goods etc.\n\nIn seven months of this fiscal year, our imports from China consumed $8.907bn whereas exports earned $1.487bn\n\nAddressing these problems and better integrating SMEs into the export supply chain require extensive policy refinements and stricter implementation of necessary measures. Achieving this will demand the unwavering dedication and focus of all stakeholders, including banks, SMEs, export industries, and regulators.\n\nBanks in Pakistan have long been helping successive governments finance fiscal deficits through bank borrowings. This naturally crowds out the private sector and leaves banks with little appetite to earn interest income from private sector lending.\n\nHowever, instead of accepting this fact, repeatedly pointed out by the SBP, they often cite low demand as the primary reason for weak private sector lending. If Pakistan wants to achieve export-driven economic growth, the government must gradually reduce its reliance on bank borrowings, and banks must enhance private sector lending.\n\nUnfortunately, the current hybrid regime has neither been able to drastically reduce administrative expenses nor has the ongoing privatisation programme gained momentum. Meanwhile, the cumulative losses of state-owned enterprises (SOEs) continue to mount.\n\nAccording to a recent report of the Ministry of Finance, aggregate losses of SOEs totalled Rs851bn in the last fiscal year ended in June 2024. This amount, mind you, is equal to about 63pc of what the Federal Board of Revenue collected in income tax from Karachi (Rs1.36 trillion) in 2023-24.\n\nFor export-driven growth, it is essential not only to boost overall merchandise exports but also to capitalise on regional export opportunities and increase the share of regional exports in total exports. China, Afghanistan, and Bangladesh are three regional markets where Pakistan can significantly expand its exports.\n\nHowever, a major challenge with China is the persistent bilateral trade deficit. Pakistan spends roughly five times more foreign exchange on Chinese imports than it earns from exports to Chinese markets. In seven months of this fiscal year, our imports from China consumed $8.907bn whereas exports earned $1.487bn. China, being the world’s second-largest economy, has more to sell to Pakistan than Pakistan can sell to it. Additionally, a substantial portion of imports from China is linked to China-Pakistan Economic Corridor related projects.\n\nNonetheless, this should not deter Pakistan from making more concerted efforts to enhance its merchandise exports to China while simultaneously developing local industries to produce domestic products that can replace at least some imported Chinese goods.\n\nIt is encouraging that Pakistan has recently intensified efforts to boost exports to Bangladesh, including through government-to-government arrangements and as the two countries are deepening their political ties, one can hope to see our exports to Bangladesh growing steadily in the coming months and years.\n\nMeanwhile, exports to Afghanistan have also been rising rapidly during this fiscal year. And that, too, is an encouraging development. But to sustain this momentum, it is crucial for Islamabad to resolve bilateral security issues with Kabul amicably, keeping the doors of trade diplomacy open all the while.\n\nPakistan’s food exports ($4.163bn in seven months of this fiscal year) have been the second-largest export sector after textiles. Sustaining the recent growth rate of over eight per cent in food exports without letting food inflation spike is critical.\n\nModernising the agriculture sector with China’s support and initiating large-scale corporate farming and livestock development with foreign investment from Saudi Arabia and the United Arab Emirates could help create better export surpluses of food grains and meat.\n\nHowever, what Pakistan needs most is the production of high-end, value-added food products to boost export revenues without risking a shortage of staple food items in the domestic market. Achieving this goal requires massive investment across all segments of agriculture, from major and minor crops to livestock, dairy, fisheries, and poultry.\n\nPublished in Dawn, The Business and Finance Weekly, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:44:48.821Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895318/challenges-to-export-led-growth",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:04:48.000Z"
}
