{
  "title": "Indian cricket board backs captain Rohit Sharma after opposition Congress member calls him fat - Sport - DAWN.COM",
  "author": null,
  "content": "India’s cricket board defended its World Cup-winning captain Rohit Sharma on Monday after comments about his lack of fitness from a spokesperson for the Congress, the country’s main opposition party.\n\nSharma, who turns 38 next month, is leading the Indian cricket team in the Champions Trophy but was criticised for his weight by Shama Mohamed, a spokesperson for the Congress, who said he was “fat for a sportsperson”.\n\n“Need to lose weight, and of course the most unimpressive captain India has ever had!” Mohamed said in a now-deleted post on X late on Sunday.\n\nThe Congress said her post did not reflect the party’s position and that Mohamed had been asked to delete the post.\n\nSharma also found support from Prime Minister Narendra Modi’s ruling Bharatiya Janata Party, as well as the Board of Control for Cricket in India (BCCI), which said such comments could have an adverse effect on the team.\n\n“It is very unfortunate that these derogatory, demoralising comments are being made when the team is in the crucial stage of a global tournament,” BCCI secretary Devajit Saikia told Reuters on a phone call when asked for a reaction to Mohamed’s comments.\n\nIndia are unbeaten in this year’s Champions Trophy and are set to face Australia in the semi-finals on Tuesday.\n\nIndia’s Sports Minister Mansukh Mandaviya said in a post on X: “Such comments undermine the hard work and sacrifices that our sportspersons make to represent the country on the global stage.”\n\nReuters could not immediately reach Sharma or his spokesperson for comment.\n\nMohamed defended her remarks, saying her post was a generic comment on the fitness of a sportsperson and did not amount to body-shaming. “\n\nI felt he is overweight and tweeted about it. I have been attacked for no reason,“ she told news agency ANI, in which Reuters has a minority stake.\n\nSharma retired from Twenty20 international cricket minutes after leading the team to their World Cup triumph last year.\n\nCricketers in India enjoy demi-god status, earning millions in endorsements and propelling a multibillion-dollar media and sports industry.\n\nAfter the T20 World Cup last year, Sharma and the rest of the team were feted by millions of cricket-crazy Indian fans, who thronged the streets of Mumbai as the team paraded the trophy in an open-topped bus.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/031937097c24a8b.jpg",
  "retrievedAt": "2025-08-25T14:55:23.165Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895563/indian-cricket-board-backs-captain-rohit-sharma-after-opposition-congress-member-calls-him-fat",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T15:44:49.000Z"
}
