{
  "title": "Regulating global Sukuk - Business - DAWN.COM",
  "author": null,
  "content": "The global Islamic finance industry, valued at over $5 trillion, is expected to reach $7.5tr by 2028 and has established itself as a viable alternative to conventional finance. According to the latest London Stock Exchange Group report, there are over 1,980 financial institutions offering Islamic financial services, and 57 countries have at least one regulation or law to support Islamic finance.\n\nSukuk, often dubbed the “crown jewel” of Islamic capital markets with a market value north of $900 billion, are Shariah-compliant alternatives to conventional bonds that do not represent a loan but often represent an ownership share in an asset or a business activity.\n\nSukuk has catalysed infrastructure development, sovereign financing, and ethical investment since its inception. The global Sukuk markets are witnessing a variety of offerings, from sovereign Sukuk to corporate, and now green Sukuk has evolved greatly, with Malaysia, Indonesia and Saudi Arabia leading the global front. On the local front, Pakistan has emerged as a regular issuer of domestic sovereign Sukuk.\n\nSukuk are innovative investment tools that should be classified as a new type of capital market instrument, other than pure debt or pure equity, due to their trade-based, rental, or profit & loss-sharing nature. However, despite major differences in the nature of sukuk, in many international markets, Sukuk is still viewed as a debt instrument by rating agencies and legal firms when compared to a typical bond that represents a debt obligation.\n\nAAOIFI’s new Shariah standard is considered a welcome step at improving investor confidence, compliance, and transparency\n\nThis lack of clarity and understanding often creates confusion among Shariah-compliant investors and other stakeholders. Due to the tendency to consider the Sukuk as a debt instrument, some lawyers prefer to include conditions or undertakings that will bring the Sukuk closer to a fixed obligation instrument, making it easy for rating agencies to rate a Sukuk on the same line as they rate a typical bond.\n\nThe global standards-setting body for Islamic financial institutions, the Accounting and Auditing Organisation for Islamic Financial Institutions (AAOIFI) based in Bahrain, is trying to guide and regulate the market by issuing guidelines and clarifications after due research, industry consultation, and expert guidance from scholars.\n\nThe standard-setting body issued the first Shariah standard on Sukuk in May 2003 to assist the industry and investors with Sukuk issuance. This standard has facilitated the issuance of Sukuk in many jurisdictions while ensuring Shariah compliance with the Sukuk.\n\nHowever, with the market growth and regular issuance of sovereign sukuk in global markets, some structural ambiguities and debates over Shariah compliance and transparency have emerged, particularly between asset-backed and asset-based Sukuk, asset ownership rights of the Sukuk holders and its legal title, disclosure in terms sheets and regular monitoring and audit.\n\nAgainst this backdrop, the AAOIFI has unveiled its new Shariah Standard draft to provide a comprehensive framework aiming to redefine Sukuk governance, transparency, and Shariah compliance.\n\nThe standard has created a discussion in the industry, with many experts, bankers, investors, and Shariah scholars appreciating the need for efforts to focus on reforms and improvement, while some circles are critically viewing the enhanced compliance, focus on transparency and clear ownership title as a potential impediment for the growth of the market and fear an initial slowdown due to potential tax implications and changes required in the regulatory or legal framework.\n\nOn the local front, we found Pakistan’s sovereign Sukuk programme already embodies many of the new Shariah standard core principles; however, the global markets are reviewing and debating the standard’s merits, challenges, and transformative potential.\n\nWe have a chance to reinforce the ethical core of Islamic finance, strengthen the integrity of Sukuk, and develop a market that is both expansive and genuinely aligned with Islamic principles. This is a crucial progression — a decisive move toward a more authentic and sustainable future for Islamic finance.\n\nSalient features of the new Sukuk standard can be summarised as follows: Firstly, the standard provides guidelines for the issuance of different types of Sukuk, basic conditions for each underlying mode for Sukuk, and guidelines on preparing legal documentation and agreements for Sukuk in line with Shariah rules.\n\nSecondly, the new standard requires that to be tradable, a Sukuk should represent undivided ownership of identifiable assets, with a significant percentage of the Sukuk’s value linked to physical assets, and it focuses on asset ownership for the Sukuk investors. This clause is aimed at providing clarity about asset ownership to investors while also ensuring that the investors have a claim on the asset, not just cash flows and that they share the asset risk as well.\n\nThirdly, the new standard requires the transfer of the legal title to Sukuk SPV, eliminating ambiguities in asset custody and ownership. Trustees must hold and manage assets exclusively for investors’ benefit. According to some critics, this requirement of the transfer of legal title as a necessary condition may create hurdles in some markets for Sukuk issuance due to tax complexities and land ownership restrictions for foreign nationals.\n\nHowever, some scholars believe that this is a general guideline and there are provisions that allow holding asset ownership under a trust arrangement in case of taxation issues or other legal hurdles.\n\nFourthly, another important guideline is to prohibit guaranteed returns or undertaking to purchase at a fixed price when Sukuk are based on Islamic finance modes of partnership or profit-and-loss-sharing ethos. This guideline represents a basic rule of Islamic commercial law that prohibits a fixed or guaranteed return in a business partnership and is already considered a basic requirement for Shariah-compliant instruments. However, certain segments in the global markets find this clause restrictive, as they were incorrectly using the guarantees and undertaking to ensure fixed returns and no loss in partnership or equity-based Sukuk.\n\nBased on a fair assessment of the new effort by the AAOIFI to introduce the Shariah standard of Sukuk, it is considered a welcome step aimed at improving investor confidence, Shariah compliance, and transparency.\n\nMoreover, the standard is still under discussion, and the draft is to be deliberated by various experts around the globe. It is expected that the final standard will incorporate the practical challenges, title transfer, and tax-related issues based on market demand and will become a catalyst for the growth of the Sukuk market on sound principles.\n\nAhmed Ali Siddiqui is the Founding Director of IBA CEIF and Jawad Tahsin is the Senior Vice President of Meezan Bank Limited\n\nPublished in Dawn, The Business and Finance Weekly, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:44:45.393Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895477/regulating-global-sukuk",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:04:47.000Z"
}
