{
  "title": "Akhtar Mengal questions credibility of election process - Pakistan - DAWN.COM",
  "author": null,
  "content": "• BNP chief says neither politics nor democracy is intact\n• Claims CPEC has only resulted in ‘corruption, exploitation’\n\nKHUZDAR: Balochistan National Party (BNP) chief Sardar Akhtar Jan Mengal has questioned the credibility of the election process, saying candidates won’t win the contest without “backing from powerful quarters”.\n\nMr Mengal, who is also member of the National Assembly, touched on various issues during a media talk at his Mengal Kot Wadh residence on Saturday.\n\n“Neither politics nor democracy is intact in the country,” he claimed.\n\n“The electoral process is merely a political ploy where candidates will not be elected through a democratic process but rather with the backing of powerful forces.”\n\nAssailing the current state of politics, Mr Mengal regretted that businessmen and traders are using politics as a tool to protect their wealth and business interests rather than for national development.\n\nThe veteran politician also strongly criticised the Balochistan government, accusing the authorities of failing to take any substantial steps to resolve the pressing issues of the province.\n\nAll political parties in the province unite for political gains but lack seriousness when it comes to problem-solving, he said, adding that successive governments had only worked to sustain their rule rather than addressing Balochistan’s challenges.\n\nHe recalled past political alliances such as MRD, ARD, etc, arguing that such alliances were temporary arrangements to achieve political goals.\n\n“Once these goals were achieved, major stakeholders abandoned their commitments, leaving Balochistan’s problems unresolved,” he pointed out.\n\nRights violation\n\nMr Mengal said Balochistan was facing a “complex set of interrelated problems”.\n\n“Initially, Balochistan’s people demanded development, basic facilities, and constitutional rights. Now, these demands have expanded to include concerns about unconstitutional actions and fundamental rights violations,” the BNP chief added.\n\nHe condemned the sacking of journalists who attempt to highlight Balochistan’s issues.\n\n“If a journalist or TV anchor tries to expose the province’s challenges, they are either targeted, forcibly disappeared, or face fabricated cases,” Mr Mengal claimed.\n\nHe criticised the authorities for ignoring the deteriorating situation despite being fully aware of the severity of the crisis.\n\nReferring to the China-Pakistan Economic Corridor, he asserted that the project has not benefited Balochistan as promised.\n\n“While other provinces are seeing the development of motorways, underground trains, and power projects, CPEC in Balochistan has only resulted in corruption and exploitation,” the BNP chief alleged.\n\nHe pointed out that despite Gwadar Port’s significance, its benefits have largely gone to people from other provinces, while locals continue to suffer from electricity shortages, with power being imported from Iran.\n\nMr Mengal accused the government of enforcing draconian laws to curb public freedoms.\n\n“These laws are not just affecting Balochistan but are designed to suppress people across Pakistan,” he said.\n\nHe compared the current governance style with martial law regimes of Ayub Khan, Yahya Khan, Ziaul Haq, and Pervez Musharraf.\n\nResignation as MNA\n\nMr Mengal while talking about his own politics said he had submitted his resignation as MNA.\n\n“Whether they accept it or not is their decision. I presented my resignation in front of the media and submitted it to the assembly secretary, as the speaker was not present at the time,” he explained.\n\nResponding to criticism about the procedure, he said it was his personal decision whether to bring witnesses.\n\nHe expressed disappointment with parliamentary politics, stating he had tested provincial, local, and national assemblies but found no real solutions for Balochistan’s problems.\n\n“Even in future assemblies, the chances of resolving Balochistan’s issues remain slim,” he added, noting that BNP’s national council would decide whether to continue participating in parliamentary politics or not.\n\nHe urged the youth to intensify their struggle for their rights.\n\nHe highlighted the lack of basic facilities such as healthcare, employment, education and clean drinking water in the province.\n\nHe also criticised “business-minded politicians” who, after spending money to win elections, prioritise their financial interests over public welfare.\n\n“If these investors had put their money into villages or cities, essential services like schools, healthcare centers, and water supply would have been ensured. But they prefer their profits over people’s problems,” Mr Mengal lamented.\n\nThe BNP leader reaffirmed his party’s commitment to fighting for Balochistan’s rights and stressed that only a leadership with the people’s mandate could bring real change.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:55:54.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895448/akhtar-mengal-questions-credibility-of-election-process",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:05:10.000Z"
}
