{
  "title": "Probe urged into trade unionist’s suicide on LHC premises - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: National Party has urged the chief justice of Lahore High Court to order an investigation into the death of a trade unionist from self-immolation on the premises of the court.\n\nPresident of the party’s Punjab chapter Ayub Malik said Asif Javed was an employee of a multinational company and was expelled from the job for establishing a trade union within the company.\n\n“The labour court had restored the job of the deceased and directed the company to clear his dues. The firm filed an appeal against the decision of the labour court in the high court. However, the case was pending in the high court for the last five years,” he said.\n\nMr Malik said the deceased was suffering because of financial issues and after getting another date for the hearing of the case, he took the extreme step of ending his life.\n\n“It is nothing but a matter of embarrassment and shame for the judiciary because a citizen committed suicide after failing to get justice,” he said.\n\nMr Malik said the chief justice of LHC should investigate why the case was delayed for five years. He said it was unfortunate that political parties were mum over the death of a trade unionist.\n\nAs per eyewitnesses, Asif Javed walked out of the courtroom of Justice Shujaat Ali Khan on February 25 and after reaching an open area poured petrol on his body, took out a lighter and set himself ablaze. While engulfed in flames, Asif kept shouting that he was not getting justice.\n\nA police official put out the blaze using a fire extinguisher while Rescue 1122 staff arriving there provided him medical aid before shifting him to hospital where he died on February 28.\n\nThe deceased was a union leader at a Kabirwala-based plant of a multinational food and beverage company.\n\nHe was sacked in 2015 along with some other employees, allegedly due to his union activities.\n\nThe sacked workers moved a labour court and the National Industrial Relations Commission (NIRC) which ordered their reinstatement along with the payment of their dues. However, the company challenged the NIRC’s decision in the high court where the case had been pending for the last five years.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:44:48.194Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895355/probe-urged-into-trade-unionists-suicide-on-lhc-premises",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:06:06.000Z"
}
