{
  "title": "Car drives into crowd in German city of Mannheim, killing two - World - DAWN.COM",
  "author": null,
  "content": "A car drove into a crowd in the western German city of Mannheim on Monday, killing at least two people and seriously injuring several others, overshadowing carnival celebrations in the region where police had been on alert for attacks.\n\nPolice detained the car’s driver and later said he had acted alone, with no broader threat seen for the public. The suspect is a 40-year-old German man from the neighbouring state of Rhineland-Palatinate who did not appear to be politically motivated, they said.\n\nPeople were seen lying on the ground at the scene and at least two were being resuscitated, a witness told Reuters.\n\nIt was unclear whether the driver acted deliberately or if there was any connection to Germany’s carnival celebrations, which culminated on Rose Monday with a number of parades, although not in Mannheim, which held its main event on Sunday.\n\nPolice declined to comment on the suspect’s identity, saying this was a focus of their investigation.\n\nSecurity has been a key concern in Germany following a string of violent attacks in recent weeks, including deadly car rammings in Magdeburg in December and in Munich last month, as well as a stabbing in Mannheim in May 2024.\n\nPolice were on high alert for this year’s carnival parades after social media accounts linked to the Islamic State terrorist group called for attacks on the events in Cologne and Nuremberg.\n\nGerman Interior Minister Nancy Faeser cancelled her attendance at the parade in Cologne on Monday, Germany’s biggest, due to the events in Mannheim, a spokesperson for the minister said.\n\nRose Monday, the culmination of the annual carnival season celebrated in Germany’s mainly Catholic western and southern regions, features parades of floats that often include comical or satirical references to current affairs.\n\nThis year’s carnival has included floats featuring US President Donald Trump, Russian President Vladimir Putin, tech billionaire Elon Musk and Ukrainian leader Volodymyr Zelensky.\n\nDressed in traditional jester costumes and sporting colourful makeup, thousands of partygoers danced through the streets of Cologne, Dusseldorf and other cities in western and southern Germany ahead of the fasting season of Lent.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/0318364830c40d6.jpg",
  "retrievedAt": "2025-08-25T14:55:23.148Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895558/car-drives-into-crowd-in-german-city-of-mannheim-killing-two",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T14:30:07.000Z"
}
