{
  "title": "Markram backs adaptable South Africa to find a way to win - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Aiden Markram played down the severity of a hamstring ailment that saw him leave the field in South Africa’s comfortable seven-wicket win over England on Saturday.\n\nMarkram, who was captaining the side in the absence of an ill Temba Bavuma, is a key part of the middle-order batting unit and the sight of him leaving the field in England’s batting innings will have sent flutters through the dressing-room.\n\n“I think it’s alright, it was mostly precautionary over anything else,” Markram said. “It feels okay. Hopefully over the next few days, I can get some good rest and then sort it out and be good to go from there.”\n\nSouth Africa join Australia, India and New Zealand in the semi-finals but who their opponents will be, and where they will play next, will be answered on Sunday when the latter two clash in Dubai.\n\nMarkram feels his side have a squad to play in most conditions, be it against India on the slower pitch in Dubai or New Zealand on the faster track in Lahore.\n\n“We have got a big squad with great options and ultimately just pick the best team that we think can get the job done on the day,” he said. “So whoever it might be, whatever roles each individual has, we back them as a team.”\n\nSouth Africa will go into their semi-final with confidence after brushing aside England in emphatic fashion.\n\nTowering fast bowler Marco Jansen took wickets up front in the England innings to put them on the back foot as they were bowled out for 179, the lowest completed innings total in the tournament to date.\n\n“He’s been huge for us,” Markram said. “We all know in the power play, especially in conditions like this, you need to be taking wickets up front and he sort of finds different ways of doing it in each game.\n\n“He’s been peaking at the right time for us as a team, and he’s leading the attack, along with Kagiso Rabada really well.”\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/031109482324163.jpg",
  "retrievedAt": "2025-10-12T01:43:48.015Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895426/markram-backs-adaptable-south-africa-to-find-a-way-to-win",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:05:22.000Z"
}
