{
  "title": "Karachiites’ first fast marred by gas outages - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The absence of cooking gas on the first day of Ramazan piled misery on people in the city as the Sui Southern Gas Company (SSGC) completely failed to deliver on its promises to provide uninterrupted supply during Sehri and Iftar.\n\nLike the electricity supply in the city, gas also played a hide-and-seek game with people all day in almost every locality on Sunday, driving them up the wall and forcing many to resort to restaurants and eateries for food before Iftar and Sehri.\n\nMany households woke up to find not even a bubble in their stoves to cook pre-dawn meals and were left with no option but to start fasting without Sehri, as they did not have an alternative arrangement — liquefied petroleum gas (LPG) cylinders.\n\nTaking advantage of the occasion, LPG dealers made the most of the gas crisis as people waited for hours in queues to get their cylinders refilled before Iftar and Sehri for the preparation of pre-dawn and post-dusk meals.\n\nSSGC fails to uphold gas supply promise during Sehr and Iftar\n\n“I was a fool to believe in the SSGC promises, as I didn’t make an alternative arrangement for cooking,” a disgruntled resident in Federal B Area said, adding that she had to get the meal for Sehri from a nearby tea and paratha stall.\n\nWhile complaints of low gas pressure and no gas supply continued to pour in till late in the evening, social media platforms were flooded with harsh criticism and concern over the performance of the gas utility.\n\nThe angry residents on social media said that it was highly deplorable that the SSGC misguided people by making false commitments about uninterrupted gas supply in the holy month.\n\n“We would have definitely made some alternative arrangement if the SSGC had not made such tall claims. After all, we have been doing it somehow for the whole year,” said Nasreen Imran, a resident of Kharadar.\n\nAs such, there was no gas at all in many areas, including parts of Keamari, Kharadar, Saddar, Gulberg, Allahwala Town Korangi, Malir Khokrapar, Shah Faisal Colony, parts of Gulshan-i-Iqbal and Gulistan-i-Jauhar, Nazimabad, North Nazimabad, Orangi Town, New Karachi and Gadap.\n\nIt may be noted that the SSGC had already reduced the gas supply by two and a half more hours as per its load-shedding schedule for Ramazan.\n\nWhile there is an annual 10 percent depletion in the country’s gas reserves and the winter season is over, the city hardly gets uninterrupted gas supply even during the notified timings, compelling a large number of consumers to either temporarily or permanently switch to the use of expensive LPG.\n\nIt is worth mentioning here that on Wednesday, Feb 26, the SSGC announced a new schedule for gas supply during Ramazan, saying that the gas utility would ensure gas availability for the preparation of Sehri and Iftar. It had said that gas would be available from 3:30pm to 10pm for Iftar and dinner preparations and from 3am to 9am for Sehri and breakfast preparations.\n\nHowever, the gas utility completely failed to ensure an uninterrupted supply during the notified hours in any part of the city.\n\nPeople from almost every locality of the city complained that the gas was supplied for hardly 15 to 20 minutes during Sehri and they could not prepare food in such a short time.\n\nFarhat Anees, a resident of Block 12, Gulberg, said that it was surprising that the gas was being supplied as per the load-shedding schedule before Ramazan, but it vanished on the first day of the holy month.\n\n“There was such low pressure when gas was restored to my area around 3:15pm that I could not even make tea on the low flame,” she added.\n\nMrs Nadeem, a resident of Phase-I of Defence Housing Authority, said that there was no gas in her house during Iftar and Sehri timings, as promised by the gas utility.\n\n“It would have been far more helpful if the SSGC had not assured us of uninterrupted gas supply, as we could have braved the situation like we have been doing for so long,” she said.\n\nMeanwhile, a gas company spokesman said that a meeting of top officials was held in the evening to discuss ways to improve gas supply to the city during Ramazan.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c4bcff6bb09.gif",
  "retrievedAt": "2025-08-25T14:55:40.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895412/karachiites-first-fast-marred-by-gas-outages",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:05:44.000Z"
}
