{
  "title": "Israel suspends aid as Hamas sees ‘coup’ against truce - World - DAWN.COM",
  "author": null,
  "content": "• UN chief calls for Gaza aid to be restored ‘immediately’\n• Egypt says Gaza reconstruction plan ready, will intensify efforts for phase two\n• Islamic Jihad says Israel bears responsibility for sabotaging ceasefire\n\nJERUSALEM: Israel said on Sun­day it was suspending the entry of aid into Gaza, where both Israel and Palestinian sour­ces reported Israeli military strikes as Hamas alleged a “coup” against a six-week-old truce.\n\nThe health ministry in Gaza reported at least four killed and six wounded in Israeli attacks.\n\nAs the 42-day first phase of the ceasefire drew to a close with negotiations inconclusive, Israel early on Sunday approved a truce extension it said US Middle East envoy Steve Witkoff proposed.\n\nThe extension would cover the month of Ramazan and the Jewish holiday of Passover. Hamas has repeatedly rejected an extension, instead favouring a transition to the truce deal’s second phase.\n\nAs outlined by former US president Joe Biden, the second phase would bring a permanent end to the war that began on Oct 7, 2023.\n\nThe truce’s first phase saw an increase in aid into the territory, where the war destroyed or damaged most of Gaza’s buildings, displaced almost the entire population, and triggered widespread hunger, according to the United Nations.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office said he had “decided that, from this morning, all entry of goods and supplies into the Gaza Strip will be suspended”.\n\nIt said there would be “consequences” for Hamas if it did not accept the temporary truce extension.\n\nMeanwhile, UN chief Antonio Guterres called on Sunday for Israel to end its suspension of humanitarian aid to Gaza “immediately”.\n\nA statement from the UN posted on X said, “The Secretary-General urges all parties to make every effort to prevent a return to hostilities in Gaza. He calls for humanitarian aid to flow back into Gaza immediately and for the release of all (prisoners).”\n\nA ‘forever’ truce\n\nOn a sandy street in Gaza City, Mays Abu Amer, 21, expressed hope the ceasefire can continue “for a longer period and forever as well. “Because we have so much destruction, we need a lot of time for reconstruction,” he said. Hamas said the “decision to suspend humanitarian aid is cheap blackmail, a war crime and a blatant coup against the (ceasefire) agreement”.\n\nGaza’s civil defence agency reported “artillery shelling and gunfire from Israeli tanks” east of Khan Yunis city in southern Gaza. The Israeli army said it was “unaware of any artillery shelling in this area”.\n\nThe Palestine Red Crescent, however, repor­ted one person killed in an Israeli drone strike in the area, and one more killed in another town nearby.\n\nThe military said it had conducted an air strike in northern Gaza targeting suspects it said had “planted an explosive device” near its troops.\n\nMediator Egypt, the Red Cross and the UN have all appealed for the truce to be maintained.\n\n“There is no alternative to the faithful and full implementation by all parties of what was signed last January,” Egypt’s Foreign Minister Badr Abdelatty said. He called for the European Union to exert pressure on the parties, “especially the Israeli” side.\n\nAbdelatty also said on Sunday that the Egyptian Gaza reconstruction plan, which ensures Palestinians remain in their land, is ready and will be presented to the emergency Arab summit on March 4.\n\nAsked about the second phase of the ceasefire deal, Abdelatty said Egypt will continue its intensive efforts to ensure the ceasefire is maintained and negotiations for the second phase can begin.\n\n‘Israel sabotaging ceasefire’\n\nFollowing the announcement of the aid suspension, AFP images showed trucks loaded with goods lined up on the Egyptian side of the Rafah crossing to Gaza.\n\nFar-right Israeli Finance Minister Bezalel Smotrich, whose party is crucial to keeping Netanyahu’s government in power, welcomed the decision to suspend aid.\n\nAccording to Israel, the truce extension would see half of the prisoners still in Gaza freed on the day the deal came into effect, with the rest to be released at the end if an agreement was reached on a permanent ceasefire.\n\nHamas spokesman Hazem Qassem later said Israel “bears responsibility for the consequences of its decision on the people of the Strip and the fate of its prisoners”. Its allied group, Islamic Jihad, accused Israel of “sabotaging” the ceasefire.\n\nOf the 251 prisoners taken by Hamas during its Oct 7, 2023, attack on Israel, 58 remain in Gaza, including 34 the Israeli military has confirmed are dead.\n\nThe aid suspension comes as Palestinians in Gaza, alongside much of the Muslim world, mark the second day of the holy month of Ramazan. In November, a UN-backed assessment found “a strong likelihood that famine is imminent” within northern Gaza.\n\nUS Secretary of State Marco Rubio, whose country is Israel’s top military supplier, on Saturday said he signed a declaration “to expedite” delivery of about $4 billion in military assistance to Israel.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c4d6371d568.jpg",
  "retrievedAt": "2025-10-12T01:43:53.064Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895455/israel-suspends-aid-as-hamas-sees-coup-against-truce",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:03:20.000Z"
}
