{
  "title": "Consumers complain about price hike on first day of Ramazan in Swat - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWAT/SWABI: The residents of Mingora have expressed frustration over hike in prices of essential items, with many claiming that shopkeepers, butchers, and vegetable vendors ignored the government price regulations on the first day of Ramazan.\n\nThe Swat district administration had issued an official price list ahead of Ramazan, setting the price of meat at Rs800 per kilogramme. However, customers reported finding it being sold for as much as Rs1,000 per kg, leaving many feeling cheated.\n\n“I went to buy meat this morning, and to my shock, the butcher was asking for Rs1,000 per kg,” said Shahid Khan, a local resident. “The government clearly set the price at Rs800, but there seems to be no one checking these vendors. It’s frustrating because we are already dealing with the added expenses of Ramazan.”\n\nSimilarly, the prices of vegetables have also surged, with vendors marking up their goods by Rs20 to Rs30 per kg compared to the government-recommended rates. Residents pointed out that even the most basic items like onions, tomatoes, and potatoes are being sold at inflated prices.\n\nDemand strict implementation of official price list\n\n“I came to buy potatoes, which are usually around Rs60 per kg, but today I was asked to pay Rs120,” said Ismali Khan, another customer at the local market. “It’s not just the meat; almost every vegetable is priced higher. It feels like the vendors know there is no one to stop them, so they just do as they please.”\n\nCustomers expressed concern that there was no visible enforcement from the district administration. Many claimed that despite the official price list being distributed, it was clear that no checks were being carried out to ensure vendors adhered to it.\n\n“We keep hearing about the price lists, but when it comes to actual shopping, there’s no control,” said Imran Ahmad, a father of three. “I’ve seen no officials in the market. It’s almost as if the vendors are allowed to increase prices at will, especially when they know no one is watching.”\n\nThe lack of oversight has led to growing dissatisfaction among consumers, who feel that basic essentials are becoming unaffordable, particularly in the holy month when many households are already struggling with increased costs.\n\nOn the other hand, the district administration and the city mayor have established a complaint cell in Mingora, urging residents to record their complaints if shopkeepers or vendors fail to follow the government price list.\n\nMeanwhile, despite high claims of the district administration officials before the commencement of Ramazan that traders would not be allowed to overcharge consumers, the butchers in Swabi were found flagrantly violating the government-issued price list on the first day of the fasting month on Sunday.\n\nThe price list showed that the beef would be sold at Rs800 per kg, but butchers charged Rs1,000 per kg.\n\nA butcher told Dawn that they never charged consumers according to the district administration’s price list because the prices of essential commodities were skyrocketing and without overcharging consumers it might be difficult for them to financially survive.\n\nWhen the consumers called for implementing the price list, a butcher retorted: “Let the officials of district administration come and fine me. We are not afraid of them (officials).”\n\nAsfandyar Khan, a resident of Panjpir village, said that the butchers overcharged the consumers at will.\n\nWhen contacted, an official of the district administration told Dawn that they were striving to get the official price list implemented.\n\nPublished in Dawn, March 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:55:27.431Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895373/consumers-complain-about-price-hike-on-first-day-of-ramazan-in-swat",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T01:06:17.000Z"
}
