{
  "title": "PM Shehbaz takes notice of gas suspension during Sehri, Iftar in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Monday took notice of the complaints about gas supply suspension to domestic consumers yesterday in Karachi during Sehri and Iftar hours.\n\nThe absence of cooking gas on the first day of Ramazan piled misery on the residents of the city as the Sui Southern Gas Company (SSGC) completely failed to deliver on its promises to provide uninterrupted supply during Sehri and Iftar.\n\nLast week, the SSGC announced a new schedule and said it would ensure gas supply to domestic consumers during Sehri and Iftar times. The SSGC had already reduced the gas supply by two and a half more hours as part of its load-shedding schedule for Ramazan.\n\nAccording to a statement issued by the SSGC today, the premier took immediate notice of these complaints.\n\nTo address these complaints, emergency meetings were held at both the secretary and minister levels with the managing directors and senior management soon after Iftar on Sunday, the statement said.\n\nConsequently, the SSGC increased the pressure by an average of 10 per cent through sales meter stations to improve the flow.\n\nIt was also decided to open gas distribution centres for around half an hour before Sehri and Iftar timings to improve the system pressure in areas with low network capacity.\n\nBesides, the SSGC arranged an additional 20 million cubic feet per day of gas to enhance the transmission line pack.\n\nThe utility further set up control rooms at the head and regional offices to monitor the gas supply and network status daily.\n\nFurthermore, the company said it would address low gas pressure complaints on an emergency basis at regional levels as well as submit daily reports to its senior management.\n\n“These measures aim to address consumer complaints and ensure a reliable gas supply during Ramazan,” the statement read.\n\nSeparately, Sindh Minister for Planning, Development and Energy Syed Nasir Hussain Shah requested the premier to ensure that there were no gas suspensions during the month of Ramazan.\n\n“It is now the month of March; the winter is not even there anymore,” the provincial minister said, adding that immediate notice should have been taken for load-shedding during Sehri and Iftar hours.\n\n“In Ramazan, these organisations should be bound [not to resort to load-shedding] so that these problems are not faced by the people,” he said in a video message.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:55:23.065Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895543/pm-shehbaz-takes-notice-of-gas-suspension-during-sehri-iftar-in-karachi",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T12:07:17.000Z"
}
