{
  "title": "Govt facilitates research to provide solutions to indigenous problems: Shibli Faraz",
  "link": "https://www.app.com.pk/national/govt-facilitates-research-to-provide-solutions-to-indigenous-problems-shibli-faraz/",
  "date_published": "2021-12-13T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP):Federal Minister for Science and Technology, Senator Shibli Faraz on Monday said that the government was facilitating the academia as well as research and development (R&D) organizations to focus on providing solutions to the indigenous problems.\nThe minister was speaking as the chief guest at opening ceremony of the two-day 18th International Conference on ‘Frontiers of Information Technology’ (FIT-2021), organized by COMSATS University Islamabad (CUI). The minister mentioned that no country can address the most pressing and difficult problems by itself; such as protecting the environment, developing sustainable energy sources, fight against incurable diseases, challenges of population growth and food scarcity.\nHe mentioned that the government and MoST through bilateral Science and Technology Cooperation Agreements of International Cooperation in the fields of Science and Technology is facilitating academia and local Research and Development Organizations to provide solutions for indigenous problems.\nHe reiterated that the government initiatives and policies are extending the benefits of communication technologies to every man, woman and child in this country.\nThe minister appreciated that FIT conference is regularly providing a platform to the researchers, scientists and industry with giving an opportunity to present their latest cutting edge research findings and ideas.\nDistinguished international academician and researcher, Prof. Dr. Atta ur Rehman delivered the keynote address.&nbsp;  In his keynote address “Open Distance Learning: Creating a Knowledge Economy”, Prof. Rahman highlighted the importance of knowledge economy with the help of technology or skills and presented novel solutions to IT specialists to learn and develop in present era. Rector, COMSATS University&nbsp;Islamabad, Prof. Dr. Muhammad T. Afzal, in his concluding remarks appreciated the efforts of government in promoting the research and development culture in the country.\nHe mentioned that the FIT forum is designed to provide a dedicated platform to scientists, engineers, academicians, industry professionals and researchers from around the world to present and share their knowledge, ideas, innovations and problem-solving techniques with the participants.\nFinally, he assured the audience that COMSATS University Islamabad will always play an active role in nurturing an educated society and contributing to the global knowledge.&nbsp;&nbsp; During the two days conference, a series of invited talks are organized as part of technical sessions and world-renowned scholars and researchers would talk.\nPhD symposia will be providing a forum to the PhD students to present their ongoing research; these symposia will be conducted by elite academicians from the arena of Information Technology.\nOn the last day (December 14) of conference, panel discussion on “How to Make digital Pakistan a Reality” will be held that will focus on the importance of digitalization in every field of life in Pakistan.\n&nbsp; The conference is being attended by the international speakers from France, Netherlands, China, Ireland, Portugal, Pakistan, United Kingdom and USA. This year, the theme of conference is “Digital Pakistan”.",
  "retrievedAt": "2025-08-11T21:42:49.371Z"
}
