{
  "title": "Balochistan students have immense potential to change country’s fate: President",
  "link": "https://www.app.com.pk/national/balochistan-students-have-immense-potential-to-change-countrys-fate-president/",
  "date_published": "2021-12-13T11:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): President Dr Arif Alvi on Monday urged the students to focus on their studies and play their role for the development of the country.\nHe said that the students of Balochistan had great potential to change the destiny of the country by equipping themselves with the latest knowledge and information technology skills.\nThe president expressed these views during an interactive session with the students and faculty members of Balochistan Residential College, Khuzdar, here at Aiwan-e-Sadr.\nTalking to the students, the President said that the government was focusing on the socio-economic development of the province which had, unfortunately, been neglected in the past.\nHe underscored that priority was being given to the development of the education sector as it played an instrumental role in the socio-economic uplift of the country.\nThe president remarked that the completion of the China Pakistan Economic Corridor (CPEC) and the development of Gwadar port would help to create employment opportunities as well as bring prosperity to the province of Balochistan.\nThe president also appreciated the government of Balochistan over its initiative of establishing residential colleges in areas such as Khuzdar and Loralai, and expressed the hope that these institutions would play a major role in the educational development of the province.\nLater, while chairing a meeting of the senate of National Skills University (NSU), Islamabad, President Dr Arif Alvi underlined the need to focus on the skill-development of youth and produce manpower in line with the requirements of the market. He urged the universities to increase the number of skilled graduates in order to fulfill the rising demand of the market.\nVice-Chancellor NSU, Professor Dr Muhammad Mukhtar, updated the meeting about the role of the university in providing skills in various fields. He also apprised the meeting about the implementation status of the decisions taken in the 2nd Senate meeting of NSU.\nThe meeting was informed that the Higher Education Commission (HEC) of Pakistan had granted No Objection Certificate (NOC) to NSU to start classes in Electrical Engineering Technology, Mechanical Engineering Technology, Civil Engineering Technology, Information Engineering Technology, Medical Lab Technology, and Mathematics. The meeting also approved the minutes of the 2nd meeting of Senate of NSU held on October 20, 2021.",
  "retrievedAt": "2025-08-11T21:42:46.621Z"
}
