{
  "title": "Discrimination against differently-abled people condemnable: President",
  "link": "https://www.app.com.pk/national/discrimination-against-differently-abled-people-condemnable-president/",
  "date_published": "2022-12-08T15:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP):President Dr Arif Alvi on Thursday said any discrimination, taboo, disrespect or stereotype associated with differently-abled people (DAPs) was highly condemnable as they were as mentally capable as any other person.\nThe president, addressing a ceremony in connection with the International Day for Persons with Disabilities (PWDs) here at the Aiwan-e-Sadr, said as a society, “we should change our attitudes towards the DAPs and create inclusiveness in all respects of life, remove barriers in their movement at public places and buildings, impart them with skills and create jobs, which suit and correspond to their respective disability.”\nFirst Lady Begum Samina Arif Alvi, representatives of the World Health Organization (WHO), differently-abled people (DAPs), members of the diplomatic community, and people from different walks of life attended the ceremony.\nThe president said the DAPs should be given jobs not only on the basis of charity but also as equal persons with equal abilities and should be given specially designed jobs and tools to make them productive and useful members of society.\nHe said all necessary steps should be taken to impart education, and provide them with tools and assistive technology to remove barriers to their movement and inclusion at national, provincial and local levels, besides giving them jobs as per their ability with dignity, honour and respect.\nThe president said hitherto the 10% neglected population could be transformed into productive and useful members of society enabling them to contribute to nation-building.\nHe said there were stereotypes in society associated with the DAPs and they also had to face ridicule, which perpetuated discrimination and hate and discouraged them from taking part in daily societal activities.\nHe said practices of name-calling and stereotypes should be stopped and a collective attitudinal change was needed to make the society inclusive which was necessary for the development and progress of the country.\nPresident Alvi said the banks were now offering special loans for the DAPs to allow them to create businesses while staying at home and market them on different online marketing platforms.\nHe said that it was society’s duty to create awareness through media and other forms of communication among parents and DAPs to avail of the loans and become financially and economically independent in their life.\nEarlier, Begum Samina Arif Alvi, in her address, said the entire month of December was dedicated to promoting the rights of DAPs at all levels of society and the institutions both in the public and private sectors.\nShe said white canes would be provided to all blind persons with visual impairments to help them in their movement.\nShe said although there had been a fixed quota for the DAPs in government and private organizations, which, however, was either not filled or the jobs were given to them as a charity.\nShe said customized jobs should be created, which correspond to and facilitate the DAPs to perform to their fullest potential.\nSecretary of the Ministry of Human Rights, in his address, outlined various steps taken by the government to ensure the inclusion of DAPs as full and dignified members of society.\nHe said an act had been enacted to ensure the rights of DAPs, and a mobile phone-based application had also been launched.\nHe said initiatives had been taken to train at least one teacher in one school with the required skills to communicate with the DAPs with ease to help them fully adjust to society.\nEarlier, children with different abilities performed a tableau, besides reciting the National Anthem in sign language. The president also used sign language to recite the National Anthem at the beginning of the ceremony.",
  "retrievedAt": "2025-08-11T15:58:54.372Z"
}
