{
  "title": "On Int’l Anti-Corruption Day, leadership reaffirms resolve to achieve corruption-free Pakistan",
  "link": "https://www.app.com.pk/national/on-intl-anti-corruption-day-leadership-reaffirms-resolve-to-achieve-corruption-free-pakistan/",
  "date_published": "2022-12-08T17:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): As the world is set to observe International Anti-Corruption Day on Friday, the country’s leadership reaffirmed its resolve to achieve a corruption-free Pakistan by promoting transparency and accountability in the country’s governance system.\nIn their separate messages issued on the Day, President Dr Arif Alvi, Prime Minister Shehbaz Sharif and Chairman of the National Accountability Bureau (NAB) Aftab Sultan called for a pledge to make collective efforts to eradicate this “cancer that eats deeper into the moral fabric of our society.”\nIn his message, President Alvi said, “The scourge of corruption and its various manifestations, moral or financial, are responsible for some of the gravest threats facing our nation. Corruption contributes to instability and poverty and is a dominant factor driving fragile countries towards state failure,” he remarked.\nHe said that fighting corruption was a serious concern for developing countries, especially Pakistan, as it weakened security, hindered economic growth, deprived the nation of precious and scarce public and private resources. It also creates social and economic disparities, erodes the economic edifice of society, and weakens state institutions, he added.\nPresident Alvi said that International Anti-Corruption Day provided with an opportunity to reflect on the progress made over the past years in the fight against corruption, but also to think about the work that remained to be done in the years ahead.\n“Elimination of corruption is a mission but we will not succeed in this fight unless we are fully committed to its elimination, and are guided by the ingenuity, expertise and energy of those who are on the frontlines of this fight.” he commented.\nHe said the fight against corruption could not be won unless all segments of society joined their hands in the efforts to uproot corruption.\nHe said the role of civil society was also very critical in detecting the root causes of corruption, exposing corrupt acts, shifting social norms, and mobilizing support for ambitious reforms based on moral values, justice, fairness and equal opportunity for all.\nHe said that enhancing parliamentary oversight and constructing a legislative framework that deterred corrupt practices and promoted transparency was essential in addressing corruption.\nMoreover, he said that the procurement processes that complied with international anti-corruption standards would ensure a level playing field for investors. Most importantly, a robust civil society and free press are critical to hold public officeholders responsible for their actions.\n“It is high time to unite the role of key stakeholders and individuals in the elimination of corruption by sharing best practices and examples of preventing and countering corruption worldwide. This could be achieved by strengthening international cooperation against corruption, tackling linkages with other forms of crime, enabling the recovery and return of stolen assets, developing innovative solutions, advancing prevention through education, leveraging youth engagement and mobilizing allies in civil society, academia and the private sector in line with the dictates of United Nations Convention Against Corruption,” the president said.\nHe called for reaffirming the commitment to eliminate corruption, promote transparency and accountability, and purge this evil from society.\nThe prime minister, in his message, calling corruption a major impediment to country’s progress, said it led to the country’s instability by destroying its economy as well as the administrative structure.\nHe said the deterioration of social values also gave way to corruption in any society.\nHe said the corruption not only risked the flow of money into the hands of miscreants to disrupt the country’s peace but also led to the weakening of national institutions creating public mistrust in governance.\nHe said the PML-N’s government always took practical steps to eradicate corruption. The ratio of corruption witnessed a downward trend during the party’s government from 2013-18. Moreover, no one could prove the corruption of even a single penny by the PML-N government after it executed projects of billions of dollars under the China-Pakistan Economic Corridor.\nThe prime minister particularly emphasised doing away with the practice of corruption as a tool for political victimization. He said the previous government jailed the political opponents on the basis of frivolous corruption allegations.\n“This practice should be ended so that the anti-corruption institutions may strengthen by performing truly for the elimination of corruption without being misused,” he commented.\nTerming corruption a major national issue, the prime minister said instead of merely using it for political sloganeering and point scoring, serious efforts should be made for its eradication.\nHe also urged all the political circles to prepare a clear roadmap to get rid of corruption.\nHe said in light of Islamic principles, efforts should be made for strengthening the institutions to do away with the scourge. We will have to ensure rule of law besides social protection as well as social values.\n“All of us will have to work collectively for a corruption-free Pakistan. Only this way, Pakistan will be able to achieve progress. On this International Anti-Corruption Day, let us pledge to realise this dream,” he urged.\nThe NAB Chairman Aftab Sultan, in his message, said with the signing of United Nations Convention against Corruption in 2007, the responsibility on Pakistan became even more extensive as several measures required under the Convention that were related to misuse of banking channels for hiding illicit wealth.\nHe said in line with the requirements of UN convention, NAB had taken serious actions like the establishment of Anti-Money Laundering Cell at NAB HQ for discouraging money launderers from parking of illicit funds. Such action on overall basis facilitated the state of Pakistan to meet the requirements of ‘Financial Action Task Force (FATF) on money laundering’.He said the NAB was absolutely determined to eradicate corruption from Pakistan through its holistic approach of awareness, prevention and enforcement. The Bureau has prescribed a maximum limit of 10 months for the expeditious disposal of whitecollar crime cases.\n“Due to effective anti-corruption strategy, NAB has recovered Rs. 886.865 billion since inception, whereas, during the year 2022, the bureau received a total number of 19,917x complaints and 416x CVs. Consequently, 209x inquiries and 36x investigations have been authorized. After completing due process under the law, 29x references have been filed in the Accountability Courts,” he said.\nThe Bureau is constantly enhancing the capability of Forensic Science Laboratory established at NAB HQ to meet the requirements of modern investigation techniques. State of the Art Pakistan Anti-Corruption Academy (PACA) has been established and operationalized by NAB for capacity building of its investigators.\nNAB under the Awareness and Prevention mandate has successfully established thousands of Character Building Societies (CBS) in educational institutions all over the country for sensitizing the future leaders of our country against corruption.\n“The responsibility of fighting corruption is not for government and National Accountability Bureau alone but for all of us. We perpetuate corruption when we choose to remain silent when we have information that can help prevent loss of resources through corruption or that can assist to bring perpetrators to book. We therefore must collectively fight to eradicate this cancer that eats deeper in to the moral fabric of our society,” he remarked.",
  "retrievedAt": "2025-08-11T15:58:51.181Z"
}
