{
  "title": "PVC market growing with wide array of downstream applications",
  "link": "https://www.app.com.pk/national/pvc-market-growing-with-wide-array-of-downstream-applications/",
  "date_published": "2022-12-08T14:39:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 08 (APP): With growing consumer awareness about new construction materials and sustainability, the PVC downstream market in Pakistan is expected to witness an upward trend in the coming years.\nA recent report by PACRA expects the local construction industry to record growth of 6 percent this year. Over the next seven years, the sector is expected to grow by a whopping 92 percent as Pakistan enters the rehabilitation phase in the aftermath of catastrophic floods and China Pakistan Economic Corridor (CPEC)-related activities revive as well. As a result, the demand for PVC applications and other construction materials is also likely to gain traction.\nAccording to Muhammad Idrees, Chief Commercial Officer of Engro Polymer & Chemicals Limited (EPCL), “The PVC market in Pakistan has undergone a phase of growth and diversification in the last few years. To meet the market requirements, we have continued to scale our operations and completed Plant expansion to 295,000 tons annually. Last year, we contributed USD 165 million in import substitution through local PVC & VCM production and generated USD 28 million in foreign exchange through exports.” He further mentioned that due to Pakistan’s inherit advantages and claose proximity to growing regional markets, there is huge export potential for PVC downstream products, which should be capitalized by local manufacturers.\nHe added that, “To promote the use of high-quality PVC downstream products, especially in the construction sector of Pakistan, EPCL is undertaking various market development initiatives and has made significant investment with its partners to launch a branded outlet called thinkPVC.”\nElaborating on the concept of thinkPVC outlet, he said that EPCL wants to engage the construction industry and other associated stakeholders to highlight innovative construction materials, with a focus on sustainable materials such as PVC. Currently, around 55 percent market share of PVC application in Pakistan is held by pipes and fittings. The goal is to create wider awareness that PVC resin applications include the manufacturing of doors, windows, flooring, roofing, outdoor furniture, vanities, and other products.”\nIdrees shared that with increasing population, there is a dire need to adopt modern and innovative construction materials for sustainable living. Compared to other materials, PVC is waterproof, termite and damage resistant, fire retardant, and a light-weight material, which offers high durability and requires minimal maintenance. PVC is more sustainable as it has 50 percent lower carbon footprint as compared to aluminum, a competing product. It also has a much longer life span and is recyclable. Consumers can save up to 28 percent in heating and cooling costs when using a double-glazed PVC window.\nHe believes that the future of PVC downstream market in Pakistan remains promising as climate change tops the government agenda and more sustainable practices will be adopted by the construction industry. “All sectors in Pakistan are expected to adopt greener solutions in line with the government policy of preserving natural resources and forests. PVC is a viable alternative to wood products, and we expect to see greater market penetration of PVC downstream products as the construction sector embraces a Go Green approach”, Idrees stated.",
  "retrievedAt": "2025-08-11T15:58:55.420Z"
}
