{
  "title": "PM for doing away with using corruption for political victimization",
  "link": "https://www.app.com.pk/national/pm-for-doing-away-with-using-corruption-for-political-victimization/",
  "date_published": "2022-12-08T17:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): Prime Minister Shehbaz Sharif has emphasised the need for doing away with the practice of using corruption as a tool for political victimization.\nThe prime minister, in his message on International Anti-Corruption Day annually observed on December 9, said the previous government jailed the political opponents on the basis of frivolous corruption allegations.\n“This practice should be ended so that anti-corruption institutions may strengthen by performing truly for the elimination of corruption without being misused,” he commented.\nTerming corruption a major national issue, the prime minister said instead of merely using it for political sloganeering and point scoring, serious efforts should be made for its eradication.\nCalling corruption a major impediment to Pakistan’s progress, he said it led to the country’s instability by destroying its economy as well as the administrative structure.\nHe said the deterioration of social values also gave way to corruption in any society.\nPrime Minister Shehbaz said the corruption not only risked the flow of money into the hands of miscreants to disrupt the country’s peace but also led to the weakening of national institutions creating public mistrust in governance.\nHe said the PML-N’s government always took practical steps to eradicate corruption. The ratio of corruption witnessed a downward trend during the party’s government from 2013-18. Moreover, no one could prove the corruption of a single penny by the PML-N government which executed projects of billions of dollars under the China-Pakistan Economic Corridor.\nHe also urged all the political circles to prepare a clear roadmap to get rid of corruption.\nHe said in light of Islamic principles, efforts should be made for strengthening the institutions to do away with the scourge. “We will have to ensure rule of law besides social protection as well as social values.\n“All of us will have to work collectively for a corruption-free Pakistan. Only this way, Pakistan will be able to achieve progress. On this International Anti-Corruption Day, let us pledge to realise this dream,” he urged.",
  "retrievedAt": "2025-08-11T15:58:52.251Z"
}
