{
  "title": "PM appeals to philanthropists to ‘adopt’ flood victims by setting up 100-unit prefab villages",
  "link": "https://www.app.com.pk/national/pm-appeals-to-philanthropists-to-adopt-flood-victims-by-setting-up-100-unit-prefab-villages/",
  "date_published": "2022-12-08T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): Prime Minister Shehbaz Sharif on Thursday appealed to philanthropists including industrialists, and expatriates to support the government’s flood rehabilitation efforts by replicating the model of building100-unit prefabricated houses for flood victims.\nAddressing here at the launch ceremony of prefabricated residential units in Tank and Dera Ismail Khan, the prime minister urged the affluent to ‘adopt’ the flood-hit people of Balochistan and Sindh by providing them the infrastructure equipped with necessary facilities.\nThe prime minister in September had announced to construct residential units for the people of Tank and Dera Ismail Khan, who were displaced by the massive flashfloods in Khyber Pukhtunkhwa. The project worth Rs 140 million was carried out as a gesture of philanthropy by Menzies Aviation and former special assistant to prime minister on aviation Captain Shujaat Azeem.\nShehbaz Sharif, who handed over keys of the residential units to flood victims, expressed satisfaction that the accommodation comprising two rooms, a kitchenette and a toilet would provide relief to the displaced people.\nHe said the post-flood damages needed more people to come forward and contribute towards replicating the same model villages and assist the government in amplifying its rehabilitation efforts.\nThe prime minister mentioned that the recent floods inflicted huge damage to around two million houses, infrastructure and roads, however, he expressed satisfaction that the federal and provincial governments along with private sector put their best efforts to provide relief to the affected people.\nHe lauded National Disaster Management Authority (NDMA) and the provincial disaster management authorities for carrying out relief and rehabilitation activities in the flood-affected areas.\nHe said the federal government disbursed Rs 70 billion to the flood-struck people in the provinces through Benazir Income Support Programme.\nShehbaz Sharif said the armed forces played an important role in reaching out to the people stranded in floods.\nHe also mentioned the support of friendly countries in extending assistance to Pakistan to help overcome the challenge of flood.\nFederal Minister for Planning Dr Ahsan Iqbal said Pakistan faced the huge catastrophe of floods, however mentioned that the government’s federal and provincial departments, and civil and military personnel demonstrated collaborative effort to overcome the challenge.\nThrough corporate social responsibility, he said, the government encouraged the private sector to contribute towards public welfare.\nHe said Pakistan would hold an international conference aimed at seeking support from the international community for post-flood rehabilitation.\nMember Khyber Pukhtunkhwa Assembly Mehmood Ahmed Khan Bhittai lauded Prime Minister Shehbaz Sharif for early implementation of the residential accommodation for the flood-hit people.\nHe said Jamiat Ulema-e-Islam would support the development endeavours of the government in the interest of people.\nCaptain Shujaat Azeem said the initiative was significant to accommodate the people in distress affected by the worst impacts of climate change. On PM’s desire, he said, the model village would be replicated in other parts of the country.\nCEO Menzies Aviation Moetesum Khurshid said the objective of the project was to handover the residential units to the flood victims before the advent of winters.\nHe said after NDMA allocated land on September 3, his company completed the project in one month as announced by PM Shehbaz Sharif.\nHe said the prefabricated houses can sustain harsh temperatures and are equipped with solar panels. A medical centre with available paramedic staff and a school have been set up in the premises.\nThe residential village has tubewells for clean water, where 9,000 indegenous trees have been planted.",
  "retrievedAt": "2025-08-11T15:58:58.100Z"
}
