{
  "title": "KP farmers to get training under $1 mln US assistance project",
  "link": "https://www.app.com.pk/national/kp-farmers-to-get-training-under-1-mln-us-assistance-project/",
  "date_published": "2022-12-08T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): The US Embassy and the Government of Khyber Pakhtunkhwa’s Planning and Development Department have jointly launched a new development project worth $1 million to provide training to farmers, improve irrigation systems, and increase household income in the province.\n“This US assistance will fund 200 training courses targeting approximately 4,000 farmers, with a special focus on women farmers,” a US Embassy news release said on Thursday.\nIt would also fund the construction of irrigation systems to reduce flood risk and improve water resource use, helping increase crop yields and improve economic livelihoods, the embassy added.\nThis new assistance follows the successful completion of development projects worth over $6 million, which have benefited over 44,000 families from the Bajaur, Khyber, Mohmand, and Torghar districts since 2019.\nUS Embassy Deputy Chief of Mission Andrew Schofer, Director of International Narcotics and Law Enforcement Affairs (INL) Lori Antolinez, Additional Chief Secretary Shahab Ali Shah, Director General of Planning & Development Department KP, and Joint Secretary Economic Affairs Division Islam Zaib attended the project signing ceremony in Islamabad.\nAndrew Schofer lauded the longstanding partnership between the US and the KP governments for curbing illegal crop production in the province.\n“This investment will provide important skills training to women farmers in the newly merged districts, helping to increase crop yields and promoting economic opportunity in Mohmand, Bajaur, Khyber, and Torghar districts,” he noted.\nSince 1988, Andrew Schofer said, the US government’s crop control programme had invested more than $80 million in Khyber Pakhtunkhwa. “This assistance includes construction of over 1200-kilometer roads, 1300 water supply and irrigation projects, and over 75,500 acres of demonstration plots for high-yield substitute crops, benefitting over 360,000 families.”\n“Poppy cultivation in Pakistan has been reduced by 87% during this period, a powerful indicator of the success of our longstanding partnership,” he added.\nReferring to 75 years of bilateral relations between Pakistan and the United States, the embassy said the US Department of State’s Bureau of International Narcotics and Law Enforcement Affairs was also marking the 40-year anniversary of partnership in Pakistan to advance justice, security, and prosperity.\n“Over the past four decades, the US government has invested more than $1 billion dollars to improve citizen security and enhance law enforcement capacity across Pakistan,” it added.\n“The United States works in more than 90 countries to help combat crime and corruption, counter the narcotics trade, improve police institutions, and promote court systems that are fair and accountable.”",
  "retrievedAt": "2025-08-11T15:58:56.928Z"
}
