{
  "title": "Ashrafi urges world to give justice to Palestinians, Kashmiris",
  "link": "https://www.app.com.pk/national/ashrafi-urges-world-to-give-justice-to-palestinians-kashmiris/",
  "date_published": "2022-12-08T15:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Thursday urged the world to give justice to Palestinians and Kashmiris.\nAddressing the World Islamic Forum in Moscow, Ashrafi who is also the chairman of Pakistan Ulema Council said Islam commanded interfaith dialogue which was need of the world at this time.\nHe said Pakistan’s Ulema, Mashaykh and religious scholars were giving the message of peace, security and moderation in the light of ‘Message of Pakistan’ and ‘Charter of Makkah-tul-Mukarrama’ to the world.\nHe said extremism and terrorism were being associated with Islam in order to mislead the Muslim young generation on the globe adding that Islam was free from all such crimes.\nHe said the way oppression was being done with the innocent people of Kashmir and Palestine, it invited the Muslims to spread the message of Islam with more force and power to let the world know that Islam was the religion of peace.\nAshrafi said Ulama, Mashaykh and government of Pakistan supported inter-religious dialogue at all levels and they had given the message to the entire world through ‘Message of Pakistan’ that peace and security could be achieved through mutual dialogue.\nHe said today, the inhuman treatment of Muslims in Palestine and Kashmir had become unbearable adding that the powerful countries should come forward to end this cycle of persecution through dialogue.He said all heavenly religions and books conveyed the message of respect and love.\nThe Charter of Makkah-ut-Mukarrama, Charter of Brotherhood of Humanity and recent gatherings in Bahrain were evidence that Muslims were making all out efforts to spread the message of Islam – peace – at every forum of the world.\nHe urged Ulema and Mashaykh from all over the world to go ahead and fight hard to eliminate the hatred, for the supremacy of justice and promotion of peace, love and tolerance in the world as we needed to protect our generation from the forces that spread violence and extremism.",
  "retrievedAt": "2025-08-11T15:58:54.289Z"
}
