{
  "title": "Indian law makers, poets criticizing Modi’s barbaric policies",
  "link": "https://www.app.com.pk/national/indian-law-makers-poets-criticizing-modis-barbaric-policies/",
  "date_published": "2022-12-08T09:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP):Indian parliamentarians, poets and columnists were criticizing and mocking at Indian Prime Minister Narendra Modi’s atrocities and barbaric policies against minority communities particularly Muslims in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nIndian revolutionary poet, Imran Pratapgarhi highlighted the Indian government’s atrocities and tyranny against the oppressed Kashmiri people in his poetic verses such as ‘I am Kashmir’, he uploaded videos on YouTube and other social networking applications defending the right to self-determination of Kashmiris.\nHe said the fascist Modi’s government was perpetrating gruesome human rights violations against the minorities and Kashmiri Muslims. “Modi is a tea seller, who has no moral ethics and political norms,” he maintained.\nImran Pratapgarhi further said the Indian prime minister was involved in the massacre of innocent Muslims of Gujrat and Kashmiris. “Kashmiri students are detained and made missing persons from various universities of India,” he added.\nAll India Majlis-e-Ittehadul Muslimeen (AIMIM) chief, Asaduddin Owaisi, slammed that Narendra Modi had violated all the constitutional norms by implementing hegemonic, autocratic and barbaric policies and laws to crush the voice raised against him.\nHe expressed his commitment, “I will always oppose Modi and his draconian laws till last breath. Revoking article 370 move a breach of constitutional promise made by Nehru and Patel regarding Jammu and Kashmir.”\nDespite of Modi’s government sanctions and curbs on freedom of expression, several Indian columnists were valiantly criticizing Indian government and its terrible policies against Kashmiri people to suppress their voice but he would not success in his nefarious motives.",
  "retrievedAt": "2025-08-11T15:59:02.650Z"
}
