{
  "article_id": "2025-04-12_7e75c9f0eeb114f1dd9eb0fa4fb1749a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/railways-to-launch-dg-khan-multan-shuttle-train-from-16th-bolan-mail-schedule-revised/",
    "retrieved_at": "2025-08-27T14:26:05.505Z"
  },
  "metadata": {
    "title": "Railways to launch DG Khan–Multan shuttle train from 16th; Bolan Mail schedule revised",
    "author": null,
    "date_published": "2025-04-12T12:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 215,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Apr 12 (APP):The Pakistan Railways has announced the launch of a new shuttle train service between Dera Ghazi Khan and Multan in a move aimed at improving travel convenience for passengers. The service, named 227Dn/228Up, will commence operations from April 16. According to the railway officials on Saturday, train 227Dn will depart from Multan at 5:30 AM daily and, after passing through Sher Shah, Muzaffargarh, and Kot Addu, will reach Dera Ghazi Khan by 9:30 AM. In return, train 228Up will leave Dera Ghazi Khan at 11:00 AM and arrive at Multan Cantt Railway Station by 2:50 PM, following the same route. The shuttle train will consist of four economy class coaches and one brake van, ensuring economical and accessible travel for daily commuters and the general public. In another development, the Pakistan Railways has also decided to revise the schedule of the 3Up Bolan Mail, which operates between Karachi City and Quetta. Effective from April 27, the train will now depart from Karachi City at 4:00 PM and will pass through Kotri, Sehwan Sharif, Dadu, Shikarpur, Jacobabad, and Sibi before arriving at Quetta Railway Station at 4:00 PM the following day. The adjustments are part of the administration's ongoing efforts to enhance rail connectivity and improve service delivery for passengers across the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}