{
  "title": "Govt, people of Pakistan express solidarity with Ethiopia over landslide incident",
  "link": "https://www.app.com.pk/national/govt-people-of-pakistan-express-solidarity-with-ethiopia-over-landslide-incident/",
  "date_published": "2024-07-30T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 30 (APP): The government and people of Pakistan have expressed solidarity with the government and people of Ethiopia following a devastating landslide in the Gofa Zone of southern Ethiopia.\nIndividuals from various sectors, including parliamentarians, diplomats, religious communities, business leaders, media professionals, youth, and civil society members, visited the Ethiopian Embassy in Islamabad to convey their condolences over the tragic incident.\nAmong the officials, Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam, reached out to Jemal Beker Abdula, Special Envoy and Ambassador Extraordinary and Plenipotentiary of Ethiopia to Pakistan, to express condolences and solidarity with the Ethiopian government and people.\nAmbassador Jemal Beker on Tuesday held separate meetings with Senator Mushahid Hussain and Director General (Africa) of the Ministry of Foreign Affairs of Pakistan, Hasnain Yousaf. Both officials expressed their condolences and sympathies to the bereaved families.\nPress Council of Pakistan Chairman, Arshad Khan Jadoon, and Tehreek-e-Jawanan Pakistan Chairman, Muhammad Abdullah Hameed Gul, were also among the prominent figures who visited the embassy to offer their condolences to Ambassador Jemal Beker Abdula.\nA large delegation from the business community, led by Islamabad Chamber of Commerce and Industry President Ahsan Zafar Bakhtawari and Pakistan-Africa Friendship Association Chairman Zafar Bakhtawari, also visited the embassy for the same purpose.\nAmbassador Jemal Beker briefed the visitors about the relief and rescue efforts being carried out by the Ethiopian government, emphasizing the permanent relocation of the affected persons in a sustainable manner.\nThe ambassador highlighted the Green Legacy Initiative of Ethiopian Prime Minister Abiy Ahmed, to combat climate challenges and ensuring food security in the country and the region. He informed the delegates that Ethiopia had planted more than 40 billion seedlings of indigenous plants, fruits, vegetables, and animal feed in the last four years through massive mobilization of the masses.\nAmbassador Jemal Beker expressed his commitment to work with the government of Pakistan to address climate issues through joint initiatives under the Green Legacy Initiative. He announced that the embassy would soon launch the second round of the Ethio-Pakistan Fraternity under the Green Legacy Initiative, initially launched across Pakistan in 2023.\nSenator Mushahid Hussain praised Ethiopian Prime Minister Abiy Ahmed for his leadership role in uniting the country to address its contemporary challenges, including climate-related issues.",
  "retrievedAt": "2025-08-11T04:13:41.874Z"
}
