{
  "title": "OEC to send female nursing staff to Malaysia",
  "link": "https://www.app.com.pk/national/oec-to-send-female-nursing-staff-to-malaysia/",
  "date_published": "2024-07-30T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):Overseas Employment Corporation (OEC) would hold walk in interview in Lahore from August 3 to 4 for the selection of female nurses staff for Malaysia.\nAn official source told APP here on Tuesday, he said that our esteemed client Sunway Health Care Hospital requires Female Staff Nurses in the State of Malaysia.\nHe said that only qualified and experienced candidate could join the Walk-in-Interview for their selection from (8:30 am to 5 pm) Lahore Shalimar Tower Hotel Jail Road. The interested candidate should have relevance qualification and experience as ICU nurses diploma in nursing or bachelor of science in nursing 16 (Years) or Post RN from the recognized institution.\nRegistration from the Nursing Council, Minimum of 03 years of related work experience in the hospital setting, specialized post-basic training in OT/ICU & Pediatric will be preferred\nOnly Females ,Not more than 45 years, Basic Monthly Salary  3,000- 4,500 RM, allowance Per Month including General Nursing Allowance for Pediatric Nurse, Specialized Allowance for ICU & OT Nurses Only, Specialized Allowance= 1100 RM, General Nursing Allowance= 700 RM, Degree Allowance= 400 RM, Post Basic Allowance= 800 RM, Operation Theatre Nurse, Pediatric Nurse, CCU Nurse, NICU Nurse,  A&E Nurse.\nFurther he said that all candidates are required to bring the following documents on the interview day including updated resume with color photographs – please refer to the sample of resume provided + must use GMAIL email address.\nGeneral Education Certificates with a certified true copy, Nursing training certificates – diploma and nursing degree, Registration certificate with own nursing board/council or with other Nursing Board/Council, Academic transcript with a certified true copy, Additional specialization course – Post Basic ICU/ NICU/ PICU/ OT/ Paeds/ A&E, Current Practicing License, Birth Certificate, International passport (If you have), Marriage certificate, Testimonial from a recent employer (If you have one), Recent passport-size color photographs (5 copies),  3 months’ pay slips (If you have).\nInterested applicants can apply via OEC’s website https://oec.gov.pk/. Help-Desk Team: for technical support, contact the OEC-Helpdesk team at UAN: 0311-0011-632 or Email:\nThe applicant will submit/attach the deposited Bank challan amounting to Rs. 1000/- generated at the time of online application submission.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:14:30.563Z"
}
