{
  "title": "FIA arrests key figures in APPC corruption case after IHC terminates bail",
  "link": "https://www.app.com.pk/national/fia-arrests-key-figures-in-appc-corruption-case-after-ihc-terminates-bail/",
  "date_published": "2024-07-30T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):The Federal Investigation Agency (FIA) on Tuesday arrested the accused, including the former Project Director of Associated Press of Pakistan Corporation (APPC), Ghawas Khan, after the Islamabad High Court (IHC) terminated their interim bail petitions in a multimillion-rupee corruption scandal.\nMusawar Imran (ex-Deputy Director) and Saad Mudassar (ex-Chief Computer Engineer) were also among those apprehended by the FIA’s Anti-Corruption Wing.\nIHC’s Justice Tariq Mahmood Jahangiri heard the pre-arrest bail petitions filed by the accused.\nAPPC’s counsel Sardar Yaqoob Mastoi argued that the lower court had already canceled the bails of the accused, who managed to escape from the courtroom.\nHe informed the court that the accused had caused a loss of millions of rupees to the state-run news organization through corrupt practices and violations of PPRA rules in the purchase of equipment. He requested the court to dismiss the  petitions so that the accused could be arrested for further investigation into the scam.\nHe emphasized that each petitioner had been accused of a specific role and that their custody was essential to investigate the irregularities mentioned in the first information report (FIR).\nConversely, the lawyers of the accused requested the court to grant interim bail to their clients.\nAfter hearing the arguments, the court dismissed the bail petitions of the accused, after which the FIA arrested Ghawas Khan, Saad Mudassar, and Musawar Imran.\nIt is noteworthy that the FIA had registered the corruption case against the accused, including the aforementioned three individuals and Bilal Zafar (ex-Deputy Director of the Cyber Wing, Ministry of Information), Arshad Majeed Chaudhry (ex-\nManager Accounts, APPC), Ziaullah Bhutto (former Director Admin & P&D), officials of M/s Tejaria Pakistan Private Limited, M/s New Horizon, M/s Arrtek System, M/s Commtel and M/s Media Links under Sections 34, 409, 420, 468 and 471, PPC r/w 5(2)47PCA.\nThe accused are alleged to have colluded as members of the procurement committee to award a contract worth\nRs 113 million illegally without the approval of the financial proposal from the Managing Director of APPC and violated PPRA rules in the purchase of the organization’s equipment. According to the FIR, these individuals are also accused of preparing fake minutes of the 8th meeting in collusion with one another.\nMeanwhile, according to the statement issued by the FIA spokesperson, the Anti-Corruption Circle Islamabad arrested three government officials Mohammad Ghawas, Saad Mudassar and Musawar Imran involved in corruption, fraud, criminal negligence and misuse of authority.\nAccording to the preliminary investigation, the accused caused a loss of Rs 124 million to the national treasury through the flagrant violations in the procurement process in the project namely ‘Restructuring of news operation by replacing outdated equipment with modern cutting edge technology‘.\nAccording to the spokesman, the accused were part of the procurement committee of the APPC. They awarded a contract Rs 113 million to a firm called M/S Arrtek System while committing fraud and abuse of authority. The financial proposal of the said firm was not approved by the competent authority. The accused further made fake meeting minutes of the procurement committee to approve the bill from Accountant General of Pakistan Revenue (AGPR), he said.\nThe total cost of this project was Rs 786.79 million.\nThe spokesperson stated that the team led by Deputy Director of FIA Anti-Corruption Circle Islamabad Muhammad Afzal Niazi gathered solid evidence of the corruption against the accused and completed the inquiry transparently.\nHe said that the FIA had started investigation after arresting the accused.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:14:09.237Z"
}
