{
  "title": "Unanimous stand in NA on finality of Prophethood: A staunch denouncement of unauthorized fatwas",
  "link": "https://www.app.com.pk/national/unanimous-stand-in-na-on-finality-of-prophethood-a-staunch-denouncement-of-unauthorized-fatwas/",
  "date_published": "2024-07-30T18:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP): Minister for Law and Justice Azam Nazeer Tarar on Tuesday delivered a resolute declaration in the National Assembly, affirming the complete and unequivocal consensus among lawmakers on the finality of the Prophethood of Hazrat Muhammad (Peace Be Upon Him).\nThe minister firmly underscored that no individual possesses the authority to issue fatwas (decrees) against others, reinforcing that such actions are both illegal and un-Islamic.\nResponding to the concerns raised by Sahibzada Hamid Raza, Minister Tarar emphasized that any discussion regarding the recent verdict delivered by the Supreme Court should be conducted in a formal parliamentary setting to determine the appropriate course of action.\nHe strongly condemned any attempt by individuals to take the law into their own hands, highlighting that declaring someone deserving of death contravenes both Shariah and national law. Such acts are unequivocally opposed to the principles of Islam, he stressed.\nMinister Tarar reaffirmed that unwavering belief in the finality of Prophethood of Hazrat Muhammad (PBUH) is a fundamental tenet of Islamic faith. Even the slightest doubt in this belief is sufficient to exclude one from the fold of Islam.\nHe reminded the House that Pakistan was founded on the principles of Islam, and it is incumbent upon us all to uphold the dignity of the Prophet (PBUH) and protect the sanctity of Islam. The entire Parliament must present a united front on the critical issue.\nHe reiterated that the Supreme Court’s role is confined to interpreting the Constitution, not rewriting it. It is the state’s duty to review the court’s verdict or pass a resolution, as these are legal matters that must be addressed by the Law and Justice Committee, which includes representatives from all parties.\nMinister Tarar urged the Chair to promptly refer the matter to the Law and Justice Committee for thorough examination.\nIn support, PML-N lawmaker Hanif Abbassi stressed that respect and love for the Prophet (PBUH) are inherent to our faith and do not require any academic validation. He called for the establishment of a parliamentary committee inclusive of prominent Ulema to address the issue expeditiously.\nPTI’s Ali Muhammad Khan and Abdul Qadir Patel of the PPP recalled that fifty years ago, under the leadership of Zulfikar Ali Bhutto, this House, alongside leading Ulema and political parties, declared Qadianis and Ahmadis as non-Muslims.\nAli commended the House for passing a resolution mandating the inclusion of “Khatam un Nabiyeen” after the Holy Prophet’s (PBUH) name in official documents and educational materials. The recent Supreme Court decision, he argued, has introduced confusion that needs to be reviewed. He proposed forming a special parliamentary committee comprising members from the National Assembly, Senate, and Ulema to investigate this matter.\nJUI-F’s Abdul Ghafoor Haideri emphasized the sensitivity of the issue and noted that while the Supreme Court’s role is to interpret the Constitution, the Parliament is the sole representative body of the Pakistani people.\nIn response, Speaker National Assembly Sardar Ayaz Sadiq directed that the matter be referred to the Parliamentary Committee on Law and Justice for further deliberation. He called for an immediate meeting of the committee and announced that all members are welcome to participate in these discussions.",
  "retrievedAt": "2025-08-11T04:12:56.656Z"
}
