{
  "title": "Narendra Modi gradually losing political capital amid rising conglomerate of “Hindu Establishment”",
  "link": "https://www.app.com.pk/national/narendra-modi-gradually-losing-political-capital-amid-rising-conglomerate-of-hindu-establishment/",
  "date_published": "2024-07-30T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):Eminent journalist and film-maker, Amna Khaishgi said Indian Prime Minister Narendra Modi in his third term as a politician and leader of the Bharatiya Janata Party (BJP), is gradually losing his political capital, and a conglomerate of “Hindu Establishment” is on the rise.\nShe was addressing the Distinguished Lecture Series at Islamabad Policy Research Institute (IPRI), on the topic titled, “India and GCC in Modi 3.0 Power Play.”\nKhaishgi said that Pakistan needs to tap its immense resource base at home and abroad, and should sooner than later be part of the international dispensation that is out with the clout to influence regional and global affairs.\nWhile narrating her rich bonding and experience in the UAE, and with the Indian diaspora, she remarked that India has carved out a special place for it, and the dynamics are not merely state-to-state or diplomatic related but ingresses deep in social fabric and economic ventures and big-money politics.\nShe specifically mentioned the religious stride that India has made in the UAE, as well as the growing celebrity influence in Saudi Arabia that outclasses all other dynamics of state-centrism.\nTalking about Prime Minister Narendra Modi’s third term, she was of the view that as a politician and leader of BJP, he is gradually losing his political capital, and a conglomerate of “Hindu Establishment” is on the rise.\nAmna Khaishgi made eloquent referrals to the ‘Hindu Establishment’, and pointed out that it has made inroads in the UAE and Gulf States, and is at the driving seat in terms of political currency, corporate monopoly and businesses.\nShe was of the view that the Crown Prince of Abu Dhabi and Saudi Arabia are two other legendary personalities who have struck a special chord with India, and the future of business revolves around New Delhi and Indians.\nShe regretted that Pakistan cannot make its presence felt, and has failed in tapping the common denominator of religion, societal oneness and cultural affinity in winning over Muslim leaderships in the Gulf.\nShe observed that India’s social polity got a rude shock with the advent of RSS and BJP, and the fraternity that was there in yesteryears has eroded. “The Mandir politics and issues of marginalisation have hurt the BJP vote bank, and its influence is waning,” she added.\nShe, however, said that there are several replacements for Modi, and saw Arvind Kejriwal as an emerging Hindu leader with his own dynamics and background.She said that hung parliament on the shoulders of Andhra and Bihar shoulders will lead to the collapse of the BJP government, and added that media fatigue is on the rise against Modi’s dispensation.\nShe called for putting the cards together in the UAE and other Gulf States to reorient Pakistani potential in labour and services for a great and competitive bargain.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:13:42.670Z"
}
