{
  "article_id": "2025-06-04_5d08eb90680c67b7184d58a89b4c50bc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/leghari-chairs-ppib-meet-on-solar-policy-shift-from-net-metering-to-net-billing/",
    "retrieved_at": "2025-08-27T10:46:42.723Z"
  },
  "metadata": {
    "title": "Leghari chairs PPIB meet on solar policy shift from net metering to net billing",
    "author": null,
    "date_published": "2025-06-04T16:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 892,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 04 (APP):Federal Minister for Power Division and Energy Sardar Awais Ahmad Khan Leghari on Wednesday chaired a high-level consultative meeting at the Private Power & Infrastructure Board (PPIB), focusing on Pakistan's shift from solar net metering to a net billing system as part of efforts to reform the power sector and ensure affordable electricity. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/06/WhatsApp-Video-2025-06-04-at-19.31.49.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume. The session, attended by experts from the solar energy industry, relevant government departments, provincial representatives, and other key stakeholders. On the occasion, the Federal Minister emphasized that the government is not abolishing net metering, but is instead reviewing options to transition to a more effective, transparent, and sustainable model. He recalled his own role in introducing net metering in 2017-18 when the system was in its initial stage, noting that its expansion has now begun to exert significant pressure on the national grid-an issue that requires timely attention. The government has no intention of harming any consumer or business, stated Minister Leghari. \"All decisions are being made in the national interest and to ensure the long-term sustainability of our energy sector. We are not demanding that consumers sell electricity at the cheapest generation costs. Rather, we are exploring a system that can automatically adjust to price fluctuations, based on a fair and market-aligned Energy Purchase Price (EPP).\" Leghari said since June 2024, the government has provided 174 billion rupees in cross-subsidies to the industrial sector, leading to a 31 percent reduction in industrial tariffs and a marked increase in electricity consumption. Electricity prices have also seen a 14 percent to 18 percent reduction across various consumer categories. \"This move has already eased pressure on the industrial sector,\" the minister stated, emphasizing that the renegotiation of contracts with Independent Power Producers (IPPs) has played a critical role in tariff reduction. The government has ensured that unnecessary projects are no longer included in the long-term energy planning process, he added. The minister said, \"We currently have 7,000 MW of surplus electricity with a visibility of three years. We are in a position to offer electricity to industry and agriculture sectors at just 7 to 7.5 cents per unit without subsidies.\" Discussions with the International Monetary Fund (IMF) are ongoing to approve a balanced scheme, despite no direct financial pressure. He further highlighted that the payback period for net metering users remains commercially viable, especially when users consume at least 40 percent of their generated electricity. \"A payback period of three years or less is reasonable for any investment,\" he said. \"These reforms aim to strengthen the system, not discourage investment. We are moving toward a more balanced and equitable framework.\" Awais reiterated that grid modernization is a key priority, with innovative solutions being explored for both integrated and off-grid systems. He further called for a more digital, transparent, and efficient consumer grievance process, replacing outdated manual systems with online portals. The minister informed participants that the government has terminated 9,000 MW of costly and unnecessary projects, easing the burden on the grid. Additionally, a levy was introduced on captive power users, bringing them back to the national grid and increasing electricity demand. During the meeting, experts from the solar energy industry, relevant government departments, provincial representatives shared their views on proposed transition from net metering to a net billing system. Rasheed Ramay of the Pakistan Solar Association highlighted the urgent need for a coordinated planning framework, stressing the importance of transparency in behind-the-meter solar installations and calling on authorities to address widespread concerns related to net metering. Hamad Khan, Senior Vice Chairman of the Pakistan Solar Association, advocated for a phased transition. \"A five-to-eight-year timeline is reasonable,\" he said, adding that net billing should be introduced gradually, following international best practices to avoid disruption. Usman, a solar sector representative, echoed support for government policy but advocated for rational, incentive-based solutions to encourage consumer adoption. Ayla Majeed welcomed the proposal, stating that the majority of industrial players see potential for investment and improved returns under the proposed model. Offering cross-sectoral support, Rumman Dar of Pakistan's wind energy sector endorsed the government's position. \"I personally benefit from solar at home and understand its transformative potential,\" he remarked. Punjab's Secretary of Energy praised the ministry's tariff reforms, stating, \"The approved tariff reductions and technical loss mitigation steps are timely. But we must still study the payback dynamics and who benefits most from solar-whether it's the wealthy or the middle class.\" System inefficiencies in DISCOs should have been reviewed so the people's burden can be bring down, he added. Concluding the session, the federal minister expressed appreciation to all participants. \"I would like to express my heartfelt gratitude to all stakeholders for today's consultation meeting. The suggestions given by all participants, including the Solar Association, representative bodies and provincial governments, will be positively reviewed from every angle. It is certain that we will not harm any business. We strongly hope that any changes to these regulations will be in the best interests of all stakeholders, the National Grid, and above all, the electricity consumers of Pakistan.\" He reaffirmed that all reforms are being implemented under a coherent, long-term strategy, not as temporary or ad-hoc measures. He emphasized the need to modernize Pakistan's energy systems and assured that all stakeholder suggestions would be given due consideration to ensure an inclusive and forward-looking transition.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}