{
  "article_id": "2025-06-04_d941fd3d13b5c7232c90d58b891695d6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-desires-to-strengthen-economic-partnership-with-belarus-pm/",
    "retrieved_at": "2025-08-27T10:47:31.237Z"
  },
  "metadata": {
    "title": "Pakistan desires to strengthen economic partnership with Belarus: PM",
    "author": null,
    "date_published": "2025-06-04T10:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 306,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 04 (APP):Prime Minister Shehbaz Sharif on Wednesday said that Pakistan desired to strengthen economic partnership with Belarus and benefit from the country's expertise in agricultural machinery manufacturing. The prime minister, in a meeting with a seven-member delegation led by Belarusian Defense Minister Lieutenant General Victor Khrenin, which called on him here, said that Pakistan and Belarus enjoyed excellent bilateral ties which were strengthening over time. The delegation included Belarusian Ambassador to Pakistan Andrei Metelitsa, Commander of the Belarusian Air Force and Air Defense Major General Andrei Yulianovich Lukyanovich and officials from the Belarusian defense ministry. The prime minister said that cooperation with Belarus in information technology and defense sectors would be further strengthened. He recalled that during his visit to Belarus this year, several memorandums of understanding and agreements were signed, which would contribute to further expand bilateral relations. He also expressed good wishes for Belarusian President Aleksandr Lukashenko. Apprising the delegation of Pakistan's stance regarding the recent tension in South Asia, he said that Pakistan offered India an impartial investigation into the Pehelgam incident, but instead of responding positively, India demonstrated aggression by attacking Pakistan and targeting civilian populations, resulting in the martyrdom of innocent civilians. May 10, Pakistan responded befittingly to Indian aggression in self-defense. Conveying President Lukashenko's good wishes to the prime minister, the Belarusian defense minister said that they desired peace and stability in South Asia. He said that the delegation's visit was aimed at further advancing the progress on MoUs and agreements between the two countries. The minister appreciated Prime Minister Shehbaz's personal interest in strengthening bilateral relations and also thanked him for the warm welcome and hospitality. The meeting was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, Defense Minister Khawaja Muhammad Asif, Federal Minister for Defense Production Reza Hayat Haraj, and relevant senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}