{
  "article_id": "2025-06-04_6742966a8860f27f034452dc6ceb0334",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-expansion-of-pakistan-railway-network-to-boost-trade-with-central-asia/",
    "retrieved_at": "2025-08-27T10:47:30.920Z"
  },
  "metadata": {
    "title": "PM directs expansion of Pakistan Railway network to boost trade with Central Asia",
    "author": null,
    "date_published": "2025-06-04T11:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 395,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 04 (APP): Prime Minister Shehbaz Sharif on Wednesday calling railway system the backbone of any country's economy, directed the Pakistan Railway to expand its network to enhance trade links with Central Asian countries. The prime minister, chairing a meeting to discuss the matters pertaining to Pakistan Railway, said that sustainable rebuilding of railway infrastructure was essential for economic and industrial development, and its modernisation was a key component of government policy to promote regional trade and connectivity. He also instructed the Pakistan Railway to expedite efforts to connect Gwadar with its network. Railways Minister Hanif Abbasi, briefing the prime minister on ongoing reforms in Pakistan Railways, said that the organisation had immense potential for further investment. He highlighted the establishment of modern information desks at major railway stations, outsourced cleaning systems at Lahore, Rawalpindi, and Multan railway stations, collaboration between Railways and provincial food authorities to monitor food quality at trains and stations, and the resumption of long-suspended services. He told the meeting that Bolan Mail had recently been relaunched as a daily service, and restoration of Dera Ghazi Khan and Khushhal Khan Khattak Express. The minister said that the concrete sleeper factories in Sukkur, Khanewal, and Kohat, and Railway hospitals, schools, colleges, and rest houses in Karachi, Lahore, Peshawar, Quetta, Multan, and Sukkur were being outsourced. Moreover, Royal Palm Golf and Country Club, Lahore, is being auctioned with the potential to establish a five-star hotel and the digitization and restructuring of the Railways' IT Directorate is underway. The minister highlighted that Free Wi-Fi introduced on trains; Rabta App upgraded for ticket booking; 155 railway stations shifting to solar, saving millions; 17,101 posts cut, 5,695 more to be phased out; and Pakistan Railways Advisory and Consultancy Services, Railcop, Pakistan Railways Freight Transport Company, and Project Implementation Unit have been discontinued. It was told that Rs 10 billion railway land had been reclaimed and planning with Punjab was in progress on Lahore-Rawalpindi high-speed train, station upgrades, and suburban services. Besides, the Saryab-Kachlak and Quetta-Chaman sections will be upgraded in collaboration with Balochistan government. Prime Minister Shehbaz commended Railways Minister Haneef Abbasi for the pace of reforms and new projects in Pakistan Railways. The meeting was attended by Federal Minister for Railways Hanif Abbasi, Adviser to the Prime Minister Dr. Tauqir Shah, Minister of State for Railways Bilal Azhar Kayani, and relevant senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}