{
  "title": "UN’s FAO, GOP sign $5 million funding agreement for flood victims",
  "link": "https://www.app.com.pk/national/uns-fao-gop-sign-5-million-funding-agreement-for-flood-victims/",
  "date_published": "2023-03-01T06:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP): The Food and Agriculture Organization of the United Nations (FAO) and the Government of Pakistan have signed a $ 5 million funding agreement for a project to recover from the devastating floods that hit the country and Balochistan in particular, in 2022.\nThe collaboration between FAO and the Balochistan Agriculture & Cooperatives Department (BACD) represents the first time that FAO has received funds through a government in its role as a recipient of funding from the Asian Development Bank (ADB), said a press release issued here by FAO.\nA grant signing ceremony was held at the Economic Affairs Division (EAD) between the Government of Pakistan and ADB. Federal Secretary for Economic Affairs Kazim Niaz and Executive Director of Japan to ADB Takahiro Yashi, representative of the Japanese Embassy in Pakistan were also present on the occasion.\nThe project follows ADB’s approval of a USD 5 million grant to provide emergency flood assistance and strengthen the country’s disaster and climate resilience, and food security. The ADB Grant was in turn financed by the Japan Fund for Prosperous and Resilient Asia and the Pacific (JFPR) and is part of the larger USD 475 million Emergency Assistance Loan (EAL) and USD 3 million technical assistance grant approved by ADB in December 2022.\nThe assistance responds to the Government of Pakistan’s request to support its post-flood recovery and reconstruction efforts and is aimed at supporting the restoration of irrigation, drainage, flood risk management, on-farm water management, and transport infrastructure in the flood-hit provinces of Balochistan, Khyber Pakhtunkhwa, and Sindh.\nThe additional financing of the JFPR Grant expands the scope of ADB’s post-flood rehabilitation efforts, particularly by supporting the urgent provision of climate-resilient seeds for staple crop cultivation, women-led livelihoods to meet basic household needs, and incorporating measures to strengthen community resilience to disasters caused by natural hazards.\nThrough this project, FAO will ensure the provision of climate-adaptive rice seeds to 60,000 farm households for the next Kharif sowing season to increase productivity in four Balochistan districts most affected by the 2022 floods; Nasirabad, Jaffarabad, Usta-Mohammad and Sohbatpur.\nThe seeds will be sown over approximately 30 per cent of the total rice cropping area of the target districts. FAO will also support women’s livelihoods in agriculture by providing them with durable farming toolkits for facilitating farming activities and protective footwear for safer rice transplanting.\nThe project builds on FAO’s immediate response to the floods in Nasirabad division by supporting smallholder farmers in planting for the Rabi season.\nIt also reinforces the FAO Director-General’s pledge at the International Conference on Climate Resilient Pakistan last January in Geneva, when he ensured that: “FAO will continue to play a leading role in transforming Pakistan’s agri-food systems to make them more efficient, inclusive, sustainable and resilient, a challenge that has gained urgency following recent floods that have devastated the country’s agriculture sector.”",
  "retrievedAt": "2025-08-11T06:14:31.512Z"
}
