{
  "title": "Provincial Steering Committee to reinforce Balochistan RoLR",
  "link": "https://www.app.com.pk/national/provincial-steering-committee-to-reinforce-balochistan-rolr/",
  "date_published": "2023-03-01T07:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP): The Steering Committee on the Rule of Law Roadmap (RoLR) Balochistan convened its 6th session to celebrate the successful completion of the first five-year phase of reforms and launch a new chapter for the RoL Roadmap developed for 2023-26.\nThe key stakeholders renewed their commitment to advance evidence-based reforms in the rule of law sector with the aim of furthering public trust and confidence in law enforcement institutions in Balochistan, said a UNODC press release issued here.\nAdditional Chief Secretary Home & Tribal Affairs, Government of Balochistan Zahid Saleem praised all institutions and departments for their dedication in implementing key reforms under the roadmap.\nHe highlighted the importance of the new five-year chapter, which will build on the achievements of the previous phase to continue to strengthen rule of law, effective administration of justice and best practices for the benefit of all citizens, especially the most marginalized ones. He thanked the European Union for its financial support, as well as United Nations Office Drugs and Crime (UNODC) for their technical support.\nThe RoL Roadmap has adopted a results-based methodology to inform institutional decisions and improve system-wide performance.\nThe meeting provided a convergence platform to Rule of Law institutions and development partners to deliberate on the progress of the roadmap. Overall, the results of the first phase report an increase in the conviction rate from 20% in 2019 to 40% in 2023 for serious and violent crimes whilst the number of Under-Trial Prisoners (UTPs) reduced to 11.2% from 1122 in 2019 to 900 in 2023.\nFor the first time, the representatives of the Balochistan Police, Prosecution, Prisons, Levies, and Reclamation and Probation Departments presented their institutional progress against RoL provincial set targets. Challenges and successes of criminal justice institutions to address fundamental issues through sector coordination were shared. A way forward was also discussed for the implementation of RoLR against PKR 50 million allocated by the Government of Balochistan.\nThe 6th Steering Committee also highlighted other key successes, including 1) a 13.5% increase in forensic case submissions and a 1.11% increase in the number of female police officers in Balochistan; 2) a 5% increase in persons bailed by the Balochistan Levies Force and training of 135 Levies Investigation Officers including 7 women; 3) Prisons Management Information System (PMIS) installed and functioning in 11 prisons; 4) training of 153 prosecutors comprising of 88% men and 11.1% women participants; 5) MoU signed on September 5, 2022 between Police and Prosecution Departments to improve coordination and cooperation before, during, and after the investigations; 6) review of the Reclamation and Probation Act; and 7) a training on Legislative Drafting.\nSven Ruesch, Team Leader Governance and Education, EU Delegation in Pakistan recalled that good governance, including Efficient rule of law and human rights are among the key policy priorities of the EU-globally and in Pakistan. “The new rule of law roadmap sets important milestones for the Government of Balochistan to actively advance the delivery of justice, peace, and security for its people, particularly women and girls”, he stressed. “We are pleased to support you towards this shared objective.”\nIn addition to the EU Delegation, representatives from UN partner agencies of UNDP and UN Women were also present.\nMs. Jouhaida Hanano, Criminal Justice and Reforms Advisor from the UNODC Country Office in Pakistan, stressed the necessity for working through a shared responsibility to drive forward results-based change. She thanked the Government of Balochistan and RoL institutions for their steady commitment and the EU for its generous funding for continuing the momentous journey of the rule of law reforms for improved justice delivery to the people of Balochistan.\nThe meeting concluded with a launching ceremony of the curriculum, comprising of 12 training manuals developed in coordination and consultation with UNODC for the Criminal Justice Institutions of Balochistan. These specialized manuals have been developed and endorsed by the respective CJIs, to bridge knowledge and skills gaps of the relevant RoL Institutions at different levels. The objective is to institutionalize the integration of these manuals in the existing training regime of CJIs, covering the “Training of Trainers” and “Mentoring” phases for the sustainability of the initiative.\nMr. Ziaullah Langau, Minister of Home and Tribal Affairs for the Government of Balochistan, thanked all stakeholders for their contributions, particularly the EU for its financial support and the UNODC for its ongoing technical assistance. He emphasized the Government of Balochistan’s commitment to advancing the reforms under the Rule of Law Roadmap, and improving people’s lives through peace, security, and justice for all.\nThe 6th Steering Committee also highlighted ongoing achievements under the EU-funded ‘Deliver Justice Project’, as part of which 5 police stations have been refurbished and converted into Smart Police Stations and a Khidmat Markaz, offering speedy access to policing services for the citizens under one roof.\nSimilarly, the Balochistan Judicial Academy has been resourced with books and research material, and refurbished with furniture, IT support and digitalization, providing the basis for setting up a state-of-the-art Judicial Academy Library and Research Centre.\nThe Rule of Law Roadmap was initially approved for four years (2018–2022) and expired in May 2022. A recent evaluation of the Roadmap was carried out to inform a revised RoLR to build on the trajectory for another four years (2023–2026) in order to consolidate, sustain, scale up, and institutionalize good practices, and data-informed approaches in the justice sector of Balochistan.\nBoth the evaluation findings and the final RoLR were presented to and endorsed by the 6th Steering Committee. The revised document will be submitted to the Chief Minister of Balochistan to be presented to the cabinet for their approval.",
  "retrievedAt": "2025-08-11T06:14:32.507Z"
}
