{
  "title": "Zong 4G, knowledge platform launch “Zong Digital Scholars Program”",
  "link": "https://www.app.com.pk/national/zong-4g-knowledge-platform-launch-zong-digital-scholars-program/",
  "date_published": "2023-11-21T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): Zong 4G, Pakistan’s leading telecommunications company with the collaboration of Knowledge Platform, a prominent education technology company have launched the “Digital Scholars Program,” an innovative initiative aimed at transforming education in 60 schools, benefiting 3,000 students across Pakistan.\nZong Digital Scholars Program is a key component of Zong’s Sustainability Initiative to improve education in remote and under-resourced areas across Pakistan.\nThe schools were selected across the country in marginalized areas to provide technology-driven education. Previously, Zong 4G has worked with organizations such as PAGE, HANDS, and PBM to set up digital labs across the country to better equip and digitalize schools and vocational centres, said a news release.\nAt the heart of the Zong Digital Scholars Program is the Math Tutoring Program for Grades 9 and 10, developed in collaboration with Knowledge Platform and school teachers.\nAdditionally, the English & Sciences Self-study Program covers a comprehensive range of subjects, including Biology, Chemistry, English, General Science, Mathematics, and Physics for Grades 9 and 10.\nParticipating schools will have access to an array of resources, including lesson plans, assessment tools, and educational games and videos. Zong is committed to providing the necessary tools for schools to create a conducive learning environment.\nZong Digital Scholars program will present awards to recognize and celebrate high-performing students, teachers and schools on both a monthly and annual basis. This initiative highlights Zong’s dedication to encouraging excellence in education and acknowledging the efforts of those contributing to its success.\nThe official spokesperson for Zong 4G shared his thoughts on the partnership, “The partnership between Zong 4G and Knowledge Platform is reflective of our promise to leave a brighter future for future generations through Digital innovation.\nEducational empowerment is a key focus area for Zong and by providing Knowledge Platforms solutions to schools in marginalized areas, we can actively change the course of the lives of over 3000 students.”\nThe CEO and Founder of Knowledge Platform, Mahboob Mahmood also commented on the initiative saying, “We are thrilled to innovate with Zong 4G to develop a new model for edtech. Knowledge Platform and partner school teachers will work together with students. We will all teach and learn together. We will closely watch how this practice evolves so we can improve and scale our model.”\nZong 4G looks forward to the positive impact the Zong Digital Scholars Program will have on education in Pakistan.\nThrough this partnership, Zong aims to contribute to the development of a digitally literate and empowered generation, paving the way for a brighter future for the nation.",
  "retrievedAt": "2025-08-11T10:36:39.760Z"
}
