{
  "title": "ISSI signs MoU with Malaysia’s Institute of Advanced Islamic Studies",
  "link": "https://www.app.com.pk/national/issi-signs-mou-with-malaysias-institute-of-advanced-islamic-studies/",
  "date_published": "2023-11-21T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): Further strengthening its international collaboration, the Institute of Strategic Studies Islamabad (ISSI) has concluded a Memorandum of Understanding (MoU) with the Institute of Advanced Islamic Studies (IAIS), Malaysia.\nThe virtual ceremony, held simultaneously at the High Commission of Pakistan in Kuala Lumpur and Islamabad, marked a pivotal moment in the deepening ties between the two premier institutions, a news release said on Tuesday.\nSyed Ahsan Raza Shah, High Commissioner of Pakistan to Malaysia, expressed his great privilege in hosting the ceremony, emphasizing the strong cultural and research connections discussed during recent meetings between the two countries.\nDr. Maszlee bin Malik, Chairman of IAIS and former Malaysian Minister of Education, was warmly welcomed as a visionary scholar and key collaborator in fostering intellectual exchanges. The ceremony was attended by Director General ISSI Ambassador Sohail Mahmood and High Commissioner of Malaysia to Pakistan, Mohammad Azhar Mazlan, among other distinguished guests.\nHigh Commissioner Mazlan highlighted the long-standing ties between Malaysia and Pakistan, encompassing areas such as defence, economy, and education. He added that the signing of the ISSI-IAIS MoU was a testament to the shared commitment to enhance institutional collaboration, a goal reaffirmed during bilateral political consultations in March 2023.\nThe MoU is expected to pave the way for deeper engagement, understanding, and collaboration in research and cultural domains.\nIn his address on the occasion, DG ISSI Amb. Sohail Mahmood highlighted the historic Pakistan-Malaysia ties, shared faith and common values, growing bilateral economic collaboration, and convergence of views on key regional and international issues.\nHe also underscored the tradition of Pakistan and Malaysia always espousing the causes of the Muslim Ummah. Besides, he added, Malaysia was a crucial partner in the context of Pakistan’s ‘Vision East Asia’ policy and its desire for an elevated partnership with ASEAN. He expressed the confidence that the MoU would serve as a catalyst for intellectual exchanges, reinforcing better understanding and cooperation on bilateral, regional and international issues.\nHigh Commissioner Mazlan congratulated both institutes and highlighted the robust economic ties, with bilateral trade reaching new heights. He emphasized the immense potential for further collaboration, especially in areas such as education and cultural exchanges.\nDr. Maszlee bin Malik echoed the sentiment, envisioning the MoU as a starting point for future joint events, research activities, and conferences that would strengthen the bonds between Malaysia and Pakistan.\nDG ISSI Ambassador Sohail Mahmood thanked the two High Commissioners and all other contributors and emphasized the crucial importance of the MoU in reinforcing people-to-people links, research collaborations, and educational exchanges.\nHe extended a cordial invitation to Dr. Maszlee bin Malik to visit Pakistan at the earliest opportunity.\nThe ceremony concluded with expressions of gratitude and optimism for the future, symbolizing another milestone in the enduring friendship and cooperation between Malaysia and Pakistan.",
  "retrievedAt": "2025-08-11T10:36:39.024Z"
}
