{
  "title": "American-Pakistani tycoon donates $9 million for NUST scholarships",
  "link": "https://www.app.com.pk/national/american-pakistani-tycoon-donates-9-million-for-nust-scholarships/",
  "date_published": "2023-11-21T18:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): An American-Pakistani business tycoon, has contributed $9 million to Islamabad’s National University of Science & Technology (NUST) with the aim of providing scholarships to students from underprivileged backgrounds, enabling them to access quality education.\nNUST has confirmed that Tanweer Ahmed has entered into a partnership with the university through an Endowment Fund for unprivileged students which will benefit nearly 200 students who would be able to get scholarships every year. The $9 million donation is one of the single largest donations by any overseas Pakistani for any Pakistani university.\nTanweer Ahmed, in an interview said he plans to expand the scheme to other universities and to NUST where the donation scheme will run permanently. He said that a formal ceremony will take place at the NUST Islamabad next month which will be attended by Pakistan’s top leadership to formally launch the scholarship programme.\nThe Houston-based businessman said: “The deserving students would get scholarships annually through the Higher Education Commission (HEC). The system to obtain scholarships will be purely on merit and aimed strictly for those students who are unable to afford quality and expensive education. I decided to launch the Endowment Fund to assist the talented and deserving Pakistani students in order for them to make their mark in various advanced sectors such as Artificial Intelligence (AI), Information Technology (IT) and latest technologies. The future belongs to these sectors and Pakistan will benefit hugely from its youth.”\nTanweer Ahmed is an American-Pakistani businessman, investor, entrepreneur and philanthropist who works with major companies, not for profit organizations and hospitals. He is the owner of the largest cricket complex in Houston, the Prairie View Cricket Complex and the owner of the Houston Hurricanes cricket franchise. The multi-millionaire businessman is the founder of a brand of food chains and also owns many food chain franchises like Pizza Hut, Taco Bell and KFC. He owns California’s largest transport company and has business interests in the energy sector and medicine industry.\nTanweer Ahmed is credited for taking over $50 million dollars aid to Pakistan during the 2022 devastating floods in Pakistan.\nOriginally from Sialkot, he started off on a humble note in the US when he migrated as a student and worked in a restaurant. He was then promoted as a manager at the same restaurant. He then started his own restaurant business and has now set up multiple businesses and successful companies.\nIt’s his own humble background and practical knowledge of the realities in Pakistan that, he said, has inspired him to work for the Pakistani youth to empower them.\nHe said: “We didn’t have the opportunities 30 years ago that the students can have today. I don’t think there were many successful Pakistanis in the 90s in the US or Europe. Today there are thousands who have done well in life. I am just one of them. Many are helping Pakistan today with everything they can. More Pakistanis need to come out with their philanthropic efforts than ever before.”\nTanweer Ahmed said that overseas Pakistanis owe it to Pakistan to serve the country of their origin and identity. “We owe to our motherland because we are where we are because of Pakistan. Our best contribution can be made through empowering our youth with modern education and knowledge. I am happy to play my part in helping Pakistani youth in achieving their goals in life.”\nThis is not the first time Tanweer Ahmed has given money to Pakistan. He has set up a hospital in Sialkot.\nNUST Rector Engineer Javed Mahmood Bukhari said in a statement said that the project is going to perpetually benefit thousands of brilliant Pakistani boys and girls towards seeking world-class university education in coming years.\nThe NUST Rector said: “Tanweer Ahmed, a well-known Pakistani American, philanthropist-businessman from Houston USA, has partnered with NUST to support the financially challenged students. This is a unique initiative being the first of its kind, in any public sector university of Pakistan. Tanweer is making approximately nine million dollars’ worth of investment in the university’s science and technology park, such that 50% income of the project will go into a specially formed endowment for the students with humble financial background. The initiative has the potential of remarkable societal impact in terms of altering the lives of thousands of Pakistani families.”\nEngineer Javed Mahmood Bukhari added: “NUST takes pride in this transformational partnership with Tanweer Ahmed, which reflects on shared commitment to advancing educational equity while creating a positive economic impact. With approximately twenty thousand-student population, National University of Sciences and Technology (NUST) Islamabad is one of the most sought universities of Pakistan.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:36:58.167Z"
}
