{
  "title": "Mushaal shows concerns on HR violations against innocent Kashmiri Muslims in IIOJK",
  "link": "https://www.app.com.pk/national/mushaal-shows-concerns-on-hr-violations-against-innocent-kashmiri-muslims-in-iiojk/",
  "date_published": "2023-11-21T05:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): Special Assistant to Pakistan Caretaker Prime Minister on Human Rights and Women Empowerment, Mushaal Hussein Mullick Tuesday showed her deep concern over the reign of terror being perpetuated by Indian security forces against innocent Kashmiri Muslims in Indian Occupied Kashmir.\nTalking to a private news channel, she said that there is a need for international powers and UN agencies not to be silent spectators of the growing cemeteries of Palestinians and Kashmiris, but to wake up and raise their voices to stop atrocities on Kashmiris.\nThe Modi-led BJP government should refrain from implementing undemocratic, unconstitutional and cruel policies, dialogue is the only way forward for a just and lasting settlement of the Kashmir issue, she highlighted.\nThe world powers must use their influence to stop Israeli and Indian aggression, she demanded, adding, that it is also a question mark on the credibility of the United Nations.\nMushaal said that it is incumbent upon the international community to fulfil its responsibility in alleviating the suffering of the Kashmiri people and assisting them in realizing their fundamental right to self-determination.\nReplying to a question, she explained that the people of IIOJK have never bowed their heads in front of India, adding, that Kashmiris are sacrificing their lives and stand in front of brutal forces to face bullets for their sacred cause.\nThrough peaceful means including protests, they want to gain the response of the international community to end this long-standing dispute, she added.\nThe people of IOJK pledged to take the ongoing resistance movement to its logical end, she mentioned.",
  "retrievedAt": "2025-08-11T10:37:09.985Z"
}
