{
  "title": "No peace without settlement of Jammu & Kashmir issue: PM",
  "link": "https://www.app.com.pk/national/no-peace-without-settlement-of-jammu-kashmir-issue-pm/",
  "date_published": "2023-11-21T08:35:00.000Z",
  "source": "APP",
  "content": "RISALPUR, Nov 21 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday said peace in the region could not be guaranteed till the resolution of the dispute of Jammu and Kashmir between Pakistan and India.\n“Let me make it clear that there can be no peace without the settlement of the Jammu and Kashmir issue,” he said in his address at the graduation ceremony of the officers here at the Pakistan Air Force (PAF) Academy Asghar Khan.\nPM Kakar said Pakistan was a peace-loving nation and wished to maintain friendly relations with all countries, especially its neighbours.\nHe, however, categorically stated that the country’s desire for peace “must not be understood as weakness”.\nThe prime minister strongly condemned the ongoing grave human rights situation in the Indian Illegally Occupied Jammu and Kashmir.\nPakistan, he said, would not indulge in any arm race but would continue to enhance its capabitlity in line with evolving technology to deter any aggression.\nThe prime minister highlighted that the rapidly changing geo-strategic environment had a profound impact on Pakistan and rest of the region.\n“Therefore, the situation demands advancements in space networks, cyber technology, nano technology and artificial intelligence,” he said.\nHe expressed satisfaction that PAF modernized itself though smart induction of cutting-edge niche technology and achieved great progress in cyber space and non-contact warfare through indigenous means.\nPM Kakar termed the armed forces of Pakistan as professionally competent and well-trained to cope with all internal and external challenges.\n“The nation holds our armed forces in high esteem for the sacrifices they rendered for national defence and for their contribution towards nation-building,” he said.\nHe mentioned that the country’s brave armed forces always showed great courage during testing times to keep the national flag high.\n“I assure you that as a nation we have surmounted challenges in the past and Insha’Allah, we will do so in future and make the country prosperous,” he said.\nThe prime minister congratulated the cadets graduated from the colleges of flying training and aeronautical engineering and expressed confidence that they would give their best professional performance with commitment and diligence.\n“Being the custodians of the PAF, you carry the hopes of this nation and must work hard to keep abreast with modern technology and trends related to modern warfare,” he told the graduates.\nA total of 131 Aviation Cadets,  08 Gentleman Cadets and 03 Naval Cadets graduated during the ceremony. The prime minister awarded Branch insignias and trophies to the distinction holders.\nEarlier, Chief of the Air Staff Air Chief Marshal Zaheer Ahmed Babar Sidhu received the prime minister on the venue. Bugles were blown when PM Kakar as chief guest of the ceremony entered the arena. The prime minister onboard a PAF jeep inspected the formation of the smartly turned out contingents of the PAF falcons.\nThe prime minister awarded the prestigious Quaid-e-Azam Banner to the Champions No. 3 Squadron on its consistently best performance in all semesters. He also pinned badges on the professionally distinguished graduating cadets.\nThe Chief of the Air Staff trophies for best performance were given to Muhammad Moosa Jawad (best pilot), Muhammad Ali Gohar (general aviation), Sajid Sikandar Abbas (air defence), Syed Saad Ali (combat support) and Sohaib Saeed (aeronautical engineering).\nThe Swords of Honour were awarded to Aviation Cadets Ahmed Malik (flying) and Sohaib Saeed (engineering).\nThe prime minister witnessed the PAF Academy Aerobatics team “Bravehearts” presenting a spirit pass over the parade venue. Afterwards, a thrilling formation flying display by PAF Mirage, F-7PG, JF-17 and J-10C fighter jets captivated the spectators by showcasing PAF’s professional prowess.",
  "retrievedAt": "2025-08-11T10:37:00.410Z"
}
