{
  "title": "Pakistan needs serious in-house reset to achieve economic balance: Experts",
  "link": "https://www.app.com.pk/national/pakistan-needs-serious-in-house-reset-to-achieve-economic-balance-experts/",
  "date_published": "2023-11-21T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): “Pakistan needs a serious in-house reset and order amid improved governance to achieve an economic and geostrategic balance in the region.”\nThis was the crux of speeches at the plenary session on “Balancing Geostrategic and Economic Diplomacy” of the 26th Sustainable Development Conference organized by the Sustainable Development Policy Institute on Tuesday. The overarching theme of the conference this year is “Light at the End of the Tunnel: Hope in Times of Despair”.\nForeign Office Spokesperson Mumtaz Zahra Baloch, in her speech, said the Special Investment Facilitation Council (SIFC) was a commendable platform where international, federal, provincial, and local institutions were working together to enhance investment in the country.\nShe said the Foreign Ministry was training its diplomats in economic diplomacy. The bureaucratic adjustments were important as the ambassadors and diplomats needed to understand economic diplomacy, she added.\nFormer National Security Adviser Dr Moeed Yusuf said no relevant experts were deployed to the fields at the Pakistani missions abroad to promote economic diplomacy like IT or medical diplomacy.\nRegarding the Palestine-Israel conflict, he said it was important for Pakistan to take policy measures to safeguard its interests in the Middle East.\nHaroon Sharif, former Chairman of Board of Investment, said the geoeconomics was not a new topic but now it had changed its shape aggressively, whereas “Pakistan is stuck in a situation where there is liquidity in the region but its dynamics or nature has changed”.\n“We must react to this extraordinary shift in a non-traditional fashion as the country needs to make a different economic equation for all,” he added.\nChairman of SDPI Board of Governors Shafqat Kakakhel, in his welcome remarks, said the climate diplomacy had emerged as a new form of diplomacy, where it was not only to safeguard national security interests of the country but also ensure its commercial, and economic cooperation with the international community.\nLater, experts at the session on “Green Transition in South Asia” called upon the policy makers to build gender empowerment perspective in the disaster management and resilience policies in Pakistan.\nDeputy Director, Foreign, Commonwealth and Development Office (FCDO), Sandra Baldwin, said during the recent devastating floods in Pakistan, more girls were dropped from schools and after few months when the schools reopened, very few of them returned to schools in the affected areas.\nShe stressed that gender responsive disaster management was essential in tackling inequality as women and girls were more vulnerable.\nHamid Yaqoob Sheikh, team leader at Revenue Mobilisation, Investment and Trade (REMIT), said, “The programme works towards increasing the number of taxpayers to strengthen tax revenue mobilization, besides addressing investment climate challenges faced by local and international businesses and reducing barriers to trade and drive competitiveness, thereby increasing exports to reduce Pakistan’s trade deficit.”\nBOI’s Additional Secretary Ambreen Iftikhar said women could play a key role in achieving Sustainable Development Goals (SDGs) by contributing to the pre and post disaster risk management, as they had more first-hand knowledge and information in that regard.\nManaging Director of National Institute of Baking and Finance (NIBAF) Riaz Nazar Ali Chunara, said the State Bank of Pakistan (SBP) was diligently working toward digitalization of economy and banking sector.\nAt another session on “Tobacco Taxation –Light at the End of Health and Poverty Tunnel”, the experts called for implementing strict regulation and punitive measures to reduce the usage of tobacco to eliminate its socio-economic hazards.\nThey warned that the use of tobacco products was leading to 80 million deaths per year across the low and medium-income countries and over 160,000 people were dying each year in Pakistan due to tobacco borne diseases.\nDr Wasim Iftikhar Janjua from SDPI said that tobacco industry was building a deceptive narrative about the use of tobacco products to enhance their sales by misleading the youth and general folk.\nBlanca Llorente, Fundacion Anaas, Colombia, who participated in the discussion via videolink, said that from 2010-23, Colombia followed three different tracks – government intervention, local research and civil society’s continuous advocacy for major tax increase on tobacco products.\nAsif Iqbal, SPDC Executive Director, said,”Every 50 individuals among 1,000 use tobacco products and more than 30 million people are tobacco users in the world causing around 160,000 deaths every year.”\nDr Syed Kaleem Imam, former Secretary of Ministry of Narcotics Control, said cigarettes were expensive in the United States whereas tobacco sector here was involved in tax evasion.\nKhurram Hashmi of Vital Strategies stressed the need for enhancing knowledge base, including literature against tobacco usage in curriculum, and engage all stakeholders to enhance complained against illicit trade of tobacco.\nSpeaking at another session titled: “Prosperity for Pakistan: Policy Agenda for the Incoming Government”, Senator Dr Musadik Malik said that the country needed to focus more on its water productivity, agriculture yield and the rising young entrepreneurs and startups linked to small and medium enterprises (SMEs) to ensure its economic sustainability and revival.\nAisah Ghaus Pasha, former Minister of State for Finance and Revenue, said the country would have faced great inflation, unemployment and public unrest if the default had not been averted.\nShe added that the IMF bailouts were needed to manage the fiscal issues of the country whereas it was necessary to implement quick and precise policy decisions.\nSaleem Mandviwalla, former Minister of State for Finance, said governance was the core issue of the country and the past 16 months were crucial to save the country from default. However, he said, lack of governance, political instability and bureaucratic hiccups needed to be addressed for a better economic system and betterment of the country.\nMian Iftikhar Hussain, Secretary-General of Awami National Party (ANP), said fear and security were the main issues of the Khyber Pakhtunkhwa province with poor water governance further aggravating the crisis as almost 80 per cent of the freshwater is wasted due to poor storage capacity.\nHe regretted that the IMF had directed the government to provide relief to the poor, but the budgets presented at the floor of parliament were merely a play of words.\nSenator Taj Haider of Pakistan People’s Party (PPP) said the economic build-up should be the priority to be addressed on war footings as it was an existential threat if left unattended.\nFormer SAPM on Youth Affairs Shaza Fatima Khawaja stressed the need to ensure the ease of doing business, consistent policies, youth-led policy, and e-governance whereas progressive taxation and targeted subsidy to improve the economy of the country.\nCountry Representative, UNDP-Pakistan, Samuel Rizk, appreciated the political leadership’s discourse on core issues of public interest. He suggested the stakeholders to adopt a social and political contract to make the government’s decision for the benefit of the unserved and the poor.\nAt another session, titled: ‘Towards Affordable and Resilient Food System in Pakistan,’ the experts said women engagement was the key to gender equality in the context of food security, as Pakistan’s food systems were vulnerable to shocks which has profoundly affected the nutrition of individuals, especially women hence impacting their future resilience.\nProf Dr Tariq Mukhtar, Dean, Faculty of Agriculture, PMAS-Arid Agriculture University, Rawalpindi, said from global perspective, an overall 3.1 billion population was unfortunately unable to afford healthy diets as per 2021 data.\nIn addition, he said, the vulnerability of Pakistanis also increased in the aftermath of Russia and Ukraine war that led to sharp increase in the commodity prices world over.\nDr Lawrence Haddad of Gian International said,” Malnutrition is the intergenerational transmission mechanism for making fragility today, translates into fragility tomorrow and so good nutrition can be the way to break that intergenerational cycle and make resilience today and equal resilience tomorrow.”\nJamie Morrison of Gain International talked about the issues emerging within the ecosystem and how to develop partnerships. “We would also suggest that all organizations within the ecosystem of support must take lead from national government and ideally through the National Convener, who is coordinating and also responsible for facing action on food system transformation within the country.”\nHe also stressed the need for access to data.\nDr Shaheen Ashraf Shah of World Food Programme said women farmers’ condition in Pakistan was very poor and there was urgent need for their financial inclusion and skill development.\nHowever, she said, women had a very low number of employments within the country’s systems be it food systems or the transportation system. She said bringing more women in the institutions would be the first indicator for substantive change.\nAt a session titled: Empowering Communities: Poverty Graduation in Pakistan’ PPAF CEO Nadir Gul Barech said their strategy was based on five key values of inclusion, participation, transparency, accountability and stewardship. He said his organization has provided around three million interest-free loans wherein 55 per cent beneficiaries were women.\nProf Dr Imran Rasul from University College London, UK talked about the impact of interventions on economic attitudes. He said that economic attitudes could be understood in three sets, i.e. redistributive preferences, pro-market beliefs, and trust in neighbours. A social protection programme was a central policy issue for governments throughout the developing world, he quoted.\nDr Kate Vyborny from South Asia Region Gender Innovation Lab, TWA, USA highlighted the role of community institutions in fostering social and economic empowerment.\nDr Ayesha Khan from AHKF said that community institutions of the poor were either very weak or altogether missing. As a result, NGOs stepped in to fill the gap. She said that the task of NGOs was to facilitate the transitioning of the community institutions and strengthen them. The success of this transition depended on community participation, she added.",
  "retrievedAt": "2025-08-11T10:36:38.441Z"
}
