{
  "title": "Surrender of illegal arms must for peace in Kurram: official - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Chief Secretary Nadeem Aslam Chaudhary has stressed the need for surrendering all illegal weapons to ensure permanent peace, safe travel and enforcement of law and order in volatile Kurram tribal district.\n\nAddressing the participants of Kurram grand jirga at commissioner’s house in Kohat, on Tuesday evening, he highlighted the importance of cooperation by community for resolving conflicts, according to a statement.\n\nThe meeting was attended by Inspector General of Police Akhtar Hayat Khan, Kohat GOC Zulfiqar Ali Bhatti, Kohat Commissioner Syed Mutasim Billah Shah, RPO Abbas Majeed Marwat, Deputy Commissioner Abdul Akram and prominent parliamentarians from Kurram tribal district. The chief secretary said that e the ongoing conflict in Kurram appeared to involve two groups but extremist elements were attempting to exploit the situation to fuel hatred.\n\nHe called upon both parties to identify and isolate such elements to prevent them from succeeding in their malicious designs.\n\nHighlighting the government’s commitment, he reiterated that the Kohat peace agreement would be implemented at all costs, with full cooperation from all relevant parties. “Understanding and tolerance are imperative to protect our areas and people. This situation must not be taken lightly,” he added.\n\nThe chief secretary said that rule of law would be upheld without exception. “Strict legal action will be taken against anyone violating government orders or laws. FIRs are not mere formalities; they will be executed and culprits will face severe punishment,” he warned.\n\nEmphasising unity and collective responsibility, he called on the youth of Kurram to actively participate in peace-building efforts and urged both sides to work closely with the government to maintain law and order in the region.\n\nEarlier, the chief secretary along with the police chief visited Hangu district where they reviewed the facilities at a temporary relief camp established for families evacuated from certain villages in Kurram.\n\nExpressing satisfaction with the arrangements, he met with displaced people and assured them that government would address their issues.\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:02:55.553Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888282/surrender-of-illegal-arms-must-for-peace-in-kurram-official",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:04:16.000Z"
}
