{
  "title": "Govt removes Ahmed Ishaq Jahangir as DG FIA - Pakistan - DAWN.COM",
  "author": null,
  "content": "The government removed Federal Investigation Agency (FIA) Director General Ahmed Ishaq Jahangir from his position on Wednesday amid ongoing action against other officials of the watchdog.\n\nAccording to a notification by the Cabinet Secretariat, Jahangir, a BS-21 officer of the Interior Division was transferred and posted as an Officer on Special Duty (OSD) in the Establishment Division “with immediate effect and until further orders”.\n\nOnce an officer is made an OSD his services are put on hold indefinitely without assigning any reason.\n\nThe FIA had dismissed 13 of its officials a day earlier and stopped the promotions of three constables said to be involved in the Greek boat tragedy in 2024.\n\nFive Pakistani citizens perished after their boats capsized near Greek islands in December 2024. More than 80 Pakistanis, including minors, were aboard the unfortunate vessels, which capsized in the Mediterranean.\n\nEarlier, 37 officials suspected to involvement in these incidents were dismissed from their service. According to the FIA, action against officials is being carried out on the instructions of Prime Minister Shehbaz Sharif.\n\nThe move against the 13 officials came after Jahangir held departmental proceedings against them. A spokesman said that eight constables, two head constables, one inspector and two sub-inspectors were fired. The DG also issued directives to stop the promotion of three constables.\n\nEarlier this month, 65 FIA officials were blacklisted for posting at any immigration checkpost and anti-human trafficking circles in the country in the light of the inquiry into the Greece boat tragedy.\n\nThe blacklisted individuals included three deputy directors, two assistant directors, four inspectors, 15 sub-inspectors, 13 assistant sub-inspectors, 20 head constables, eight constables and one clerk. Most of them belong to the Karachi and Gujranwala zones of the FIA.\n\nJahangir was posted as interim FIA DG in January 2024 by the caretaker government.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:00:42.560Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888445/govt-removes-ahmed-ishaq-jahangir-as-dg-fia",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T11:30:15.000Z"
}
