{
  "title": "Minor egg seller among two gang-raped in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: Two persons, including a minor boy, were subjected to gang rape in Bahawalpur and Vehari district’s area of Karampur in Mailsi tehsil.\n\nTwo persons allegedly gang-raped a 12-year-old egg-seller at the General Bus Stand in the limits of Civil Lines police station, Bahawalpur, on Monday night.\n\nAccording to police spokesperson, the victim studies in a seminary during day-time and sells boiled eggs at night at the general bus stand.\n\nOn Monday night, when he was selling eggs, three suspects sitting in a van demanded eggs from him.\n\nAs he boarded the van, two of the suspects raped him, while their third accomplice stood guard outside the van. Police have yet to arrest the suspects.\n\nIn another incident, two friends took a tailor-master to a graveyard in Mailsi tehsil’s Karampur area where they criminally assaulted him after tying with a rope.\n\nThe accused also shaved his eyebrows and moustaches besides making his video and threatened him with dire consequences if he disclosed it to anyone. Karamopur police registered an FIR.\n\nINQUIRY: The committee, set up on chief minister’s directive, has completed its inquiry into the alleged theft of 29,000 insulin vials worth Rs25 million from the Multan health department during the previous months.\n\nA source, on the condition of anonymity, said the committee in its report held a former\n\nCEO of Multan district health authority and an ex-DHO responsible for negligence and poor performance and recommended action against them.\n\nThe source said the committee recommended compulsory retirement of the former CEO and forfeiture of three-year service of ex-DHO.\n\nIt may be mentioned when the scandal was unearthed both were placed under suspension and after issuance of show-cause notices, they were also given an opportunity of personal hearing by the committee.\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:03:10.175Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888391/minor-egg-seller-among-two-gang-raped-in-punjab",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:01:54.000Z"
}
