{
  "title": "Nearly 40 bodies brought to morgue after stampede at India’s Kumbh Mela - World - DAWN.COM",
  "author": null,
  "content": "Dozens of people were killed in a pre-dawn stampede at the Maha Kumbh Mela in northern India on Wednesday, police sources and a Reuters witness said, as tens of millions gathered to take a dip in sacred river waters on the most auspicious day of a six-week Hindu festival.\n\nBodies were still being brought to the local Moti Lal Nehru Medical College hospital morgue more than 12 hours after the tragedy at the world’s biggest gathering of humanity, although authorities were yet to officially announce the casualty numbers.\n\nNearly 40 bodies were brought to the morgue, three police sources told Reuters.\n\nA Reuters witness counted 39 bodies inside the morgue. One of the three police sources and a fourth officer said all 39 were stampede victims.\n\n“More bodies are coming in. We have nearly 40 bodies here. We are transferring them out as well and handing over to families one by one,” one of the sources said.\n\nThere were 15 ambulances outside the morgue and about half a dozen people looking inside for their loved ones.\n\nSenior police officer Vaibhav Krishna said when he was reached for comment that police could not give the official numbers because they were busy with crowd management.\n\nDistraught relatives queued up to identify those killed by the stampede, which occurred when crowds surged towards the confluence of three rivers, where immersion is considered particularly sacred.\n\nSome witnesses spoke of a huge push that caused devotees to fall on each other, while others said closure of routes to the water brought the dense crowd to a standstill and caused people to collapse due to suffocation.\n\n“There was commotion, everybody started pushing, pulling, climbing over one another. My mother collapsed…then my sister-in-law. People ran over them,” said Jagwanti Devi, 40, as she sat in an ambulance with the bodies of her relatives.\n\nSaroja, who had traveled for the festival from the southern city of Belagavi and gave only her first name, blamed police for the deaths of four members of her family.\n\n“Police didn’t make proper arrangements. They are responsible for this,” she wailed. Police have said they are doing all they can to manage the vast crowds.\n\nAn official at Prayagraj’s SRN Hospital, where some of the injured were taken, said those who died had either suffered heart attacks or had comorbidities like diabetes.\n\n“People came in with fractures, broken bones…Some collapsed on the spot and were brought dead,” said the official, who did not want to be named.\n\nPrime Minister Narendra Modi offered condolences to “devotees who have lost their loved ones”, without specifying the number of dead.\n\nYogi Adityanath, chief minister of Uttar Pradesh state where the festival city of Prayagraj is located, said the stampede was set off when some devotees tried to jump barricades put up to manage crowds.\n\nAt the scene after the stampede, some people sat on the ground crying, while others stepped over belongings left by those trying to escape the crush.\n\nThe Hindu festival is expected to draw some 400 million people overall, according to officials, compared with the Haj pilgrimage in Saudi Arabia which drew 1.8 million last year.\n\nBy Tuesday, nearly 200 million people had attended the festival since it started two weeks ago, officials said, adding that more than 57 million people had taken a holy dip until 4pm (3:30pm PKT) on Wednesday alone.\n\nDevout Hindus believe taking a dip at the confluence of three sacred rivers — the Ganga, the Yamuna, and the mythical, invisible Saraswati — absolves people of sins and, during the Kumbh, also brings salvation from the cycle of life and death.\n\nAttendees this year ranged from Defence Minister Rajnath Singh and Home Minister Amit Shah to Adani Group Chairman Gautam Adani and celebrities like Coldplay’s Chris Martin, who local media reported reached Prayagraj on Tuesday.\n\nModi was expected to visit the festival next month.\n\nAuthorities had expected a record 100 million people to throng the temporary township in Prayagraj on Wednesday, and had deployed additional security and medical personnel along with AI-software-based technology to manage the crowd.\n\nA Rapid Action Force (RAF) — a special police unit called in during crisis — was deployed to bring the situation under control after the stampede and the ‘holy dips’ were also closely regulated, with devotees going first and ascetics beginning their processions only after devotee numbers reduced.\n\nTelevision visuals showed scores of ascetics, smeared in holy ash or wearing saffron, moving towards the confluence as security personnel and dense crowds of devotees looked on and helicopters showered petals from above.\n\nSocial media posts spoke of heavy traffic congestion on roads leading into Prayagraj as authorities tried to manage the crowd, leaving several people stranded.\n\n“I planned this trip for over a year, but Ive been stuck in traffic for 19 hours,” American travel blogger Drew Binsky said on Instagram, where he has more than 1.2 million followers.\n\nOpposition parties blamed the stampede on what they called the government’s “mismanagement” and “VIP culture”.\n\n“VIP culture should be curbed and the government should make better arrangements to meet the needs of common devotees,” Rahul Gandhi, leader of main opposition Congress party, said on X, referring to politicians and celebrities being treated differently.\n\nA similar stampede on the most auspicious day of the festival when it was last held in 2013 had killed at least 36 pilgrims.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/29172704d492faa.jpg",
  "retrievedAt": "2025-08-26T08:00:41.854Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888432/nearly-40-bodies-brought-to-morgue-after-stampede-at-indias-kumbh-mela",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T08:13:25.000Z"
}
