{
  "title": "CL first phase set for frantic finale after UEFA reforms hit mark - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: The Champions League reform drew criticism because it added to an already packed calendar, yet the new league phase of this season’s expanded competition is all set for a frantic conclusion on Wednesday as 18 matches are played simultaneously across Europe and the likes of Manc­hester City and Paris St Germain battle to avoid an early exit.\n\nAfter seven rounds, only two teams — Liverpool and Barcelona, on a maximum 21 points and 18, respectively — have secured direct access to the last 16 while 25 of the 36 teams are still awaiting their fate, including powerhouses Bayern Munich, Real Madrid and City, the latter being in the elimination zone ahead of their home game against Club Brugge.\n\nThe idea that the new format was giving an easy pass to the knockout phase to the big sides has been brushed aside with Juve­n­tus and PSG beyond the top 16.\n\nThe first eight teams qualify directly for the last 16 with the eight remaining spots being deci­ded in playoffs to add some more drama.\n\nArsenal, Inter Milan, Atletico Madrid, AC Milan, Atalanta and Bayer Leverkusen occupy the other six spots for now, but so much could change on the final night.\n\nAfter all, VfB Stuttgart in 24th position are only three points behind Leverkusen in eighth, with 15 sides in between them.\n\nArsenal and Inter, on 16 points, need only draw away to Girona and at home to Monaco respectively in order to secure their last-16 spots.\n\nAtletico and Milan also look strong on 15 points. Atletico finish at already-eliminated RB Salzb­urg, and Milan go to Dinamo Zagreb, who are 26th and must win to stay in contention. Atalanta in seventh place, on 14 points, have a tough assignment at Barca.\n\nWith so little between teams in terms of points, so much could down boil down to goal difference, setting up a potentially chaotic final night.\n\nIt is the kind of scenario UEFA wanted from the refreshed format, where it has been hard to predict how many points are needed for a top-24 place.\n\nBack in August, simulations by UEFA stats geeks suggested eight points would be enough to enter the playoffs round.\n\nNow it looks like the 25th-place team will go out with 10 or even 11 points. It could be PSG or City, who are currently 25th.\n\n“What a beautiful format, it’s a real treat,” Canal Plus pundit and for­mer Tottenham Hotspur great David Ginola said after PSG beat City 4-2 last week, setting the stage for a nail-biting finish for both sides.\n\nThe draw, with teams also facing sides from their own pot, meant that some top clubs played each oth­­er as early as the initial phase, as Liverpool manager Arne Slot noted.\n\n“If I look at Paris St Germain, every week I think they have the hardest team to face, so they are quite low on the table, which is not their quality, but they are low,” Slot said.\n\nThe previous format, with four teams in each group and the top two advancing into the knockout pha­se, was a quasi-guarantee for the privileged and featured num­erous dead rubbers on the final day.\n\nIt will not be the case this year, with only Sturm Graz v RB Leipzig and Young Boys v Red Star Belgrade the only encounters with nothing at stake.\n\nBig names like reigning champions Real, last season’s runners-up Borussia Dortmund, Bayern and Juventus are all still hoping to clamber into the top eight, but are already guaranteed to at least be in February’s play-off round.\n\nIn fact, only nine of the 36 teams will come into the final matchday still fighting to secure qualification for the next phase, including former European Cup winners PSV Eindhoven and Benfica.\n\nThe biggest name under threat is City, with the 2023 champions currently languishing two points outside the qualifying spots, having taken a single point from their last four games in the competition.\n\n“Today we don’t deserve it,” Guardiola said when asked following the PSG defeat if the new format was fair. “What is the argument that it isn’t fair? I said to the players to accept it and recover. We have to recover our game, that is what we have to do.”\n\nThere is jeopardy for City, but at the same time they know a win in their last match will take them through, and they will be expected to overcome Brugge at the Etihad.\n\nPSG’s win at home to City eased their fears of being eliminated, although it could still happen — the French champions go to Stuttgart, where a draw will be enough to take both teams through.\n\nSporting Lisbon in 23rd will advance with a win at home agai­nst Bologna, and 20th-placed Benfica might need just a point at Juventus.\n\nFor others, the heaviest price to pay for inconsistent results in the league phase will be having to go into the play-offs.\n\n“The table does not lie. At the moment we aren’t a top team. Top teams don’t lose as many games. But we still have the feeling that we’re in a process and on a good path,” said Bayern’s Joshua Kimmich after his team’s 3-0 loss at Feyenoord last week.\n\nThe teams finishing from ninth to 24th in the standings will go into Friday’s draw for the play-offs, with the first legs to be played on February 11 and 12 and the return matches a week later.\n\nThe teams finishing between ninth and 16th will be seeded, and the draw will be based on a pre-determined bracket. This means the teams finishing ninth and 10th will face the side either in 23rd or 24th place, while 15th and 16th will face either 17th or 18th.\n\nThere is nothing to stop teams from the same country facing each other, and teams can also be drawn against opponents they already met in the league phase.\n\nMuch is bound to change on Wednesday, but based on the current standings PSG could play French rivals Lille in the play-offs, while Bayern or Real could play Juventus or Celtic.\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67994fdc8e056.gif",
  "retrievedAt": "2025-10-12T01:02:52.434Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888317/cl-first-phase-set-for-frantic-finale-after-uefa-reforms-hit-mark",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:03:40.000Z"
}
