{
  "title": "‘A man for all seasons’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE controversy surrounding the recent visit of the federal interior minister to the US highlights the prevailing mess in our system of governance, particularly in foreign policy matters.\n\nOften described as ‘a man for all seasons’, Mohsin Naqvi landed in Washington in the midst of a transition of power in that country. He was certainly not among the few foreign dignitaries who were officially invited for the inauguration ceremony. His presence in the capital during the event generated all manner of speculation.\n\nIt’s still not clear whether he was on an official visit. Naqvi said the purpose of his visit was to “develop an effective plan against terrorism through cooperation with American politicians”.\n\nIndeed, he met a few Congressmen. But the messages posted on X by two lawmakers after the meeting indicate that there was hardly any serious discussion on the issue; instead, they expressed concern over the continued detention of former prime minister Imran Khan.\n\nInterestingly, Pakistan’s Foreign Office distanced itself from the home minister’s visit, which also seems to have to do with our relations with the US. An FO spokesman was quoted as saying that the department had nothing to do with the minister’s visit, raising the question as to whose brilliant idea it was to send him to Washington at the time of a power transition there.\n\nThe issue of terrorism and Afghanistan, which Naqvi said was his main point of discussion with Congressmen and others in Washington, cannot be separated from the wider issue of our relationship with the new US administration. He obviously did not meet any senior official of the new administration that is still taking shape.\n\nIt was evident that Naqvi who wears many hats — from interior minister to head of the Pakistan Cricket Board — is least versed in matters of diplomacy. The new kid on the block, who many believe is being propped up by the establishment, seems to have little understanding of the complexity of external relations. His participation at an event in Washington last week has generated massive controversy.\n\nMohsin Naqvi’s faux pas has caused huge diplomatic embarrassment to Islamabad.\n\nNaqvi claimed it was a youth event but a banner seen in a picture of him at the occasion reads ‘New Federal State of China’, showing the right-wing lobbyist that is working to topple the communist regime in Beijing as one of the sponsors of the event. It may not have been intentional but the faux pas has caused huge diplomatic embarrassment to Islamabad.\n\nThe incident could have serious implications for our relations with our closest ally. A major question pertains to who planned his engagements in Washington. Such ministerial visits to an important capital are generally planned very carefully. While Pakistan’s ambassador accompanied the minister to meetings with the Congressmen, it is not clear whether he was with him at this event.\n\nUnsurprisingly, the episode generated intense controversy on social media. No one but the minister is to be blamed for the embarrassment caused. He chose to visit Washington with no clear agenda at a highly critical juncture of Pakistan’s relations with the US.\n\nWhile the minister was still in Washington, a group of US lawmakers and rights activists at a briefing on Capitol Hill called for stopping the military trial of political activists in Pakistan and ending the persecution of opposition leaders. Surely the briefing was organised by expat PTI supporters, but it also indicates an increasingly unfavourable situation in Washington for the Pakistani government.\n\nIt’s unfortunate that the power struggle within Pakistan manifests itself outside. Last year, dozens of US lawmakers wrote a letter to the then US president calling for the release of Imran Khan. Some analysts noted that it marked the first such collective call from multiple members of the US Congress for the release of the leader who has been a strong critic of US foreign policy.\n\nKhan’s latest conviction in the Al Qadir case and the military trial of PTI workers have not gone down well on Capitol Hill. In an interview to Voice of America, Congressman Joe Wilson said he told Naqvi that relations between Islamabad and Washington could only improve with Pakistani institutions following the rule of law. He also called for the release of Imran Khan.\n\nSimilar comments were made by another Congressman after his meeting with Pakistan’s home minister. If the purpose of Naqvi’s meetings with the US lawmakers was to clarify the allegations of repression against his government, then he failed miserably in his mission as reflected in the statements of the US lawmakers.\n\nIt seems that the establishment was in a bit of panic by the post on X by Richard Grenell, an aide of President Donald Trump, and the statement by US lawmakers calling for the release of Imran Khan. That could be the reason for dispatching the interior minister to Washington for an early engagement with the Trump administration. But the move failed badly.\n\nWith no connections in Washington and no experience of diplomacy, Mohsin Naqvi should have been the last man for the job that required a more sophisticated approach. He didn’t meet anyone in the new administration. The timing of the visit was hardly appropriate. Surely Pakistan needs to engage with the new US administration but there is a correct way to go about it. It should be the responsibility of the foreign ministry to formulate a clear policy strategy to engage with Washington. Unfortunately, there is no clear thinking on that.\n\nThere is also the question of who runs our foreign policy. It was apparent that the FO was not in the loop regarding the home minister’s Washington visit. The controversial visit reflects a broken policymaking process that will cost the country dearly. Foreign policy begins at home and we need to first fix our affairs internally. A politically unstable country with no respect for the rule of law cannot earn respect abroad.\n\nThe writer is an author and journalist.\n\nzhussain100@yahoo.com\n\nX: *@hidhussain*\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6799567c89400.jpg",
  "retrievedAt": "2025-08-26T08:00:44.364Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888351",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:02:38.000Z"
}
