{
  "title": "Three terrorists killed in Bannu operation, says ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Two soldiers martyred, five attackers neutralised as Qila Abdullah attack repulsed\n• Levies official gunned down in Turbat\n\nLAKKI MARWAT / QUETTA: Three terrorists were killed and nine others injured in an intelligence-based operation in Janikhel town of Bannu district, the army’s media wing said on Tuesday.\n\nIn a statement, the Inter-Services Public Relations (ISPR) said the operation was launched following reports of the presence of ‘khwarij’ (an official term used for banned outfits) in the area. It added that security forces effectively eng­a­ged the location, neutralising three terrorists and injuring nine others in the exchange of fire.\n\nThe ISPR said a sanitisation operation was underway to eliminate any remaining militants, with security forces determined to eradicate terrorism from the country.\n\nEarlier, a Frontier Consta­bulary soldier was martyred when militants attacked an FC post in the Baran Dam area of Bannu district late on Monday night.\n\nAn official source confirmed the attack, stating that the assailants used both light and hea­vy weapons in an attempt to breach the post. The FC personnel effectively engaged the attackers, and the fire exchange continued for some time.\n\nThe source said that a successful retaliation by the FC personnel forced the assailants to flee. Five FC personnel were injured during the gun battle and were shifted to a hospital.\n\nTwo soldiers martyred\n\nMeanwhile, two soldiers were martyred and five terrorists, including two suicide bombers, were killed in a heavy gun battle between security forces and khwarij during an armed attack on a Frontier Corps security check post in the Gulistan area of Qila Abdullah, a district of Balochistan bordering Afghanistan, the ISPR said on Tuesday.\n\nIn a statement, the ISPR said that during the night of Jan 27-28, khw­arij attempted to attack a security post in the general area of Gulis­tan in Qila Abdullah. However, it added, the attempt was thwarted by Pakistani troops, which forced the terrorists to ram an explosive-laden vehicle into the post’s boundary wall.\n\nThe statement said in the ensuing firefight, all five terrorists, including two suicide bombers, were neutralised.\n\nDuring the intense exchange of fire, two soldiers — Naik Tahir Khan (age 39, resident of Tank district) and Lance Naik Tahir Iqbal (age 26, resident of Karak district) — sacrificed their lives.\n\nLevies official shot dead\n\nIn a separate incident, unknown armed men gunned down a Levies Force official in Kalatak Bazaar area of Turbat, police said on Tuesday.\n\nThe Levies official, identified as Ghulam Jan, was targeted while he was on his way home. He sustained multiple bullet injuries and died on the spot.\n\nPolice said it appeared to be a case of target killing. No group has claimed responsibility for the murder.\n\nBehram Baloch in Gwadar also contributed to this report\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:01:21.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888339/three-terrorists-killed-in-bannu-operation-says-ispr",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T02:35:33.000Z"
}
