{
  "title": "Governor Kundi lambasts PTI govt for ‘all-out failure’ in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: Khyber Pakhtunkhwa Governor Faisal Karim Kundi has hit out at the PTI-led provincial government over its failure to ensure peace in the province.\n\nAddressing a press conference at Gomal University in Dera Ismail Khan on Tuesday, the governor said the PTI government’s performance was “poor on all fronts”.\n\nHe also raised concerns about the weaknesses of Khyber Pakhtunkhwa’s police force, saying the provincial government has received an additional Rs500 billion under the National Finance Commission (NFC) award during the last 13 years.\n\nYet, the salaries of KP police were low compared to their peer from other provinces, he claimed.\n\nLaments weakness of police despite ‘extra funding of Rs500bn’ from Centre\n\n“The KP police force does not have modern equipment or bullet-proof vehicles,” he claimed, urging the provincial government to support the police and other law enforcement agencies to combat terrorism effectively.\n\nMr Kundi said he attempted to play a role in establishing peace by calling a conference with representation from political parties across the board.\n\nThe conference convened at the Governor House was attended by all political parties of the province except the PTI, Mr Kundi added.\n\nOn the other hand, the governor said that the KP Chief Minister Ali Amin Gandapur called a meeting at KP House, Islamabad, and “only invited five or six parties”.\n\nMr Kundi described it as “an attempt to create division”.\n\nHe also discussed ongoing development projects in the province, including the Chashma Lift Canal being funded by the Saudi Bank.\n\nThe project would bring a “green revolution” in the region.\n\nHe also accused the provincial government of “creating hurdles” in the construction of an international airport in Dera Ismail Khan.\n\nPTI ‘accepted’ Imran’s sentence\n\nGovernor Kundi also claimed that PTI was repeatedly seeking a deal to end its legal challenges in the name of negotiations.\n\n“I always tell them these cases would be dealt with in the courts,” he said.\n\nReferring to the 14-year imprisonment handed to PTI founder Imran Khan in the 190 million pound case, Mr Kundi said his party did not hold any protest against the verdict, which meant “they have accepted the decision”.\n\nOn the issue of negotiations with Afghanistan, the governor reiterated Pakistan’s clear stance that Afghan soil should not be used for attacks inside the country.\n\nHe referenced previous negotiations by the PTI’s government with terrorists, noting that these groups later took up arms again.\n\nReplying to a question about the amendments to the Prevention of Electronic Crimes Act, 2016, he assured the government would address the grievances of journalists through dialogue and negotiations.\n\nSeraiki province\n\nThe governor also stressed the need for unity among all the stakeholders to create the South Punjab province.\n\nHe made these remarks while addressing the ‘8th Annual Azeem Seraikistan Talent Award Show’ as chief guest.\n\nThe event was organised by the Seraikistan Students Movement (SSM) and Seraiki Youth Parliament, Dera Ismail Khan, at the Gomal University.\n\nThe governor said the Seraiki language was spoken by people across all four provinces.\n\nHe resolved that the PPP would continue to stand with the Seraiki brothers and sisters to resolve their issues.\n\nHe emphasised the need for unity to achieve the creation of a Seraiki province.\n\nAccording to Mr Kundi, the parliamentarians who secured votes in the name of Seraiki province in the 2018 elections did not raise the issue effectively in the parliament.\n\nHe highlighted the efforts of his party, PPP, which had already passed resolutions in both national and provincial assemblies in favour of the Seraiki province.\n\nSpeaking on the occasion, the chairman of National Assembly’s Standing Committee for Defense, Fatehullah Khan Miankhel, called Gomal University a great gift from former prime minister Zulfikar Ali Bhutto.\n\nHe acknowledged the university’s role in the region’s development and opposed turning educational institutions into “political battlegrounds”.\n\nGovernor Kundi, MNA Miankhel and PPP leader Malik Farhan Afzal Dhap, along with faculty members, awarded shields to students for their outstanding achievements.\n\nThe students also presented poetry and drama in Seraiki language.\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:01:08.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888358/governor-kundi-lambasts-pti-govt-for-all-out-failure-in-kp",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:02:22.000Z"
}
