{
  "title": "AI can identify women at risk of breast cancer - World - DAWN.COM",
  "author": null,
  "content": "OSLO: Artificial intelligence is able to identify women who have an elevated risk of developing breast cancer several years before it is diagnosed, the Norwegian Institute of Public Health (FHI) said on Tuesday.\n\nFive researchers from FHI, the University of Cali­fornia and the University of Washington were given acc­ess to a commercially available AI programme to retroactively analyse the mammographies of 116,495 women who took part in a Norwegian detection programme bet­ween 2004 and 2018. In total, 1,607 of the women developed breast cancer.\n\nThe algorithm was able to predict which women ran a higher risk of developing breast cancer, and even identify which breast was at risk, four to six years before a diagnosis.\n\n“We noted that the breast which developed cancer had an AI score about twice as high as the other breast,” said Solveig Hofvind, who heads the detection programme and the AI project. “The study shows that the AI algorithms already available on the market can be used to develop more personalised detection programmes,” she said.\n\nAI could be used for early detection of breast cancer, to reduce costs and better target at-risk populations, FHI said.\n\nAccording to the World Health Organisation, 670,000 women died of breast cancer in 2022, the most common form of cancer among women in most countries. The study is published in the Journal of the American Medical Associa­tion Net­work, which edits a collection of prestigious medical journals.\n\nThe Norwegian detection programme also laun­ched a project last year involving 140,000 women to determine whether AI could be as efficient as, or even better than, radiologists to diagnose cancer cases.\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/29085642d1d2ef8.jpg?r=085757",
  "retrievedAt": "2025-08-26T08:00:55.369Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888375/ai-can-identify-women-at-risk-of-breast-cancer",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:03:08.000Z"
}
