{
  "title": "New backlash over Trump plan to move people out of Gaza - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: An idea floated by US President Donald Trump to move Gazans to Egypt or Jordan faced a renewed backlash on Tuesday as hundreds of thousands of Gazans displaced by the Israel-Hamas conflict returned to their devastated neighbourhoods.\n\nA fragile ceasefire and prisoner release deal took effect earlier this month, intended to end more than 15 months of conflict that began with Hamas’s Oct 7, 2023 raid on Israel. After the ceasefire came into force, Trump touted a plan to “clean out” the Gaza Strip, reiterating the idea on Monday as he called for Palestinians to move to “safer” locations such as Egypt or Jordan.\n\nHundreds of thousands of Palestinians were also headed to north Gaza on Tuesday after Israel permitted their passage.\n\nThe US president, who has repeatedly claimed credit for sealing the truce deal after months of fruitless negotiations, also said he would meet Israeli Prime Minister Benjamin Netanyahu in Washington “very soon”. Jordan, which has a tumultuous history with Palestinian movements, on Tuesday renewed its rejection of Trump’s proposal.\n\n“We emphasise that Jordan’s national security dictates that the Palestinians must remain on their land and that the Palestinian people must not be subjected to any kind of forced displacement whatsoever,” Jordanian government spokesman Mohammad Momani said.\n\nBittersweet homecoming for Palestinians returning to north\n\nQatar, which played a leading role in the truce mediation, on Tuesday said that it often did not see “eye to eye” with its allies, including the United States. “Our position has always been clear to the necessity of the Palestinian people receiving their rights, and that the two-state solution is the only path forward,” Qatar’s foreign ministry spokesman Majed al-Ansari said.\n\nFollowing reports that Trump had spoken with Egyptian President Abdel Fattah al-Sisi at the weekend, Cairo said there had been no such phone call. “A senior official source denied what some media outlets reported about a phone call between the Egyptian and American presidents,” Egypt’s state information service said.\n\nOn Monday, Trump reportedly said the pair had spoken, saying of Sisi: “I wish he would take some (Palestinians).” After Trump first floated the idea, Egypt rejected the forced displacement of Gazans, expressing its “continued support for the steadfastness of the Palestinian people on their land”.\n\nGazans returning home\n\nColumns of Palestinians carrying what belongings they could headed to north Gaza on Tuesday for a second straight day, after Israel permitted their passage in accordance with an ongoing ceasefire. “I’m happy to be back at my home,” said Saif Al-Din Qazaat, who returned to northern Gaza but had to sleep in a tent next to the ruins of his house. “I kept a fire burning all night near the kids to keep them warm… (They) slept peacefully despite the cold but we don’t have enough blankets,” the 41-year-old said.\n\nOn Monday, Israel allowed hundreds of thousands of displaced Gazans to return to their homes in the north. Although the crowds had thinned somewhat by Tuesday, thousands of men, women, and children were still seen heading north, fully aware they had little waiting for them but the rubble of their homes.\n\nIn central Gaza’s Nuseirat refugee camp, children waved at Egyptian soldiers manning checkpoints along the route as vehicles laden with mattresses, bags and other belongings made their way north. For many, the journey marked not just a return home but a confrontation with the harsh realities of more than 15 months of conflict in the densely populated territory of 2.4 million people.\n\nMona Abu Aathra managed to travel from central Gaza to Gaza City, though she has yet to assess the full extent of the conflict’s impact on her home. Her hometown, Beit Hanoun, was among the areas hardest hit by a months-long Israeli military operation which continued right up to this month’s ceasefire.\n\n“We returned to Gaza City with nothing, and there’s no drinking water. Most streets are still blocked by the rubble of destroyed homes,” the 20-year-old said.\n\nPublished in Dawn, January 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67996042f0a29.gif",
  "retrievedAt": "2025-10-12T01:02:54.458Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888379/new-backlash-over-trump-plan-to-move-people-out-of-gaza",
  "dateList": "2025-01-29",
  "date_published": "2025-01-29T03:03:08.000Z"
}
