{
  "article_id": "2025-01-21_35be7774ce7fff7573886aa086a0ea5d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886659/judicial-bad-blood-in-focus-as-sc-official-faces-contempt",
    "retrieved_at": "2025-10-12T00:56:48.489Z"
  },
  "metadata": {
    "title": "Judicial ‘bad blood’ in focus as SC official faces contempt - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T01:58:50.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 895,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD: Three Supreme Court judges, on Monday, initiated contempt proceedings against a senior staff member for not fixing a case regarding the jurisdiction of regular benches. Headed by Justice Mansoor Ali Shah, the bench including justices Ayesha A. Malik and Aqeel Ahmed Abbasi, issued a show cause notice to Additional Registrar (Judicial) Nazar Abbas under contempt of court charges. He was directed to appear in person and explain why the case was not fixed despite clear directions. The case pertained to whether regular benches of the Supreme Court can determine the constitutionality of Article 191A of the Constitution, under which the Constitutional Bench was established after the 26th Amendment. The question arose on Jan 13, when a three-judge bench, comprising justices Shah, Malik and Irfan Saadat Khan, heard the federal government's petition against a Sindh High Court's decision to strike down Section 221-A(2) of the Customs Act, 1969. The applicant argued that the regular bench could not hear the case as it involved challenges to the constitutionality of laws. During the subsequent hearing on Jan 16, the composition of the bench was changed, with Justice Abbasi replacing Justice Khan, who was on leave. However, Justice Shah ordered the case to be placed before the original bench, including Justice Khan, on Jan 20. At the start of court proceedings on Monday, Barrister Salahuddin Ahmed pointed out that he had travelled from Karachi, but the case was not fixed for hearing. Consequently, Justice Shah summoned Additional Registrar Abbas for an explanation. When the proceedings resumed after a short break, Deputy Registrar Zufiqar Ali appeared before the court stating the additional registrar was unwell. He explained that the matter was placed before the three-judge committee - constituted under the Supreme Court (Practice and Procedure) Act 2023 - which fixes cases for hearing. The committee, according to Mr Ali, decided that the case would be heard by a Constitutional Bench on Jan 27. This surprised Justice Shah, a member of the three-judge committee, who said he had had no clue when the meeting was called and what transpired there. \"I am a member of the judges' committee, but I did not know about the meeting,\" he observed. At this point, Justice Malik highlighted that the entire cause list for the week was changed, with several cases on tax and other matters scheduled before the bench. Justice Shah then asked the deputy registrar to present the minutes of the committee meeting which purportedly decided that the case would be heard by a Constitutional Bench. When the court resumed the hearing after a second break, Mr Ali said that his office didn't receive the minutes of the committee meeting. He said the case was transferred to the Constitutional Bench by a research officer of the court. Justice Malik wondered where a \"research officer will tell the court which case has to be fixed before which bench\". She said the judges' committee could not transfer the case from one bench to another, adding the arguments for sending the case to the Constitutional Bench could also be made before the present bench. Justice Shah observed that if Justice Khan was busy with other cases then other judges should have been added to the bench to hear the present case. But the committee has \"no authority\" not to fix the matter before the present bench, he remarked. While concluding, Justice Shah, in his order, questioned how a judicial order could be ignored by not fixing the case before a regular bench. Later, in a dramatic turn of events, the Supreme Court office issued a cause list stating that the contempt of court matter against the registrar would be taken up on Tuesday by a two-judge bench comprising justices Shah and Abbasi. Surprisingly, Justice Malik was not made part of the bench. Lawyers' support In a statement over today's proceedings, the Balochistan Bar Council (BBC) regretted the move to not fix the case before Justice Shah's bench. It said the action amounted to contempt of court and extended support to Justice Shah's \"principled stance\". The bar said the case should be fixed before Justice Shah's bench without delay since the failure to do so would \"undermine the credibility of the Supreme Court\". The statement said the judiciary cannot be reduced to a \"subsidiary body of the executive\", as this would represent a grave violation of the Constitution and an attack on judicial independence. In a related development, the All Pakistan Lawyers Action Committee, through an open letter, also expressed solidarity with Justice Shah. The removal of a case from Justice Shah's bench not only undermined the sanctity of the Supreme Court but also violated the principle of judicial independence enshrined in Article 209 of the Constitution, the committee said. The said article \"binds judges, including the CJP, to act without fear or favour\" in accordance with their oath. \"Any action that deviates from this principle constitutes a betrayal of the Constitution and the trust of the people of Pakistan.\" The letter reminded the judiciary, particularly CJP, that their constitutional mandate was to protect and preserve the Constitution and law. \"[The judges] are duty-bound to act as guardians of justice, not facilitators of vested interests.\" The recent actions threatened to \"transform the Supreme Court into a subordinate institution\", eroding its credibility and integrity. \"This must be resisted at all costs.\" Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}