{
  "article_id": "2025-01-21_2b80ebdde66964be60a78e5a5ea97899",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886672/biden-watches-in-disbelief-as-trump-tears-into-his-record",
    "retrieved_at": "2025-08-26T07:51:17.123Z"
  },
  "metadata": {
    "title": "Biden watches in disbelief as Trump tears into his record - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T01:58:34.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/21100159bb59e33.jpg",
    "categories": [],
    "word_count": 644,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "WASHINGTON: Donald Trump's inauguration had to be moved indoors due to a particularly frigid wintry spell across much of the United States, causing significant changes to the event after years of tedious planning. But the weather wasn't the only unusual aspect of the 47th president's swearing-in ceremony. Here are some memorable moments from a historic occasion. Trump unloads While Trump refused to attend Joe Biden's 2021 inauguration, the departing president was keen to restore tradition by showing his face. He may well wish he hadn't bothered, as Trump tore into his record, denouncing what the new Republican president said had been a \"betrayal\" of Americans by a \"radical and corrupt establishment\". They were apparently getting along fine during the earlier formalities, with Biden unaware that his successor was about to eviscerate his legacy. But the veteran Democrat could only smile in disbelief - and occasionally grimace - while his vice president Kamala Harris looked stony-faced, as Trump launched broadside after broadside. \"From this moment on, America's decline is over,\" Trump declared. Awkward air kiss The new president and first lady attempted to celebrate their return to the White House with a public display of affection, but weren't able to make contact thanks to Melania's wide-brimmed hat. The Eric Javits headpiece bumped up against the incoming president's forehead as he leaned in, frustrating his efforts to land the smacker and forcing the couple to air kiss as they clasped hands. The moment immediately went viral, with one wag on X commenting: \"I've just realised why Melania is wearing that wide-brimmed hat - it made it impossible for Trump to land his attempted kiss. Smart woman.\" Who's running Silicon Valley? Never was the convergence of money and politics more obvious than in Trump's inauguration audience, where Silicon Valley princelings rubbed shoulders with Washington's elite. Around a dozen billionaires were present for the ceremony, with some commentators on social media putting their total value at around $1 trillion - the approximate GDP of Switzerland. Amazon CEO Jeff Bezos, Meta founder Mark Zuckerberg, Google chief Sundar Pichai, Apple boss Tim Cook and the world's richest man - Tesla CEO Elon Musk - were all sitting nearby as Trump was sworn in. Bye bye Bible Trump didn't place his hand on a Bible or the US constitution as he took the presidential oath - either because he had decided to break with protocol or perhaps because he just forgot. The incoming first lady, Melania Trump, was standing beside him holding a Trump family bible and the so-called Lincoln Bible, which was used by the 16th president in 1861 and by Barack Obama in 2009 and 2013. But Trump stood with his left arm planted by his side as he raised his right hand for the oath of office. Touching sacred texts isn't a legal requirement - the constitution merely demands that presidents declare fealty to it \"by oath or affirmation\". It does not specify what they should be doing with their hands. \"But no religious test shall ever be required as a qualification to any office or public trust under the United States,\" the charter document states. Absentees Washington's version of royalty was also out in force as three former presidents - Bill Clinton, George Bush and Barack Obama - attended, along with a couple of ex-vice presidents, Mike Pence and Dan Quayle. Joe Rogan even managed to wangle a seat - presumably a thank-you for the valuable support he gave Trump during the election campaign as the host of the world's biggest podcast. But there were notable absences, including former first lady Michelle Obama and former House speaker Nancy Pelosi. Both women attended Trump's 2017 inauguration, although Trump himself skipped Biden's 2021 swearing-in. Pence's wife Karen, who pointedly snubbed Trump this month at Jimmy Carter's funeral, also gave Monday's ceremony a miss. Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}