{
  "article_id": "2025-01-21_21bac88ed026174a3a7d89002185047f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886748/turkish-ski-resort-fire-kills-66-forces-guests-to-jump-from-windows",
    "retrieved_at": "2025-08-26T07:50:42.505Z"
  },
  "metadata": {
    "title": "Turkish ski resort fire kills 66, forces guests to jump from windows - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T07:51:09.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/2117332416b2e83.jpg",
    "categories": [],
    "word_count": 507,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "The death toll from a fire that engulfed a hotel at a popular ski resort in northwestern Turkiye on Tuesday rose to 66, officials said, expressing great \"pain\" at the tragedy. Witnesses said desperate guests had tried to escape using ropes, footage showed bedsheets hanging from the windows, and media reports suggest some had died after trying to jump to safety. \"Our pain is great,\" Interior Minister Ali Yerlikaya told reporters at the resort in Kartalkaya, around 170 kilometres northwest of the capital Ankara. He added that \"66 citizens lost their lives and 51 others were wounded\" as officials said that the fire had now been contained. The blaze broke out at 3:27am (0027 GMT) in the 12-storey Grand Kartal hotel, which has wooden cladding, Yerlikaya said. Some 238 guests were registered at the hotel, the minister added. It was a peak time during a two-week school holiday. Turkish authorities detained four suspects, including the owner of the resort hotel, Justice Minister Yilmaz Tunc said on X. The minister previously announced that six prosecutors had been allocated to investigate the blaze. Private broadcaster NTV said that the dead included three people who had jumped from the hotel's windows. The fire is believed to have started in the restaurant and spread quickly, though it was not immediately clear what caused it. Part of the structure backs onto a cliff, making it harder for firefighters to tackle the blaze. President Recep Tayyip Erdogan cut short an address to his ruling AKP party congress in Ankara, saying: \"Our pain is great, our heartache is great.\" He said administrative and judicial investigations have been launched into the cause of the fire. \"All necessary steps will be taken to shed light on all aspects of the incident and to hold those responsible accountable,\" he promised. Television footage showed huge plumes of smoke rising into the sky with a snowcapped mountain behind the hotel. \"I heard screams around midnight, [hotel] residents were shouting for help,\" Baris Salgur, who works at a nearby hotel, told NTV television. \"They asked for a blanket, saying they will jump. We did what we could, we brought rope, pillows, we brought a sofa. Some people threw themselves once the flames approached them.\" Footage showed the wrecked lobby of the hotel with shards of glass on the floor, the reception desk and the wooden furniture inside charred black. Authorities warned that the building could collapse. A survivor who managed to escape the flames told local media that no alarms rang out at the hotel when the fire started and complained about the lack of any safety measures, including fire stairs or smoke detectors. Tourism Minister Nuri Ersoy said that the hotel had two fire escapes. \"The hotel has a fire safety certificate issued by the fire department ... Regular inspections must be carried out by the fire department,\" he said. Footage revealed bed sheets hanging from the hotel's windows indicating that some people had tried to use them to escape the blaze. Those evacuated were rehoused in nearby hotels.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}