{
  "article_id": "2025-01-21_b21b86e66aa6b610c71213591a5ac34f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886763/7208-pakistani-prisoners-freed-from-saudi-arabia-between-2019-and-2024-fo",
    "retrieved_at": "2025-08-26T07:50:38.063Z"
  },
  "metadata": {
    "title": "7,208 Pakistani prisoners freed from Saudi Arabia between 2019 and 2024: FO - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T09:57:38.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 509,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "A total of 7,208 Pakistani prisoners have been released from Saudi prisons between 2019 and 2024, according to a written response from Deputy Prime Minister and Foreign Minister Ishaq Dar shared in the Senate on Tuesday. The response was to a question from Senator Dr Zarqa Suharwardy Taimur regarding the announcement made for the release of 2,107 Pakistani prisoners in Saudi jails during the visit of Saudi Crown Prince Mohammed bin Salman to Pakistan in 2019 when the PTI was in power. The two-day historic visit of the crown prince in February 2019 had concluded with a significant announcement that 2,100 Pakistani prisoners languishing in Saudi Arabia's jails would be released soon. Dar's response mentioned the following breakdown provided by the Ministry of Foreign Affairs on Pakistani prisoners released from Saudi Arabia's prisons since the crown prince's visit. These included 545 prisoners in 2019, 892 in 2020, 916 in 2021, 1,331 in 2022, 1,394 in 2023, and 2,130 in 2024. \"However, due to the continuous arrival of prisoners and deportations, it is difficult to categorise or determine the exact number of those who benefited from the said amnesty,\" Dar said in the written response. He shared that amongst the released prisoners 4,301 fell under the consular jurisdiction of the Pakistan Consulate General in Jeddah while 2,907 were under the Pakistan Embassy in Riyadh. The foreign minister also added, \"The ministry is developing a comprehensive consular policy which is being prepared through consultation with various stakeholders,\" in response to another question. The situation of thousands of Pakistani workers imprisoned in Middle Eastern jails is a delicate matter in Pakistan, where it is widely believed that most of these detainees are impoverished labourers lacking proper legal support. A large number of Pakistanis migrate to the Middle East annually, primarily employed on construction sites or as domestic workers. The remittances they send home are crucial to supporting the country's economy. Dar's written response also said that 23,456 Pakistanis are imprisoned abroad while giving details regarding the total number of Pakistanis jailed abroad. In a written response to another question by Senator Taimur, Dar cited statistics provided by the foreign ministry, \"According to current statistics, approximately 23,456 Pakistani citizens are imprisoned in various countries around the world. \"The largest number is in the Gulf countries, specifically Saudi Arabia (12,156), then the UAE (5,292), followed by Greece (811) and Qatar (338).\" He added that the ministry is in the process of \"obtaining the previous 10-year data from all missions and sub-missions. The required information will be presented as soon as it is available.\" In February of last year, the Senate Standing Committee on Human Rights had directed the foreign ministry to formulate a much-delayed \"Uniform Consular Protection Policy\" within three months and get it approved by the government for its implementation. During the meeting, foreign ministry officials had said that there were 23,456 prisoners in foreign prisons, mainly in Saudi Arabia, the UAE, Iraq, Bahrain, Oman, Qatar, India and China. Out of the total number of imprisoned Pakistanis, at least 7,869 were under-trial prisoners.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}