{
  "article_id": "2025-01-21_5da093cac4cfe6d26f4780d4f9729a47",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886775/uk-pm-vows-to-fight-new-terrorism-threat-after-southport-girls-murders",
    "retrieved_at": "2025-08-26T07:50:42.164Z"
  },
  "metadata": {
    "title": "UK PM vows to fight new ‘terrorism’ threat after Southport girls’ murders - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T12:58:37.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/2117205033cacdc.jpg",
    "categories": [],
    "word_count": 586,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "British Prime Minister Keir Starmer on Tuesday pledged to fight the changing face of \"terrorism\" after a teenager admitted the murder of three young girls in a stabbing spree that triggered riots last year. Starmer said the \"barbaric\" killings, which were not treated as \"terrorism\" by the judicial authorities, were \"a sign Britain now faces a new threat ... acts of extreme violence perpetrated by loners, misfits, young men in their bedrooms\" who were accessing material online. Bebe King, six, Elsie Dot Stancombe, seven, and Alice da Silva Aguiar, nine, were killed in the attack in the northwestern seaside town of Southport near Liverpool on July 29, 2024. Axel Rudakubana, 18, who was born in Wales to Rwandan parents, on Monday admitted murder as his trial was due to start, prompting the government to announce a public inquiry into the events leading up to the killings. Starmer said the girls' deaths should mark a \"line in the sand\" and \"a fundamental change in how Britain protects its citizens and its children\". Admitting that questions now needed to be answered, the prime minister said failure by the state in the case \"frankly leaps off the page\". His televised address came as media reported that Rudakubana had been in contact with the police and social services over the years. But despite him being referred three times to the government's anti-extremism scheme, Prevent, over concerns about his obsession with violence, nothing was done to stop him. The scheme aims to \"stop people from becoming terrorists or supporting terrorism\" or help rehabilitate those already involved in terror, according to the interior ministry. The decision that Rudakubana did not meet the threshold for intervention by Prevent was \"clearly wrong\" and had failed the families of the victims, Starmer said. In the past the \"predominant threat was from highly organised groups with clear political intent, groups like Al-Qaeda\", Starmer said, adding that had now changed. It now included not just those inspired by traditional \"terrorist\" groups but also individuals \"fixated on... extreme violence, seemingly for its own sake\", he said, pledging new laws if necessary. \"If the law needs to change, to recognise this new and dangerous threat, then we will change it and quickly, and we will also review our entire counter extremist system to make sure we have what we need to defeat it,\" he said. The public inquiry will look at the contact multiple agencies had with Rudakubana. Media reported that his Christian church-going parents, who were both Tutsi, came to Britain after being forced to flee Rwanda following the 1994 genocide. Photographs of Rudakubana as a young boy show him appearing in a Doctor Who-themed advert for a BBC children's fundraiser. But he was later excluded from school after he reportedly was bullied and admitted to carrying a knife. He later sneaked back into the school armed with a hockey stick in an apparent attempt to attack other children and teachers, The Times newspaper reported. In an incident a week before the Southport killings, his father stopped him visiting his old school armed with a knife. The planned attack was thwarted after his father persuaded a taxi drive not to drive the then 17-year-old to the school, the Daily Mail newspaper said. Reports also said authorities had long known of his interest in atrocities and mass murders after he was found doing research on a school computer. Social workers reportedly required a police escort when visiting him at the family home because of the perceived threat he posed.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}