{
  "article_id": "2025-01-21_ab72916c2c8622865a00d37954179625",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886789/finance-minister-says-1bn-loan-agreed-with-two-middle-eastern-banks",
    "retrieved_at": "2025-08-26T07:50:40.108Z"
  },
  "metadata": {
    "title": "Finance minister says $1bn loan agreed with two Middle Eastern banks - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T16:32:17.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 498,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Finance Minister Muhammad Aurangzeb told Reuters on Tuesday that the government has agreed terms for a $1 billion loan with two Middle Eastern banks at a six to seven per cent interest rate as Pakistan looks for more financing. \"With two institutions we have now gone forward in signing up the term sheet - one bilateral and one for trade (finance),\" Aurangzeb said during an interview on the sidelines of the World Economic Forum annual meeting in Davos. Aurangzeb added that the loans were short-term, or up to one year. State Bank of Pakistan Governor Jameel Ahmad told Reuters in August that Pakistan aimed to raise up to $4bn from Middle Eastern commercial banks by the next fiscal year. Aurangzeb added that Pakistan was aiming to discuss with ratings agencies a move towards a single B rating, hoping to see an upgrade in the coming months. \"Ideally I would like to think that some action in this direction can take place before our fiscal year is over, which is this June,\" he said. Moody's upgraded Pakistan's ratings to 'Caa2' in August, citing improving macroeconomic conditions, and Fitch raised its rating to CCC+ in July following the staff-level agreement with the International Monetary Fund (IMF). However, both these ratings are still deep in sub-investment grade - or \"junk\" - territory. The government aims to boost its finances after securing a $7bn IMF bailout in September 2024, with the first review set for late February. \"We have the first formal review of the extended fund facility (EFF) coming through towards [the] end of February,\" Aurangzeb said. \"I do think we are in good stead for that review.\" IMF EFFs provide financial assistance to countries facing serious medium-term balance of payments problems resulting from structural weaknesses that require time to address. In October, Aurangzeb said the government had made a formal request for around $1bn in funding from the IMF via its Resilience and Sustainability Trust (RST). The RST, created in 2022, provides long-term concessional cash for climate-related spending, such as adaptation and transitioning to cleaner energy. Pakistan is one of the most vulnerable countries to climate change, according to the Global Climate Risk Index. Aurangzeb said the government will take discussions forward on RST financing when the IMF mission visits for the first review of the EFF programme. \"I'm hoping in the next sort of six to nine months, we can get there with the Fund as well,\" Aurangzeb said. Cash-strapped Pakistan failed last year at an attempt to offload a 60pc stake in debt-ridden flag carrier Pakistan International Airlines (PIA) which is part of an effort to raise funds and reform state-owned enterprises as envisaged under the ongoing bailout programme. \"In the next five to six months we should get to a good outcome,\" the minister said, referring to the privatisation of PIA. He cited better business prospects after the European Union's aviation regulator lifted its 4.5-year ban on the flag carrier, with flights to Europe resuming this month.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}