{
  "article_id": "2025-01-21_69f491af1d0e5af3ad0c1595412e7ad2",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886657/govt-swings-into-action-after-pti-threatens-boycott",
    "retrieved_at": "2025-10-12T00:56:51.366Z"
  },
  "metadata": {
    "title": "Govt swings into action after PTI threatens boycott - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T01:58:50.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 1011,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "- PM briefed on meetings; Irfan Siddiqui promises 'serious response' within seven days - Gohar says negotiations meaningless sans judicial commissions on May 9, Nov 26 events - PTI likely to move IHC against Al Qadir Trust case verdict today ISLAMABAD: The government on Monday assured the PTI of a response to the opposition's charter of demands within seven working days, after the party warned it would boycott the next round of talks if judicial commissions were not formed to probe the May 9 and Nov 26 incidents. \"We have shared PTI's demands with all our allies in the ruling coalition and sought their suggestions on how to fulfil them,\" said Senator Irfan Siddiqui, a member of the government's negotiation team, while talking to Dawn. \"We will give a serious, sympathetic response to the PTI within seven working days,\" he said, adding that Prime Minister Shehbaz Sharif had formed a committee of all ruling allies to finalise the government's response, with its first meeting scheduled to be held shortly. \"We have also included some legal experts in the committee, including Law Minister Azam Nazir Tarar, and asked our allies to obtain legal opinions from their respective legal teams on the PTI demands and present their viewpoints in the committee's first meeting,\" he said. \"Once we gather suggestions from our partners, a unanimous reply will be prepared and presented to the prime minister.\" As agreed by the two sides, he said, the government will respond to the opposition within seven working days (by Jan 27 or 28), after which the reply will be presented before National Assembly Speaker Sardar Ayaz Sadiq during the next meeting. Senator Siddiqui denied media reports suggesting that the government had refused to form a judicial commission, urging the media to avoid spreading baseless news that could undermine the dialogue process. \"Such news causes worries and uncertainty on the other side and can hamper the dialogue process,\" he cautioned. Later, three members of the government's negotiation team - Ishaq Dar, Irfan Siddiqui, and Rana Sanaullah - called on PM Shehbaz to brief him on their meetings with the PTI. A source said the prime minister urged them to maintain close liaison with other members of the government's team and finalise the responses to PTI's charter of demands. PTI's threat The government's response followed a warning from PTI Chairman Barrister Gohar, who said the party would not participate in the fourth meeting if the government failed to commit within seven days to forming judicial commissions on May 9 and Nov 26 incidents. Barrister Gohar, who met PTI founder Imran Khan in jail, told reporters that the ex-PM had categorically directed him that there would be no talks if the government did not form the judicial commissions. Talks will be meaningless if the government filed to do so, he said, adding that the government should make the talks result-oriented through sincerity and politeness. Separately, PTI Secretary General Salman Akram Raja said that the party would abandon talks with the government by January 28 unless they were allowed unfettered access to their incarcerated party founder. Speaking to the DawnNewsTV, Mr Raja said: \"In the last meeting, we asked to meet him alone, without the tools or officers of the state present. But it does not seem to be happening now\". When asked if the PTI would negotiate with the establishment, Mr Raja said the party was open to talking with all actors and it will engage with the establishment as well. Separately, PTI legal expert Faisal Chaudhry, speaking to Dawn, said the party was committed to the negotiations for the country's benefit, not for gaining any advantage for the party itself. \"Imran Khan has said that imprisonment does not make any difference to him and it will not affect the negotiations with the government and others. He has stated that he only wants the establishment of a judicial commission to investigate the May 9 and November 26 incidents. He also clarified that the negotiations have nothing to do with his release,\" Mr Chaudhry said, sharing the former prime minister's message. In reply to a question, he warned that if the government did not show seriousness regarding the establishment of the judicial commission, PTI would be left with no option but to stop negotiations with the government. He also criticised Senator Siddiqui for his statement and accused the \"Form 47 government\" of showing mistrust towards security agencies. He said the government was also showing mistrust towards the press release issued by the security agencies. \"It seems the government is afraid and puzzled because of the contacts between PTI and other powers.\" So far, three meetings between the government and PTI have taken place, chaired by NA Speaker Ayaz Sadiq. During the last meeting on Jan 16, the PTI presented its charter of demands, including the formation of judicial commissions to investigate the events of May 9, 2023, and Nov 26, 2024, as well as the release of all PTI prisoners. Challenge to 190m case verdict Meanwhile, speaking outside Parliament House, Leader of the Opposition in the National Assembly Omar Ayub Khan said the party would approach the high court against the decision in the 190 million Al Qadir Trust case. He said it should be asked from Hasan Nawaz, son of ex-PM Nawaz Sharif, how he transferred Rs40 billion from Pakistan to the UK. Barrister Gohar claimed that the 190m case was not related to corruption but was a case concerning a trust, asserting that Imran Khan was not involved in corruption. In response to a question about the judicial commission, he said that the commission could be established at any time and over any issue. He confirmed that Imran Khan had set a seven-day deadline for the commission's formation. PTI leaders Asad Qaiser announced that the party would approach the Islamabad High Court on Tuesday (today) to challenge the Al Qadir Trust case. He said Imran Khan remained the most popular leader and hinted that the PTI would soon form an alliance with opposition parties. Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}