{
  "article_id": "2025-01-21_4c19232f3b3e4dde3cda7c7e001a8b4d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886670/tech-billionaires-take-centre-stage-at-trumps-inauguration",
    "retrieved_at": "2025-10-12T00:56:49.188Z"
  },
  "metadata": {
    "title": "Tech billionaires take centre stage at Trump’s inauguration - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T01:58:34.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/21101232f021cef.jpg",
    "categories": [],
    "word_count": 418,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "WASHINGTON: US tech multibillionaires - including Elon Musk, Mark Zuckerberg, and Jeff Bezos - were given prime positions at Donald Trump's inauguration on Monday, in an unprecedented demonstration of their power and influence in the White House. The tech tycoons, whose companies are among the world's most valuable, have spent the ten weeks since the election courting favour with Trump, marking a dramatic shift from Silicon Valley's more hostile response to his first term four years ago. Attendees also included Apple CEO Tim Cook and Google CEO Sundar Pichai, along with the search engine's founder Sergey Brin. TikTok CEO Shou Chew sat in the back row of the stage, even as his platform's future remains uncertain. TikTok on Sunday credited Trump for promising an executive order to save the app from a US ban, though its fate in the United States remains unclear while under Chinese company ByteDance's ownership, in defiance of a US law. Despite highly limited seating after the ceremony moved indoors due to bad weather, Meta CEO Zuckerberg attended with his wife Priscilla Chan, while Amazon executive Bezos was accompanied by his fiance, Lauren Sanchez. Their prominent positions on the inauguration stage - more visible than many cabinet members - was particularly notable for Zuckerberg, whom Trump had threatened with life imprisonment just months ago. Zuckerberg recently made headlines by brashly aligning his company's policies with Trump's worldview, notably by eliminating fact-checking in the United States and relaxing hate speech restrictions on Facebook and Instagram. Musk has shown the strongest support for Trump, contributing $277 million to the president's campaign and transforming his X platform into an amplifier for pro-Trump voices. Bezos, like Zuckerberg and his peers, has visited Trump's Mar-a-Lago estate in Florida leading up to the inauguration, with favourable treatment, government contracts and reduced regulatory scrutiny for Amazon in the balance. As owner of The Washington Post, Bezos sparked controversy by blocking the newspaper's planned endorsement of Vice President Kamala Harris for the 2024 presidential election, triggering newsroom protests and subscriber cancellations. Musk has been appointed to co-lead the Department of Government Efficiency to advise the White House on cutbacks to public spending and has spent much of the past two months at Mar-a-Lago. While Musk's SpaceX is already a major government contractor, Amazon's AWS cloud computing division and Google also count the US government among their biggest clients. Google, Meta, Apple, and Amazon face landmark antitrust lawsuits from the US government that could force their breakup. Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}