{
  "article_id": "2025-01-21_235084c0d2204391e2df1eb8402c957e",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886703/trump-executive-orders-target-climate-immigration-policy-federal-employees",
    "retrieved_at": "2025-08-26T07:50:44.604Z"
  },
  "metadata": {
    "title": "Trump executive orders target climate, immigration policy, federal employees - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T03:21:15.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/210803513571d07.jpg",
    "categories": [],
    "word_count": 1248,
    "reading_time_minutes": 7
  },
  "content": {
    "article_body": "US President Donald Trump on Monday issued a flurry of executive orders and directives as he sought to put his stamp on his new administration on matters ranging from energy to criminal pardons and immigration. Here are some of the key executive orders signed on Trump's first day back in office. Trump pardoned about 1,500 people who stormed the US Capitol on Jan 6, 2021, in a sweeping gesture of support to the people who assaulted police as they tried to prevent lawmakers from certifying his 2020 election defeat. \"We hope they come out tonight, frankly,\" Trump said. \"We're expecting it.\" The far-reaching action also cuts short the sentences of 14 members of the far-right Proud Boys and Oath Keepers organisations, including some who were convicted of seditious conspiracy. The document also directs the US attorney general to drop pending cases related to the riot. Trump signed orders declaring illegal immigration at the US-Mexico border a national emergency, designating criminal cartels as terrorist organisations, and targeting automatic citizenship for US-born children of immigrants in the country illegally. Trump's order dealing with US refugee resettlement will suspend the program for at least four months and will order a review of security to see if travellers from certain nations should be subject to a travel ban, the official said. \"The United States lacks the ability to absorb large numbers of migrants,\" the order said. At a rally at a sports arena, Trump revoked 78 executive actions of the previous administration. \"I'll revoke nearly 80 destructive and radical executive actions of the previous administration,\" Trump said. Trump also said he will sign an order directing every agency to preserve all records pertaining to \"political persecutions\" under the Biden administration. The rescission applied to executive orders spanning from former President Joe Biden's first day in office in 2021 to as recently as last week, and covered topics from Covid relief to the promotion of clean energy industries. Trump also rescinded executive orders that had promoted diversity, equity and inclusion (DEI) and promoted rights for LGBTQ+ people and racial minorities, fulfilling promises to curtail protections for the most marginalised Americans. Among the 78 repealed executive orders signed by Biden, including at least a dozen measures supporting racial equity and combating discrimination against gay and transgender people. Trump signed an order to delay a ban for 75 days of popular short-video app TikTok that was slated to be shuttered on Jan 19. The order directs the attorney general to not enforce the law \"to permit my administration an opportunity to determine the appropriate course of action with respect to TikTok\". Trump signed orders freezing government hiring and new federal regulations, as well as an order requiring federal workers to immediately return to full-time in-person work. \"I will implement an immediate regulation freeze, which will stop Biden bureaucrats from continuing to regulate,\" Trump said, adding he will also \"issue a temporary hiring freeze to ensure that we're only hiring competent people who are faithful to the American public.\" The move would force large numbers of white-collar government employees to forfeit remote working arrangements, reversing a trend that took off in the early stages of the Covid-19 pandemic. Some of Trump's allies have said the return-to-work mandate is intended to help gut the civil service, making it easier for Trump to replace long-serving government workers with loyalists. Trump ordered all executive departments and agencies to deliver emergency price relief to the American people and increase the prosperity of the American worker. Measures include cutting regulations and climate policies that raise costs, and prescribe actions to lower the cost of housing and expand housing supply. \"Over the past 4 years, the Biden Administration's destructive policies inflicted an historic inflation crisis on the American people,\" the order said. Trump also signed a withdrawal from the Paris climate treaty, including a letter to the United Nations explaining the withdrawal. The announcement, which has been widely expected ever since Trump won the Nov 5 presidential election, further threatens the central goal of the agreement to avoid a rise in global temperatures of 1.5 degrees Celsius, a target that appears even more tenuous as last year was the planet's hottest on record. \"It is the policy of my administration to put the interests of the United States and the American people first,\" the order said. He repealed a 2023 memo from Biden that barred oil drilling in some 16 million acres in the Arctic, saying the government should encourage energy exploration and production on federal lands and waters, and eliminated an electric vehicle (EV) mandate. Another order withdrew the United States from the World Health Organisation, saying the global health agency had mishandled the Covid-19 pandemic and other international health crises. The plan, which aligns with Trump's longstanding criticism of the UN health agency, marks a dramatic shift in US global health policy and further isolates Washington from international efforts to battle pandemics. Trump has nominated several critics of the organisation to top public health positions, including Robert F. Kennedy Jr., a vaccine sceptic who is up for the post of secretary of Health and Human Services, which oversees all major US health agencies including the CDC and FDA. Trump signed an executive action to create an advisory group called the Department of Government Efficiency aimed at carrying out dramatic cuts to the US government, attracting immediate lawsuits challenging its operations. The group - dubbed \"DOGE\" - is being run by Tesla CEO Elon Musk and has grandiose goals of eliminating entire federal agencies and cutting three quarters of federal government jobs. The president signed a document \"ending weaponisation\" of government against political opponents. The order directs the attorney general to investigate the activities of the federal government over the last four years, including at the Department of Justice, the Securities and Exchange Commission, and the Federal Trade Commission during the prior administration. It said the government will \"identify and take appropriate action to correct past misconduct by the Federal Government related to the weaponisation of law enforcement and the weaponisation of the Intelligence Community.\" Trump signed an executive order that he said was aimed at \"restoring freedom of speech and ending federal censorship\". \"Under the guise of combating 'misinformation,' 'disinformation,' and 'malinformation,' the federal government infringed on the constitutionally protected speech rights of American citizens,\" the White House said. Trump and his Republican allies had accused the administration of Democratic former President Biden of encouraging suppression of free speech on online platforms. Trump declared a national energy emergency, promising to fill up strategic oil reserves and export US energy all over the world. He laid out a sweeping plan to maximise US oil and gas production - including by declaring a national energy emergency, stripping away excess regulation, and withdrawing the US from an international pact to fight climate change. Trump said he expects the orders to help reduce consumer prices and improve US national security. He also signed orders aimed at promoting oil and gas development in Alaska, reversing Biden's efforts to protect vast Arctic lands and waters from drilling. The US also will withdraw from the Paris climate agreement and end leasing to wind farms, according to the White House's website. In addition, Trump said he would revoke what he has called an electric vehicle mandate. The moves signal a dramatic U-turn in Washington's energy policy after Biden sought to encourage a transition away from fossil fuels and establish the US as a leader in combating global warming.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}