{
  "article_id": "2025-01-21_2fac118f8bef84ec85a4cc5404e696db",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886671/how-trump-has-already-changed-the-world",
    "retrieved_at": "2025-10-12T00:56:47.792Z"
  },
  "metadata": {
    "title": "How Trump has already changed the world - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T01:58:34.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678eed81dee80.gif",
    "categories": [],
    "word_count": 849,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "Donald Trump has only just been sworn in as the 47th president but the global impact of his second term is already being felt, according to a BBC report. From Jerusalem to Kyiv to London to Ottawa, his election victory and the anticipation of a new Trump agenda has changed the calculations of world leaders - with some far-reaching consequences. In the lead-up to the handover of power in Washington, BBC correspondents dissected these changes in the regions where they were. \"National emergency\" plan Incoming President Donald Trump plans to declare a \"national emergency\" at the US-Mexico border as part of a broader first-day flurry of executive orders aimed at quickly reversing the Biden administration's policies. As part of his plans, Trump will also order construction on the border wall to be resumed and that some criminal organisations be officially designated as foreign terrorists, reported by BBC. While campaigning, Trump vowed to shut down what he termed the \"open-border\" policies of Joe Biden. In a series of calls with reporters on Monday morning, as reported by the BBC, incoming Trump administration officials outlined dozens of executive orders the president-elect planned to take when he officially takes office, including 10 focused on what one official described as \"common sense immigration policy\". President plans to declare emergency at border in flurry of day one orders Officials said that Trump plans to end birthright citizenship, meaning that the children of undocumented migrants living in the US will no longer automatically be considered US citizen. Middle East - ceasefire deal in Gaza Donald Trump has made an impact on the Middle East even before he sits down in the Oval Office to start his second term as president, reported by BBC. He cut through the delaying tactics that Israel's Prime Minister Benjamin Netanyahu, in alliance with his ultra-nationalist coalition partners, had used to avoid accepting the ceasefire deal that Trump's predecessor Joe Biden put on the negotiating table last May. American pressure on Hamas and other Palestinian groups is a given. Under Biden, pressure on Israel was the lever that was never pulled. Trump starts his second term claiming credit, with reasonable justification, for getting the ceasefire deal in Gaza over the line. He can bask in some glory. Ukraine - pressure for a deal The return of Trump to the White House means new realities for Ukraine - the new US president wants a peace deal, not a soaring bill for US military support. That much is clear. How he intends to get there is not. Trump's original boast - that he could end the war in a day - has been revised by his new Russia-Ukraine envoy, Keith Kellogg. Lieutenant-General Kellogg (retired) has said he would like \"a solution\" within 100 days. If Trump can push both sides into negotiations, Ukraine won't be coming to the table in a position of strength, BBC reported. Moscow currently control's one-fifth of Ukraine's territory, including the Crimean Peninsula which is annexed in 2014. Many here fear President Trump will push for a settlement on Russia's terms. President Zelensky has indicated he is ready for some compromises. Three years into Russia's invasion, he has little choice. But President Putin, who is winning on the battlefield, albeit slowly and with massive losses, may have no desire to stop now. Canada - threat of tariffs adds to turmoil The political instability in Ottawa comes as Canada faces a number of challenges - not least the vow by Trump to impose 25 per cent tariffs on Canadian goods. Until recently, Justin Trudeau seemed determined to hang on as prime minister, citing his desire to face Pierre Poilievre - his ideological opposite - in the polls, BBC reported. But the shock resignation of Trudeau's key deputy, former Finance Minister Chrystia Freeland, in mid-December - when she cited his perceived failure to not take Trump's threats seriously - proved to be the final straw. Members of Trudeau's own party began to make it publicly clear they no longer supported his leadership. And with that, the last domino fell. Trudeau announced his resignation as PM earlier this month. China - investors eye trade war China's economy rebounded in the last three months of last year, allowing the government to meet its growth target of 5 per cent in 2024, Beijing announced on Friday, according to BBC. But it is one of the slowest rates of growth in decades as the world's second largest economy struggles to shake off a protracted property crisis, high local government debt and youth unemployment. The head of the country's statistics bureau said China's economic achievements in 2024 were \"hard won,\" after the government launched a slew of stimulus measures late last year. Beijing has rarely missed its growth targets in the past. Experts had broadly predicted this rate of growth. The World Bank said lower borrowing costs and rising exports would mean China could achieve annual growth of 4.9pc. Investors, however, are bracing themselves: the threat of President-elect Donald Trump's tariffs on $500bn (409bn) worth of Chinese goods looms large. Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}