{
  "article_id": "2025-01-21_edc8d78fed50f3d8f29fd84964f29df6",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886645/seven-year-old-karachi-boy-raped-before-being-murdered-autopsy-reveals",
    "retrieved_at": "2025-08-26T07:50:57.730Z"
  },
  "metadata": {
    "title": "Seven-year-old Karachi boy raped before being murdered, autopsy reveals - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T02:01:36.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 586,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "- Body found in water tank appears to be 'four-five days old': MLO - DIG says cause of death is yet to be determined by doctors KARACHI: Investigators are now treating the death of a seven-year-old boy, whose body was found in an underground water tank of the high-rise building he lived in 11 days after his disappearance, as a murder case after a post-mortem report confirmed that he was subjected to a sexual assault before being killed. On January 7, Mohammed Sarim had gone to a madressah on the premises of the same apartment complex he lived in but did not return. On Jan 18, he was found dead in the underground water tank of the same complex. Doctors who performed the autopsy had said that the marks of injuries on the body suggested that it was \"not an accidental death\". The police had expressed the possibility that the water tank was not properly covered and that may have caused the boy to fall inside if he was playing nearby. However, the report of a post-mortem examination, a copy of which is available with Dawn, has concluded that the minor boy was subjected to a sexual assault. The report, prepared by Medico-Legal Officer Dr Ghazanfar Ali Shaheryar of the Abbasi Shaheed Hospital, stated that the victim had suffered 12 different injuries/wounds on various parts of the body and \"all are ante-mortem' (prior to death) except one injury (number four)\". Although the body was found 11 days after his disappearance, the autopsy report stated that the boy had died \"approximately four to five days\" before the post-mortem examination. The fresh findings cast doubt on investigators' efforts to recover the child, as it appeared that he was alive at least a week after his kidnapping. However, DIG-West Irfan Ali Baloch told Dawn that the exact cause and time of the death was yet to be ascertained by doctors and he had not received the reports in this regard. The officer added that a teacher of the seminary where the victim studied was already in custody of the police and his DNA samples were being taken for cross-matching with the samples of the victim boy. No tangible progress in abducted boys' kidnap case DIG-South Syed Asad Raza told Dawn that three suspects had been detained for interrogation in a case pertaining to the kidnapping of two minor boys in the Garden area. Five-year-old Aliyan and six-year-old Ali Raza, both friends and neighbours, were abducted by a couple riding a motorcycle when they were playing outside their homes on Siddiq Wahab Road in Garden West on Jan 14. The DIG said a five-member investigation team was taking every possible effort for the safe recovery of the children. Moreover, with the help of technology, it had transpired that the children were taken away from the Dhobi Ghat area of Garden and their last location was traced at Kashti Chowk in Lyari, the DIG said, adding that the investigators had also conducted geo-fencing of the area. Meanwhile, Karachi police chief Additional Inspector General Javed Alam Odho on Monday met senior investigators to review progress of the boys' kidnap cases. He issued directions for safe recovery of the missing children, said a police spokesperson in a statement. He also asked the officers to expedite the investigation and provide every possible help to the families. The meeting was attended by DIGs, district SSPs of both operation and investigation wings and the chief of the Anti-Violent Crime Cell. Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}