{
  "article_id": "2025-01-21_1f012c8add86edbe08acf9e66015a60b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886785/nab-cautions-against-investing-in-bahria-towns-dubai-project-govt-to-reach-out-to-uae-for-malik-riazs-extradition",
    "retrieved_at": "2025-08-26T07:50:40.102Z"
  },
  "metadata": {
    "title": "NAB cautions against investing in Bahria Town’s Dubai project; govt to reach out to UAE for Malik Riaz’s extradition - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T14:00:09.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 557,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "The National Accountability Bureau (NAB) cautioned the public on Tuesday on investing in Bahria Town's new real estate project in Dubai, adding that the government was reaching out to the United Arab Emirates to seek property tycoon Malik Riaz's extradition through legal avenues. The development comes on the heels of PTI founder Imran Khan and his spouse's conviction in the Al-Qadir Trust case, in which Riaz and his son are also co-accused and proclaimed offenders. As PTI and legal experts pointed to the need for accountability for all those involved, Information Minister Attaullah Tarar had said that consultation was ongoing on how to bring the other absconders back. In a press release issued today carried by state-owned media outlet Radio Pakistan, NAB said: \"Mr Malik Riaz is residing in Dubai, UAE. He has recently launched a project for the construction of luxury apartments in Dubai, UAE. The general public at large is hereby advised and warned to refrain from investing in the stated project. If the general public at large invests in the stated project, their actions would tantamount to money laundering, for which they may face criminal/ legal proceedings. \"The government of Pakistan is reaching out to the government of UAE for the extradition of Malik Riaz through legal channels.\" NAB recounted that he was currently an absconder in the Al-Qadir Trust case and wanted by the court with the watchdog already having frozen innumerable assets of his and Bahria Town. The watchdog said it was conducting inquiries and investigations against the Bahria Town owner and his associates for \"fraud, deceptive practices and cheating public at large\". It said it had \"cogent and credible information about the fact that Mr Malik Riaz and his accomplices have not only illegally possessed/occupied state-owned land but also land belonging to private persons situated at Karachi, Takht-Pari, Rawalpindi and New Murree. \"He is using these lands for developing housing societies without obtaining mandatory/required regulatory permissions/no objection certificates and has committed fraud against the state and general public at large to the tune of billions of rupees.\" NAB alleged that the property tycoon was developing housing societies under the name of Bahria Town \"in a duplicitous manner\" in other cities, including Peshawar and Jamshoro, by \"illegally possessing/occupying land\" and failing to procure the same mandatory regulatory permissions and legal documents. It added that he continued to \"defraud the general public at large by selling them plots/files in these illegal housing societies\" despite neither he nor Bahria Town having a \"good/clear title\" to any of the lands in \"these illegal housing societies\". Last year in May, the property tycoon had complained in an uncharacteristic cryptic post that he was facing \"pressure\" to take a political side and was facing financial losses, but vowed not to be used as a \"pawn for political motives\". He has many past cases alleging the use of land acquisition tactics for his real estate projects. He and his firm have also been at the centre of multiple court cases; most recently being ordered by the Supreme Court to pay the amount the real estate developer owed to the Sindh government for the acquisition of land for Bahria Town Karachi. The property tycoon - who is considered well-connected with political parties, media and the country's civil and military establishment - has not yet addressed today's statement by NAB.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}