{
  "article_id": "2025-01-21_141949458f85f6329d691b52be499931",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886654/gaza-truce-holding-after-first-prisoner-swap",
    "retrieved_at": "2025-08-26T07:51:14.023Z"
  },
  "metadata": {
    "title": "Gaza truce holding after first prisoner swap - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-21T02:00:36.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678ee14a48fa1.gif",
    "categories": [],
    "word_count": 738,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "- 90 Palestinians freed in exchange for three Israeli prisoners; ex-detainee says Israeli jail is 'hell, hell, hell' - First phase of ceasefire to last six weeks - Qatar says 12.5m litres of fuel will enter Gaza for 10 days JERUSALEM: A fragile ceasefire between Israel and Hamas was holding on Monday, following the exchange of three Israeli prisoners for 90 Palestinians in an agreement aimed at ending more than 15 months of war in Gaza. The three Israeli prisoners released on Sunday, all women, were reunited with their families and taken to hospital in central Israel, where a doctor said they were in stable condition. Hours later in the Israeli-occupied West Bank, Palestinian prisoners released by Israel left Ofer prison on buses, with jubilant crowds celebrating their arrival. As the ceasefire took effect, thousands of displaced, war-weary Palestinians set off across the devastated Gaza Strip to return home. The truce began on the eve of Donald Trump's inauguration for a second term as US president. If all goes according to plan, the first phase of the truce would last six weeks during which the parties would negotiate a permanent ceasefire, which has not been agreed yet. Despite the risks, hundreds of Palestinians were streaming through an apocalyptic landscape in Jabalia in northern Gaza, one of the worst-hit areas. \"We are finally in our home. There is no home left, just rubble, but it's our home,\" said Rana Mohsen, 43. The initial 42-day truce was brokered by mediators Qatar, the United States and Egypt. It should enable a surge of sorely needed humanitarian aid into Gaza, as more Israeli prisoners are released in exchange for Palestinians in Israeli custody and Israeli forces leave some areas. During the initial phase of the truce, 33 Israeli prisoners are due to be returned from Gaza in exchange for around 1,900 Palestinians. Reunited The first three released - Emily Damari, Romi Gonen and Doron Steinbrecher - returned to Israel after Hamas fighters handed them over to the Red Cross in a bustling square in Gaza City on Sunday. \"In Emily's own words, she is the happiest girl in the world; she has her life back,\" Damari's mother said on Monday, adding that her daughter was \"doing much better than any of us could have expected\" even after losing two fingers. In Tel Aviv, there was elation among the crowd who had waited for hours for the news of their release, with a campaign group hailing their return as \"a beacon of light\". Journalist Avi Issacharoff lashed out against the Israeli government for what he said was its failure \"to engage in any way on the 'day after' the war\". Following the return of the three prisoners, the Israel Prison Service confirmed the release of 90 Palestinian prisoners early on Monday. In the West Bank town of Beitunia, near Ofer prison, Palestinians cheered and chanted as buses carrying prisoners arrived, with some climbing atop and unfurling a Hamas flag. \"All the prisoners being released today feel like family to us. They are part of us, even if they're not blood relatives,\" Amanda Abu Sharkh, 23, told AFP. One freed detainee, Abdul Aziz Muhammad Atawneh, described prison as \"hell, hell, hell\". The next prisoner swap should take place on Saturday, a senior Hamas official said. Gaza to be rebuilt As the war devastated much of the Palestinian territory and displaced millions of people, Hamas on Monday vowed that Gaza and its people would \"rise again\". \"Gaza, with its great people and its resilience, will rise again to rebuild what the occupation has destroyed,\" Hamas said. For many Israelis yearning for a future free from war and for the release of prisoners still held in Gaza, Trump's return to the White House is a source of hope. Many Israelis have been looking forward to his return for a while, even ahead of the ceasefire. UN relief chief Tom Fletcher said 630 trucks carrying desperately-needed aid had entered Gaza in the hours after the start of the truce, with 300 of them headed to the north of the territory. Qatar said that 12.5 million litres of fuel would enter Gaza over the first 10 days of the truce. The World Food Programme said it was moving full throttle to get food to Palestinians. \"We're trying to reach a million people within the shortest possible time,\" said WFP official, Carl Skau. Published in Dawn, January 21st, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}