{
  "title": "South Punjab Secretariat to become operational on Oct 15",
  "link": "https://www.app.com.pk/national/south-punjab-secretariat-to-become-operational-on-oct-15/",
  "date_published": "2020-09-04T12:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 4 (APP): The South Punjab Secretariat will formally become operational on October 15, as decided by a meeting chaired by Prime Minister Imran Khan here on Friday.\nThe meeting on establishment and working of South Punjab Secretariat was attended by Foreign Minister Shah Mehmood Qureshi. Chief Minister Punjab Usman Buzdar, Finance Minister Punjab Makhdoom Hashim Jawan Bakht, Chief Secretary Punjab, Additional Chief Secretary South Punjab and Additional Inspector General South Punjab joined through video-link.\nThe Prime Minister emphasized that the government’s main focus was to bring about improvement in the lives of common man and directed the administration of South Punjab to work in fulfilling the same vision.\nHe lauded efforts of Chief Minister Buzdar and the Punjab government for establishment of South Punjab Secretariat, and said solid steps reflected PTI government’s will to implement its manifesto in letter and spirit.\nHe regretted that governments in the past ignored the genuine issue of the people of South Punjab.\nStressing on the need for Provincial Finance Commission Award, the prime minister said separate allocation for South Punjab would usher in a new era of progress and prosperity.\nImran Khan directed to complete process of devolution of power phase-wise to ensure smooth running of administrative procedures.\nHe asked to keep him regularly updated on the progress of the working of new Secretariat.\nForeign Minister Qureshi highlighted the practical steps taken by Pakistan  Tehreek-e-Insaf in accordance with the aspirations of people of southern Punjab, establishment of South Punjab Secretariat, devolution of administrative powers, ending sense of deprivation and resolving problems at their doorsteps.\nHe said the PTI government had fulfilled its promise to establish South Punjab Secretariat, which had developed a new spirit among the people of the area about their identity.\nQureshi presented a proposal for allocating budget for South Punjab in next year’s Public Sector Development Programme and reserving a quota for the locals in employment.\nThe meeting informed the Prime Minister that rules of business of Punjab Government had been amended following the establishment of South Punjab Secretariat and 16 secretaries had been deputed in South Punjab.\nThe prime minister was updated that health, education, police, planning and development, local government, finance and agriculture had been transferred to South Punjab.\nAn effective structural organization has been put in place in the new Secretariat equipped with technology, e-governance and paperless culture to facilitate the people.",
  "retrievedAt": "2025-08-11T19:46:03.826Z"
}
