{
  "title": "PTI supporters moving towards Islamabad to attend Imran’s historic rally: Fawad",
  "link": "https://www.app.com.pk/national/pti-supporters-moving-towards-islamabad-to-attend-imrans-historic-rally-fawad/",
  "date_published": "2022-03-26T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain said on Saturday that a huge crowd was moving towards Islamabad to attend “Amr Bil Maroof” public meeting of Pakistan Tehreek-e-Insaf.\nTalking to media along with Governor Sindh Imran Ismail and Minister for Maritime Affairs Ali Zaidi at Bani Gala that a 20 km long rally from Gilgit-Baltistan was reaching Islamabad.\nHe said that people of Gilgit-Baltistan were not as active in Pakistan’s politics in the past as they were now.\nThe minister said that the whole country including Khyber Pakhtunkhwa, Punjab, Karachi and Balochistan were seemed to be in the colors of PTI.\nHe said that tomorrow more than one million people would attend the public meeting to show solidarity with Prime Minister Imran Khan.\nHe said that those who tabled no-confidence motion against the PM tried to purchase loyalities of the people using ill- gotten money would be rejected by the people in tomorrow’s meeting.\nChaudhry Fawad Hussain said that after Zulfiqar Ali Bhutto era, today Pakistan’s foreign policy was independent because of Imran Khan’s courageous leadership.\nThe wheel of Pakistan’s economy has begun to move due to policies of Imran Khan and , the people of Pakistan will thwart the conspiracy of those who conspire against the country’s development.\nAll caravans were towards Parade Ground Islamabad, and all arrangements for the rally were complete.\nHe said media coverage was being provided to PTI caravans coming to Islamabad.\nNews of local processions has started appearing in all televisions and newspapers from today, he said.\nHe appealed to PTI activists to maintain public discipline and follow Supreme Court and High Court guidelines.\nHe said that roads and streets should not be closed anywhere.\n“Through a peaceful protest we will pay tribute to our leader and Prime Minister Imran Khan”, Chaudhry Fawad said.\n“This will be the largest gathering in the history of Pakistan”, he said.\nTo a question, he said that it was the right of all parties to hold meetings and people would also get comparison of meetings.\nThe minister challenged the “thieves” to come together and hold a rally so that people can know how much support they enjoyed.\nReplying to another question, he said that two PTI MNAs have assured that they would not violate party discipline.\nHe said that Minister for Planning and Development Asad Umar has a meeting with one member and another member would meet him today.\nHe said that a meeting with MQM was held last night and a meeting with PML-Q was due today. He said that Asad Umar, Pervez Khattak and Imran Ismail will meet with MQM again tonight.\nHe said that fake news was very unfortunate as the words of Shahyar Afridi and Ghulam Sarwar were presented out of context in the media.",
  "retrievedAt": "2025-08-11T14:36:42.719Z"
}
