{
  "title": "ISSI holds seminar on Pak-Iran ties: prospects for trade, connectivity",
  "author": null,
  "content": "ISLAMABAD, Feb 27 (APP):The Centre for Afghanistan, Middle East & Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI),  in collaboration with the Iranian Embassy  held a Seminar titled “Pakistan-Iran Ties: Prospects for Trade and Connectivity”.\nThe seminar was moderated by Ms. Amina Khan, Director CAMEA. Speakers included Ambassador Sohail Mahmood, Director General ISSI; Ambassador Reza Amiri-Moghaddam, Ambassador of the Islamic Republic of Iran in Pakistan; Ambassador Mudassir Tipu, Ambassador of Pakistan in the Islamic Republic of Iran; Mr. Hamza Sarosh, Former Senior VP Rawalpindi Chamber of Commerce (RCCI) ; Mr. Damanpak Jami, Senior Fellow, Institute for Political and International Studies (IPIS), Iran, and Dr. Nazir Hussain, Member Board of Directors, Regional Centre for Strategic Studies (RCSS), Colombo-Sri Lanka. The Keynote Speaker on the occasion was Ambassador Riffat Masood, Pakistan’s former Ambassador to Iran.\nAmbassador Sohail Mahmood, Director General ISSI, emphasized the deep historical, cultural, and economic ties between Pakistan and Iran, highlighted the need to leverage geographical proximity into building a durable economic partnership. He noted significant progress since 2021, including border market operationalization, energy cooperation through the Polan-Gabd transmission line, and the expansion of barter trade, alongside commitments made during President Raisi’s 2024 visit, such as the $10 billion trade target, expediting Free Trade Agreement (FTA) negotiations, and economic free zones. He also stressed the importance of leveraging regional platforms like Economic Cooperation Organization (ECO), Developing-8 (D-8), Shanghai Cooperation Organization (SCO), and the Belt and Road Initiative (BRI)  to enhance trade and infrastructure development, particularly through Gwadar-Chabahar port collaboration. While acknowledging challenges, including sanctions, informal trade, and logistical constraints, he called for enhancing border infrastructure, formalizing trade networks, and exploring alternative financial mechanisms. Reaffirming Pakistan’s shift to a geo-economic approach, he emphasized that sustained dialogue and targeted policy initiatives can transform challenges into opportunities, fostering a more integrated, prosperous, and stable region.\nIn her Keynote Speech, Ambassador Riffat Masood outlined key challenges, including trade imbalances, U.S. sanctions, and limited border crossings, while noting regional rivalries and India’s expanding trade ties with Iran. Despite these hurdles, she highlighted positive developments such as 39 MoUs, the revival of the ITI train, and expanded energy cooperation. She urged enhancing border security, strengthening mutual trust, and advancing projects like Gwadar-Chabahar and the BRI to unlock full trade potential.\nMs Amina Khan highlighted the $10 billion trade target and key energy projects as significant steps in strengthening ties. While challenges remain, she stressed that structured engagement and mutual respect provide a strong foundation for a resilient and enduring partnership.\nAmbassador Reza Amiri-Moghaddam emphasized trade and connectivity as the key to economic growth, stressing the need for investment in transit corridors. Noting Pakistan and Iran’s strategic location as trade bridges between Asia and Europe, he called for removing bureaucratic barriers, enhancing transport infrastructure, and deepening cooperation. He also updated on a range of bilateral initiatives including opening of border crossings, establishment of border sustenance markets, new targets for bilateral trade, and feasible options for connectivity between Iran and Pakistan.\nAmbassador Mudassir Tipu highlighted the growing trade potential between Pakistan and Iran, particularly in agriculture and infrastructure development. He emphasized the need to sign an FTA, improve border facilities, and enhance business engagement.\nMr. Hamza Sarosh stressed the need for stronger business-to-business ties, noting that despite geographic proximity and economic complementarities, formal trade remains limited. He urged both countries to streamline trade policies, enhance banking channels, and boost private sector engagement. Mr. Damanpak Jami noted that Pakistan and Iran’s geographic proximity offers a natural trade advantage, and said that Bandar Abbas can be connected to Chabahar and Gwadar, enhancing regional connectivity and paving the way for a strategic partnership between the two countries.  Dr Nazir emphasized that Gwadar and Chabahar should be seen as complementary hubs for enhancing regional connectivity between South and West Asia. He also underscored the importance of enhanced interaction between the business communities as well as increased people-to-people exchanges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:10:59.420Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/issi-holds-seminar-on-pak-iran-ties-prospects-for-trade-connectivity/",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T15:18:00.000Z"
}
