{
  "title": "Experts, politicians express diverse views on creating more provinces: SDPI",
  "author": null,
  "content": "ISLAMABAD, Feb 27 (APP):The experts on federalism, democracy, and devolution on Thursday expressed diverse views on creating more provinces.\nThose who favoured creating more smaller provinces were of the view that the new provinces should be set up as administrative units while others were of the view that provinces in Pakistan can only be created through constitutional Amendment and based on language, culture, and other local dynamics instead of administrative lines.\nThey were speaking at a roundtable discussion on “Political Economy of Administrative Restructuring” organized by the Sustainable Development Policy Institute (SDPI), said a press release.\nTo kick off the discussion on the subject, Mian Muhammad Amir, noted educationist and media outlet head, presented his well thought out paper titled ‘Pakistan 1947-2025- Why it continues to Fail its People?’. He said there is a dire need to create more smaller provinces at the division levels along administrative lines.\nThis will benefit the people across Pakistan. However, there was a consensus among the diverse speakers that service delivery in the country is poor so there is a need to strengthen local government.\nMian Amir said we are reluctant to speak on this subject, otherwise, this could have been the most popular decision liked by the people of Pakistan. According to his paper, smaller manageable provinces will help train leadership from the grass roots and at least from the middle class. He warned that 30 million children are out of schools, and we are creating a lot of unemployed youth.\nQuoting from the experiences of creating new provinces by various countries, he argued that only smaller provinces seemed viable. He thanked SDPI for initiating the debate on his paper and on the overall subject.\nPPP Senator (R) Farhatullah Babar said that they have been discussing the issue of new provinces within the party. He said in other countries, language and culture were behind creating new states. He said we must go through the provisions of the constitution to move towards creating more provinces.\nHe said that the new provinces cannot be made unless the provincial assembly of the respective province adopts a unanimous resolution to do so as was done by the Punjab Assembly on Seraiki province. Instead of asking for new smaller provinces, there is a need to empower local governments so that the people can benefit from these governments at local levels.\nFormer Punjab minister Mian Imran Massod supporting the ideas of smaller provinces, he said that since the 18th Amendment, devolution to provinces have been done and it created no harm to the federation. Similarly, more provinces may not affect federal structure. He said if consensus evolved among all players, we could do another constitutional amendment paving ways for new provinces. We should take this discourse positively as an administrative measure.\nMQM Leader Syed Haider Abbas Rizvi was of the view that Pakistan has been suffering from administrative ills instead of economic crisis. If we make new provinces along administrative lines, we can solve our socio-economic and political issues. He said they believe in devolution of powers. Under the 18th Amendment, the power was devolved from federation to the provinces which further should go down to MCs and UC levels.\nLike the national finance commission awards, there should be provincial commission awards to empower local governments.\nDr Shahid Kardar, former Finance Minister Punjab, said we must develop our democracy in true federal spirit to serve the people better in terms of service delivery.\nFormer federal Secretary Syed Kaleem Imam called for taking the debate to the public to get their opinion on the subject.\nSenior Journalist Zahid Hussain said there is a need to set up a strong local government system and to reconstruct the provinces to deliver to the people.\nHuman Rights Lawyer Col (Retd) Inamur Rehman said that nothing could be hide in the era of social media. Tell the people about their rights and there could be a referendum on the issue of creating more provinces.\nShahid Zaheer, a former bureaucrat suggested to bridge the gap between the people and policy makers to improve trust level so that people contribute taxes willingly.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:10:34.454Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/experts-politicians-express-diverse-views-on-creating-more-provinces-sdpi/",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T16:18:00.000Z"
}
