{
  "title": "33rd anniversary of Khojaly genocide commemorated",
  "author": null,
  "content": "ISLAMABAD, Feb 27 (APP):A seminar titled “Khojaly Genocide and Ethnic Cleansing: A Crime Against Humanity” was held at the National Library in Islamabad to commemorate the 33rd anniversary of the Khojaly genocide.\nThe event was organized by the MUSLIM Institute in collaboration with the Embassy of Azerbaijan.\nDistinguished speakers, including Ambassador of Azerbaijan to Pakistan Khazar Farhadov, Ambassador of Turkiye to Pakistan Irfan Neziroglu, and others, reflected on the historical tragedy and emphasized the importance of justice and global solidarity.\nThey highlighted the forced deportations of nearly 150,000 Azerbaijanis by Armenia between 1948 and 1953, and the subsequent expulsion of 250,000 Azerbaijanis in 1988, transforming Armenia into a mono-ethnic state.\nThe Khojaly genocide, which occurred in February 1992, resulted in the brutal massacre of 613 innocent Azerbaijani civilians, including 106 women and 83 children. The speakers emphasized that remembering the martyrs of Khojaly is not just an act of commemoration but a commitment to justice.\nThe seminar also underscored the importance of challenging narratives that justify oppression and warned that silence enables atrocities in conflict zones. The international community was urged to hold accountable those responsible for mass violence, including the perpetrators of genocide in Indian Gujarat and Karnataka.\nThe event concluded with a strong call to further strengthen bilateral relations between Pakistan and Azerbaijan, enhancing cooperation in defense, education, trade, and cultural exchange. The speakers emphasized the need for continued engagement at regional and international levels to foster peace, stability, and prosperity for both nations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:11:24.317Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/33rd-anniversary-of-khojaly-genocide-commemorated/",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T13:53:00.000Z"
}
