{
  "title": "PM, Crown Prince of Abu Dhabi resolve to enhance Pakistan, UAE ties",
  "author": null,
  "content": "ISLAMABAD, Feb 27 (APP):Crown Prince of Abu Dhabi and Chairman of Abu Dhabi Executive Council Sheikh Khaled bin Mohamed bin Zayed Al Nahyan called on Prime Minister Muhammad Shehbaz Sharif during his official visit to Pakistan on Thursday and discussed matters of bilateral interest.\nThis was the first official visit of Sheikh Khalid to Pakistan, in his capacity as Crown Prince.\nThe Prime Minister warmly welcomed the Abu Dhabi’s Crown Prince while reaffirming Pakistan’s resolve to further strengthen its historic and fraternal bonds between Pakistan and the United Arab Emirates. One on one meeting was followed by the delegation level talks.\nRecalling his most productive meeting with His Highness Sheikh Mohamed bin Zayed Al Nahyan, President of the UAE in Abu Dhabi earlier this month, the Prime Minister said that it was a matter of huge satisfaction that the two countries were now working more closely than ever before, to transform their excellent political ties into a mutually beneficial economic partnership. The Prime Minister told that during his recent visit to Uzbekistan the project of Uzbekistan-Afghanistan-Pakistan Railway Line was discussed and Uzbekistan showed keen interest in the project. He further said that the project will benefit the ports of Gwadar and Abu Dhabi and would prove to be a game changer for the whole region.\nThe Prime Minister lauded the U.A.E.’s consistent and strong support for Pakistan in various fields, including at difficult times. He deeply appreciated the keen interest shown by the U.A.E. in expanding its investment portfolio in Pakistan and remarked that the recent successful investment initiatives between various Pakistani entities and Abu Dhabi Ports were a shining example of this robust and ever-expanding cooperation.\nSheikh Khaled bin Mohamed bin Zayed, who was accompanied by a delegation comprising senior officials and business leaders, thanked the Prime Minister and reaffirmed the U.A.E.’s steadfast support for Pakistan’s economic development and prosperity.\nOn this occasion, both leaders also witnessed the exchange of several MoUs and agreements between the two sides. The MoUs/Agreements were signed in the fields of banking, mining, infrastructure development and railways.\nMeanwhile in a post on X, the PM said, “Honoured to welcome HH Sheikh Khaled bin Mohamed bin Zayed Al Nahyan, Crown Prince of Abu Dhabi and Chairman of Abu Dhabi Executive Council, today. We held the most fruitful discussions and resolved to further strengthen our excellent bilateral ties, through enhanced trade, investment & energy cooperation. With the encouragement and support of the UAE’s Royal family, Pakistan-UAE ties are growing from strength to strength!”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:11:01.177Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-crown-prince-of-abu-dhabi-resolve-to-enhance-pakistan-uae-ties/",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T14:31:00.000Z"
}
