{
  "title": "CDA generates Rs 21.84b revenue through commercial plots’ auction",
  "author": null,
  "content": "ISLAMABAD, Feb 27 (APP):Capital Development Authority (CDA) has successfully concluded the third day of its high-stakes commercial plot auction, generating a staggering Rs. 21.84 billion in revenue so far.\nWith just one day remaining, the auction has already surpassed expectations, attracting a flood of investors eager to secure prime real estate in the federal capital.\nThe auction, which began on February 25, has seen fierce competition across 18 categories of commercial plots.\nOn the third day alone, five plots were sold for a combined Rs. 5.024 billion, adding to the Rs. 16.82 billion raised in the first two days.\nThe event, held at the Jinnah Convention Center, will culminate on Friday, February 28, with the auction of constructed shops at the Blue Area Parking Plaza.\nThe highlight of the third day was the sale of Plot No. 25-B in Sector G-11/1, which fetched an impressive Rs. 2.794 billion. Other notable transactions included Plot No. 5 in Sector G-9/2, sold for Rs. 246 million, and three plots in I-14 Markaz Plot No. 3-E, Plot No. 3-D, and Plot No. 3-C each securing Rs. 661.3 million. These sales underscore the high demand for commercial spaces in key sectors of Islamabad.\nThe auction is being closely monitored by the CDA’s Auction Committee, chaired by the Member Finance.\nAll bids will undergo rigorous scrutiny before being presented to the CDA Board for final approval.\nCDA Chairman Muhammad Ali Randhawa emphasized that the revenue generated from the auction will be reinvested into the city’s development and beautification projects, aiming to enhance Islamabad’s infrastructure and public amenities.\nThe overwhelming participation of investors reflects confidence in Islamabad’s real estate market. “The response has been phenomenal,” said a CDA spokesperson. “Investors are keen to capitalize on the city’s growing commercial potential, and the auction has provided them with a golden opportunity.”\nAs the auction enters its final day, all eyes are on the Blue Area Parking Plaza shops, expected to attract even more competitive bidding.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:10:58.002Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-generates-rs-21-84b-revenue-through-commercial-plots-auction/",
  "dateList": "2025-02-27",
  "date_published": "2025-02-27T15:55:00.000Z"
}
