{
  "article_id": "2025-03-29_259c3974065a23b17b3c1af2f0f0ef0d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistani-american-police-officer-promoted-to-captain-in-nypd/",
    "retrieved_at": "2025-08-27T14:05:54.377Z"
  },
  "metadata": {
    "title": "Pakistani-American police officer promoted to Captain in NYPD",
    "author": null,
    "date_published": "2025-03-29T15:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 273,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "NEW YORK, March 29 (APP): A Pakistani-American police officer Zegham Abbas in the New York Police Department (NYPD), has been promoted to the rank of Captain. Abbas's promotion marks the culmination of his 16-year service within the department. To honour his achievement, a special ceremony was held at the NYPD headquarters at One Police Plaza. The event was attended by senior NYPD officials, family members, and friends who celebrated his success. Captain Zegham Abbas hails from Lahore, Pakistan. He attended King Edward Medical College in Lahore before moving to the United States in 2003 through a student exchange program. He then pursued his medical degree at Albert Einstein College of Medicine, completing his education there. In 2009, he joined the New York Police Department, where he has since made significant strides in his career. Speaking at the ceremony, Captain Abbas explained that after reaching the Captain rank, officers in NYPD can progress to the positions of One-Star Chief, Two-Star Chief, and Three-Star Chief. The highest rank is Four-Star Chief, which is the most senior position within the department. He also mentioned that the promotion to Captain is the final step in NYPD's promotional exams, and completing this exam successfully is essential to achieving the Captaincy. At the ceremony, prominent political and social figures from New York, Aslam Dholon, congratulated Captain Zegham Abbas on his promotion and expressed hope that, like in the past, Abbas would continue to serve the Pakistani community in New York in the future. Currently, nearly 500 Pakistani-American officers, both senior and junior, are serving in the NYPD, underscoring the increasing presence and contribution of Pakistani-American officers in law enforcement.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}