{
  "article_id": "2025-03-29_c5f3d015196915f3a60ae3d4f65486f2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-sharif-greets-the-amir-of-qatar-on-eid/",
    "retrieved_at": "2025-08-27T14:06:16.916Z"
  },
  "metadata": {
    "title": "PM Shehbaz Sharif greets the Amir of Qatar on Eid",
    "author": null,
    "date_published": "2025-03-29T11:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 213,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Mar 29 (APP):Prime Minister Muhammad Shehbaz Sharif on Saturday held a telephonic call with the Amir of the State of Qatar His Highness Sheikh Tamim bin Hamad Al Thani and conveyed his warm greetings and best wishes and the brotherly people of Qatar on Eid ul Fitr. His Highness the Amir warmly reciprocated the Prime Minister's Eid greetings and conveyed his best wishes for the people of Pakistan. While fondly recalling his visit to Doha last October, the Prime Minister conveyed his deep appreciation to the Amir as well as Her Excellency Sheikha Al Mayassa, for hosting the Manzar cultural exhibition, which was inaugurated in his presence. The Prime Minister proposed the idea of having a similar exhibition hosted in Lahore, which the Amir very graciously accepted. The two leaders also reaffirmed their common desire to further strengthen the close brotherly relations in the trade and investment. To carry forward discussions on investment, it was agreed that a delegation from Qatar shall visit Pakistan immediately after Eid. The regional situation was also discussed and the Prime Minister expressed his deep appreciation for Qatar's diplomatic role in peace efforts, particularly in Gaza. The Prime Minister also renewed his invitation to the Amir to undertake an official visit to Pakistan at his earliest convenience.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}