{
  "title": "President directs SLICP to pay insurance claim to nominees of a deceased policyholder",
  "link": "https://www.app.com.pk/national/president-directs-slicp-to-pay-insurance-claim-to-nominees-of-a-deceased-policyholder/",
  "date_published": "2023-11-05T09:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): President Dr Arif Alvi has directed the State Life Insurance Corporation of Pakistan (SLICP) to pay death insurance claim worth Rs 300,000 along with a profit to the family members of a deceased policyholder, who were not being paid the claim for almost three years.\nThe president further asked the SLICP to form a panel of doctors for devising a policy on pre-insurance tests of proposed policyholders.\nThe president gave these directions while rejecting a representation filed by SLICP against the order of the Wafaqi Mohtasib, President Secretariat Press Wing said in a press release on Sunday.\nSaad Taheer (the complainant) had alleged that his father had purchased a life insurance policy from the agency in 2013 for the sum assured of Rs 300,000/- with annual premium of Rs 18,406.\nHis father died in 2020, and he filed the death insurance claim which was repudiated by SLICP on the ground that the deceased had a pre-insurance ailment of hepatitis-C, which he had deliberately hidden.\nFeeling aggrieved, he approached the Wafaqi Mohtasib which asked SLICP to reconsider the matter and provide appropriate relief to the nominees of the deceased policyholder. SLICP, then, filed a representation with the President against the Mohtasib’s order.\nThe president held a hearing on the matter, and after listening to both sides, gave his decision.\nHe pointed out that the deceased purchased the policy in 2013, whereas SLICP had produced copies of medical reports of the year 2015 and all reports pertained to the post-insurance period and were not worth consideration.\nHe further noted that the confidential report of the SLICP field officer had also declared the insured as healthy at the time of issuance of the policy and had clearly stated that she knew the insured for the last two years.\nThe president also referred to Section 80 of the Insurance Ordinance 2000, which provided that no policy of life insurance, after the expiry of two years from the date on which it was affected, shall be called into question by the insurer on the ground that a statement in the proposal for insurance or in any report of a medical officer was false or inaccurate.\nThe president, therefore, rejected State Life’s representation and directed it to pay the insurance claim along with the accrued profit within 30 days to the nominees.\nHe further asked State Life to constitute a panel of doctors to advise it on a policy regarding pre-insurance medical tests.\n“This panel of doctors would suggest as to what are the most prevalent and common diseases in Pakistan and what tests should be included before issuance of the policy”, he added.\nThe president also advised that the company might devise a risk assessment about different diseases and modify premiums accordingly, if they wanted to issue policies to patients with mild and very prevalent diseases like diabetes, hypertension, hepatitis etc.",
  "retrievedAt": "2025-08-11T10:22:54.578Z"
}
