{
  "title": "LESCO detects 244 power pilferers on 58th day of anti-power theft campaign",
  "link": "https://www.app.com.pk/national/lesco-detects-244-power-pilferers-on-58th-day-of-anti-power-theft-campaign/",
  "date_published": "2023-11-05T09:58:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 05 (APP):Lahore Electric Supply Company (LESCO) detected a total of 244 connections from\nwhere the customers were pilfering electricity in all its circles of five districts (Lahore, Sheikhupura, Nankana Sahib, Kasur and Okara) on the 58th day of grand anti-power theft campaign.\nLESCO spokesman told the media here Sunday the company had also lodged FIR applications against 243 electricity thieves, out of which 56 FIRs had been got registered in respective police stations, while 37 accused have been arrested.\nGrand anti-power theft operations against electricity thieves are being conducted on the directives of the Federal Power Division and the LESCO Chief Executive Officer (CEO) Engineer Shahid Haider is supervising these operations. The LESCO chief vowed that the operations would continue without discrimination until the complete end of electricity theft. The electricity pilferers as well as the LESCO officers and employees who facilitate them were also being brought to justice.\nOn the 58th consecutive day (Nov 5) of the anti-power theft campaign, the spokesman added, large commercial consumers were also found involved in electricity theft and all of them were also disconnected and charged with detection units. Among the seized connections 10 were commercial, 03 agricultural and 231 domestic, and all these connections were disconnected and charged with a total of 669,071 units as detection bill amounting to Rs 11.657 million.\nApprising the media about some major power pilferers, he explained that LESCO charged Rs 500,000 detection bill against 8,000 units to an electricity pilferer in Kot Lakhpat area of Lahore; Rs 250,000 fine in the form of detection bill against 5,165 units to a customer stealing electricity in Panorama Centre Lahore; Rs 206,109 detection bill against 3,153 units to another power thief in Sundar area Raiwind; and Rs 205,609 detection bill against 2,540 units to a power thief also in Sundar area.\nDuring the 58 days of grand anti-theft campaign, the spokesman mentioned that LESCO detected pilferage on 23,713 power connections and submitted 23,474 FIR applications against electricity thieves in the relevant police stations, out of which 22,625 FIRs had been registered, while 11,873 accused have so far been arrested by the police. The LESCO has so far charged a total of 45,212,509 detection units worth Rs 1,916,124,205 to all the power pilferers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:23:16.159Z"
}
