{
  "title": "Govt to devise new strategy to deal with inflation in country: Dr Aisha",
  "link": "https://www.app.com.pk/national/govt-to-devise-new-strategy-to-deal-with-inflation-in-country-dr-aisha/",
  "date_published": "2022-05-27T10:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): State Minister for Finance and Revenue Dr Aisha Ghaus Pasha on Friday said the incumbent government was working on many structural reforms to bring back the economy on the track of an inclusive and sustainable growth.\nResponding to various queries during the Questions Hour in the Senate, she said the government was completely acquainted with the current economic woes and it would have to take tough decisions for mitigating the severe effects of inflation on the middle and low-income groups.\nDr Aisha said the masses had been provided relief during the holy month of Ramzan and they would be facilitated in the coming days.\nShe said the government was working on the needed reforms to achieve the macroeconomic stability, build fiscal resilience and stimulate economic recovery.\nShe said the government was devising a new strategy to overcome inflation in the country.\nThe minister said we needed to regain the credibility which we had lost substantially in the last four years.\nThe main factor of inflation was taking foreign loans in the last three years, she added.\nShe said the 22 per cent inflation was due to importing many things including food items.\nShe said with respect to income tax, there had not been any major changes in tax rates except one, wherein a new additional tax rate was introduced to tax on money income vide tax laws (Amendment) Ordinance, 2021. This new additional tax was later on increased in 2022.\nShe said this measure was taken to reduce on money practice and bring the income from on money into the tax net.\nIn written reply, she said the present SBP governor had been appointed under Section 10 (3) of SBP Act, 1956 which provides that the governor shall be appointed by the president for a term of three years and on such salary and terms and conditions of service as the president may determine, except that neither the salary of the governor nor his other terms and conditions of service shall be varied to his disadvantage after his appointment.\n“No person shall hold the office of the governor after attaining the age of sixty five years,” she added.",
  "retrievedAt": "2025-08-11T14:58:32.449Z"
}
