{
  "title": "Imran froze petrol, diesel prices sans subsidiary allocations or ECC approval: Musadik",
  "link": "https://www.app.com.pk/national/imran-froze-petrol-diesel-prices-sans-subsidiary-allocations-or-ecc-approval-musadik/",
  "date_published": "2022-05-27T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Minister of State for Petroleum Senator Dr Musadik Malik Friday said ex-prime minister Imran Khan had frozen the petroleum prices without allocating the required subsidy amount or approval from the Economic Coordination Committee (ECC).\nAddressing a news conference in Islamabad on Friday, he said Imran indeed had installed “land mines” for the government by subsiding the oil prices- thus deliberately pushing the country to the brink of bankruptcy.\nHe urged Imran not to mislead people on only assumptions.\nHe said comprehensive investigations have transpired that Imran Khan had announced the freezing of petroleum product prices sans having any cogent plan for paying the subsidy.\nThe ex-prime minister abruptly announced the oil price-freezing apparently for political gains as he knew his government was being ousted.\nImran had announced Rs 120 billion per month subsidy on petroleum products sans any allocation; he said adding that there was no written agreement with Russia about oil import at reduced rates.\nThe total subsidy on oil up to June 2022 was Rs 360 billion which was announced without consulting the ministry, cabinet, or inking any agreement.\nDr Musadik said Imran Khan had inflicted from Rs 700- 800 billion losses to the national exchequer on account of subsidizing petroleum products if taxes were included.\nThe annual budget to meet expenses of the federal government was Rs 520 billion, he added.\nHe said Prime Minister Shehbaz Sharif had made it clear that he would not allow an increase in oil prices without finalizing a plan to save poor segments of society. “We have to save the people having an income of Rs 20,000- 30,000 per month from impacts of inflation.” Let the rich share the burden of inflation, he added.\nThe government has devised a comprehensive strategy to save the poor segments of society from the impact of increased petroleum prices.\nHe said the PM would announce the plan soon to save the poor from inflation.\nRegarding Imran Khan’s claim of buying oil from Russia, he said no documentary evidence of his claims had so far been spotted. If there was any understanding with Russia, where were the documents? he questioned.\nThe minister said the Imran government in its last days had written a letter to Russia expressing the desire for starting trade with Russia without receiving any response from Russia.\nHe said, present government has also contacted Russia but the energy minister of Russia said they were ready for holding talks on the projects related to infrastructure development. “The Russian ambassador was also contacted but we did not receive any reply yet.”\nMusadik said Pakistan State Oil (PSO) arranged nearly 50 per cent of imports of petroleum products through open tendering. The people claiming to buy petroleum products at a 30 per cent discount should compete for the open bidding and bring cheap oil to the country, he added.\nAbout oil prices’ decrease in India, he said today’s petrol price in India was Rs 250.17 per litre in Pakistani rupee. Whereas the price of petrol in Pakistan was Rs 179.85 per litre.\nDiesel was available in India at Rs 234.03 per litre. In Pakistan, the diesel price was Rs 174.15 per litre.\nIndia has recently decreased the petrol price by Rs 24 per litre. Indeed they had decreased Central Excise Duty (CED) on petroleum products. In Pakistan the CED was already zero, the minister said.",
  "retrievedAt": "2025-08-11T14:58:29.569Z"
}
