{
  "title": "Six days aside, Imran would not return to Islamabad in 6 centuries: Marriyum",
  "link": "https://www.app.com.pk/national/six-days-aside-imran-would-not-return-to-islamabad-in-6-centuries-marriyum/",
  "date_published": "2022-05-27T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Friday said Imran Khan would never return to Islamabad with a so-called long march again as the masses did not support him anymore due to his 4-year rule of corruption, nepotism, loot and plunder.\n“Six days aside , he (Imran) will not return to Islamabad in the next six centuries,” she said while making it clear to all and sundry that the fresh election would be held on completion of the coalition government’s constitutional term.\nLIVE #APPNews : Federal Minister for Information & Broadcasting @Marriyum_A addresses News Conference #Islamabad  https://t.co/bjwyQmG7sg\nAddressing a news conference, she said it was the prerogative of Pakistan Muslim League-Nawaz (PML-N) and its allies to announce the fresh election date and they would do so.\nShe said the people had realized that Imran is a kleptomaniac, thief, incompetent and imbecile person who ruined the economy, devalued the rupee, rendered millions of youth unemployed and burdened the people with massive debts.\nThe minister termed Imran’s march a “flop show” and advised him to stay-at-home as it would be difficult for him to face the people who had rejected the politics of vandalism, arson and sabotage.\n“Take a relaxing pill and rest at your residence in Banigala, and let others to relax,” she said asking Imran to watch television while being at home and learn from Prime Minister Shehbaz Sharif as to how run the state’s affairs.\nShe said stay-at-home was the only option for Imran as his politics and political narrative had been buried by the masses who had decided to support the politics of progress, development and prosperity.\nMarriyum said the journey of progress had been started under the dynamic leadership of PM Shehbaz Sharif who was working day and night to steer the country out of economic crisis and provide them maximum relief to ward off impact of the inflation inherited by the current government from the previous one.\nShe said the prime minister would address the nation shortly and inform them about the elements of economic plan prepared by the PML-N government in consultation with its allies for providing relief to the masses.\n“The people will see the difference tonight that the country had not a prime minister who got to know from TV that the rupee had devalued and inflation gone up,” she said, adding Shehbaz Sharif was a hands-on PM who was chalking out a plan which would help reduce the burden of the conditions accepted by the government in the International Monetary Fund (IMF) agreement.\nShe said a plan was underway to ease the IMF agreement’s conditions with policy fixes for the public who would be provided relief through fiscal management.\nThe conditions in the agreement were agreed by the Imran-led government, she said vowing that a plan was also being devised to ensure people-friendly negotiations with the IMF in the future.\nShe said as per the PTI regime’s agreement with IMF, the Imran led government promised to increase the price of petroleum products every month and the mafias near Imran were the major beneficiary.\nMarriyum said the present government could have raised the price of petrol and diesel on the very first day after coming into power on the basis of the PTI government and IMF deal, but it realized that the masses were already suffering under the burden of inflation and even now this decision was taken with a heavy heart.\nShe said when Imran realized that he would be voted out through no confidence motion, he announced subsidy on petroleum products which was opposed by his Minister for Finance and secretary finance and it was never presented before the federal cabinet for approval.\nShe said the person who could not hold a small public gathering in Islamabad, would never launch a long march again. What sort of the long march was it? The leader was airborne and giving call to its workers to reach D-Chowk and use brute force against the policemen.\nMarriyum said he climbed to his container after descending from the helicopter the next day. Despite giving the calls to its workers for reaching the D-Chowk, he, himself, not went there and abandoned them abruptly.\n“It cannot be a revolution, rather it is impassiveness and impudicity,” she said, adding Imran ran away despite the government gave them permission for the protest.\nShe said revolution was not possible without the power of masses. “The revolution and power comes again and again when a leader has a support of its people as this happens in the case of Nawaz Sharif,” she added.\nReacting to Imran’s presser, she said he had admitted that he returned after failure of his much trumpeted long march.\nImran claimed that there were hurdles on the way, but at the same time admitted they came to Islamabad without preparation, she added.\nTaking a dig at the PTI chief , she said that actually they had made preparations for collecting weapons, sticks and ammunition as they already announced a “bloody long march”.\nShe revealed that every PTI MNA and MPA from KP was given Rs 3.5 million from the KPK government’s resources for making arrangements of the long march.\nThe PTI leaders had conspired to pitch KP, Punjab and Federal police against each other, she added.\nMarriuym said that PTI activists carrying arms were shown on the television channels and no one could deny the fact.\nImran’s claim that he returned as he feared that there would be violence was strange. The actual reason to abandon the march was his frustration over meager number of participants including 20 vehicles in his convoy and about 1500 protesters on the ground.\nShe said that Imran’s claim of hurdles was not based on reality as from Attock Bridge to F-8 there was no hurdle along the way. His convoy was stopped for more than half a dozen times to wait for the arrival of other supporters but no one turned up as the people had rejected the politics of violence.\nMarriyum Aurangzeb said that Imran should also visit the residence of the police man martyred in firing of PTI activists in Lahore and apologize with his family as he did visit the house of PTI worker.\nShe also brushed aside the notion that the overseas Pakistanis were deprived of the voting right. The new legislation on electoral reforms had been made after removing anomalies in the law enacted by the PTI government through ordinance.\nThe expats were given the voting right, but its procedure would be decided by the Election Commission of Pakistan so that their vote would not become controversial. “We are giving them representation in the Parliament.\nShe said the ECP was empowered by the current government and given a right to ensure free and fair elections in the country.\nMarriyum said she had proposed to record the wrongdoings of the NAB under its present chairman who should not let go home without holding him to the account.\nTo a query, she said Imran had dictatorial mindset while the country now had a democratic government which would not listen to his dictations and threats.\nA person who was rejected by people should not be listened to, she added.\nShe said Imran did not bother to consult the opposition during his rule on the major issues such as COVID-19 pandemic, terrorism, economy and others.\nThe minister said the law would take its course wherever Imran misused his authority.\nThere were the evidences as to how the sugar was exported and then imported during his rule for filling the pockets of mafias and cartels.\nAs regards the unruly incidents at Masjid-e-Nabvi, she said the matter was between Imran Khan and the Almighty. “What they [PTI workers] had done to me at Masjid-e-Nabvi, I leave it to Allah,” she added.",
  "retrievedAt": "2025-08-11T14:58:28.838Z"
}
