{
  "title": "PTI keen to learn Chinese model of economic, financial rejuvenation: Saifullah Nyazee",
  "link": "https://www.app.com.pk/national/pti-keen-to-learn-chinese-model-of-economic-financial-rejuvenation-saifullah-nyazee/",
  "date_published": "2021-07-06T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP): Chief Organizer Pakistan Tehreek Insaf (PTI) Senator Saifullah Khan Nyazee on Tuesday said his party is keen to learn Chinese way of modernity, governance, fighting corruption and model of economic and financial rejuvenation.\nAddressing at a ceremony to mark the centenary of the Communist Party of China (CPC) here, he said it was a historic day for both the political parties PTI and CPC as they were celebrating together 100th anniversary of the CPC and the 10th anniversary of the establishment of bilateral relations between the two political parties.\nCongratulating the CPC on 100th anniversary, he said CPC was the Party which was holding 1.4 billion people together. “Pakistan was going through a phase akin to the Chinese post cultural revolution,” he said while stressing the need to fight off deep rooted corruption.\nHe said that Prime Minister Imran Khan was resolute against terrorism and imperial dictates, in equal measures.\nThe Chief Organizer PTI said that people were yielding fruits from the prudent policies of Prime Minister Imran Khan, adding that despite all odds, the country’s gross domestic product (GDP) has touched 4 percent. He said that it was a great achievement for a developing nation.\nAmbassador of the People’s Republic of China to Pakistan Nong Rong eulogized PTI for hosting the event to celebrate the 100th anniversary of CPC. He said that PTI and CPC had developed its relations at party to party level and both the political parties were also arranging high level party exchanges.\nThe Chinese Ambassador said that CPC and PTI had signed a memorandum of understanding (MoU) to further strengthen links between the two parties.\nHe vowed to further strengthen its relations through mutual learning between the two friendly countries.",
  "retrievedAt": "2025-08-11T20:56:28.526Z"
}
