{
  "title": "AJK President calls for highlighting mass atrocities in IIOJK through movies, plays",
  "link": "https://www.app.com.pk/national/ajk-president-calls-for-highlighting-mass-atrocities-in-iiojk-through-movies-plays/",
  "date_published": "2021-07-06T13:36:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Jul 06 (APP): AJK President Sardar Masood Khan Tuesday called upon human rights bodies, civil society organizations, and youth activists to highlight mass atrocities in Indian Occupied Jammu and Kashmir (IIOJK) through short films, plays, skits, and other modern and traditional media.\nHe expressed these views while talking to a four-member delegation of the Human Rights Council of Pakistan which called on him under the leadership of the Council chief Jamshed Hussain in the State metropolis , AJK President office said here on Tuesday.\nHe said thousands of people in IIOJK have been killed by Indian forces in custody, extrajudicial executions, and enforced disappearances, and these human rights violations are committed with absolute impunity.\nThe President said, one million Indian Army troops had besieged the defenseless Kashmiris for the last 73 years in general and the last two years in particular and they had let loose the worst oppression against them.\nHe maintained, besides killing, the Kashmiri people were being deprived of their properties, dignity, and jobs, and it appears that India is bent upon eliminating the Kashmiris thereby changing the Muslim identity of the state.\nSardar Masood Khan lamented, the youth raising their voice against the heinous Indian plan of settling Hindus in the Muslim majority state to change its demography, are declared terrorists and killed.\nHe urged the Human Rights Council of Pakistan and other human rights groups to launch a full-scale campaign to expose the brutalities of the Indian troops through all available media. Expressed his concern, he said the so-called human rights champion Western countries were silent over the Indian brutalities.\nThe organization now, they said was going to observe Kashmir martyrs week from Thursday which will start from a seminar at the National Press Club Islamabad where besides the AJK president, many national figures will speak.",
  "retrievedAt": "2025-08-11T20:56:32.393Z"
}
