{
  "title": "EU ambassador calls on Speaker Punjab Assembly",
  "link": "https://www.app.com.pk/national/eu-ambassador-calls-on-speaker-punjab-assembly/",
  "date_published": "2021-07-06T15:59:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 06 (APP): Ambassador of the European Union to Pakistan Androulla Kaminara called on Speaker Punjab Assembly Chaudhry Parvez Elahi and discussed wide range of matters including digitalization, GSP Plus status regional stability, EU-Pak relations and matters of mutual interest during a meeting here on Tuesday.\nThe European Union ambassador was accompanied a delegation comprising Head of Political, Trade and Communications section Daniel Clauss, Press and Information Section Officer Syed Khawar Hussain and Androulla Kaminara’s husband Charlie.\nSpeaking on the occasion, Chaudhry Parvez Elahi said that Kashmir dispute was a long-standing issue between Pakistan and India, adding that Pakistan wanted a peaceful solution of the issue as per the United Nations (UN) resolutions.\nHe said the political and military leadership besides the general public were united on the Kashmir issue, urging the EU to take notice of the violation of human rights in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) and play its role in giving the Kashmiri people their right to self-determination as envisaged in the statutes of UN.\nSpeaker Punjab Assembly stressed the need to stop the Indian government from the use of brutal force against the hapless, innocent Kashmiri people of the occupied valley.\nHe said Pakistan gives great importance to its trade ties, adding that EU was the second largest business partner of Pakistan. He said Pakistan was one of the largest importer of chemicals and machinery from the EU.\nSpeaker PA stressed the need to enhance exchange of parliamentary delegations between Pakistan and the EU member countries, adding that her delegation would further strengthen the relationship between the European Union and Pakistan.\nAmbassador Androulla Kaminara said that the EU gives great importance to its ties with Pakistan, adding that EU would play its role in digitalization of various sectors.\nThe diplomat said that the EU pins great importance to improving status of women in Pakistan, adding that the role of women was vital in prosperity of societies.\nAcknowledging the importance of peace for regional stability, she said the EU will play its role ensuring peace in the region.\nAndroulla Kaminara said the EU will continue its support to the provincial assemblies of the country.",
  "retrievedAt": "2025-08-11T20:56:30.610Z"
}
