{
  "title": "Pakistan acted concretely to protect human capital from pandemic’s negative impacts: Dr Nishtar",
  "link": "https://www.app.com.pk/national/pakistan-acted-concretely-to-protect-human-capital-from-pandemics-negative-impacts-dr-nishtar/",
  "date_published": "2021-07-06T18:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr Sania Nishtar Tuesday said Pakistan is among the first few countries that acted concretely in terms of protecting the human capital from the negative effects of the COVID-19 pandemic.\nShe was speaking at the High-Level Political Forum, UN Headquarters at Town Hall session “The SDGs in time of crisis: A sustainable, inclusive and resilient recovery from COVID-19 as an opportunity to realize the SDGs”.\nSpeaking on the occasion, Dr Nishtar said the pandemic has taught us that the data innovation, delivery system and a commitment to integrity and accountability are crucial to address the longstanding fault lines that have plagued the public sector delivery.\nAnd today Pakistan’s transformative reform hinges on these attributes, she said adding secondly, gaps in financial and digital literacy must be addressed to bridge the digital divide and it is with this in view that we have built financial inclusion into the overall design of expanded social protection.\nThirdly, we must protect human capital from the negative coping strategies that are inevitable as a result of the pandemic and in this regard Pakistan is amongst the first few countries that acted concretely, she mentioned.\nDr Nishtar said, “We placed nutrition and financial access to education at the heart of social protection objectives.”\nDespite that COVID-19 disruptions, “We are on track to upscale a new nationwide health and nutritional CCT and have already up-scaled our education conditional cash transfer programme nationally. Both programme heavily skewed in favour of women and girls who get a higher cash stipends amount,” she added.\nTo hedge against food price inflation, Dr Nishtar said, “We took a policy decision to target commodity subsidies to benefit the poor and have provided universal social protection and universal health coverage for the transgenders and the eligible differently abled.”\nShe said, “We are using innovative financing to combat hunger by forging partnerships with philanthropists and restructuring social protection programmes for informal workers”.\n“And even in the midst of the pandemic, we fast track work on the digital social registry in view of its importance in the 21st century welfare state”, she said.\nDr Nishtar said, “We realize that there is more that needs to be done and we in fact are beware of the complacency.”\nShe continued, “We believe the pandemic has unearthed an opportunity to recast the role of a welfare state which needs to be a major part of re-commitment to the agenda 2030. Each country will have its own way of taking forward this but the essential building blocks are the same.”\nShe said in Pakistan we believe that the social protection of today is the human capital, the resilience and the economic inclusion of tomorrow.\nInvesting in social protection is both a response to current needs as well as preparedness for and insurance against future crises, she added.",
  "retrievedAt": "2025-08-11T20:56:28.509Z"
}
