{
  "title": "COVID-19 national tally reports 74 infected patients in critical condition",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-reports-74-infected-patients-in-critical-condition/",
  "date_published": "2021-07-06T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP): The national tally on Tuesday of total active COVID-19 cases was recorded 33,390 with 830 more people testing positive for the deadly virus and 714 people recovering from the disease whereas 74 infected persons were admitted in the hospitals in critical condition during last 24 hours.\nTwenty-five corona patients have died during past 24 hours, 23 of whom were under treatment in the hospitals and two of them perished in their respective homes or quarantine facilities, according to the latest update issued by the National Command and Operation Center (NCOC).\nMost of the deaths occurred in Punjab and followed by Sindh. Out of the total 25 deaths occurred, 12 of them died were under treatment on ventilators.\nThere were 1,968 Covid infected patients under treatment in critical condition and 74 of them were admitted in various Covid dedicated healthcare facilities of the country during past 24 hours.\nNational Covid positivity ratio during past 24 hours was recorded 2.22 percent. The Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 11 percent, Lahore 15 percent, Peshawar 11 percent and Multan 18 percent. The maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 91 percent, Muzaffarabad 16 percent, Karachi 30 percent and Rawalpindi 20 percent.\nAround 199 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Balochistan, and Gilgit Baltistan (GB).\nSome 37,364 tests were conducted across the country on Monday, including 9,743 in Sindh, 17,488 in Punjab, 7,184 in Khyber Pakhtunkhwa (KP), 1,519 in Islamabad Capital Territory (ICT), 529 in Balochistan, 385 in GB, and 516 in AJK.\nAround 908,648 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 964,490 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 20,588, Balochistan 27,445, GB 6,504, ICT 83,048, KP 138,616, Punjab 347,014 and Sindh 341,275.\nAbout 22,452deaths were recorded in country since the eruption of the contagion. Around 5,528 people perished in Sindh, eight of them died in hospitals. Some 10,786 people died in Punjab with eight deaths occurred in the hospitals and two out of the hospitals in the past 24 hours.\nAs many as 4,343 people expired in KP,three of them died in hospitals, 780 individuals died in ICT, 315 people died in Balochistan, three of them died in the hospitals, 111 infected people perished in GB and 589 people in AJK succumbed to the deadly virus, one of them perished in the hospitals.\nA total of 14,815,639 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country. Some 2,223 corona patients were admitted in hospitals.",
  "retrievedAt": "2025-08-11T20:56:35.442Z"
}
