{
  "title": "Micromanagement approach adopted by PTI govt to brave COVID-19 induced challenge: Syed Ali Zaidi",
  "link": "https://www.app.com.pk/national/micromanagement-approach-adopted-by-pti-govt-to-brave-covid-19-induced-challenge-syed-ali-zaidi/",
  "date_published": "2020-04-14T03:36:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 14 (APP):Federal Minister for Shipping and Maritime Affairs, Ali Haider Zaidi here on Tuesday said that Pakistan Tehreek i Insaf(PTI) government has adopted a micro-management approach to handle COVID-19,a pandemic of global proportions also affecting our country that holds its own and peculiar dynamics.\nTalking to reporters during his visit to a Ehsaas Center functional in an urban slum “Chanesar Goth” that fall in his constituency NA 244, he said Prime Minister Imran Khan fully conscious of the plight of the poorest of the poor and the daily wage earners affected due to COVID induced lockdown has earmarked huge amounts under Ehsaas Program to help the former in a systematic manner with absolute transparency.\nAbout the ongoing Ehsaas Cash Relief, he said this was one of the components of the Ehsaas Program and is scheduled to be completed in next two weeks followed by series of similar support for the lowest segments.\nComplimenting his statement, the minister said crisis brings along opportunities and PTI government is attempting to pave way for an efficient and regular mechanism to makeup for non existent social welfare infrastructure adding that equal attention was being paid to create economic opportunities for the masses.\nZaidi emphasizing that COVID -19 continues to play havoc and a new situation is emerging with every passing day across the globe, said this is time for developing countries like Pakistan to also contemplate situation they would be faced with once the disease is actually controlled.\n‘Every third world country is expecting their loans to be waived off while the developed world itself, despite their efficient healthcare, social welfare and financial infrastructure are found to pumping in trillion of dollars for the protection of their people,” elaborated the minister.\nTo a question about relevance of lockdown and the need to reactivate business activities, he said people feared to be inflicted with coronavirus would die of starvation and may even resort to anarchy hence a delicate balance has to be maintained with due consideration towards dynamics of different areas in each province of our countrDifferent parts of the Sindh province have their own dynamics, reiterated the minister while mentioning that even its capital Karachi is diverse in context of situations and requirements of people belonging to DHA, Mohammad Ali Society, Khudadad Colony and Chanesar Goth like localities – being absolutely different.\n“The harsh facts we are currently exposed to have become all the evident that despite devolution of health, education and social sectors to the provincial government under the 18th constitutional amendment nothing was done by the party in power for past several years,” said Syed Ali Zaidi in response to a query.\n“Is this not ironical that in the entire northern Sindh, with the exception of Khairpur none of the healthcare facilities hold provision for ventilators,” he said.\nThe federal minister said”Federal government is working in coordination with the provincial governments and are facilitating each of them in procurement of essential supplies needed for public in general as well as sections, mainly doctors and paramedics, who have emerged as the front line fighters against the pandemic.”\nAbout the lockdown, he said the he himself as the Minster of Maritime Affairs had issued directives that the port workers on daily wages would be paid at their doorsteps and that will be duly informed as when to resume their duties.\nSimilarly, he said “A summary has been forwarded by the KPT board to waive demurrage charges imposed on charterers adding that Pakistanis are resilient people they are striving against odds and PTI government is trying its best to reduce the intensity through resources at its disposal which is but the public money needed to be spend with absolute transparency, care and caution.”\n“We have to equally focus on our capacity building to handle after affects of the current pandemic and that has to be done on war footing,” he said reminding that Karachi is the financial hub of the country and has its peculiar dynamics which ought not be ignored by any one.",
  "retrievedAt": "2025-08-11T19:05:58.474Z"
}
