{
  "title": "Pakistan summon senior Indian diplomat to register protest over ceasefire violations along LoC",
  "link": "https://www.app.com.pk/national/pakistan-summon-senior-indian-diplomat-to-register-protest-over-ceasefire-violations-along-loc/",
  "date_published": "2020-04-14T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP):Pakistan on Tuesday summoned a senior Indian diplomat to lodge its strong protest over the ceasefire violations by Indian occupation forces along the LoC on April 14, which resulted serious injuries to an innocent civilian.\n“A senior diplomat from the High Commission of India was summoned to the Foreign Office, today, to register Pakistan’s strong protest at the ceasefire violations by the Indian occupation forces along the Line of Control (LoC) in Jandrot Sector on 14th April, 2020, resulting in serious injuries to an innocent civilian,” a Foreign Office statement issued here said.\nDue to indiscriminate and unprovoked firing by the Indian occupation forces, a 65-year old innocent civilian, Alam Din son of Feroz Din, sustained serious injuries in Jandrot Sector, it added.\nAccording to the statement, the Indian occupation forces along the LoC and the Working Boundary (WB) have continuously been targeting civilian populated areas with artillery fire, heavy-caliber mortars and automatic weapons. This year, India has committed 765 ceasefire violations to date, it added.\nCondemning the targeting of innocent civilians by the Indian occupation forces, it was underscored that such senseless Indian acts, in clear violation of the 2003 Ceasefire Understanding and complete disregard for international human rights and international law, were a threat to regional peace and security.\nBy raising tensions along the LoC and the WB, it said, India could not divert attention from the worsening human rights situation in the Indian Occupied Jammu and Kashmir (IOJ&K).\nPakistan urged the Indian side to respect the 2003 Ceasefire Understanding; investigate this and other such incidents of deliberate ceasefire violations and maintain peace along the LoC and the WB.\nThe Indian side was also urged to allow the United Nations Military Observer Group in India and Pakistan (UNMOGIP) to play its mandated role as per the United Nations Security Council (UNSC) resolutions, the statement concluded.",
  "retrievedAt": "2025-08-11T19:05:53.196Z"
}
