{
  "title": "PM announced mega relief package for needy people during lockdown: Qasim Suri",
  "link": "https://www.app.com.pk/national/pm-announced-mega-relief-package-for-needy-people-during-lockdown-qasim-suri/",
  "date_published": "2020-04-14T05:17:00.000Z",
  "source": "APP",
  "content": "QUETTA, Apr 14 (APP):Deputy Speaker National Assembly Qasim Khan Suri on Tuesday said that Prime Minister Imran Khan has announced a mega relief package for poor people of the country despite having an economic crisis because the central government was well aware about the problems of needy people during lockdown to cope the COVID-19.\nHe said the central regime was cooperating with the provincial governments in order to control the spread of the coronavirus for interest of public health saying that federal and provincial regimes were on one page in difficult situation.\nQasim Suri expressed these views while talking to media on the occasion of the distribution of ration among needy persons at Girls High Schools of Chashma Khaduzai area here.\nQasim Suri said Prime Minister Imran Khan had instructed the economists and department concerned to make a comprehensive plan to assist daily wagers in hard time in respective areas of the country, adding that the central government was determined for helping needy people in wake of the coronavirus.\nThe Deputy Speaker said this time has not for politics during difficult situation of coronavirus but all political parties and leaders should come forward to serve unprivileged people under the lockdown to get rid of the deadly virus from the country.\nThe government was utilizing all available resources to cope the outbreak in the country but the experience of developed countries such as China, Europe, and the United States proved that the deadly virus could be defeated through adopting preventive steps against it, he said adding that the government would supply essential goods to needy persons at their doorsteps.\nHe said it was the duty of the everyone to stay their homes and to cooperate with government in this regard for defeating the coronavirus.\nQasim Khan Suri also appreciated the efforts of Pakistan Army, Civil Administration and doctors who were playing important role to tackle the coronavirus and hoped that we would get rid of it by collective efforts.",
  "retrievedAt": "2025-08-11T19:05:57.883Z"
}
