{
  "title": "Meeting on corona situation held at NCOC",
  "link": "https://www.app.com.pk/national/meeting-on-corona-situation-held-at-ncoc/",
  "date_published": "2020-04-14T01:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP):A detailed briefing was given on current Coronavirus (COVID-19) situation and measures being adopted to combat the disease at National Command and Operation Centre (NCOC) on Tuesday.\nMinister for Planning, development, Reforms and special initiatives Asad Umar chaired the meeting. The forum reviewed progress made so far and future course of action.\nPrime Minister Azad Jammu and Kashmir (AJK), Chief Ministers of Sindh, Balochistan, Gilgit Baltistan, Chief Secretary Punjab and Khyber Pakhtunkhwa participated through video.\nThe forum finalized recommendations to be taken up at National Coordination Committee (NCC) for final decision on post April 14 COVID-19 strategy. A detailed analysis and discussion was made by all stakeholders.\nThe forum discussed guidelines ad SOPs for possibility of phased easing of industries. The forum considered that the implementation on these guidelines and SOPs will be employers’ responsibility while the decision will be made in NCC for final approval.\nIt was decided that the Ministry of Interior in consultation with Ulemas will formulate guidelines for Ramazan covering aspects including taraveeh, namaz, roza congregations, festivity (Iftari, sehri etc), arrangements of Juma bazar or Ramzan bazar etc., distribution of food items and fitrana by philanthropists.\nThe forum was informed that to get indigenous manufacturing capacity, Pakistan Engineering Council (PEC) has started developing five different types of ventilators.\nIt was further informed that eight designs have been submitted for approval while the clinical trials have been started.\nThe Ministry of Science and Technology, Drug Regulatory Authority of Pakistan (DRAP), and National University of Science and Technology (NUST) will finalize the decision of domestic development of testing kit within 36 hrs.\nThe forum was also briefed about the medical services allocated by Pakistan Railways including converting seven trains into hospitals and isolation wards.\nIt was informed that 26 trains are available for plying across the country while 48 Railway hospitals are available including 12 major and hospitals and 36 small dispensaries.\nThe forum was apprised that 1,950 passengers will be brought back in next weeks by air while three months will be required to bring back all stranded Pakistanis with approximately 8,000 passengers per week.\nAll passengers will be quarantined as per health guidelines at locations of arrival while the air traveling SOPs will be reviewed on 16 April 16.\nThe participants were informed that seven international airports will be operating to bring back 8,000 passengers every week.\nIt was informed that the Ministry of Interior has issued notifications for closure of borders for another two weeks from date of expiry of previous notification as Wahga Border from 16 to 29 April, Western border with Afghanistan and Iran from 13 to 26 April and Kartarpur Corridor from 11 to 24 April.\nBrig ® Ijaz Ahmed Shah, Minister for Interior, Muhammad Hammad Azhar, Minister for Industries and Production, Omar Ayub Khan, Minister for Energy, Khusro Bakhtiar, Minister for Economic Affairs, Fakhar Imam, Minister for National Food and Security, Moeed Yousaf, Special Assistant to Prime Minister on National Security, Dr Zafar Mirza, Special Assistant to Prime Minister on Health and Abdul Razak Dawod, Advisor to PM for Commerce attended the briefing.",
  "retrievedAt": "2025-08-11T19:06:02.444Z"
}
