{
  "title": "WHO urges global ban on flavoured tobacco, nicotine products",
  "author": null,
  "content": "ISLAMABAD, May 31 (APP):On World No Tobacco Day, the World Health Organization (WHO) has issued a strong call to governments worldwide to immediately ban all flavours in tobacco and nicotine products.\nThe health agency warns that flavouring is a key tactic used to lure youth into addiction and is urging swift action to protect public health.\nThe organization demanded ban on all flavours in tobacco and nicotine products including cigarettes, pouches, hookahs and e-cigarettes, to protect youth from addiction and disease.\nFlavours like menthol, bubble gum and cotton candy are masking the harshness of tobacco and nicotine products turning toxic products into youth-friendly bait.\nFlavours not only make it harder to quit but have also been linked to serious lung diseases. Cigarettes, which still kill up to half of their users, also come in flavours or can have flavours added to them.\n“Flavours are fuelling a new wave of addiction, and should be banned,” said Dr Tedros Adhanom Ghebreyesus, Director-General of WHO. “They undermine decades of progress in tobacco control.\n“Without bold action, the global tobacco epidemic, already killing around 8 million people each year, will continue to be driven by addiction dressed up with appealing flavours.”\nFlavours are a leading reason why young people try tobacco and nicotine products. Paired with flashy packaging and social media-driven marketing, they’ve increased the appeal of nicotine pouches, heated tobacco, and disposable vapes into addictive and harmful products, which aggressively target young people.\n“We are watching a generation get hooked on nicotine through gummy bear-flavoured pouches and rainbow-coloured vapes,” said Dr Rüdiger Krech, WHO Director of Health Promotion. “This isn’t innovation, it’s manipulation and we must stop it.”\nWHO reiterates that tobacco products, including heated tobacco products, expose users to cancer-causing chemicals and should be strictly regulated.\nThe 2025 World No Tobacco Day campaign honours governments, youth activists and civil society leaders pushing back against industry interference. “Your actions are changing policy and saving lives,” said Dr Krech.\nWith around 8 million tobacco-related deaths each year, the time for action is now. Flavours, and the industries that deploy them, have no place in a healthy future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:06:24.828Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/who-urges-global-ban-on-flavoured-tobacco-nicotine-products/",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T13:20:00.000Z"
}
