{
  "title": "Issues of Balochistan to be resolved amicably: PM",
  "author": null,
  "content": "QUETTA, May 31 (APP):Prime Minister Muhammad Shehbaz Sharif Saturday said the issues faced by the people of Balochistan would be resolved amicably and funds would be made available for the development and progress of the largest province.\nAddressing a grand jirga of Balochistan here, he said the four provinces were like brothers and would equally share resources of the country.\nThe federal government was spending Rs 70 billion on the solarization project in Balochistan, he said adding Rs 150 billion would be diverted for the building of highway N25 in Balochistan.\nThese funds would be acquired from the amount which the government was collecting after the lowering down of prices of petroleum products in the international market.\nThe prime minister said the government would allocate Rs 1000 billion for the Public Sector Development Programme (PSDP) this year and 25 percent or Rs 250 billion from the fund would be for projects in Balochistan.\nHe said federal funds were the right of people of Balochistan and every penny would be spent transparently on the progress and prosperity of the province.\nAs chief minister of Punjab, he said he allocated ten percent quota for the students of Balochistan in different schemes of Punjab including laptop schemes and scholarships in the foreign and provincial educational institutions.\nIn the past, Rs two billion were allocated for a heart hospital in Balochistan, he continued.\nHe recalled that Punjab had agreed to give part of its funds from the National Finance Commission (NFC) Award to Balochistan in view of its development needs as the province had a larger area. In today’s value, the funds diverted to Balochistan amounted to Rs 160 billion, he explained.\nThe NFC award was signed in Lahore in 2010 after three days of discussions among the national leadership including President Asif Ali Zardari, then prime minister Syed Yousaf Raza Gilani and Nawaz Sharif, he added.\nHe said in the tenure of Nawaz Sharif lot of development projects were undertaken in Balochistan and President Zardari initiated Aghaz-e-Haqooq-e-Balochistan.\nHe said the elders of Balochistan decided to become part of Pakistan under the leadership of Quaid-e-Azam Muhammd Ali Jinnah.\nTalking about incidents of terrorism in Balochistan, he said terrorists were blood thirsty and were against the progress of Pakistan and were undertaking heinous acts at the behest of foreign elements.\nHe said terrorists in Balochistan were foreign agents who had resorted to barbarity but they would not be tolerated by the government and armed forces of Pakistan.\nHe assured that social and economic justice would be delivered to the people of Balochistan.\nReferring to the latest incidents in Sorab, he said the country could not make progress without peace.\nTalking about conflict with India, he said on the midnight of May 6 and 7 and May 10 India attacked Pakistan but with the grace of Allah, the armed forces of Pakistan bravely defeated the enemy, who will remember its failure forever.\nHe thanked people of Pakistan for showing unity and standing with the Pakistan army shoulder to shoulder during the conflict.\nAs prime minister he was witness to all the events of the short duration war, he said adding as a brave and sagacious leader Field Marshal Syed Asim Munir led Pakistan armed forces to a victory against India and made the nation proud and the success was akin to avenging the events of 1971.\nHe said now the enemy was scared and the friendly countries were more confident after success of Pakistan.\nHe recalled that Pakistan conducted six nuclear explosions in response to five detonations of India in 1998, adding Nawaz Sharif was leader of the nation on that momentous occasion, which fortified the defence of Pakistan.\nField Marshal Chief of Army Staff Syed Asim Munir, Acting Governor Balochistan Governor Abdul Khaliq Achakzai, Chief Minister Balochistan Mir Sarfraz Bugti and high ranking military and civil officials attended the event.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:05:50.097Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/issues-of-balochistan-to-be-resolved-amicably-pm/",
  "dateList": "2025-05-31",
  "date_published": "2025-05-31T14:56:00.000Z"
}
