{
  "title": "Bilawal should better resolve governance issues in Sindh: Firdous",
  "link": "https://www.app.com.pk/national/bilawal-should-better-resolve-governance-issues-in-sindh-firdous/",
  "date_published": "2020-03-09T01:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan on Monday asked PPP Chairman Bilawal Bhutto Zardari to better address the governance issues of his party’s government in Sindh, where people were facing miseries.\nTalking to a private news channel, Dr Firdous said the leaders of Pakistan Peoples Party, who were living in glass houses, using mineral water and availing perks and privileges, could never feel the pain of poor people of Sindh, who were compelled to drink filthy water.\nPlaying gimmicks for political point scoring, she said, would never resolve the problems being faced by the people of Sindh, she observed. The PPP leaders should better empower the institutions in the province for the purpose, she added.\nReplying to a question about the women march, Dr Firdous said the ideology and concept of the march were very clear that women should be empowered and given representation in every institution to take the country forward.\nThere might be some concern over some slogans of the march because the West and the East hold different ideologies, values and cultures, she said, adding ,”We should keep in mind the our cultural values, and rules and regulation of our society.\n” However, it was the responsibility of every person to provide better opportunities to the opposite gender so that they could play constructive roles in every field, Dr Firdous said.\nTo a query about Nawaz Sharif, she said the Pakistan Muslim League-N leader should return to the country as the people could only reduce his pain of being out of power.\nThe Federal Government, she said, was following the Constitution and laws of the land and had directed the Punjab government to approach the court for bringing the PML-N leader back to the country.\nTo another question, she said the people had expressed full confidence in the leadership of Prime Minister Imran Khan, who was making efforts to put the country on the path of speedy progress.",
  "retrievedAt": "2025-08-11T18:55:22.852Z"
}
