{
  "title": "Pakistan Navy to plant 300,000 saplings on Margalla Hills: CNS",
  "link": "https://www.app.com.pk/national/pakistan-navy-to-plant-300000-saplings-on-margalla-hills-cns/",
  "date_published": "2020-03-09T01:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP):Chief of Naval Staff (CNS) Pakistan Navy Admiral Zafar Mahmood Abbasi Monday said Pakistan Navy, as part of the government’s “Plant for Pakistan” drive, had planned to plant 300,000 plants on Margalla hills during Tree Plantation Campaigns 2020 to increase the forest cover and meet challenges of global warming and climate change.\nIn his message on the occasion of Spring Tree Plantation 2020, the CNS said, Pakistan Navy had always remained in the forefront and contributed a lot in improving the ecosystem, a Pakistan Navy press release.\nHe said afforestation was vital for our socio-economic development and a sustainable ecosystem. For years, apart from the contributions toward food, fiber, livelihood, resources and water; trees had been instrumental in thwarting the adverse effects of climate change.\nAdmiral Abbasi noted, “The effects of climate change are alarming and its consequences are being felt in the shape of unpredictable weather conditions such as; devastating floods, abnormal rise in temperature, less precipitation, lower water table, drought and resultantly forest fires incidents.\nRealizing the need of immediate redressal to this dangerous global and national challenge, climate change is recognized as a serious “National Security Challenge” thus being emphasized as one of the major subject at all tiers of strategic thinkers and practitioners.”\nIn this context, he said Pakistan Navy gave high importance to plant culture and plantation campaigns to increase the forest cover of the country and reduce the effects of global warming.\nAdmiral Abbasi said, “Millions of plants have been planted in naval shore establishments and along the costal belt Pakistan. These plantation efforts are based on the principles of awareness through maximum participation and achieving sustainable results.”\nThe Naval chief said, “on this occasion let us commit, that we owe it to ourselves and to our children, to be saviors of the trees and environment that is a blessing of Allah SWT. I urge all our countrymen to join hands with PN in this noble cause and commit to plant at least one tree each, thus helping provide clean and better environment for ourselves and our future generations. Pakistan Navy Zindabad – Pakistan Paindabad.”",
  "retrievedAt": "2025-08-11T18:55:25.392Z"
}
