{
  "title": "CM announces special package for road infrastructure,water supply schemes for Mohmand",
  "link": "https://www.app.com.pk/national/cm-announces-special-package-for-road-infrastructurewater-supply-schemes-for-mohmand/",
  "date_published": "2020-03-08T22:01:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 09 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan has said that tribal districts were replete with precious mineral resources and provincial government was working to utilize these resources for the development of these districts.\nHe categorically stated that these resources belong to the people of the merged districts and they have the right on these resources.\nHe assured the tribal people that all the developmental initiatives for these areas would be initiated with the consultation of the local people.\nHe expressed these views while addressing a public gathering at Ghalanai, District Mohmand on Monday.\nEarlier Prime Minister Imran Khan formally launched the Ihsaas Kifalat Program in District Mohmand by giving away Ihsaas kifalat Cards to the local.\nGovernor Khyber Pakhtunkhwa Shah Farman, Federal Ministers Perviaz Khatak, Murad Saeed and  Noor ul Haq Qadri and Special Assistant to Prime Minister Sania Nishter were also present on this occasion.\nThe Chief Minster said”Local government system is being introduced in the tribal districts for the provision of better municipal services to the people while Jirga system will remain intact to resolve the minor issues of the tribal people there and then.”\nHe said that WAPDA authorities have already been directed to recruit local people against the non-technical positions under Mohmand Dam Project. He said that under Mohmand Dam Project, various development schemes at a cost of Rs. 4 billion were being launched in consultation with the local people.\nMahmood Khan said that a special complaint cell has been setup in the Chief Minister Secretariat to address the grievances of the people of merged areas and to resolve their issues in timely manner and added that through the complaint cell the people of area communicate their complaints to Chief Minister Office directly.\nHe assured that all such complaints would be resolved within 24 hours. Mahmood Khan added that a water supply scheme for upper Mohmand will be started very soon.\nHe further stated that a major water supply scheme for the Ghalanai Headquarter from Sro Killi would also be initiated for which consultancy firm has already been hired.\nThe Chief Minister also announced hundred solar tube wells, four irrigation tube wells, Special packages for road infrastructure, Upgradation of Mamad Gut and Yaka Ghund Grid Stations and Rs. 2.00 Million Special Grant for Ghalanai Press Club District Mohmand.\nChief Minister said people of District Mohmand would soon get good news regarding the establishment of a University Campus in Mohmand.\nMahmood Khan said that a mega sports complex was being constructed in Mohmand with the cost of Rs. 750 Million whereas sports grounds would be setup at Tehsil level in the district.",
  "retrievedAt": "2025-08-11T18:55:34.473Z"
}
