{
  "title": "PTM leaders travel on Afghan army helicopter from border to Kabul to attend oath-taking ceremony of President Ashraf Ghani",
  "link": "https://www.app.com.pk/national/ptm-leaders-travel-on-afghan-army-helicopter-from-border-to-kabul-to-attend-oath-taking-ceremony-of-president-ashraf-ghani/",
  "date_published": "2020-03-08T22:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP):Pashtun Tahaffuz Movement (PTM) leaders Mohsin Dawar and Ali Wazir Monday got a free ride on an Afghan National Army helicopter from Pak-Afgan border\ncrossing to Kabul to attend the oath-taking ceremony of President Ashraf Ghani.\nMohsin Dawar thanked President Ashraf Ghani for delaying his oath, because\nof the two Pakistani legislators who were barred by the FIA from flying to Kabul\nfor being on the ECL (Exit Control List).\nPrime Minister Imran Khan had on Sunday gave one-time permission to the two Pashtun legislators to attend the oath-taking ceremony of Afghan President Ashraf Ghani.\nMohsin Dawar in his tweet after reaching Kabul said “Wanted to express my gratitude to President @ashrafghani for delaying his oath taking for the arrival of @Aliwazirna50 and myself.”\nThe Afghan government specially dispatched a military helicopter to rush the two parliamentarians to the ceremony from Torkham.\nMohsin Dawar in a Twitter post, from Kabul said : “Overwhelmed by the welcome we have received here. Wishing a peaceful future for Afghanistan and the region,” Dawar said in a Twitter post in which he also tagged some pictures showing them travelling in an Afghan army helicopter.\nAccording to Afghan media, before reaching Kabul, the PTM leaders also briefly visited ‘officials’ in eastern Nangarhar province.\nSince its creation in 2014, the PTM has been organizing and taking out rallies\nin tribal areas, criticizing Pakistan’s security forces, despite their supreme sacrifices for cleansing the tribal belt from terrorists and restoring peace.\nAt a press conference last year, former director general of Inter-Services Public Relations (ISPR) Major General Asif Ghafoor had also questioned the PTM leadership about the sources of funding required to run their party, without getting any answers.",
  "retrievedAt": "2025-08-11T18:55:30.688Z"
}
