{
  "title": "Women empowerment is key to progress: Dr Firdous",
  "link": "https://www.app.com.pk/national/women-empowerment-is-key-to-progress-dr-firdous/",
  "date_published": "2020-03-09T01:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 09 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Monday said Pakistan could only progress by empowering woman in all spheres of life through all possible means.\nHowever, the controversial jingles could harm the cause of women march, she exchanged these views in the National Assembly Standing Committee on Information and Broadcasting’s meeting held here. The meeting was chaired by MNA Mian Javed Latif.\nThe special assistant said Pakistan Tehreek-e-Insaf (PTI) government was committed to safeguard the women’s rights through legislation and its implementation in the society.\nRegarding the woman march, she said the government remained neutral instead of supporting any side of the divide adding the electronic media, on her request, played a responsible role in the coverage of ‘Aurat March’ but unfortunately, social media did not made responsible reporting on the occasion.\nShe suggested the committee that Pakistan Telecom Authority chairman should be summoned and asked about preventing the digital media from such inflammatory postings on different social platforms.\nShe said there was a dire need to create balance between two extremes through legislation and regulation.\nThe committee appreciated the Special Assistant Dr Firdous and her ministry’s overtures for handling the women march properly as two percent violators failed to convince rest of the population about their negative slogans like ‘Mera Jism Meri Marzi’.\nThe committee stressed upon the need for launching of a proper media awareness campaign about the laws available for the protection of women’s rights so that their implementation could be ensured at grassroots level.\nThe committee expressed concerns over the non adherence on PEMRA’s code of conduct by private media channels.\nThe committee, therefore, decided to invite all media channels’ owners in the next meeting to devise a strategy regarding the elimination of negative elements from the media contents so that soft image of Pakistan could be presented on the globe. Moreover, the issue of retrenchment of media persons could also be discussed to safeguard their interests.\nThe meeting was attended by MNAs Engr Usman Khan Tarakai, Tahir Iqbal, Aftab Jahangir, Kanwal Shauzab, Syed Amin-ul-Haque, Zulfiqar Ali Behan, Syma Nadeem and officials of information ministry and its attached departments.",
  "retrievedAt": "2025-08-11T18:55:21.749Z"
}
