{
  "title": "Kashmiris to attain freedom from Indian occupation: AJK president.",
  "link": "https://www.app.com.pk/national/kashmiris-to-attain-freedom-from-indian-occupation-ajk-president/",
  "date_published": "2020-03-08T21:57:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Mar 09 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Monday said India was hell-bent upon suppressing the just liberation movement of the Kashmiri people in Indian Occupied Jammu and Kashmir (IOJK).\n‘’No power on earth can stop the Kashmiris from attaining their freedom from Indian occupation and ascertaining their inalienable right to self-determination,” he said while speaking to Syed Abdullah Gillani, the representative of APHC chairman Syed Ali Geelani at Jammu and Kashmir House in the federal capital, an AJK Presidential Secretariat said in a statement issued here this evening.\nDuring the meeting the latest situation in IOJK was discussed in detail. Both condemned the steps taken by India which had led to the incarceration of thousands of Kashmiris, killings, blinding and molestation of women folk.\nSyed Abdullah Gillani while praising the president’s efforts in highlighting the Kashmir issue in the international arena said, “We hope that under his guidance we will further intensify our efforts and help mobilize critical support for the resolution of the Kashmir dispute.”\nHe said despite Syed Ali Geelani’s old age and fragile health, India continued to fear his presence and had kept him under house-arrest for the past 11 years.\nCastigating the international community’s inattention and double standards on Kashmir, the AJK president called on the United Nations Security Council to not hide behind expediency and urged it to take cognizance of the precarious security situation in the IOJK.\nGillani proposed that along with organising conferences and seminars on Kashmir, delegations comprising Kashmiris living on both side of the line of control may be sent to leading countries of the world to engage both their public representatives and civil society.\nHe said Kashmiri women may lead demonstrations especially in the capitals of the P5 members in order to sensitize them to the atrocities taking place in IOJK.\nThe AJK president while paying tribute to the brave Kashmiri women said the pain and anguish suffered by them were the worst in the world. Despite all that, he said, they had not lost hope and were struggling for their liberty.\nHe acknowledged the efforts of Assiya Andarabi and her companions and condemned her illegal imprisonment.\nTerming Syed Ali Geelani as Salaar-e-Azam (a great leader) and Quaid-e-Hurriyat (Leader of the Resistance), the president said the people of IOJK, AJK and Pakistan had full faith in the leadership of Syed Ali Geelani.\nHe went on to say that there would be no compromise on the right to self-determination of the Kashmiris and we shall attain our freedom from Indian occupation.",
  "retrievedAt": "2025-08-11T18:55:41.564Z"
}
