{
  "title": "Indonesian envoy classify distinct ancient heritage as treasure for both nations",
  "link": "https://www.app.com.pk/national/indonesian-envoy-classify-distinct-ancient-heritage-as-treasure-for-both-nations/",
  "date_published": "2023-06-18T11:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): Ambassador of Indonesia to Pakistan Adam Tugio on Sunday classified distinctive cultural-historic heritage as a treasure trove for the two brotherly countries that has continuously been preserved during the course of history.\nHe made these remarks while addressing the opening ceremony of a photo exhibition titled “A Night at Lahore Museum: Tracing the Confluence of Civilizations Between Indonesia and Pakistan,” jointly organized by the Indonesian Embassy and Lahore Museum enthralled the audience with its spectacular display of ancient cultural connectivity through meticulously selected photographs.\nThe Envoy said, “Indonesia and Pakistan are heirs of one of the oldest civilizations in the world, with a marked history of religious-cultural communication. This exhibition aims to highlight the cross-regional cultural influences through selected photographs and videos of both sides’ artefacts, sculptures, and inscriptions.”\n“From cuisine to old healing practices, from religious traditions to cultural norms, and ancient history to modern civilization, there is a long list of striking similarities between the two brotherly nations,” he remarked.\nElaborating on early historic inter-regional connectivity, the Envoy pointed out that the ancient Gandhara region, mainly comprising the North West region of present-day Pakistan, was a melting pot of different civilizations.\n“The spread of Buddhist and Islamic civilization to the Indonesian archipelago is also attributed to the influence of Gandhara civilization,” added the Envoy.\nAmbassador Tugio especially thanked the Lahore Museum for providing generous support to all the guests for their participation and warmly invited Pakistani friends to the Exhibition to celebrate the rich cultural heritage of the two Muslim brotherly countries.\nMinister of Health Punjab Prof. Dr Javed Akram who was called as a chief guest at the inaugural ceremony of the photo exhibition, also spoke on the occasion. He hailed the Embassy’s initiative of organizing the Exhibition to promote the shared cultural heritage. He emphasized the need to strengthen academic linkages and people-to-people contacts to materialize the benefits of strong bonds of friendship between the two countries.\nThe week-long exhibition provides a fresh perspective on the cross-regional interaction between the two biggest Muslim-populated countries from the past to the present. The exhibition is open to the public until 24th June at the Lahore Museum.\nThrough interactive display, the exhibition will allow visitors to trace the confluence of civilization between Indonesia and Pakistan in various ways.\nThe exhibition also features spices and some popular products from Indonesia with the kind support of Indomie, the largest food producer in Indonesia operating in Faisalabad.",
  "retrievedAt": "2025-08-11T08:44:28.045Z"
}
