{
  "title": "Saudi Arabia’s Ministry of Hajj and Umrah plays active role in “Makkah Route” Initiative",
  "link": "https://www.app.com.pk/national/saudi-arabias-ministry-of-hajj-and-umrah-plays-active-role-in-makkah-route-initiative/",
  "date_published": "2023-06-18T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): Saudi Arabia’s Ministry of Hajj and Umrah, as an essential partner of the “Makkah Route” initiative launched by the Ministry of Interior, is actively involved in facilitating travel procedures at the airports of the countries covered by the initiative.\nWithin the framework of the Makkah Route initiative, the Ministry of Hajj and Umrah is committed to providing a range of services. Firstly, it utilizes its technical systems, specifically the Nusuk platform, to record pilgrim data and organize them into groups based on their flights.\nBefore they depart from their respective countries, the ministry guides the pilgrims to the airport according to their flight schedules and ensures the sorting and coding of their luggage in alignment with the registered electronic housing contracts, Saudi Arabia’s news Agency SPA reported.\nUpon arrival at the airports in Jeddah and Madinah, the Ministry receives the luggage on behalf of the pilgrims and manages the necessary procedures until it is delivered to their temporary residences.\nIn parallel, field committees associated with the Ministry continuously monitor the duration of the pilgrims’ stay at the airports and ensure the readiness and quality of land transportation, from the start of the journey until its conclusion at the hotels in Makkah and Madinah.\nFurthermore, the Ministry has the responsibility of overseeing the adherence of the pilgrim affairs offices in the respective countries to the Nusuk platform’s work mechanisms. This includes providing instructions for the sorting and coding of baggage at the departure station and verifying the accuracy of the pilgrims’ data on the luggage before they embark on their travel, ensuring that each pilgrim receives their baggage at their place of residence.",
  "retrievedAt": "2025-08-11T08:44:28.850Z"
}
