{
  "title": "PML-N always preferred state over politics: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/pml-n-always-preferred-state-over-politics-ahsan-iqbal/",
  "date_published": "2023-06-18T17:50:00.000Z",
  "source": "APP",
  "content": "NAROWAL, Jun 18 (APP): Federal Minister for Planning, Development and Special Initiatives Prof. Ahsan Iqbal has said the Pakistan Muslim League-Nawaz (PML-N) has always preferred state over politics, and recently saved the country from bankruptcy after forming a coalition government in centre last year.\nHe was addressing the opening ceremony of Construction Division Narowal, along with Federal Minister for Energy Engr Khurram Dastgir Khan here on Sunday. He said the previous Pakistan Tehreek-e-Insaf (PTI) government put the development gear in reverse and destroyed the country.\nAhsan Iqbal said that an incompetent person was made the prime minister of a nuclear power Pakistan by giving him the certificate of ‘Sadiq’ and ‘Ameen’.\nHe said that in the past, instead of development projects, seeds of hatred were sown and only revenge actions were taken. He said that through the political of uncertainty, Imran Khan tried to destroy the national economy.\nThe federal minister said “we are responsible politicians; we have a national government, and we are serving people with national spirit, while Imran Niazi created a situation of anarchy”.\nHe said “we played our role, we saved Pakistan from bankruptcy in one-year rule and launched development programmes for the country”.\nThe PML-N senior leader said “our allies are united, and they prepared a budget for the entire nation under the leadership of Prime Minister Shehbaz Sharif”.\nHe said Shehbaz Sharif was taking all decisions through consensus among all coalition partners. He said the prime minister had always consulted the ruling coalition parties before making any crucial and national decision.\nAhsan Iqbal said the federal government distributed a huge amount among the flood victims through the Benazir Income Support Programme (BISP). He said that the incumbent government was resuming all development projects which had been put on the back burner by the previous PTI government. The PML-N has always worked on mega development projects in the country, he added.\nHe said that the 2035 Roadmap was being made, which would help eradicate poverty and unemployment in the the next three to four years.\nHe said that the government would steered the country out of all crises. He said the three-time prime minister Nawaz Sharif’s name was written on all development projects and the PML-N would get a huge mandate in the next elections.",
  "retrievedAt": "2025-08-11T08:44:24.757Z"
}
