{
  "title": "Revival, expansion of Pakistan’s film industry vital to project national narrative through screen tourism: Marriyum",
  "link": "https://www.app.com.pk/national/revival-expansion-of-pakistans-film-industry-vital-to-project-national-narrative-through-screen-tourism-marriyum/",
  "date_published": "2023-06-18T08:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Sunday said that the revival and expansion of Pakistan’s film industry were vital to project the national narrative through screen tourism.\n“Screen tourism presents an opportunity to spread the narrative of Pakistan, as seen in the successful examples of Qatar, Saudi Arabia and Iran, where budding film industries have thrived”, she said while addressing 25 high achievers of the National Amateur Film Festival Award bound to leave for Australia on Monday.\nThe Ministry of Information and Broadcasting has sponsored these 25 students one-year training in New York Academy, Australia.\nThe government was to promote Pakistan’s narrative, focusing on heritage, youth engagement, and tourism through screen tourism, she maintained.\nThe minister said it was high time to invest in Pakistan’s entertainment industry, which currently enjoyed tax exemptions.\n“Over the next decade, I foresee a revival of the industry that will allow it to compete withneighbouring countries and even international markets,” she said adding that the high achievers had the potential to make a significant impact in this field.\nThe minister recalled that Pakistan’s film industry faced a significant setback between 1970 and 2000, causing its growth to stagnate. However, since 2000, the industry has experienced a boost, although its progress has been hindered by the absence of cinemas and affordability issues, which limited access for the general public, she maintained. The minister said the government introduced a film policy in 2017 to address these challenges.\nShe said that extensive research and consultations with relevant stakeholders and experts were conducted to develop this comprehensive policy. Lessons, she added ,were learned from countries with flourishing film industries or successful revivals, providing valuable insights.\nMarriyum Aurangzeb said that incentives for the film industry were included in the 2018 budget, and after coming into power again last year, the coalition government established a dedicated film division in the ministry.\nThe film sector currently enjoyed zero taxation, with income tax exemptions for individuals and production houses. Import of equipment for film and drama production had also been tax exempted, she said. The minister disclosed that the corporate entities providing funds for film production can claim CSR tax credits from the Federal Board of Revenue (FBR), making it a significant incentive.\nFurthermore, she said, the government has approved a film finance fund with an initial allocation of Rs 2 billion. This fund, operated through the Film Council, will support budding producers in the production of films, television dramas, and documentaries.\nThe minister said for making entertainment accessible to the general public, cinema income has been exempted from taxation for the first ten years, especially for those cinemas offering affordable ticket prices. She maintained that an excellent example of the cinema industry’s revival was the monumental success of the new version of Maula Jatt movie. This version, not seen by those who made the original movie a hit, generated substantial business overseas in multiplex cinemas.\nShe said by taking advantage of this framework, young students and professionals, equipped with valuable skill sets, can tap into the immense potential of the film industry.\nMarriyum said that universities like NUST, Iqra and LUMS as well as schools and colleges, offer film production and drama as degree courses, fostering a talent pool for the industry. The revitalized PTV academy, equipped with modern studios, will be open to schools and colleges, allowing the youth to gain knowledge and experience in film production, she remarked.\nAbout the Australia-bound high achievers of the National Amateur Film Festival Award, she said as individuals embarking on this course, they were fortunate to be part of this endeavor. Upon their return, they might even become instructors and produce films at the PTV academy, further contributing to the industry’s growth. She congratulated them on their achievement, and wished them best of luck for their future endeavors.",
  "retrievedAt": "2025-08-11T08:44:32.708Z"
}
