{
  "title": "Voices for Kashmir solidarity echo across Pakistan’s missions globally",
  "link": "https://www.app.com.pk/national/voices-for-kashmir-solidarity-echo-across-pakistans-missions-globally/",
  "date_published": "2021-02-05T16:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): As Pakistan observed Kashmir Solidarity Day on Friday, its embassies and missions across the globe also raised the voices of Kashmiri people in their respective destinations to denounce Indian oppression and seek implementation of the UNSC resolutions on the dispute.\nThe seminars, webinars, protest demonstrations, photo exhibitions, painting contests, video messages, screening of documentaries and special prayers marked the events held by the Pakistan’s missions abroad.\nThe ceremonies were attended by the diaspora, local parliamentarians, human rights activists and staffers of the embassies and high commissioners.\nThe envoys read out the special messages of Prime Minister Imran Khan, President Dr Arif Alvi and Foreign Minister Shah Mahmood Qureshi issued on the occasion to reiterate Pakistan’s support to the Kashmiri brethren.\nThe national anthems Pakistan and Azad Jammu and Kashmir were played on the occasion.\nAt an event held by Pakistan’s embassy in Turkey, Parliamentarian Muhammet Balta said “Like Pakistan, Kashmir and Kashmiris have the same place in the heart and mind of every Turk.\nHe underscored that President Recep Tayyip Erdogan highlights the Kashmir issue at every international platform and this is the same for the entire Turkish nation.\nMuhmmet Balta criticized the 5th August 2019 illegal measures by India to try and change the special status of Jammu & Kashmir which is a disputed territory as recognized by the United Nations.\nPakistan’s Ambassador to Turkey Muhammad Syrus Sajjad Qazi the commemoration of 5th February as Kashmir Solidarity Day is a stark reminder of the broken promises and unfulfilled commitments made to the Kashmiri people by India for holding a plebiscite, when it had taken the matter first time to the UN in January 1948 and accepted its prescription.\nAll the constants in Kashmir’s equation i.e geography, history & law are on Pakistan’s side. The variables like politics and economics are also bound to change in Pakistan’s favour “, Ambassador Rizwan Saeed Sheikh said while addressing an event to observe Kashmir Solidarity Day pic.twitter.com/kFfqMo5wiq\n— Permanent Mission of Pakistan to OIC (@PakOIC_Jeddah) February 5, 2021\nA photography exhibition on the ongoing human rights violations in the IIOJK was also organized during the event.\nLeading think-tank of Turkey, the Economic & Social Research Centre (ESAM) also organized a webinar on the subject.\nIn Colombo, the Kashmir Solidarity Day even, held by Pakistan’s high commission,  the acting High Commissioner reiterated the resolve of the government and people of Pakistan for continuous support to Kashmiris.\nThe keynote speakers Muhammad Shiraz Yoonus and Dr. Asela Wickramasinghe stressed upon the peaceful solution of the issue through meaningful dialogue and highlighted the significance of interfaith harmony as well as peaceful co-existence of all.\nIn his video message, Pakistan’s envoy to the European Union, Belgium and Luxembourg Ambassador Zaheer A Janjua urged the international community, especially the European Union, to play its role in ensuring fundamental human rights and freedoms of the Kashmiri people.\nHe demanded immediate lifting of the military siege and communications blackout, rescinding India’s illegal and unilateral actions, release of illegally arrested and incarcerated Kashmiris, repeal of the draconian laws enabling impunity to Indian occupation forces and access of the international human rights organizations and media, to evaluate the human rights situation in the occupied territory.\nConsulate General of Pakistan Istanbul arranged a protest demonstration activity against the Indian atrocities in the Occupied Kashmir. pic.twitter.com/qRf04YnH1i\n— Pakistan Consulate General Istanbul (@PakinIstanbul_) February 5, 2021\nChairman EU-Pak Friendship Federation Europe, Chaudhry Perveiz Iqbal Losar urged international media to expose Indian army’s atrocities in Indian Illegally Occupied Jammu & Kashmir (IIOJK) to the world and help Kashmiris in their struggle for right to self-determination under the UN resolutions.\nChaudhry Perveiz Iqbal Losar, who visited Shaheen Top, Line of Control (LOC) to observe Kashmir Solidarity Day, said “terrorist & coward Indian Army” had shifted its own civilian population from LOC to other places but they attack on innocent civilian population across LOC.\nAt a community event in Abu Dhabi, Pakistan’s Ambassador to UAE Afzaal Mahmood said that people in the Indian Illegally Occupied Kashmir were a part of Pakistani nation and Pakistanis would always stand shoulder-to-shoulder with them.\nHe said Pakistan’s ultimate objective remains the resolution of Indian Illegally Occupied Jammu & Kashmir (IIOJK) dispute as per the wishes of the Kashmiri people and relevant resolutions of the United Nations Security Council.\nA documentary was screened and a photo exhibition was held depicting gross human rights violations being committed by the Indian occupation forces.\nTurkish Parliamentarian & Chairman of Environment Commission in Turkish Parliament @muhammetbalta61 said at #KashmirSolidarityDay event in Ankara “Like Pakistan, Kashmir and Kashmiris have the same place in heart and mind.”#KeşmirDayanışmaGünü#PakStandsWithKashmiris#Kashmir pic.twitter.com/e6s1SgtdnE\n— Pakistan Embassy Turkey (@PakinTurkey) February 5, 2021\nIn Brunei Darussalam, at a special event, High Commissioner Maj Gen (retd) Abdul Aziz Tariq reaffirmed Pakistan’s unwavering political, moral and diplomatic support for the people of IIOJK in their just, legitimate and heroic struggle for the right of self-determination.\nA seminar was held Pakistan’s Consulate General, Sydney Australia where Australian Senator Mehreen Faruqi said that there were gross abuses of human rights in Kashmir. She said that her party has called on the Australian Government to call on the Indian Government to withdraw troops from Kashmir and release the political prisoners.\nOther speakers including Consul General Muhammad Ashraf, Dr. Ali Sarfraz, President Kashmir Council of Australia said the developed countries were keeping silent on these atrocities because of their economic and strategic interests with India.\nPakistan High Commission in Australia held a seminar ‘A Case of Human Rights in Jammu and Kashmir’, addressed by former foreign secretary Salman Bashir, former Australian senator Lee Rhiannon, Member of the Legislative Council in the New South Wales Parliament David Shoebridge, Honorary Associate Professor of Australian National University Dr Claude Rakisits, Professor Samina Yasmin from University of Western Australia, Director and founder of the Centre for Muslim States and Societies and High Commissioner for Pakistan Babar Amin.\nSenator Lee Rhiannon said the people of IIOJK were facing a grave humanitarian crisis and were being denied basic rights, including freedom of movement and communication, and basic essential needs such as food and medicine.\nAn event was organised at the Embassy to commemorate the Jammu and Kashmir Solidarity Day. Anbassador Dr. Mohammad Faisal addressed the participants. @DrMFaisal@ForeignOfficePk@SMQureshiPTI#PakstandsWithKashmir#IIOJKunderSeige#KashmirLivesMatter pic.twitter.com/GHKOJO2tyy\n— Pakistan Embassy Germany (@PakinGermany_) February 5, 2021\nSalman Bashir gave an overview of the IIOJK conflict and highlighted the human rights violations, being carried by the Indian Security forces in IIOJK, including use of pellet guns, collective punishments, extra-judicial killings, rape and detention of Kashmiri leaders.\nA photo exhibition on the human rights violations, committed by the Indian security forces in the IIOJK\nDr Claude Rakisits, in his remarks, stated that the situation in IIOJK was grave due to the continued clampdown there. He said India’s actions of August 5, 2019 were a violation of international laws.\nIn Tokyo on Thursday, Pakistan Community members carrying banners and placards marched towards the UN Representative Office in Tokyo and submitted a resolution on behalf of the “Kashmir Solidarity Forum Japan” reminding the UN of its pledge made to the people of Kashmir accepting their right of self-determination.\nAmbassador Imtiaz Ahmad in his keynote address enumerated the steps taken by the government of Pakistan at various international forums to highlight India’s unacceptable actions and gross human rights violations.\nEarlier, a webinar and a photo exhibition were held to highlight the continuing torture and brutal repression carried out by the Indian Occupied forces in IIOJK.\nAt Pakistan embassy in Austria, Ambassador Aftab Ahmad Khokhar briefed the local media in Vienna on Kashmir dispute in a historical perspective while also highlighting the ongoing Indian atrocities in IIOJK and Indian measures to alter its demographic structure in violation of international law.\n“All the constants in Kashmir’s equation i.e geography, history & law are on Pakistan’s side. The variables like politics and economics are also bound to change in Pakistan’s favour,” Pakistan’s Permanent Representative to OIC Ambassador Rizwan Saeed Sheikh said addressing an event to observe Kashmir Solidarity Day.\nAddressing a webinar, Charge d’Affaires at Embassy of Pakistan France M. Amjad Aziz Qazi stressed that Pakistan would remain steadfast in its solidarity with the Kashmiri people until they get their legitimate right to self-determination, in accordance with the United Nations Charter and relevant UN Security Council Resolutions.\nThe Charge d’Affaires, who also inaugurated a photographic exhibition, said under the leadership of Prime Minister Imran Khan and Foreign Minister Makhdoom Shah Mahmood Qureshi, Pakistan has been actively highlighting the case of Kashmir at the international level, in an unprecedented manner.\nA photographic exhibition in connection with Kashmir Solidarity Day was inaugurated by C’dA Mr. Amjad Aziz Qazi at Pakistan Embassy France today.#KashmirSolidarityDay pic.twitter.com/xuflyBucED\n— Pakistan Embassy France (@PakinFrance) February 5, 2021\nThe Embassy of Pakistan in Tehran organized a seminar a number of Iranian academicians, media persons, members of Pakistani community including students participated in the event.\nIn his remarks, the Ambassador called the international community and all human rights organizations to urge India to halt the brute use of force against the innocent Kashmiri people and resolve the Kashmir Dispute as per the UNSC Resolutions. The Ambassador thanked the Iranian leadership, civil society and media persons for their continued support to the Kashmir cause.",
  "retrievedAt": "2025-08-11T20:19:30.172Z"
}
