{
  "title": "Pakistan to continue supporting Kashmiris against Indian oppression: Shibli",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-supporting-kashmiris-against-indian-oppression-shibli/",
  "date_published": "2021-02-05T08:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 05 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Friday said Pakistan would continue to stand with their Kashmiri brethren struggling against the Indian atrocities, military attacks, oppression and cruelty in the occupied Jammu and Kashmir.\nThe minister, in his message on the occasion of Kashmir Solidarity Day, said today the people of Pakistan expressed solidarity with their Kashmiri brothers, reiterating their pledge that Pakistan would continue to extend moral, political and diplomatic support for the Kashmiris right to self-determination.\nHe said the Kashmir dispute was an unfinished agenda of the Sub-continent’s partition, and the one-sided and illegal step of India on August 5, 2019 on Kashmir had further increased the importance of the day of February 5.\nThe unarmed and oppressed Kashmiris, he said, had been the victims of inhuman treatment of India for the last seven decades. However, the continuous military siege, communication blockade, media blackouts and severe restrictions faced by the Kashmiris in the last 18 months were unprecedented in the world, he added.\nShibli said India was now known as a cruel and oppressive imperial state, which had not only usurped the basic rights of Kashmiris but also made the lives of minorities in the country miserable.\nEspecially the Muslims were targetted with discriminatory treatment and oppression, he added.\nThe minister pointed out that there was no respect and protection for the life, property, businesses, social and economic rights, and sacred religious and historic places of Muslims in India.\nThe Kashmiri people were struggling for the last seven decades for their just, democratic and basic rights, he observed.\nHe called upon the international community to force India to stop its inhuman treatment of the Kashmiris.\nHe urged the civilised world to play its just role in ensuring fundamental rights of the Kashmiri people in light of the United Nations Security Council resolutions.\nPrime Minister Imran Khan was standing with the Kashmiri people and he raised voice for their rights at the international forums, the minister stated.",
  "retrievedAt": "2025-08-11T20:19:24.860Z"
}
