{
  "title": "Pakistan urges UNSC to exercise legal, moral authority for implementing Kashmir resolutions",
  "link": "https://www.app.com.pk/national/pakistan-urges-unsc-to-exercise-legal-moral-authority-for-implementing-kashmir-resolutions/",
  "date_published": "2021-02-05T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): Pakistan on Friday called upon the United Nations Security Council (UNSC) to exercise its legal and moral authority for implementation of its resolutions on Jammu and Kashmir dispute guaranteeing an inalienable right to self-determination.\nAs the country observed annual Kashmir Solidarity Day, Foreign Minister Shah Mahmood Qureshi approached the UNSC President and the UN Secretary General to apprise them of India’s continuing gross and systematic violations of human rights in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAs part of Pakistan’s sustained diplomatic outreach, he also apprised them of India’s unlawful campaign to colonize the occupied territory, and its belligerent and hostile actions against Pakistan, including persistent ceasefire violations, which posed a threat to peace and security.\nThe foreign minister, in his letter addressed to the UNSC President and the UN Secretary General, underscored that all unilateral and illegal measures taken by India in the occupied territory of Jammu and Kashmir in violation of international law, including relevant resolutions of the UN Security Council and the 4th Geneva Convention, such as changes in the demographic structure, usurpation of land and farcical “elections”, were null and void, according to a Foreign Office press release.\nDrawing attention to India’s perpetration of terrorism and subversion against Pakistan, Foreign Minister Qureshi recalled the detailed dossier presented to the United Nations containing irrefutable evidence of India’s active planning, promoting, aiding, abetting, financing and execution of terrorist activities against Pakistan.\nIndia’s smear campaign to malign Pakistan internationally revealed through the EU DisinfoLab report hds also been brought to the attention of the Security Council, he added.\nThe foreign minister noted that the recent exposé of transcripts in the Indian media further established its orchestration of “false flag” operations and belligerent actions for domestic political and electoral gains.\nHe also apprised the Security Council of alarming incident in December 2020 of firing upon a clearly marked vehicle of the United Nations Military Observer Group in India and Pakistan (UNMOGIP), threatening the safety and security of UN peacekeepers and impeding the fulfillment of their mandate.\nThe foreign minister called upon the Security Council to urge India to immediately lift the continuing military siege, and rescind the illegal and unilateral actions in the IIOJK, remove restrictions on communications, movement and peaceful assembly, and release incarcerated Kashmiri political leaders.\nHe also called for freeing all arbitrarily and illegally detained Kashmiris, freezing and reversal of new domicile rules and property laws designed to change the demographic structure of the IIOJK, and remove the draconian laws enabling Indian occupation forces to continue human rights violations with impunity, including extrajudicial killings in fake encounters.\nMoreover, the foreign minister urged the UNSC to urge India to allow access to the occupied territory to the UN observers, international human rights and humanitarian organizations, observers and the international media.\nThe letter by the foreign minister is part of Pakistan’s continuous efforts to keep the UN Security Council and the Secretary General fully apprised of the grave situation in the IIOJK and the threat it poses to peace and security in the region.",
  "retrievedAt": "2025-08-11T20:19:19.840Z"
}
