{
  "title": "Kashmir solidarity day aims to highlight Indian brutalities: CM Balochistan",
  "link": "https://www.app.com.pk/national/kashmir-solidarity-day-aims-to-highlight-indian-brutalities-cm-balochistan/",
  "date_published": "2021-02-05T12:48:00.000Z",
  "source": "APP",
  "content": "QUETTA, Feb 05 (APP): Chief Minister Balochistan Jam Kamal Khan on Friday said Kashmiri people were being victimized by Indian barbarism while its fascist rulers has turned Kashmir’s beautiful valley into prison for the past several months.\nHe expressed these views while addressing at a ceremony to mark Kashmir Day to express solidarity with Kashmiri people at Balochistan Assembly here.\nChief Minster regretted that the silence and indifference of the major powers to India’s atrocities and blatant human rights violations in Occupied Jammu and Kashmir was a tragedy of history.\nChief Minister Jam Kamal Khan reiterated his commitment that the people of Pakistan and Balochistan would continue to support their Kashmiri brothers in all circumstances.\nHe said silence of western powers over the fascism of the Modi government and the atrocities against minorities and especially Muslims in our neighborhood were regrettable in the world.\nHe said that the history of oppressors in the world is dark and the real face of Modi has become clear adding that it was the responsibility of the just and conscientious people of the world to raise their voice against the Indian government.\nHe said that one of the aims of celebrating Kashmir Solidarity Day on February 5 was to make the world aware of the facts and to awaken their conscience to support the oppressed Kashmiri people.\n“We wanted to send a message to the Kashmiri people that we stand with them and soon our Kashmiri brothers will breathe free and open air from the tyranny of India,” he said.\nChief Minister expressed satisfaction over the fact that rallies and celebrations were organized in all the districts of Balochistan on the occasion of Kashmir Solidarity Day which is a proof that the patriotic people of Balochistan stand with the oppressed Kashmiri brothers.\nHe said we wanted peace in the region, but we desired to make it clear that for peace and stability, oppression and injustice must end.\nHe said that we must share our message regarding this day in some forum even in political context adding we have to move this cause forward, solidarity with the Kashmiri people has always been and will remain.\nProvincial Minister Mir Saleem Ahmed Khosa, Parliamentary Secretaries, Ms. Bushra Rind, Dhanish Kumar and Chief Minister’s Coordinator Bilal Khan Kakar also addressed the function.\nLater, Balochistan Chief Minister Jam Kamal along with the provincial ministers also expressed solidarity with the Kashmiri people by forming a chain of hands.\nProvincial Ministers Mir Arif Jan Mohammad Hassani, Saleem Ahmed Khoso, Haji Matha Khan Kakar, Parliamentary Secretaries Ms. Bushra Rind, Dhanish Kumar, Chief Minister’s Coordinator for Public Affairs Bilal Khan Kakar, Commissioner Quetta Division Asfandyar Khan Kakar and other people of Kashmir were present on the occasion.\nHowever, various rallies and different programs were held to celebrate the Kashmir Day with zeal to express solidarity with Kashmiri people in respective districts of Balochistan including Mastung, Khuzdar, Kalat, Kharan, Nushki, Dabandin, Gwadar, Panjgur, Naseerabad, Jaffarabad, Kuhlo, Sibi, Bolan, Suhbatpur, Chaman, Loralai, Pishin, Qila Saifullah, Harani and other districts.\nMeanwhile, rallies were taken out in provincial capital under different political parties including Balochistan Awami Party (BAP), Jamiat Ulema-i- Islam (JUI), other parties, and Paksitan Youth Peace Movement (PYPM) for expressing solidarity with Kashmiri people during celebration of Kashmir Day.",
  "retrievedAt": "2025-08-11T20:19:19.340Z"
}
