{
  "title": "Qureshi urges foreign media to visit both Kashmirs to compare development, rights situations",
  "link": "https://www.app.com.pk/national/qureshi-urges-foreign-media-to-visit-both-kashmirs-to-compare-development-rights-situations/",
  "date_published": "2021-02-05T07:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 05 (APP): Foreign Minister Shah Mahmood Qureshi on Friday asked the international observers and foreign media to visit both parts of Kashmir for getting first hand information about normalcy at the Pakistan side and the worsening human rights situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“I invite the foreign media and international observers to come and see themselves development in Azad Jammu and Kashmir (AJK), and later visit Srinagar to see the opposite,” the foreign minister said in his address to the Kashmir Solidarity rally here in the Federal Capital.\nThe comparison of “two entirely opposite situations in the AJK and the IIOJK” should be an eye-opener for the world, he added.\nSenate Chairman Sadiq Sanjrani, National Assembly Speaker Ayaz Sadiq, Minister for Information and Broadcasting Senator Shibli Faraz, parliamentarians and a large number of people from all walks of life participated in the rally.\nThe foreign minister said Pakistan would continue to extend support to the Kashmiris till they got their right to self-determination.\nAll the institutions of Pakistan, he added, were on same page on the issue of Kashmir with a united stance regarding the rights of Kashmiris.\n“We reaffirm our unflinching solidarity with the IIOJK people. The entire Pakistani nation stands with them in their valiant struggle to secure their inalienable right to self-determination,” he said.\nQureshi mentioned that for 18 months, the IIOJK had been under continuous Indian military siege, with the Kashmiris virtually caged in their own houses amid communications blockade and severe restrictions on the media.\n“Under the suffocating military siege and in the face of ravaging COVID-19 pandemic, the Indian army has continued cordon-and-search operations, staged fake ‘encounters’, and indulged in the killing spree of Kashmiri youth in the IIOJK — thus further accentuating the grave humanitarian tragedy there,” he said.\nFollowing the extremist Hindutva ideology, he said, the RSS-BJP regime had also embarked on a design to change the demographic structure of the occupied territory and obliterate the distinct Kashmiri identity.\nApart from new domicile and property laws, the rules changing the official status of Urdu language were also part of India’s that sinister campaign, he added.\nThe foreign minister called upon the international media, United Nations Secretary General, the UN High Commissioner for Human Rights, world parliaments, and human rights and civil society organizations to take notice of the grave human rights violations in IIOJK, including detentions without trial, use of pellet guns, and extra-judicial killings.\nThe international community must act in support of the fundamental freedoms and basic human rights of the Kashmiris, he said, urging India to allow the UN Fact Finding Mission to investigate the grave human rights violations in IIOJK.\n“India must allow the United Nations Military Observer Group in India and Pakistan (UNMOGIP) unhindered access to carry out its mandate.\nIf India has nothing to hide, it must allow international media and civil society to visit and report on the human rights situation in the IIOJK,” he said.\nThe foreign minister stressed on the international community to hold India accountable for its egregious violations of human rights and serious crimes against the Kashmiri people.\n“Pakistan also reaffirms full support to the Kashmiri brothers and sisters. This solidarity will continue until the Kashmiris achieve their inalienable right to self-determination as enshrined in the UN Charter and relevant UN Security Council resolutions,” he said.\nIt was the only course to durable peace, security and development in South Asia, the foreign minister stressed.",
  "retrievedAt": "2025-08-11T20:19:26.127Z"
}
