{
  "title": "PM asks world community to hold India accountable for HR abuses in IIOJK",
  "link": "https://www.app.com.pk/national/pm-asks-world-community-to-hold-india-accountable-for-hr-abuses-in-iiojk/",
  "date_published": "2021-02-04T19:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP):Prime Minister Imran Khan has called upon the world community to hold India accountable for its crimes against humanity in the IIOJK, reiterating Pakistan’s “unshakable” solidarity with the Kashmiri people.\n“For its part, Pakistan will remain unshakable in its solidarity with the Kashmiri people until they realize their legitimate and inalienable right to self-determination, in accordance with the United Nations Charter and relevant UN Security Council resolutions.\nThis is indispensable for durable peace and security in South Asia,” he said in his message to the nation on Kashmir Solidarity Day (February 5).\nImran Khan reaffirmed Pakistan’s resolute support for the Kashmiri brothers and sisters, who continued to be subjected to an inhuman military siege and communications blockade since August 5, 2019.\nHe said the tragedy of the Kashmiris, however, went back more than seven decades as they had faced unabated repression and consistent denial of their fundamental rights by India.\n“India must stop its brutal suppression of the Kashmiris, adhere to its international human rights obligations, and honour the commitment to Kashmiris to grant their inalienable right to self-determination through a free and impartial plebiscite under the UN auspices,” the prime minister demanded.\nHe said while observing the Solidarity Day, Pakistan saluted the unflinching resolve of Kashmiris in their valiant struggle for the right to self-determination, which was pledged to them by India, Pakistan and the international community.\nImran Khan said ever since India reneged on this commitment, it had sought to brutally suppress the Kashmiris’ quest for freedom.\nThe latest Indian attempts to further colonize the Indian Illegally Occupied Jammu and Kashmir (IIOJK) by altering its demography and obliterating the distinct Kashmiri identity were reflective of a sinister design to convert the Muslim majority into a minority, he added.\nThe said changes, he stated, were being carried out through promulgation of illegal domicile rules, changes in property laws, and downgrading the status of Urdu language. Incentives were being offered to outsiders to settle on the occupied land of the Kashmiris in violation of international law, particularly the 4th Geneva Convention.\nThe prime minister said over eight million Kashmiris had been turned into prisoners in their own homes, with more than 900,000 occupation troops holding them hostage.\n“History has few examples of such violation of fundamental rights. Thousands of Kashmiris have been arbitrarily detained. The Kashmiri youth are being particularly targeted through abductions, incarceration at undisclosed locations, indiscriminate use of pellet guns, and extra-judicial killings in fake encounters,” he remarked.\nCalling it a “manifestation of Indian state-terrorism against innocent Kashmiris”, the prime minister called for immediate lifting of the military siege and communications blockade as well as rescinding of India’s illegal and unilateral actions in the IIOJK.\nMoreover, he said, all those arbitrarily arrested and illegally incarcerated should be released and draconian laws providing impunity to the Indian occupation forces immediately repealed.\nThe prime minister demanded India to give access to the international human rights and humanitarian organizations, as well as the international media to investigate the grave human rights situation in the occupied territory.\nMeanwhile, Foreign Minister Shah Mahmood Qureshi, in his message, said for 18 months now, the IIOJK was under continuous Indian military siege, with Kashmiris virtually caged in their own houses, reeling under communications blockade, and facing severe restrictions on the media and political leadership being incarcerated.\nHe said under the suffocating military siege and in the face of ravaging COVID-19 pandemic, the Indian army had continued cordon-and-search operations, staged fake “encounters”, and indulged in a killing spree of Kashmiri youth in IIOJK – thus further accentuating the grave humanitarian tragedy there.\nFollowing the extremist “Hindutva” ideology, he said, the RSS-BJP regime had also embarked on a design to change the demographic structure of the occupied territory and obliterate the distinct Kashmiri identity.\n“If India has nothing to hide, it must allow international media and civil society to visit and report on the human rights situation in IIOJK,” he commented.\nCalling the international community to hold India accountable for its egregious violations of human rights and serious crimes against the Kashmiri people, he reaffirmed Pakistan’s support to the Kashmiri brothers and sisters.",
  "retrievedAt": "2025-08-11T20:19:28.301Z"
}
