{
  "title": "Masood accuses India of misguiding world about ground realities in IIOJK",
  "link": "https://www.app.com.pk/national/masood-accuses-india-of-misguiding-world-about-ground-realities-in-iiojk/",
  "date_published": "2021-02-05T18:14:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 05 (APP): Azad Jammu & Kashmir (AJK) President Sardar Masood Khan on Friday said India was misguiding the European governments and the US administration as well as decision-making institutions that Delhi was fighting against terrorists in occupied Kashmir.\n“The reality is somewhat different and India in fact is crushing defenceless, weak and unarmed Kashmiri people, and depriving them of their homeland, businesses and livelihood and engaged in the genocide of the inhabitants of the disputed territory,” he stressed.\nHe was addressing the Kashmir Solidarity Conference organized Faheem Kiani President Tehrik e Kashmir by through video link, which was also participated and addressed by more than 40-plus UK members of Parliament (MPs) and leaders of the Kashmiri community living in Britain, according to AJK President Office.\nThe UK MPs, who spoke on occasion and expressed solidarity with the people of occupied Jammu and Kashmir, were included, Robbie Moore MP, Gill Furniss MP Tony Lloyd MP, Steve Baker MP, Nadia Whittome MP, Yasmin Qureshi MP, Richard Burgon MP, Stephen Timms MP, Sarah Owen MP, Rachel Hopkins MP, Paul Bristow MP,\nJames Daly MP, Kate Hollern MP, Andrew Gwynne MP, Sara Britcliffe MP, Afzal Khan MP, Alison Thewliss MP, Rebecca Longbailey MP, Imran Hussain MP, John Spellar MP, Shabana Mahmood MP, Tahir Ali MP, Sam Tarry MP, Lillian Greenwood MP. Phil Bennion Former MEP, Liam Byrne MP, Tanmanjeet Singh Dhesi MP, Lord Wajid Khan, Debbie Abraham MP, Hilary Benn MP, Paul Blomfield MP and Cheryl Gillan MP.\nThe AJK president exhorted them to use their influence, and convey to the governments of the Western countries that if they failed to block the Indian military adventurism, the rule of law and the world order would no longer be in place in the world.\nTragically, he maintained that India was committing the crimes against humanity, and at the same time, it wanted that the world should not speak about its guilt. Such attitude of India should not be acceptable to the world at all.\nThe AJK president expressed gratitude to the UK and the European parliaments, media and the civil society for supporting the Kashmir cause, but he also complained that the powerful governments of those countries were silent over the Indian repression and the worst violations of human rights as well as the genocide of Kashmiri people at the hands of the Indian Army, and are thus showing negligence towards their international obligations.\n“Their silence is encouraging India to trample human rights in Kashmir,” he added.\nHe asserted that the UK MPs must not support the Kashmiri people mere to seek votes from the Kashmiri community in their constituencies but they should support the Kashmiri people because they were being deprived of their civil liberties and rights.\nSardar Masood Khan suggested that economic sanctions should be imposed on India for committing crimes against humanity in occupied Kashmir, and the Western countries should avoid making an investment in India until and unless it is ready to grant the right of self-determination to the Kashmiri people.\nHe prevailed upon the UN Security Council, the UN secretary-general and the UN Human Rights Commission to immediately take notice of the situation prevailing occupied Kashmir as it is posing a serious threat to peace and security of not only the region but the entire world. He reminded that both Pakistan and India are nuclear states, and the Indian brutalities are bringing both the countries close to a nuclear clash.\nPresident Tehrik Kashmir and host of the Solidarity Faheem Kiani in his welcome address thanked, especially the President of Azad Jammu and Kashmir and the British Parliamentarians for attending this Kashmir Solidarity Conference and expressing solidarity with the people of Indian occupied Jammu and Kashmir who living in the most militarized area in the world under brutal Indian occupation, Subjugation and oppression for last 73 years.\nHe said that you all know what the Indian Army is doing to Kashmiris in occupied Jammu and Kashmir. The Indian Army has killed thousands of Kashmiris and is using rape as a weapon of war in Kashmir. Kashmir, that needs your attention.\nHe said we have seen genocidal fascists emerge throughout history like Hitler, Mussolini and many others. In places like Rwanda and the Balkans, we have seen firsthand what happens when the world turns a blind eye. It is imperative that MPs play their role in preventing a repeat of history before it is too late.\nA delegation of All Parties Hurriyat Conference headed by Ishtiaq Hamid also called on President Arif Alvi. Talking to the delegation, the Pakistan president declared the APHC leaders as heroes and said they can narrate the true story of the Kashmiris’ plight. and more effectively advocate the international community about the Kashmir cause.\nThe Hurriyat leadership thanked the president Pakistan for coming to Azad Kashmir and expressing solidarity with the oppressed Kashmiri people. They said the words of President of Pakistan have emboldened the whole population of IIOJK.",
  "retrievedAt": "2025-08-11T20:19:29.427Z"
}
