{
  "title": "Quetta blast carried out to destabilize Pakistan: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/five-killed-11-injured-in-suicide-attack-in-quetta-says-sheik-rashid/",
  "date_published": "2021-04-22T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP):Minister for Interior Sheikh Rashid Ahmed on Thursday said the suicide blast in a Quetta hotel, which claimed five lives and injured 11, was carried out to destabilize Pakistan as the enemies could not digest its progress.\nIt was a suicide attack by the forces inimical to the country’s development, to disrupt peaceful environment in the Balochistan’s capital, he said while addressing a press conference.\nSheikh Rashid said six of the 11 injured had been discharged from hospital after treatment while two were in critical condition.\nA forensic investigation was being conducted into the attack and the terrorists had not yet been identified, he added.\nThe minister said he had directed the Balochistan Chief Secretary to investigate the incident. The Ministry of Interior had directed all the 22 law enforcement institutions under it, including the FC, Rangers, Coastal Guards and others, to remain on high alert, he added.\nHe said Balochistan and Gwadar were important for the country’s progress. Gwadar was in fact the future of Pakistan, he added.\nThe minister said the external elements were trying to destabilize and disrupt peace in Pakistan.\nSome 200,000 to 300,000 social media accounts were created in India in last 10 days for anti-Pakistan propaganda. The foreign forces could not see Pakistan progressing under the leadership of Prime Minister Imran Khan, he added.\nHe said Pakistanis were a great nation, who with the help of their great armed forces and intelligence agencies, had already defeated the terrorists backed by foreign forces, and would again thwart all the evil designs and conspiracies being hatched in India against the country.\nHe said an elected prime minister, a great army and 220 million people were the guardians of Pakistan. “We know how to live and die for this country,” he said.\nThe armed forces of Pakistan had won the fight against terrorism after laying down thousands of lives, he reiterated.\nReplying to a question, Sheikh Rashid said China was the closest friend of Pakistan. The Chinese ambassador had been in Quetta for the past few days and he was safe.\nHe rejected the speculations that the Chinese ambassador was at the hotel when the blast took place. The diplomat was somewhere else, he added.",
  "retrievedAt": "2025-08-11T20:39:01.898Z"
}
