{
  "title": "Serving ailing humanity; a collective responsibility of all: PM",
  "link": "https://www.app.com.pk/national/serving-ailing-humanity-a-responsibility-of-all-pm/",
  "date_published": "2023-08-06T12:14:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 06 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said that all those who were tasked with the onus to serve humanity, should strive for the provision of free-of-cost health and education facilities to the poor and deprived segments of society.\nThe prime minister was addressing a conference arranged here to create awareness about the elimination of Hepatitis-C in the country arranged at Pakistan Kidney and Liver Institute (PKLI).\nAddressing the participants, the prime minister said it was their collective responsibility to serve the poor and deprived masses by setting up health facilities like the PKLI in line with the vision of Quaid e Azam Muhammad Ali Jinnah, the founder of the nation, and in accordance with the concept of the welfare state.\nThe event was attended by Governor Punjab Muhammad Balighur Rehman, ministers, experts and relevant authorities.\nThe prime minister termed the event a historic and said that he always desired to see PKLI working on the pattern of Johns Hopkins of the USA.\nHe said the PKLI journey started in 2014, when he requested Dr Saeed Akhtar to set up a state-of-the-art institute for the kidney and liver diseases in Punjab province.\nThe prime minister said that the institute was established with an autonomous body to rid it of any official red tape.\nThe project was launched in 2015 and was completed in 2018 when the first kidney transplant was performed, he recollected.\nThe prime minister said that till this day, a total of 1000 transplants had been performed at PKLI which was another milestone.\nThe PKLI had now Rs 15 billion in the trust fund which would help in providing free treatment to the poor people, he added.\nHe observed that previously, they used to send liver disease patients to other neighbouring countries.\nPKLI was established in the country which entertained patients irrespective of class and without discrimination, he said, adding it was also an essence for the creation of Pakistan for which Quaid and a large number of people gave huge sacrifices.\nHe regretted that the poor people in the country suffered while the rich had all the resources to get treatment for themselves at the best facilities in the world.\nThe prime minister said during 2018, about 26 Hepatitis C filter clinics were established in the province under the umbrella of PKLI where patients were treated with great care and with free medicines.\nThat programme was subsequently halted due to politics, but now these filter clinics again started functioning and treatment was being provided across the province, he added.\nAbout the Hepatitis C programme, the prime minister said that Rs35 billion fund was provided by the federal government on the basis of half percent contribution by the provincial governments.\nEarlier, the prime minister launched the national Hepatitis C elimination programme and performed groundbreaking of PKLI University.\nSpeaking on the occasion, Governor Punjab Muhammad Balighur Rehman said today, was a momentous day in the health and education sectors of the country as the prime minister would be inaugurating PKLI University and Hepatitis C Elimination Initiative.\nThe health and education sectors always witnessed progress during the governments of PML-N which established a vast network of different renowned institutions, he added.\nThe governor also expressed concerns over a number of out of school children in the country.\nProfessor Dr Saeed Akhtar, in his remarks, said that they were successful in setting up an information-based system leading to a center of excellence to serve the ailing and poor segments of society.\nDespite, Covid-19 pandemic, the institute performed thousands of surgeries and transplants and achieved a milestone of 1000 such surgeries and transplants, he added.\nPKLI had served over 3.5 million patient interactions since its inception in December 2017.\nMore than 2 million patient interactions had been served at PKLI hospital in a short span of time.\nOver 1.5 million patient visits for Hepatitis relief have been served under the Hepatitis Prevention and Treatment Programme (HPTP) since its launch till June 2019.",
  "retrievedAt": "2025-08-11T09:05:12.123Z"
}
