{
  "title": "Senate passes ‘Pakistan International Airline Corporation (Conversion) (Amendment) Bill, 2023’ to address financial woes",
  "link": "https://www.app.com.pk/national/senate-passes-pakistan-international-airline-corporation-conversion-amendment-bill-2023-to-address-financial-woes/",
  "date_published": "2023-08-06T18:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): The Senate on Sunday successfully passed ‘The Pakistan International Airline Corporation (Conversion) (Amendment) Bill, 2023’ with a resounding majority of votes.\nThe bill, presented by Leader of the House and Minister for Finance, Muhammad Ishaq Dar, aimed to bring about crucial amendments to the Pakistan International Airline Corporation (Conversion) Act of 2016. The amendments came in response to concerns raised by the concerned committee regarding the airline’s financial situation.\nAddressing the house, the minister highlighted the adverse impact of disinformation disseminated by a former government minister, leading to an annual loss of Rs 71 billion.\nHe emphasized that this misleading statement not only incurred severe financial losses for the national exchequer but also negatively affected Pakistani pilots employed by international airlines such as Emirates.\nRevealing alarming figures, Minister Dar stated that out of the total loss of Rs 71 billion experienced by Pakistan International Airlines (PIA), a substantial portion of Rs 59 billion was attributed to revenue generated from the United Kingdom (UK).\nHe underscored the efforts of the current government to revitalize the national flag carrier and align it with international aviation safety and regulatory standards.\nMinister Dar empathetically acknowledged the challenges faced by the Pakistani diaspora, especially those residing in the UK, due to the suspension of national flights.\nHe emphasized that the government had been repeatedly urged to find a resolution, as travelers had to bear additional expenses and inconvenience due to multiple transit flights.\nWith the amendment now in place, he said the relevant authorities were set to visit Pakistan in August, raising hopes for the resumption of PIA flights by October this year.\nHighlighting the financial state of PIA, Dar shared that the total liability of the airline amounted to Rs.743 billion, which included significant bank loans totaling Rs 383 billion.\nHe pointed out that the government had provided a sovereign guarantee, obliging it to pay Rs.262 billion in case of default by the institution. Furthermore, the PIA was burdened with outstanding dues to the tune of Rs.360 billion to entities like the Pakistan State Oil, Federal Board of Revenue, and Civil Aviation Authority, he maintained.\nThe minister expressed concern that the PIA was projected to incur a loss of Rs 110 billion this year alone.\nHe warned that if the airline continued its operations for seven more years, its liabilities could balloon to an astonishing Rs1973 billion.\nIn a reassuring announcement, he stated that the privatization of PIA would not result in the termination of any employee’s service. Currently, the airline employed around 7,900 individuals, he added.\nConcluding his remarks, the minister underscored the legislation’s importance for the greater good of the country and its citizens.\nEarlier, Senator Hidayat Ullah, Chairman of the Standing Committee on Aviation, presented a comprehensive report on the bill, highlighting the committee’s findings and recommendations.\nSenator Saleem Mandviwala emphasized the absence of fake pilots in Pakistan, and Senator Syed Yousuf Raza Gillani called for strict penalties against those responsible for causing significant financial losses and damaging the national reputation on the globe.",
  "retrievedAt": "2025-08-11T09:05:00.861Z"
}
