{
  "title": "Nawaz Sharif to be next PM if voted to power: PM",
  "link": "https://www.app.com.pk/national/nawaz-sharif-to-be-next-pm-if-voted-to-power-pm/",
  "date_published": "2023-08-06T15:13:00.000Z",
  "source": "APP",
  "content": "KASUR, Aug 6 (APP):Prime Minister Shehbaz Sharif Sunday said Nawaz Sharif would be the next prime minister of Pakistan and would change destiny of the country by initiating projects in the sectors of agriculture, industry and infrastructure.\nHe was speaking at a public meeting here after laying foundation stone for Taray Garh interchange on the Lahore-Bahawalnagar motorway and Rai Mansab Ali Khan interchange on Abdul Hakim motorway on the Bucheki-Nankana road.\n“Nawaz Sharif will serve the people of Pakistan as prime minister for another term if voted to power. He considers the whole of Pakistan as his family and in the past selflessly served the people,” he remarked.\nHe said Rs 263 billion would be spent on the construction of motorway from Lahore to Bahawalnagar and on other projects.\nHe recalled that in the past, Pakistan suffered from loadshedding of 20 hours every day and then Nawaz Sharif came in 2013 and he removed the darkness caused by power shortages by setting up power projects, revived industry and agriculture and brought the CPEC project of $ 30 billion with the collaboration of China.\nHe said their government provided laptops worth billions of rupees to millions of students, adding he was unfairly criticised for delivering laptops to youth who were now using modern tools of communication and earning livelihoods.\nHe noted that Nawaz Sharif initiated the project of Diamer Bhasha and Dasu dams and made Pakistan a nuclear state by conducting six nuclear explosions in response to five explosions by India.\nHe reminded that Nawaz Sharif rejected the offer of $ five billion by then US President Bill Clinton and went on with the nuclear explosions while ignoring pressure. Nawaz Sharif also started Zarb e Azab led by Pakistan army to eradicate terrorism and the jawans of armed forces and people from all sections of society rendered sacrifices against terrorism.\nShehbaz Sharif said unfortunately terrorists were again allowed to re-enter Pakistan and they took many innocent lives in terrorist acts.\nIn the era of Nawaz Sharif, the PM said Pakistan had good relations with friendly and brotherly countries including China, Saudi Arabia, Iran, Turkey, Qatar and others.\nThen Imran Niazi was imposed on the country after rigged election in 2018 and his regime caused severe damage to relations with these countries including Islamic countries and he resorted to baseless allegations of corruption against companies of China, he added.\nTies with China were broken by the former government of Imran Niazi despite the fact that the neighbouring country massively invested in infrastructure, power and road projects, he pointed out.\nThe prime minister said former judge Saqib Nisar and other co-conspirators ousted Nawaz Sharif on the basis of residence permit even when his name was not among the 400 persons named in the Panama papers.\nNawaz Sharif and his daughter Maryam Nawaz appeared before the court 100 times in their cases and did not evade arrests as was later done by Imran Niazi who presented a fake receipt for an expensive watch imprinted with a model of Khana-e-Kaaba and came in court with a “bucket on his head”, he added.\nHe said those who filed false and concocted cases against opposition leaders now met divine justice.\nHe said in the tenure of Imran Niazi, several cases of corruption surfaced including wheat and sugar scams in which money was minted by unnecessary export and import of these commodities and then these acts of fraud were never probed and citizens bore the burden of loot and plunder.\nHe said his government faced unprecedented challenges of inflation and devastating floods.\n“My government distributed Rs 100 billion among the flood affectees and several hundreds of billions are still required for their rehabilitation.”\nHe said due to his government’s policies and distribution of seeds and fertilizer on lower rates, bumper wheat was produced while cotton production this year would also be at record levels.\n“My government saved the country from default and from difficult economic conditions, unemployment and price hikes by signing the agreement with the International Monetary Fund.”\nHe said reasons of current inflation were war in Ukraine and rising international commodity and fuel prices, adding due to the mismanagement of the past government, his government had to sign agreement with IMF despite its tough conditions.\nSaudi Arabia gave $ two billion, UAE $ one billion and China rescheduled loans of $ five billion so that Pakistan could meet the financing needs for finalizing the IMF agreement, he informed.\nHe said as chief minister he served the people of Punjab with sincerity, undertook massive projects in health and education sectors, built road network in the province and gave free medicine to people.\nHe vowed that their next government would bring revolution in the agriculture sector, extract minerals worth billions of dollars and equip youth with latest tools of information technology. The youth programme would be implemented at the federal and provincial levels and more laptops would be given to the students on merit.\nHe lamented that billions of rupees were wasted on unnecessary court cases instead of a focus on mineral extraction in the provinces.\nHe told that the National Assembly would be dissolved on August 9 and a caretaker government would be formed.\nHe prayed for the departed souls who lost their lives in the train accident during the day and after sinking of a boat in Head Sulemanki.\nEarlier, the prime minister was given detailed briefing on the new infrastructure projects. Governor Punjab Balighur Rehman and legislators of Pakistan Muslim League(N) accompanied the prime minister.",
  "retrievedAt": "2025-08-11T09:05:00.251Z"
}
