{
  "title": "Malaysia-Pakistan bilateral trade surpasses $ 1.8 bln: Malaysian HC",
  "link": "https://www.app.com.pk/national/malaysia-pakistan-bilateral-trade-surpasses-1-8-bln-malaysian-hc/",
  "date_published": "2023-08-06T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): The High Commissioner (HC) of Malaysia to Pakistan, Ambassador Mohammad Azhar Mazlan said that the annual bilateral trade volume between Pakistan and Malaysia has surpassed USD $1.8 billion and both nations are determined to further strengthen their trade and investment collaboration in multiple sectors.\nSpeaking at a ceremony honoring Pakistan’s former participants of the Malaysian Technical Cooperation Program (MTCP), the High Commissioner emphasized the untapped potential for growth, stating that “Pakistan and Malaysia have the capacity to increase trade volume up to USD $ 10 billion annually.”\nHe underscored the significance of mutual collaboration, given that both Pakistan and Malaysia are integral partners in the Belt and Road Initiative (BRI), with Pakistan implementing the China-Pakistan Economic Corridor (CPEC) under the BRI framework.\nHigh Commissioner said “We believe in fostering stronger ties between our two nations and leveraging our respective strengths for mutual growth and prosperity. Together, we can achieve remarkable outcomes and create a brighter future for both Malaysia and Pakistan.”\nThe High Commissioner highlighted MTCP’s history and success since its inception in 1980, spanning an impressive 43 years. Under this program, around 764 Pakistani officials have received training in various crucial sectors, including nation-building, anti-corruption, Islamic finance, taxation, counterterrorism and good governance.\nThe High Commissioner expressed immense pride in this program, considering it an essential foreign policy tool for Malaysia.\nEmphasizing the historical ties, the High Commissioner said that the formal bilateral ties between Malaysia and Pakistan date back following Malaysia’s independence in 1957 and have since grown stronger over the years. This relationship has now extended into key multiple areas, among others, encompassing culture and tourism, education, defense, technical assistance on human resource development, trade and investment.\nAcknowledging the significant educational ties between the two countries, the High Commissioner revealed that currently, Malaysia is hosting around 5,000 Pakistani students pursuing their academic dreams.\nAdditionally, prior to the COVID-19 pandemic, a substantial number of Pakistanis sought higher education opportunities in Malaysia, reflecting the commitment to further expand and enhance this relationship.\nRecognizing the tremendous potential of Pakistan, given its sizeable population of approximately 240 million, the High Commissioner emphasized the abundant opportunities for collaboration between the two countries, particularly in the business environment.\nRecognizing the valuable contribution of Pakistani alumni who had the opportunity to receive training in Malaysia, the High Commissioner called them “Malaysian Ambassadors” in Pakistan, attributing their exposure to Malaysia’s expertise as a positive influence in fostering stronger ties between the two nations.",
  "retrievedAt": "2025-08-11T09:05:14.320Z"
}
