{
  "title": "Printing industry witnesses boom in sale of Azadi items ahead of independence day",
  "link": "https://www.app.com.pk/national/printing-industry-witnesses-boom-in-sale-of-azadi-items-ahead-of-independence-day-2/",
  "date_published": "2023-08-06T06:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP):The printing industry all across the country, including the capital city, has been witnessing a boom in the sale of Azadi items for the upcoming 76th Independence Day on 14 August (Monday) this year where printers were working till late at night to meet the orders and introduce unique designs to attract citizens. According to a report aired on a private news channel, As Pakistan is gearing up to celebrate Independence Day on 14th August, all leading textile factories have been receiving huge orders to make and supply tri-colour flags, posters, banners, decorative accessories To meet the increasing demands of the customers, the printers were seen busy with extra labour hours and they continued work till late at night, said a citizen. They have rolled out hundreds of thousands of national flags, posters, banners, and decorative accessories since the start of this month while vendors made quick profits on the streets, said a shopkeeper.  A worker in the Punjab printing press has expressed his joy for the extraordinary surge and extra profit in salary for printing stuff like Quaid Jinnah’s portraits, the National Flag, stickers with pictures of Minar e Pakistan and colored masks, etc. The enthusiastic youngsters are keen on purchasing different items to decorate their homes, bikes, cars and even offices. The additional workforce has already been hired to meet the demand, said a shopkeeper. Various political, social, educational, and literary events have also been planned to honor the event, however, the majority of people are giving advance orders and purchasing these items, said the youngster. An owner of the factory said we have hired an additional workforce to meet the orders, adding, the business activities remain continued till 13th August. The vendors on footpaths were also attracting huge public response ahead of Independence day and earning two times high as compared to last year, said a pedestrian.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:05:13.858Z"
}
