{
  "title": "FIA cracks down on hawala, human trafficking in Quetta - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Federal Investigation Agency’s (FIA) Commercial Bank­ing Circle Quetta has arre­sted three suspects invol­ved in illegal currency exchange and hawala/hundi transactions.\n\nMeanwhile, the agency also taken into custody three human traffickers in separate operations in Taftan.\n\nA spokesperson for FIA said that the operation was conducted on the directives of FIA Director General Riffat Mukhtar Raja as part of a crackdown on networks enga­ged in hawala and illegal money transfers.\n\nThe arrested suspects were identified as Muhammad Umar, Lal Muhammad, and Abdul Wali.\n\nOfficials said a total of Rs1.7 million was recovered from the accused, along with four mobile phones, registers, and other evidence related to hawala/hundi dealings. The suspects, who failed to provide satisfactory explanations regarding the seized currency, were taken into custody and further investigation has been initiated.\n\nHuman traffickers held\n\nMeanwhile, the FIA spokesman said that the agency also arrested three human traffickers in separate operations in Taftan and took four Bangladeshi nationals into custody.\n\nIn one operation, FIA Taftan staff launched a raid after receiving intelligence about a gang involved in smuggling people illegally to Iraq via Iran.\n\nDuring the raid, the agency arrested a notorious trafficker, Muhammad Adnan Aslam, who was linked to an organised network operating from Iraq. He was accused of smuggling Pakistani citizens through illegal rou-tes into Iran and onward to Iraq.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:29:02.686Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936548/fia-cracks-down-on-hawala-human-trafficking-in-quetta",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:42:55.000Z"
}
