{
  "title": "Governor for joint efforts to improve education in Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Governor Sheikh Jaffar Khan Mandokhail has underlined the need for collective measures to improve primary education, terming it the backbone of the country’s education system and the true foundation of future success.\n\n“We can significantly improve the literacy rate in the country, and particularly in the province, by focusing on primary education from the very beginning,” he said while addressing participants of an educational programme organised by Unicef and the Norwegian government on primary, middle, and technical education in Balochistan at BUITEMS University.\n\nA large number of teachers and students attended the event along with Unicef provincial head Maryam Darvesh, BUITEMS Vice Chancellor Dr Khalid Hafeez, University of Balochistan Vice Chancellor Dr. Zahoor Bazai, BUITEMS Pro Vice Chancellor Dr. Mirwais Khan Kasi and Palwasha Jalalzai.\n\nGovernor Mandokhail said the event was of great importance as speakers and experts highlighted the ground realities and statistics about primary education in Balochistan, which would help guide the government in formulating a comprehensive strategy for the future.\n\nSays 2.9m children out of school in the province\n\nHe noted that although Balochistan is the largest province in the country in terms of area, it is a very difficult task to provide all basic facilities to its very small but scattered population at their doorstep.\n\n“To turn the vision of an educated and developed Balochistan into a reality, we urgently need special help and guidance from the developed countries and international organisations,’’ he said.\n\nThe governor said the condition of primary education in Balochistan was alarming, pointing out that 2.96 million children are still out of school, depriving a large segment of the population of their basic right to education. He added that many village schools lacked basic infrastructure, electricity, clean drinking water, and proper sanitation facilities.\n\nHe stressed that such poor conditions hinder the learning environment and discourage parents from sending their children to school.\n\n“Every conscious person in the world should recognise that every child deserves the opportunity to learn, study, and progress. It is our national responsibility to ensure that no child in Balochistan is left behind in the race of life or deprived of basic facilities. Together, we can light new lamps of knowledge and awareness and equip our children with quality education and modern skills,” the governor concluded.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:52:46.206Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936540/governor-for-joint-efforts-to-improve-education-in-balochistan",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:42:55.000Z"
}
