{
  "title": "Wheat, vegetable prices surge as market disruptions continue - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: After over a year of price stability driven by declining interest rates and encouraging economic indicators, consumers are now facing rising prices for wheat and related products. The wheat crop, although harvested in March, came in below expectations, contributing to growing concerns.\n\nTraders warn that wheat consumption in the livestock and poultry sectors has added to the supply pressure, as a significant amount of wheat has been diverted for animal feed. In addition, recent heavy rains, particularly in Karachi and the upcountry, have exacerbated the supply-demand imbalance for vegetables, leading to higher prices at markets.\n\nAs per the latest data from the Sensitive Price Index (SPI) for the week ending Aug 21, the price of a 10kg wheat bag in Karachi has risen to Rs660, up from Rs640 at the start of August. Similarly, the cost of one kilogram of fine flour has increased to Rs95 from Rs93. The 20kg wheat flour bag now costs between Rs1,500 and Rs1,800, compared to Rs1,350 to Rs1,700 earlier this month.\n\nRauf Ibrahim, Chairman of the Karachi Wholesalers Grocers Association (KWGA), highlighted that the wholesale price of wheat has surged to Rs72 per kg, up from Rs62 in July. When the Sindh wheat crop entered the market in March, it was priced at Rs55-56 per kg. This sharp rise in wheat prices has led to increases in flour prices as well, with wholesale rates for flour No. 2.5 and fine flour climbing from Rs74 and Rs79 per kg to Rs81 and Rs85, respectively.\n\nWheat consumption in livestock and poultry sectors adds to supply pressure\n\nThe trend is not confined to Karachi. Across the country, the national average prices for wheat flour have risen. A 20kg wheat flour bag now costs between Rs1,480 and Rs1,800, while the price for a 10kg wheat bag and one kilogram of fine flour have increased to Rs709 and Rs97.53, respectively.\n\nIbrahim further noted that retailers are likely to pass on an additional Rs10 per kg to consumers as the wholesale price of wheat rises. Despite the harvests from Sindh and Punjab earlier this year, a wheat crisis is beginning to emerge, with fears of a potential shortage looming.\n\nIt is estimated that between three and four million tonnes of wheat have already been consumed by the livestock sector, out of the 23 million tonnes harvested this year. This consumption, which has increa­sed ahead of Eidul Azha, is expected to continue. This is a sharp deviation from the original estimate of a 27 million tonne harvest, further straining wheat supply.\n\nHe criticised both federal and provincial governments for their delayed response to the rising wheat prices, warning that unless action is taken, flour prices could climb to Rs100 per kilogram, affecting the broader population. He called for a ban on the use of wheat in the livestock sector to prevent further shortages and urged the government to stockpile wheat in private and state-run warehouses to avoid a crisis.\n\nCostly vegetables\n\nIn addition to wheat, the vegetable market in Karachi has also seen significant price hikes following recent rains. For example, tomato prices have surged to Rs200 per kg, up from Rs100-150 just days earlier, while onions have increased to Rs80 per kg from Rs50-60. Green onions have seen a dramatic increase, now priced at Rs500-600 per kilogram, up from Rs300. Other vegetables, such as bottle gourd and apple gourd, are being sold for Rs150 per kilogram, up from Rs80-100.\n\nHaji Shajehan, President of the Falahi Anjuman Wholesale Vegetable Market at the New Sabzi Mandi Super Highway, attributed the rise in vegetable prices to supply disruptions caused by the rains. He also noted that some exporters are purchasing good-quality onions for export, further contributing to local price increases. He placed part of the blame on retailers who are overcharging consumers due to reduced supply from Sindh’s producing areas.\n\nIn the pulses market, there is a significant gap between wholesale and retail prices. The wholesale price for good quality Mash, Moong, Masoor, and Gram pulses ranges from Rs240 to Rs340 per kilogram, while retailers are charging Rs280-420 for the same products.With these ongoing price increases and the looming threat of further price hikes, consumers are feeling the impact, and many are concerned about the government’s ability to manage the situation.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68aa3f6735fac.jpg",
  "retrievedAt": "2025-10-12T03:52:54.155Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936365/wheat-vegetable-prices-surge-as-market-disruptions-continue",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:01.000Z"
}
