{
  "title": "Indian batsman Cheteshwar Pujara calls time on illustrious career - Sport - DAWN.COM",
  "author": null,
  "content": "Veteran batsman Cheteshwar Pujara dropped curtains on his illustrious India career on Sunday after playing 103 Tests but failing to win back his place in the last two years.\n\nThe 37-year-old, who made his Test debut in 2010, last played for India in the 2023 World Test Championship final but has been active in domestic cricket as well as county cricket in England.\n\n“Wearing the Indian jersey, singing the anthem, and trying my best each time I stepped on the field — it’s impossible to put into words what it truly meant,” Pujara wrote on his social media pages.\n\n“But as they say, all good things must come to an end, and with immense gratitude I have decided to retire from all forms of Indian cricket. Thank you for all the love and support!”\n\nThe cricketer’s message continued: “As a little boy from the small town of Rajkot, along with my parents, I set out to aim for the stars; and dreamt to be a part of the Indian cricket team.\n\n“Little did I know then that this game would give me so much — invaluable opportunities, experiences, purpose, love, and above all a chance to represent my state and this great nation.”\n\nPujara joins former India captains Virat Kohli and Rohit Sharma and spinner Ravichandran Ashwin from the same generation to quit Test cricket within the past year.\n\nHe scored 7,195 runs, including 19 hundreds, from 103 Tests, averaging 43.60.\n\nPujara also played five one-day internationals but his solid defence and a remarkable ability to play marathon knocks made him an asset in Test cricket.\n\nHe demonstrated those skills most notably in 2018-19 when India registered their maiden Test series victory in Australia with player-of-the-series Pujara amassing 521 runs in seven innings.\n\nPujara batted a combined 11 hours in the opening Test in Adelaide, scoring 123 and 71 as India won the series opener.\n\nFormer India captain Anil Kumble led tributes to Pujara.\n\n“Congratulations on a fantastic career! You have been a great ambassador of this wonderful game,” Kumble, who also coached an Indian side featuring Pujara, wrote on X.\n\n“We are all proud of all your achievements on the cricket field. You gave it your all for the team! It was a privilege to have worked with you and may you continue to shine in your second innings.”\n\nPujara, a rare five-day specialist in the age of T20 and white-ball performers, has in the past attributed his staying power to discipline.\n\n“I have certain routines, fitness, a little bit of meditation, yoga and pranayama (a breathing technique) because it is necessary to shut the outside noise, even if it is positive,” he told reporters in 2023.\n\n“We play nine Tests on an average, and when you go back home, unless you have domestic cricket, you are not in touch with the game. Keep challenging yourself, keep training, looking forward.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/241242288838042.png",
  "retrievedAt": "2025-08-25T13:28:40.469Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936878/indian-batsman-cheteshwar-pujara-calls-time-on-illustrious-career",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T07:47:29.000Z"
}
