{
  "title": "Karachi’s water crisis may ease as Hub Dam nearly fills up - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Amid the city’s ongoing water crisis, recent monsoon rains have brought a significant improvement by raising the Hub Dam’s water level by 11 feet and securing potentially enough storage for up to three years.\n\nAccording to official sources, the water level at Hub Dam rose significantly due to the recent monsoon rains, increasing from 322 feet to 333 feet.\n\nKarachi faces severe water shortages, with a daily requirement of over 1,200 million gallons per day (MGD) but currently receiving only around 650 MGD, officials said.\n\nThe Hub Dam supplies approximately 100 MGD to the Keamari and West districts, while the remainder is sourced from Keenjhar Lake.\n\nOfficials say additional six feet of water is required to reach dam’s maximum capacity of 339 feet\n\nOfficials also said that the dam’s maximum capacity is 339 feet and when filled to this level, it can supply water to the West, Keamari and Central districts of the city for up to three years.\n\nWhen the dam reaches full capacity, excess water is released through a spillway to ensure safe drainage.\n\nIt is worth noting that the Hub Dam, completed in 1981, spans an area of 24,300 acres. To date, the dam has reached its full capacity 12 times. Last year, it reached the maximum level on Sept 1, after which the spillway was opened and water was released.\n\nExperts believe that if monsoon rains continue, the dam may reach full capacity again in the coming days.\n\nOfficials welcomed the rise in the water level and described it as encouraging news for both the Karachi Water and Sewerage Corporation and the city’s residents.\n\nThey added that the increased water reserves will play a crucial role in stabilising and improving Karachi’s water supply system.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:28:49.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936490/karachis-water-crisis-may-ease-as-hub-dam-nearly-fills-up",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:19.000Z"
}
