{
  "title": "Three tons as record-breaking Australia crush South Africa in 3rd ODI consolation win - Sport - DAWN.COM",
  "author": null,
  "content": "Cameron Green slapped a 47-ball century with Travis Head and Mitchell Marsh also blasting tons as Australia crushed South Africa by 276 runs in a record-breaking third and final one-day international on Sunday in Mackay.\n\nThe hosts were playing for pride, down 2-0 in the series, and responded magnificently, posting an ominous 431-2 after opting to bat — their highest ODI total on home soil.\n\nThey then dismissed the Proteas for 155 in the 25th over, with spinner Cooper Connolly taking 5-22.\n\nHead was supreme in blazing 142 off 103 balls, ably supported by skipper Marsh (100 from 106).\n\nTheir 250-run platform at Great Barrier Reef Arena was Australia’s highest ever opening partnership against the Proteas, bettering the 170 by Matthew Hayden and Adam Gilchrist in Durban in 2002.\n\nGreen then took over with a whirlwind 118 not out to mark the first time Australia’s top three have all scored centuries. Alex Carey was unbeaten on 50, with the 18 sixes slogged between them also a record at home.\n\n“A pretty crazy day, a full performance by the lads,” said Marsh.\n\n“But full credit to South Africa, they played outstandingly well in the first two games and were too good for us.”\n\nSouth Africa did themselves no favours by resting quicks Nandre Burger and Lungi Ngidi, with their second-string attack outplayed.\n\nAfter Marsh won the toss, the openers made an aggressive start, driving Australia to 86 after the 10-over powerplay.\n\nHead was in ominous touch, crunching boundaries with ease to reach his half-century off 32 deliveries.\n\nAt the other end, Marsh slammed two big sixes as he also got in the groove, going after the Proteas’ fresh new-ball pairing of Kwena Maphaka and Wiaan Mulder.\n\nWith the bowlers running out of ideas, Head cruised to a seventh ODI century, pushing Senuran Muthusamy for an easy single.\n\nHe then really let rip with a series of big hits before being caught in the deep by Dewald Brevis off Keshav Maharaj after crunching 17 fours and five sixes.\n\nMarsh battled to three figures soon after but was out next ball, taken on the run by wicketkeeper Ryan Rickelton after he skied Muthusamy.\n\nBut the onslaught was far from over with Green producing a sizzling display of power-hitting, including three giant sixes in a row off Muthusamy to post his maiden ODI century.\n\nOnly Glenn Maxwell (40 balls) has scored a faster hundred for Australia.\n\n“The two openers, they batted beautifully so me and ‘Kez’ (Carey) could just bat with a lot of freedom,” said Green.\n\nSouth Africa’s chase started badly with four wickets down for 50 inside nine overs.\n\nSean Abbott accounted for Aiden Markram (two) and skipper Temba Bavuma (19) while Xavier Bartlett took care of Rickelton (11) and Tristan Stubbs (one).\n\nThe visitors’ big hope was Brevis and he produced some fireworks in his 49 before Green caught him on the ropes off Connolly, who then cleaned up the tail.\n\n“We were under the pump from the first ball and didn’t really pitch up today,” said Bavuma. “They put us under pressure and we didn’t have the answers.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/24172028eb197c8.png",
  "retrievedAt": "2025-08-25T13:28:35.630Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936899/three-tons-as-record-breaking-australia-crush-south-africa-in-3rd-odi-consolation-win",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T12:26:49.000Z"
}
