{
  "title": "Rayan, Azlan headline Pakistan’s performance at junior swim worlds with new national records - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan’s junior male swimmers tore through the national record books as Rayan Awan and Azlan Sohail set new marks at the World Junior Swimming Championships in Romania, which concluded on Sunday.\n\nRayan clocked 30.87 in the Men’s 50m Breaststroke to smash the previous record of 30.98 set by Abdul Aziz Chaudhry 17 years ago. To put it into perspective, the record was set before Rayan was even born. He finished 58th out of 86 swimmers in the breaststroke sprint.\n\nAzlan can safely call himself the junior medley king after smashing the Under-16 national records in both the 200m and 400m Individual Medley.\n\nHe swam a 2:14.18 in the 200m IM to obliterate the previous record of 2:20.22 set by Ahmed Durrani, who represented Pakistan at the Paris 2024 Olympics last year. Azlan finished 47th out of 73 swimmers in the heats.\n\nAzlan then went 4:54.68 in the 400m IM to smash the age group record of 4:57.86 set by Amaan Siddiqui in 2022.\n\nThe 16-year-old had a mammoth lineup of 10 events ranging from sprints to mid-distance, but he delivered in every single race. He clocked 26.72 in the 50m Butterfly to finish 80th out of 116 swimmers.\n\nCompatriot Ali Mitha finished 61st in the same event with a time of 25.95. The duo battled it out in the 100m Freestyle as well, with Azlan clocking a 54.73 to finish 93rd ahead of Ali at 104th with a 55.55.\n\nThe duo, alongside Hareem Malik and Meher Maqbool, set a new national record of 04:10.45 in the Mixed 4x100m Freestyle Relay, according to official data released by World Aquatics.\n\nAzlan swam a 1:00.10 in the 100m Butterfly and 2:24.10 in the 200m Butterfly to finish 73rd and 45th respectively. He clocked in at 4:21.61 in the 400m Freestyle on the opening day of the week-long competition.\n\nAli swam a 25.06 in the 50m Freestyle to finish 81st out of 119 swimmers and a 27.38 in the 50m Backstroke: 27.38 to place 43rd out of 87 swimmers.\n\nThe 18-year-old swam a 1:01.19 in the 100m Backstroke — where he won there national title last year in 1:02.06 — to finish 52nd, while compatriot Mohid Sadiq Lone placed 71 and clocked a 1:04.43.\n\nLone swam a 2:24.33 in the 200m Backstroke and 2:20.78 in the 200m IM. He capped off the last of his mid-distance swims with a 2:41.02 in the 200m Breaststroke just ahead of Rayan, who clocked in 2:41.71.\n\nAside from breaking a nearly two-decade old record, British-based Rayan swam a 1:10.06 in the 100m Breaststroke.\n\nOver on the women’s side, Hareem Malik has been dominating breaststroke and swam a 36.12 in the 50m event, where she holds a national record set at last year’s junior national championships.\n\nShe swam a 33.70 in the 50m Butterfly to finish 99th, while Fatima Salman clocked 35.52. They went head to head in the 50m Freestyle too and it was once again Hareem who came out on top with a 30.71 while Fatima finished with a 32.68.\n\nFatima went 1:19.93 in the 100m Butterfly and a 2:55.91 in the 200m IM.\n\nMeher Maqbool clocked 1:10.03 in the 100m Freestyle and broke the U16 record in the 200m Freestyle with 2:28.44, smashing the previous mark of 2:29:14. She swam a 35.69 in the 50m Backstroke and finished just behind a 35.30 from Raaqiah Aqeel, the team’s youngest swimmer at just 14 years of age. Meher then went 1:17.49 in the 100m — where she claimed the title at last year’s nationals — while Raaqiah swam a 2:53.37 in the 20m Backstroke.\n\nThe women’s quartet set two new records when they swam a 4:48.46 in the 4x100m Freestyle Relay to break the previous record of 4:49.55, and a 5:12.25 in the 4x100m Medley Relay to smash the previous mark of 5:36.37.\n\nAll records were confirmed to Dawn.com by the Pakistan Swimming Federation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/242307189939c0f.webp",
  "retrievedAt": "2025-08-25T13:28:36.405Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936900/rayan-azlan-headline-pakistans-performance-at-junior-swim-worlds-with-new-national-records",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T12:46:26.000Z"
}
