{
  "title": "Beyond the short-term - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S management of the conflict with India, in which it got the better of its adversary, showed how effectively it met the latest external challenge to its security.\n\nThis generated a surge in national pride and self-confidence. Civil-military relations appear to be smooth and friction-free. Progress has also been made in achieving short-term macroeconomic stability as a result of the government’s measures. The country no longer faces an economic emergency as it did a year ago when it was teetering on the brink of sovereign debt default. Leaderless and divided, the opposition poses little threat to the government, at least for now. All this has created an aura of stability and indicates a positive near-term outlook.\n\nWhile it is important to acknowledge the gains Pakistan has recently made on various fronts, caution is warranted as the foundation for longer-term political and economic stability remains to be built. This requires addressing structural issues and dealing with the country’s enduring fault lines. It is a task waiting to be done.\n\nTake the case of the economy. An IMF bailout programme and implementation of several of its conditionalities have helped to stabilise the economy. But economic recovery remains fragile and the country still has to make the transition from stabilisation to growth and investment. Moreover, stabilisation has yet to involve building sufficient capacity to repay loans without resorting to more borrowing at a time when debt levels are unsustainable and external financing needs are large in the coming years. Constant requests for loan rollovers to lenders indicate the persisting lack of repaying capacity.\n\nThe country remains mired in a low-growth, low-investment, high-debt equilibrium trap. There is no escape from this unless structural issues are tackled. This requires bold, wide-ranging reforms that deal with the sources of chronic internal and external financial imbalances. It involves first and foremost, tax reform to make the regime simple and equitable. The tax base remains extremely narrow with several (politically significant) sectors either untaxed or lightly taxed. The export base is also narrow; little surprise that exports have fallen to eight per cent of GDP from 16pc a decade ago.\n\nThere has been no movement on privatising loss-making state-owned enterprises which are such a drain on the exchequer. Among other structural issues that need to be resolved are the energy sector’s circular debt, a heavy, burdensome regulatory regime and the state’s inordinately large presence in the economy that discourages investment. Private investment is stagnant. At 13pc of GDP, investment is the lowest among regional peers.\n\nLack of investment in human capital also constrains economic growth and contributes to the country’s economic weakness. Failure to invest in people has relegated Pakistan to the bottom of global human development rankings. Key indicators of literacy, education, health and other aspects of human welfare have deteriorated in recent years with poverty rising to 44pc. Underinvestment in education has meant 40pc of Pakistanis remain illiterate while 26 million school-age children are out of school, which is a national scandal. This enduring fault line has serious consequences for Pakistan’s long-term stability, one that suffers from neglect.\n\nBuilding durable stability requires addressing structural problems and overcoming fault lines.\n\nOn the political front, the PML-N-led government began its tenure with questionable legitimacy after a disputed election. It has now all but neutralised the main opposition party, PTI through a combination of electoral chicanery, legal manoeuvres, crackdowns, arrests, repressive measures, and, of course, by confining Imran Khan to jail. This has enabled the government to keep the opposition at bay, muzzle dissenting voices and rule virtually unhindered.\n\nThis may establish temporary ‘calm’ but is a recipe for instability ahead. The opposition represents a large section of society, has a significant parliamentary presence and runs the KP government. Efforts to marginalise it, far from contributing to political stability, detracts from it. It deepens polarisation in the country and fuels uncertainty.\n\nThe marked drift to authoritarianism, also reflected in a slew of laws that undermine judicial independence and criminalise free speech, is in fact a threat to stability. The way to build lasting political stability is not by autocratising the country but by strengthening constitutional democracy and rule of law and accommodating the opposition rather than suppressing it. Intolerance of opposition and criticism may have a long pedigree in the country’s history but it is a fault line that needs to be overcome.\n\nCivil-military relations are tension-free today because the government has ceded unprecedent­ed space to the military in the so-called hybrid system. The military’s role in governance is the most expansive under any civilian government. But this doesn’t guarantee stability. It could arguably do so if the military acted as a transformational agent committed to reform. But the status quo orientation of the managers of the hybrid arrangement does little for long-term stability or for economic development. Hybrid government distorts the political system, involves power without responsibility and creates a disconnect with both democratic principles and public aspirations, which expect those they have elected to run the government.\n\nThe internal security situation continues to pose a threat to the country’s stability despite determined efforts by the army and other law- enforcement personnel. There have been notable counterterrorism successes. But the alarming deterioration in security, driven by militant violence across KP and Balochistan, has yet to be reversed. This made last year the deadliest in a decade in casualties suffered by security forces.\n\nBalochistan, of course, presents a special case as the underlying sources of long-standing public disaffection need to be addressed. Insurgents have to be isolated and the trust of the local community won. But in conflating militants with Baloch nationalists and casting every dissident group and political leader as traitors and abettors of terrorists, state policy contradicts the fundamental principle of fighting militancy, which is not to multiply the number of adversaries.\n\nEngaging with the grievances that militants and foreign powers exploit is essential for an effective counter-insurgency strategy. This means law enforcement must be accompanied by political, economic and social measures to win hearts and minds. Without that, restoring stability to the province will remain elusive.\n\nThese different challenges require reframing the stability paradigm so that policies are crafted to deal with structural problems which stand in the way of achieving durable stability. This needs, above all, a break from the business-as-usual, muddle-through approach of the past.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab9e357a8ad.jpg",
  "retrievedAt": "2025-10-12T03:52:48.442Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937055",
  "dateList": "2025-08-24",
  "date_published": "2025-08-25T00:30:50.000Z"
}
