{
  "title": "Pakistan Open MMA Championship set for thrilling finals - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Under cloudy skies, the semi-final round of the Pakistan Open MMA Championship rolled into action on Saturday as fighters displayed their prowess, recording multiple submission wins across various weight categories here at the Brave Gym.\n\nThe strawweight (52.2kg) fight between Tayyab and Bismillah kicked off the action, with the former displaying superior grappling skills throughout three electrifying rounds to secure a unanimous decision victory.\n\nIn the opening round, Punjab’s Tayyab secured a half-guard and landed several significant strikes. Bismillah managed to escape and secure a dominant position by the end of the round, but it was too little, too late.\n\nThe second round began in similar fashion with Tayyab securing a takedown, but Bismillah locked in a guillotine choke. Tayyab remained calm, broke free, and, capitalising on his opponent’s fatigue, landed strikes from the top position.\n\nWith two rounds down, Bismillah’s only remaining option was a finish by knockout or submission.\n\nHe charged forward early in the third round but quickly ran out of gas. Sensing his opponent’s weakness, Tayyab pounced on the opportunity for a takedown. Bismillah eventually managed to get out, but he lacked both the time and the energy to mount a winning offense.\n\nTayyab will face Abdul Mannan in the final, after the fighter from Islamabad recorded a dominant submission win over Nehal Khan of Punjab.\n\nMannan came out blazing, throwing powerful overhand rights and proving quicker in the exchanges. Nehal tried to clinch to weather the storm, but Mannan picked him up and slammed him into the octagon, though he couldn’t secure a finish.\n\nThe second round started similarly. Mannan swung hard, and as Nehal attempted to clinch, he gave up his neck, allowing the 22-year-old Mannan to secure the submission.\n\nTanzil Abbas registered the first submission of the day, defeating Hussain Malik of Sindh to confirm his place in the featherweight (65.8kg) final.\n\nThe fight started cautiously, with both fighters trying to find their range. Tanzil, representing KP, showed superior skills on the ground, eventually securing an armbar in the final round.\n\n“I improvised during the fight as I originally wanted a striking battle with him,” Tanzil told Dawn. “But after my first takedown attempt, I realized he wasn’t very good on the ground, so I changed my approach.”\n\nNext up for Tanzil is defending champion Ayyan Hussain, who also secured a first-round submission win over Sindh’s Musavir Shah.\n\n“I am prepared and ready to do everything to win the championship,” Tanzil said regarding his final fight. “Hopefully, it will be a complete MMA package from my side.”\n\nHe added that having back-to-back fights is difficult as it takes a toll on the body, but noted that this is the case for his opponent as well.\n\n“Recovery and weight cutting are very difficult as you have to lose almost three to four kg before every fight. But I will walk away with the win.”\n\nThe bantamweight (61.2kg) division saw a controversial end to a fight, as champion Asghar Khan was awarded a submission win by referee Dawood despite his opponent, Ihsanullah, not tapping.\n\nAsghar attempted a takedown, but after a scramble, Ihsanullah got on top. Asghar, however, secured his opponent’s arm and appeared to lock in an armbar, prompting the referee to abruptly end the contest. Ihsanullah and his corner were unhappy with the decision and protested vehemently.\n\nThe flyweight bout saw a similar conclusion, with Mohiz Satti of Islamabad winning his fight against Balochistan’s Abdul Rehman via first-round armbar submission. Abdul Rehman also did not tap, but Mohiz had firm control and could have broken his opponent’s arm.\n\nOn Friday, Faizan’s hand was broken during his flyweight bout, and he had to be rushed to a local hospital.\n\nIt will be an all-Islamabad final in the flyweight division, as Muhibullah also registered a submission victory over Nazar of Punjab.\n\nAfter dominating the first round with his superior grappling skills, Muhibullah slammed Nazar in the second round before finishing the fight with an armbar.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:28:51.659Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936513/pakistan-open-mma-championship-set-for-thrilling-finals",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:08.000Z"
}
