{
  "title": "Why Pakistani students feel unheard — and what can change that - Pakistan - DAWN.COM",
  "author": null,
  "content": "Across Pakistan’s higher education landscape, an underexplored challenge is quietly taking root: the growing disconnect between university administrations and their students.\n\nUniversities in Pakistan have made commendable strides in expanding access and infrastructure. Yet, between those who run these institutions and those who fill their classrooms, an invisible gap persists — one of dialogue, and mediation, subtle enough to escape daily notice, but powerful enough to shape policy, campus culture, and the student experience itself.\n\nIn recent years, Pakistan’s student population has surged. Enrolment in higher education crossed 2 million in 2022-23, up from 1.58 million in 2017-18, according to the Higher Education Commission (HEC). With this growth has come greater diversity not only in socioeconomic backgrounds, but in expectations, communication styles, and cultural references.\n\nMany university administrations, however, remain rooted in older institutional traditions, shaped by administrative norms that were designed for smaller, more homogeneous cohorts. As the social, digital, and cultural profile of Pakistani youth evolves, so too must the ways universities connect, communicate, and collaborate with their students.\n\nOne of the central structural issues is the lack of formal mediation bodies or consistent platforms for dialogue. Without these, students are left to navigate opaque decision-making processes on their own, while administrators handle policy and discipline without structured feedback. This results in a mutual sense of disconnect — students feel unheard, and institutions operate in the dark, unable to anticipate or fully grasp the concerns of the very people they serve.\n\nUnlike in many other countries, Pakistani universities are governed by individual institutional charters. The Higher Education Commission (HEC) sets minimum academic and administrative standards but grants universities considerable autonomy in how they govern themselves.\n\nUnder the HEC’s 2002 Ordinance, degree-awarding institutions are authorised to craft their own statutes, including rules on governance, student conduct, and disciplinary proceedings. While this autonomy encourages innovation and accountability, it also creates inconsistencies in how student affairs are handled. Some universities have clear grievance redressal policies; others lack accessible processes or dedicated forums for dialogue. As a result, the quality of governance often depends entirely on internal policy choices.\n\nAdding to this complexity is the legal status of student representation. Since the 1984 ban on student unions, formal avenues for student voices have been limited. While the ban may have contributed to greater campus stability at the time, its long-term effect has been the absence of structured, representative dialogue between students and university leadership.\n\nIn March 2024, the Supreme Court, in Judgment No. 7 of 2024, acknowledged the importance of student representation in university governance and called for clearer regulatory frameworks to safeguard against politicisation. The ruling has reignited policy debates but has not addressed the broader challenge of how universities can integrate student perspectives through neutral, accountable mechanisms. In their absence, students often resort to social media or informal channels to voice grievances — a practice that can further widen the trust gap between administrations and the student body.\n\nThis policy vacuum is especially concerning in a sector where unmanaged tensions can escalate rapidly. A 2022 study by the Institute of Social and Policy Sciences (I-SAPS) found that over 70 per cent of students in public-sector universities felt they lacked adequate platforms to raise concerns about academic policies, housing conditions, or campus life. In private universities, student satisfaction was generally higher, yet the perception of having limited influence over policy decisions remained a recurrent theme.\n\nInternational models offer useful points of reference. In the United Kingdom, for instance, the Education Act 1994 requires universities to engage students through formally recognised student unions and academic representation systems. In the United States, many institutions maintain Ombuds offices — neutral, confidential spaces where students can raise concerns and seek mediation. These bodies are neither adversarial nor political; their sole mandate is to preserve institutional harmony by ensuring students are heard and administrators remain informed.\n\nIn Pakistan, by contrast, such institutional forums are rare. While a few private universities have experimented with town hall meetings, feedback portals, and faculty–student liaison committees, these initiatives are often ad hoc and lack legal recognition. As student populations grow and digital communication accelerates the flow of information, informal mechanisms alone are unlikely to suffice. Universities must now consider whether structured, legally backed forums for mediation can complement governance structures and build trust without undermining institutional authority.\n\nThe benefits of such mechanisms go beyond procedure. When students feel heard, they are more inclined to follow institutional policies, engage in academic initiatives, and contribute to a healthier campus culture. Likewise, administrators with access to real-time student feedback can make better-informed decisions, reducing the risk of resistance, misunderstandings, or policy missteps.\n\nLegally, there is room to explore this middle ground. Section 10 of the HEC’s Model Charter for Private Universities encourages the creation of academic councils with student representation, albeit limited to academic matters. Extending this principle into wider aspects of campus life — without even reverting to politicised structures — could be a useful starting point. Similarly, grievance redressal systems under the HEC’s Quality Assurance Framework could be expanded to include student mediation cells, with representation from both students and faculty.\n\nToday, universities grapple with a host of challenges — from regulatory compliance to financial sustainability. Yet neglecting student–administration relations risks brewing long-term tensions that could erode institutional cohesion.\n\nAs Pakistan’s higher education sector seeks to compete globally and serve a younger, more connected generation, the lack of structured mediation mechanisms is poised to become an ever greater governance liability.\n\nFurthermore, unresolved grievances can invite litigation under constitutional provisions on equality (Article 25) or due process (Article 10-A), especially when disciplinary actions are perceived as arbitrary. If grievance management continues to be inconsistent and opaque, it could potentially undermine public confidence in higher education governance.\n\nIt is important to clarify that the case for mediation is not a critique of existing governance structures, many of which have adapted to manage complex academic ecosystems with limited resources. Rather, it is an acknowledgment of the changing nature of student engagement, and the growing need for responsive institutional frameworks that reflect this shift.\n\nBuilding such systems does not require sweeping legislation or major structural change. It simply requires recognising that, when thoughtfully institutionalised, dialogue can be a source of stability, not disruption. Universities that anticipate and manage student expectations through transparent, participatory forums are far better positioned to thrive in an increasingly complex educational environment.\n\nIn a country where education is both a constitutional right and a cornerstone of national progress, fostering genuine partnership between students and universities is a legal and strategic necessity. Ensuring they work in concert, rather than in conflict, may prove to be one of the most vital reforms yet to shape the future of Pakistan’s higher education.\n\nHeader Image: The image is created via generative AI",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/151459037c464d2.png",
  "retrievedAt": "2025-10-12T03:53:03.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930661/why-pakistani-students-feel-unheard-and-what-can-change-that",
  "dateList": "2025-08-24",
  "date_published": "2025-08-25T07:07:24.000Z"
}
