{
  "title": "Israeli strikes in Yemen’s capital kill two, Houthis say - World - DAWN.COM",
  "author": null,
  "content": "Israel struck Yemen’s capital Sanaa on Sunday, killing at least two people, according to the country’s Houthi rebels, who have repeatedly launched missiles and drones at Israel throughout the Gaza conflict.\n\nAFP images showed a large fireball lighting up the skies over the rebel-held Yemeni capital, leaving behind a column of thick, black smoke.\n\nThe Houthis’ health ministry reported “two martyrs and 35 wounded” in the Israeli raid.\n\nA Houthi security source told AFP that the air raid targeted a municipal building in central Sanaa, while the group’s Al-Masirah TV channel reported that the two dead were in a strike on an oil company facility in the city.\n\nThe channel said the targets also included a power station in Sanaa’s south that was previously hit last Sunday.\n\nThe Israeli army said it had targeted Houthi military sites in Sanaa, including areas near the presidential palace, two power plants and a fuel storage facility.\n\n“The strikes were conducted in response to repeated attacks by the Houthi terrorist regime against the State of Israel and its civilians,” the military said in a statement.\n\nLate on Friday, the Houthis fired a missile that Israeli authorities said had “most likely fragmented in mid-air”.\n\nSince October 2023, the Houthis have repeatedly fired missiles and drones at Israel, claiming to be acting in solidarity with the Palestinians. Most of the Houthi attacks have been intercepted, but they have prompted retaliatory Israeli air strikes on rebel targets in Yemen.\n\nOn August 17, Israel said it targeted an energy infrastructure site in Sanaa linked to the Houthis, with Al-Masirah reporting at the time the capital’s Haziz power station was hit. The latest Israeli statement said the Haziz facility was targeted again on Sunday.\n\nA photographer working with AFP reported significant damage after the August 17 strike.\n\nBeyond attacks on Israel itself, the Houthis have also targeted ships they say are linked to Tel Aviv in the Red Sea and Gulf of Aden off Yemen.\n\nThe group broadened its campaign to target ships tied to the United States and Britain after the two countries began military strikes aimed at securing the waterway in January 2024.\n\nIn May, the rebels cemented a ceasefire with the United States that ended weeks of intense US strikes, but vowed to continue targeting Israeli ships.\n\nIsraeli Defence Minister Israel Katz said earlier this month that the Houthis would “pay with compound interest for every attempt to fire at Israel”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/242245504ecfdb8.webp",
  "retrievedAt": "2025-08-25T13:28:39.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936908/israeli-strikes-in-yemens-capital-kill-two-houthis-say",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T18:02:02.000Z"
}
