{
  "title": "Raw food exports decline 10.25pc in July - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s raw food exports saw a 10.25 per cent decline in July 2025, primarily due to a significant drop in rice shipments, marking the first downturn after 19 consecutive months of growth.\n\nDespite persistent food inflation in the country, the demand for Pakistani raw food exports weakened, largely due to shifts in global supply dynamics.\n\nOfficial figures from the Pakistan Bureau of Statistics revealed that rice exports were the main contributor to this decline. Shipments of rice dropped by 18.29pc year-on-year, largely due to reduced exports of both basmati and non-basmati varieties.\n\nSpecifically, the quantity of basmati rice exports fell by 42.72pc year-on-year, with its value decreasing by 39.74pc. On the other hand, exports of non-basmati rice recorded a slight decline of 0.76pc in value but saw a 34.11pc increase in quantity during the same period.\n\nDespite the drop in overall rice exports, new markets, including Bangladesh, have begun importing Pakistani rice, highlighting the sector’s growth potential. The rice industry remains a major contributor to Pakistan’s exports, especially to the European Union (EU) and the United Kingdom (UK).\n\nRice exports fall by 18.29pc, while those of meat and fruit rise\n\nAccording to the Trade Development Authority of Pakistan (TDAP), Pakistan capitalised on the opportunity created by India’s export ban on non-basmati white rice in July 2023. Pakistan’s competitive pricing and quality, especially in non-basmati varieties like IRRI-6, allowed the country to meet the gap in West Africa, where demand surged from countries like Benin, Ghana, and Ivory Coast.\n\nHowever, India’s decision to lift the export ban in September 2024 and remove the minimum export price (MEP) in October 2024 has intensified competition. West African buyers, particularly those in price-sensitive markets like Benin, are likely to return to Indian rice, which is more competitively priced. Despite this, Pakistan retains a foothold in East African markets such as Kenya and Mauritius, where white rice is preferred.\n\nThe TDAP plans to consolidate its presence in West Africa through a rice roadshow in Ghana, Ivory Coast, and Senegal from August 24 to September 3, 2025. The roadshow will feature 28 top Pakistani rice companies and will focus on promoting Pakistan’s rice quality, competitive pricing, and reliable supply chains.\n\nOther export trends\n\nDespite the overall decline in raw food exports, some sectors showed positive growth. Meat exports, for instance, increased by 9.80pc in July FY26 compared to the same period last year, driven by strong demand from the Gulf Cooperation Council (GCC) countries, particularly the UAE, Saudi Arabia, and Qatar. In FY24, Pakistan exported 123,419 tonnes of meat worth $512 million, with beef making up the majority of the exports.\n\nThe Meat Export Strategy 2023-27, which focuses on compliance, branding, and market expansion, is expected to support growth in this sector.\n\nMeanwhile, vegetable exports saw a sharp decline of 44.95pc in July, primarily due to reduced shipments of onions, potatoes, and tomatoes. On the other hand, fruit exports rose by 43.63pc, providing some relief. Exports of fish and fish products also recorded an increase of 18.60pc during the month.\n\nIn FY25, overall food exports fell by 3.44pc, totalling $7.12bn compared to $7.38bn in the previous year, further reflecting the challenges faced by the food export sector.\n\nDomestic impact\n\nDomestically, consumers have been facing rising prices for food items, particularly sugar, vegetables, and meat, due to supply-demand gaps. In the past three years, the cost of buffalo meat has nearly doubled, from Rs700 per kg to Rs1,600 per kg. Chicken prices have also surged, rising from Rs500 to Rs700 per kg.\n\nWith the decline in raw food exports, the government will need to address both domestic inflation and international competitiveness to ensure long-term stability in the food export sector.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:28:55.307Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936368/raw-food-exports-decline-1025pc-in-july",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:01.000Z"
}
