{
  "title": "8 more killed in DI Khan as rains continue to batter KP, taking province’s death toll to 406 - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least eight people were killed as heavy downpour lashed Khyber-Pakhtunkhwa’s Dera Ismail Khan district, taking the total rain-related death toll in the province since August 15 to 406, Rescue 1122 said on Sunday.\n\nRecord rains in KP, which started on August 15, have wreaked havoc on different parts of the province. Last week, the provincial government declared an emergency as torrential rains ravaged homes, displaced families, and left a trail of destruction across Buner, Swat, Shangla, Mansehra, and beyond.\n\nOn Thursday, the KP Provincial Disaster Management Authority (PDMA) issued an advisory, forecasting widespread rains in the province from August 22 to 26.\n\nDI Khan Rescue 1122 spokesperson, in a statement, said that “torrential rains claimed the lives of eight people in DI Khan last night,” while 48 people were injured in roof collapse incidents across the city, as per a PDMA report.\n\nAccording to the Rescue 1122 statement, “heavy rains and strong winds caused widespread infrastructure damage as multiple incidents of damage to trees, walls, and solar panels were reported.”\n\nRescue 1122 teams were “actively engaged in rescue operations in the affected areas”, said the statement, as all the injured people were rushed to nearby hospitals.\n\nRescue teams were working to clear out debris from the damage caused by the heavy deluge, the statement added.\n\nDetailing rescue efforts, the District Emergency Officer Engineer Fasihullah said, “Our top priority is the protection of citizens, and we are utilising every available resource in the rescue operation”.\n\nAccording to the latest data issued by KP PDMA, last night’s rains in DI Khan have taken the province’s rain-related death toll since August 15 to 406, which includes 305 men, 55 women and 46 children.\n\nDistrict Buner’s death toll has risen to 237, while Swabi has recorded 42 deaths due to flash floods till now, according to PDMA. Mansehra reported 25 deaths in flash floods, landslides and roof collapse incidents. Another three people lost their lives in Battagram due to flash floods.\n\nAbbottabad and Noshwera reported two deaths each, the PDMA report said.\n\nMardan, Upper Kohistan, Torghar, and South Waziristan recorded one death each.\n\nThe PDMA report said that 247 people have been injured in rain-related incidents across the province, out of which 175 are men, 38 women, and 30 children. The highest number of injuries was reported in Buner at 128.\n\nSince August 15, a total of 3,526 houses have been damaged due to rain and flash floods, including 577 that were destroyed completely.\n\nThe number of cattle that perished during the rain was 5,727, according to the report.\n\nPDMA spokesperson has advised the public to contact the authority’s helpline at 1700 in case of any emergency or weather updates.\n\nPDMA’s emergency operation centre remains fully functional, the spokesperson added.\n\nPTI Chairman Barrister Gohar Ali Khan, while speaking to Dawn.com on Saturday, assailed the federal government for its “inadequate support” to KP, particularly Buner.\n\n“Centre only provided six things to Buner: 200 tents, 98 ration packages, five generators, five dewatering pumps, 400 blankets and 500 kgs of medicine”, he claimed, saying that, “This is nothing”.\n\nGohar also appealed to the Centre to provide the people of KP relief from electricity bills at this “difficult time”.\n\nIn a related development, Bahrain’s Interior Minister, Lieutenant General Rashid bin Abdullah Al Khalifa, held a telephonic conversation with Interior Minister Mohsin Naqvi today to convey his sorrow over the loss of lives caused by rains and floods in Pakistan.\n\nOn Friday, the Nat­ional Disaster Management Authority (NDMA) issued a red alert, urging provincial and district administrations to brace for pot­­ential flooding as a fresh monsoon spell has been forecasted to lash the country from Aug 23 to 29.\n\nAccording to NDMA data, at least 788 people have died and over 1,000 have been injured in rain-related incidents and flash flooding since the start of the Monsoon season on June 25.\n\nMonsoon rains, which fall across the region from June to September every year, continue to lash many parts of the country. Starting in late June, Monsoon rains have wreaked havoc across the country in the past month by triggering deadly floods, landslides and displacement, particularly in vulnerable, poorly drained, or densely populated areas.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2416513315c0b85.jpg",
  "retrievedAt": "2025-08-25T13:28:40.330Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936874/8-more-killed-in-di-khan-as-rains-continue-to-batter-kp-taking-provinces-death-toll-to-406",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T07:35:07.000Z"
}
