{
  "title": "Five killed in New York state tourist bus crash - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: Five passengers aboard a tourist bus were killed when their driver got distracted and crashed on a New York state highway, police said. The wreck happened 40 kilometers east of Buffalo as the tourists headed back to New York City after visiting Niagara Falls.\n\nThe passengers were of Indian, Chinese and Filipino origin, authorities said.\n\n“It’s believed the operator became distracted, lost control, over corrected and ended up… over there,” said New York state police commander major Andre Ray at the scene Friday evening, giving the toll for the first time.\n\nNo one else was in a life-threatening condition, Ray said. Several passengers received medical treatment and were released. Fifty-four people were on the bus when it crashed and no children were killed, US media reported, contradicting an earlier police briefing.\n\nSix Chinese citizens were aboard the bus, China’s state broadcaster CCTV said quoting the Chinese consulate in New York. Five were treated for minor injuries and discharged, while the sixth was undergoing surgery. The bus had traveled to Niagara Falls, on the border with Canada, for the day and was heading home when the accident took place on a highway near Pembroke.\n\n“Mechanical error was ruled out as well as impairment or intoxication,” said Ray, who added that no charges had been brought. Translators were sent to the scene to help communicate with the victims.\n\nEight helicopters were involved in the rescue effort, Margaret Ferrentino, president of Mercy Flight, a nonprofit provider of air ambulance services, said.\n\n“The driver is alive and well — we’re working with him. We believe we have a good idea of what happened, why the bus lost control. We just want to make sure that all the details are thoroughly vetted,” a police spokesman said earlier.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/24095153e7a3c14.jpg",
  "retrievedAt": "2025-08-25T13:28:51.648Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936531/five-killed-in-new-york-state-tourist-bus-crash",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:14.000Z"
}
