{
  "title": "SMOKERS’ CORNER: THE MYTH OF POPULIST UPRISINGS - Newspaper - DAWN.COM",
  "author": null,
  "content": "Populists and their supporters often claim they are ‘fighting against the elites.’ In at least three major cases, this so-called ‘fight’ was fought on the streets and caused serious damage to government and state properties.\n\nThese include the January 6, 2021 attack by Donald Trump’s supporters on the Capitol Building in Washington DC; the February 8, 2022 attack on the National Congress Palace and the Supreme Court building in Brazil’s capital Brasília by supporters of Jair Bolsonaro; and the May 9, 2023 attacks on government and military facilities in Pakistan by supporters and leaders of Imran Khan’s party.\n\nTwo presidents (Trump and Bolsonaro) had lost re-election bids, and one former prime minister (Khan) had been arrested on corruption charges a year after he was ousted as PM through a no-confidence vote in the parliament. All three lamented that certain political and state elites had conspired to oust them.\n\nAfter their ouster, they were accused of inciting their supporters to create havoc by striking against the ‘elites’ who had allegedly engineered their exit. Trump managed to dodge his accusers and return to the White House in 2024. But Khan has been in jail for over two years now, serving two prison sentences and facing additional cases.\n\nHe’s been barred from contesting elections for at least five years. Bolsonaro is under house arrest and facing a trial in which he can serve a 20 year (or more) prison sentence. He cannot contest an election till 2030.\n\nFrom Washington DC and Brasília to Islamabad, populist uprisings have been framed as revolts of the people against ‘corrupt elites.’ In truth, these were clashes between rival elites, each cloaking its power struggle in the language of mass resistance\n\nTrump’s survival in this regard — and his somewhat miraculous return to power — was mostly due to the manner in which his opponents understood his defeat in 2020. Despite Trump’s victory in 2016, they continued to comprehend Western democracy as being a self-correcting system that had course-corrected itself when Trump lost his re-election bid in 2020. To them, he was likely to slip into oblivion. They saw Trump’s first term (2016-2020) as a temporary bout of madness within American democracy. This was a naive analysis.\n\nAccording to social physiologists J.P. Forgas and W.D. Crano, after populists acquire power, the movements that carried them into power may continue unabated, driven mostly by the ‘tribal’ allegiances and moral fervour of their followers.\n\nPopulist leaders who manage to get into power are aware of this. That’s why their rhetoric and actions don’t really change even when they become presidents or prime ministers. They want the movements to survive. Seeing themselves as ‘outsiders’, they are never able to feel secure in power. They keep their movements going so they can fall back on them if and when they’re ousted.\n\nSince the movements that carry the populists to power remain active, they (the movements) become willing conduits of the reactive narratives of the ousted populists. The movements provide the populists foot soldiers for their ‘fight’ against the ‘corrupt elites’ that had ousted them. Trump, Bolsonaro and Khan all believed that the riots that they allegedly triggered would compel nervous state elites to restore them.\n\nHowever, once the riots were brought under control, the state and the new governments in Brazil and Pakistan became aware of the role populist movements can play even after the core leaders of the movements had fallen. Therefore, in Brazil and Pakistan, such movements began being systematically dismantled, whereas Trump’s movement (‘Make America Great Again’) was allowed to regroup and regenerate itself.\n\nAll three movements discussed here claimed to be anti-elite. To Trump, the elites were the ‘deep state’, ‘establishmentarian politicians’ and ‘liberals’ (especially in the Democratic Party), and moderates within his own Republican Party. To Bolsonaro, mainstream leftist parties, secularists and the Supreme Court were the ‘evil elites.’ To Khan, ‘corrupt’ mainstream parties, ‘khooni liberals’ [murderous liberals] and, later, some Supreme Court judges and the military, were the detested elites.\n\nIn Brazil and Pakistan, those supporting Bolsonaro and Khan saw the February 2022 and May 2023 violence as ‘middle class uprisings’ against ruling elites, whereas in the US, those who were ransacking the Capitol Building believed a ‘people’s revolution’ was underway.\n\nHowever, in the early 1990s, the American historian Christopher Lasch had explained populism as “the revolt of the elites.” The American anthropologist Arjun Appadurai expanded Lasch’s observation by writing that, if the 20th century was an era of ‘the revolt of the masses’, the 21st century has been the era of the ‘revolt of the elites.’\n\nSuch observations bother populists and their supporters. They like to be identified as the ‘masses’ or at least as a significant part of the masses. They really aren’t — considering that the term masses is usually identified with social and economic segments that are below the upper and the middle classes.\n\nAs a term, ‘masses’ was refigured by the middle classes in Europe and the US during the height of the Industrial Revolution in the 19th century to mean the millions of people who began thronging urban centres to work in the ever-growing number of factories and lived in cramped conditions (slums). The ‘masses’ were not involved in the populist uprisings discussed here. Those who were at the forefront of the uprisings were what Appadurai calls the “new elite”, which was battling the established elites for political power.\n\nWhen populists succeed in becoming presidents and prime ministers, an ‘alternative elite’ begins to take shape. It is largely given momentum by those wealthy businesspeople and sections of the middle classes that have developed tense social and political disagreements with other sections of the business and middle classes.\n\nModern-day populism is a fight between elites. So, during the three uprisings we’ve discussed here, when an alternative elite lost power, its leaders and supporters poured out not to ‘save democracy’, or carry on some noble mission. They rioted to save the power that their section of the elite had managed to grab, but then had lost.\n\nPublished in Dawn, EOS, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a822fa375a3.jpg",
  "retrievedAt": "2025-08-25T13:28:42.427Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1933832",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:44:05.000Z"
}
