{
  "title": "Indonesia turns down ear-splitting ‘haram’ street parties - World - DAWN.COM",
  "author": null,
  "content": "People in an Indonesian village watched as a tower of loudspeakers mounted on a truck rumbled through their usually serene home, blasting a thumping bass loud enough to crack windows.\n\nLoudspeaker towers are commonplace on Indonesia’s main island of Java, blaring a repetitive mix of electronic tunes and traditional folk music at street parties, but they have drawn the ire of local authorities and calm-seeking neighbours.\n\nThe loudspeaker stacks have proven so disruptive that officials this month have restricted their use while religious bodies have declared excessive and damaging sound from them to be “haram”, or forbidden under Islamic law.\n\n“The sound is booming from 1pm to 3am. They play loud music and drink alcohol,” Ahmad Suliyat, a resident of Ngantru village in East Java province, told AFP.\n\n“It’s really disturbing.” Indonesians in East Java have shared videos on social media of cracked walls, falling roof tiles and damaged stores caused by the noise impact known as “sound horeg”, which loosely means to move or vibrate in Javanese.\n\nThe online backlash forced authorities in East Java to issue an order this month limiting noise levels and specifying the times and locations loudspeakers can be used. “It was made for health and security reasons. The noise level must be regulated so it will not disturb the public peace and order,” East Java governor Khofifah Indar Parawansa told AFP.\n\nEar-splitting noise has been shown to have adverse health consequences, including a higher risk of heart conditions for those exposed.\n\nAnd Indonesia’s loudspeaker towers, popular for little more than a decade in the world’s most populous Muslim nation, have had dire consequences for some who attend the deafening street gatherings.\n\nA woman died this month after allegedly suffering cardiac arrest caused by loudspeaker towers at a carnival she attended, local media reported, while there has been an increase in hearing problems among those attending the events.\n\nThe East Java government has capped sound system levels at 120 decibels, while mobile units used in parades or protests are limited to 85 decibels.\n\nMobile units are also banned from being used near schools, hospitals, ambulances and places of worship that are in session.\n\nIn July, a local Islamic council issued a religious edict that said excessive sound at parties that is capable of causing damage is forbidden by religion.\n\n“The use of a sound system excessively, especially during a wedding convoy, or any other events that cause noise, disturb road users, or make people neglect worshipping, is haram,” read the fatwa.\n\nLocals typically rent the speaker towers for weddings, circumcisions and Independence Day events – all celebrations that can last until dawn.\n\nSome, like Daini, who goes by one name like many Indonesians, believe the loudspeakers are a local tradition that should be kept.\n\nShe glanced at her cracked window, held together by duct tape, as music blared from the truck in Ngantru.\n\n“The glass cracked during a sound horeg event last year. But that’s OK, people here like loud events,” said the 61-year-old.\n\nBut loudspeakers have continued blasting above the new limits, due to lax enforcement by local authorities.\n\nAfter the rules were issued, an AFP journalist heard loudspeaker towers blaring music at an East Javan event as authorities watched on.\n\nThe World Health Organisation says sound at 85 decibels and above can cause hearing damage over time, and anything above 120 decibels can cause immediate harm.\n\nSome Indonesians posted screenshots online of apps registering loudspeaker sound levels as high as 130 decibels.\n\nOperators of loudspeaker towers argue they are responding to demand that generates revenue for local businesses.\n\n“I believe most people who dislike sound horeg are not from here,” David Stevan Laksamana, a 40-year-old loudspeaker rental owner in Malang, told AFP.\n\n“In Malang alone, it employed tens of thousands of people. This business is helping the economy.” Others who cannot stand the disruptive street parties fear reporting them, with some loudspeaker tower owners reportedly parking outside complainants’ houses to blare music for hours.\n\n“I never complain to the village head,” said Ahmad.\n\n“I just keep quiet. I’m afraid of intimidation if I say anything. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2414180530c82b7.jpg",
  "retrievedAt": "2025-08-25T13:28:39.211Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936883/indonesia-turns-down-ear-splitting-haram-street-parties",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T09:25:51.000Z"
}
