{
  "title": "Sukkur-IBA, Bolan University to set up MDCAT centres in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After intervention of the Pakistan Medical and Dental Council (PMDC), Sukkur-IBA University and Bolan University of Medical and Health Sciences have decided to establish Medical and Dental Colleges Admission Test (MDCAT) centres in Islamabad for the candidates holding domiciles of Sindh and Balochistan, respectively.\n\nThis decision will facilitate thousands of students who reside in Islamabad but hold domiciles of Sindh or Balochistan. Previously, they had no choice but to travel to their respective provinces to appear in the test.\n\nAfter receiving assurances from the universities, the PMDC has included Islamabad as a city of choice for MDCAT candidates from both provinces.\n\nIt is worth mentioning that the PMDC is registering candidates through its website, with August 25 set as the last date for registration with the normal fee. So far, around 100,000 candidates have registered. The PMDC has also allowed candidates to update their registration, enabling those from Sindh and Balochistan who initially selected test centres in their provinces to now opt for Islamabad instead.\n\nJacobabad also designated as new test centre; students can update their registration on PMDC portal by tomorrow with normal fee\n\nAccording to the PMDC notification, both universities will establish test centres at Islamabad.\n\n“Additionally, Jacobabad has also been designated as test centre for MDCAT- 2025 in Sindh. All interested candidates may visit PMDC website and register for the MDCAT-2025 through online portal,” the notification states.\n\nIt is noteworthy that parents and candidates belonging to Sindh and Balochistan but residing in Islamabad had appealed to the PMDC to intervene, as they were otherwise compelled to travel long distances merely to appear in the MDCAT—a test that does not guarantee admission in medical or dental colleges.\n\nCandidates from Balochistan also pointed out that they would have to travel by air, since it is currently unsafe to travel by road due to the involvement of Indian-sponsored groups.\n\nPassing the MDCAT is mandatory for admission to medical and dental colleges in Pakistan.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:52:50.216Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936551/sukkur-iba-bolan-university-to-set-up-mdcat-centres-in-islamabad",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:42:55.000Z"
}
