{
  "title": "From celebration to fear: How monsoons now haunt Tharparkar - Pakistan - DAWN.COM",
  "author": null,
  "content": "• In past eight years, lightning strikes in desert region have killed over 350 people, thousands of livestock\n• Residents demand installation of lightning arresters, protective infrastructure in villages\n• Activist alleges CSR funds not being spent by coal companies for protection of locals\n• SECMC says Met officials’ research found no scientific link between coal mining and rising number of lightning strikes\n\nMITHI: The desert region of Tharparkar, where rainfall was once celebrated as a blessing, has in recent years turned into a land of fear and tragedy. For generations, the monsoon was welcomed with folk songs, dances, children playing on sand dunes and peacocks spreading their feathers. But now, whenever clouds gather over the arid land, villagers rush indoors, farmers abandon their fields, and whispered prayers ask that the lightning may spare them.\n\nAccording to official data from the District Disaster Management Authority (DDMA), more than 350 people have lost their lives in lightning strikes across Tharparkar since 2018, while thousands have been injured. The desert has also seen the death of thousands of livestock, including goats, sheep, cows, buffalo and camels.\n\nBetween 2023 and 2025 alone, 60 people were killed, over 50 injured and more than 1,600 animals perished. Officials concede that the actual figures are likely to be much higher, as many incidents in remote pastures and forests are never reported.\n\nThe tragedies have been numerous and devastating. Two years ago, six young Hindu devotees walking to the annual Dada Parbrahm fair near Mithi were struck by lightning and died. Last year, an entire family in the village of Akro near Nagarparkar was wiped out in a single strike. And just last week, four more people were killed in Kloi, Modasio and nearby villages, while days earlier a motorcyclist lost his life after being hit on the road in Nagarparkar.\n\n‘Coal projects destabilise Thar’s climate’\n\nLocal journalists and activists say such incidents were rare in the past but have risen sharply since 2018–19.\n\nSenior journalist and activist Khatuo Jani told Dawn that the expansion of coal projects has disturbed Thar’s fragile environment.\n\n“The open-pit mining in Blocks I and II, the heavy chimneys of coal-fired power plants run by Sindh Engro Coal Mining Company, and the gases they release have polluted the air and destabilised the climate. Lightning incidents were once rare in villages, now they are frequent and deadly. Once rain was joy, now it is pain, fear and even death,” he said.\n\nHe added that although the Climate Hit Act of 1958 provides for compensation of Rs200,000 to Rs500,000 for victims, no families in Thar have received support for their losses. He further pointed out that a team from Mehran University had visited the area but avoided examining the mining and power plant sites.\n\n“Both Block I and Block II projects generate billions, yet their Corporate Social Responsibility (CSR) initiatives have failed to address this crisis. Coal royalties and CSR budgets exist, but they are not being spent on protecting communities,” Mr Jani said.\n\nAccording to him, the Thar Foundation should be using CSR allocations for installing earthing systems, early-warning mechanisms, awareness campaigns and community-level rescue training, but nothing meaningful has been done. “Billions flow into Thar in the name of coal, but the poor remain unprotected while human lives and livestock are lost every monsoon,” he added.\n\nCivil society groups have also raised an alarm. Comrade Nand Lal Malhi, chairman of the Thar Action Forum, said that during the current monsoon alone lightning has struck more than 10 places, killing three people and hundreds of animals. He recalled that in 2023 a conference held in Mithi had urged the Sindh government and environmental authorities to install lightning arresters across Thar’s 2,500 villages.\n\n“Two years have passed and no action has been taken. If such measures had been implemented, we would not be facing losses on this scale today,” he said, urging the provincial government to use coal royalties and CSR funds if budgetary resources were insufficient.\n\nAijaz Bajir, media coordinator of the Thar Citizen Forum, said that most incidents are occurring around Coal Block II, where mining and power projects release large volumes of gases into the atmosphere.\n\n“The District Council had even written to Mehran University’s vice chancellor requesting research, but no meaningful study has been carried out. Companies working here are earning billions yet have not bothered to investigate this growing disaster,” he said.\n\nExpert calls for installtion of earthing rods\n\nExperts, too, believe climate change is a major factor. Dr Riaz Din, associate professor of Electrical Engineering at NED University, explained that lightning is a common global phenomenon but has intensified in recent years.\n\n“In the United States, some 250 million lightning strikes occur annually, causing around $2 billion in damage. But in Thar, an open desert with little awareness or protection, the consequences are devastating,” he said, stressing that installing earthing rods could greatly reduce casualties and protect livestock.\n\nCivil society organisations have attempted small interventions. Ali Akbar Rahimoon, CEO of Aware Organisation, said his organisation had installed simple earthing rods in ten villages near Chachro.\n\n“Since then, no major damage has occurred in those villages. The current from strikes is diverted safely into the ground. But in areas without such rods, people live in constant fear, farmers abandon their fields and rush home as soon as thunder begins,” he said and urged the Sindh government, PDMA and DDMA to extend the initiative across the desert and introduce modern early-warning systems.\n\nResidents, meanwhile, accuse their lawmakers and local government of indifference. Billions are spent on Annual Development Programme (ADP) and Sustainable Development Goals (SDG) budgets, but nothing is done to protect them from lightning,” said villagers in Nagarparkar.\n\nThey demanded that upcoming budgets allocate resources for lightning arresters in every town and village, so that no more human lives and livestock are lost.\n\n‘No scientific link between coal mining and lightning strikes’\n\nWhen contacted, Sindh Engro Coal Mining Company (SECMC) and Thar Foundation said in a statement that the meteorological department had conducted research and concluded that there was no scientific link between coal mining in Thar and the rising number of lightning strikes in the desert.\n\nIt said officials underscored this position during Sindh Energy Minister Nasir Hussain Shah’s recent visit to Tharparkar, where concerns had been raised by local groups about possible connections between mining activity and extreme weather events.\n\nInternational studies, including research from China, also suggest that while climate change is intensifying lightning incidents worldwide, no direct correlation has been established with coal mining operations.\n\n“The Thar coal projects contribute to Sindh’s economy through royalty payments made to the provincial government. In addition, the Thar Foundation — established to support the desert region — channels its own CSR funds into programmes aimed at uplifting local communities.\n\nThese initiatives include healthcare, education, livelihood generation, women’s empowerment, and other development projects,” the statement concluded.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68aa5902e82af.gif",
  "retrievedAt": "2025-08-25T13:28:47.270Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936484/from-celebration-to-fear-how-monsoons-now-haunt-tharparkar",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:20.000Z"
}
