{
  "title": "Trump deploys troops in Washington’s safest sites - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Hundreds of National Guard soldiers in military fatigues and combat boots mingled with tourists, posed for selfies, and treated themselves to ice cream from food trucks along Washington’s National Mall, one of the safest parts of America’s capital.\n\nOn occasion an angry local would hurl verbal abuse at them, but the soldiers simply shrugged and carried on what appeared to be an undemanding assignment. Outside the National Museum of African American History and Culture, five members of the West Virginia National Guard were standing on the street corner far away from the city’s crime hot spots.\n\n“It’s boring. We’re not really doing much,” said Sergeant Fox, who declined to give his first name. Fox is among almost 2,000 troops, including 1,200 from six Republican-led states, who are being deployed in Washington as part of an extraordinary militarisation inside the Democratic-led city.\n\nThe soldiers, some of whom said they did not get involved in arrests, are officially in Washington to support a federal crackdown on what President Donald Trump calls a crime epidemic. But that depiction appears to run counter to the fact that crime rates overall have shrunk in recent years.\n\nCriticism\n\nThat disconnect, combined with the troop concentration near the Washington Monument, the Lincoln Memorial and in view of the US Capitol, highlights criticism by the city’s Democratic leaders that this massive deployment is more a show of power by Trump, rather than a serious effort to fight crime.\n\nDemocrats say massive deployment is more a show of power by Trump, rather than a serious effort to fight crime\n\nWashington Mayor Muriel Bowser said this week she did not think the arrival of troops was about tackling crime. She also expressed concern about the presence of “an armed militia in the nation’s capital.” The soldiers seen were not armed, but the Pentagon said on Friday the troops will soon be on mission with their service-issued weapons.\n\nBy contrast with central Washington, residents of Ward 8 in the city’s southeast — the area with the highest crime rate — said there was not a guardsman in sight. With the ward’s murder rate dwarfing that of most other neighborhoods, many locals said they would welcome troops on their streets.\n\n“I haven’t seen any. This is where they need to be,” said Shawana Turner, 50, a housing case manager on a Ward 8 street. The Joint Task Force for the District of Columbia, which is leading the crime crackdown, said where National Guard troops are deployed is based on requests from law enforcement agencies.\n\nAbigail Jackson, a White House spokeswoman, said teams of federal law enforcement officials are making arrests in Washington’s highest crime areas every night. “The National Guard is not making arrests at this time, their role is to protect federal assets — including law enforcement officers — and provide a visible law enforcement presence,” she said.\n\nThe troops are one element of a surge of local and federal law enforcement agents in Washington, including the FBI, who have conducted active arrest operations since Trump announced earlier this month that he was federalising law enforcement responsibility in Washington. Deploying troops on American streets is rare and controversial. National Guard have been sent to Washington in recent years, to help bolster security at presidential inaugurations and during protests, including the January 6, 2021 riot at the US Capitol by Trump supporters.\n\nPublished in Dawn, August 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68aa5df8798c5.gif",
  "retrievedAt": "2025-08-25T13:28:49.379Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936529/trump-deploys-troops-in-washingtons-safest-sites",
  "dateList": "2025-08-24",
  "date_published": "2025-08-24T00:43:14.000Z"
}
