{
  "title": "Global webinar denounces India’s colonial attitude to muzzle freedom of press in IIoJK",
  "link": "https://www.app.com.pk/national/global-webinar-denounces-indias-colonial-attitude-to-muzzle-freedom-of-press-in-iiojk/",
  "date_published": "2020-10-07T15:16:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Oct 07 (APP): World-fame experts belonging to various sections of life at a webinar hosted on Wednesday lambasted Modi led fascist regime in India for using colonial tactics to gag the press and silence the critical voices presenting Indian atrocities into the international limelight.\nThe webinar titled “Kashmir siege knocking at the doors of world conscience” was hosted by Kashmir Institute of International Relations (KIIR) and joined by Qazi Shibli editor in chief of digital magazine Kashmiyate from Srinagar, Mark McDonald international criminal lawyer from UK, British parliamentarians Barrister Imran Hussain, Muhammad Yasin, Mr. Jonathan Gullis, Mr, Anthony Josph Lloyd’, Catherine Constantinidies South Africa, and Ana Lundrinda from Geneva. Whereas the even was moderated by KIIR chief Altaf Hussain Wani.\nIn his initial remarks the KIIR chairman gave a detailed account of how cunningly the Indian state was busy in silencing the critical voices who have time and again exposed the Indian state terrorism in Kashmir. He said that since 5 August 2019, attempts to muzzle the freedom of the press by the Indian authorities have been on the rise.\nReferring to new media policy enforced in the region Mr. Wani said, “It is actually part of the pattern that media-men have been witnessing since August last year”. The new media policy he said was put in place to silence the journalist fraternity of Kashmir, which he said has played a crucial role in bringing Indian atrocities to international limelight during the year-long siege.\nSpeaking on the occasion Mr. Shibli who was released recently after 9-month long illegal detention said that the Indian authorities use a mix of harassment, intimidation, surveillance and online information control to silence critical voices to conceal the crimes being committed against Kashmiris by the Indian state and its forces in the restive region.\nNarrating the story of his detention, threats and harassment faced by the Kashmiri journalist fraternity Mr. Shibili said that it was high time that the international community should come forward to safeguard the lives of journalists and their profession.\nOther speakers while paying eulogizing tribute to the bravery of Kashmiri journalists expressed their serious concerns on the ongoing human rights violations in Indian occupied Kashmir.\nThey observed that the continued violations and atrocities committed by Indian forces in Kashmir can no longer go unaccounted for.",
  "retrievedAt": "2025-08-11T19:52:36.354Z"
}
