{
  "title": "Researchers identify highly effective antibodies against Covid-19",
  "link": "https://www.app.com.pk/national/researchers-identify-highly-effective-antibodies-against-covid-19/",
  "date_published": "2020-10-07T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 07 (APP): German researchers have identified highly effective antibodies against SARS-CoV-2 (Covid-19) and are now pursuing the development of a passive vaccination.\nThe study, published in the journal Cell, also discovered that some SARS-CoV-2 antibodies bind to tissue samples from various organs, which could potentially trigger undesired side effects.\nInitially, the scientists from Germany’s Charite hospital and German Neurodegenerative Diseases Centre (DZNE) isolated almost 600 different antibodies from the blood of individuals who had overcome Covid-19, Medical Daily reported .\nBy means of laboratory tests, they were able to narrow this number down to a few antibodies that were particularly effective at binding to the virus. Next, they produced these antibodies artificially using cell cultures.\nThe identified so-called neutralizing antibodies bind to the virus, as crystallographic analysis reveals, and thus prevent the pathogen from entering cells and reproducing.\nIn addition, virus recognition by antibodies helps immune cells to eliminate the pathogen.\nStudies on hamsters – which, like humans, are susceptible to infection by SARS-CoV-2 – confirmed the high efficacy of the selected antibodies:\n“If the antibodies were given after infection, the hamsters developed mild disease symptoms at most. If the antibodies were applied preventively – before infection – the animals did not get sick,” said study author Jakob Kreye from DZNE.\nTreating infectious diseases with antibodies has a long history.\nFor Covid-19, this approach is also being investigated through the administration of plasma-derived from the blood of recovered patients.\nWith the plasma, antibodies of donors are transferred.",
  "retrievedAt": "2025-08-11T19:52:36.560Z"
}
