{
  "title": "NA Speaker pays tribute to martyred police personnel",
  "link": "https://www.app.com.pk/national/na-speaker-pays-tribute-to-martyred-police-personnel/",
  "date_published": "2025-08-10T15:09:50+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP):National Assembly Speaker Sardar Ayaz Sadiq on Monday paid heartfelt tribute to the brave officers and personnel of the Pakistan Police who embraced martyrdom in the line of duty, marking Police Martyrs Day with solemn reverence.\n\nHonoring the fallen heroes, in his police martyrs day message, Speaker Sadiq acknowledged their unwavering commitment to safeguarding the nation and protecting citizens across all regions. “Their sacrifices are a powerful testament to the police force’s resolve in upholding peace and ensuring the safety of the people of Pakistan,” he stated.\n\nExpressing solidarity with the families of the martyrs, the Speaker assured them that the nation stands united in remembering and honoring the legacy of these courageous individuals. “Their sacrifices will never be forgotten,” he affirmed.\n\nSpeaker Sadiq lauded the role of police personnel in the fight against terrorism, noting that over 8,000 officers have laid down their lives in service to the motherland.\n\nHe praised the professionalism and dedication of the Pakistan Police, which has earned global recognition—including international medals and awards at the World Police Summit 2025.\n\nCommending the integration of modern technology in policing, the Speaker emphasized its importance in effective crime prevention and maintaining law and order.\n\nHe also appreciated the collaborative efforts of the police with other security and emergency services in ensuring peace and responding to natural disasters and critical situations.\n\nConcluding his remarks, Speaker Sadiq said that every police officer and personnel entrusted with the protection of the country is a source of pride for the entire nation.",
  "retrievedAt": "2025-08-10T10:13:18.906Z"
}
