{
  "title": "IG Rizvi leads tributes on police Martyrs’ Day: \"our martyrs are a beacon of courage and pride\"",
  "link": "https://www.app.com.pk/national/ig-rizvi-leads-tributes-on-police-martyrs-day-our-martyrs-are-a-beacon-of-courage-and-pride/",
  "date_published": "2025-08-10T15:09:50+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP):Islamabad Capital Territory (ICT) Police observed Police Martyrs’ Day with solemn tributes and heartfelt remembrance for the 67 valiant officers who laid down their lives in the line of duty.\n\nThe day began with Quran recitation ceremonies held at various mosques, including at the Police Lines Headquarters, where floral wreaths were also laid at the Yadgar-e-Shuhada (Martyrs’ Memorial).\n\nA public relations officer told APP on Monday that Inspector General of Police (IGP) Syed Ali Nasir Rizvi, along with senior officers and the families of martyred personnel, paid their respects at the memorial. Candles were lit to honor the fallen heroes, while national songs and commemorative videos highlighting their sacrifices were released across digital platforms.\n\n“Police Martyrs’ Day is not just a remembrance of our fallen comrades—it is a day of renewal of our pledge to uphold the ideals they died defending,” said IGP Rizvi. “Our martyrs are a source of pride for the entire nation, and Islamabad Police remains committed to serving the public with honor, guided by the principles of sacrifice, courage, and justice.”\n\nThe day, officially marked every year on August 4, was established to commemorate the supreme sacrifices of law enforcement personnel, particularly in memory of the 2007 terrorist attack on the Police Training School in Quetta, which claimed the lives of several police cadets. Since then, Youm-e-Shuhada-e-Police has been observed nationwide to honor the legacy of thousands of police officers who gave their lives protecting the country against terrorism, organized crime, and other threats to public safety.\n\n“ICT Police salutes all martyrs of the nation and pays special tribute to the mothers who raised these brave sons,” said the spokesperson. “The legacy of their blood compels us to build a force that is people-centric, responsive, and rooted in the values of duty and sacrifice.”\n\nMultiple events are being held in Islamabad as part of the day’s observance, including special meetings with families of martyrs, prayer ceremonies, and awareness campaigns to recognize the contribution of police personnel in ensuring national security.\n\nVideos released by the ICT Police not only documented the bravery of fallen officers but also aimed to inspire the new generation of officers to carry forward the torch of selfless service.\n\n“Our resolve stands unshaken,” said IGP Rizvi. “Today, as we honor our heroes, we reaffirm our commitment to protect the citizens of Pakistan with the same courage, loyalty, and resilience.”",
  "retrievedAt": "2025-08-10T10:14:05.742Z"
}
