{
  "title": "“Pakistan’s Retaliation in May 2025 Reasserted Pakistan’s Vow on Kashmir:” Chairman Kashmir Committee",
  "link": "https://www.app.com.pk/national/pakistans-retaliation-in-may-2025-reasserted-pakistans-vow-on-kashmir-chairman-kashmir-committee/",
  "date_published": "2025-08-10T15:09:50+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP):The Institute of Regional Studies (IRS), Islamabad, hosted a high-level seminar titled “Unheard Voices of IIOJK: Six Years of Struggle after Article 370” to mark the sixth anniversary of India’s unilateral revocation of Articles 370 and 35-A that stripped Indian Illegally Occupied Jammu & Kashmir (IIOJK) of its autonomous status on August 5, 2019.\n\nParliamentarians, senior defence officials, Kashmiri leaders, and civil society representatives attended the event to honour the resilience of the people of IIOJK and reinforce Pakistan’s enduring political, diplomatic, and moral support for their right to self-determination.\n\nAddressing the seminar, Chairman Parliamentary Committee on Kashmir Rana Muhammad Qasim Noon declared Kashmir “a sacred national cause embedded in Pakistan’s ideology,” adding that true peace and stability in South Asia remain impossible without resolving the Kashmir dispute as per UN Security Council resolutions. He paid tribute to the Pakistani armed forces for their defence during the May 2025 conflict, which he said had “reshaped the regional balance”.\n\nAmbassador Jauhar Saleem, President IRS, termed India’s 2019 actions “a blatant violation of international law and an attempt at demographic engineering.”\n\nHe stressed that despite curfews, lockdowns, mass detentions, internet shutdowns and militarization, India has failed to suppress the Kashmiri identity or silence their demand for freedom.\n\nMs. Farzana Yaqoob, former AJK Minister, said Pakistan’s stance had grown more articulate and proactive on global forums.\n\nShe proposed redefining August 5 as a “Day of Courage” to honour Kashmiri resistance, and urged Pakistan to adopt legal diplomacy by pursuing international casework against Indian human rights violations in IIOJK.\n\nSpeakers including Fatehullah Khan, Sheikh Abdul Mateen, and Abdul Hamid Lone rejected India’s “constitutional terrorism” and exposed how thousands of Kashmiri civilians, activists, and political leaders continued to face arrest, torture, and extrajudicial killings. They reaffirmed that the Kashmiri struggle is one for identity and justice, not territory.\n\nThe seminar concluded with a unanimous call for recognition of August 5 as a symbol of Kashmiri resilience against oppression; unity across Pakistani civil-military institutions in advocating Kashmir’s right to self-determination and mobilising international conscience against India’s continued human rights abuses.\n\n“The Kashmiri freedom struggle mirrors other historic battles against occupation and injustice,” stated the final communique. “Like South Africa, Palestine or Bosnia — history will side with those who stand for truth and freedom. Kashmir will be free.”",
  "retrievedAt": "2025-08-10T10:13:27.898Z"
}
