{
  "title": "PM orders advance weather alert system for tourist destinations",
  "link": "https://www.app.com.pk/national/pm-orders-advance-weather-alert-system-for-tourist-destinations/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "GILGIT, Aug 4 (APP): Prime Minister Shehbaz Sharif on Monday stressed that an advanced weather alert system must be established for tourist destinations based on seasonal forecasts, and local populations should be resettled away from natural water passageways to help prevent emergencies in the future.\n\nChairing a meeting regarding the recent floods and rehabilitation work in Gilgit Baltistan, the prime minister said that keeping climate change in view, early warning systems, preparedness for relief operations, and construction of climate-resilient infrastructure in vulnerable areas should be ensured.\n\nNDMA and the Ministry of Climate Change should jointly establish a forecasting and monitoring center for Gilgit-Baltistan in the coming months, the prime minister said adding that a comprehensive system must be developed for immediate rescue and assistance in emergency situations.\n\nHe instructed NDMA to ensure close cooperation with provincial governments and relevant institutions to enhance rescue and relief efforts.\n\n“All rehabilitation measures for those affected by the recent monsoon must be completed promptly,” the prime minister said emphasizing that a survey of damage to roads and infrastructure should be conducted, and communication links in all affected areas must be restored on a priority basis.\n\nThe prime minister also expressed sorrow over the loss of lives during recent rains and floods in the area.\n\nThe prime minister, highlighting Pakistan’s minimal contribution to global emissions, the prime minister stressed that despite the fact that Pakistan contributed almost zero emissions, it was among the top ten nations most affected by climate change-induced disasters. “Despite Pakistan’s near-zero emissions, we suffer huge devastation every year due to global warming,” he noted.\n\nAppreciating the rescue operations and efforts of NDMA, PDMA, the Ministry of Communications, district administration, and rescue personnel, the prime minister directed NDMA to provide all necessary assistance to the provincial government.\n\nThe provincial administration and Chairman NDMA briefed the meeting on the losses caused by the heavy monsoon, particularly in Gilgit-Baltistan, the expected weather conditions, and actions taken so far.\n\nThe Ministry of Climate Change also informed the meeting about progress on the installation of an early warning system for Glacial Lake Outburst Floods (GLOF).\n\nIt was reported that on July 21 2025, heavy rainfall occurred due to cloudbursts in Thak-Babusar, Thor, Kundus, and Ishkoman areas of Gilgit-Baltistan, resulting in damage to tourists and local populations. Over 600 people were rescued, and damaged roads were repaired and reopened to restore connectivity.\n\nFive tent villages were established for rescue operations, and 10 helicopters along with 2 C-130 aircraft were deployed to transport stranded tourists and individuals to safe locations.\n\nThe operation involved participation from the Pakistan Army, NDMA, district administration, police, GBDMA, Rescue 1122, and health workers.\n\nThe Ministry of Communications briefed on damage to roads, bridges, and infrastructure caused by rains and floods. The prime minister instructed that all damaged infrastructure be rebuilt with climate resilience in mind.\n\nThe Ministry of Climate Change also updated the meeting on the ongoing installation of the GLOF early warning system. The prime minister directed NDMA to fully cooperate with the Ministry to complete the system installation within the next two months and ordered third-party validation of the system’s deployment.\n\nAdditionally, he instructed the Minister for Water Resources to remain in Gilgit-Baltistan to complete consultations and planning for a better water management system.\n\nFederal Ministers Engineer Amir Muqam, Abdul Aleem Khan, Attaullah Tarar, Mian Moeen Wattoo, Dr. Musadik Malik; Adviser Rana Sanaullah; PM’s Coordinator Shabbir Ahmed Usmani; Governor Gilgit-Baltistan Syed Mehdi Shah; Chief Minister Gilgit-Baltistan Gulbar Khan; Chairman NDMA Inam Haider Malik; and other senior officials and government representatives.",
  "retrievedAt": "2025-08-10T10:32:25.204Z"
}
