{
  "title": "Amir Muqam calls August 05 black day in IIOJK’s history",
  "link": "https://www.app.com.pk/national/amir-muqam-calls-august-05-black-day-in-iiojks-history/",
  "date_published": "2025-08-10T15:09:50+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Federal Minister for Kashmir Affairs & Gilgit-Baltistan and SAFRON Engineer Amir Muqam on Monday called August 05, 2019 was a sad day in the history of Indian Illegally Occupied Jammu and Kashmir (IIOJK) that day India scrapped its special status and bifurcated it into two so-called ‘Union Territories.’\n\nIn a message on Youm-e-Istehsaal (5 August 2025), the minister said that the prime objective of India’s illegal and unilateral actions of August 05, 2019 was to undermine the internationally-recognized status of IIOJK and to convert the Kashmiri Muslims into a disempowered community in their own land.\n\nEver since, Amir Muqam stated that the Indian government had taken scores of measures, aimed at changing the demographic structure and political disposition of the IIOJK. Some of the newly-introduced or modified laws, notably, pertain to issuance of domicile certificates to non-Kashmiris and ownership of land and property by the outsiders, he added.\n\n“The delimitation of electoral constituencies has also been changed and the Lieutenant Governor has been given more powers in the administrative matters,” he said.\n\nFurthermore, the minister said that the salience of Kashmiri identity, culture and language was being diluted. The Indian measures in IIOJK since August 5, 2019 constitute a breach of the UN Charter, relevant Security Council resolutions and international law, especially Fourth Geneva Convention.\n\nToday, Amir Muqam said that India was bent upon silencing every voice that challenges its occupation of IIOJK as thousands of Kashmiri leaders and activists remain behind the bars for last several years while the local media had been muzzled.\n\nHe said, “Under draconian counterterrorism and emergency laws, the Indian forces enjoy impunity to kill any person and destroy any property. Confiscation of property and demolition of houses are the latest additions to the list of India’s brutal tactics. I salute the people of IIOJK, who are facing the Indian oppression with great valor and courage.”\n\nHe said that the dismal human rights situation in IIOJK calls for the immediate attention of the international community, adding that the reports/statements by the Office of UN High Commissioner for Human Rights, OIC-Independent Permanent Human Rights Commission, UN Special Procedures, Human Rights Watch and Amnesty International had repeatedly exposed the human rights abuses in IIOJK.\n\nHe urged the international community to ask India to improve the human rights situation in IIOJK, release the political prisoners, and implement the UN Security Council resolutions.\n\nFor its part, the minister concluded that Pakistan will continue to extend its complete political, diplomatic and moral support for the Kashmiri’s struggle for realization of their right to self-determination.",
  "retrievedAt": "2025-08-10T10:11:26.439Z"
}
