{
  "title": "Hot & humid conditions persist nationwide as isolated rains expected in upper parts",
  "link": "https://www.app.com.pk/national/hot-humid-conditions-persist-nationwide-as-isolated-rains-expected-in-upper-parts/",
  "date_published": "2025-08-10T15:09:50+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP): The Pakistan Meteorological Department has forecast another day of intense heat and humidity across most parts of the country on Tuesday, with isolated rain-wind/thundershower activity expected in northern and upper regions.\n\nAccording to the forecast, hot and very humid conditions are likely to prevail in Sindh, most parts of Punjab, and Balochistan. However, some respite is expected in Upper Punjab, Islamabad, Khyber Pakhtunkhwa, and Kashmir, where rain-wind/thundershowers are predicted at isolated locations. Isolated heavy falls are also likely during this period.\n\nIn the federal capital, Islamabad, partly cloudy weather accompanied by rain-wind/thundershower is expected in the afternoon and evening hours. The surrounding areas are also likely to receive isolated heavy rainfall.\n\nIn Khyber Pakhtunkhwa, showers are likely in various districts including Chitral, Swat, Dir, Mansehra, Abbottabad, Peshawar, Kohat, Bannu, Tank, and Waziristan, among others. Upper districts may receive heavy downpours, raising concerns of urban flooding in vulnerable areas.\n\nPunjab will largely continue to experience oppressive heat and humidity. However, intermittent showers may occur in cities like Rawalpindi, Lahore, Gujranwala, Faisalabad, Sargodha, and Multan, as well as in northern areas such as Murree and Galiyat.\n\nMeanwhile, Sindh will remain under the grip of hot and humid weather. Coastal areas, including Karachi, may experience partly cloudy skies but no significant rainfall is expected.\n\nBalochistan will also witness hot and humid conditions throughout most of the day, with chances of rain and thunderstorms in Zhob, Barkhan, Khuzdar, and Mo Si Khel during the evening and night hours.\n\nIn Kashmir and Gilgit-Baltistan, partly cloudy conditions will prevail with potential for rain-wind/thunderstorm activity in isolated locations. Isolated heavy falls may also be witnessed in Kashmir.\n\nOver the past 24 hours, hot and humid conditions dominated most regions. However, rainfall with isolated heavy falls occurred in parts of the northeast Potohar region, Islamabad, and Kashmir. Significant rainfall was recorded in Rawalpindi, where New Kattarian received 68 mm, Shamsabad 31 mm, Chaklala 22 mm, Pirwadhai 19 mm, Katcheri 17 mm, and Gawalmandi 14 mm. Sialkot received 50 mm at the airport and 21 mm in the city. Mangla recorded 25 mm, Islamabad Airport 20 mm, Islamabad City 13 mm, Saidpur 1 mm, Gujrat 12 mm, Narowal 6 mm, and Jhelum 1 mm. In Kashmir, Garhi Dupatta received 23 mm of rainfall.\n\nResidents are advised to stay hydrated, avoid unnecessary outdoor activities during peak heat hours, and remain alert in rain-prone areas where waterlogging or localized flooding may occur.",
  "retrievedAt": "2025-08-10T10:11:36.524Z"
}
