{
  "title": "Kabul hosts Pakistan, China foreign ministers today - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chinese Foreign Minister Wang Yi will visit Islamabad to co-chair the sixth Pakistan-China Foreign Ministers’ Strategic Dialogue on Thursday, as Kabul hosts a trilateral meeting with Pakistan and China on counter-terrorism and other issues today.\n\n“On August 20 of this year, Mr Wang Yi, a member of the political bureau of the Chinese ruling party and foreign minister, and Mr Ishaq Dar, deputy prime minister and foreign minister of Pakistan, will travel to Kabul to attend a trilateral meeting,” the Afghanistan foreign ministry said in a statement on Tuesday.\n\nThe discussions are expected to cover progress on earlier commitments, including counter-terrorism cooperation, extending the China-Pakistan Economic Corridor (CPEC) to Afghanistan, and strengthening regional trade and connectivity.\n\n“The participants of the meeting are expected to exchange views on the future of relations based on common interests, mutual understanding, and broad cooperation,” the ministry said. The gathering, the first of its kind hosted in Afghanistan since the Taliban took control of Kabul, will bring together Wang, Dar and Afghan Acting Foreign Minister Amir Khan Muttaqi for a day-long dialogue.\n\nChinese diplomat to visit Islamabad on Thursday to co-chair high-level moot\n\nMr Wang will also hold bilateral meetings with senior Taliban leaders on political and economic cooperation. The last round of trilateral talks among the three countries’ foreign ministers was held in Beijing on May 21.\n\nIslamabad visit\n\nFollowing the Kabul meeting, the Chinese foreign minister is scheduled to travel to Islamabad to attend the Pakistan-China strategic dialogue on Aug 21, Dawn.com reported.\n\nThe fifth round of Strategic Dialogue in May 2024 was co-chaired by Foreign Minister Ishaq Dar and his Chinese counterpart Wang in Beijing.\n\nAccording to the FO’s statement issued on Tuesday, “On the invitation of Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar … Mr Wang Yi is visiting Islamabad for co-chairing the sixth Pakistan-China Foreign Ministers’ Strategic Dialogue on August 21, 2025.”\n\n“The visit is part of the regular high-level exchanges between Pakistan and China to further deepen their ‘All-Weather Strategic Cooperative Partnership’, reaffirm support on the issues of respective core interests, enhance economic and trade cooperation, and reaffirm their joint commitment to regional peace, development and stability,” the statement added.\n\nLast month, FM Dar met with Wang on the sidelines of the Shanghai Cooperation Organisation event, where they discussed and reaffirmed mutual support in core sectors, including agriculture, mining, industry and security.\n\nPublished in Dawn, August 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:55:58.725Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931972/kabul-hosts-pakistan-china-foreign-ministers-today",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T00:20:42.000Z"
}
