{
  "title": "Israel refuses to budge after Hamas accepts truce proposal - World - DAWN.COM",
  "author": null,
  "content": "• Mediators cautious about ‘breakthrough’ as Tel Aviv sticks to demand for release of all hostages\n• Israeli forces kill at least 45 people in Gaza, Palestinian death toll hits 62,064\n• UN says 265 aid workers slain in this year\n\nJERUSALEM: A day after Hamas accepted a fresh proposal for a ceasefire in Gaza, and signalled its readiness for a new round of talks aimed at ending nearly two years of war, Israel said it stood firm on its call for the release of all prisoners in any future Gaza ceasefire deal.\n\nMediators are awaiting an official Israeli response to the plan, with Qatar expressing guarded optimism for the new proposal, noting that it was “almost identical” to an earlier version previously agreed to by Israel.\n\nBut a senior Israeli official told AFP the government’s stance had not changed and demanded the release of all prisoners in any deal.\n\nThe two foes have held on-and-off indirect negotiations throughout the war, resulting in two short truces during which Israeli hostages were released in exchange for Palestinian prisoners, but they have ultimately failed to broker a lasting ceasefire.\n\nQatar and Egypt, backed by the United States, have mediated the frequent rounds of shuttle diplomacy.\n\nEgypt said Monday that it and Qatar had sent the new proposal to Israel, adding “the ball is now in its court”.\n\nQatari foreign ministry spokesman Majed al-Ansari said on Tuesday that Hamas had given a “very positive response, and it truly was almost identical to what the Israeli side had previously agreed to”.\n\n“We cannot make any claims that a breakthrough has been made. But we do believe it is a positive point,” he added.\n\nMounting pressure\n\nAccording to a report in Egyptian state-linked outlet Al-Qahera News, the latest deal proposes an initial 60-day truce, a partial hostage release, the freeing of some Palestinian prisoners and provisions allowing for the entry of aid.\n\nIsraeli Prime Minister Benjamin Netanyahu has yet to publicly comment on the plan, but said last week that his country would accept “an agreement in which all the [prisoners] are released at once and according to our conditions for ending the war”.\n\nSenior Hamas official Mahmoud Mardawi said on social media that his group had “opened the door wide to the possibility of reaching an agreement, but the question remains whether Netanyahu will once again close it, as he has done in the past”.\n\nHamas’s acceptance of the proposal came as Netanyahu faced increasing pressure at home and abroad to end the war.\n\nOver the weekend, tens of thousands took to the streets in the Israeli city of Tel Aviv to call for an end to the war and a deal to free the remaining priosners still held in Gaza.\n\nThe new proposal also comes after Israel’s security cabinet approved plans to conquer Gaza City, fanning fears the new offensive will worsen the already catastrophic humanitarian crisis in the devastated territory.\n\n45 killed\n\nMeanwhile, at least 45 people were killed by Israeli strikes and fire across the territory, the local civil defence agency reported on Tuesday.\n\nA spokesman said the situation was “very dangerous and unbearable” in the Zeitoun and Sabra neighbourhoods of Gaza City, where he said “artillery shelling continues intermittently”.\n\nThe Israeli military declined to comment on specific troop movements, but later claimed that a strike in Khan Yunis overnight targeted a Hamas militant.\n\nSabra resident Hussein al-Dairi, 44, said “tanks are firing shells and mortars, and drones are firing bullets and missiles” in the neighbourhood.\n\n“We heard on the news that Hamas had agreed to a truce, but the occupation is escalating the war against us, the civilians,” he added.\n\nIsrael’s campaign in Gaza has claimed the lives of at least 62,064 Palestinians so far, most of them civilians.\n\n383 aid workers killed\n\nA record 383 aid workers were killed last year, the United Nations said Tuesday, branding the figures and lack of accountability a “shameful indictment” of international apathy, and warning that this year’s toll was equally grim.\n\nThe 2024 figure was up 31 per cent on the year before, the UN said on World Humanitarian Day, “driven by the relentless conflicts in Gaza, where 181 humanitarian workers were killed, and in Sudan, where 60 lost their lives”.\n\nIt said state actors were the most common perpetrators of the killings last year, and most of the victims were local staff attacked in the line of duty or in their homes.\n\nBesides those killed, 308 aid workers were wounded, 125 kidnapped and 45 detained.\n\n“Humanitarians must be respected and protected. They can never be targeted,” UN Secretary-General Antonio Guterres said in a statement.\n\n“This rule is non-negotiable and is binding on all parties to conflict, always and everywhere. Yet red lines are crossed with impunity,” he said, calling for perpetrators to be brought to justice.\n\nPublished in Dawn, August 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a502ea79346.jpg",
  "retrievedAt": "2025-08-20T04:56:00.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931969/israel-refuses-to-budge-after-hamas-accepts-truce-proposal",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T00:20:42.000Z"
}
