{
  "title": "FBR notifies simplified e-return form for taxpayers - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) has released a simplified electronic income tax return form for individual taxpayers for the tax year 2025.\n\nThe final form was notified through SRO1561 of 2025 after a 40-day consultation period, following the draft version’s release for public feedback on July 7 this year.\n\nThe new form is currently available only in English, while the Urdu version is still awaited despite earlier government announcements. Weeks of delay in finalising the form had created uncertainty among taxpayers, which was finally resolved with the notification of the final version.\n\nThe interactive return form incorporates an auto-fill system that integrates data on purchases, assets, and tax deductions at source, ultimately generating a single return upon completion. It consists of eight digital windows, each with one input column, designed for a step-by-step process.\n\nFor instance, entering an employer’s name in the first window automatically fills in tax deduction details. Withholding tax deductions linked to CNIC numbers will also appear on the form. Similarly, entering bank account details will display closing balances, while registered purchases linked to the filer’s CNIC will auto-populate, minimising manual entry.\n\nThe simplified return form is applicable to salaried individuals with additional rental income, as well as small businesses within a prescribed threshold. Taxpayers exceeding this threshold will be redirected to the standard filing process.\n\nThrough SRO1562 of 2025, the FBR has also introduced simplified electronic return forms for salaried individuals, associations of persons (AOPs), companies, and business professionals, with the aim of streamlining the filing process and enhancing transparency.\n\nUnder the Income Tax Ordinance, taxpayers must begin filing returns soon after the close of the tax year, with September 30 set as the deadline.\n\nSRO1562 also makes it mandatory for owners of immovable properties abroad to file an “Electronic Foreign Income and Assets Declaration for Resident Individuals”. Resident taxpayers must now disclose details of foreign rental properties, business income, overseas assets, earnings, and bank accounts.\n\nIn addition, the FBR has notified separate electronic returns for non-residents with no Pakistan-source income, traders, small and medium enterprises (SMEs), and salaried taxpayers.\n\nFinal versions of the electronic return for manufacturers, traders, and SMEs have also been issued.\n\nPublished in Dawn, August 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:56:00.769Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932014/fbr-notifies-simplified-e-return-form-for-taxpayers",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T00:20:36.000Z"
}
