{
  "title": "PM Shehbaz orders probe into Rs50bn gas bill shock - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif has ordered an independent probe into the controversial Rs50 billion gas billing dispute involving influential consumer groups and the gas utility sector.\n\nThe investigation will be led by former federal secretary Shahid Khan, following complaints from industrial and CNG consumers who received sudden bills for past gas dues, dating back to 2015.\n\nSources confirmed that the prime minister has constituted a special inquiry committee to examine the matter. The dispute centres around the Lahore-based Sui Northern Gas Company Ltd (SNGPL), which issued revised bills for the period between April 2015 and June 2022. These bills were based on updated notifications from the Oil and Gas Regulatory Authority (Ogra).\n\nAccording to these notifications, the industrial sector owes Rs14.4bn, the power sector Rs40bn (ultimately payable by electricity consumers), the CNG sector Rs3.8bn, and the fertiliser sector Rs2.4bn. The total payables amount to Rs59.8bn, including Rs51.3bn in differential gas charges and approximately Rs8bn in general sales tax (GST), in addition to late payment charges.\n\nThe issue has sparked concern, particularly among the industrial sector, which claims to have secured stay orders in the past to avoid such payments. Around 2,950 industrial consumers and 1,200 CNG consumers have protested, arguing they have strong legal grounds to challenge the additional charges. These groups assert that over the past decade, they have either exported or sold products and had no means to pass on the extra billing costs.\n\nThis billing dispute is further complicated by a Rs76bn subsidy claim against the government. The differential in Regasified Liquefied Natural Gas (RLNG) prices for export-oriented industries and the fertiliser sector is subsidised by the government, but the amounts recoverable from consumers have been billed.\n\nBoth Ogra and SNGPL have blamed each other for the legal errors. SNGPL sources explained that Ogra issued actualised RLNG prices for the period from April 2015 to June 2022 in December 2024, but later removed the revised notifications from its website following amendments requested by Pakistan State Oil (PSO) and Pakistan LNG Ltd (PLL). Ogra subsequently re-issued the RLNG prices on March 28, 2025, covering a period of 84 months. SNGPL has charged the differential amount to RLNG consumers under the gas sales agreement (GSA) clause 3.\n\nThe sources further argued that Ogra should not have revised the RLNG rates from ten years ago. Instead, they suggested the authority should have pursued recovery of the differential amount between the provisional RLNG prices and the actualised rates on a prospective basis, similar to how the fertiliser sector handled its payments.\n\nThey warned that retroactive claims could be nearly impossible to collect, with consumers likely to seek stay orders in court. This could undermine confidence in the regulated gas sector and fuel the growth of private entities outside the regulatory framework.\n\nOgra spokesperson Imran Ghaznavi defended the regulator’s actions, stating that it had been determining monthly provisional RLNG prices, which were now actualised. He clarified that, according to the Gas Sales Agreement (GSA) and the SNGPL Consumer Service Manual, the differential between the provisional and actual RLNG prices was recoverable in future bills, not in a single bill.\n\nPublished in Dawn, August 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a5054044b4f.jpg",
  "retrievedAt": "2025-08-20T04:55:55.010Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931979/pm-shehbaz-orders-probe-into-rs50bn-gas-bill-shock",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T00:20:59.000Z"
}
