{
  "title": "Separate homeland created to preserve Muslim heritage,culture, identity: Shibli",
  "link": "https://www.app.com.pk/national/separate-homeland-created-to-preserve-muslim-heritageculture-identity-shibli/",
  "date_published": "2020-08-14T05:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said on Friday that Pakistan was achieved after unprecedented sacrifices of the Muslims of the sub-continent and the aim of a separate homeland was to preserve Muslim heritage, culture and identity.\nSpeaking during an award distribution ceremony organised by the Press\nInformation Department (PID) in honour of the writers, and artists, he said\nrecognition of their contribution and services was vital.\nThe minister said during past over seven decades many ups and downs were\nwitnessed by the society. He said that unfortunately the literature,\npoetry, arts and culture and sports had witnessed decline.\nShibli said that many artists and producers strived hard and were part of the past glory of radio Pakistan, PTV and performing arts but now that enthusiasm and spirit was lacking in all fields and politics was no exception.\nHe said that Prime Minister Imran Khan was his inspiration for joining\npolitics to bring a change in the country as the past political leadership failed to deliver.\nThe minister said that the first two years of Pakistan Tehreek-e-Insaf\ngovernment were difficult due the problems inherited by it and the\noutbreak of coronavirus in the country. However, he expressed the\nsatisfaction that with the grace of Allah Almighty and due to the\nstrategy of the government, the situation in Pakistan was far better\nthan many countries. He said that now difficult time was over and good\ntime was round the corner.\nThe minister said it was the responsibility of all segments of the society to\nwork hard to hand over a better Pakistan to the next generation. He\nsaid that Independence Day was a good opportunity to reiterate the\ncommitment for taking all possible measures to make Pakistan a\ndeveloped and prosperous welfare state as envisioned by its founders.\nShibli said that the present leadership of the country was determined to\nensure rule of law and merit in the country and make it a modern\nIslamic welfare state.\nHe said that on this day the nation should feel for Kashmiris who were facing worst state terrorism by fascist Modi regime of India. He requested the senior artists and writers to train the new generation in their respective fields .\nEarlier Secretary Information and Broadcasting Akbar Hussain Durrani\nin his speech said the fields of literature, art and culture had\nwitnessed a decline during the past few decades which was a cause of\nconcern. He said that the young generation had the technology in their\nhands but did not have teachers to guide them. He said that the\nimportance of freedom was realized by slave people like Kashmiris and\nPalestinians.\nHe said once Pakistani radio and television dramas had great\nviewership due to their class but now the standards had declined and\nsame was the situation in fields of literature and these fields needed\nto be revived.\nHe said that the artists and writers who were being given awards were role model for their successors. Earlier Principal Information Officer Shehera Shahid welcomed the artists, writers and other guests. Those who were given awards included senior journalists Zia ur Rehman Kashmiri and Nisar Ahmed Shakir, newscaster Kanwal Naseer, artists Nighat Aman, Laila\nZuberi,Ayub Khoso,Taj Buledi, Rabia Tabbasum, Sajad Kishwar and Raees Ahmed,poet Javed Ahmed and senior PTV producer Khwaja Najmul Hassan.\nBesides Managing Director Associated Press of Pakistan Tariq Mehmood\nand Director General Radio Pakistan Ambreen Jan senior officials of\nthe Ministry of Information and Broadcasting were also present on the\noccasion.",
  "retrievedAt": "2025-08-11T19:39:29.348Z"
}
