{
  "title": "Shibli asks compatriots to raise voice for Kashmiris through ‘run for Kashmir’ telemarathon",
  "link": "https://www.app.com.pk/national/shibli-asks-compatriots-to-raise-voice-for-kashmiris-through-run-for-kashmir-telemarathon/",
  "date_published": "2020-08-14T02:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): Minister for Information and Broadcasting Senator Shibli Faraz on Friday urged the people to raise voice for besieged Kashmiris through ‘Run for Kashmir  telemarathon’ a symbolic protest to highlight Indian atrocities in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and give a wake up call to the world conscience.\nSpeaking at the launching ceremony of “Run for Kashmir tele marathon”\nhere, he said that international community especially human rights organizations should take action on small incidents but they were in a\nslumber on ongoing Indian state terrorism in IIOJK.\nMinister for Kashmir Affairs and Gilgit Baltistan Ali Amin Gandapur and Minister for Inter Provincial Coordination Dr Fehmida Mirza also spoke on the occasion.\nShibli said that under the principles of partition plan of June 3, 1947, Muslim majority areas were to form part of Pakistan and Kashmir having overwhelming Muslim majority was to join Pakistan. He said that due to a conspiracy, Kashmir could not become part of Pakistan and it was illegally occupied by India in complete disregard for international laws and partition plan of the subcontinent.\nThe minister said that armless Kashmiri people were facing worst state terrorism and the entire state was besieged by force of military might and their new generation was killed, blinded and maimed by use of lethal pellet\nguns.\nHe said that Pakistan would continue its moral, diplomatic and political support to Kashmiris just cause till realization of the goal of freedom.\nShibli said that every Pakistani should participate in this tele marathon through Run for Kashmir app to show their support for the Kashmir cause and protest over Kashmiris genocide.\nCongratulating the nation on Independence Day, he said that Pakistan was achieved after unprecedented sacrifices of our forefathers and was the responsibility of all to work hard for making it a strong and prosperous nation.",
  "retrievedAt": "2025-08-11T19:39:30.829Z"
}
