{
  "title": "NA Speaker, Deputy Speaker congratulate nation on 73rd independence day",
  "link": "https://www.app.com.pk/national/na-speaker-deputy-speaker-congratulate-nation-on-73rd-independence-day/",
  "date_published": "2020-08-14T07:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): Speaker National Assembly Asad Qaiser and Deputy Speaker Qasim Khan Suri congratulated the nation on the 73rd Independence Day celebrated on August 14.\nIn a message, the Speaker said that this day was a day of renewal of our commitments and reminded of the unforgettable struggle and sacrifices made by our forefathers for next generations to live in freedom.\nThe Speaker remarked that undoubtedly freedom was a great blessing and the nations which were living a life in slavery and were being subjected to oppression and exploitation know the value of freedom.\nHe said that the value of freedom could be gauged from the plight of the people living in Indian illegally occupied Jammu and Kashmir (IIOJK) and had been the victimized of Indian oppression and barbarism for more than seven decades.\nSpeaker Asad Qaiser said that the goal of achieving the freedom was to establish a state where the teaching of the Holy Quran and practices of the Holy Prophet Muhammad (PBUH) were implemented for the welfare of all irrespective of caste, colour and creed. The Quaid-e-Azam also dreamt about such a peaceful, democratic and welfare state that would be a model for the whole world.\nHe said that it was essential to be united to realize the dream of making Pakistan a true Islamic welfare state.\nThe Speaker paid tribute to the sacrifices offered by freedom leaders and their untiring efforts for the Muslims of subcontinent due to which dream of a separate homeland for Muslims was achieved.\nHe urged the nation to work hard for making Pakistan developed and prosperous country. He said that this day reminded all to work with honesty and sincerity for the progress of the nation. He remarked that Pakistan would make progress by practicing unity, belief and faith based principles laid down by Quaid-e-Azam Muhammad Ali Jinnah.\nOn this occasion, Deputy Speaker Qasim Khan Suri said that August 14 was the day of renewed commitment and reminded of the everlasting sacrifices rendered by the founders of Pakistan and our forefathers for the freedom of this country.\nHe said, “today we have to pledge that we will work together for the development of the country beyond provincialism, linguistics and political affiliations and work hard for progress and prosperity of homeland.”",
  "retrievedAt": "2025-08-11T19:39:24.273Z"
}
