{
  "title": "PM reiterates resolve for polio-free Pakistan; lauds downward trend in cases",
  "author": null,
  "content": "ISLAMABAD, Mar 05 (APP): Prime Minister Shehbaz Sharif on Wednesday reiterating his government’s resolve to purge the country of polio virus, said that the downward trend in February this year evidenced the effectiveness of the polio vaccination drives in the country.\nThe prime minister, chairing a meeting regarding the anti-polio vaccination drive, appreciated the administration of all provinces for their efforts to timely identify polio cases resulting into the gradual downward trend, according to a PM Office press release.\nHe said that the cooperation between the federation and provinces was inevitable to completely eradicate the polio virus.\nAppreciating the cooperation by the security forces during the polio campaigns, he directed the digitization of polio data and strict monitoring.\nThe participants of the meeting were informed that the anti-polio campaign was going on with full momentum in all provinces.\nIt was told that in polio vaccination drive of February this year, 42.5 million children were administered polio drops and nearly 90% of the child population in polio-affected districts were vaccinated.\nThe authorities informed that six polio cases have been reported so far this year.\nSince the launch of the February’s anti-polio campaign, a significant reduction in polio cases has been observed, particularly in polio-affected districts such as Balochistan, Sindh, and southern Khyber Pakhtunkhwa.\nIt was told that three polio campaigns during the first six months was part of the plan, of which the first one had been conducted in February, while the other two are scheduled for April and May.\nAll aspects of the polio campaign are being continuously monitored through an IT dashboard.\nThe meeting was attended by Minister of State Dr. Mukhtar Bharath, Senator Ayesha Raza Farooq, and senior officials from relevant departments.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:22:47.754Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-reiterates-resolve-for-polio-free-pakistan-lauds-downward-trend-in-cases/",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T08:06:00.000Z"
}
