{
  "title": "Pakistani journalists to enhance skills in UK through prestigious fellowship",
  "author": null,
  "content": "ISLAMABAD, Mar 05 (APP): Eight promising Pakistani journalists are set to embark on an intensive two-month course at the University of Westminster in the UK, as part of the prestigious South Asian Journalism Programme.\nThis fellowship, running since 2012, is offered as part of the UK’s Chevening scholarships and connects journalists with leading media organizations, including the BBC and Financial Times.\nThe fellows, hailing from various cities across Pakistan, including Quetta, Multan, Peshawar, Islamabad, and Karachi, will undertake a bespoke 8-week fellowship titled ‘Good Governance in a Changing World: The Media, Politics and Society’.\nBritish High Commissioner Jane Marriott emphasized the importance of high-quality journalism in holding power to account. This intensive course aims to equip the journalists with the skills to carry out bold investigative journalism, create lasting networks, and break critical stories upon their return to Pakistan.\nAsim Ahmed Khan, a CNN multimedia journalist and upcoming fellow, expressed his excitement about the program, stating that it offers a great opportunity to connect with fellow journalists, exchange ideas, and explore new approaches to storytelling.\nThe fellowship will provide the journalists with a platform to explore approaches taken by the UK and the South Asia region, discuss evidence-based context for key policy debates, and understand international positions. This year’s cohort will join nearly 70 Pakistani alumni from the fellowship and the wider Chevening alumni community in Pakistan, which is nearly 2,000 strong.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:21:50.465Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistani-journalists-to-enhance-skills-in-uk-through-prestigious-fellowship/",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T18:47:00.000Z"
}
