{
  "title": "Pakistan successfully hosted multilateral int’l conferences; strengthened diplomatic outreach: MOFA",
  "author": null,
  "content": "ISLAMABAD, Mar 5 (APP):Ministry of Foreign Affairs (MOFA), last year, focused on revitalizing diplomatic ties and expanding engagement globally as the high-level visits and the successful hosting of the Shanghai Cooperation Organization-Council of Heads of Government in Islamabad highlighted these efforts.\nOn the economic front, Pakistan attracted investments through the Special Investment Facilitation Council, with active support from its missions and consulates.\n“Pakistan remains committed to safeguarding national security and geostrategic interests, including the peaceful resolution of Jammu & Kashmir in line with UNSC resolutions. The country prioritizes strengthening economic and commercial ties with the international community while ensuring the welfare of the Pakistani diaspora and optimizing resources to facilitate them,” it was added.\nAdditionally, Pakistan actively promoted its positive global image to boost tourism, foster people-to-people connections, and enhance trade and business relations, a report of MOFA highlighted the incumbent government’s one-year performance.\nThroughout 2024, Pakistan actively worked to strengthen diplomatic ties worldwide while continuing its political and diplomatic support for the Jammu & Kashmir and Palestine causes at international forums, particularly the UN.\nPakistan extended its strong political, moral and diplomatic support for the people of Jammu & Kashmir at all relevant international forums, especially the UN and the OIC.\nThe prime minister highlighted the Jammu and Kashmir issue in his address before the United Nations General Assembly.\nThe deputy prime minister/foreign minister emphasized Pakistan’s principled position on Jammu and Kashmir at the 15th OIC Summit held in Banjul, Gambia which adopted comprehensive communique including reaffirming support for the just settlement of the Jammu & Kashmir dispute as per the UNSC resolutions and wishes of the Kashmiri people.\n“Pakistan has consistently provided unwavering diplomatic support to the Palestinian cause, denouncing Israeli aggression and advocating for Palestinian rights at international platforms such as the UN, OIC, and D-8,” it said.\nThe prime minister attended the Arab-OIC Summit on Palestine in Riyadh, while the deputy prime minister/foreign minister reaffirmed Pakistan’s commitment at the 15th OIC Summit in Banjul and the Extraordinary Meeting of the D-8 Council of Foreign Ministers.\nPakistan also participated in the high-level conference on Gaza in Jordan and presented its oral statement at the ICJ regarding Israel’s policies in occupied Palestinian territories.\nSince the start of the Gaza conflict, Pakistan had called for an immediate ceasefire, unobstructed humanitarian aid, and a lasting resolution based on pre-1967 borders, with Al-Quds Al-Sharif as Palestine’s capital.\nThe prime minister conducted official visits to multiple countries, including China, Saudi Arabia, and the UAE, to enhance political, economic, and investment relations.\n“Pakistan’s presence at global summits such as the UNGA, COP29, and the SCO Council of Heads of Government reflected its commitment to international cooperation,” the report said.\nThe country also secured a non-permanent seat on the UN Security Council for 2025-2026 and led the adoption of a UN resolution against Islamophobia.\n“In trade and economic diplomacy, Pakistan expanded its partnerships with key allies, increasing exports, securing foreign investments, and fostering bilateral agreements with regional and global powers. These diplomatic achievements underscore Pakistan’s proactive role in global affairs, multilateral cooperation, and economic engagement,” it was further added.\nDuring the Kyrgyzstan student crisis, the Pakistan Embassy provided 24/7 assistance, coordinated with local authorities, and facilitated evacuations.\nFollowing boat tragedies off Greece, Morocco, and Libya, Pakistani missions identified victims and survivors, while the Crisis Management Unit kept families informed.\nMoFA launched an online Apostille certificate portal to streamline document legalization. A two-day symposium, “From Gandhara to the World” (May 28-29, 2024), gathered global religious leaders and scholars to promote Buddhist heritage, cultural collaboration, and tourism.\nOver 50 cultural events worldwide, including fashion shows, Qawwali performances, and Pakistan nights, promoted Pakistan’s image.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:23:10.977Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-successfully-hosted-multilateral-intl-conferences-strengthened-diplomatic-outreach-mofa-2/",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T08:13:00.000Z"
}
