{
  "title": "HEC conducts nationwide training for 300 teachers of affiliated colleges",
  "author": null,
  "content": "ISLAMABAD, Mar 05 (APP):The Higher Education Commission (HEC), under its World Bank-supported project Higher Education Development in Pakistan (HEDP), conducted a nationwide training programme entitled “Equipping Teachers to Foster Learning Skills in Students” for teachers of affiliated colleges.\nThe initiative, spearheaded by the Post secondary Education Reform Unit (PERU), aimed to enhance the quality of teaching and learning in resource-constrained affiliated colleges by strengthening teachers’ capacity to develop essential learning skills in students.\nThe training was designed and developed in collaboration with the National Academy of Higher Education (NAHE). A team comprised of 18 NAHE approved Resource Persons and Experts led by Dr. Kashif Suhail Malik, Consultant/Master Trainer IIUI, trained over 300 teachers from all provinces and regions of Pakistan.\nThe trainings were conducted in eight cohorts across major cities, including Islamabad, Karachi, Quetta, Peshawar, Bahawalpur, Lahore, and Skardu.\nThe training was launched following the results of the recently conducted Learning Skills Assessment Test (LSAT), which evaluated first-semester students in affiliated colleges on three critical learning skills a) Information Management Skills, b) Communication Skills, and c) Problem-Solving Skills. LSAT results revealed significant gaps in these skills, raising concerns about students’ preparedness for academic challenges.\nIn response, HEC developed a targeted teacher training programme to equip educators with effective teaching strategies that foster critical thinking, effective communication, and structured information management in classrooms.\nThis initiative reflects HEDP’s ongoing commitment to improving teaching and learning quality in Pakistan’s higher education sector, particularly in decentralized institutions such as affiliated colleges. By empowering teachers with modern pedagogical tools, the programme aims to bridge skill gaps among students and prepare them for academic and professional success.\nTo assess the impact of this training, a second phase of LSAT is currently in the planning stage. This phase will evaluate student progress and learning outcomes and is expected to be conducted between mid-April and the end of May 2025.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:22:45.741Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/hec-conducts-nationwide-training-for-300-teachers-of-affiliated-colleges/",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T11:55:00.000Z"
}
