{
  "title": "Prof. Dr. Iqbal Choudhary showcases OIC-COMSTECH’s vision at MWC 2025 in Barcelona",
  "author": null,
  "content": "ISLAMABAD, Mar 05 (APP):Coordinator General of OIC-COMSTECH, Prof. Dr. Iqbal Choudhary participated in the Mobile World Congress (MWC) Barcelona 2025, engaging with global technology leaders and exploring cutting-edge advancements in the telecommunications industry.\nDuring his visit to the Huawei booth, Prof. Dr. Choudhary acknowledged the company’s pioneering contributions to 5G-A intelligent core network solutions and its significant role in promoting global technological collaboration.\n“On behalf of OIC-COMSTECH, I am honoured to recognize Huawei’s outstanding contributions to MWC Barcelona 2025. Huawei’s pioneering advancements in 5G technology and their dedication to fostering global collaboration have set new benchmarks in the industry. Their commitment to innovation, sustainability, and inclusivity resonates deeply with our mission to promote scientific and technological cooperation among OIC member states,” he remarked.\nMWC Barcelona 2025 featured the launch of 5G-A intelligent core network solutions alongside 83 global showcases across 71 key industrial scenarios, demonstrating the rapid evolution of digital technologies and their impact on industries worldwide.\nAs a follow-up to the recent cybersecurity event jointly organized by OIC-COMSTECH and Huawei, a Memorandum of Understanding (MoU) was signed between the Pakistan Telecommunications Authority (PTA) and Huawei. The agreement aims to enhance cybersecurity frameworks, strengthen technological capabilities, and drive innovation in the telecommunications sector.\nOIC-COMSTECH and Huawei have been actively collaborating on multiple initiatives, including capacity-building programs, digital transformation projects, and research partnerships to enhance the technological expertise of OIC member states.\nProf. Dr. Iqbal Choudhary’s participation at MWC Barcelona 2025 underscores OIC-COMSTECH’s commitment to advancing scientific and technological progress in the Muslim world, while fostering global partnerships in emerging technologies to create a more connected and innovative future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:21:52.693Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/prof-dr-iqbal-choudhary-showcases-oic-comstechs-vision-at-mwc-2025-in-barcelona/",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T14:47:00.000Z"
}
