{
  "title": "PM meets IFZA delegation; witnessed MoU between IFZA, BoI",
  "author": null,
  "content": "ISLAMABAD, Mar 5 (APP):Prime Minister Muhammad Shehbaz Sharif on Wednesday met an 8-member delegation from the International Free Zones Authority (IFZA) of the United Arab Emirates and the Aleria Group here and witnessed a memorandum of understanding (MoU) exchanged between IFZA and the Board of Investment Pakistan for investment in existing Special Economic Zones (SEZs).\nThe Prime Minister welcomed the delegation of the International Free Zones Authority of the United Arab Emirates that would invest in several projects in existing Special Economic Zones of Pakistan, a Prime Minister’s Office news release said.\nOn the occasion, the prime minister said Pakistan and the UAE had long-standing brotherly relations spanning decades, whereas the country had vast investment opportunities in several sectors.\n“The government is taking steps on a priority basis to provide a business and investment-friendly environment in the country,” the prime minister said.\nThe delegation praised Pakistan’s economic stability under the leadership of Prime Minister Muhammad Shehbaz Sharif and expressed that Pakistan was emerging as the most suitable market for investment in the region. The delegation expressed keen interest in further increasing its investment footprint in Pakistan.\nThe meeting was attended by IFZA Chairman Martin Gregers Pederson and Aleria Managing Partner Mana Ali Muhammad Hammad Al Shamsi, along with officials from Aleria and IFZA. Deputy Prime Minister and Foreign Minister Ishaq Dar, Minister for Planning Ahsan Iqbal, Minister for Privatization Abdul Aleem Khan, Minister for Information and Broadcasting Attaullah Tarar, Special Assistant Tariq Fatemi and relevant senior officials also participated in the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:21:51.243Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-meets-ifza-delegation-witnessed-mou-between-ifza-boi/",
  "dateList": "2025-03-05",
  "date_published": "2025-03-05T15:29:00.000Z"
}
