{
  "title": "IHC dismisses Nawaz Sharif’s appeals in Al-Azizia & Avenfield property references",
  "link": "https://www.app.com.pk/national/ihc-dismisses-nawaz-sharifs-appeals-in-al-azizia-avenfield-property-references/",
  "date_published": "2021-06-24T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP): The Islamabad High Court (IHC) on Thursday dismissed two appeals of former prime minister Nawaz Sharif against his imprisonment sentences in Al-Azizia Steel Mills and Avenfield Property references.\nThe court also upheld the decisions of accountability court Islamabad, for handing 11 year and seven year jail in Avenfield property and Al-Azizia Steel Mills references, respectively.\nThe court order read: “Since appellant is fugitive from law, hence has lost his right of audience before this court and we are left with no choice except to dismiss his appeals. The instant appeal is dismissed. Appellant may file an application before this court, as and when he surrenders or is captured by the authorities, for decision of the appeal on merits.\nNeedless to observe that the said application, if and when is made, shall be decided in accordance with law.”\nA division bench of IHC, comprising Justice Aamer Farooq and Justice Mohsin Akhter Kiyani, issued a nine-pages judgment this day, which the bench had reserved last day after listening the arguments from NAB prosecutor and amicus curiae.\nThe court order said: “The appellant was provided fair trial and now has absconded from justice at the time of hearing of appeal.\nMian Muhammad Nawaz Sharif was provided a fair trial inasmuch as learned trial court provided him opportunity of hearing as well as cross-examining the prosecution witnesses and only after the proper trial, his conviction was recorded; he despite being on bail, proceeded abroad and did not appear before this court and without any justification, remained absent on a number of dates.\nHence this court was left with no option but to follow the procedure as provided in Code of Criminal Procedure, 1898 and declare him as fugitive from law.”\nThe former prime minister was sentenced a total of 11 years in prison and slapped a £8 million fine (Rs1.3 billion) in the Avenfield properties reference while the trial court announced seven-year jail to Nawaz Sharif along with Rs1.5 billion and $25 million in Al-Azizia Steel Mills reference.\nThe former prime minister had filed appeals to IHC against the decision of accountability court. The IHC suspended the verdict in Avenfield property reference and later granted bail to Nawaz Sharif in Al-Azizia Steel Mills reference allowing him to travel abroad for medical treatment. However, the accused skipped multiple hearings deliberately and didn’t surrender despite repeated court notices. Subsequently, IHC declared Nawaz Sharif fugitive on continuous disappearance and now finally dismissed his appeals.",
  "retrievedAt": "2025-08-11T20:52:55.019Z"
}
