{
  "title": "Economic system to be transformed as per Islamic principles: Minister",
  "link": "https://www.app.com.pk/national/economic-system-to-be-transformed-as-per-islamic-principles-minister/",
  "date_published": "2021-06-24T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 24 (APP): Minister of State for Parliamentary Affairs Ali Muhammad Khan underlined the need for transforming the financial system of the country in line with Islamic principles to achieve lasting development and prosperity.\n“The country can’t progress without ending the interest-based system,” he said on Thursday while opening the budget debate in the National Assembly.\nHe urged the lawmakers from both the treasury and opposition benches to work hand-in-hand to establish a true Islamic economic system.\nQuoting Quaid-e-Azam Muhammad Ali Jinnah’s speech to officials of the State Bank of Pakistan in 1948, he said Jinnah was of the view that Pakistan should not follow the western economic system as the rooted the two world wars and a major cause of destruction.\nThe minister said the country would progress and prosper if the government and opposition implemented the Islamic economic system in a successful manner.\nHe said Shaheed Zulfikar Ali Bhutto had given the constitution and passed law against Qadianis declaring them non-Muslims while the credit of motorways went to Muhammad Nawaz Sharif.\nAli Muhammad said Prime Minister Imran Khan politically activated and motivated the youth to work for the development of the country rather then going abroad as this brain drain was causing huge loss to the national progress.\nHe said the PM had set an example of across the board accountability under which everyone was bought into book without any discrimination.\nThe minister said the welfare of the masses was the prime responsibility of the government, and accordingly the Ehsaas Programme had been started aimed at realizing the vision of transforming Pakistan into a welfare state.\nHe said the health card initiative was helping the underprivileged segments of the society to get free of charge medical facility.\nAll the economic indicators were improving as agriculture, industrial and services sectors were witnessing a remarkable growth despite the economic slow down caused by the coronavirus pandemic, he stated.\nAli Muhammad said the incumbent government had also started construction work on major dams such as Diamer Basha, Dasu and Mohmand that would help irrigate the land.\nHe said the opposition should give credit to Khyber Pakhtunkhwa government for constructing Swat motorway from its own budget and allocating 25 percent for health and education sectors, during its previous tenure.\n“We are united for Pakistan, the Constitution, Khatm-e-Nabuwwat (Finality of Prophethood) and Respect of the Holy Prophet Muhammad (PBUH),” he added.\nPrime Minister Imran Khan gave a loud and clear reply ‘absolutely not’ with regard to giving Pakistan’s soil to anyone against any country, which made the whole nation proud, he remarked.",
  "retrievedAt": "2025-08-11T20:52:59.609Z"
}
