{
  "title": "President for joint efforts by all stakeholders to strengthen electoral system",
  "link": "https://www.app.com.pk/national/president-for-joint-efforts-by-all-stakeholders-to-strengthen-electoral-system/",
  "date_published": "2021-06-24T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 24 (APP): President Dr Arif Alvi on Thursday said that it was the national obligation of political parties and concerned stakeholders to work together to strengthen electoral system in the country.\nHe emphasized the need for expediting the electoral reforms process so as to grant Overseas Pakistanis their political rights as well as make the electoral process more transparent, secure and impartial.\nThe President made these remarks during a meeting with Minister for Science and Technology Senator Syed Shibli Faraz, Minister for Information and Broadcasting Chaudhary Fawad Hussain, Minister for Education, Shafqat Mahmood, Minister for Information Technology and Telecommunication (IT&T), Syed Amin-ul-Haque, and Advisor to PM on Parliamentary Affairs, Zaheer-ud-Din Babar Awan to discuss the electoral reforms process here at the Aiwan-e-Sadr.\nThe meeting discussed various proposals with regard to improving the electoral laws and emphasized the need for evolving consensus among political parties and other relevant stakeholders to take forward the reforms process.\nReferring to the Elections Act 2017, the President stated that the said Act was supported by all political parties for strengthening the democratic process, and this time the political leadership of various political parties also needed to show the same spirit of cooperation for the sake of political rights of our citizens for a fair electoral process within the country through Electronic Voting Machines and also to facilitate the Overseas Pakistanis through internet-voting.\nThe President remarked that he was ready to reach out to all political parties to take them on board to improve the existing electoral laws.\nHe urged the need to rise above the political differences and jointly work for the fundamental political rights of the people of Pakistan.",
  "retrievedAt": "2025-08-11T20:52:54.644Z"
}
