{
  "title": "Efforts on to make Pakistan polio free: PM",
  "link": "https://www.app.com.pk/national/efforts-on-to-make-pakistan-polio-free-pm/",
  "date_published": "2021-06-24T06:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 24 (APP): Prime Minister Imran Khan has said that the government is making earnest efforts to make Pakistan a polio-free country despite the challenges in the wake of COVID-19 crisis.\nIn a telephonic conversation with Bill Gates, Co-Chair of the Bill & Melinda Gates Foundation (BMGF) Wednesday night, the prime minister discussed the ongoing polio eradication campaign in the country as well as on the country’s response to the public health challenges amid the COVID-19 pandemic.\nThe Prime Minister appreciated the work of BMGF for the socio-economic uplift of the most disadvantaged people around the globe, especially for promoting universal access to health services and combating of infectious diseases. He expressed gratitude, in particular, for BMGF’s partnership with Pakistan to rid the country of polio.\nThe Prime Minister reaffirmed that polio eradication remained a key national priority for the government.\nHe mentioned that a special polio eradication campaign was launched in the country earlier this month (June 7-11), during which vaccine drops were administered to over 33 million children under five years of age.\nSpoke with Bill Gates last night & thanked him for the help his Foundation provided for polio eradication in Pak. This time last yr we had 56 reported  cases – this yr so far only 1 case. InshaAllah we will eradicate polio completely in coming yr.\n— Imran Khan (@ImranKhanPTI) June 24, 2021\nThe Prime Minister expressed his satisfaction over the substantive progress in cutting the transmission of the poliovirus in the country. He hoped that polio would be eradicated soon with the support of all partners.\nBill Gates expressed his appreciation for the Prime Minister’s leadership for this national cause, saying that while progress was encouraging, keeping up pressure would be the key to ending transmission for good.\nThe Prime Minister also highlighted Pakistan’s efforts to overcome the third wave of coronavirus in the country.\nWhile alluding to Pakistan’s potential in the Information Technology (IT) sector and Government’s business friendly IT policy, the Prime Minister encouraged Microsoft to further expand its footprint in Pakistan.\nThe prime minister also encourage Bill Gates to consider setting up a Microsoft Incubation Lab in Pakistan.\nThe telephone call follows the high-level GPEI (Global Polio Eradication Initiative ) Polio Oversight Board (POB) delegation visit to Pakistan in early June, when Prime Minister Imran Khan met POB leadership and had convened the National Task Force on Polio Eradication. The new GPEI Polio Eradication Strategy was launched on 10 June 2021 in a global (virtual) event featuring high-level participation from Pakistan.",
  "retrievedAt": "2025-08-11T20:53:01.556Z"
}
