{
  "article_id": "2025-07-13_dd0a02f4369202c158f792ba3d1894f7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/decision-on-cancellation-of-islamabads-e-parking-contract-upheld/",
    "retrieved_at": "2025-08-27T09:32:19.806Z"
  },
  "metadata": {
    "title": "Decision on cancellation of Islamabad’s e-parking contract upheld",
    "author": null,
    "date_published": "2025-07-12T19:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, July 12 (APP): An Islamabad court has upheld the cancellation of the e-parking contract by the Directorate of Municipal Administration, Metropolitan Corporation Islamabad (MCI), terming it legal in accordance with the rules and in the public interest. This decision is being considered as an important milestone of DMA, MCI's administrative transparency, financial integrity and improvement in civic amenities, said a press release issued by Directorate of Municipal Administration, Metropolitan Corporation Islamabad. The contract with AJCL company was terminated in June 2025 after serious problems surfaced such as violation of several clauses of the contract, financial irregularities and non-implementation of cashless system. The said company challenged this decision by filing various legal proceedings, including a contempt of court petition, an appeal for re-possession of parking sites, and a request to stop the proposed auction of smart parking. The court, while declaring all the claims ineffective and baseless, declared the decision of DMA, MCI as fully in line with legal requirements and administrative procedures. The decision has been appreciated not only by legal experts but also by civic circles, who are calling it a decision that promotes institutional accountability, transparent governance and sustainable civic governance, said a senior DMA officer. \"This decision makes it clear that any effort to create hurdles in way to safeguarding of state resources, countering maladministration, and continuity of reform measures. In addition, the citizen-oriented policies of DMA and MCI are being lauded by the public circles. The DMA. MCI in its statement expressed commitment to ensure the provision of best facilities to citizens by developing all local government services, including the Islamabad Smart Parking Project, on effective, transparent and modern lines.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}