{
  "article_id": "2025-07-13_d7ac8a9068a7edec23a8013b138a10cc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/indian-sponsored-terrorism-to-be-foiledaleem-khan/",
    "retrieved_at": "2025-08-27T09:31:53.025Z"
  },
  "metadata": {
    "title": "Indian sponsored terrorism to be foiled:Aleem Khan",
    "author": null,
    "date_published": "2025-07-13T15:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 466,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 13 (APP): Federal Minister for Communications Abdul Aleem Khan, visited Khanewal and Dunyapur in District Lodhran on Sunday to express condolences and solidarity with the families of those who martyred in the recent tragic bus attack in Balochistan. In the village in Kacha Khoh, Federal Minister expressed sympathies with the bereaved family of Shaheed Lance Naik Ghulam Saeed and offered condolences over the martyrdom of the soldier and the passing away of his father. While expressing love and affection with the children of Ghulam Saeed, Abdul Aleem Khan was quite sentimental. He prayed for the departed souls that may Allah Almighty grant them a place in His infinite mercy and strength and patience to bear this irreparable loss. Talking to the media, Abdul Aleem Khan reaffirmed that the nation would eliminate terrorism at all costs and stand firm behind its Armed Forces. He emphasized that targeting residents of other provinces by removing them from buses in Balochistan is a conspiracy aimed at creating divisions among the Pakistani people. However, he asserted that the nation will remain united and resilient by the grace of Allah Almighty. Federal Minister pointed out that the world is aware of India's involvement in this proxy war and just as it faced humiliation in recent conflicts it will continue to suffer setbacks in the future. Abdul Aleem Khan said that in recent past Pakistan defeated India and now its nefarious designs will again be netuerlized. He further stated that Pakistani soldiers are making the ultimate sacrifice in the line of duty and the entire nation stands behind them like a solid wall. Abdul Aleem Khan reiterated that his visit to Khanewal and Lodhran was to share the grief of the affected families and to express solidarity. He prayed for the swift eradication of this menace of terrorism from the country. He also noted with sadness that the victims of this incident were not wealthy or privileged but rather belonged to poor, hardworking and common households. In addition, Federal Minister for Communications Abdul Aleem Khan visited Dunyapur in Lodhran district where he offered condolences on the martyrdom of two brothers, Usman Toor and Jabir Toor in the Balochistan attack. He especially commended the patriotic spirit displayed by their mother stating that no power in the world can defeat such nation blessed with brave and courageous mothers. Abdul Aleem Khan declared that this mother in Dunyapur has set a new global example of resilience and bravery and her courage is a matter of pride for every Pakistani. He was accompanied by Central Party Leaders including Rana Nazir Ahmad Khan, Mian Khalid Mehmood, MPA Shoaib Siddiqui and Brigadier (R) Qaiser Mahey. The local administration of Khanewal and Lodhran along with political and social leaders, appreciated the visit and offered prayers for the martyrs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}