{
  "article_id": "2025-07-13_400df0f75a438ac5bdc2da7a15cf7c41",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/six-killed-many-injured-in-bus-crash-near-chakri-due-to-slippery-road-conditions/",
    "retrieved_at": "2025-08-27T09:31:26.954Z"
  },
  "metadata": {
    "title": "Six killed, many injured in bus crash near Chakri due to slippery road conditions",
    "author": null,
    "date_published": "2025-07-13T17:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 201,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 13 (APP): At least six passengers were killed while several others injured when a bus traveling from Rawalpindi to Multan skidded off the road due to slippery road conditions, near Chakri on early Sunday morning, According to National Highways and Motorway Police (NHMP) spokesperson, six passengers were critical injured whereas 21 sustained minor injuries, transported to the District Headquarters (DHQ) Hospital in Chakwal by FWO and Rescue 1122 teams. He said initial investigations suggest that recent rainfall had made the road dangerously slick, contributing to the driver losing control. Upon receiving the alert, rescue teams from the Motorway Police, Frontier Works Organization (FWO), and Rescue 1122 were immediately dispatched to the site and launched a coordinated relief operation. Senior officials, including the Sector Commander of M-2 North and the Deputy Superintendent of Police (DSP) Chakri Beat, visited DHQ Chakwal and the Pakistan Institute of Medical Sciences (PIMS) in Islamabad to oversee rescue operations and monitor the medical treatment being provided to the injured. The identities of the deceased are being withheld until their families can be notified. Authorities are continuing to assist the victims' families and have urged drivers to exercise extreme caution while traveling in adverse weather conditions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}