{
  "article_id": "2025-07-13_1feee3f19d84366c5ca1eb78f99e7809",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/itp-uses-drone-technology-to-enforce-traffic-laws-on-major-highways/",
    "retrieved_at": "2025-08-27T09:32:20.546Z"
  },
  "metadata": {
    "title": "ITP uses drone technology to enforce traffic laws on major highways",
    "author": null,
    "date_published": "2025-07-13T09:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 13 (APP):Islamabad Traffic Police (ITP) has penalized over 300 drivers and educated more than 350 citizens during recent operations carried out using drone technology to monitor traffic violations on major highways, including the Expressway and Srinagar Highway. An official told APP on Sunday that under the leadership of Chief Traffic Officer Captain (R) Syed Zeeshan Haider, the initiative aims to ensure strict enforcement of traffic rules through real-time monitoring. He said the drones are being used to identify violations such as lane discipline breaches, overloading, one-wheeling, and other hazardous driving behaviors. He said more than 300 drivers have already been penalized through legal action based on footage captured by drone cameras. In addition to enforcement, he said over 350 citizens have been educated about traffic laws as part of the campaign. He said several vehicles involved in serious violations have also been impounded and shifted to local police stations. \"Using drone footage, violations are being identified, challans are being issued on the spot, and in some cases, vehicles are being taken into custody,\" said CTO Zeeshan. He said in the next phase, drone monitoring will be expanded to include all sectors and additional major roads across the city. Zeeshan added that drones are also being utilized to detect congested points on roads, enabling rapid deployment of special teams to address traffic build-up and ensure smooth flow.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}