{
  "title": "Marriyum for boosting screen tourism to promote Pakistan’s true image",
  "link": "https://www.app.com.pk/national/marriyum-for-boosting-screen-tourism-to-promote-pakistans-true-image/",
  "date_published": "2022-11-23T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday underlined the need for boosting screen tourism to showcase the country’s true image across the globe through its culture, heritage and tourism.\n“In Pakistan, we discuss film industry in a stereotype way but it has been replaced with screen tourism across the world. It (film) has been added in the educational curriculum which does not only use for telling story of a country, but also help showcase its culture, heritage and tourism,” she said while addressing the signing ceremony of a Memorandum of Understanding (MoU) between the Fatima Jinnah University Rawalpindi and PTV Films for the Naqash Digital Film Initiative.\nThe signing of MoU between the representatives of PTV Films and Fatima Jinnah University was witnessed by the information minister, Secretary Information and Broadcasting Shahera Shahid and others officers of the ministry and the varsity.\nUnder the agreement, the PTV Films would promote the short films and other film related work of the university’s students through massive projection.\nMarriyum Aurangzeb congratulated both the Fatima Jinnah University and PTV managements on signing of the agreement and said it was a fabulous work which would eventually promote the film industry in the country.\n“This is the way Pakistan needs to communicate with younger generation as a nation so that they can get more opportunities to showcase their talent,” she added.\nThe minister recalled the rise and fall of Pakistani film industry in the past, saying “We were the first film producing country in the South Asian Region and in 1996, it was our industry which produced more films than the one in our neighboring country.”\nShe said the film industry had been revived in the country and did take off especially during the last ten years. It struggled a lot during the last couple of decades due to shutting down of cinemas and other reasons, she added.\nMarriyum said she had been completing the unfinished task of 2018 since assuming the charge of information ministry during the current government tenure.\n“We launched the first ever film and culture policy in 2018 when Pakistan was celebrating its 70th independence day,” she said, adding now the policy had been in implementation phase and started paying dividends.\nShe said there had been zero taxation for the film industry in the country while the import of film industry related equipment was made duty free to uplift the sector. Withholding tax for film producers was abolished and entertainment tax had been made zero.\nThe minister said new cinemas would have tax exemption on their income for 10 years. The Film Finance Fund was being constituted which could be accessed by young people for film production, she added.\n“It is not a loan but a grant which the youth can take for film production,” she said, adding process was underway for corporate sector inclusion in this fund.\nShe termed the closure of cinemas as a major reason behind the downfall of film industry.\nThe cinemas such as Shabistan and Gulistan in Rawalpindi, Lahore and other cities were once landmarks , but they were now replaced by plazas, wedding halls and petrol stations.\nMarriyum asked the Fatima Jinnah University management to sensitize their students about the film policy which would not only incentives them but also their parents and society as a whole.\nShe said 66 per cent youth below the age of 30 was huge which needed to be engaged in constructive activity. “We have to understand this and it will be huge public service if the educational institutions take steps for film promotion,” she remarked.\nThe minister assured the university management of all out support from the PTV and ministry for their students grooming in media and film sector.\nShe urged the university management to start internship programme for their students in collaboration with PTV so they could have hands-on experience of broadcast and film production.\nSecretary Information and Broadcasting Shahera Shahid said it was an honour for the information ministry to provide platforms to the young generation for showcasing their talent.\n“We will continue to provide platforms to the young generation for their encouragement, progress and development,” she added.\nPTV Managing Director Sohail Ali Khan praised Marriyum Aurangzeb for her efforts and vision in promoting for uplifting the film industry in such a short span of time.\nHe said the minister had been implementing the policy in an impressive way.",
  "retrievedAt": "2025-08-11T15:54:50.674Z"
}
