{
  "title": "US envoy participates in community tree plantation drive",
  "link": "https://www.app.com.pk/national/us-envoy-participates-in-community-tree-planting-drive/",
  "date_published": "2022-11-23T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): US Ambassador in Pakistan Donald Blome Wednesday participated in a community tree planting drive that will become part of a larger project to develop an urban forest in the city of Quetta.\nThe ambassador during his visit to Balochistan also meet with Chief Minister Abdul Quddus Bizenjo, local partners working to advance climate change adaptation, representatives of higher education institutions, leaders of local NGOs, and Afghan refugees, said a news release from the US embassy in Pakistan.\nAmbassador Blome discussed US efforts to combat the effects of climate change through a Green Alliance with diverse partners in Pakistan and underscored the strong cooperation between the United States and Pakistan on promoting economic development through higher education and women’s empowerment.\nAt the event, the ambassador highlighted that the U.S. government had provided more than 97 million dollars in flood-related assistance to Pakistan this year, including to individuals and communities in need in Balochistan.\n“But we know that the effects of the flooding are far from over, and every nation faces the threat of climate change. So, we’re working with diverse partners to increase Pakistan’s resilience to climate change through a Green Alliance,” he said.\nAmbassador Blome also met with leadership from the Balochistan University of Information Technology, Engineering and Management Sciences and the Sardar Bahadur Khan Women’s University to discuss how U.S. government support has helped them respond to local economic development needs in their academic programs.\nThe United States, through the U.S. Agency for International Development (USAID), has provided scholarships to almost 300 students—56 per cent of them women—to pursue higher education at the institutions and further their communities’ economic development.\nIn remarks at the launch event of “Entrepowered—Women Can Do,” a program that will provide $350,000 of seed funding to women entrepreneurs in Balochistan, Ambassador Blome said, “The United States believes that empowering women is a strategic investment in the future for both private citizens and the global economy. By working together on projects like Entrepowered, we can advance women’s equality in the business sector and unleash a vast potential that will help bring prosperity to Quetta and Balochistan.”\nThe United States is also proud to support the United Nations High Commissioner for Refugees (UNHCR) livelihoods program in Quetta, which fosters economic development for Afghan refugees and local artisans. Since 2009, UNHCR, with U.S. funding, has implemented 251 projects in Balochistan to provide infrastructure upgrades to schools, water and sanitation improvements, and health facility upgrades for both Afghan refugees and Pakistani host communities.",
  "retrievedAt": "2025-08-11T15:54:52.880Z"
}
