{
  "title": "BISP starts disbursement of quarterly tranche of Benazir Kafaalat",
  "link": "https://www.app.com.pk/national/bisp-starts-disbursement-of-quarterly-tranche-of-benazir-kafaalat-2/",
  "date_published": "2023-10-08T13:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP):The process of disbursement of the quarterly tranche (July–September) of Benazir Kafaalat cash assistance to beneficiaries across the country is continued smoothly by the Benazir Income Support Programme (BISP) to provide relief to the beneficiaries.\nThe payment of Rs. 9000 per household will be disbursed among around nine million registered beneficiary families. The beneficiaries, in case of any complaint, can approach the nearest BISP Tehsil offices or call the toll-free helpline number 080026477 of the Benazir Income Support Program. The special control room has been activated in the BISP headquarters to address the complaints of the beneficiaries promptly.\nHowever, the beneficiaries can also contact them on WhatsApp numbers including 0320-3263026 (Sindh), 0320-3263041 (9Punjab), 0325-5365469 (Balochistan), 0325-5365469 (Khyber Pakhtunkhwa), Azad Jammu and Kashmir, and Gilgit Baltistan.\nThe messages from the Benazir Income Support Program are sent only from 8171, and messages from any other number should not be trusted.\nIt is also pertinent to mention here that the Secretary of BISP, Amer Ali Ahmed, has announced that the performance of different regions and zones will be assessed on the basis of the number of complaints addressed by the officials in order to make the program more transparent and effective.\nBISP management is taking immediate action against the agents responsible for deductions in a swift response to these matters.\nBISP will also conduct a virtual engagement via the official Facebook account of BISP on October 10 (Tuesday) at 11:30 a.m. to listen to the issues being faced by the beneficiaries.\nIn addition, a dedicated phone line (051-9246421) has been designated to provide a direct channel for beneficiaries to contact BISP with their queries and concerns.\\778\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:00:28.943Z"
}
