{
  "title": "PBF welcomes European Parliament’s decision of extending GSP Plus status to Pakistan",
  "link": "https://www.app.com.pk/business/pbf-welcomes-european-parliaments-decision-of-extending-gsp-plus-status-to-pakistan/",
  "date_published": "2023-10-08T10:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): The Pakistan Business Forum (PBF) has welcomed the European Parliament’s decision of extending the Generalized System of Preferences (GSP) Plus status to Pakistan for another four years till 2027, but has urged the government to remove regulatory obstacles to boost exports to the EU.\nThe GSP Plus status offers developing countries duty-free or reduced-tariff access to the EU market for over 6,000 products. It is a significant opportunity for Pakistan to boost its exports and create jobs.\nIn a statement, PBF Chairman (Capital Area) Atif Ikram Sheikh said that PBF appreciates the unwavering efforts of the Government of Pakistan in advocating for this extension, further strengthening trade relations and fostering economic growth for our nation.\nHe said that the GSP Plus status, which Pakistan has enjoyed in the past, has significantly contributed to enhancing our export potential and economic prosperity.\nAtif Ikram said that GSP Plus status holds paramount importance for Pakistan’s economy as it has played an important role in expansion of multilateral trade.\nAccording to the trade statistics from ITC World Trademap, Pakistan’s exports to EU, which were around 6.3 billion dollars in 2013, have increased over the time to 11.3 billion dollars in 2022, primarily due to the deeper market access provided by European Union under GSP Plus.\nHe said that this essentially meant that due to GSP Plus, the European Union was by far the biggest destination for Pakistan’s exports as more than 30 percent of our exports reach EU market.\nThe PBF office bearer said that this privilege has played a pivotal role in boosting our export sector, particularly in textiles, apparel and other key industries. The GSP Plus status has not only bolstered our economic prospects but has also supported job creation and sustainable development within the country.\nAs looking ahead, the extension of the GSP program until 2027 presents an exceptional opportunity for Pakistan to further elevate its trade relations with the European Union. Similarly PBF believes that by leveraging this extended GSP status, Pakistan can diversify its export base and explore new markets, thus amplifying the growth trajectory of our nation.\nThe PBF’s chairman also stated it is time time to carry out a deeper study as to what extent the country benefited from the scheme and why it could not maximize its benefits ? How we improve it further including PBF asserted that to diversify our products and improve quality to access untapped European markets.\nHowever, the PBF has warned that Pakistan is not making full use of the GSP Plus status due to a number of regulatory obstacles. These include complex customs procedures, lack of transparency, and inadequate infrastructure.\nThe PBF has called on the government to take urgent steps to remove these obstacles and make it easier for businesses to export to the EU. This would help Pakistan to capitalize on the GSP Plus status and boost its exports.\nThe PBF’s recommendations are in line with the government’s own stated goals of boosting exports and creating jobs. The government has already taken some steps to remove regulatory obstacles, but more needs to be done.\nOne key area where the government can take action is to simplify customs procedures. The current system is complex and time-consuming, which can deter businesses from exporting. The government should introduce a single-window system to streamline the customs process and make it easier for businesses to comply with regulations.\nAnother area where the government can take action is to improve transparency. Businesses often complain that it is difficult to understand and comply with government regulations. The government should publish all relevant regulations online and make them easy to access. The government should also provide more guidance and support to businesses to help them comply with regulations.\nFinally, the government needs to invest in infrastructure to support exports. This includes improving roads, ports, and airports. The government should also invest in logistics and trade facilitation services.",
  "retrievedAt": "2025-08-11T10:00:10.663Z"
}
