{
  "title": "Pak-Afghan improved relations crucial for regional peace, stability: Ashrafi",
  "link": "https://www.app.com.pk/national/pak-afghan-improved-relations-crucial-for-regional-peace-stability-ashrafi/",
  "date_published": "2023-10-08T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): Pakistan Ulema Council Chairman, Hafiz Muhammad Tahir Mahmood Ashrafi on Sunday emphasized that the relationship between Pakistan and Afghanistan must be strengthened, and no one should be allowed to undermine the pursuit of peace between the two neighbouring countries.\nTalking to media, accompanying prominent religious leaders, he stressed the need for improved relations between Pakistan and Afghanistan and the importance of maintaining peace in the region.\nAshrafi clarified Pakistan’s stance on Afghan nationals residing within its borders, stating, “There is not a single illegal student or teacher in any of the seminaries in Pakistan. If the police have any information, they should consult the concerned seminary and its administration.”\nHe underscored the distinction between Afghan refugees and illegal migrants and expressed Pakistan’s commitment to ensuring that Afghan nationals living legally in Pakistan face no issues.\nAddressing the issue of terrorism, he stressed that both countries should cooperate in preventing individuals from either side from engaging in acts of terrorism in the neighbouring country. He called for a direct channel of communication between the governments of Pakistan and Afghanistan to address concerns and resolve issues.\nAshrafi highlighted the sacrifices made by Pakistan for the cause of peace in the region, including hosting almost four million Afghan refugees. He also reminded the audience that Pakistan had supported Afghanistan against the Soviet Union and suffered significant losses during the war on terror, with over 80,000 Pakistanis martyred.\nRegarding the current situation in Afghanistan, he expressed hope in the interim government and Pakistan’s ongoing efforts to bring stability to the region. He urged cooperation between both nations in facilitating the return of illegal Afghan migrants while ensuring the protection of those living legally in Pakistan.\nIn conclusion, Ashrafi stressed the importance of collaboration between religious scholars and political leaders from both Pakistan and Afghanistan to promote regional peace. He called for open channels of communication and the removal of misunderstandings that could be exploited by outsiders to create divisions between the two countries.\nHe also addressed the global issues of Palestine and Kashmir, emphasizing the need for unity in addressing oppression and finding peaceful solutions to these long-standing conflicts.\nThe accompanied religious scholars echoed the sentiment that regional peace was a shared goal, and both Pakistan and Afghanistan must work together to eliminate the threat of terrorism and foster stability in the region.",
  "retrievedAt": "2025-08-11T10:00:06.383Z"
}
