{
  "title": "Taliban announce caretaker govt under Hassan Akhund; rubbish claim of Pakistan’s involvement",
  "link": "https://www.app.com.pk/national/taliban-announces-interim-govt-set-up-akhund-to-head-state/",
  "date_published": "2021-09-07T15:05:00.000Z",
  "source": "APP",
  "content": "KABUL, (Afghanistan) Sep 7 (APP): The Taliban on Tuesday announced an interim government in Afghanistan with Mullah Mohammad Hasan Akhund as its head and strongly rubbished claims of any involvement by Pakistan in the internal affairs of the Islamic Emirate.\nAddressing a press conference, the Taliban spokesman Zabihullah Mujahid announced that Mullah Abdul Ghani Baradar would act as deputy head of the interim set up.\nZabihullah Mujahid, the Spokesman and the new Information Minister of the Islamic Emirate of Afghanistan to a question dismissed any involvement from Pakistan and said; “the interference from Pakistan is a rumour that has been propagated during last 20 years.”\n“We do not allow interference. We act with complete freedom and we were able to fight the world countries which were occupying our country,” he said in response to a question after announcing the new interim Afghan government set up in Kabul.\nMedia error: Format(s) not supported or source(s) not found\n“From the outset, we fought the whole world for sake of Islam and our country,” Zabihullah said, rubbishing the narrative being built by the Indian media over Pakistan’s role in the comeback of the Taliban in Afghanistan and the routing of the Ashraf Ghani regime.\nZabihullah told the media that Mullah Amir Khan Muttaqi had been assigned the portfolio of foreign minister, Sirajuddin Haqqani as interior minister, Molvi Muhammad Yaqub as minister for defence and Hidayattullah Badari as finance minister etc.\nHe said it was an interim set-up of the Islamic Emirate of Afghanistan which could be reshuffled later on.\nThe announcement came after Taliban’s consolidation of its position in the wake of takeover of Kabul on August 15 in a surprising blitz and complete withdrawal of foreign forces led by US. They also announced complete control of Afghanistan with the fall of Panjshir province.\nMujahid further said that they were confronted with different issues like poverty and economy and stressed upon all Afghans to work for the peace, stability and prosperity of Afghanistan.\nHe maintained that Panjshir province had been now secured and peaceful and no war was raging there.\nTo a question, the Taliban spokesman, strongly rebutted that there was any interference by Pakistan, terming it as mere ‘a rumour’. Certain elements wanted to draw a wedge between Afghanistan and Pakistan, he added.\nHe said that Taliban had acted with complete freedom and were able to fight the countries who had been occupying Afghanistan.\n“We have sacrificed for the defence and for the people of this country and will not allow any interference,” he added.\nHe also asked the protesting Afghan people not to use the current situation for causing any trouble to the country.\nOther members of the cabinet included; Mullah Khairullah Khairkhwa – Information and Culture, Mullah Abdul Latif Mansoor – Water and electricity, Abdul Baqi Haqqani – Education,\nNajibullah Haqqani Telecommunications, Khalil-ur-Rehman Haqqani – Refugees, Abdul Haq Wasiq – Intelligence, Haji Address – Afghanistan Bank, Qari Din Mohammad Hanif – Economics, Maulvi Abdul Hakim Sharia – Minister of Justice, Noorullah Noori – Borders and Tribes, Younis Akhundzada – Rural Development,Mullah Abdul Manan Omari – Public Benefits,Mullah Mohammad Isa Akhund – Mines, Fasihuddin – Levi Drastiz, Shir Mohammad Abbas Stanekzai – Deputy Minister of Foreign Affairs, Malvi Noor Jalal – Deputy Minister of Interior, Zabihullah Mujahid – Deputy Information and Culture, Mullah Taj Mir Javad – First Deputy Chief of Intelligence, Mullah Rahmatullah Najib – Deputy Chief of Intelligence and Mullah Abdul Haq – Deputy Minister of Interior in the fight against drugs.\nMullah Mohammad Hasan Akhund\nMullah Mohammad Hasan Akhund is presently head of the Taliban’s powerful decision-making body, Rehbari Shura or leadership council. He belongs to Kandahar, the birthplace of the Taliban, and was among the founders of the Taliban movement.\nAkhund had worked for 20 years as head of Rehbari Shura and earned himself a very good reputation. According to the Taliban, Mullah Hasan had worked in important positions during their previous government in Afghanistan. He had served as foreign minister and as deputy prime minister.\nBorn in Pashmol village of Panjwai district in Kandahar, Akhund hails from Babar tribe of Pashtuns.\nBesides heading cabinet of Taliban during previous stint, he had also served as foreign minister, Governor Kandahar, and political advisor of Mulla Omar. Moreover, he was also elected as acting President of Afghanistan.\nDeputy PM Abdul Ghani Baradar\nAppointed as deputy head of government in new Taliban government, Abdul Ghani Baradar comes from Popalzai tribe of Pashtuns and belonged to Uruzgan district.\nEarlier, he supervised the Taliban operation as well as leadership council and financial matters of Taliban. One of the founding members of Taliban, Abdul Ghani Baradar used to teach at a seminary along with Mulla Omar.\nDuring the Taliban government, he served as Governor Herat and chief of Taliban force.\nDeputy Info Minister Zabihullah Mujahid\nZabihullah Mujahid has been assigned the portfolio of Deputy Minister for Information and Culture. He was appointed Taliban spokesperson after the arrest of Muhammad Hanif in January 2007.\nHaving got early education at different seminaries of Afghanistan, Mujahid is at home in Pashtu, Persian and English languages.\nInterior Minister Sirajuddin Haqqani\nAppointed as caretaker Interior Minister Sirajuddin Haqqani was born in 1970 to Jalaluddin Haqqani.\nComing from Khost province, Haqqani  had taken part in Afghan Jihad and later against US and NATO forces. He enjoys prominent place among Taliban and Haqqani group.\nRefugees Minister Haji Khalilur Rehman Haqqani\nAppointed as Minister for Refugees, Khalilur Rehman Haqqani belongs to Zadran tribe in Khost province and a cousin of Sirajuddin Haqqani.\nHaving obtained his early education in Afghanistan and later Darul Ulum Haqqania Akora Khattak, he actively took part in the war against alien forces.\nDefense Minister Maulvi Yaqoob Mujahid\nThe elder son of late Mulla Omar, Maulvi Muhammad Yaqoob has been assigned the portfolio of Defense Minister in new Taliban cabinet.\nAlso a deputy Amri of Taliban, he was born in 1990 in Kandahar where he also obtained his early education.\nHe also played a key role for coordination between the military and political wings of Taliban and is highly regarded in the group.",
  "retrievedAt": "2025-08-11T21:10:58.885Z"
}
