{
  "title": "Peace in Afghanistan prerequisite for stability of region : Sheikh Rashid",
  "link": "https://www.app.com.pk/national/peace-in-afghanistan-prerequisite-for-stability-of-region-sheikh-rashid/",
  "date_published": "2021-09-07T18:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 07 (APP):Minister for Interior, Sheikh Rashid Ahmad on Tuesday said that long-lasting peace in Afghanistan was a prerequisite for stability in the region and the world.\nHe was talking to the German ambassador in Pakistan Bernhard Schlagheck and Ambassador of the Netherlands Wouter Plomp in a meeting held here to discuss matters of mutual interest including the prevailing situation in Afghanistan.\nSheikh Rashid said that peace in Afghanistan was a must for peace in Pakistan, adding that Pakistan wanted peace and stability in Afghanistan.\nHe said that the government of Pakistan was providing full assistance to those Afghan citizens and foreigners leaving Afghanistan.\nThe minister said a facilitation desk was set up at the ministry to provide support round the clock in that regard.\nHe said that Pakistan was fulfilling its responsibilities and providing full assistance on humanitarian grounds.\nThe minister said that Pakistan was already serving four million Afghan refugees for the last 40 years.\nBoth the envoys thanked Pakistan for timely assistance in the safe evacuation of foreigners, particularly European citizens and concerned members of organizations from Afghanistan.\nThey appreciated the efforts of Pakistan for the safe evacuation of foreigners.\nThey also hailed the role of Pakistan for its long-term support and accommodating a large number of Afghan refugees.\nThe Netherlands envoy said that sustainable peace and development in Afghanistan was the joint objective of Pakistan and the European Union.\nHe said that the EU was ready to fully support Pakistan in the prevailing situation.\nThe German ambassador expressed the desire to evacuate those Afghan citizens working with their organizations in Afghanistan and sought support from Pakistan.\nThe minister assured full cooperation to the European envoys for further evacuation.",
  "retrievedAt": "2025-08-11T21:10:58.233Z"
}
