{
  "title": "NAB asks AAA Associates’ victims to submit compensation claims within fortnight",
  "link": "https://www.app.com.pk/national/nab-asks-aaa-associates-victims-to-submit-compensation-claims-within-fortnight/",
  "date_published": "2024-04-07T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP): The National Accountability Bureau (NAB) has instructed individuals robbed by AAA Associates to submit their compensation claims to the NAB Rawalpindi bureau within the next two weeks. Those who have already submitted claims are advised not to resubmit their applications.\nAccording to NAB, Rawalpindi sources, the Bureau was investigating the allegations of extortion of money, fraud, cheating, and false promises perpetrated by individuals such as Fawad Bashir, Shahzad Ali Kayani, and others from AAA Associates, targeting the general public.\nThe Bureau is probing allegations of money extortion, fraud, cheating and false promises perpetrated by individuals like Fawad Bashir, Shahzad Ali Kayani, and others associated with AAA Associates. Their alleged activities, centered at office no. 20121 on the Second Floor of the Business Centre in Bahria Town, Rawalpindi, have targeted the general public.\nThe NAB has asked individuals deceived by AAA Associates with false promises to submit their claims for the return of their stolen money. These individuals are required to provide supporting documentation, including a copy of their Computerized National Identity Card (CNIC) and receipts, either via post or email within next fifteen days. This will enable the commencement of legal proceedings against the culprits.\nVictims are asked to submit their claims, along with required documents, to the office of the Director General, NAB Rawalpindi, the Investigation Officer at Investigation Wing-II, National Accountability Bureau (Rawalpindi), situated at Melody, Islamabad, G-6, Civic Centre. Contact details for inquiries include Fax: 051-9220832, Phone: 051-9222064, and email: rawalpindi@nab.gov.pk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:46:00.684Z"
}
