{
  "title": "Renowned Saudi philanthropist, religious leader Dr Al-Issa visits Pakistan",
  "link": "https://www.app.com.pk/national/renowned-saudi-philanthropist-religious-leader-dr-al-issa-visits-pakistan/",
  "date_published": "2024-04-07T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 07 (APP): Dr Mohammad bin Abdulkarim Al-Issa, a distinguished figure in the realms of religion and philanthropy, on Sunday arrived in Pakistan for a significant visit from 7th April to 16th April 2024, aimed at fostering interfaith dialogue and cooperation.\nAs the Secretary General of Muslim World League and Chairman of Council of Muslim Scholars, Dr Al-Issa has long been at the forefront of promoting a more inclusive and tolerant understanding of Islam. Dr Al-Issa’s efforts to combat Islamophobia and promote religious co-existence have garnered international acclaim.\nIn 2019, he spearheaded a groundbreaking dialogue among Muslim and non-Muslim scholars, resulting in the signing of “The Charter of Makkah,” a testament to his dedication to fostering understanding and mutual respect.\nDuring his current visit to Pakistan, Dr Al-Issa is set to lead the Eid-ul-Fitr prayer at Faisal Mosque, one of the largest mosques in the world, located in the capital city of Islamabad.\nAdditionally, he will inaugurate the groundbreaking Seerat-un-Nabi Museum, the first of its kind in Pakistan, dedicated to showcasing Prophetic Relics and employing modern technologies such as virtual and augmented realities to elucidate the life and teachings of the Holy Prophet Muhammad (Peace Be Upon Him).\nDr Al-Issa’s itinerary also includes high-level meetings with key figures in the Pakistani government, including the Prime Minister, Chief Justice, and Chief of Army Staff, underscoring the importance of fostering strong diplomatic and cultural ties between Pakistan and Saudi Arabia.\nDr Al Issa’s visit comes on the heels of his previous accolades, including the prestigious Hilal-e-Pakistan award conferred upon him by the President of Pakistan in 2022 for his humanitarian efforts and role in strengthening the bond between the two nations.\nAs Dr Al-Issa continues to champion interfaith dialogue and promote a message of peace and tolerance, his visit to Pakistan serves as a testament to the enduring importance of collaboration and understanding in building a more harmonious world.",
  "retrievedAt": "2025-08-11T01:45:32.091Z"
}
