{
  "title": "PM constitutes body to review climate change governance, funds",
  "link": "https://www.app.com.pk/national/pm-constitutes-body-to-review-climate-change-governance-funds/",
  "date_published": "2024-04-07T09:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 7 (APP): Prime Minister Shehbaz Sharif has constituted a high-level committee to review Climate Change Governance and Mechanisms to access Climate Funds and nominated Climate Change Minister, Romina Khursheed Alam and Executive Director, Sustainable Development Policy Institute (SDPI), Dr Abid Suleri as its members alongwith other senior members.\nThe Minister of Climate Change and Environmental Coordination has issued a detailed notification explaining the context, mandate, terms of reference (TORs) and list of the members of the Committee.\nThe committee will be chaired by the Deputy Chairman Planning Commission that comprised of government officials, parliamentarians, representatives from civil society and environment NGOs, private sector, research institutes, and expert/advisors with knowledge on specific topics.\nThe members are Deputy Chairman Planning Commission, Mohammad Jehanzeb Khan (chair), Coordinator to PM on Climate Change, Roinina Khurshid Alam, Senator Ayesha Raza Farooq, MNA Bilal Kiyani, Executive Director, SDPI, Dr Abid Suleri, Kashmala Kakakhel Climate Finance Expert, Rizwan Mehboob, Climate Expert, Ali Tauqir Sheikh Climate Expert, Ahsan Kamran Climate Finance Expert, Nadia Rehman, Member CC PC, Secretary MoCC&EC (Secretary of the Committee), Secretary Ministry of Commerce, Secretary MoPDSI and Secretary Ministry of EA and Additional Secretary (EF) Ministry of Finance.\nThe Committee will suggest approach that involves mainstreaming climate considerations across all government organizations and operations, as well as integrating them into the development agenda and Sustainable Development Goals (SDGs).\nIt includes evaluating the effectiveness of existing and proposed institutional mechanisms such as the National Climate Change Council, SIFC, proposed Climate Change Authority, Climate Change Fund, National Disaster Risk Management Fund, and coordination with key ministries.\nAdditionally, there is a need to review institutional mechanisms and policies to mobilize climate finance, including climate funds and innovative financial instruments. The appraisal of institutional mechanisms and policies to mobilize carbon finance is also crucial.\nFurthermore, assessing institutional mechanisms and policies to attract private capital from various sources such as Development Finance Institutions (DFIs), Pension Funds, Insurance Companies, Commercial Banks, Venture Capital, and Private sector firms is essential. Examining institutional mechanisms and policies to enhance engagement with Multilateral Development Banks (MDBs) to reduce the cost of finance and leverage private sector investment through grants, guarantees, and concessional climate funds will also be recommended by the Committee.\nThe committee will make recommendations to strengthen climate governance, access climate and carbon finance, and mobilize the private sector to drive decarbonization of industry, integrate into green value chains, and boost exports in alignment with evolving international regulatory mechanisms such as carbon border adjustments. Additionally, the role of media, academia, and research entities in policy advocacy and formulation should be articulated.",
  "retrievedAt": "2025-08-11T01:45:38.667Z"
}
