{
  "title": "Irregularities in purchase of health equipment surfaced in IKDP: Audit Report",
  "link": "https://www.app.com.pk/national/irregularities-in-purchase-of-health-equipment-surfaced-in-ikdp-audit-report/",
  "date_published": "2024-04-07T10:14:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 07 (APP):Complaints of widespread irregularities in procurement of equipment and construction contracts at the Institute of Kidney Diseases Peshawar surfaced in an audit report released here Sunday.\nAccording to an audit report, by buying various equipment for the kidney center at expensive prices from the market rate and giving the construction contract to the company after approval, the exchequer has caused a loss of millions of rupees.\nIn the audit report of the Institute of Kidney Disease Peshawar, objections were raised on medical devices and other items. Medical equipment and other items were purchased at prices higher than the market rate and by purchasing medical equipment at higher prices, the exchequer suffered a loss of Rs 9.7 million, according to the audit report.\nSurgical gloves were purchased at Rs 112 instead of Rs 71 and a loss of Rs 2.5 million was caused by the purchase of surgical gloves at a higher price, according to the audit report. Plastic bags were bought at Rs. 230 instead of Rs. 197, thus the sale packs were bought at a cost of Rs. 5160 more than the market rate.\nChemicals used in IKD were also bought at high prices, the audit report revealed. The contract for the beautification and construction work of the hospital was given against the rules. The contract is worth Rs. Rs. 88.7 million was given to a private company.\nAccording to the audit report 10% performance security of Rs. 8.8 million has not been taken from the company and the contract has been unjustifiably extended till the year 2022-23. Unauthorized payment of Rs. 90 million has been made for construction work of OPDIBP, the audit report said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:45:58.555Z"
}
