{
  "title": "Pakistani passport ranks 4th worst in world for fifth straight year - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistani passport has ranked the fourth worst for the fifth straight year, according to this year’s Henley Passport Index, a ranking of the world’s 199 passports based on the number of destinations their owners can access without a prior visa.\n\nIn the latest global ranking issued on October 7, Pa­­kistan’s travel docum­ent was placed at 103 in the list — tied with Yemen — and ranked higher than only those of Iraq (104), Syria (105) and Afghanistan (106).\n\nPer the ranking, Pakistan and Yemen’s passports permit visa-free access to 31 countries only out of 227 travel destinations, Iraq’s allows travel to 29, Syria’s gives access to 26 destinations, and Afghanistan’s travel document only affords the bearer access to 24 destinations without a visa.\n\nPakistan’s passport has been declared the world’s fourth worst since at least 2021 on the Henley index, which calculates countries’ “visa-free score” — the number of destinations travellers can access without a prior visa, or with a visa on arrival.\n\nThe travel document placed 100th on the list in 2024 and 2023, 109th in 2022 when it allowed entry into 32 countries sans a prior visa, and 107th in 2021 with the same visa-free score.\n\nThe top spot yet again belonged to Singapore, as its passport provides citizens visa-free access to 193 destinations, followed closely by South Korea in second place with a visa-free score of 190, and Japan ranking third with 189 destinations its citizens can visit without a visa.\n\nGermany, Italy, Luxembourg, Spain and Switzerland rank fourth, with visa-free access to 188 locations.\n\nAustria, Belgium, Denmark, Finland, France, Ireland and the Netherlands rank fifth with a visa-free score of 187.\n\nAlso notable was that for the first time since the Henley Passport Index was created 20 years ago, the United States has fallen out of the world’s top 10 most powerful passports.\n\n“Once unrivalled at No.1 in 2014, the American passport has now slumped to 12th place, tied with Malaysia, with visa-free access to only 180 of 227 destinations worldwide,” Henley said in a press release.\n\nSimilarly, the British passport has slipped to its lowest-ever position on the index, dropping from sixth to eighth since July, despite also once holding the top spot in 2015.’\n\nThe United Arab Emirates’ passport, which entered the top 10 for the first time last year, hiked one spot, moving to eighth with a visa-free score of 184.\n\nChina’s passport, which ranked 59th last year with 85 destinations accessible without a visa, dropped to 64th with its visa-free score lowering to 82.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/151531079020a09.webp",
  "retrievedAt": "2025-10-16T23:44:24.632Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949079/pakistani-passport-ranks-4th-worst-in-world-for-fifth-straight-year",
  "dateList": "2025-10-13",
  "date_published": "2025-10-15T08:48:17.000Z"
}
