{
  "title": "Traffic restored in Chiniot after night-long closure by truckers - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHINIOT: Traffic on the highways leading from Chiniot to Sargodha and Jhang was restored on Sunday after being suspended during the night-long protest by dumper truck drivers.\n\nThe protesting transporters closed-off the main roads leading out of the city on Saturday in protest against the administration for imposing a ban on their entry during daytime.\n\nThe traffic was restored after the district administration held a dialogue with the protesters and assured them of further negotiations of their demands.\n\nEarlier, the Stone Suppliers Association and Truck Dumper Owners Association office bearers held a press conference at the district press club in which they complained that the administration was treating them as terrorists and creating hurdles in their business. They said dilapidated roads were the main reason behind fatal accidents and claimed that out of the 777 accidents during the last month, only 16 involved trucks.\n\nThey said the ban on trucks on the Chiniot-Pindi Bhattian Road and Chiniot-Sahianwala Road by the administration was affecting their businesses. They demanded the administration lift the ban on trucks on the two highways and the ban on the daytime entry of their vehicles in the city.\n\nTransporters closed main roads leading out of city in protest against banning their entry to certain roads\n\nDuring the negotiations, the administration allowed the entry of 160 trucks owned by local transporters into the city area.\n\nIt is pertinent to mention here that citizens had appreciated the ban on dumper trucks in the city as it reduced traffic congestion during rush hours.\n\nPublished in Dawn, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:34:32.324Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948541/traffic-restored-in-chiniot-after-night-long-closure-by-truckers",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T02:32:36.000Z"
}
