{
  "title": "‘Temporary ceasefire’ agreed with Afghanistan, says FO, following ‘precision strikes’ in Kandahar and Kabul - DAWN.COM",
  "author": null,
  "content": "The Foreign Office (FO) on Wednesday announced that a temporary ceasefire has been agreed with Afghanistan for the next 48 hours amid recent border hostilities between the two countries.\n\n“A temporary ceasefire has been decided between the Pakistani government and the Afghan Taliban regime, with the mutual consent of both parties, for the next 48 hours from 6pm today, at the request of the Taliban.”\n\n“During this period, both sides will make sincere efforts to find a positive solution to this complex but solvable issue through constructive dialogue,” the FO said.\n\nTaliban regime spokesperson Zabiullah Mujahid said on X that Afghan forces were instructed to respect the ceasefire, “unless any aggression takes place”.\n\nEarlier, state broadcaster PTV News reported that the Pakistan armed forces conducted “precision strikes” in Afghanistan’s Kandahar province and capital Kabul.\n\nA statement uploaded on X, quoting security sources, said: “Pakistan Army’s retaliatory action against Afghan Taliban aggression, key hideouts destroyed. Key hideouts of Afghan Taliban successfully targeted by Pakistan Army.\n\n“These precision strikes were carried out in Afghanistan’s Kandahar province. As a result of these strikes, Afghan Taliban Battalion Number 4 and Border Brigade Number 6 completely destroyed. Dozens of foreign and Afghan operatives killed.”\n\nThe statement added that the Pakistan Army possessed the “full capability to give a strong and complete response to any external aggression”.\n\nIn a subsequent update, PTV reported, citing security sources, that strikes were conducted in Kabul as well.\n\n“The centre and leadership of Fitna al-Hindustan were targeted in Kabul. The Pakistan Army possesses the full capability to give a befitting response to any aggression,” PTV reported.\n\nFitna-al-Hindustan is a term designated by the state for terrorist organisations in Balo­chistan.\n\nThe PTV post quoted security sources as saying that the Pakistan Army targeted Afghan Taliban Battalion Headquarters No 4, Battalion 8, and Border Brigade No 5 in Kandahar.\n\n“All these targets were meticulously selected, isolated from civilian populations, and successfully destroyed,” the post read.\n\nEarlier in the day,the Inter-Services Public Relations (ISPR) said security forces repulsed an attack by the Afghan Taliban along the Balochistan border, killing around 15 to 20 of their members.\n\nAccording to the ISPR, Afghan Taliban “resorted to cowardly attack[s] at four locations in [the] Spin Boldak area” in the early hours of Wednesday. “The attack was effectively repulsed by Pakistani forces,” the statement said.\n\nToday’s fighting is the third major skirmish between Pakistan and Afghanistan within a week, following the incident in Kurram last night and earlier skirmishes that began on Saturday night and continued into Sunday morning at several locations.\n\nAccording to the ISPR, 23 Pakistani troops were martyred and 29 injured in the incident that began with Afghan Taliban attacking posts across the border. The military’s media affairs wing also said that credible intelligence estimates and damage assessment showed that “more than 200 Taliban and affiliated terrorists have been neutralised, while the number of injured is much higher”.\n\nAfghanistan claimed it carried out the attack as a “retaliatory” measure, accusing Islamabad of conducting air strikes in its territory last week. For its part, Islamabad did not confirm whether it was behind the air strikes but underscored Pakistan’s right and resolve to defend itself.\n\nThe weekend clash took place against the backdrop of Pakistan suffering multiple casualties among security forces in intelligence-based operations against terrorists.\n\nIslamabad has repeatedly called on Kabul to bar terrorist groups from using its territory to attack Pakistan, however, Afghanistan denies the allegations and claims Afghan soil is not used for attacks on neighbouring countries.\n\nThe issue of terrorists using Afghan soil against Pakistan has long strained ties between the two countries and the ties seem to have nose-dived with recent increase in hostilities at the border.\n\nOn Monday, Defence Minister Khawaja Asif said while speaking on Geo News programme ‘Aaj Shahzeb Khanzada ke Saath’ that there were “no ties” between Islamabad and Kabul. “It’s a stalemate right now. You can say there are no active hostilities, but the environment is hostile,” he had said, adding: “There are no ties, direct or indirect, as of today”.\n\nThe minister had also said that hostilities between the two sides could resume “at any time”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/151736378c7227d.webp",
  "retrievedAt": "2025-10-16T23:34:49.424Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949107/temporary-ceasefire-agreed-with-afghanistan-says-fo-following-precision-strikes-in-kandahar-and-kabul",
  "dateList": "2025-10-13",
  "date_published": "2025-10-15T11:58:10.000Z"
}
