{
  "title": "Cameroon’s 92-year-old president poised for eighth term - World - DAWN.COM",
  "author": null,
  "content": "YAOUNDE: Cameroonians voted on Sunday in an election expected to return 92-year-old Paul Biya, the world’s oldest serving head of state, to office after 43 years in power.\n\nJournalists saw voters crowding outside polling stations during the day in the capital Yaounde before they closed in the early evening, with an electoral official declaring the ballot had gone “calmly”.\n\nBiya faced 11 opponents, including former employment minister Issa Tchiroma Bakary, 79, who generated unexpected enthusiasm among voters in the central African nation, where half the population is under 20.\n\nMost of the eight million Cameroonians who were eligible to vote in the one-round election had only known one ruler in their lifetime. Biya has been in power since 1982 and has won every election in the past 20 years with more than 70 per cent of the vote.\n\n“Nothing is certain. Let’s wait until we know the name of the elected official,” Biya told reporters after he cast his ballot in the Bastos neighbourhood, near the presidential palace.\n\nCameroonian political scientist Stephane Akoa said: “We shouldn’t be naive. We know full well the ruling system has ample means at its disposal to get results in its favour.” But he said that the campaign in recent days had been “much livelier” than was usually the case at that stage and “this poll is therefore more likely to throw up surprises”.\n\nReporters saw polling stations close at 1700 GMT (10pm PKT).\n\n“Voting passed off calmly,” an official from the national electoral authority, Jean-Alain Andzongo, said at a voting station in the capital.\n\nPublished in Dawn, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68ec553dc927a.jpg",
  "retrievedAt": "2025-10-16T23:34:34.836Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948505/cameroons-92-year-old-president-poised-for-eighth-term",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T01:56:37.000Z"
}
