{
  "title": "China, Philippines trade accusations over vessel clash - World - DAWN.COM",
  "author": null,
  "content": "MANILA: The Philippines and China accused each other on Sunday of responsibility for a maritime confrontation near disputed islands in the South China Sea, further escalating tensions in the resource-rich waterway.\n\nThe Philippine Maritime Council, an inter-agency government body, blamed Chinese maritime forces for deploying a water cannon and ramming a Filipino vessel near the Philippine-occupied Thitu Island, locally known as Pag-asa, “strongly condemning” the incident and vowing to pursue “appropriate diplomatic action”.\n\nAccording to Manila’s coast guard, three vessels were anchored near the island early on Sunday as part of a government programme to protect local fishermen when Chinese ships reportedly approached and used water cannon to intimidate them.\n\nAn hour later, a Chinese coast guard ship allegedly fired its water cannon directly at a Philippine vessel before ramming its stern, causing minor damage but no injuries, the coast guard said.\n\nChina’s coast guard said two Philippine government vessels “illegally entered” waters near Sandy Cay, a coral reef in the northern Thitu Reefs within the Spratly Islands, leading to a collision.\n\nBeijing said a Philippine vessel “dangerously approached” a Chinese coast guard ship, for which it held Manila responsible. Manila’s authorities vowed to continue operations in the area, emphasizing the need to protect Filipino fishermen’s livelihood.\n\nUS condemns ‘aggressive actions’\n\nUS Ambassador to the Philippines MaryKay Carlson condemned what she described as China’s “dangerous ramming” of a Filipino vessel, calling the incident “aggressive actions” in the South China Sea, in a post on social media platform X.\n\nThe disputed area, part of the Spratly Islands, has been the site of repeated confrontations between the two nations over the years. Tensions have heightened recently, particularly over the Scarborough Shoal and other contested regions in the South China Sea, which China claims almost entirely.\n\nBrunei, Indonesia, Malaysia, the Philippines, and Vietnam also assert claims over portions of the waterway, a strategic trade route that facilitates over $3 trillion in annual ship-borne commerce.\n\nLegal basis\n\nConfrontations between Philippine and Chinese vessels occur frequently in the contested waterway, which Beijing claims nearly in its entirety despite an international ruling that its assertion has no legal basis.\n\nAngelica Escalona, a spokeswoman for the foreign affairs department in Manila, also told reporters that a diplomatic protest would be filed over the incident. “Full responsibility lies with the Philippine side,” spokesman Liu Dejun said in an online statement.\n\n‘Bullying tactics’\n\nPhotos and videos released by the Philippine Coast Guard showed a China Coast Guard vessel, which had its water cannon activated, shadowing a Philippine ship.\n\n“Despite these bullying tactics and aggressive actions… we will not be intimidated or driven away,” the Philippine Coast Guard said.\n\nThe incident was the latest in a string of flare-ups between Beijing and Manila in the South China Sea, a busy waterway through which more than 60 per cent of global maritime trade passes.\n\nThe Philippine government said last month that one person was injured when a water cannon attack by a China Coast Guard vessel shattered a window on the bridge of another fisheries bureau ship, the BRP Datu Gumbay Piang, near the Beijing-controlled Scarborough Shoal.\n\nAnd in August, a Chinese navy vessel collided with one from its own coast guard while chasing a Philippine patrol boat near the same shoal.\n\nChina seized control of the fish-rich shoal from the Philippines after a lengthy standoff in 2012. The Philippines had voiced opposition to China’s plans for a “nature reserve” there, calling it a pretext for the eventual occupation of the site.\n\nPublished in Dawn, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68ec5547bf862.jpg",
  "retrievedAt": "2025-10-16T23:44:27.286Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948506/china-philippines-trade-accusations-over-vessel-clash",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T01:56:37.000Z"
}
