{
  "title": "Withering geoeconomics - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT was almost exactly three years ago that a paper was published by Moeed Yusuf and his co-author Rabia Akhtar arguing in favour of a pivot away from geopolitics towards geoeconomics as Pakistan’s primary external orientation. That paper had built upon the National Security Policy (NSP) of 2021 which had expanded the meaning of the word ‘security’ to include human dignity and prosperity as well. Lasting security, the NSP had argued, cannot be built with guns alone, but must also secure people’s rights to live in dignity and pursue their own prosperity.\n\nRecent developments provide a good opportunity to revisit the arguments made in that paper. Subsequent developments have vindicated substantial portions of what the writers were saying but at the same time, things seem to have moved in the opposite direction to the one they urged policymakers to take.\n\nThe paper argued that a sound economic footing built on domestic reform is the key to securing Pakistan’s future. It argued that for a pivot to geoeconomics that was “a significant departure in how Pakistan perceives its own utility for the world”. They observed that Pakistan had traditionally seen itself as a “net security provider to the West, a strategic neighbour for China, and a partner to key Middle Eastern countries like Saudi Arabia as a means of soliciting foreign economic support”. But this model was “structurally flawed”, they argued. And rightly so.\n\nSadly the advice seems to have generated little more than chatter and ample nodding of heads, with little to no impact on policy. Some of this is due to the powerful hold that geopolitics has on the minds of the establishment, and in equal measure, it is owed to the fact that the world evolved in ways different from what the authors foresaw.\n\nAll signs are now pointing in the direction of yet another incoming geopolitical rent.\n\nThe authors were right in seeing neoliberalism coming under increasing strain and countries around the world retreating into “economic nationalism”. They were right when they said this tendency would drive a greater role for ‘geoeconomics’ in the future, as more and more countries subordinated their economic policy to the requirements of a changing global order. They were right in pointing out that Pakistan would be at a disadvantage in this world due to its economic weakness, and must deploy a form of geoeconomics that is a “win-win” for its partners rather than a zero-sum game.\n\nBut this was the easy part. They were writing after the tariff wars of the first Trump presidency after all, and the dying throes of the liberal world order were all around us. Much of the hysteria around China’s Belt and Road Initiative had peaked, but was still around, and it was possible to see how the world was going to be carved up into competing economic blocs. The conventional wisdom at that time (to which I also subscribed in those days) was that a day was coming when Pakistan would be forced to choose between America and China, that the days of foreign bailouts were ending, Pakistan’s addiction to geopolitical rents would have to be broken.\n\nIn pointing the way forward, the authors laid the emphasis on “connectivity”, particularly in energy, as well as “development partnerships” that sought investments rather than aid. And here things began to fall apart.\n\nA few things have happened since then to render outdated this vision of ‘connectivity’. First is the depth of the transformation sweeping the world of energy, as the solar-plus-battery revolution renders the world of gas pipelines, cross-border power transmission lines, foreign investment in refineries and giant power plants obsolete. Connectivity for the authors hinged on energy above all else, but with the energy sector itself in such profound flux, the vision was stillborn.\n\nSecond, the connectivity rested on good relations with Afghanistan, normalisation of ties with India, and a lifting of Iran’s sanctions. Each of these now seems like a remote possibility, so even if there was to be a cross-border demand for energy transmission — whether via the Iran gas pipeline or the CASA electricity transmission line — the regional situation seems to be closing these possibilities off more than opening them up.\n\nDevelopment partnerships resting on investments have taken a mortal hit from the most recent episode of near bankruptcy that Pakistan is still trying to emerge from. The message from the past few years that has gone to all foreign investors around the world is that Pakistan is not able to afford any investment because the economy here tends to run out of foreign exchange. The only condition under which investors might come into Pakistan now would be if they were riding the coat-tails of geopolitics.\n\nMost importantly, all signs are now pointing in the direction of yet another incoming geopolitical rent. The specifics are unknown, but Pakistan’s rulers seem to be busy securing for themselves one more round of security-related inflows of exactly the sort that the authors of that paper said Pakistan needs to depart from.\n\nThe stars are aligning for Pakistan in almost startling ways, even if the ground beneath our feet feels a bit shaky. In other places, Moeed Yusuf had warned that Pakistan sits nestled between two regions that have a rising arc of conflict — East Asia and the Middle East — and that these conflicts will find their way to Pakistan. But it turns out Pakistan is instead sitting in the sweet spot, where the conflicts of these regions won’t bother us, but our utility to the big powers in each of these regions will increase.\n\nToday all three — the US, China and Saudi Arabia — are smiling on Pakistan. Yet one more round of geopolitical rents seems to be gathering on the horizon (though it is still not clinched). And old ways of thinking consider themselves vindicated while those of us who have always argued for the merits of learning to stand on our own feet, must perhaps wait another decade for our moment.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, October 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f04d921a50b.jpg",
  "retrievedAt": "2025-10-16T23:34:48.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949239",
  "dateList": "2025-10-13",
  "date_published": "2025-10-16T01:43:38.000Z"
}
