{
  "title": "China very concerned about border clashes between Pakistan and Afghanistan, foreign ministry says - World - DAWN.COM",
  "author": null,
  "content": "China is concerned about recent border clashes between Pakistan and Afghanistan and has asked the two countries to protect their nationals and investments in the region, Beijing’s foreign ministry said on Monday.\n\nIntense border clashes between Pakistan and Afghanistan started late on Saturday night and continued into Sunday morning. The Inter-Services Public Relations (ISPR) said that 23 Pakistani troops were martyred and 200 Taliban and affiliated terrorists were killed when Islamabad responded to aggression by Kabul.\n\nAfghanistan claimed it carried out the attack as a “retaliatory” measure, accusing Islamabad of conducting air strikes in its territory earlier this week. For its part, Islamabad has not confirmed whether it was behind the air strikes but maintains that Kabul should “stop harbouring the Tehreek-i-Taliban Pakistan on its soil”.\n\nIn response to Islamabad’s repeated calls to bar terrorists from using its territory for cross-border attacks, Afghanistan denies the allegation of allowing terrorist outfits to use its soil.\n\nMeanwhile, China shares a border with Afghanistan and Pakistan in its western region and has sought to play a mediating role in calming hostilities between the two sides.\n\n“China is willing to continue to play a constructive role in improving and developing Pakistan-Afghanistan relations,” foreign ministry spokesperson Lin Jian said during a regular press briefing.\n\nBeijing hopes that Kabul and Islamabad will “remain calm and restrained, and persist in properly resolving each other’s concerns through dialogue and consultation to avoid escalation of conflicts,” Lin said.\n\nIn August, China’s Foreign Minister Wang Yi attended a meeting with Pakistani and Afghan counterparts in Kabul, calling for strengthening exchanges at all levels.\n\nIn an informal trilateral meeting weeks earlier, hosted by Beijing, China said Kabul and Islamabad had agreed to upgrade their diplomatic ties.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/13151744168d9fa.webp",
  "retrievedAt": "2025-10-16T23:34:25.859Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948624/china-very-concerned-about-border-clashes-between-pakistan-and-afghanistan-foreign-ministry-says",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T10:27:16.000Z"
}
