{
  "title": "Trio win Nobel economics prize for work on innovation, growth and ‘creative destruction’ - World - DAWN.COM",
  "author": null,
  "content": "Joel Mokyr, Philippe Aghion and Peter Howitt won the 2025 Nobel economics prize on Monday for their work on how innovation and the forces of “creative destruction” can drive economic growth and lift living standards across the globe.\n\nTheir research explains how technology gives rise to new products and production methods which replace old ones, resulting in a better standard of living, health and quality of life.\n\n“Over the last two centuries, for the first time in history, the world has seen sustained economic growth. This has lifted vast numbers of people out of poverty and laid the foundation of our prosperity,” the Royal Swedish Academy of Sciences, which awards the prize, said in a statement.\n\nThe laureates have also shown that such progress cannot be taken for granted, the Academy said, while two of the prize winners highlighted that US President Donald Trump’s trade policies would impinge on growth.\n\n“Economic stagnation, not growth, has been the norm for most of human history. Their work shows that we must be aware of, and counteract, threats to continued growth,” the Academy said.\n\nWhile most economists view economic growth as a driver of prosperity, there are some who do not see it as an unalloyed good.\n\nThe 2024 Economics prize was won by Daron Acemoglu, Simon Johnson and James Robinson for work on inequality and Johnson in particular has pointed to how the benefits of technological innovation can be skewed toward powerful elites.\n\nThere is also a fierce debate about what level of growth is sustainable in light of man-made climate change and environmental degradation.\n\nThe prestigious award, formally known as the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel, is the final prize to be given out this year and is worth 11 million Swedish crowns ($1.2m).\n\nMokyr, a professor at Northwestern University in the United States, was awarded half the prize.\n\nAghion, a professor at the College de France and INSEAD in Paris and at the London School of Economics and Political Science, and Howitt, a professor at Brown University in the United States, shared the other half.\n\nThe award comes at a potential inflexion point for the global economy with many expecting artificial intelligence to spark a new growth spurt.\n\nIt also highlights the strategic risks for Europe of falling further behind the United States and China on technologies of the future as well as the potential costs of barriers to global trade.\n\nSpeaking by phone at the press conference, Aghion said de-globalisation and tariff barriers were “obstacles to growth” adding that the bigger the market the more possibilities to exchange ideas, transfer technologies and for healthy competition.\n\n“Anything that gets in the way of openness is an obstacle to growth. So I see there kind of dark clouds currently accumulating, pushing for barriers to trade and openness,” he said.\n\nAghion called on Europe to learn from the US and China, which he said have found ways to reconcile competition and industrial policy.\n\n“In Europe, in the name of competition policy, we became very anti any form of industrial policy. I think we need to evolve on that and find ways to reconcile industrial policy in areas like defense, climate, AI, biotech,” he said.\n\nHowitt, who said he had been “absolutely stunned” by the award, was also critical of President Trump’s trade policies.\n\n“It’s pretty clear that these are going to discourage innovation by reducing what we call the scale effect, he told Reuters. “Starting a tariff war just reduces the size of the market for everybody.”\n\nHe said that trying to bring manufacturing jobs back to the US could perhaps make some political sense but was not good economic policy.\n\n“We’re good at designing running shoes, but it’s best for us to leave others to make them,” he said.\n\nThe awards for medicine, physics, chemistry, peace and literature were announced last week.\n\nThose prizes were established in the will of Swedish dynamite inventor and businessman Alfred Nobel and have been handed out since 1901, with a few interruptions mostly due to the world wars.\n\nThe Economics prize was established much later, being given out first in 1969 when it was won by Norway’s Ragnar Frisch and Jan Tinbergen from the Netherlands for work in dynamic economic modelling.\n\nTinbergen’s brother Nikolaas also won a prize, taking home Medicine in 1973.\n\nWhile few economists are household names, relatively well-known winners include former US Federal Reserve chairman Ben Bernanke, and Paul Krugman and Milton Friedman.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/13175418635b063.webp",
  "retrievedAt": "2025-10-16T23:34:26.147Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948667/trio-win-nobel-economics-prize-for-work-on-innovation-growth-and-creative-destruction",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T13:18:35.000Z"
}
