{
  "title": "Ancelotti ready to make World Cup history with Brazil - Sport - DAWN.COM",
  "author": null,
  "content": "No country has ever won the World Cup with a foreign-born coach, but Carlo Ancelotti said Monday that there was “always a first time” as he eyes glory with Brazil.\n\nThe Italian became Brazil’s first overseas coach in six decades when he took over in May, and he helped the five-times champions punch their ticket for next summer’s World Cup.\n\nBrazil face Japan in a friendly in Tokyo on Tuesday, fresh from a 5-0 hammering of South Korea in Seoul last week.\n\nAncelotti said he is aiming to create history for himself and his team at the World Cup in the United States, Canada and Mexico.\n\n“My goal is to give my best for the Brazil national team, to try to get them to perform at their best and to win the World Cup,” he said.\n\n“Of course, no foreign-born coach has ever won the World Cup, but there is always a first time in life.”\n\nBrazil made hard work of qualifying, finishing fifth in the South American table.\n\nAncelotti is their fourth coach since Tite stepped down following the quarter-final loss to Croatia at the 2022 World Cup in Qatar.\n\nBrazil sparkled against South Korea, with 18-year-old starlet Estevao scoring twice and Real Madrid pair Rodrygo and Vinicius Jr. also among the goals.\n\nBrazilian fans hailed the win as a return to “jogo bonito”, but Ancelotti said there was more to his team than that.\n\n“Brazilian players have the quality to play beautiful football, but you have to think about what you mean by beautiful football,” he said.\n\n“Brazilian players have individual quality, but that is combined with teamwork and movement off the ball, and that’s very important in football.”\n\nBrazil travelled to Asia without forward Neymar, 33, who was ruled out of action until at least November with a thigh injury.\n\nTime is running out for Brazil’s record goalscorer to force his way back into the squad before the World Cup.\n\nAncelotti said there were no questions over Neymar’s quality.\n\n“If Neymar is in good condition, then of course he can fit into the national team,” he said.\n\n“If Neymar is fit, then he can play in any team in the world.”\n\nBrazil have kept four clean sheets in their five games since Ancelotti took over, having been porous at the back before then.\n\n“He’s Italian, so he likes his team to defend well,” said their Newcastle midfielder Bruno Guimaraes.\n\n“Especially at the World Cup, the teams that don’t concede goals win the title, so it’s essential that we defend well.”\n\nJapan were the first team to book their place at next year’s tournament after cruising through Asian qualifying.\n\nThey have never beaten Brazil in 13 attempts and are without several injured players, including Brighton winger Kaoru Mitoma and Liverpool midfielder Wataru Endo.\n\nCoach Hajime Moriyasu said defeating Brazil would give them the confidence to make an impact in North America.\n\n“We want to win and to grow as a team and give everything for this challenge,” he said.\n\n“Brazil are one of the top teams in the world and we respect them, but we have players who are playing in Europe and getting experience there.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/13190448341b12a.webp",
  "retrievedAt": "2025-10-16T23:34:26.829Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948671/ancelotti-ready-to-make-world-cup-history-with-brazil",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T14:05:44.000Z"
}
