{
  "title": "Heavy rains flood Mexico towns, leave nearly 130 dead or missing - World - DAWN.COM",
  "author": null,
  "content": "Torrential rains that lashed Mexico last week killed at least 64 people and 65 more are missing, the government said on Monday, after a tropical depression triggered landslides and flooding in parts of the Gulf Coast and central states.\n\nThe unnamed depression came toward the end of the rainy season, battering land and bursting rivers that had already been soaked by months of rains, while forecasters were focused on tropical storms and two hurricanes on the Pacific coast.\n\n“This intense rain was not expected to be of such magnitude,” President Claudia Sheinbaum told reporters.\n\nAdmiral Raymundo Morales, Mexico’s Navy secretary, said the flooding was the result of the coming together of warm and cold air fronts over rivers that were already filled to the brink and mountains weakened by months of rain.\n\nAround 100,000 homes were affected, Sheinbaum said. She is set to meet with the finance ministry later in the day to discuss rebuilding efforts, and visit some hard-hit states.\n\nLaura Velazquez, national coordinator of civil protection, said Hidalgo and Veracruz were the states worst affected, with 29 deaths and 18 missing reported in Veracruz, and 21 deaths and 43 missing in Hidalgo.\n\nThe rain also destroyed infrastructure such as bridges and left streets filled with mud. Videos and images from last week showed emergency responders wading through deep waters to find stranded residents and get supplies to affected communities.\n\nAuthorities have deployed thousands of personnel to help evacuate, clean up and monitor the places that were hardest hit.\n\nElectricity, which had been knocked out in towns across five states, has largely been restored. Authorities said they will also focus on containing the spread of viruses such as dengue, carried by mosquitoes that breed in stagnant water.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1323111627eb4ce.webp",
  "retrievedAt": "2025-10-16T23:34:24.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948699/heavy-rains-flood-mexico-towns-leave-nearly-130-dead-or-missing",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T18:12:40.000Z"
}
