{
  "title": "Incentivising cooperative farming - Newspaper - DAWN.COM",
  "author": null,
  "content": "While the issue of corporate farming is hit by unending controversy for various reasons, policymakers plan to offer innovative ways to develop cooperative farming for increasing productivity and earnings of small and medium sized farms.\n\nFederal Minister for Food Security and Research Rana Tanveer Hussain says small and medium farmers, who make up the majority of cultivators, face persistent challenges in accessing modern technology, affordable inputs, and profitable markets. Cooperative farming, he said, provides a collective solution to these problems.\n\nInformed estimates suggest that slightly over 90 per cent of the total farming community in Pakistan falls under the category of small farms with less than 12.5 acres of land for cultivation, says an international consultant, adding, “this very community, the majority, will be at threat” from corporate farming.\n\nAs per Dr Ally R Memon, an academic based in the UK and involved with public sector consultancy projects, cooperative farming is a system where farmers voluntarily join together to form organisations (cooperatives) with the intention of mutual benefit under the core idea of collective action.\n\nAs the government urges the necessity of collaborative agriculture practices, critics question the actual benefits to small and medium sized farms\n\nIt is a way of organising, elaborates Dr Memon, whereby joint purchasing of inputs occurs. Produce is collectively marketed to get better prices, equipment and labour is shared, financial services are provided to members of the cooperative, and so on. Success in cooperative farming is measured by its contribution to the incomes of farmers who are part of cooperatives.\n\nHowever, the ability and scope of independent small-scale farmers to benefit or perform in a corporate farming environment may be handicapped, weakened or diminished. In his article titled ‘Corporate vs Cooperative Farming’ published by The Friday Times, Dr Memon questions who the real beneficiary of cooperative farming will be.\n\nIn his view, “The corporations will be able to control supply chains and determine pricing [ie market manipulation].” He further shared that corporations absorb small local farmers even in developed countries.\n\nMr Hussain, on the other hand, has a different view on cooperative farming. In a recent press release the federal minister stated, “Cooperative farming ensures that every farmer, regardless of land size, has access to advanced machinery, climate-smart techniques, interest-free agri-finance, and direct market linkages.” He further explained that this model reduces production costs, eliminates middlemen, and guarantees farmers a fair share of profit.\n\nThe federal minister stressed: “This is not merely an agricultural plan; it is a social and economic revolution that will empower farmers and secure Pakistan’s future.”\n\n“The corporations will be able to control supply chains and determine pricing [ie market manipulation],” worries Dr Ally R Memon, an academic based in the UK\n\nTested on a tiny scale, according to a study by local experts, cash crop farmers, who were part of a cooperative in Punjab, witnessed an increase in the yield, with a 38pc higher benefit-cost ratio than non-cooperative growers.\n\nMoreover, a Food and Agricultural Organisation document released on October 22, 2024 recommended that Pakistan should promote the formation of farmer cooperatives to pool resources, share knowledge, and jointly invest in machinery. It recommended developing and disseminating low-cost mechanisation solutions through partnerships, cooperative models, and policy dialogue.\n\nExperts say mechanised farming is neither feasible nor possible on small farms. It is cooperative farming which can make it possible by consolidating small holdings into enlarged farm sizes.\n\nThe Cooperative Societies Amendment Act of 2020 provides the legal framework for the establishment of cooperative entities and outlines the rules and procedures for the registration, administration, and functioning of cooperative societies, emphasising democratic decision-making and equitable distribution of benefits.\n\nThe government has also accepted recommendations of the National Commission for Food and Agriculture regarding the need to introduce cooperative farming in Pakistan, says Dr Memon.\n\nToday, more than 12pc of the world’s population are members of three million cooperatives, providing 280m jobs worldwide. The world’s 300 largest cooperatives have a global turnover of about $2.4 trillion.\n\nChairing a high-level meeting on cooperative farming and marketing, also attended by Rana Iftikhar Muhammad, President of the Chamber of Agriculture Punjab, and other stakeholders, the federal minister called the government’s initiative the “backbone of sustainable agriculture”.\n\nThe cooperative farming model will not only uplift the rural economy but also help Pakistan reduce reliance on costly food imports, Mr Hussain stressed. With improved yields through intercropping and value addition, he added, the country can cut down its reliance on imported wheat, pulses, and edible oil, saving valuable foreign exchange.\n\nCooperative farming is a bottom-up approach to bring a vital segment of the informal economy into the documented sector.\n\nHowever, transparency and accountability to shareholders are required to ensure a fair deal to everyone pooling their farmland and resources to make the cooperative a success which would then lead to the value of each piece of land expressed in corresponding shareholding to rise. This would encourage more small farmers to join co-operatives.\n\nThe government is committed to supporting farmers through modern storage facilities, processing units, and export-oriented packaging centres under the cooperative model, said the minister.\n\nReaffirming the government’s resolve, he said the ministry would provide technical guidance and financial assistance through innovative mechanisms to ensure success.\n\nPublished in Dawn, The Business and Finance Weekly, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/130806013fafd1c.webp",
  "retrievedAt": "2025-10-16T23:34:30.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948403",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T02:09:46.000Z"
}
