{
  "title": "Noman derails South Africa to 216-6 in first Pakistan Test - Sport - DAWN.COM",
  "author": null,
  "content": "Spinner Noman Ali grabbed four wickets to restrict South Africa to 216-6 at the close of play on day two of the first Test in Lahore on Monday, despite a fighting half century from Tony de Zorzi.\n\nSpinners dominated on a turning Gaddafi Stadium pitch as all the day’s 11 wickets went to slow bowlers, with South African left-armer Senuran Muthusamy taking a career-best 6-117 to dismiss Pakistan for 378.\n\nZorzi was holding the fort at the close with 81 not out and Muthusamy on six as South Africa trail by 162 runs in the first innings.\n\nZorzi batted with guts, knocking nine boundaries and a six, combating Noman, who claimed 4-85.\n\nSouth Africa started off well with 45-0 on the board when Noman removed touring skipper Aiden Markram for 20 and Wiaan Mulder for 17 — both caught behind by wicketkeeper Mohammad Rizwan.\n\nRyan Rickelton, who scored a punishing 71 with two sixes and nine boundaries, and Zorzi added 94 for the third wicket, taking on the spinners with some aggressive shots.\n\nIt was part-timer Salman Agha who broke the stand by forcing an edge from Rickelton with Babar Azam taking a smart low catch in the slips.\n\nNoman returned for his third spell to get Tristan Stubbs caught behind for eight and Kyle Verreynne leg-before for two while Sajid Khan removed Dewald Brevis for a golden duck.\n\n“We need to get them out as early as possible, and a 120-run lead would help us win this Test,” said Noman.\n\n“This pitch will further help spinners in the coming days, so it’s good for us.”\n\nEarlier, it was Noman’s like-for-like left-armer Muthusamy who destroyed Pakistan after they resumed on 313-5, losing their last five wickets for just 16 runs.\n\nMuthusamy, who bettered his previous Test best of 4-45 against Bangladesh in Chattogram last year, said: “It was really nice to add value to the team by getting wickets.\n\n“It was not ideal to have lost a wicket close to stumps, but we will fight back tomorrow.”\n\nAgha hit five fours and three sixes in his 93 and was last man out, caught in the deep off spinner Prenelan Subrayen, who took 2-78.\n\nAgha added 49 with Rizwan to take their sixth-wicket stand to 163 before Muthusamy ripped out the middle order with three wickets in the 12th over of the day.\n\nRizwan was the first to go, for 75, when he edged a sharply turning ball to wicketkeeper Verreynne after a knock containing two fours and two sixes.\n\nTwo balls later, Noman went without scoring, bowled when he played down the wrong line, and then Sajid Khan followed first ball, caught in the slips.\n\nIt became 378-9 when Muthusamy bowled Shaheen Shah Afridi, on seven, for his sixth wicket.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/13184311ad86b92.webp",
  "retrievedAt": "2025-10-16T23:34:30.949Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948599/noman-derails-south-africa-to-216-6-in-first-pakistan-test",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T07:30:06.000Z"
}
