{
  "title": "Khyber Pakhtunkhwa records first death of year from dengue - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: A 30-year-old person died of Dengue Haemorrhagic Fever in Mardan on Sunday, one of the high-risk districts of the province for the vector-borne ailment.\n\nIt is the first mortality from the vector-borne disease this year so far, according to an official report.\n\nIt said that the patient was admitted to Mardan Medical Complex (MMC) on September 30 but he left the hospital at his own.\n\nHe left the ward against medical advice after two days and opted for home isolation where he received a lot of dextrose water drips that deteriorated his condition, doctors said.\n\nTotal number of cases reaches 3,236\n\nThey said that the patient was re-admitted to the same hospital two days ago, but he couldn’t survive.\n\nMeanwhile, the report released by Integrated Disease Surveillance and Response System (IDSRS) of the directorate- general health services, Khyber Pakhtunkhwa, the man was diagnosed positive for dengue virus five days ago. He breathed his last in Mardan district.\n\nIt said that Khyber Pakhtunkhwa reported 34 more dengue patients during the last 24 hours, making the overall tally of the province-wide cases 3,236.\n\nThe report said that the number of hospitalised dengue patients reached 57 as 10 more infected persons were admitted to health facilities.\n\nIt said that the disease had so far sent 1, 365 patients to hospitals.\n\nOf the total confirmed patients, 2,990 have recovered and the tally of active cases is 245 in the province.\n\nCharsadda is leading the list of positive cases with 1,008 patients followed by Haripur with 301 cases, Mansehra with 299 cases, Peshawar with 294 cases, Mardan with 253 cases, Swabi with 132 cases, Kohat with 125 and Abbottabad with 114 cases.\n\nDoctors associated with anti-dengue campaign told this scribe that they had been asking people to adhere to guidelines but all their requests had fallen on deaf ears.\n\n“Today (Sunday), we visited dozens of houses in Sufaid Dheri locality where 16 persons have tested positive for Chikungunya. We have found that almost every house is full of larva,” they said.\n\nOfficials said that on the directives of the director general health services, Dr Shahid Yunis, a free medical camp was organised by the district health team in Sufaid\n\nDheri with support of Rotary International in response to increase in the number of cases of vector-borne diseases where more than 650 patients received curative services provided by male and female teams of doctors.\n\nThey said that facilities of screening and testing of symptomatic patients and oral polio vaccine were also provided to locals by paramedical staff of Peshawar district health office.\n\nOfficials said that the activities were supervised by Dr Mohammad Atif Khan, the deputy district health officer, Dr Anthony Alamzeb Feroz, the public health coordinator, and Dr Mussawir Manzoor, the deputy director of public health department.\n\nThe district entomologist, Aminullah, and IDSRS’s Mustaqeem Afridi conducted awareness sessions, highlighting the importance of community involvement in protection against vectors during the high-risk season.\n\nHouses in high disease burden areas were inspected, larvae was identified and community was sensitised on water storage and destruction of larvae practices, they said.\n\nThey said that people should store water but in covered pots to deny breeding space to mosquitoes, the transmitters and carrier of the dengue.\n\nExcessive power outages have forced people to store water but they should keep in mind that utensils should be covered to put brakes on production of mosquitoes, they added.\n\nHealth experts said that mode of transmission for dengue and Chikungunya was the same as both were caused by mosquito-bites and the only way of protection was store water in safe manner.\n\nLast year, three persons had died of dengue fever of the total 4,200 infections recorded in the province.\n\nThis year, health department started following the guidelines due to which the mortalities declined.\n\nThey said that temperature was still appropriate for mosquitoes and cases would rise during the current month but awareness was key to safety from the disease.\n\nPublished in Dawn, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/130959239c73ff3.webp",
  "retrievedAt": "2025-10-16T23:34:34.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948473/khyber-pakhtunkhwa-records-first-death-of-year-from-dengue",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T01:57:01.000Z"
}
