{
  "title": "Situationer: A night of deadly clashes - Newspaper - DAWN.COM",
  "author": null,
  "content": "FOR almost seven hours, Pakistan pounded targets inside Afghanistan along the entire stretch of the border, from Arandu in Chitral to Angoor Adda in South Waziristan.\n\nThe fighting ensued after the Afghan Taliban, around 9pm, targeted the Pakistani position along the Gavi border belt in Kurram. The apparent provocation for this cross-border aggression was a drone strike by Pakistan on a militant hideout in which 27 terrorists were killed inside the Pakistani territory.\n\nWhat began in the north soon expanded to the rest of the border, as Afghan forces struck several Pak­istani posts from Kunar, Nangarhar, and Nuristan provinces. Tirah Valley also came under attack after mortar shells fired by the Afghan Taliban landed in a village, leaving a civilian dead and a child injured.\n\nBefore midnight, both sides had entered fierce clashes and Pakistani forces had begun to conduct decisive artillery and air force strikes to take out the hostile positions along the border, forcing the Taliban fighters to retreat. Besides heavy artillery, PAF jets pounded multiple Afghan posts and militant positions, said sources who closely monitored the hours-long overnight battle.\n\nHow it all started from a drone strike on a hideout of terrorists\n\nAccording to sources, air raids by Pakistan targeted hostile positions in the Afghan provinces of Helmand, Kandahar, Khost, Paktia, and Paktika. The jets with their precision strikes destroyed the 2nd Kandak headquarters and strongholds of Aziz, Rawat, and Naka among others. “By midnight, 11 Afghan posts were neutralised and 27 hostile targets were destroyed, with heavy explosions heard deep inside the Afghan territory,” they said.\n\nAs PAF jets thundered in the Afghan airspace taking out the Taliban border posts and terrorist positions, the Taliban forces reached out to Pakistan for a ceasefire — a request turned down by Pakistan and military operations continued late into the early hours of Sunday.\n\nFrom 2am to 4am, the artillery with the PAF continued to pound Afghan positions, reportedly destroying the enemy sites at Barbcha, Ali Dost, Malgai Koh, Turkmanzai Top, and Kharachar Fort. This onslaught forced the Afghan forces to withdraw from several forward posts after they suffered major losses.\n\nAttacks along border\n\nIn Lower Dir, Pakistani security forces gave a strong response to the Afghan forces at the Shahi Binshahi Border, repulsing attacks and forcing the Taliban forces to retreat.\n\nIn Lower South Waziristan, several villages along the border came under Afghan fire — a move that prompted retaliation by the forces, which inflicted significant human and material losses on the Afghan side. Sources added that during the retaliatory operation, one Afghan post was captured, and the Pakistani flag was subsequently hoisted at the captured position.\n\nAmid these clashes, there were multiple infiltration attempts soon after midnight when the Taliban tried to infiltrate from Sra Kwand in Angoor Adda area of South Waziristan, said sources. This was, however, foiled.\n\nAfter hours of bombing and gunfire, the situation returned to normalcy around 4am. “The situation remains tense but under control on Pakistan’s side as PAF jets and artillery units remain on high alert as cross-border fire reportedly subsided after 04:00 hours, but heightened vigilance continued along the western frontier,” sources said.\n\nAs Pakistan and Afghanistan traded fire, the authorities immediately closed the Angoor Adda border, resulting in a complete suspension of bilateral trade activities. The sudden closure left dozens of trucks stranded on both sides of the border. It may be mentioned here that Angoor Adda border had reopened only ten days ago after a closure of two years.\n\nIn Khyber, the Torkhum border crossing was also closed. However, the situation at this crossing remained peaceful. Residents at the Bacha Maina residential compound told Dawn that some of the families moved to Landi Kotal after the border security forces ordered the closure of the border at midnight.\n\nIn North Waziristan, the Ghulam Khan border was closed following an exchange of fire between Pakistani and Afghan forces in different areas along the border.\n\nIn Kurram, an emergency was declared in all hospitals and the Kharlachi border crossing with Afghanistan was closed. Tribal fighters in the district reportedly moved to assist security forces on the frontline amid continuous artillery duels near Kharlachi and Manujaba Forts.\n\nWith input from our correspondents in Dir, Khyber and South Waziristan, North Waziristan and Kurram\n\nPublished in Dawn, October 13th, 2025\n\nHeader image: People carry a Pakistani flag-draped coffin of soldier Aslam Jadran, who died following the overnight border clashes between Pakistan and Afghanistan, during a funeral in Kurram on October 12. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1308063561c41ea.webp",
  "retrievedAt": "2025-10-16T23:34:31.711Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948511/situationer-a-night-of-deadly-clashes",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T01:56:19.000Z"
}
