{
  "title": "Rising numbers of stray dogs in Karachi make citizens’ lives unbearable - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The unchecked rise in the stray dog population has made life increasingly unbearable for citizens across Karachi, with frequent attacks causing injuries, deaths and widespread fear in various localities of the metropolis.\n\nIt has become a common sight to see packs of dogs roaming freely in the streets of the city, often hounding passers-by, particularly children and women, and motorcyclists.\n\nWhile cases of dog bites are becoming increasingly common, around two dozen people have died due to rabies during the current year.\n\nSources said that the town mun­i­cipal corporations (TMCs), which are responsible for taking measures against stray dogs in their respective jurisdictions, as well as the Rabies Control Programme Sindh (RCPS), established in 2018 with an objective to address rabies and eliminate deaths caused by dog bits, have failed to implement sustained control measures.\n\nStreet dogs roam freely everywhere in city including educational institutions, public parks; frequent attacks spread fear among residents\n\nThe RCPS pledges to control the stray dog population through humane methods such as trap-neuter-return (TNR) and trap-neuter-vaccinate-return (TNVR), alongside neutering and spaying instead of culling. It also promises to raise public awareness and promote empathy towards animals.\n\nIn private conversations, the TMCs expressed doubt over the efficacy of the “humane methods” as they believed that the erstwhile poison method of dog culling was a better choice.\n\nMany residents whom Dawn spoke to argue that while the emp­h­asis on “humane methods” is com­m­endable, the programme’s implementation has delivered little tangible relief, with dog-bite cases and daily hardships steadily increasing.\n\nThey contend that without result-oriented strategies and stronger coordination with municipal authorities, the menace will only intensify, as TNR, TNVR, and even relocation to outlying areas have so far failed to bring any respite to residents.\n\nVoices from neighbourhoods\n\nIn District East’s Gulistan-i-Jauhar and Safoora, residents complain that even routine activities such as walking to the market or sending children outside to play have become risky.\n\n“We feel safe only when travelling by car. If we are on a motorcycle or on foot, especially while carrying something, these stray starving dogs inevitably chase us. They either attempt to snatch our belongings or attack, leaving us terrified,” said one resident.\n\nRecently, a news went viral on social media stating that even Karachi University was not free from the menace.\n\nA student from the Department of Food Sciences was reportedly injured after falling when chased by stray dogs inside the campus.\n\nIn Surjani Town, New Karachi and other neighbourhoods of District Central, families said they had stopped allowing children to play outside in the evenings.\n\n“Every other day we hear of dog-bite cases here. They bark at women and children, and when they panic and run, the dogs attack,” a resident explained.\n\n“During the day one somehow manages, but at night it becomes impossible to walk through the streets,” he added.\n\nSimilarly, in Liaquatabad and Gulberg, residents complained not only of safety risks but also of financial losses. A man named Mehmood recounted how a stray dog damaged the bumper of his car, leaving him with unexpected repair costs. He said such incidents added to the burden of already strained households.\n\nResidents of Korangi voiced similar concerns, saying the issue had now begun to directly affect public spaces such as schools and parks.\n\nA woman expressed shock over the presence of stray dogs in the playground of a government scho­ol, warning that the safety of schoolchildren was being compromised due to the administration’s negligence.\n\nLocals further noted that at Korangi 5 Model Park, dogs frequently chase joggers — particularly women — disrupting the calm and freshness associated with morning walks.\n\n“Even if they don’t bite, the mere contact with clothes feels disgusting,” one resident said, adding that this constant nuisance was an example of how an unchecked problem, if ignored for long, could gradually encroach upon people’s everyday freedoms.\n\nIn Orangi and Baldia towns of District West, residents said the menace had turned simple routines such as commuting to work or attending prayers into unsafe experiences.\n\nAn elderly man said: “Nowadays it is even difficult to go for Fajr prayers. These dogs rush towards you barking or attempt to bite. One has no choice but to fend them off with stones or carry a stick for protection.”\n\nA similar situation is evident in District South, where residents complain that walking through markets has become nearly impossible. A woman from Lyari said that dogs often chased people returning from meat shops.\n\nA man from Malir recounted how his brother and sister-in-law were injured when they fell from their motorbike while being chased by dogs; his sister-in-law sustained a deep head injury. Such incidents, he argued, show that the menace has gone far beyond being a mere nuisance, and now poses a direct threat to both life and property.\n\nAuthorities’ response\n\nWhen contacted about measures being taken against stray dogs, Safoora Town Chairman Rashid Khaskheli said that whenever complaints are received, the sanitation department captures dogs and releases them in remote areas, sometimes in coordination with the Edhi Foundation.\n\nHe added that in cases where a dog turns rabid and poses a direct threat to residents lives, the department “have no option but to kill it by administering poison”.\n\nAt a recent programme held in connection with World Rabies Day, Minister Nasir Shah has said that the Sindh Government was paying special attention to the vaccination programme to protect human lives.\n\nHe said that vaccination of street dogs can help control rabies. He said that there will also be dog lovers in society who oppose the killing of stray dogs.\n\nPublished in Dawn, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68ec45f3ae495.jpg",
  "retrievedAt": "2025-10-16T23:34:34.787Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948460/rising-numbers-of-stray-dogs-in-karachi-make-citizens-lives-unbearable",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T01:56:44.000Z"
}
