{
  "title": "‘I’m good at making peace’: Trump turns attention to border skirmishes between Pakistan and Afghanistan - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Monday appeared eager to ease tensions between Pakistan and Afghanistan after border skirmishes between the two countries over the weekend, saying he was “good at making peace”.\n\nIntense border clashes between Pakistan and Afghanistan started late on Saturday night and continued into Sunday morning. The Inter-Services Public Relations (ISPR) said that 23 troops were martyred and 200 Taliban and affiliated terrorists were killed when Islamabad responded to aggression by Kabul.\n\nThe US president, since returning to the White House for his second term in January, had repeatedly insisted in the run up to the Nobel peace prize that he deserved the award for his role in resolving eight conflicts — a claim observers say is broadly exaggerated.\n\nThe US president touched on the border hostilities between Pakistan and Afghanistan while speaking to reporters on Air Force One as he flew from Washington to Israel. Tel Aviv and Hamas are set to carry out a hostage-prisoner exchange as part of the first phase of the Gaza peace plan proposed by Trump.\n\nDuring the interaction with the media, a reporter stated that the US president was receiving credit from Democrats and Republicans for securing the peace deal in Gaza.\n\n“Where do you think it fits into your legacy?” the reporter asked.\n\n“This will be my eighth war that I’ve solved. And I hear now there’s a war going on between Pakistan and Afghanistan. I said, ‘I’ll have to wait till I get back’. I am doing another one’. Because I’m good at solving wars, I’m good at making peace and it is an honour to do it. I save millions of lives,” he said.\n\nCommenting on the Nobel peace prize being awarded to Venezuelan opposition leader Maria Corina Machado, he said: “In all fairness to the Nobel committee, it was for 2024 … But there are those that say you could make an exception cause a lot of things happened during 2025 that are done and completed and great.\n\n“But I did this not for Nobel, I did this for saving lives,” he said.\n\n“Think about India-Pakistan. Think about some of the wars that were going on for years. We had one going for 31 [years], one going for 32 [years] and one going for 37 years. And I got every one of those done, for the most part, within a day. It’s pretty good,” he said.\n\nHe went on to say that he had settled “a few of the wars just based on tariffs”.\n\n“With India and Pakistan, I said if you guys want to fight a war and you have nuclear weapons, I’m going to put big tariffs on you both; like a 100 per cent, a 150pc and 200pc … I had that thing settled in 24 hours. If I didn’t have tariffs you could have never settled that war,” he said.\n\nTrump has repeatedly claimed credit for ending the May conflict between India and Pakistan. The conflict, the worst between the old foes in decades, was sparked by an attack on Hindu tourists in occupied Kashmir, which New Delhi, without evidence, said was backed by Pakistan. Pakistan has denied involvement, with the foreign ministry having questioned the credibility of India’s account of the events, saying it was “replete with fabrications”.\n\nBoth sides used fighter jets, missiles, artillery and drones during the four-day conflict, killing dozens of people, before agreeing to a ceasefire. In the immediate aftermath of the conflict, Pakistan said it took down six Indian fighter jets during the conflict, including the French-made Rafale. New Delhi acknowledged “some losses” during the conflict but denied losing six jets.\n\nAdditional input from AFP and Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/130828501e5c5d8.webp",
  "retrievedAt": "2025-10-16T23:34:35.580Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948566/im-good-at-making-peace-trump-turns-attention-to-border-skirmishes-between-pakistan-and-afghanistan",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T04:12:36.000Z"
}
