{
  "title": "Increasing downloads, decreasing developers - Business - DAWN.COM",
  "author": null,
  "content": "You’d think that a country where “is the internet working today?” is a legitimate office conversation starter would struggle with app growth. But somehow, that is not the case. Despite unreliable connectivity and speed, Pakistan’s mobile ecosystem has quietly staged an impressive comeback.\n\nAccording to Data Darbar’s State of Apps Report 2024, after downloads flatlined in 2023 at 3.26 billion, the market revived with 3.56bn installs, a 9.2 per cent increase that outpaced Indonesia, Mexico, the Philippines, and all comparable markets.\n\nIn the process, Pakistanis collectively spent 79.1bn hours on apps this year, up 14.1pc from 2023, and the country still holds its position as the 9th largest app market globally by installs and 12th by usage, maintaining its standings from yesteryears.\n\nBefore we get into which apps won and lost, let’s talk about the foundation that made all of this possible. Pakistan’s mobile broadband subscriptions grew 8.4pc to reach 134.8m users in 2024, pushing broadband penetration to 57pc of the population. Average monthly data consumption hit 8.4GB per user, nearly double the 4.9GB we were consuming back in 2020.\n\nThe only thing growing faster than Pakistan’s app downloads is the number of developers deciding it’s easier to build for other markets\n\nIn terms of reach, it probably doesn’t take a genius to guess which app is the most popular in Pakistan. Quite expectedly, TikTok dominated once again in 2024 with 32.4m downloads, followed by another Bytedance product, ie video editor Capcut, at 27.1m. Meanwhile, Meta’s family of apps, Facebook (24.3m), WhatsApp (22.7m), and WhatsApp Business (20.9m) rounded out the remaining spots in the top five.\n\nThe app usage trends also mirrored Pakistan’s broader internet landscape, one marred by frequent restrictions and censorship. Therefore, it was no surprise that VPN installs remained high, helped further by the blocking of X (which was unblocked in May this year) and the throttling of other platforms. Expectedly, Super VPN downloads jumped 149pc to 19.1m while Secure VPN grew 158pc to 7.6.\n\nIn e-commerce, the biggest story of 2024 was Temu. The Chinese shopping app launched in Pakistan and racked up 8m downloads in its debut year, overtaking Daraz (7.7m) to become the most downloaded shopping platform in the country. In fact, China dominated the top charts, claiming four of the five leading e-commerce apps. The story here is clear: Pakistani consumers are globally connected, highly price-conscious, and well, their online habits are no different from offline purchasing patterns.\n\nTamasha, Pakistan’s most popular streaming platform, saw downloads decline 13.4pc to 10.2m in 2024. On paper, that may seem like a loss. But as the platform is now maturing, reach is no longer the north star, and the focus has shifted towards engagement. Those numbers attest to a better trend as monthly active users surged 61pc to 17.1m, whereas paid subscriptions soared 367pc from 289,000 to 1.35m users.\n\nAs the country held fast its position as the 9th largest app market globally by installs, active developers dropped 26pc to just 1,400 — the steepest annual decline in five years\n\nEasypaisa and JazzCash continued their dominance in digital payments, where the former was on top of the downloads chart (12.1m), while the latter led in terms of monthly active users (19.7m), the highest ever recorded for any Pakistan-based app across any category.\n\nCryptocurrency platforms also saw explosive growth despite regulatory uncertainty. Binance downloads jumped 69pc to 5.4m, while Pocket Broker (a foreign investment platform) surged 1,343pc to 2.6m downloads. While the government has wholeheartedly embraced virtual assets since the start of this year, the specific licensing frameworks are yet to be released, and till then, it’d be hard to imagine a local player capitalising on this demand.\n\nNow for the bad news. While downloads and engagement surged, Pakistan’s developer community contracted sharply in 2024. Active developers dropped 26pc to just 1,400, the steepest annual decline in five years. Similarly, Android app releases plummeted 55pc to 1,700 titles, while game development fell 31pc with only 756 titles released. Part of it is stricter app store policies from Google, which have tightened registration and approval criteria over the past few years. But the bigger issue is that an increasing number of developers are registering their accounts abroad to avoid payment and taxation complications in Pakistan. For third-party analytics platforms like Appfigures and data.ai, this means they’re slipping outside Pakistani domicile and no longer showing up in local developer counts.\n\nOn the other hand, iOS development remained stable at 784 titles released in 2024. For publishers, this is more lucrative as the monetisation potential on Apple is substantially higher than that on Google, despite the former’s lower download volumes. To state the obvious, an iPhone customer is worth way more (almost 8x) than their Android customer.\n\nThe question isn’t whether apps will continue growing in Pakistan. The infrastructure is built, the users are engaged, and the spending is happening. The question is whether Pakistan’s own developers will be part of that growth, or whether they’ll keep watching from the sidelines, or from abroad, as foreign platforms capture the upside. Because right now, the only thing growing faster than Pakistan’s app downloads is the number of developers deciding it’s easier to build for literally any other market.\n\nThis is happening despite the gaming industry generating $300m in total revenue during FY23, including $157.9m from exports. Pakistan currently has 36m online gamers, projected to reach 50.9m by 2025, with over 257 gaming companies employing more than 12,000 people.\n\nThe writer is the co-founder of Data Darbar\n\nPublished in Dawn, The Business and Finance Weekly, October 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68eb8793122ec.jpg",
  "retrievedAt": "2025-10-16T23:34:35.462Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948416/increasing-downloads-decreasing-developers",
  "dateList": "2025-10-13",
  "date_published": "2025-10-13T02:09:46.000Z"
}
