{
  "article_id": "2025-06-07_951cae3302e7d514b4aa7d5efbe2f4fc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-admin-reserves-lake-view-daman-e-koh-parks-for-families/",
    "retrieved_at": "2025-08-27T10:54:09.371Z"
  },
  "metadata": {
    "title": "ICT admin reserves Lake View, Daman-e-Koh parks for families",
    "author": null,
    "date_published": "2025-06-07T06:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 243,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 07 (APP): The district administration of Islamabad has declared that Lake View Park and Daman-e-Koh will remain open exclusively for families during the three days of Eid ul Azha. According to an official notification, both parks have been designated as \"family-only\" venues for Eid. This decision has been taken to manage crowds and ensure a safe environment for parkgoers during the festive holidays. In this regard, Additional Deputy Commissioner Sahibzada Yousuf issued the notification, confirming that the new rule will be in effect throughout all three Eid days. Officials said this step aims to improve the experience for families visiting these public places. Authorities are expected to enforce the restriction strictly, with security personnel deployed at entry points to verify visitors. The announcement comes as thousands of residents typically head to parks and picnic spots during Eid holidays. Parks like Lake View and Daman-e-Koh attract large crowds, often leading to congestion and complaints from families. By limiting entry to families, the administration hopes to manage footfall and maintain order. District officers also appealed to citizens for cooperation, requesting them to respect the decision and avoid visiting in groups that do not include family members. The move is part of broader efforts by city authorities to improve public space management during peak seasons such as Eid, when local tourism and park visits sharply rise. The notification is effective only for the Eid holidays and does not apply before or after that period.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}