{
  "article_id": "2025-06-07_fe10df8fb710ef8d7ad89d08f0561352",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dc-visits-checkpoints-on-eid-urges-citizens-to-support-cleanup-efforts/",
    "retrieved_at": "2025-08-27T10:53:46.705Z"
  },
  "metadata": {
    "title": "DC visits checkpoints on Eid, urges citizens to support cleanup efforts",
    "author": null,
    "date_published": "2025-06-07T08:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 369,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 07 (APP): On the first day of Eid ul Azha, the Islamabad district administration remained active across the city, focusing on security, traffic flow, and post-qurbani cleanliness. In this regard, Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon, visited checkpoints to greet officers on duty and called for public support in maintaining hygiene after sacrificial rituals. The spokesman of ICT administration said, as the federal capital observed the first day of Eid ul Azha, the district administration took several steps to ensure order and safety. Security remained tight across Islamabad, with officers deployed at key locations and roads. To appreciate the efforts of security personnel, Deputy Commissioner (DC) Islamabad Irfan Nawaz Memon visited various checkpoints in the city, he said. He greeted officers on duty, exchanged Eid wishes, and boosted their morale. The administration also distributed sweets among the deployed personnel. Young officers expressed happiness at the DC's presence, with many taking photos with him. The Additional Deputy Commissioner General also accompanied the DC during the visit. The DC also met citizens in different areas of the city and exchanged Eid greetings with them as well. Speaking about arrangements during Eid, DC Irfan Nawaz Memon said that the administration ensured proper management at cattle markets, which operated smoothly during the pre-Eid days. He credited effective planning and public cooperation for maintaining the flow of traffic around these crowded areas. \"There was no major traffic disruption, thanks to the coordination between citizens and Islamabad Traffic Police,\" the DC stated. Regarding the cleanliness drive, the DC appealed to residents to actively support post-qurbani waste disposal. He said that over 200,000 biodegradable bags had been distributed across Islamabad to help in the proper collection of animal waste. \"We request residents to use these biodegradable bags instead of discarding waste in open spaces,\" he said. \"The administration will make sure that waste is picked up and disposed of in time.\" He further added that maintaining hygiene during Eid ul Azha is a shared responsibility and urged citizens to cooperate with sanitation workers and follow the official instructions. The district administration plans to continue its field visits and monitoring over the next two days of Eid to ensure smooth operations across the city.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}