{
  "article_id": "2025-04-20_4e90c9cfead8da3e92f307718de5d51a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-paidar-commemorate-zimbabwes-national-day/",
    "retrieved_at": "2025-08-27T14:41:39.265Z"
  },
  "metadata": {
    "title": "ISSI-PAIDAR commemorate Zimbabwe’s National Day",
    "author": null,
    "date_published": "2025-04-20T12:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 785,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 20 (APP):The Centre for Afghanistan, Middle East & Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with Pakistan Africa Institute for Development and Research (PAIDAR), organized an event to commemorate Zimbabwe's National Day. The proceedings - which began with the national anthems of Pakistan and Zimbabwe- were moderated by Ms. Amina Khan, Director CAMEA. Speakers included Ambassador Sohail Mahmood, Director General ISSI; H.E. T.M.J Abu-Basutu, (RTD) Air Marshal, Ambassador of Zimbabwe to Pakistan; Mr. Murad Baseer, Ambassador of Pakistan to Zimbabwe; and Ambassador Khalid Mahmood, Chairman, BoG, ISSI, said a press release. The chief guest on the occasion was Senator Mushahid Hussain Sayed, President PAIDAR, while the Keynote Speaker was Ambassador Hamid Asghar Khan, Additional Secretary (Africa), Ministry of Foreign Affairs Pakistan (MOFA). Ambassador Sohail Mahmood extended warm felicitations to the Government and people of Zimbabwe on their 45th National Day. He emphasised that Zimbabwe's struggle for independence, achieved on April 18, 1980, is a story of courage, determination, sacrifice, and resilience that resonates deeply with countries like Pakistan, which share a legacy of anti-colonial struggle and firmly uphold the right of nations to self-determination. He underscored the longstanding friendship between Pakistan and Zimbabwe, built on shared principles of solidarity, mutual respect, and South-South cooperation, and recalled Pakistan's strong diplomatic and material support for Zimbabwe's liberation struggle as well as assistance in post-independence institution-building. Ambassador Sohail Mahmood also noted the positive evolution of bilateral relations since their establishment in 1980, with collaboration in key sectors such as education, agriculture, health, and defence. Ambassador Mahmood emphasised that the trade ties between the two countries are gradually growing, but there is still a vast untapped potential to be realised. He also lauded Zimbabwe's role as a key partner in Southern Africa under Pakistan's 'Engage Africa' policy and welcomed the opening of Zimbabwe's embassy in Islamabad in 2023. He concluded by reaffirming Pakistan's commitment to furthering the friendship between the two nations, based on shared values, mutual interests, and a common vision for peace, development, and prosperity. In her remarks, Ms Amina Khan highlighted the significance of commemorating Zimbabwe's National Day. She underscored Pakistan's historic support for Zimbabwe's decolonisation and its commitment to Africa under the 'Engage Africa' policy. She also emphasised CAMEA's efforts to enhance ties with the African Continent and called for greater cooperation with Zimbabwe in areas like trade, education, and investment. Senator Mushahid Hussain Sayed highlighted the strategic importance of Pakistan-Zimbabwe relations, extending warm congratulations on Zimbabwe's 45th National Day. He noted that Pakistan supported Zimbabwe's struggle for independence, and ties were further strengthened after independence through high-level visits, including those by President Mugabe to Pakistan and the then Prime Minister Nawaz Sharif to Harare. Emphasising close defence cooperation and solidarity, he called for deeper engagement with the Global South and reaffirmed Pakistan's continued support for Zimbabwe in the years ahead. Ambassador Hamid Asghar highlighted Pakistan's strong, long-standing ties with Zimbabwe, noting Pakistan's early recognition of Zimbabwe's sovereignty and support during its independence struggle, including support to the Zimbabwe Air Force. He emphasised enhancing bilateral economic ties, particularly through trade and investment as part of Pakistan's pivot to geo-economics. He also proposed increasing bilateral visits and promoting initiatives like the Pakistan-Africa Economic Council and an e-commerce platform to boost trade and business with Zimbabwe. Ambassador T.M.J Abu-Basutu, in his remarks, appreciated the ISSI for organising the celebration of Zimbabwe's National Day and highlighted the longstanding, brotherly ties between Zimbabwe and Pakistan. He acknowledged Pakistan's consistent support since Zimbabwe's independence, particularly in defence cooperation and the training of Zimbabwe's Air Force. Emphasising the need to expand bilateral ties, he pointed to the untapped potential in sectors such as trade, mining, tourism, and infrastructure, and called for greater collaboration between the governments and private sectors of both countries to foster economic growth and deepen the partnership. Ambassador Murad Baseer highlighted Pakistan's historic support for Zimbabwe's independence and stressed the need to further strengthen bilateral ties. He emphasised the role of the Pakistani diaspora in Zimbabwe, particularly in business and mining, and suggested leveraging skilled professionals to enhance cooperation. Stressing a stronger emphasis economic diplomacy, he noted Zimbabwe's potential in the agriculture and mining sectors. He urged Pakistani companies to explore long-term investments under the African Continental Free Trade Area (AfCFTA) and emphasised the importance of regional integration, stating that investing in one country can open doors to the entire region. Ambassador Khalid Mahmood, in his vote of thanks, highlighted Zimbabwe's historic struggle for independence and Pakistan's proud role in supporting it, including through defence cooperation. He stressed the need to further strengthen ties, pivot towards geo-economics, and fully utilise existing mechanisms, expressing hope for deeper Pakistan-Zimbabwe relations in the future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}