{
  "article_id": "2025-04-20_fdb247348551d58b53e94cb604f274e4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/prime-minister-launches-nationwide-anti-polio-drive-vows-complete-eradication/",
    "retrieved_at": "2025-08-27T14:40:49.665Z"
  },
  "metadata": {
    "title": "Prime Minister launches nationwide anti-polio drive, vows complete eradication",
    "author": null,
    "date_published": "2025-04-20T18:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 278,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 20 (APP): Prime Minister Muhammad Shehbaz Sharif has reaffirmed the government's commitment to eradicating polio from the country, announcing the launch of a fresh 7-day national anti-polio campaign aimed at vaccinating millions of children under the age of five. Speaking at the inaugural ceremony of the campaign on Sunday, the Prime Minister said that the government, along with health authorities, is making tireless efforts to eliminate the virus once and for all. \"Today marks the beginning of another nationwide polio campaign. With Allah's grace, we are vaccinating children not only here, but across the country including Gilgit-Baltistan and Azad Kashmir,\" he said. The Prime Minister personally administered polio drops to children to formally kick off the campaign, which will conclude on April 27. He praised the efforts of the Ministry of Health, including Minister Mustafa Kamal, Dr Malik Mukhtar Ahmed Bharath, the Secretary, Coordinator, and frontline health workers for their dedication. \"I urge all parents to fully cooperate with field teams to ensure every child is vaccinated,\" he added. Acknowledging challenges in some security-sensitive areas, he said that robust measures have been taken to ensure the safety of teams and smooth implementation of the drive. \"We must mobilize communities in every neighborhood and street to support this national cause,\" he emphasized. The premier also extended heartfelt thanks to international partners such as the World Health Organization (WHO), Bill Gates, and other stakeholders for their continued support. \"With your cooperation and our collective resolve, I am confident we will achieve permanent relief from this dangerous disease,\" he said. Federal Health Minister Mustafa Kamal, Dr Malik Mukhtar Ahmed Bharath, and senior health officials were present at the event.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}