{
  "article_id": "2025-04-20_b1dd3b4e6dfebe41f59a83d254267977",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aphc-slams-hindutva-agenda-projection-in-iiojk-urges-release-of-detainees/",
    "retrieved_at": "2025-08-27T14:41:40.992Z"
  },
  "metadata": {
    "title": "APHC slams Hindutva agenda projection in IIOJK, urges release of detainees",
    "author": null,
    "date_published": "2025-04-20T10:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 345,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 20 (APP):The All Parties Hurriyat Conference has strongly denounced the projection of Hindutva agenda by the India's ruling BJP-RSS regime in the name of reviving so-called pre-Islamic Hindu civilization in Indian illegally occupied Jammu and Kashmir . APHC spokesman Advocate Abdul Rashid Minhas in a statement issued in Srinagar termed the the settling of non-locals in Kashmir and the selling of Kashmiri properties to outsiders as an attempt to to eradicate the Muslim majority character of the occupied territory. Minhas warned that New Delhi cannot undermine Kashmiris' genuine struggle for self-determination by mean tactics. He urged the international community to force India to maintain Kashmiris' identity and implement UN resolutions for final settlement of the Kashmir dispute. The APHC spokesman while demanding immediate release of thousands of Kashmir including Hurriyat leadership languishing in different jails said that Jammu and Kashmir is an internationally recognized disputed territory and placing restrictions on their freedom to speech is against the international law. He said that the people of Kashmir had been engaged in a peaceful struggle to secure their birthright to self-determination for the past seventy-eight years. APHC condemned the attachment of properties of local people saying communal elements have wicked plans to divide the Kashmir valley on communal lines after abrogation of article 370 and 35-A. The spokesman deplored that under the nefarious agenda of bringing a demographic change, India has issued tens of thousands of domicile certificates to outsiders in past six years in the Kashmir valley and Jammu region. To rob Kashmiris of their identity and rights, the he said, India is issuing domicile certificates to non-Kashmiris on fast-track basis, which is clear violation of UN resolutions on Kashmir. Besides, the BJP govt is using brutal tactics like illegal confiscations, forced evictions, termination of employees and demolition of properties to effect a demographic change in the territory as soon as possible. The people of Kashmir are least interested in Narenda Modi's development mantra. What is important for them is their right to self-determination, which BJP-led Indian govt never likes to discuss, he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}