{
  "article_id": "2025-01-07_f71bb5d514f390550f6def0a7691efa7",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883527/sindh-assembly-opposition-raises-concerns-over-boys-drowning-in-open-manhole",
    "retrieved_at": "2025-08-26T07:31:20.587Z"
  },
  "metadata": {
    "title": "Sindh Assembly opposition raises concerns over boy’s drowning in open manhole - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T02:52:32.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 839,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "- Minister urges collective action to prevent children from falling into uncovered gutters - Says KWSC placed covers on 32,000 manholes last year - House passes resolution to pay tribute to Zulfikar Ali Bhutto on birth anniversary KARACHI: The Sindh Assembly on Monday echoed with the opposition's concern over the death of a minor boy, who drowned in an open manhole in Shah Faisal Colony a day before, as it criticised the authorities for being \"inefficient\" while Local Government (LG) Minister Saeed Ghani appealed to the public to 'take action' against unscrupulous elements involved in stealing the covers. At the outset of the proceedings, Leader of the Opposition Ali Khurshidi of the Muttahida Qaumi Movement-Pakistan, on a point of order, took up the issue of manholes that lack covers and asked the government to ascertain who was responsible for such negligence. Mr Khurshidi said that there were thousands of open manholes across the city, which posed danger to the public, and demanded that assistance be announced for the deaths that occurred due to lack of sewer covers. Referring to Friday's protest by the opposition in the house, he also said that the controversial results of the inter exams in Karachi was an important issue. He said that the students would have to bear the impact of the poor results as they would not be able to get admission in public universities and professional colleges. Responding to the opposition leaders' concerns over uncovered manholes in the city, LG minister Saeed Ghani said that the provincial government, relevant civic agencies and the public had to play their due role in preventing fatalities of children falling into open sewers. Mr Ghani told the house that the Karachi Water and Sewerage Corporation (KWSC) in the last year had placed 32,000 covers in the metropolis and added that there were around 400,000 utility holes in the city. The LG minister said that every union committee in the city had been asked to keep 50 to 100 manhole covers ready for the uncovered gutters in their respective jurisdictions. He told the house that the covers were either stolen or broken by 'unscrupulous elements' retrieving steel from them. He appealed to the public to take action against persons involved in stealing and smashing of manhole covers. Tribute to Bhutto Members from both sides of the aisle also lauded the political acumen and vision of the founding chairman of the Pakistan Peoples Party, Zulfikar Ali Bhutto, as the house unanimously passed a resolution to pay homage to him on his birth anniversary. Senior parliamentarian and PPP-Sindh President Nisar Ahmed Khuhro tabled the resolution after Speaker Syed Awais Shah suspended all other business on the agenda to discuss the resolution on the request of the Law and Parliamentary Affairs Minister Zia Lanjar. It said the house acknowledged Bhutto's instrumental role in shaping Pakistan's history, notably in establishing the country's nuclear programme, promoting socio-economic development and introducing its first constitution of 1973. \"Shaheed Zulfikar Ali Bhutto's unwavering dedication to democracy and parliamentary supremacy continues to inspire generation of Pakistanis. His selfless efforts to support Pakistan during a critical period have left an indelible mark on the nation,\" the resolution said. Speaking on the resolution, Mr Khuhro said that the greatest achievement of Bhutto was giving the country a unified constitution. The PPP MPA, who is also chairman of the assembly's Public Account Committee, said that it was also necessary to implement the Constitution that the nation was proud of. \"After the Constitution was made, we were able to show our face to the world,\" he said. He said that Asif Zardari, Faryal Talpur and other party leadership had also served jail terms for protecting the Constitution. Former chief minister Syed Qaim Ali Shah said that great personalities like Bhutto were born once in centuries. Paying rich tributes to the former prime minister, Senior Minister Sharjeel Inam Memon said that Bhutto made the country a nuclear power without caring for his life. \"It is the glory of Allah that today even political opponents give examples of Bhutto in their rallies,' he said. The minister said that there was a vast difference between today's leaders and Mr Bhutto, adding that the Simla Agreement was signed and 90,000 soldiers were got released due to tireless efforts of the former prime minister. Shabbir Qureshi of Pakistan Tehreek-i-Insaaf-backed Sunni Ittehad Council said: \"Bhutto's only one achievement is heavy on the world as he got the Constitution amended to the effect that whoever does not believe in the Khatm-i-Nabuwat is not a Muslim.\" PPP's Imdad Pitafi, Irrigation Minister Jam Khan Shoro and Khair-un-Nisa Mughal also spoke on the resolution. Later, the house was adjourned to Tuesday (today). Cake-cutting ceremony After the session, a ceremony was held in the assembly building to commemorate the birth anniversary of Z A Bhutto. The event included a cake-cutting ceremony led by prominent members of the PPP. It was attended by several PPP leaders, and provincial ministers, who paid tribute to the party's founder. Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}