{
  "article_id": "2025-01-07_fadf6e694d539925e129e0b4ff21f9c4",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883645/state-govt-responsible-for-sectarian-fighting-says-fazl",
    "retrieved_at": "2025-08-26T07:30:51.404Z"
  },
  "metadata": {
    "title": "‘State’, govt responsible for sectarian fighting, says Fazl - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T03:42:10.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/677ca2c439d4b.jpg",
    "categories": [],
    "word_count": 591,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR: Jamiat Ulema-i-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman on Monday insisted that the \"state\" and government were responsible for sectarian fighting and inflaming people's sentiments in the country. During a reception hosted by the JUI-F KP chapter at Nishtar Hall here, Mr Fazl said that the presence of sectarian elements in the country was an undeniable fact. He added that it was the state institutions and government that fomented sectarian fighting before blaming it on religious groups. The JUI-F leader said the recent Kurram violence was tribal in nature. Says Kurram violence was tribal in nature He wondered if it was truly a sectarian conflict, then why Hangu and Kohat, where both Shia and Sunni communities lived side by side, were peaceful. Mr Fazl also said it was puzzling why the Kurram fighting didn't affect nearby districts like Hangu, Kohat, Peshawar and Dera Ismail and instead, its \"heat\" was felt in far-off Karachi city and even Iranian capital Tehran. He said that one sect's representatives addressed a news conference in Islamabad, while those of the other sect did the same in Peshawar. \"Who is pulling the strings of these people and bringing them to the fore?\" The JUI-F chief claimed that his party was approached by both sides in Kurram, and when it came up with a solution, violence erupted the very next day. Without naming anyone, he insisted that he received a message questioning his role to calm the situation. Mr Fazl said that Pakistan's democracy and parliamentary system were not perfect and therefore, they're subjected to criticism. He, however, said that a system shouldn't be shunned due to its weaknesses and instead, everyone should work for its improvement. The JUI-F leader said that his party's efforts to strengthen democracy in the country would continue. He said that leadership of all religio-political parties had worked to promote harmony within the nation. \"Our struggle for democracy will continue,\" he said. About a controversy about the madressah bill, Mr Fazl said that while the federal government was talking about mainstreaming seminaries, it was a fact that millions of youth graduating from universities and colleges had been driven for pillar to post for jobs. \"If the government can't provide these graduates with employment, then what it will offer to seminarians,\" he said. The JUI-F chief said that the use of force whether it was against political workers at the D-Chowk or the local government representatives outside the KP Assembly in Peshawar was wrong, and he condemned it. \"Both of these incidents should be treated alike,\" he said. Mr Fazl said that those who stole elections and changed their results by force should bear in mind that they would face the fate of former Bangladesh prime minister Hasina Wajid or Syrian president Basharul Assad, who had to flee their countries due to people's protests. He said that the federal government did a U-turn on its commitment on the seminaries bill and tried to further complicate the issue, but the JUI-F successfully advocated the cause. The JUI-F chief said that his was the only party to oppose the 26th Constitutional Amendment as the PTI did not take part in that process. \"We got the original 56 sections of the amendment bill reduced to 22 and inserted five of our own into it, bringing the total to 27,\" he said. Mr Fazl also said that his party stopped the government from narrowing the scope of Article 8 of the Constitution and making changes regarding the transfer of high court judges. Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}