{
  "article_id": "2025-01-07_b2d7457cff9123355505e76d344c28bd",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883564/australia-set-sights-on-world-domination-after-taming-india",
    "retrieved_at": "2025-10-12T00:45:04.698Z"
  },
  "metadata": {
    "title": "Australia set sights on world domination after taming India - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T02:52:24.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/07110112666fb9b.jpg",
    "categories": [],
    "word_count": 401,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "SYDNEY: Cricket's World Test Championship final is still five months away but it is already playing on the mind of Australia skipper Pat Cummins, saying the defence of their title is \"a huge goal\" after conquering India. Australia surged into a June showdown against South Africa at Lord's with a six-wicket victory in the fifth Test against India in Sydney on Sunday. The thrilling win sealed a first series triumph against their South Asian rivals in a decade. It also confirmed their place in a clash against South Africa that will determine the world's most consistent red-ball side over the last two years from the nine teams contesting the WTC. \"To hold the Border-Gavaskar Trophy is an amazing feeling, and the extra layer is now securing a spot again in the World Test Championship final, which was always a huge goal for us in this cycle,\" Cummins said. \"We talk about the World Test Championship a lot. It's a trophy we're really proud to hold so we want to go back and defend it. \"I think it's a great tournament in that you've got to play well consistently and across all different conditions against different teams. \"We can't wait to get over there.\" South Africa booked their spot under the WTC's average points system when they beat Pakistan in a dramatic two-wicket win at Centurion late last month. Australia play two Tests in Sri Lanka starting later this month before a lengthy red-ball break heading into the WTC final. Cummins appears likely to miss the Sri Lanka tour for the birth of his second child, with Steve Smith in pole position to take over as captain. But the Australian skipper is adamant that after four year in the role, he has no plans to hand over the armband permanently anytime soon. \"First of all, I absolutely love what I do. That's the biggest driver in wanting to play Test cricket and work with this team and support staff,\" Cummins said. \"I absolutely love everything about it, it's that much fun. If I can keep doing it for a while, even better.\" Cricket Australia meanwhile said nearly 838,000 spectators attended the Border-Gavaskar Trophy series, despite two matches ending within three days. The numbers were boosted by the Boxing Day Test in Melbourne going all five days, with a record 373,691 people turning out across the match. Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}