{
  "article_id": "2025-01-07_f293af11d9d991f152d6ef547da78e85",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883517",
    "retrieved_at": "2025-08-26T07:30:49.276Z"
  },
  "metadata": {
    "title": "Dr Kunbhar’s family expresses ‘no trust’ in police probe - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T02:52:32.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 227,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "UMERKOT: The family of Dr Shahnawaz Kunbhar, who was killed in police custody on Sept 19 last year, has demanded a transparent judicial investigation into his death amid violent reaction from several religious entities and burning of his body by charged extremists. The demand was made before a delegation comprising activists of different civil society organisations that visited the bereaved family's home in Janhero village of Umerkot district on Monday. Headed by leaders of the Sindhi Association of North America (Sana), the delegation comprised Dr Ejaz Turk, Tahira Abdullah, Jami Chandio, Amar Sindhu and other civil society activists. Ibrahim Kunbhar, speaking on behalf of his family, told the visiting activists that the bereaved did not have trust in the ongoing police investigation. He said that it must be conducted under a sitting judge of the Sindh High Court. He also alleged that the CCTV camera footages of Dr Kunbhar's arrest in Karachi and all other related happenings in Mirpurkhas, Umerkot and other places were destroyed. The aim was to save the police officers and other people involved in the whole episode from being taken to task, he said. It is pertinent to mention here that the Sindh government had recommended a judicial probe by the SHC way back on October 16 last year but no headway has been seen since then. Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}