{
  "article_id": "2025-01-07_5ed46713c2404fda7339e5cb48e9157b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883609/prometheus-or-dr-frankenstein",
    "retrieved_at": "2025-08-26T07:30:50.938Z"
  },
  "metadata": {
    "title": "Prometheus or Dr Frankenstein? - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T02:53:46.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/677c69b99fcdf.png",
    "categories": [],
    "word_count": 1017,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "DR Manmohan Singh, who passed away at 92 last week, will be remembered in contrarian ways. As finance minister and as prime minister, he condemned 'left wing extremism' as the biggest internal security threat to India. The sahukar-backed right wing agreed. Consequently, too many leftist intellectuals and academics are in jail over unfounded claims that they posed a threat to Indian democracy. By the time it was Singh's turn to hand over the baton to Narendra Modi, which he grudged but refused to see as a logical outcome of his economic policies, Singh was warning that Hindutva posed the real threat to India. In the end, it was too late to heed the corrected warning. The threat to Indian democracy was either posed by the left or by the right. It couldn't be coming from both, unless they had ganged up as they did self-servingly against Indira Gandhi's brief recourse to emergency. Dr Singh is thus hailed as India's economic Prometheus, after the Greek legend who defied the Olympian gods by taking fire from them and giving it to humanity. Praise is showered on him for opening India's economy, which strove to unleash the complex nation's hidden energies. In some versions of the Greek myth, Prometheus is also credited with the creation of humanity from clay, a description the ever-self-effacing former PM would probably frown on. Manmohan Singh's policies shored up business captains who ganged up to promote Narendra Modi as prime minister. Many respected him for his cultural roots and not for his politics. Of his three daughters, one is an author who has also written extensively on social issues such as forest conservation in Mizoram. Another daughter is a history professor, with seminal work on Indian history to her credit. The third daughter, Amrit Kaur, is a respected human rights lawyer in New York. We just heard her singing Faiz in a tribute to her father. She constructed 'Gulon mein rang bharey' with an emotionally vivid alaap that helped discern the gentle notes of Raag Jhinjhoti in Mehdi Hasan's fabled composition of the poem. One remembers how early in Manmohan Singh's innings as prime minister his party president, Sonia Gandhi, went searching for Raga'n Josh, an out-of-stock book about legendary musicians by Sheila Dhar, herself an accomplished classical singer and raconteur. Sonia Gandhi came to know that Singh's wife, Gursharan Kaur, wanted the book. Sonia resourcefully tracked it and gave the prime minister's wife the precious gift of a book; one that would have made Nehru smile approvingly. Recalling similar uplifting stories should help dispel the cultural dankness gripping the country since Narendra Modi began advising citizens on how to fry pakoras on sewer gas stoves. The second view about Manmohan Singh's interventions as finance minister (1991-96) and as prime minister (2004-2014) places him as the protagonist in the 19th century Gothic novel about a scientist's tricky experiment that goes horribly wrong. Dr Victor Frankenstein's monster in the Indian context has been nourished by the economic experiment that Dr Singh was asked to begin in 1991. The Congress was in a crisis following the assassination of Rajiv Gandhi in May that year. The vanishing of the Soviet market and the oil price shock saw India barely staving off default by pawning its gold reserves. What followed saw the rise of a Frankenstein-like middle class, much of which thrives on hate of its progenitors. Worse still, Singh's policies shored up business captains who ganged up to promote Narendra Modi as prime minister. In other words, the logic of Singh's reforms dictated the dissolution of the democracy that enabled the tycoons to become super rich and which left the poorer masses living in hope of the bonanza trickling down into their dingy homes. One shudders to see crisis-stricken Pakistan picking up the discredited IMF model, which has led to the dilution of democracy in India and elsewhere. But let us begin at the beginning, or somewhere around there, to assess Dr Singh's fraught experiment. A major earthquake in Maharashtra in 1993 required me to cover the devastation for a Western news agency. Several instructive lessons lay in store; one such was watching Shiv Sena cadres removing with bare hands and unmatched dedication the rotting bodies and animal carcasses. It was the same Shiv Sena, remember, that had violently targeted Muslims in the '92-93 Mumbai carnage after the destruction of the Babri masjid. Isn't it the same with rightwing groups in Pakistan, where, too, the government is outpaced by the Jamaat or Jamiat cadres in rescue missions; say, in the flood-ravaged mountains? A starker lesson in the Latur visit was unrelated to the earthquake havoc. Maharashtra's then chief minister Sharad Pawar met me over several evenings after he retired from the daily press conferences to his makeshift office. Pawar was India's defence minister when he met then Chinese premier Li Peng. Pawar said Li was worried about Dr Singh's reforms, as his coalition government had not taken the last man into confidence. Pawar said China hadn't taken the last man into confidence either about its reforms. Li said China's one-party system could handle any resultant turbulence with ease, while India, given its democracy, would struggle. Mikhail Gorbachev, he said, bore a closer resemblance to India's problems. \"Gorbachev blundered by introducing perestroika and glasnost simultaneously,\" Li said to Pawar. Perestroika, or radical restructuring, and glasnost, underscoring an open society, don't go together, Li said. Sure enough, the Rao government needed to bribe a bunch of MPs to win the vote for Singh's reforms. Besides, Singh had to give a fake address in Assam to qualify for a Rajya Sabha seat from there. Additionally, the Supreme Court rejected journalist Kuldip Nayar's petition against altering the rules for election to the Rajya Sabha, initially designed as the council of states. The court tweaked the constitution and allowed citizens of any state to be elected to the Rajya Sabha from any other state. Singh never got elected to the Lok Sabha, so it was a handy court ruling. The writer is Dawn's correspondent in Delhi. jawednaqvi@gmail.com Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}