{
  "article_id": "2025-01-07_1915eb6961cf52d93535b62c050004be",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883677/uae-agrees-to-roll-over-payment-of-2bn-due-by-pakistan",
    "retrieved_at": "2025-08-26T07:30:46.797Z"
  },
  "metadata": {
    "title": "UAE agrees to roll over payment of $2bn due by Pakistan - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T09:52:36.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/07133730a279e3e.jpg",
    "categories": [],
    "word_count": 649,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Prime Minister Shehbaz Sharif on Tuesday announced that the United Arab Emirates (UAE) had agreed to roll over the payment of $2 billion due by Pakistan this month. Securing external financing has previously been a key condition for the International Monetary Fund (IMF) to approve the $7bn bailout deal for Pakistan. Last year, friendly countries such as China, UAE, and Saudi Arabia had helped the country successfully clinch the IMF programme by providing timely confirmation of necessary financing assurances - with the IMF's fund disbursement tied to debt rollover confirmation from these countries. While talking to cabinet members today, the prime minister said he met with UAE President Sheikh Mohammed bin Zayed Al Nahyan while he was on a personal visit to Pakistan on Sunday. \"In a one-on-one meeting, he said...there is a $2 billion dollar repayment due and we are extending this,\" the premier said. \"I asked for the UAE to invest a few billion dollars in key investment projects and that would be helpful. \"He (Nahyan) said the UAE was committed to this investment and the two countries share brotherly ties,\" the premier added. PM Shehbaz also said that the government will have to approach the IMF to reduce electricity prices in the country. Under the $7 billion Extended Fund Facility (EFF) signed in September last year, the global money lender has asked Pakistan to impose a substantial levy on gas supply to industrial captive power plants (CPPs) to eliminate any cost-benefit between the grid power and their in-house electricity generation. The country has to deliver on one of the major structural benchmarks that required gas disconnections to CPPs by the end of January 2025 to qualify for disbursement of the second of the seven $1bn tranches in March. The two sides will meet for the first biannual review in the second half of February. The premier said that the government will have to move forward as our home-grown economic plan - the National Economic Transformation Plan 2024-29 - had already been initiated. \"That is why I am calling a meeting - because until our electricity prices are not reduced, our industry, our exports, and our commerce cannot be successful,\" he said. The prime minister added that last week, the government held a meeting to discuss electricity price reductions - taking provinces and allies into account - and had finalised \"two or three options\". \"We will have a comprehensive meeting to take those options forward so that our growth can be possible,\" he said. \"For that, we will have to go to the IMF.\" Meanwhile, Finance Minister Muhammad Aurangzeb, in a press conference, said that the government was working on reducing its expenditure. Speaking on the topic of \"rightsizing\" of the federal government, he said, \"The expenses of the federal government are talked about - that you take taxes from us, what are the expenses of the federal govt? - and that is correct.\" The finance minister recounted the that prime minister had created a committee aimed at \"reducing the govt's expenditure so that those resources could be allocated in a better way\". \"It included whether the government should do it themselves or hand it over to the private sector,\" he said. \"For example, we need to keep strategic reserves, that activity is understandable but should we do it via a government institution or outsource the process to the private sector?\" \"Rs900 billion is the approximate expense of the federal government - that I've already talked about how to reduce that expense,\" he added. Regarding the rolling back of the 43 ministries that have been included in the process, he said it was being done in a phased manner. He said that it was being done \"in waves, and in each wave, five to six ministries and their attached departments will be brought in\", adding that it was not possible to rightsize 43 ministries in one go.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}