{
  "article_id": "2025-01-07_626bbe7084a456604d63b6afc5aaf0e0",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883633/three-brothers-killed-in-lock-up-as-rivals-storm-police-station-in-faisalabad",
    "retrieved_at": "2025-10-12T00:45:02.440Z"
  },
  "metadata": {
    "title": "Three brothers killed in lock-up as rivals storm police station in Faisalabad - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T03:27:08.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 759,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "LAHORE/TOBA TEK SINGH : In what appeared to be a case of a security lapse, five armed men carried out a brazen attack at a police station in Tandlianwala tehsil of Faisalabad district and allegedly killed three brothers and injured their cousin facing a murder case. The attackers stormed the Saddar police station by scaling the walls using a bamboo ladder, killed their rivals in lock-up within a few minutes and fled the scene without any resistance as there were only three policemen out of total 64 posted at the police station when the attack was carried out. The police declared the incident a result of an old enmity between the two local groups of Tandlianwala tehsil- Sukhera and Kharral - who had so far allegedly killed eight persons of each other in Tandlianwala. Those who lost their lives in the fresh lethal attack were identified as Muhammad Bilal, Muhammad Usman and Nasir Ali, the men belonging to Sukhera group. The injured, Muhammad Asif, was shifted to Tandlianwala THQ hospital in a critical condition. Team formed to probe into security lapse amid reports of thin police presence They were arrested for allegedly murdering three men of rival Kharral group and a case was lodged against them under 7 ATA and other heinous charges. The police inquiries showed that 61 police personnel posted at the Tandlianwala Saddar police station had gone to their homes, leaving three suspects, who were on physical remand granted by the anti-terrorism court, almost unattended. Sources privy to the incident declared it a case of security lapse, holding the divisional SP, DSP and other police officers responsible for the attack and killing of the suspects in custody saying the Faisalabad police high-ups had already conveyed them in writing to keep the suspects in tight security following the old enmity between the two groups. They said the police officers blatantly violated the instructions and left the deceased at the mercy of the three policemen. Faisalabad Regional Police Officer (RPO) Dr Abid Khan told Dawn that the assailants brought a wooden ladder and went to the backside of the police station on finding the main gate closed. He said the armed men went to the roof of the police station and then reached the corridor through the stairs where a police constable, Kaleem Shafiq, fired warning shots on finding the armed strangers. However, the attackers opened indiscriminate fire, forcing the constable to stop firing and take shelter in a portion of the police building. The assailants then went to the police lock-up and unleashed massive firing on their rivals, killing three of them on the spot and injuring another critically. The attackers belonging to the Kharral group fled the scene after completing the task, the RPO said, adding that he reached the site along with Faisalabad City Police Officer Kamran Adil soon after the attack. To a question, he said, enmity started between Sukhera and Kharral groups for the first time when the former attacked and injured a man of the later group in March 2023. The attacker belonging to the Sukhera group, Mohammad Imran, was declared proclaimed offender (PO) in this case, the RPO said. He went on saying the armed men from Kharral party avenged and allegedly murdered two men of the rival group in August 2023. A murder case was lodged against the men of the attacking group accordingly. As litigation was ongoing, Dr Abid said, the Sukhera party carried out an armed attack in October last year and allegedly killed three men of the rival group when they were on way to the district court. The Tandlianwala City police lodged a murder case under 7-ATA and other heinous charges and arrested the four suspects of Sukhera group in the above-mentioned killings of three individuals. To a question about security lapse, the RPO said he would not spare anyone and set an example for others. According to sources, at least 10 individuals of the attacking group had been arrested but police have not so far confirmed their arrests. Meanwhile, Inspector General of Police Punjab Dr Usman Anwar took notice of the police's negligence, constituted an inquiry team of three senior police officers to investigate the matter separately to fix a responsibility against those held guilty of security lapse which led to the killing of three in-custody murder suspects. The inquiry officials, including DIG intelligence special branch police Punjab Faisal Raja (head of the committee), additional IG complaints Ehsanullah Chohan and additional IG operations Zahid Nawaz Marwat have reached Faisalabad. Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}