{
  "article_id": "2025-01-07_9edd566151da9e1af65e8e49e06725cb",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883713/3-soldiers-martyred-19-terrorists-killed-in-kp-operations-ispr",
    "retrieved_at": "2025-08-26T07:30:45.884Z"
  },
  "metadata": {
    "title": "3 soldiers martyred, 19 terrorists killed in KP operations: ISPR - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T18:38:49.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/07233731e5e4e9c.jpg",
    "categories": [],
    "word_count": 310,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Three soldiers were martyred and 19 terrorists were killed in three separate engagements in Khyber Pakhtunkhwa, the military's media wing said on Tuesday. A statement from the Inter-Services Public Relations (ISPR) said that in the first instance, eight terrorists were \"sent to hell\" after an intelligence-based operation (IBO) was conducted in Peshawar's Matani area, where the terrorists were engaged at the location. Eight more were neutralised in an IBO in Mohmand district's general area of Baizai and three more in Karak district, the ISPR said. It added the operations were conducted between Monday and Tuesday. The ISPR said that Lance Havaldar Abbas Ali, 38, resident of Ghizer district; Naik Muhammad Nazir, 37, resident of Skardu district and Naik Muhammad Usman, 37, resident of Attock district, \"fought gallantly\" during the intense exchanges of fire and were martyred. Sanitisation operations were being conducted to eliminate any other terrorists, the statement said. \"Security forces of Pakistan are determined to wipe out the menace of terrorism from the country and such sacrifices of our brave soldiers further strengthen our resolve,\" the ISPR concluded. Pakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan. Terror attacks have increased since the banned Tehreek-i-Taliban Pakistan broke a fragile ceasefire agreement with the government. With at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade. Equally alarming were the cumulative losses of civilians and security personnel: 1,612 fatalities, accounting for over 63 per cent of the total recorded the past year and marking 73pc more losses compared to 934 outlaws eliminated. The overall fatalities recorded last year were a record nine-year high, and over 66pc more than in 2023. On average, nearly seven lives were lost daily.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}