{
  "article_id": "2025-01-07_3f1915f8a0fb06e094e4d0202615c309",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883632/four-die-20-injured-as-bus-overturns-near-muzaffargarh",
    "retrieved_at": "2025-10-12T00:44:47.795Z"
  },
  "metadata": {
    "title": "Four die, 20 injured as bus overturns near Muzaffargarh - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T03:25:36.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "MUZAFFARGARH: Four passengers died while 20 others got injured seriously when a speeding bus overturned along the TP Link Canal near Sultan Colony on Monday. The bus, traveling from Rawalpindi to Multan, suffered a tyre burst, causing the driver to lose control and resulting in the accident. Local residents immediately rushed to the scene and called rescue officials. According to rescue teams, four passengers died on the spot due to severe head injuries, while over 20 others were critically injured. The injured were shifted to nearby hospitals for emergency treatment. Some of the critically injured patients were later shifted to Nishtar Hospital in Multan. The deceased were also moved to a local hospital, and their bodies were handed over to their families. Kot Addu Deputy Commissioner Syed Munawar Abbas Bukhari and DPO Syed Hasnain Haider visited the accident site and supervised the rescue operations. The bus involved in the incident belonged to a private transport company. The accident occurred near Head Muhammadwala due to the combination of a tyre burst and speeding. Rescue teams and a contingent of Kot Addu police worked to remove injured passengers and recover bodies by cutting through the bus. Attacked: A group of people allegedly occupying 65 acres of state land attacked a forest department team in the Noor Kubra area. The attackers allegedly tortured the officials and tried to snatch their mobile phones and cash. A case was registered at the Muzaffargarh city police against 37 named people involved in the attack. Divisional Forest Officer (DFO) Rashid Mehmood said that the armed people resisted efforts to retrieve the encroached land. The attackers had illegally cultivated wheat on the occupied land. The DFO confirmed that 28 acres of land had already been reclaimed, and action to recover the remaining 65 acres was ongoing under orders from higher authorities. Published in Dawn, January 7th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}