{
  "article_id": "2025-01-07_1066b22f5102e3641d00006ac9650173",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883667/trump-claims-great-nation-possible-if-canada-becomes-51st-state-after-trudeau-steps-down",
    "retrieved_at": "2025-08-26T07:30:49.413Z"
  },
  "metadata": {
    "title": "Trump claims ‘great nation’ possible if Canada becomes 51st state after Trudeau steps down - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T07:07:56.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/07120509b2ea78c.jpg",
    "categories": [],
    "word_count": 223,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "US President-elect Donald Trump on Monday once again stirred controversy by suggesting Canada's merge with the US hours after Canadian Prime Minister Justin Trudeau announced resignation. \"Many people in Canada LOVE being the 51st State. The United States can no longer suffer the massive Trade Deficits and Subsidies that Canada needs to stay afloat. Justin Trudeau knew this, and resigned,\" said Trump on Truth Social post. Trudeau announced his resignation earlier Monday amid growing dissatisfaction within his party and low public approval ratings, raising concerns about his ability to win the next election against a surging Conservative opposition. Trump argued that a US-Canada merger would eliminate trade barriers and reduce taxes for Canadians, and said: \"If Canada merged with the US, there would be no Tariffs, taxes would go way down, and they would be TOTALLY SECURE from the threat of the Russian and Chinese Ships that are constantly surrounding them.\" The incoming US president further described his vision of potential merger by saying, \"what a great Nation it would be!!!\" Since his election victory in November, the president-elect has referred to Canada as the \"51st state.\" Trump also previously threatened to slap a 25 per cent tariff on Canadian imports unless Canada takes steps to significantly reduce drugs and illegal immigrants crossing into the US. Trump similarly threatened Mexico with the tariffs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}