{
  "article_id": "2025-01-07_bad29213958f54cc6415e72533e14b8b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883707/women-require-spousal-parental-consent-for-haj-says-religious-affairs-ministry",
    "retrieved_at": "2025-08-26T07:30:44.027Z"
  },
  "metadata": {
    "title": "Women require spousal, parental consent for Haj, says religious affairs ministry - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-07T15:50:46.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/072013176b95729.jpg",
    "categories": [],
    "word_count": 262,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Women who are not granted permission by their husbands or parents will not be able to perform Haj, a statement from the Religious Affairs Ministry said on Tuesday. This year, the Saudi government has allotted a total Haj quota of 179,210 pilgrims to Pakistan. Some 89,602 people will be performing the pilgrimage under the government scheme, while the rest will perform it through private tour operators, according to the ministry. According to the 2025 Haj Policy document, a copy of which is available with Dawn.com, women will be able to travel to Saudi Arabia for pilgrimage alone subject to conditions set by the Council of Islamic Ideology (CII). \"As per the decision of the Council of Islamic Ideology taken in its session no. 232 held on 6th and 7th June 2023, female pilgrim (without mehram) shall be allowed for Haj subject to the conditions that: a) She has been allowed by her parents, and in case of married, by her husband. b) She will have a group of reliable female pilgrims and there is no threat to her dignity,\" the document read. In the past, Pakistani women were unable to travel to Saudi Arabia alone for pilgrimage. But in 2021, the Saudi government lifted its ban on women travelling alone for the Haj and Umrah. The move was part of a campaign by the Saudi political leadership to improve the rights of women in the country. The document further said that children below 12 would not be allowed to go for Haj and immunisation of vaccines approved by Saudi Arabia was mandatory.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}