{
  "article_id": "2025-01-11_aa7c5bbcb6c17e5724265d0f60738670",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884415/a-six-million-dollar-banana",
    "retrieved_at": "2025-08-26T07:36:46.337Z"
  },
  "metadata": {
    "title": "A six-million-dollar banana? - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-11T01:53:49.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6781c00784ef7.png",
    "categories": [],
    "word_count": 1029,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "LADIES and gentlemen, imagine a hypothetical experiment. Suppose I buy a banana for Rs10 and tape it to a wall. At the end of this rather banal experiment, what if I tell you that the banana's value is now Rs10,000? Don't laugh, or fret, just yet! About a month ago, a millionaire, Justin Sun, bought a similarly duct-taped banana for more than $6 million, and ate it in front of everyone present! If you are feeling stunned, flabbergasted, astounded or confused, don't be. These kinds of oddities are more frequent than you may like to believe. Here is another one. A particular piece of human excrement is now valued at $39,000! Was it the seemingly banal, but rather innovative, idea of duct-taping a banana that conferred such tremendous value upon it? Please don't gross out; I gave these examples just as an intro to the challenging, yet exciting, question that has put to test the intellect and brilliance of thought leaders since the time of Aristotle - what determines the value of a thing or a good? The details of theories surrounding value formation are outside the scope of this article. Briefly put, it began with Aristotle's division of value into 'value in use' and 'value in exchange', a bifurcation that has stood the tests of time well, with leading lights like Adam Smith and Marx making use of it. The advent of the 'utility' school brought satisfaction levels into the equation, providing an explanation for Smith's famous 'diamond-water' paradox. Another famous explanation came from Keynes, who compared the stock market to a beauty contest, whereby a person may bet on the contestant who he thinks that the crowd values more rather than his personal pick. Although the theories do a commendable job in many instances, there are still gaps that need to be filled. In the case of the piece of poo, which is on display at the Jorvik Viking Centre in York, England, belonging to a Viking from the 9th century AD, the value derives from its rarity (fossilised faecal matter from 1,200 years ago is super rare) and the extremely valuable insights it offers into the dietary habits of people of a particular area in the said period. The case of the banana, though, presents a challenge that even the best of theorists find difficult to explain. The very act of duct-taping a banana was the idea of an Italian artist, Maurizio Catellan, who first did this at Art Basel in Miami in 2019, titling it 'Comedian'. This particular banana, whose winning bid came in at $6.2m by Justin Sun, was bought for less than a dollar by Maurizio outside the famous auction house, Sotheby's, before he duct-taped it and put it up for auction. So was it the seemingly banal, but rather innovative, idea of duct-taping a banana that conferred such tremendous value upon it? Was it the famous auction house (Sotheby's), the Miami art exhibition, or was it the collective action of bidders who tried to outbid each other for the banana during the auction? Or was something else at play? It is fascinating, and intriguing, to enquire into the process and factors that transformed an ordinary piece of food worth less than a dollar into an item worth more than $6m. If the vendor had carried out the same act, probably no one would have noticed. Was it Maurizio's standing as an artist, his networking, or any other expertise that made his duct-taping act a hit? Above all, what prompted the crypto entrepreneur Justin Sun to pay that much for an item that he could have bought for less than a dollar? Was it the publicity and the urge to be noticed that came with his act, which is going to be remembered for a long time? Or does it have anything to do with the disutility of the money in his possession, implying that spending that much did not matter to him much, especially in context of the utility of publicity and lasting fame that came with it? Besides the intellectual challenge of value determination, a related (and equally challenging) question is that of distribution based on contribution to a good's value, a mainstay of economic debates involving those on what we call the 'left' and those on the 'right'. Towering figures of economics like Marx made this very question the main focus of their writings, and of course, this is one of the most important considerations within economic policymaking and management. A prominent example is minimum wage laws, whereby governments legally mandate a floor upon wage payments to workers. In our banana example, the artist, Maurizio, had bought it for only 35 cents from a fruit vendor outside the Sotheby's auction house in New York. The vendor, Shah Alam, did not get any part of the proceeds from the astronomical price paid for the banana. When his story came to light, there was an outcry, with people calling it unfair that the vendor did not get anything from the bounty. The buyer, Justin Sun, tried to ameliorate the emotions by promising to buy a hundred thousand bananas from Shah Alam (valued at $25,000). Still, the difference between $25,000 and $6m remains profound, and the offer did not impress him in context of cost of logistics for arranging that many bananas and the payment to the stall owner. Should Maurizio have shared the spoils with Shah Alam? Or once he paid for it, did the payoffs from its use exclusively belong to him only? Can governments legislate to halt such stratospheric payoffs that may widen income inequalities? I will leave the reader with a challenging puzzle. In 2009, a person by the pseudonym of Satoshi Nakamoto heralded a digital experiment that resulted in what we now know as Bitcoin. It is neither backed by any government nor by any commodity. How in the world did it manage to gain so much value as to be $100,000 to a single Bitcoin? The writer is an economist. His current research focuses on cost-benefit analysis of foreign-funded PSDP projects, economic reforms and history of economic thought. shahid.mohmand@gmail.com X: @ShahidMohmand79 Published in Dawn, January 11th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}