{
  "article_id": "2025-01-11_0e4fac7158accce47cb5098b6f13f84b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884446/venezuelas-maduro-sworn-in-for-third-term-as-us-raises-reward-for-his-capture",
    "retrieved_at": "2025-08-26T07:36:50.616Z"
  },
  "metadata": {
    "title": "Venezuela’s Maduro sworn in for third term as US raises reward for his capture - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-11T01:53:13.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6781c9fadd9b8.gif",
    "categories": [],
    "word_count": 287,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "CARACAS: Venezuelan President Nicolas Maduro, whose nearly 12 years in office have been marked by deep economic and social crisis, was sworn in for a third term on Friday, despite a six-month-long election dispute, international calls for him to stand aside and an increase in the US reward offered for his capture. Maduro, president since 2013, was declared the winner of July's election by both Venezuela's electoral authority and top court, though detailed tallies confirming his victory have never been published. Venezuela's opposition says ballot box-level tallies show a landslide win for its former candidate Edmundo Gonzalez, who is recognised as president-elect by several countries including the United States. International election observers said the vote was not democratic. The months since the election have seen Gonzalez's flight to Spain in September, his ally Maria Corina Machado going into hiding in Venezuela, and the detentions of high-profile opposition figures and protesters. In the latest in a series of punitive steps, the outgoing Biden administration increased its reward for information leading to the arrest or conviction of Maduro on drug trafficking charges to $25 million, from a previous $15m. It also issued a $25m reward for Interior Minister Diosdado Cabello and a $15m reward for Defence Minister Vladimir Padrino, as well as new sanctions against eight other officials, including the head of state oil company Hector Obregon. The US indicted Maduro and others on narcotics and corruption charges, among others, in 2020. Maduro has rejected the accusations. The US move coincided with sanctions by Britain and the European Union each targeting 15 officials, including members of the National Electoral Council and the security forces, and Canadian sanctions targeting 14 current and former officials. Published in Dawn, January 11th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}