{
  "article_id": "2025-01-11_84247c44f1b71c03ed16e613c82b79f8",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884462/water-tankers-run-over-kill-three-bike-riders-in-karachi",
    "retrieved_at": "2025-08-26T07:36:49.899Z"
  },
  "metadata": {
    "title": "Water tankers run over, kill three bike-riders in Karachi - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-11T01:53:18.000Z",
    "image_url": "https://i.dawn.com/medium/2025/01/101257286728039.jpg?r=134242",
    "categories": [],
    "word_count": 237,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI: Three people were hit and killed by water tankers in two separate incidents in the city on Friday, police said. In the first incident, an angry mob set a water tanker on fire after it hit and killed two motorcyclists on Shaheed-i-Millat Road. DIG Traffic Ahmed Nawaz Cheema said that the tanker hit the victims near Tipu Sultan Bridge. As a result, Syed Noman and Israr Ahmed, were killed. The tanker also hit and injured another person but he couldn't be identified, the DIG added. The bodies were shifted to the Jinnah Postgraduate Medical Centre. Ferozabad SHO Inam Husain Junejo attributed rash driving as probable cause of the accident. The errant driver, Shahzad Ali Shah, managed to escape from the spot, leaving behind the tanker that was set on fire by angry people. A Rescue-1122 official said that area residents managed to control the fire themselves before arrival of their fire tenders. He said the tanker was partially damaged. The Ferozabad police had registered a case against the tanker driver on complaint of Danish, brother of one deceased Israr Ahmed, said area SHO Inam Junejo. In another incident on National Highway, a bike rider, Saeed, was killed when a water tanker hit him near Ghaghar Phatak. However, Steel Town SHO Adeel Shah said the victim's relatives had reached an \"agreement\" with the driver and did not want any legal proceedings. Published in Dawn, January 11th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}