{
  "article_id": "2025-01-11_dde2bea25e01d9809237fd23b0b654b7",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884431/lng-prices-for-january-notified",
    "retrieved_at": "2025-08-26T07:36:52.558Z"
  },
  "metadata": {
    "title": "LNG prices for January notified - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-11T01:53:01.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 373,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: With system losses touching a record 16.16 per cent, the Oil and Gas Regulatory Authority (Ogra) on Friday notified a slight increase in the sale price of Regasified Liquefied Natural Gas (RLNG) for Sui Southern Gas Company (SSGCL) and a reduction for Sui Northern Gas Pipelines Ltd (SNGPL) for January. Karachi-based SSGCL serves consumers in Sindh and Balochistan, and Ogra increased its system losses from 13 to 16.16pc last month. On the other hand, Lahore-based SNGPL provides gas to consumers in Punjab and Khyber Pakhtunkhwa, and the regulator had set losses at 8.6pc last month from 8pc earlier. According to notification, the RLNG's sale price for SNGPL at the transmission stage has been reduced by 1.98pc to $11.73 per million British thermal units (mmBtu) against 11.966 per mmBtu in December. The sale price at the distribution stage for SNGPL was cut by 1.8pc to $12.67 per mmBtu against $12.90 per mmBtu for December. Conversely, the RLNG sale price for SSGCL was raised by 0.44pc $10.59 per mmBtu at the transmission stage from $10.54 last month. The sale price at the distribution stage for the company was also raised by 0.45pc to $12.6 per mmBtu for January against $12.54 in December. The significant difference between the transmission and distribution of about $2 per mmBtu is mainly because of high losses during distribution. The overall increase in absolute terms for SSGC's transmission price amounted to $0.047 per mmBtu and $0.056 per unit at distribution point. The decrease in RLNG price for SNGPL at transmission stood at $0.24 per mmBtu and $0.23 per unit for distribution. Ironically, the RLNG distribution prices for SSGCL, $12.6 per mmBtu and $12.67 per mmBtu for SNGPL are almost $3.66 and $3.72 per mmBtu higher than Pakistan State Oil's $8.94 per mmBtu average delivered price ex-ship (DES), respectively. This is mainly because both the LNG importers - PSO and Pakistan LNG Ltd (PLL) - and port authorities also charge profit margins on account of retainage and margins at the rate of 3.15pc and 3.1pc of DES price, respectively, on top of 8.6pc losses of SNGPL and 16.16pc losses of SSGCL. The basket RLNG price was based on a total of 11 cargoes for January. Published in Dawn, January 11th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}