{
  "article_id": "2025-01-11_8bcc134ebb83d94bccc620f4062d3e42",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884400/coalition-not-threatened-by-ppps-concerns-over-new-canals-ahsan-iqbal",
    "retrieved_at": "2025-08-26T07:37:04.436Z"
  },
  "metadata": {
    "title": "Coalition not threatened by PPP’s concerns over new canals: Ahsan Iqbal - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-11T01:52:42.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 508,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KARACHI: Despite strong reservations from its coalition partner, PPP, the PML-N government appears unwilling to back down from its stance on six new canals on the Indus River in Punjab, insisting that they will not affect Sindh's share of water. While talking to reporters on Friday, Federal Planning Minister Ahsan Iqbal dismissed the concerns raised by the PPP, emphasising stringent oversight of the country's water distribution system. The objections raised by the PPP regarding the proposed project was \"a baseless debate\", he swiftly responded when asked about the PPP's objections. \"It was the PML-N government in 1991 that formulated the water accord, which clearly defines the water share of each province,\" he said. Planning minister downplays Sindh's objections \"A foolproof, transparent system is in place to ensure its implementation. No province can receive more than its allocated share, nor can any province be deprived of its rightful allocation.\" Mr Iqbal added that the water regulator, Indus River System Authority (Irsa), has representatives from all provinces, which \"ensures the transparency and fairness of the water distribution system\". The PPP has expressed serious reservations over the Centre's plan to build new canals to draw water from the Indus River for farming in Punjab's Cholistan region. There have been widespread protests in Sindh against the proposed canals, with the province's chief minister and PPP leader, Murad Ali Shah, saying the plan threatened Sindh's agricultural economy. The PPP leaders have also raised these concerns in talks with PML-N, saying the project would render lands in Sindh \"completely barren\". Threat to coalition However, despite these reservations, Mr Iqbal downplayed any potential threat to the Shehbaz Sharif-led federal government. \"We have a robust mechanism in place under Deputy Prime Minister [Ishaq Dar], which effectively manages matters between the two coalition partners [PML-N and PPP],\" he said. \"Whenever any issue arises, we engage in discussions and resolve it amicably. There is no such division that poses a threat to our alliance. It could be a presumptive idea, but it is entirely disconnected from reality.\" Earlier, the federal minister, in his brief address at an event, said his government was \"committed\" to national development\". He highlighted the recently launched 'Uraan Pakistan', an economic transformation plan, and said it was \"designed for the people of Pakistan\". The plan focused on creating an export-oriented economy, fostering a youth-driven techno-economy, addressing climate resilience, enhancing water and food security, promoting green energy, and achieving equitable socioeconomic development by empowering youth and women. The minister emphasised that the PML-N government was committed to overcoming national challenges through policy reforms and strategic public expenditure. \"Uraan Pakistan represents our commitment to empowering every citizen of Pakistan. We aim to provide opportunities for youth, digitise agriculture for farmers, and significantly increase exports,\" said Mr Iqbal. \"Our government is setting a strong economic foundation to ensure Pakistan's global competitiveness and a prosperous future for generations to come.\" The federal minister said the world was economically competitive, and it was time to position Pakistan \"to excel on the global stage\". Published in Dawn, January 11th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}