{
  "article_id": "2025-01-11_d1d54c399c4e9ede4c773cd0e0e46099",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884399/competence-of-military-court-judges-questioned",
    "retrieved_at": "2025-08-26T07:37:04.083Z"
  },
  "metadata": {
    "title": "Competence of military court judges questioned - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-11T01:52:42.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 840,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "- Justice Mandokhail wonders how much experience presiding officers have of handing down harsh punishments - Justice Hilali asks how military courts assumed jurisdiction when FIRs were filed under PPC, ATA - Govt explains it charged only 105 individuals under OSA, PAA on basis of 'solid evidence' in May 9 cases ISLAMABAD: A Supreme Court judge on Friday questioned the competence of presiding officers in military courts, asking whether they have sufficient legal expertise to impose severe punishments. \"I have been in the judiciary for the last 34 years and I'm still learning,\" Justice Jamal Khan Mandokhail of the constitutional bench observed during a hearing, where the federal government justified the trial of civilians by military courts in the May 9 violent protests, when PTI workers attacked military installations. Justice Mandokhail also wondered whether the presiding officer of the military court was an experienced and knowledgeable law officer who understood the repercussions of awarding serious punishments. Appearing before the seven-judge bench, Additional Attorney General (AAG) Chaudhry Aamir Rehman said that only 105 individuals out of 5,000 suspects were charged based on \"solid evidence\" under the Official Secrets Act (OSA) and the Pakistan Army Act (PAA) 1952. He explained that 35 FIRs had been registered in the wake of the violence, which included attacks on military installations. The government's explanation came as the bench reviewed intra-court appeals against the Supreme Court's Oct 23, 2023, five-judge order nullifying military court trials of civilians. Justice Musarrat Hilali questioned how military courts could assume jurisdiction when FIRs were registered under the Pakistan Penal Code (PPC) and the Anti-Terrorism Act (ATA). When she regretted that despite repeated directions, the federation had not provided copies of the FIR registered against the convicts, AAG Rehman noted that three FIRs, including one with OSA sections, had been submitted to the court. Khawaja Haris Ahmed, representing the Ministry of Defence, assured the court that complete trial records would be presented. He explained that additional charges could be added during investigations and noted that the Supreme Court had previously allowed military court convictions to be challenged in superior courts. Justice Jamal Khan Mandokhail observed that while interpreting laws, the intention of the top judiciary should always be to benefit citizens. However, the counsel explained that the benefit of the citizens was always connected with the benefit of the state and not to a small segment of people who undermine the security and interest of the state. \"It is a settled principle of law that instead of striking down a law under challenge, the priority of the courts should always be to remove conflict, if any, by saving the legal instrument,\" the counsel said. Justice Mandokhail regretted that the apex court could not go into merits; rather, the judiciary would be helpless if the military courts, while ignoring the requirements of the criminal justice system, awarded a death sentence to an accused civilian based on false or lack of evidence. \"We need to tread carefully while deciding the present matter in a way that shrinks the jurisdiction of the military courts so that it should apply to fewer and fewer civilians,\" Justice Mandokhail emphasised. The counsel, however, replied that courts could intervene if the assumption of the jurisdiction by the military courts was based on mala fide (in bad faith) or coram non judice (not before a judge) and without any legal authority. Referring to the 2016 Said Zaman Khan case, the counsel explained that the Supreme Court had held that any conviction by the military courts could be challenged before the superior judiciary, adding that the decision also highlighted that some rights could not be made available to the accused facing trials in the military courts. The counsel argued that military court jurisdiction applied only to cases directly impacting national security under Section 2(1d) (i and ii) of the PAA. He clarified that offences like hijacking fall under ATA and not PAA, citing a past plane hijacking case where the Supreme Court ruled that passengers' lives were not at risk. Justice Hilali raised concerns about military court procedures, noting that presiding officers do not announce judgements themselves, leaving decisions to commanding officers. \"How can an officer who had not heard the matter could hand over the judgement?\" Justice Hilali questioned. She pointed to the tense security situation in Khyber Pakhtunkhwa, where cases of attacks on army personnel were not sent to military courts. Justice Muhammad Ali Mazhar observed that military courts worldwide conduct trials with only military officers presiding. The counsel explained that those military officers had experience in conducting trials. Justice Naeem Akhtar Afghan observed that there was a general perception that the trial in the military court was only to the extent of punishment, stressing that it would have been appropriate if the stages of the trial in the military courts were explained. He recalled that he had heard such cases in the Balochistan High Court and knew that the facility of engaging a lawyer of choice was available in court martial. Published in Dawn, January 11th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}