{
  "title": "Premier reviews steps to secure Chinese nationals - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Sheh­baz Sharif has said the government is building a safe and business-friendly environment for the Chinese community in Pakistan by enhancing their security.\n\n“The confidence of Chinese companies in the Pakistani economy is extremely important for our economic future,” Prime Minister Shehbaz said while chairing a meeting on Tuesday regarding security arrangements for Chinese citizens in Pakistan.\n\nThe prime minister acknowledged that multiple measures were being taken to enhance the security of Chinese nationals across the country, including in Islamabad.\n\nHe said that the Safe City projects were an excellent example of this increasing capacity. He added that Safe City projects were being built across the country as per the international standards.\n\nUnveils plan to overhaul police training, align it with military academy standards\n\n“China is our friendly country,” said the prime minister stressing that the protection of Chinese brothers was the top priority of the government. He said the China-Pakistan Economic Corridor (CPEC) was a highly important joint project between the two countries which had now entered its second phase, where business-to-business cooperation will be prioritized between the two countries.\n\nIn light of the development of CPEC, the protection of Chinese nationals in Pakistan had gained even greater importance, he said, while issuing directives that measures be taken on a priority basis at all airports to facilitate their arrival and departure.\n\nDuring the meeting, the prime minister was briefed on the progress of special security arrangements for Chinese nationals across the country.\n\nInterior Minister Syed Mohsin Raza Naqvi informed the PM about the security arrangements being implemented nationwide. It was said special security arrangements for Chinese nationals had been enforced in light of potential terror threats.\n\nThe federal government and all provinces were working in full cooperation on this matter, while safe city projects were under construction across the country, it was highlighted.\n\nChinese nationals were also being provided with security escort facilities for travel, the PM was told.\n\nThe meeting was further informed that all new housing projects would be equipped with cameras that meet Safe City standards.\n\nTraining facility inaugurated\n\nEarlier, the PM visited the National Po­­l­ice Academy (NPA) and Islamabad Safe City Capital Command and Control Centre.\n\nAddressing the 52nd Commons Batch of Assistant Superintendents of Police (ASPs), the PM announced plans to undertake a comprehensive overhaul of the institution, aligning it with the standards of the Pakistan Military Academy.\n\nHe also inaugurated the ‘Raising the Standard: NPA Tactical Firing Range and Elite Police Training Facility’, a state-of-the-art complex designed to provide han­ds-on tactical training to police officers.\n\nBesides, the PM performed the groundbreaking ceremony of the new ASP Hostel, aimed at providing modern residential facilities for trainee officers.\n\nHe outlined a bold vision for the academy’s revival, announcing the launch of a Master’s degree programme for trainees and the establishment of a 25-acre state-of-the-art campus where a training school, with a modern firing range, would be built. “Collaboration with international partners, including China and the United Nations, is planned to upgrade training standards,” he added.\n\nIn his address, PM Shehbaz praised law enforcement agencies along with security forces for their commitment to eradicate terrorism from the country. He urged police force to uphold justice and ensure safety and protection of the life and properties of the people.\n\nHe praised the leadership of police institutions, including trainers and course commanders, and encouraged enhancement of the Gilgit-Baltistan quota. “We aim to equip our officers not only with weapons but also with modern technology and critical thinking. From hostels to classrooms, the entire structure will be refurbished,” he said.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/230939330c28e22.png",
  "retrievedAt": "2025-08-17T21:09:03.810Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926009/premier-reviews-steps-to-secure-chinese-nationals",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:05.000Z"
}
