{
  "title": "COMMENT: India’s nuclearisation of oceans poses ‘a global threat’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE Narendra Modi government is pursuing an aggressive maritime strategy to emerge as a hegemon in the Indian Ocean Region. New Delhi’s offensive policies, evolving alliances and anti-China groupings in the Indian and Pacific Oceans are facilitating its naval buildup, far beyond its genuine security needs.\n\nThe nuclearisation of the India Ocean, led by India, has exacerbated strategic asymmetries, intensified military competition, and strained strategic stability in the region.\n\nIts strategy to develop a potent sea-based deterrent comprising nuclear submarines — nuclear-powered ballistic missile submarines (SSBNs) and nuclear-powered attack subs (SSNs) — signifies a major shift from a defensive to offensive maritime posture.\n\nIndia’s SSBN programme forms the sea-based leg of its nuclear triad, aimed at providing a second-strike capability. It intends to develop a nuclear triad comprising more than 400 nuclear warheads, out of which 100 nuclear warheads could be deployed on four to five ballistic missile submarines.\n\nNew Delhi’s pursuit of long-range missile capabilities, beyond Pakistan and China, should be enough to plant the seed of doubt in any thinking mind about its real intentions\n\nThese estimates are based on India’s developmental goals and future SSBN configurations, which are designed to carry up to two dozen K-15 Sagarika missiles, having a range of 750km, or eight of the K-4 missiles, which have a range of 3,500km.\n\nNew Delhi is also developing K5 and K6 submarine-launched ballistic missiles (SLBMs) with ranges of 6,000 and 8,000km, respectively. India’s SSBNs are believed to be equipped with nuclear-tipped cruise missiles.\n\nThis pursuit of long-range missile capabilities, beyond Pakistan and China, should be enough to plant the seed of doubt in any thinking mind about India’s real intentions. The development of long-range delivery systems, especially intercontinental ballistic missiles (ICBMs) such as Agni-V and K6 etc, pose serious risks to regional and global stability.\n\nThe speculation around Agni-VI, which may have a range exceeding 10,000km, and its multiple independently targetable re-entry vehicle (MIRV) capability indicates ambitions far beyond New Delhi’s stated doctrine of ‘Credible Minimum Deterrence’ (CMD).\n\nThese systems, capable of delivering nuclear warheads thousands of kilometres away, signal a shift in India’s defence posture from regional deterrence to global power projection, with a little or no regard for its destabilising consequences.\n\nIn a recent article for the seminal Foreign Affairs journal, Ashley J. Tellis — a senior fellow at the Carnegie Endowment for International Peace — underscored how New Delhi aims to restrain not just China, but also any other country that would aspire to singular dominance, including the United States.\n\nGoing by the old maxim that ‘countries do not have friends, only interests’, the West must seriously ponder India’s ambivalent foreign policy, and take into account its ICBMs as a threat in their security calculations.\n\nRegardless of range, the SSBN’s speed and sustained nuclear propulsion provides it the capability to launch SLBMs against any state around the globe from unexpected axis.\n\nIndia justifies its military developments, including a nuclear submarine force, under the pretext of a ‘two-front threat’. However, its logic for possessing SSBNs — to survive a decapitating first strike —remains unsubstantiated.\n\nAdditionally, the under-sea deployment of nuclear weapons against a counter-force threat from China underscores India’s lack of confidence in its land- and air-based nuclear assets. Such threat perceptions seemingly ignore the Chinese nuclear strategy, which neither seeks parity nor aims to use nuclear weapons as instruments of war.\n\nIndia’s nuclear doctrine is inimical to strategic stability in South Asia. In pursuing an ambitious triad of nuclear forces, it is straying from the course charted after it went overtly nuclear in 1998.\n\nBoth the draft nuclear doctrine released in 1999, and the official version released later in 2003, state India’s commitment to a minimalist nuclear posture. CMD entails that deterrence can be projected through smaller number of nuclear weapons, and that keeping a ready-to-use nuclear arsenal on continuous alert is not necessary.\n\nIndeed, India’s development of a nuclear submarine force capable of carrying more than a hundred ready-to-fire nuclear warheads in the Indian Ocean is not in line with its CMD claim, and challenges the strategic stability of the region.\n\nFurthermore, the number of Indian nuclear warheads on SSBNs may increase if Indian policymakers decide to introduce MIRV capability into its sea-based nuclear delivery systems.\n\nAccording to India’s declared doctrine, air- and land-based nuclear weapons were believed to be kept in a state of ‘recessed deterrence’ during peacetime, which means that nuclear weapons are de-alerted, de-mated and disassembled. In case of a conflict, operationalising the nuclear arsenal from recessed to ready-state would require coordination among multiple agencies.\n\nIn case of SSBNs, the nuclear weapons are kept in a ready-to-fire state, to have assured second-strike capability, which requires a warhead to be pre-mated to the delivery vehicle. An Indian SSBN on deterrent patrol is believed to be deployed with mated and ready-to-fire SLBMs, which has significant implications for alert levels and could alter nuclear force postures.\n\nMeanwhile, the SSBN programme, carrying ICBMs, represents a lurking threat to the region, as well as the globe. In such a situation, Pakistan shall be constrained to restore balance, albeit with proportionate and restrained responses to an evolving threat.\n\nThe writer is visiting faculty at National Defence University, Islamabad\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:06:41.196Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925924/comment-indias-nuclearisation-of-oceans-poses-a-global-threat",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:22:19.000Z"
}
