{
  "title": "Ex-Liverpool defender Joey Jones dies aged 70 - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Former Liverpool and Wales defender Joey Jones, a key member of two European Cup-winning teams, has died aged 70 after illness, the club said on Tuesday.\n\nJones made 100 appearances for Liverpool in three highly successful years between 1975 and 1978, also winning a UEFA Cup and a league title.\n\nJones, was part of the Liverpool side who won their first European Cup in 1977 and successfully defended the title the following year.\n\nThe tough-tackling left-back also earned 72 caps for Wales.\n\nHe was immortalised in a banner revealed by Liverpool fans at the 1977 European Cup final victory over Borussia Monchen­gladbach, which said: “Joey ate the frogs’ legs, made the Swiss roll, now he’s munching Gladbach”.\n\nIt was a reference to wins over French club Saint Etienne and Zurich in the quarter and semi-finals.\n\n“Liverpool FC is deeply saddened by the passing of Joey Jones. The thoughts of everyone at LFC are with Joey’s family and friends at this sad time,” the club said in a statement.\n\nJones started and ended his career at Wrexham and also had spells at Anfield, Chelsea and Huddersfield.\n\nJones spent spent 11 years in three stints at Wrexham who said they would build a statue in his honour.\n\nHis former Wales team-mate Mickey Thomas posted on X: “This morning I lost my best friend and soul mate, Sir Joey our memories will never fade — Today my heart is broken. Love you Sir Joey RIP. My condolences are with Janice and all the family.”\n\nFormer Liverpool star John Aldridge also paid tribute, writing: “What a lovely man and an inspirational full back who gave his heart and soul in a red shirt and for all the clubs he played for! Our thoughts are with Joey’s family! I’m a lucky man to have met him many times.”\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/23110359b07e8b4.jpg",
  "retrievedAt": "2025-08-17T21:07:57.118Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925959/ex-liverpool-defender-joey-jones-dies-aged-70",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:23.000Z"
}
