{
  "title": "British families receive ‘wrong remains’ of Air India plane crash victims: report - World - DAWN.COM",
  "author": null,
  "content": "Families in the United Kingdom have received the “wrong remains” of victims of an Air India plane crash last month, which left 260 people dead, according to a media report on Wednesday.\n\nThe families are suffering “fresh heartache because the remains of their loved ones were wrongly identified before being flown home”, British publication The Daily Mail reported.\n\nIt said relatives of one of the victims had to abandon “funeral plans after being informed that their coffin contained the body of an unknown passenger rather than their family member”.\n\nIn another case, the “commingled” remains of more than one person killed in the crash were mistakenly placed in the same casket, it added.\n\nA lawyer representing several families and UK media said relatives of a British victim received a casket that contained mixed remains. The family of a separate victim received the remains of another person, according to James Healy-Pratt, who is representing 20 British families who lost loved ones in the disaster.\n\nHealy-Pratt told the Press Association news agency that the return of victims’ remains had been marred by serious errors, which had been identified following a probe by a British coroner.\n\n“In the first two caskets that were repatriated, in one of the caskets, there was co-mingling of DNA which did not relate to the deceased in that casket or the casket that accompanied it,” he said.\n\nThe lawyer added the coroner was then “able to determine that one particular loved one was not at all who the family thought they were”.\n\nMiten Patel, whose mother Shobhana Patel died along with her husband in the disaster, told the BBC that “other remains” were found in her casket after her body was returned to Britain.\n\n“People were tired and there was a lot of pressure. But there has to be a level of responsibility that you’re sending the right bodies to the UK,” he told the broadcaster.\n\nThe Indian Ministry of External Affairs (MEA) said it has been “working closely with the UK side from the moment these concerns and issues were brought to our attention”.\n\nMEA spokesman Randhir Jaiswal said in a post on X today: “In the wake of the tragic crash, the concerned authorities had carried out identification of victims as per established protocols and technical requirements. All mortal remains were handled with utmost professionalism and with due regard for the dignity of the deceased.”\n\nHe added: “We are continuing to work with the UK authorities on addressing any concerns related to this issue.”\n\nThe UK-bound plane slammed into several buildings on June 12 after crashing in western Gujarat state.\n\nAmong the passengers were 169 Indian nationals, 53 British nationals, seven Portuguese and a Canadian.\n\nOne passenger survived the crash after he jumped out of the plane.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:05:45.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926084/british-families-receive-wrong-remains-of-air-india-plane-crash-victims-report",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T15:08:51.000Z"
}
