{
  "title": "HRCP alarmed at political dysfunction, injustice in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Human Rights Commission of Pakistan (HRCP) on Monday raised alarm over political dysfunction and rising injustices in Punjab.\n\nThe HRCP held a press conference to highlight the human rights situation in Punjab as recorded in its report, State of Human Rights in 2024, launched earlier.\n\nWhile voter registration and total votes cast was reportedly increased in the 2024 general elections, the turnout declined. Women’s representation in the assemblies more than doubled, but the Punjab Assembly remained plagued by disruptions, a tendency to ignore input from the opposition, and hurried legislation. Assembly proceedings in 2024 were dominated by chaos. Women MPAs staged a walkout over inappropriate gestures in the House and the allocation of reserved seats for women and minorities faced legal setbacks.\n\nThe Punjab Defamation Act 2024, hurriedly approved in June, was widely criticised by human rights networks for stifling free speech. The law was subsequently challenged in the Lahore High Court as unconstitutional.\n\nThe Punjab authorities imposed road closures to prevent PTI protests in Islamabad, infringing on the right to movement for both political activists and ordinary citizens.\n\nContinued persecution of religious minorities persisted, including a Christian man in Sargodha who was lynched by a violent mob, following accusations of blasphemy. The Ahmadiyya community withdrew from the electoral process entirely, citing systemic discrimination and lack of safety.\n\nThe report notes with alarm that nine people from Punjab were killed on the Quetta-Taftan highway as well as seven Punjabi labourers in an alleged militant attack in Panjgur, Balochistan.\n\nPunjab continued to account for the highest number of child abuse cases in the country. Between January and June 2024 alone, the province reported 78pc of the 1,630 cases nationwide, alongside 2,506 incidents of sexual abuse, 2,189 kidnappings, 457 cases of child trafficking, and 455 instances of physical abuse. The death of 11-year-old Ayesha, a domestic worker in Faisalabad, and similar incidents in Sargodha and Lahore exposed the violence faced by underage working children in private homes.\n\nReports of sexual violence against women with mental disabilities, domestic abuse resulting in fatalities, including pregnant women, and honour killings continued throughout the year.\n\nIn a case involving an alleged rape at a private college in Lahore, HRCP noted that there was no conclusive evidence that the incident had occurred. A ruling by the Lahore High Court declared the age-based gender distinction in the Child Marriage Restraint Act 1929 unconstitutional; however, broader legislative reform remained stalled.\n\nThe report notes that workers’ rights and environmental conditions were also neglected. Sanitation workers continued to face hazardous working conditions.\n\nMeanwhile, the provincial government failed to address dangerously high smog levels, with Lahore and Multan recording unprecedented air pollution levels in November.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/231107207d7f821.png",
  "retrievedAt": "2025-08-17T21:07:15.905Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926001/hrcp-alarmed-at-political-dysfunction-injustice-in-punjab",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:44.000Z"
}
