{
  "title": "Contractor remanded for eight days in Kohistan graft case - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: An accountability court here remanded a contractor into custody of National Accountability Bureau (NAB) for eight days in a high-profile case involving alleged embezzlement of Rs36 billion funds in the Upper Kohistan district accounts office.\n\nJudge Mohammad Zafar directed NAB officials to produce the suspect, Fazal Rahim, before him on July 29. The judge also allowed five days additional custody of two other contractors named Doraj Khan and Mohammad Ayub to NAB after completion of their earlier physical remand.\n\nFazal Rahim was arrested from Kohistan on Sunday by officials of NAB, Khyber Pakhtunkhwa, raising the number of arrested suspects in the case to nine.\n\nOther arrested persons include former district account officer of Upper Kohistan Shafiqur Rehman, auditor of accountant general office Fazal Hussain, former bank official-turned-contractor Mohammad Riaz, former manager of a private bank Tahir Tanveer and contractors Doraj Khan, Amir Said, Subedar Khan and Mohammad Ayub.\n\nNine people have been arrested for their alleged involvement in the scam\n\nFazal Rahim, Doraj Khan and Mohammad Ayub were produced before the court by NAB officials, stating that they were involved in illegal withdrawal and misappropriation of more than Rs36.63 billion from the contractors’ security deposit head of an account, G-10113.\n\nThey said that on credible information, NAB started an inquiry and during preliminary probe it revealed that officials of communication and works department, Upper Kohistan, in connivance with officials of district accounts office, Upper Kohistan, and NBP branch there, misappropriated funds from different projects through bogus withdrawal of funds from national treasury in the name of several contractors, who did not execute any civil work.\n\nA deputy prosecutor general of NAB, Mohammad Ali, said that Fazal Rahim was also part of the group, which embezzled the funds. He stated that several transactions had taken place in the bank accounts of the suspect, therefore, the bureau needed his custody for interrogating him.\n\nAbout Doraj Khan, he said that he was owner of a construction company M/S Holly Woood Construction Company and received more than Rs1.10 billion in the bank accounts of the said firm.\n\nHe said that the suspect had transferred the encashed crime proceeds to his personal bank accounts and utilised the same to purchase upscale properties in his own names and that of his benamidars/associates.\n\nSimilarly, about Mohammad Ayub, he stated that he was also involved in the offence as several transactions were taken place in his accounts and from the alleged ill-gotten money he acquired several properties.\n\nNAB has claimed that the suspects in league with each other fraudulently submitted fake bills and got issued different cheques in favour of different companies owned by several contractors from head of account ‘G-10113’ for earnest money, security and deposit funds of local government, communication and works, irrigation and public health departments on the pretext of civil work, which had never been done.\n\nThe accountability courts have so far confirmed several NAB orders to freeze dozens of moveable and immovable properties, including luxurious residences, commercial plazas and plots, expensive vehicles and cash, including foreign currency.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/2511101435f88d0.jpg?r=111017",
  "retrievedAt": "2025-08-17T21:06:42.129Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925904/contractor-remanded-for-eight-days-in-kohistan-graft-case",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:57.000Z"
}
