{
  "title": "Many PTI bigwigs jailed for May 9 violence - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Yasmin Rashid, Omer Cheema, opposition leader of Punjab Assembly among those handed 10-year jail term; convicted leaders face disqualification under Article 63(1)(g)\n• Shah Mehmood Qureshi among six acquitted in Sherpao Bridge case\n• PTI leadership vows to move high court against ‘unjust’ decisions\n• Suspended PTI MPAs reinstated by acting Punjab Assembly speaker\n\nLAHORE: Several PTI leaders were handed down decade-long sentences by two anti-terrorism courts in Lahore and Sargodha in connection with cases registered in the aftermath of the May 9, 2023, violence that had engulfed the country following the arrest of former prime minister Imran Khan in a corruption case.\n\nIn Lahore, ATC Judge Arshad Javed announced the decision in Kot Lakhpat Jail around 9:30pm in the presence of the incarcerated PTI leaders, who were implicated in the Sherpao Bridge case.\n\nThe court awarded 10-year rigorous imprisonment to Dr Yasmin Rashid, Senator Ejaz Chaudhry, former governor Omar Sarfraz Cheema, and former provincial minister Mian Mehmoodur Rashid. Besides four senior leaders of the PTI, the judge sentenced as many accused to 10-year rigorous imprisonment, including Afzaal Azeem Pahat, Ali Hassan, Khalid Qayum and Riaz Hussain.\n\nThe court, however, acquitted PTI Vice Chairman Shah Mehmood Qureshi. This is the first verdict in any of the cases related to the May 9 riots in Lahore. The judge acquitted six accused, including Mr Qureshi, who, as per his defence, was in Karachi on the day of the alleged occurrence. PTI activists Hamza Azeem, Aitzaz Rafiq, Rana Tanvir, Iftikhar Ahmad, and Zayas Khan were also acquitted.\n\nIn this case, as many as 14 accused were indicted during the trial conducted in the jail for security reasons. The prosecution had submitted the challan (charge-sheet) on Sept 28, 2023.\n\nIn its final arguments, the prosecution had argued that the ‘May 9 conspiracy’ was hatched on May 7 at Zaman Park, the residence of Imran Khan.\n\nAdvocate Burhan Moazzam\n\nMalik, the lead defence counsel, argued that the FIR mentioned 400 accused persons, but only 14 were being put on trial. The lawyer also pointed out that no medical certificate existed to prove that any person was injured on May 9. He said the prosecution failed to establish the presence of the PTI leaders at the place of alleged occurrence.\n\nAbout Mr Qureshi, he said the former foreign minister was in Karachi on May 9, 2023. The Sarwar Road police registered the FIR, claiming that the accused delivered provocative speeches and incited rioting, attacks and public disorder at Sherpao Bridge during the widespread violent protests of May 9.\n\nSargodha ATC\n\nMeanwhile, the Sargodha ATC awarded ten-year rigorous imprisonment each to dozens of PTI leaders, including Leader of the Opposition in the Punjab Assembly Ahmed Khan Bhachar, in another May 9 riots case registered at the Musakhel police station.\n\nATC Judge Naeem Sheikh convicted as many as 32 accused, including sitting MNA Ahmad Chattha and former MNA Rana Bilal Ijaz. In this case, over 70 accused persons, including National Assembly Opposition Leader Omar Ayub Khan, had been declared proclaimed offenders.\n\nOver a dozen accused were granted exemption from personal appearance during the trial proceedings. The prosecution presented testimonies of 50 witnesses to prove charges of attacks, vandalism, and incitement to violence against the accused.\n\nThe PTI parliamentarians convicted in May 9 cases would face automatic disqualification under Article63(1)(g) of the Constitution, which bars members convicted of crimes involving moral turpitude or corrupt practices.\n\n‘Unlawful, unjust’\n\nCommenting on the conviction, Mr Ayub said the decision by the Sargodha court was unlawful. In a statement on his X account, he said the same prosecution witnesses were declared untrustworthy by the previous trial judge. He said the PTI leaders had been convicted unjustly. He said the PTI leaders will challenge the conviction before the higher courts.\n\nMr Bhachar also announced he would challenge the ATC verdict in the Lahore High Court. “Once the written verdict is received, I will approach the Lahore High Court,” he added.\n\nSuspended PTI MPAs reinstated\n\nSeparately, Punjab Assembly acting Speaker Zaheer Iqbal Channar on Tuesday reinstated 26 opposition PTI members who had been suspended for 15 sittings for disrupting Chief Minister Maryam Nawaz Sharif’s speech on June 27.\n\nDuring the session, Punjab Finance Minister Mujtaba Shujaur Rehman addressed the house and conveyed Chief Minister Maryam’s desire for the return of the suspended members. “These representatives have been elected by the people and have come to the assembly,” the minister said, adding, “I request the speaker to allow them back into the house so they can represent their constituencies.”\n\nHe emphasised the importance of the opposition’s presence, remarking, “The assembly lacks vibrancy without the opposition. The reinstatement of the 26 suspended members will enable them to represent their constituencies effectively. Frankly, I don’t enjoy the proceedings as much without the opposition.”\n\nEarlier, Speaker Malik Muhammad Khan had rejected references against the 26 opposition MPAs seeking their disqualification on Saturday.\n\nMeanwhile, the Punjab Assembly also unanimously adopted a resolution condemning the killing of nine bus passengers from Punjab while they were travelling in Balochistan on July 10.\n\nAmjad Mahmood in Lahore also contributed to this report\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:09:23.331Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925931/many-pti-bigwigs-jailed-for-may-9-violence",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:22:12.000Z"
}
