{
  "title": "Sindh farmers to boycott wheat cultivation over imposition of farm tax - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Leaders say millions of farmers are ready to court arrest, but will not pay the tax\n• Sindh Chamber of Agriculture vows to move court or go for some other crops\n\nHYDERABAD: Sindh Chamber of Agriculture (SCA) has announced that it will challenge the 45pc agricultural income tax in court. It described the tax as ‘unconstitutional, illegal and unethical’, and asked its members and farmers across Sindh to boycott wheat cultivation this year.\n\nThe decision was taken at meeting of the chamber held here on Tuesday under the chairmanship of its patron-in-chief, Dr Syed Nadeem Qamar.\n\nThe meeting rejected the tax and claimed that it was imposed under directives of the Inter­national Monetary Fund (IMF).\n\nThe farmers who attended the meeting argued that they were not receiving fair prices for their produce and, as such, there was no justification for the imposition of such a tax.\n\nThe meeting asked farmers across Sindh not to pay the tax, and warned that if government resorted to arrest them for on this disobedience, millions of other farmers would also court arrest. “We are ready to face imprisonment, but will not pay the agricultural income tax,” farmers’ leaders at the meeting declared.\n\nThe participants announced a complete boycott of agricultural income tax and asked the government for the exemptions similar to those given to industrialists.\n\nThe SCA told farmers to boycott wheat cultivation for the 2025-26 season on the ground that they were not getting adequate support prices.\n\nThe farmers vowed to go for growing alternative crops, such as mustard, nigella (kalonji), sunflower and other oilseeds instead. They said that due to very low wheat prices, they could not even recover the cost of production, and this year will be marked as a ‘boycott year’ for wheat cultivation.\n\nDecline in cotton production\n\nThe chamber expressed its deep concern over 40pc decline in cotton production, estimating that the yield would not exceed four million bales. It said farmers were receiving only Rs6,500 per maund for cotton although the Sindh agriculture minister had promised Rs11,000 per ma­und which did not materialise.\n\nSCA demanded withdrawal of the 18pc local tax on cotton and imposition of a 25pc tax on imported cotton to discourage imports this promoting local production. It expressed its concern over rising cost of agricultural inputs, citing a Rs22 per liter increase in diesel prices and Rs600 per bag increase in DAP fertiliser over the last 15 days.\n\nIt said that skyrocketing prices of essential agricultural inputs were crippling farmers, especially since they were not receiving fair prices for their produce. These developments, it warned, indicated a deliberate destruction of agricultural sector. It demanded immediate rollback of increased prices of diesel, fertilisers, seeds, pesticides and other agricultural inputs.\n\nThe chamber urged farmers to contact their respective mukhtiarkars (administrative officers) and related officials to get themselves registered for the Benazir Hari Card. It demanded that the subsidy of Rs10,000 per acre, currently available to sunflower and canola crops, be extended to mustard and rapeseed crops as well.\n\nThe meeting was attended by Sindh Irrigation and Drainage Authority Chairman Kabool Khatian, general secretary Zahid Bhurgari, Nabi Bux Sathio, Shahnawaz Khan Jamali, Asghar Khan Noonari, Murad Ali Khan Nizamani, Sikander Ali Sariwal, Bilal Khan Laghari, Abdul Karim Talpur and others.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/67a1587013e09.gif",
  "retrievedAt": "2025-08-17T21:07:14.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925934/sindh-farmers-to-boycott-wheat-cultivation-over-imposition-of-farm-tax",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:38.000Z"
}
