{
  "title": "Balochistan couple murder: Quetta ATC extends tribal leader’s physical remand by 10 days - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Quetta anti-terrorism court on Wednesday extended the physical remand of tribal leader Sardar Sherbaz Satakzai, one of the main suspects in the ‘honour’ killing of a man and a woman, for 10 more days.\n\nThe viral video of the murder showed a group of men leading a couple out of vehicles and into a desert before gunning them down with pistols and shooting the bodies. Political figures and activists said it was an ‘honour’ killing incident. Balochistan Chief Minister Sarfraz Bugti said on Sunday that he had directed the provincial police to take immediate action, following which one suspect was apprehended.\n\nSardar Satakzai is one of the main suspects in the case and was presented before the Quetta ATC on Monday before being handed over to the Serious Crimes Investigation Wing (SCIW) on a two-day physical remand on the judge’s order upon the police’s request.\n\nHe was presented in the ATC today before Judge Muhammad Mubeen, who accepted the police request and granted Satakzai’s physical remand for another 10 days, handing him over to the SCIW.\n\nSeparately, a video statement of the woman’s mother emerged today in which she defended the incident and said it occurred as per local custom and tradition. She said the decision was taken by a jurga and Satakzai had no role in it, calling for his release.\n\nThe Pakistan Ulema Council (PUC) strongly condemned the mother’s statement, declaring it contrary to Islamic teachings, as well as the Constitution and law.\n\nThe PUC said the remarks suggested that the murder was committed with the consent of the parents, a revelation it termed “deeply disturbing and unacceptable”.\n\nThe PUC declared that it was the responsibility of the state, law enforcement agencies, the Balochistan government and the provincial judiciary to take firm action against all those facilitating the perpetrators.\n\nIt categorically rejected the parents’ justification, stating that it violated Islamic principles and the Constitution.\n\nTerming the incident both condemnable and tragic, the PUC called for a comprehensive investigation and stressed that justice must be served without delay or negligence. It urged the state to fulfil its constitutional and moral duty by ensuring that all those responsible were brought to justice.\n\nPUC Chairman Tahir Ashrafi further said that the parents did not have the right to forgive the killers or kill their own children.\n\nIn Pakistan, ‘honour’ killings continued to claim the lives of women throughout 2024, perpetuated by deeply ingrained societal beliefs about family dignity and shame.\n\nData from the Human Rights Commission of Pakistan shows that in 2024, ‘honour’ killings continued to be a serious issue across Pakistan, with particularly high figures in Sindh and Punjab. From January to November, a total of 346 people fell victim to ‘honour’ crimes in the country.\n\nThe previous two years also saw a consistent rise in murders related to the so-called ‘honour’.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2318300414a731a.png",
  "retrievedAt": "2025-08-17T21:05:41.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926080/balochistan-couple-murder-quetta-atc-extends-tribal-leaders-physical-remand-by-10-days",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T14:22:31.000Z"
}
