{
  "title": "Bangladesh seethes as toll from jet crash rises to 31 - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Grief gave way to anger in Bangladesh on Tuesday, a day after a fighter jet crashed into a school, killing 31 people, mostly children, in the country’s deadliest aviation accident in decades.\n\nThe pupils had just been let out of class when the Chinese-made F-7 BJI aircraft slammed into the private Milestone School and College in Dhaka on Monday. At least 31 people have died, up from the military’s earlier toll of 27.\n\nMore than 170 people were injured in the crash, with 69 of them still undergoing treatment at various hospitals. “Ten patients are in very critical condition,” Sayedur Rahman, from the Ministry of Health and Family Welfare, told reporters.\n\nAt a protest on the school campus, students accused the government of lying about the death toll and demanded a list of those injured. “There were hundreds of students in that academic building. We saw body parts strewn all over the ground. Where are they?” a 17-year-old student said. “When students and teachers asked this question to the military personnel, they roughed us up,” he said.\n\nMilitary accused of roughing up protesting students\n\nSome of the students carried placards that read: “We want justice” and “Where are the bodies of our brothers and sisters?” Students also stormed the national secretariat in Dhaka, prompting police to use batons and stun grenades, local media reported.\n\nPress secretary Ahammed Foyez said that the government had agreed to meet the student’s demands. “We believe the demands raised by the students are legitimate and should be fulfilled,” Foyez said.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6880212d46fb3.gif",
  "retrievedAt": "2025-08-17T21:07:22.102Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925976/bangladesh-seethes-as-toll-from-jet-crash-rises-to-31",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:29.000Z"
}
