{
  "title": "19-year-old girl dies in coma after alleged marital rape: Karachi police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A 19-year-old girl in Karachi’s Lyari succumbed to her injuries after an alleged marital rape at the hands of her husband, police said on Wednesday.\n\nEarlier this month, the newlywed girl was admitted to Civil Hospital Karachi in critical condition after allegedly enduring “brutal sexual violence” from her husband, who was arrested by the police.\n\nThe victim was in a coma and her physical examination findings were “consistent with sexual violence”, police surgeon Dr Summaiya Syed had stated.\n\n“The rape victim, 19, passed away at the trauma centre of the Civil Hospital Karachi at 10:45am today,” Syed said today.\n\nShe was admitted to the trauma centre in a “critical condition”, having undergone a surgical procedure at another hospital, she added.\n\n“Her initial findings were positive for sexual violence,” she said.\n\nThe police surgeon told Dawn.com that the hospital informed police and family to conduct a post-mortem examination of the body and was waiting for their response.\n\nBaghdadi police Station House Officer Majid Alvi also confirmed her death to Dawn.com.\n\nHe said that the girl got married on June 15. “Two days later, the husband subjected her to sodomy” and assaulted her with a metal pipe, leading to deterioration of her health condition.\n\nThe brother of the victim had registered a first information report (FIR) at the Baghdadi Police Station on July 5 under Sections 324 (attempt to commit murder) and 376-B (punishment for rape) of the Pakistan Penal Code.\n\n“On the third day of her marriage, my sister was subjected to brutal sexual violence allegedly by her husband. She remained admitted at a private hospital in the city and was later taken to Shaheed Mohtarma Benazir Bhutto Trauma Centre of Civil Hospital Karachi in a critical condition the other day,” the FIR read.\n\nIn the FIR, the complainant said his 19-year-old sister married the suspect on June 15. Her health condition deteriorated on June 30, compelling the family to bring her back home. She informed the parents that on July 17, her husband subjected her to an “unnatural sexual act”.\n\nHe said that the husband also sexually assaulted her with a foreign object. Subsequently, the husband subjected her to sexual violence, leading to bleeding. As per the FIR, the suspect threatened his wife with “dire consequences” if she disclosed anything to anyone.\n\nDespite the presence of anti-rape laws — with punishment for rape either resulting in the death penalty or imprisonment of between 10 and 25 years — cases continue to prevail in the country.\n\nIn May, two sisters were subjected to a sexual assault in their home in North Karachi, police and doctors had said.\n\nIn April, in a rare verdict, an additional district and sessions judge in Gujranwala handed down 10-year rigorous imprisonment to a man for subjecting his wife to an unnatural sexual offence.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:06:00.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926056/19-year-old-girl-dies-in-coma-after-alleged-marital-rape-karachi-police",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T12:04:18.000Z"
}
