{
  "title": "MAGA-style ‘anti-globalist’ politics arrives in Japan - World - DAWN.COM",
  "author": null,
  "content": "TOKYO: Populist ideals are gaining traction in Japan, spurred by right-wing politicians running rampant elsewhere railing against “elitism”, “globalism” and immigration.\n\nWhile Prime Minister Shigeru Ishiba’s coalition lost its upper house majority in an election on Sunday, the “Japanese first” Sanseito party, created only five years ago, increased its seats from two to 15.\n\nSanseito’s agenda comes straight from the copybook of right-wing movements such as US President Donald Trump’s “Make America Great Again” (MAGA), the Alternative for Germany (AfD) and Nigel Farage’s Reform party in Britain.\n\nThis includes “stricter rules and limits” on immigration and foreign capital, opposition to “globalism” and “radical” gender policies, and a rethink on decarbonisation and vaccines, and pesticide-free agriculture.\n\nFounded on YouTube, Sanseito will “bring power back to the people”, party leader Sohei Kamiya, a 47-year-old former teacher and supermarket manager, wrote in the Japan Times.\n\nCheap labour\n\nSurveys have put immigration far down the list of voters’ concerns, who are much more worried about inflation and the economy. But for Sanseito, the influx of newcomers into Japan — where the immigration its economy badly needs is far lower than in other developed countries — is to blame for a host of ills from crime to rising property prices to dangerous driving.\n\n“It’s fine if they visit as tourists, but if you take in more and more foreigners, saying they’re cheap labour, then Japanese people’s wages won’t rise,” Kamiya said at a campaign. But he added: “We are not exclusionary. We have never called to drive out foreigners.”\n\nMeanwhile, online platforms have been flooded with disinformation, some of which Japanese fact-checking groups and the government have debunked. Some posts falsely claimed that foreigners leave almost $3 billion of medical bills unpaid a year, or that Chinese residents on welfare doubled in five years.\n\nAt a Sanseito election rally in front of Tokyo’s Shinagawa station, where orange T-shirted party workers handed out “Stop destroying Japan!” flyers, one voter said she was finally being heard.\n\n“They put into words what I had been thinking about but couldn’t put into words for many years,” said the 44-year-old IT worker on a precarious short-term contract.\n\n“When foreigners go to university, the Japanese government provides subsidies to them, but when we were going to university, everyone had huge debts.”\n\nMoscow meddling?\n\nRussian bot accounts have been responsible for “large-scale information manipulation”, according to a much-read blog post by Ichiro Yamamoto from the Japan Institute of Law and Information Systems think-tank.\n\nThis has been helped by artificial intelligence enabling better translation of material into Japanese. More understanding towards Russia — something which was long anathema for Japanese right-wingers — is also a theme for Kamiya.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/231032227068d55.jpg",
  "retrievedAt": "2025-08-17T21:07:34.765Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925981/maga-style-anti-globalist-politics-arrives-in-japan",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:29.000Z"
}
