{
  "title": "Panel moves to strengthen harassment laws for Balochistan women - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Baloch­is­­tan Assembly’s standing committee on women development, in its meeting on Tuesday, has discussed steps to stren­gthen workplace and harassment laws for women.\n\nThe meeting, presided over by Chairman Fazal Qadir Mandokhail, focu­s­­ed on the Draft Amend­m­ent Bill 2025, which seeks to fortify legal frame-wor­ks ensuring equality, res­p­ect, and protection for wo­­men in professional settings.\n\nA key proposal discussed that involved revising the procedure for appointing support staff in the Ombuds­person’s Office, aimed at enhancing its self-sufficiency and operational capacity.\n\nLawmakers also called for structural reforms to empower the Ombuds­person and ensure timely and just handling of harassment complaints.\n\n“The amendment’s int­ent is not only to shield women from harassment but to promote a culture of fairness, dignity, and inc­lusivity across all workpl­aces,” the committee emp­hasised.\n\nThe proposed legislation has been hailed as a milestone in advancing women’s rights in Ba­­lochistan, reinforcing the provincial government’s commitment to building a more inclusive and supportive work en-vironment for women, it added.\n\nThe meeting was atten­ded by Deputy Speaker Ghazala Gola, Raheela Hameed Durrani, Rub­a­­ba Khan Buledi, Safia Bibi, Meena Majeed Bal­och, and senior officials incl­uding Assembly Sec­re­tary Tahir Shah Kakar, Women Development Secretary Saira Atta,\n\nand Special Secretary Abdul Rehman.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/241204591a8a428.jpg?r=120517",
  "retrievedAt": "2025-08-17T21:08:50.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926008/panel-moves-to-strengthen-harassment-laws-for-balochistan-women",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:05.000Z"
}
