{
  "title": "Trade gap with neighbours widens 29pc in FY25 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s trade deficit with nine neighbouring countries expanded by 29.42 per cent in FY25, rising to $12.297 billion compared to $9.502bn in the preceding year.\n\nExports registered notable growth to Bangladesh, Afghanistan, and Sri Lanka, largely attributed to recent shifts in the regional political landscape. However, trade relations with these countries have remained strained in recent years, primarily due to challenges stemming from restrictive government policies.\n\nDespite the uptick in exports, the overall trade gap with regional partners widened, driven predominantly by increased imports from China, India, and Bangladesh during the months under review.\n\nIn FY24, the trade deficit with these countries was $9.506bn, up 49pc from $6.382bn in the preceding year.\n\nPakistan’s exports to Afghanistan, Bangladesh and Sri Lanka saw a hefty growth in July-June FY25. Still, exports to other countries, especially China, continued to decline during the period, according to data compiled by the State Bank of Pakistan.\n\nThe value of Pakistan’s exports to nine countries — Afghanistan, China, Bangladesh, Sri Lanka, India, Iran, Nepal, Bhutan and the Maldives — rose 1.49pc to $4.401bn in July-June FY25 from $4.336bn over the same period last year.\n\nContrary to this, imports surged 20.66pc to $16.698bn in FY25 from $13.838bn over the same period of the previous fiscal year.\n\nFurther analysis showed that imports from China grew by 20.79pc to $16.312bn in FY25 from $13.504bn over the same period last year. In FY24, imports from China totalled $13.506bn, up by 39.78pc from $9.662bn over the previous year. The bulk of imports in the region are sourced from China, with partial contributions from India and Bangladesh.\n\nPakistan’s exports to China dipped 8.6pc to $2.476bn in FY25 from $2.709bn over the same months in the preceding fiscal year.\n\nImports from India increased pc to $220.58m in FY25 from $206.89m over the last year. In FY24, imports from India rose 6.62pc to $206.89m — up from $190.04m in the same period last year. Meanwhile, exports to India remained at $1.43m in FY25. Exports to India totalled $3.669m in FY24 against $0.329m in the same period the previous year.\n\nExports to Afghanistan increased 38.68pc to $773.89m in FY25 from $558.03m last year. Imports stood at $25.89m against $11.96 in FY24, a growth of 116.47pc. Pakistan’s main exports to Afghanistan include sugar in the current fiscal year. In the past four months, Pakistan has exported more than 700,000 tonnes of sugar, mostly to Afghanistan.\n\nNo data is available as most trade with Iran is conducted via informal channels. However, Pakistan has opted for barter trade amid the thriving smuggling of Iranian petroleum products and LPG via a porous border of Balochistan.\n\nExports to Bangladesh increased by 19.08pc to $787.35m in FY25 from $661.19m. Imports grew 38.47pc to $78.31m in FY from $56.55m over the last year. The increase resulted after the toppling of the Hasina government in Dhaka. Pakistan has started exporting rice to Bangladesh in the current fiscal year.\n\nExports to Sri Lanka dropped 4.14pc to $376.61m in FY25 from $392.89m over the last year. This decline in exports to Sri Lanka occurred following the recession in economic activity.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68801c4531c50.gif",
  "retrievedAt": "2025-08-17T21:08:08.558Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925963/trade-gap-with-neighbours-widens-29pc-in-fy25",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:15.000Z"
}
