{
  "title": "World’s top court paves way for climate reparations - World - DAWN.COM",
  "author": null,
  "content": "The world’s highest court on Wednesday declared that states are obligated under international law to tackle climate change and warned that failing to do so could open the door to reparations.\n\nIn a historic ruling, the International Court of Justice (ICJ) said climate change was an “urgent and existential threat” and states had a legal duty to prevent harm from their planet-warming pollution.\n\nCountries breaching their climate obligations were committing a “wrongful act”, the court said in its advisory opinion, which is not legally binding but carries significant moral, political and legal weight.\n\n“The legal consequences resulting from the commission of an internationally wrongful act may include … full reparations to injured states in the form of restitution, compensation and satisfaction,” said ICJ President Yuji Iwasawa on behalf of the 15-judge panel.\n\nThis would be on a case-by-case basis where a “sufficient direct and certain causal nexus” had been shown “between the wrongful act and the injury”, the court added.\n\nHistorically, rich, industrialised countries have been responsible for the majority of emissions. Iwasawa said these countries had to take the lead in addressing the problem.\n\nCampaigners and countries on the climate frontlines hailed a milestone moment in the fight for accountability from big polluters most responsible for global warming.\n\nRalph Regenvanu, the climate change minister for Vanuatu, the small Pacific island nation which spearheaded the case at the Hague, was jubilant.\n\nSpeaking to AFP outside the court, Regenvanu said it was “a very strong opinion at the end” and better than hoped.\n\n“We can use these arguments when we talk with our partners, some of the high-emitting states. We can say you have a legal obligation to help us,” he said.\n\n“This helps us in our arguments. It’s going to give us a lot more leverage … in all negotiations.”\n\nThis was the biggest case in ICJ history, and seen as the most consequential in a recent string of landmark climate rulings.\n\nThe United Nations had tasked the 15 judges at the ICJ, a UN court in the Hague that adjudicates disputes between nations, to answer two fundamental questions.\n\nFirst: What must states do under international law to protect the environment from greenhouse gas emissions for the future?\n\nSecond: What are the consequences for states whose emissions have caused environmental harm, especially to vulnerable low-lying island states?\n\nIn a detailed summary of the opinion, Iwasawa said the climate “must be protected for present and future generations”.\n\nThe adverse effect of a warming planet “may significantly impair the enjoyment of certain human rights, including the right to life”, he added.\n\nLegal and climate experts said the opinion, while not legally binding, could have far-reaching consequences for national courts, legislation and public debate.\n\n“The court’s clear and detailed articulation of state obligations will be a catalyst for accelerated climate action and unprecedented accountability,” David Boyd, a former UN special rapporteur on human rights and the environment, told AFP.\n\nJohan Rockstrom, director of the Potsdam Institute for Climate Impact Research, said the ruling bound all nations by international law to prevent harm from emissions of planet-warming greenhouse gases.\n\nThe court was “pointing the direction for the entire world and making clear that every nation is legally obliged to solve the climate crisis”, he told AFP.\n\nCourts have become a key battleground for climate action as frustration has grown over sluggish progress toward curbing planet-warming pollution from fossil fuels.\n\nThe Paris Agreement, struck through the UN Framework Convention on Climate Change (UNFCCC), has rallied a global response to the crisis, but not at the speed necessary to protect the world from dangerous overheating.\n\nThe journey to the Hague began six years ago with students from the climate-imperilled Pacific region fed up with the lack of accountability for the damage afflicting their homelands.\n\nThe fight pitted major wealthy economies against the smaller, less developed states, which are most at the mercy of a warming planet.\n\nMore than 100 nations and groups made submissions in the Hague, many from the Pacific who gave impassioned appeals in colourful traditional dress.\n\n“It’s such a perfect ending to a campaign that started in a classroom,” said Vishal Prasad, director of the student-led campaign that kicked off the case.\n\n“We have now a very, very strong tool to hold power accountable, and we must do that now. The ICJ has given everything possible,” he told AFP in the Hague.\n\nJohn Kerry, the former US special envoy for climate change, told AFP, “It should not take the stamp of international law to motivate countries to do what is already profoundly in their economic interests.\n\n“We shouldn’t need another reason to act and accelerate action.”\n\nThe ruling could also make it easier for states to hold other states to account over climate issues like pollution or emissions.\n\n“The court can affirm that climate inaction, especially by major emitters, is not merely a policy failure but a breach of international law,” said Fijian Vishal Prasad, one of the law students who lobbied the government of Vanuatu in the South Pacific Ocean to bring the case to the ICJ.\n\nAlthough it is theoretically possible to ignore an ICJ ruling, lawyers say countries are typically reluctant to do so.\n\n“This opinion is applying binding international law, which countries have already committed to,” Chowdhury said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2400000667342b6.jpg",
  "retrievedAt": "2025-08-17T21:05:32.706Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926082/worlds-top-court-paves-way-for-climate-reparations",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T15:11:53.000Z"
}
