{
  "title": "AJK tribunal nullifies minister’s 2021 election - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: An election tribunal in Azad Jammu and Kashmir (AJK) on Tuesday nullified the July 2021 election of Agriculture Minister Sardar Mir Akbar from a constituency in Bagh district.\n\nThe verdict was delivered by District Judge Sardar Muhammad Akram Khan, who heads the tribunal, on a petition filed by Sardar Qamaruz Zaman of PPP, a former minister.\n\nThe petitioner challenged the notifications declaring Mr Akbar’s victory, citing alleged rigging, procedural irregularities and constitutional violations.\n\nMr Akbar had contested the election from LA-16 Bagh-III, commonly known as Sharqi Bagh, on a PTI ticket.\n\nHe later served as a cabinet member in successive PTI governments led by Sardar Abdul Qayyum Niazi and Sardar Tanveer Ilyas.\n\nIn April 2023, amid mounting pressure and internal strife within the PTI, he joined a breakaway ‘forward bloc’ under the leadership of Prime Minister Chaudhry Anwarul Haq.\n\nSardar Akbar was elected in the 2016 general election on a PML-N ticket and served as minister for forests for five years.\n\n`Transparency in question’\n\nSardar Akram Khan, the judge, noted in his ruling that after extensive deliberations and analysis of the objections raised, the court found that Mr Zaman had proven all but four of them.\n\n“Widespread irregularities, procedural violations and electoral fraud raise serious questions about the transparency of the election and cast doubt on the legitimacy of the returned candidate’s success,” the judge observed.\n\n“Given that the fundamental purpose of an election tribunal is to ensure transparency in the electoral process and uphold the rule of law, it is only just that when blatant legal violations and corrupt practices are proven through concrete documentary and oral evidence, such election results be declared void,” he added.\n\nWhile dismissing the petitioner’s demand for the return of Mr Akbar’s salaries and allowances, the judge annulled the election results and cancelled the official notifications dated July 27 and July 30, 2021, which had declared him successful.\n\nThe tribunal directed the AJK Election Commission to immediately conduct fresh elections in LA-16 Bagh-III.\n\nAccording to constitutional and legal experts, the tribunal’s verdict will only become enforceable once the election commission formally issues a de-seating notification.\n\nThe commission has been incomplete since January, when the five-year term of Chief Election Commissioner retired justice Abdul Rashid Sulehria expired.\n\nThe commission is also supposed to include a senior member and one other member. While a former civil servant, Syed Nazirul Hasan Gilani, has been appointed as a member, the post of senior member remains vacant, further hindering the commission’s ability to act on the tribunal’s directives.\n\nIn a statement following the judgement, Mr Akbar said he would appeal the decision before the AJK Supreme Court.\n\n“I hope the Supreme Court will do justice by overturning the tribunal’s verdict and validating my election,” he said.\n\nOn the other hand, Mr Zaman addressed a meeting arranged by party workers in Bagh to celebrate his victory, instructing them to begin preparations for fresh elections.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2023/06/6498b6726d6cd.jpg",
  "retrievedAt": "2025-08-17T21:08:41.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926004/ajk-tribunal-nullifies-ministers-2021-election",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:06.000Z"
}
