{
  "title": "Foreign debt inflows surge to $12.4bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s foreign debt inflows surged to $12.4 billion in FY25, largely due to a last-minute $3.4bn commercial borrowing from foreign banks to meet an International Monetary Fund (IMF) benchmark, according to the Economic Affairs Division (EAD) report released on Tuesday.\n\nThe EAD data showed that almost 43pc of the total foreign assistance —amounting to $5.25bn — was disbursed in June alone, compared to $6.89bn in the preceding 11 months (July-May). The sharp uptick was driven by commercial loans from institutions in China and the UAE.\n\nIncluding rollovers and cash deposits maintained with the central bank, total external inflows for FY25 reached approximately $24bn. The budgeted target for the year was $19.4bn, including $9bn in rollovers from friendly countries, though the EAD did not specify how much of the targeted rollovers were actually realised.\n\nThe report said that total fresh loans and grants amounted to $12.14bn in FY25, up 24pc from $9.81bn in the previous fiscal year. This includes $8.6bn (71pc) in programme and budgetary support, compared to $6.7bn in FY24 — a 28pc increase. Project financing accounted for $3.5bn, up 17pc from $3bn last year.\n\nPakistan secures $5.25bn in June alone to meet IMF benchmark\n\nOf the total, inflows from multilateral lenders stood at $4.84bn, compared to $4.28bn in FY24. Bilateral disbursements declined by 35pc to $600 million, from $920m the previous year. Combined, multilateral and bilateral inflows amounted to $5.44bn in FY25, slightly up from $5.2bn last year.\n\nThe EAD also reported a significant rise in foreign commercial borrowing, which rose to $4.3bn — up 330pc from the previous year. The government had originally budgeted $3.8bn from foreign commercial banks for FY25, a target that was exceeded despite earlier reluctance from lenders.\n\nIn contrast, the government’s $1bn target for international bond issuance in FY25 could not be materialised. A projected $9bn inflow from China and Saudi Arabia, including $5bn in time deposits from Riyadh and $4bn in SAFE deposits from Beijing, remains crucial for bridging the country’s external financing gap under the IMF programme.\n\nMeanwhile, proceeds from overseas Pakistanis through the Naya Pakistan Certificates rose to $1.9bn in FY25, up 73pc from $1.1bn in FY24.\n\nAmong multilateral donors, the Asian Development Bank was the single largest lender, disbursing $2.13bn in FY25 compared to $1.3bn last year. The World Bank followed with $1.77bn in disbursements.\n\nNotably, the EAD data does not include the $2bn disbursed by the IMF under the $7bn Extended Fund Facility, which is recorded separately by the State Bank of Pakistan.\n\nPublished in Dawn, July 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/19095052842e773.jpg?r=101016",
  "retrievedAt": "2025-08-17T21:08:16.743Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925966/foreign-debt-inflows-surge-to-124bn",
  "dateList": "2025-07-23",
  "date_published": "2025-07-23T00:23:15.000Z"
}
