{
  "title": "Minister objects to polio sampling, seeks third-party audit",
  "author": "Asif Chaudhry",
  "content": "LAHORE: Punjab Minister for Health and Population Welfare Khwaja Imran Nazir has stirred up a controversy, raising a question mark on the existing environmental polio sampling process, and stressed upon the authorities for the introduction of legislation to find out the reasons as to why Pakistan has still not been able to completely eradicate the crippling disease despite decades-old efforts.\n\nAddressing a seminar organised by the Emergency Operation Centre (EOC) Punjab here on Thursday, he announced that the Punjab government would go for a third-party audit of the environment sampling process.\n\n“In future, the provincial health department will also collect environmental samples in coordination with the experts of the World Health Organization (WHO),” the minister says.\n\nThe statement of the health minister brought the polio eradication programme to the limelight at a time when the environmental samples continued to be reported positive in some parts of Punjab.\n\nStresses polio legislation, warns of power disconnection for those who refuse vaccination\n\nAs per reports, the environmental samples were being found positive for wild poliovirus type 1 (WPV1) for the last few months in Lahore and Rawalpindi, making it a concerning issue for the provincial health authorities.\n\n“There must be a reason as to why Pakistan has still not been able to completely eradicate polio that continues to threaten the future of children,” says the health minister.\n\nFocalperson to the Chief Minister on Polio Eradication, Uzma Kardar, Punjab EOC coordinator Adeel Tasawur, Chief Executive Officer of Lahore District Health Authority Dr Asif Arbab and media representatives were also present on the occasion.\n\nKhwaja Imran Nazir said the health department has been directed to thoroughly examine all aspects to determine why, despite extensive efforts, the complete elimination of polio has not yet been achieved.\n\nWhile the government has full confidence in the sincerity and efforts of its development partners, it is still concerning that despite continuous efforts, the province has not been able to rid itself of this crippling disease.\n\nThe minister said Chief Minister Maryam Nawaz Sharif is deeply committed to complete eradication of polio.\n\nFor a better and safer future for children, there is a need to correct the direction and improve the approach towards this mission, Mr Nazir said and added: “It’s time to introduce legislation for polio eradication.”\n\nHe stressed that it is a collective responsibility of everyone to play their part in eradicating this disease, and warned that those would refuse polio drops to their children would have to face suspension of electricity supply.\n\nThe health department would also go for the blockade of their CNICs, he said adding that some more plans were underway in the fight against polio.\n\nImran Nazir emphasised that this small preventive step protects children from lifelong disability. “Our polio workers are our heroes, reaching every household. We request full cooperation from parents, so no child is left behind,” he added.\n\nHe highlighted the important role of media in supporting the government’s efforts by countering misinformation and ensuring accurate messages reach communities. “Community outreach is not possible without media support,” he said.\n\nFocalperson Uzma Kardar said the campaign is an important opportunity to reach young parents with correct information about vaccines. She stressed that repeated vaccination is essential because the polio virus continues to circulate in different areas.\n\nHead of the Punjab Polio Eradication Programme, Adeel Tassawur, reaffirmed that reaching every eligible child in the November fIPV round and the upcoming December National Immunization Days (NIDs) remains the top priority.\n\nPublished in Dawn, October 31st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/310950154da27c6.webp",
  "retrievedAt": "2025-11-02T00:26:08.793Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952214/minister-objects-to-polio-sampling-seeks-third-party-audit",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T01:16:24.000Z"
}
