{
  "title": "Pakistan denies Indian media report on dropping ‘not valid for Israel’ from passports, sending 20,000 troops to Gaza",
  "author": "Nadir Guramani | Dawn.com",
  "content": "The information ministry on Friday denied “unverified or politically charged claims” by an Indian news channel about Pakistan preparing to dispatch 20,000 troops to Gaza and the country removing the clause from its passports that makes it invalid for travel to Israel.\n\nIndian news outlet Republic TV had made the allegations, specifying the number of soldiers Pakistan was planning to send to Gaza “under the supervision of Western countries and Israel.” The channel, according to a statement by the Ministry of Information and Broadcasting, had also “ridiculously claimed that Pakistan had also removed the ‘Not valid for Israel’ clause from the passport.”\n\nIn a statement on X, the information ministry referred to a press release by the Ministry of Foreign Affairs (Mofa), reiterating that “Pakistan’s stance on Israel remains unchanged, that is, Islamabad does not recognise Israel, and no military cooperation or engagement exists or is under discussion”.\n\nMoreover, the ministry clarified that the passport clause remained intact.\n\n“Directorate General of Immigration and Passports confirms it still reads ‘valid for all countries except Israel’”, said the statement.\n\nMofa’s stance, as pointed out by the ministry, is that Pakistan does not recognise Israel and steadfastly supports the legitimate rights of the Palestinian people, including the establishment of an independent and sovereign Palestinian state based on pre-1967 borders, with Al-Quds Al-Sharif as its capital.\n\n“The claim originates solely from Republic TV, known for sensationalised anti-Pakistan narratives,” the information ministry added. “No international or regional media outlet has carried the assertion.”\n\nThe ministry further urged reliance on official statements and verified policy updates and to avoid “unverified or politically charged claims from partisan media”.\n\nEarlier this week, Defence Minister Khawaja Asif had said that the decision to send Pakistani troops for the Gaza peace force was still being finalised and “it is in process”.\n\nA cornerstone of the US-brokered Gaza Peace Agreement is the establishment of the International Stabilisation Force (ISF), composed mainly of troops from Muslim-majority countries. According to officials close to the discussions, an announcement is expected soon from the federal government regarding the decision.\n\nOfficials familiar with the deliberations, who requested anonymity because of the sensitivity of the matter, said discussions within the government and military establishment were at an “advanced stage”. According to them, the tone of internal consultations suggests that Islamabad is inclined to take part in the mission.\n\nQuestioned whether any such move was in the offing or not in an interview on Geo News show ‘Aaj Shahzeb Khanzada Kay Sath’, Asif said: “This thing has to be finalised [and] it is in process. The government will decide to pass through the process, and I don’t want to preempt it.”\n\nHe said parliament would be taken on board and all institutions would be informed about the move.\n\nThe defence minister said if Muslim countries took a decision to participate in the peace force and Pakistan also had to take part, then it would be a “moment of pride for the country to play a role in protecting Palestinians”.\n\n“This is an opportunity that Pakistan should avail itself of if it is available to us.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/31152214ce93288.webp",
  "retrievedAt": "2025-11-02T00:24:50.017Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952350/pakistan-denies-indian-media-report-on-dropping-not-valid-for-israel-from-passports-sending-20000-troops-to-gaza",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T10:12:16.000Z"
}
