{
  "title": "Any external aggression will be met with firm and severe response: DG ISPR",
  "author": "Abdullah Momand",
  "content": "Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry has reiterated that any external aggression against Pakistan will be met with a “firm and severe” response, a statement from the military’s media wing said on Friday.\n\nHis comments come against the backdrop of recent tensions with Afghanistan over Islamabad’s long-standing concern regarding terrorist attacks emanating from Kabul. For its part, Islamabad has demanded that the Taliban stop terror groups from using its soil against Pakistan. The Taliban, however, deny the allegation of allowing terrorists to operate from Afghan soil.\n\nMeanwhile, in May, the country faced a military standoff — the worst in decades — with neighbouring India. Following an intense, four-day escalation, the two countries agreed to a ceasefire, mediated by the United States.\n\nAddressing a meeting today with students and academics from universities in Khyber-Pakhtunkhwa’s (KP) Abbottabad district, the DG ISPR asserted, “The armed forces remain committed to defending the country, and any external aggression will be met with a firm and severe response,” as per ISPR.\n\nLt Gen Chaudhry detailed that “Pakistan has taken effective steps against terrorism and Fitna Al Khwarij.”\n\nFitna al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP). Since the group ended a fragile ceasefire agreement with the government in November 2022, the country has seen a surge in terrorist attacks, particularly in KP and Balochistan, mostly targeting police, law enforcement personnel, and security forces.\n\nThe statement further mentioned that during the meeting, Lt Gen Chaudhry also talked about the current security situation, including Pak-Afghan tensions and Marka-i-Haq,“ adding that “students and teachers present paid tribute to martyrs.\n\nThe Pakistan Army has named the period of conflict with India from the April 22 Pahalgam attack to the May 10 conclusion of Operation Bunyanum Marsoos as “Marka-i-Haq”.\n\nVice Chancellor Hazara University, Dr Ikramullah Khan, lauded the armed forces’ role and vowed to stand with them, the statement said.\n\n“Pakistan army’s resolve is a metaphor for their love for the country,” he was quoted as saying in the statement.\n\nKhan was of the view that “terrorist elements are aiming to mislead our youth,” emphasising that the situation called for the dissemination of “accurate and reliable information.”\n\nPer the statement, both students and teachers echoed similar views, stating that the discussion with DG ISPR “had helped dispel any false information they had regarding the Pakistan army, as well as the national and provincial situation.”\n\nOn October 21, the Chief of the Army Staff (COAS) Field Marshal Asim Munir had said that any violation of Pakistan’s territorial integrity would be met with a ’firm and decisive response.“",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/31134049bf1e6b4.webp",
  "retrievedAt": "2025-11-02T00:24:46.391Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952348/any-external-aggression-will-be-met-with-firm-and-severe-response-dg-ispr",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T08:59:41.000Z"
}
