{
  "title": "Punjab doles out Rs6.39bn among flood-hit people",
  "author": "Majeed Gill",
  "content": "• 98,000 ATM cards prepared; 37 camps established for compensation distribution\n• 90pc of flood assessment survey completed; data of 463,000 victims verified by deputy commissioners\n\nBAHAWALPUR: The Punjab government has distributed Rs6.39 billion among flood-affected people across the province. The amount is part of the Rs100bn allocation made under the Punjab Chief Minister Flood Rehabilitation Programme.\n\nSenior Minister Marriyum Aurangzeb made the announcement while addressing a ceremony to distribute ATM cards among the flood-hit people at Jinnah Stadium, Khairpur Tamewali, about 45km from here, on Thursday.\n\nShe said 90 per cent of the flood assessment survey, covering data of 569,000 victims, had been completed by the Punjab Disaster Management Authority (PDMA). Data of 463,000 victims had also been verified by the respective deputy commissioners to ensure transparency in the compensation disbursement process.\n\nAccording to an official statement issued from Lahore, authorities told a meeting that over 98,000 ATM cards had been prepared, while 37 camp sites had been set up in 27 flood-affected districts across Punjab for compensation payments through the Bank of Punjab. Each beneficiary will receive Rs50,000 in cash along with an ATM card.\n\nThe distribution of compensation in 13 districts began on Oct 20, while disbursement in the remaining districts will start in the second phase from Nov 3.\n\nEach flood victim can withdraw up to Rs300,000 per day from Bank of Punjab ATMs. According to the statement, 19 camps have been established for flood victims in 36 tehsils, with Rs50,000 in cash and ATM cards to be issued to 500 people at each camp.\n\nFlood rehabilitation camps have also been set up in Bahawalnagar, Depalpur, Jhang, Nankana Sahib, Muzaffargarh, Chiniot and Khairpur Tamewali.\n\nProvincial ministers Mian Kazim Hussain Pirzada, Khwaja Salman Rafique, Malik Sohaib Ahmed Berth, MPA Rana Tariq, PDMA Director General Irfan Ali Kathia, Divisional Commissioner Musarrat Jabeen, Bahawalpur Deputy Commissioner Dr Farhan Farooq, and former senator Saood Majid Chaudhry accompanied Ms Aurangzeb at the ceremony.\n\nThe senior minister said Rs20bn had been transferred to the Bank of Punjab for the rehabilitation of flood-affected people, of which Rs11bn had been credited to victims’ accounts.\n\nShe said Chief Minister Maryam Nawaz would continue to stand by the flood survivors until their complete rehabilitation, noting that the process had begun within a record 26 days.\n\nMs Aurangzeb added that the survey in 72 tehsils of the flood-affected districts had already been completed, despite earlier claims that it would take six months. Punjab Irrigation Minister Kazim Pirzada also addressed the ceremony.\n\nPublished in Dawn, October 31st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/31073857c2d2b36.webp",
  "retrievedAt": "2025-11-02T00:25:49.206Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952296/punjab-doles-out-rs639bn-among-flood-hit-people",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T02:13:57.000Z"
}
