{
  "title": "Stocks lose 1,732 points more on profit-taking",
  "author": "Muhammad Kashif",
  "content": "KARACHI: The Pak­istan Stock Exchange (PSX) on Thursday extended its losing streak for the seventh consecutive session, with the benchmark KSE-100 index closing below the 157,000-point mark as investors continued profit-taking.\n\nThe index shed 1,732 points, or 1.09pc, to settle at 156,732.87, marking a new closing low and breaching the previous trough of 158,443 recorded on Oct 13. The market’s early attempt at recovery, when the index rose to an intraday high of 159,507 points (up 1,042 points or 0.66pc), was short-lived as institutional selling wiped out gains and drove the market deep into negative territory.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, said the persistent bearish sentiment ref­lected declining investor confidence and limited buying interest. The recent breakdown in Islamabad-Kabul talks further dampened sentiment, with regional uncertainty weighing on expectations for cross-border trade and economic stability.\n\nTrading activity also slowed, with volumes down 10.87pc to 846.8 million shares and traded value decreasing 8.95pc to Rs37.5bn. Bank of Punjab led the volumes chart with 84.1 million shares.\n\nMarket participants viewed the new low below 157,000 as a sign of continued weakness. Mr Najib noted that a weekly close above the 160,000 level would be key to restoring confidence, while failure to recover could invite further selling pressure in the sessions ahead.\n\nAccording to Topline Securities Ltd, major draggers included Engro Corporation, Bank of Punjab, Systems Ltd, United Bank and MCB Bank, which collectively shaved 1,162 points off the index.Analysts expect investors to remain cautious in the final session of the week amid concerns about geopolitical developments and the lack of near-term positive triggers.\n\nPublished in Dawn, October 31st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/310823501beb00d.webp",
  "retrievedAt": "2025-11-02T00:27:23.871Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952256/stocks-lose-1732-points-more-on-profit-taking",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T01:16:04.000Z"
}
