{
  "title": "Drama unfolds on court during women’s quarterfinals at 3rd CNS Squash Championship",
  "author": "Anushe Engineer",
  "content": "A seemingly routine quarter-final at the CNS Squash Championships turned into a literal battleground as throat jabs and body slams took centre stage between two women vying for a spot in the semi-finals on Friday morning.\n\nWhat started off as a regular game in Karachi between top seed Sana Bahadar and former Pakistan number one Sadia Gul turned into rough play during the fourth game as an injured Sana — leading 7/11, 15/13, 11/6 — asked the referee to stop play and pointed to her throat before exiting the court.\n\nIt wasn’t till she communicated to her father that the referee and audience knew what had happened — she had been elbowed in the throat and was struggling to breathe. Sana, who is entirely deaf and mute, relies on her father as her primary translator to communicate her thoughts to the rest of the world.\n\nThe duo had already stumbled over each other’s shoes and rackets throughout the match and protested to the referee, mostly in vain, as they briefly nursed their injuries and got back to the game.\n\nAfter being attended to by a medical staff and given a three-minute break to recover, Sana gave a thumbs-up to the referee and re-entered the court. The 19-year-old seemed to have lost her mojo as she struggled to pick up points and ultimately lost the fourth game 5/11 to Sadia, who is currently Pakistan’s only female squash coach.\n\nWith two wins each, an already tense fifth set witnessed drama unfold as both players appealed to the referee for a let on multiple occasions. Sadia was chastising herself out loud — “Sadia come on, you need to focus” — as Sana clawed her way back and equalised the score 10-10 to applause from the sparse audience.\n\nAt 11-11, Sadia lunged into the court’s glass wall seemingly after tripping on court. One point later, she stumbled several steps backwards and hit her head against the wall before slumping to the floor.\n\nSana went to pick up her racket and then lent her a hand to pull her up. Sana almost won the match at 14-13 before Sadia took a point, Sana appearing visibly frustrated with herself.\n\nUltimately, Sadia took the game 16-14 to secure her place in Saturday’s semi-final. The two hugged on court and Sana gestured her thanks to the referee — clapping her hand against her racket — before heading over to her brother and father, Sher Bahadar.\n\nIt was while she was cooling down that Sher approached Sadia, congratulated her on the win, and then accused her of unsportsmanlike conduct during the game. Sadia turned to the referee and protested Sher approaching her, but the referee stayed silent, even as he accused the referee of deliberately causing Sana to lose.\n\nSpeaking to Dawn after the match, Sher lamented Sadia “constantly shoving Sana throughout the game, which is against PSA [Professional Squash Association] rules.\n\n“If this happened at a game being played abroad, the player would have been given a warning the first time, and then the opponent would have been handed the match win,” Sher said. He has reached out to PSA requesting that they independently analyse the game and provide their verdict.\n\n“Sadia is an experienced player, a coach and now a mother; these kinds of antics from her were unprofessional,” he said.\n\nThe remaining quarterfinals unfolded without turmoil. Mahnoor Ali breezed through to the semis with a 3-0 win over Zunaira Imran (11-0, 11,3, 11-2) while Mahnoor’s sister Sehrish beat Rushna Mehboob in similar fashion (11/7, 11/4, 11/5). Mariam Malik defeated her younger sister Amna 3-1 (11/7, 11/7, 9/11, 11/6).\n\nOn the men’s side, Nasir Iqbal raced into the semis with a 11/4, 11/1/ 11/3 victory over Saddam-ul-Haq while Tayyab Aslam cruised past Mohammad Zaman 11/8, 11/4, 11/2. Ammad Gul also advanced without losing a game, defeating Israr Ahmed 11/7, 12/10, 11/4. In the last quarter-final, Anas Ali Shah came back from a game down to beat Abdullah Nawaz 9/11, 11/3, 11/8, 11/3.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/3121475915f36e5.webp",
  "retrievedAt": "2025-11-02T00:23:20.679Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952378/drama-unfolds-on-court-during-womens-quarterfinals-at-3rd-cns-squash-championship",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T16:49:38.000Z"
}
