{
  "title": "First-time offenders caught by e-ticketing system can have fines waived after apology: Sindh CM",
  "author": "Imtiaz Ali",
  "content": "Sindh Chief Minister Murad Ali Shah said on Wednesday that first-time offenders caught by the newly implemented traffic e-ticketing system can have their fines waived within 10 days by appearing in person and submitting an apology, according to a press release.\n\nThe CM inaugurated the Traffic Regulation and Citation System (TRACS), commonly known as the e-ticketing system, at the Central Police Office (CPO) on Monday.\n\nHe explained that the new system replaces the outdated manual ticketing process with a fully automated e-ticketing mechanism, utilising advanced AI-integrated CCTV cameras to detect violations such as speeding, red-light jumping, and helmet non-compliance.\n\nAccording to the press release, CM Shah received a report from Sindh Inspector General of Police Ghulam Nabi Memon detailing traffic rule violations under the new system, which has issued fines to 35 official vehicles for various infractions.\n\n“According to the report, e-challans were issued for offences such as not wearing seatbelts, running red lights, using tinted windows, and operating mobile phones while driving,” the press release stated.\n\nThe report revealed that a police vehicle was fined for a seatbelt violation on the Lyari Expressway at 1:36pm on Tuesday. Traffic Deputy Inspector General Peer Muhammad Shah informed the chief minister that the vehicle’s driver was twice observed not wearing a seatbelt between Garden and Lyari Expressway, triggering the automated system to issue a Rs10,000 fine, according to the press release.\n\n“The CM said that first-time offenders can have their fines waived within 10 days by appearing in person and submitting an apology,” the press release stated.\n\n“Even the police must comply with traffic regulations. This system upholds fairness and accountability for all citizens,” CM Shah was quoted as saying.\n\nThe press release added the provincial chief executive underlined the importance of traffic law compliance for public safety and directed that while first-time offenders can have their challans waived, repeat offenders would pay fines without exception.\n\n“All citizens have equal rights under the law — compliance must be ensured across the board,” CM Shah added.\n\nOn Tuesday, more than 2,650 electronic challans were issued by the Karachi Traffic Police following the inauguration of the new e-ticketing system. According to the Sindh police, 1,535 challans were issued for not wearing a seat belt, 507 challans for riding a motorcycle without a helmet, 419 for speeding, 166 for running a red light, and 32 for using a mobile phone while driving.\n\nAdditionally, seven challans were issued for putting tints on vehicle windows, five challans each for improper parking and parking in a no-parking zone, four for stop line violation, and three each for lane line violation and driving on the wrong way.\n\nIn June, the Sindh government decided that e-challans for traffic violations would be delivered to vehicle owners’ registered home addresses. Vehicles with unpaid fines would not be allowed to be sold or transferred.\n\nThe decision came amid Karachi witnessing a surge in traffic accidents, particularly involving dumpers and water tankers, that killed nearly 500 people and injured 4,879 in 2024, according to hospital data.\n\nThe spate of deadly incidents triggered protests over citizens’ deaths, prompting the provincial government to ban heavy vehicles during daytime hours and require them to obtain fitness certificates.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30191240a7257ca.webp",
  "retrievedAt": "2025-11-02T00:27:53.332Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952175/first-time-offenders-caught-by-e-ticketing-system-can-have-fines-waived-after-apology-sindh-cm",
  "dateList": "2025-10-31",
  "date_published": "2025-10-30T14:28:03.000Z"
}
