{
  "title": "Allies put final touches on plan for AJK no-trust vote",
  "author": "Iftikhar A. Khan",
  "content": "• PPP likely to announce PM nominee today as incumbent premier stays put\n• AJK planning department suspends release of development funds\n\nISLAMABAD: After days of consultations, President Asif Ali Zardari and Prime Minister Shehbaz Sharif on Thursday endorsed the plan for in-house change in Azad Kashmir in a meeting attended by senior PPP and PML-N leadership at the Presidency.\n\nSources said the name of the PPP candidate for AJK premiership would most likely be announced today (Friday) after a meeting of the PPP AJK parliamentary party to be chaired by PPP Chairman Bilawal Bhutto-Zardari. A source describing the meeting as the final round of consultations over the upcoming no-trust motion termed it “very positive”. He said both sides called for political stability in Azad Kashmir and criticised the incumbent AJK government for the manner in which it handled recent protests in the state.\n\nA member of the AJK Assembly, when asked if the PML-N would vote for the no-confidence motion against Anwar ul Haq as well as for the PPP nominee, said that “they will be automatically voting for the PPP candidate when they vote against Haq, as the successor’s name will be there on the resolution to be passed”.\n\nIt may be noted here that it is mandatory under the interim constitution to summon the session of the Legislative Assembly within 14 days of the submission of the resolution for a vote of no-confidence. The resolution has to be signed by at least 14 members of the House.\n\nUnder the law, a resolution for a vote of no-confidence cannot be moved in the assembly unless, by the same resolution, the name of another member of the assembly is put forward as the successor. “A resolution shall not be voted upon before the expiration of three days, or later than seven days, from the date on which it is moved in the assembly,” the law reads.\n\nAzad Jammu and Kashmir Interim Constitution Act 1974 provides that when a no-confidence motion is passed in the house, the successor proposed in the resolution becomes the next prime minister without any separate election procedure.\n\nMeanwhile, incumbent AJK Prime Minister Chaudhry Anwar ul Haq, who at one stage had decided to step down, has decided to remain the chief executive of the state as long as he can. A source close to him said though the option of resigning before a vote on no-confidence will be open, PM Haq was ready to face the vote.\n\nMoreover, the Planning and Develo­pment Department of Azad Jammu and Kashmir has suspended the release of funds to the tune of billions sanctioned for different line departments for development projects under the annual development programme for the first half of the current financial year 2025-26.\n\nThe letter, a copy of which is available with Dawn, proposed clearance of Rs 3,721.259 million in “mature liabilities” in various sectors like communication, agriculture, education, health, etc. A formal notification barred the release of further funds for any development scheme without written approval. Huge funds amounting to well over seven billion, however, have already been released to different departments.\n\nPublished in Dawn, October 31st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/310826546d5c9f8.webp",
  "retrievedAt": "2025-11-02T00:25:25.357Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952312/allies-put-final-touches-on-plan-for-ajk-no-trust-vote",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T02:40:10.000Z"
}
