{
  "title": "China’s Xi holds court at Apec summit after Trump trade truce",
  "author": "Reuters",
  "content": "South Korea played host, but all eyes were on China’s Xi Jinping at an annual gathering of Pacific Rim leaders on Friday, where he met his Canadian, Japanese and Thai counterparts after securing a fragile trade truce with US President Donald Trump.\n\nThat agreement, struck just before Trump left South Korea, skipping the main two-day Asia-Pacific Economic Cooperation summit, cooled spiralling tensions between the world’s two largest economies that jolted global commerce.\n\nWith Trump hosting the White House’s annual Halloween party back in Washington, Xi sought to cast China as the predictable champion of free and open trade at the forum, a role the US has dominated for decades.\n\n“Changes unseen in a century are accelerating across the world,” Xi told leaders of the 21-member economic bloc on Friday in the historic town of Gyeongju.\n\n“The rougher the seas, the more we must pull together,” Xi added in a speech calling for the protection of global trading rules and deeper economic cooperation.\n\nHowever, many Asian nations are wary of China’s rhetoric, given its muscular defence posture in the region, dominance in manufacturing and its own willingness to use export controls and other tools in trade disputes.\n\nDeputising for Trump, US Treasury Secretary Scott Bessent told the gathered leaders — many of whom have been hammered by Trump’s barrage of tariffs — that Washington was “rebalancing its trade relationships to build a stronger foundation for global growth”.\n\nThe IMF initially cut the global growth outlook after Trump’s ‘Liberation Day’ tariff announcement in April, but has edged it back up as shocks and financial conditions have proved more benign than expected.\n\nAmong the most hotly anticipated bilateral meetings, the Chinese leader held his first talks with Japan’s new premier Sanae Takaichi. In brief opening remarks, both leaders said they would seek to advance ties.\n\n“I conveyed my concerns, but also raised areas where we can cooperate. I would like this meeting to serve as a starting point for Japan and China,” Takaichi said after the meeting.\n\nXi called for managing differences by focusing on the bigger picture and “treating each other as partners, not treating each other as threats, learning from history, and looking toward the future”.\n\nWhile relations between the historic rivals have been on a sounder footing in recent years, Takaichi’s surprise elevation to become Japan’s first female leader may strain ties due to her nationalistic views and hawkish security policies.\n\nOne of her first acts since taking office last week was to accelerate a military build-up aimed at deterring the territorial ambitions of an increasingly assertive China in East Asia. Japan also hosts the biggest concentration of US military abroad.\n\nThe detention of Japanese nationals in China and Beijing’s import restrictions on Japanese beef, seafood and agricultural products were also likely to be on the agenda.\n\nCanadian Prime Minister Mark Carney also held talks with Xi, aiming to restart broad engagement with China after years of poor relations.\n\nEmbroiled in a trade dispute with the United States, Canada’s biggest trading partner, Carney told a gathering of executives running parallel to the summit on Friday that Ottawa aimed to double its non-US exports over the next decade.\n\nAfter his meeting with Xi, Carney said he had accepted an invitation to visit China, which is Canada’s second-biggest trading partner.\n\nUnder the leadership of Carney’s predecessor, Justin Trudeau, Canadians were detained and executed by the Chinese government, and Canada’s security authorities concluded that China interfered in at least two federal elections.\n\nChina announced preliminary anti-dumping duties on Canadian canola imports in August, a year after Canada said it would levy a 100 per cent tariff on imports of Chinese electric vehicles. Officials from both sides met to discuss those issues this month.\n\nXi also met Thai Prime Minister Anutin Charnvirakul, saying China would share its development experience and calling for expedited progress on a rail line between the nations and intensify efforts to crack down on cross-border crime.\n\n“The relations and cooperation between the two countries, which had previously stalled, have now been revived,” Anutin said in a statement.\n\nSouth Korean President Lee Jae Myung, a US ally who finds himself at the frontlines of China’s competition with the United States, will tackle Korean denuclearisation with the Chinese leader at a summit on Saturday, his office said.\n\nElsewhere, Taiwan said it was making progress on a tariff deal with the United States, and South Korea said final details of its deal with Washington were almost ready after a breakthrough was agreed on Wednesday.\n\nSouth Korean Foreign Minister Cho Hyun said on Thursday that he was hopeful APEC leaders would issue a joint declaration when the summit concludes on Saturday.\n\nAPEC, which stretches from Russia to Chile and accounts for 50pc of global trade, failed to adopt a joint declaration in 2018 and 2019, during Trump’s first presidency.\n\nThere were also some business deals on the sidelines with US chipmaker Nvidia opens new tab agreeing on a $3 billion AI joint venture with South Korean automaker Hyundai Motor Group, opens new tab.\n\nNvidia CEO Jensen Huang has had a whirlwind week, with the company becoming the first to surpass a $5 trillion valuation, but the issue of the US chipmaker’s sale of advanced AI chips in China was seemingly left out of Thursday’s Xi-Trump summit.\n\nHuang said on Friday he hoped the chips can be sold in China, although stressed it was a decision for Trump.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/311852371e1c35a.webp",
  "retrievedAt": "2025-11-02T00:23:53.435Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952368/chinas-xi-holds-court-at-apec-summit-after-trump-trade-truce",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T14:07:02.000Z"
}
