{
  "title": "NAB recovers Rs200m in Kohistan corruption case",
  "author": "Bureau Report",
  "content": "PESHAWAR: The National Accountability Bureau (NAB) has recovered Rs200 million from the prime accused in the Rs40 billion Kohistan financial scam.\n\nSources said that a NAB team raided the house of the main accused, Qaiser Iqbal, a clerk in the communication and works department in Abbottabad, and recovered Rs100 million on the pointation of his wife, who was also in custody.\n\nThey added that another Rs100 million was recovered from another place.\n\nSources said that NAB had so far recovered more than Rs2 billion in the case, the highest cash recovery in its history.\n\nIqbal and his wife were arrested earlier this month and were produced before the court on Oct 18.\n\nThe NAB officials informed the court that the female suspect, in active connivance with her husband and his other benamidars, managed huge cash withdrawals from the bank accounts and through crime proceeds purchased valuable assets in her name knowing that such assets were grossly disproportionate to the known sources of her husband’s income.\n\nThey said that the couple, throughout the proceedings of inquiry and investigation, hid facts, remained non-cooperative, provided misleading statements and concealed critical details of the assets held to clear the liability of more than Rs14 billion determined until now.\n\nThe NAB officials insisted that on credible information, they had started an inquiry, which revealed that officials of the communication and works department in Upper Kohistan, in connivance with officials of the district accounts office and local NBP branch, had misappropriated funds from different development projects through bogus withdrawals from the treasury in the name of several contractors, who had not carried out any civil work.\n\nThey said several people were involved in the illegal cash withdrawal and misappropriation of around Rs40 billion from the contractors’ security deposit head of a bank account.\n\nThe officials said the accused abused their respective positions to initiate the process of fraudulent withdrawal from government treasury by creating falsified documentations, which were used to siphon off funds from the bank account.\n\nThey said the accused included officials of the district accounts office and communication and works department, staff members of commercial banks and scores of private contractors.\n\nThe accountability courts have so far confirmed several NAB orders to freeze dozens of moveable and immovable assets, including luxurious residences, commercial plazas and plots, expensive vehicles and cash, including foreign currency allegedly owned by several suspects.\n\nTwenty-two suspects have so far been detained in connection with the case.\n\nPublished in Dawn, October 31st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/3110450797e7b0a.webp",
  "retrievedAt": "2025-11-02T00:26:15.378Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952233/nab-recovers-rs200m-in-kohistan-corruption-case",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T01:16:36.000Z"
}
