{
  "title": "Corruption, extortion case: Lahore court extends physical remand of 6 NCCIA officials by 3 days",
  "author": "Rana Bilal",
  "content": "A Lahore court on Friday extended the physical remand of six National Cyber Crime Investigation Agency (NCCIA) officials by another three days in a case pertaining to the alleged misuse of authority, extortion of money, and acceptance of bribes.\n\nThe first information report (FIR) of the case was registered with the FIA Anti-Corruption Circle Lahore on the complaint of Aroob Jatoi, the wife of YouTuber Saadur Rehman alias Ducky Bhai, who has been arrested in a case pertaining to promoting gambling apps on social media.\n\nThe FIR was registered against a total of nine individuals, including eight NCCIA officials. Among them, the six remanded in the FIA custody were said to be missing for several days before the FIA announced their arrest on Monday.\n\nLahore NCCIA’s Additional Director Sarfraz Chaudhry, Lahore NCCIA Deputy Director (acting in-charge) Zawar Ahmad, Lahore NCCIA Sub-Inspector Ali Raza, Lahore NCCIA Assistant Director Shoaib Riaz, Lahore NCCIA Sub-Inspector Yasir Ramzan and Lahore NCCIA Assistant Director Mujtaba Zafar are the six officials.\n\nThe six were presented in the court of Judicial Magistrate Naeem Wattoo, with the FIA’s investigating officer (IO) requesting further 11 days of physical remand to continue the investigation.\n\nAccepting the request, the judge remanded the suspects into three more days of physical custody to complete the investigation and ordered their appearance on Monday.\n\nAccording to the court order, the counsels for the suspects variously argued that their clients were wrongly nominated in the case or alleged irregularities in the complaint against them. They also raised questions about the recoveries made.\n\nMeanwhile, the FIA’s legal counsel strongly opposed all contentions and contended that it was a white collar crime.\n\n“Earlier three days physical remand was granted and different heavy amounts were recovered from all accused persons. Learned counsels pointed out illegalities and irregularities in said alleged recoveries but this court has no mandate to decide said questions during remand at this stage. Heavy amounts are recovered from all accused persons. Progress is happened. Contention of IO looks plausible for further physical remand to make investigation due to said heavy amount recoveries. Contention of learned counsels looks not plausible to discharge accused persons at this stage,” the order said.\n\nThe FIR was registered under Sections 109 (punishment for abetment if the act abetted is committed in consequence and where no express provision is made for its punishment) and 161 (public servant taking gratification other than legal remuneration in respect to an official act) of the Pakistan Penal Code, read with Section 5(2)47 of the Prevention of Corruption Act, which deals with criminal misconduct by public servants.\n\nIt stated that the NCCIA had arrested Rehman and the inquiry into his case was assigned to Lahore NCCIA Assistant Director Shoaib Riaz.\n\nThe FIR said it was found during the inquiry that Riaz “misused his authority” to “extort Rs9 million” through his frontmen from Rehman’s family. It was further alleged in the FIR that Riaz also colluded with Rehman’s lawyer, Chaudhry Usman, for this purpose.\n\nAccording to the FIR, Riaz extorted Rs6m on the pretext of “providing relief to Aroob Jatoi” and another Rs3m for Rehman’s judicial remand, who had been on physical remand.\n\nIn August 2025, Riaz extorted Rs6m in cash through his frontman, Salman Aziz, in Sheikhapura, while the remaining Rs3m was obtained via three cheques of Rs1m each through another frontman identified as Shehbaz, the FIR alleged.\n\nIt added that Riaz gave Rs5m to a friend of Lahore NCCIA Deputy Director (acting in-charge) Zawar Ahmed’s for safekeeping, while Rs500,000 was given to Salman Aziz, lawyer Chaudhry Usman and Additional Director Sarfaraz each.\n\nRiaz himself kept Rs2m, the FIR said, adding that it was also found during the inquiry that he had transferred $326,420 from Rehman’s account to his own via Binance.\n\n“During the inquiry, the suspects were found guilty of deceiving detained Saadur Rehman’s family about providing him relief and misusing their authority,” the FIR stated. “It was also found during the inquiry that the suspects were operating as a network and misusing their authorities, taking bribes in cash monthly for facilitating call centres, aggregate companies and individuals involved in online fraud. After keeping their shares, they would give the rest of the amount to the higher-ups.”\n\nOfficers at the NCCIA headquarters were sent these amounts via Muhammad Usman, the NCCIA deputy director operations in Islamabad, and Islamabad NCCIA Deputy Director Ayaz Khan, according to the FIR. Sarfaraz and Zawar in Lahore would hand over Rs 1m to the two officials in Islamabad almost every month, and the latter would then transfer it to the higher-ups, the FIR said.\n\nIt added that FIA’s Lahore Anti-Corruption Circle Assistant Director Syed Zainul Abideen had been assigned the investigation of the case.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/311643508c2c4c3.webp",
  "retrievedAt": "2025-11-02T00:24:21.953Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952357/corruption-extortion-case-lahore-court-extends-physical-remand-of-6-nccia-officials-by-3-days",
  "dateList": "2025-10-31",
  "date_published": "2025-10-31T12:05:21.000Z"
}
