{
  "title": "Promotion of sports, tourism top priority of govt: Shibli",
  "link": "https://www.app.com.pk/national/promotion-of-sports-tourism-top-priority-of-govt-shibli/",
  "date_published": "2021-02-04T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP):Federal Minister for Information and Broadcasting Shibli Faraz on Thursday said the promotion of sports and tourism were the top priorities of present government.\nAddressing a pre-launch event of the Islamabad Tourism Festival organized here by Pakistan Hand Gliding and Paragliding Association (PHPA) in collaboration with Cutting Edge Group and National Tourism Coordination Board (NTCB), the minister said he was excited to come here as he was also a pilot.\nHe said unfortunately this sport remained ignored in the past.\nPrime Minister Imran Khan, he said, had a vision to promote tourism and sports in the country and the present government was taking various steps in that regard.\nHe said terrorism had badly affected the tourism sector but today peace was restored with a lot of sacrifices of the brave armed forces.\nHe stressed that the promotion of tourism and sports would create job opportunities for the youth. It would also bring a good name for the country, he remarked.\nHe said adventure sports had a lot of potential to attract foreign tourists and bring foreign exchange in the country. He expressed best wishes for the first para gliding event being organized in Islamabad and other major cities.\nHe said such kinds of sports were very healthy activity as the same were full of adventure and excitement. Internationally this sport would get attention, he added.\nHe assured that the government was working in different spheres to promote tourism and sports.\nFederal Minister for Power Omar Ayub Khan was also present on the occasion.\nThe event was aimed to showcase different air shows and adventure sports like paragliding, accuracy landing, wing suite flying, sky diving and power para gliding.\nThe event also consisted of the title song performance by Sahir Ali Bagga.\nCutting Edge Group Chief Executive Officer Chaudhry Shahzad Akhtar, Fakhre Alam, Arif Malik and Syed Sajjad Hussain Shah were also present at the event.",
  "retrievedAt": "2025-08-11T20:19:06.615Z"
}
