{
  "title": "Sindh govt backing influential electricity thieves: Omar Ayub",
  "link": "https://www.app.com.pk/national/sindh-govt-backing-influential-electricity-thieves-omar-ayub/",
  "date_published": "2021-02-04T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP):Minister for Power Division Omar Ayub Khan on Thursday alleged that the Sindh government was backing the certain influential people in electricity theft activities in the province.\nAnswering a question in the National Assembly, the minister said the Sindh government not only supported some influential people involved in power theft but also created hindrances in the registration of cases against them.\nOmar Ayub said the annual capacity payment to the Independent Power Producers (IPPs) was Rs185 billion in 2013, Rs 468 billion in 2018 and Rs 860 billion in 2020, and it would reach Rs 1,455 billion in 2023.\nThe minister declared them the “land mines”, which were inherited by the Pakistan Tehreek-e-Insaf (PTI) government due to the corrupt and wrong policies of the previous regimes of Pakistan Muslim League-Nawaz (PML-N) and Pakistan Peoples Party (PPP).\nHe said increase in the prices of electricity was due to the badly drawn up agreements with the IPPs comprising wrong fuel mixes, which ultimately forced the country to rely on imported fuels for power generation and face the issue of capacity or compulsory payments.\nOmar Ayub said the present government had invested Rs 49 billion on transmission and Rs 74 billion on the distribution system to make the power sector efficient and responsive.\nTo another question, the minister said lineman Muhammad Mubariz died and Muhammad Pervaiz was injured while replacing electricity poles in NA-183. Safety measures for 11KV line, on which work was to be executed, were taken, however, hazard identification was not done and the 132KV line running parallel to existing HT line, resulted in the said accident.\nHe said an inquiry was conducted into the incident and based on the recommendations of the said investigation, disciplinary actions had been taken against the delinquents.\nReplying to another query, he said the appointments in Oil & Gas Development Company Limited (OGDCL) were made in accordance with the criteria approved by its board of directors. Currently, the OGDCL had 67 employees (contract/regular) having their domicile from Lakki Marwat district.\nMoreover, the minister said considering the nature of business activities, the temporary/ interim arrangements of manpower were often made, preferably from locals of the area.\nOmar Ayub said at present, 17 service units of local manpower as project workers had been engaged through third party contractor at Rig N¬6 at Wali X¬1 till completion of project.\nHe said,”The OGDCL takes proactive steps and strive towards conservation of the environment, implementing controls to eliminate pollution and environmental harm.”\nAll exploration and production activities were being carried out under the compliance of applicable Initial Environment Examination and Environmental Impact Assessment regulations 2000, he added.",
  "retrievedAt": "2025-08-11T20:18:56.692Z"
}
