{
  "title": "Government bill to bring transparency in Senate elections: Shahzad Waseem",
  "link": "https://www.app.com.pk/national/government-bill-to-bring-transparency-in-senate-elections-shahzad-waseem/",
  "date_published": "2021-02-04T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP):Leader of the House in Senate Shahzad Waseem Thursday said the government presented bill in the Parliament to bring transparency in the Senate elections and end the unfair practices of the past regimes.\nSpeaking in the Senate, he said it was a reality that elections in the Senate in the past were not transparent and there were incidents of horse trading and buying of votes.\nThe government and the opposition had to decide to end these unfair practices, he said adding after the previous election of Chairman Senate, the opposition should have identified those who changed their loyalties.\nHe recalled that Prime Minister Imran Khan removed 20 members of his party from the provincial assembly of Khyber Pakhtunkhwa due to allegations that they sold their votes in the Senate elections.\nThe opposition parties while signing the charter of democracy agreed that all indirect and Senate elections should be held through open and identifiable votes, he continued.\nShahzad said the government wanted to change the law and approached the Supreme Court and presented a bill in the National Assembly to ensure transparency in the elections.\n“Prime Minister Imran Khan wanted transparency in the Senate elections,” he said adding unfair practices were also used in the election of Balochistan.\nHe said there was a nexus between corruption and politics and there was a vicious cycle of fake accounts and corrupt practices by godfathers and mafias.\n“We have to break this vicious cycle. I request the opposition to set good traditions to increase the dignity of the members and the Senate.”\nSenator Faisal Javed said Imran Khan was the first one who gave the idea of neutral umpires in the international cricket and then staged a 126 days sit in to demand opening of four constituencies to rectify problems in the electoral process.\nWhen the four constituencies were opened, rigging was proved in them, he said adding Prime Minister Imran Khan sent home 20 provincial assembly members for selling their votes despite the fact that elections were near and those were winning candidates.\nImran Khan did not compromise on the issue of corruption, he said adding the opposition should support the legislation of public interest.\nThe opposition wanted NRO to hide its corruption and Imran Khan clearly said he would not give NRO, he remarked.\nDuring discussion on the presidential address, Senator Mohsin Aziz said the government gave a relief package of Rs 1.2 trillion during the COVID 19 and Rs 200 billion of it was for Ehsaas programme.\nHe said during his address, the President mentioned that the economy was improving, current account deficit was in surplus, exports were rising and industrial activity was picking up.\nSenator Abdul Qayyum said the government could not provide online education to the students living in the far flung areas. He said 40 percent schools in the rural areas were without electricity and basic facilities.\nHe pointed out that there was a need to set up special economic zones as was envisaged in the China Pakistan Economic Corridor (CPEC) project.\nEarlier, Minister of State for Parliamentary Affairs Ali Muhammad Khan presented the bill to make provisions for the establishment of Pakistan single window [The Pakistan Single Window Bill, 2021].\nChairman Senate referred the bill to the relevant committee. The bill was already passed by the National Assembly.\nChairman Standing Committee on Law and Justice Senator Javed Abbasi presented different reports of the committees before the house.\nThe reports were related to reforms in laws, amendments in articles 11, 73 and 93 of the constitution and Guardians and Wards Act, 1890 and for changes in the Pakistan Penal Code, 1860 and in the General Clauses Amendment Bill, 2021 and The Public Complaints Bill 2021.",
  "retrievedAt": "2025-08-11T20:19:01.776Z"
}
