{
  "title": "82,728 Roshan Digital Accounts opened abroad in five months; $436 million remitted, PM told",
  "link": "https://www.app.com.pk/national/82728-roshan-digital-accounts-opened-abroad-in-five-months-436-million-remitted-pm-told/",
  "date_published": "2021-02-04T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Prime Minister Imran Khan was on Thursday told that with 82,728 Roshan Digital Accounts opened so far in 97 countries of different continents by the overseas Pakistanis, an amount of $436 million had been remitted and paid under the facility.\nHe was further informed that as 600 to 700 accounts were being opened on daily basis, Pakistani expatriates were remitting around US $ 6 to 7 million per day.\nThe prime minister was presiding over a meeting here to review progress on the provision of facilities made available for the overseas Pakistanis under the Roshan Digital Account.\nForeign Minister Makhdoom Shah Mahmood Qureshi, Special Assistants to the PM Syed Zulfikar Abbas Bukhari and Dr Waqar Masood Khan, State Bank Governor Reza Baqir and Deputy Governor Murtaza Syed, Senator Faisal Javed and senior officers were in attendance.\nThe meeting was briefed in detail about the encouraging response and interest shown by the overseas Pakistanis towards the facility of Roshan Digital Account, introduced under the vision of Prime Minister Imran Khan, during the last five months and the proposals for the provision of more facilities in future along with modernization.\nIt was told that with a sharp increase witnessed in workers’ remittances during the last month, the Pakistani expatriates from Saudi Arabia, the United Arab Emirates, the United Kingdom and the United States had taken lead in utilizing the facilities, provided under the Roshan Digital Account.\nThe participants were apprised of the cooperation of ministries of Foreign Affairs and Finance, Overseas Pakistanis and Human Resource Development as well as the Federal Board of Revenue (FBR) in the success of Roshan Digital Account.\nIt was further told that full cooperation of various ministries as well as Senator Faisal Javed made possible the journey of Roshan Digital Account a success during the last five months.\nThe participants were also briefed in detail about payments under the Roshan Digital Account as well as a proposed road-map for further increasing the remittances and providing more facilities to the overseas Pakistanis.\nThe prime minister while appreciating the provision of facilities to the expatriate community under the Roshan Digital Account and the success achieved during the last five months, said that the overseas Pakistanis were the country’s most precious asset and the government was fully committed to facilitate them with regard to the remittances and investment.\nWhile directing for modernization of facilities under the Roshan Digital Account and further facilitating the overseas Pakistanis in account opening, and making the process of their investment in the country’s various sectors more easy, he stressed early finalization and implementation of the proposals.",
  "retrievedAt": "2025-08-11T20:18:56.357Z"
}
