{
  "title": "Ombudsman institutions functioning with full govt’s support: Ejaz",
  "link": "https://www.app.com.pk/national/ombudsman-institutions-functioning-with-full-govts-support-ejaz/",
  "date_published": "2023-07-11T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): The Ombudsman institutions are functioning in Pakistan with the full support of its citizenry and the incumbent government.\nThis was stated by Wafaqi Mohtasib (Federal Ombudsman) Ejaz Ahmad Qureshi while addressing an international seminar in Bangkok on the role of the Asian Ombudsman as a mechanism for promoting fair administration, good governance and the rule of law, a news release on Tuesday said.\nThe seminar was held as part of the Asian Regional Meeting 2023 hosted by the International Ombudsman Institute (IOI) which is a global ombudsman body with over 200 members from across the globe.\nIn his address to the seminar, Qureshi emphasized that the institution of Wafaqi Mohtasib was playing its due role in the dispensation of administrative justice, thereby complementing the efforts of the supreme judiciary in providing justice to all citizens.\nHe said that the steps taken by the Wafaqi Mohtasib’s institution to check against the maladministration and administrative excesses of government agencies, in fact, contribute towards promoting good governance, the rule of law and respect for human rights.\nHighlighting the growth of the institution as an effective mechanism for speedy and inexpensive justice, Wafaqi Mohtasib Ejaz Ahmad Qureshi stated that it has perfected its complaints-handling mechanism over the last 40 years.\nThe incidence of complaints has touched an all-time high figure of 164,173 during 2022 and the disposal of 157,798 complaints has been unprecedented.\nDuring the first six months of the current year, it has received 90,660 complaints and disposed of 92,387 complaints including the backlog which is reflective of the public confidence in the institution.\nAddressing the international seminar, Qureshi said the ombudsmanship has taken firm roots in Pakistan.\nThe ombudsman institutions are functioning in the country with the full support of its citizenry and the government.He said the Wafaqi Mohtasib’s institution meets all the given standards in terms of the Venice Principles (2019), the Paris Principles (1993) and the UN Resolution 77/224 of December 2022. Ejaz Ahmad Qureshi being the current President of the Asian Ombudsman Association (AOA), also chaired an informal meeting of the AOA members on the sidelines of the international seminar.\nHe reiterated Pakistan’s commitment to the cause of ombudsmanship as a means to achieving the ultimate goals of good governance and the rule of law and assured the membership of an active role by AOA in strengthening cooperation within the ombudsman fraternity.",
  "retrievedAt": "2025-08-11T08:52:56.536Z"
}
