{
  "title": "UNHCR provides cash assistance to over 1 million Afghan refugees in Pakistan",
  "link": "https://www.app.com.pk/national/unhcr-provides-cash-assistance-to-over-1-million-afghan-refugees-in-pakistan/",
  "date_published": "2023-07-11T18:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): UNHCR, the UN Refugee Agency, has completed the disbursement of cash assistance to over 1 million registered Afghan refugees in Pakistan who were impacted by the prolonged difficult economic situation in the aftermath of the devastating floods of 2022.\nThe cash assistance programme, which was launched in January 2023 in collaboration with the Government of Pakistan, officially concluded at the end of June.\nUNHCR’s one-off cash grant of up to PKR 25,000 or approximately USD100, depending on family size, supported a total of 250,000 Afghan refugee households in Pakistan. The total spending on cash assistance for Afghan refugees since January was USD17.8 million, said a press release.\nUNHCR’s Representative in Pakistan, Ms. Noriko Yoshida, said that the current economic situation coupled with the floods last year had badly affected people in Pakistan, including refugees.\n“It was imperative to provide cash assistance to refugees in line with the support that was provided by the government to the people in Pakistan,” she said.\nPakistan hosts over 1.3 million registered Afghan refugees and 427,000 people in refugee-like situations from Afghanistan.\nThe assistance has helped those hardest hit by the economic downturn by enabling them to meet their basic needs.\nYoshida reaffirmed UNHCR’s commitment to continue supporting refugees and their hosts and recognized the support of the international community for making their assistance possible. She also acknowledged and appreciated the support in its implementation by the Government of Pakistan, financial service provider Habib Bank Limited (HBL) and other national implementing partners such as INSPIRE Pakistan and Society for Human Rights and Prisoners’ Aid (SHARP).\nThe partnership is UNHCR’s first private sector engagement with the country’s banking system and is an excellent example of the commitment of the Government and private sector in the country to find innovative approaches to support vulnerable Afghans.\nUNHCR is on the ground to support Pakistan as it recovers from the aftermath of last year’s devastating floods, with a particular focus on areas hosting refugees. Some 800,000 refugees live in areas that were impacted by the devastating floods.",
  "retrievedAt": "2025-08-11T08:52:46.664Z"
}
