{
  "title": "Marriyum terms news item published about Azam Chaudhry as false, baseless",
  "link": "https://www.app.com.pk/national/marriyum-terms-news-item-published-about-azam-chaudhry-as-false-baseless/",
  "date_published": "2023-07-11T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Tuesday that the news item published in Friday Times about Azam Chaudhry was false and baseless.\nIn a tweet, she said that Azam Chaudhry was not a Pakistan Television Corporation employee and had never been a PTV employee.\nShe said that he has only been a member of an issues-based analyst pool for PTV. He has not been removed from the pool and has not been asked to leave.\nShe clarified that nothing of the sort has been communicated to him and he is part of the PTV Lahore analysts pool as she was writing this tweet.\nShe said that the views and opinions of the said journalist were known to the government at the time he was invited to the press conference.\n“If the government wanted to suppress his voice or questions, he would not have been invited and given an opportunity to ask his questions. The Prime Minister answered his questions in detail,” she said.\nThe minister said that she also answered his questions. She said that the PM spent a significant amount of time answering questions from various reporters at Governor’s House that day.\nThe minister said that unlike the previous PTI regime and its fascist PM, who was declared a Press Freedom Predator by Reporters Without Borders, PM Shehbaz and the present government firmly believed in the freedom of media.\nThe PTI government used to only allow selected reporters and journalists to its fascist PM’s press conferences, she remarked. The present government ensured that PM Shehbaz Sharif’s press conferences are open to all reporters and journalists.\nThe minister said that this story was published without taking the government’s point of view which was unprofessional and fell short of journalistic ethics and standards.",
  "retrievedAt": "2025-08-11T08:52:57.206Z"
}
