{
  "title": "PM stresses ending disparity of resources among population",
  "link": "https://www.app.com.pk/national/pm-stresses-ending-disparity-of-resources-among-population/",
  "date_published": "2023-07-11T06:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Prime Minister Shehbaz Sharif on Tuesday urged the stakeholders to invest in empowering communities by building their capacity through better health and educational facilities and ensuring an enabling environment to unlock their potential.\nIn his message on the World Population Day being globally marked today, the moment draws the attention to the vast disparity between the requirements of increasing population and availability of resources.\nAlso, he said, it highlights the need for affirmative policy actions to empower our communities and the people.\nPM Sharif said population remains at the heart of effective national planning.\nHe said for developing countries in particular, managing population growth is key to socio-economic development.\nHe said no country, howsoever resourceful, can deal with population explosion.\n“Thus drawing a balance between population and resources is fundamental to the fulfilment of the needs of teeming millions,” he said.\nThis year’s theme ‘Unleashing the power of gender equality’ is a powerful reminder of the imperative to empower our women, girls and men and end discrimination.\n“Their mainstreaming in the national life will automatically help in achieving the development goals and increasing human productivity,” he said.\nThe prime minister said gender equality was not just a human rights issue, but also an economic requirement.\n“The idea of balanced development is grounded in the empowerment of communities, who are enabled in not only fulfilling their aspirations of a meaningful life but also becoming a shareholder in the process of development of their societies,” he said.\nHe mentioned the significance of the multifarious factors such as climate change, geostrategic upheavals and dysfunction of markets, the countries are finding it hard to stay on course for achieving Millennium Development Goals.\nAdd to this mix the issue of gender inequality and discrimination and humanity gets farther from Sustainable Development Goals, he said.\nThe prime minister said the concept of development was not abstract but rooted in the welfare of the people.\n“Hence all the more reason to invest in effective communication between the policy makers and the people at large for better outcomes,” he said. “We need to demonstrate greater political will to deal with the challenge.”",
  "retrievedAt": "2025-08-11T08:53:06.429Z"
}
