{
  "title": "Gandhara Symposium 2023 to start tomorrow",
  "link": "https://www.app.com.pk/national/gandhara-symposium-2023-to-start-tomorrow/",
  "date_published": "2023-07-10T19:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP): A three-day Gandhara Symposium 2023 titled “Cultural Diplomacy: Reviving Gandhara Civilization and Buddhist Heritage in Pakistan” was being held in Islamabad from tomorrow (July 11) to July 13.\nThe Symposium was organized by the PM Task Force on Gandhara Tourism, the Institute of Strategic Studies Islamabad (ISSI) and the Directorate of Archaeology and Museums, Government of Khyber Pakhtunkhwa, said a press release.\nThe symposium includes four Sessions focused on Gandhara Civilization and Buddhist Heritage in Pakistan, a Round Table discussion and visits to Taxila and Peshawar Museums followed by a cultural evening.\nThe Inaugural Session would be addressed by the President of Pakistan, Dr. Arif Alvi, as Chief Guest and Minister of State, Chairman of the PM Task Force on Gandhara Tourism, Dr. Ramesh Kumar Vankwani would be the Guest of Honour.\nThe Concluding Session will be addressed by Senator Talha Mahmood, Federal Minister for Religious Affairs & Inter-Faith Harmony.\nThe speakers at the Gandhara Symposium will be from Malaysia, Thailand, South Korea, Nepal, Sri Lanka, China, and Pakistan. Faith leaders, archaeologists, curators, experts, religious scholars, and academicians will reflect on the richness of Gandhara civilization and the Buddhist Heritage. Prominent stakeholders from Pakistan’s tourism industry will also participate in the Symposium.\nThe Gandhara civilization flourished in the region which is mostly modern-day Pakistan. Situated at the crossroads of ancient trade routes, Gandhara served as a melting pot of diverse cultures and civilizations. One of the most remarkable aspects of the Gandhara civilization was its artistic creativity.\nThe re-discovered cities of the Gandhara civilization exhibited many elements of their well-structured and modern lives through paintings, sculptures, coins, pottery and their relation with Buddhism.\nPreserving and further promoting the Buddhist Gandhara heritage is of paramount importance for Pakistan. Besides other modes, digital and social media offer new powerful means for projecting the Buddhist Gandhara heritage in Pakistan to the world. The sacred sites, sculptures, and artefacts of Gandhara are not just relics from the past; they are also a source of inspiration for the faithful and tourists from different parts of the world.\nOne of the key objectives of the Gandhara Symposium will be to create awareness about Gandhara and foster a sense of appreciation for Pakistan’s rich and diverse cultural heritage, both domestically and abroad. Another important objective of the Gandhara Symposium will also be to consider new initiatives that reinforce Pakistan’s cultural diplomacy efforts and help promote tourism, particularly faith tourism, in Pakistan.",
  "retrievedAt": "2025-08-11T08:53:06.256Z"
}
