{
  "title": "PM for creation of enabling equal opportunities for women empowerment",
  "link": "https://www.app.com.pk/national/pm-for-creation-of-enabling-equal-opportunities-for-women-empowerment/",
  "date_published": "2023-07-11T13:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday stressed upon provision of equal opportunities to the womenfolk as they consisted of half of the country’s population and were playing varying roles at different strata of society.\nHe was addressing the launching ceremony of the ‘Prime Minister’s Initiative for Women Empowerment’ which is being initiated at a total cost of Rs 10.4 billion.\nThe prime minister said that the country’s womenfolk were an effective and energetic segment, playing effective roles in families and society as mothers, sisters, wives and daughters.\nHe observed that in the last 75 years, the required opportunities for the women empowerment were not sufficient and stressed upon making of further efforts for securing women rights, including the inheritance rights and creation of opportunities in a conducive environment, so that they could contribute meaningfully and productively in society.\n“Look around the Muslims world and the West, the women have played their due role for the progress and prosperity of their respective nations,” he added.\nLauding different prominent women personalities of the country, he said that they had served as great ambassadors of Pakistan in different capacities.\nThe prime minister said that there was no dearth of talent in Pakistan as they were blessed with great minds, but there was a need to harness the true potential with creation of opportunities.\nCommending the rural women, he said that the ratio of the rural area women in the national building capacity was immense as they had been working on fields along side with the men.\nHe further observed that to achieve a place among the the comity of nations, both genders of the country had to work together, and underlined the need for provision of financial and actual opportunities in different fields.\n“The women segment of our society is the driving engine for the country’s economy and serve as builders of nation,” he added.\nAbout the creation of Shuhada Fund initiative, he said it was their duty as the martyrs had sacrificed their lives for the protection of the motherland and saved generations.\nThere could be no other precedent of bravery and valour than their sacrifice, he said, adding their bereaved families deserved honour and support.\nThe ceremony was attended by a large number of women belonging to all walks of life, besides ministers, parliamentarians, representatives of women organizations and relevant authorities.\nReferring to the current day challenges, he expressed his gratitude to the brotherly country of Kingdom of Saudi Arabia for extending financial support in form of $2 billion deposit with the State Bank of Pakistan.\nThe prime minister questioned that as a nation for how long they would continue to depend upon foreign loans. “It is the pricking question,” he added.\nHe said a neighbouring country of Pakistan in the year 1991 sought the last IMF programme and then did not require any other financial programme.\nThe prime minister underscored the need that they had to streamline their affairs by learning lessons from the past and ‘like an active nation have to move ahead’.\nFor a year, he said, he had never faced such severe financial issues, triggered further by the last year’s floods, global inflation and Ukraine war which posed a huge challenge for the country’s economy.\nAbout the International Monetary Fund (IMF) programme, he hoped that it would proceed accordingly.\nTerming the foreign debts fetters, he said the nation had to rid itself of financial chains.\nThe prime minister further highlighted that they had to focus on the development of agriculture, exports and exploration of precious minerals worth trillions of dollars.\nHe regretted that billions of dollars had been wasted on litigation in the past and the country did not get a single penny profit which made them to suffer collectively.\nThe prime minister without elaboration said that all the political leaders and dictators were equally responsible for those woes.\n“If we show determination, the country can emerge within days,” he added.\nThe prime minister further highlighted that as chief minister of Punjab, he embarked upon different initiatives for women empowerment.\nHe cited the award of scholarships to the deserving girls in South Punjab whereas under the Punjab Skill Development Programme, thousands of women from the backward areas were equipped with skills development education, adding they did not invest on brick and mortar rather on human resources.\nSpeaking on the occasion, Minister for Human Rights Riaz Hussain Pirzada said that the focus on women empowerment was a significant part of the present government’s policy.\nHe cited that Article 25 of the Constitution and other related articles guaranteed against all kinds of gender discrimination, adding the international charter also insisted upon ensuring of equal opportunities.\nWomen empowerment, he further said, meant provision of equal opportunities to the women to participate fully in the national, economic and political affairs of the country.\nHe said the PM’s initiatives would serve to achieve the objectives under Sustainable Development Goals (SDGs).\nPM’s Special Assistant on Youth Affairs Shaza Fatima Khawaja said that the initiative was launched under the PM’s vision aimed at women empowerment.\nShe expressed the hope that maximum number of women would take benefits from the initiatives and would play their role in the progress and prosperity of the country.\nShaza also stressed upon provision of opportunities to the womenfolk, besides availability of platforms to serve as springboards for the aspiring womenfolk to excel in different fields.\nThe present government has given a high priority on human rights and gender equality. It has allocated Rs 5,000 million for the Prime Minister’s Initiative for Women Empowerment in PSDP 2023-24 plus a new project titled “Women on Wheels” for which the PSDP allocation for 2023-24 is Rs 500 million.\nThe funds will be used for various projects aimed at promoting gender equality and women empowerment with a total cost of Rs 10,410 million.",
  "retrievedAt": "2025-08-11T08:52:52.536Z"
}
