{
  "title": "Chinese Girls’ documentary highlights rich, diverse culture of Pakistan",
  "link": "https://www.app.com.pk/national/chinese-girls-documentary-highlights-rich-diverse-culture-of-pakistan/",
  "date_published": "2023-07-11T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP):The short documentary film titled “Threads of Friendship: A Chinese Girl’s Adventure in Pakistan” screened here on Tuesday at the Aiwan-e-Quaid auditorium showcased the rich and diverse culture of the country captured in visuals presented by a native Chinese in pure Urdu language.\nThe speakers at the screening of the short documentary film termed China as Pakistan’s all-weather, ‘iron’ friend and said that both the countries were linked in a bond of friendship that spanned over decades and travels through generations.\nThe documentary is in fact a joint venture of the China Media Group (CMG) and 101 Friends of China, an Islamabad-based mega strategic think-tank founded by the late Editor-in-Chief of Pakistan Observer, Zahid Malik in 2014.\nIn the 22-minute short film, Director of the China Media Group (CMG) Urdu Service, also known as the China International Radio Urdu Service, (FM 98 Dosti Radio) Noreen (Chinese name: Nao Ling) has successfully tried to explore various layers of the ancient, rich, diverse and unique culture of Pakistan.\nShe  started her journey by visiting Faisal Masjid giving some useful information about its architecture, design and historical perspective.\nShe also visited the Pakistan Monument, Saidpur Village, Rawal Lake and the National Incubation Centre.\n“Pakistan” in her words “is a country full of wonders,” she added.\nAt the closure of the documentary she said, “My journey has just started and soon I shall be back with more such captivating sights.”\nSpecial Assistant to Prime Minister (Minister of State) on Interior Affairs, Jawad Sohrab Malik was the Chief Guest on the occasion while among the noted guests who attended the show included Press Attache of the Embassy of China Liu Chang, Vice-Chancellor of the Quaid-e-Azam University (QAU), Prof Dr Niaz Ahmed Akhtar, Vice-Chancellor, National Skills University, Prof Dr Muhammad Mukhtar, CEO of Pakistan Observer and Vice Chairman 101 Friends of China Faisal Zahid Malik, DG National Institute of Maritime Affairs (NIMA), Vice Admiral (R) Ahmed Saeed and former Project Director (PD) China Pakistan Economic Corridor (CPEC) Hassan Daud Butt.\nThe audience that included a large number of the Pakistani and the Chinese viewers applauded as the short documentary progressed and admired her for portraying an enlightened, peaceful and moderate Pakistan in her documentary.\n“Her command of Urdu and ease of using the right Urdu word at the right place is simply amazing,” said Fatima, one among the audience.\nIn the words of the moderator and co-producer, Fahd Gauhar Malik, the screening exemplified the power of video-sharing and communication that enabled us all to delve deeper into the nuances of Pakistan’s customs and traditions through the lens of our Chinese friends.\n“During the four weeks of recording and while working with Noreen we always found her full of energy and passion to film the ‘real potential’ of Pakistan’s tourism sector and to attract the local as well as foreign tourists to this land of peace, harmony and diversity,” said Fahd Malik.\nChief Guest on the occasion SAPM Jawad Sohrab Malik commending the work of the CMG and 101 Friends of China said Pakistan had always valued its friendship with China. Pakistan’s tourism sector indeed carried a huge potential that must be tapped and Noreen and Fahd through the documentary have tried to reflect that.\nDr Hassan Daud Butt in his speech shared his experience of the Chinese people’s hospitality and love for the Pakistanis and held that he felt the same feeling of sincerity and camaraderie in the ‘Chinese Girl’s Adventures in Pakistan.’ Noreen, he said, has become a household name in Pakistan because of FM98 Dosti Radio and a large number of the Pakistani people are tuned to its transmissions.\nWhile thanking the audience, Noreen said she planned to do more such documentaries on Pakistan’s sites that have not so far been discovered.\nTo a question, she said wherever she went for the sake of the documentary she found the Pakistani people very kind, helpful, cooperative and hospitable. A certificate was also presented to Noreen in recognition of her great work.",
  "retrievedAt": "2025-08-11T08:52:56.878Z"
}
