{
  "title": "Srinagar highway becomes signal free after proposal of ITP",
  "link": "https://www.app.com.pk/national/srinagar-highway-becomes-signal-free-after-proposal-of-itp/",
  "date_published": "2022-03-20T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): The Srinagar (Kashmir) Highway has been made signal free after the proposal of Islamabad Traffic Police to district administration and Capital Development Authority.\nChief Commissioner Islamabad has appreciated the proposal of Senior Superintendent of Police (Traffic) and gave directions for immediate implementation on it.\nFollowing the proposal, Srinagar Highway has been made signal-free by giving three protective U-turns which connects Islamabad and the twin city with the Islamabad International Airport.\nBy implementation on this proposal, solution to traffic jams has been ensured which would also save over Rs seven billion which could have been spent on construction of flyovers or interchanges.\nMore than 1,15, 000 vehicles would exit and enter Islamabad while all foreign delegates could travel on signal free road. It would also save 1,00, 000 hours travel time while safe road environment is also be ensured through it.\nThree protective U-turns have been named G-9/G-10 Protective U-turn, Police Lines Protective U-turn and G-12 Protective U-turn. Following the proposal of Senior Superintendent of Police (SSP) (Traffic) Rai Mazhar Iqbal, this plan was okayed and accomplished with in minimum time of 15 days.\nChairman CDA has appreciated SSP (Traffic) Rai Mazhar Iqbal for giving this outstanding proposal. Through this proposal, Rs. 7.5 billion public money has been saved which is required for construction of four over-head bridges.\nAll foreign guest and dignitaries would move to and fro airport on the road thus Signal free corridor would promote Pakistan’s International Image, he said adding, the duration of travel to Islamabad International Airport would reduce to half through this initiative.\nThis would be 60 to 70 percent solution to traffic jam while time duration of travelling to Islamabad Airport would also reduce considerably, the SSP (Traffic) remarked.",
  "retrievedAt": "2025-08-11T14:34:13.946Z"
}
