{
  "title": "FM Qureshi, Egyptian FM discuss bilateral ties, global issues",
  "link": "https://www.app.com.pk/national/fm-qureshi-egyptian-fm-discuss-bilateral-ties-global-issues/",
  "date_published": "2022-03-20T08:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 20 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi and Foreign Minister of the Arab Republic of Egypt, Sameh Hassan Shoukry Sunday held in-depth consultations, exchanging views and perspectives on a wide range of bilateral, regional and international issues.\nBoth sides expressed satisfaction at the excellent state of bilateral relations and close cooperation at various regional and multilateral fora.\nForeign Minister Shoukry is visiting Pakistan for bilateral engagements and participation in the 48th session of the OIC Council of Foreign Ministers (CFM) being held in Islamabad on March 22-23.\nUnderscoring Pakistan’s shared bonds of common faith, cultural affinity and historically warm ties with Egypt, the Foreign Minister reaffirmed the desire to further deepen the multi-dimensional relationship between the two countries.  The two Foreign Ministers agreed to enhance high-level exchanges and to strengthen institutional engagement for adding further momentum to close collaboration on all issues of mutual interest.\nThe Foreign Minister also stressed the need to foster closer inter-Parliamentary cooperation as part of enhanced people-to-people exchanges between the two brotherly countries.\nForeign Minister Qureshi highlighted the potential for increased cooperation in the fields of trade, investment, defence, tourism, agriculture and higher education.\nBoth Foreign Ministers concurred on the need to explore opportunities for such bilateral cooperation.\nThe Foreign Minister apprised his counterpart of the ongoing human rights violations and illegal demographic changes in Indian Illegally Occupied Jammu and Kashmir (IIOJK). He also briefed Foreign Minister Shoukry on the recent so-called “accidental” firing of a missile by India into Pakistan’s territory.\nHe stressed that, in addition to highlighting disturbing questions about the multiple shortcomings and technical lapses of serious nature in India’s management of strategic weapons, the lack of communication and explanation from India’s side was a source of serious concern. Noting that the incident was consistent with India’s irresponsible conduct and needed to be addressed by the international community, the Foreign Minister underscored Pakistan’s demand for a joint probe into the incident.\nThe two Foreign Ministers had a detailed exchange on the developments relating to Afghanistan.\nForeign Minister Qureshi emphasized the need for urgent measures to avert humanitarian and economic crises in Afghanistan.\nHe drew attention to the improvement in the security situation and stressed the importance of constructive engagement by the international community to help promote the objectives of durable peace and stability of Afghanistan as well as the prosperity of the Afghan people.\nThe two Foreign Ministers shared perspectives on the situation in Ukraine. Foreign Minister Qureshi highlighted Pakistan’s principled position and consistent calls for a peaceful settlement through dialogue and diplomacy.\nHe stressed the inviolability of the principles of the UN Charter.\nThe two Foreign Ministers also exchanged views on the economic impact on the world at large and the unintended consequences for the developing countries arising from the ongoing conflict, particularly in the shape of rising oil and food commodity prices.\nIn the context of the 27th Conference of Parties (CoP) of UN Framework Convention on Climate Change, scheduled to be held in Sharm-el-Sheikh, Egypt, later this year, the two Foreign Ministers discussed priority actions for tackling Climate Change, particularly the need for channeling enhanced climate finance for developing countries. Foreign Minister Qureshi assured Pakistan’s support to the Egyptian Presidency of CoP-27 for a successful Conference.",
  "retrievedAt": "2025-08-11T14:34:17.140Z"
}
