{
  "title": "No one to be allowed to disrupt OIC conference: Rasheed",
  "link": "https://www.app.com.pk/national/no-one-to-be-allowed-to-disrupt-oic-conference-rasheed/",
  "date_published": "2022-03-20T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Interior Minister Sheikh Rasheed Ahmed while regretting over Bilwal Bhutto statement about forthcoming OIC’s Foreign Ministers Summit, on Sunday said no one would be allowed to disrupt the OIC Conference.\nIf anyone has courage then dare to stop the Organization of Islamic Cooperation (OIC) conference, he warned while addressing a presser here. The National Assembly had adopted a resolution on January 21 to hand over the House to Foreign Office for holding OIC Conference, he added.\nLIVE #APPNews : Minister for Interior @ShkhRasheed talks to media #Islamabad https://t.co/n1OaZ7ko7A\n— APP  (@appcsocialmedia) March 20, 2022\nHe said only agents of imperialistic forces could think to sabotage the OIC conference.\nHe said outer security of Parliament House, Parliament Lodges and Members National Assembly’s (MNA) hostels had been handed over to the Rangers and FC till April 2.\nRegarding convening of National Assembly (NA) session for no-confidence motion against the Prime Minister, the minister said the Speaker NA could not kill the motion rather he has authority to extend the session keeping in view the current situation.\nHowever, he said that he did not know when the Speaker would summon the National Assembly session.\nHe expressed the hope that all allied would support Prime Minister Imran Khan after their consultation.\nThe Minister condemned storming at Sindh House and said the cases had been registered against all those who were involved in the incident. The Attorney General would file reference in Supreme Court on Monday, he added.\nHe said Pakistan Tehreek-e-Insaaf (PTI) would hold a historic rally at D –Chowk on March 27 and PM Imran Khan would address it, adding, the opposition was also holding a rally.\nSheikh Rasheed said the Interior Ministry would provide full security and protection to both rallies of March 25 and March 27.\nHe said that he has directed the Commissioner and Deputy Commission Islamabad to take onboard both the parties and select separate venues for holding their rallies. The imperialistic forces were against the independent foreign policy of Pakistan given by Imran Khan and hatching conspiracies, he added.\nHowever, he warned that if any untoward incident happened at the rally, cases would be registered against their leadership, he added.\nTo a question, Rasheed said no hurdle would be made for the participants of the opposition’s rally.\nTo another question, he expressed the hope that the dissident PTI MNAs and allied would support Imran Khan in no-confidence motion.\nTo a separate question about the death of Islamabad police lady constable, the minister said as per postmortem report, poison was given to her and a First Information Report had been registered under section 302.",
  "retrievedAt": "2025-08-11T14:34:16.089Z"
}
