{
  "title": "OIC FMs to discuss Palestine, Kashmir issues: Qureshi",
  "link": "https://www.app.com.pk/national/oic-fms-to-discuss-palestine-kashmir-issues-qureshi/",
  "date_published": "2022-03-20T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Minister for Foreign Affairs Shah Mahmood Qureshi Sunday said the Council of Foreign Ministers of Organization of Islamic Cooperation in its meeting would discuss the challenges being face by the Muslim Ummah including the issues of Palestine and Kashmir.\nHe was speaking during a visit to Parliament House here to see the arrangements for the meeting of Council of Foreign Ministers of Organization of Islamic Cooperation on Tuesday.\nForeign Secretary Sohail Mahmood, Special Foreign Secretary Raza Bashir Tarar, Spokesman of Ministry of Foreign Affairs Asim Iftikhar and senior officers of the ministry were present on the occasion.\nThe officials gave a detailed briefing to the minister about the arrangements for the conference.\nThe minister visited the central conference hall, counters for the delegations, medical center, media center and different meeting rooms.\nSpeaking on the occasion, the minister said it was a great honour for Pakistan to host the OIC Council of Foreign Ministers conference after holding the extraordinary session of the OIC ministers last time.\nHe said he met with the visiting Egyptian foreign minister and exchanged views on matters of mutual interest.\nAs a founding member of OIC, Pakistan wanted a strengthened platform of OIC, he remarked.\nHe said under the leadership of Prime Minister Imran Khan, Pakistan effectively raised the issue of Islamophobia and a resolution was adopted in the United Nations and from now onwards March 15 will be observed as an international day against Islamophobia.\nHe said on the special instructions of Prime Minister Imran Khan all arrangements had been made to host the OIC delegates led by foreign ministers.",
  "retrievedAt": "2025-08-11T14:34:10.185Z"
}
