{
  "title": "PM witnesses signing of new agreement for Reko Diq project",
  "link": "https://www.app.com.pk/national/pm-witnesses-signing-of-new-agreement-for-reko-diq-project/",
  "date_published": "2022-03-20T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 20 (APP): Prime Minister Imran Khan Sunday witnessed the signing ceremony between the Government of Pakistan, the Government of Balochistan and Barrick Gold Corporation of Canada after successfully resolving the longstanding dispute with Tethyan Copper Company (TCC) concerning the development of copper and gold mines in Chagai, popularly known as the Reko Diq dispute.\nThe new agreement was signed by representatives of the Federal and Balochistan Governments with a delegation of Barrick Gold, led by Chief Executive Dr. Mark Bristow.\nAs per the terms of the new agreement, the Reko Diq project shall be revived and developed by Barrick gold in partnership with Pakistani entities. The new project company shall be owned 50% by Barrick Gold. The remaining 50% shareholding shall be owned by Pakistan, divided equally between Federal Government and the provincial government of Balochistan.\nFederal Government’s 25% shareholding shall be divided equally amongst three state-owned-entities (SOEs) of the Federal Government, namely Oil & Gas Development Corporation Limited (OGDCL), Pakistan Petroleum Limited (PPL) and Government Holdings Pakistan Limited (GHPL). Balochistan’s share shall be held by a company wholly owned and controlled by the Government of Balochistan.\nAs part of the Prime Minister’s vision for Balochistan, the Government of Balochistan’s share of capital and operating expenses for the project shall be borne by the Federal Government. In other words, the Government of Balochistan shall not incur any expenses in development of the mines and its share of expenses shall be borne by the Federal Government.\nIn developing the project, nearly USD 10 billion shall be invested in Balochistan, including USD one billion that shall be invested in social uplift projects such as roads, schools, hospitals and creation of technical training institute for mining.\nThe investment shall create over 8000 new jobs. This project shall make Balochistan the largest recipient of foreign direct investment in Pakistan and the Reko Diq project shall be one of the largest copper and gold mining projects in the world. To ensure optimal utilization of nation’s mineral wealth the government was also considering setting up a smelter.\nThe agreement was reached after several rounds of negotiations over the last three years. In August 2019, the Prime Minister had set up a committee to steer the negotiations with an aim for early development of the mines. In this effort, the Federal and Provincial Governments were assisted by international advisors.\nTo ensure the deal was compliant with all the laws, the Government shall submit the matter before the parliament and the Supreme Court.\nWhile speaking on the occasion, the Prime Minister stressed on the emphasis his government placed on development of Balochistan and uplift of underdeveloped areas. He expressed hope that the investment will mark the beginning of large scale investments in Balochistan that shall change the quality of lives of ordinary citizens in Balochistan.\nThe Prime Minister appreciated the efforts of the negotiating team for a transparent and favourable agreement for the people of Balochistan.\nEarlier, delegation of Barrick Gold Corporation called on the Prime Minister. Canadian High Commissioner to Pakistan Wendy Gilmour was also present.\nPrime Minister Imran Khan congratulated the nation and residents of Balochistan province over the successful agreement for the development of Reko Diq mine.\nIn a series of tweets, the prime minister expressed hope that Reko Diq mine would be potentially the largest gold and copper mine in the world and liberate the country from the crippling debt, ushering in a new era of development.",
  "retrievedAt": "2025-08-11T14:34:11.551Z"
}
