{
  "title": "18 migrants die, 50 missing after shipwreck in eastern Libya - World - DAWN.COM",
  "author": null,
  "content": "At least 18 migrants died in a shipwreck off the city of Tobruk in eastern Libya over the weekend, and 50 are still missing, the International Organisation for Migration (IOM) said on Tuesday, citing reports.\n\nTen survivors have been accounted for so far, the IOM said.\n\nTobruk is a coastal city near the border with Egypt.\n\nSince the toppling of Muammar Gaddafi in a Nato-backed uprising in 2011, Libya has become a transit country for migrants fleeing conflict and poverty to Europe across the desert and over the Mediterranean.\n\n“This latest tragedy is a stark reminder of the deadly risks people are forced to take in search of safety and opportunity. Libya remains a major transit point for migrants and refugees, many of whom face exploitation, abuse, and life-threatening journeys,” the IOM said.\n\nLast month, at least 60 migrants were feared dead after a pair of shipwrecks off the coast of Libya. The first ship went down on June 12 near a Libyan port in Tripoli, with 21 people, including women and children, reported missing and only five survivors found.\n\nThose lost at sea included Eritrean, Pakistani, Egyptian and Sudanese nationals. The second wreck took place about 35 kilometres off the port city of Tobruk, with the sole survivor reporting 39 people lost at sea.\n\nA number of Pakistani migrants were feared to be among the dead after a vessel capsized near the Marsa Dela port, northwest of Zawiya city in Libya in February. The boat was carrying around 65 passengers at the time of the accident.\n\nThe development followed a similar incident in January in which a boat carrying 80 passengers capsized near Morocco. While the identities of at least 13 Pakistanis killed in the incident were confirmed, over 40 Pakistanis were reportedly murdered by African human traffickers on the boat and only 22 survived the tragedy.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/191009265a21498.jpg?r=100950",
  "retrievedAt": "2025-08-17T21:36:13.177Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927425/18-migrants-die-50-missing-after-shipwreck-in-eastern-libya",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T14:37:59.000Z"
}
