{
  "title": "Trump sets new deadline for end to Ukraine war - World - DAWN.COM",
  "author": null,
  "content": "TURNBERRY: US President Donald Trump on Monday set a new deadline of 10 or 12 days for Russia to make progress towards ending the war in Ukr­aine or face consequences, underscoring frustration with Russian President Vladimir Putin for the conflict.\n\nTrump has threatened both sanctions on Russia and buyers of its exports unless progress is made. “I’m going to make a new deadline of about … 10 or 12 days from today,” Trump told reporters during a meeting with British Prime Minister Keir Starmer in Scotland.\n\n“There’s no reason in waiting… We just don’t see any progress being made.”\n\nTrump said he was disappointed in Putin and shortening the 50-day deadline he had set on the issue earlier this month. There was no immediate comment from the Kremlin.\n\nThreatens Russia, buyers of its exports with sanctions if progress not made within 12 days\n\nTrump, who has expressed anno­yance also with Ukrainian Presi­dent Volodymyr Zelensky, has not always followed up on his tough talk about Putin with action, citing what he deems a good relationship that the two men have had previously.\n\nOn Monday, Trump indicated he was not interested in more talks with Putin. He said sanctions and tariffs would be used as penalties for Moscow if it did not meet Trump’s demands.\n\n“There’s no reason to wait. If you know what the answer is going to be, why wait? And it would be sanctions and maybe tariffs, secondary tariffs,” Trump said.\n\n“I don’t want to do that to Russia. I love the Russian people.”\n\nExpressing disappointment in President Putin, Trump said, “I’m going to reduce that 50 days that I gave him to a lesser number because I think I already know the answer what’s going to happen.”\n\nThe US president has repeatedly voiced exasperation with Putin for continuing attacks on Ukraine despite US efforts to end the war. Trump has played up successes in other parts of the world where the United States has helped to broker peace agreements and has been flattered by some leaders who suggest he should be given the Nobel Peace Prize.\n\nBefore returning to the White House in January, Trump had promised to end the conflict “within 24 hours”.\n\n“We thought we had that settled numerous times, and then President Putin goes out and starts launching rockets into some city like Kyiv and kills a lot of people in a nursing home or whatever,” Trump said. “And I say that’s not the way to do it.”\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6887ef919c735.jpg",
  "retrievedAt": "2025-08-17T21:40:02.970Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927251/trump-sets-new-deadline-for-end-to-ukraine-war",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:52.000Z"
}
