{
  "title": "Punjab allocates Rs60 billion for restoration of historical sites - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: Punjab Parliamentary Secretary for Human Rights and Minorities Affairs has said that the Punjab government has announced an ambitious plan to preserve and promote the province’s rich historical legacy by declaring three cities including Taxila as official heritage cities.\n\nShe was talking to newsmen during her visit to Gandhara Art Village on Monday.\n\nOn this occasion, Gandhara Stone Art Village Association Chairman and other officials of Punjab Small Industries Corporation were also present on this occasion.\n\nShe added initially Rs60 billion has been earmarked for the development and restoration of 60 key archaeological and historical sites across the province. “The initiative aims not only to highlight these locations on the international stage but also to stimulate local tourism, cultural preservation, and economic growth,” she said.\n\nShe revealed that Taxila has been given special prominence and will be designated as an “International Heritage City.” Punjab Chief Minister Maryam Nawaz Sharif hailed Taxila as the “City of Civilizations,” acknowledging its profound historical significance, particularly its connections with the Gandhara civilization and sacred Buddhist heritage.\n\nShe said that the Punjab government plans to upgrade its archaeological sites, museum facilities, and excavation areas to meet international standards, with the goal of attracting greater numbers of foreign tourists. Responding to a question, she said that the Punjab government has increased minority cards quota minority cards from 50,000 to 75,000.\n\nShe added that in the first phase, 50,000 cards were being distributed, while preparations for launching the second phase were underway.\n\nEarlier, she was briefed about the project by Gandhara Stone Art Village Association Chairman Syed Zaheer Hussain Shah.\n\nShe was informed that the village PC-I was approved with the total cost of Rs. 104.360 to establish Gandhara Art Village at Taxila.\n\nTraining Centre, Common Facility Centre, Display Centre and Design Centre. The art village chairman said the move was aimed at mainstreaming the centuries-old skills of craftsmanship of Taxila artisans by utilising the latest computer-based technologies to produce market-oriented products. “This initiative will have a pivotal impact on the capacity of the artisans community to produce better quality artefacts especially Gandhara art products,” Mr Shah added. He said the initiative had focused on the design, value addition and product development of stone craft by local artisans.\n\nLater, Ms. Sonia Ashir also visited Christian hospital Taxila where she visited various parts of the hospital, especially the newly upgraded outdoor patient department and male ward. She lauded the century of selfless services of the hospital for curing ailing humanity.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:37:56.883Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927231/punjab-allocates-rs60-billion-for-restoration-of-historical-sites",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:10:21.000Z"
}
