{
  "title": "Pakistan women’s camp ahead of Ireland tour starts today - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: A five-day pre-series training camp for the Pakistan women’s cricket team begins on Tuesday at the Hanif Mohammad High Performance Centre, as the side looks to fine-tune preparations ahead of their upcoming Twenty20 International series in Ireland, the country’s cricket board announced on Monday.\n\nUnder the supervision of head coach Mohammad Wasim, the camp will continue till August 2 and focus on skill development in batting, bowling and fielding.\n\nPlayers will also feature in intra-squad T20 practice matches before the team departs for Dublin on August 3.\n\nThis marks the final phase of preparations following a 27-day conditioning camp held earlier this month here. The national squad, announced last week by the PCB, includes 15 players with all-rounder Fatima Sana continuing as captain.\n\nSpeaking at a press conference over the weekend, Fatima expressed confidence in her side’s form and unity.\n\n“Despite the difference in conditions, our batters are confident, and we’re looking to carry forward the momentum from the Qualifiers,” she said.\n\nPakistan defeated Ireland in the opening ODI of the ICC Women’s World Cup Qualifiers earlier this year, eventually qualifying for the mega event unbeaten. That experience, Fatima believed, has instilled a renewed belief in the squad.\n\n“We are trying to develop our T20I game as well,” she added, emphasising the team’s focus on all three departments.\n\nTop-order batter Muneeba Ali echoed similar sentiments, highlighting the shift in focus from the 50-over format to T20s.\n\n“We’ve identified areas of improvement and worked on them during the camp,” she said. The idea is to build on our strengths while staying mindful of what lies ahead.“\n\nPakistan will play three T20Is against Ireland from August 6 to 10 at the Clontarf Cricket Club in Dublin. The series serves as vital match practice ahead of a busy international calendar, including a home series against South Africa in September and the ICC Women’s World Cup, set to be played under a hybrid model later this year.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:38:52.977Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927275/pakistan-womens-camp-ahead-of-ireland-tour-starts-today",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:09:53.000Z"
}
