{
  "title": "A land far, far away - Newspaper - DAWN.COM",
  "author": null,
  "content": "LESS than two years later, the Baloch women are back protesting in Islamabad. They don’t seem to have received much attention this time, but that is hardly surprising. At a time when states everywhere are redefining their relationships with their own people, especially those who think the right to protest is a legitimate one, these women visitors are being treated not just with indifference but resentment.\n\nThey have not been allowed to protest in front of the Press Club and are forced to sit on the road. The traders, who have a great sense of timing, are also most upset at the inconvenience caused to them. After all, they already have to deal with so many disruptions in this city, such as dharnas by the TLP, PTI and even Tahirul Qadri in the past. Why should women from Balochistan assume they can behave as do men from Punjab?\n\nWhen they came in the winter of 2023-24, the caretaker government didn’t bother to talk to them. The current government is no less preoccupied. But it is kinder for it didn’t try to bus them away in the middle of the night, and neither did it encourage other protesters to put up air-conditioned tents right next to them, just to make the women realise that they are not the only victims around.\n\nAmong the protesters is the sister of BYC leader Mahrang Baloch. She has come to Islamabad because Mahrang is behind bars in Quetta. In recent days, there have been many allegations against Mahrang and others in the BYC: links with militant groups; acts proving their unpatriotic credentials; the decision to forcibly enter a hospital in Quetta and steal bodies in the mortuary. Which of these allegations have made it to the formal charges under which she is in prison is unclear to me because little of it is reported by a press focused on political parties operating in Islamabad or Lahore or Peshawar.\n\nThe lived experiences of the rest of us are very different from those in Balochistan.\n\nBut even if I were better informed, I wonder if it is possible to remain a little sceptical of the accusations levelled against those who have been arrested. As a society, we press on with allegations excitedly, which dissipates when evidence makes its way from the TV studios to the courts. Apparently, most of it is due to lazy prosecution, though in many cases hardworking judges don’t let shoddy work get in their way. Cases nearer to Islamabad have unfolded this way, time and again, and yet when the allegations first surface and people are arrested, the belief in their guilt is complete. Could one venture to wonder if the BYC leader’s journey follows a similar path?\n\nIt might be an irrelevant question because in many ways, Balochistan is far away from what the rest of us see. The lived experiences of the rest of us are very different from those in that province. For the Baloch, she is a young woman in jail with few chances of relief or justice, a citizen who deserves compassion and her rights. Some senior lawyers express anguish at the idea of the ‘child’ in jail with little hope of relief, as the new-look judiciary as well as amendments to other laws have made bail or a release harder for those who have been arrested.\n\nThe government claims the new laws will put an end to enforced disappearances, as now the authorities have the right to detain people for three months without any charge. And with this power, the ones held will also be allowed to meet their loved ones. Each will know of the other’s well-being.\n\nBut if this was so, why would the hapless women be in Islamabad in this heat, sitting quietly on concrete, waiting for just a little attention from our elected politicos? Even if they do realise that the air in Islamabad inflicts amnesia on those in power, they tend to forget all the issues they had expressed empathy for when in opposition. But I digress. I was explaining the benefits of the changes in law.\n\nIndeed, those in power are quite confident of how things will be better going forward. But I wonder how it will help those who have been waiting for their missing relatives, for years, if not decades, holding on to a picture and some memories? How are they supposed to heal? After all, Mahrang or Sammi Baloch would not be household names if they had not gone through the experiences they have — of losing a loved one and then protesting at a time the rest of us were playing and studying in schools.\n\nOne can ask why Mahrang has so much appeal in a part of Pakistan, far from Islamabad. It might be because her story strikes a chord, because her lived experience is shared by many others. This grievance has to be addressed, if Pakistan is to make progress in Balochistan.\n\nConnected with this is the question about whether or not it is possible to view the political crisis in Balochistan as one which can only be handled through force. This is an approach, some argue, which has not worked in parts of KP. Beyond our own borders, there has also been a change of attitude towards Kabul, where too, engagement has replaced an earlier policy. Within, it might also be time to consider some tweaks to this approach in Balochistan.\n\nThis will neither be easy nor quick. But it might not be too late to start a conversation, about engaging the mainstream political parties and politicians who have remained part of the electoral process. This can be the first step, which might then help create the environment to reach out to other more unpalatable stakeholders. And beyond the mainstream politicians, people such as Mahrang, will have to be engaged. After all, the British government eventually did talk to Sinn Fein.\n\nThe writer is a journalist.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688851d26a054.png",
  "retrievedAt": "2025-08-17T21:37:29.295Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927325",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T04:46:36.000Z"
}
