{
  "title": "Palestinian question a ‘test case’ for world, Dar tells UN moot on two-state solution - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister Ishaq Dar on Tuesday said the Israel-Palestine question was a “test case” for the United Nations and the world as he addressed a high-level conference on the two-state solution in New York.\n\nDar was addressing a rescheduled global conference on “The Peaceful Settlement of the Question of Palestine and the Implementation of the Two-State Solution” at the United Nations headquarters.\n\nThe three-day moot, co-chaired by France and Saudi Arabia, comes amid renewed international efforts calling for an end to Israel’s bombardment of Gaza ongoing for over 660 days, with France announcing it will formally recognise the State of Palestine.\n\n“The Palestinian question is a test case for the United Nations and the world. Pakistan reaffirms its unwavering and principled support for the Palestinian people’s inalienable right to self-determination, including their right to a viable, independent and contiguous State of Palestine, based on the pre-1967 borders, with Al-Quds Al-Sharif as its capital,” Dar told the conference.\n\n“It is high time for credible and enforceable international action,” he stressed, according to a transcript posted on X by Pakistan’s Permanent Mission to the UN.\n\nSince October 7, 2023, Israel’s offensive against Gaza has killed more than 60,000 and injured 145,870 others, according to the health ministry in the besieged and bombarded territory.\n\n“First, an immediate, unconditional and permanent ceasefire across Gaza and all Occupied Palestinian Territories.\n\n“Resolution 2735 must be implemented. We commend the efforts of Saudi Arabia, Qatar, Egypt and the United States,” Dar said, referring to a UN Security Council resolution passed last year for a ceasefire in Gaza.\n\n“Second, full and unimpeded humanitarian access, especially life-saving food and medicine. Humanitarian teams must be protected,” the deputy premier said, highlighting the need for reinforced political and financial support for the UN Relief and Works Agency (UNRWA).\n\n“International accountability for war crimes and crimes against humanity. Impunity must end,” Dar further said. The International Criminal Court (ICC) had issued arrest warrants last year for Israel’s Prime Minister Benjamin Netanyahu and former defence minister Yoav Gallant, as well as Hamas’s slain military chief Mohammed Deif.\n\nDar further noted: “Fifth, the reinvigoration of a genuine and irreversible political process to end the occupation and realise the two-state solution.”\n\nThe conference, with 123 countries and global organisations participating, aims to chart a concrete path towards the two-state solution through proposals developed by eight working groups, which have held extensive consultations with UN member states and civil society groups.\n\nDuring his speech, Dar urged the conference to “ensure universal recognition of the State of Palestine and its full UN membership”, welcoming France’s decision in that regard.\n\nThe deputy premier highlighted: “Today, Gaza is a graveyard of international law and humanitarian principles.\n\n“The death and destruction inflicted by Israel, including the killing of over 58,000 Palestinians — mostly women and children — is an unconscionable breach of international humanitarian law, UN resolutions and the binding measures of the International Court of Justice (ICJ).”\n\nThe ICJ, in a non-binding ruling, had ordered Israel in January 2024 to prevent acts of genocide against Palestinians, but had stopped short of ordering a ceasefire as requested by South Africa. In July that year, it also ruled that Israel’s decades-long occupation of Palestinian territory was “illegal” and needed to end as soon as possible.\n\nAt the moot, the deputy PM also called attention to Israel’s blocking of humanitarian aid to Gaza, which Tel Aviv eased on Sunday.\n\n“The blockade of aid, deliberate targeting of civilian infrastructure, including refugee camps, hospitals and aid convoys, has crossed every red line of legality and humanity. This collective punishment must stop now!” Dar emphasised.\n\n“For over 75 years, the Palestinian people have endured occupation, displacement and denial of their fundamental rights, including their inalienable right to self-determination. This prolonged injustice is not just a political failure, but a moral stain — and a persistent threat to international peace and security.”\n\nDetailing Pakistan’s will to support Palestinians, Dar said: “Pakistan stands ready to extend dedicated technical assistance and capacity building support to our Palestinian brothers and sisters in key sectors such as public administration, health, education and service delivery, in coordination with the Palestinian leadership.\n\n“Pakistan is prepared to contribute to the building of institutions, including through participation in the Arab-OIC Plan, and any international protection mechanism,” he added.\n\n“Justice delayed is justice denied. But when justice is denied for generations, the consequences are even graver.\n\n“The question of Palestine has impacted the entire region and beyond. We must give hope to the Palestinian people. The occupation must end, and end now. It is time for freedom, self-determination and statehood, and Palestine’s full membership of the UN. That will be the best guarantee for lasting peace in the region,” the foreign minister asserted.\n\nSpeaking on the outcomes of the conference, Dar underscored the “centrality of the two-state solution as the only path to sustainable peace”. He called on the moot to demand Israel’s immediate withdrawal from Gaza and support its reconstruction as envisaged in Resolution 2735 and a plan by Arab countries.\n\n“Four: reject and halt any attempts at the forced displacement or demographic manipulation. Five: Oppose illegal Israeli settlements and annexation, especially in the West Bank and East Jerusalem,” the foreign minister said, addressing the UN member states present.\n\nThe deputy premier also supported a proposal by the Organisation of Islamic Cooperation (OIC) to “provide international protection for the Palestinian people through the deployment of an international protection mechanism”.\n\nOn the sidelines of the UN conference, Dar met with Palestinian PM Mohammad Mustafa and held a “detailed exchange on the grave situation in Gaza and Occupied Palestinian Territory”.\n\n“I conveyed deep sorrow over the immense suffering endured by innocent Palestinians, and reaffirmed Pakistan’s full solidarity with them,” the deputy PM said on X.\n\nHe reiterated Pakistan’s firm commitment to lasting peace and the establishment of a sovereign Palestinian state based on pre-1967 borders.\n\n“We expressed hope that the conference would lead to concrete outcomes in support of the Palestinian cause and the realisation of the two-state solution,” Dar wrote.\n\nMustafa also addressed the conference, saying: “What is happening in Gaza is its latest and most brutal manifestation, and we are more than ever compelled to act.”\n\nSeparately, Dar also held a meeting with Kuwait’s Foreign Minister Abdullah Al-Yahya in New York and discussed close collaboration at multilateral forums.\n\nPakistan established diplomatic relations with Kuwait in October 1963. The two countries maintain strong brotherly relations rooted in shared religion and culture, with the oil-rich Gulf state hosting nearly 100,000 Pakistanis.\n\nDar met with the Kuwaiti minister on the sidelines of the international conference on the two-state solution.\n\nThe two leaders “discussed close collaboration at multilateral fora, including at the UN and OIC”, a statement by the Foreign Office said.\n\n“The two leaders discussed ways to further strengthen Pakistan–Kuwait relations, with a focus on enhancing cooperation in trade, investment, energy, food security and defence.”\n\nBoth sides agreed to undertake high-level exchanges soon to deepen bilateral engagement, the FO added.\n\nThe two foreign ministers also expressed their “deep concern at continuing Israeli acts of aggression against Palestinians and worsening humanitarian situation in Gaza”, stressing the urgent need for a just and lasting resolution.\n\nDar also met with Bangladesh’s Foreign Adviser Md. Touhid Hossain on the sidelines of the conference, which the FO noted was their fourth meeting since October 2024.\n\n“The two leaders reviewed bilateral ties, reaffirmed commitment to deepen political, economic and cultural cooperation, as well as boost connectivity and people-to-people exchanges,” the FO said on X.\n\n“Both agreed to undertake high-level visits in the near future,” it said, adding that the two diplomats also expressed their concern over the “grave humanitarian crisis and ongoing Israeli aggression” in Gaza.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/29135842c62c959.jpg",
  "retrievedAt": "2025-08-17T21:36:51.837Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927385/palestinian-question-a-test-case-for-world-dar-tells-un-moot-on-two-state-solution",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T10:32:47.000Z"
}
