{
  "title": "Officials grilled for letting tourists go to flood-hit areas - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate Standing Committee on Communications on Monday grilled the National Highway Authority (NHA) and Motorway Police for not taking preventive measures and allowing a gush of tourists to reach hilly areas during torrential rains and flash floods where many tourists lost their lives recently.\n\nThe committee, headed by Senator Pervaiz Rashid, was briefed by NHA regarding the flood-affected portion of the Indus Highway, damaged during the Manchar Lake Floods of 2022. It was informed that the segment has been restored as two-lane road.\n\nThe committee’s members also referred to the recent Babusar Top incident, questioning why the NHA did not take preventive measures to stop tourists from entering the area despite being aware of the risks.\n\nMembers pointed out that on the Motorways, if a vehicle is found over-speeding, the driver is detained immediately, his family is left behind, and in some cases, rude behaviour is adopted by Motorway Police officials.\n\nTorrential rains, flash floods recently claimed life of several tourists\n\n“Why similar strict actions were not taken to stop tourists from heading towards hazardous areas like Babusar Top,” a committee member asked.\n\nThe committee directed that Motor­way Police officials should be instructed to avoid misconduct with the public. In response, the chairman of the committee recommended summoning the Inspector General of Motorway Police for a detailed briefing on the matter.\n\nThe meeting was attended by Senators Zamir Hussain Ghumro, Jam Saifullah Khan, Saifullah Abro, Dost Ali Jessar, Palwasha Mohammad Zai Khan, Kamil Ali Agha, Abdul Wasay and other officials from Ministry of Communications and relevant departments.\n\nDeputations in NHA\n\nThe committee sought a comprehensive list of 43 officials of (BS-16 & above) serving with the NHA on deputation with details such as names, designations, qualifications, parent departments, duration of deputation, and number of extensions granted.\n\nThe NHA chairman informed the committee that out of 20,900 employees, 43 were initially on deputation in the authority, but now the number has been reduced to 39.\n\nA member of the committee termed the situation alarming and said that as per court directives, deputation should not exceed three years, but several officers in NHA have exceeded this limit.\n\nHyderabad-Sukkar Motorway\n\nA comprehensive briefing was given to committee meeting on the current status of Hyderabad-Sukkar Motorway (M-6) by the NHA chairman.\n\nThe NHA chairman told the committee that Islamic Development Bank (IsDB) has indicated to give $475 million for two sections of M-6 (4 & 5) while sections 1 & 2 will be built under PPP mode.\n\nCAREC project\n\nThe committee was apprised of the possibility of funds availability for the construction of the Sehwan Bypass under the CAREC Tranche-1 project.\n\nThe committee was informed that Sehwan Bypass could not be included in the ADB-funded CAREC Tranche-1 project, which was at the closing stage.\n\nMeanwhile, the chairman of Senate standing committee on economic affairs, Saifullah Abro, called its meeting on Aug 1 for deliberations on the communications sector, with a particular focus on the CAREC-Tranche III project.\n\nThe committee questioned how all four lots of tranche-III were being given to the same joint venture of — NXCC, Rustam Associates and Dynamic Constructors.\n\nTalking to Dawn, Mr Abro, who is also a member of the Senate committee on communications, said that serious concern was expressed over repeated absence of the secretary of communications from the meeting. He said the committee felt that secretary should have attended the meetings and briefed members on actions taken by the ministry so far on alleged irregularities in the biding process of CAREC-Tranche III project.\n\nMr Abro said that despite repeated directives, the NHA has failed to provide relevant documents to the committee that could prove innocence of the authority.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:39:43.883Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927305/officials-grilled-for-letting-tourists-go-to-flood-hit-areas",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:59.000Z"
}
