{
  "title": "China and US wrap up first day of trade talks in Stockholm - World - DAWN.COM",
  "author": null,
  "content": "STOCKHOLM: Chinese and US officials wrapped the first day in a fresh round of talks in Stockholm on Monday, with the world’s top two economies looking to extend a fragile trade truce in the face of President Donald Trump’s global tariff war.\n\nThe negotiations in Sweden concluded shortly before 8pm, with neither side offering details on their progress, although a US Treasury department spokesman said they were expected to resume on Tuesday.\n\nThe United States and China earlier this year imposed triple-digit tariffs on each other in a tit-for-tat escalation, but then walked them back under a temporary agreement reached in May.\n\nThe expiry of that 90-day truce falls on August 12, but there are indications they could use the Stockholm talks to push it back further.\n\nBoth sides tight-lipped about outcome as negotiations to resume today\n\nThe negotiating teams in Stockholm were being led by US Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng in Sweden.\n\nThey were meeting in the Rosenbad building, home to the Swedish government.\n\nBefore Monday’s talks, US Trade Representative Jamieson Greer said he did not expect “some kind of enormous breakthrough today” at the talks in Stockholm that he was attending.\n\n“What I expect is continued monitoring and checking in on the implementation of our agreement thus far, making sure that key critical minerals are flowing between the parties and setting the groundwork for enhanced trade and balanced trade going forward,” he told CNBC.\n\nTrade analysts said another 90-day extension of a tariff and export control truce struck in mid-May between China and the US was likely.\n\nAn extension would facilitate planning for a potential meeting between Trump and Chinese President Xi Jinping in late October or early November.\n\nThe Financial Times reported on Monday that the US had paused curbs on tech exports to China to avoid disrupting trade talks with Beijing and support Trump’s efforts to secure a meeting with Xi this year.\n\n‘Shift’ seen in US approach\n\nThe previous round of China-US talks was held in London.\n\n“There seems to have been a fairly significant shift in (US) administration thinking on China since particularly the London talks,” said Emily Benson, head of strategy at Minerva Technology Futures.\n\n“The mood now is much more focused on what’s possible to achieve, on warming relations where possible and restraining any factors that could increase tensions,” she told AFP.\n\nTalks with China have not produced a deal but Benson said both countries have made progress, with certain rare earth and semiconductor flows restarting.\n\n“Secretary Bessent has also signalled that he thinks a concrete outcome will be to delay the 90-day tariff pause,” she said. “That’s also promising, because it indicates that something potentially more substantive is on the horizon.” US-China Business Council president Sean Stein said the most important thing from Stockholm “is the atmosphere coming out”.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/29081222f0c84e6.jpg?r=081235",
  "retrievedAt": "2025-08-17T21:40:05.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927250/china-and-us-wrap-up-first-day-of-trade-talks-in-stockholm",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:52.000Z"
}
