{
  "title": "PTI demands withdrawal of armed forces from merged districts - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The provincial chapter of Pakistan Tehreek-i-Insaf here on Monday condemned the killing of seven persons in Tirah incident and demanded of federal government through a resolution to withdraw armed forces from merged districts within fortnight.\n\n“The organisational committee demands of federal government to cancel all the notifications under Article 245 within fortnight and formally announce withdrawal of armed forces from merged districts,” said the resolution of PTI.\n\nIt is worth mentioning that Article 245 of the Constitution deals with calling armed forces in aid of civil powers.\n\nThe provincial chapter of PTI made the demand through a resolution, which was passed unanimously during the meeting of organisational committee of the party.\n\nOrganisational committee of party calls for independent commission to probe Tirah incident\n\nIt is pertinent to mention here that a protest over the killing of a minor girl in Tirah took a turn for the worse on Sunday, as seven people were shot after a demonstration outside a military installation took a violent turn.\n\nFollowing the incident, security officials met with tribal elders and announced compensation for the victims, assuring that medical treatment would be provided to the injured. The Khyber Pakhtunkhwa government has announced separate compensation for the deceased and injured.\n\nThe organisational committee of PTI met here with provincial president of the party, MNA Junaid Akhbar Khan, in the chair. The meeting was also attended by PTI provincial general secretary Ali Asghar Khan, senior vice president Arbab Jandad, additional general secretary Irfan Saleem, finance secretary Dr Nadeem Alam, information secretary Adeel Iqbal, deputy general secretary Dr Shafqat Ayaz and other senior leaders of the party.\n\nThe meeting was convened to discuss two-point agenda including discussion on the Tirah incident and preparation for the August 5 protest of PTI.\n\nThrough the resolution, the party also directed its lawmakers to pass a resolution in KP Assembly to demand of federal government to withdraw security forces from merged districts. It also directed MPAs of the party to secure support of opposition lawmakers in the passage of the resolution.\n\nPTI also directed its government in Khyber Pakhtunkhwa to issue orders to KP advocate general to immediately submit an application with Supreme Court of Pakistan to withdraw the stay orders issued through which it had suspended a judgement of Peshawar High Court of restricting scope of Article 245 of the Constitution.\n\nThe committee said that prolonged deployment of military under Article 245 of the Constitution created an atmosphere of “unbridled power and ineffective accountability, resulting into trampling of fundamental rights and deterioration of law and order.” It said that it was binding on KP advocate general to submit the report to organisational committee of PTI after each two weeks.\n\nThrough the resolution, it also demanded formation of an independent commission to fairly probe the Tirah incident as well as other similar incidents reported recently. It stated that the probe commission should consist of retired judges of superior judiciary and civil society members that should submit its report within 30 days. “The probe commission should identify perpetrators and recommend strict legal actions against them,” said the resolution.\n\nSimilarly, it demanded registration of FIRs against the people responsible for the Tirah incident and drone attacks in which civilians were either killed or injured so as to complete the investigation logically.\n\nThe committee also rejected the decision of federal government to turn Frontier Constabulary into Federal Constabulary and declared it attack on provincial autonomy, saying the historic provincial role of FC should be maintained.\n\nIt said that any change in the name of Frontier Constabulary or changes in its organisational structure would not be accepted without consultation of KP and other stakeholders.\n\nThe resolution stated that soon after the cancellation of Article 245 of the Constitution, it was binding on the provincial government to extend KP Police Act, 2017, to merged districts to fully restore police power and establish district peace committees consisting of tribal elders, religious scholars, women and youth.\n\nThe committee also demanded of authorities to expedite the process of merging Levies Force and Khasadar Force into police to ensure lasting peace in merged districts.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/688195b4e8e61.jpg",
  "retrievedAt": "2025-08-17T21:38:00.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927226/pti-demands-withdrawal-of-armed-forces-from-merged-districts",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:10:38.000Z"
}
