{
  "title": "Plan to protect kids against dozen life-threatening illnesses unveiled - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Federal Minis­ter for Health Syed Mustafa Ka­­mal has said Pakistan will dev­e­lop a new nationwide plan to lau­n­ch an immunisation drive aim­ed at protecting children against 12 life-threatening diseases.\n\nThe minister made the announcement while chairing a meeting of the federal directorate of im­­munisation on Monday to review progress and challenges of the country’s immunisation programme.\n\nMr Kamal highlighted urgent need for coordinated measures to increa­­se immunisation coverage, ensuring all children are protected against vac­cine-preventable diseas­­es. He said an awareness ca­­mpaign would be lau­n­ch­­ed so that parents un­­de­r­stand the critical importance of timely vaccination.\n\nParents must not beco­­me enemies of their own children by ignoring vaccination, the minister said, adding that they must take their children to the nearest health centre for routine immunisation.\n\nUnderscoring the government’s commitment, he said prevention was the primary focus. “Pr­e­vention is better than cure,” he remarked. “We must stop children from falling ill in the first place,” he said, adding that protecting children from deadly diseases was not only a public health priority but also a “religious and moral responsibility of every parent”.\n\nDuring the meeting, EPI Dir­ector General Dr Soofia Yunus presented a briefing on the current challenges and outlined the strategic way forward.\n\nThe WHO reaffirmed its support for Pakistan on World Hepatitis Day, also observed on Monday, as the country faces the world’s highest hepatitis C burden, with 10 million of the global 60 million cases.\n\n“We will continue to fully support Pakistan in its journey to combat hepatitis and reinforce prevention, detection, and treatment, ensuring that we protect the most vulnerable populations to leave no one behind,” said Dr Dapeng Luo, the WHO representative in Pakistan.\n\nIn Pakistan, common modes of transmission include unsafe blood transfusions, reused needles and syringes, and unhygienic practices in surgical, dental, tattooing and barber shop settings.\n\nGlobally, chronic viral hepatitis causes 1.3 million deaths every year, or about 3,500 deaths every day, mostly from liver cancer and cirrhosis.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/25143059d9163fc.jpg?r=143207",
  "retrievedAt": "2025-08-17T21:39:52.751Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927249/plan-to-protect-kids-against-dozen-life-threatening-illnesses-unveiled",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:52.000Z"
}
