{
  "title": "Two missing siblings found murdered in Narowal - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: Two siblings, who had gone missing on Sunday at village Bheko Chhor, were found murdered on Monday.\n\nReports said six-year-old Ume Kalsoom and three-year-old Muhammad Waris were reportedly beaten to death with iron rods and stones by unknown assailants.\n\nTheir father, Muhammad Kashif, a labourer and resident of the village, told police that the children had left home around 6:30pm to buy toffees and biscuits from a nearby shop but did not return.\n\n“We searched every house in the village with the help of local residents but couldn’t find them,” Kashif said in his complaint to the Sialkot Saddar police station. He suspected they had been kidnapped.\n\nPolice registered a first information report under Section 365 of the Pakistan Penal Code against unidentified suspects. On Monday morning, authorities were informed that two bodies had been spotted in the village graveyard, located just 200 feet from the victims’ home.\n\nA police team confirmed the recovery of the bodies. District Police Officer (DPO) Faisal Shahzad also reached the site and called the investigation SP, Punjab Forensic Science Agency (PFSA), and Homicide Investigation Unit, to conduct a thorough investigation.\n\nAccording to initial reports and medical examination, the children were brutally tortured but not subjected to sexual violence.\n\nThe DPO said several suspects, including locals and family members, had been taken into custody for questioning. The children’s father, originally from District Nankana Sahib, said he had no known enmity in the area and had settled in Sialkot for work.\n\nThe bodies were shifted to a government hospital for autopsy.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/28182803e120d1c.jpg?r=182815",
  "retrievedAt": "2025-08-17T21:37:30.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927331/two-missing-siblings-found-murdered-in-narowal",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T04:59:07.000Z"
}
