{
  "title": "KP govt ‘monitoring’ Tirah situation - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER/KARACHI: The Khyber Pakhtunkhwa government has claimed that Chief Minister Ali Amin Gandapur was “in contact” with the “relevant administration” over the shooting of protesters in Tirah.\n\nSeven people were fired at after a demonstration outside the Brigade Headquarters in Bagh-Maidan Markaz on Sunday against the death of a minor girl in a mortar strike.\n\nPrime Minister Shehbaz Sharif had condemned the “firing on peaceful citizens by khawarij” — the state’s terminology for the banned Tehreek-i-Taliban Paki­stan (TTP).\n\nHowever, sources and eyewitnesses said security personnel guarding the installation had reportedly opened fire to control the crowd after the demonstration took a violent turn.\n\nBar Qambarkhel tribesmen march against militant presence in restive valley\n\nA number of those who lost their lives on Sunday were laid to rest in the Bagh Markaz and Peer Mela localities of Tirah.\n\nBesides the seven deaths, at least 16 people sustained gunshot wounds. There has been no official statement from the local administration or the military about the mortar strike or Sunday’s killings.\n\n“The chief minister is in constant contact with the relevant admi­n­istration,” Dawn.com quo­ted CM Gandapur’s adviser, Barri­ster Mohammad Ali Saif, as saying on Monday. He said the KP chief minister was “monitoring” the Tirah incident himself.\n\nLocal sources claimed that security officials had accepted the tribesmen’s demand for compensation to the families of the deceased and injured tribesmen. However, no FIR has been lodged.\n\nSeparately, the PTI has called for an immediate and impartial inquiry into the Tirah incident, and asked for those responsible to be held accountable.\n\nIn a statement, PTI Information Secretary Sheikh Waqqas Akram said that the use of live ammunition against unarmed civilians was not only unjustifiable but also a blatant violation of basic human rights and democratic principles.\n\nTTP ‘withdrawal’ demanded\n\nMeanwhile, the Bar Qambarkhel tribe in the restive Tirah valley temporarily suspended its week-long protest against the presence of militants in Tirah after representatives of the banned TTP reportedly asked for some time to hold talks with their leadership in Afgh­a­nistan on the demand for their withdrawal from the valley.\n\nSources told Dawn that the decision to suspend the sit-in was announced during a jirga in Lar Bagh, after ‘successful negotiations’ between the Bar Qambar­khel elders and TTP representatives in the region.\n\nSources said the jirga was told that militant commanders had sought time till Aug 5.\n\nEarlier, Malak Zahir Shah had led a protest of hundreds of tribesmen, carrying the Holy Quran in their hands, and demanded the TTP men leave their area.\n\nThey staged a sit-in in Bhutan Shareef, saying they would only end their protest when given assurances that the militants would exit the area.\n\nIbrahim Shinwari in Khyber also contributed to this report\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/27211220c25e7b7.jpg?r=211407",
  "retrievedAt": "2025-08-17T21:40:12.651Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927254/kp-govt-monitoring-tirah-situation",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:45.000Z"
}
