{
  "title": "Economic recovery continues, but rains pose threat: ministry - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Finance (MoF) on Monday projected that inflation for July would remain in the range of 3.5–4.5 per cent, though it warned that recent heavy rains could disrupt agricultural output and supply chains.\n\nIn its Monthly Economic Update and Outlook, the MoF said inflation had declined sharply in recent mon­ths, supported by lower interest rat­es, exchange rate stability, and prudent macroeconomic management.\n\nLooking ahead, the ministry expects the economy to maintain its recovery momentum in early FY26, backed by improved fundamentals and rising investor confidence. “Large-Scale Manufacturing (LSM) is likely to retain its pace in June, driven by increased private sector credit offtake and higher production activity,” it said. The rebound is expected to boost imports of raw materials and intermediate goods while supporting exports of value-added products.\n\nThe MoF further noted that strengthening domestic demand, a stable rupee, and steady global commodity prices are expected to enhance exports, remittances, and imports during July, reinforcing stability in the external sector.\n\nSays Pakistan posts first annual current account surplus in 14 years\n\nThe ministry reported that the economy grew by 2.68% in FY25, while inflation eased to 4.5pc. Improved fiscal discipline helped contain the deficit, which, along with better resource management, strengthened market confidence and created space for monetary easing.\n\nAs FY26 begins, the government aims to build on this momentum with a renewed focus on sustainable and inclusive growth.\n\nKey policy priorities include continued fiscal consolidation, enhanced revenue mobilisation, modernisation of the agriculture and industrial sectors, and reforms in business climate and human capital development.\n\nA major positive development cited in the report was the current account surplus of $328 million recorded in June, bringing the full-year surplus for FY25 to $2.11 billion — the first annual surplus in 14 years and the largest in 22 years. This compares with a deficit of $2.07bn in FY24.\n\nThe improvement was primarily driven by a surge in workers’ remittances and exports, which more than offset the impact of higher imports. “This reflects the strengthening of external sector dynamics and effective macroeconomic management,” the report stated.\n\nIt also noted continued growth in foreign exchange reserves, which stood at $19.9bn as of July 11, including $14.5bn held by the State Bank of Pakistan — signalling greater external sector stability going into FY26.\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/28155253606e055.jpg?r=155315",
  "retrievedAt": "2025-08-17T21:39:03.566Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927243/economic-recovery-continues-but-rains-pose-threat-ministry",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:09:14.000Z"
}
