{
  "title": "NFC places ‘undue burden on Centre’: Ahsan - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Federal Minister for Planning Ahsan Iqbal expres­sed concern on Monday over the current formula for distribution of divisible pool resources under the National Finance Commission (NFC) award, arguing that it places an undue burden on the federal government.\n\nHe urged the provinces to develop a consensus to help ease the fiscal strain on Islamabad.\n\nSpeaking to reporters at the Karachi Press Club, he said the federal government was unable to invest in key development projects because a significant portion of development funds was being consumed by the provinces. After transferring provincial shares, the Centre is not left with enough funds to invest in projects critical to the country’s water and food security.\n\n“The federal government bears around Rs716 billion in expenses on behalf of the provinces,” Mr Iqbal said. “This significantly shrinks our fiscal space. Right now, we are facing a major challenge — projects like Diamer Bhasha Dam and Mohmand Dam, which are vital to our water security, cannot be completed swiftly due to insufficient development funds.”\n\nThe minister called upon the provincial governments to hammer out a formula that eases the federal government’s financial burden and enables it to complete these important projects.\n\nPlanning minister says provincial expenses shrink fiscal space for major projects, like dams\n\nMr Iqbal reiterated the government’s ambition to transform Pakistan into a $1 trillion economy by 2035 under the “Uraan Pakistan” initiative launched on Dec 31 last year.\n\n“No country wants to borrow money, but due to wounds inflic­ted by PTI’s policies we had no choice other than going back to the IMF. “We are now ensuring strict compliance with the IMF programme to achieve economic stability,” he said.\n\nEconomic indicators\n\nThe planning minister recou­n­ted “improvements” made in economic indicators over the past year, saying inflation had dropped by 24 per cent, interest rates had come down from 23pc to 11pc, remittances reached a record $39 billion and the stock market surged past 130,000 points.\n\n“All these are indicators that Pakis­tan’s economy has taken off. Now we will ensure political stability, continuity of policies, and institutional reforms so that we never face a decline again.”\n\nMr Iqbal highlighted Pakistan’s “growing stature” on the international stage following successful military operations like Operation Bunyanum Marsoos.\n\n“We are now set to take off in diplomacy as well,” he said. “During the PTI’s tenure, even our friends abandoned us, but under Prime Minister Shehbaz Sharif, our alliances are strong again.\n\n“Through CPEC 2.0, our relations with China have strengthened, and thanks to effective diplomacy, the Kashmir issue is back on the global agenda.”\n\nHe said the development bud­get had prioritised Balochistan, with funds allocated for the N-25 highway [Chaman–Quetta–Kara­chi], now renamed as the Pakistan Expressway.\n\nAhsan Iqbal gave updates on other key infrastructure projects. “Financing for Sukkur–Hyder­ab­­ad Motorway has been secured. The project was delayed due to PTI-era inefficiencies,” said Mr Iqbal.\n\n“Work continues on the Pesh­a­war–Karachi Motorway, which is a key part of Nawaz Sharif’s vision. The K-IV project for Kara­chi’s water supply has received Rs8bn. Extension of the Green Line bus service in Karachi has been approved in the current budget, with Prime Minister Shehbaz Sharif set to lay the foundation stone soon.”\n\nShowbiz industry\n\nEarlier, the federal minister held a meeting with directors and producers of the showbiz industry to find ways for introducing the country’s products in the global market. In a roundtable discussion with a delegation which inclu­ded names like Nadeem Baig, Satish Anand and Hina Khawaja Bayat, he said Pakistan had a rich culture and heritage in music, art and drama.\n\n“Pakistan’s film industry was once strong, with Lahore and Karachi its centre,” Mr Iqbal observed. “But the film industry has now declined to such an extent that just three or four films are released in a year.\n\n“Pakistani plays and films are not present on global platforms like Netflix and Amazon. You [directors and producers] must play your part to introduce our products to a global audience.”\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68880059999d9.gif",
  "retrievedAt": "2025-08-17T21:39:56.384Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927306/nfc-places-undue-burden-on-centre-ahsan",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:59.000Z"
}
