{
  "title": "Ex-home minister questions India’s Pahalgam narrative - World - DAWN.COM",
  "author": null,
  "content": "• Chidambaram asks why attackers haven’t been caught or identified; criticises lack of clear info from BJP govt\n• BJP govt claims success, opposition accuses it of hiding fact as Indian parliament debates Operation Sindoor\n• New Delhi claims killing Kashmiri fighters under new ‘Operation Mahadev’\n\nKARACHI: As the Indian parliament kicked off an animated discussion on Monday on the recent military standoff with Pakistan, a former home minister has challenged New Delhi’s narrative on the Pahalgam incident, questioning the claim that the attackers came from Pakistan.\n\nThe remarks from veteran Indian National Congress leader P Chidambaram came during an interview with The Quint, where he questioned the authorities handling of the April 22 attack and pointed out a lack of evidence to support New Delhi’s claim regarding Pakistan’s role.\n\n“Where are the terrorist attackers? Why have you not apprehended them, or even identified them? A news item had emerged about the arrest of a few people who gave the attackers shelter. What happened to them?” Times of India quoted him as saying.\n\nHe also questioned the role of the investigating agencies. “They are unwilling to disclose what the [National Investig­ation Agency] has done all these weeks. Have they identified the terrorists or where they came from? For all we know, they could be homegrown terrorists. Why do you assume they came from Pakistan? There is no evidence of that,” The Statesman quoted Mr Chidambaram as saying during the interview.\n\nAccording to Times of India, he also pointed out what he called the lack of a clear official information.\n\n“We get snatches and bits of information from different officers. The Chief of Defence Staff (CDS) goes to Singapore and makes a statement that gives you bits of information. The deputy army chief makes a statement in Mumbai. In Indonesia, a junior officer of the Navy makes a statement. But why is the PM or the defence minister, or the foreign minister not making a comprehensive statement?” he said.\n\nAsked what he believed the government was trying to hide, Mr Chidambaram responded, “I think, and this is speculation, I think they are hiding the fact that we made tactical mistakes (during Operation Sindoor), and we re-strategised… The CDS hinted at that. What tactical mistakes were made? What was the re-strategising? Either the BJP government is incompetent to answer these questions, or it is unwilling to do so.”\n\nMr Chidambaram further added, “They are also hiding the losses. I said it in a column that in a war, losses will occur on both sides. I understand that India would have suffered losses. Be upfront.”\n\nThe remarks prompted criticism from the ruling Bharatiya Janata Party (BJP), which accused the Congress leader of defending Pakistan.\n\nUnion minister Pralhad Joshi accused Mr Chidambaram of giving a “clean chit to Pakistan”, while BJP spokesperson Amit Malviya alleged that Congress “always bend over backwards to protect the enemy”.\n\n‘No pressure to end fighting’\n\nIn parliament, members from the treasury benches accused the Congress party of speaking the language of Pakistan and took exception to Mr Chidambaram’s remarks.\n\nIndian Defence Minister Rajnath Singh began the discussion by skipping mention of any follow up on the April 22 Pahalgam terror attack, and avoided answering a question about India losing warplanes to Pakistan by saying that the opposition was asking the wrong question.\n\n“If a child gets good marks in the exam, the question whether he had broken a pencil or lost one was not correct.”\n\n“We should not focus on whether (an examinee’s) pencil was broken or the pen was lost during the exam. Ultimately, the result matters, and the result is that our forces achieved fully the goals of Operation Sindoor.”\n\nMr Singh continued to make his claims though: “The opposition sometimes asks about planes shot down. Their question does not represent India’s sentiments. They have not yet asked how many Pakistani planes were shot down.\n\nHe also reiterated the Indian claim that Operation Sindoor was halted because India had fulfilled its political and military objectives. “To say it was done under any pressure is totally baseless and wrong,” he claimed, adding: “The aim was not to go to war but to compel the adversary to bend.”\n\nExternal Affairs Minister S. Jaishankar also claimed that President Donald Trump had played no role in bringing about the ceasefire. He said US Vice President J.D. Vance had spoken to Prime Minister Narendra Modi and told him that Pakistan was preparing to launch a major attack, adding that PM Modi told him that the attack would be responded to appropriately.\n\n‘Operation Mahadev’\n\nMeanwhile, Pakistan’s state broadcaster warned that India has once again begun “fake encounters” under the guise of countering terrorism, with an alleged plan to “use” detained Pakistanis in them.\n\nThe statement came after the Indian Army’s Chinar Corps said they killed three alleged terrorists as part of the so-called ‘Operation Mahadev’ in occupied Kashmir’s Srinagar, Radio Pakistan reported.\n\nWhile Indian media, citing sources, has been linking one of the dead to the Pahalgam attack, there has been no official word in this regard.\n\nThe Radio Pakistan report recalled statements made by military spokesperson Lt Gen Ahmed Sharif Chaudhry in press briefings held in April, where he had revealed details of 723 Pakistani nationals illegally detained in various Indian jails… [and] 56 Pakistanis are said to be held in secret custody by Indian intelligence agencies.\n\nOur correspondent in New Delhi also contributed to this report\n\nPublished in Dawn, July 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/271727276f2daff.jpg?r=183736",
  "retrievedAt": "2025-08-17T21:40:04.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927253/ex-home-minister-questions-indias-pahalgam-narrative",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T02:08:52.000Z"
}
