{
  "title": "Air India audit finds 51 safety lapses, from unapproved simulators to training gaps - World - DAWN.COM",
  "author": null,
  "content": "India’s aviation watchdog found 51 safety lapses at Air India in its July audit, including lack of adequate training for some pilots, use of unapproved simulators and a poor rostering system, according to a government report seen by Reuters.\n\nThe annual audit was not related to the deadly Boeing 787 crash last month that killed 260 people in Ahmedabad, but its findings come as the airline faces renewed scrutiny after the accident.\n\nThe Tata Group-owned airline is already facing warning notices for running planes without checking emergency equipment, not changing engine parts in time and forging records, along with other lapses related to crew fatigue management.\n\nThe 11-page confidential audit report from the Directorate General of Civil Aviation (DGCA) noted seven “Level I” significant breaches which need to be fixed by July 30, and 44 other non-compliances classified which need to be resolved by August 23.\n\nOfficials said they found “recurrent training gaps” for some unspecified Boeing 787 and 777 pilots, saying they had not completed their monitoring duties — where they don’t fly but observe functioning of instruments in the cockpit — ahead of mandatory periodic evaluations.\n\nAir India’s fleet includes 34 Boeing 787s and 23 Boeing 777s, according to Flightradar24 website.\n\nFlagging operational and safety risks, officials wrote in their report that Air India did not do “proper route assessments” for some so-called Category C airports — which may have challenging layouts or terrain — and conducted training for such airfields with simulators that did not meet qualification standards.\n\n“This may account to non-consideration of safety risks during approaches to challenging airports,” the DGCA audit report said.\n\nIn a statement to Reuters, Air India said it was “fully transparent” during the audit. It added it will “submit our response to the regulator within the stipulated time frame, along with the details of the corrective actions”.\n\nA preliminary report into the June crash found that the fuel control switches were flipped almost simultaneously after takeoff and there was pilot confusion in the cockpit. One pilot asked the other why he cut off the fuel and the other responded that he hadn’t done so, the report said.\n\nThe DGCA has often flagged concerns about Air India pilots breaching the limits of their flight-duty periods, and the audit report said an AI-787 Milan-New Delhi flight last month exceeded the limit by 2 hours and 18 minutes, calling it a “Level I” non-compliance.\n\nThe audit was conducted by 10 DGCA inspectors and included another four auditors.\n\nIt also criticised the airline’s rostering system, which it said “doesn’t give a hard alert” if a minimum number of crew members were not being deployed on a flight, adding that at least four international flights had flown with insufficient cabin crew.\n\nTata acquired Air India from the government in 2022. While it has aggressively expanded its international network, it faces persistent complaints from passengers, who often take to social media to show soiled seats, broken armrests, non-operational entertainment systems and dirty cabin areas.\n\nReuters reported last week that Air India’s senior executives, including the airline’s director of flight operations and its director of training, were sent notices on July 23 flagging 29 “systemic” lapses, pulling up the airline for ignoring “repeated” warnings. Air India has said it will respond to the regulator.\n\nThe audit report noted that “door checks and equipment checks” showed inconsistency with procedures and there were gaps in training documentation. Further, it said no chief pilots were assigned for the Airbus A320 and A350 fleet.\n\n“This results in a lack of accountability and effective monitoring of flight operations for these aircraft types,” the report said.\n\nLast year, authorities warned or fined airlines in 23 instances for safety violations, with 11 involving the Air India Group. The biggest fine was $127,000 on Air India for “insufficient oxygen on board” during some international flights.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/141025410495606.jpg?r=102557",
  "retrievedAt": "2025-08-17T21:36:23.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927419/air-india-audit-finds-51-safety-lapses-from-unapproved-simulators-to-training-gaps",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T14:01:42.000Z"
}
