{
  "title": "Rescue operation underway as German climber Laura Dahlmeier goes missing while trying to summit Laila Peak - Pakistan - DAWN.COM",
  "author": null,
  "content": "German mountaineer Laura Dahlmeier went missing while attempting to scale Laila Peak (6,096 metres) in the Hushy valley of Gilgit-Baltistan’s Ghanche district while another was rescued by army helicopters on Tuesday.\n\nIn a statement issued today, Alpine Club of Pakistan (ACP) Vice President Karrar Haidri said: “Former Olympic and world champion biathlete Laura Dahlmeier sustained serious injuries after being struck by a rockfall while attempting to summit Laila Peak.\n\n“The incident occurred around noon on July 28 at an altitude of approximately 5,700m. Dahlmeier was climbing with her mountaineering partner, Marina Eva, when a sudden rockfall hit her, resulting in significant injuries.”\n\nIt said the expedition organiser immediately alerted emergency services and a coordinated rescue operation was launched with support from Pakistan Army aviation helicopters and local high-altitude porters.\n\nIt added that rescue helicopters were unable to land at the accident site on Monday due to the challenging terrain and adverse weather conditions.\n\n“Efforts to evacuate Dahlmeier by air continued into July 29 with ground support teams on standby, awaiting a break in the weather.\n\n“Marina Eva successfully descended to base camp and is reported to be in good health. Meanwhile, worsening weather continues to delay aerial access to the injured climber, leaving the rescue team prepared to respond as soon as conditions permit,” the statement said.\n\nA press release posted on Dahlmeier’s Instagram account said that a helicopter overpass determined that she was at least “seriously injured” and “there were no signs of life”.\n\nIt said she was in the region with friends since the end of June and successfully climbed the Great Trango Tower (6,287m) on July 8, with Laila Peak the second planned summit goal.\n\nIt said she was a state-certified mountain and ski guide, an active member of the mountain rescue service and considered an experienced and risk-conscious mountaineer.\n\nGB government spokesperson Faizullah Faraq said an international mountaineering rescue team was currently overseeing the recovery operation and experienced climbers in the area were assisting in the mission.\n\nEarlier this month, a tourist from the Czech Republic, Klára Kolouchová, died after falling into a ravine at the Nanga Parbat base camp in GB.\n\nKolouchová, 46, was part of a multinational expedition atte­m­pting to summit the mountain. Her health reportedly deteriorated at Camp 4, forcing her to abort the climb and begin her de­­s­­­cent with Nepali Sherpa Tara­man Tamang.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2922180670f489d.jpg",
  "retrievedAt": "2025-08-17T21:36:06.069Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927437/rescue-operation-underway-as-german-climber-laura-dahlmeier-goes-missing-while-trying-to-summit-laila-peak",
  "dateList": "2025-07-29",
  "date_published": "2025-07-29T17:27:32.000Z"
}
