{
  "title": "Prudent policies of government resulted in stability of economy, decrease in inflation: Tarar",
  "link": "https://www.app.com.pk/national/prudent-policies-of-government-resulted-in-stability-of-economy-decrease-in-inflation-tarar/",
  "date_published": "2024-09-26T04:33:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 26 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar has said that stringent measures and prudent policies of the government had resulted in stability in the economy.\nAddressing a press conference here he said that due to steps of the present regime, inflation and and prices of daily use commodities had fallen considerably.\n” A certain political party wanted the economy to default,” the information minister said, adding, but the government took steps to avert such a situation.”\nHe said that the inflation ratio had decreased significantly compared to the same period last year and now it had come down single digit which was a good sign. Tarar said that the smuggling of dollars has been stopped by taking stringent measures and Information technology sector-related exports have increased significantly.\nThe economic stability of Pakistan was being acknowledged at the international level as well, he said.\nMoody’s and Fitch also declared Pakistan’s economy stable whereas Bloomberg described the Pakistani economic indicators as positive.\n“According to a Bloomberg survey, Pakistan’s stock exchange is moving in a positive direction”, he maintained.\nThe arrival of record remittances from overseas Pakistanis was also a good omen,he remarked.\nThe agreement with the IMF, the minister said would make the economy more stable, he remarked.\nThe minister said that Turkish President Tayyip Erdogan also praised Pakistan’s step toward economic stability.\nPrime Minister Shehbaz Sharif had held meetings with the heads of various countries on the sidelines of the United Nations General Assembly session.\nThe determination of the development of Bangladesh and Pakistan relations was reiterated during the PM’s meeting with Chief Adviser Dr Yunus in New York proved quite useful.\nTo a question, he said it would be a pleasure for the Prime Minister to invite Dr. Yunus, who was an intelligent and visionary leader to visit Pakistan.\nHe said due to floods Pakistan had to face a lot of financial and human losses as it suffered a lot due to the adverse effects of climate change.\nHe said Pakistan had given sacrifice of more than 80 thousand lives in the war against terrorism and its economy lost billions of dollars due to the scourge of terrorism.\nUnder the National Action Plan, various measures had been taken to root out terrorism from the soil of the motherland, he said.\nHe said peace has been restored in the mega city of Karachi and other areas with the efforts of the government.\nAbout the Palestine situation, he said the Prime Minister had taken up the situation in Gaza at every international forum.\n“Pakistan has clearly stated that Israel was committing genocide of Palestinians in Gaza for which\nit should be held accountable”.\nThe international community should show solidarity with the helpless people of Palestine and hold Israel accountable for its war crimes in the Gaza region. He said that the Palestinian leadership had acknowledged Pakistan’s support at all forums and Islamabad would continue to support Palestinians in every possible way.\nHe said that more measures will be taken for the education of Palestinian students in Pakistan\n“Pakistan is standing with and will continue to stand with the Palestinians,” he added.\nThe minister reiterated that the government was fully committed to the Quaid-i-Azam’s policy of not recognizing Israel.\nTarar also strongly condemned the Israeli attacks on Lebanon.\nThe nation, he said will be proud of the Prime Minister’s speech at the United Nations General Assembly.\nHe said Pakistan was desirous of improvement in the relations with neighbouring brotherly country Iran.\nThe minister termed overseas Pakistanis as valuable assets of the nation and the government attached high importance to their suggestions.\nProtecting Pakistan’s interest was a topmost priority of the government and efforts of a certain political party to spread anarchy and chaos would be foiled, he said. ” Pakistan Muslim League-N did not believe in politics of hatred and anarchy.\nTo a question, he said that the government was taking steps to provide relief to people and both\nThe Federal and Punjab governments have provided a subsidy on electricity.\nCompared to last year, the prices of food items and petroleum products have decreased, the information minister said.\nThe minister said Pakistan and America had good relations which would further improve.\nAttaullah Tarar said that digitization and reforms were being done in the Federal Bureau of Revenue which would help improve its performance.\nHe said that Karachi’s contribution to the economy was gigantic and steps were afoot to resolve its problems.\nAbout independent power producers, he said a task force has been set up to review their contracts. He reminded that\nit was the Pakistan Muslim League-Nawaz which ended electricity load shedding on an emergency basis after coming to power in 2013.\nHe said that famous technology company Google had assured to increase its investment in Pakistan and manufacture Chromebook.\nSmartphones for all projects were under consideration and Huawei had agreed to increase investment and it will provide training to 300,000 students in Pakistan.\nIn the meeting with Bill Gates, he said, more measures were discussed for the improvement of the IT sector in Pakistan.\nPML-N’s priority was not politics, the interest of the state was foremost for it.\nAnswering a question, he said Pakistan wanted good relations with Afghanistan, but the territory of any country should not be used against Pakistan.He said it was the prerogative of the Parliament to amend the constitution.\n“Constitutional courts exist in many countries of the world which take up cases related to the Constitution.”\n“Parliament has the power to rewrite or amend the constitution”, he maintained.\nThe minister said that Pakistan’s embassies and consulates all over the world had been given strict instructions to solve the problems of the Pakistani community in their respective countries.\nTo a question, he said that Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur had broken the windows of vehicles with a Kalashnikov in Lahore.\nHe said that the Punjab government in the past had offered support for counter-terrorism measures in Khyber Pakhtunkhwa. Commenting on the policies of the PTI, he said that politics should not be against the state.\nHe remarked that in this age of digital media, steps were necessary to counter false information and fake news on social media.\nHe said that the Special Investment Facilitation Council (SIFC) was established to promote investment in the country and after its establishment, investment in Pakistan had become easier for foreign investors.",
  "retrievedAt": "2025-08-10T21:23:23.932Z"
}
