{
  "title": "Strengthening access to Information paradigm critical in building trust between citizens, public institutions: Speakers",
  "link": "https://www.app.com.pk/national/strengthening-access-to-information-paradigm-critical-in-building-trust-between-citizens-public-institutions-speakers/",
  "date_published": "2024-09-26T18:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP):The speakers at a national level consultation on International Day for Universal Access to Information (IDUAI) on Thursday underlined that strengthening access to information paradigm was critical in building trust between citizens and public institutions.\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) and the Centre for Peace and Development Initiatives (CPDI), in collaboration with the Pakistan Information Commission, and civil society partners Individual held a national level discussion that featured eminent speakers that provided insights into the current state of information access in Pakistan, a news release said.\nThey also highlighted the implications of weak information commissions on cohesion and governance.\nThe consultation was held in conjunction with the International Day for Universal Access to Information (IDUAI). This year’s global theme highlights the significance of public access to information as a foundation for transparency, accountability, and public participation.\nFormer Information Commissioner Punjab and Right to Information expert, Mukhtar Ahmed Ali highlighted the need to prioritize public welfare. “This culture of secrecy prevents citizens from understanding the actions of their elected representatives and remaining aware of their rights.” He added that institutional strengthening is required to ensure effective implementation of RTI in the country.\nHamza Khan Swati, the National Professional Officer at UNESCO in Pakistan, highlighted that access to information is a fundamental right. He further highlighted that information commission’s role to be strengthened in light of evolving and emerging challenges pertaining to disinformation.\nShoaib Siddiqui, Chief Information Commissioner at the Pakistan Information Commission, underscored the need for comprehensive studies on digital information consumption and its impact on governance.\nThe consultation also addressed the challenges posed by the misuse of information and the trust gap between the masses and government institutions.\nFariha Aziz, a digital rights activist, emphasized the need for timely access to information, noting that delays can render data irrelevant.\nShe highlighted that one of the biggest achievements of information access laws is the time limitation that ensures effective public engagement with the government.\nDr. Jawaid Ali Shah, Chief Information Commissioner at the Sindh Information Commission, called for trust-building through accountability.\nMehboob Qadir Shah, former Chief Information Commissioner at the Punjab Information Commission, highlighted that RTI can help eliminate systemic injustices perpetuating various inequalities in Pakistan.\nThe second session focused on empowering marganlized communities. Reem Shareef, a transgender rights activist, noted that RTI laws have helped the transgender community eliminate misinformation and counter negative social media campaigns.\nZahid Abdullah, a right to information advisor, explained the vital role Right To Information laws play for differently abled by recognizing their constitutional rights.\nMs. Farah Hamid, Khyber Pakhtunkhwa Chief Information Commissioner, stressed the need for public engagement and awareness about RTI laws.\nFrom an investigative journalist perspective, Umar Cheema suggested that the RTI law has eliminated the gap between the people and government institutions, allowing everyone to access information without fear.\nMoonus Kainat Zahra, from CPDI, presented additional recommendations to enhance the RTI framework.\nShe suggested implementing regular training programs for public officials on RTI compliance and public awareness campaigns to educate citizens about their rights under RTI laws.\nShe also recommended establishing a centralized digital portal for RTI requests to streamline process and work towards strengthening commissions for more information integrity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:22:33.154Z"
}
