{
  "title": "Pakistan inks contract for selling JF-17 Block-III fighter jets to Azerbaijan",
  "link": "https://www.app.com.pk/national/pakistan-inks-contract-for-selling-jf-17-block-iii-fighter-jets-to-azerbaijan/",
  "date_published": "2024-09-26T12:38:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Sep 26 (APP): As part of Pakistan’s efforts to enhance defence cooperation with friendly countries, a contract for the sale of JF-17 Block-III fighter aircraft to bolster air power capabilities of Azerbaijan has been recently signed.\nDuring his recent visit to Pakistan, Azerbaijan’s President Ilham Aliyev was briefed on the combat capabilities and versatile employment options of JF-17 BLOCK-III fighter aircraft, an Inter Services Public Relations news release said on Thursday.\nPursuant to President Aliyev’s visit and on the request of Government of Azerbaijan, Pakistan deployed a Pakistan Air Force (PAF) contingent at Baku to participate in ADEX-2024 showcasing the aerial prowess and static display of Pride of Pakistan JF-17 Thunder Block-III.\nDuring deployment, JF-17 carried out air-to-air refuelling from the PAF Multi Role Tanker Transport (MRTT) aircraft deploying in a single hop to Baku, demonstrating long haul capability and reach of the PAF’s fighter jet.\nPresident Ilham Aliyev visited the static display of JF-17 BLOCK-III and later witnessed its enthralling aerial demonstration, showcasing the agility and maneuverability of the fighter jet alongside the professional competence of PAF pilots.\nThe JF-17 Thunder Block-III is an AESA Radar and Long Range BVR equipped 4.5 generation Multi-Role fighter aircraft which is capable of undertaking wide array of combat missions providing contemporary air power employment options thus strengthening the National Security Paradigm of Azerbaijan.\nPresident Ilham Aliyev said that the support extended by Pakistan would go a long way in consolidating the existing military cooperation, fostering closer defence collaboration and strengthening the warm brotherly ties between the two nations.",
  "retrievedAt": "2025-08-10T21:22:42.702Z"
}
