{
  "title": "Pakistan to expose India through legal diplomacy",
  "author": null,
  "content": "ISLAMABAD, May 23 (APP):Minister of State for Law and Justice, Barrister Aqeel Malik, Friday vowed to expose India globally through legal channels, citing unprovoked aggression and India’s purported inability to control water flows effectively.\nIn an exclusive interview with a local news channel, Barrister Aqeel Malik stated that Pakistan will pursue legal avenues to highlight India’s alleged unprovoked aggression and its claimed inability to manage water resources.\nAqeel Malik emphasized that Pakistan will tackle these issues through a combination of robust legal frameworks and effective diplomatic strategies, ensuring a comprehensive approach to address the concerns.\nBarrister Aqeel stated that Pakistan will dispatch high-level delegate teams, comprising skilled diplomats, to engage with international organizations, including the UN Security Council, to address the issues at hand.\nBarrister Aqeel Malik accused India of state-sponsored terrorism, alleging its support for militant groups in Balochistan, including the TTP and BLA.\nBarrister Aqeel Malik vowed that Pakistan will exhaust all avenues to expose India’s alleged actions and will pursue all available legal measures to bring attention to the matter.\nResponding to a query, Barrister Aqeel Malik elaborated on the Indus water issue, stating that India lacks the necessary infrastructure capability and capacity to effectively control and manage the waters.\nHe alleged that instead of focusing on constructive management, India aims to weaponize water as a tool, potentially exacerbating tensions in the region.\nBarrister Aqeel Malik assured that Pakistan will handle the situation with maturity and through legal means to defuse India’s alleged provocations and bring international attention to the matter.\nRegarding counter-terrorism efforts, Barrister Aqeel Malik stated that Pakistan has accelerated operations against terrorism and expects to yield positive results soon.\nHe emphasized the country’s commitment to combating terrorism, protection of civilians and ensuring national security.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:50:32.045Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-expose-india-through-legal-diplomacy/",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T07:24:00.000Z"
}
