{
  "title": "Govt, nation determined for success in economic field: PM",
  "author": null,
  "content": "ISLAMABAD, May 23 (APP): Prime Minister Muhammad Shehbaz Sharif Friday said after the success of Marka-e-Haq, the government of Pakistan and the whole Pakistani nation was determined for success and historic victory in the economic field.\nHe was speaking during a meeting with a delegation of Presidents of Chambers of Commerce from all across the country.\nHe said the government in collaboration with the private sector and with the grace of Allah Almighty will emerge as a world economic power.\nHe underscored the need for reinvigorating the private sector for achieving self-sufficiency.\nHe said it was foremost priority of the government of Pakistan to protect rights of the business community and provide them a conducive environment for profitable business.\nHe said the government was taking different measures for promotion of small and medium enterprises.\nHe said the government was implementing a policy of easy business to bring down the cost of doing business.\nSteps were being taken to ensure access to easy business loans and to bring cost of electricity down, he added.\nThe prime minister said tax evasion was absolutely unacceptable and all steps would be taken to stop it.\nHe underlined the need for introduction of modern technology in the country’s industries.\nWomen have an important role to play in the economic progress of the country, he remarked.\nHe said the government will extend complete cooperation to the businesswomen in their economic activities so that they could play an active role in the country’s progress.\nThe members of the delegation pay tribute to the prime minister and Pakistan army for their historic win in Marka-e-Haq.\nThey thanked the prime minister for the correct economic policies of the government and gradual improvement in the business conditions.\nThe performance of the stock exchange had gradually improved in the last two years which was reflective of the fact that the government economic policies were moving in the right direction, they added.\nThey reiterated to extend complete cooperation to the government of Pakistan for its steps for the country’s development and for public welfare and well being.\nThe members of the delegation appreciated the reforms undertaken in the Federal Board of Revenue and gave suggestions for making the reforms business friendly.\nThe delegation presented suggestions for budget for the next financial year. The prime minister instructed the finance minister to consider these suggestions.\nFederal Minister for Finance Muhammad Aurangzeb, Minister for Planning and Development Ahsan Iqbal, Minister for Industries Rana Tanvir Hussain, Minister for Commerce Jam Kamal Khan, Minister for Petroleum Ali Pervaiz Malik, Minister for Railways Hanif Abbasi, Minister for Information Technology Shaza Fatima Khawaja, Special Assistant Haroon Akhtar and high ranking officials of relevant departments attended the meeting.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:49:22.310Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-nation-determined-for-success-in-economic-field-pm/",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T15:11:00.000Z"
}
