{
  "title": "‘Independence Day’ of Azerbaijan represents declaration of sovereignty spirit of resilience: Ambassador Farhadov",
  "author": null,
  "content": "ISLAMABAD, May 23 (APP):Ambassador of Azerbaijan to Pakistan Khazar Farhadov on Friday said that ‘Independence Day’ of the Republic of Azerbaijan represents not only the declaration of sovereignty but also the spirit of resilience, sacrifice, and unwavering quest for progress that characterizes the people of Azerbaijan.\nToday “we celebrate the 107th anniversary of our independence, marking the establishment of the Azerbaijan Democratic Republic on May 28, 1918 – first secular republic in the Muslim East.”\nAmbassador of Azerbaijan to Pakistan Khazar Farhadov said this while addressing the celebration of the 107th anniversary of independence of Republic of Azerbaijan, here in a local hotel.\nAzerbaijan envoy said that within a remarkably brief span, Azerbaijan established its first parliament and government, defined its borders, instituted state attributes, and carried out crucial state-building measures.\nHe said that important steps were taken in the field of state building, recognition of the Republic as a subject of international relations, and protection of its national interests.\nThe Azerbaijan Democratic Republic, though it had an existence of only 23 months, played a pivotal role in the formation of democratic traditions and the history of national statehood, and laid a solid foundation for the future independence of the Republic by strengthening the sentiments of freedom and independence, he said.\nAmbassador Farhadov said that the legal successor of the Azerbaijan Democratic Republic, the independent Republic of Azerbaijan restored its independence in 1991 and managed to preserve its sovereignty thanks to Great leader of Azerbaijan, Heydar Aliyev who has made an immense contribution to the people and the state of Azerbaijan.\nThe Ambassador said that Azerbaijan has been implementing the policy of Heydar Aliyev, continuing and enriching it under the leadership of H.E Mr. Ilham Aliyev, the President of the Republic of Azerbaijan.\nThe Islamic Republic of Pakistan was one of the first countries that recognized the independence of the Republic of Azerbaijan on December 12, 1991, he said.\nHe said that the diplomatic relations between the two countries were established on June 9, 1992.\nThe envoy said that from the first day of our independence, “we feel Pakistan’s full support to the Republic of Azerbaijan both in bilateral format and within the framework of international organizations, and during the occupation of Azerbaijani lands by invader Armenia and their liberation by Azerbaijan, and in the post-conflict period.”\nHe said that in 2020, under the leadership of the Supreme Commander-in-Chief of the Azerbaijani Armed Forces, President Ilham Aliyev, Azerbaijan liberated its internationally recognized territories from the almost 30-year long occupation by Armenia, implementing UN Security Council 4 resolutions of 1993, he said.\nThe Ambassador said that to prevent further large-scale provocations by Armenian forces in the Karabakh economic region of Azerbaijan and to restore the constitutional order, the Azerbaijani Army conducted an anti-terror operation on September 19, 2023, which lasted just 23 hours, forcing the enemy to surrender.\nKhazar Farhadov said that this victory fully restored Azerbaijan’s sovereignty, and today, the Azerbaijani flag flies proudly in all territories where Azerbaijani sovereignty is established and and, Azerbaijan has officially declared 2025 as the Year of Constitution and Sovereignty.\nHe said that over the past years, Azerbaijan has successfully chaired several important organizations such as the UN Security Council, the Non-Aligned Movement, the Organization of Turkic States, and many others.\nIn this regard, “I would like to highlight my country’s successful hosting of the COP29 conference, which not only underscored our nation’s growing leadership in global climate action but also provided a vital platform for international cooperation. I am especially pleased to acknowledge the participation of the Islamic Republic of Pakistan, represented by a large and esteemed delegation led by the Prime Minister, Muhammad Shehbaz Sharif that has contributed to climate cooperation between our two brotherly peoples”, the Ambassador said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:49:39.775Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/independence-day-of-azerbaijan-represents-declaration-of-sovereignty-spirit-of-resilience-ambassador-farhadov/",
  "dateList": "2025-05-23",
  "date_published": "2025-05-23T17:12:00.000Z"
}
