{
  "title": "Election Commission to decide polls date: PM",
  "link": "https://www.app.com.pk/national/election-commission-to-decide-polls-date-pm/",
  "date_published": "2023-09-11T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP):Prime Minister Anwaar-ul-Haq Kakar Monday said Election Commission would decide about the date for the upcoming elections.\nIn an interview with a private television, he said Parliament had passed a law according to which Election Commission had the power to announce the date for new elections.\nSpeculation regarding the elections should end as these would be held according to the prevalent law, he said adding, “We have no intention to prolong tenure of the caretaker government.”\nHe said as a student of history of Pakistan, he would express gratitude to Quaid-e-Azam for protecting rights of the Muslim minority and saving it from the domination of majority.\nAfter seeing the attitude of bigger states against the minorities, he said he could see that it would have been difficult to protect the religious and cultural identity of Muslims if Quaid had not secured an independent state for Muslims.\nHe said he admired Quaid-e-Azam for his constitutionalism, all- inclusiveness and for protection of rights of minorities.\nThe prime minister assured that action against smuggling would continue and the writ of the state would be established.\n“We are taking these actions so that the new government with its mandate can easily continue our work for public interest.”\nHe said the apex committee of Special Investment Facilitation Council (SIFC) included current military leadership, thus making the council a strong constitutional and legal body which was taking firm actions and implementing decisions.\nThe caretaker federal and provincial governments had good coordination which was helpful in implementing decisions, he noted.\nHe said the SIFC was focusing on economic revival and on sectors of agriculture and mineral extraction.\nWork would be done on major plans of investment so that they could be at an advanced stage when the next government would take over, he told.\nHe said Pakistan had multifaceted relations with Afghanistan and had regular discussions with it on issues of trade, terrorism, security and regional connectivity.\nBoth sides were talking with the realization that neighbors could not be changed, he added.\nTo a question about rising incidents of terrorism in the country, he said the terrorists had now more latest weapons, night vision goggles and other equipment which had increased their capacity to fight.\nHowever, he made it clear that the terrorists could not take away an inch of territory of Pakistan and the security forces would respond and manage the situation.\nThe state would show its firmness against terrorists as in no condition anyone would be allowed to resort to violence, he stressed.\nPM Kakar said there was no restriction on Pakistan Tehreek i Insaf (PTI) for taking part in the elections.\nTalking about incidents of May 9, he said miscreants resorted to vandalism and arson and the whole incident was reported by the local and international media.\nThe accused involved in the incident would be dealt with according to the law of the land, he continued.\nHe said Nawaz Sharif was thrice elected prime minister and when he would come back to Pakistan he would be treated according to law.\nHe clarified that he had no intention to start meetings with the leadership of political parties.\nTo a question about Pakistan’s foreign policy, he said Pakistan had good relations with all countries, adding China was on the verge of becoming the largest economy of the world and the western world led by US was anxious about it and wanted to contain its influence.\nPakistan had adopted the policy of Look Africa to improve its relations with the continent which had a population of more than a billion people, he informed.\nHe said Saudi Crown Prince Mohammed Bin Salman would visit Pakistan on a mutually agreed time when both sides would be ready to announce projects for investment.\nResponding to a question, he said Kashmir was part of body, soul and collective memory of Pakistan and Kashmiris aligned themselves with Pakistan.\nThe PM said sports including cricket should not be politicized and the issues concerning cricket with India should only be raised by officials of cricket board.\n“We are making Pakistan a secure country for sports. But we cannot force a country to play in Pakistan,” he commented.\nHe said he met with vice chancellors of universities in a meeting during his visit to Quetta and now he would meet with officials of Higher Education Commission to resolve issues facing the education sector with a focused attention.\nHe said the government would soon decide about the issue of giving relief to the electricity consumers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:34:46.485Z"
}
