{
  "title": "Jamal Shah inaugurates exhibition “Portraits of Quaid” at PNCA",
  "link": "https://www.app.com.pk/national/jamal-shah-inaugurates-exhibition-portraits-of-quaid-at-pnca/",
  "date_published": "2023-09-11T15:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): The Caretaker Federal Minister for National Heritage and Culture Jamal Shah on Monday inaugurated a solo exhibition of paintings titled “Portraits of Quaid” to commemorate the 75th death anniversary of Quaid-e-Azam Muhammad Ali Jinnah.\nThe exhibition was organized by Ali Azmat, a renowned artist in collaboration with ForArtSake curated by Amna I Pataudi and Dr. Rahat Naveed Masood here at the Pakistan National Council of the Arts (PNCA).\nAddressing the inaugural ceremony, Jamal Shah paid rich tribute to Quaid-i-Azam Muhammad Ali Jinnah for his vision, untiring hard work, and charismatic leadership to win a separate homeland for the Muslims of the sub-continent.\nThe minister said that Ali Azmat has thematically tried to capture what Quaid-i-Azam Mohammad Ali Jinnah envisioned for Pakistan.\nJamal Shah said “Ali Azmat adds color, aesthetics, and takes up the responsibility to bring clarity and awareness to the larger political landscape of the country. he has accomplished this feat remarkably well in his works. As you walk from one painting to another, you can see how brilliantly Azmat Ali captures the changing expressions of the Quaid’s visage”.\nHe said that the exhibition is a fantastic amalgamation of hyperrealistic paintings and drawings of Muhammad Ali Jinnah.\nThe minister said, today, there was a need for the nation to emulate the Father of Pakistan’s everlasting principles of faith, unity, and discipline to face the current challenges.\nJamal Shah said that the National Heritage and Culture Division and its attached departments would organize more cultural activities including theatre, music, film festivals, and China Pakistan Economic Corridor Cultural Caravan.\nHe praised curator Amna I Pataudi, artist Ali Azmat, and ForArtSake and said “The art can transform you like nothing else”.\nAmna I Pataudi said that for the first time, any artist has become the Federal Minister for Culture and added that Jamal Shah being an artist can better understand the issues of the artist’s community.\nShe said the repertoire of expressions is as rich as the colorful strokes of the artist. His works reflect his love for nature, history, and spirituality, as well as his social commentary on contemporary issues. He uses various mediums and techniques, such as oil, watercolor, acrylic, collage, and mixed media, to create his unique style.\nThe exhibition will remain open for the public till 18th September at the National Art Gallery, PNCA.\nThe show was visited by a large number of people including artists, students, Government officials, press & media, etc.\nStudents also interviewed the artists about their techniques.",
  "retrievedAt": "2025-08-11T09:34:46.405Z"
}
