{
  "title": "Sugar price & availability normalizing after countrywide crackdown against smuggling, hoarding",
  "link": "https://www.app.com.pk/national/sugar-price-availability-normalizing-after-countrywide-crackdown-against-smuggling-hoarding/",
  "date_published": "2023-09-11T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): With the caretaker government launching a massive crackdown and showing ‘zero-tolerance’ towards smuggling and hoarding of essential commodities, the price and availability of sugar were gradually becoming stable and normal.\nIn line with its strategy, the government has also planned prize money (cash reward) for those citizens who would provide information leading to the identification of elements involved in the smuggling and hoarding.\nFor this purpose, a toll-free number has been set up at the Federal Investigation Agency (FIA) and the Ministry of Interior to call and share the required information against the elements involved in illegal activities, causing a dent in the national economy.\nTo stop hoarding the federal and provincial governments have launched operations in different cities, including Lahore, Rawalpindi, Islamabad, Faisalabad, Peshawar, Quetta and Dera Ismail Khan, which resulted in seizure of illegally stocked sugar.\nIn Rawalpindi, the district administration taking strict action against sugar hoarders conducted raids on different illegal warehouses and sealed 13 godowns in Tayyaba Market and Rattaamral, confiscating over 1,000 sugar bags weighing 50 kilograms. The administration also sealed five shops in Dalgaraan and Naswar Bazaars for hoarding sugar.\nIn Peshawar, the district administration recovered 311 tons of sugar bags from godowns on Daraband Road.\nIn Quetta, a major crackdown is underway against the sugar mafia, under which the local administration last night recovered 250 tons of sugar and 750 tons of urea fertilizer in the outskirts of the provincial capital.\nIn Faisalabad, the district administration raided storages of sugar in the revenue limits of the city to check its artificial shortage and sale in black.\nIn Lahore, the Punjab government and sugar mill owners reached an agreement that the commodity would be sold at the rate of Rs 140 per kilogram.\nIn Dera Ismail Khan, the local administration conducted raids on the marked godowns on Daraband Road from where 5,000 bags of sugar were recovered. Similarly, in another raid, 650 bags of hoarded sugar were seized from the Maryali superstore.\nMeanwhile, a spokesperson for the Utility Stores Corporation (USC) told APP that sufficient stocks of sugar were available at a controlled price across the country.\nHe said sugar was available at Rs 147 per kg for general customers and at Rs101 per kg for customers registered under the Benazir Income Support Programme (BISP)\nFederal Minister for Commerce and Industries, Dr Gohar Ejaz said there were two reasons behind the increase in sugar price and shortage including ‘hoarding and smuggling.’\nHe said a team of Punjab government under the leadership of the caretaker Chief Minister called on sugar mill owners and asked them to prevent hoarding and take strict measures against the elements involved in the black marketing.\nGohar Ejaz said due to these decisions of the central and provincial governments, the price of sugar in the market had fallen considerably.\nHe said the federal government had taken strict measures to prevent all cross-border smuggling, which started to leave a positive impact on the market and soon the prices of sugar would further reduce.\nGohra Ejaz said the federal and provincial governments coordinating with the sugar mill owners, mutual measures will soon help bring down the sugar prices.\nHe said the government was taking all possible measures to provide relief to the common man and bring down the inflation.\nTalking to APP, Joint Secretary Ministry of Food Security and Research and Coordinator Sugar Advisory Board, Ejaz Ahmed Bajwa said the previous provincial government of Sindh had announced the prices for the coming year, which were higher than this year.\nHe said the Sugar Advisory Board made recommendations on the price of sugar to the Federal Cabinet, from where the sugar prices were fixed in the Economic Coordination Committee (ECC) of the cabinet after approval.\nMeanwhile, explaining the position of sugar stock to date, he said that sugar production in the year 2022-23 stood at 7.731 MMT and the provincial sugar stock clocked at 2.418 MMT till December 31, 2022.\nBy September 7, he said sugar stock stood at 1.787 MMT, while at the provincial level, the sugar stock in Punjab was 1.164 MMT, 0.457 MMT in Sindh and 0.165 MMT in Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T09:34:52.938Z"
}
