{
  "title": "Pakistan can’t allow misuse of Afghan transit trade agreement: FO",
  "link": "https://www.app.com.pk/national/pakistan-cant-allow-misuse-of-afghan-transit-trade-agreement-fo/",
  "date_published": "2023-09-11T08:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Pakistan on Monday said that for the last several decades, it had facilitated Afghan transit trade and would continue to do so, however, it could not allow the misuse of the agreement.\nThe Foreign Office spokesperson Mumtaz Zahra Baloch, in response to a statement by the Afghan Ministry of Foreign Affairs on the closure of the Pakistan-Afghanistan border at Torkham, said the remarks came as a surprise as the “Interim Afghan authorities know fully well the reasons for the temporary closure of the Pakistan-Afghanistan border at Torkham.\nThe spokesperson said Pakistan could not accept the construction of any structures by the Interim Afghan government inside its territory since those violated its sovereignty.\n“On the 6th of September, instead of a peaceful resolution, Afghan troops resorted to indiscriminate firing, targeting Pakistan military posts, damaging the infrastructure at the Torkham Border Terminal, and putting the lives of both Pakistani and Afghan civilians at risk, when they were stopped from erecting such unlawful structures,” she commented.\nShe said that such unprovoked and indiscriminate firing on Pakistani border posts could not be justified under any circumstances.\nThe spokesperson said that the unprovoked firing by Afghan border security forces invariably emboldened the terrorist elements. These elements are enjoying sanctuaries inside Afghanistan as confirmed by the UN Security Council’s Analytical Support and Sanctions Monitoring Team in its latest report, she added.\nThe spokesperson said that Pakistan had always wished the Afghan border to be a border of peace and amity between the two countries.\n“We have welcomed our Afghan brothers and sisters with open arms for decades. Pakistan has continued to exercise restraint and prioritize dialogue in the face of persistent unwarranted provocations by Afghan troops deployed along the Pakistan-Afghanistan Border,” she remarked.\nThe spokesperson said that the temporary closures took place only in extreme cases such as the incident of September 6, 2023, on the border or when Afghan soil was used to launch terror attacks inside Pakistan.\nShe said the statement of the Afghan Ministry of Foreign Affairs also included some irrelevant comments and unsolicited advice about Pakistan’s economy and foreign trade.\nShe reiterated that Pakistan stood ready to resolve all bilateral issues and concerns through constructive dialogue so that both countries could reap the dividends of economic connectivity and resultant prosperity.\n“We expect the Afghan interim authorities to be mindful of Pakistan’s concerns, respect the territorial integrity of Pakistan and ensure that the Afghan territory is not used as a launching pad for terrorist attacks against Pakistan,” the spokesperson added.",
  "retrievedAt": "2025-08-11T09:35:02.177Z"
}
