{
  "title": "Anti-power theft crackdown: 194 arrested with recovery of Rs 27.251 mln so far",
  "link": "https://www.app.com.pk/national/anti-power-theft-crackdown-194-arrested-with-recovery-of-rs-27-251-mln-so-far/",
  "date_published": "2023-09-11T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): The caretaker government during its ongoing country-wide crackdown against power theft has so far recovered Rs 27.251 million and arrested 194 electricity thieves.\nAs per the Electricity Anti-Theft Campaign Statistics (Progressive) issued by the Ministry of Energy (Power Division) on Monday, some 8.737 million units of electricity theft costing Rs 352.404 has been detected across the country since start of the drive on September 7, with registration of 1,529 first information reports (FIRs).\nAbout 715 cases have been registered against the power thieves by the Lahore Electric Supply Company (LESCO), with arrest of 79 accused and recovery of Rs 10.316 million. Likewise, the Gujranwala Electric Power Company (GEPCO) has got registered 15 cases and held six persons, besides the recovery of Rs 795,000.\nThe Faisalabad Electric Supply Company (FESCO) has also got registered 61 cases of power theft, with the arrest of one accused and recovery of Rs 1.020 million, while the Islamabad Electric Supply Company (IESCO) got registered nine cases against the accused and recovered Rs 1.190 million.\nSimilarly, 556 cases of power theft were got registered by the Multan Electric Power Company (MEPCO, with the arrest of 15 accused and recovery of Rs 8.251 million, while the Peshawar Electric Supply Company (PESCO) got registered 17 cases against electricity thieves, and arrested eight accused with the recovery of Rs 2.225 million.\nThe Hyderabad Electric Supply Company (HESCO) got registered 94 cases and held 26 accused along with recovery of Rs 937,000, while the Sukkur Electric Power Company (SEPCO) got registered 38 cases of power theft with the arrest of 30 accused and recovery of Rs 1.132 million.\nSimilarly, the Quetta Electric Supply Company (QESCO) has got registered 24 cases and arrested 29 accused with the recovery of Rs 665,000, and the Tribal Areas Electric Supply Company (TESCO) managed to recover Rs 720,000.",
  "retrievedAt": "2025-08-11T09:34:49.276Z"
}
