{
  "title": "Net-metering saga: Much ado about the 0.83 per cent - Pakistan - DAWN.COM",
  "author": null,
  "content": "The surge in generation of electricity through a distributed network has been driven by a significant reduction in solar panel prices globally, largely due to a supply glut in China, which is the largest manufacturer of solar panels. A drop in prices led to a surge in demand, and a solar revolution started to take shape, against the backdrop of high electricity prices that were being offered by the grid.\n\nThe availability of low-cost distributed solar generation has been a boon for areas where power supply was either non-existent, unreliable, or scant, particularly in rural areas — while also accelerating a transition from diesel and electricity powered tube wells to solar. A reduction in the cost of solar panels also led to a surge in demand from industrial units, resulting in accelerated installation of solar panels in these establishments. This is turn reduced the average cost of electricity, and inadvertently resulted in a reduction in demand of electricity from the grid.\n\nPer the Seventh Population & Housing Census 2023, the number of households generating electricity from solar panels stood at 2.96 million, almost 88 per cent of them rural households. Only 0.35m urban households were generating electricity from solar. The rural households were effectively off-grid, and embraced solar as the economics made more sense. Effectively, none of these households are affected in any way whatsoever in the recent revision in net-metering regulations, because they are operating behind-the-meter, and effectively consume all electricity that they generate.\n\nAssuming a 20pc growth in the number of households with solar panels, one can estimate 3.55m households to have solar panels installed. Considering how most installations are in rural households, wherein electricity demand is lower, it may be prudent to take an average of 2 kilo Volt (kV) load per household. This results in residential solar capacity in the range of 7,100+ MegaWatts (MW) that continues to operate — again, most of it operating off-grid. This actually alleviates load on the grid, as extending the distribution network over long stretches results in higher losses, and recovery issues. A natural evolution in such a case would be the emergence of micro-grids, as battery capacity becomes more economical.\n\nAs explained above, most solar power generated in Pakistan is distributed, and off-grid. However, there are some consumers that have a net-metering connection from the local electricity distribution company, which we will refer to as “grid” for the sake of brevity. In such a connection, the household consumes the electricity when the sun is shining, and any surplus is then sold to the grid. As the sun sets, the household starts relying on the grid for its electricity requirements, and then sets off consumption during the evening with the surplus production in the morning.\n\nIt is important to understand here that the economic value of any commodity, whether it is a fruit, vegetable, construction material, or even water, or in this case, the electron of electricity, is dependent on demand and supply of the same. As the usage of solar to generate electricity started surging, the demand of electricity from the grid started reducing — particularly between 7am to 2pm when solar generation peaks. As more distributed solar capacity started coming online, it inadvertently lead to an environment where the price of electrons during peak solar hours reduced considerably. The phenomenon is captured by hourly marginal prices of electricity, which are reduced to an average of Rs10 to Rs12 per kilowatt-hour (kWh) during peak solar generation hours.\n\nHence, the economic value of electrons that were being dispatched by households, and other net-metering users during the day, continued to decline. However, against this electron with declining value, such users set-off their day’s production, by effectively buying back the same electrons from the grid at night.\n\nAs the sun sets, the marginal price of an electron increases substantially, because there is no solar, and electricity demand increases. The marginal price of an electron in the evening is in the range of Rs22 to Rs28 per kWh, depending on season, and time of the day. Effectively, the net-metering users effectively benefited by selling cheaper units, to subsidise consumption of more expensive units in purely economic terms.\n\nSuch a phenomenon has been witnessed across the world, leading to a creation of a “duck curve”, wherein demand from the grid reduces during the day with such drop resembling a duck. Utilities across the world have gradually reduced the price of electrons that are produced during the day. This is precisely what is being done here as well.\n\nIt’s also important to understand here that the price of an electron can largely be split into variable, and fixed costs. The fixed costs pertain to the power plants, transmission network, distribution wires, etc — the fixed infrastructure that allows the flow of electrons from the generation site to the consumer. Such fixed costs are also referred to as capacity costs.\n\nThese capacity costs are spread over the number of electrons that are expected to be supplied during a year. Net-metering users, because they are not paying for electricity being consumed during the night that will be set-off against their surplus production during the day, also avoid paying these capacity costs. As they are able to avoid paying the capacity costs, the same are then spread over all other electricity consumers — which is certainly not fair to them all.\n\nEffectively, net-metering users are able to avoid a higher variable cost in the evening, because they are swapping off their cheap electrons with more expensive electrons like a barter trade, and because they avoid paying capacity costs. All such costs that are avoided are effectively socialised to all other consumers of electricity, making electricity more expensive for them. A question that is often asked is, why should such users pay for fixed costs — well, because they rely on the fixed infrastructure for reliability, and effectively use it as a battery. If they don’t want the ability to rely on a connection to consumer electricity at night, they can certainly disconnect.\n\nThe recent changes in net-metering regulations affect only around 283,000 households, from a total of 34 million households that are connected to the grid, effectively making them 0.83pc of total consumers. A geographic split of such users further illustrates that over 70pc of such users are in high-income areas of Karachi, Lahore, Rawalpindi, and Islamabad. This effectively becomes a problem of the rich, who also can make the most noise, relative to the other 99.1pc households in the country. The protected, and vulnerable households are hence subsidising consumption of the 0.83pc in this particular scenario, as the economics of net-metering became lopsided in the last two years.\n\nThe revised net-metering regulations simply suggest that any surplus electricity sold by such net-metered connections will be bought by the grid at a price closer to the grid’s average variable cost of electricity — while these connections can continue to pay the price for electricity in the evening, just like everyone else. Even in such a case, these connections will be better-off, as they can potentially recover the full cost of their solar system in around three years. The return on capital invested in such a case still remains considerably higher than the risk-free rate in the country.\n\nSuch connections also have an option to completely go off the grid, and not even buy electricity from the grid at night. They can certainly buy battery storage capacity, and store electricity for consumption at night, and the same may certainly be viable in a few years. But for now, it is an expensive proposition, and the economics of it all still favours the grid.\n\nBy all means, a revision in net-metering regulations was essential to close the gap in economic value of electrons that were being swapped. In a scenario where there would have been no change, the dispersion would have increased further, resulting in higher electricity costs for the remaining consumers on the grid.\n\nThe future is distributed, with a core supply of baseload. Distributed solar will continue to gain strength, and we will see community, and micro-grids emerging, creating a market for electrons.\n\nAs battery prices reduce — expected to reduce by 50pc by 2030 — we may see more households going completely off-grid. The power infrastructure effectively has a few years to make things efficient, and devolve from a centralised cost-plus pricing model, to a more market-driven competitive model. Inability to do the same may eventually lead to a mass exodus from the grid, risking creation of a stranded asset that no one wants.\n\nSolar is a gift that needs to be leveraged for further growth, and that can be done through better pricing, and prevalence of better economic thought, across the complete value chain of the power infrastructure.\n\nHeader image created with generative AI",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/232357278722a6f.png",
  "retrievedAt": "2025-08-25T15:24:59.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899873/net-metering-saga-much-ado-about-the-083-per-cent",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T06:37:46.000Z"
}
