{
  "title": "Zulfikar Ali Bhutto posthumously awarded top civilian honour - Pakistan - DAWN.COM",
  "author": null,
  "content": "• President Zardari confers civil awards on 69 recipients\n• Military honours awarded to army, navy, PAF officers and personnel\n\nISLAMABAD: President Asif Ali Zardari on Sunday conferred civil awards on 69 personalities, including former prime minister Zulfikar Ali Bhutto, in recognition of their outstanding contributions in various fields.\n\nThe investiture ceremony, held at Aiwan-i-Sadr, honoured Pakistani nationals and foreign dignitaries for their achievements in health, education, literature, journalism, public service, research, diplomacy and the economy.\n\nThe event was attended by federal ministers, Senate chairman, parliamentarians, diplomats, media representatives and members of civil society.\n\nZAB awarded posthumously\n\nAmong the awardees, Mr Bhutto, former prime minister and founder of the PPP, was posthumously conferred with Nishan-i-Pakistan, the country’s highest civilian honour.\n\nThe award, received by Sanam Bhutto, was given in recognition of Mr Bhutto’s services to the country, democracy and people.\n\nMr Bhutto was executed on April 4, 1979, after being convicted in a controversial murder case, widely criticised for lacking due process. He was buried at his family mausoleum in Garhi Khuda Baksh.\n\nIn March last year, the Supreme Court acknowledged that Mr Bhutto’s trial was unfair and deprived of due process at both the trial and appellate levels, correcting what was seen as a historic miscarriage of justice.\n\nOther recipients\n\nThe other recipients who were conferred upon with awards in different categories included retired Air Marshal Raja Shahid Hamid Nishan-i-Imtiaz (posthumous), Sultan Ali Akbar Allana Nishan-i-Khidmat, SP Muhammad Ejaz Khan Hilal-i-Shujaat (posthumous), DSP Allama Iqbal Hilal-i-Shujaat (posthumous), DSP Sardar Hussain Shaheed, constables Irshad Ali and Jahanzaib Hilal-i-Shujaat (posthumous), Additional SHO Adnan Afridi Shaheed Hilal-i-Shujaat (posthumous), SI Taimoor Shahzad Shaheed Hilal-i-Shujaat (posthumous), Sepoy Muhammad Asif Shaheed Hilal-i-Shujaat (posthumous), Allah Rakhio (late) Hilal-i-Shujaat (posthumous), Dr Tauqir Hussain Shah Hilal-i-Imtiaz, retired Capt Khurram Agha Hilal-i-Imtiaz, Ali Haider Gilani Hilal-i-Imtiaz, Khawaja Anver Majid Hilal-i-Imtiaz, Hussain Daud Hilal-i-Imtiaz, Professor Dr Shaheryar Hilal-i-Imtiaz, Dr Zaryab Setna Hilal-i-Imtiaz, Javed Jabbar Hilal-i-Imtiaz, Mohtarma Sadia Rashid Hilal-i-Imtiaz, Aamir Hafeez Ibrahim Hilal-i-Imtiaz, Jimmy Engineer Hilal-i-Imtiaz, Umar Farooq Hilal-i-Imtiaz, Dr Naveed Shirwani Hilal-i-Imtiaz, Capt. (retd) Hamza Anjum Shaheed Sitara-i-Shujaat (posthumous), Malik Sabz Ali Shaheed Sitara-i-Shujaat (posthumous), Muham­mad Samiur Rehman Sitara-i-Imtiaz, Ahmad Ishaq Jahangir Sitara-i-Imtiaz, Dr Ghulam Muhammad Ali Sitara-i-Imtiaz, Irfan Nawaz Mamon Sitara-i-Imtiaz, Sardar Muhammad Aftab Ahmed Khan Watoo Sitara-i-Imtiaz, Dr Hamid Ateeq Sarwar Hilal-i-Imtiaz, Ali Salman Habib (late) Sitara-i-Imtiaz (posthumous), Waqarud din Syed Sitara-i-Imtiaz, Ayaz Khan Sitara-i-Imtiaz, Professor Dr Ziaul Haq Sitara-i-Imtiaz, Imtiaz Hussain Sitara-i-Imtiaz, Jameel Ahmad Sitara-i-Imtiaz, Syed Azhar Hasnain Abidi Sitara-i-Imtiaz, Zafar Waqar Taj Sitara-i-Imtiaz, Muhammad Hussain alias Murad Sadpara (Late) Sitara-i-Imtiaz (posthumous), Bahrose Hussain Baloch Sitara-i-Imtiaz, Sana Hashwani and Safinaz Muneer Sitara-i-Imtiaz, Naveed Ahmad Fareed Presidential Pride of Performance Award, Rashid Waheed Khawaja Presidential Pride of Performance Award, Mohtarma Aniqa Bano Presidential Pride of Performance Award, Barkat Shah Presidential Pride of Performance Award, Haydar Qurbonov Sitara-i-Quaid-i-Azam, Dr Christine Brunhilde Sitara-i-Quaid-i-Azam, Agostino Da Polenza Tamgha-i-Pakistan, Professor Valevia Piacentini Tamgha-i-Pakistan, Syed Shakeel Shah Tamgha-i-Imtiaz, Ashhad Jawwad Tamgha-i-Imtiaz, Amin Muhammad Lakhani Tamgha-i-Imtiaz, Rehan Mahtab Chawla Tamgha-i-Imtiaz, Syed Jawad Hussain Jafferi Tamgha-i-Imtiaz, Professor Dr Usman Qamar Tamgha-i-Imtiaz, Mohtarma Dr Sara Qureshi Tamgha-i-Imtiaz, Dr Ikram Ullah Tamgha-i-Imtiaz, Muhammad Yousaf Khan Tamgha-i-Imtiaz, Sarwar Muneer Rao Tamgha-i-Imtiaz, Hassan Ayub Tamgha-i-Imtiaz, Dr Syed Abid Mehdi Kazmi Tamgha-i-Imtiaz, Mir Nadir Khan Magsi Tamgha-i-Imtiaz, and Dr Xinmin Liu Tamgha-i-Quaid-e-Azam.\n\nMilitary awards\n\nPresident Zardari also conferred military awards to the officers and soldiers of Pakistan Army, Navy and Air Force on Sunday.\n\nTwo Sitara-i-Basalat, 227 Tamgha-i-Basalat, 82 Imtiazi Asnad, 185 COAS Commendation Cards, 23 Hilal-i-Imtiaz (Military), 112 Sitara-i-Imtiaz (Military) and 133 Tamgha-i-Imtiaz (Military) have been awarded, the military’s media wing, Inter-Services Public Relations, said in a statement.\n\nPublished in Dawn, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/24101534d2622fb.jpg",
  "retrievedAt": "2025-08-25T15:25:28.170Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899962/zulfikar-ali-bhutto-posthumously-awarded-top-civilian-honour",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:23.000Z"
}
