{
  "title": "FIA arrests four with fake passports, visas at Sialkot airport - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: The immigration authorities of the Federal Investigation Agency (FIA) arrested four people for possessing fake German passports and fake Canadian visas after they were offloaded from different flights at Sialkot International Airport.\n\nAn FIA official said that during immigration clearance of flight G9-553, Waqar Ahmad of Khushab, Sana Ullah of Sargodha and Javed Iqbal of Sargodha were caught before they could depart for Doha. During scrutiny and profiling, they were caught carrying eight fake German passports and eight fake Schengen visas.\n\nThey revealed that they had dealt with agents - Adnan of Sahiwal and Ali of Sialkot - for Rs3 million and Rs5 million.\n\nSimilarly, during immigration clearance of flight FZ-338, Rashid Ali of Sialkot was departing for Baku. A fake Canadian visa sticker was found removed from his passport. Moreover, a search of his mobile phone revealed five fake Canadian visa stickers belonging to other intending immigrants, screenshots, passports, tickets, payment receipts, visa-related chats, and voice messages. He revealed that Rana Afzal of Wazirabad had charged him Rs4 million and Rs6 million for each of the five other intending immigrants to send them to Canada via Baku, Azerbaijan.\n\nThe suspects were handed over to the anti-human trafficking cell in Gujranwala for further necessary action.\n\nAlso, the FIA Gujranwala zone arrested four human traffickers. An FIA official said Muhammad Iftikhar of Bin Qasim, Malir, was arrested for extorting Rs4.3 million from the complainant, promising to secure employment visas for Dubai, America and Canada for him and his cousins. However, he failed to fulfill this commitment and refused to return the amount.\n\nAsif Hussain of Gujranwala was arrested for extorting Rs700,000 from the complainant for sending him to Dubai for employment but failed to fulfill his commitment.\n\nSarfraz Ahmad, alias Safdar, of Sambrial, was arrested for extorting Rs4.05 million from complainant Zohain Akhtar, promising to send him to Italy for employment. Instead, the suspect sent him to Libya and forced him to board a boat, but the complainant refused and returned to Pakistan.\n\nPublished in Dawn, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:09:04.268Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899924/fia-arrests-four-with-fake-passports-visas-at-sialkot-airport",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:54.000Z"
}
