{
  "title": "IHC summons Islamabad IG over disappearance of journalist Ahmad Noorani’s brothers - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Islamabad High Court (IHC) on Monday summoned the Islamabad Inspector General of Police (IGP) during a hearing on a plea filed by journalist Ahmad Noorani’s mother for the recovery of his two brothers.\n\nThe US-based Noorani, who works for a news outlet called FactFocus, recently published an investigative report regarding a serving high-ranking military official and his relatives.\n\nNoorani’s two brothers, Muhammad Saifur Rehman Haider and Muhammad Ali, went missing from their residence in the early hours of Wednesday.\n\nNoorani’s mother Amina Bashir had filed a plea with the IHC for the recovery of his two brothers.\n\nShe said that her two sons were “forcibly disappeared” from their Islamabad home at 1:05am by “unknown officials ostensibly belonging” to the country’s intelligence agencies. “It is quite clear that his brothers have been subjected to enforced disappearance as a clear reprisal aimed at silencing Noorani’s journalism,” the petition said.\n\nThe petition cited the government, Ministry of Defence, Islamabad IGP, and station house officer (SHO) of Noon Police Station as respondents in the case.\n\nOn Saturday, the IHC ordered the SHO to submit a detailed report on the disappearance. Meanwhile, Advocate Imaan Hazir Mazari, representing the petitioner, criticised authorities for not registering an FIR despite three days passing since the incident.\n\nDuring today’s hearing, Justice Raja Inam Ameen Minhas expressed his dissatisfaction with the SHO’s report and summoned the Islamabad IGP on March 26.\n\nAdvocate Imaan Hazir Mazari, representing the petitioner, appeared before the court along with Noorani’s mother and sister.\n\nThe mother broke out in tears during the proceedings. She said, “Will the high court be responsible if something happens to my children?”\n\nThe SHO submitted his report to the court. He said, “We have been using all available sources,” adding that the police had carried out geofencing, looked into call detail records and checked the cameras near the house.\n\nJustice Minhas told the police officer that he should have presented his findings but he did not.\n\nThe lawyer for the Islamabad police said that there was no application to register a case.\n\n“We are not discussing that right now,” the judge retorted, adding that there was an alternative forum for that purpose.\n\nMazari asked that if the police had not filed a report for five days, then how were they conducting the investigation.\n\nJudge Minhas responded, “I am calling the IGP. He will conduct an investigation.”\n\nMazari claimed that it had been six days since the incident but the police had not done anything yet.\n\n“I can only order as per my authority,” the judge remarked.\n\nMazari said that the intelligence agencies were to be blamed in this case. She alleged that Noorani’s brothers were kidnapped because of his recent reporting.\n\nJustice Minhas observed that he would not pass any order which could not be implemented.\n\nMazari requested the judge to adjourn the case until today or tomorrow. The court adjourned the hearing of the case until March 26.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:24:58.652Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900026/ihc-summons-islamabad-ig-over-disappearance-of-journalist-ahmad-nooranis-brothers",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T09:14:51.000Z"
}
