{
  "title": "Finance: Challenges to industrial growth - Newspaper - DAWN.COM",
  "author": null,
  "content": "During the last quarter of this fiscal year, beginning April 1, Pakistan’s industrial sector may see a stronger policy push for growth as the current regime is working on an industrial revival plan.\n\nTwo things are to be considered: first, the potential revival plan’s implementation will remain subject to the continuation of the tenous political stability, the extent of success in the anti-terrorism campaign and the International Monetary Fund’s approval for support for industries.\n\nSecond, even if all goes well, the industrial sector, particularly large-scale manufacturing (LSM), will respond to the policy push with a considerable time lag, and exports, too, will take time to capitalise on it.\n\nThis means that the current fiscal year will end on a disappointing note for LSM, and the growth of goods exports will also be limited. This may keep economic growth on the lower side of the State Bank of Pakistan’s projected range of 2.5-3.5 per cent and the initial target of 3.6pc set by the current regime.\n\nSo, there is apparently no immediate relief in sight for tens of millions of unemployed people. Slower growth in exports, meanwhile, would allow further expansion in the trade deficit, taking a toll on the current account and challenging the exchange rate stability.\n\nEvery successive government comes up with new policies, sometimes under political considerations and often due to misguided, ill-informed inputs from the bureaucracy\n\nBesides, the ever-rising reliance on food exports and enhanced pressure on the exchange rate would not only push food inflation further up, but higher food inflation plus imported inflation would rebuild inflationary pressures.\n\nFood exports now boast a 23.4pc share in overall goods exports ($5.173 billion during July-Jan FY25 against total goods export earnings of $22.074bn). The national average consumer inflation of 1.5pc, as seen in February, points to the possibility that inflation has bottomed out, and the above analysis indicates it may not remain stable in a narrow range.\n\nThe cumulative output of LSM shrank 1.78pc during July-January FY25, compared with the same period of the last fiscal year, according to the Pakistan Bureau of Statistics. (Output in January 2025 alone fell 1.22pc compared to January 2024).\n\nThis decline in LSM output in the first seven months of FY25 follows a modest 2.42pc expansion in the whole of FY24. That is to say, the current declining trend is not because of a high base effect and reflects an effective squeeze in production.\n\nThe target for LSM growth set at 4.4pc for FY25 now seems unattainable, though a much lower growth of 1pc-1.5pc can be achieved\n\nThe target for LSM growth during this fiscal year was set at 4.4pc, but it seems that actual growth will be nowhere close to it, though a much lower growth of 1pc-1.5pc can be achieved. However, that, too, remains subject to political stability, success in the ongoing fight against terrorism in Khyber Pakhtunkhwa and Balochistan and improvement in overall governance across the country.\n\nThe list of industries that experienced net decline in the seven months of FY25 includes such important ones as food, chemicals, cement, iron and steel, and machinery and equipment. Even the industries that posted some growth didn’t see a massive rise in output, except for automobiles and tobacco. Heavyweight textiles, for example, posted a paltry 2.08pc rise in production, the petroleum sector 2.47pc, the leather industry 0.72pc and fertilisers — just 0.65pc in July-January FY25.\n\nPakistan’s LSM sector suffers from some key structural weaknesses, and its productivity cannot be enhanced substantially even in the next fiscal year if those weaknesses are not addressed effectively. Key weaknesses include the country’s low productivity per worker and low value addition.\n\nFrom 2000 to 2020, Pakistan’s average labour productivity growth rate was 1.5pc, compared with 3.9pc in Bangla­desh, 5.7pc in India and 8.5pc in China, according to an International Labour Organisation report. Another report by the Pakistan Institute of Development Economics reveals that Pakistan’s value added per worker grew to an average annual rate of just 0.9pc during the past two decades, much lower than 2.5pc in comparable countries.\n\nLow investment in technology and workers’ training and upskilling, poor law and order situation, and lack of modern work culture in many industries are some obvious causes, but the government and the private sector must work together to dig deeper with the spirit of accepting responsibility and not blame shifting.\n\nIntermittent energy crises and high energy costs also keep industrial growth compromised. Business lobbies often complain that effective energy prices in Pakistan are several times higher than the energy prices in comparable countries. The root cause of this lies in the inefficiency of power distribution companies, mostly in the hands of the government, and in circular debt created due to impractical power-sharing agreements with independent power projects (IPPs).\n\nThe government must accept the responsibility for this structural problem of our industrial sector and crackdown on large, powerful, and well-connected power thieves and defaulters of power bills.\n\nPolicy inconsistency is yet another structural issue plaguing the quality growth of industries in Pakistan. Every successive government comes up with new policies, sometimes under political considerations and often due to misguided, ill-informed inputs from the bureaucracy.\n\nPublished in Dawn, The Business and Finance Weekly, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:09:24.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899712",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:30.000Z"
}
