{
  "title": "Unsuccessful Olympic bid water under the bridge, insists Coe - Sport - DAWN.COM",
  "author": null,
  "content": "NANJING: World Athletics president Sebastian Coe insisted on Sunday that his unsuccessful challenge to succeed Thomas Bach as head of the International Olympic Committee was water under the bridge.\n\nCoe had to be content with third place in the vote for the new IOC president in Greece this week.\n\nKirsty Coventry, a former Olympic gold medal-winning swimmer for Zimbabwe, won in the first round of voting with 49 of the 97 votes cast from IOC members to become the first African and the first woman to hold the post.\n\nIOC veteran Juan Antonio Samaranch Jr received 28 votes, while Coe, twice Olympic 1500m champion for Britain, received just eight.\n\nAsked whether he categorised his defeat as humiliating, Coe was adamant that that was not the case and that he was very much back to the day job.\n\n“No, I mean, I don’t think like that,” he told AFP on the sidelines of the world indoor championships in Nanjing.\n\n“I’m here. This is the centrepiece of Olympic sport and I’ve got a job to do.\n\n“The world goes on. I offered a vision, which I stand by, I’m very happy to have done.\n\n“I thought I could make a contribution, but that’s not going to be the way.”\n\nCoe said it was now a question of bouncing back from the disappointment of the vote in the Greek coastal resort of Costa Navarino and into the final two years of his mandate as World Athletics president.\n\n“That’s exactly what I’ve done. I flew from Greece last night and I’m here, and I’ve got a big job,” he said.\n\n“All the candidates presented very different views and visions and, you know, I’m not going to go back through all that again, that’s done. But it’s on the record.”\n\nCoe added: “The broader point is I’m here as president of the centrepiece Olympic sport. I remain an IOC member by virtue of my status here, which, to me, is very important. We will continue to be really good partners of the movement and, by implication, supportive of whoever is president, which we will be.”\n\nCoe, 68, vowed to use his remaining two years as head of track and field’s governing body “to continue to do what we’re absolutely committed to”.\n\n“Growing the sport, maintaining good governance, maintaining the really important democratic mandate of all our member federations and a council that will remain challenging and engaged. We continue to do that. Commercial program­mes are going extremely well and we are committed to all the things that we’re doing,” Coe told AFP.\n\nWorld Athletics’ presence in Nanjing for the world indoors was “huge”, Coe added in reference to the start of the body’s Asian swing over the coming seasons.\n\n“This is the first of three major Chinese cities that are hosting our events,” with Beijing the venue for the world outdoor championships in 2027 after having last hosted them in 2015.\n\nYangzhou will welcome the world road running champs in 2027 and Guangzhou is home to the 2025 world relays in May.\n\n“And, of course, Tokyo, in barely a few months, is going to be hosting our centrepiece event in a stadium with people,” he said in reference to the 2025 world outdoor championships in the Japanese capital. Asia is hugely important to us.“\n\nPublished in Dawn, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/241059286ee04a7.jpg",
  "retrievedAt": "2025-10-12T02:09:06.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899955/unsuccessful-olympic-bid-water-under-the-bridge-insists-coe",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:34.000Z"
}
