{
  "title": "Agriculture: A directionless agriculture sector - Newspaper - DAWN.COM",
  "author": null,
  "content": "Has Pakistan’s agriculture sector — particularly its two major crops, wheat and cotton — attained a level of crop yields that allows it to compete globally without government subsidies or market intervention? The government seems to believe so, as reflected in its recent policies. But is this confidence well-founded, or a miscalculation that could jeopardise the backbone of the nation’s economy?\n\nFor decades, policymakers have placed unwavering emphasis on wheat and cotton as cornerstones of national food security and economic growth, respectively. This approach paid dividends: Pakistan achieved near self-sufficiency in wheat (even generated an export surplus in some years), despite rapid population growth. Likewise, Pakistan remained a net exporter of cotton after meeting the demand of its vast textile and garment industry — the country’s largest export contributor.\n\nHowever, Pakistan’s agriculture sector has failed to keep pace with global advancements in crop yields. Per-acre yields of most crops remained significantly lower than those of regional and international competitors due to deep-rooted structural deficiencies, including inadequate investment in research and development, an ineffective agricultural extension system, limited availability of high-yielding seeds, and weak pesticide and seed regulations. Adding to these woes, in recent years, climate change has exacerbated crop production risks — particularly of cotton — leading to erratic yields.\n\nMeanwhile, the government has been under mounting pressure from international lenders to improve its fiscal discipline and rationalise public expenditures. As a result, the ruling PML-N government — already infamous for anti-farmer policies — has cut agricultural subsidies and scrapped support (intervention) prices for wheat, cotton, and sugarcane.\n\nAn end to government subsidies paired with importing value-added goods is pushing farmers to switch towards low value-added crops\n\nThese measures have left the sector struggling for survival due to higher production costs and lower yields.\n\nGlobally, developing countries subsidise their agriculture until crop yields become competitive. In contrast, Pakistan appears to have abandoned its support mechanism prematurely. The consequences are already evident.\n\nWith dwindling profitability, many farmers (who had the option) have shifted to alternative crops, disregarding the country’s long-standing strategic agricultural objectives. Wheat acreage has shrunk by seven per cent this year, while cotton output has plummeted to just 5.5 million bales — a 34pc decline from the previous year.\n\nHowever, globalisation and advancements in communications and trade logistics have reshaped food security and raw material supply chains. The ease of importing wheat and cotton within six weeks from virtually anywhere in the world has challenged traditional notions of food security and self-sufficiency. This globalisation has also transformed government, consumer, and industry behaviour.\n\nLast year, despite sufficient local stocks, wheat was imported in large quantities to keep domestic prices close to international prices. This year, Pakistan’s spinners and textile mills increasingly favoured imported cotton and yarn due to better quality, competitive pricing, and exemption from the 18pc sales tax applied to local alternatives. These trends have fuelled growing pressure on the government to let market forces dictate agricultural outcomes, abandoning decades-old interventionist policies.\n\nAt first glance, this transition — where farmers prioritise high-margin crops (if agro-climatic conditions, water availability, and other factors allow) and consumers pay market-driven prices (if mafias do not step in) — may appear to be a natural economic evolution. However, such an unrestricted and directionless approach to agricultural crops poses multiple risks for the country.\n\nFirst, in recent years, farmers have shifted from cotton to rice, maize, and sesame. While this has led to a rise in exports, much of the maize and sesame are exported as raw commodities. Even in rice, value addition remains low. In short, Pakistan is gradually shifting from high-value-added crops to low-value-added ones.\n\nSecond, if crop yields continue to lag — burdened by high production costs — Pakistan risks losing competitiveness in maize, sesame and other crops as well in a few years. Eventually, rice may remain the country’s only viable agricultural export, as many countries are moving away from water-intensive crops to conserve water for future generations. Yet, Pakistan touts its rise in rice exports from $2-4 billion as a monumental achievement, failing to recognise the long-term vulnerabilities of this strategy.\n\nThird, frequent crop switching by farmers creates uncertainty that discourages investment in value-added industries and allied businesses. Without policy clarity, even the government cannot improve value chains, develop the necessary infrastructure, invest in research and development, or strengthen human and institutional capacity.\n\nFourth, the agriculture sector provides direct and indirect employment opportunities to over 60pc of Pakistan’s population. With the manufacturing sector experiencing negative growth, the government has no choice but to promote agriculture to absorb the 3m young people entering the job market annually.\n\nFifth, excessive reliance on market forces and unrestricted commodity imports is putting intense pressure on already strained foreign exchange reserves. While occasional imports may be necessary, making them a permanent policy feature is unsustainable.\n\nIn conclusion, an unplanned and directionless approach with no predictable outcome will constrain the agriculture sector’s long-term productivity and growth while hindering the optimal use of vital resources like land and water.\n\nThe government must define a clear agricultural growth strategy with a list of priority crops that align with national development objectives and recent climate change realities and, in turn, support them through consistent policy and market interventions — rather than short-term incentives.\n\nKhalid Wattoo is a farmer and a development professional, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad\n\nPublished in Dawn, The Business and Finance Weekly, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67df32a58727c.jpg",
  "retrievedAt": "2025-08-25T15:25:00.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899711",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:30.000Z"
}
