{
  "title": "South Africa envoy to US back home to a raucous welcome - World - DAWN.COM",
  "author": null,
  "content": "CAPE TOWN: The South African ambassador who was expelled from the United States in a row with President Donald Trump’s government arrived home on Sunday to a raucous welcome and struck a defiant tone over the decision.\n\nTies between Washington and Pretoria have slumped since Trump cut financial aid to South Africa over what he alleges is its anti-white land policy, its genocide case against Israel at the International Court of Justice (ICJ) and other foreign policy clashes.\n\n“It was not our choice to come home, but we come home with no regrets,” expelled ambassador Ebrahim Rasool said in Cape Town after he was ousted from Washington on accusations of being “a race-baiting politician” who hates Trump.\n\nUS Secretary of State Marco Rubio said last week Rasool was expelled after he described Trump’s Make America Great Again movement as a supremacist reaction to diversity in the United States.\n\nRasool was greeted with cheers and applause from hundreds of placard-waving supporters mostly clad in the green and yellow of the ruling African National Congress party at Cape Town International Airport.\n\n“I want to say that we would have liked to come back with a welcome like this if we could report to you that we had turned away the lies of a white genocide in South Africa, but we did not succeed in America with that,” he said with a megaphone after a more than 30-hour trip via Qatari capital Doha.\n\nThe former anti-apartheid campaigner defended his remarks about Trump’s policies, saying he had intended to analyse a political phenomenon and warn South Africans that the “old way of doing business with the US was not going to work”.\n\n“Our language must change not only to transactionality but also a language that can penetrate a group that has clearly identified a fringe white community in South Africa as their constituency,” he said.\n\n“The fact that what I said caught the attention of the president and the secretary of state and moved them enough to declare me persona non grata says that the message went to the highest office,” he added.\n\n‘Badge of dignity’\n\nSouth Africa, the current president of the Group of 20 leading economies, this week said it considered improving its relationship with the United States a priority.\n\nThe United States is South Africa’s second-biggest trading partner and will take over the rotating G20 presidency next year. Rasool is due to provide a report to President Cyril Rama­phosa on Monday. Pretoria should nonetheless not try to mend its ties with Washington “without sacrificing our values”, Rasool said. “The declaration of persona non grata is meant to humiliate you, but when you return to a crowd like this… I will wear my persona non grata as a badge of dignity, our values and that we have done the right thing,” he said.\n\nTrump froze US aid to South Africa in February, citing a law in the country that he alleges allows land to be seized from white farmers.\n\nRelations have also been strained by South Africa’s case against US ally Israel at the ICJ. Pretoria alleges Israel has committed genocidal acts against the Palestinians in its offensive in the Gaza Strip.\n\nPublished in Dawn, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e0ba72e4dd0.gif",
  "retrievedAt": "2025-08-25T15:25:16.834Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899972/south-africa-envoy-to-us-back-home-to-a-raucous-welcome",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:42.000Z"
}
