{
  "title": "Court sentences 2 men to death for killing woman of their family in Toba Tek Singh - Pakistan - DAWN.COM",
  "author": null,
  "content": "An additional sessions judge in Toba Tek Singh on Monday sentenced to death two men involved in murdering a woman in their family.\n\nMaria Bibi was murdered by her father Abdul Sattar and brother Faisal at Chak 477-JB Allowal on March 17, 2024. Her body was exhumed for autopsy on March 28 after a video of the crime went viral on social media and received large-scale outcry.\n\nThe main accused, Faisal, had confessed to the killing on camera, recorded by media persons while he was in police custody on March 31, a day after his arrest. He said that that he had raped and strangled his sister to cover up an incestuous relationship with her. However, a DNA report had shown that the girl was neither raped nor was she pregnant as it was earlier alleged.\n\nThe police had subsequently mentioned in the first information report (FIR) and challan of the case that the girl was murdered by her father and brother in the name of honour and the FIR previously registered under Sections 34 (common intention), 201 (causing disappearance of evidence of offence, or giving false information to screen offender) and 302 (murder) of the Pakistan Penal Code (PPC) had been amended and Section 311 (honour killing) had also been inducted in it.\n\nFaisal’s brother Shahbaz and his wife Sumaira were also arrested in a separate case on the charge of hiding the murder from police. They had told the police that Maria had informed them a day before her killing that Faisal and their father had raped her. Shahbaz had claimed that he had secretly made a video of the murder by pretending to be talking to his other sister, Kausar, on the phone.\n\nAdditional Sessions Judge Abdul Hafeez Bhutta presided over a hearing for the case today and delivered his verdict.\n\nA short order, a copy of which is available with Dawn.com, said Shahbaz and Sumaira were acquitted by extending the benefit of the doubt to them and ordered the former’s release with the latter already on bail.\n\n“The prosecution has successfully proved its case against accused persons Muhammad Faisal and Abdul Sattar beyond reasonable doubt. Therefore, I convict accused Muhammad Faisal under Section 302(b) PPC and sentenced him to death as tazir for committing the murder of Maria Bibi.\n\n“I also convict accused Abdul Sattar under Section 302(b) PPC read with 34 PPC and sentenced him to death as tazir for his shared common intention in the murder of Maria Bibi. They be hanged by their necks till they are dead,” the order reads, adding that the sentence was subject to the Lahore High Court’s (LHC) confirmation.\n\nIt also ordered them to pay compensation of Rs10,000,000 each to Maria’s legal heirs under Section 544A of the Criminal Procedure Code, to be recovered as arrears of land revenue.\n\nIt added that they would undergo six months of simple imprisonment in case of non-payment. The order directed that the convicts be sent back to the district jail for commitment warrants for the execution of the sentence awarded to them and that the case record be forwarded to the LHC to confirm the death sentence.\n\nIt lastly said that the convicts could appeal against the verdict within 30 days.\n\nA statement by the office of Punjab Prosecutor General Syed Farhad Ali Shah explained how the authorities had taken quick notice of the case and assigned it high priority to see it to sentencing.\n\n“It is the responsibility of the prosecution to bring the accused to justice which the prosecutors of Punjab are doing well by utilising all their capabilities,” Shah was quoted as saying.\n\nTalking to Dawn.com, he said the results of the high-profile cell set up by him were coming to fruition, adding that the prosecution office monitored a case at every stage from its registration to the verdict.\n\n“The investigation was completed under the Anti-Rape Act. Sentences are being handed down in the cases after full implementation of the Anti-Rape Act rules. The verdict in the Maria murder case is proof that the high-profile cell of the Punjab Prosecutor General Office is fully active,” he said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:24:54.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900063/court-sentences-2-men-to-death-for-killing-woman-of-their-family-in-toba-tek-singh",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T13:40:45.000Z"
}
