{
  "title": "Top seeds Zverev, Sabalenka advance at Miami Open - Sport - DAWN.COM",
  "author": null,
  "content": "MIAMI: World number one Aryna Sabalenka reached the last 16 at the Miami Open when Elena-Gabriela Ruse retired injured on Saturday, while men’s top seed Alexander Zverev beat Jacob Fearnley 6-2, 6-4 to reach the third round.\n\nSabalenka, who arrived in Miami fresh off a defeat in last week’s Indian Wells final, wrapped up the first set 6-1 before Romanian Ruse was forced to retire with a right thigh injury.\n\nUp next for three-times Grand Slam champion Sabalenka will be American defending Miami champion Danielle Collins, who beat Swiss qualifier Rebeka Masarova 6-4, 3-6, 6-3.\n\nFormer world number one Naomi Osaka prevailed 7-6(6), 3-6, 6-4 against American wildcard Hailey Baptiste and will play Italian sixth seed Jasmine Paolini, who advanced when Ons Jabeur retired with a left leg injury while trailing 4-3 in the first set.\n\nThird seed Coco Gauff also progressed with a 6-2, 6-4 win over Greece’s Maria Sakkari while Olympic champion Zheng Qinwen advanced with a 6-1, 7-6(3) win over Taylor Townsend.\n\nLocal hope Ashlyn Krueger stunned 26th seed and former US Open runner-up Leylah Fernandez to set up a meeting with Zheng.\n\nOn the men’s side, Zverev looked comfortable against British qualifier Fearnley as the German mixed a solid serve with dominance from the baseline while saving the only two break points he faced during the 74-minute match.\n\nFor Zverev, who lost at the first hurdle in Indian Wells, the win gave him a German record 145th Masters 1000 win, one more than Tommy Haas. He now faces Australia’s Jordan Thompson.\n\n“Happy to kind of have improved a few things from Indian Wells where I didn’t feel well on the court. I didn’t feel like I played good,” Zverev told reporters. “Hopefully this is just the first of many matches for me here and I can continue playing well.”\n\nIndian Wells champion Jack Draper crashed out 7-6(2), 7-6(3) to Czech Jakub Mensik.\n\nThe match was temporarily suspended when a large crowd of Brazilian spectators, who were waiting to watch Joao Fonseca’s clash with Ugo Humbert due next at the same venue, expressed their anger when that match was shifted to the main stadium.\n\nThe fans, some of whom had waited for hours at Grandstand, booed as they left the venue, but were delighted when Fonseca later got past Humbert 6-4, 6-3.\n\n“I really liked the decision, because I already played my first round there, so I knew how the court was, the atmosphere,” said the 18-year-old Fonseca.\n\n“I knew there was going to be a lot of Brazilians. The crowd is super nice. It’s an honour seeing a lot of them cheering for me, saying my name every match I win.”\n\nReilly Opelka rallied to beat Danish 11th seed Holger Rune 4-6, 6-3, 7-6(5) and with Draper, Carlos Alcaraz and Daniil Medvedev all losing this week there are no Indian Wells semi-finalists left in the men’s draw at Miami.\n\nHong Kong wildcard Coleman Wong stunned 13th seed Ben Shelton 7-6(3), 2-6, 7-6(5) to advance, while Canada’s Denis Shapovalov and American third seed Taylor Fritz also won and will meet in the third round.\n\nPublished in Dawn, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e0b6ed57dd5.gif",
  "retrievedAt": "2025-08-25T15:25:17.839Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899958/top-seeds-zverev-sabalenka-advance-at-miami-open",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:34.000Z"
}
