{
  "title": "Stressed rivers and drying farmlands - Business - DAWN.COM",
  "author": null,
  "content": "Just after a week, the sowing of Kharif crops will formally begin in Sindh. However, early sowing of cotton crops, a major Kharif cash crop, has already been reported in the lower Sindh region, as is the practice in vogue based on the strength of whatever flows are available in channels feeding farmlands.\n\nHowever, by the end of the current Rabi season of this year, water flows for winter crops have not been encouraging given what the Indus River System Authority (Irsa) had predicted at the commencement of the season in October 2024. In early March, the water regulator had to revise its estimate of water shortage in Rabi from 16 per cent to 35pc in March. One Irsa official, however, said the shortage had risen to 51pc for Punjab and Sindh overall by the third week of March. Sindh’s overall shortage is 52.7pc by Mar 21.\n\nWheat acreage targets were revised downward for 2024-25 considering that the government stayed away from fixing wheat support prices and farmers — agriculture officials believe — preferred growing oilseed crops like sunflower, mustard and canola over wheat. Many also opted to increase rice cultivation. Cotton sowing and production targets were also missed last year. Against a growing target of 630,000 hectares, 582,000 hectares of cotton acreage were achieved in 2024-25 in Sindh.\n\nSindh, being at the tail end of the Indus Basin Irrigation System, experienced a 52.75pc overall water shortage till Mar 20, with Sukkur barrage, the province’s lifeline for agriculture, recording a 69.8pc water shortage. Water flow records of the past five years for Mar 20 showed that Sindh had borne the brunt of the 40.8pc water shortage in 2021; 39.1pc in 2022; 20.17pc in 2023; 24.35pc in 2024; and the highest (so far) overall shortage of 53.6pc in March 2025. Similarly, Sukkur Barrage’s highest shortage was recorded at 52.32pc in March 2022 and 46.6pc in March 2021.\n\nSindh faces regular agitation over potential new canals on the Indus River citing fears of water shortages given past and present experiences\n\nGuddu Barrage has recorded a 17pc shortage in spite of the fact that the right bank Begari Sindh feeder is closed, while the Desert Pat feeder is feeding its share of water to Balochistan alone. Its Ghotki feeder, however, draws water. Kotri Barrage has not yet recorded a shortage.\n\nThe unavailability of flows in Rabi would hit wheat and sugarcane productivity, besides vegetable crops.\n\nEarly sown Kharif crops in lower Sindh, particularly cotton, need irrigation supplies in quick succession, which seem to have eluded cotton till March. Usually, almost 70-80pc cotton cultivation takes place by early April in Sindh, which has been jeopardised. The shortage won’t spare bananas, grown largely in Sindh, either. Water availability for mangoes is crucial at this point in time, for mango trees are witnessing fruit setting.\n\nThe shortage is attributed to Tarbela and Mangla reaching ‘dead level’ in February. After hitting a dead level of 1,050 ft on Feb 15, Mangla recorded a marginal improvement in storage level, ie 1,061.25 ft on Mar 20, as the dam is considered to be an early riser. Tarbela is a principal source of irrigation water for Sindh, whilst flows from Mangla are rarely released for the province. It had a run of the river flows on Mar 21 after hitting a 1,402 ft dead level on Mar 18. Even at this point in time, when Sindh needs water, flows are stored in Mangla.\n\nThe present situation clearly looks grim for farmers in this part of Pakistan. They fear that, come April, it could potentially worsen as the temperature would start rising. Groundwater remains, by and large, brackish in most parts of Sindh; thus, growers don’t find recourse to this resource that is luckily sweet in Punjab.\n\n“From our point of view, rainfall can rescue farmers. In case it doesn’t rain, the situation will become very difficult. We are heading, God forbid, towards a drought. Isn’t it alarming that while such shortages are regular, we plan new canals without realising that the existing demand of command areas remains unmet?” laments Sindh Chamber of Agriculture Vice President Nabi Bux Sathio.\n\nSindh Abadgar Board president Mahmood Nawaz Shah agrees with Mr Sathio, saying early-sown cotton would be at stake. “It can hardly survive if its required flows after sowing are missed. Farmers grow cotton without assessing ground realities and then end up suffering economic losses. Sindh is already struggling with ideal cotton production,” he says. It is time that flows from Mangla dam, whatever available, should be released for Sindh, which is in dire need of water.\n\nIrsa Director of Operations Khalid Idrees Rana believes that this situation — dams attaining dead level in this period — usually occurs in Feb and March. He attributed the current shortage to lower-than-anticipated rainfall in rim station catchment areas.\n\nWhile assessing flows at the start of the Rabi season, Irsa had anticipated a 16pc shortage in its meeting on Oct 2, 2024, for Punjab and Sindh. But weather patterns upset the estimates. The Irsa Technical Committee is now scheduled to meet on Mar 25 to finalise the draft regarding anticipated water availability for Kharif 2025, followed by the Irsa Advisory Committee’s meeting on Mar 26.\n\nThe Advisory Committee would not only approve the anticipated water availability criteria for Kharif 2025 but would also look into the ‘operational constraints & outflow capacity’ of T3, T4, T5 and the lower level outlet (LLO) of T4 at Tarbela, where ongoing work at the powerhouse on T5 is putting additional strain on outflow capacity.\n\n“Presently, water availability will be further compromised for provinces due to the unavailability of T5’s LLO. An outflow of 200,000 cusecs was achievable before the start of powerhouse work, but now it is affecting releases for provinces considerably,” says an official.\n\nSindh, being a lower riparian region, is prone to water shortages in Kharif, but shortages as high as 70pc at the main barrage of Sukkur in March seem to be a new phenomenon. An invariable shortage of 65-70pc has often been reported at Kotri Barrage during the peak of Kharif (May and June) in the last few years, according to available irrigation statistics. Only floodwaters, if any, improve flow availability.\n\nThe current water shortage is seen in the backdrop of the planned new canals’ construction, leading to heated debate. Sindh is witnessing regular agitation over the new canals in question, with growers and political activists rejecting the project amidst fears that flows of the Indus, given past experience, would be eventually diverted to irrigate areas not known for irrigated agriculture, otherwise in southern Punjab.\n\nThe upcoming weeks would set the tone for what shape weather patterns may take. One thing is for sure: impacts of climate change, making water flow availability highly unpredictable, have become more pronounced. And it makes the question of whether to build new canals, especially in Cholistan upcountry, more relevant.\n\nPublished in Dawn, The Business and Finance Weekly, March 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:09:28.731Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899710/stressed-rivers-and-drying-farmlands",
  "dateList": "2025-03-24",
  "date_published": "2025-03-24T02:03:30.000Z"
}
