{
  "title": "PM commends ministry, NHA for rehabilitation of flood-affected road infrastructures",
  "link": "https://www.app.com.pk/national/pm-commends-ministry-nha-for-rehabilitation-of-flood-affected-road-infrastructures/",
  "date_published": "2022-09-04T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): Prime Minister Shehbaz Sharif has commended the Ministry of Communications and National Highway Authority (NHA) for the construction and rehabilitation of highways and bridges in flood-affected areas across the country.\nAccording to NHA, Secretary Communications and Chairman National Highway Authority Captain (R) Muhammad Khurram Agha gave a detailed briefing to Prime Minister Shehbaz Sharif during the flight at Bibi Nani on the flood-affected roads and the ongoing rehabilitation work on the link bridges and Pinjarra Bridge.\nThe Prime Minister lauded Federal Minister of Communications Maulana Asad Mehmood, Chairman NHA and his team for their keen interest and efforts on ongoing rehabilitation work on the bridges, highways etc.\nThe recent heavy rains and floods have severely damaged the national highway network in Balochistan and the province’s land connectivity with other provinces has been cut off, due to which not only the movement of traffic but also the delivery of goods and relief activities were facing difficulties.\nBalochistan Chief Minister Abdul Quddus Bizenjo said that there was no example of how quickly and in a short spam NHA restored the Pinjarra bridge and Bibi Nani for the movement of traffic.\nFurther, the land connection from Swat with Bahrain has been also restored with the efforts of the minister and Corps Engineers of Pakistan Army, NHA, District Administration have also played a vital role in this regard.\nThe NHA staff was also at the forefront of relief activities in the country. The national highways of Sindh province have been greatly affected by the recent rains and floods.\nPassengers were requested by NHA to get information from NHA zonal office before travelling while the road of National Highway N55 from Dadu to Nasirabad (35km) has been submerged in flood water. The district administration has also closed N55 for traffic and diverted N55 traffic to N-5. Therefore, due to the traffic of N55, there has been an additional load of traffic on N-5. However, the Motorway Police was trying to restore traffic on N5.\nThe NHA officials have also contacted the Chief Secretary Sindh and IG Sindh and asked for police presence to restore the flow of traffic.\nUnder the direction of the minister, the architects and field staff of NHA were busy day and night in restoring all the damaged highways.",
  "retrievedAt": "2025-08-11T15:31:17.799Z"
}
