{
  "title": "26 more die, 11 injured due to monsoon catastrophe: NDMA",
  "link": "https://www.app.com.pk/national/26-more-die-11-injured-due-to-monsoon-catastrophe-ndma/",
  "date_published": "2022-09-04T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): The unprecedented torrential monsoon rains across the country on Sunday inflicted further lives and property losses as the total death count in various incidents reached 1,290 and 12,588 individuals got injured since the onset of the rainy season.\nThe National Disaster Management Authority (NDMA) issued a 24-hour situation report released on routine basis that accounted overall life, property and infrastructure losses incurred by the heavy rains lashing out various parts of the country.\nThe heavy rains and flash floods caused deaths of a child in Zhob and a man whereas the details of the latter were to follow.\nIn Khyber Pakhtunkhwa some two perished due to roof collapse and flood in various districts including a women due to flood in DI Khan and a child due to roof collapse in\nNorth Waziristan.\nHowever, in various incidents of roof collapse a man in Lower Dir and three children in North Waziristan were reportedly injured.\nThe NDMA underlined that the Provincial Disaster Management Authority of Khyber Pakhtunkhwa (KP) reconciled it’s death data as the number of a deceased woman was reduced by the PDMA.\nData Reconciliation: PDMA KP: 1x Female death reduced.\nDeath Data Rearrangement: PDMA Sindh: 2x Males added & and 2x Females reduced.\nThe data reconciled by the NDMA mentioned that two perished men and women each figures were reduced by the PDMA Sindh. However, segregated data of nine individuals was still awaited from PDMA Sindh.\nIn Punjab’s District Rajanpur a man drowned in flood water.\nIn Sindh, 22 people perished including four men and a child died in Noushero Feroze, two men, a woman and four children in Shikarpur, two men, a woman and two children in Badin, a man died due to house collapse in Matiari, a man died in Khairpur and three children died in Ghotki.\nThere was no incident or loss to report Islamabad Capital Territory (ICT), Gilgit Baltistan (GB), Punjab and Azad Jammu and Kashmir (AJK).\nIn Balochistan M-8 was blocked as the route of 100 – 140 kilometers (Km) was blocked due to land sliding in 24 Km section of Wangu hills.\nIn KP, N-95 was blocked as the route (Madyan) between Behrain – Laikot (27 km)\nwas blocked.\nAt the N-50, the road was opened for traffic except breached section of Sagu bridge and preparation of approaches on both sides of Sagu bridge was in process.\nIn Sindh, N-55, Meher Johi Canal to Khairpur Nathan Shah was submerged and road was closed.\nThe report highlighted that scattered thunderstorm and rain of moderate intensity with one or two heavy falls was expected over the upper catchments of all the major rivers along with Islamabad and Peshawar, Rawalpindi and Gujranwala Divisions. However, isolated thunderstorm and rain was expected over Lahore Division.\nThe Pakistan Meteorological Department (PMD) has forecasted that weak monsoon\ncurrents from Arabian Sea were penetrating upper and central parts of the country which subsequently caused rain-wind and thundershowers with isolated heavy falls in Khyber Pakhtunkhwa, Islamabad, Northern Punjab, Gilgit Baltistan and AJK from Sep 3rd (Saturday) to Sep 6th (Tuesday).\nThe massive torrential rains have damaged 40,980 houses, including 14,904 fully damaged and 26,076 partially damaged while 875 livestock animals died.",
  "retrievedAt": "2025-08-11T15:31:05.920Z"
}
