{
  "title": "Nation working in unison to overcome flood devastation: PM",
  "link": "https://www.app.com.pk/national/nation-working-in-unison-to-overcome-flood-devastation-pm/",
  "date_published": "2022-09-04T10:14:00.000Z",
  "source": "APP",
  "content": "KACHHI, Sep 4 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said during the current situation which arose after the monsoon rains and floods, the entire nation was working in unison and inspiration to overcome the problems which was very important.\nExpressing his view after getting a briefing from the relevant authorities over the reconstruction and rehabilitation efforts of road, rail and bridges infrastructure in the area, the prime minister said that it was a matter of satisfaction that all the people had been involved to overcome the enormous issues after the natural calamity hit the country.\nAppreciating the efforts of the district administration authorities and others, the prime minister said their commitment and devotion had been a source of inspiration for the general public.\nHe said that he saluted all those who had been involved in the relief and rehabilitation efforts. The chief minister and the chief secretary had been coordinating and working with all the relevant authorities, he added.\nIt was your commitment to the nation, he said, adding that their efforts would serve as a beacon of light for the people. It was the teamwork that could yield results in trying times, he opined.\nThe prime minister announced Rs5 million relief grant for the labourers who were working there in the difficult situation and another amount of Rs1 million for the staff that was working for the restoration of gas pipelines. A committee would be set up to dispense the amount on merit.\nThe prime minister said the floods had caused large-scale damages across the country, affecting all the provinces. About 1300 lives were lost, livestock swept away, while the economic and infrastructure damages were enormous.\nIn this district, the prime minister said, recent floods had swept away Bibi Nani bridge, disrupting traffic from Quetta to Sukkur and leaving about 6000 people stranded on both ends.\nHe appreciated the NHA, law enforcement jawans and other authorities who restored the damaged bridge within 8 hours, adding that they did a great national service.\nThe prime minister said that when a catastrophe hit, the whole nation stood up and march in unison by working hard to overcome the challenges. The prime minister announced Rs3 million for those labourers working on the restoration of Bibi Nani bridge.\nNational Highway Authority Chairman Khurram Agha also briefed the prime minister about the restoration of Bibi Nani bridge. About 106 kms road around Bibi Nani and Pinjar Bridges were largely affected.\nThe chief minister thanked the prime minister for his visits and continuous support to the flood-affected areas of the province. He said the FC personnel had played a major role in the restoration of the connectivity bridge.\nHe also announced Rs2 million for the labourers and workers.",
  "retrievedAt": "2025-08-11T15:31:11.004Z"
}
