{
  "title": "CDA to install permanent decorative lights on major avenues",
  "link": "https://www.app.com.pk/national/cda-to-install-permanent-decorative-lights-on-major-avenues/",
  "date_published": "2024-11-30T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): Capital Development Authority (CDA) has decided decided to install decorative lights permanently on major thoroughfares to enhance beauty of the federal capital.\nThe decision was taken in a meeting chaired by the authority’s chairman Muhammad Ali Randhawa on Saturday to review the Islamabad beautification plan.\nIn the first phase, LED floodlights will be installed along Constitution Avenue.\nThe Chairman CDA stated that the lights should be energy-efficient and cost-effective. He emphasized that effective and permanent measures should be taken for protection of lights.\nHe instructed to prepare PC-I of the project and to present it for approval at the earliest.\nThe Chairman CDA directed to carry out repair of all sign and direction boards installed in the city immediately under the Beautification. He instructed that a plan be presented to beautify the city’s key buildings.\nHe directed that a team consisting of architects be formed to assist with the beautification plan.\nThe meeting decided that all avenues in the city would be beautified in phases.\nDuring the briefing, it was informed that under the Beautification Plan, plants have been planted that will ensure the city remains adorned with beautiful flowers throughout the year.\nThe meeting was informed that the plan aims to balance the city’s natural beauty with modernity. It was also mentioned that symmetry will be ensured among the elements contributing to the beautification of the city.\nChairman CDA Muhammad Ali Randhawa also said that a plan to enhance the facilities at F-9 Park should be presented.\nHe stated that Fatima Jinnah F-9 Park will be developed as a center for recreational activities.",
  "retrievedAt": "2025-08-10T15:44:18.778Z"
}
