{
  "title": "PTA intensifies crackdown on illegal IMEI tampering, sale of cloned mobile devices",
  "author": null,
  "content": "ISLAMABAD, Jun 11 (APP):Pakistan Telecommunication Authority (PTA) Zonal Office Lahore, in close coordination with the National Cyber Crime Investigation Agency (NCCIA) Gujranwala, carried out two successful raids in Gujranwala against illegal IMEI tampering and the sale of cloned/patched devices.\nThe first raid took place at Google Valley Mobile Plaza, Model Town, where 19 tampered/cloned phones were seized, and the shop owner was arrested, said a news release.\nThe second raid was conducted at Musa Mobile, Main Market, Gujranwala, where 6 tampered devices were confiscated. The shop owner, however, escaped, exploiting the crowd gathered at the scene.\nOne seized device had an IMEI linked to Disney Mobile, a brand not officially available in Pakistan. Confiscated phones included models from Google Pixel, OnePlus, Motorola, and a Samsung S23 Ultra, all with reconfigured IMEIs of lower-priced devices. FIRs have been lodged, and investigations are ongoing.\nPTA maintains a zero-tolerance policy against the illegal modification of mobile device identifiers. IMEl tampering and the distribution of cloned phones pose serious threats to national security and public safety, facilitating criminal anonymity and enabling cybercrime, financial fraud, abductions, and other offenses.\nPTA urges the public to stay vigilant and report any suspicious activity related to mobile phone cloning or tampering.\nRegulatory actions are being strengthened, and violators will face strict legal consequences.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:04:29.325Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pta-intensifies-crackdown-on-illegal-imei-tampering-sale-of-cloned-mobile-devices-2/",
  "dateList": "2025-06-11",
  "date_published": "2025-06-11T09:09:00.000Z"
}
