{
  "title": "India poised to ruin world order : AJK president",
  "link": "https://www.app.com.pk/national/india-poised-to-ruin-world-order-ajk-president/",
  "date_published": "2020-02-24T03:40:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 24 (APP):Azad Jammu and Kashmir President Sardar Masood Khan said on Monday that India was poised to ruin the world order which had come into being on the basis of the principle of rule of law following the World War-II, and the United Nations was also its part thereof.\n“The United Nation is striving for combating climate change and sustainable development, but is not fulfilling its basic responsibilities of preventing the disasters of war, genocide, ethnic cleansing and the human rights violations,” he said while addressing the opening session of a conference on “Resolution of the Kashmir Issue: Pakistan’s Options in the Realm of International Law and Global Politics” in Lahore, AJK Presidential secretariat said in a statement released to media here.\nOrganized by Departments of Political Science and International Relations of the University of Management and Technology (UMT) Lahore, the conference was also addressed by former Pakistan Foreign Minister Khurshid Mehmood Kasur, former Azad Jammu Kashmir Prime Minister Sardar Attique Ahmed Khan; President UMT, Ibrahim Hassan Murad, Lt. Gen. (Retd) Javed Hassan, leader of All Parties Hurriyet Conference Syed Abdullah Gilani and an expert on international law Ahmar Bilal Soofi and others.\nThe AJK president said that liberation of occupied Kashmir was the responsibility of not only Kashmiri people but also Pakistan because Kashmir was a matter of the survival of Pakistan also, and it was incomplete without Kashmir.\n“The ongoing liberation movement in Occupied Jammu and Kashmir is the struggle for completion of Pakistan, and under the international law, Pakistan can move International Court of Justice, International Criminal Court and International Law Commission against India’s unlawful, unconstitutional and immoral actions, and can demand setting up of a tribunal, but it will be a political decision,” he said.\nThe AJK president was of the view that although the global politics was not in favor of Pakistan and the Kashmiri people, but there was good news that the international civil society had decided to support Pakistan and the Kashmiri people.\n“After August 5 last year, a big development has taken place in the world that earlier we went to the European Parliament and call on the MPs during informal meetings but they referred to their trade relations with India and were not ready to hear anything about Kashmir, but this situation has changed altogether after August 5 Indian actions, and they have adopted the narrative of Pakistan and the Kashmiri people on the Kashmir issue,” he underlined.\nSardar Masood Khan said that not only European and UK parliaments, but the French Parliament, for the first time in the history, held its sessions on Kashmir while the US Congress also held three sessions on Kashmir.\nThese development, he said had opened up new doors for us to narrate the story of Kashmir.\n“In the changed global scenario, we should build our narrative afresh, and use all available options,” he said.\nThe AJK president said that after changing the special status of Kashmir, India was looking for a political group which supports its narrative inside Kashmir, but it would never succeed in its attempt.\n“Chapter Six of the United Nations is in fact a passage way to Chapter Seven. Article 33, 34 and 35 of the Chapter Seven of UN Charter empower the Security Council to initiate process of negotiation, reconciliation, arbitration and use of good offices. If all these efforts do not succeed, you have to move to the next step,” the AJK president emphasized.\nHe stressed that the environment of unity and cohesion should be maintained in Pakistan and Azad Kashmir, and a unanimous stand on the Kashmir issue should be adopted to take the 72 years old liberation struggle of the Kashmiri people to its ultimate end.",
  "retrievedAt": "2025-08-11T18:51:13.719Z"
}
