{
  "title": "Credit for entire PSL matches in country goes to Imran Khan: Faisal Javed",
  "link": "https://www.app.com.pk/national/credit-for-entire-psl-matches-in-country-goes-to-imran-khan-faisal-javed/",
  "date_published": "2020-02-24T03:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP):Senator Faisal Javed Monday said credit for entire Pakistan Super League (PSL) matches returns to Pakistan goes to Prime minister Imran Khan where total number of tourists showed a double-digit surge in last 18 months.\nTalking to a private news channel , Senator Faisal said Prime Minister Imran Khan had fulfilled his promise with the nation to revive cricket after ten years in the country to satisfy cricket fans as entire PSL matches are being held in Pakistan which is also boosting tourism industry in our country and built the confidence of other countries to Pakistan.\nHe said cricket lovers are enjoying the PSL matches and expressed hope that PSL would pave the ways for completely revival of international cricket.\n“It is very important for Pakistani nation that all these matches are being played in the country,”he added.\nHe also paid tribute to the Pakistani nation, Army and all security forces for making the environment secure and friendly for players, adding, they are making PSL a successful event in country.\n“It was such a fantastic atmosphere and there was such a buzz because cricket returned home under the leadership of Prime minister Imran Khan,” he says.\nPakistan Super League (PSL) attracted some of the world’s best cricketers and build their confidence for Pakistan again which is a positive sign, he added.\n“Pakistan cricket always offers unique and exciting stuff and this PSL matches giving much excitement to the cricket fans”, he said.\nReplying a query about his favorite PSL team, he wished good luck for Quetta Gladiators and said PSL tournament in country was going without any mishap and brought more joy to Pakistanis. And may the best team will win.\nThe PSL would highlight the positive image of Pakistan globally and attract more people across the world to visit our beloved homeland, the Senator said.\nHe also admired role of Rameez Raja in cricket and termed him a best commentator.",
  "retrievedAt": "2025-08-11T18:51:15.651Z"
}
