{
  "title": "Pakistan Embassy in Tehran actively monitoring situation after outbreak of COVID19",
  "link": "https://www.app.com.pk/national/pakistan-embassy-in-tehran-actively-monitoring-situation-after-outbreak-of-covid19/",
  "date_published": "2020-02-23T21:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP):The Embassy of Pakistan in Tehran is actively monitoring the situation in the wake of outbreak of Coronavirus Disease (COVID19) in Iran, with its epicenter in the city of Qom.\nThe Government of Pakistan is working in close collaboration with the Government of Iran to curb the spread of this virus.\n“While the Embassy and its sub-missions in Mashhad and Zahedan will continue its outreach with Pakistan community members, Zaireen and the Pakistani students in Iran, all the Pakistani nationals living, travelling and studying in Iran, especially those who are residing in Qom, are advised to take utmost precaution and adopt safety measures as prescribed by the World Health Organization and the Iranian authorities to stay safe from the Coronavirus Disease,” an embassy press release issued on Monday said.\nThe embassy said the Iranian authorities had designated hospitals for the treatment of Coronavirus Disease in every major city. In case of any suspicion of contracting the disease or development of any symptoms such as severe cough, sneeze, fever etc., it advised the Pakistanis to visit those hospitals and cooperate with local health authorities and also share the complete information with the Pakistan Embassy.\nIt also advised to avoid unnecessary social media hype and ignore unconfirmed news. The embassy urged all Pakistani citizens to stay calm but vigilant while adopting the following preventive measures:\nFrequently clean hands by using alcohol-based hand rub or soap and water;\nWhen coughing and sneezing cover mouth and nose with flexed elbow or tissue; it should be immediately followed by disposing-off the tissue and washing hands;\nAvoid close contact with anyone who has fever and cough. In case of fever, cough and difficulty in breathing, immediately seek medical care and share previous travel history with the health care provider;\nWhen moving in public places or transport always wear a mask and gloves. Do not take shoes inside home and keep separate shoes for indoors, if necessary;\nThe latest reports suggest that the symptoms of virus may appear from 14-24 days in a person affected by the virus. In case if anyone is tested positive please immediately inform the Embassy at below given hotline numbers;\nAvoid travelling to Qom and areas currently experiencing cases of novel Corona Virus Disease;\nThe consumption of raw or under-cooked animal products should be avoided. Raw meat, milk or animal organs should be handled with care, to avoid cross-contamination with uncooked foods, as per good food safety practices;\nIt is advised to use public toilets and WCs with utmost care. Only use the toilets/WCs where water is available and flush system is working in the toilets;\nFor convenience of our compatriots, the Embassy has established the following dedicated helplines\nEmbassy of Pakistan, Tehran\nFor assistance regarding Coronavirus Disease, COVID19 Hotlines are as follow:\n+98-910-7659395\n+98-9107648296\n+98-910-7648301\n+98-910-7648298\nFor general queries during the office hours, please call the Embassy’sreception at the following numbers:\n+98-21-66941388\n+98-21-66944888\n+98-21-66941389\n+98-21-66941390\nEmail: tehraninfopak@gmail.com\nConsulate of Pakistan, Mashhad\nFor assistance regarding Coronavirus Disease, COVID19 Hotlines at Mashhad Consulate are as follow:\n0098 – 901 650 5397\n0098 – 939 941 7558\n0098 – 939 778 0488\n0098 – 513 222 9845\nConsulate of Pakistan, Zahedan\nFor assistance regarding Corona Virus Disease, COVID19 Hotlines at Zahedan Consulate are as follow:\n0098 – 938 474 1755\n0098 – 905 461 6642\n0098 – 543 322 3389.",
  "retrievedAt": "2025-08-11T18:50:59.317Z"
}
