{
  "title": "Projects of Rs 162 bln for Karachi development package under approval process: Governor",
  "link": "https://www.app.com.pk/national/projects-of-rs-162-bln-for-karachi-development-package-under-approval-process-governor/",
  "date_published": "2020-02-23T21:05:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 24 (APP):Governor Sindh Imran Ismail on Monday said that the projects under Rs 162 billion development package for Karachi were in various phases of approval.\nHe said this while talking to media persons after visiting Deaf Reach School and College in Gulistan-e-Johar here.\nReplying to a question, the governor said that it was true that progress and prosperity of the country lied in development of Karachi and the development of the metropolis was among the top priorities of the federal government.\nImran Ismail said that Prime Minister Imran Khan would soon inaugurate completed Federal government-funded development projects in Karachi.\nWhile replying to a question about launching of Greenline, Imran Ismail said that it would take time because special buses were to be purchased which would also have facilities for the persons with disability.\nHe asked media for coverage of institutes like Deaf Reach who were serving the humanity selflessly and without any discrimination.\nTheir services must be recognized at all levels and he would recommend founder of the School Richard Geary for the Highest Civil Award of Pakistan, the governor said.\nHe expressed gratitude to Richard Geary and his wife Ms. Heidi, for their endeavors in educating deaf children of the country.\nEarlier, Governor Sindh Imran Ismail visited Deaf Reach School and College – Johar and enquired about the facilities being provided to the students.\nHe also visited class rooms, computer and science laboratory and lauded the free of cost facilities which were being imparted to the students.\nHe commended the management specially founder of the School Richard Geary and his wife Ms. Heidi for working of the betterment of Deaf children.\nAfter visiting various sections of the school, the governor said that he was very much impressed by the talented students who were performing with excellence in their studies and co-curriculum activities.\nHe expressed the hope that graduates of this remarkable institution would serve the country with utmost distinction.\nThey had extra zest and energy which made them so special in all aspects, he added.\nHe said that the Special Children were not lesser in any means as compared to normal children.\n“Someone is even more talented than other normal students which can be seen in this institute,” he remarked.\nThe governor announced Rs 100,000 monthly grant from his own pocket for the school and pledged to motivate philanthropists for donations.\nRichard Geary informed the governor that this school had seven branches all over the country of which five ware situated in Sindh including Karachi,Hyderabad, Sukkur, Nawabshah and Tando Allahyar.\nAs many as 240 children were being imparted education in Karachi, he added.\nHe said that all the facilities including tuition fee, uniforms, books and transportation were being provided free to every student in this institution.\nAround Rs 7,500 per month were incurred on each student.",
  "retrievedAt": "2025-08-11T18:50:56.992Z"
}
