{
  "title": "Govt develops hospitals information system on COVID-19: Mirza",
  "link": "https://www.app.com.pk/national/govt-develops-hospitals-information-system-on-covid-19-mirza/",
  "date_published": "2020-05-29T04:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP):Special Assistant to the Prime Minister on National Health Services Dr Zafar Mirza on Friday said t the government had developed health information system with having update on the status of available facilities at public sector hospitals for the COVID-19 patients.\nAddressing a press conference here at the National Command and Operation Centre (NCOC), Dr Mirza said due to the information system, the government would be able to know the occupancy of beds and ventilators, and their availability at the intensive care units and allocated wards of hospitals.\nHe said with the help of the system, the authorities concerned could easily manage the situation in hospitals to properly treat the corona patients. Moreover, the shortage of any necessary equipment could also be addressed.\nDr Mirza said although the number of patients on ventilators were increasing but still the ratio of ventilator usage was 20 percent which meant still enough quantity of ventilators and beds were available in hospitals for the COVID-19 patients.\nHe said the government was committed to ensure availability of medical services and provision of the best possible medical treatment for the corona patients at hospitals.\nHe said the government had made some amendments in the guidelines of safe burial of dead COVID-19 patients for the safety of all those who attended the funeral ceremony or handled the dead bodies of individuals suspected or confirmed for Covid-19.\nHe said till date there was no scientific evidence of transmission of virus through the dead body of COVID 19 deceased case, yet it was vital to ensure precautionary measures while handling the bodies of suspected or confirmed cases.\nHe said adopting guidelines would help prevent any possible transmission. There was no restriction on immediate family members to attend the funeral rituals.\nHe said anyone attending the body must use appropriate personal protection equipment (PPE) including gown, gloves, and mask etc. He advised to use face shield and goggles, if there were a potential risk of body fluid splashes.\nHe said the body should be cleaned and dried, and it could also be covered with a white cloth, as per the religious practice, for the burial. The health care workers, family members or mortuary staff, preparing the body for burial, should follow the standard precautions of wearing appropriate PPE.\nHe said the family and friends might view the body but should not be allowed to touch or kiss it. They should wash hands thoroughly with soap and water frequently.\nThe burial rituals, including burial gathering and prayers should have minimal possible numbers like only immediate family and relatives. All in attendance should observe standard precautions like social distancing, face masks and frequent hand washes.\nDr Mirza said during the last 24 hours, 57 corona patients lost their lives, which was ever highest figure of deaths in the country due to COVID-19. Some 157 patients were on ventilators.\nHe said so far 64,000 confirmed cases were reported throughout the country while during last 24 hours 2,636 new cases were reported. He added that 35% patients had been recovered completely while over 520,000 corona tests had been conducted so far.\nHe said new corona positive cases were increasing and there were threats of spread of the disease. He asked the citizens to continue implementing protective measures as per directions to stem the increase in the coronavirus cases.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:12.526Z"
}
