{
  "title": "Justice Isa issues clarification regarding invitation to celebrate Golden Jubilee of Constitution",
  "link": "https://www.app.com.pk/national/justice-isa-issues-clarification-regarding-invitation-to-celebrate-golden-jubilee-of-constitution/",
  "date_published": "2023-04-11T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 11 (APP): Supreme Court judge Justice Qazi Faez Isa on Tuesday issued a clarification regarding invitation to celebrate the Golden Jubilee of the Constitution of the Islamic Republic of Pakistan (the Constitution).\nJustice Isa, in the clarification, stated that all the SC judges were invited to celebrate the Golden Jubilee of the Constitution.\nHe said prior to accepting the invitation, inquiries were made as to whether there would be political speeches, and assurances were extended that only the Constitution and its making would be spoken about, and the programme sent to him also confirmed that.\n“Having cleared this point, first by my staff from the Deputy Director of the National Assembly, and then by me directly with the Speaker, I accepted the invitation as I wanted to show solidarity with the Constitution. I had been asked if I would like to speak and I had declined. However, when political statements were made (in a few of the speeches), I requested to speak to correct any misconceptions that may arise, and I did so,” he added.\nHe stated that surprisingly, some had objected to where he sat and/or his presence at the function to commemorate the Constitution.\n“I would have preferred to sit in the hall on one side or in the gallery, but respect was shown to a member of the judiciary by seating me at the centre; I did not choose to sit there,” he said.\nThe clarification stated that the Constitution was unanimously enacted by the people’s directly elected representatives at all ends political spectrum, which testified to their sagacity. It affirmed the Founder’s motto of achieving success; Unity, Faith and Discipline.\n“It established that even the most intractable problems can be solved with sincerity and motivation when the people’s interest is kept paramount. I may add that the elected representatives of the people are deserving of all respect. Without the politicians of the All India Muslim League we would not have gained independence. The organizers of the Convention had invited all to commemorate a singularly. important day in Pakistan’s history. The Golden Jubilee of the Constitution is a celebration of all citizens; it is not the exclusive domain of any particular political party or institution. The significance of the Constitution must be impressed upon all, and this should be done continuously. When Pakistan did not have a constitution enacted by the directly elected representatives of the people, the country broke apart. The lingering mistake was finally rectified 50 years ago and the people’s fundamental rights were recognised and enshrined in the Constitution. The salvation of all Pakistanis lies in adherence to the Constitution. Citizens are best served if seeds of discord are not planted.\n“The making of the Constitution is one of the greatest moments in our history, which should be celebrated,” Justice Isa concluded.",
  "retrievedAt": "2025-08-11T08:16:48.110Z"
}
