{
  "title": "CDA to take possession of amenity plots to curb misuse in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Capital Development Authority (CDA) has decided to take over amenity plots from the private housing societies to avoid their misuse.\n\nA meeting chaired by CDA Chairman Muhammad Ali Randhawa took this decision on Wednesday. Sources said the CDA chief directed the planning wing to make an inventory of amenities plots, which had been transferred to the CDA, but the possession was still pending.\n\nThe housing schemes are supposed to transfer land reserved for amenities, such as parks and schools, to the civic agency to obtain a no-objection certificate. However, there are reports that this land is being sold by housing schemes. In light of these reports, the CDA has decided that the land transferred to its name will be taken over by the civic body, and its newly created Directorate of Estate Management III will be in charge of such plots. According to sources, the purpose of this exercise is to ensure proper utilisation of amenities land.\n\nThere are 65 approved housing schemes in the capital territory, and several societies have yet to hand over the CDA these plots. In addition to the approved housing projects, over 100 housing schemes are operating without authorisation.\n\nPlanning wing directed to make inventory of such land; development activities in housing schemes to be monitored\n\nThe meeting also decided to take steps for the recovery of dues from various housing societies and directed the CDA’s planning wing to ensure the implementation of regulations under which the housing societies were bound to get the transfer of plots vetted from the CDA.\n\nThe chair also directed the CDA to do mapping of all unauthorised societies to determine if they could be regularised in light of recommendations of the master plan commission. If not, it said action should be taken against them.\n\nIt is relevant to note here that following the federal cabinet’s decision in Aug 2021, a committee was established “to advise and develop an effective policy for regularisation of irregular housing schemes” in various zones of Islamabad.\n\nIn 2016, two reports compiled by the Senate Standing Committee on Law and Justice had blamed the CDA and the local administration for the mushroom growth of illegal housing schemes and the violation of layout plans by the cooperative housing societies. The reports, which were adopted by the Senate in 2016 and by the CDA in March 2018, are yet to be implemented.\n\nIn one of the reports about the cooperative housing schemes, the Senate had recommended that the violations of layout plans committed by housing schemes may be accommodated by amending the regulations. However, the Senate had directed the civic agencies that no compromise should be made regarding public parks.\n\nAfter being informed that green areas and amenity plots had been sold out by housing societies, the Senate had recommended that any land adjacent to the housing schemes may be bought and utilised as public parks while space for graveyards should be acquired in the vicinities of the societies.\n\nMeanwhile, during the meeting, CDA’s planning wing informed that the process of issuing notices on account of violations within private housing societies has already been initiated.\n\nA statement said that Chairman CDA, Muhammad Ali Randhawa, directed that the survey process in all private housing societies be expedited. He said development activities in the private housing societies should be monitored using Google and satellite imagery, and strict action should be taken against private housing societies for any violations of the approved layout plans.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:46:34.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884022/cda-to-take-possession-of-amenity-plots-to-curb-misuse-in-islamabad",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:30:47.000Z"
}
