{
  "title": "Three Hindu youths kidnapped by Katcha area dacoits near Rahim Yar Khan - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAHIM YAR KHAN: Three members of the Hindu community from Chowk Sawetraarea near Bhong were allegedly kidnapped by dacoits of Katcha area on Tuesday night.\n\nReports said that three Hindu youths, Shaman, Sajan and Shameer, were intercepted by more than five armed dacoits near Chowk Sawetra Basic Health Unit (BHU).\n\nThe kidnappers took them to Katcha area and later released a video message.\n\nIn the video message, a criminal, Ashiq Hussain Korai, said he was from Katcha Karachi island in the river Indus.\n\nHe said that the Hindu youths were kidnapped because Ahmedpur Lama Station House Officer (SHO) Rana Ramzan had allegedly picked up his 10 family members, including his brother\n\nAllah Wasaya and some children and women.\n\nHe warned the police that if his relatives were not freed, he would not only kill the kidnapped youths, but also attack police. The video clip also shows the barefooted, chained Hindu youths, appealing for their release.\n\nAccording to a source, whenever police arrest relatives or family members of any dacoit, these criminals kidnap poor people, especially from minority communities.\n\nThe dacoits use the kidnapped persons to bargain with police for the release of their relatives, the source says.\n\nHe says that during the last couple of months, police had to release some accomplices of dacoits in exchange for the kidnapped persons.\n\nWhen contacted, a police spokesperson refused to share his version on the issue.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:33:49.893Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883932/three-hindu-youths-kidnapped-by-katcha-area-dacoits-near-rahim-yar-khan",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:30:31.000Z"
}
