{
  "title": "Senators raise food safety issues - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Concerns include sale of ‘plastic rice’, poor quality milk\n• Govt proposes amendments to Cotton Cess Act\n\nISLAMABAD: The Se­­nate Standing Committee on National Food Security and Research on Wed­nes­day raised concerns over food safety standards in the country, with members highlighting issues such as plastic rice and substandard milk being sold in the market, posing a threat to public health.\n\n“More milk is being sold than what is produced in the country. What is being sold as food is often poison,” remarked Senator Ajmal Wali Khan during a meeting of the committee chaired by Senator Syed Masroor Hussain.\n\n“The Senate should legislate to ensure the quality of food in Pakistan, as the provinces have failed to address this critical issue,” he said.\n\nSenator Danesh Kumar expressed concern over the potential health risks of arsenic contamination, which has been linked to cancer.\n\nWith no national food safety policy in place, the committee discussed the need for stronger regulations and a unified appro­ach across provinces.\n\nNational Food Security Secretary Syed Zafar Ali Shah said highlighted that although the 18th Amen­dment shifted responsibility to the provincial governments, the federal government is drafting new laws to address food quality at the national level.\n\nThe committee also addressed concerns surrounding the quality of rice exports, particularly following an incident in October 2024 when a consignment was halted in Italy due to substandard quality.\n\nSecretary Zafar Shah noted that while Pakistan adheres to the European Union’s safety standards for rice exports, problems often arise when rice is shipped before laboratory results are available. “We have tightened checks on all food items, including rice, and have prepared new legislation to improve food safety,” he said.\n\nThe committee chairman decided to form a subcommittee to deliberate on and formulate a comprehensive national food security policy and draft new legislation aimed at ensuring food quality across the country.\n\nMeanwhile, ministry officials informed the committee that the government plans to propose amendments to the ‘Cotton Cess Act’ in order to address the challenges facing the textile sector, and ensure better support for the cotton sector.\n\nThe committee chairman and Food Minister Rana Tanver Hussain suggested that the committee should seek input from Aptma before proceeding with new legislation, emphasising the importance of collaborative solutions for the sector’s long-term sustainability.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:46:46.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884007/senators-raise-food-safety-issues",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:29:12.000Z"
}
