{
  "title": "Afghanistan warns Iran after criticism of dam project - World - DAWN.COM",
  "author": null,
  "content": "KABUL: The Afghan government warned Iran on Wednesday against “irresponsible comments” following Tehran’s criticism last week of an upstream dam being built by its neighbour.\n\nWater rights have long been a source of friction in ties between the two countries, which share a more than 900-kilometre border.\n\nEsmaeil Baqaei, spokesman for the Iranian foreign ministry, voiced “strong protest” on Friday over the “disproportionate restriction of water entering Iran” due to the Pashdan Dam on the Harirud River, adding that the project could be in violation of bilateral treaties.\n\nThe new Iranian ambassador to Kabul, Alireza Bigdeli, met on Wednesday with the political deputy of the Afghan prime minister’s office, Maulawi Abdul Kabir.\n\nKabir said that while the “water-sharing dispute between the two countries has been resolved through mutual understanding… irresponsible comments could undermine the relationship between the two countries”.\n\nThe Afghan Taliban official added that there were “no issues in Afghanistan that could harm relations with Iran” and “expressed his desire to strengthen bilateral cooperation”, according to a government statement on social media platform X.\n\nAfghanistan’s Taliban authorities said last month that the Pashdan project, located in Herat province, was “nearing completion” and water storage had begun.\n\nThe dam will store around 54 million cubic metres of water, irrigate 13,000 hectares of agricultural land and generate two megawatts of electricity.\n\nThe Harirud River, also known as Hari and Tejen, flows from the mountains of central Afghanistan to Turkmenistan, passing along Iran’s borders with both countries.\n\nIn May 2023, Iran issued a stern warning to Afghan officials over another dam project, on the Helmand River, saying that it violated the water rights of residents of Sistan-Baluchistan, a drought-hit province in southeastern Iran.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:11:08.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883983/afghanistan-warns-iran-after-criticism-of-dam-project",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:30:00.000Z"
}
