{
  "title": "Govt, PTI unable to ‘see eye to eye’ on dialogue - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PTI leaders bemoan ‘monitored’ meeting with party founder; govt says private meeting not possible under rules\n• Party agrees to submit written demands; Imran says talks won’t progress without probe into crackdowns\n• NA speaker offers to step aside to ensure ‘integrity’ of dialogue after PTI criticism\n\nISLAMABAD: Despite some headway in talks between the government and the opposition, negotiators from the ruling coalition and the PTI could not see eye to eye on the modalities of the dialogue, with ‘unmonitored’ access to Imran Khan becoming a fresh bone of contention, following an agreement on the submission of written demands.\n\nOn Wednesday, after a meeting with Imran Khan in Adiala jail, PTI interim chairman Barrister Gohar Ali Khan said that the party founder had permitted them to share their demands with the government negotiation committee in writing, as agreed upon in the first round of talks.\n\nThe PTI leaders, however, expressed reservations about the ‘monitored’ meeting with the party founder in Adiala jail, with NA Opposition Leader Omar Ayub demanding a meeting which was not “monitored by intelligence agencies”.\n\nMr Ayub said, “Our current meetings with Imran Khan are being held in a confined space, equipped with cameras and listening devices, which compromises the confidentiality and integrity of our discussions. This situation is unacceptable and undermines our ability to communicate freely and effectively.”\n\nThe government committee’s spokesperson, Senator Irfan Siddiqui, took exception to this demand and said the PTI had made the meeting with its founder conditional and difficult.\n\nSpeaking to Dawn, Senator Irfan Siddiqui said, “They (PTI leaders) want their meeting with Imran Khan in an open space without any surveillance and jail officials. Such conditions may not be entertained under the jail manual and laws.”\n\nHe said the government team had assured the PTI leaders that their meeting with Imran Khan in the jail would be facilitated but questioned that if Barrister Gohar met Mr Khan in jail on Wednesday, then how many others wanted to meet him.\n\n“The PTI’s negotiation team was formed some 40 days ago on Dec 5, but I think it has not completed its homework yet,” he added. He further said a recent tweet of Mr Khan in which he criticised Prime Minister Shehbaz Sharif had further harmed the negotiation process.\n\nNA speaker’s offer\n\nNational Assembly Speaker Ayaz Sadiq also came under fire from the PTI regarding the jail meeting, prompting him to say that he was willing to step down from his role as the head of the negotiation committee.\n\nHe said that if PTI leaders believe that he should withdraw from the negotiation process, then he was willing to consider such a proposal to uphold the neutrality and integrity of the speaker’s office. Barr­i­s­ter Gohar, however, exp­r­essed confidence in Mr Sa­­d­­iq, saying that the spea­ker was capable of holding successful dialogue.\n\nIn a statement, the spea­ker clarified that his role in the negotiations was “pu­­­­­rely that of a facilitator, and arranging a meeting with the party’s founding chairman is neither his mandate nor his responsibility”.\n\nHe expressed disappoi­n­­tment over claims that attempts to contact the speaker’s office were not positively received. He said he never refused a meeting with any member of the National Assembly. The speaker emphasised that his absence from the country did not hinder his ability to arrange meetings. He stated that he is always ready to facilitate such arrangements.\n\nMeanwhile, PM’s aide Rana Sanaullah said there was no pressure on the government to release Imran Khan from jail. Speaking at a press conference, he said: “They (PTI) have already met Imran but then they said they want to talk to him again in a proper manner to get written demands.”\n\nJudicial commission\n\nSeparately, PTI founder Imran Khan said that the former ruling party would walk away from negotiations if its demand for the formation of a judicial commission to probe the May 9 and Nov 26 violence was not met at the next round of talks.\n\nAccording to a transcript of a conversation between Mr Khan and his legal team in Adiala jail, posted on the X account of the PTI founder, the premier demanded a “transparent investigation” into the two crackdowns.\n\nIt may be noted that the incarcerated PTI chief does not have access to his social media accounts.\n\n“My demands are legitimate and reasonable, but the government is not taking them seriously. I am not being allowed to meet the members of my party, which is my legal right. If the government does not establish a judicial commission in the next meeting, we will not proceed with the negotiation process,” the statement posted on his account said.\n\nThe statement also alle­ged that after November 26, many PTI supporters had been disappeared, but the government was not serious in tracing their whereabouts.\n\n“Today, we have formed a committee on the issue of the missing persons, which will be headed by lawyer Qazi Anwar,” he said.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:46:18.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884020/govt-pti-unable-to-see-eye-to-eye-on-dialogue",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:28:39.000Z"
}
