{
  "title": "KKH restored for traffic as Hunza sit-in ends after govt accepts demands - Pakistan - DAWN.COM",
  "author": null,
  "content": "A protest sit-in against the power crisis in Hunza district’s Aliabad area came to an end on Wednesday with the Karakoram Highway (KKH) restored for traffic as the government accepted the locals’ demands.\n\nProtests had erupted in several parts of Gilgit-Baltistan on Friday as residents decried over up to 22 hours of daily power outages amid harsh winter conditions and snowfall.\n\nThe sit-in in the Aliabad area — the district headquarters of Hunza — caused difficulties for locals and travellers, with heavy traffic remaining suspended and an alternative route open only for light traffic. Vehicles loaded with goods imported from China via Khunjerab Pass also remained stranded at the protest venue.\n\nA statement issued today by GB government spokesperson Faizullah Faraq said that Adviser to the Prime Minister on Political and Public Affairs Rana Sanaullah chaired a meeting in Islamabad today, attended by the GB chief minister and chief secretary as well, that accepted the 14 demands of the protesters.\n\nGB administration officials subsequently engaged the sit-in leaders for talks, following which the protest was called off.\n\nLocal leader Amjad Barcha told Dawn.com that the end to the sit-in was opposed by GB Assembly member Ubaidullah Baig who called for it to continue. Barcha said traffic on the KKH was subsequently restored.\n\nAwami Workers Party leader Baba Jan, a leader of the sit-in committee, told Dawn.com that the demonstration was called off on the condition that electricity be generated from Attabad Lake, electricity be brought over from the Chinese city of Kashgar and immediate electricity supply be restored via generators.\n\nHe said the additional chief secretary expressed his regret and assured that problems that inconvenienced the people would be resolved in the future. Jan warned that if action was not taken, the protesters would come out on the streets with greater intensity than before.\n\nJan said the sit-in’s ranks continued to swell today with more women and children participating, along with convoys from different parts of GB.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/09000833710ab6b.jpg",
  "retrievedAt": "2025-10-12T00:46:33.368Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883913/kkh-restored-for-traffic-as-hunza-sit-in-ends-after-govt-accepts-demands",
  "dateList": "2025-01-09",
  "date_published": "2025-01-08T19:11:52.000Z"
}
