{
  "title": "Imran’s problems of his own making, says Maryam - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: Chief Minister Maryam Nawaz says the confinement of PTI leader in jail and his involvement in criminal cases was nothing but the “outcome of his own misdeeds”.\n\nShe was addressing a cheque distribution ceremony at the University of Sargodha on Wednesday under the Honhaar Scholarship Programme.\n\n“A person claiming to be a politician has misled the youth. Instead of focusing on their character building, he put them on path of violence,” she said.\n\nReferring to the 10-year sentence awarded to Hassan Niazi, the nephew of PTI founder, she said that he (Niazi) had spoiled his life and brought misery for his parents. She said he had been rightly punished as his conduct was an absolute disgrace to the nation.\n\nHands over Honhaar Scholarships to students\n\nShe said the PML-N had never forced its party workers into politics of revenge and hatred. She advised students to focus on their studies instead of becoming tools of a person who forced the people of a province to invade Punjab and attack police and Rangers.\n\nBefore her speech, the CM said brilliant students had been selected for scholarships on merit. She said funds were available in the Punjab treasury but wondered why they were not spent on youth education in the past.\n\nTo a demand put forth by students that talented students of first year and third year should also be given scholarships, the CM promised to look into the matter.\n\nShe recalled her recent visit to China and added that she was surprised to see class five children in China studying artificial intelligence. “Therefore, I decided to work on promoting AI technology to ensure better and prosperous chances for the youth.”\n\nMaryam said the Punjab government would give loans to children so that they did not become a burden on their parents by studying and doing business.\n\n“It is a matter of immense pleasure that girls are getting 60pc Honhaar scholarships.”\n\nShe said her government was introducing a laptop scheme for children.\n\n“The first batch of laptops has arrived. We will also give international scholarships to the youth according to their needs.”\n\nShe sang a national song with students and handed over cheques worth Rs70 million to 1,588 students belonging to four districts of Sargodha division and Sargodha medical college.\n\nOPD: The chief minister set June 30 deadline to open the OPD of the Nawaz Sharif Institute of Cardiology, Sargodha, and Dec 31 deadline for its completion.\n\nShe visited the under-construction building of the institute and inspected various sections. The 200-bed health facility is expected to cost nearly Rs8.84 billion.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:34:19.425Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884055/imrans-problems-of-his-own-making-says-maryam",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:29:12.000Z"
}
