{
  "title": "PHC issues notices to Peshawar DC, other officials in contempt - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court on Wednesday issued notices to Peshawar deputy commissioner and other officials, seeking their reply to a contempt plea against demolition of a multi-storey building despite the court’s ‘restraining order’.\n\nA bench consisting of Justice Syed Attique Shah and Justice Mohammad Faheem Wali directed the assistant advocate general, Waqas Orakzai, that the replies of the deputy commissioner, additional deputy commissioner and two other officers should be submitted within seven days.\n\nThe bench was hearing a contempt petition jointly filed by former MPA and a leader of Awami National Party, Yaseen Khalil, and his brother Ajab Khan, requesting the court to initiate proceedings against the officials under the contempt of court law for violating an order of the court.\n\nAdvocate Rahmanullah appeared for the petitioners and stated that they had filed a petition in the high court, challenging interference in their property including multi-storey flats on Warsak Road and its sealing by the district administration few days ago.\n\nFormer MPA claims his property demolished despite court’s ‘restraining order’\n\nHe said that the court had issued an order after preliminary hearing of the petition on Dec 31, seeking their written comments till Jan 2. He stated that the court had also directed that if there was any order directing for the sealing of the property in question, it should remain suspended till next date of hearing.\n\nHe argued that instead of following the court’s restraining order, the respondents accompanied by a large number of police and officials of other departments demolished the said property on the pretext that the petitioners had encroached on land belonging to irrigation department.\n\nThe counsel said that heavy machinery was used to bring down the structures inflicting loss to the tune of millions of rupees on the petitioners. He said that the petitioners had provided all the relevant documents to the deputy commissioner regarding their ownership right on the said land, but in vain.\n\nHe contended that the land in question had been in the petitioners’ family name since 1975 and was registered on the name of their father Hakeem Khan Khalil.\n\nIt is pertinent to mention that few days ago Yaseen Khalil also addressed a press conference wherein he requested the provincial government to order a judicial inquiry into the matter as he was victimised by the administration.\n\nHe claimed that National Accountability Bureau also earlier inquired into the matter but closed the inquiry after the relevant documents were submitted to it.\n\nContrary to his claim, the district administration stated that the disputed land measuring around one kanal, over which a five-storey structure was constructed, in fact belonged to irrigation department. It claimed that the anti-encroachment drive was carried out without any fear or favour and nobody was victimised.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:33:37.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883976/phc-issues-notices-to-peshawar-dc-other-officials-in-contempt",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:31:09.000Z"
}
