{
  "title": "Govt raises Rs425bn, slashes T-bill yields - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The government on Wednesday slas­hed the returns on treasury bills by up to 49 basis points and raised much below the staggering amount of bids, reflecting another possibility of an interest rate cut.\n\nThe government raised Rs424.15 billion through the T-bill auction against a target of Rs250bn. The investors looked eager to park their surplus liquidity in the risk-free government papers as the bids reached Rs1.7 trillion.\n\nThe pattern showed banks were willing to put maximum money for the longest 12-month tenor and offered Rs1.2tr bids. The government raised just Rs171.4bn for the tenor at 11.80 per cent compared to the previous auction rate of 12.29pc, a decline of 49bps.\n\nThe benchmark six-mo­nth and short-term three-month tenors noted a decl­ine of 21bps in their cut-off yields. The government rai­sed Rs83.8bn and Rs75bn at 11.78pc for each tenor.\n\nThe government also raised Rs104bn as a non-bidding amount, totalling the total borrowing to Rs434.15bn.\n\nThe auction of Pakistan Investment Bonds (PIBs) also witnessed a race to buy maximum bonds but the government remained cool and borrowed just Rs8bn out of the total bids of Rs775.2bn. Another Rs3.86bn was raised through a non-bidding way, totalling Rs11.86bn.\n\nPIBs and Treasury Bills are government-issued debt instruments used to raise funds for budgetary needs. PIBs are long-term securities with maturities ranging from three to 20 years, offering fixed interest rates, making them suitable for investors seeking stable, long-term retu­rns. T-Bills, on the other hand, are short-term instruments with maturities of three, six or 12 months, issued at a discount to face value and redeemed at par, providing a quick and relatively secure investment option.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:11:22.227Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883969/govt-raises-rs425bn-slashes-t-bill-yields",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:29:27.000Z"
}
