{
  "title": "CM unveils Rs370m programme to support persons with disabilities - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur has launched a Rs370 million financial assistance programme to support persons with disabilities in the province.\n\nDuring the launch event here on Wednesday, the chief minister said it was the state’s responsibility to support all vulnerable segments of society, including special persons.\n\nHe said welfare initiatives for vulnerable sections of society were a key part of the vision of PTI founder Imran Khan.\n\n“During our tenure, no vulnerable group, including persons with special abilities, will remain without government support. The provincial government will take responsibility for the destitute and helpless people”, he said, according to an official statement issued by the Chief Minister’s Secretariat on Wednesday.\n\nSays expression ‘persons with special abilities’ will be used in official documents\n\nThe chief minister said that the provincial government was working under a comprehensive strategy to assist the vulnerable segments of society.\n\nHe said that data on persons with special abilities, widows, orphans, and other deserving individuals was being collected across the province.\n\nMr Gandapur said that in order to ensure sustainability, all welfare initiatives of the provincial government were being incorporated into the regular budget.\n\nHe said that there would be no shortage of financial resources for welfare initiatives and the support of vulnerable groups.\n\nThe chief minister announced a programme to provide electric wheelchairs to persons with special abilities and saidin the first phase, electric wheelchairs would be distributed to special government employees and students in higher education institutions, followed by the provision of wheelchairs to special students in schools in the second phase.\n\nHe also said that the government had increased the amount provided under the dowry fund from Rs25,000 to Rs200,000 and doubled the amount given under the Zakat Fund.\n\n“We are introducing the Ration Card to assist elderly and widowed women, and a program for the welfare of orphans and abandoned children is also being initiated,” he said.\n\nMr Gandapur said there were plans to build a state-of-the-art old-age home for destitute senior citizens, where all necessary facilities would be provided.\n\nHe said the government was establishing shelters for the transgender community to live with dignity. Also, the chief minister ordered the replacement of the word ‘disabled’ with ‘persons with special abilities’ in official documents.\n\n“The term “disabled” will no longer be used in official documents, and instead, persons with special abilities will be adopted,” he said.\n\nMr Gandapur said persons with special abilities possessed unique and exceptional abilities and needed opportunities to showcase their potential. He distributed financial assistance cheques among special persons.\n\nSocial welfare minister Syed Qasim Ali Shah, members of the provincial assembly, high-ups of the Social Welfare department, and special persons also attended the event.\n\nMeanwhile, the chief minister inaugurated the newly-established Police Facilitation Centre in the East Cantonment police station.\n\nThe centre will provide several services including police clearance, character certificates, foreign registration, employee verification, domicile verification, reporting of lost or stolen items, tenant information forms, traffic information, and driving licences, according to a statement issued by the Chief Minister’s Secretariat.\n\nIt added that services such as driving learner permits, police welfare admissions, tender information, recruitments in police, victim support, and legal advice would also be available at the centre.\n\n“The centre will operate as an integrated and online system, enabling citizens to access these services from their homes without having to visit the police station.”\n\nThe statement revealed that it was the third centre in the province, following the establishment of similar centres in Nowshera and Charsadda and that in the next phase, such centres would be established in other districts of the province.\n\nMr Gandapur said that the provincial government was committed to providing the maximum possible facilities to people in all sectors and that the culture and overall environment of police stations would be made people-friendly, ensuring a sense of complete safety for citizens.\n\nHe said the government was providing resources to the police on a priority basis to meet all requirements and align them with modern needs.\n\nPublished in Dawn, January 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677ef874076d9.jpg",
  "retrievedAt": "2025-08-26T07:33:37.722Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883985/cm-unveils-rs370m-programme-to-support-persons-with-disabilities",
  "dateList": "2025-01-09",
  "date_published": "2025-01-09T01:31:09.000Z"
}
