{
  "title": "India engaged in bringing about demographic changes in IIOJK: Sardar Masood",
  "link": "https://www.app.com.pk/national/india-engaged-in-bringing-about-demographic-changes-in-iiojk-sardar-masood/",
  "date_published": "2021-01-18T16:24:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jan 18 (APP): President Azad Jammu and Kashmir, Sardar Masood Khan Monday said that the Indian occupational authorities were engaged in ulterior designs bringing about demographic changes to vaporize the disputed State of Jammu & Kashmir and to make it a Hindu majority state.\n“This is unacceptable. The people of Jammu and Kashmir have vowed they would not let this happen”, asserted Masood Khan.\nThe AJK President made these remarks while addressing a webinar on “New Domicile Law in IIOJK” organized by the Center for Research and Security Studies (CRSS).\nThe event was attended by Imtiaz Gul, Executive Director CRSS and Dr Nazir Gillani, President of Jammu and Kashmir Council for Human Rights.\nThe President while addressing the seminar said, India invaded and reoccupied IIOJK on August 5, 2019, and then illegally divided the state into two parts and annexed it to the Indian federation, against the wishes of the people of Jammu and Kashmir.\nSince then, he said, Indian forces have been systematically killing, torturing, forcibly disappearing and incarcerating people in the occupied territory, targeting young men.\nThousands of political activists have been put in concentration camps. Rape and sexual violence against women have been used as a weapon of war to punish the entire population of the disputed region in order to deter them from demanding freedom and self-determination, he said.\nMasood Khan said that since April last year, Indian occupation forces and authorities are systematically and illegally changing the demography in the occupied territory.\nHe went on to add that more than two million Hindus from India have been imported and transferred to the occupied territory and the Indian leadership has made it clear that they would increase this number to more than 5 million in a short period of time.\n“India through these actions is violating international humanitarian law and norms of customary international law.\nThe Fourth Geneva Convention and Additional Protocol prohibit deportation or transfer of a State’s own population in a territory it occupies while the Statute of International Criminal Court says that such transfers, directly or indirectly constitute a war crime.”\nSardar Masood maintained that several resolutions of the UN Security Council, UN General Assembly and UN Human Rights Commission declared such illegal transfers and “implantation of settlers and settlements” unlawful and that the State undertaking such an exercise, as well as individuals, making decisions on its behalf will have criminal responsibility.\nMoreover, President Khan said that Article II of 1948 Genocide Convention recognizes that a crime of genocide and it clearly depicts the situation in the Indian Occupied Jammu and Kashmir.\nArticle II, he said, defines genocide as any of the acts committed with the intent to destroy in whole or part a national, ethnical, racial or religious group.\n“This is what is happening in Indian Occupied Jammu and Kashmir”, he said.\nKhan said that the Muslim majority of the disputed State of Jammu and Kashmir aspire to decide their political future by exercising their right to self-determination but India has chosen to crush these aspirations of the entire Kashmiri nation and is now in the process of altering the occupied territory to a Hindu Rashtra.\nHe said that the world is aware of the heinous and punishable crimes the BJP-RSS regime is committing in the Indian Occupied Jammu and Kashmir. India’s crimes against humanity, he said, have been highlighted by the world media, influential parliaments and civil society.\nPresident AJK said that despite this overwhelming evidence, the world’s most powerful nations, who present themselves as custodians of human rights law, have not moved; and they have no intention to move. “This is complicity; this is a dereliction of legal obligations on their part”, he said.\nMasood Khan said that the Kashmir movement has to be turned into an international civil rights movement to get Kashmiris out of this living inferno and this has to be a people’s movement at the global level.\n“We must activate the political pincer with the participation of the diaspora community and international civil society to demand justice for Kashmiris. There are no shortcuts to achieving this goal.”\n“We should move out of closed-room meetings and diplomatic chambers because the crimes being committed in Kashmir are crimes against humanity”, the state president concluded.",
  "retrievedAt": "2025-08-11T20:15:06.696Z"
}
