{
  "title": "Shibli agrees with PML-N Senator to form Committee of Whole on Broadsheet issue",
  "link": "https://www.app.com.pk/national/shibli-agrees-with-pml-n-senator-to-form-committee-of-whole-on-broadsheet-issue/",
  "date_published": "2021-01-18T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Monday endorsed the proposal of a senior legislature of Pakistan Muslim League-Nawaz (PML-N) to form a Committee of Whole of the Senate to discuss the Broadsheet issue in detail.\n“I respect the thoughts of (PML-N Senator) Javed Abbasi and fully agree with his suggestion to form a committee of the Whole of the Senate to discuss the issue of Broadsheet in detail, so that the nation could know the truth who actually behind it,” he said while speaking in the Senate.\nEarlier making the suggestion, Senator Javed Abbasi said it would be a test case for the Senate. The nation must know the truth as to who was the beneficiary and who had done the agreements.\nAbbasi requested the Senate chairman to constitute the committee.\nAdvisor to Prime Minister on Interior and Accountability Barrister Shahzad Akbar said the Broadsheet case had been made public on the directives of Prime Minister Imran Khan.\nSharing the details, he said, “We are paying the price of NROs (National Reconciliation Ordinances) given by the past government to the corrupt elements.”\nHe said the NROs had cost the national exchequer as Pakistan was compelled to pay 20 percent of the detected corruption money stashed abroad to the Broadsheet.\nThe looted money could not be recovered owing to the deals inked by the past rulers with Nawaz Sharif and other corrupt elements.\nHe said the agreements were signed with the Broadsheet and International Assets Recovery by the National Accountability Bureau (NAB) during the time of Pervaiz Musarraf for detection of corruption money abroad.\nHe said PML-N chief Nawaz Sharif left for Saudi Arabia in December 2000 after getting an NRO from General Pervaiz Musharraf, and NAB cancelled the agreement with the Broadsheet in October 2003.\nThe Broadsheet was paid twice $2.25 million and $ 1.25 million in 2008 after signing of settlement agreements during the tenure of Yousaf Raza Gilani, he added.\nShahzad Akbar alleged that the Broadsheet judgment was kept hidden by the PML-N government.\nMaulana Abdul Ghafoor Haideri of JUI-F alleged that rigging had been done in the elections of Gilgit Baltistan.\nDeputy Chairman Saleem Mandviwalla criticized the economic policies of the PTI government and questioned the role of NAB in conducing accountability.",
  "retrievedAt": "2025-08-11T20:15:04.292Z"
}
