{
  "title": "COVID-19 claims 46 lives, over 1,920 new Coronavirus cases reported",
  "link": "https://www.app.com.pk/national/covid-19-claims-46-lives-over-1920-new-coronavirus-cases-reported/",
  "date_published": "2021-01-18T09:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):The national tally of total active COVID-19 cases in Pakistan on Monday reached to 34,986 with 1,920 more people tested positive for the deadly virus and 1,589 people recovered from the coronavirus during the last 24 hours.\nForty Six coronavirus patients, 39 of whom were under treatment in hospital and Seven were in their respective homes or quarantines died on Sunday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab followed by the Sindh.\nIt added that out of the total 46 deaths during the last 24 hours 30 patients died on ventilators.\nNo COVID-19 affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan while 325 ventilators were occupied elsewhere in Pakistan.\nThe maximum ventilators were occupied in four major areas including Multan 49 percent, Islamabad Capital Territory (ICT) 31 percent, Bahawalpur 55 percent and Lahore 36 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID-19 patient) was also occupied in Four major areas of Peshawar 44 percent, Multan 38 percent, Karachi 40 percent and Rawalpindi 26 percent.\nSome 37,949 tests were conducted across the country on Sunday including 10,945 in Sindh, 15,195 in Punjab, 6,071 in Khyber Pakhtunkhwa (KP), 4,478 in Islamabad Capital Territory (ICT), 543 in Balochistan, 376 in GB and 341 in AJK.\nAround 475,228 people have been recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 521,211 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 8,631, Balochistan 18,612, GB 4,884, ICT 40,111, KP 63,615, Punjab 149,782 and Sindh 235,576.\nAbout 10,997 deaths were recorded in country since the eruption of the contagion. Around 3,793 perished in Sindh among 18 of them died on Sunday. 14 of them died in hospital and Four out of the hospital.\n4,432 in Punjab had died with 23 deaths in past 24 hours. 20 of them perished in the hospital and three out of the hospital.1,783 in KP where Four of them died in hospital on Sunday, 457 in ICT where One of them died in the hospital on Sunday, 190 in Balochistan, 101 in GB and 241 in AJK succumbed to the deadly virus in hospital.\nA total of 7,405,571 corona tests have been conducted so far, while 631 hospitals are equipped with COVID-19 facilities. Some 2,849 coronavirus patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:15:09.963Z"
}
