{
  "title": "SAFRON, UNHCR announce emergency cash assistance programme for COVID-19 affectees",
  "link": "https://www.app.com.pk/national/safron-unhcr-announce-emergency-cash-assistance-programme-for-covid-19-affectees/",
  "date_published": "2020-05-11T23:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):The Government of Pakistan, the Ministry of States and Frontier Regions (SAFRON) and the United Nations High Commissioner for Refugees (UNHCR), in collaboration with the Pakistan Post Office Department, have announced an emergency cash assistance initiative benefiting the most vulnerable refugee families impacted by the COVID-19\npandemic in Pakistan.\nThe emergency cash is similar to the Federal Government’s Ehsaas emergency cash programme, where vulnerable families receive Rs.12,000 to cover a four-month period. The emergency assistance will help eligible refugee families to meet their urgent needs during the COVID-19 pandemic.\nThe UNHCR Deputy Representative in Pakistan, Iain Hall, and the Chairman/Director General of Pakistan Post Office Department, Akhlaque Rana, signed an agreement for the disbursement of the emergency cash grants.\nThe Federal Minister for SAFRON, Sahabzada Mehboob Sultan, the Secretary for SAFRON, Muhammad Aslam Kamboh, and the Chief Commissioner for Afghan Refugees, Saleem Khan, fully supported the initiative.\nOver the past weeks, UNHCR and the Commissionerate for Afghan Refugees, with the collaboration of partners, volunteers and refugee community leaders, have carried out vulnerability assessments to identify the most needy\nrefugee families. Those eligible for the emergency assistance include refugees with disabilities or serious medical conditions, as well as single parents.\nHall said many thousands of vulnerable refugees lost their only source of income in the current coronavirus spread. “UNHCR is very concerned by the growing destitution of refugee families who solely depend on daily wages. We hope that this emergency assistance will help the most vulnerable get through this health pandemic,” said Hall.\nHe added that UNHCR would initially target 36,000 refugee families, noting that if additional donor funds are secured,\nthe humanitarian support would be expanded to many more needy families.\nSultan expressed his gratitude for UNHCR’s partnership in response to the COVID-19 situation, and appealed for strong support from the international community to Pakistan at this unprecedented and extremely challenging time.\n“Afghan refugees should not feel left out. They are as important and as dear to us as they were 40 years ago, and Pakistan would do everything it takes within its competency and even beyond,” said Sultan.\nThe Chairman/Director General of Pakistan Post, Rana said the “Pakistan Post Office Department is committed to delivering this vital emergency cash assistance to refugees”.\nHe expressed his appreciation for this new partnership with UNHCR and his resolve to carry out this task at hour of need.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:35.073Z"
}
