{
  "title": "NCOC launches joint initiative with provinces for protecting healthcare workers",
  "link": "https://www.app.com.pk/national/ncoc-launches-joint-initiative-with-provinces-for-protecting-healthcare-workers/",
  "date_published": "2020-05-12T00:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):The National Command and Operation Centre (NCOC) Tuesday launched a joint initiative to support the steps and efforts undertaken by the provinces for protecting the healthcare workers who were on the front line in the fight against the coronavirus.\nThe campaign ‘We Care’ was being undertaken to protect the healthcare professionals keeping in view the future projections about the rise in number of corona positive cases, Special Assistant to the Prime Minister on Health (SAPM) Dr Zafar Mirza said while chairing the meeting of NCOC.\nThe NCOC discussed the issues being faced by the healthcare workers of all the provinces including Gilgit Baltistan (GB) and Azad Jammu and Kashmir (AJK). The provincial health ministers joined the meeting through video link.\nDr Zafar Mirza said the increasing number of COVID-19 patients along with doctors and paramedics being infected with the contagion, had created a national anxiety. Around 10 percent healthcare professionals had contracted the coronavirus and majority of them were not directly related to the critical healthcare units dealing with the corona patients.\nHe said the Shuhada Package announced by the Federal Government for the families of healthcare professionals sacrificing their lives in the line of duty during the pandemic, was also extended to the GB and the AJK.\nThe provincial health ministers apprised the meeting that the healthcare professionals lacked the expertise to use the personal protective equipment as the pandemic risk was witnessed by them for the first time. They demanded a unified incentive package for the healthcare workers and departments who were fighting the coronavirus.\nA memorandum of understanding was also signed between the World Health Organization and the Ministry of Health.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:32.331Z"
}
