{
  "title": "NCOC directs to ensure health SOPs implementation; doctors, paramedics’ training",
  "link": "https://www.app.com.pk/national/ncoc-directs-to-ensure-health-sops-implementation-doctors-paramedics-training/",
  "date_published": "2020-05-12T01:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):The National Command and Operation Centre (NCOC) on Tuesday directed to ensure implementation of health standard operating procedures (SOPs) and proper training of doctors and paramedics, fighting as the frontline force against COVID-19 pandemic.\nThe NCOC, headed by the Minister for Planning Development Reforms and Special Initiatives Asad Umar, was apprised by Special Assistant to the Prime Minister on Health Dr Zafar Mirza that the Ministry of National Health Services Regulations and Coordination was going to launch the camping ‘WE CARE ’ for protection of the healthcare workers.\nA draft of the guidelines in this regard was ready to be shared with the provincial health ministers for further implementation, Dr Zafar informed the meeting.\nThe campaign is aimed at bringing all medical workforce on the same page for using personal protective equipment (PPEs), link PPE utilization with supply and bridge gaps between hospital administrations and the government.\nAround one lac health workers would get training on the guidelines through webinars, telehealth portal to be used in this process where it would also provide counseling and stress management facilities to doctors getting exhausted and stressed due to workload, the meeting was further informed.\nSpeaking on the occasion, Asad Umar said there was need to devise new strategy and planning after May 9 situation.\nHe directed all the ministers and quarters concerned to come up with draft plans aimed at dealing with the worst case scenarios as ease in the lockdown would increase pressure on the healthcare system and management which may persist till June and July.\nMinister for Interior Brig (R) Ejaz Ahmed Shah, Minister for Industries and Production Hammad Azhar, Minister for National Food Security Syed Fakhar Imam, Adviser to the Prime Minister on Commerce Textile and Investment Abdul Razak Dawood, Prime Minister’s Focal Person on COVID-19 and others attended the meeting.",
  "retrievedAt": "2025-08-11T19:12:28.076Z"
}
