{
  "title": "Cabinet decides to amend laws for appointing heads of public sector institutions",
  "link": "https://www.app.com.pk/national/cabinet-decides-to-amend-laws-for-appointing-heads-of-public-sector-institutions/",
  "date_published": "2020-05-12T05:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):The Federal Cabinet on Tuesday decided to amend relevant laws for appointments in various government departments, especially their heads, to induct best human resource in the public sector organizations.\nBriefing the media about the decisions taken in the cabinet meeting chaired by Prime Minister Imran Khan here, Federal Minister for Information and Broadcasting Senator Shibli Faraz said the PM had constituted a committee headed by Adviser on Institutional Reforms Dr Ishrat Hussain, which would present its recommendations in that regard within one week. The PM directed Minister of Law and Justice Farogh Naseem to prepare draft amendments in the relevant laws like ESTA Code, Companies Act and Corporate Governance Rules.\nShibli Faraz said the cabinet was briefed on the progress made in the electoral reforms process.\nBriefing about the salient features of the proposed reforms, Minister for Narcotics Control Azam Swati, formerly Parliamentary Affairs Minister, said the recommendations made by the electoral reforms committee included timely delivery and announcement of election results, finalization of the action plan by political parties four months before the election, time for delimitation of constituencies and permission to a candidate to appoint five agents. The presence of nominated representatives of respective candidates during vote counting, reforms regarding women quota, election expenses, basis of delimitation and steps to address the lacunas in the process, right of vote for expatriate Pakistanis and biometric voting were also parts of the proposals.\nThe PM, while appreciating the proposals, said all the lacunas in the election laws would be addressed so that the people’s trust in the election process was restored and nobody could raise a finger on the transparency of election. A transparent and credible electoral process was the foundation of democracy and the Pakistan Tehreek-e-Insaf (PTI) was the only party which had taken serious efforts and practical steps for electoral reforms.\nExpressing the government’s commitment, the prime minister directed to intensify efforts so that electoral reforms process should be completed as soon as possible.\nShibli Faraz said the cabinet discussed the issue of unlawful appointments made in various ministries during the previous governments. It transpired that appointments without any cabinet approval were made in 12 ministries. Expressing his serious concern, the prime minister directed all the ministries to share details in next cabinet meeting so that action could be taken on the issue.\nThe minister said during the discussion on cotton crop, the prime minister directed that its support price should be fixed after thorough consultations with all the stakeholders in order to encourage the farmers to sow more cotton as its ratio had dropped during the past two decades.\nThe PM was in favour of giving subsidies on cotton seed and fertilizer, so that poor growers could benefit, he added.\nSenator Shibli Faraz said the cabinet also approved the names of the members of National Commission on the Status of Women, including Shaista Bukhari from Punjab, Habiba Hassan from Sindh, Rubina Naz Advocate from Khyber Pakhtunkhwa, Fatima Iqbal from Balochistan, Madhiha Sultana from AJK, Sosan Aziz from Gilgit Baltistan and Asia Azeem from the Federal Capital.\nThe cabinet also approved the decisions taken by the Cabinet’s Committee on Energy and Economic Coordination Committee.\nThe minister said the PM directed steps for provision of energy to the consumers at affordable rates and reduction of the circular debt. He also directed the minister for energy to complete the process of reformation in various departments of the ministry with a time line.\nThe information minister said the cabinet reviewed the matters pertaining to the audit survey regarding embezzlement at the Karachi Port Trust.\nHe said Minister for Planning and Development Asad Umar gave a briefing on the steps being taken to control the coronavirus in the country and presented the report on the situation after relaxation in the lockdown.\nAddressing the cabinet meeting, the prime minister said lockdown was a temporary process which could limit the spread of the virus to some extent but it was necessary to take precautionary\nmeasures as much as possible to avoid the pandemic. The decision to ease the lockdown was taken keeping in view the economic situation and the plight of the common man, especially the daily wagers.\nImran Khan remarked that activities in the construction and other sectors had even been allowed by the developed countries keeping in view the ground realities. Keeping the economy afloat and balancing security measures was imperative, he added.\nShibli Faraz it was observed that generally the people did not adopt precautionary measures and the cabinet appealed to them to strictly follow the standard operating procedures (SOPs) as the\ncountry could not afford surge in the coronavirus cases.\nHe said there was need of a balance between economic activities and social distancing to run the country’s affairs of the country. It was the national responsibility of all citizens to observe social distancing as the countries, where the practice was followed by the citizens, had succeeded to control the pandemic to a great extent.\nThe minister said no state had unlimited resources to give subsidies and relief packages to their population for a long time. No country could afford continuous lockdown and the decision to ease the countrywide lockdown in Pakistan was taken in view of the difficulties being faced by poor labour class.\nThe government had limited resources and infrastructure, and continuous lockdown was not possible under the prevailing conditions, he added.\nReplying to questions, Shibli Faraz asked the opposition to raise the issue of 18th Constitutional Amendment in the Parliament instead of triggering a controversy through television talk shows. It was not the only one constitutional amendment, rather many other constitutional amendments part of the Constitution and should not be made controversial by the opposition.\nHe referred to the bills introduced by Senator Abdul Qayyum of Pakistan Muslim League-Nawaz about amendments, concerning the Election Commission of Pakistan, which were also part of the 18th Amendment. Likewise, every member of the Parliament had the right to move amendments, he added.\nAbout the opposition’s calls for amending the National Accountability Act, he said it should be seen in a specific perspective. Whenever any opposition leader was arrested or faced allegations by the nti-graft body, his party people started blasting it.\nHe said like many other institutions, the National Accountability Bureau (NAB) might have capacity issues and its performance might not be up to the mark. The opposition parties, which wanted to change its law, might have done so in the past when they were in government instead of using the Bureau against each other.\nIn that respect, he referred to the bill of Pakistan Peoples Party’s Senator Farooq H Naek on NAB’s powers, which was to be taken up by the National Assembly for deliberations. The opposition should better take up this matter in the Parliament, as, otherwise, it would serve no purpose, he added.\nHe said there should be discussion in the Parliament on the constitutional amendments and if any party had the required number of members that it would get the same passed. There was no need to create controversies, he stressed.\nTo a question, he said Prime Minister Imran Khan would definitely come to the Parliament. He was massively busy in dealing with the corona challenge and other matters.\nHe, however, pointed out that the champions of democracy should also be asked as to why they were staying away from the parliamentary sessions. They had been taking a lot about summoning of the sessions, he recalled, adding he had already highlighted that they just clamoring but would not attend the sessions.\nHe said the prime minister was not coming to the Parliament as he was running the country’s affairs, but where was the Leader of Opposition; who was just sitting before a computer. The people were well aware of such hypocrisy and dual standards. he added.\nRegarding major issues like IPPs probe, NFC and presentation of the budget, the minister said the prime minister was doing multi-tasks and as he believed in teamwork he would successfully handle all the challenges.\nPrime Minister Imran Khan, he said, believed in transparency. The government had no idea about the outcome of the sugar and wheat probe but it had ordered it and made the report public which showed its sincerity. There was delay in the matter due to the coronavirus, which was causing problems in access to the relevant record.\nHe said the prime minister had given one more week for furnishing the lists of illegal appointments in ministries and departments in view of large number of appointments. He would brief the media about the details in that regard next week.\nTo a question about the reports of replacement of Sindh Governor, he said that after recovering from the virus, Governor Imran Ismail would resume his duties soon.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:24.918Z"
}
