{
  "title": "President constitutes 10th NFC",
  "link": "https://www.app.com.pk/national/president-constitutes-10th-nfc/",
  "date_published": "2020-05-12T07:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):President Dr Arif Alvi has constituted the 10th National Finance Commission (NFC), with effect from April 23, 2020, to work out a resource distribution mechanism between the federation and the provinces.\nThe president authorized Advisor to Prime Minister on Finance and Revenue Dr. Abdul Hafeez Shaikh, in the absence of Federal Minister for Finance, to chair the meetings of the commission, which was constituted under Article 160(1) of the Constitution of the Islamic Republic of Pakistan, according to a notification issued by the NFC Secretariat, Finance Division, here on Tuesday.\nThe 10-member commission comprises federal finance secretary as the official expert, four provincial finance ministers, and four technical members of the provinces, including Tariq Bajwa, Dr. Asad Sayeed, Musharraf Rasool Cyan, and Javed Jabbar.\nAccording to the terms of reference of the commission, it would devise a formula for distribution between the federation and the provinces of the net proceeds of different taxes, including taxes on income, sales and purchase of goods and export duties.\nThe ToRs also include making of grants-in-aid by the Federal Government to the provincial governments; exercise by the Federal Government and the provincial governments of the borrowing powers conferred by the Constitution; assessment and allocation of resources to meet expenditures related to the Azad Government of States of Jammu and Kashmir, Government of Gilgit-Baltistan and newly merged districts of Khyber Pakhtunkhwa (erstwhile FATA); assessment and allocations of resources to meet expenditures made on security and natural disasters/calamities.\nThe commission would also make an assessment of total public debt and allocations of resources for its prepayment; rationalization of subsidies given by the federal and provincial governments in their budgets and agreeing on a mechanism for financing them; explore ways to reduce losses of state-owned enterprises and agreeing on a mechanism for sharing the losses between the federal and provincial governments; and consider any other matter relating to finance referred to it commission by the president.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:24.854Z"
}
