{
  "title": "Lawmakers call for national unity to deal with COVID-19 challenges",
  "link": "https://www.app.com.pk/national/lawmakers-call-for-national-unity-to-deal-with-covid-19-challenges/",
  "date_published": "2020-05-12T01:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):Senators on Tuesday stressed the need to devise an effective national action plan besides forging unity to deal with the unprecedented challenges posed by coronavirus (COVID-19).\nOpening debt on various motions that the House may discuss the grave situation arising out of coronavirus epidemic, Leader of the Opposition in the Senate, Raja Zafarul Haq said the federal and provincial governments should be on the same page to contain the spread of Coronavirus.\nHe said the government should have summoned the sessions of both Houses due to grave situation due to COVID-19. Unfortunately both sessions were not summoned and the opposition had to requisition the session, he added. He was of the views that the constitutional institutions should be fully functional in such critical time.\nZafarul Haq said it was high time to forge national unity and unison , rather than dividing the nation in this critical time.\nHe opposed the relaxation in lockdown, saying it may lead to increase in Covid-19 cases. Lockdown was eased despite specific reservations of doctors and health practitioners, he added.\nLeader of the Opposition Raja Zafarul Haq appreciated the consistent assistance being extended by China to Pakistan in the battle against COVID-19 the virus.\nHe regretted that a ‘super power’ was unduly blaming China for spread of the\nvirus, which was false and baseless.\nThe Leader of Opposition also expressed concerns over the oppression\nunleashed by Modi government in Occupied Jammu and Kashmir and massacre of Muslims in India.\nHe said occupied Kashmir people had no access to medical supplies and\ntreatment due to lockdown.\nTaking part in the debate Sherry Rehman of Pakistan People’s Party Parliamentarian (PPPP) said that unwarranted hate campaign had been launched against his party and provincial Sindh government.\nShe said such tactics would vitiate the political atmosphere. National unity was need of the hour to deal with unprecedented challenge posed by coronavirus, she added.\nShe said meeting of Council of Common Interest was not convened although it\nwas an appropriate constitutional forum.\nShe said only corona virus issue should be discussed in current scenario.\nMusadik Malik of PML-N said opposition parties in the House wanted to give\nsome positive suggestions to make the strategy on COVID-19 more effective.\nHe said the there should be an effective lockdown even after Eidul Fitr as\nwas imposed in early weeks after the virus hit the country.\nFirst, he said there was the need to annihilate the virus by imposing\na 4 to 6-week lockdown, following which it could be eased gradually after\nassessing situation on ground.\nHe called for bifurcating the whole country on wards and unions councils\nbasis, adding there should be 100 percent testing of the all those having the\nvirus symptoms. Besides, the localities should be categorized as Red,\nYellow and Green zones, he added.\nMushtaq Ahmed of Jamaat-e-Islami criticized the easing of the lockdown\nat a time when the number of COVID-19 patients was increasing in the\ncountry.\nHe suggested the government to increase the virus testing capacity and\nprovide all necessary safety equipment to health workers and doctors, who\nwere playing a role of frontline warriors.\nHe called for devising a National Action Plan to effectively combat the\nlooming threat of the deadly virus that took hundreds of thousands lives\nacross the world in just a few months.\nHe also expressed concern over the deteriorating economic situation\nand underlined the need for taking remedial measures.\nPML-N’s Javed Abbasi said there should be strict screening of all those\nentering Pakistan either through air or ground route. The situation would be\nbetter, if the screening was carried out in letter and spirit, he added.\nHe underlined the need for increasing the virus testing capacity across\nthe country, and review the strategy of easing the lockdown as the number\nof cases was increasing with each passing day.\nAbbasi said it was not the time of political point-scoring, but to exhibit\na greater unity and evolve a consensus strategy to stem the spread\nof the virus.\nLater, Chairman Sadiq Sanjrani adjourned the House to meet again on\nThursday at 12:00 p.m.",
  "retrievedAt": "2025-08-11T19:12:27.754Z"
}
