{
  "title": "Govt launches “We Care” program for health professionals’ online training",
  "link": "https://www.app.com.pk/national/govt-launches-we-care-program-for-health-professionals-online-training/",
  "date_published": "2020-05-12T01:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):The Ministry of National Health Services, with the support of World Health Organization (WHO), on Tuesday launched countrywide “We Care” program for online training and guidance of medical professionals on health protocols and use of personal protection equipment (PPE) kits.\nIn this regard an agreement was signed between Health Services Academy (HAS) and WHO at National Command and Control Centre (NCOC).\nCountry head WHO Dr Palitha Mahipala signed the agreement from WHO while Special Assistant to the Prime Minister on National Health Services Dr Zafar Mirza was also present on the occasion.\nLater, in a media briefing on the program, Dr Zafar Mirza said the main objective of this national program was to start online professional training of over 100,000 frontline health workers across the country.\nHe said these frontline health workers were our real heroes and their safety and protection was the top priority of the government, adding provision of PPE kits to the hospitals was no more an issue now.\nHe said the government had started providing PPE kits directly to the hospitals where corona patients were under treatment through National Disaster Management Authority (NDMA).\nHe added that sufficient quantity of health equipment was available for hospitals staff while provinces were also busy to ensure provision of PPE kits to hospitals.\nHe said the government was making all out efforts to ensure safety of frontline health workers who were contributing in fight against coronavirus through effective training mechanism with the support of provinces and stakeholders including Pakistan Medical Association (PMA).\nParticipating in media briefing through video-link, Provincial Health Minister Punjab Dr Yasmin Rashid said the Punjab government was making sincere efforts for ensuring safety of health staff against COVID-19 who were deployed at hospitals.\nProvincial Health Minister Sindh Dr Azra Fazal Pechuho said through “We Care” program the provincial governments would be able to properly train the frontline health workers to ensure their safety.\nShe offered full support in fight against COVID-19 and training of health staff.\nParliamentary Secretary Health Balochistan Dr Rubaba Buledai said the government of Balochsitan was working in an effective manner for safety of health workers and expressed the hope that this national level program would help improving professional skills of health professionals.\nShe assured that the provincial government would implement all guidelines related to the COVID-19 and safety of health staff.\nShe assured full support of the provincial government in efforts of federal government against COVID-19.\nHealth Minister Azad Jammu and Kashmir (AJK) Dr Najeeb Naqi appreciated the launching of this national program and assured full coordination and support of the AJK government.\nSecretary Health Gilgit Baltistan Raja Rasheed Ali congratulated the federal government for making an effective strategy against Coronavirus and added that “We Care” program would ensure safety of health workers through their proper training.\nHe said doctors and health staff were rendering great services at hospitals in fight against COVID-19.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:30.486Z"
}
