{
  "title": "Pakistani photographers dominate ECO Exhibition in Ankara",
  "link": "https://www.app.com.pk/national/pakistani-photographers-dominate-eco-exhibition-in-ankara/",
  "date_published": "2024-12-16T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Pakistani photographers Toori and Ali dominated during seven days Photographic Exhibition of ECO Member States, kicked off at the Esztergom Castle Turkish Cultural Center in Keçiören, Ankara.\nThe exhibition attracted diplomats and people from all walks of life, was arranged by Tehran-based ECO Cultural Institute (ECI)—the cultural specialized agency of the ten-member Economic Cooperation Organization, in collaboration with the the Keçiören Municipality and diplomatic mission of Pakistan, said a press release received here from Ankara.\nTitled “Frames of Friendship: A Photographic Tribute to ECO Cultures”, the event showcased the work of six renowned photographers belonging to Turkiye, Pakistan, Iran and Afghanistan.\nDuring his remarks, Dr. Saad S Khan, President of ECI, highlighted the diverse cultural heritage of ECO member states emphasizing the importance of fostering cultural cooperation between the ten ECO member states by showcasing each other’s calligraphy, poetry, painting, photographs, and music. He expressed his deep connection to Turkey, calling it his second home.\nSultan Bey, the head of foreign affairs committee in Turkish Parliament; Atila Zorlu, Vice Mayor of Keçiören Municipality; Yousaf Junaid, Pakistan’s ambassador to Turkiye, and Dr. Ghasem Nazemi, Cultural Counsellor of Iran in Ankara also spoke on the occasion.\nThe speakers underscored the strong cultural ties between ECO member states. Deputy Mayor spoke about his vision of making Keçiören a bridge for all ECO countries, emphasizing the importance of fostering deeper ties between the nations in the region.\nThe meeting also offered prayers for the departed souls of military officers who died in the Isparta Army Aviation School helicopter tragedy the day before.\nThe exhibition featured the works of photographers Muzammil Toori, Sajad Heydari, Aytaç Ünal, Aigerim Begimbet, Ali Tahir and Samaneh Rustami. The photographs offered a glimpse into the beauty, traditions, and unity of the ECO region.\nThe exhibition is open to the public at the Esztergom Castle Turkish Cultural Center in Ankara for the next seven days.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:50:02.288Z"
}
