{
  "title": "Huawei, PTA organize National Broadband Network Forum 2024",
  "link": "https://www.app.com.pk/national/huawei-pta-organize-national-broadband-network-forum-2024/",
  "date_published": "2024-12-16T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Huawei and the Pakistan Telecommunication Authority (PTA) jointly organized the National Broadband Network Forum 2024 on Monday under the theme “Gigabit for All.”\nThe event was addressed by Chairman Senate Yousaf Raza Gillani, Minister for State for Information Technology and Telecommunication Shaza Fatima and Chairman PTA Major General (R) Hafeez-ur Rehman.\nThe chairman Senate commended PTA’s role in enhancing broadband penetration, noting a milestone of 59% but stressing the need to address the remaining gaps.\nHe also expressed appreciation for Huawei Pakistan’s commitment for ICT sector enablement over the past many years, “Huawei, has been a major partner in the digital transformation of Pakistan, and we are looking forward to working closely together to further enable the industry in the fields of AI, Cloud and Big Data.”\nMinister of State for IT, Shaza Fatima Khawaja assured the government’s continued support to the telecom sector in bridging the digital divide. Chairman PTA highlighted the importance of collaboration and innovation in achieving universal connectivity. Secretary MoIT pledged sustained efforts toward building a digitally inclusive Pakistan.\nAamir Ibrahim, CEO Jazz said, “We applaud PTA’s leadership in fostering collaboration and driving initiatives like the National Broadband Network Forum, which are instrumental in shaping Pakistan’s digital future. With a broadband penetration milestone of 59%, it is clear that strategic partnerships—such as those with PTA and technology leaders like Huawei—are vital in advancing internet accessibility, AI-driven innovation, and broadband infrastructure. At Jazz, we remain steadfast in our commitment to working alongside PTA and other stakeholders to ensure that digital transformation empowers growth, inclusion, and progress for all Pakistanis.”\nHuawei’s CEO reaffirmed the commitment to providing cutting-edge broadband solutions, furthering Pakistan’s digital transformation. CEO Jazz and NERA PTA’s 5G consultants also shared their dedication to enhancing broadband infrastructure across the country.\nThe event underscored the collective commitment to advancing Pakistan’s broadband infrastructure and fostering a smart, connected future. The NBN Forum 2024 is the second in a series of international forums hosted by PTA, focusing on increasing broadband penetration in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:49:39.699Z"
}
