{
  "title": "Siddiqui stresses PTI must tackle legal cases head-on, foreign help won’t work",
  "link": "https://www.app.com.pk/national/siddiqui-stresses-pti-must-tackle-legal-cases-head-on-foreign-help-wont-work/",
  "date_published": "2024-12-16T17:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Senator Irfan Siddiqui, parliamentary party leader of the Pakistan Muslim League (N) in the Senate on Monday said the only way forward for PTI chairman is to face court cases, as relying on foreign governments for release is not an option.\nSpeaking to the media outside Parliament House on Monday, he said he is unsure of newly elected US President Donald Trump’s priorities and his level of involvement in other countries.\nHe said he knows of a prisoner in Pakistan who assisted the US in finding Osama, and the US has repeatedly requested his release. Despite many governments coming and going, the prisoner remains in Pakistan’s custody.\nSiddiqui said that since Pakistan did not hand over the prisoner to the US, he does not believe any country, including America, will interfere in Pakistan’s internal affairs.\nHe added that the tragedy of PTI is that instead of addressing matters in court according to the constitution, laws, and rules, they turn it into an international issue through propaganda, both internal and external, including social media, tarnishing Pakistan’s image. They even claim that more atrocities are being committed in Pakistan than in Gaza.\nPTI claims that the atrocities happening in Pakistan are worse than those in Indian Illegally occupied Jammu and Kashmir. Senator Irfan Siddiqui said these individuals have no respect for their country or its honor.\nHe added that the right course for them is to face their cases in court, and if acquitted, so be it. Siddiqui emphasized that relying on foreign leaders or governments to secure their release will not work.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:48:17.502Z"
}
