{
  "title": "Six cochlear implant surgeries conducted at PIMS",
  "link": "https://www.app.com.pk/national/six-cochlear-implant-surgeries-conducted-at-pims/",
  "date_published": "2024-12-16T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Six cochlear implant surgeries successfully conducted at Pakistan Institute of Medical Sciences (PIMS) with the support of UK-based charity organization.\nIn a major step toward improving healthcare access for hearing-impaired children, six deserving candidates received free cochlear implants at the Children’s Hospital, PIMS.\nThis initiative was carried out by the UK-based charity organization International Medical Relief Agency (IMRA) in collaboration with Islamabad Courses of ENT (ICE).\nThe surgeries were performed by Dr. Noweed Ahmed, a UK-based specialist from James Cook University Hospital, as part of an ongoing program.\nThis effort follows similar projects in October 2022 and December 2023, where six children received implants each year.\nExecutive Director of PIMS, Prof. Dr. Imran Sikandar, expressed his gratitude and highlighted the significance of the initiative.\n“We are proud that PIMS is becoming a hub for cochlear implants. After reviewing over two dozen cases, six deserving children were selected for these life-changing procedures.”\nHe said, “While we aim to institutionalize this service, we are facing severe funding challenges. We plan to seek government support to ensure this facility becomes widely available to the most deserving children.”\nDr. Sikandar also cited data from the World Health Organization (WHO), noting that as of October 2018, 10 million Pakistanis were living with some form of hearing impairment.\nHe emphasized that early intervention is essential for children born deaf or those who lose hearing before developing speech, as untreated hearing loss can result in lifelong disabilities.\nProf. Dr. Altaf Hussain, Head of the ENT Department at PIMS, described the importance of cochlear implants and acknowledged the role of IMRA in making the surgeries possible.\nHe said, “Blindness separates us from things, but deafness separates us from people.”\nHe said that a cochlear implant is a sophisticated electronic device that stimulates the cochlear nerve to restore hearing.\nHe said thar public-sector hospitals in Pakistan lack the resources to offer such procedures, leaving families at the mercy of private providers who charge over Rs 03 million per surgery.\nHe elaborated on IMRA’s contribution, crediting its founder, Dr. Haroon Khan, for his continued support.\n“IMRA has been instrumental in providing free surgeries for deserving children, with Dr. Haroon Khan assuring us of biannual visits for similar programs.”\nHe said this initiative not only brings relief to families but also helps PIMS build capacity to offer these procedures independently in the future.”\nThe cost of cochlear implant surgeries, estimated at Rs. 3.5 million in the private sector, remains a significant barrier for most families in Pakistan.\nWith IMRA’s support, PIMS aims to make this life-changing technology accessible to the underprivileged, laying the foundation for a sustainable program to address hearing impairments across the country.",
  "retrievedAt": "2025-08-10T13:48:22.019Z"
}
