{
  "title": "Free-of-cost TB treatment facilities being provided to people; NA told",
  "link": "https://www.app.com.pk/national/free-of-cost-tb-treatment-facilities-being-provided-to-people-na-told/",
  "date_published": "2024-12-16T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Federal Parliamentary Secretary for Health Nelson Azeem on Monday admitted that tuberculosis cases were increasing in the country and as many as 1,841,000 cases had been reported across the country.\nResponding to a question during the question hour of the 11th session of the 16th meeting of the lower house of the Parliament, he said that 9312 cases had been recorded in the federal capital while free-of-cost medicines and treatment facilities were being provided to the patients.\nAnswering another question, Nelson told the House that the prices of heart stents were determined by the price controlling committee during its quarterly meeting established under the Drug Regulatory Authority of Pakistan linked with dollar fluctuation rates.\nIn addition, a National Intervention Cardiology Board has also been set up which is responsible for checking the quality of stents.\nAnswering a question by MNA Sehar Kamran, he said that actions were taken to prevent the spread of dengue while several cases were pending in various courts over non-compliance of Anti Dengue SOPs.\nTo a question from PML(N) MNA Nuzhat Sadiq, Nelson Azeem told the House that biometric attendance system was installed at the Tehsil Headquarters Hospitals, but this system was not functional at the Basic Health Units and Rural\nNelson told the House that doctors recruitment was carried out by the Federal Public Service Commission (FPSC), however, the health ministry has written a letter to FPSC for required appointments against sanctioned posts.\nHe added that doctors were also being recruited on a contract basis so that the provision of basic health facilities could continue to provide health treatment facilities to the people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:48:18.655Z"
}
