{
  "title": "Pakistan committed to promoting marine cooperation: President Asif Zardari",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-promoting-marine-cooperation-president-asif-zardari/",
  "date_published": "2024-12-16T09:42:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 16 (APP): President Asif Ali Zardari has reaffirmed Pakistan’s commitment to promoting regional marine cooperation and ensuring peace, progress and sustainability in the Indian Ocean region.\nAddressing the 3rd China-Indian Ocean Region Forum on Blue Economy Cooperation held in Kunming, China, via a video message, the President stressed the need for collective action to harness the ocean’s potential while addressing the pressing challenges of climate change, pollution and ecosystem degradation.\n“Pakistan stands ready to partner with all stakeholders to promote marine cooperation and ensure that our region remains a bastion of peace, progress, and sustainability,” the president said.\nThe forum, held from December 14 to 16 in Kunming, China, is organised by the China International Development Cooperation Agency (CIDCA) and focuses on promoting collaboration among countries in the maritime sector.\nThe president said that the future world economic growth was going to be driven by the East due to its large population resources.\nHighlighting the importance of the ocean as a shared lifeline and a source of immense economic opportunities, President Asif Ali Zardari pointed out Pakistan’s efforts to enhance its blue economy. He said that these include the formulation of the National Maritime Policy, initiatives focusing on sustainable fisheries and marine conservation and the Living Indus Project, which aims to protect ecosystems and combat pollution.\nHe underscored the development of Gwadar Port under the China-Pakistan Economic Corridor (CPEC), which is being transformed into a regional connectivity hub to drive trade and maritime economic growth.\nThe president praised Pakistan’s partnership with China, under the Belt and Road Initiative, emphasizing its role in knowledge exchange, technological advancement, and marine conservation.\nThe president commended China’s Global Development Initiative and CIDCA’s efforts to embed sustainability in the Forum’s goals. He expressed appreciation for the inclusion of capacity building and island nations in the Forum’s agenda, saying that it aligned with Pakistan’s vision of transnational collaboration and environmental stewardship.\nExpressing optimism about the Forum’s outcomes, the President said, “I am sure that this Forum will pave the way for greater economic cooperation among member countries.” He also called for collective efforts to protect marine resources and promote the blue economy for the benefit of future generations.\nThe 3rd China-Indian Ocean Region Forum aims to bring together leaders, policymakers, and experts from across the region to explore opportunities for maritime collaboration and sustainable development.",
  "retrievedAt": "2025-08-10T13:49:38.857Z"
}
