{
  "title": "IIOJK Elections: “Just shameful Drama,” Says Mushaal Mullick",
  "link": "https://www.app.com.pk/national/iiojk-elections-just-shameful-drama-says-mushaal-mullick/",
  "date_published": "2024-09-22T18:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP):Senior Kashmiri leader and wife of Chairman Jammu and Kashmir Liberation Front Yasin Malik, Mushaal Hussein Mullick on Sunday called the impending elections in the region, a “drama” and a “Shame.”\nIn an interview with PTV News, she stated that these elections represent a facade of normalcy that is both misleading and harmful to the Kashmiri people.\nShe described the elections as a continuation of a long-standing strategy by India to undermine the legitimate aspirations of the Kashmiri populace. “This is not the first time we have seen such a charade,” she noted.\nMullick criticized the Modi government for controversially granting domicile rights to approximately 5 million non-residents, whom she believes will masquerade as locals to participate in the electoral process. “Dressed in Kashmiri attire, they will play their parts in this orchestrated drama,” she warned.\nShe accused India of employing both old and new actors to maintain a narrative of normalcy in a region still under heavy military occupation. “The concept of normalcy is impossible here; it is all a deception,” she declared.\nSince 2019, Mullick noted, many non-Kashmiris have moved into the area under the protection of a large military presence. “This is not just about elections; it is about erasing our identity,” she emphasized.\nShe urged the global community to support the Kashmiri people, who continue to face oppression. Mushaal reiterated her commitment to challenging these oppressive measures and vowed to advocate for the right to self-determination for the Kashmiri people. “We will raise our voices both locally and internationally; our struggle will not cease,” she added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:17:04.725Z"
}
