{
  "title": "President IIU felicitates Dr.Mukhtar on assuming charge as chairman HEC",
  "link": "https://www.app.com.pk/national/president-iiu-felicitates-dr-mukhtar-on-assuming-charge-as-chairman-hec/",
  "date_published": "2022-08-02T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): President, International Islamic University, (IIU) Dr. Hathal Homoud Alotaibi felicitated Chairman Higher Education Commission (HEC) Dr. Mukhtar Ahmed on assuming the charge.\nDuring the meeting held here on Tuesday, both discussed the issues of mutual interest including initiatives for promotion of quality education and role of universities in society building.\nThe meeting was also attended by Dr. N.B. Jumani, Vice President, Administration and Finance, IIUI.\nDr. Hathal Homoud briefed Dr. Mukhtar on IIU’s vision, future plans and strategy for academic excellence.\nIIU President vowed that he will be in the leading ranks for cooperation with the HEC chief as per his aspirations for improvements in the education sector.\nHe said that IIU will be keen to enhance its bilateral ties with the universities across the world.\nDr. Hathal apprised him that university after the transitional period, now all set for a new journey of success as it has completed its new strategic plan that he also presented to the Chairman HEC.\nThe IIU President also briefed him about the university’s vision of digitization and successful launch of its Open and Distance Learning system.\nOn the occasion, Chairman HEC said that he has special regard for the scope and stature of IIU.\nHe said that he has been a member of its highest statutory body and that the university has potential to excel as one of the best educational institutions in the world.\nHe desired that the league of Islamic Universities must hold gatherings to form a consortium in the light of the OIC vision and IIU must lead as a hub of this consortium.\nHe also thanked Custodian of the Two Holy Mosques and the Imam Muhammad Ibn e Saud University of Kingdom of Saudi Arabia for the continuous support of IIU.\nHe added that Saudi Arabia has a special place in the hearts of Pakistanis.\nAppreciating the vision and future plans of IIU President, Dr. Mukhtar said he was happy to see that IIU was heading in the right direction under the leadership of a hard working president.\nHe assured of maximum support saying the role of HEC shall be all about facilitation and cooperation for all the universities and positive steps will be encouraged.",
  "retrievedAt": "2025-08-11T15:19:49.380Z"
}
