{
  "title": "Minister asks HEC chairman to align higher education sector with modern trends",
  "link": "https://www.app.com.pk/national/minister-asks-hec-chairman-to-align-higher-education-sector-with-modern-trends/",
  "date_published": "2022-08-02T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP):Federal Minister for Planning Development & Special Initiatives Professor Ahsan Iqbal has asked the Higher Education Commission (HEC) to align the higher education sector with modern trends and requirements while curriculum of the varsities should be aligned with the job market.\nThe minister made these remarks while meeting with the newly-appointed Chairman HEC Dr. Mukhtar Ahmed at the Ministry.On July 30 Prime Minister Shehbaz Sharif appointed Dr Mukhtar Ahmed as the HEC chairman, according to a press release issued here on Tuesday.\nThe minister while congratulating him said that Dr Mukhtar had an extensive experience in the education sector which would reflect in the policies of HEC.\n“Priority sectors and best universities should be selected for scholarships abroad, ” said the minister, adding that despite the economic crisis, ample funds had been provided for HEC.\nThe minister further added that a competitive process should be set up through the academic and performance audit system of universities.\nCandidates should be selected to benefit from the Pakistan-America Knowledge Corridor Project, he remarked.\nProfessor Iqbal said that steps should be taken to ensure the establishment of Dr. AQ Khan Metallurgy Institute.\nDr Ahmed, a renowned educationist, had earlier held the post of HEC Chairman from 2014 to 2018.Executive Director HEC from 2013 to 2014 and as Member (Operations and Planning) HEC from 2005 to 2011.\nWith a Bachelors and Masters of Science from University of Agriculture, Faisalabad and Masters in Business Administration and PhD from University of California, Riverside, USA, Dr. Mukhtar Ahmed has over three decades of educational development and management experience at national and international level that includes teaching, research, administration, policy development, linking educational research to industry/commercialization, introducing entrepreneurial approaches to education and a diverse range of educational development programmes.",
  "retrievedAt": "2025-08-11T15:19:47.312Z"
}
