{
  "title": "Govt may send reference to SC after notifying PTI as foreign funded party; Law Minister",
  "link": "https://www.app.com.pk/national/govt-may-send-reference-to-sc-after-notifying-pti-as-foreign-funded-party-law-minister/",
  "date_published": "2022-08-02T16:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Federal Minister for Law and Justice Azam Nazeer Tarar on Tuesday said that the government could notify PTI as a foreign funded political party and could also forward a reference to the Supreme Court.\nAddressing a press conference along with Interior Minister Rana Sanaullah, the law minister said that the Ministry of Parliamentary Affairs, the Ministry of Law and Justice and the Ministry of Interior would consider each word of the Election Commission’s decision in detail and the law would take its course.\nHe said that Pakistan Muslim League-Nawaz leader Hanif Abbasi had filed a petition before the Supreme Court with reference to Imran Khan using prohibited funds for creating chaos and disorder in the country, on which the apex court had stated that the Election Commission of Pakistan would examine this matter.\nHe said that the Supreme Court had also stated that the federal government would decide to ban the party on ECP’s report regarding foreign funding.\nHe said that the Election Commission heard the prohibited funding case with great patience and restraint as timings were fixed according to PTI’s will and even the report of the Scrutiny Committee was given to them. The Election Commission had issued a detailed decision based on the reports of various national institutions of the country including the State Bank of Pakistan, he added.\nThe Minister said that every political party had to declare the expenses, income and sources of income to the Election Commission but PTI had detached itself from the accounts which were being used by its senior leadership. The PTI chief’s money trail contradicted his narrative, he added.\nHe said that he had discussed with the Interior Minister in detail about the decision of the Election Commission. Under the law, political parties were allowed to carry out activities and it mentioned clearly regarding collection of funds, he added.\nHe said that this law had been interpreted many times in the courts that the right to participate in political activities could not be taken away from anyone, but political parties would work according to the law and would also be bound to disclose the sources of their income and expenses.\nThe Law Minister said that all political parties were bound to inform the ECP about their income and expenditure details at the end of every year. He said that the nation was waiting for the decision of the prohibited funding case for 8 years.\nHe said that nine lawyers were changed by PTI, allegations were made against ECP, then a written apology was sought, similarly resolutions were also passed by the provincial assemblies of Punjab and Khyber Pakhtunkhwa against the head of Election Commission of Pakistan to stop the decision in some way.\nHe said that the Chief Election Commissioner and members of the Election Commission had put a detailed report in front of the public, which had three parts, in one part the prohibited funding had been mentioned in detail.\nHe said that the details of the receiving funds from foreign nationals who did not have dual citizenship had also been provided. The declarations submitted by Imran Khan as party chief to ECP for five consecutive years from 2008 to 2013 had been declared false and PTI also tried to hide its accounts, which was not only illegal but also unethical, he added.\nThe Minister said that a person whose entire politics was based on thieves, dacoits, money trail and conspiracies had been told by the constitutional body of Pakistan that his (Imran Khan) receipts and money trail were against the constitution and laws of the country.\nThere was no justification for Imran Khan to be in politics as the constitution and law of Pakistan would not allow it, he added.\nHe said that details were mentioned in the Political Party Ordinance of 2002 regarding elections and political parties in the country, while the 1973 Constitution had also clearly written in this regard. Similarly, the details had been added in the Election Act of 2017.\nHe said that this law was not made by the government but all political parties including PTI were represented in it even Sheikh Rasheed who was the only member of assembly of his political party was also included in the committee which made this law.\nHe said that those who made such laws should apologize to the nation or face the law.",
  "retrievedAt": "2025-08-11T15:19:43.753Z"
}
