{
  "title": "Legal action to be pursued on ECP’s decision on PTI financial crimes; Marri",
  "link": "https://www.app.com.pk/national/legal-action-to-be-pursued-on-ecps-decision-on-pti-financial-crimes-marri/",
  "date_published": "2022-08-02T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri has said that the legal action would be pursued followed by the judgment of Election Commission of Pakistan (ECP) proving financial crimes committed by Pakistan Tehreek-i-Insaf.\nAddressing a news conference here on Tuesday along with Pakistan People’s Party leader, Faisal Karim Kundi, the federal minister said that the founding member of PTI, Akbar S. Babar who had filed prohibited funding case against his own party pursued this case with great commitment and in an inspirational way.\nShazia Marri regretted that still PTI leaders are defending their crimes following the ECP’s judgment which is shameful.\nShe said that Imran Khan assuming that this decision would be against him started blaming other political parties of receiving foreign funding. “PTI must come forward with proofs if Pakistan People’s Party or Pakistan Muslim League Nawaz has received foreign funding”.\nShazia Marri said that ECP’s judgment has proved that Imran Khan has been running his party affairs through prohibited funding. On what agenda he was working within Pakistan through this funding, she questioned.\nIt is clearly stated in the political orders of the parties that from which sources the political parties cannot get funding, she said.\nECP’s decision has proved that Imran Khan is a liar and not `Sadiq’ and `Ameen’ anymore. He submitted false affidavits before the ECP and delayed the decision for the last eight years through writ petitions.\nImran Khan received over two million US dollars from Arif Naqvi and big amounts from 34 Indian Industrialists for running his political party’s affairs. He also received thousands of dollars from US based business woman of Indian origin.\nOver 350 foreign companies provided funding to Imran Khan for running his political party, she added.\n“Now the legal process will be followed in light of this decision,” she said.\nShazia Marri said the ECP judgment has shown that Imran Khan has committed a serious crime of receiving prohibited funding and now he has to be answerable before the masses that on what agenda he was working.\nImran Khan, who used to call others as thieves, robber and imported, himself is declared as a liar by ECP. How a person who was running a political party on foreign funding can realize the sufferings of a common man, she asked.\nThe way he led the country towards bankruptcy during the period of four years reflect that he has nothing to do with this country and its people, she said.",
  "retrievedAt": "2025-08-11T15:19:51.818Z"
}
