{
  "title": "Khawaja Asif urges executive to refer PTI’s prohibited funding case to judiciary",
  "link": "https://www.app.com.pk/national/khawaja-asif-urges-executive-to-refer-ptis-prohibited-funding-case-to-judiciary/",
  "date_published": "2022-08-02T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Defence Minister Khawaja Muhammad Asif urged the executive to refer the matter pertaining to PTI’s prohibited funding to the judiciary for further action.\nSpeaking on a point of order in the National Assembly on Tuesday, he said the judiciary should assess the evidence mentioned in the decision of the Election Commission of Pakistan (ECP) regarding foreign funding of the Pakistan Tehreek Insaf (PTI).\nHe said the judiciary should decide the matter on merit to uphold the law and constitution as well as to end the culture of abusive language and unconstitutional acts. He said the ECP today fulfilled its responsibility by declaring that PTI had received prohibited foreign funding.\nHe said Imran Khan was a foreign funded agent, who harmed and maligned the state institutions.\nHe said what an irony it is that institutions were fine if they support him and he starts hurling abuses on them if they will withdraw their support.\nQuoting ECP’s decision, Khawaja Asif said it has now been proved that Imran Khan accepted funding from foreign countries, including the United States, Canada, India, Israel and the United Kingdom. He said this case was a bright example of money laundering. He said it will be a great tragedy to country if Imran Khan goes unscathed.\nThe minister said now it was responsibility of the parliament and other institutions to play their due role in upholding the constitution and social values of our society.\nHe said that PTI chief destroyed the economies and institutions in a well-thought-out plan.\nHe said that Imran Khan abuses the institutions working according to the law and named as “Mir Jafar and Mir Sadiq”.\nHe said that the name of the current election commissioner was proposed by PTI.\nHe said that the Election Commission’s decision has shown Imran Khan’s real face to the nation.\nIf Imran Khan has the moral courage, he should file a case against the Financial Times.",
  "retrievedAt": "2025-08-11T15:19:46.352Z"
}
