{
  "title": "ISA bags first position in Pakistan Quiz",
  "link": "https://www.app.com.pk/national/isa-bags-first-position-in-pakistan-quiz/",
  "date_published": "2022-08-02T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): The Information Service Academy (ISA) bagged top position in the “Pakistan Quiz” held on Tuesday here at its auditorium in connection with the 75th anniversary of the country.\nInternational Islamic University, Federal Urdu University and National University of Modern Languages secured second, third and consolation prizes, respectively, said a news release.\nChief Guest, Hafeezullah Khan, a highly accomplished policy and law practitioner, established administrator and a well-respected literary and media person along with Guest of honor, Additional Secretary Information Mobashar Tauqeer gave away shields and certificates to the award-winning participants. The event was conducted by probationary officer Saba Javed.\nThe event attracted four teams including those from the three leading universities of Islamabad.\nThe participating teams were questioned in three rounds, each round comprising three questions, on the history, culture, sports and tourism sector of Pakistan, and at the end, ISA team carried the day. The universities’ teams were accompanied by their respective faculty members.\nChief Guest, Hafeezullah Khan and Guest of Honor, Additional Secretary, Mobashar Tauqeer were both of the opinion that students needed to develop book reading habits as much as possible to gain knowledge about the history of Pakistan and strengthen their general knowledge, a treasure that would greatly help them rise in their future careers. They also called upon the accompanying faculty to promote book reading culture in educational institutions.\nThey appreciated efforts of the Information Service Academy in holding the Pakistan Quiz which highlighted different facets of the history, culture and tourism treasures of Pakistan.\nDirector General ISA in the end thanked all the teams for their zeal and spirit of participation and wished them the best for future contests.",
  "retrievedAt": "2025-08-11T15:19:44.991Z"
}
