{
  "title": "Syrians rejoice during first Eid after Assad’s fall - World - DAWN.COM",
  "author": null,
  "content": "Eidul Fitr in Syria was charged with newfound joy this year, as thousands freely celebrated the holiday for the first time after the fall of Bashar al-Assad.\n\nFrom the early morning hours, crowds of men, women and children flocked to pray at Damascus’s historic Umayyad Mosque in the Old City.\n\n“This is the first time we truly feel the joy of Eid, after getting rid of Assad’s tyrannical regime,” Fatima Othman told AFP.\n\nFollowing prayer, worshippers exchanged Eid greetings while street vendors sold colourful balloons and toys to children posing for photos with their parents.\n\n“Our celebration is doubled after Assad’s fall,” said Ghassan Youssef, a resident of the capital.\n\nA few kilometres (miles) away, on the slopes of Mount Qasyun overlooking Damascus — a site previously off-limits to Syrians until Assad was deposed on December 8 — a few thousand people gathered at Unknown Soldier Square for an open-air prayer.\n\nAmong them were members of the security forces and the army, dressed in uniform and armed. The road leading to the square was packed, according to an AFP photographer.\n\nSome worshippers distributed sweets to celebrate, while the three-star Syrian flag, adopted by the new authorities, waved in the air.\n\nUnder the previous government, access to the Unknown Soldier monument was typically restricted to Assad and his close associates, who would lay wreaths there during national ceremonies.\n\nThe memorial, where a giant screen broadcast the Eid prayer, is near the presidential palace.\n\nThere, interim President Ahmed al-Sharaa prayed alongside Syria’s new mufti Osama al-Rifai and several cabinet ministers in the presence of a large crowd.\n\nHe later delivered a speech emphasising the country faced “a long and arduous road to reconstruction but possesses all the resources needed to recover”.\n\nThis came two days after the formation of a new government, which faces daunting challenges in a country devastated by 14 years of civil war.\n\nWael Hamamiya, who had been in Sweden since the early days of the conflict, returned to Damascus to celebrate Eid with his family.\n\n“This is my first Eid here in nearly 15 years. I truly feel the celebration in its full meaning,” he told AFP, beaming.\n\n“Everyone who has come is over the moon. This is the celebration of celebrations!”\n\nThe occasion was more sombre for some Syrians, who were able to visit the graves of loved ones that had been off-limits during Assad reign, especially in former opposition strongholds.\n\nAt Al-Rawda Cafe in Damascus, 36-year-old Amer Hallaq chatted with friends after returning from exile in Berlin where he ended up after dodging compulsory military service in 2014.\n\n“For years, I thought I’d never see my family again or celebrate Eid with them,” Hallaq said.\n\n“The joy of liberation and victory is immense, but there’s still a lot of work ahead. This is only the beginning of the road.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/011211185dcede7.jpg",
  "retrievedAt": "2025-08-25T13:55:18.712Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901547/syrians-rejoice-during-first-eid-after-assads-fall",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T07:02:25.000Z"
}
