{
  "title": "Sit-in will continue until our women reach home after being released: BNP’s Mengal - Pakistan - DAWN.COM",
  "author": null,
  "content": "BNP-M President Sardar Akhtar Mengal said on Monday that his party’s sit-in demanding the release of arrested Baloch Yakjehti Committee (BYC) leaders will continue until “our women are released and reach their homes.”\n\nMengal had announced a “long march” from Wadh to Quetta to protest the arrests of BYC chief organiser Dr Mahrang Baloch and other leaders as well as police crackdowns on a sit-in. However, the Quetta administration had denied the party permission for the rally.\n\nOn Saturday evening, a provincial government delegation comprising Zahoor Ahmed Buledi, Bakht Muhammad Kakar and Sardar Noor Ahmed Bangulzai met Mengal and other BNP-M leaders at the party’s sit-in site in Mastung but could not convince Mengal to end the sit-in, which continued.\n\nAddressing the protesters today, Mengal said, “The sit-in will be written in history and will continue until our women reach home after being released.”\n\n“Let’s promise that until we take our imprisoned women home, it will be forbidden for us to go home,” he said.\n\nOn the first day of Eidul Fitr, Eid prayers were offered at Lakpas, in which protesters, as well as people from Mastung and nearby areas also participated.\n\n“Yesterday, the government came with its butterfly-shaped drone and took pictures of our sit-in to prove how small the sit-in was. But today, I ask them to bring their big butterfly (helicopter) and see how many participants we have,” Mengal said.\n\nBNP central leader and former senator Sana Baloch told Dawn.com that BNP-M or BYC are not a campaigning party or organisation.\n\n“They are raising their voice for their rights in a democratic manner. Rana Sanaullah says that Sardar Akhtar Mengal’s speeches are promoting extremism in Balochistan, which is very sad.\n\n“When the PML-N leaders talked about respecting the vote, the leadership including Sanaullah were put under arrest and today those same PML-N leaders are telling us that our speeches and statements are promoting extremism.”\n\nBaloch added, “It is not our statements and speeches but the government’s policies that are causing extremism, due to which Pakistan’s relations with neighboring countries are not good today and due to these policies, the people of Mastung are offering Eid prayers on the highways today.”\n\nBaloch said that if the report of the commission headed by Mengal had been implemented on the instructions of the Islamabad High Court, the situation would not have deteriorated so much today and further deterioration would have been avoided.\n\nOn the fourth day of the ongoing protest sit-in at Lakpas area of ​​Mastung, BNP Awami chief and member of Balochistan Assembly Mir Asad Baloch, National Party leader Sardar Kamal Khan Bangulzai, Prince Muhammad Baloch, son of the Khan of Kalat, and other political leaders also expressed solidarity with the sit-in protesters.\n\nMarchers and motorists from different political parties had started their journey to Quetta from Mengal’s native town of Wadh at around 9am on Friday.\n\nOn Saturday, after the BNP-M claimed that over 250 of its activists were detained as its march was met with police action near Mastung, Mengal and other party workers also survived a suicide bombing.\n\nAddressing the sit-in on Saturday, Mengal had said: “The government delegation spoke to us about cooperation and finding a way.\n\n“We told them that they must find a way and let us go to Quetta.”\n\nMengal elaborated: “The government delegation asked us if we wanted to hold a rally, to which we said that if we wanted to hold a rally, we would have done it in Khuzdar.\n\n“We told the government our only demand is to release the women,” Mengal said. “We told them that we will march towards Quetta, demanding the release of our women.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/312309478e868d9.jpg",
  "retrievedAt": "2025-08-25T13:55:21.669Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901512/sit-in-will-continue-until-our-women-reach-home-after-being-released-bnps-mengal",
  "dateList": "2025-04-01",
  "date_published": "2025-03-31T19:02:42.000Z"
}
