{
  "title": "China launches military drills around Taiwan, calls its president a ‘parasite’ - World - DAWN.COM",
  "author": null,
  "content": "China staged military drills off Taiwan’s north, south and east coasts on Tuesday as a “stern warning” against separatism and called Taiwanese President Lai Ching-te a “parasite” as Taiwan sent warships to respond to China’s navy approaching its shores.\n\nThe exercises, which China has not formally named unlike the war games last year, are happening after a rise in Chinese rhetoric against Lai and follow on the heels of US Defence Secretary Pete Hegseth’s Asia visit, during which he repeatedly criticised Beijing.\n\nChina’s military deployed ships, aircraft and artillery to practise blockading the island, strikes on ground and maritime targets, and air interception to “test forces’ coordination in combat”, Beijing’s Eastern Theatre Command said in a statement.\n\nLast May, three days after Lai’s inauguration, Chinese forces staged war games to simulate seizing full control of areas west of the so-called first island chain and conducted live-fire missile exercises.\n\nChina considers democratically governed Taiwan as its own territory and calls Lai a “separatist”. In a video accompanying its announcement, the Eastern Theatre Command called him a “parasite” in English and depicted him as a green bug held by chopsticks over a burning Taiwan.\n\nTaiwan’s government condemned the drills, with the presidential office saying China was “widely recognised by the international community as a troublemaker” and that the government has the confidence and ability to defend itself.\n\nTaiwan’s government rejects Beijing’s sovereignty claims, saying only the island’s people can decide their future.\n\nTwo senior Taiwan officials told Reuters that more than 10 Chinese military ships had approached close to Taiwan’s 24 nautical miles (44 kilometres) contiguous zone and Taiwan sent its own warships to respond.\n\nTaiwan’s defence ministry said it had not detected any live fire by the Chinese military, but that at least 71 Chinese military aircraft and 13 navy ships were involved. It added it did not know when the drills would end.\n\nMinistry spokesperson Sun Li-fang said Taiwan’s armed forces had elevated their readiness level to ensure that China does not “turn drills into combat” and “launch a sudden attack on us”.\n\nChina’s foreign ministry said the drills “are legitimate and necessary actions to defend national sovereignty and safeguard national unity”.\n\n“China’s reunification is an unstoppable trend — it will happen, and it must happen” Guo Jiakun, a spokesperson, said at a regular news conference today.\n\nTaiwan’s stock market brushed off the rise in tensions, with the benchmark index closing up 2.8 per cent today.\n\nTaiwan’s Defence Ministry said that China’s Shandong aircraft carrier group had entered the island’s response area on Monday, adding that it had dispatched military aircraft and ships and activated land-based missile systems in response.\n\nThe drills took place after Hegseth left the region following visits to Japan and the Philippines, where he criticised China and said Japan was “indispensable” for tackling Chinese aggression.\n\nA senior Taiwan security official told Reuters, citing internal assessments, that Beijing needed to avoid any “perceived confrontation” with Washington prior to the US-China trade talks, and thus Taiwan has become a pretext.\n\n“Taiwan is their best excuse. That’s why they chose to launch such military drills as soon as the US defence secretary left Asia,” the official said.\n\nThe de facto US embassy, the American Institute in Taiwan, said the US would continue to support the island.\n\n“Once again, China has shown that it is not a responsible actor and has no problem putting the region’s security and prosperity at risk,” a spokesperson said in a statement.\n\nChina’s military released a series of propaganda videos in quick succession after the drill announcement, depicting Chinese warships and fighter jets encircling Taiwan, Taipei being aimed at from above and a barrage of missiles firing into the sky before exploding on their targets.\n\nA video of a poster accompanying the drills titled “Closing In” and showing Chinese forces surrounding the island, was released on the Eastern Theatre Command’s Weibo.\n\nThis was followed by a video titled “Shell”, depicting President Lai as a green cartoon bug spawning parasites across the island, on the Eastern Theatre Command’s WeChat page.\n\n“Parasite poisoning Taiwan island. Parasite hollowing island out. Parasite courting ultimate destruction,” the animation said.\n\nTaiwan Defence Minister Wellington Koo said such rhetoric was not conducive to peace and “shows their provocative character”.\n\nA third video, “Subdue Demons and Vanquish Evils”, featured Sun Wukong, the magical monkey king from the Ming Dynasty epic “Journey to the West” as he is depicted in the “Black Myth: Wukong” hit video game.\n\nIt opens with the video’s title flashing across the screen and the Chinese mythical warrior riding on clouds before cutting to footage of Chinese fighter jets.\n\nA fourth poster, released later in the day and titled “Enveloping Advance”, had the Chinese characters of its title covering the island.\n\nTaiwan’s Koo told reporters the People’s Liberation Army (PLA) should focus first on resolving its issues with corruption instead of destroying peace and stability in the region.\n\nChina’s military has undergone a sweeping anti-corruption purge over the past few years, which saw former Chinese defence minister Li Shangfu ousted in October 2024.\n\nChina’s defence ministry did not immediately respond to a request for comment on Koo’s remarks.\n\nThe Global Times, which is owned by the People’s Daily newspaper of the governing Chinese Communist Party, said the drill had not been given a code name to show that Chinese military forces surrounding the island “has become a normal practice”, citing Zhang Chi of National Defence University.\n\n“Through a series of exercises held in the Taiwan Strait in recent years, the PLA has strongly enhanced its ability to prepare for war and fight battles,” the article on the paper’s Weixin social media page added.\n\nSeparately, Chinese President Xi Jinping told Indian President Droupadi Murmu the two countries should work more closely together, saying their relationship should take the form of a “Dragon-Elephant tango” — a dance between their emblematic animals.\n\nThe Chinese and Indian presidents exchanged congratulatory messages on Tuesday, the 75th anniversary of the start of their diplomatic ties, as tensions ease after a 2020 clash between their troops along their shared border in the Himalayas.\n\nXi said the neighbours should find ways to coexist peacefully and that he was ready to deepen communication and coordination in major international affairs, and jointly safeguard peace in border areas.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/01204359ca9b3c0.jpg",
  "retrievedAt": "2025-08-23T16:15:14.467Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901573/china-launches-military-drills-around-taiwan-calls-its-president-a-parasite",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T15:44:33.000Z"
}
