{
  "title": "Finance: Looking for more to export - Newspaper - DAWN.COM",
  "author": null,
  "content": "Pakistan has pledged to the International Monetary Fund (IMF) that it will “further strengthen institutional capacity to fight corruption and significantly reduce trade barriers to support inclusive growth and a level playing field for business and investment.”\n\nThis statement is part of the press release issued by the IMF on March 25, announcing that it had reached a staff-level agreement with Pakistan, which will now have little to no room to incentivise its export industries by imposing tariff and non-tariff barriers against imports.\n\nMoreover, “strengthening institutional capacity to fight corruption” may also weaken the bureaucracy-industrialist nexus, which has long provided undue patronage to select, often politically connected, export-led firms, shielding them from competition. Supporting “a level playing field for business and investment” should also imply making industries more efficient rather than allowing them to survive within a protected environment of import restrictions.\n\nPakistan’s goods’ trade deficit expanded to $16.5bn during eight months of this fiscal year, between July 2024 and February 2025, from $14.05bn in the same period a year ago, according to the balance of payments data released by the State Bank of Pakistan. The country’s total foreign exchange inflows from all sources fall short of matching outflows year after year due to massive external debt servicing. As a result, Pakistan frequently seeks rollovers of foreign funds from friendly nations like China, Saudi Arabia, and the United Arab Emirates (UAE) to bridge financing gaps.\n\nThe state needs a new trade framework engaging private-sector stakeholders for a realistic assessment of export diversification rather than only relying on bureaucratic feedback\n\nGiven this reality, the current hybrid regime must double down on efforts to boost exports, promote import substitution, ensure consistent remittance growth, and foster an environment conducive to attracting foreign investment.\n\nMoreover, the recent surge in militancy and terrorism in Balochistan and Khyber Pakhtunkhwa must be tackled effectively. Without swift action, actual foreign direct investment (FDI) inflows may remain elusive despite the increasing number of memorandums of understanding being signed to attract FDI from Saudi Arabia, the UAE, Qatar, and Central Asian states.\n\nEven FDI under the second phase of the China-Pakistan Economic Corridor could remain minimal if the security situation deteriorates further.\n\nDuring the first eight months of this fiscal year, net FDI inflows stood at $1.618 billion, marking a 41 per cent increase compared to the same period last year. However, the fact that net FDI plummeted to just $95 million in February 2025, down from $172m in February 2024, highlights the damaging impact of rising terrorism on investor confidence.\n\nPakistan’s goods’ trade deficit expanded to $16.5bn during 8MFY25 from $14.05bn in the same period a year ago\n\nKey challenges to remittance growth include uncertainties in job markets in the major host countries of Pakistani expatriates — Saudi Arabia, the UAE, other Gulf Cooperation Council nations, the US, and the UK — as well as the high base effect of this year’s inflows. In the first eight months of FY25, Pakistan received $24bn in remittances, and full-year inflows are expected to reach $36bn, up from $30.25bn in FY24.\n\nHowever, expecting a similarly rapid increase in the next fiscal year would be overly optimistic, especially given the anticipated slower global economic growth. And, even if remittances remain strong beyond this fiscal year, it is crucial to sustain this momentum while simultaneously re-examining export policies to lay the foundation for long-term, sustainable export growth.\n\nPromoting non-textile exports and adding value to food exports must become an integral part of Pakistan’s export strategy. While the current outlook for such diversification may not seem promising, foundational work must begin now to prevent further deterioration in the trade balance.\n\nThis is not to suggest that textile and food exports (currently low value-added) should be neglected. Pakistan cannot afford that. However, it must be acknowledged that the textile sector, long sustained by government incentives, has consumed the lion’s share of financial support, often at the expense of other export industries. Additionally, unrestrained growth in food exports not only risks exacerbating food inflation but also threatens to create severe food shortages, particularly among financially vulnerable populations and geographically disadvantaged regions.\n\nSeveral high-potential sectors could generate substantial export revenue with well-targeted policy support. These include pharmaceuticals, defence equipment and engineering goods, auto parts, minerals and chemicals, leather and leather products, sports goods, surgical instruments, culinary products and handicrafts from various regions of the country. But to achieve meaningful progress, exemplary coordination is required between the federal and provincial governments, alongside the active involvement of industry representatives.\n\nThe Pakistan Business Council has already conducted a study on this issue titled ‘Export Diversification into Non-Traditional Product Segments’ and released it last year. While the report primarily highlights pharmaceuticals as a non-traditional export sector with high potential, it also identifies several promising subcategories within garments, leather products and footwear, sports goods, and surgical and medical devices.\n\nA new framework for exports and imports would do well to engage private-sector stakeholders for a realistic assessment of where to begin export diversification, rather than relying solely on bureaucratic feedback.\n\nPublished in Dawn, The Business and Finance Weekly, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:55:20.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901167",
  "dateList": "2025-04-01",
  "date_published": "2025-03-31T00:47:27.000Z"
}
