{
  "title": "Dozens in hospital in Malaysia after towering blaze on Petronas gas pipeline - World - DAWN.COM",
  "author": null,
  "content": "Scores of people in Malaysia were being treated in hospitals on Tuesday after a huge fire broke out at a gas pipeline operated by state energy giant Petronas, showering flaming debris from the sky and shattering windows.\n\nAuthorities said the blaze in the town of Puchong on the outskirts of the capital Kuala Lumpur had been extinguished by mid-afternoon. They said at least 305 people were affected, including those left homeless after some 190 homes were damaged.\n\nNo deaths were reported and the health minister said those admitted to hospital were all in a stable condition.\n\nState news agency Bernama said 145 people had received hospital treatment and 41 had since been discharged, citing health ministry data. They were treated for burns, other injuries and respiratory problems, state authorities said.\n\nThe fire started early on Tuesday with a towering orange flame and billowing smoke that could be seen on the horizon from far away, according to early images on news outlets and footage shared on social media.\n\nWitnesses in evacuation centres described scenes of chaos that started with an explosion.\n\n“The fire is really raging high. And then once you can see debris — you’re talking about debris which is still on fire — started to fall all over the place, that’s (when) we know something bad has happened,” said Raja Hilmy Bin Raja Idris, 59, whose house was a kilometre from the fire.\n\nEvian Wee, 50, said she initially thought a tornado or earthquake had struck.\n\n“I saw a red glow moving around … I kept hearing things falling — glass, stones, all crashing in. All the windows were shattered,” she said.\n\n“It started off with the explosion, then the windows started shaking violently. That’s when we realised it was an explosion that led to the fire.”\n\nPetronas said earlier it had isolated the pipeline and was working closely with all relevant parties to ensure the safety of the surrounding community, environment and security of gas supply to the country.\n\nMalaysia’s Prime Minister Anwar Ibrahim said the state government and Petronas would take full responsibility for restoring the area, adding that the process could take a year.\n\n“It will take some time to determine the cause. Let there be a thorough investigation. Our priority now is safety. It looks under control so far,” he said, adding that those affected would be given financial assistance in the interim.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/01184039bdc629a.jpg",
  "retrievedAt": "2025-08-25T13:55:17.844Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901568/dozens-in-hospital-in-malaysia-after-towering-blaze-on-petronas-gas-pipeline",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T13:45:56.000Z"
}
