{
  "title": "BYC leader Sammi Deen released from Karachi prison after week in custody under MPO - Pakistan - DAWN.COM",
  "author": null,
  "content": "Baloch Yakjehti Committee (BYC) leader Sammi Deen Baloch was released on Tuesday and discharged from the Maintenance of Public Order (MPO) Ordinance after her participation in protests against rights violations.\n\nSammi and five others were taken into custody on March 24 for violating a freshly imposed Section 144. Despite a judicial magistrate discharging the activists and ordering their release the next day, Sammi was detained shortly after under the MPO for 30 days.\n\nNumerous voices, from UN experts to Amnesty International to civil society leaders, activists and members, had since called for not only her release but also other detained Baloch rights activists, including BYC organiser Dr Mahrang Baloch.\n\nAn order from the Sindh Home Department today said that Sammi’s name was withdrawn from the previous MPO detention order. It ordered the Karachi Central Prison’s senior superintendent to release her if she was not required in any other case.\n\nConfirming the release, Sammi’s sister Mehlab Deen Baloch posted on X: “My sister, Sammi Deen, has finally been released, and I cannot express my gratitude enough. I sincerely thank Advocate Jibran Nasir and all the human rights activists, civil society members and everyone who stood by us, raised their voices, and fought for justice.”\n\nNasir said Sammi was with her family now, adding that the public and media pressure was “instrumental” in ensuring her release.\n\n“We demand that the MPO is withdrawn in its entirety against all BYC members who have a fundamental and democratic right to peaceful protest. Release of Sammi is the first step in the right direction by the state. We also demand immediate release of Mahrang Baloch and all BYC activists detained by the Balochistan government.”\n\nThe BYC said in a post on X about her release: “This victory belongs to every voice that resisted her illegal detention and stood firm.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/01191705c8d4e7e.png",
  "retrievedAt": "2025-08-25T13:55:17.700Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901569/byc-leader-sammi-deen-released-from-karachi-prison-after-week-in-custody-under-mpo",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T14:26:46.000Z"
}
