{
  "title": "‘No breakthrough’ in talks with govt as BNP march marks 5th day - Pakistan - DAWN.COM",
  "author": null,
  "content": "A deadlock continued to persist after a provincial government delegation arrived on Tuesday to hold talks with the Balochistan National Party-Mengal (BNP-M) while its protest against recent arrests of rights activists marked its fifth day on Tuesday.\n\nThe BNP-M had announced a long march from Wadh to Quetta last Friday to protest against the arrests of Baloch Yakjehti Committee leaders and activists, including Dr Mahrang Baloch and Sammi Deen Baloch, as well as the police crackdown on their sit-in in Quetta. Sammi was released earlier today.\n\nThe sit-in is currently at Lakpass where a provincial government delegation comprising Zahoor Ahmed Buledi, Bakht Muhammad Kakar and Sardar Noor Ahmed Bangulzai arrived to hold talks with BNP-M chief Sardar Akhtar Mengal. The delegation had previously met Mengal and other BNP-M leaders at the party’s sit-in site in Mastung on Saturday evening but could not convince Mengal to end the sit-in.\n\nIn a video message released after the talks, Mengal said: “There has been no breakthrough as of yet and nor have negotiations been successful but talks are ongoing.”\n\nHe also rubbished any reports of an agreement signed between the two sides regarding the release of protesters, saying “rumours” without any merit were being spread on social media. Mengal added that the future course of action for the protest would be announced soon in a day or two.\n\nEarlier today, leaders and officials of the province’s various political parties and organisations arrived to express solidarity, including Voice for Baloch Missing Persons vice chairman Mama Qadeer Baloch and general secretary Hooran Baloch, tribal leader Sardar Nadir Langove and others.\n\n“The Baloch nation has always stood by me now it’s time for me to stand by them Sardar Akthar Jan Mengal addressed the participants of the sit-in in Mastung Lakpass today.\n\n“The BNP’s sit-in continues near Lakpass, with people from across Balochistan visiting and expressing their solidarity with Sardar Akhtar Jan. The BNP’s demands from the government include the immediate release of Dr Mahrang Baloch and other activists,” the party said in a post on X. It also noted Sammi’s release.\n\nAdvocate Sajid Tareen, acting president of the BNP-M, said the sit-in would continue under Mengal’s leadership till the release of all “daughters of Balochistan”, including Mahrang.\n\nAddressing those gathered, Mengal said the government should bring a clear change in its policies if it wanted peace in Balochistan, adding that the sit-in was for the sake of detained Baloch daughters and women and would continue until their release.\n\nHe said that instead of helping the situation in the province, threats and arrests would further worsen it, adding that the people had become aware and circumstances were not the same as in 1970.\n\nMengal also criticised the provincial government for taking a backseat to the federal government regarding the situation with messages and statements coming from federal ministers while the Balochistan government remained silent.\n\nMeanwhile, BNP leader and former senator Sanaullah Baloch said that as per Mengal’s instructions, Wednesday was decided as a day for relatives of missing persons from all over Balochistan to participate in the sit-in with the photos of their relatives so that they could raise their voice in an organised manner for their recovery.\n\nSeparately, a Supreme Court Bar Association (SCBA) delegation was stopped from going to Lakpass to express solidarity with the participants of the ongoing sit-in, according to its president Rauf Atta.\n\nHe told Dawn.com that the delegation was stopped by security officials from going to the Lakpass Tunnel. He added that the security officials sought a permit to the group from the Quetta deputy commissioner allowing them to visit the sit-in.\n\nAtta said the permit was declared necessary to remove the obstacles set up by the security forces. He added that the delegation could not proceed further due to the unsafe condition of other rough and uneven roads near Lakpass, forcing it to return to Quetta.\n\nMarchers and motorists from different political parties had began their journey to Quetta from Mengal’s native town of Wadh at around 9am on Friday.\n\nOn Saturday, after the BNP-M claimed that over 250 of its activists were detained as its march was met with police action near Mastung, Mengal and other party workers also survived a suicide bombing.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/012155112c327f9.jpg",
  "retrievedAt": "2025-08-23T16:15:14.047Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901574/no-breakthrough-in-talks-with-govt-as-bnp-march-marks-5th-day",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T16:43:10.000Z"
}
