{
  "title": "ISSI commemorates Youm-e-Istehsal with Seminar on “August 5, 2019: Another Turning Point in the Jammu and Kashmir Dispute”",
  "link": "https://www.app.com.pk/national/issi-commemorates-youm-e-istehsal-with-seminar-on-august-5-2019-another-turning-point-in-the-jammu-and-kashmir-dispute/",
  "date_published": "2025-08-10T15:14:25+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP): The India Study Centre (ISC) at the Institute of Strategic Studies Islamabad (ISSI) on Tuesday hosted a seminar, titled “August 5, 2019: Another Turning Point in the Jammu and Kashmir Dispute.”\n\nThe event was organized to commemorate the struggle, resolve, and sacrifices of the Kashmiri people, and observe Youm-e-Istehsal to condemn India’s unilateral and illegal actions of August 5, 2019, with regard to the Indian Illegally Occupied Jammu and Kashmir (IIOJK), said a press release.\n\nAmbassador Masood Khan, Former President of the State of Azad Jammu and Kashmir, graced the occasion as the Chief Guest and Ambassador Imran Ahmed Siddiqui, Additional Secretary (Asia Pacific), Ministry of Foreign Affairs Pakistan, as the Guest of Honour. Speakers included Ambassador Sohail Mahmood, Director General ISSI; Ambassador Khalid Mahmood, Chairman BoG, ISSI; Dr. Sheikh Waleed Rasool, Assistant Professor, Riphah International University; Dr. Raja Qaiser Ahmed, Assistant Professor, SPIR, Quaid-e-Azam University; Mr. Altaf Hussain Wani, Chairman Kashmir Institute of International Relations (KIIR); Ms. Naila Altaf Kayani, Human Rights Activist; Mr. Muhammad Farooq Rehmani, Former Convener of APHC AJK; and Barrister Nida Salam, Lawyer, Islamabad High Court.\n\nIn his remarks on the occasion, Ambassador Sohail Mahmood said that for the last six years, the IIOJK had remained the ‘most militarized zone’ in the world; the suppression of Kashmiris by Indian security forces reached unseen scale; and the human rights violations escalated to the level of ‘crimes against humanity’ with ‘collective punishment’ of entire communities. However, despite all its wanton repression, India has neither been able to dampen the spirit of the Kashmiris nor break their will to fight for their inalienable right to self-determination.\n\nNew Delhi is now making an unacceptable assault on the Kashmiris’ rights, land, and distinct cultural identity and working to turn the Kashmiri Muslim majority into a minority on their own soil. These sinister designs indicate replication of the Israeli model to implement a ‘settler-colonial project’, he added.\n\nAmbassador Sohail Mahmood noted that, unable to control the resistance movement by force, India has reverted to its familiar ploy of branding the indigenous Kashmiri struggle as “terrorism” and accusing Pakistan of complicity in the so-called “cross-border terrorism.” Failing to use the Pahalgam attack of 22 April 2025 to deter Pakistan militarily and diplomatically, New Delhi has now weaponized water. Its willful smear campaign against Kashmiris and Pakistan and reckless military adventurism show that the Hindutva-driven BJP government has no interest in stability and peaceful co-existence.\n\nWhile reflecting on Pakistan’s steadfast support for the just cause of the Kashmiri people, Ambassador Sohail Mahmood emphasized that India and the international community must recognize that Kashmir is a dangerous flashpoint and that durable peace and stability in South Asia remains contingent upon a just and peaceful resolution of the Jammu and Kashmir dispute in accordance with the UNSC resolutions. This, he stressed, can only be ensured through the collective endeavours of Kashmiris, Pakistan, and the world community.\n\nIn his remarks, chief guest Ambassador Masood Khan warned that the unresolved Kashmir dispute will intensify the smog of war in South Asia, making it catastrophic for the region and the world. He noted that the Indo-Pak conflict of May 2025 challenged the narrative of India’s regional military dominance and brought renewed focus on Kashmir as central to South Asia’s long-term peace and stability.\n\nDiscussing Pakistan’s position on Kashmir, Ambassador Khan highlighted the potential of the Pakistani and Kashmiri diaspora to reach global conscience regarding the plight of the Kashmiri people. He emphasized the need for sustained understanding of India’s socio-political landscape and its strategic culture through dedicated research initiatives.\n\nWhile lauding Pakistan’s efforts to raise the Kashmir Issue at global forums including the UN Security Council, General Assembly, and Human Rights Council, Ambassador Masood Khan called for stronger communication with global institutions and decision-making bodies.  Further, he advised Pakistan to remain vigilant of any new development with regard to the political status of IIOJK and strategically respond to it.\n\nAmbassador Imran Ahmed Siddiqui noted that India’s demographic and electoral engineering in IIOJK following 5 August 2019 was in clear violation of the International Law, International Humanitarian Law, Article 1 of the UN Charter, and the 4th Geneva Convention. The incarceration of Kashmiri political leadership and a cap on political activity in the occupied territory reflect the broader design of eliminating truly representative political class.\n\nWhile reemphasizing Pakistan’s resolve to firmly stand with the Kashmiris’ right to self-determination, Ambassador Imran Siddiqui stressed that ‘Youm-e-Istehsal’ was a renewed call for international community to address the miseries taking place under the Indian occupation and resolve the dispute according to the will of the Kashmiri people. He reiterated Pakistan’s full support for the Kashmiris until the realization of their right to self-determination.\n\nEarlier, Dr. Khurram Abbas in his introductory remarks noted that, following its actions of 5 August 2019, India was determined to erase the Kashmiri identity through a myriad of structural and cultural changes. Lacking any legal, political, and moral basis, unilateral actions of India related to Indus Waters Treaty or Jammu and Kashmir are fueling chaos and uncertainty, and squeezing the space for meaningful engagement.\n\nDr. Sheikh Waleed Rasool, while presenting a historical overview of the Kashmiri struggle, shed light on administrative measures being taken by India to disenfranchise and dispossess Kashmiri Muslims in the aftermath of 5 August 2019.\n\nMoreover, drawing from an academic background, Dr. Raja Qaiser Ahmed presented an overview of India’s shifting constitutional narratives on IIOJK and how they contributed to New Delhi’s fiercer occupation of the territory. He called upon the youth to engage in deep research and produce quality academic work to contribute to global awareness about the Kashmir issue.\n\nAltaf Hussain Wani explained how Kashmiri people were broken due to broken promises and the world silence on their miseries.  He also highlighted how the UN human rights machinery and international human rights organizations had helped advance the cause and stressed that more engagement on these platforms would facilitate efforts for breaking the ‘silence.’\n\nSimilarly, Ms. Naila Altaf Kayani explained the civilizational, cultural, and linguistic suppression of the Kashmiri people at the hands of Indian occupying forces. She underscored that the Indian state was not just erasing the political identity but the cultural soul and very existence of Kashmiris. She stressed that it was crucial to continue to raise awareness and resist this systematic erasure.\n\nMuhammad Farooq Rehmani reinforced the need to build on the current global environment favouring Pakistan and the Kashmir cause. Barrister Nida Salam highlighted that no international legal framework permitted India to declare Kashmir its internal matter and that its status cannot be altered without a UN-supervised plebiscite.\n\nThe seminar was concluded with remarks by Ambassador Khalid Mahmood, Chairman BoG, ISSI.",
  "retrievedAt": "2025-08-10T10:16:02.904Z"
}
