{
  "title": "Pakistan stands united with Kashmiris on Youm-e-Istehsal: Aurangzeb Khichi",
  "link": "https://www.app.com.pk/national/pakistan-stands-united-with-kashmiris-on-youm-e-istehsal-aurangzeb-khichi/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi has reiterated Pakistan’s unwavering solidarity with the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK), marking the fifth anniversary of India’s controversial revocation of the region’s special constitutional status.\n\nIn a strong statement issued on Youm-e-Istehsal, the minister condemned New Delhi’s August 5, 2019, move as a flagrant violation of international law, UN Security Council resolutions, and the fundamental rights of the Kashmiri people.\n\n“India’s unilateral actions not only undermined the identity and autonomy of the Kashmiri people but also intensified the repression, turning the region into an open-air prison,” he said.\n\nKhichi described August 5 as a dark day in the region’s history, symbolizing the systemic denial of justice, political rights, and civil liberties.\n\nHe paid tribute to the unflinching resolve and sacrifices of the Kashmiri people, who, despite facing continuous lockdowns, communication blackouts, and military crackdowns, have kept their struggle for freedom alive.\n\nHe reaffirmed Pakistan’s consistent support for the Kashmir cause, stating, “Pakistan will continue to raise its voice at every international platform to demand justice for the Kashmiri people and to ensure the fulfillment of their right to self-determination as guaranteed by the United Nations.”\n\nThe minister also highlighted efforts by the National Heritage and Culture Division to preserve Kashmir’s rich cultural identity.\n\n“Through various projects, we are working to document and promote the Kashmiri language, literature, and heritage to protect their national legacy from cultural erasure,” Khichi stated.\n\nCalling upon the global community, the minister urged world powers and human rights organizations to take serious notice of the grave situation in IIOJK and to press India for an end to its brutal policies.\n\n“Youm-e-Istehsal is not just a day of mourning, but a call for global conscience to awaken,” Khichi concluded.",
  "retrievedAt": "2025-08-10T10:18:08.128Z"
}
