{
  "title": "Pakistan reaffirms solidarity with Kashmiri people on ‘Youm-e-Istehsal’",
  "link": "https://www.app.com.pk/national/pakistan-reaffirms-solidarity-with-kashmiri-people-on-youm-e-istehsal-2/",
  "date_published": "2025-08-10T15:14:25+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):The people and Government of Pakistan on Tuesday solemnly observed the ‘Youm-e- Istehsal’, on the sixth anniversary of India’s illegal and unilateral actions of 5 August 2019 in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n\nIn their special messages on the occasion, the President, the Prime Minister and the Deputy Prime Minister/Foreign Minister have renewed Pakistan’s unwavering diplomatic, political and moral support to the Kashmir Cause and called for resolution of the Jammu and Kashmir dispute in accordance with the relevant UN Security Council Resolutions and aspirations of the Kashmiri people, a news release from Foreign Office Spokesperson said.\n\nThey have also underscored that India’s unlawful actions since 5 August 2019 are aimed at turning the Kashmiris into a disempowered community in their own land.\n\nThe Deputy Prime Minister/Foreign Minister has addressed letters to President UN General Assembly, President UN Security Council, UN Secretary General, UN High Commissioner for Human Rights and OIC Secretary General to apprise them of the latest developments in IIOJK. In these letters, he has urged the implementation of relevant UN Security Council resolutions to enable the people of Jammu and Kashmir to determine their own future. He has also stressed the urgent need for improving the human rights situation in IIOJK and releasing the incarcerated Kashmiri political prisoners.\n\nAhead of the ‘Youm-e-Istehsal’, the Foreign Secretary briefed the Islamabad-based diplomatic missions on the situation in IIOJK, on 4 August 2025. She highlighted the legal, security and human rights dimensions of the Jammu and Kashmir dispute, with special reference to the developments of the past few months in the region.\n\nTo express solidarity with the oppressed people of IIOJK, a special ‘Walk’ was held in Islamabad, this morning, along the Constitution Avenue, up to the D-Chowk. The walk was led by Deputy Prime Minister/Foreign Minister. The officers and staff members of the Ministry participated in the walk, alongside people from other spheres of life.\n\nA range of activities have been designed throughout the country to observe ‘Youm-e-Istehsal’, which include public rallies, seminars, webinars, panel discussions and photo exhibitions. With the active participation of Pakistani and Kashmiri Diaspora, Pakistan’s diplomatic missions around the world are also arranging special events to raise global awareness about the Indian oppression in IIOJK.",
  "retrievedAt": "2025-08-10T10:17:26.447Z"
}
