{
  "title": "Housing minister reaffirms Pakistan’s unwavering support for Kashmir cause",
  "link": "https://www.app.com.pk/national/housing-minister-reaffirms-pakistans-unwavering-support-for-kashmir-cause/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP):Federal Minister for Housing and Works, Mian Riaz Hussain Pirzada, has strongly condemned India’s unilateral revocation of Articles 370 and 35A on August 5, 2019, and reaffirmed Pakistan’s unwavering support for the Kashmir cause.\n\nIn his special message on the occasion of Youm-e-Istehsal, the minister termed the move an illegal and condemnable act that directly attacked the identity, autonomy, and fundamental rights of the Kashmiri people.\n\n“Since 1947, our Kashmiri brothers and sisters have been engaged in a historic struggle for freedom and self-determination,” Pirzada said.\n\nHe added that following the 2019 revocation, India intensified its brutal repression in the region, imprisoning thousands of Kashmiris, including their political leadership.\n\n“Such oppression cannot suppress the legitimate aspirations of the Kashmiri people,” he stressed.\n\nThe minister reaffirmed Pakistan’s unwavering diplomatic, moral, and political support for the Kashmir cause.\n\n“Pakistan has always stood by its Kashmiri brothers and sisters in their just struggle, and it will continue to raise its voice for their rights at every global forum,” he affirmed.\n\nReferring to the deep historical, religious, and cultural ties between Pakistan and the people of Kashmir, Pirzada stated:\n\n“Kashmir is our jugular vein. Our bond with the Kashmiris is not just political—it is also religious, moral, and rooted in blood.”\n\nHe expressed disappointment over the continued silence of the international community in the face of ongoing human rights abuses in Kashmir. “Though voices are raised across the world against these atrocities, the oppressors continue with impunity,” he remarked.\n\nConcluding his message, Riaz Hussain Pirzada offered prayers for peace, justice, and the fulfillment of the Kashmiri people’s aspirations.\n\nHe vowed that the Government of Pakistan, the Armed Forces, and the entire nation would always stand shoulder to shoulder with the people of Kashmir.\n\n“May the Kashmiri people soon attain their rightful freedoms, and may the Kashmir issue be resolved in accordance with their will,” he prayed.",
  "retrievedAt": "2025-08-10T10:18:10.243Z"
}
