{
  "title": "Khalid Magsi reiterates unflinching support for Kashmiris on Youm-e-Istehsal",
  "link": "https://www.app.com.pk/national/khalid-magsi-reiterates-unflinching-support-for-kashmiris-on-youm-e-istehsal/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):Federal Minister for Science and Technology, Khalid Hussain Magsi has reaffirmed Pakistan’s unwavering support for the people of Indian-occupied Jammu and Kashmir on the occasion of Youm-e-Istehsal, observed annually to mark India’s revocation of the region’s special status on August 5, 2019.\n\nTalking to APP, the minister strongly condemned India’s unilateral move, terming it a violation of international law and United Nations Security Council resolutions.\n\n“That act marked a dark chapter in the region’s history and further intensified the brutalities being committed in the occupied valley,” he said.\n\nMagsi said the people of Kashmir continue to face widespread human rights violations, military lockdowns, and political suppression under Indian occupation.\n\n“On this day, we stand in complete solidarity with our Kashmiri brothers and sisters, who are courageously resisting decades of injustice.”\n\nHe reiterated that the government of Pakistan will continue to extend full political, moral, and diplomatic support to the Kashmiri people in their just struggle for the right to self-determination.\n\nUrging the global community to take serious notice of the grave situation in the region, the minister said, “The silence of the world powers only emboldens the oppressors. The time has come for the international community to ensure accountability and justice.”\n\nHe emphasized that the international media and human rights organizations must play their role in exposing the reality of Indian atrocities in the occupied territory. “Suppressing the truth cannot suppress the spirit of the Kashmiri people,” he said.\n\nMagsi paid rich tribute to the resilience and sacrifices of the Kashmiri people. “Their courage in the face of tyranny is unmatched. Pakistan will continue to be their voice at every forum until their aspirations are fulfilled,” he added.\n\nThe minister also urged Pakistani youth and civil society to remain engaged and vocal in support of the Kashmiri cause, saying that collective national resolve strengthens the global campaign for justice and human rights in Kashmir.",
  "retrievedAt": "2025-08-10T10:18:06.081Z"
}
