{
  "title": "Govt to run massive vaccination drive across country: Asad Umar",
  "link": "https://www.app.com.pk/national/govt-to-run-massive-vaccination-drive-across-country-asad-umar/",
  "date_published": "2021-05-31T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP): Minister for Planning, Development and Special Initiatives Asad Umar Monday said the government had decided to run massive COVID vaccination drive across the country to achieve the target of providing 70 million vaccines to the people.\nThe lockdown is no more the solution of containing COVID-19, as the vaccination has become the only way to do away with the pandemic,” Asad Umar said while briefing media after attending the meeting of National Coordination Committee (NCC) here.\nThe NCC meeting was presided over by Prime Minister Imran Khan and was attended by Chief Ministers of all the provinces.\nAsad Umar informed that in today’s meeting, the NCC had endorsed the strategy of vaccination drive prepared by the National Command and Operation Center (NCOC).\n“We want that maximum number of people should be administered the vaccines in June and July before the Eid-ul-Azha to avoid imposing lockdown in the county during the Eid festival.\nAsad Umar said the NCOC took some difficult decisions during the last ten days of Ramzan and Eid days but they yielded positive results as the positivity ratio had come down from 10-11 percent to 4 percent.\nIn Sindh, however he said the pandemic was still expanding at little higher rate.\nHe said the COVID had not ended yet and the people should still strictly follow the SOPs issued by the government to curb the expansion of pandemic.\nUmar said positive results were seen in the countries where vaccination ratio was high.\nIn the country so far, about 5.3 million people have been vaccinated.\nHe said there was no issue of vaccine availability as “we have already arranged 10 million more vaccines while 10 million more would available in June and further 10 million in July, he added.\nHe said during previous day, some 383,000 vaccines were provided but “we want to increase the daily vaccine number by 100 percent”.\nHe said now the whole of nation approach was being adopted to ensure effectiveness of the vaccination drive.\nThe minister added that, the federal government would provide free of cost vaccine to all people including18 years and above.\nHe said in order to make the drive successful, the government would engage different stakeholders including media, bar councils, religious scholars, Ulema, trade bodies and others to run the drive collectively.",
  "retrievedAt": "2025-08-11T20:47:06.124Z"
}
