{
  "title": "Best healthcare services to be ensured for mother, child: Dr Faisal",
  "link": "https://www.app.com.pk/national/best-healthcare-services-to-be-ensured-for-mother-child-dr-faisal/",
  "date_published": "2021-05-31T12:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP): Special Assistant to Prime Minister on National Health Services, Regulations, and Coordination Dr Faisal Sultan on Monday said that the government is committed to providing the best medical services at public hospitals for mother and child in the country.\nDuring visit to Mother and Child Health Center Aabpara, Dr Faisal said that innovative steps are being taken to further improve the facilities to control mother and child mortality rate in the country.\nHe said that the present government has paid special focus on the health sector and particularly on mother and child health by starting several mega projects. He said that effective measures are being adopted to achieve targets of universal health coverage (UHC).\nHe said that the government is working for expansion of universal health coverage (UHC) by investing in health systems, especially in Primary Health Care (PHC) and is committed to implement its agenda to achieve the target of UHC.\nHe reiterated the strengthening of Primary Health Care in the country and taking innovative steps to improve the health status of the population. He assured expansion in coverage of the Sehat Sahulat Program, which will be instrumental in decreasing the financial burden on the poor and marginalized population and endorsement of the Universal Health Coverage Benefit Package.\nHe said that the government is working on developing strategies and plans for strengthening the PHC services and implementation of UHC plan.\nHe urged the public to strictly adhere to COVID-19 Standard Operating Procedures (SoPs) to effectively counter the disease. He urged citizens to wear mask, maintain social distance, wash hands with soap frequently and avoid crowded places.",
  "retrievedAt": "2025-08-11T20:47:12.107Z"
}
