{
  "title": "Surveillance, screening enhanced for Monkeypox: Dr. Mukhtar Ahmad",
  "link": "https://www.app.com.pk/national/surveillance-screening-enhanced-for-monkeypox-dr-mukhtar-ahmad/",
  "date_published": "2024-08-17T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Prime Minister’s Coordinator for Health Dr. Malik Mukhtar Ahmad on Saturday said that the government has formulated a comprehensive strategy to protect the people from the Monkeypox (Mpox).\nAddressing a press conference, Dr. Mukhtar Ahmad said that people need not worry as only one case of Mpox has been reported in Pakistan. He added surveillance and screening are in place at all airports and points of entry.\nDr. Mukhtar Ahmad said that in the provinces including the federal capital, laboratories are allocated for the diagnosis of Mpox. He said that cases of Mpox have been reported from Africa and people coming from Africa, America and the Gulf countries will be monitored.\nHe said that under the leadership of Prime Minister Muhammad Shehbaz Sharif, the Federal capital and the provinces have taken steps on a joint priority basis. He said that the Ministry of Health is ensuring continuous monitoring daily and the government is closely monitoring the situation.\nHe said that the ministry is in full contact with the provinces and on the instructions of the prime minister, a meeting is being conducted on daily basis. He appealed to the public to isolate themselves at home if their family has a travel history and Mpox symptoms.\nDr. Mukhtar Ahmad added in such a situation contact a qualified doctor and follow the doctor’s instructions in case of having any such symptoms.\nHe said that this virus has been found in 99,000 people in the world and only 200 patients died and all others recovered. He said that symptoms may take 10 to 15 days to appear and spending too much time with the patient can spread it.\nIt is better if the patient is quarantined, he said adding that fever medicines are used for Mpox.",
  "retrievedAt": "2025-08-11T04:43:37.782Z"
}
