{
  "title": "PM for strict vigilance in wake of global mpox outbreak",
  "link": "https://www.app.com.pk/national/pm-for-strict-vigilance-in-wake-of-global-mpox-outbreak/",
  "date_published": "2024-08-17T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday directed for keeping strict vigilance on spread of Monkeypox (mpox) after the World Health Organization (WHO) had declared its outbreak in different parts of the world as public health emergency of international concern.\nChairing an important meeting on the measures being taken against spread of mpox virus, the prime minister directed for ensuring effective screening measures at all airports, seaports and borders of the country, besides asking the border health services to keep complete surveillance of the situation.\nHe also directed the National Command and Operations Center (NCOC) to keep alertness and hold daily evaluation of the situation and asked for provision of all required gadgets and kits for the evaluation of mpox virus.\nThe meeting was attended by PM’s Coordinator on National Health Dr Malik Mukhtar Ahmad Bharath, Federal Secretary National Health Nadeem Mehboob, Chairman National Disaster Management Authority (NDMA) Lt. Gen. Inam Haider Malik, chief secretaries, chief commissioner ICT and other relevant senior officials, PM Office Media Wing said in a press release.\nThe prime minister further directed for strengthening of coordination among the provincial governments, governments of Gilgit Baltistan and Azad and Jammu Kashmir.\nHe asked for the launch of effective and complete awareness campaign, besides hinting to get weekly briefing over the mpox situation.\nThe meeting was apprised of the situation about the spread of monkeypox virus. A person in District Mardan was diagnosed as carrier of the virus. The resident had just returned to Pakistan from abroad where he was employed. He was quarantined and his condition was out of danger, the meeting was further apprised.\nIt was told that no local transmission of mpox was detected in Pakistan. The WHO, on August 14, had declared spread of mpox virus as public health emergency after which the NCOC had issued national advisory. The required instructions in this regard had been issued, the meeting was briefed.\nThe federal and provincial governments were launching awareness drives in this regard, whereas Civil Aviation Authority (CAA) would supervise the flights arriving from abroad.\nThe provincial governments, governments of Gilgit Baltistan, Azad Jammu and Kashmir and Islamabad Capital Territory administration had allocated isolation wards and beds in the largest hospitals for the possible mpox virus cases.\nAll the precautionary measures were in place, it was further added.",
  "retrievedAt": "2025-08-11T04:43:16.954Z"
}
