{
  "title": "Naqvi visits residence of martyred DC Panjgur",
  "link": "https://www.app.com.pk/national/naqvi-visits-residence-of-martyred-dc-panjgur/",
  "date_published": "2024-08-17T15:32:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 17 (APP): Federal Interior Minister Mohsin Naqvi on Saturday visited the residence of the martyred Deputy Commissioner of Panjgur, Zakir Baloch, in Turbat.\nHe was accompanied by IG Frontier Corps South Balochistan, Major General Bilal Sarfraz Khan.\nInterior Minister Mohsin Naqvi met with Zakir Baloch’s father, his brothers and other family members, expressing deep sorrow and grief over his martyrdom.\nThe interior minister consoled the father of the martyred Deputy Commissioner of Panjgur, Zakir Baloch and praised his courage.\nHe announced financial assistance of 20 million rupees for the family of the martyred Deputy Commissioner and handed over an allotment letter for a plot to the martyr’s father.\nMohsin Naqvi also conveyed a special condolence message from President Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif to the father of the martyr.\nWhile talking to the family members, he said that while this cannot replace a lost life, it is a humble effort to take care of the family of the martyred Zakir Baloch.\n“It is our responsibility to take care of the family of the martyred Zakir Baloch,” he said adding that We are proud of a courageous father like you, who provided higher education to all your sons. The entire nation salutes the father of the martyred son.\nExpressing his deep sadness over the martyrdom of Deputy Commissioner Panjgur Zakir Baloch, the Interior Minister described him as a dedicated, hardworking, and brave officer.\n“Zakir Baloch achieved the highest rank of martyrdom, and martyrs live forever,” he said. “The late Deputy Commissioner will always remain alive in our hearts. We salute the sacrifice of Zakir Baloch, who was martyred in the line of duty.”\nFederal Interior Minister Mohsin Naqvi prayed for the elevation of the ranks of the martyred Deputy Commissioner and for patience and strength for his family.\nThe RPO Gwadar, Deputy Commissioner and other senior civil and military officials were also present on this occasion.",
  "retrievedAt": "2025-08-11T04:43:14.612Z"
}
