{
  "title": "Mohsin Naqvi visits residence of martyred deputy commissioner",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-visits-residence-of-martyred-deputy-commissioner/",
  "date_published": "2024-08-17T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Minister for Interior Mohsin Naqvi visited the residence of martyred Deputy Commissioner Panjgur Zakir Baloch in Mastung.\nHe met with the father of Zakir Baloch, Kanoor Baloch, his brothers, and other family members. Inspector General Frontier Corps South Balochistan Major General Bilal Sarfraz Khan was also present on the occasion.\nExpressing deep sorrow over the martyrdom of Zakir Baloch, Mohsin Naqvi condoled with the father of Zakir Baloch. He announced the financial assistance of Rs. 2 crores for the family of martyred Deputy Commissioner. He also handed over the allotment letter of a plot to the father of Zakir Baloch.\nThe interior minister conveyed special condolence messages from President Asif Ali Zardari and Prime Minister Muhammad Shhbaz Sharif.\nHe stated that this is not a substitute for anyone’s life, but a humble effort to take care of the family of martyr Zakir Baloch.\nHe assured that it is their responsibility to take care of the family of martyrs. He further said, “we are proud of the parents like you who have provided higher education to all their sons”.\nThe minister stated that the entire nation salutes the father of the martyr. He said that Zakir Baloch was a dutiful, hardworking, and brave officer who achieved the highest rank of martyrdom and that martyrs are always alive.\nHe further said, “Deputy Commissioner Panjgur Zakir Baloch will always live in our hearts and we salute his sacrifice as he embraced martyrdom while performing his duties. He prayed that May Allah Almighty elevate the ranks of martyred Deputy Commissioner Panjgur Zakir Baloch and grant patience to his family”.\nRegional Police Officer Gwadar, Deputy Commissioner, and high-ranking civil and military officials were also present on the occasion.",
  "retrievedAt": "2025-08-11T04:43:16.379Z"
}
