{
  "title": "Education access, self-confidence, family support: key to success for special persons",
  "link": "https://www.app.com.pk/national/education-access-self-confidence-family-support-key-to-success-for-special-persons/",
  "date_published": "2023-08-23T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Stressing the significance of family support, access to education, exploration of unique abilities, and self-confidence as crucial elements for the success and empowerment of special persons, Assistant Legal Advisor at Pakistan Bait-ul-Mal, (PBM) Noreen Khan, stated on Wednesday.\nIn an interview with APP, she, who herself was born with a disability affecting the left side of her body, stressed the importance of launching an awareness campaign especially targeting parents of special children.\nThe aim is to communicate to parents that providing an education for their special child is crucial for securing an independent future. It’s imperative that parents comprehend that their child’s uniqueness is not a burden on society; rather, it holds the promise of a positive contribution.\nRecognizing and nurturing the latent talents of their special child becomes essential, as every individual has been bestowed with distinct gifts by Allah Almighty. The responsibility lies in the identification and refinement of these innate abilities to their fullest potential.\nShe noted that within PBM, there exists a specialized division committed to addressing the needs of individuals with special requirements. Parents facing limitations in educating their exceptional children should have access to education stipends offered by PBM. The imperative lies in parents equipping their children with education to foster their self-reliance. PBM assumes the role of providing educational stipends to cater to the specific needs of special children, guaranteeing their access to necessary education.\nHighlighting her challenges in accessing various buildings due to the lack of ramps, she emphasized the necessity of having wheelchair accessibility in different shopping centers. Ensuring accessibility in diverse buildings becomes essential to provide convenience for individuals with special needs.\nBorn in 1980, Noreen was enrolled in Al-Farabi Special Education Centre in Islamabad due to her physical limitations. After transferring to a regular girls’ school because of limited class options, she became acutely aware of her distinct physical condition. This marked the initial instance when she encountered various attitudes from different individuals.\nWhile some regarded her with pity, others extended remarkable kindness. Apart from her family, Noreen experienced a lack of encouragement and acknowledgment during her school years, resulting in feelings of isolation.\nAfter matriculation, she entered F.G. College for Women, Islamabad. College life was harder with multiple classrooms. Interested in Arabic Literature and Islamic Studies, but distant classrooms posed issues. Her tardiness contrasted classmates. Arabic teacher advised subject change due to timing, showing sympathy. Faced diverse attitudes in education.\nAfter LL.B from International Islamic University Islamabad, she faced advice on challenges for disabled women in law. Encouraged by teachers, she completed LL.B and joined NAB as Assistant Director. LL.M (Corporate Law) followed in July 2007. Drafted Accessibility Act for Pakistan Govt., contested 2008 General Election for National Assembly, aiming to represent disabled segment. Provided legal consultation to NGOs like STEP and Milestone for impact.\nCurrently, she serves as Assistant Legal Advisor (BPS-18) at Pakistan Bait ul Mal, dedicated to serving humanity. In closing, her advice is: “Stay strong, be positive, ignore others’ opinions; help them understand your goals. No shame in disability; Allah is our flawless creator.”",
  "retrievedAt": "2025-08-11T09:16:36.998Z"
}
