{
  "title": "Dangerous ‘new normal’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "IF recent developments have demonstrated anything it is that there are few certainties in geopolitics today. The world seems more unstable and unpredictable than at any time since the end of the Cold War. Conflicts have been proliferating. New ones have erupted even as longer-running wars persist.\n\nThe Middle East remains in turmoil and the war in Gaza continues. The Ukraine war is still raging. President Donald Trump has contributed much to international volatility by his disruptive policies and upending of the global trade system, but the world was already passing through unsettled times with multilateralism under unprecedented strain. Geopolitical tensions have escalated while the US-China confrontation remains the most significant strategic dynamic in a world in flux.\n\nThe global order has been fragmenting with increasing attacks by powerful countries on the sovereignty and territorial integrity of weaker states or those regarded as adversaries. Long-established global norms are being undermined. The threat or the use of force has become all too frequent.\n\nExamples abound of how international law is being flouted with impunity by countries launching military strikes on other nations in what are often disingenuously called pre-emptive wars. This has produced what UN Secretary General António Guterres once described as an “epidemic of impunity”. Israel’s war on Gaza, the Russian invasion of Ukraine, US bombing of Iran, India’s unprovoked attack on Pakistan and Israeli strikes on Iran all violated international law and the UN Charter. Does this represent what some call a new era of escalation? Is this a dangerous ‘new normal’?\n\nCountries taking such military offensives seem to calculate that there will be minimum or no international consequences or diplomatic costs of their actions. This is encouraging a casual and careless defiance of international law. In some cases, there hasn’t even been global condemnation of military aggression.\n\nFor example, no Western country denounced the Israeli attack on Iran’s nuclear facilities, prohibited by international law, additional protocols of the Geneva Conventions and UN Security Council resolutions; instead, some countries applauded the strikes. Then there is the double standard practised by much of Europe towards the conflicts in Ukraine and Gaza — condemning Russia and supporting Ukraine but not applying the same principle to Israel, the aggressor, in its genocidal war on Gaza. For many countries of the Global South, this has spelt the denouement of a rules-based order, whose rules were in any case unequally applied and advantaged Western powers.\n\nHistory is testimony to the fallacy that the use of force can bring peace and security.\n\nThe fraught security environment, marked by lawlessness, armed conflicts and mounting geopolitical tensions, has had an obvious impact. It has led to a significant rise in global defence spending, with the world rearming at an alarming pace. According to the annual 2025 report by Sipri (Stockholm International Peace and Research Institute), global defence expenditure has hit a record level.\n\nThe most significant spending increases are accounted for by countries either engaged in or anticipating regional conflict. The annual Military Balance report by IISS (International Institute of Strategic Studies) also found global defence spending soaring to a new high. This is having a destabilising impact at both the global and regional levels.\n\nGrowing insecurity and rising threat perceptions have also engendered renewed thinking among countries about seeking nuclear weapons. Having witnessed how Iran and Ukraine were attacked by nuclear powers — Iran, an NPT member-nation being bombed by two nuclear weapon states — many countries have been encouraged to see nuclear weapons as the most viable option for their security.\n\nThe lesson countries facing security challenges may have drawn from recent events is that without nuclear weapons they are more vulnerable to external aggression and attacks on their sovereignty. This makes a discriminatory global non-proliferation regime, that has been eroding over time, more questionable in the eyes of many states. The Sipri report highlights the potential for more countries to consider developing or hosting nuclear weapons. This at a time when the nuclear arsenals of nuclear-armed states are being “enlarged and upgraded”.\n\nAccompanying these trends is declining faith in diplomacy. This doesn’t of course mean that diplomacy isn’t needed, but when diplomacy fails to produce results or negotiations are used as a smokescreen for military action — as Israel has been doing in talks with Hamas and the US did with Iran — its efficacy comes into doubt. This is consequential as the breakdown of trust makes countries reticent and sceptical about negotiations, as for example Iran is in response to talks offers from the US.\n\nMultilateral institutions, too, are faced today with a crisis of credibility and legitimacy. Guterres has repeatedly said trust in global institutions is at a breaking point with multilateral organisations ailing and in need of urgent reform and revitalisation. The loss of faith in multilateralism, he has said, is because people see “broken promises, unmet commitments, double standards, and vast inequalities”.\n\nFormer secretary general Ban Ki-moon has gone even further arguing that “the UN is slipping into dysfunction”. In a recent essay in The Economist, co-authored with Helen Clark, he attributed this to the organisation’s powerful members, who “disregard the rule of law when it suits them”, and to “certain leaders who want to see the UN on its knees”.\n\nWhat has brought the UN into disrepute is the role of the Security Council whose principal responsibility is to prevent conflicts, end wars and preserve international peace. The Council has failed to live up to this responsibility because of its veto-wielding members and the divisions among them. Not only has the SC failed to prevent genocide in Gaza and end Israel’s war there, some of its permanent members have invaded countries, bombed states and attacked the sovereignty of other nations.\n\nWhat all this adds up to is growing international disorder in which unilateral actions by big countries and regional powers are posing new risks and magnifying threats to international peace and security. The most dangerous approach adopted by leaders of some countries is based on their belief that the use of force will deliver peace and stability. History bears testimony to the fallacy of such a notion.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68686000d0725.jpg",
  "retrievedAt": "2025-08-17T19:44:25.888Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922222/dangerous-new-normal",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:54.000Z"
}
