{
  "title": "Turkiye arrests three more opposition mayors: party - World - DAWN.COM",
  "author": null,
  "content": "Turkiye arrested three more opposition mayors early on Saturday as part of an investigation into alleged graft, officials from the main opposition, the Republican People’s Party (CHP) said, denouncing it as a “political operation”.\n\nThe early morning arrests were the latest move targeting elected officials of the CHP as the government of President Recep Tayyip Erdogan puts increasing pressure on the party, which won a huge victory against his Justice and Development Party (AKP) in the 2024 local elections and is rising in the polls.\n\nThe arrests were linked to an investigation into alleged graft which resulted in the removal in March of Istanbul’s powerful opposition mayor, Ekrem Imamoglu, whose jailing sparked mass protests in Turkiye’s worst street unrest since 2013.\n\nImamoglu is Erdogan’s biggest political rival and the CHP’s candidate for the 2028 presidential race.\n\nEarlier this week, police arrested more than 120 people as part of a probe into alleged graft in the opposition stronghold of Izmir, Turkiye’s third city.\n\nThe latest detainees were based in southern Turkiye: mayor of the southern city of Adana, Zeydan Karalar; mayor of the resort town of Antalya, Muhittin Bocek; and the mayor of Adiyaman in the southeast, Abdurrahman Tutdere.\n\n“In a system where the law bends and sways according to politics, where justice is applied for one group and ignored for another, no one should expect us to trust in the rule of law or believe in justice,” wrote Mansur Yavas on X, opposition mayor of the capital Ankara.\n\n“We will not bow to injustice, lawlessness, or political operations.”\n\nThe pro-Kurdish Peoples’ Equality and Democracy Party (DEM), the third largest in Turkiye’s parliament, also denounced the arrests in a strongly-worded statement.\n\n“This persecution of elected officials must stop,” wrote DEM co-president Tulay Hatimogullari on X.\n\n“Not respecting the decisions of the people at the ballot box and not recognising the will of the people is causing deep rifts within society,” she wrote.\n\n“These operations are not a solution, but block the road to a democratic Turkiye.”\n\nDEM has in recent months been working closely with Erdogan’s government to facilitate moves to end the decades-long conflict with the Kurds, facilitating talks which in May saw Kurdistan Workers’ Party (PKK) rebels ending their bloody armed struggle in a conflict that cost nearly 40,000 lives.\n\nSaturday’s arrests were the latest in a slew of legal manoeuvres targeting the CHP.\n\nOn Monday, an Ankara court began hearing a case against the party involving allegations of vote-buying at its 2023 leadership primary which could end up overturning the election of CHP’s popular leader Ozgur Ozel, who rose to prominence for his role in leading the March protests.\n\nAnadolu news agency said the Adana and Adiyaman mayors were linked to a case opened by the Istanbul public prosecutor’s office into alleged tender rigging and bribery.\n\nPolice also arrested the deputy mayor of Istanbul’s Buyukcekmece district Ahmet Sahin as part of the same probe, BirGun news website said.\n\nAntalya’s mayor was held over a separate investigation launched by the resort town’s chief public prosecutor into allegations of bribery, with police also arresting his son, it said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/05152036298e6fc.png",
  "retrievedAt": "2025-08-17T19:44:12.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922292/turkiye-arrests-three-more-opposition-mayors-party",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T10:33:28.000Z"
}
