{
  "title": "Jirga member killed, 3 injured by armed suspects’ firing in Bannu: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least one person was killed and three others were injured after armed assailants attacked a jirga in Khyber Pakhtunkhwa’s Bannu district, police said on Saturday.\n\nPakistan has witnessed an uptick in terror activities recently, especially in KP and Balochistan after the banned Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.\n\nBannu police spokesperson Kashif Nawaz told Dawn.com, “The Sardi Khel community had organised a jirga in the Mandi Khel area, which was attacked by militants who attempted to take away the jirga leader, Malak Eid Nawaz Sardi Khel, resulting in a clash with the jirga participants.”\n\nHe said that the armed men opened fire at the participants, killing one person and injuring three other people, including a police constable.\n\nNawaz further said the injured were taken to the District Headquarters Hospital Bannu for treatment.\n\nA police party had gone to the crime scene and searched for the terrorists while making efforts to maintain peace in the area, he added.\n\nBannu has witnessed several militant attacks over the past several months.\n\nIn March, 16 terrorists were killed while five soldiers were martyred as security forces responded to a terrorist attack on the Bannu Cantonment.\n\nThe incident resulted in the deaths of 13 civilians and injured 32 others after “severe destruction” of a mosque and a residential building due to the suicide blasts, causing the perimeter wall to partially collapse.\n\nOn October 14 2024, five militants wearing burqas and suicide vests were killed as four police officials embraced martyrdom in an attempt to foil a gun and bomb attack on Iqbal Shaheed Police Lines.\n\nLast year, a terrorist attack in July targeting Bannu Cantonment had martyred eight members of the security forces, while a retaliatory operation killed 10 terrorists.\n\nDespite several high-profile attacks, the country saw an overall decline in militant violence during June, according to data released by an Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies.\n\nThe report said that there were a total of 78 militant attacks across the country in June, resulting in at least 100 fatalities, including 53 security personnel, 39 civilians, six militants, and two members of peace committees.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/07/669adf0d9de5b.jpg",
  "retrievedAt": "2025-08-17T19:43:56.481Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922294/jirga-member-killed-3-injured-by-armed-suspects-firing-in-bannu-police",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T13:08:51.000Z"
}
