{
  "title": "LHC again warns against felling of trees - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court on Friday once again warned the authorities against felling trees for Yellow Line Train or any other development project in the provincial metropolis.\n\nDuring the hearing of several identical petitions on environmental issues, a provincial law officer told the court that the Yellow Line Train project remained under consideration so far, with no physical work started.\n\nJustice Shahid Karim maintained that cutting trees would not be allowed under any circumstances. He observed that developed countries may manage climate impacts, but Pakistan was far more vulnerable.\n\nThe judge clarified that the court was not opposed to development, but wanted that all future projects avoid deforestation.\n\nHe declared that a contempt notice would be issued to the director general of the Parks and Horticulture Authority (PHA) in case of cutting trees for any project.\n\nThe judge also expressed concern over the worsening effects of climate change, urging the authorities to prioritise environmental protection.\n\n“For God’s sake have mercy on future generations and plant more trees,” Justice Karim said, suggesting that greenery be made mandatory on high-rise buildings as part of sustainable urban planning.\n\nDuring the proceedings, a counsel for the Lahore Development Authority (LDA) submitted the Green Buildings Policy, which includes provisions like water treatment plants.\n\nThe judge was informed that the policy applies only to new constructions and that six buildings in Lahore have so far been declared green buildings.\n\nA court-formed judicial commission presented a report on tree plantation within the Central Business District (CBD).\n\nThe judge also directed the chief traffic officer (CTO) to submit a report on the feasibility of converting major roads into one-way routes to ease congestion and reduce pollution.\n\nThe judge will resume hearing on July 11.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/thumbnail/2025/08/11095605e9eac17.jpg",
  "retrievedAt": "2025-08-17T19:44:46.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922202/lhc-again-warns-against-felling-of-trees",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:36.000Z"
}
