{
  "title": "Berlin offers to buy US air defence system for Kyiv - World - DAWN.COM",
  "author": null,
  "content": "BERLIN: German Chancellor Friedrich Merz discussed his country’s offer to buy Patriot air defence systems for Ukraine with US President Donald Trump by phone on Thursday, according to a government spokesperson.\n\nMerz initiated the call with Trump to promote arms deliveries to Ukraine, particularly Patriots, after the Pentagon paused some shipments, the spokesperson said on Friday.\n\nGermany was in “intensive talks” to buy Patriots for Ukraine to help it counter some of the heaviest Russian attacks since the war began in 2022, the spokesperson said at a press conference on Friday.\n\n“There are various ways to fill this Patriot gap,” the spokesperson told journalists, adding that one option being considered was buying the Patriot missile batteries in the United States and then sending them on to Kyiv.\n\nThe US has paused shipments of certain critical weapons to Ukraine, including 30 Patriot air defence missiles due to low stockpiles, prompting warnings by Kyiv this would weaken its ability to defend itself.\n\nGermany has sent three of the US-made systems from its military stocks to Ukraine, and Defence Minister Boris Pistorius last month.\n\nPistorius would travel to Washington later this month for talks with his US counterpart about his initiative, as well as production capacities, said a defence ministry spokesperson.\n\n“Of course these issues will also be on the agenda,” said the spokesperson.\n\nPistorius has floated the idea of buying Patriot systems that could be freed up to bypass long industrial delivery times and ensure they get to Ukraine quickly.\n\nUkraine is increasingly\n\ndesperate for the systems that it relies on to destroy fast-moving ballistic missiles, with President Volodymyr Zelensky also calling Trump on Friday to discuss air defence weapons and Russian strikes.\n\nGermany, Ukraine’s second largest donor after the United States, has sought to take on more of a leadership role in ensuring backing for Kyiv as US support has been thrown into question under Trump.\n\nWhile Europe could sustain Ukraine’s resistance without US military support, according to a German military official, the challenges would be immense.\n\nGermany has provided a total of 38 billion euros ($43bn) worth of military aid to Ukraine, including funds earmarked for the coming years.\n\nMacron, Starmer to chair talks\n\nPresident Emmanuel Macron and British Prime Minister Keir Starmer will during the French leader’s visit next week to the UK co-chair talks with other European leaders on boosting Ukraine’s defences, the Elysee Palace said.\n\n“There will certainly be a discussion on how to seriously maintain Ukraine’s combat capability,” Elysee Palace said, adding that Starmer and Macron will co-chair the meeting of Kyiv’s allies. by video link.­\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:45:07.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922174/berlin-offers-to-buy-us-air-defence-system-for-kyiv",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:24.000Z"
}
