{
  "title": "Despite tensions, trade with India continues - World - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite a brief military conflict and the continued closure of borders, trade between Pakistan and India persisted in May, with official data showing that imports from India reached a three-year high during July-May FY25.\n\nAccording to the State Bank of Pakistan (SBP), imports from India totalled $211.5 million in the first 11 months of FY25 — surpassing $207m in FY24 and $190m in FY23. In May alone — when the four-day conflict broke out in the first week—imports stood at $15m, slightly down from $17m in the same month last year.\n\nHowever, Pakistan’s exports to India remained negligible. In May, they were recorded at just $1,000, while total exports during July-May FY25 were only $0.5m. In FY24 and FY23, exports stood at $3.44m and $0.33m, respectively—highlighting the highly one-sided nature of bilateral trade.\n\nTraders were reluctant to discuss the continuation of imports during the tense period. One trader suggested the goods might have arrived through third countries, with payments made prior to the hostilities.\n\n“It may have come from a third country and the payment for the May imports would have been made before the war,” he said.\n\nPakistan’s imports from New Delhi hit 3-year high\n\nAlthough official data reflects limited trade, Indian research institutions claim actual trade is far higher. The India-based Global Trade Research Initiative (GTRI) reported last month that India’s unofficial exports to Pakistan are estimated at $10bn annually, routed primarily through Dubai, Colombo, and Singapore.\n\nAnalysts say the unofficial trade remains robust due to Pakistan’s high cost of production and industrial dependence on foreign inputs.\n\n“We should not ignore smuggling from India since the cost of production in Pakistan is the highest in the region, which creates space for goods from India, China, and Bangladesh,” said an exporter.\n\nFormal trade relations between Pakistan and India have remained frozen since 2019, but the data and ground realities suggest economic interdependence persists, albeit through unofficial channels.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68685a81ce192.gif",
  "retrievedAt": "2025-08-17T19:45:32.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922165/despite-tensions-trade-with-india-continues",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:12.000Z"
}
