{
  "title": "Automobile prices surge after budgetary levies - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Following the imposition of a carbon levy and an increase in sales tax under the federal budget 2025-26, several automobile assemblers have begun passing the impact on to consumers from July 1, while others are either absorbing the additional cost or delaying price revisions until after Ashura.\n\nAn official at MG Pakistan stated the company would absorb the price hike despite the new levy. The assembler of Haval vehicles has also decided to maintain prices at previous levels.\n\nThe carbon levy or NEV adoption levy is charged at 1pc on engines below 1300cc, 2pc on engines between 1300cc and 1800cc, and 3pc on engines above 1800cc, applied on the invoice price, including duty and taxes.\n\nPak Suzuki Motor Company Ltd (PSMCL) has raised prices across its lineup by Rs18,810 to Rs186,000. The Alto VXR, VXL, and AGS now cost Rs2.994m, Rs3.166m, and Rs3.326m, reflecting increases of Rs167,861, Rs177,480, and Rs186,446, respectively.\n\nIn the upgraded Suzuki Cultus range, the VXR, VXL, and AGS models are now priced at Rs4.089m, Rs4.359m, and Rs4.591m, up by Rs40,490, Rs43,160, and Rs45,460, respectively.\n\nThe Suzuki Swift GL MT, GL CVT, and GLX CVT now retail at Rs4.460m, Rs4.605m, and Rs4.766m, compared to Rs4.416m, Rs4.560m, and Rs4.719m earlier.\n\nAssemblers increase vehicle prices by up to Rs700,000 following carbon levy and higher GST\n\nSuzuki Every VX and VXR posted price increases of Rs163,230 and Rs166,200, reaching Rs2.912m and Rs2.965m, respectively. Ravi pickup and its without-deck variant now cost Rs1.975m and Rs1.899m, up by Rs19,560 and Rs18,810. PSMCL clarified that the revised prices include FED, sales tax, and carbon levy but exclude advance income tax.\n\nCiting rupee depreciation, rising international freight charges, and the carbon levy, Lucky Motor Corporation increased prices of various KIA models from Rs95,000 to Rs700,000. The Picanto AT, Stonic EX Plus, and EX now sell at Rs4.090m, Rs5.999m, and Rs4.862m after respective increases of Rs150,000, Rs499,000, and Rs95,000.\n\nThe Sportage L Alpha, L FWD, and L HEV have seen hikes of Rs400,000 to Rs600,000, now priced at Rs8.899m, Rs10.499m, and Rs11.599m. The Sorento 3.5L V6 now costs Rs13.899m, up by Rs400,000, while its other variants—3.5L V6 EMI, HEV FWD, HEV AWD EMI, HEV AWD, and HEV AWD EMI—range from Rs14.399m to Rs17.199m, marking increases of Rs400,000 to Rs700,000. The Kia Carnival is now priced at Rs18.2m, up by Rs700,000.\n\nHowever, LMC has kept the prices of its electric vehicles—V5 Air, EV5 Earth, and EV9—unchanged at Rs18.5m, Rs23.5m, and Rs43.2m, respectively.\n\nAtlas Honda Ltd (AHL) has raised the prices of various motorcycles by Rs2,000 to Rs6,000. Its flagship models, the Honda CD 70 and CG-125, now cost Rs159,900 and Rs238,900, respectively.\n\nUnited Auto Industries has also revised up the prices of several two-wheeler models following the imposition of 18pc GST and the NEV levy. The US-70cc (standard), Self Start, Alloy Rim, and Alloy Rim with Self Start models are now priced at Rs111,000, Rs122,000, Rs121,000, and Rs132,000, compared to Rs93,182, Rs102,411, Rs101,572, and Rs110,801 previously.\n\nCar and bike parts imports surge\n\nDespite the price hikes, bike and two-wheeler sales are expected to remain firm in the coming months, supported by a rising trend in parts and accessories imports by assemblers.\n\nAccording to the Pakistan Bureau of Statistics (PBS), the import bill for semi- and completely knocked-down kits by car assemblers rose by 41pc to $950m during July–May FY25, from $676m in the same period last year. Imports of two-wheeler parts increased by 16.5pc to $43m from $37m during 11MFY24.\n\nAccording to Large-Scale Manufacturing data, bike production surged by 34pc to 1.362m units in July–April FY25, from 1.013m units in the same period last year.\n\nMohammad Sabir Sheikh, a bike sector analyst, rul­ed out any adverse impact on sales following the carbon levy. He noted that demand has remained strong since January, with many buyers opting to replace old­er mot­orcycles—typically over five years old—with new models.\n\nAtlas Honda Ltd achieved record monthly production and sales of 130,189 and 130,240 units, respectively, in May 2025.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:45:31.567Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922164/automobile-prices-surge-after-budgetary-levies",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:12.000Z"
}
