{
  "title": "Pakistan not mulling any alternative to Saarc: FO - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Spokesperson says Islamabad ‘committed’ to working with existing eight-nation forum\n• Calls upon India to choose between belligerence and talks\n\nISLAMABAD: Pakistan on Friday ruled out the creation of an alternative forum to the already existing South Asian Association for Regional Cooperation (Saarc).\n\n“Pakistan remains committed to the principles and objectives of the Saarc charter. It has actively been participating in different Saarc activities,” the foreign office spokesperson said about the eight-nation organisation, which included Pakistan, Afghanistan, Bangladesh, Bhutan, India, Maldives, Nepal and Sri Lanka.\n\nIn his weekly press briefing, Ambassador Shafqat Ali Khan said Pakistan desires Saarc to function as an “important forum for regional cooperation”.\n\nHe rejected the reports about the creation of a Beijing-led alternative to Saarc.\n\nRegarding cooperation among Pakistan, China, and Bangladesh, the member of the purported coalition, Mr Khan said China was a very important country that enjoys friendly relations with most of the South Asian countries.\n\n“China pursues an agenda of peace, development and common prosperity [and] in that sense, these three countries are working together”, he remarked.\n\nThe three nations have recently intensified bilateral contacts and held several high-level meetings.\n\nLast month, they launched a trilateral cooperation mechanism, pledging to pursue “win-win cooperation”.\n\nThe move, seen as a subtle yet significant shift in South Asia’s strategic landscape, was announced after the inaugural meeting of the Bangladesh-China-Pakistan Vice Foreign Minister/Foreign Secretary mechanism.\n\nThe new trilateral platform marked a notable development in the South Asian geopolitical landscape, particularly as it brought together Pakistan and Bangladesh, which had remained diplomatically distant for decades.\n\nThe relations between Islamabad and Dhaka have warmed considerably since the ouster of former Bangladeshi prime minister Sheikh Hasina last year.\n\nUnder the interim leadership of Chief Adviser Muhammad Yunus, Dhaka has actively pursued broader diplomatic horizons, including a new phase of engagement with both China and Pakistan.\n\nNuclear blackmail\n\nFO spokesperson Khan also expressed concerns over India’s military buildup and said it cannot be allowed to make arbitrary decisions about attacking other countries.\n\n“No state can allow another state to violate its sovereignty and territorial integrity at will. In the face of any aggression, Pakistan shall always defend its sovereignty and territorial integrity with full vigour. There should be no doubt about that”.\n\nReferring to the Indian assertions about the so-called nuclear blackmail, he said it revealed the “profound insecurity and frustration of India about Pakistan’s effective capabilities to defend itself”.\n\n“Pakistan’s conventional capabilities are adequate to deter India without the self-imposed ‘nuclear blackmail’ that New Delhi suffers from.”, he remarked.\n\nIn reply to a question about the Indian Defence Ministry’s approval of $12.31 billion to strengthen its missile and combat capabilities, he said Pakistan has been repeatedly flagging concerns about its neighbour’s rapid military buildup.\n\n“The past Indian strategic behaviour demonstrates, irrespective of their declaratory position, that this military buildup is primarily configured for use against Pakistan”, he said.\n\nIndia’s choice\n\nThe FO spokesperson once again reiterated the call for dialogue to resolve longstanding issues between India and Pakistan.\n\nHe said Pakistan preferred dialogue and diplomacy over conflict and confrontation.“Now it is India’s choice whether it treads the path of belligerence, bellicosity or takes steps for dialogue and reconciliation”, Mr Khan added.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:45:46.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922182/pakistan-not-mulling-any-alternative-to-saarc-fo",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:06.000Z"
}
