{
  "title": "Lyari building collapse — an inevitable tragedy foretold by Karachi’s illegal structures - Pakistan - DAWN.COM",
  "author": null,
  "content": "• SBCA has declared 588 buildings ‘dangerous’ in Karachi\n• 55 people have died in four major structural collapses over past five years in Lyari alone\n• Govt prepared to relocate occupants of dangerous buildings, says Saeed Ghani\n\nKARACHI: As yet another building crumbled into dust in Lyari on Friday killing at least 10 people, the shadow of a far greater disaster looms over the city, as the fallen structure was one of 588 buildings officially declared dangerous by the Sindh Building Control Authority (SBCA).\n\nA total of 107 of the “dangerous” buildings are concentrated in Lyari alone, making the latest tragedy less of a shock and more of a grim inevitability.\n\nThe building, now reduced to rubble, was no stranger to danger. In fact, the officials and sources said, it was already marked and catalogued as one of the 107 “dangerous structures” in Lyari, as per SBCA’s records.\n\nAcross the city, the SBCA admits that 588 buildings are too dangerous for human habitation.\n\nThe SBCA claims to have done its job — letters sent, notices served, warnings issued. But, these actions ring hollow when evacuation orders are neither enforced nor accompanied by viable relocation options for already vulnerable residents. Most of these residents are daily wage earners and low-income families with nowhere else to go.\n\n“We can’t forcefully evacuate without the cooperation of local law enforcement and social welfare bodies. People simply don’t leave,” said an SBCA official.\n\nBut the reality is far grimmer. Jawad Shoaib, a Lyariite and area councillor, says the authorities are more focused on “illegal constructions” in the area and had least interest in making serious plans for the relocation of the residents of these dangerous buildings.\n\n“If you’re told to vacate but have no money, no plan, and no help — what do you do? Wait to die, or risk staying?” he asked.\n\nThis is not the first time Lyari has mourned like this. Over the past five years, at least four major buildings have collapsed in this historic but long-neglected district. In 2020, three such incidents left 49 people dead.\n\nIn March 2020, a single-storey house collapsed after torrential rains — two lives lost, five injured.\n\nJust three months later, June 2020, a five-storey structure crumbled, killing 22 people. Later that month, another building fell in Khudadad Market, Lyari, claiming 25 more lives. And now, in July 2025, eight more names are added to a growing list of fatalities.\n\nThat’s 55 deaths in five years — all linked to crumbling, unsafe buildings in the same area.\n\nThe question hanging in the dusty Karachi air: If these buildings were already declared dangerous, why were people still living in them?\n\nSindh Local Government Minister Saeed Ghani sees it as a real challenge.\n\nTalking to the media after reviewing the ongoing rescue operations at the site of the collapsed building near Aath Chowk in Baghdadi, he sought people’s support for such “sensitive job”.\n\n“The real challenge arises when the government tries to forcibly evacuate residents from such buildings,” he said. “It becomes a humanitarian issue, and the authorities face criticism for displacing people from their homes. However, if the goal is to save innocent lives and avoid such disasters, strict action must be taken, even if it means removing people from their shelters.”\n\nHe said that after the recent tragedy, the people should think seriously about ensuring such incidents do not happen again anywhere in the city. “We may have to take away the roofs over people’s heads, but at least we will be able to save their lives,” he said.\n\nResponding to a question about the “mafia of illegal builders” operating in the city, he claimed that the government had taken strict action against them, filed FIRs, and identified such builders. However, he stressed that unless citizens cooperate, this issue cannot be resolved.\n\n“It’s a matter of demand. We want to eliminate this demand. If citizens stop purchasing homes in illegal buildings, the demand will cease,” he said and added that efforts are underway to cancel the feasibility of such illegal construction projects.\n\nLater in the evening, he told a press conference that the provincial government was prepared to displace occupants of the city’s dilapidated buildings in order to save lives, and relocate them to alternative sites if necessary.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686852ff6c8b0.gif",
  "retrievedAt": "2025-08-17T19:45:01.969Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922116/lyari-building-collapse-an-inevitable-tragedy-foretold-by-karachis-illegal-structures",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:30.000Z"
}
