{
  "title": "Microsoft closes office in Pakistan, lays off staff - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Microsoft has decided to close its office in Pakistan and laid off five employees, Dawn has learnt.\n\nEarlier, media reports suggested that the global tech giant had moved its operations out of the country.\n\nThese were based on a LinkedIn post by Jawad Rehman, the former head of Microsoft in Pakistan. Citing sources, he claimed the company “is officially closing its operations in Pakistan”.\n\nMicrosoft had an on-ground presence in Pakistan until recently, albeit with a significantly reduced local workforce. Most of its operations were handled from foreign offices and by partners in Pakistan, people familiar with the matter told Dawn.\n\nIn response to Dawn’s query, a Microsoft spokesperson said, “We will serve our customers through both our strong and extensive partner organisation, and other closely located Microsoft offices. We follow this model successfully in a number of other countries around the world.”\n\nSpokesperson says company to provide services through local partners, offices abroad\n\nThe decision to move out of Pakistan was part of the company’s ongoing series of layoffs worldwide as it looks to pivot towards artificial intelligence (AI).\n\nOn Wednesday, Microsoft announced it would lay off nearly four per cent of its around 228,000 employees, Reuters rep­orted. In May, the company announ­ced layoffs affecting around 6,000 workers.\n\nThe company said on Wednesday it planned to manage its operations with fewer managers and streamline its products, procedures and roles.\n\nEvolving business models\n\nIn a statement on Wednesday, the IT and Telecommunications ministry said global tech companies are moving from on-premises software deployment to the Software-as-a-Service (SaaS) model. Microsoft’s decision is also reflective of this shift.\n\nAccording to technology expert Habibullah Khan, large software enterprises have two business models: on-premise and Saas.\n\nUnder the former model, the company installs and runs software on the customer’s servers or infrastructure, with hardware and data centres managed internally by customers. The company gets a one-time payment through the sale of licences.\n\nOn-premise software deployment is a capital-intensive model and results in high upfront costs with recurring needs for maintenance and upgradation.\n\nIn comparison, SaaS allows a company to serve a particular location without any on-ground presence as the software is hosted in the cloud. In the model, the company makes money through subscription costs.\n\nWith the evolution of technology, more companies have transitioned to SaaS models, as it reduces upfront costs, Mr Khan explained.\n\nNot an ‘exit’\n\nThe IT ministry also said Microsoft’s move couldn’t be construed as an exit from Pakistan, but rather a shift to a “partner-led, cloud-based delivery model”.\n\nOver the past few years, several multinational companies in various sectors have either shut down their operations in Pakistan or sold them to local enterprises. Last month, ride-hailing service Careem announced it would end operations in Pakistan from July 18.\n\nHowever, Mr Khan believes Microsoft’s move is different from other exits, as the company now earns almost all of its revenue through cloud-based subscriptions.\n\nHe added the company is on a global cost-cutting drive and its decision to close the office in Pakistan was reflective of the move towards SaaS-and-AI operating model, “and is not in any way a reflection on Pakistan’s tech ecosystem or its economy”.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/071937488b6be2c.jpg?r=193756",
  "retrievedAt": "2025-08-17T19:45:22.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922163/microsoft-closes-office-in-pakistan-lays-off-staff",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:12.000Z"
}
