{
  "title": "80pc of rescue operation complete as death toll from Lyari building collapse rises to 19 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Rescue teams pulled more bodies from the rubble of a five-storey building collapse in Karachi overnight, taking the toll on Saturday to 19 as the recovery continued for a second day with eighty per cent of the operation completed.\n\nSouth Deputy Commissioner (DC) Javed Nabi Khoso told Dawn.com: “Eighty per cent [of the] rescue operation has been completed and it is still ongoing.”\n\nHe added that there were “19 confirmed deaths and 13 injured” so far in the incident.\n\nHowever, South Deputy Inspector General (DIG) of Police Syed Asad Raza earlier told a higher toll of 21 to Dawn.com. The same figure was reported in an update by the Edhi Foundation and according to the data from the Shaheed Mohtarma Benazir Bhutto Institute Of Trauma (SMBBIT) at Civil Hospital Karachi, seen by Dawn.com, which showed that 20 bodies were brought to the facility while one person died during treatment.\n\nThe data showed that 11 injured people were brought for treatment with 10 later discharged.\n\nThe five-storey building on Fida Husain Shaikha Road in Lea Market had already been declared uninhabitable by authorities due to its dilapidated structure, which was further weakened by recent rains, said DIG Raza.\n\n“Rescue operation is still underway in Baghdadi, Lyari where the building had collapsed on Friday,” DIG Raza told Dawn.com.\n\n“On one side, debris has been removed up to the ground floor, while on the other side, the rescue team has removed debris up to the third floor,” the police officer added.\n\nRoof and building collapses are common across Pakistan, mainly because of poor safety standards and the use of shoddy construction materials.\n\nKarachi, home to more than 20 million, is especially notorious for poor construction, illegal extensions, ageing infrastructure, overcrowding and lax enforcement of building regulations.\n\n“My daughter is under the rubble,” 54-year-old Dev Raj told AFP at the scene.\n\n“She was my beloved daughter. She was so sensitive but is under the burden of debris. She got married just six months ago.”\n\nRescue teams worked throughout the night, and families said that at least eight people were still believed to be trapped as temperatures climbed to 33 degrees Celsius in the morning.\n\nAbid Jalaluddin Shaikh, leading the Rescue 1122 efforts at the scene, told AFP that the operation continued through the night “without interruption”. “It may take eight to 12 hours more to complete,” he said earlier today.\n\nUp to 100 people had been living in the building, senior police officer Arif Aziz told AFP.\n\nThe incident came days after a portion of a building collapsed in the city’s Kharadar area. However, no casualties or injuries were reported.\n\nThe Public Account Committee of the Sindh Assembly had directed the provincial government in December to take urgent steps to evacuate over 570 buildings declared “dangerous” by authorities across Karachi.\n\nThe Sindh Building Control Authority (SBCA) said it had declared the plot as dangerous through its Technical Committee for Dangerous Buildings after a thorough inspection conducted in October 2022.\n\nThe authority said it had issued three ejectment notices to the residents since then, as well as asked K-Electric, Sui Southern Gas Company (SSGC) and Karachi Water and Sewerage Board (KWSB) to disconnect utility services.\n\nBut Imran Khaskheli, an owner and resident watching the rescue operation on Saturday, denied receiving notices.\n\n“Do you think we are out of our senses to stay in an unsafe building with our families?” he said, speaking to AFP. He said he had seen cracks in the pillars of the building early on Friday morning.\n\n“I knocked on all the doors and asked families to leave immediately,” Khaskheli said, adding that around 40 families lived in the building but that many did not heed his warning.\n\nMore than 50 buildings in the district have been declared unsafe, with six evacuated since yesterday, DC Khoso told AFP.\n\nRescue 1122 spokesperson Hassaanul Haseeb Khan said the incident had reportedly occurred between 9am and 9:30am. However, they said they received the information late due to the suspension of communication networks, he added.\n\nMobile services are usually suspended in certain areas due to security concerns during Muharram.\n\nSindh Rescue 1122 Director General (DG) Abid Jalaluddin Shaikh, in a statement, said yesterday there were hindrances during the rescue operation due to the “unruly crowd, various road blockades and mobile network [issues]”.\n\nHeavy machinery faced difficulty in reaching the site amid the narrow alleys of Lyari, a low-income neighbourhood.\n\nPolice even had to baton-charge a crowd that had gathered around the site to make way for machinery, officials added.\n\nSindh Chief Minister Murad Ali Shah sought a report on the collapse and details of dilapidated buildings from the SBCA.\n\nSindh Local Government Minister Saeed Ghani said a high-level committee has been formed that will submit a report on the incident by Monday. He lamented that residents did not evacuate the building despite being served notices previously.\n\nThe minister also ordered the suspension of the related officials at the SBCA.\n\nSindh Assembly opposition leader and Muttahida Qaumi Movement-Pakistan MPA Ali Khurshidi blamed the Sindh government for Karachi’s administrative collapse and the Lyari building tragedy.\n\n“Call the tanker mafia and you’ll get water in 30 minutes,” he said during a press conference, pointing out rampant corruption and institutional failure across civic bodies.\n\nKhurshidi said if the provincial administration was to blame and held responsible if it had not passed laws in 17 years to make this a criminal offence.\n\n“Instead of saying ‘this should be done,’ you should be admitting, ‘we should’ve done this, but we failed to.’”\n\nAddressing President Asif Ali Zardari and PPP Chairman Bilawal Bhutto-Zardari, he said: “This is a question of your and your party’s credibility.”\n\nHe said the suspensions of officials would not work, insisting that termination and legal consequences were necessary. He condemned the “harassment” of Karachiites through traffic police extortion, pleading for urgent administrative reform, saying the public was fed up.\n\n“This isn’t about point-scoring politics,” Khurshidi said. “We’re doing politics so we can solve genuine issues faced by people.” He concluded by calling on President Zardari and Bilawal to stop issuing mere condemnations and to instead fix the broken system under their party’s governance.\n\nIn April, a 10-year-old girl died when a three-storey building in Bhains Colony suddenly collapsed, while a man and a woman were pulled alive from the debris.\n\nIn October 2023, five people were killed and four others injured when an under-construction building collapsed in Shah Faisal Colony.\n\nThe city witnessed two such incidents within 72 hours in September 2020, claiming the lives of at least three people and injuring over a dozen.\n\nLyari also faced a similar incident in June 2020, when 22 people were killed after a five-storey residential building housing about 40 apartments collapsed.\n\nA building collapse in Karachi’s Gulbahar area in March 2020 killed 27 people. A similar 2011 incident in Lyari’s Musa Lane neighbourhood took 33 lives.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/05120610fc4453b.jpg",
  "retrievedAt": "2025-08-17T19:44:19.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922268/80pc-of-rescue-operation-complete-as-death-toll-from-lyari-building-collapse-rises-to-19",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T07:30:59.000Z"
}
