{
  "title": "Sindh govt moves ahead with plan to roll out 1,000 electric buses in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government is moving forward with its plan to roll out 1,000 electric buses across the city under its Peoples Green Transport Project, as Chief Minister Murad Ali Shah has given the go-ahead for engaging transaction advisers for the ambitious scheme.\n\nThe decision was taken in the meeting of the Public-Private Partnership (PPP) Policy Board on Friday.\n\nThe PPP Policy Board meeting, chaired by the CM, was informed that the technical evaluation committee had confirmed the project’s alignment with sustainable urban mobility goals and that the previously appointed transaction advisors would be used to fast-track implementation, avoiding delays in procurement.\n\nThe meeting was attended, among others, by provincial ministers Sharjeel Inam Memon, Saeed Ghani, Ziaul Hassan Lanjar, Chief Secretary Asif Hyder Shah, DG PPP Unit and Transport Secretary Asad Zamin.\n\nProcurement of 600 12-metre and 400 eight-metre buses under consideration\n\nIt meeting was informed that the advisors would assess the unique selling proposition submitted by a private consortium.\n\nIf deemed feasible, a detailed project will be implemented under the PPP model, involving phased procurement and operation of 600 12-metre and 400 eight-metre electric buses.\n\nAs per the project, 10 bus depots will be constructed and the project will operate on a per-kilometre payment model over a 10-year concession period, with ownership of assets transferring to the government thereafter.\n\nThe board also reviewed key updates on the Shahrah-i-Bhutto high-speed corridor, which stretches up to 39 km from Korangi Creek Avenue in DHA to the M-9 Motorway near Kathore.\n\nThe board discussed in detail and reviewed the progress on the Dhabeji Special Economic Zone project.\n\nE-cabinet app approved\n\nSeparately, the chief minister also approved the launch of the e-Cabinet App.\n\nThis innovative platform is designed to ensure robust security, transparency and environmental sustainability, achieving 100 per cent paperless operations and significantly reducing meeting preparation time by more than half, while also saving millions in government funds.\n\nThe CM revealed that the provincial government currently incurs over Rs11m annually in paper costs alone, excluding additional expenses such as file covers, boards, fuel and staffing.\n\nThe e-Cabinet app will manage the entire workflow for the chief minister’s summaries, cabinet meetings and documentation for the cabinet committee on finance, as well as meeting minutes.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:45:01.087Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922117/sindh-govt-moves-ahead-with-plan-to-roll-out-1000-electric-buses-in-karachi",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:30.000Z"
}
