{
  "title": "Why and for whom? - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE Supreme Court’s decision to allocate reserved seats to the treasury benches is being seen as the latest step towards stifling space for opposition politics and expanding the governing and legislative remit of the ruling regime.\n\nAny debate on the constitutional merits of this step and the extent to which it damages democracy is redundant. After an election that can only be charitably described as ‘irregular’, the government has been functioning through executive and judicial fiat for the past year, while politics more generally has been stage-managed for the past two and a half years.\n\nThe net result is a political sphere — legislature, federal government, judiciary and party activity — heavily regulated by the establishment.\n\nSo what will this latest step help achieve? With two-thirds delivered to the government in the National Assembly, and the Senate remaining its usual pliable self, there are murmurs of a ‘27th Amendment’ shooting for what the 26th attempted but could not score — a federal constitutional court sitting above the current superior judiciary.\n\nIt might seem a bit redundant, given how effective the constitutional bench is proving itself to be. But one shouldn’t underestimate the desire for total control. There remain lingering concerns about a potential judicial revolt bubbling up from the high courts against which a more comprehensive insurance policy, such as a superseding judicial structure, may be required.\n\nAnother murmur doing the rounds is a reconfiguration of the NFC award, long sought by both the civil-military bureaucracy, and several finance ministers. With the legislature numbers now in place, the next step would be to manufacture some urgency.\n\nThe volume on discussions of provincial profligacy in the face of federal impoverishment will go up. All will be told that the provinces put up populist budgets with few taxes, while the federal government does all the hard work (squeezing compliant taxpayers without broadening the base) for them. A revised NFC might seek to frontload some expenses — defence, pensions, debt-servicing — prior to downward transfers.\n\nFinally, a third murmur involves changes to the office of the presidency and who can legally occupy it. It will likely be a familiar revision, seen before on at least three earlier occasions. Given all that has transpired these past few years, it would be an unsurprising development.\n\nSociety shows no broad-based winners in the status quo. Instead, any winners here are selective.\n\nMedia discourse will busy itself with the possibility of none, one, two, or all three of these happening over the next few weeks. Talk show studios will turn into game theory seminars. But few will ask two fundamental questions: why is this happening and for whom?\n\nWhy is all this energy and effort being devoted to twist politics into creating and sustaining a hybrid-authoritarian state? While its architects think they’re creating their own version of China, so far they’ve only managed to recreate a South Asian Egypt. What is the logic at play here?\n\nLoyalists say this endeavour is a demand placed by the external security environment — a claim recently bolstered by the recent war with India. Others say it is the only way Pakistan can navigate a rapidly changing world order, marked by the erosion of American unipolarity. Another frequent justification is that it is the only way past petty constraints to deliver economic development.\n\nNone are new, each of these are as old as the country: authoritarianism, via a strong centre, was the need of the hour after achieving statehood to ensure territorial integrity; authoritarianism was needed to navigate the Cold War; and only authoritarianism could see through reforms needed for the country to prosper economically. The actual track record of all three justifications does not bear repeating. Crass power politics, ie, surviving in office by ensuring a popular force (this time around, the PTI) stays out, ends up as a more plausible ‘why’ every single time.\n\nThe other question worth raising is who is all of this in service of? A quick survey of the usual social groups reveals no clear winners. Large industrialists remain unhappy, as they usually are, on account of high interest rates, energy tariffs and new regulations regarding captive power plants. Exporters are no longer getting concessionary financing. Importers are struggling because of dollar liquidity constraints and fewer shenanigans with the exchange rate. Real estate developers and contractors haven’t had many favours since the 2020 amnesty scheme and the latest budget doesn’t do much for them either.\n\nFarmers, especially large landowners, are upset at commodity price crashes and the removal of support prices, which usually worked to their benefit. The middle classes are reeling from three years of real wage erosion and mounting taxes. The working classes are rarely given any consideration in Pakistani politics and it’s foolish to expect their fortunes to be any different today.\n\nSociety shows no broad-based winners in the status quo. Instead, any winners here are selective. Those who have access to the state, those who have access to its decision-makers. Those who’ve been on the right side of some important office holder. It’s not all industrialists, but perhaps one or two. It’s not all contractors, but perhaps a couple who’ve since been busy building underpasses and overheads. A logic of rewarding the right number of people to keep things ticking along remains the dictating logic of this regime.\n\nAnd it is the same logic that is at play within the state as well. While everyone else gets austerity and low growth, officers of the state — civil and military — face few such constraints. Some get elevated to new ranks. Others get offices they would not have access to otherwise. The right judgement produces an appropriate reward. Timely compliance and deference gets you a two-thirds majority.\n\nSo on the rare instance that someone asks ‘why and for whom?’, the easiest answer is power and for those who staff and sustain the state.\n\nThe writer teaches politics and sociology at Lums.\n\nX: @umairjav\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6868602a0fe24.png",
  "retrievedAt": "2025-08-17T19:44:27.069Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922223",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:54.000Z"
}
