{
  "title": "Law enforcement agencies should be held accountable for lapses during investigations: SC - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court has observed that law enforcement agencies should be held accountable for lapses during the investigations or prosecution, which leads to the acquittal of criminals.\n\nThe observation was given by Justice Athar Minallah in an order acquitting two men accused of drug trafficking.\n\nThe judge expressed displeasure over the performance of law enforcement agencies, saying the future generations cannot be exposed to the menace of narcotics only because the authorities tasked with ridding society of this evil fail to perform their duty effectively.\n\nHe observed the law enforcement agencies arrest alleged traffickers but fail to get a conviction due to lapses in investigation.\n\nAcquits two men ‘caught with 314kg narcotics’ Justice Minallah says law enforcement agencies arrest accused, but fail to get them convicted\n\nThe judgement acquitted two men, Ameenullah and Khairullah, who were arrested on March 12, 2017, with 314kg of narcotics in their vehicle.\n\nThe appellants were booked in a case registered at Police Station Staurt Ganj, Shikarpur, under section 9(c) of the Control of Narcotic Substances Act 1997.\n\nIn April 2019, the Sindh High Court (SHC) Larkana circuit bench released the two men on the benefit of doubt.\n\nThe apex court found serious lapses at the investigation and prosecution stages, like missing proof of safe storage, absence of witnesses to confirm the narcotics were the same ones tested and contradictions in police testimony.\n\nEven the chemical examiner’s report was rendered worthless.\n\nThe prosecution presented only two witnesses to prove its case — Inspector Pervaiz Ali Mithani, who recovered the narcotics and Assistant Sub-Inspector Mehrab Ali. They testified about the recovery, but their accounts differed on details like who sealed the narcotics and where they were stored.\n\nThe other witnesses, including those who handled the evidence, were given up by the prosecution.\n\nThe trial court allowed this omission and convicted the two men, the Supreme Court noted.\n\nThis trial court failed to exercise its powers in this case, Justice Minallah regretted adding the Sindh government should take steps to ensure narcotics cases are dealt with effectively and in accordance with the law.\n\nHe observed the responsibility to ensure effective prosecution lies with the federal and provincial governments, as they were ultimately responsible for the overall supervision of law enforcement agencies.\n\nThe judgment observed that the Sindh prosecutor general should examine the case and take appropriate action so that omissions highlighted in this case are not repeated.\n\n“The prosecutor general is therefore advised to consider issuing guidelines in exercise of its functions under section 9-A (1) of the Act for the prosecutors and officers responsible for investigations relating to effective and efficient prosecution,” Justice Minallah said.\n\nHe added the responsibility for effective prosecution does not end with the executive because the judiciary was also “equally responsible in ensuring that the trial is conducted fairly and that a just decision is reached”.\n\nThe court directed the SHC to establish a policy for the regular training of judicial officers on conducting criminal trials.\n\nThe Supreme Court office was also directed to send copies of the judgment to the chief secretary and prosecutor general of Sindh for taking appropriate steps in the light of these observations.\n\nA copy should also be sent to the SHC registrar for placing it before the chief justice SHC for his consideration, the judgment said.\n\nPublished in Dawn, July 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/3011404689ce737.gif?r=114101",
  "retrievedAt": "2025-08-17T19:44:39.470Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922157/law-enforcement-agencies-should-be-held-accountable-for-lapses-during-investigations-sc",
  "dateList": "2025-07-05",
  "date_published": "2025-07-05T00:15:42.000Z"
}
