{
  "title": "Sheikh Rashid sees deadlock among opposition parties over issue of no-confidence motion",
  "link": "https://www.app.com.pk/national/sheikh-rashid-sees-deadlock-among-opposition-parties-over-issue-of-no-confidence-motion/",
  "date_published": "2022-02-27T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): Interior Minister Sheikh Rashid Ahmed on Sunday said there was a deadlock among the opposition parties over the issue of no-confidence motion.\nAddressing a press conference here at the ministry of Interior, he said that opposition’s plans to bring a no-confidence motion would fail as they all were interested to protect their own vested interest.\nSheikh said the opposition trying to create chaos in the country but they would have to face defeat eventually, adding that the government would not create any hurdles for participants of the opposition’s long march and provide full security.\nThe interior minister said that those who were thinking of confrontation will dig their own political grave, adding that  these people were disgracing the public mandate. He said the government had full confidence over its allies.\nHe said it was not Bilawal Bhutto’s capacity to challenge the government.He said the parties which were against each other during past but today they were extending invitations to each other.\nThe minister said that after 24 years, Australian Team was in Pakistan and the government has provided head of the state security to the visiting team.\nHe said that India awarded its Wing Commander Abhinandan despite being a loser to hide embarrassment.\nReplying a question, he termed Prime Minister Imran Khan’s visit to Russia as successful.\nThe minister said the salaries of armed and civil forces were being increased. He said that new 13 passport offices were being established.\nHe said that he was fully satisfied with the performance of Islamabad Police. He praised Islamabad Police for exemplary investigation in Noor Mukadam case.\nReplying to another question about PTI leader Jahangir Tareen’s health, he prayed for later’s early recovery.",
  "retrievedAt": "2025-08-11T14:25:22.549Z"
}
