{
  "title": "Pak embassy making strenuous efforts to evacuate nationals as Russian-Ukraine conflict deepens",
  "link": "https://www.app.com.pk/national/pak-embassy-making-strenuous-efforts-to-evacuate-nationals-as-russian-ukraine-conflict-deepens/",
  "date_published": "2022-02-27T09:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): Pakistan embassy in Ukraine is making all-out efforts to evacuate the stranded Pakistani nationals at the earliest, amidst the deepening Russian-Ukraine conflict.\nAccording to details shared by Pakistan Embassy in Ukraine, the Pakistanis were being evacuated from Ternopil and Lviv to Poland, Hungary, Slovakia and Romania and the embassy was coordinating with the respective missions there for the onward facilitation.\nAbout 4,000 Pakistani nationals, mostly married to Ukrainians, had already left on the advice of the mission whereas, 3,000 students also left the war zone while the remaining 600-700 students were being evacuated.\nThe mission has established different focal points for facilitation and evacuation of Pakistani citizens, which are:-\nThe embassy sharing further details about the evacuation process said that so far, 125 Pakistani citizens including students, community and families of staff, had been evacuated from Ukraine. 376 nationals were already at Ukraine-Poland crossing, 4 persons were at the Ukraine-Romania border and 9 others were at Ukraine-Hungary border.\nA total of 84 Pakistanis had crossed over to Poland. In total, 137 Pakistanis have been evacuated on Sunday noon.\nA total of 35 Pakistani students from Kharkiv and 3 students from other cities had been received by Lviv facilitation desk. 30 students from Kharkiv were on their way to Lviv by train while 7 students had reached Ternopil.\nThe embassy further said that it was providing accommodation to students in Ternopil and transportation wherever possible especially from Lviv to border crossings.\nThe curfew had been imposed for the last three days in key cities and the administration had asked the people to remain in safe places. Different cities including Lviv and Ternopil were being hit.\nIt said the majority of students from Kharkiv had already reached Lviv and departed to Poland border.\nPakistan Ambassador to Ukraine Dr Noel. I. Khokhar had spoken with Ukraine Deputy Internal Affairs Minister Yenin Yevheniy regarding expediting the exit facilitation for the Pakistani citizens while, the embassy had requested meeting with commander of border posts at Ukraine-Poland border, so that issues of Pakistanis stuck on Ukrainian side and waiting for exit, could be highlighted.\nPakistan’s ambassador to Hungary Muhemmed Aejaz received the students who arrived in Poland.",
  "retrievedAt": "2025-08-11T14:25:26.989Z"
}
