{
  "title": "People of Sindh fed up with PPP’s rule: Qureshi",
  "link": "https://www.app.com.pk/national/people-of-sindh-fed-up-with-ppps-rule-qureshi/",
  "date_published": "2022-02-27T06:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): Vice Chairman Pakistan Tehreek-e-Insaf and Foreign Minister Makhdoom Shah Mahmood Qureshi Sunday said that people of Sindh were fed up with the PPP’s rule in Sindh and they were looking for an alternate leadership.\nIn a press statement, Qureshi said that PTI’s ‘Huqooq-e-Sindh’ march had reached Sukkur from Ghotki after passing through different areas. The masses on its way had warmly welcomed the march as they had been the democratic people and followers of the democratic norms.\nIf the PPP leadership had the right to present their viewpoint in Punjab province, then the PTI leadership had the same right to visit Sindh province, the PTI stalwart further added.\nPTI’s vice chairman said that he had come to Sindh to ask the residents what the PPP government had done for them during the last fifteen years of its rule.\nHe said the PPP government was blocking the health cards facility to the Sindh people. People in Thar had been given the facility, but he wanted to ask the provincial government as to why it was depriving other areas of the province, he said.\nThe PTI government had stabilized the country’s economy which was at the brink of default and now, put it on the path of strength, he added.\nReferring to PPP’s long march towards Islamabad, Qureshi claimed that they had been giving Rs30,00 to each participant.\n“It is no more a party of late Mohtarma Benazir Bhutto, but a party of ‘zar’ (money) and Zardari. Imran Khan’s caravan is confronting this clique,” he opined.\nThe PTI’s march led by VC Shah Mahmood Qureshi and PTI Sindh president Ali Zaidi on Sunday will head towards Jacobabad after passing through Shikarpur and Kashmore.\nOn its way, the PTI’s top leadership would address public gatherings at different places.",
  "retrievedAt": "2025-08-11T14:25:38.714Z"
}
