{
  "title": "Shafqat takes briefing about performance, targets of education ministry",
  "link": "https://www.app.com.pk/national/shafqat-takes-briefing-about-performance-targets-of-education-ministry/",
  "date_published": "2022-02-14T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Federal Minister for Education, Professional Training, National Heritage and Culture Shafqat Mahmood reviewed the performance and targets achieved by each organization under performance agreement signed last year on September 22.\nWhile chairing a weekly review meeting of the ministry and attached organizations here on Monday he said, the ministry was graded to 91.2 percent on the basis of qualitative and quantitative assessment indicators with fourth position among other ministries during a mid year review and awarded appreciation certificate from the Prime Minister on February 10.\nWhile terming it a big achievement for the ministry, the Minister congratulated the whole team saying, he has taken all the targets seriously since the beginning which had resulted in this milestone achievement.The Federal Minister reiterated his resolve to retain it and to improve the progress. He advised all the heads of attached organizations to carefully workout on the targets given by the ministry.\nShafqat Mahmood said, many of the organizations of the ministry e.g. National College of Arts, Pakistan Institute of Fashion and Design and National Skills University ( which is the only university of the country recognized by UNESCO) etc. were not added in the Performance Agreement of 2021-23 and he instructed to get them added for next quarters.\nSharing his experience with the participants of the meeting, Shafqat Mahmood said, when he was assigned the portfolio of Education; few of his friends were not happy as they were expecting some other portfolio but today they all were happy and congratulating on our success.\nShafqat Mahmood advised all the senior officers to maintain their performance for next quarters as the challenges would also be increased.",
  "retrievedAt": "2025-08-11T14:20:19.605Z"
}
