{
  "title": "Pakistan accords top priority to projects for Afghanistan: PM",
  "link": "https://www.app.com.pk/national/pakistan-accords-top-priority-to-projects-for-afghanistan-pm/",
  "date_published": "2022-02-14T17:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): Prime Minister Imran Khan Monday here said Pakistan accorded top priority to business-to-business relationships and communication projects for Afghanistan.\nThe Prime Minister stated this while chairing fourth meeting of the Apex Committee on Afghanistan.The government will fully facilitate expansion of ties with the neighbouring country, he added.While discussing the potential of bilateral trade between Pakistan and Afghanistan, he said trade, healthcare and communication projects for Afghanistan were a priority.He said that Afghan students studying in Pakistani universities will be playing a vital role for development of Afghanistan and continue to strengthen people to people contacts between the two countries.Pakistan wanted a peaceful and stable Afghanistan, he said adding international community must help avert humanitarian crisis in Afghanistan.The Prime Minister directed that scholarships should continue for Afghan students and all necessary resources be made available.He said that Pakistan will support hospitals helped build by it in Afghanistan as well as will work to build greater road and rail connectivity with Afghanistan.Earlier, National Security Advisor Dr. Moeed Yusuf provided a detailed briefing to the Apex Committee regarding Afghanistan.The Prime Minister directed relevant ministries to fast-track the projects and commitments announced for aid of Afghan people.The meeting was attended by Federal Ministers including Shoukat Fayaz Tarin, Fawad Ahmed, Shafqat Mehmood, Azam Khan Swati, Sheikh Rashid Ahmed, Army Chief General Qamar Javed Bajwa, National Security Advisor Dr. Moeed Yusuf, Advisor Commerce Abdul Razaq Dawood, SAPM Dr. Faisal Sultan and senior civil and military officers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:20:04.437Z"
}
