{
  "title": "Hammad encourages German company for Biofuel, RE’s pilot projects",
  "link": "https://www.app.com.pk/national/hammad-encourages-german-company-for-biofuel-res-pilot-projects-2/",
  "date_published": "2022-02-14T16:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Pakistan and Germany on Monday held a thorough discussion to promote bilateral cooperation in the energy sector, especially in RE resources and clean energy technologies.\nA high-level German delegation, led by State Secretary Jochen Falsbarth, held an extensive meeting with the Pakistani delegation that was headed by Minister for Energy Hammad Azhar, a news release said.  During the meeting here, the minister encouraged the GIZ, a German company, to undertake pilot projects based on Biofuels and Renewable Energy (RE) resources.\nBoth sides discussed various aspects of renewable energy resources and clean energy technologies in Pakistan, and German cooperation in the sector.  The German side thanked the Pakistani government for assisting the evacuation of German nationals from Afghanistan after the withdrawal of foreign military troops from there.  Hammad Azhar lauded the German support in establishing the SCADA [Supervisory Control and Data Control Acquisition] system in the Islamabad Electric Supply Company and Multan Electric Supply Company, and motivated the GIZ to expand it to other parts of Pakistan as well.\nThe minister reiterated the government’s vision to reach 60 per cent of energy supply from local and sustainable resources by 2030, and implement Alternative and Renewable Energy Policy and for the promotion of Clean and Green Pakistan Initiative.\n“The government is planning to launch a policy framework whereby inviting foreign and local investors for concession agreements to set up renewable resources power projects with their transmission networks to cover the unserved areas. These microgrids are potential projects where German companies can mutually benefit.”\nHammad Azhar hoped that continuous engagement with the German government would bring about positive change in the renewable energy sector, and increased cooperation through Pakistan-German Renewable Energy Forum (PGREF) The visiting delegation consisted of German Ambassador to Pakistan Bernhard Schlagheck, Board Manager GIZ Thorsten Schafer and Head of Division Afghanistan and Pakistan Helmut Fischer.\nThe Pakistani side comprised Minister for Energy Hammad Azhar, Secretary Power Syed Asif Haider Shah and the Chief Executive Officer of Alternate Energy Development Board.",
  "retrievedAt": "2025-08-11T14:20:11.127Z"
}
