{
  "title": "Stern action to be taken against agents involved in illegal deductions from Kafaalat payments: Dr. Sania",
  "link": "https://www.app.com.pk/national/stern-action-to-be-taken-against-agents-involved-in-illegal-deductions-from-kafaalat-payments-dr-sania/",
  "date_published": "2022-02-14T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar Monday warned of a stern action to be taken against agents involved in illegal deductions of money from payments of Ehsaas Kafaalat beneficiaries.\nFurther, coveting the agents to refrain from fraudulent deductions, Dr. Sania reiterated that those involved in illegal deductions from payments of Kafaalat beneficiaries will be dealt strictly according to the law.\nThe biannual stipend amount of Ehsaas Kafaalat has been raised from Rs 12,000 to Rs 13,000 since February 1, 2022.\nThe increase of Rs1,000 was ratified by the Federal Cabinet in June last year to benefit all Ehsaas Kafaalat beneficiaries.\n“With the recent raise in Kafaalat stipend amount, all eligible beneficiaries of Kafaalat will now get Rs 13,000 as a six-monthly stipend amount. No agent of partnering banks will be allowed to illegally deduct any money from payment to deserving families”, said Dr. Sania in her televised message for retail agents of Habib Bank and Bank Alfalah.\nThe video message can be watched at the official YouTube channel: EhsaasOfficial.\nShe also urged beneficiaries to collect full payment of Rs 13,000 from the agents along with the computerized payment receipt at the time of Kafaalat cash disbursement.\nEligible beneficiaries can access payment at biometric ATMs, designated retail shops and specialized campsites of partnering banks countrywide. Habib Bank serves payments in Punjab, Sindh, Balochistan and Islamabad and Bank Alfalah across Khyber Pakhtunkhwa, Gilgit Baltistan and Azad Jammu and Kashmir.\nEhsaas Kafaalat is an unconditional cash transfer programme that includes cash stipends and bank account for 8 million poorest women across all districts of the country.\nThe Ehsaas Kafaalat payment system features biometrically enabled disbursements to beneficiary women on six monthly basis. Beneficiaries are being identified through recently accomplished Ehsaas survey and Ehsaas Registration Desks operating in all Tehsils.\nSurveyed families can check their eligibility and disbursement status in Kafaalat on Ehsaas 8171 web-portal with the help of their Computerized National Identity Card or survey token numbers. The portal can be accessed at:https://ehsaastracking.pass.gov.pk",
  "retrievedAt": "2025-08-11T14:20:19.400Z"
}
