{
  "title": "PM for joint cooperation to address security issues along Pakistan-Iran border",
  "link": "https://www.app.com.pk/national/pm-for-joint-cooperation-to-address-security-issues-along-pakistan-iran-border/",
  "date_published": "2022-02-14T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): Prime Minister Imran Khan on Monday underscoring that the Pakistan-Iran border was a border of peace and friendship, underlined the importance of joint cooperation to address security issues.\nHe also stressed early completion and operationalization of border sustenance markets, for economic uplift of the people living on both sides of the border.\nThe Prime Minister was talking to Iranian Minister for Interior Dr. Ahmad Vahidi, who called on him.\nHe particularly emphasized the importance of close bilateral collaboration to boost trade and regional connectivity.\nThe Prime Minister expressed satisfaction over the positive momentum in brotherly relations between the two countries and highlighted the vast potential that exists for enhanced collaboration in diverse fields.\nHe thanked the Iranian Government and the Supreme Leader for steadfast support for the just resolution of the Jammu and Kashmir dispute.\nThe Prime Minister also expressed satisfaction over the convergence of views regarding a peaceful and stable Afghanistan and underscored the importance of close coordination between the two countries.\nHe also stressed the need for urgent actions by the international community to prevent humanitarian crisis and economic meltdown in Afghanistan and measures to enhance practical engagement, strengthen stability, and counter terrorism.\nThe Prime Minister reiterated his invitation to President Raisi to visit Pakistan at an early date.\nInterior Minister Dr. Ahmad Vahidi conveyed cordial greetings of Iranian leadership to the Prime Minister and reaffirmed Iran’s desire to strengthen bilateral relations in all aspects.",
  "retrievedAt": "2025-08-11T14:20:12.040Z"
}
