{
  "title": "No-trust move poses no threat to govt: Farrukh",
  "link": "https://www.app.com.pk/national/no-trust-move-poses-no-threat-to-govt-farrukh/",
  "date_published": "2022-02-14T11:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Monday said there was no threat to the government from the opposition’s no-trust move against the prime minister.\n“The opposition should think about forging unity within its rank instead of getting worried about the government and its allies,” he told media persons here after the PTI Central Executive Committee (CEC) meeting.\nThe minister said it was a loud and clear message by the PTI CEC to hold accountability of all those who had looted the national wealth.\nHe said the CEC had congratulated Umar Amin Gandapur, the brother of Federal Minister for Kashmir Affairs Ali Amin Gandapur for winning elections of Tehsil Mayor, DI Khan by a clear majority.\nLike 2018 general elections, he said the people of Dera Ismail Khan had once again rejected JUI-F chief Maulana Fazl-Ur-Rehman in the Khyber Pakhtunkhwa (KPK) local government elections.\nHe said PTI had emerged biggest party in the local body elections of KPK after securing maximum votes, adding that after mayoral elections at tehsil level the party remained on top position.\nSimilarly, in other districts of KPK, the minister said PTI had secured three seats from Karak one each from Bannu and Bajaur.\nIt was the first time that PTI government had empowered the voter by giving him right of direct vote for the election of mayor in KPK, he added.\nHe said after a thumping victory of PTI in local government elections, Pakistan Peoples Party (PPP), Pakistan Muslim League Nawaz (PML-N) and Awami National Party (ANP) had wiped out from the KPK.He asked the opposition to not drag women into politics.\nIt was the same people which always disrespected women as they did the same in past by character assassination of Benazir Butto, he added.\nCommenting on the case of PML-N President Shehbaz Sharif, he said Rs 16 billion were deposited in the accounts of 14 employees of Ramzan Sugar Mill. Some 17,000 transactions were made into these accounts, he added.\nHe said billions of rupees were surfaced in the account of Maqsood peon who was an employee of Ramzan Sugar Mill.\nThe minister said the people like Masroor Anwar were their front man who used to deposit corruption money in the bank accounts of Shehbaz Sharif from 2008 to 2017.\nHe said Shehbaz Sharif was begging for support of Asif Zardari and Chaudhry brothers, his ‘nervousness’ had increased after the statement of Minister for Water Resources Moonis Elahi about recent political meetings.\nHe said a special court was likely to frame charges against Shehbaz Sharif and his son Hamza Shehbaz on February 18 in Rs16 billion alleged money-laundering case against them.",
  "retrievedAt": "2025-08-11T14:20:21.330Z"
}
