{
  "title": "IHC issues written orders regarding bails of Imran Khan in multiple cases",
  "link": "https://www.app.com.pk/national/ihc-issues-written-orders-regarding-bails-of-imran-khan-in-multiple-cases/",
  "date_published": "2023-05-13T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP): The Islamabad High Court (IHC) on Saturday issued written orders regarding the bails of Pakistan Tehreek e Insaf (PTI) chief Imran Khan in all cases against him including Al-Qadir Trust.\nA two-judge bench comprising Justice Miangul Hassan Aurangzeb and Justice Saman Rafat Imtiaz issued the written order in Al-Qadir Trust case.\nThe court said that the National Accountability Bureau (NAB) could file a case for bail cancellation of Imran Khan if he didn’t cooperate with the investigation.\nIt said that Imran Khan would have to appear before the NAB whenever it was required by the investigation officer. The order further said that advocate general and additional attorney general had adopted the stance that Imran Khan couldn’t get relief after imposition of article-245 of the constitution. The stance meant that they wanted to seize the basic rights of the citizens.\nThe court served notices to attorney general of Pakistan for assistance on the point of access to the court during the imposition of article 245.\nIt said that the additional attorney general also raised the objection on the maintainability of the case as the accountability court was the right forum.\nThe order said that Imran Khan was produced before the IHC on the directives of the top court, adding that the said objection was not maintainable. The high court was authorized to hear the case under section-561A of code of criminal proceeding, it said.\nMeanwhile, Justice Miangul Hassan Aurangzeb also issued a four pages judgment refraining the authorities from arresting Imran Khan till May 17, in any case registered in federal capital after May 9. It said that as per the petitioner’s lawyer, Imran Khan was arrested from the court premises at the time when he was confirming his biometric.\nThe lawyer had stated that Imran Khan was produced before the high court on directives of the top court.\nThe order said that Imran Khan should be provided foolproof security as former prime minister in light of the judgment of the superior court. It said that Imran Khan wouldn’t be arrested in any case which was registered after May 9.\nThe court also instructed advocate general Islamabad to produce the details on next hearing regarding total cases registered against PTI’s chief.\nSimilarly, a single member bench comprising Justice Tariq Mehmood Jahangiri issued written order regarding the protective bail of Imran Khan in Zille Shah murder case.\nThe order said that the court had accepted the protective bail of Imran Khan till May 22, against surety bonds worth Rs 50,000. The court instructed PTI’s chairman to approach the relevant court for the relief during the said time period.\nIt said that Imran Khan’s lawyer had stated that the case was registered on political grounds and it based on dishonesty.\nHe pleaded the court to grant bail for provision of justice to his client. The lawyer had stated that the police had already recorded the statement of Imran Khan in this case. The police had stated before the LHC that arrest of PTI’s chief was not required in this case, it added.\nThe order said that the petitioner had adopted the stance that he could be arrested after reaching Lahore. The court said that it had granted bail to the petitioner and the case is disposed of.\nJustice Miangul Hassan Aurangzeb also issued a three pages judgment stopping the arrest of Imran Khan under Section-16 of Maintenance of Public Order (MPO) and in other cases.\nThe order said that the lawyer had stated that there was a threat of the life of his client as the security had been withdrawn from him. The court ordered to provide security to Imran Khan as per the directives of top court.\nThe order said that Imran Khan had been summoned on next hearing in personal capacity. The court had granted him bail till May 17, against surety bonds worth 50,000.",
  "retrievedAt": "2025-08-11T08:29:13.583Z"
}
