{
  "title": "PM condemns allegations of Imran Niazi against army chief",
  "link": "https://www.app.com.pk/national/pm-condemns-allegations-of-imran-niazi-against-army-chief/",
  "date_published": "2023-05-12T19:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP): Prime Minister Shehbaz Sharif strongly condemned the allegations of Imran Khan against the army chief.\nIn a statement here on Friday, he said the statement of Imran Niazi against the Pakistan army was proof of his low-minded mentality.\nThis statement was a confession of the mastermind of the tragic incidents of May 9, he added.\nThe PM said this was the same mentality which levelled false allegations of his murder against the patriotic army, officers and concocted false stories of cypher and foreign conspiracy.\n“This is an expression of real intentions of the anti-state mastermind of the terrorists. This is confession that whatever happened on May 9 was done on the directions of Imran Niazi,” he added.\nThe prime minister said this statement was proof that Imran Niazi was behind the plan to desecrate the monuments of martyrs and ghazis and attacks on sensitive installations and buildings.\nHis anger against General Syed Asim Munir was that he as Director General ISI was aware about the worst corruption of Imran Niazi, his wife, Farah Gogi and senior leadership of PTI, he said adding allegations against the highly decorated General Syed Asim Munir who was very admired in the rank and file and was appointed on merit, was nothing but ill-intentioned.\nThe PM said Imran Niazi was afraid of the winner of the sword of honour, Hafiz e Quran and the honest army chief.\nHe said this kind of cheap talk against the chief of the brave army which was fighting against terrorism was akin to support of terrorists.\nThe whole nation stood with armed forces and the army chief, he added.\nSeparately on his Twitter handle, the prime minister posted that Imran Khan’s statement about the army chief ‘is a reflection of his diseased and obsessive mindset’.\n“The desecration of the martyrs’ monuments and attack on the national installations represent an unimaginable low in our politics,” he further added.\nThe prime minister criticizing the PTI’s chief said that Imran Nizazi’s statement was also an admission of masterminding the tragic and disgraceful incidents of terrorism undertaken by the PTI’s goons at his behest.",
  "retrievedAt": "2025-08-11T08:29:30.349Z"
}
