{
  "title": "No retreat of coalition govt on Imran Khan’s violence against state: Sherry Rehman",
  "link": "https://www.app.com.pk/national/no-retreat-of-coalition-govt-on-imran-khans-violence-against-state-sherry-rehman/",
  "date_published": "2023-05-13T10:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 13 (APP): Federal Minister for Climate Change, Senator Sherry Rehman on Saturday said the coalition government was not going to retreat on Pakistan Tehreek-e-Insaf (PTI)’s violence against the state.\nIn a news conference flanked by Minister of State for Poverty Alleviation Faisal Karim Kundi here, she said that due process would be observed against IK and his supporters for jeopardizing country’s peace and security for the sake of his ego.\nThe minister alleged that Imran Khan wanted to bring the law of the jungle into the country and turn it into a battle zone.\nSenator Rehman said Khan was compromising the pride, prestige and honour of the country.\nShe accused Khan of singling out the Army Chief in his contestation for regaining power. It was condemnable but rather the matter has transcended the level of condemnation, she added.\nThe Minister said Imran Khan came in a lavish car to the Court, whereas her party leaders were presented before the courts in armoured vehicles used for prisoners.\nShe queried Imran Khan that had he forgotten about what happened to women during his rule. How Faryal Talpur was arrested from the hospital at night?\nShe alleged that Imran Khan considered himself above the courts and the state, whereas he did a pre-planned arson and siege of government and state installations in various cities across the country.\nSenator Rehman underlined that after the judicial murder of Shaheed Zulfiqar Ali Bhutto and the martyrdom of Shaheed Mohtarma Benazir Bhutto, the Pakistan Peoples Party (PPP) never attacked the military installations but rather resisted the martial laws in a political manner.\nShe added that after the burial of Shaheed Mohtarma Benazir Bhutto, former President Asif Ali Zardari held a press conference and raised the ‘Pakistan Khape’ (We want Pakistan).\nPTI, she said, had turned into a movement of violence, adding, “He is clearly saying if I go down, everything should go down.”\n“Imran Khan cannot threaten the government and state and no government will allow this.”\nAmid the evident economic crisis, he wanted to create instability in the country, she said.\n“He is wanting a national reconciliation ordinance (NRO–first issued by former President General Pervez Musharraf that provided an amnesty to politicians, political workers and bureaucrats involved in corruption, embezzlement, money laundering and terrorism from 1986-2007),” she added.\nSenator Rehman mentioned whosoever was arrested, in this case, would be trialled with proper evidence and all the proofs would be presented before the court.\nShe added that Imran Khan did not bother that the country’s enemy state blew trumpet on all the violence perpetrated against the state.\nShe said the PTI protestors did not spare the Edhi ambulances, flared up markets, livestock, government and state installations etc.\nThe government would have to take action to restore peace in the country, she added.\nImran Khan, she said, had been given blanket relief in nine cases, whereas he did not want to appear before the courts and demanded a VIP protocol.\nThe minister alleged that Imran Khan was not ready to condemn the losses incurred to state installations in the court.\nHe used to keep his ego superior to that of the nation and everything else and he was resisting the human, citizen and social rights of the nation, she said.\nSenator Rehman said Imran Khan was accused in an open and shut case of Rs60 billion corruption but no probe was being initiated against him.\nResponding to media queries, she said the government in the Monday session of the National Assembly would decide concrete steps against Imran Khan through mutual consultation of the House.\nTo another query, she said Former President Asif Ali Zardari gave his arrest to the police teams in a dignified manner at Zardari House as part of decent political norms.\nShe replied to another query that PTI had no standards while PPP was unmatchable.\n“Incitement of violence against the state was not allowed anywhere in the world, like in the UK prompt arrests were made against the perpetrators.”\n“Imran Khan had no policy in the past and also in the future,” she added.",
  "retrievedAt": "2025-08-11T08:29:26.356Z"
}
