{
  "title": "Pakistan stands by Kashmiri people in their freedom struggle: PM",
  "link": "https://www.app.com.pk/national/pakistan-stands-by-kashmiri-people-in-their-freedom-struggle-pm/",
  "date_published": "2023-05-02T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP): Prime Minister Shehbaz Sharif on Tuesday reiterated that Pakistan stood by the people of Kashmir in their just struggle for freedom as India could never suppress their voice through oppression.\nThe prime minister, in a meeting with Prime Minister of Azad Jammu and Kashmir Anwarul Haq and his delegation, said Pakistan would continue its moral, political and diplomatic support to the Kashmiri people to make them get their right to self-determination.\nHe congratulated the AJK PM on assuming the office through a constitutional and democratic process, and assured his government’s support for AJK development and resolution of the issues related to the development funds.\nThe prime minister urged the United Nations and the international community to take notice of the illegal unilateral Indian actions of August 5, 2019, calling it an attack on the human rights.\nHe said Pakistan always exposed the Indian atrocities in the Indian Illegally Occupied Jammu and Kashmir at every international forum.\nThe prime minister instructed the authorities concerned for immediate resolution of the issues related to the development funds of the Azad Jammu and Kashmir.\nThe delegation comprised AJK ministers including Col. (retd) Waqar Noor, Faisal Mumtaz Rathore and Member of Legislative Assembly Chaudhry Latif Akbar.\nPresident of Pakistan Muslim League-N AJK chapter Shah Ghulam Qadir, former AJK prime minister Raja Farooq Haider and President of Pakistan Peoples Party AJK chapter Chaudhry Yaseen also attended the meeting.\nFederal ministers Ishaq Dar and Ahsan Iqbal, and Advisor to PM on Kashmir and Gilgit Baltistan Qamar Zaman Kaira were also present.",
  "retrievedAt": "2025-08-11T08:25:14.140Z"
}
