{
  "title": "Railways’  Eid train operation gets passengers’ overwhelming response",
  "link": "https://www.app.com.pk/national/railways-eid-train-operation-gets-passengers-overwhelming-response/",
  "date_published": "2023-05-02T09:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP): The special trains on Eid ul Fitr introduced by Pakistan Railways had received an overwhelming response from thousands of travellers who visited their loved ones in their native towns.\nThe passengers have expressed their gratitude to Pakistan Railways for facilitating them on Eid through special trains which saved their precious time and money.\nA large number of passengers with families were seen at the railway stations according to whom the staff at the stations was quite helpful in informing them about timing of trains, platforms’ numbers, ticketing and booking issues.\nTalking to APP Muhammad Ali who arrived at Rawalpindi Railway Station from Karachi after celebrating Eid with his relatives said that Pakistan Railways had won the passengers’ hearts through completing Eid trains operation with a lot of improvement.\nAnother passenger, Shahraiz Arshid said that the services being provided by the management were very much improved while all the railway stations were neat and clean.\nHe said that despite the tracks were not in good condition after the heavy rains and floods of 2022 across the country, the timing of the trains was also improved as compared to the previous years.\nIt is pertinent to mention here that Pakistan Railways had announced the operation of five special trains to facilitate the travel needs of the public during the Eid-ul-Fitr holidays.\nHe said the trains had been operated from Karachi to Lahore and Karachi and Peshawar to various locations across the country, providing a comfortable and convenient mode of transportation for passengers.\nOn the other hand, Pakistan Railways Police had also tightened security arrangements in trains as well as at stations to avoid any untoward incident during Eid-ul-Fitr vacations.\nMinister for Railways Khawaja Saad Rafique had directed all superintendents (SPs) of Railways Police to depute sufficient force at exit and entry points of all railway stations and strictly watch to be carried out of suspicious persons, he added.\nPakistan Railways Police Commando Force had been deputed at vulnerable installations and in trains, while bomb disposal staff was also kept on alert for the search of luggage and passengers at railway stations.\n“The SPs of Railways Police directed to conduct complete check and search of empty racks before trains reach the platforms for departure towards their destinations,” the official added.",
  "retrievedAt": "2025-08-11T08:25:22.574Z"
}
