{
  "title": "Ethiopia’s successful peace process offers lessons for Sudan: Envoy",
  "link": "https://www.app.com.pk/national/ethiopias-successful-peace-process-offers-lessons-for-sudan-envoy/",
  "date_published": "2023-05-02T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP): Ambassador Extraordinary and Plenipotentiary of the Federal Democratic Republic of Ethiopia (FDRE) to the Islamic Republic of Pakistan Jemal Beker Abdula on Tuesday said Sudan could learn from the successful peace process of his country for ending the conflict which had entered into its third week.\nAddressing to Pakistan-based ambassadors from the member states of the Intergovernmental Authority on Development (IGAD) here, he said dialogue was the only way forward for resolving disputes to bring lasting peace in the region.\nThe meeting of the ambassadors of IGAD member states was called by Sudan’s Envoy in Pakistan to brief his counterparts about the latest situation in his country.\nReferring to the speech delivered by Prime Minister of FDRE H.E. Dr. Abiy Ahmed in an event recently held at Addis Ababa to commemorate the conclusion of Ethiopia’s Peace Process, he said the prime minister had also urged the warring parties in Sudan to learn from Ethiopia’s peace process for ending their conflict.\n“It is on record how much Africa in general and Ethiopia in particular suffered from the Tigray war, but it is the determination of our people and support of the whole of Africa and other international partners which steered us out of the conflict,” the ambassador said.\n“Peace in Sudan is imperative for peace in entire Africa, so there is a dire need to end this conflict now through dialogue,” he said while expressing Ethiopia’s desire to help Sudan in resolving its issues.\nThe ambassador said Ethiopia has not only been supporting in evacuation process of stranded nationals from Sudan but also extending humanitarian support to the people of Sudan in such trying times.\nHe said Ethiopia had faced the same kind of challenges but peaceful dialogue was the only option for all stakeholders to bring lasting peace to Sudan.\nNobody would get any benefit from the war as it only resulted in deaths, hunger, poverty and unemployment, H.E. Jemal Beker said while apprising his counterparts on the successful execution of the peace process to bring peace in northern parts of Ethiopia.\nHe also highlighted the role played by the African Union in resolving the dispute between the government of the Federal Democratic Republic of Ethiopia and the Tigray’s People Liberation Front (TPLF).\nThe Intergovernmental Authority on Development (IGAD) is a body of eight member states including Djibouti, Ethiopia, Kenya, Somalia, South Sudan, Sudan, and Uganda.",
  "retrievedAt": "2025-08-11T08:25:20.587Z"
}
