{
  "title": "Govt devising comprehensive strategy to further curtail illegal narcotics’ trade: Shazain Bugti",
  "link": "https://www.app.com.pk/national/govt-devising-comprehensive-strategy-to-further-curtail-illegal-narcotics-trade-shazain-bugti/",
  "date_published": "2023-05-02T13:06:00.000Z",
  "source": "APP",
  "content": "KARACHI, May 02 (APP): Federal Minister for Narcotics Control Nawabzada Shazain Bugti on Tuesday, said that government was devising a comprehensive strategy to curtail movement of narcotics while legislation for ensuring effective control on selling and use of drugs was under consideration as well.\nHe talking to media persons during visit of Benazir Shaheed ANF Model Addiction Treatment and Rehabilitation Centre (MATRC) Karachi, said that government was determined to root out the menace of drugs from the society.\nBesides stringent measures to control the drug peddling across the country, the government was also focused on effective measures for rehabilitation of drug addicts, he said adding that federal and provincial governments were working jointly to achieve the set goals.\nShazain Bugti said that Anti Narcotics Force (ANF) and other federal and provincial agencies and departments were actively engaged in controlling the menace of drugs that was evident from the fact that out of total recovery of drugs and narcotic substances across the world as much as 17 percent was recovered in Pakistan alone.\nHe said that synthetic narcotics substances were rapidly replacing traditional drugs around the world while drug paddlers were also utilizing newer means and ways for transportation and selling of drugs.\n“The government was devising a new system to effectively check the illegal business of narcotics and we are confident that new system will help closing all those avenues being used by drug traffickers,” he stated.\nSpeaking on steps for rehabilitation of addicts, the minister said that three model addiction rehabilitation and treatment centres were functioning in Sindh, one each at Karachi, Hyderabad and Sukkur, in collaboration with the provincial government.\nDiscussion was underway with Sindh government for establishing more rehab centres in the province and provincial government has agreed in principle that rehabilitation and treatment centres should be set up at district level, he informed.\nIt was further agreed to establish more rehabilitation centres in other cities of Sindh as well as setting up drug rehabilitation centres in 4 prisons of Sindh, the minister said adding that there ministry wanted to set up rehabilitation centres in all the 108 prisons across the country.\n“We will also engage other provincial governments for establishing rehabilitation centres for ensuring free of cost treatment of drug addicts throughout the country,” he vowed.\nOn a query about use of narcotics in educational institutions, the minister informed that government was working on legislative framework which would empower the enforcement agencies to carry out random drug testing in educational institutions.\nIt would help discouraging the trend of drug usage among the youth that was future of Pakistan and must be prevented from indulging in self harming habits like drugs, he hoped.\nOn another question about political scenario of the country, Shazain Bugti maintained that incumbent government consisted of representatives of masses who were elected by vote of the people and it would complete its constitutional term.\nEarlier, the minister along with Secretary, Ministry of Narcotics Control, Humaira Ahmed, received briefing on functions, present status and future endeavours of Benazir Shaheed ANF Model Addiction Treatment and Rehabilitation Centre (MATRC) Karachi.\nThe minister also inspected different sections of the centre including wards, computer rooms and other facilities for under treatment patients. He talked to patients and inquired about their treatment process and facilities being provided.",
  "retrievedAt": "2025-08-11T08:25:25.039Z"
}
