{
  "title": "SAPM Tarar urges to include seven senior judges in bench hearing SC (Practice, Procedure) bill case",
  "link": "https://www.app.com.pk/national/sapm-tarar-urges-to-include-seven-senior-judges-in-bench-hearing-sc-practice-procedure-bill-case/",
  "date_published": "2023-05-02T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP):Special Assistant to the Prime Minister (SAPM) on Interior Attaullah Tarar on Tuesday urged the Supreme Court to include seven senior most judges of the apex court in the bench hearing Supreme Court (Practice and Procedure) bill case.\nAddressing a press conference along with Special Assistant to the Prime Minister (SAPM) Malik Muhammad Ahmad Khan, Tarar said that the apex court stayed the Supreme Court (Practice and Procedure) which had not become a law yet.This was a question mark on the powers of Parliament, he added.\nHe said that according to the Constitution legislature and judiciary had separate roles.\n“The role of the Parliament is to draft law and this is why it is called legislature. If a law is not yet being shaped and its implementation is stopped then it is unconstitutional,” he added.\nHe said that the six bar councils including Pakistan Bar Council (PBC) had raised observations on apex court judge Justice Sayyed Mazahar Ali Akbar Naqvi’s inclusion in the eight-member larger bench hearing the Supreme Court (Practice and Procedure).\nThe Attorney General for Pakistan also supported PBC’s stance in this regard and stated that references were pending against Justice Naqvi in the Supreme Judicial Council, he added.\nHe urged that Justice Naqvi should not be included in the bench until he was proven guilty or innocent.\nJustice Naqvi should recuse himself from the bench after filing of references in the SJC, he added.\nAttaullah Tarar demanded that seven senior most judges who were not made part of the larger bench should be included.\nHe said that the Parliament passed the Supreme Court (Practice and Procedure) bill to restrict the suo motu power of the Chief Justice but the same judge initiated proceedings on the bill and issued a stay order.\nTarar said that the bail pleas of PTI President Chaudry Pervaiz Elhai were fixed for hearing before Justice Asjad Javed Goral which was big discrimination.\n“Goral’s brother is a ticket holder in Elhai’s party and he had relations with him. It is surprising that Elahi’s bail plea not fix before another judge. This clearly shows that one political party is being facilitated while the powers of the parliament are being compromised,” he said.\nMeanwhile, Malik Muhammad Ahmad said courts were providing maximum relief to the Chairman Pakistan Tehreek-e-Insaf (PTI) in every court case.\nHe blamed that the son of former Chief Justice of Pakistan Justice (retd) Saqib Nisar was involved in selling of PTI tickets.\nHe alleged that the PTI misused the donations of Shaukat Khanum Hospital and was also involved in money laundering.Parliament is a supreme and powerful pillar of the state, he added.",
  "retrievedAt": "2025-08-11T08:25:24.620Z"
}
