{
  "article_id": "2025-10-23_cd20111af420a34261fc84c90c3b1baf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-invites-polish-companies-to-explore-investment-opportunities-in-pakistans-energy-mining-it-sectors/",
    "retrieved_at": "2025-10-23T20:22:08.142Z"
  },
  "metadata": {
    "title": "PM invites Polish companies to explore investment opportunities in Pakistan’s energy, mining & IT sectors",
    "author": null,
    "date_published": "2025-10-23T19:01:16.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/dc4bdc0c-c9db-4da7-88fc-0272a7c2b681.jpeg",
    "categories": [
      "National"
    ],
    "word_count": 348,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 23 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday invited Polish companies to explore investment opportunities in Pakistan, particularly in the energy, mining, and information technology sectors, during a call on paid by the Deputy Prime and Foreign Minister of Poland. Deputy Prime Minister & Foreign Minister (DPM/FM) of Poland, Radoslaw Sikorski paid a courtesy call on the prime minister here at the Prime Minister's House. Deputy Prime Minister & Foreign Minister Muhammad Ishaq Dar, Foreign Secretary, Amna Baloch and Pakistan's Ambassador to Poland Sami Malik also attended the meeting, a Prime Minister's Office news release said. PM Shehbaz expressed Pakistan's desire to further expand bilateral cooperation in trade, energy, defence, education, labour and other areas of mutual interest. The prime minister highlighted that Pakistan and Poland enjoyed cordial and friendly ties spanning over decades. He lauded Poland's high-level of industrialization and progress that had been a feature of the country since the 1970s. During the meeting, regional and international developments, including peace efforts in the Middle East and Ukraine were also discussed. The prime minister emphasized the importance of peaceful resolution of disputes through dialogue and diplomacy, and underscored Pakistan's consistent position of upholding international law, humanitarian principles, and the UN Charter. PM Shehbaz conveyed his warm regards to Prime Minister Donald Tusk of Poland and extended an invitation to him to undertake an official visit to Pakistan, at his earliest convenience. The Polish DPM/FM expressed Poland's strong interest in deepening its engagement with Pakistan in diverse fields. While sharing that Polish investment in Pakistan's petro chemical sector was over US$ 0.5 billion, he suggested that Pakistan could also benefit from Polish expertise in water treatment. He also appreciated Pakistan's role in promoting regional peace and stability. Both sides agreed to enhance contacts to further consolidate cooperation between the two countries. Earlier, the Polish dignitary, who is on an official visit to Pakistan, held detailed talks at the Foreign Office with the Deputy Prime Minister & Foreign Minister of Pakistan, as well as signing of two MoUs and addressing a talk at a local think tank.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}