{
  "title": "Stakeholders oppose agri-trade authority - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The All Pakistan Fruit and Vegetables Exporters, Importers and Merchants Association (PFVA) has expressed serious concerns over the proposed formation of the National Agri-Trade and Food Safety Authority (NAFSA).\n\nIn a letter to the Ministry of Food Security on Saturday, PFVA Chairman Aslam Pakhali termed the move unnecessary and unwarranted, saying the new authority will further burden the horticulture sector instead of facilitating it.\n\nPFVA, which claims to be the sole representative body of the horticulture sector, has raised strong objections to the proposed bill for NAFSA’s establishment.\n\nHe asserted that before forming a new authority, the government must thoroughly assess the shortcomings of the existing Department of Plant Protection (DPP).\n\nKey association warns forming NAFSA will hamper exports\n\n“Simply replacing an entity without addressing its failures does not guarantee success,” he added.\n\nThe association also expressed disappointment over the lack of stakeholder involvement in drafting the new regulations.\n\nThe PFVA chairman identified several key reasons for the inadequate performance of the DPP. These mainly include insufficient qualified and trained manpower, and lack of inspection and testing operational infrastructure at ports.\n\nHe suggested that the government strengthen the DPP by enhancing its operational inspection and testing infrastructure at ports, similar to developed nations, employing skilled and qualified officers to improve efficiency and reduce administrative costs rather than creating a new authority.\n\nThe PFVA chairman warned that the establishment of NAFSA may result in the placement of additional bureaucratic layers and increased hurdles and conflicts with existing departments.\n\nThere are concerns that excessive red tape could make regulatory processes more cumbersome rather than efficient, he remarked.\n\nHe also questioned whether NAFSA would have the capacity and resources to effectively implement new standards, given that existing departments have struggled to uphold international Sanitary and Phytosanitary (SPS) standards.\n\nWhile the stated goal of NAFSA is to improve exports, Mr Pakhali feared that poorly implemented regulations could create additional challenges for exporters. Increased bureaucracy and regulatory hurdles may hinder trade instead of facilitating it. As a key player in the agricultural trade sector, the PFVA believes it should have been consulted to ensure the policies are practical and effective.\n\nAnother concern is the absolute power entrusted to NAFSA.\n\nThe association has highlighted that Section 36 of the proposed bill states that no suit shall be instituted against the authority or its members, effectively removing legal accountability. This provision prevents trade bodies from addressing grievances against the authority, raising serious concerns about transparency and fairness.\n\nThe PFVA has also called for a reasonable timeframe for dispute resolution, particularly for perishable goods.\n\n“Delays in resolving disputes could render decisions meaningless if the product deteriorates or expires before a resolution is reached,” he remarked.\n\nThe PFVA chief warned that forming NAFSA could significantly disrupt the export sector.\n\n“If new regulations are enforced strictly without addressing the root causes of past failures, exports may decline to undesirable levels,” he opined, strongly recommending that the government focus on strengthening the existing DPP by addressing its shortcomings instead of establishing a new authority.\n\n“Enhancing the DPP’s capacity would be a more cost-effective solution, ensuring better facilitation for exporters and improved compliance with SPS standards.\n\nMeanwhile, one fruit exporter told Dawn that a similar bill was earlier rejected by the Nawaz Sharif and Imran Khan governments due to overlapping and duplicity of authority at the federal level.\n\nOne member of the association added that the definitions and terminologies used in the NAFSA bill are not aligned with the definitions defined by the International Plant Protection Convention, Codex Alimentarius Commission (CAC), and the World Organisation for Animal Health (WOAH), formerly the Office International des Epizooties.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:54:48.437Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895187/stakeholders-oppose-agri-trade-authority",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T01:11:14.000Z"
}
