{
  "title": "KARACHI’S WRONG HIGH-RISE OPTION - Newspaper - DAWN.COM",
  "author": null,
  "content": "Cities are living things. If their needs cannot be met through formal planning, they acquire these needs through other means. The process of acquiring what is required through other means reflects the culture and limitations of the agents through which these needs are acquired.\n\nMost of the cities of the Global South have developed in this manner and after development attempts have been made to retrofit them, so as to improve them aesthetically and functionally. These developments determine the future of these cities, their vulnerabilities, and the aspirations of their citizens, which are also shaped by the tangible and intangible cultures that evolve out of the retrofitting process. The most vibrant global cities have evolved in this manner and have become centres of art, literature and, above all, innovation and production. Karachi, Bombay and Cairo are examples of such cities.\n\nThere are other cities that have been meticulously planned over time, right down to minute details. Examples of such cities are Paris and Barcelona and especially cities such as Amsterdam, Brussels, Delft and Aachen. These cities have become nothing more than museums and are preserved as such. People visit them to look at their monuments, engage with their nightlife, and converse with their history.\n\nHowever, all these cities have one thing in common: providing housing for their citizens and a debate on the typology of that housing. They have all had similar experiences over time in providing housing, similar failures, and similar concerns regarding housing for the poor.\n\nHousing is not just a social right but can be the best way to fight urban poverty as well. But the latest push from policy-planners in Karachi is to provide high-density, high-rise apartments for low-income families, based on the Chinese model. Architect and urban planner Arif Hasan explains why, after evaluating such settlements around the world, he has come round to the conclusion that it is not a feasible or sustainable solution to Karachi’s housing issues…\n\nFIGHTING POVERTY THROUGH HOUSING\n\nIn all surveys of poor communities in Karachi and discussions with them carried out by myself and my colleague Amal Hashim, what has emerged is that, for the poor, a roof over their head is not only an economic benefit but is also the most effective way of fighting poverty.\n\nIt also earns them respect in the eyes of others, and they receive better proposals for the marriages of their daughters. It also guarantees upward social and economic mobility for their families. With the owning of a roof, a loan for house construction can be acquired from the House Building Finance Company (HBFC) and other banks. Without roof ownership, such a loan cannot be acquired, because banks want an asset as security against the loan it gives out. In addition, one can carry out improvements in the house as and when funds are available or when one desires.\n\nHowever, acquiring a roof is dependent on buying or building a house. For buying, one needs money, and for building one needs land. There is no way to own land in Karachi for most people because its cost is beyond the paying capacity of low-income families. This is realised by all politicians and political parties. Therefore, before they come to power, they promise to build a large volume of houses to make them available for the “poor”, either free or through large subsidies.\n\nFor example, the Pakistan Tehreek-i-Insaf (PTI) had promised to provide five million homes between 2018 and 2022. However, only 1,500 flats were handed over to beneficiaries, and that too only in Islamabad. The Pakistan Muslim League-Nawaz (PML-N) and the Pakistan Peoples Party (PPP) built even less and those too were beyond the affordability of poor families. In addition, these homes were less than a drop of water in a sea of need.\n\nHowever, if the houses could be affordable to purchase or affordable loans could be provided for the purchase of land, the situation would be very different. But for land and houses to be affordable, their delivery and construction should also be affordable. This calls for research into cheaper technologies in the house-building processes and their link with the social delivery system.\n\nThe problem is that the culture of our planners and politicians does not allow them to think in terms of building cheaply constructed housing for their voters or, on the other hand, providing functional low-cost housing to the victims of natural disasters with the latter’s active physical and economic involvement.\n\nThe examples of both these are presently available, where homes are being built for flood-affected victims. On the one hand, the homes are far too expensive for the poor to afford and, on the other, the homes are too small to be liveable and without basic infrastructure such as toilets and kitchens. This is what can be termed as “an anti-poor bias” in policy and planning. Unfortunately, through the promotion of the policies of Western academic theory and practice, our professionals are also being trained in this manner.\n\nTHE HIGH-RISE SOLUTION?\n\nAlmost every party, through its members, has said that, given the lack of land space, high-rise accommodation, like in China, should be constructed, where buildings can be as high as 30 floors.\n\nThere are those who feel that, because of this, a lot of open space can be generated for social use. This could also help, the theory goes, in creating comparatively large and well-organised social groups of house owners in each building. Meanwhile, the Government of Sindh, in its Sindh Special Development Board Act 2014, feels that highrises will create a “soft image” of the country.\n\nHowever, experience shows that all these assumptions are incorrect. High-rise and medium-rise buildings are far more expensive than walk-ups because they require heavier foundations and structures. They often require boring for their foundations and additional safety measures for earthquakes and wind pressure. In addition, there are problems related to solid waste disposal, the cost of maintenance, and distribution of collective utility charges.\n\nBut there are sociological problems as well. In my work with Homeless International (a UK-based international NGO), I evaluated council estates in Britain and discovered that apartments on floors over 10 to 12 were occupied by squatters or were vacant. In addition, high-rise council estates are full of crime, theft and drugs. Elder residents of these estates point out that this is carried out with the support of the police. There are no community organisations in these estates.\n\nSimilarly, apartments were built by Toki [government-backed Mass Housing Development Authority] in Turkiye where people have been moved from their informal settlements in city centres to multi-storey towers on the fringes of the city. The people are very unhappy and for reasons similar to those in Britain.\n\nIn addition, the new residents complained that, because of an absence of play areas and of issues related to vertical movement, both children and the elders watch television much more than before and/or play with their smartphones, promoting segregation between elders and the younger generation. The purchase of smartphones is an additional expense for poor families.\n\nResidents complain that it is not possible to supervise children while they play or get together because one has to come down 10 or 14 floors for that. It is also difficult to make friends with other families because of the difficulties involved in vertical movement. As a result, children, especially adolescents, are restricted to their homes or around the elevator lobby or staircases. In addition, without supervision, they form gangs and indulge in “anti-social” and criminal activities.\n\nIt is for these reasons that not only are high-rise apartments for low-income communities discouraged in Britain but many high-rise blocks have been demolished. In Turkiye and the Scandinavian countries as well, high-rise apartments for low-income communities are being questioned.\n\nKARACHI’S EXPERIENCE WITH HIGH-RISES\n\nIn Karachi, where high-rise or even medium-rise apartments have been constructed for low-income groups, there are constant disagreements and often violence among the apartment owners on issues related to the cost of maintenance and utilities. As a result, the apartments are not maintained. They have major plumbing leakages which have destroyed the stability of their structures.\n\nReligious and social activities that used to take place on the ground floor can no longer do so and, as a result, the promoters of these activities have to hire a community hall far away from their homes, which increases the cost of the event substantially. Children can no longer play cricket and football even where space is available. I found the same situation in Soviet-built housing in Cambodia and Vietnam.\n\nLet us take an example. There is a cluster of 1,400 high-rise apartments behind and adjacent to Iqra University. Even if we take half a child per apartment, it works out to 700 children in this cluster. Even half of these cannot be accommodated in the open spaces around the apartment blocks. In addition, light and air to most of the apartments are not available.\n\nThe promoters of the high-rise option argue that much higher densities can be achieved through the high-rise option. However, studies carried out by me as a member of the UN’s committee on forced evictions and for Vietnam and the UK, and for the hypothetical remodelling of a number of existing high-density settlements in Karachi, show that the maximum densities permissible by the Sindh Building Control Authority (SBCA) can be achieved by walk-up houses of ground-plus-two floors and by medium-rise apartment blocks, with sufficient space left over for recreational and other social facilities.\n\nGiven the cost and procedures involved, upgrading seems to be the only option for providing secure homes to low-income groups who already have a home of some sort.\n\nAN ALTERNATIVE MODEL OF HOUSING DEVELOPMENT\n\nThere are approximately 1.5 million housing units in the katchi abadis [informal settlements] of Karachi. These have been built by informal developers without a penny of subsidy by the government. The overwhelming majority have paid for their legally acquired electricity and gas connections.\n\nSo the informal developer has done much better than the Karachi Development Authority (KDA), the Lyari Development Authority (LDA) or the Malir Development Authority (MDA). If this construction and maintenance can be organised and supported, the communities can improve the neighbourhoods with the help of appropriately structured local bodies.\n\nThe late development practitioner and social scientist Akhtar Hameed Khan has shown us that this can be done. But, “how” is another story.\n\nThe writer is an architect. He can be reached at arifhasan37@gmail.com and through the website www.arifhasan.org\n\nPublished in Dawn, EOS, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c336782b2b4.jpg",
  "retrievedAt": "2025-08-25T14:54:21.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895143",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T01:12:27.000Z"
}
