{
  "title": "Trump designates English as official language of US - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Saturday designated English as the official language of the United States, saying it would bring cohesion to a country characterised by immigration from around the world.\n\nThe White House published an executive order by Trump which says it is “long past time” that English is declared as the nation’s official language.\n\n“A nationally designated language is at the core of a unified and cohesive society, and the United States is strengthened by a citizenry that can freely exchange ideas in one shared language,” the document states.\n\nThe order revokes a presidential mandate from the 1990s under then-president Bill Clinton requiring federal agencies and agencies receiving federal funding to provide assistance to non-English speakers.\n\nAccording to the new document, agencies will still have flexibility to decide how much help to offer in languages other than English.\n\n“Nothing in this order … requires or directs any change in the services provided by any agency,” the executive order states.\n\nIt adds that agency heads are empowered to determine what is necessary “to fulfill their respective agencies’ mission and efficiently provide government services to the American people”.\n\nTrump has issued a blizzard of executive orders in his first weeks in office, seeking to put his right-wing stamp on the country.\n\nHowever, many of his orders are being challenged in court, particularly when they seek to annul federal funding approved by Congress.\n\nWhile the White House acknowledges that more than 350 languages are spoken in the United States, the order says English has been the nation’s language “from the founding of our Republic”, and “our Nation’s historic governing documents, including the Declaration of Independence and the Constitution, have all been written in English”.\n\nNearly 68 million people speak a language other than English at home, according to US government figures from 2019.\n\nWhile English is by far the majority language in the country, more than 40m people in America are estimated to speak Spanish at home.\n\nIn addition to other immigrant groups, including Chinese and Vietnamese, the complex US linguistic landscape includes scores of Native American languages.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/02144517e30cd6f.png",
  "retrievedAt": "2025-08-25T14:54:20.382Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895309/trump-designates-english-as-official-language-of-us",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T09:40:45.000Z"
}
