{
  "title": "PPP unlikely to quit coalition govt: PML-N Senator Irfan Siddiqui - Pakistan - DAWN.COM",
  "author": null,
  "content": "PML-N Senator Irfan Siddiqui has said that its ally in the ruling coalition, the PPP, was unlikely to quit the government as the party did not want to steer the country towards “another crisis”.\n\nThe differences between the PML-N, which heads the coalition, and the PPP have been simmering for months as the key ally has expressed frustration over unfulfilled promises.\n\nA meeting in December between the top leaders from both sides, Prime Minister Shehbaz Sharif and President Asif Ali Zardari, seemingly failed to put an end to the disagreements. Even after that meeting, PPP Senator Saleem Mandviwalla claimed that directives issued by the Presidency were not being heeded by the PM’s Office.\n\nDuring an interview with DawnNewsTV programme ‘Doosra Rukh’, aired on Saturday, Senator Siddiqui said the PPP “would not want the country going into another crisis” as a result of it quitting the government alliance.\n\n“If the National Assembly dissolves, we would head towards another instability, and another election would be demanded. If elections are held here [in NA], then what would happen in the provinces?\n\n“So, the country would then go into another crisis. My opinion is that given how Pakistan is steering out of difficulties, the PPP would not want the country going towards a crisis again,” Siddiqui said.\n\nHis remarks came as he responded to a query about the PPP quitting the ruling coalition by not voting in favour of the federal budget later this year.\n\nSiddiqui acknowledged that the possibility existed even today: “Undoubtedly, if the PPP decided even today ‘we are not supporting the government’ then we can be voted out tomorrow because the PML-N does not have the [simple] majority.”\n\nHowever, he stressed neither the PPP nor the PTI could form the government alone, given that they failed to secure a simple majority in last year’s general elections.\n\nThe PML-N reaffirmed that the PML-N’s agreement with the PPP should be implemented.\n\n“PPP has a [history] of democratic struggle, it wants to maintain the parliament and not put the system into chaos. National interests are dearer to it [and] it does not want to do politics of violence.\n\n“So, in all these aspects, [the PPP] is now instinctively very close to us (PML-N), regardless of what our ideologies are.”\n\nStating that the PPP’s reservations should be addressed, Siddiqui recalled that efforts were underway to do that as a committee had been formed under Deputy Prime Minister Ishaq Dar.\n\n“We will definitely resolve these reservations,” the PML-N leader asserted.\n\nIn January, the PPP held a meeting of its Central Executive Committee (CEC), where it demanded that the federal government hold local government polls in Punjab and Islamabad as per the agreement it had made with the ruling coalition.\n\nThe PPP has also repeatedly voiced concern over the construction of controversial canals in Punjab’s Cholistan area.\n\nIt has called for the immediate meeting of the Council of Common Interests (CCI), which has been pen­ding for 11 months, and called for the canal issue to be raised there.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:54:21.348Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895311/ppp-unlikely-to-quit-coalition-govt-pml-n-senator-irfan-siddiqui",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T11:31:49.000Z"
}
