{
  "title": "Seminary teacher in Bahawalpur held for torturing minor student - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: Police on Saturday arrested a seminary teacher for allegedly torturing his 10 years old pupil at Madressah Jamia Ghausuia in the limits of Thingi police station in Vehari district.\n\nQari Shabaan’s arrest was made on the complaint of Muhammad Akram, father of torture victim Muhammad Waqas. Police registered case under section 328-PPC.\n\nThe complainant alleged that suspect tortured and abused his son for not learning his lesson.\n\n“My son was in a state of shock and fear and was admitted to a local hospital.”\n\nSENTENCE: A court in Mailsi handed down life imprisonment along with fine Traiq Ali in a murder case.\n\nAccording to prosecution , Tariq Ali had murdered Rehmat Ali over enmity in the limits of city Mailsi police station of Vehari district in 2023.\n\nTariq Ali was arrested by Mailsi policet. The court sentenced him of to life imprisonment along with a fine of one million rupees which would be given to the legal heirs of the deceased as a compensation.\n\nIn another case, drug trafficker Khadim Hussain was sentenced to nine years’ imprisonment along with a fine of Rs 100,000. He was arrested by Tibba Sultan police and narcotic was recovered from his possession.\n\nSUGAR: The Ashraf sugar mills, Bahawalpur, has established 12 sale points in the districts of Bahawalpur and Lodhran for buying sugar at subsidized price of Rs130 per kilo.\n\nThe sale points are in Bahawalpur city, Khairpur Tamewali, Hasilpur, Lodhran and Kahror Pucca and will remain functional till the last day of month of Ramzan.\n\nconvocation: Third convocation of the Government Sadiq College Women University (GSCWU) was held here on Friday where 3,988 students -- 2,394 MA/MSc, 1,591 BS, three PhDs – were awarded degrees and medals.\n\nIn his presidential address, former Punjab governor Baleeghur Rehman said PML-N governments had established 90 per cent of women universities in the country.\n\nHe promised to recommend to the chief minister to resolve problems of the university, including possession of 125 acres of land allotted to it for the establishment of its new campus.\n\nEarlier, VC Prof Dr Shazia Anjum presented a detailed report and said the university was providing quality education from BS to PhD level.\n\nShe said new programmes of bio-technology and food sciences technology had been introduced while other departments, including artificial intelligence (AI), nanotechnology, environmental engineering would be launched in near future.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:54:23.675Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895255/seminary-teacher-in-bahawalpur-held-for-torturing-minor-student",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T02:34:20.000Z"
}
