{
  "title": "PSX witnesses second bearish month amid IMF uncertainty - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) continued its bearish trend for the second month in a row, primarily due to anxious selling by investors in February. This uncertainty stemmed from concerns about tax reforms and the outcome of the upcoming first review of the $7 billion Extended Fund Facility by the International Monetary Fund (IMF).\n\nThe equity investors remained cautious throughout the month and opted to take profits at available margins. A successful IMF review would lead to the release of the second tranche, which the country direly needed to meet its external debt repayment obligations.\n\nAccording to Insight Securities Ltd, the market posted a slightly negative performance in February. The benchmark KSE 100 index reached an intra-month high of 115,890 after opening at 114,525 and fell to an intra-month low of 109,406. However, by the end of the month, it managed to close at 113,252, marking a decline of 1,004 points, or 0.88pc. After five consecutive positive months, the PSX turned negative in the first month of 2025.\n\nHowever, the market closed the outgoing week in the green zone supported by improved liquidity on the local front and positive investor sentiment surrounding discussions on the additional $1bn funding under the IMF’s climate facility, observed Arif Habib Ltd (AHL).\n\nA key positive development was the signing of a memorandum of understanding (MoU) between Pakistan and Iran aimed at increasing bilateral trade volume to $10 billion. However, investors remained cautious, closely monitoring potential corporate and provincial tax reforms ahead of the IMF’s review for federal budget FY26 approvals.\n\nThe State Bank of Pakistan’s (SBP) foreign exchange reserves recorded an uptick of $21m to $11.2bn while the rupee depreciated slightly by 0.04pc, closing at Rs279.57 against the dollar.\n\nAs a result, the index gained 450.7 points or 0.40pc week-on-week.\n\nHowever, AKD Securities Ltd noted that the market remained volatile throughout the week. It started on a positive note, buoyed by the initiation of talks for $1.2-1.5bn climate financing from the IMF, government proposals for energy tariff cuts and resolving circular debt, and strong corporate results, particularly from the banking and cement sectors.\n\nHowever, the momentum faded during the latter half of the week due to the absence of fresh triggers. On the climate financing front, authorities are discussing the implementation of a carbon levy. Meanwhile, the IMF has objected to the sales tax exemption on local EV component sales.\n\nOn the macro front, Pakistan signed several accords and committed to boosting bilateral trade with Azerbaijan, Uzbekistan and the UAE.\n\nSector-wise, positive contributions during the week came from commercial banks (510 points), glass and ceramics (83 points), power generation (78 points), E&P (68 points), and food (47 points). Meanwhile, the sectors that contributed negatively were technology and communication (109 points), investment banks (31 points), engineering (23 points), and insurance (21 points). Scrip-wise positive contributors were OGDC (206 points), MCB (203 points), BAHL (176 points), MEBL (106 points), and MLCF (95 points). At the same time, scrip-wise negative contributions came from HBL (109 points), Mari Energies (105 points), The Searle Company (72 points), Mehmood Textile (66 points), and Pakistan Oilfield (57 points).\n\nForeigner selling continued clocking in at $6.0m compared to a net sell of $5.1m last week. Significant selling was witnessed in banks ($3.9m), followed by ‘all other sectors’ ($1.3m). On the local front, buying was reported by mutual funds ($31.6m) and brokers ($0.8m).\n\nThe average trading volume dipped 17pc to 492m shares while the value traded decreased 0.6pc to $86m week-on-week.\n\nAccording to AKD Securities, the market outlook will likely remain positive, with the upcoming Monetary Policy Committee meeting scheduled for March 10 and any developments on the IMF review remaining in the investor’s focus.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:42:54.523Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895181/psx-witnesses-second-bearish-month-amid-imf-uncertainty",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T01:11:14.000Z"
}
