{
  "title": "The vanquished - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT should be becoming more and more obvious to anyone following the judiciary’s new direction that the critics of the 26th Amendment were justified in fearing that it would be abused by the government.\n\nEver since its enactment, it has become progressively more difficult to rationalise the reconstituted Judicial Commission’s decisions as politically neutral or objective. Take the recent expansion of the Supreme Court’s Constitutional Bench, for example. Why did the bench need to be expanded with five judges, with five judges only, and why did all five have to be only those who have only recently been elevated to the Supreme Court?\n\nThere are no legal or moral justifications, only political ones, for why several senior, experienced judges were once again ignored during consideration. Even to the layperson, it is clear that now that the judiciary has fallen to executive control, the vae victis principle has been put into play.\n\nObjectivity would demand that each judge appointed to the Constitutional Bench pass a rigorous test of merit and judgement in constitutional matters. What we have seen, instead, is an arbitrary system of appointment dominated by ‘like-minded’ individuals who feel no need to give the public any reasoning or justification for why they have made their decisions. This lack of transparency hurts judicial integrity.\n\nSeveral judges and stakeholders had previously demanded that the Constitutional Bench include all Supreme Court justices, at least for the purposes of adjudicating on the question of the legality of the 26th Amendment. This demand has been repeatedly ignored, and the recent expansion of the bench with selected judges suggests it may never be entertained. It is unfortunate that this path has been chosen, as it means that some important questions that concern the legitimacy of the Constitutional Bench itself may never be settled.\n\nThose who have managed to impose their will on the judiciary should realise that they have won a pyrrhic victory. In dismantling a pillar of the state, they have gravely hurt the legitimacy of the current regime in the public’s eyes. The Constitutional Bench is supposed to hear cases with far-reaching implications. Any impression that its judges have been cherry-picked erodes faith in its ability to adjudicate justly and sows the seeds for social divisions.\n\nIt is not proper or fair that certain justices are being repeatedly prevented from hearing any matter of national import just because they have vocally defended their independence.\n\nA system of justice that is publicly perceived to be skewed cannot deliver judgements that the public will accept unquestioningly as objective and just. Without the public’s trust, the apex court loses its raison d’être.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:54:22.062Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895245",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T02:22:42.000Z"
}
