{
  "title": "Army chief urges youth to focus on their duties instead of engaging in ‘baseless criticism’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) General Syed Asim Munir has urged the country’s students to be “self-responsible” and urged them to focus on their duties instead of engaging in “baseless criticism”, state-run Radio Pakistan reported on Sunday.\n\nIn recent statements, the military has taken a harsh line against online campaigns aimed at the army, with Gen Munir himself warning that social media was being used as a tool to spread anarchy and false information targeting the armed forces.\n\nCOAS Munir inaugurated the CMH Institute of Medical Sciences (Cims) in Punjab’s Bahawalpur, where he engaged with students from various universities, according to a statement by the Inter-Services Public Relations (ISPR) issued on Friday.\n\nDuring his interaction with students at Cims, Gen Munir stressed the “importance of self-responsibility, saying each of us must focus on our own duties and performance instead of engaging in baseless criticism”, Radio Pakistan reported.\n\nAccording to the ISPR statement, the army chief underscored the army’s commitment to nurturing the nation’s youth and lauded its role in shaping Pakistan’s future. He reaffirmed the “army’s support for initiatives that empower young talent”, the ISPR added.\n\nIt further said that Gen Munir encouraged students to pursue academic excellence with dedication and equip themselves with the skills necessary to contribute meaningfully to national development.\n\nThe army chief had addressed a gathering of university and college students last month in Rawalpindi, where he emphasised the need to imbibe “Pakistaniat”.\n\n“As long as great mothers continue to sacrifice their children for Pakistan and the youth stand united with the armed forces, nobody can harm the country,” Radio Pakistan quoted COAS Munir as saying.\n\nAccording to the report, the army chief described the country as a precious gift from Allah Almighty, highlighting it was “blessed with many bounties”. He urged the audience to remain steadfast in their beliefs, remember the ancestors, and uphold the society’s core values.\n\nGen Munir also reiterated that an “organised illegal spectrum backs terrorism with certain elements providing support to it”, Radio Pakistan said.\n\n“Whenever the state takes action against them, their false narratives are spread to undermine those efforts,” the army chief was quoted as saying.\n\nIn December, the ISPR said the illegal spectrum had “political backing everywhere, which, for its narrow-minded political and financial gain, is obstructing all the necessary steps that are required […] to break this illegal spectrum”.\n\nThe COAS had also expressed the army’s firm resolve to “eradicate the illegal spectrum undermining national security” in November last year. Past statements by the military have referred to a “spectrum of illegal activities” when speaking about the “pilferage of resources and economic losses that the country suffers due to these activities”.\n\nDuring his Bahawalpur visit, Gen Munir also inaugurated Innovista Cholistan and Integrated Combat Simulator Arena, which the ISPR described as “pioneering initiatives aimed at advancing medical education, information technology and combat readiness”.\n\nHe visited the Bahawalpur Cantonment as well where he addressed officers and troops, stressing that rigorous training “must continue to be the defining attribute of the Pakistan Army in overcoming the challenges of modern warfare”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/021325087b88003.jpg",
  "retrievedAt": "2025-08-25T14:54:22.151Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895305/army-chief-urges-youth-to-focus-on-their-duties-instead-of-engaging-in-baseless-criticism",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T08:45:32.000Z"
}
