{
  "title": "FOOTPRINTS: SHADOWS OF THE PAST - Newspaper - DAWN.COM",
  "author": null,
  "content": "IN September 1996, Al Haq, Jamia Haqq­ania’s monthly magazine, published a special edition celebrating Taliban victories following Maulana Samiul Haq’s visit to Afghanistan.\n\nThe magazine deta­i­led how Samiul Haq, after returning, urg­ed students to support the Taliban, offering special concessions to those willing to join. Within days, 250 students volunteered and were dispatched to Khost, Uruzgan, Lo­gar, Maidan Sha­har and Jalalabad.\n\nNow, in a grim turn of fate, violence has struck back at the seminary three decades later.\n\nOn Friday, a suicide bomber detonated explosives near the western gate of Maulana Abdul Haq Mosque, located within the sprawling seminary complex. The blast killed Maulana Hamidul Haq, son of Samiul Haq, who himself was mysteriously assassinated in 2018.\n\nThe explosion occurred as Maulana Hamidul Haq exited the mosque after prayers. On Saturday, the scene remained chaotic — blood and human remains stained the walls, and stunned students and locals gathered in shock.\n\nUsman, a teenage worshipper, recalled that the explosion occurred as they were offering sunnats after Friday prayers. “As soon as Maulana Hamid stepped out of the mosque, the blast took place,” he said.\n\nFormer seminary student Sifatullah, who travelled from Lakki Marwat for his late teacher’s funeral, blamed the attack on “enemies of Islam”.\n\n“This attack will push the religious section of society to rise against the rulers,” he said. He was also critical of the seminary’s lax security protocols, stressing that one must pass through several cordons of guards to arrive at any government building. But here, “a suicide bomber managed to enter undetected and killed the Sheikh”, he lamented.\n\nMany other students seemed uncertain about who could have carried out the attack. When asked if militant Islamic State-Khorasan (IS-K) group was behind the attack, most of them feigned ignorance. Senior JUI-F leader Amanullah Haqqani, when asked the same question, was evasive and said that the attack was a handiwork of “anti-Islam forces”.\n\nHaqqania’s history\n\nThe Haqqania seminary was established in September 1947. It was named Haqqania after its founder, Maulana Abdul Haq, a graduate of Darul Uloom Deoband.\n\nDr Altaf Qadir, a history professor at the University of Peshawar and author of Sayyid Ahmad Barailvi: His Movement and Legacy from the Pukhtun Perspective, told Dawn that parts of the seminary were built over the site of the Syed Ahmed Shaheed’s first battle against the Sikh rulers.\n\nDr Qadir said that in 1826, Syed and his adherents attacked a Sikh camp at this site in what later came to be known as Shabkhoon — a surprise attack by night. He said that the first batch of Afghan fighters against the first Afghan president of the Republic of Afghanistan, Sardar Dawood Khan, were invited by Zulfikar Ali Bhutto in the early 1970s to be trained in a military facility in the Nowshera district. This was under the command of Gen Nasirullah Babar, then a brigadier at the Frontier Corps.\n\nHaqqania perhaps would have remained obscure like other seminaries if some of its alumni, like Jalaluddin Haqqani, Muhammad Nabi Muhammadi, Maulvi Younas Khalis and some others, had not come to play an outsized role in the Afghan Jihad.\n\nIn their book Fountainhead of Jihad — The Haqqani Nexus, 1973-2012, Vahid Brown and Dan Rassler write: “This Deobandi seminary was the birthplace of a distinctively Pashtun Islamism, embodied in an alumni social network of religious and political elites that has had tremendous political success and far-reaching social influence in both Afghanistan and Pakistan. It was also the birthplace of the Haqqani network and the institution from which the Haqqanis take their name.”\n\nThey noted that after graduating from this seminary in 1970, Jalaluddin Haqqani also campaigned for Maulana Abdul Haq when he contested the National Assembly election that year. Later, he taught at his alma mater for a year before returning to Afghanistan.\n\nVahid and Rassler note that Yunis Khalis and Muhammad Nabi Muhammadi, two of the seminary graduates, were also instrumental in bridging the gap between Kabul Islamists, including Hikmatyar, Rabbani and Massoud and the more traditional Pak-Afghan Taliban schooled at Haqqania.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c37d930d721.jpg",
  "retrievedAt": "2025-10-12T01:43:43.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895180",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T01:10:58.000Z"
}
