{
  "title": "SECP clears amendments to modaraba ordinance - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Policy Board of the Securities and Exchange Commission of Pakistan (SECP) on Saturday approved the proposed amendments to the Modaraba Companies and Modaraba (Floatation and Control) Ordinance 1980.\n\nThe amendments were initially introduced in the National Assembly in July 2020 through the Modaraba Ordinance (Ame­ndments) Bill 2020 and received approval from the Standing Committee on Finance and Revenue and were presented to the National Assembly for consideration.\n\nHowever, the proposal lapsed due to the expiration of the National Assembly’s term in August 2023.\n\nThe SECP has completed a fresh proposal review by actively engaging the stakeholders for consultation. Consequen­tly, the policy board has finalised and approved a revised proposal for submission to the Finance Division for further legislative action.\n\nThe key reforms retained from the initial bill focus on promoting industry development, empowering investors, and enhancing regulatory alignment within the modaraba sector.\n\nThe proposal includes the introduction of unlisted modarabas to facilitate financial reso­urce mobilisation and performance-based profit sharing.\n\nAdditionally, it strengthens investor rights by aligning governance provisions with the Companies Act, enabling special resolutions for management changes, and improving investor protection thr­ough access to courts for winding-up proceedings.\n\nFurther amendments aim to streamline regulatory oversight by empowering the commission in disciplinary proceedings, transforming certain criminal offences into civil matters for better enforcement, and dissolving the Modaraba Tribunal by transferring its responsibilities to High Courts and session courts.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:54:37.517Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895183/secp-clears-amendments-to-modaraba-ordinance",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T01:11:14.000Z"
}
