{
  "title": "Nations fail to break deadlock on UN climate report timing - World - DAWN.COM",
  "author": null,
  "content": "Nations failed to break a deadlock over the timing of the UN’s next blockbuster assessment of climate change science after a marathon meeting in China that US envoys skipped.\n\nAt issue was whether the Intergovernmental Panel on Climate Change (IPCC), which informs policymakers, will deliver its next three-part assessment before a 2028 United Nations’ “stocktake” of the global response to rising temperatures.\n\nMany wealthy countries and developing nations exposed to climate impacts wanted an accelerated timetable, arguing the reports would allow countries to be guided by the most up-to-date science.\n\nBut they faced objections from some oil producers and major polluters with rising emissions, such as India and China.\n\nThe talks in Hangzhou ran over by more than a day, wrapping up late Saturday night with an agreement to allow work to proceed without a definitive deadline for delivery.\n\nThe outcome was a “bitter disappointment”, said Zhe Yao, global policy adviser at Greenpeace East Asia.\n\nThe deadlock “only serves those who wish to hold back climate action, but climate vulnerable countries cannot wait”, Yao said.\n\n“It’s a bitter disappointment every time when division leads to a decision being postponed or kicked down the road.”\n\nThe meeting was overshadowed by a US decision to stay away, as President Donald Trump unpicks his predecessor’s climate actions.\n\nExperts warned the US absence from the world’s leading scientific body on climate change would be hugely damaging.\n\n“International scientific progress is key to prosperity, equity, and resilience — for the US and all nations,” said leading climate scientist Johan Rockstrom, of the Potsdam Institute for Climate Impact Research.\n\nThe meeting in Hangzhou came on the heels of the hottest year on record and rising alarm over the pace of warming.\n\nUN officials sought to inject urgency into the largely closed-door proceedings when they opened on Monday.\n\n“Time is not on our side,” UN Environment Programme chief Inger Andersen warned, urging “ambitious” outcomes from the talks.\n\nThe UN’s first stocktake, published in 2023, was a damning indictment of slow progress on tackling warming.\n\nIn response, the COP28 climate summit issued a groundbreaking call for the world to move away from fossil fuels.\n\nThe IPCC has warned the world is on course to cross the Paris climate deal’s long-term warming threshold of 1.5 degrees Celsius above pre-industrial levels in the early 2030s.\n\nRecent studies have also suggested that milestone could be crossed before the end of this decade.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:54:21.949Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895297/nations-fail-to-break-deadlock-on-un-climate-report-timing",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T06:44:12.000Z"
}
