{
  "title": "22 members of Ahmadiyya community held in Sialkot - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Daska (Sialkot) police on Saturday arrested 22 members of the Ahmadiyya community for offering prayers in their religious place.\n\nThe police registered a case under Section 298(c) of the Pakistan Penal Code (PPC), which prohibits individuals of the Qadiani group or the Lahori group (who call themselves “Ahmadis” or by any other name) from posing as Muslims, calling their faith Islam, preaching or propagating their faith, or outraging the religious feelings of Muslims.\n\nThe complaint was lodged by Hamza Asif, a resident of Mohalla Totiyanwala, who stated that he was passing near the house of Nasrullah Khan Sahi, an Ahmadi, and saw people offering Friday prayers.\n\nHe alerted the police which arrived at the scene, took 22 individuals into custody, and registered the case.\n\nAhmadiyya community spokesperson Aamir Mahmood stated that members of their community had gathered in the Baitul Zikr and were observing their religious sermons when `religious extremists’ began hurling threats. He mentioned that the community members alerted the police, which arrested 22 members, including children and teenage boys.\n\nMahmood asserted that the members were observing their religious sermons in a cordoned-off place marked as Baitul Ziker and that, under the constitution, they could do so.\n\nSialkot District Police Officer (DPO) Faisal Shehzad explained that, due to an encroachment operation, a part of the wall of Baitul Zikr was demolished.\n\nHe said the community members gathered on Friday to construct the worship place after the operation and began offering Friday prayers.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/07/25151851fcfe52f.jpg?r=151945",
  "retrievedAt": "2025-08-25T14:54:23.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895267/22-members-of-ahmadiyya-community-held-in-sialkot",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T02:44:40.000Z"
}
