{
  "title": "Death toll in India avalanche rises to 8 as rescue operation ends - World - DAWN.COM",
  "author": null,
  "content": "Rescuers recovered the eighth and final body from the site of an avalanche in a remote area of northern India, the army said on Sunday, marking the end of a marathon operation in sub-zero temperatures.\n\nMore than 50 workers were submerged under snow and debris after the avalanche hit a construction camp on Friday near Mana village on the border with Tibet in the Himalayan state of Uttarakhand.\n\nAuthorities revised down the number of workers on site at the time of the avalanche from 55 to 54 after one worker, previously believed to be buried, was found to have safely made his way home before the avalanche hit.\n\nRelief teams had managed to rescue 50 workers, but among them four later died of their injuries.\n\nThe army used a drone-based detection system to assist in its search operations. Multiple drones and a rescue dog were also employed.\n\nConstruction worker Anil, who only gave his first name, recalled his rescue hours after being buried by the avalanche.\n\n“It was as if God’s angels had come to save us,” Anil, who is in his late 20s, told AFP today by phone from his hospital bed.\n\n“The way we were engulfed in snow, we had no hope of surviving.” Being alive now felt “like a dream”, he said.\n\nWorking on a project by the Border Roads Organisation, the workers were living on site in steel containers considered stronger than tents and capable of withstanding harsh weather.\n\nAnil said many workers were fast asleep and a few others were in makeshift toilets when the avalanche struck around 6am (5:30am Pakistan time) on Friday.\n\nAs the ground beneath them shook, the container in which Anil and his colleagues were in began to slide down.\n\n“At first we did not understand what was happening but when we looked out of the window of the containers, we saw piles of snow all around,” he said. “The roof of the containers was also slowly bending inwards.”\n\nEveryone started screaming for help and a few men were lucky to get out of their containers.\n\n“But not all of them made it out and they remained trapped,” he said.\n\nHis colleague Vipin Kumar thought “this was the end” when he found himself unable to move as he struggled for air under the thick layer of snow.\n\n“I heard a loud roar, like thunder … before I could react, everything went dark,” he told the Times of India newspaper.\n\nAt an altitude of more than 3,200 metres, minimum temperatures in the area were down to minus 12 degrees Celsius.\n\nDhan Singh Bisht said his son and nephew were alive only because of the prompt action by the relief teams.\n\n“I am grateful to them,” an overwhelmed Bisht told AFP by phone yesterday.\n\nAvalanches and landslides are common in the upper reaches of the Himalayas, especially during the winter season.\n\nScientists say climate change is making weather events more severe, while the increased pace of development in the fragile Himalayan regions has also heightened fears about the fallout from deforestation and construction.\n\nIn 2021, nearly 100 people died in Uttarakhand after a huge glacier chunk fell into a river, triggering flash floods.\n\nDevastating monsoon floods and landslides in 2013 killed 6,000 people and led to calls for a review of development projects in the state.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/021748511f4b091.jpg",
  "retrievedAt": "2025-08-25T14:54:21.866Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895329/death-toll-in-india-avalanche-rises-to-8-as-rescue-operation-ends",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T12:53:28.000Z"
}
