{
  "title": "South Waziristan district headquarters relocated to Ladha from Tank - Pakistan - DAWN.COM",
  "author": null,
  "content": "SOUTH WAZIRISTAN: The Upper South Waziristan district headquarters has officially been relocated from Tank to Ladha, marking a historic administrative shift after 130 years.\n\nThe formal inauguration ceremony took place on Saturday at the Ladha Tehsil Building, attended by MNA Zubair Mehsud, MPA Asif Khan, former senator Saleh Shah, tehsil mayors, and senior district administration officials.\n\nThe district headquarters of South Waziristan was originally established in 1895 during the British rule — not within the district itself, but in Tank. As a result, local residents had to travel to another district for administrative matters. After more than a century, the provincial government, under the leadership of Chief Minister Ali Amin Khan Gandapur, and with the support of Inspector General of Frontier Corps South Khyber Pakhtunkhwa Mehar Khan Niazi, MPA Asif Khan, and the military leadership, has successfully relocated the district headquarters to Ladha, which is centrally positioned within the district.\n\nThe inauguration event saw widespread participation, with prominent political figures, government officials, and local tribal elders in attendance.\n\nElders hail move as beginning of new era of development in tribal district\n\nAddressing the gathering, the speakers emphasised the historical significance of the move. They highlighted that the district headquarters of South Waziristan, Orakzai, and Khyber were originally established outside their respective districts during the British rule. However, the provincial government and military leadership had now taken steps to relocate these administrative centres to their rightful districts, they added.\n\nSpeaking on the occasion, MNA Zubair Mehsud, MPA Asif Khan, former senator Saleh Shah, and the tehsil mayors expressed their satisfaction with this long-overdue decision. They noted that shifting the district headquarters to Ladha would mark the beginning of a new era of development in Upper South Waziristan.\n\nThey further stated that one of the key reasons for the underdevelopment of the region was the placement of the district offices in another district. This issue has now been resolved, ensuring that local residents can access government services more efficiently, they added.\n\nThe relocation is expected to streamline administrative functions and accelerate developmental projects in the area, ultimately contributing to the prosperity of the region.\n\nIt is noteworthy that on January 12, IGFC Mehr Niazi had officially announced the relocation of the district headquarters from Tank to Ladha during a jirga with the Mehsud and Burki tribal elders.\n\nFollowing the announcement, the district administration officials and all relevant departments began the process of shifting their offices to the new headquarters.\n\nThe move has been widely welcomed by the local community, which had long demanded this administrative correction. With the headquarters now in its rightful place, the people of Upper South Waziristan can finally benefit from improved governance and development initiatives within their own district.\n\nCEASEFIRE AGREEMENT: A major development took place in the longstanding Ghundak land dispute between the Sarkikhel and Jikhel-Darikhel tribes in Birmal tehsil of Lower South Waziristan district on Saturday as both the parties agreed to a temporary ceasefire until the 10th day of Eidul Fitr.\n\nThe agreement was made possible thanks to extensive mediation efforts by Pakistan Tehreek-i-Insaf MNA Zubair Wazir, the civil administration officials and the tribal elders.\n\nThe agreement prohibits any construction activity or armed engagement during this period. The district administration has issued a stern warning that any violation of the truce will result in strict legal action against the responsible party.\n\nThe development has significantly reduced tensions, which had been escalating over the past few weeks due to increasing hostilities between the two tribes.\n\nThe dispute, which revolves around ownership claims over the Ghundak land, had led to a volatile situation, with both tribes fortifying their positions and preparing for potential armed conflict. For the past 15 days, the rival groups had occupied defensive bunkers, heightening fears of an imminent clash.\n\nHowever, following successful negotiations, both factions have agreed to vacate their positions and abide by the terms of the ceasefire.\n\nSpeaking on the matter, MNA Zubair Wazir emphasised the importance of dialogue and peaceful resolution, stating that after Eid, concerted efforts would be made to settle the issue permanently through negotiations. He acknowledged the crucial role played by tribal elders and the local administration in de-escalating the crisis and urged all stakeholders to work towards a lasting solution.\n\nThe truce has been widely welcomed by residents of the region, who had been living under the constant fear of violence. Community leaders have expressed hope that the coming negotiations will lead to a fair and just resolution, preventing any future flare-ups.\n\nWhile the temporary ceasefire has eased immediate tensions, the underlying issues remain unresolved. The involvement of local authorities, tribal mediators, and political representatives will be essential in ensuring that the dispute is settled amicably, bringing long-term stability to the area.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:43:11.502Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895158/south-waziristan-district-headquarters-relocated-to-ladha-from-tank",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T01:11:53.000Z"
}
