{
  "title": "Case of the BLA and PKK - Pakistan - DAWN.COM",
  "author": null,
  "content": "WITH the fall of the Assad regime in Syria, the Middle East’s militant landscape has been in the throes of a rapid transformation. Armed groups are under immense pressure to change tactics, with many altering their strategies. Others are undecided due to ideological and geostrategic considerations.\n\nA particularly significant development is the call by Abdullah Öcalan, a founding member of the Kurdistan Workers’ Party (PKK), urging his group to disarm and dissolve itself. This announcement is bound to have far-reaching implications for the region; Öcalan’s message is likely to resonate among various Kurdish armed factions, in particular those that are located in north-eastern Syria and northern Iraq, and which have historical links to the PKK. It would be interesting to see how Kurdish groups backed by the Syrian Democratic Forces (SDF) will react to the development, given their deep connections to the PKK. Öcalan’s statement could potentially reshape the political and military dynamics of the region.\n\nThe SDF was not invited by the Türkiye-backed Hayat Tahrir al-Sham, which toppled the regime of Bashar al-Assad in Syria, to participate in a dialogue to form a new transnational government due to pressure from Ankara. However, SDF leaders have confirmed that they are in talks with the new authority in Damascus. Indeed, the HTS will consider Ankara’s advice in dealing with the SDF, while defusing Öcalan’s pressure would be challenging for the SDF. The SDF is also waiting for a response from the new administration in the US to see how it will react to the recent developments. Öcalan’s announcement will likely further pressure and isolate the SDF, forcing it to decide which path to adopt. Initially, the SDF denounced Öcalan’s call and stated that it had nothing to do with Syria.\n\nThe tolerance for non-state actors of all ideological and political shades in the Middle East is reducing fast, with Iran seemingly alone in supporting the resistance by non-state actors in the region. The PKK’s call for disarming itself after 40 years of resistance, during which time 40,000 lives were lost, will have a consequential impact.\n\nThe PKK’s call for disarming itself after 40 years of resistance will have a far-reaching impact.\n\nThe Middle East is changing, and it remains to be seen whether the changes will be confined to the region or impact other areas as well, including Pakistan. The most curious case would be that of the Balochistan Liberation Army (BLA), which seeks inspiration from the PKK and other Kurdish militant movements.\n\nThe BLA is an ethno-nationalist militant group with left-leaning tendencies; it is also one of the most active insurgent groups among the 10 major leftist separatist movements worldwide. Left-leaning secular separatist movements are known to take inspiration from one another in shaping their ideological and political paradigms, as well as in refining their tactics and strategies. Moreover, such movements are open to influences from religiously motivated groups, especially in the area of operational tactics. For instance, alongside influences from other leftist militant movements, the BLA has also adopted tactics of Al Qaeda and the TTP, including the use of suicide bombings in its operations.\n\nAmong leftist insurgencies, the BLA is mainly influenced by Kurdish militant movements in Türkiye, Syria, Iraq, and Iran, viewing them as historical parallels. This influence was certainly in evidence when the BLA named one of its female suicide bombers Zilan Kurd after a Kurdish woman who, on June 30, 1996, carried out a suicide attack targeting Turkish soldiers in Dersim. The real name of the Baloch Zilan was Mahal Baloch, a seventh-semester law student at the University of Turbat, and originally from Gwadar. Interestingly, the BLA assigned her this name in February 2023, the same year that the Democratic Autonomous Administration of North and East Syria — also known as Rojava — declared support for the BLA, highlighting the similarities between the Baloch and Kurdish struggles.\n\nDespite these ideological parallels and symbolic connections, no concrete ties have been established between the BLA and Kurdish militant groups, aside from speculations that the BLA sought to leverage Kurdish networks to gain legitimacy in the West — particularly from the US, which has designated the BLA as a terrorist organisation. Rojava, the American-backed militia in Syria, gained the West’s support for fighting the militant Islamic State group; the BLA is often accused of having links with the TTP — a link that contradicts its leftist ideological leanings. While the alleged nexus between the BLA and TTP is an ambiguous one, the BLA has been significantly influenced by Kurdish militant groups in their inclusion of women in their ranks. The women have participated actively in operations, and increasingly, the names of female BLA militants are making headlines.\n\nApparently, there is no direct comparison between the evolving situation in the Middle East and the one in Pakistan and Afghanistan, but recent developments are likely to invite introspection among Balochistan insurgents, mainly the BLA. They are quite possibly reflecting on how their sources of inspiration have come under pressure despite the military and financial support that the US has given them. This may not be an era where resistance movements can easily succeed. Lessons can be learned from Colombia to the Philippines, where left-leaning ethno-nationalist movements struggle. The PKK disarmed itself without achieving substantial gains. The BLA, being the most active group in this club, might use this as an excuse to continue its resistance against the state.\n\nThis reflection is not limited to non-state actors. State institutions can also learn that initiating change can break the cycle of violence. A significant difference can be made by adopting a more inclusive approach towards the Baloch, incorporating them in a broader national cohesion scheme, addressing their political and economic grievances, and, most importantly, reviewing policies on matters like missing persons. The state and the insurgents might sustain the cycle of violence for decades, but the cost will be immense, affecting the economy, peace, and national cohesion.\n\nThe writer is a security analyst.\n\nPublished in Dawn, March 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c3c25ddcd1f.jpg",
  "retrievedAt": "2025-08-25T14:54:23.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895249/case-of-the-bla-and-pkk",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T02:29:37.000Z"
}
