{
  "title": "Kyiv’s allies embrace Zelensky at crisis talks - World - DAWN.COM",
  "author": null,
  "content": "UK Prime Minister Keir Starmer on Sunday warned that European security faced a once-in-a-generation moment as he hosted crisis talks in London on the Russian invasion of Ukraine, just days after a Kyiv-Washington clash.\n\nEighteen allies were gathered on the key question of security guarantees for Ukraine, all the more pressing after US President Donald Trump berated his Ukrainian counterpart Volodymyr Zelensky in an unprecedented White House blow-up.\n\nSitting next to Zelensky in front of the flags of Ukraine and European nations, summit host Starmer said it was “a once-in-a-generation moment for the security of Europe, and we all need to step up”.\n\n“I hope you know that we are all with you and the people of Ukraine for as long as it takes. Everyone around this table,” he told the Ukrainian leader.\n\nZelensky was embraced by some of the 18 other top leaders, including Starmer, Canadian Prime Minister Justin Trudeau and Nato chief Mark Rutte, while protesters rallied outside the UK leader’s home in support of Ukraine.\n\nIt was a stark contrast to Zelensky’s unusually heated Friday meeting with Trump in Washington, where he was berated by the American leader and accused of not being “ready” for peace with Russia.\n\nTrump and his Vice President JD Vance angrily accused Zelensky of not being “thankful” and refusing to accept their proposed truce terms.\n\nTheir argument, played out in front of the world’s news cameras, raised fears that Trump wants to force Kyiv into a peace deal, giving Russian President Vladimir Putin what he wants while leaving Ukraine broken and insecure.\n\nSpeaking ahead of the summit in London, Starmer said “nobody wants to see” scenes like Zelensky and Trump’s Oval Office clash. “We have to find a way that we can all work together. Because, in the end, we’ve had three years of bloody conflict. Now we need to get to that lasting peace,” Starmer told the BBC.\n\nItalian Prime Minister Giorgia Meloni echoed the sentiment, saying as she met Starmer in his Downing Street home that it was “very, very important that we avoid the risk that the West divides”.\n\nUkraine’s allies have been underscoring their steadfast commitment to counter growing concerns that Trump is about to sell Kyiv short in negotiations with Russia.\n\nThe London meeting brings together leaders from around continental Europe, including France, Germany, Denmark and Italy as well as Turkey, Nato and the European Union.\n\nWith fears mounting over the United States’ commitment to Nato, the meeting will also address the need for Europe to increase defence cooperation.\n\nIn addition to attending the security summit, Zelensky is also due to meet King Charles III during his visit.\n\nAs Sunday’s gathering got underway, dozens of protesters draped in the yellow and sky-blue flag of Ukraine gathered outside Starmer’s office, some holding signs bearing the legend “Putin’s end is near” and “Stop vermin, Stop Putin”.\n\nThat mirrored the hero’s welcome Zelensky received on Saturday when his convoy swept into Downing Street to a cheering crowd.\n\n“You’re very, very welcome here in Downing Street,” Starmer told the Ukrainian president before their 75-minute closed-door talks. Zelensky effusively thanked Britain and its people “for their tremendous support from the very beginning of this war”.\n\nThe pair unveiled a £2.26 billion ($2.84bn) loan agreement to support Ukraine’s defence capabilities, to be paid back with the profits of immobilised sovereign Russian assets.\n\nTrump has alarmed Kyiv and European allies with his pivoting of Washington’s diplomacy on the conflict.\n\nThe recently inaugurated Republican has cast himself as a mediator between Putin and Zelensky and has sidelined Kyiv and Europe while pursuing a rapprochement with Putin.\n\nThough he refused to apologise after the White House clash, Zelensky indicated that he was still open to signing a deal on Ukraine’s mineral wealth — coveted by Trump.\n\nMoscow, meanwhile, branded Zelensky’s Washington trip a “complete failure”. The Kremlin said in remarks aired on Sunday that the United States’ dramatic shift in foreign policy towards Russia largely aligned with Moscow’s vision.\n\n“The new administration is rapidly changing all foreign policy configurations. This largely coincides with our vision,” Kremlin spokesman Dmitry Peskov said in an interview with Russian state television recorded on Wednesday.\n\nTop Washington officials suggested on Sunday that Zelensky might have to step down if a peace deal is to be reached, underscoring President Donald Trump’s stunning shift in approach to the war with Russia.\n\n“We need a leader that can deal with us, eventually deal with the Russians, and end this war,” National Security Advisor Mike Waltz told CNN. “And if it becomes apparent that President Zelensky’s either personal motivations or political motivations are divergent from ending the fighting in this country, then I think we have a real issue.”\n\nWhile European leaders rallied around Ukraine, Republican officials appeared on Sunday news programmes questioning whether any deal could be reached with Russia so long as Zelensky remains.\n\n“Either he needs to come to his senses and come back to the table in gratitude, or someone else needs to lead the country to do that,” said Republican Mike Johnson, Speaker of the House of Representatives. “I mean, it’s up to the Ukrainians to figure that out, but… we need President Zelensky to do what is necessary.”\n\nSenior Democrats have angrily pushed back since the debacle Friday, saying Trump has come dangerously close to an all-out embrace of Russia.\n\n“The White House has become an arm of the Kremlin,” said Senator Chris Murphy, a Democrat who has emerged as one of Trump’s most outspoken critics. “It appears America is trying to align itself with dictators,” he said on CNN.\n\nSecretary of State Marco Rubio insisted, however, that the White House was clear-eyed about Putin’s Russia. “No one here is claiming Vladimir Putin is going to get the Nobel Peace prize this year,” he said on ABC.\n\nRubio added, however, that the first step in securing peace is to get the parties to talk together. “You cannot end a war unless both sides come to the table,” he said. “I’m not promising you it’s possible,” he added. “I’m not telling you it’s 90 per cent likely.\n\n“I’m saying it’s zero per cent likely if we don’t get them to a negotiating table. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/02215239f09a7a5.jpg",
  "retrievedAt": "2025-08-25T14:54:18.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1895332/kyivs-allies-embrace-zelensky-at-crisis-talks",
  "dateList": "2025-03-02",
  "date_published": "2025-03-02T13:25:55.000Z"
}
