{
  "title": "International criticism grows over Indian deception tactics during foreign envoys’ visit to IIOJK",
  "link": "https://www.app.com.pk/national/international-criticism-grows-over-indian-deception-tactics-during-foreign-envoys-visit-to-iiojk/",
  "date_published": "2021-02-19T09:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):The international community’s criticism grew like an avalanche towards India for the country’s latest disguised tactics during the EU and other peace envoys’ visit to Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAccording to a press statement received here from Tehreek-e-Kashmir(TeK) UK, the TeK President Raja Fahim Kayani said that Indian authorities had planned a visit of the European Union and African envoys to IIOJK in order to put a cover on the human rights violations in the disputed territory.\nHe said, it was surprising to see how the world’s so-called biggest ‘democracy’ was trying to fool the world by such hypocritical attempts. “If they are so fair, they must allow UN fact-finding mission,” he added.\n”India has been involved in severe violation of human rights in IIOJ&K in the last seven decades and specially since 5th August 2019 but It is important to mention that the purpose of the European Union and African envoys’ visit on 17th of February 2021 was to show to the world that the situation in IIOJK is normal and create an environment for upcoming trade and investment agreement between EU and India likely during the bilateral summit to be held on 8th of May 2021,” he remarked.\nRaja Fahim Kayani also wrote a letter to Volkan Bozkir, President of the United Nations General Assembly; António Guterres, Secretary General of the United Nations, Michelle Bachelet, The United Nations High Commissioner for Human Rights; Josep Borrell , High Representative of the Union for Foreign Affairs and Security Policy , Arena Maria, Chair of the Subcommittee on Human Rights of European Parliament, David McAllister, Chair of the Committee on Foreign Affairs of European Parliament, and other UN and EU’s officials.\nHe said, before the visit, Indian authorities arrested a number of human rights activists including chairman International Forum for Justice Human Rights (IFJHRJK), Mohammad Ahsan Untoo.”\nMeanwhile, Danish MP Sikandar Siddique also criticised India’s latest attempts on disguising the tragic situation in IOK and tweeted that ”Just as ‘guided’ (aka heavily choreographed) tours in North Korea, benefit only the regime, these visits in IIOJK are useless. The UN must have real access to document Modi’s violations of human rights’.\nBritish MP and Shadow Deputy Leader of the House of Commons Afzal Khan said that India welcomed a delegation to Indian Occupied Kashmir but it still refuses the United Nations or any other independent organisation to enter into the disputed region Jammu and Kashmir .The UN must be allowed unfettered access to Indian occupied Jammu and Kashmir, to fully assess the humanitarian situation & help broker peace”\nBritish MP Rachel Hopkins said ”The diplomatic delegation to Indian Occupied Kashmir must be able to visit wherever they wish to and speak to whoever they want to.”\nBritish MP and Chair Labour friends of Kashmir Andrew Gwynne also issued a statement about the matter and said that: ‘We hope news of the 22 Foreign Diplomats visiting Indian Occupied Kashmir is a newfound spirit of openness by India and these representatives will have unrestricted access to all the affected areas and will be able to speak to whoever they like’.\nFormer MEP John Howarth also highlighted that the delegation visiting Jammu and Kashmir at the invitation of the government of India, was composed of experienced international diplomats; who can recognise propaganda when they see it; and expected them to be fully skeptical about what they see and allowed to see.\nBut the delegation we really need, the presence we really need in Jammu and Kashmir is one of international observation under the auspices of the UN, free to move at will, and to look at whatever they want. Is only that we will see the abuses of human rights that have taken in Kashmir, come to an end’.\nBritish MP John Spellar , Former Minister of state said that the visit must now urgently pave way for United Nations Fact Finding Mission with full access.\nPolitical Strategist and Seniour Political Adviser Sheni Hamid also reminded everyone once more about UNSC’s crucial role on the matter; stating that the citizens of IIOJK do have solid evidences to prove that genocide was happening in the region.\nSince the Universal Declaration of Human Rights are amongst the core values to be kept by UN; and since UN member India has also signed the Geneva Convention and the Genocide Convention, UNSC has a crucial obligation to act towards stopping genocide from happening in Kashmir.\nHowever, organising a guided tour to International delegation visiting IIOJK would not bring any help to the region; because the visiting delegation would only be allowed to see a rosy picture in the area. Consequently, this would mislead their judgment for a fair conclusion.\nSo, the delegation and UNSC should insist on fact based evidences with regards to the ongoing genocide in IIOJK.",
  "retrievedAt": "2025-08-11T20:23:09.945Z"
}
