{
  "title": "COVID-19 claims 40 lives, infects 1,245 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-40-lives-infects-1245-more-people/",
  "date_published": "2021-02-19T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):The national tally on Friday of total active COVID-19 cases recorded 24,139 with 1,245 more people tested positive for the deadly virus and 1,243 people recovered from the disease during the last 24 hours.\nForty corona patients have died during past 24 hours, 39 of them were under treatment in hospital and one in their respective quarantines and homes on Thursday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nThe maximum ventilators were occupied in four major areas including Multan 25 percent, Islamabad Capital Territory (ICT) 35 percent, Peshawar 26 percent and Lahore 35 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Gujrat 61 percent, Peshawar 37 percent, Multan 24 percent, and Lahore 24 percent.\nAround 241 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 34,754 tests were conducted across the country on Thursday, including 10,863 in Sindh, 12,049 in Punjab, 6,430 in Khyber Pakhtunkhwa (KP), 3,456 in Islamabad Capital Territory (ICT), 725 in Balochistan, 467 in GB, and 764 in AJK.\nAround 531,840 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 568,506 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 9,673, Balochistan 18,967, GB 4,947, ICT 43,145, KP 70,493, Punjab 166,242 and Sindh 255,039.\nAbout 12,527 deaths were recorded in country since the eruption of the contagion. Around 4,267 perished in Sindh among four of them died during past 24 hours in the hospital.\n5,166 in Punjab had died with 28 deaths in past 24 hours in the hospital. 2,020 in KP where six of them died in hospital on Thursday, 488 in ICT among one of them in the hospital on Thursday, 199 in Balochistan, 102 in GB and 285 in AJK among one of them succumbed to the deadly virus in the hospital on Thursday.\nA total of 8,602,515 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 2,070 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:23:06.397Z"
}
