{
  "title": "Gwadar Cricket Stadium holds first-ever match",
  "link": "https://www.app.com.pk/national/gwadar-cricket-stadium-holds-first-ever-match/",
  "date_published": "2021-02-19T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):The iconic Gwadar Cricket Stadium surrounded by mesmerizing rocks on Friday held its first ever exhibition match played between Showbiz Sharks and Gwadar Dolphins.\nThe exhibition match was organized by singer-actor Fakhr-e-Alam in the lush green stadium of Gwadar amidst the coastal mountains and game changer port of Balochistan.\nThe match was dedicated to the Pakistani mountaineer Ali Sadpara who was declared dead by his family on Thursday.\nThe participants prayed for the high ranks of the departure soul of Muhammad Ali Sadpara and acknowledged his services for mountaineering especially his last endeavour to summit of the Savage Mountain K2.\nSpecial Assistant to the Prime Minister on Overseas Pakistanis Syed Zulfikar Bukhari said Pakistan was proliferating with beauty of nature and adventure from K2 to Gwadar, adding that tragedies always had united us. He was excited to play on the most beautiful cricket pitch in the world.\n“Such a beautiful ground does not exist in any other part of the world,” Zulfi Bukhari said.\nHe said a tournament would be played every year at Gwadar Cricket Stadium.\nThe government would focus on making Gwadar the most beautiful tourist destination in the world, he added.\nBritish High Commissioner to Pakistan Christian Turner presided over the coin toss at the stadium.\n“An honour to preside over coin toss at inaugural #CricketAtGwadar match at beautiful Gwadar stadium,” said the British High Commissioner in his tweet.\nGwadar Dolphins had chosen to bowl against Showbiz Sharks.\nShowbiz Sharks was captained by Chief Executive Offucer Pakistan Cricket Board Waseem Khan and team was comprised of Fakhr-e-Alam, Faysal Qureishi, Ali Zafar, Saleem Sheikh, Aijaz Aslam, Shehzad Roy, Sami Khan, Kamran Jeelani, Salman Saeed, Ali Safina and Noman Habib.\nThe Gwadar Dolphins team included local players and politicians like Syed Zulfi Bukhari, Ali Zaidi and GOC Gwadar.\nLast month, renowned TV personality Fakhr-e-Alam uploaded a video of the beautiful Gwadar cricket ground in Balochistan, describing it as the “most beautiful cricket ground” he had ever seen.\nIn a short video clip, Alam urged people to come out and play cricket in the Gwadar cricket ground. The video showcased the large, lush green stadium built between a long road and jagged edges of the mountains.\nThe International Cricket Council (ICC) shared the photo and challenged others to find a more picturesque stadium.",
  "retrievedAt": "2025-08-11T20:23:06.399Z"
}
