{
  "title": "PM Imran committed to end role of money in election process: Shibli",
  "link": "https://www.app.com.pk/national/pm-imran-committed-to-end-role-of-money-in-election-process-shibli/",
  "date_published": "2021-02-19T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Friday said Prime Minister Imran Khan was committed to end role of money in election process.\nTalking to media here, he said the government was striving to bring genuine representatives of the people in the parliament and this was not possible without abrogating the role of money in sale and purchase of votes.\nThe minister said the people, now, realized the importance of transparency in the Senate elections.\nHe said the politics of money needed to be eliminated and candidates should be elected on the basis of their capabilities.\nShibli said buying and selling of votes undermined democracy and moral values.\nHe said Election Commission of Pakistan would also be strengthened to further enhance its performance. Pakistan Tehreek-e-Insaf (PTI) believed that eligible persons could not come forward in politics until misuse of money was controlled, he added.\nHe said the PTI’s desire and demand was that under proportional representation, the parties and alliances should get seats as per their strength in the electoral assemblies.\nShibli said the PTI’s stance was justified and based on democratic principles and Bilawal Bhutto Zardari had also hinted his inclination towards open voting.\nThe minister said the opposition was trying to confuse the people by mentioning the no confidence motion against the Senate chairman but that was issue of internal rules of the house.\nHe said the opposition parties had agreed to amend the Constitution for open ballot system in the Senate elections but they failed to do so despite ruling the country for ten years.\nShibli said the PTI had clear majority in Khyber Pakhtunkhwa and Punjab and the government also enjoyed the advantage of having resources but it was surrendering the advantage in the larger interest of the democratic system.\nHe said the PTI was the only party which expelled its members of provincial assembly who violated the party discipline and voted for another candidates.\nSenate Standing Committee on Information and Broadcasting Chairman Senator Faisal Javed was also present on the occasion.",
  "retrievedAt": "2025-08-11T20:23:06.619Z"
}
