{
  "title": "By-elections: Polling starts in 2 each national, provincial assemblies",
  "link": "https://www.app.com.pk/national/by-elections-polling-starts-in-2-each-national-provincial-assemblies/",
  "date_published": "2021-02-19T06:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):The polling process has started for the by-elections in four constituencies including two vacant seats of the National Assembly and two of the provincial assemblies of Punjab and Khyber Pakhtunkhwa on Friday.\nThe Election Commission of Pakistan (ECP) is holding by-elections on four vacant seats this day which included NA-45 Kurram-I, NA-75 Sialkot-IV, PP-51 Gujranwala-I and PK-63 Nowshera-III.\nThe seat of NA-75 Tehsil Daska, District Sialkot was vacated after the death of Pakistan Muslim League-Nawaz (PML-N) Member of the National Assembly Syed Iftikhar-ud-Din in August 2020. The provincial assembly seat PP-51 Wazirabad was vacated due to the death of PML-N Member of the Provincial Assembly Chaudhry Shaukat Manzoor Cheema in June 2020 due to coronavirus.\nAccording to the ECP, the number of registered voters in the constituency NA-75 is 4,94300. As many as 360 polling stations have been set up out of which 155 are declared sensitive and 25 are highly sensitive.\nThe deputy commissioner had earlier announced a holiday in connection with the by-elections of NA-75 Sialkot-IV Daska.\nThe ECP has established 102 polling stations in the constituency PK-63 to facilitate 141,934 voters including 79,063 men and 62,871 women. 52 polling stations have been set up for men, 47 for women and three are combined polling stations. Out of the total, 39 polling stations were declared most sensitive and 35 as sensitive.\nIn pursuance of the provisions of Section 57 of the Elections Act 2017 read with Section 102 thereof and clause (4) of Article 224 and Article 254 of the Constitution, the ECP has called upon the electors to elect members of national and provincial assemblies.",
  "retrievedAt": "2025-08-11T20:23:07.682Z"
}
