{
  "title": "Pak-Saudia agree for certification of Pakistani skilled workforce",
  "link": "https://www.app.com.pk/national/pak-saudia-agree-for-certification-of-pakistani-skilled-workforce/",
  "date_published": "2021-12-05T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 05 (APP):Pakistan and Saudi Arabia signed a landmark momentous agreement for certification and employment of Pakistani skilled workforce through Takamol and National Vocational and Technical Training Commission (NAVTTC) yesterday.\nThe Agreement was signed by Minister for Federal Education and Professional Training, Shafqat Mahmood from Pakistan side and Dr. Ahmad Jabbar Al Yamni, from Saudia Arabia Takamol side.\nThe Agreement signing ceremony took place at Ministry of Human Resources & Social Development, Saudi Arabia and it was witnessed by senior officials of both countries.\nThis important cooperation between both countries has far-reaching impact for enhancing the employment opportunities for skilled Pakistani work force by joint certification and testing by Takamol Saudi Arabi and NAVTTC National Vocational and Technical Training Commission Pakistan.\nThis will also safeguard the existing Pakistani work force in Saudi Arabia. In order to facilitate Pakistani expatriate workforce, NAVTTC under the leadership of Shafqat Mahmood, Minister for Federal Education and Professional Training, Chairman NAVTTC Syed Javed Hassan and Executive Director NAVTTC Sajid Baloch worked hard to achieve this hallmark far-reaching Agreement between NAVTTC and Takamol.\nIt is expected that millions of Pakistani skilled workers will get gainful employment opportunities with higher earning as a result of the efforts of the Government of Pakistan.\nUnder this partnership, NAVTTC, National Vocational and Technical Training Commission Pakistan and Takamol, a subsidiary of Government of Saudi Arabia are establishing the testing regime under the Skills Verification Program, by exchanging the NOS (National Occupational Standards) and to facilitate skill verification of candidates through competency-based assessment (Theory & Practical) at exam Centers in Pakistan for candidates desirous of working in the Kingdom of Saudi Arabia.\nThis will enable Pakistani skill workforce to have authentic and internationally recognized joint certification by both Takamol Saudi Arabia and NAVTTC Pakistan, through Recognition of Prior Learning (RPL) assessment.\nThe Ministry of Human Resource and Social Development of Kingdom of Saudi Arabia (KSA) has introduced Skill Verification Program (SVP) implemented from July, 2021 in order to regulate its labor market. After implementation of SVP in KSA, the skill verification has become necessary for the Pakistani skilled workers, who intend to have employment in Saudi Arabia.\nIt is important to note that the largest number of Pakistani expatriate workforce is based in Saudi Arabia, who contribute substantially to Pakistan’s economy through foreign remittances. Most of the present Pakistani workforce in KSA fall in the category of un-skilled or semi-skilled labour, which means reduced remunerations and it also impacts remittances negatively.\nMoreover, in the changing scenario of labour laws and dynamics of the labour market overseas, a large number of Pakistani skill workforce require skills certification as presently they face non-recognition of their qualifications, skills and certification.\nThis cooperation will help a large number of these workers, also leading to national productivity and development.",
  "retrievedAt": "2025-08-11T21:41:29.609Z"
}
