{
  "title": "5th phase of referendum for Sikh homeland to be held on Dec 5",
  "link": "https://www.app.com.pk/national/5th-phase-of-referendum-for-sikh-homeland-to-be-held-on-dec-5/",
  "date_published": "2021-12-04T19:07:00.000Z",
  "source": "APP",
  "content": "The fifth phase of the referendum for an independent Sikh homeland will be held in the United Kingdom on December 5 2021.\nSikhs had massively participated in earlier four phases of the Khalistan Referendum.\nKhalistan referendum voting kick-started in London on  October 31, 2021 and over 30,000 Sikhs took part in the phase of the Khalistan referendum.\nSecond phase of Khalistan referendum was held in Southhall & Gravesend in the UK on November 7 2021, more than 10,000 British Sikhs took part in second phase of referendum.\nThird phase of the Khalistan referendum was held in Birmingham and Barking in the UK on November 14 2021 while fourth phase of the Khalistan referendum was held in UK cities of Leicester, Coventry and Derby on November 21, 2021.\nHuge participation of Sikhs in a referendum for their homeland has unnerved India, India tried hard to stop the Sikh referendum exercise in the UK. India’s false propaganda against Sikhs failed to prevent Khalistan referendum. UK allowed Sikh referendum despite Indian diplomatic efforts.\nKhalistan referendum has sent a strong message to Indian establishment to end discrimination against Sikhs and India should be prepared to give Sikhs their birthright of freedom.\nSikh referendum will also be held in future in the US, Canada, Australia, and the Indian region of Punjab.\nVoting in Geneva will be held on 10th December 2021 and result of Khalistan referendum will be declared by the Punjab Referendum Commission after the final phase of voting will be held in next six months.\nFindings of Khalistan referendum would be shared with United Nations and international bodies to create wider consensus.\nKhalistan referendum was in complete consonance with the UN Charter, separate Sikh homeland in the name of Khalistan was the dream of every Sikh.\nSikhs For Justice had released a map of their vision of what Khalistan would entail, the map shows not just Punjab but Haryana and Himachal Pradesh as part of Khalistan.\nSikhs had been facing organized persecution and continuous exploitation at the hands of successive Indian governments and Khalistan movement gained momentum in the aftermath of ethnic cleansing of Sikh community in India.\nSant Jarnail Singh Bhindranwale gave his life fighting Indian imperialism in 1984. Sikhs were committed to tread the path shown by Sant Jarnail Singh Bhindranwale.\nSeparate homeland for Sikhs in the name of Khalistan was writing on the wall. The world community must break its silence on the oppression of Sikhs in India.\nSikhs’ fight against India was actually a war against Hindutva hegemony.",
  "retrievedAt": "2025-08-11T21:41:33.171Z"
}
