{
  "title": "Sports can lead our younger generation on right path: Fawad",
  "link": "https://www.app.com.pk/national/sports-can-lead-our-younger-generation-on-right-path-fawad/",
  "date_published": "2021-12-05T11:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 5 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain Sunday said sports can lead our younger generation on right path through utilizing their potential in constructive and healthy way.\nThe minister was addressing a presser along with Federal Minister for Inter-Provincial Coordination (IPC), Dr. Fehmida Mirza and Special Assistant to the Prime Minister on Youth Affairs, Usman Dar.\nThe minister termed the decline of politics and democracy in our country as the reason of decline of sports and said that the Olympics performance of Pakistan was heavily criticized in the past while hockey and squash were almost eliminated.\nAbout the Kamyab Jawan Sports Drive to be launched on Monday, the minister said that around 6000 athletes between the ages of 15-25 were participating in the sports games under this drive for which every division has been declared a region.\nAs many as 3300 boys while 2700 girls are participating in the games and the ratio of girls reflect they are equal partners in sports like politics, economy and other fields.\nAbout the recent incident of mob lynching of the Sri Lankan Factory Manager, the minister said that the way Pakistani nation has shown its reaction over this incident reflect that they are united in their stance against such extremist and heinous act and wanted to cope with.\nThis was the second such incident after the attack on Army Public School on which the whole nation was grieved and ashamed, he said.\n“The reaction of our nation shows that majority of the people among the 220 million populations are tolerant citizens except few thousands or lacs of such extremist people, which is the ray of hope for us to move forward”, he said.\nHe said that the Prime Minister, Imran Khan conveyed his grief and pain over this incident while talking to the Sri Lankan President and also issued a message afterthe incident.\nFawad said that Pakistan is a progressive country with strong institutions and democratic values. “No country has witnessed restoration of democracy in the way as Pakistan after passing from long eras of dictatorship”.\nHe said that the way Ahsan Iqbal and Mustafa Nawaz Khokhar responded to the Maulana Fazl-ur-Rahman statement reflect that leadership exist in all the political parties who can realize the severity of the situation and wanted to cope with.\nThe minister said that the political process and democracy can only flourish in the country when law and order situation is improved.\nFawad said that the crowd involved in this incident was between the ages of 15-25 and emphasized on engaging youth in constructive and healthy activities like sports.\nThe minister congratulated SAPM, Usman Dar and Federal Minister for IPC, Dr, Fehmida Mirza for launch of this much needed sports drive.",
  "retrievedAt": "2025-08-11T21:41:33.276Z"
}
