{
  "title": "PM directs for all out support to assist repatriated students from Bishkek: Musadik",
  "link": "https://www.app.com.pk/national/pm-directs-for-all-out-support-to-assist-repatriated-students-from-bishkek-musadik/",
  "date_published": "2024-05-19T16:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): Federal Minister for Petroleum, Senator Musadik Masood Malik on Sunday said the Prime Minister had directed to ensure all out support to assist the repatriated students from Bishkek for reaching their hometowns safely.\nAddressing the students returning from Bishkek and media here at the Islamabad International Airport, the Minister expressed his heartfelt sympathies to the students for facing violence in Kyrgyzstan.\nMalik said the government made efforts but due to limited mission in Kyrgyzstan, it was unable to make extraordinary interventions.\nHe added that due to limited capacity, the Pakistani mission abroad was not to remain all-prepared for such emergencies.\n“The Federal Cabinet on behalf of the government extend an apology for the predicament the Pakistani students faced. We are running special flights to bring back all those who want to return and would not force the senior students who intend to stay as their final examinations were ahead,” he said.\nThe Minister said the government had demarched the Kyrgyzstan government and got the surety from them that no more mob attacks would be allowed on Pakistani students.\n“People made personal calls to me, the ambassador and we established a hotline at the Ministry of Foreign Affairs and the Embassy in Kyrgyzstan with four to five people operated the hotline to assist our students,” he said.\nMusadik Malik vowed that the government of Pakistan would support its children in distress all over the world. “Our Foreign Minister is also in contact with the Krgyz counterpart and our embassy is also engaged with them as well. We will bring every children through special flights and two more are ready to repatriate them with safety,” he said.\nThe Minister underlined that the government was taking commitment from the Kyrgyzstan government for the protection of Pakistan students staying in their country.\nHe announced that it was the government’s responsibility to send the students to their homes and would ensure all the required arrangements in that regard.\n“In case of any problem, the students can reach out to us and the government will do the rest. I welcome you with a painful heart as I share the feelings what your parents had been going through due to the tragedy abroad and. The students have passed through great pain and distress and my heart goes out with them,” he added.",
  "retrievedAt": "2025-08-11T02:35:39.216Z"
}
