{
  "title": "APSUP strongly condemns recent attacks on Pakistani students in Kyrgystan",
  "link": "https://www.app.com.pk/national/apsup-strongly-condemns-recent-attacks-on-pakistani-students-in-kyrgystan/",
  "date_published": "2024-05-19T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 19 (APP): The Association of Private Sector Universities of Pakistan (APSUP) Sunday strongly condemned the recent attacks on Pakistani students in Kyrgyzstan.\n“These reprehensible acts of violence against innocent Pakistani students studying abroad are deeply concerning and utterly unacceptable,” the association said in a statement issued here.\n“Education is a fundamental right and a beacon of hope for many young individuals striving to build a better future for themselves and their families. Such violent incidents undermine this principle and create an atmosphere of fear and insecurity among international students, APSUP remarked.\n“We urge the Kyrgyz authorities to take immediate and decisive action to ensure the safety and security of all Pakistani students in their country” adding that it is imperative that the perpetrators of these heinous acts are brought to justice and measures are put in place to prevent any recurrence of such incidents, they stressed.\nThey said we also call upon the government to engage with their counterparts in Kyrgyzstan to address this issue urgently and ensure the well-being of our students.\nA helpline should be made functional to provide updated information to the parents of the students, they recommended.\nAPSUP stands in solidarity with the affected students and their families during this difficult time and committed to supporting all efforts to provide them with the necessary assistance and ensure their safe and peaceful continuation of studies.\nThe pursuit of education should never be marred by fear or violence, APSUP believed.\nWe appeal to the international community to uphold the values of respect, tolerance, and safety for all students, regardless of their nationality.",
  "retrievedAt": "2025-08-11T02:35:45.199Z"
}
