{
  "title": "UNSC Resolution on Afghanistan a step in right direction: FO",
  "link": "https://www.app.com.pk/global/unsc-resolution-on-afghanistan-a-step-in-right-direction-fo/",
  "date_published": "2021-12-23T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): Pakistan on Thursday welcomed the adoption of UN Security Council Resolution regarding humanitarian assistance to Afghanistan as “a step in the right direction towards helping the Afghan people in dire need.“As called for by the OIC, pathways should now be found towards revitalizing of the Afghan economy and unfreezing of the assets that rightfully belong to the Afghan people,” Foreign Office Spokesperson Asif Iftikhar said in a statement.\n“Pakistan welcomes the adoption, by consensus, of the United Nations Security Council Resolution 2615, that has reaffirmed that provision of humanitarian and other assistance to people of Afghanistan is not a violation of the Security Council Sanctions regime,” he added.\nThe Spokesperson said that the resolution came at a critical time, and reflected the sense of urgency felt by the international community to help the Afghan people, who had suffered immensely due to decades of conflict.\nThis sentiment was also reflected in the Resolution adopted unanimously by the 17th Extraordinary Session of the OIC Council of Foreign Ministers (OIC-CFM) hosted by Pakistan last week, he mentioned.\nThe Foreign Office Spokesperson said that the OIC-CFM, chaired by Pakistan, unequivocally called for swift roll out of all possible humanitarian, recovery, reconstruction, development, technical and material assistance to Afghanistan.\nHe recalled that Prime Minister Imran Khan, in his key note address to the OIC-CFM, had stated that sanctions should not prevent the international community from providing humanitarian and other essential assistance to the people of Afghanistan.\n“Pakistan hopes that the international community, especially the donor countries, UN Agencies, humanitarian organizations, international financial institutions and other emergency relief providers, will act swiftly and with determination, to provide all possible assistance to the people of Afghanistan,” the Spokesperson maintained.",
  "retrievedAt": "2025-08-11T21:45:09.858Z"
}
