{
  "title": "Pakistan, Saudi Arabia reiterate desire to take bilateral ties to new heights",
  "link": "https://www.app.com.pk/national/pakistan-saudi-arabia-reiterate-desire-to-take-bilateral-ties-to-new-heights/",
  "date_published": "2021-12-23T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): Chairman of Shura Council of Saudi Arabia Dr. Abdullah Mohammad Bin Sheikh Thursday called on President Dr Arif Alvi here wherein the two countries reiterated their desire to take the existing bilateral relations into new heights in all the areas of mutual interest.\nBoth sides underlined the importance of further strengthening the parliamentary cooperation between the two brotherly countries.\nWelcoming the delegation, the President said that Pakistan and the Kingdom of Saudi Arabia enjoyed deep historical ties and tremendous cooperation which needed to be further promoted for the mutual benefit of the two sides.\nHe appreciated the Kingdom’s historical and continued support, and financial assistance to Pakistan in difficult times.\nHe congratulated the Saudi leadership for its timely initiative to convene the 17th Extraordinary Session of the Council of Foreign Ministers of OIC on the humanitarian situation in Afghanistan.\nPresident Alvi lauded the role played by the Kingdom for mobilizing the international community as well as announcing financial help, during the recently held OIC session of Foreign Ministers for the people of Afghanistan.\nHe expressed satisfaction that the OIC countries had given a strong message of hope, solidarity, and unity to the people of Afghanistan during this challenging time.\nHe emphasized that the Muslim world should work together to address the challenge of Islamophobia.\nThe atrocities being committed by India against the innocent people of Indian Illegally Occupied Jammu and Kashmir were also highlighted by the president during the meeting.\nHe urged the international community to put pressure on India to stop committing human rights violations and grant Kashmiris their right to self-determination in accordance with the UN Security Council’s resolutions.\nDr Abdullah Mohammad Bin Sheikh said that he considered Pakistan as his second home and emphasized the need to take practical steps to further improve bilateral ties.\nHe conveyed greetings to the president from King Salman bin Abdulaziz Al Saud and Crown Prince Mohammad Bin Salman. He also congratulated the president on successfully holding the 17th Extraordinary Session of the Council of Foreign Ministers of OIC on Afghanistan.",
  "retrievedAt": "2025-08-11T21:45:15.401Z"
}
