{
  "title": "Christian all set to celebrate Christmas on Saturday",
  "link": "https://www.app.com.pk/national/christian-all-set-to-celebrate-christmas-on-saturday/",
  "date_published": "2021-12-23T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):Christian community across Pakistan, like other parts of the world, is all set to celebrate the grand festival of Christmas on Saturday (December 25) in a befitting manner.\nThe Christian community has finalized its preparations to mark this festivity expressing traditional enthusiasm through giving last minute touches to their shopping and decorating Christmas tree.\nThe festival of Christian community will be marked through different activities ranging from big official gatherings to cake cutting ceremonies at the level of small communities, illuminating houses and observing prayers in Churches.\nSpecial cake cutting ceremonies will be arranged at different ministries and departments to share the happiness of the festival with the Christian staff members.\nSpecial services will be held in Churches across the country and prayers would be offered for peace, progress and prosperity of Pakistan as well as for the safety of all humanity from the life threatening pandemic.\nThe main attraction of the Christmas festival include the traditions like Christmas Tree, Santa Clause, Carols and Christmas gifts which add charm to the festivity.\nAll young and old have finalized shopping for themselves and their loved ones while children and youngsters were more inclined towards decorating Christmas tree and buying Christmas gifts to show their love to their family and friends.\nThe other festivities of the Christmas day include distribution of gifts among children, singing hymns, prayers and family gatherings.\nThe main ritual of the Christmas celebration is decoration of Christmas tree to welcome the arrival of Santa Claus also known as Father Christmas.\nIt has been observed that a number of shopping malls and hotels in the capital have placed decked Christmas trees to attract the visitors especially children.\nThe Christmas tree is usually decked with different ornaments including baubles, small bells painted gold or silver, stars of different shapes and sizes, pine cones, apples, candies, tinsel and balloons made from glass, metal, wood and ceramic.\nAn angel and star is often placed at the top of the tree representing the host of angels. It is pertinent to mention here that Islamabad Police has planned comprehensive security arrangements on the eve of Christmas and special deployment at Churches and public places.\nAccording to the police source, more than 1200 policemen will be deployed around churches in Islamabad and foolproof security arrangements have been planned for Christmas and special checking outside the churches.\nIt has been observed that a number of stalls have been set up outside the Katchi Abadis where the majority of Christian community reside. The stalls owners have displayed variety of decorative ornaments as well as dress of Santa Claus which is the source of attraction for the youngsters and children.\nDifferent brands and eateries in capital are also offering good discounts on the occasion of Christmas to attract more customers.",
  "retrievedAt": "2025-08-11T21:45:15.264Z"
}
