{
  "title": "FM urges people to beware of enemy sowing seeds of hatred",
  "link": "https://www.app.com.pk/national/fm-urges-people-to-beware-of-enemy-sowing-seeds-of-hatred/",
  "date_published": "2020-09-23T12:59:00.000Z",
  "source": "APP",
  "content": "MULTAN, Sep 23 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi Wednesday warned people to beware of enemy sowing seeds of hatred to harm peace and tranquility in the country.\nAddressing inaugural three-day 781st Urs ceremony of Hazrat Bahauddin Zakariya after giving traditional bath to the grave of the great saint, he said, the enemy forces were trying hard to breach the national cohesion through fake news to create\ndivide on sectarian and ethnic lines and nurturing their anti-Pakistan agenda.\nThe enemy attacked us last year but fled away after reprisal, he said adding that now its tactics are changing.\nThey are now trying to create sectarian strife. The country was being pushed into a hybrid war, he said.\nHe advised people to respect one another creed and faith and talk about each other with reverence.\nForeign Minister said that Muslim countries were passing through immense difficulties currently and many nations who were prosperous were now trapped in problems.\nHe said, it was our fundamental responsibility to save ourselves from flames of the\nfire being ignited by the enemy.\nQureshi advised people to learn to forgive each other adding that ups and downs are part of life.\nHe said the course of tranquility comes through difficulties and added that one must move to gain spiritual serenity.\nHe appealed the participants to carry forward his message as the world was being pushed into new form of battlefield.\nA psychological war was being imposed on us, he emphasized. He appealed Ulema to comprehend the conspiracies of the enemy and spread the message of peace and love among the people.\nHe was happy to see lovers of the saint pouring into the mausoleum to pay respect to the saint in great numbers disregarding difficulties. He praised Zaireen from Sindh who faced heavy rains that disturbed their life but did not forget to\npay respect to the saint.\n“The love I find here was matchless.” Qureshi lauded the saint for advocating peace, brotherhood and love.\nHe hailed media and scholars as they had played ‘responsible role’ to hit back propaganda of enemy vigorously.\nHe said, media and intellectuals should continue to defend county’s national interests and ideological frontiers.\nHe said, national unity was the need of the hour. He said that every individual must play role to strengthen Pakistan further.",
  "retrievedAt": "2025-08-11T19:49:54.982Z"
}
