{
  "article_id": "2025-06-30_e06865abb09499a4865952eae726e043",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahsan-iqbal-urges-officers-to-play-role-in-export-led-growth/",
    "retrieved_at": "2025-08-27T16:37:52.548Z"
  },
  "metadata": {
    "title": "Ahsan Iqbal urges officers to play role in export-led growth",
    "author": null,
    "date_published": "2025-06-30T08:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 338,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Jun 30 (APP):Federal Minister for Planning, Development and Special Initiatives Prof Ahsan Iqbal on Monday urged the officers to play a leading role in enabling export-led growth, digitising government operations, building climate resilience, improving infrastructure delivery and ensuring inclusive development. He said this while inaugurating a modern classroom at the Pakistan Administrative Staff College (PASC), National School of Public Policy (NSPP) Lahore, and commenced the 123rd National Management Course (NMC). Addressing the participants, the minister said the civil servants must play their vital role for Pakistan's transformation, adding that the system must be reformed to deliver better outcomes. He introduced the STAR model - Stable, Transparent, Agile and Responsible - as a governance framework to guide civil service transformation. Prof Ahsan Iqbal presented a comprehensive roadmap for governance reforms and institutional performance improvement, emphasising the transition from a procedure-focused to a mission-driven bureaucracy. The minister said the country is facing a crucial moment requiring data-driven, technology-enabled and accountable governance. Ahsan said: \"We must build institutions that are policy-consistent and shielded from political volatility, ensure transparency in decision-making, foster agility to respond to changing demands and instill responsibility in the use of public resources.\" The minister commended the role of civil servants to make the China-Pakistan Economic Corridor (CPEC) a success which showed the dedication of Pakistan's civil servants, adding that civil servants of various ministries worked with dedication, commitment and unity, and they made the CPEC successful in all stages. Prof Ahsan Iqbal outlined the government's long-term economic vision under the banner of 'URAAN Pakistan', which aims at making Pakistan a $1 trillion economy by 2035. He said the strategy is built on the five pillars of the 5Es: Exports, E-Pakistan, Environment, Energy & Infrastructure and Equity & Empowerment. Referring to Islamic teachings, he reminded the participants that public service is a responsibility and leadership in Islam is a duty, not a privilege. The minister encouraged the course participants to take part in the training with a spirit of service, creativity and commitment to the national development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}