{
  "article_id": "2025-06-30_be1723b65b1928f19555028072c1894a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-gbv-helpline-toolbox-launched-to-revolutionize-survivor-support-in-pakistan/",
    "retrieved_at": "2025-08-27T16:39:10.214Z"
  },
  "metadata": {
    "title": "National GBV Helpline Toolbox Launched to Revolutionize Survivor Support in Pakistan",
    "author": null,
    "date_published": "2025-06-30T11:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 314,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 30 (APP):In a landmark move to enhance gender-based violence (GBV) response across Pakistan, the Ministry of Human Rights (MoHR), in collaboration with UNFPA and Rozan, officially launched the first-ever GBV Helpline Toolbox today. Supported by the UK's Foreign, Commonwealth & Development Office (FCDO) under the flagship AAWAZ II programme, the Toolbox is set to transform the way survivors of GBV access support and services in Pakistan. The launch event, held in Islamabad, was graced by Secretary MoHR Abdul Khalique Sheikh (PSP), Director General MoHR Abdul Sattar , Deputy Representative UNFPA Pakistan Latika Maskey Pradhan and Excellency Henrietta Hamilton, Deputy Development Director and Head of Operational Excellence at the British High Commission. With nearly 1 in 3 women in Pakistan facing physical or emotional violence, the GBV Helpline Toolbox responds to a pressing national need by providing standardized protocols, survivor-centered guidelines, and practical tools to helpline staff and government institutions. The aim is to ensure that every survivor-regardless of their background-receives professional, empathetic, and confidential assistance. \"This Toolbox represents a unified national response mechanism that prioritizes dignity, inclusivity, and access,\" said Secretary MoHR Abdul Khalique Sheikh. \"It is a crucial step in ensuring no survivor is left unheard or unsupported.\" The Toolbox is a result of extensive national consultations and collaborative efforts. It defines clear operational standards, referral systems, and accountability measures, paving the way for a cohesive and professional GBV response system throughout the country. Officials from participating organizations emphasized the importance of inter-agency collaboration, peer learning, and nationwide adoption of the Toolbox to ensure consistent, high-quality support services for GBV survivors. For immediate support, survivors are encouraged to contact: 1099 - Ministry of Human Rights/PCSW Helpline 1737 - Punjab Women Protection Authority Helpline This initiative marks a new chapter in Pakistan's commitment to human rights and survivor-centered service delivery-building a future where every voice is heard, and every survivor is supported.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}