{
  "article_id": "2025-06-30_144daaabc64b9afb2980e6c86b418867",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-pays-tribute-to-lawmakers-for-their-commitment-to-democracy-rule-of-law/",
    "retrieved_at": "2025-08-27T16:37:47.790Z"
  },
  "metadata": {
    "title": "Gilani pays tribute to lawmakers for their commitment to democracy, rule of law",
    "author": null,
    "date_published": "2025-06-30T11:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 239,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 30 (APP):Chairman Senate Syed Yousaf Raza Gilani has paid tribute to elected representatives around the world for their commitment to democracy, the rule of law, human rights, and public service. In a special message issued on International Day of Parliamentarism he said that parliament is the cornerstone of any democratic society and the true voice of the people's aspirations. \"An empowered, transparent, and accountable parliament not only ensures national development, prosperity, and stability, but also upholds constitutional principles and democratic traditions,\" he said. Highlighting the vital role of Pakistan's Upper House, he noted that the Senate, as a symbol of the Federation, plays a crucial part in fostering inter-provincial harmony, promoting national unity, and ensuring equitable development across all regions. He added that the Senate serves as a platform for representing minorities, marginalized communities, and underdeveloped areas, and is committed to advancing democratic values and the Sustainable Development Goals (SDGs). Gilani also acknowledged Pakistan's growing role on the international stage through forums like the Inter-Parliamentary Union (IPU), where the country continues to promote peace, global cooperation, and democratic stability. He stressed that democracy's success depends not only on strong legislation but also on public trust, transparent governance, and the moral and constitutional conduct of elected officials. Urging all parliamentarians to rise above political divides, Gilani called on them to prioritize the national interest, uphold the supremacy of the Constitution, and work for the welfare of the people.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}