{
  "article_id": "2025-06-30_9e2d7457083a4d516e093e65c0c15db5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistans-first-indigenous-kaalash-marriage-bill-clears-vetting-by-law-deptt/",
    "retrieved_at": "2025-08-27T16:38:26.871Z"
  },
  "metadata": {
    "title": "Pakistan’s first indigenous Kaalash Marriage Bill clears vetting by Law Deptt",
    "author": null,
    "date_published": "2025-06-30T13:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 483,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR, Jun 30 (APP): In a landmark step toward preserving cultural heritage, Pakistan's first indigenous Kalash Marriage Bill has successfully passed vetting by the Law Department and will soon be presented to the cabinet before being tabled in the Khyber Pakhtunkhwa (KP) Legislative Assembly. This historic legislation aims to protect and formalize the unique marital customs of the Kalash community, ensuring their traditions are legally recognized while promoting cultural rights. This disclosure was made by Qamar Naseem, Programme Manager Blue Veins organization during annual consultative workshop for CSO Support group here Monday. The CSO Support group has been formed by Blue Veins under its initiative of `Faith in Action for Equal Rights and Opportunities' having three components including Kalash Marriage Bill, Implementation of two percent admission quota for Minorities in public sector universities and strengthening implementation of the Code of Conduct to counter hate speech and harmful content. Qamar explained to the participants that the Kaalash Marriage Bill had been drafted with considerable effort, as there was no written record of the community's religious traditions. The bill aimed to protect and preserve these customs, ensuring they remained intact after the legislation's passage. \"Once enacted, it will mark a significant milestone in Pakistan's efforts to safeguard minority communities and their ancestral practices,\" he remarked. The draft legislation has obtained approval from Law department and will now be forwarded for presentation in cabinet meeting for review, he added. About admission quota, the meeting was informed that out of 34 public sector universities in KP, about 27 have showed compliance by properly displaying announcement about minority quota on websites. The meeting participants demanded of government to also announce scholarships for students of minority community. Imran Yousaf, a representative of Christian Community demanded enforcement of Christian Marriage Act in Khyber Pakhtunkhwa. He said in Punjab, the colonial era legislation of 1872 for Christian Marriage is implemented and the practice should be replicated in Khyber Pakhtunkhwa. He expressed concern that, due to legal complexities, the Minority Rights portfolio is held by the Chief Minister of KP, who is unable to devote the necessary attention to it given his overwhelming workload. Imran also raised the issue of Endowment Fund of Rs. 200 million established for welfare of victims of All Saints Church. \"Although the allocated fund has increased from Rs. 200 million to Rs. 290 million due to addition of interest, but no disbursements have been made yet to support the victims of the Church blast,\" Imran claimed. Speaking on the occasion, Rizwan Ahmad of National Commissioner for Human Rights (NCHR) apprised the meeting that steps were being taken for protection of the rights of minority community. Compliance by 27 public sector universities in KP regarding implementation of minority quota is a reflection of efforts being made for benefit of the community. He said in the new budget, KP government has planned several schemes for benefit of minority community.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}