{
  "article_id": "2025-06-30_f904267aba47ec2f27405650a70fec6f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-airports-authority-holds-sixth-e-kacheri-to-address-public-grievances/",
    "retrieved_at": "2025-08-27T16:37:47.789Z"
  },
  "metadata": {
    "title": "Pakistan Airports Authority holds sixth e-kacheri to address public grievances",
    "author": null,
    "date_published": "2025-06-30T11:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 200,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 30 (APP):The Pakistan Airports Authority (PAA) conducted its sixth e-Kacheri on Monday at its headquarters in Karachi, with the aim of addressing public concerns and improving airport services. The session was chaired by Deputy Director General (Works & Development) Sumair Saeed and was attended by senior directors from departments including Human Resources, CNS, Security, SQMS, Planning & Development, and Civil Works. During the virtual forum, citizens raised a range of concerns, with a particular focus on human resource-related issues and complaints about lost or damaged baggage. Other matters highlighted included a shortage of porters, technical inefficiencies at airports, baggage handling delays, and troubling reports of bribery and misconduct by personnel linked to various airport-operating agencies. Deputy DG Sumair Saeed responded to each concern, providing context where needed and directing relevant departments to take swift and effective action. He emphasized the Authority's zero-tolerance policy toward corruption and reaffirmed PAA's commitment to service excellence. Addressing a specific inquiry regarding airport infrastructure, the Deputy DG announced that the design and consultancy phase for the upgradation of Dera Ghazi Khan Airport is nearing completion. He added that physical work on the project is expected to begin by the end of the year.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}