{
  "title": "Islamabad police remain silent on Sub-Inspector’s misconduct, citizen seeks justice",
  "link": "https://www.app.com.pk/national/islamabad-police-remain-silent-on-sub-inspectors-misconduct-citizen-seeks-justice/",
  "date_published": "2024-08-11T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): A citizen Usman Ghani has accused Islamabad police high-ups of shielding a sub-inspector Saif ul Islam who was allegedly involved in manhandling, illegal detention and torturing at Shalimar Police Station.\nAccording to details, the applicant Usman Ghani visited Shalimar Police Station with a companion for the solution of a matter between the two parties. Upon arrival, Sub-Inspector Saif-ul-Islam allegedly questioned Usman’s identity in a disrespectful manner. When Usman asked for the officer’s name, the sub-inspector reportedly dragged him to the lockup, detaining him without any formal charges. The plaintiff Usman claimed his requests for a glass of water were ignored, and an hour later, he was coerced into signing a blank paper. He was also threatened with false charges if he disclosed the incident.\nThe citizen Usman Ghani has also submitted a written complaint to the DIG’s office, but no action was taken despite of several follow-ups. According to Usman, after the media reported the incident, he received a call from the SDPO Circle Office. However, when he visited the office, the SP was unavailable and his calls went unanswered.\nThe sources indicated that police officers, in coordination with Sub-Inspector Saif-ul-Islam, delayed responding to Usman’s complaint, possibly attempting to prevent CCTV footage from being made public. The complainant expressed frustration over the lack of response from the Islamabad police, questioning why the authorities were protecting a lower-ranking officer.\nIn his appeal to the DIG Operations, the IG Islamabad and the Federal Minister of Interior, Usman sought justice, pointing out that the delay in action raises serious concerns about police accountability.\nHe questioned whether similar treatment would have been meted out if the victim had been a relative of a senior officer. Usman urged the authorities to ensure that justice prevails for all citizens, regardless of their status.",
  "retrievedAt": "2025-08-11T04:33:02.410Z"
}
