{
  "title": "Exploding Lithium batteries of solar panels erupted H-9 inferno: Report",
  "link": "https://www.app.com.pk/national/exploding-lithium-batteries-of-solar-panels-erupted-h-9-inferno-report-2/",
  "date_published": "2024-08-11T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): The H-9 inferno erupted on July 10th that turned a large number of shops, makeshift stalls, pushcarts, and merchandise to ashes, occurred due to exploding Lithium batteries attached to solar panels after it got overheated owing to excessive charging.\nThe Directorate of Emergency and Disaster Management of Municipal Corporation Islamabad (MCI) in its report submitted to the Parliamentary Committee, revealed that there was no electricity supply to the Bazaar as it was a one-day operations trading hub.\nThe report revealed that as many as 625 stalls were affected out of the total 2,743 in almost all the sections of the Bazaar, even though there were trained individuals capable of undertaking fire fighting efforts the massive scale of fire left all helpless.\nThe remaining 2,118 stalls were saved due to effective fire fighting operations conducted by the authorities that involved 31 fire tenders, 255 firefighting staff including 12 from MCI, four from Rawalpindi Administration, four from Pakistan Navy, two from Pakistan Air Force, nine from other departments and 16 water tankers in the entire operation.\nAn official from the Directorate of Emergency and Disaster Management, MCI claimed that the department was working out proper solutions to address fire risks and was mulling over a centralized electricity supply system or complete wrap-up of operations at night to be ensured.\nMoreover, he said that a committee of the vendors was formed to ensure localized awareness and mitigation efforts against fire hazards in the bazaar.\nThe Islamabad Capital Territory (ICT) Administration official claimed that the Rescue 1122 and the Emergency and Disaster Management wing of MCI had 10 fire brigades to manage the entire federal capital which was insufficient to manage the present scale of the metropolis’ population and sprawling infrastructure. However, in 2022, two episodes of mass fire in H-9 Bazaar had occurred after the UPS batteries had blown off, he added.\nHe informed that there was no insurance for the solar panels of shops that got impacted by fire and since it was a temporary bazaar, all electricity connections were removed after repeated fires.\nThe Capital Administration was preparing a summary to place Rescue 1122 under the Capital Development Authority (CDA) with a complete autonomous Director General that would also involve a complete beef up in resources, capacities and personnel. Moreover, revalidated standard operating procedures (SOPs) for fool proof fire prevention arrangements as a professional team was engaged to create the system, the official said.",
  "retrievedAt": "2025-08-11T04:33:17.748Z"
}
