{
  "title": "Atta Tarar vows to protect minorities’ rights at every forum",
  "link": "https://www.app.com.pk/national/atta-tarar-vows-to-protect-protect-rights-of-minorities-at-every-forum/",
  "date_published": "2024-08-11T14:45:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 11 (APP):Federal Minister for Information and Broadcasting Atta Ullah Tarar Sunday vowed to raise his voice at every forum to protect the rights of minorities.\nAddressing a ceremony regarding Minority Day held here at Model Town, he added, “We are proud of the minorities of Pakistan, the white color in the Pakistani flag represents the minorities, and the minority communities in Pakistan have always played a positive role in the development, prosperity and establishment of peace in the country.”\nThe Federal Information Minister assured that the government would raise its voice at all forums to protect the rights of minorities, asserting that Prime Minister Muhammad Shehbaz Sharif has clearly instructed the parliamentarians to play an active role in the protection of minority rights in and outside the parliament, as the government is the guarantor of the protection of rights of every citizen of Pakistan. He mentioned that he is an MNA of Lahore’s constituency where he represents 70,000 Christian voters. “I have received more love from this community than anyone else, and I am always in need of their support and guidance,” he added.\nHe said that when there is an incident or the community feels little fear, “then we encourage them and help raise their voice”, adding that Muhammad Shehbaz Sharif has always given the message of tolerance for the promotion of interfaith harmony.\nAtta Ullah Tarar also thanked all the participants in the ceremony, especially the minority communities for their presence. ‘Pakistan also belongs to the minorities and our flag, in which the white colour represents you, we are also proud of you’, he said. He also recited some poetry of a Sikh poet and chanted the slogan of ‘Long live Pakistan, long live the minorities of Pakistan.’\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:33:24.029Z"
}
