{
  "title": "Shahid Afridi leads KSL trials, new dates announced for aspiring cricketers",
  "link": "https://www.app.com.pk/national/shahid-afridi-leads-ksl-trials-new-dates-announced-for-aspiring-cricketers-2/",
  "date_published": "2024-08-11T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP):The organizers of the Kashmir Supreme League (KSL), the most prestigious and eagerly anticipated cricket league in Azad Jammu and Kashmir, have announced a revised schedule for their upcoming trials, taking into consideration the recent changes in weather conditions.\nThe trials are now set to begin on August 17 at the iconic Muzaffarabad Cricket Stadium, according to a press release issued here on Sunday.\nThe first phase of trials will be conducted on August 17–18 at the Muzaffarabad Cricket Stadium for aspiring cricketers from Muzaffarabad and Neelum districts.\nFollowing this, the trials for Bagh and Jhelum Valley districts are scheduled for August 20 at Bagh Cricket Stadium. On August 22, Rawalakot Cricket Stadium will host the trials for Haveli and Rawalakot districts.\nThe cricket action will then move to Kotli on August 24, where the trials for Kotli and Pallandri districts will be held at Kotli Cricket Stadium. Finally, the trials will conclude on August 26 at Mirpur Cricket Stadium for participants from Mirpur and Bhimber districts.\nShahid Khan Afridi, a globally celebrated cricketer and former captain of Pakistan’s national team, continues to be the brand ambassador for the Kashmir Supreme League. His involvement has added significant prestige to the league, attracting widespread attention from both local and international cricketing communities.\nLegendary wicketkeeper and former captain Moin Khan is also deeply involved in the league’s operations, ensuring that the KSL is managed with the highest standards of professionalism and excellence.\nThe Kashmir Supreme League is more than just a sporting event; it is a significant opportunity for the region’s emerging cricket talent to showcase their skills on a grand stage.\nThe league is expected to feature some of the most distinguished national and international cricket stars, who will not only compete but also mentor the young talent from Kashmir, sharing their vast experience and knowledge.\nBeyond the cricketing realm, the league is expected to draw prominent figures from various fields, both nationally and internationally. The presence of such esteemed personalities underscores the league’s broader mission to promote mutual relations, tourism, and sports activities within Pakistan and Azad Jammu and Kashmir.\nSince the league’s announcement, there has been a palpable wave of excitement among the youth of Kashmir. Young cricketers from across the region have been diligently preparing for the trials, eager to earn their place in what promises to be a historic cricketing event.\nThe Kashmir Supreme League has already captured the imagination of cricket enthusiasts, and the upcoming trials are expected to further elevate the anticipation and excitement surrounding this landmark event.",
  "retrievedAt": "2025-08-11T04:33:05.328Z"
}
