{
  "article_id": "2025-03-18_caf4fa1cde091ae0f78ae05fd4da09a6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minority-development-committee-approves-welfare-schemes-worth-rs-39-mln/",
    "retrieved_at": "2025-08-27T13:48:42.930Z"
  },
  "metadata": {
    "title": "Minority Development Committee approves welfare schemes worth Rs 39 mln",
    "author": null,
    "date_published": "2025-03-18T12:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 200,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 18 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf, and Minister of State Kheal Das Kohistani on Tuesday chaired a meeting of the Minority Development Committee. During the meeting, 53 welfare schemes, proposed by current and former non-Muslim parliamentarians and community leaders, were presented for consideration. The session was attended by Religious Affairs Secretary, Dr. Syed Ata-ur-Rehman, Senior Joint Secretary and Head of Interfaith Harmony Wing Dr. Mirza Ali Masood, Deputy Secretary Imran Rasheed, Deputy Chief Planning Division Iqbal Ahmed, Deputy Secretary Finance Naveed Akhtar, and Secretary Evacuee Trust Property Board Fareed Iqbal, among other committee members. After thorough deliberation, the committee approved 31 small-scale welfare schemes worth Rs. 39 million under the Minority Development Fund. These projects include the installation of solar systems and water filtration plants at non-Muslim places of worship, healthcare, and educational institutions. Additionally, the approved initiatives cover the provision of sewing machines for underprivileged non-Muslim women, furniture, prayer mats, and walk-through gates for religious sites. The restoration of old buildings, boundary walls, sound systems, and other essential facilities is also part of the plan. All approved projects are set to be completed before June of the current fiscal year.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}