{
  "article_id": "2025-03-18_bb7fec3e3f426b03bd12b281d8b4ca36",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/launches-13-feeder-electric-bus-routes-paving-way-for-greener-capital/",
    "retrieved_at": "2025-08-27T13:48:07.371Z"
  },
  "metadata": {
    "title": "launches 13 feeder electric bus routes, paving way for greener capital",
    "author": null,
    "date_published": "2025-03-18T17:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 406,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 18 (APP):Capital Development Authority (CDA) has successfully launched 13 feeder electric bus routes across Islamabad, marking a significant step in the cityas transition to eco-friendly public transportation. Under the leadership of Chairman Muhammad Ali Randhawa, the CDA is spearheading efforts to reduce carbon emissions, improve air quality, and provide affordable, efficient transport options for the capitalas residents. During a high-level meeting at the CDA Headquarters, on Tuesday Chairman Randhawa reviewed the progress of the electric and feeder bus operations, emphasizing the authorityas commitment to creating a cleaner, healthier, and more sustainable urban environment. The meeting highlighted the operational success of 120 electric buses across various routes, with plans to deploy the remaining 40 buses by June 2025, once charging infrastructure at the H-9 Bus Depot is fully operational. The electric bus initiative is part of a broader strategy to integrate feeder routes with the existing Bus Rapid Transit (BRT) network, ensuring seamless connectivity for commuters. With 216 bus stops and four depots planned at strategic locations, the project aims to revolutionize public transport in Islamabad. The first batch of 30 electric buses, operational since July 2024, has already made a significant impact, with an average daily ridership of 32,000 passengers across all routes. Chairman Randhawa expressed his satisfaction with the projectas progress, stating, aThe transition to electric buses is not just about reducing emissions; itas about building a future where public transport is efficient, affordable, and environmentally sustainable. We are committed to leading by example and ensuring that Islamabad becomes a model city for green mobility.a The CDAas ambitious plans donat stop at electric buses. Future initiatives include the development of a comprehensive public transport master plan and the construction of a Multimodal Intercity Bus Terminal at I-11, supported by the Asian Development Bank (ADB). Additionally, the authority is exploring innovative revenue streams, such as digital advertising boards in metro buses and terminals, to reduce reliance on subsidies and ensure financial sustainability. The meeting also underscored the importance of policy regulations to accelerate the adoption of electric vehicles (EVs) across Islamabad. Chairman Randhawa directed the CDA to collaborate with public sector institutions and universities to transition their transportation systems to electric alternatives. He also called for strategies to minimize subsidy dependence, ensuring the long-term viability of the electric bus project. With 13 feeder routes already operational and more on the horizon, the CDA is setting a new standard for sustainable urban development in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}