{
  "title": "Present govt to work for uplift of underprivileged people: Science Minister",
  "link": "https://www.app.com.pk/national/present-govt-to-work-for-uplift-of-underprivileged-people-science-minister/",
  "date_published": "2022-06-08T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Federal Minister for Science and Technology, Agha Hassan Baloch in a meeting with the Chairman Gwadar Port Authority Naseer Khan Kashan held here Wednesday expressed the resolve of the present government to work for the uplift of the underprivileged people in the country.\nBoth discussed the issues related to the ongoing projects in Gwadar.\nThe federal minister stressed upon utilizing the potential of youth in the area through means of modern education and skills development for the prosperity of the country.\nHe said engaging the local people and fishermen will create a sense of ownership in the local community.\nThe minister expressed the resolve of the present government to enhance the living standard of the underprivileged people in the country especially focusing on the educational development of the people of Balochistan.\nHe said this is the top priority and vision of the Balochistan National party leadership Sardar Akhtar Jan Mengal to uplift the socio-economic status of the province.\nThe federal minister remarked that the complex of China Pakistan Economic Corridor and the development of Gwadar port would help create employment opportunities as well as bring prosperity to the province of Balochistan.\nIt has huge potential for economic development and progress of the region, he added.\nAgha Hassan Baloch lauded the efforts of Gwadar Port authority for the development of the region’s most strategically well-located port.\nNaseer Khan Kashani briefed about all the ongoing Gwadar port operations and projects to the minister.\nHe said we are working on different avenues for the talented youth of Balochistan to fully exploit these opportunities.\nState of the art vocational and training institute is operational under Gwadar Port Authority to empower and maximize the employment opportunities for local youth, he added.\nSpeaking on the occasion, Chairman Gwadar Port Authority invited the federal minister for a detailed tour of the area and appreciated the support of the government for the economic development and progress of Gwadar.",
  "retrievedAt": "2025-08-11T15:03:00.923Z"
}
