{
  "title": "Maritime Affairs to provide 2000 motor boat engines for fishermen in Gwadar",
  "link": "https://www.app.com.pk/national/maritime-affairs-to-provide-2000-motor-boat-engines-for-fishermen-in-gwadar/",
  "date_published": "2022-06-08T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 8 (APP):Federal Minister for Maritime Affairs, Senator Faisal Ali Subzwari announced to provide 2000 motor boat engines worth Rs. 500 million along with a floating jetty with the cost Rs. 267million to fishermen in Gwadar by the end of this year.\nThe Minister Senator Faisal Ali Subzwari attended the World Ocean Day Event organized by the Ministry of Maritime Affairs as the Chief Guest in Karachi.\nMinistry of Maritime Affairs celebrated World Ocean Day by attending a consultative workshop organized by the World Bank (WB) on ‘Blue Economy Development Roadmap’ in collaboration with the Ministry on Wednesday in Karachi, said a press release here.\nThe Minister while speaking highlighted the Development of Blue Economy (BE) Policy and roadmap as a special agenda of the Ministry of Maritime Affairs and appreciated the efforts of World Bank for conducting a detailed study on Blue Economy that will surely be beneficial for policy making in future.\nWhile addressing, he stated that the purpose of the event is to create awareness in the people of Pakistan about the potential of our ocean as an important asset for sustainable economic growth as well as to take collective action to advance the sustainable utilization of our ocean.\nThe Minister announced that “For the people of Gwadar, we have promised some 2000 fisherman to provide them motor boat engines for Rs. 500m for effective fishing.\nWe are also going to provide them a floating jetty with the cost of Rs. 267m by the end of this year.”\nThe Minister also stressed on the need of sector like Blue Economy to get more explored and also assured that in future, Blue economy Development would be a special agenda of the Ministry.\nFurthermore, he assured working in close coordination with the Government of Sindh to address the issues related to fisheries and maritime sector development.\nAdditional Secretary Maritime Affairs, Mr. Asad Rafi Chandna also stressed on taking urgent and immediate actions in reducing marine pollution, increasing sea food exports, and enhancing coastal tourism to flourish the blue economy of Pakistan.\nThe Chairman Karachi Port Trust (KPT), Mr. Syedain Raza Zaidi, Chairman Port Qasim Authority (PQA), Rear Admiral (R) Syed Hasan Nasir Shah HI(M), Chairman Pakistan National Shipping Corporation (PNSC), Mr. Rizwan Ahmed, MD KoHFA, Principal Officer Mercantile Marine Department (MMD), Pakistan Marine Academy (PMA), GM Ops KPT – Rear Admiral Zubair Shafique, GM Tech KPT – Rear Admiral Shahid, DG Port Qasim – R Adm Javed Iqbal, GM Engineering KPT – R Admiral Shahid, Country Director World Bank, and other respectable participants also graced the occasion with their presence.",
  "retrievedAt": "2025-08-11T15:03:09.821Z"
}
