{
  "title": "PM fulfilled promise of flour at Rs 40/kg with people of KPK: Marriyum",
  "link": "https://www.app.com.pk/national/pm-fulfilled-promise-of-flour-at-rs-40-kg-with-people-of-kpk-marriyum/",
  "date_published": "2022-06-08T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Prime Minister Shehbaz Sharif has fulfilled his promise of providing flour at discounted price to the people of Khyber Pukhtunkwa with the commodity being supplied at Rs 40 per kg.\nSharing the details of this initiative, Federal Minister Information and Broadcasting Marriyum Aurangzeb said the provision of flour at discounted price to the people of Khyber Pakhtunkhwa would be ensured at the PM’s signature ‘Shehbaz Speed’.\nShe said the supply of flour at Rs 40 per kg had already started in Khyber Pakhtunkhwa. For expedient and effective realization of the PM’s initiative for the people of Khyber Pakhtunkhwa, 100 Mobile Stores had been launched, she said.\nThe province had been divided into two zones vis-à-vis Abbottabad and Peshawar zone for this purpose. This systematic supply of flour at discounted price would be gradually extended to the entire Khyber Pakhtunkhwa province, she assured.\nThe minister said that so far more than 50,000 bags of flour had been sold in Abbottabad and Peshawar zones in line with PM Shehbaz’s initiative. Flour at discounted price was being provided through separate mobile stores in Abbottabad and Peshawar zones, she added.\nShe said that in Abbotabad alone 22,070 flour bags at the discounted price of Rs 40 per kg were sold over the last two days. Meanwhile, more than 23,400 bags were sold to the people in the Peshawar zone during the same time.\nThe minister said that the number of mobile stores would be increased to 200 by June 13, so that more people of Khyber Pakhtunkhwa could benefit from the Rs 40 per kg flour.\nIn addition to this, temporary flour selling points in Khyber Pakhtunkhwa would also be operational by June 9, and by June 17 they would increase to 500, to further facilitate the process.\nMarriyum said, in line with the vision and promise by PM Shehbaz, there would more than 2000 selling points in KPK province at 993 locations where people would be able to buy flour at the discounted price.\nShe said that the prime minister had fulfilled his promise with the brave people of Khyber Pakhtunkhwa, who had suffered under an incompetent regime for 8 years that had stalled welfare and progress in their province.\nShe pledged that PM Shehbaz would continue to take more of such initiatives for the welfare and betterment for the people of KPK.",
  "retrievedAt": "2025-08-11T15:03:01.058Z"
}
