{
  "title": "PM vows to strengthen Pakistan-UK trade, investment ties",
  "link": "https://www.app.com.pk/national/pm-vows-to-strengthen-pakistan-uk-trade-investment-ties/",
  "date_published": "2022-06-08T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 8 (APP): Prime Minister Muhammad Shehbaz Sharif Wednesday expressed his government’s resolve to further strengthen Pakistan-UK bilateral relations in diverse fields especially in the areas of trade and investment.\nSpeaking as chief guest at the 75th Coronation Ceremony of Queen Elizabeth here at British High Commission, he referred to his recent telephonic conversation with British Prime Minister Boris Johnson on strengthening trade and economic cooperation and said, “We are expecting a trade delegation from UK very soon.”\nThe Prime Minister on this occasion also appreciated the role of British High Commission in bringing the people of Pakistan and UK closer, adding, his government will support the High Commission to translate friendly relationship into strong trade and investment ties, which was call of the day.\nShehbaz Sharif recalled with appreciation of the UK’s contribution of 600 million pounds for Pakistan during his stint as Punjab Chief Minister in the areas of primary education, mother and child healthcare as well as skill development.\nThe Prime Minister extended warm felicitations to UK on behalf of the government and people of Pakistan as well as on his behalf over the 75th Coronation of Her Majesty Queen Elizabeth and wished the Queen a happy, healthy and long life.\nHe said that since the people of Pakistan have special affection for the royal family, they always extended warm welcome to the members of royal family whenever they visited Pakistan.\nThe Prime Minister said that 75th coronation of Queen Elizabeth also coincided with the platinum independence ceremonies of Pakistan as well as 75th anniversary of Pakistan-UK diplomatic and friendship relations.\nBritish High Commissioner Christian Turner in his remarks on the occasion highlighted the close bilateral relationship between Pakistan and UK and vowed to make efforts to further strengthen the historic ties.\nThe Prime Minister on this occasion also cut a special cake to mark the event, which besides the members of cabinet and parliamentarians was also attended by diplomats, civil and military officers, media-persons and others.",
  "retrievedAt": "2025-08-11T15:02:54.363Z"
}
