{
  "title": "Climate Change Ministry identifies forest risk areas, directs provinces to replicate: Sherry",
  "link": "https://www.app.com.pk/national/climate-change-ministry-identifies-forest-risk-areas-directs-provinces-to-replicate-sherry/",
  "date_published": "2022-06-08T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said the Ministry of Climate Change’s task force has identified forest risk areas to ensure strict vigilance and monitoring of high risk regions and directed the provinces to replicate the system rolled out during the meeting.\nAddressing a media briefing here flanked by Additional Secretary MoCC Jodat Ayaz and IG Forest MoCC Raja Mohammad Omar, she said the task force report on forest risk areas identified was shared with the prime minister.\nShe said, “Every province will have to mark low to high risk areas for strategic deployment of resources to contain ravaging forest fires.”\nThe Minister added that every province would have to mark low to high risk areas for strategic deployment of resources during forest fires where the high risk areas to be monitored daily and Balochistan was especially apprised on the process.\nThe relevant forest departments of the provinces would form vigilance teams to be formed as per the directions of the ministry, she said, adding, latest drones would be used for vigilance of high risk areas.\nEarlier, a video of federal Minister highlighting environmental degradation impacts and challenges faced by the country including pollution, global warming and degradation of natural resources was showed to media men prior to media briefing.\nSenator Sherry Rehman said the video was shared to media men for spreading the word with the nation and masses to take responsibility for protecting environment as masses and policy makers had to work hand in hand.\n“It’s the matter of responsibility and a journey of conservation where media is a tool of communication and an effective source of public mobilization. No region can change its shape without bringing change among it’s people”, she said.\nShe said the world in general was facing environmental degradation and Pakistan in particular.\n“We (MoCC) created a task force at the ministry and did stock taking of forest fires and Indus river that feeds 90% of our agriculture,” she informed.\nShe added that it was a long process for conservation of Indus River and the project concept was shared with the provinces for their feedback and input.\nWithout provinces participation the issue could become a serious problem, she underlined.\n“Not only in Margallas there are repeated fires it almost in all other areas like Murree, Kahuta and yesterday it occured near NUST and also in other areas. Despite extinguishing efforts forest fires have become a nuisance for us”, she added.\nShe informed that three fires were again reported in Margalla hills, where two of them were contained and one was to be put out as fire fighting operation was underway.\n“I request the masses to remove garbage and dry twigs that become source of forest fire during searing heat. Fire in Sherani forests kept blazing for ten days and we had to called a tanker aircraft from Iran to extinguish it”, she said.\nShe also appreciated the fire fighters who were facing serious fires with limited equipment and resources in very hard terrain areas. “We will have to tribute and salute the fire fighters for their efforts,” she added.\nShe also thanked the IWMB fire fighters, and Capital Development Authority (CDA) control room that helped reduce damage of life and property during repeated forest fires.\nThe Minister added that the fire season has remained a huge challenge for all of us and citizens would have to take care while going on trails.\nShe informed that during her participation at the Stockholm+50 Conference in Sweden she made huge climate diplomacy at global forums.\n“It’s not the issue of one ministry rather everyone. We discussed with the relevant ministries to devise strategy to preserve water reserves and hazards of heatwaves during next year. The Health Ministry including the provincial ministries made huge cooperation with MoCC.\nThe in time installation of heatwave centers in Punjab and Sindh helped control life losses,” she mentioned.\nThe Minister highlighted that California despite waste technological and human advancement was facing drought. “It is an example for us that we will have to keep our house in order to address climate crisis”.\nShe also added that the masses had to limit pollution particularly plastic pollution asMargalla Hills National Park have to use half of the resources to put out fire and remaining for waste management.\nShe urged the masses to use social media to highlight perpetrators of forest fires as strict penalties would be levelled on the culprits.\n“People must report even on Twitter to report individuals igniting forest fires and action will be taken against them”.\nArmy and provincial disaster management authorities (PDMAs) resources deployed where required across the country to contain forest fires, she added.\nShe insisted that the counter fire on short notice was a major challenge where all citizens should highlight garbage burning as a crime in forest fire risk areas.\n“If citizens will preserve water and control garbage burning then it will help us overcome issues.”\nThe Minister told that the MoCC was making adaptation measures and working out policy on plastic bags.\n“In 2050, plastics will be more than aquatic life in oceans. We need to think what kind of country we are going to give to our next generations”, she said.\nShe added that water scarcity would be a major issue and the nation should also think on water conservation.\n“We will send the summary of climate change council which is part of our law that never met for the past many years and will be convened.\nIt will take six months as internationally it takes time for such framework’s establishment.”\nResponding various media queries, she said there was full participation of all provinces in the task force meeting.\n“All provincial departments responded to heatwave call. We saw the cooperation of the provinces certain and forthcoming\nShe told the media that the Ministry would focus the next three months on Indus River preservation and forest fires prevention.\n“Recharge Indus will be made a movement not only project to protect the ancient river from pollution and degradation”.\nTo another query, she said it was not arson case everywhere and done intentionally by people in various forest fire incidents.\n“We have made strict SOPs as climate disasters have abrupt impacts but it’s mitigation is a long term process”.\nAll provinces have changed forest laws to increase penalties for arson whereas forest fires were considered as disasters that amplified the administration response towards the incident, she added.\nThe UN has clearly stated that fifty percent forest fire all over the world are due to climate change, the Minister said.\nShe warned that heatwaves would occur next year and the country’s preparedness should be better.\nShe said the country pledged at international climate conferences without any ground work.\n“It will cost US$101 billion for energy transition to renewable or clean sources as per global pledge of 50% but we will start working on it despite this huge cost”, she concluded.\nThe Minister later visited the Islamabad Wildlife Management Board office to meet the forest guards and laid their efforts in extinguishing forest fires in hard and inaccessible areas with limited resources.",
  "retrievedAt": "2025-08-11T15:02:57.664Z"
}
