{
  "title": "NA passes Assembly Secretariat Employees amended bill, 2022",
  "link": "https://www.app.com.pk/national/na-passes-assembly-secretariat-employees-amended-bill-2022/",
  "date_published": "2022-06-08T17:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP):The lower house on Wednesday passed the National Assembly Secretariat Employees (Amendment) Bill, 2022, allowing the speaker to make appointments through open advertisement, after a selection process on the recommendations of the Departmental Selection Committee.\n  \nThe bill moved by Mehmood Bashir Virk says that the National Assembly is a constitutional body established under the Article 87 of the Constitution of Islamic Republic of Pakistan, which provides that the Majlis-e-Shoora (Parliament) may by law regulate the recruitment and the conditions of service of persons appointed to the Secretariat staff of either House.\nTo regulate the recruitment and condition of persons appointed in the National Assembly Secretariat Employees Act, 2018 was passed by the Majlis-e-Shoora which came into force on February 28, 2018 after the assent of the President thereon.\nAccording to the section 6 on the National Assembly Secretariat Employees\nAct, 2018, initial appointment to the post of BPS 16 to BPS 19 in the\nNational Assembly Secretariat was to be made by the Speaker on recommendations of the Federal Public Service Commission.\nHowever it has been observed that sometimes the FPSC cannot complete the\nselection process due to various reasons within six months of the\nrequisition of the Secretarial for appointment on posts of BPS 16-19.\nTherefore, it is imperative that provision may be made in the National Assembly Employees Act, 2018 that in case of inability of the FPSC to recommend persons for initial appointments to the posts in BPS 16 to BPS 19 within six months of the receipt of the requisition, the speaker may withdraw the requisition form the FPSC and make\nappointments against such posts through an open advertisement and\nafter a selection process on the recommendation of the Departmental Selection Committee.\nAmendment of Section 6, Act VII of 2018 say: “ Provided that in case of inability of the FPSC to recommend persons for initial appointment to the Posts in BPS-16 to BPS-19 on the requisition of the National Assembly Secretariat for such appointments within six months of receipt of the requisition, the Speaker may withdraw the requisition from the FPSC and make appointments against such posts through an open advertisement and after a selection process on the commendations of the Departmental Selection Committee.”\nAPP/ szm-muk",
  "retrievedAt": "2025-08-11T15:03:09.650Z"
}
