{
  "title": "Cooperation of WB in development of various sectors in Pakistan commendable: Sadiq Sanjrani",
  "link": "https://www.app.com.pk/national/cooperation-of-wb-in-development-of-various-sectors-in-pakistan-commendable-sadiq-sanjrani/",
  "date_published": "2022-06-08T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP): Chairman Senate Muhammad Sadiq Sanjrani on Wednesday appreciated the cooperation extended by the World Bank in the development of various sectors in Pakistan.\n“The World Bank will continue to support Parliament and the Government of Pakistan in institutional reforms for governance and service delivery” he said during a meeting with World Bank Country Director in Pakistan, Najy Benhassin who called him in his chamber.\nDuring the meeting, ongoing schemes and initiatives in the areas of energy, education, health and development were discussed during the meeting.\nBoth sides also discussed multiple ongoing projects in Pakistan in collaboration with the World Bank.\nThe World Bank Country Director while lauding Pakistan’s efforts for revival of the economy and development sector yearned that Pakistan will vanquish the prevailing economic and energy crisis and high inflation soon.\nThe Chairman Senate maintained that steps are being taken by formulating concrete policies for economic recovery and stability.\n“As representatives of the people, the parliamentarians have the responsibility in enhancing global health, tackle infectious diseases and drivers of ill-health, and achieve the Sustainable Development Goals. The World Bank and Parliaments can engage the governments to formulate joint frameworks for development which will then help legislatures in oversight and increase the efficacy of aid”, he stressed.\nIt was proposed that the World Bank can play a very important role to build the human capital and unleash the potential of the youth population of the country through technical and financial assistance.\nThe visiting dignitary underlined that the World Bank will continue to assist Pakistan in tackling the challenges it faces including sustainable development and overcoming the energy crisis.",
  "retrievedAt": "2025-08-11T15:02:58.686Z"
}
