{
  "title": "PUC to hold peaceful protests against blasphemy on Friday: Ashrafi",
  "link": "https://www.app.com.pk/national/puc-to-hold-peaceful-protests-against-blasphemy-on-friday-ashrafi/",
  "date_published": "2022-06-08T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 08 (APP):Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Tahir Mehmood Ashrafi on Wednesday said Ulema and Mashaikh of various schools of thought would mark ‘Youm-e-Hurmat-e-Rasool’ (SAW) across the country on Friday under the leadership of Pakistan Ulema Council (PUC).\nAddressing a presser along with other religious scholars, he said the faithful would hold peaceful and organized protests against the blasphemous comments of India’s ruling party leaders.\nTahir Ashrafi who is also the PUC chairman said, in Friday congregations, they would deliver sermons on the sanctity of the Holy Prophet (PBUH).\nOn this occasion, resolutions would be adopted against the perpetrators of blasphemy, he added.\nHe appealed the Muslims of the Islamic world to boycott Indian products like the Middle East countries.\nHe said the Organization of Islamic Cooperation (OIC) and the United Nations Organization (UNO) should take strong action against India for its persistent atrocities against minorities and the blasphemous comments about sanctity of the Holy Prophet (PBUH).\nHe urged the government to take up the blasphemy case at the platforms of OIC and the UNO.\nHe said reactions from the entire Islamic world including Saudi Arabia, Qatar, Kuwait, Jordan, Oman, Iran and Turkey was commendable on the blasphemous issue.\nTahir Ashrafi also announced that the PUC would hold a seminar on ‘Hurmat-e-Rasool’ in the federal capital next week in which eminent leaders of Islamic world would address.\nIn this regard, the PUC leadership was making coordination with Dr Muhammad bin Abdul Kareem Al Issa, Secretary General of Muslim World League, Mufti-e-Azam Saudi Arabia, Sheikh Al Azhar, Mufti-e-Azam of Oman, Mufti-e-Azam Egypt, Mufti-e-Azam United Arab Emirates and leadership of Muslims and other religions in the United States of America, United Kingdom, Europe and Turkey.",
  "retrievedAt": "2025-08-11T15:02:54.373Z"
}
