{
  "title": "625 new coronavirus cases reported; 14 deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/625-new-coronavirus-cases-reported-14-deaths-in-past-24-hours/",
  "date_published": "2020-10-20T07:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): The total active COVID-19 cases in Pakistan on Tuesday were recorded 9,461 as 625 more people tested positive for the deadly virus during the last 24 hours.\n14 corona patients, 12 of whom were under treatment in hospital and two out of hospital died on Monday, according to the latest update issued by the National command and Operation Centre (NCOC).\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK) and Balochistan, while 80 ventilators elsewhere in Pakistan, out of 1,884 allocated for COVID-19 patients, were occupied.\nSome 26,211 tests were conducted across the country on Monday, including 8,182 in Sindh, 8,623 in Punjab, 3,938 in Khyber Pakhtunkhwa (KP), 3,697 in Islamabad Capital Territory (ICT), 922 in Balochistan, 428 in Gilgit Baltistan (GB), and 421 in Azad Jammu and Kashmir (AJK).\nAround 307,950 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 324,084 cases were detected so far, including AJK 3,507, Balochistan 15,704, GB 4,084, ICT 18,187, KP 38,708, Punjab 101,760 and Sindh 142,134.\nAbout 6,673 deaths were recorded in country since the eruption of the contagion, including 2,583 Sindh among one of them died in hospital and one out of hospital on Monday, 2,310 in Punjab among 11of them in hospital and one out of hospital on Monday, 1265 in KP, 195 in ICT, 148 in Balochistan, 90 in GB and 82 in AJK.\nA total of 4,122,069 corona tests have been conducted so far, while 735 hospitals are equipped with COVID facilities. Some 805 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T19:55:29.805Z"
}
