{
  "title": "Pakistan to raise migrated Hindu family murder issue at all fora: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-to-raise-migrated-hindu-family-murder-issue-at-all-fora-qureshi/",
  "date_published": "2020-10-20T16:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP):Minister for Foreign Affairs Shah Mehmood Qureshi on Tuesday assured that the government would raise the issue of murders of a migrated Pakistani Hindu family members in India at all major international forums.\nReplying to a calling attention notice of Jamaat-e-Islami’s Mushtaq Ahmed in the Senate, the minister said they would contact the international human rights organizations to apprise them of the reservations of Hindu community in Pakistan regarding the murders.\nPakistan had the right to know the circumstances in which its nationals had died in India, and the government would continue pursuing New Delhi to inform about the facts about the incident without further delay, he added.\nQureshi said the government was fully cognizant of the concerns of civil society and political parties over the matter. Soon after the the incident, Pakistan’s High Commission in New Delhi, he said, had asked the Indian government to give it access to the only surviving member of the victim family, copies of the first information report, initial investigation report and post-mortem details of the deceased persons.\nThe Indian authorities, he said, did not provide any substantive details regarding the cause and circumstances of the deaths. They still continued to evade the issue, Qureshi added.\nThe minister said the Indian government wanted to use the family for spying against Pakistan. The Hindu family members’ murder had exposed the so-called ‘safe India narrative’, which was in fact an unsafe country, he added.\nQureshi said a petition had been filed in the Islamabad High Court, which had given two weeks time to the government for sharing the details.\nHe said Pakistan had been re-elected to the United Nations Human Rights Council (HRC) with an overwhelming majority. The issue could also be raised at that forum. The Government of Pakistan would approach all the relevant fora, he added.\nHe said Shrimati Mukhi, the daughter of the deceased head of the 12-member victim family, had filed the first information report. Pakistan had sought consular access to the only surviving member of the Bheel family, he added.\nThe minister said a large number of Hindu community members under the auspices of Pakistan Hindu Council staged a protest in Islamabad against deaths of the migrant family in India.",
  "retrievedAt": "2025-08-11T19:55:24.427Z"
}
