{
  "title": "Four in 10 children are stunted in Pakistan: Nutrition survey",
  "link": "https://www.app.com.pk/national/four-in-10-children-are-stunted-in-pakistan-nutrition-survey/",
  "date_published": "2020-10-20T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP):A new National Nutrition Survey (NNS) launched on Tuesday claimed that four out of 10 children under the age of five years are stunted in Pakistan.\nThe current survey shows four percent decrease since the last survey conducted in 2011, and that nearly two out of every 10 children under five also suffer from wasting.\nAddressing the launching ceremony, Dr Faisal Sultan, Special Assistant to Prime Minister on National Health Services, Regulations and Coordination said that malnutrition in Pakistan remains high at the fore front of government’s agenda.\nHe said that on the directions of the Prime Minister, the ministry is endlessly engaged in efforts to address the issue of malnutrition.\nHe highlighted the importance of cascading high level commitments into policies that benefit the masses.\nOn PM’s special directives, the ministry is leading in inter-sectoral coordination and advocacy as well as policy and planning for nutrition in the country.\nFor this purpose, a Nutrition Advisory Group has also been constituted which would provide technical oversight and guidance on nutrition policy and programming, he added.\nHe said that the findings of the nutrition survey are very concerning for the government. Women and children in the country are far below the acceptable levels of nutrition and this alarming situation requires urgent attention.\nHe said “For actionable plans and progress towards SDGs, food security, and ending malnutrition, we have to develop district-specific and region-specific strategies.”\nHe said “With a data set as comprehensive as NNS 2018, we are on the right track.\nIndividuals and institutions partnerships on a micro and macro level will bear the fruits we have been striving for since decades.”\nDr Baseer Achakzai, Director Nutrition Programme, Ministry of National Health Services highlighting the findings of survey said that the NNS assesses the nutrition status of 115,500 households across Pakistan, the largest ever nutrition survey conducted in the country.\nNearly 13 per cent of children between the ages of two and five years suffer from some form of functional disability.\nThe survey points out that one in every eight adolescent girls and one in every five adolescent boys are underweight while over half of the adolescent girls in Pakistan are anemic.\nWomen of reproductive age in Pakistan also bear a triple burden of malnutrition as 14 percent are undernourished, which reflects an improvement compared to 18 per cent in 2011.\nOverweight and obesity has increased from 28% in 2011 to 38% in 2018.\nHe added that National Nutrition Survey is funded by the UK government with technical support from UNICEF, which is carried by Agha Khan University and led by Ministry of National Health Services.\nThe Deputy Director Development British High Commission, Jim Carpy said “United Kingdom is proud to support this very important initiative to assess the nutritional needs in Pakistan.”\n“The results of this survey will help us in tackling the issue of malnutrition by targeting those most affected, including children under five, adolescent girls and pregnant women.”\nHe highlighted that United Kingdom will continue to work closely with Pakistan to improve maternal and child health, end preventable deaths and ensuring adequate nutrition for all.\nAida Girma, UNICEF Representative in Pakistan said that the National Nutrition Survey 2018 is a wake-up call to a clear and present emergency.\nThe country confronts a triple burden of malnutrition affecting young children, adolescents, pregnant and lactating women.\nA clear indication that nutrition in Pakistan requires high level attention and adequate funding to reduce mortality due to malnutrition and to ensure that every child reaches full development potential in life.\nStrengthening the health system to deliver preventative and curative nutrition services at scale is imperative.\nUNICEF will continue to work with the government of Pakistan in its efforts to end all forms of malnutrition in the country, she added.\nProf Zulfiqar Ali Bhutta Founding Director of Centre of Excellence in Women and Child Health, Agha Khan University said that Pakistan faces massive challenges in maternal and child nutrition is no longer news.\nAfter 2010 floods and the National Nutrition Survey 2011, effective actions on many of issues like childhood stunting, wasting and widespread micro-nutrient deficiencies were lacked.\nThe devolution of health services and programs to the provinces in 2011 also led to a period of review and recalibration, followed by the movement to develop multi-sectoral plans and initiatives to address under nutrition and its determinants.\nDr. Malik Safi, DG Health expressed the hope that the information gathered in this survey would be properly and effectively utilized for decision making, planning, and implementation of nutrition interventions in the country.",
  "retrievedAt": "2025-08-11T19:55:24.425Z"
}
