{
  "article_id": "2025-03-06_ed9cfc72c792e94d24a36e39f7755f3b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/icgeb-announces-research-grants-2025-for-scientists-in-member-states/",
    "retrieved_at": "2025-08-27T13:24:24.029Z"
  },
  "metadata": {
    "title": "ICGEB announces Research Grants 2025 for scientists in member states",
    "author": null,
    "date_published": "2025-03-06T11:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 253,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 06 (APP):The International Centre for Genetic Engineering and Biotechnology (ICGEB) has invited applications for its Research Grants 2025 under the Collaborative Research Programme (CRP), aimed at supporting cutting-edge scientific projects in its member states, including Pakistan. The initiative seeks to promote collaborative research in basic life sciences, human healthcare, industrial and agricultural biotechnology, and bio-energy, fostering international scientific partnerships and capacity building. According to ICGEB, the programme offers grants ranging between 25,000 to 50,000 per year for up to three years, covering expenses for laboratory equipment, consumables, training, and travel. The grant aims to strengthen scientific cooperation, particularly in developing countries, while addressing global challenges like climate change, public health, and sustainable development. A special category, Early Career Return Grants, will fund young scientists who have spent at least two years abroad and recently returned to their home country to establish an independent research laboratory. This initiative aims to encourage the brain gain phenomenon by supporting young researchers. The ICGEB Research Grants offer a unique opportunity for Pakistani researchers to collaborate on global scientific challenges, particularly in areas of biotechnology, healthcare, and renewable energy. Young researchers returning from abroad can play a crucial role in strengthening the country's research landscape. ICGEB encourages women scientists to apply, while proposals focusing on socio-economic impact and sustainable development will be given priority. The last date for online submission is April 30 and selected projects will be announced by the end of the year. The researchers can submit applications through the ICGEB portal at www.icgeb.org.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}