{
  "article_id": "2025-03-06_b8c16bfa20a77101500e030cdfae20dd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/coas-visits-bannu-cantonment/",
    "retrieved_at": "2025-08-27T13:23:47.541Z"
  },
  "metadata": {
    "title": "COAS visits Bannu cantonment",
    "author": null,
    "date_published": "2025-03-06T15:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 355,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Mar 06 (APP): Chief of Army Staff (COAS) General Syed Asim Munir visited Bannu on Thursday, following the foiled terrorist attack on Bannu Cantonment by Khwarij on 4 March 2025. During the visit, the COAS was briefed on ongoing operations and the overall security situation of the area, said an ISPR news release. He also visited Combined Military Hospital (CMH) Bannu to inquire about the health and well-being of the injured soldiers, acknowledging their resilience and unwavering dedication. The COAS commended the high morale and steadfast resolve of the troops, reaffirming that Pakistan Army would continue to serve as a bulwark against terrorism to ensure the security and stability of the state. The COAS expressed profound condolences to the families of innocent civilians who lost their lives in this henious and cowardly terrorist incident. He also assured that while the perpetrators of the incident were neutralized instantly by the valiant soldiers, however, the planners and facilitators of the dastardly attack would also be brought to justice soon, wherever they may be. He underscored that the barbaric targeting of civilians including children, women and the elderly exposed the true intentions of Khwarij as enemies of Islam. Emphasizing the pivotal role of the local community, he reiterated that national unity is imperative in the fight against terrorism and assured that the Armed Forces would spare no effort in ensuring the safety and security of the people of Pakistan. While addressing the troops, the COAS lauded their heroic actions, recognizing their swift and decisive response in neutralizing the attackers and thwarting their nefarious designs. He further stated that the fight against Khwarij and their facilitators, acting on the behest of hostile elements, would continue until its logical conclusion. The COAS highlighted that terrorist groups, including Fitna Al-Khawarij, continued to operate from Afghan soil against Pakistan. He underscored that the use of foreign weapons and equipment in recent terrorist attacks was clear evidence that Afghanistan remained a safe haven for such elements. He reaffirmed that no entity would be allowed to disrupt Pakistan's peace and stability. Earlier upon his arrival, the COAS was received by Corps Commander Peshawar",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}