{
  "title": "Govt to extend all-possible cooperation to AJK flood victims: Kaira",
  "link": "https://www.app.com.pk/national/govt-to-extend-all-possible-cooperation-to-ajk-flood-victims-kaira/",
  "date_published": "2022-08-03T15:46:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD Aug 3 (APP): Advisor to the Prime Minister on Kashmir and Gilgit-Baltistan Affairs Qamar Zaman Kaira on Wednesday said the federal government was ready to extend all possible cooperation to the Azad Jammu and Kashmir (AJK) government to help the flood victims.\n“Quick and easy payment of relief funds to the victims will be ensured and all-out efforts will be made to protect the people,” he said during a one-day visit to Muzaffarabad after a briefing given by State Disaster Management Authority (SDMA) about damages and measures taken for mitigating floods due to monsoon rains.\nKaira said climate change had become a potent challenge to the world including Pakistan and the government was ready for all kind of cooperation to prevent losses caused by floods.\nThe Ministry of Kashmir Affairs would provide all possible cooperation to AJK government in this regard, he said, adding that the ministry had also been working to allocate to separate budget for relief assistance to flood affectees.\nKaira said the AJK government should inform the center of its needs to combat climate change as the prime minister had given special directives to ensure immediate response in this regard.\n“All-out efforts will be made to protect the Kashmiri brethren. There is a need to devise an early warning system to predict natural disasters so that timely measures can be taken.”\nOn the occasion, Kaira also distributed relief cheques among flood victims. He also prayed for the military officers and soldiers who embraced martyrdom during relief operations.\nThe avisor also directed to complete the tender process for the construction of houses for Kashmiri refugees soon. “Settling Kashmiri refugees is the top priority of government and concrete steps are being taken to increase their living allowance. An all-party conference of AJK was called to formulate a plan of action on Kashmir issue,” he said.\nHe also praised the refugee brothers who gave a warm welcome to him even in these difficult conditions caused by floods.\nHe said the every Pakistani wanted to see Kashmir liberated from the occupied forces, and the whole nation was with them in their struggle for freedom.\n“Prime Minister Shehbaz Sharif has highlighted Kashmir issue at all international forums, while Foreign Minister Bilawal Bhutto Zardari has also been speaking extensively about it at every platform in the US, Europe, Asia, and elsewhere in the world,” he added.\nKaira, who inspected the rain-affected houses in the refugee camps, informed Kashmiri refugees that a total of three billion rupees had been provided for construction of 1,314 houses as their settlement was government’s first priority.\nHe said AJK called the all parties conference to formulate a plan of action on Kashmir issue and the latter was in regular contact with the federal government in this regard. “We will also consult retired judges, bar councils and AJK universities on the matter in question in the future.”\n“Steps are being taken to establish a Kashmir chair in all universities of Pakistan whereas the nation salutes Kashmiris for playing vital role in the struggle for creation of Pakistan,” he said.\nMeanwhile, SDMA briefed Kaira that a plan was prepared keeping in view the weather forcaste for above-normal-rains expected in some areas of the state.\nIt was informed that about 16,000 families in AJK were facing threats due to flood situation and landslides. As many as 33 houses were affected in the refugee camp, while livestock was also damaged in the Neelum Valley due to storm on June 16.\nBesides, 10 people were martyred due to roof collapse in Poonch, while a total of 25 people died due to inclement weather conditions and 217 houses were destroyed in AJK.\nمشیربرائے امور کشمیر و گلگت بلتستان قمر زمان کائرہ سے چیف سیکریٹری آزاد کشمیر محمد عثمان چاچڑ کی ملاقاتملاقات میں آزاد کشمیر میں حالیہ بارشوں سے سیلابی صورتحال پر تبادلہ خیالمقامی آبادی کی حفاظت کے لیے اٹھائے گئے اقدامات پر بھی غور@QamarKairaPPP pic.twitter.com/Bfsv3fnvcZ\nMeanwhile, Chief Secretary AJK Muhammad Usman Chachar met with the PM aide and briefed him about the flood situation in AJK and measures taken to protect the local population.",
  "retrievedAt": "2025-08-11T15:20:12.199Z"
}
