{
  "title": "India’s unilateral action of Aug. 5 unconstitutional, against UN resolutions: Raja Parvaiz Ashraf",
  "link": "https://www.app.com.pk/national/indias-unilateral-action-of-aug-5-unconstitutional-against-un-resolutions-raja-parvaiz-ashraf/",
  "date_published": "2022-08-03T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): National Assembly (NA) Speaker Raja Pervaiz Ashraf on Wednesday said the Indian government’s unilateral action of August 5, in Indian Illegally Occupied Jammu and Kashmir (IIOJK) was unconstitutional and against the United Nations (UN) resolutions.\nTalking to APP regarding ‘Youm e Ishtehsal’ to be marked on August 5, he said the international community should break the silence for the rights of Kashmiris and play its role in resolving the Kashmir conflict according to the UN resolutions.\nThe NA Speaker said the unilateral move of the Indian government to end the special status of Kashmir on August 5, 2019 was unconstitutional and against the UN resolutions. Contrary to UN resolutions, Kashmir was an unfinished agenda of the subcontinent’s division, he added.\nThe UN and international community should play their role to resolve the Kashmir issue, he said adding the Indian forces were treating innocent people of the occupied Kashmir inhumanly and the way India had exploited the Kashmiris due rights by depriving them of their right to self-determination was beyond the condemnation.\nHe said more than 900,000 Indian troops were inflicting atrocities on Kashmiris and they were being kidnapped so that a large number of them were going missing.\nHe said the government of Pakistan had always supported the Kashmiri brothers and sisters and would continue their support till the day they received freedom from the Indian clutches.\nHe asked the Indian government to consider the human rights of Kashmiris and their personal freedom, feelings and emotions and withdraw its unconstitutional move of August 5, 2019, designed to change the geographical status of Kashmir.\nHe said the Kashmir’s freedom movement was not going to fade as Kashmiris yearning for freedom was growing with every passing day.",
  "retrievedAt": "2025-08-11T15:20:04.107Z"
}
