{
  "title": "APHC calls for complete shutdown in IIOJK on Youm-e-Istehsal",
  "link": "https://www.app.com.pk/national/aphc-calls-for-complete-shutdown-in-iiojk-on-youm-e-istehsal/",
  "date_published": "2022-08-03T14:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): In Indian Illegally Occupied Jammu and Kashmir (IIOJK), the All Parties Hurriyat Conference (APHC) while reiterating its call for a complete shutdown, civil curfew and large-scale protest demonstrations on August 5, the Youm-e-Istehsal, appealed to the people to offer special prayers for the success of the ongoing freedom movement.\nAccording to Kashmir Media Service (KMS), the incarcerated APHC Vice Chairman, Ghulam Ahmad Gulzar, in a special message from Srinagar Central Jail said that August 5 is one of the most tragic, painful and darkest days of Kashmir history and the Kashmiris will always observe it as Youm-e-Istehsal.\nIt was on August 5 in 2019 when RSS-backed fascist government led by killer of humanity Narendra Modi usurped political, social, religious and all other basic rights of Kashmiris, turned IIOJK into a big open-air prison, he added. He termed the August 5 action as AN attack on Kashmir’s unique identity, culture, demography and fundamental rights by Hindutva forces.\nThe APHC leader deplored that the RSS-backed Modi government was hell-bent on turning Jammu and Kashmir into a graveyard and wasteland for imposition of its devil Hindutva ideology. He said the Hindutva forces have started the settler-colonial project by bringing administrative changes in the disputed region which started with the introduction of new domicile law.\nAPHC General Secretary, Molvi Bashir Ahmad Irfani in a statement in Srinagar that slavery is a curse and Kashmiris will prefer martyrdom over Hindutva slavery. He maintained Kashmir is an internationally recognized disputed territory and scrapping its special status is not only a violation of the United Nations resolutions on Kashmir but also a blatant violation of international law.\nMolvi Bashir Irfani said that the motive behind abrogation of Articles 370 and 35-A was to change the demography of the territory and turn it into a Hindu state. He said that abolition of special status was followed by coercive administrative steps which include domiciles to thousands of Indian Hindus, amendment in land laws and setting up of soldiers’ colonies in the territory. These all steps are aimed at settling Hindus in Kashmir and turn Muslims into a minority, he added.\nGhulam Ahmad Gulzar and Molvi Bashir Irfani urged the Kashmiris all over the world to protest on 5th August against Indian aggression and promote freedom movement and expose Indian crimes in IIOJK. They also appealed to the Kashmiri diaspora to hold protest demonstrations on that day and draw the attention of the world towards the plight of oppressed people of IIOJK.\nThe Jammu and Kashmir Liberation Front (JKLF) spokesperson appealed to the people of Jammu Kashmir to observe August 5 as a Black Day.",
  "retrievedAt": "2025-08-11T15:20:12.974Z"
}
