{
  "title": "PM orders 24/7 monitoring of flood-hit areas, report by every 48 hours",
  "link": "https://www.app.com.pk/national/pm-orders-24-7-monitoring-of-flood-hit-areas-report-by-every-48-hours/",
  "date_published": "2022-08-03T08:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): Prime Minister Shehbaz Sharif ordered round-the-clock monitoring of rescue, relief, and rehabilitation measures in the flood-affected areas of Balochistan.\nHe also ordered an update regarding the relief and disbursement of funds to the flood victims through the submission of a report every 48 hours.\nThe prime minister instructed the relevant authorities to speed up the distribution of relief funds in Balochistan, especially in areas like Bolan, Quetta, Zhob, Dakki, Khuzdar, Kohlu, Kech, Mastung, Harnai, Qila Saifullah, and Sibbi.\nPM Sharif also directed to pace up the relief and rehabilitation work in the flood-affected areas of Sindh, Khyber Pukhtunkhwa, and Punjab.\nHe said the affected people were looking towards the government for mitigation of their sufferings and stressed that negligence in the supply of food, medicines, and accommodation would not be tolerated.\nHe emphasized extending a uniform level of facilitation to flood victims across the country.\nThe prime minister ordered to ensure proper cleaning, sanitation, and fumigation of the flood-hit areas to avert the spread of diseases including dengue.\nHe also directed the provision of clean drinking water to flood victims to control gastric diseases.\nA report by the authorities concerned informed the prime minister that the arrangement of food, medical camps, and shelter had been made in the flood-hit areas of Balochistan.\nThe report said that relief activities had been increased in collaboration with the provincial government of Balochistan, while work was in progress in other provinces with the cooperation of the respective provincial governments.",
  "retrievedAt": "2025-08-11T15:20:05.546Z"
}
