{
  "title": "EU’s ambassador to Pakistan calls on Minister Riaz Hussain Pirzada",
  "link": "https://www.app.com.pk/national/eus-ambassador-to-pakistan-calls-on-minister-riaz-hussain-pirzada/",
  "date_published": "2022-08-03T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Ambassador of the European Union to Pakistan Dr. Riina Kionka calls on Federal Minister for Human Rights Mian Riaz Hussain Pirzada as matters of mutual interest and cooperation were discussed in this meeting, said in a press release issued here on Wednesday\nThe minister welcomed the ambassador and said that Pakistan values its reciprocal relations with the EU that were moving in a positive direction in all spheres of cooperation.\nHe said the European Union, through its assistance, has played a vital role in the socio-economic uplift of Pakistan and they (government) expect that sectorial dialogues on emerging areas of cooperation, including environment, climate change, human rights and sustainable development will be strengthened through Strategic Engagement Plan (SEP) that was signed between Pakistan and the EU in June 2019.\nMinister said that the EU is one of the largest trade and investment partners of Pakistan.\nThe minister further credited the GSP Plus for playing an important role in expansion of trade.\n“We remain committed and have demonstrated consistent progress in the implementation of GSP Plus related 27 international conventions,” added the minister.\nHe further stated that Pakistan has seen the European Commission’s legislative proposal for preferential market access for post-2023.\nAmbassador of the European Union appreciated the coordinating role of the Ministry of Human Rights and its commitment for working on GSP + particularly the recent enactment of laws.\nShe also mentioned that monitoring mission had shown its satisfaction on Pakistan’s progress on implementation of 27 international conventions.\nAt the end, minister stressed upon the close coordination for effective compliance on GSP commitments. He assured the ambassador in extending maximum support from the forum of the Ministry of Human Rights for the EU delegation to arrange its meetings for further discussions on GSP+ in the Ministry of Interior and Commerce.",
  "retrievedAt": "2025-08-11T15:20:11.796Z"
}
