{
  "title": "Protecting supremacy of Parliament is constitutional responsibility of parliamentarians: Khawaja Asif",
  "link": "https://www.app.com.pk/national/protecting-supremacy-of-parliament-is-constitutional-responsibility-of-parliamentarians-khawaja-asif/",
  "date_published": "2022-08-03T10:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Defence Minister Khawaja Muhammad Asif on Tuesday said that Parliament is supreme institution and protecting the supremacy of the house is legislator’s constitutional responsibility.\nParticipating in debate in the National Assembly, he said that if the head of any institution was summoned in any of Parliamentary committees, he must appear.\nHe said that strengthening this institution is the responsibility of all, including the government and the opposition member of Parliament.\nKhawaja Asif said that we have to make the committees of this house effective, as these committees were actually an extension of this house.\nHe said that everyone should be accountable to the committees while recognizing the supremacy of the Parliament.\nHe said that if any institution head can appear in the Public Accounts Committee (PAC) meeting, so why can’t the NAB.\nHe said that PAC chairman has raised an important issue and this institution should stand behind the committee.\nHe said that the PAC was the most influential committee in the House. “If someone challenges chairman PAC in terms of his work, jurisdiction, we should bring him to the House who considers themselves as holy cows”, he added.\nHe proposed that a special parliamentary committee should be formed to investigate this matter.\nHe said that in 75 years, Parliament was the most targeted, sometimes it was the target of dictatorship and sometimes it was the target of 58-B.\nHe said that for the last 14 years, fortunately, there has been no accident with this institution of Parliament.\nThe minister said that PTI government in Khyber Pakhtunkhwa had closed accountability institution.\nHe said that accountability was carried out in all other provinces, why was it closed in KP and the institution was locked.\nHe said that previous day the claimant to run the country under the constitution was exposed by the constitutional institution for submitting a false affidavit.\nHe said that PTI chief Imran Khan kept receiving money from Israel and America.\nHe said that the United Kingdom’s National Crime Agency confiscated and sent Rs 50 billion of Bahria Town directly to the government, which was adjusted, against their liabilities. Property Tycoon gave land for Al-Qadir University as bribe. “We were jailed due to our affiliation with political party”, he added.",
  "retrievedAt": "2025-08-11T15:20:03.222Z"
}
