{
  "title": "A consortium of Pakistan China Research Centers proposed",
  "link": "https://www.app.com.pk/national/a-consortium-of-pakistan-china-research-centers-proposed/",
  "date_published": "2022-08-03T18:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP):A consortium of Pakistan-China Research Centers has been announced to build strong collaboration amongst the academic sector to promote Pakistan-China Education and Knowledge Corridor.\nThis consortium proposed to build collaboration in research projects and developing of further understanding in order to move China-Pakistan relations forward, said a press release.\nThis was proposed during the Webinar on “71 Years of China Pakistan Research and Development Cooperation: Way Forward” hosted by the Centre for BRI and China Studies-Institute of Peace and Diplomatic Studies- IPDS & Pakistan Research Center, Inner Mongolia Honder College of Arts and Sciences, China.\nIt was proposed that consortium members would be from China and Pakistan to prepare a roadmap for future research and knowledge collaboration.\nFarhat Asif, President IPDS said research and education development collaboration was important between China and Pakistan and this webinar is organised to review the research and development progress and build a way forward.\nProf. Tang Jun, Director, Pakistan Research Center, Inner Mongolia Honder College of Arts and Sciences, said that various joint research programs between China and Pakistan contribute to promoting collaboration on issues of mutual interests and there was a growing opportunity for both sides to share research and intellect in various fields.\nAmbassador of Pakistan to China, Moin Ul Haq, in his video message said Pakistan and China’s friendship was defined by resilience, trust, and active partnership. Ambassador has highlighted the role of research centers and think tanks in exploring the complex matrix of politics, economies, and socio-cultural areas of cooperation between Pakistan and China.\nProf. Dr. Manzoor Hussain Soomro, President, ECO Science Foundation, Vice President, Belt and Road International Science Education Consortium (BRISEC) said Pakistan and China may learn from each other’s experience and there were various avenues that can be explored between the two countries in exchange of knowledge and technology.\nIn the academic session Dr. Zhang Jiegen, Executive Director, Center for Pakistan Studies, Institute of International Studies, Fudan University, explained in depth dynamics of geostrategy, geoeconomic and geo security compulsion that are offering challenges and opportunities for both China and Pakistan.\nProf. Dr. Zahid Anwar, Pro Vice-Chancellor & Director, China Study Center, University of Peshawar mentioned various agreements between Research centers of China and Pakistan and said these are active agreements that are regular and robust.\nProf. Dr.Song Zhihui, Director, Pakistan Study Center, Sichuan University said that CPEC was an important milestone in China-Pakistan relations and both sides may work together to remove negative propaganda through robust media research and cooperation.\nDr. Chen Ruihua, Director, China-Pakistan Economic Corridor (CPEC) Research Center, Kashi University, said Afghanistan and Central Asian states must also be incorporated into the CPEC project as they play a crucial role in integrating the region.\nDr. Tahir Mumtaz Awan, Head of China Study Center, COMSATS University, Islamabad, said study institutes were essential to bridging relations between China and Pakistan for research and development cooperation.\nProf. Jin Qiang, Assistant Director, Intercultural Communication Research Center, Hebei University, China’s, said both countries’ media have to play a joint role in refuting the negative propaganda of the western powers against the Pak-China friendship.\nDr. Samina Sabir, Coordinator, CPEC Center, University of Azad Jammu and Kashmir shared about the progress in Pakistan-China relations. Large number of students, faculty members from both China and Pakistan participated in the Webinar.",
  "retrievedAt": "2025-08-11T15:20:09.207Z"
}
