{
  "title": "US Congressional Delegation meets Sherry to support flood victims of Pakistan",
  "link": "https://www.app.com.pk/national/us-congressional-delegation-meets-sherry-to-support-flood-victims-of-pakistan/",
  "date_published": "2022-09-05T10:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Monday met the US Congressional delegation, headed by Congresswoman Sheila Jackson Lee, and apprised them of the current relief efforts and the assistance required for rehabilitation of the flood affected areas and population.\nThe delegation comprised of Congressman Tom Souzzi, Congressman Al Green and US Ambassador Donald Blome. The delegation expressed solidarity with the people of Pakistan and great concern on the devastation wreaked by the ‘Monster Monsoon’, promising full support to Pakistan in these trying times, a news release said.\nThe Federal Minister, while explaining the ongoing relief efforts, said, “the devastation on ground is much more than we encountered in the 2010 floods. This time, however, we are unable to find dry ground to land our helicopter sorties providing relief. We had a cataclysmic start to the year, with temperatures reaching 53 degrees in Sindh followed by heatwaves and 3 times the normal amount of GLOFs.\nThe South remains inundated, posing danger to human health now. Despite relief efforts from the government, NDMA, PDMAs and Pak Army, we are under-resourced. 33 million people have been impacted severely. We have appealed to our bilateral and multilateral partners in this time of need.”\nWhile talking about the imminent health crisis, Minister Rehman remarked, “There are far-reaching impacts of these floods which have unleashed on Pakistan for 9 weeks now. The situation on the ground is still worrying in terms of relief and rescue.\nIt is a national emergency. We are now heading towards a health emergency due to water-borne diseases. We need urgent relief funds to deal with this emerging crisis. We really appreciate US assistance and support in this moment of great crisis.\nIt reminds us of a strong partnership and of better times. Right now, we are looking at conducting risk assessment followed by building climate-resilient infrastructure and for that we would require your support.”\nThe US Congressional Delegation expressed condolences and deepest regret on the loss of lives and commitment to helping Pakistan in these trying times and advocate for funding in the US.",
  "retrievedAt": "2025-08-11T15:31:40.076Z"
}
