{
  "title": "Entire army, from Jawans to Generals, patriotic; should be no question about patriotism of any army chief: President",
  "link": "https://www.app.com.pk/national/entire-army-from-jawans-to-generals-patriotic-should-be-no-question-about-patriotism-of-any-army-chief-president/",
  "date_published": "2022-09-05T15:52:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sept 5 (APP): President Dr. Arif Alvi on Monday said that the armed force had successfully safeguarded the country from external and internal threats by rendering countless sacrifices and coming to the aid of civil administration in the face of national or man-made calamities.\nHe said that there should be no doubt about the patriotism of Jawans to Generals. “All chiefs of army staff who had been appointed in Pakistan were patriotic”, he added.\nThe President called upon the people of Pakistan, institutions and media to desist from stirring doubts and controversies on this matter.\nHe further said that as the President of Pakistan, all the institutions of the state were dear to him, including the current government, as it was the responsibility of the President to take ownership of all institutions.\nThe President made these remarks while talking to Peshawar-based journalists, here at Governor House, according to a press release issued by the President’s Media Wing.\nWhile dilating on the flood situation in Pakistan, the President emphasized the need to build large water storage dams to store the flood water and minimize the damage to lives, livelihoods and infrastructure of the country and use the stored water for supplying to urban centers as well as for agriculture.\nThe President said that encroachments and illegal constructions on river banks in the north stopping the river path was one of the main reasons for the loss of lives and properties.\nHe called upon the government to ensure that no encroachment on the path of any river was built to minimize flood impact in future.\nHe said that the government had planned to construct around 800 water storage bodies and delay action dams in Baluchistan to preserve the rain and flood water to control the flooding in future as well as replenish the underground water reservoirs.\nThe President said that Pakistan received annual water of over 150 MAF by way of rains and the melting of glaciers, which needed to be more effectively managed, distributed, and stored.\nHe said that the existing bodies and institutions on rivers and water resources should be strengthened and made effective to address water-related issues in the country, adding that Artificial Intelligence, telemetry systems, and satellites were among the effective tools which can help bring greater transparency in water distribution.\nThe President said that the glaciers were melting at an alarming pace and causing water bursts which resulted in severe damage.\nHe called upon the governments to conduct an in-depth study on the effects of climate change in Pakistan, conduct flood analysis, and identify areas where dams and embankments could be constructed to forestall heavy floods and save people’s lives and properties.\nHe said that rescue and relief activities in flood-hit areas should be given due attention, however, taking people in confidence on important matters was a part of the national discourse which could play an important role in mobilizing the masses and creating a national discourse on topics of national interest, including floods.\nWhile responding to the possible corruption in the flood aid distribution, he said that there was a need to bring transparency and fairness in the use of flood funds and implementation of projects to avoid allegations and incidents of corruption.\nWhile replying to another question, the President said that all provincial assemblies of KP, Sindh and Balochistan had passed resolutions against the construction of Kalabagh.\nHe said that the construction of Kalabagh can be reconsidered afresh by the relevant institutions with the stakeholders to understand their point of view and remove doubts and apprehensions and build consensus.\nWhile replying to another question, the President said that amidst the politically polarized and charged atmosphere, he did not want to create any controversy about any institution or personality, and airing of any comments or statements out of reference and context should be avoided.\nReplying to a question, the President said that behind the scenes, he was endeavouring to play some mediatory role between the stakeholders to defuse the political polarization, however, he would not dilate upon to “to let the things mature”.\nHe said that the sole purpose of his efforts was to understand and remove misgivings and misunderstandings amongst the stakeholders to bring them closer to each other and make efforts to find a middle way on major issues in the greater national interest.\nHe said that currently there was a difference of only eight months between the routine schedule of elections and those demanding early elections and he believed that things have the potential to settle down.\nWhile expressing his opinion on the current economic situation, the President said that the recent signing of the agreement with IMF would encourage other donors and institutions to come forward to help Pakistan out of its economic difficulties and hoped that things would start getting better.\nHe said that the high inflation was his concern in the same way as it concerned other citizens of the country.\nThe President said that the privacy of individuals should be respected and backbiting should be avoided.\nHe added that fake news and backbiting could be countered through ethical and moral education and by creating resistance in society against them.",
  "retrievedAt": "2025-08-11T15:31:30.015Z"
}
