{
  "title": "Indian Cd”A summoned to register strong protest over extra-judicial killing of a Pakistani national",
  "link": "https://www.app.com.pk/national/indian-cda-summoned-to-register-strong-protest-over-extra-judicial-killing-of-a-pakistani-national/",
  "date_published": "2022-09-05T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): The Indian Charge d’Affaires (Cd’A) on Monday was called to the Ministry of Foreign Affairs to register a strong protest over the extra-judicial killing of Tabarak Hussain, a Pakistani national in an Indian army hospital in Rajouri, Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“The Cd’A was told to convey to his government Pakistan’s strong condemnation of the killing of Tabarak Hussain, a mentally challenged Pakistani national who had inadvertently crossed the border at Naushera in Rajouri district on August 21, 2022 and was mercilessly shot by Indian security forces,” the Foreign Office Spokesperson said in a press release.\nThe Cd’A was conveyed Pakistan’s outright rejection of the claim that Tabarak Hussain died of ‘cardiac arrest’ as purported by the Indian authorities as well as the mischievous narrative being spun that Hussain had been sent by the Pakistan army.\n“Government of India has been called upon to share the details of this particular incident, including a credible post-mortem report to determine the cause of death and undertake a transparent investigation to bring to account whoever is responsible for the murder of the Pakistani prisoner. Prompt and expeditious repatriation of the mortal remains of the deceased to Pakistan, as per the wishes of his family was also demanded,” the spokesperson further added.\nThe Cd’A was reminded that the Indian claims held no water, as Tabarak Hussain being of unsound mental health, had inadvertently crossed the border in 2016 and had to be repatriated to Pakistan after serving a 26-month long prison term.\nIt was underscored that this incident had further heightened Pakistan’s serious concerns over the safety, security and well-being of other Pakistanis in Indian custody.\nThe Cd’A was also reminded of another brutal extrajudicial killing of a Pakistani prisoner Muhammed Ali Hussain by the Indian authorities recently, it was added.",
  "retrievedAt": "2025-08-11T15:31:35.732Z"
}
