{
  "title": "PM for constructive, sustained engagement between Pakistan, US",
  "link": "https://www.app.com.pk/national/pm-for-constructive-sustained-engagement-between-pakistan-us/",
  "date_published": "2022-09-05T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 5 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday expressing satisfaction at the upward trajectory in the Pakistan-US relationship, underlined the need for a constructive and sustained engagement between the two countries, based on mutual respect, trust and understanding.\nHe was talking to a U.S. Congressional delegation (CODEL), which led by Congresswoman Sheila Jackson Lee called on him here.\nApart from Congresswoman Lee, the delegation included Congressman Thomas Souzzi and Congressman Al Green.\nWhile appreciating the delegation’s visit to Pakistan at a critical juncture when flash floods have ravaged the country, the Prime Minister underlined that the government was fully engaged in the rescue and relief efforts.\nHe added that over 33 million had been affected; more than 1,300 human lives lost; and extensive damage was caused to agriculture, livestock, property, and critical infrastructure.\nThe Prime Minister underscored that rehabilitation and reconstruction would pose serious challenges and entail commitment of enormous resources.\nContinued support, solidarity and assistance from the international community were critical in that context, he added.\nThe Prime Minister underscored that despite being one of the lowest emitters of carbon emissions, Pakistan was facing the brunt of climate catastrophe.\nHe stressed that the developed countries must step up their climate ambition, including towards the provision of predictable climate finance for mitigating the adverse impacts of climate change in the developing world.\nThe Prime Minister appreciated the flood relief assistance being provided by the U.S., adding, that the Congressional delegation’s visit would help enhance global awareness of the scale of destruction caused by the super floods in Pakistan and mobilize greater support.\nThe 3-member Congressional delegation is visiting Pakistan from 4-6 September 2022. The delegation visited Sindh to witness the extent of the damage and human suffering and held meetings with key stakeholders to explore ways and means to assist Pakistan in its recovery efforts in a sustained manner.\nCongresswoman Lee, while sharing her deepest sympathies for the flood victims particularly those who had lost loved ones, lauded efforts of Prime Minister Shehbaz Sharif and expressed the hope that the Pakistani nation will deal with this calamity with resilience and resolve.\nShe affirmed that the U.S. Congress and Administration would stand by Pakistan in the wake of this colossal challenge and extend critical support to help them mitigate the sufferings of the affected people and rebuild their lives and communities.",
  "retrievedAt": "2025-08-11T15:31:31.497Z"
}
