{
  "title": "Pakistan most adversely impacted by climate change: FM",
  "link": "https://www.app.com.pk/national/pakistan-most-adversely-impacted-by-climate-change-fm/",
  "date_published": "2022-09-05T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 5 (APP): Foreign Minister Bilawal Bhutto Zardari on Monday underlined that despite being one of the lowest emitters of carbon emissions, Pakistan was the most adversely impacted by the climate change.\nHe stressed that the developed countries must step up their climate efforts, including towards the provision of predictable climate finance for mitigating the adverse impacts of climate change in the developing world.\nThe Foreign Minister was talking to a U.S. Congressional delegation (CODEL), which led by Congresswoman Sheila Jackson Lee called on him here. Her delegation included Congressman Thomas Souzzi and Congressman Al Green.\nThe delegation is visiting Pakistan from 4-6 September 2022.\nThe Foreign Minister appreciated the delegation’s visit to Pakistan at this time when super floods had ravaged the country.\nHe underscored that Pakistan has undergone floods of historic proportions. More than 1300 lives have been lost; over 33 million people are affected; over 4 million acres of crops have been washed away; and close to a million livestock have perished, he added.\nThe Foreign Minister said that, currently, the government was fully engaged in the rescue and relief efforts.\nHe emphasized that rehabilitation of the millions impacted and reconstruction of critical infrastructure required enormous resources which was a huge challenge.\nThe Foreign Minister hoped that the international community would recognize the enormity of challenge faced by Pakistan and assist Pakistan in its rehabilitation and reconstruction efforts.\nHe stressed that Pakistan was neither the first nor the last country to face a climate catastrophe and expressed the need to engage on a common climate agenda and called for climate justice at the global level.\nCongresswoman Lee underscored that she was over whelmed by the devastation caused by floods and maintained that her delegation, having assessed the on-ground situation, will support efforts of the U.S. Congress and the U.S. Administration to assist Pakistan in these trying times.",
  "retrievedAt": "2025-08-11T15:31:29.652Z"
}
