{
  "title": "PAF short documentary revives memories of September 5 War",
  "link": "https://www.app.com.pk/national/paf-short-documentary-revives-memories-of-september-5-war/",
  "date_published": "2022-09-05T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): The Pakistan Air Force (PAF) in its exclusive series of short documentaries with regards to the 58th PAF Defence Day has revived the memories of valour and courage of the nation’s chivalrous warriors.\nThe PAF Directorate General Public Relations released the fifth short documentary that unveiled the position when the stage of the September 65 war came, the brave men of the Pakistan Air Force created those brilliant stories of bravery, valour and courage that our nation would always recount with pride.\nThe short documentary was based on the combats and determination of the Shaheens of the Pakistan Air Force in connection with the September 5, 1965.\nThe prologue narrated that on September 5 morning, Pakistan Army occupation of Jourian and invasion of Akhnoor started hinted towards a massive threat as India politically did not want to lose more territories in Kashmir.It added that the Pakistan Army had occupied Chamb, Dewa Skrana and Jourian and conquered 300 square miles area of Kashmir.\nIt was clear that Indian Army was unable to resist Pakistan Army offensive launched in the area that increased the risk of war to break out on other fronts.Moreover, India Radio announced fake news that Delhi to receive heavy rainfall in the next 24 hours that was intended to propagate that India would not attack Pakistan due to the inclement weather.However, the PAF Met office at that time forecasted that there was no rainfall near Delhi. It was part of the Indian forces’ strategy to mislead the Pakistan Armed Forces.\nAfter the Rann of Kutch operations, the PAF preparations were in the full swing, therefore, the PAF top leadership was completely satisfied with its soldiers’ preparations.\nHowever, the limited number and close proximity of PAF bases along the border with India increased the risk of Indian Air Force (IAF) attacks at any time. The PAF bases were kept all time high alert keeping in view the risk. There was less tension observed on September 5. However, PAF did 16 missions on F-86 and F-104 fighter jets.After the intimation of an Indian aircraft’s presence in the area, the PAF, F-104 aircraft was sent in the area.The supersonic sounds and blasts created by this aircraft caused massive fear across the border in Amritsar. The then Indian Defence Minister had even announced that the Pakistani jets had entered Amritsar via Wagha and had fired rockets in IAF units.",
  "retrievedAt": "2025-08-11T15:31:38.166Z"
}
