{
  "title": "Attacks on mosques, businesses a precursor of full-blown Muslim genocide in India",
  "link": "https://www.app.com.pk/national/attacks-on-mosques-businesses-a-precursor-of-full-blown-muslim-genocide-in-india/",
  "date_published": "2022-04-20T08:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): With the unabated attacks on mosques, houses and businesses run by the Muslims in different Indian states particularly Karnataka, it is strongly believed that the country was fast heading towards a “full-blown genocide.”\nIn a recent Genocide Emergency Alert for India, Prof Gregory H Stanton had said that the country had reached the eighth stage of genocide with the persecution of the Muslim community.\nProf Stanton, who is the architect of the “10 stages of genocide” theory and also the founder of Genocide Watch, a non-profit organization that works to predict and prevent genocide and all other forms of mass murder, said India was in the 8th stage of genocide.\n“India is in Stage 8 of Genocide, the Persecution – just one step away from conducting extermination,” he said and added that the country’s Prime Minister Narendra Modi “will be very happy to watch it happen”.\nIn a recent spate of violence, the Muslims in Karnataka are being targeted by Hindu extremists backed by the politicians of ruling Bharatiya Janata Party (BJP).\nBesides burning their properties and attacking mosques and businesses, the right wing groups are calling upon Hindus not to employ the services of Muslim cab, tour and travel operators.\nMuslims account for about 13% of the state’s nearly 70 million population.\nThe Muslims, who have been setting up their stalls since years at the annual Hosa Margudi and Kollur Mookambika fairs, and the Bappanadu Durgaparameshwari, Mangaladevi and Puttur Mahalingeshwara temples in Dakshina Kannada have been asked to keep away.\nThe calls to keep Muslims away from fairs started during the COVID-19, when the Hindu extremists alleged them for spreading the pathogen.\nA Hindu shopkeeper who had installed his toy shop at the recently concluded Bappanadu Shri Durgaparameshwari Temple festival said that everyone has been silenced by the threat posed by pro-Hindu outfits.\n“If I speak out against them, they will ensure I can’t install shops at other festivals.”\nThe Muslims in India had been questioning the role of the state institutions including police for not taking any action against those who had put up posters spreading hateful propaganda outside the fairs.\n“Today, Hindu extremists in Bihar, Madhya Pradesh, Gujarat, Goa, Karnataka, and other Indian states attacked Muslims and their places of worship. These large-scale, well-orchestrated attacks serve as a precursor to the full-blown genocide,” Indian American Muslim Council said in a statement.\nThe Council also shared multiple videos showing anti-Muslim violence including the putting up of saffron flag on mosques, looting and burning a Muslim widow’s house, pelting stones at mosques and playing hate songs in rallies.\nNot only at the level of the institutions, the anti-Muslim hate is also penetrating into the grassroots level with the Hindu owners refusing to rent out their properties to the Muslims.\n“If necessary, we can make living by selling our organs of the body but not from the rent money of the Muslims. The house is empty, only for Hindus,” reads a board displayed by a Hindu man at the front door of his house.\nIn a video footage, the destroyed watermelons are seen on the road after the Hindu extremists vandalized the push cart owned by Muslims, threatening them not to run their businesses outside the temples.\nThe Muslim students in Karnataka are also going to lose their academic year following a ban on Hijab, endorsed by the high court. Though the court ruling had not asked the teachers to remove Hijab, the schools managements have barred their entry too, despite having no such mandate.\n“Indian media is extensively covering Pakistan but not even a single debate/show about how a Hindu Priest threatened to rape Muslim women or about the humiliation meted out to Muslims in Karnataka,” wrote Sania Syed, an activist on Twitter.\nContrary to the hate campaign being run by Hindu leaders, the Jamiat Ulema Islam wing in Karnataka has appealed the Muslims not to pay heed to boycott the Hindu traders during Holy Ramazan, advising them not fall for this communal propaganda and to not discriminate based on religion.",
  "retrievedAt": "2025-08-11T14:43:53.347Z"
}
