{
  "title": "Due process wasn’t followed for establishment of DMW: Marriyum",
  "link": "https://www.app.com.pk/national/due-process-wasnt-followed-for-establishment-of-dmw-marriyum/",
  "date_published": "2022-04-20T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): Minister of Information and Broadcasting Marriyum Aurangzeb said on Wednesday that the Pakistan Tehreek-e-Insaf (PTI) government had not followed due process for establishing the Digital Media Wing wherein die hard workers of the party were inducted in flagrant violation of rules and regulations.\nAddressing the media persons during “Meet the Press” Programme here at the National Press Club, she said that after the fall of the Imran Khan regime, 80 per cent employees at Digital Media Wing resigned which manifested that they were inducted in violation of rules.\nThe minister assured that those recruited in DMW under the rules should not worry as they would be integrated into the Cyber Wing of the Ministry of Information.\nThe only objective of the establishment of the Digital Media Wing by the previous government was to launch baseless propaganda against their opponents including politicians and journalists in the shape of abuse and intimidation.\n“We will not abuse anyone,” Maryam Aurangzeb assured the journalists by stating that PML-N under the leadership of Nawaz Sharif and Shehbaz Sharif did not believe in witch hunt.\nThe taxpayers’ money could not be spent on launching propaganda against their opponents, Maryam Aurangzeb said, adding that the entire campaign was run through faceless and robotic tweets.\nThe minister said Twitter handlers of all such faceless tweets had been traced and warned of the actions against those who involved in malicious campaigns against the institutions.Criticizing the former PM, she said that Imran Khan also knew that now only robots would support him on social media, as he could not make his place on social media anymore.\nShe said that the Parliamentary Committee on National Security has been named by Prime Minister Shehbaz Sharif  which would meet soon and the whole truth would come out before the people of Pakistan.\nShe said that the committee could not meet due to the delay in the formation of the federal cabinet.What happened to journalists, media workers and media houses in past three and a half years was a dark era as restrictions were imposed on freedom of expression , journalists were kidnapped and tortured to satisfy ego of one person.\nShe urged the media to come forward to eradicate the prevailing culture of intolerance in the country which was very dangerous for the body fabric of the society.\n“We will work together to solve media problems”, Maryam Aurangzeb while recalling working with the media during the finalization of 8th Wage Board Awards.\nShe announced that she would sit in Press Information Department two days a week to listen to the problems of media workers, and all members of the media could meet her there.",
  "retrievedAt": "2025-08-11T14:43:52.463Z"
}
