{
  "title": "Religious Tourism: Re-discovering Buddhist art, architecture & archaeology",
  "link": "https://www.app.com.pk/national/religious-tourism-re-discovering-buddhist-art-architecture-archaeology-by-muhammad-naeem-khan-niazi/",
  "date_published": "2021-04-21T08:32:00.000Z",
  "source": "APP",
  "content": "By Mohammad Khan Niazi\nLAHORE, Apr 21 (APP): The economic potential of religious tourism has remained untapped for decades despite the fact that Pakistan is home to various ancient civilizations of the world.\nGandhara civilization is a witness to the heyday of Buddhism and preserves some of the rare and finest relics associated with the Lord Buddha – founder of Buddhism.\nAlmost all provinces contain sacred remains of the Buddhist art, architecture and archaeology and presence of holy artifacts makes Pakistan a cherished destination for the Buddhist pilgrims.\nOn the intervention of the High Commission of Pakistan Colombo, Sri Lanka, some senior Buddhist monks arrived in Pakistan on April 19. The monks will visit various Buddhist heritage sites and museums during their week-long visit.\nThis pilgrimage is hoped to promote religious tourism in the coming days as Pakistan is center of the ancient Buddhist civilization which has remained hidden from the eye of the world.\nThe Buddhist delegation is led by venerable Dr. Walpole Piyananda Thero (who is Abbot and President, Dharmavijaya Buddhist Vihara, USA) and will visit Islamabad, Taxila, Shahbaz Garhi, Takht-e-Bhahi and Jehanabad (Swat) besides two-day visit to Lahore.\nThe Buddhist delegation will also hold meetings with the officials of the Ministry of Religious Affairs and Interfaith Harmony and other top government officials  during their sojourn in the federal capital.\nPrime Minister Imran Khan soon after assuming power in 2018 stressed the need to promote religious tourism in order to bolster country’s economy and improve soft image of Pakistan across the globe.\nIn his recent state visit to Sri Lanka, Prime Minister Imran Lanka invited Buddhist monks to come and see rare holy Buddhist remains in Pakistan.\nThe Second Secretary, High Commission of Pakistan Colombo Ms. Ayesha Abu Bakr Fahad said a lot of people do not know that Pakistan is home to the glorious Gandhara civilization and the Gandara Buddhist civilization.\n“In line with Prime Minister Imran Khan’s vision to promote religious tourism to earn valuable foreign exchange, we planned to make Buddhist clergy visit Pakistan and see the historical treasures that the country has”, she responded.\nThe diplomat said the visitors would be taken along the holy Buddhist trail so that they may see most sacred Buddhist sites and pay homage to the ‘Tooth relics of Lord Buddha’, the ‘Bone relics of Lord Buddha’ and the ‘Body Ashes of Lord Buddha’.\nVenerable Dr. Walpole Piyananda Thero said he was very happy for the way Pakistan had preserved the Buddhist statues, art and architecture despite being the fact that Pakistanis are not followers of Buddhism.\n“No doubt, Buddhism spread across the world through statues of the Buddha and Buddha’s message is of peace and compassion”, he added.\nHe said Prime Minister Imran Khan is revered by the Sri Lankans as a former cricketing great and a moderate politician, adding that he recently visited Sri Lanka and invited Buddhist monks to come and see the sacred Buddhist sites in the country.\nVenerable Uduwe Dhammaloka Thero said the history of Buddhism and Gandhara civilization spans over thousands of years into antiquity, adding that our visit will rebuild the centuries’ old historic relations between Buddhism and the land of Pakistan.\n“We had certain misconceptions about peace and security in Pakistan all our fears have subsided but after arriving here”, he said, urging the country should open its doors to the Buddhist pilgrims and it can earn foreign exchange worth millions.\nDr Asela Wickramasinghe, who is senior political advisor to the Sri Lankan President on Sri Lanka and Maldives, said the Pakistan government to open the Buddhist sites, which had been closed in the past, to the tourists, adding that their visit will inspire many across the globe to visit Pakistan.\n“Lift undue restrictions on tourism and Buddhist pilgrims from Japan, China, Thailand and other countries would rush to Pakistan,”, he said in his message, adding that Pakistanis are lucky to have Prime Minister like Imran Khan.\nDirector Lahore Museum Ijaz Ahmed  Minhas said that the Buddhist monks have been very pleased to be here in Pakistan to rediscover their glorious past, adding that one monk shared that it was great opportunity, courtesy Prime Minister Imran Khan, to see so many relics in real about which they had read in history books only.\nAbout the visit promoting religious tourism, he said the visiting Buddhist monks were religious leaders from across the world and they would disseminate the message of love and good-will about Pakistan once they go back to their communities.\nThe visit of senior Buddhist monks is likely to lay bare the hidden Buddhist remains to the world in the days to come and raise Pakistan’s image as a treasure trove of ancient civilizations besides being a tolerant and peace-loving country.",
  "retrievedAt": "2025-08-11T20:38:53.739Z"
}
