{
  "title": "Trump signals Gaza ceasefire ‘possible next week’ - World - DAWN.COM",
  "author": null,
  "content": "• Israeli attacks on Gaza claim another 62 lives\n• Military orders war crimes probe into shootings, Haaretz reports\n\nWASHINGTON: US President Donald Trump voiced optimism on Friday about a new ceasefire in Gaza, saying an agreement involving Israel and Hamas could come as early as next week.\n\nHe said he had been just been talking to some of the people involved in trying to reach a ceasefire to hostilities between Israel and Hamas.\n\n“The situation in Gaza is terrible. We think, within the next week, we are going to get a ceasefire. We’re providing significant aid to that area. Though not directly involved, we are engaged due to the loss of life,” he told reporters at the White House on Friday.\n\n62 killed in Gaza\n\nMeanwhile, Gaza’s civil defence agency said that Israeli forces killed at least 62 people on Friday, including 10 who were waiting for aid in the war-ravaged Palestinian territory.\n\nAid seekers were reportedly killed near Gaza sites, marking the latest deadly incident as a US- and Israeli-backed foundation replaces traditional humanitarian organisations.\n\nCivil defence spokesman Mahmud Bassal told AFP that 62 Palestinians had been killed on Friday by Israeli strikes or fire across the Palestinian territory.\n\nWhen asked by AFP for comment, the Israeli military said it was looking into the incidents, and denied its troops fired in one of the locations in central Gaza where rescuers said one aid seeker was killed.\n\nBassal said that six people were killed in southern Gaza near one of the distribution sites operated by the Gaza Humanitarian Foundation (GHF), and one more in a separate incident in the centre of the territory, where the army denied shooting “at all”.\n\nAnother three people were killed by a strike while waiting for aid southwest of Gaza City, Bassal said.\n\nThe health ministry in the territory says that since late May, more than 500 people have been killed near aid centres while seeking scarce supplies.\n\nBassal said that 10 people were killed in five separate Israeli strikes near the southern Gaza city of Khan Yunis, east of which he said “continuous Israeli artillery shelling” was reported Friday.\n\nThe Ezzedine Al-Qassam Brigades, said they shelled an Israeli vehicle east of Khan Yunis on Friday.\n\nThe Al-Quds Brigades said they had attacked a group of Israeli soldiers north of Khan Yunis in coordination with the Al-Qassam Brigades.\n\nBassal added that thirty people were killed in six separate strikes in northern Gaza on Friday, including a fisherman who was targeted “by Israeli warships”.\n\nHe specified that eight of them were killed “after an Israeli air strike hit Osama Bin Zaid School, which was housing displaced persons” in northern Gaza.\n\nIn central Gaza’s al-Bureij refugee camp, 12 people were killed in two separate Israeli strikes, Bassal said.\n\nWar crimes\n\nIsrael’s Military Advocate General has launched a probe into allegations of war crimes, accusing Israeli forces of deliberately firing at Palestinian civilians near Gaza aid sites, Haaretz reported Friday.\n\nThe military told Reuters that the Israel Defence Forces were not ordered to intentionally shoot civilians. They are aiming to enhance the “operational response” in aid areas by installing new fencing, signs, and opening additional routes to access handout zones.\n\nThe military said that some incidents were being reviewed by relevant authorities.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/685f2baa4a423.gif",
  "retrievedAt": "2025-08-20T04:31:03.861Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920718/trump-signals-gaza-ceasefire-possible-next-week",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:15:44.000Z"
}
