{
  "title": "GB Assembly echoes public anger over power outages - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: As protest demonstrations continued on Friday in several areas of Gilgit-Baltistan against massive loadshedding and power outages — leading to blockades on main roads and the Karakoram Highway — the issue was raised in the GB Assembly by opposition lawmakers, who said the crisis has made life unbearable for people.\n\nSpeaking on a point of order, Leader of the Opposition Sohail Abbas said that people in different parts of GB have blocked roads in protest against unscheduled and unannounced power outages lasting between eight and 12 hours daily.\n\nHe added the situation has worsened due to the region experiencing the warmest summer in decades — an unprecedented and unusual phenomenon that has compounded public misery.\n\n“In some areas, people are experiencing eight to 12 hours of power outages, while others have been without electricity for several consecutive days,” Mr Abbas said, adding the extreme heat has made daily life intolerable.\n\nProtesters block Karakoram Highway, main roads in several parts of the region\n\nHe criticised the power department for failing to issue a loadshedding schedule or provide any communication. “When people try to contact officials, they get no response or explanation for the prolonged outages,” he said. “Had a schedule been issued, people could have at least prepared themselves accordingly.”\n\nOther opposition members echoed his concerns, pointing out that while the people of GB are used to facing up to 22 hours of loadshedding during winter — due to reduced water flow in rivers and tributaries — it is incomprehensible that similar power outages are occurring in the summer, when water flow is abundant.\n\nResponding to the opposition’s complaints, GB Chief Minister Haji Gulbar Khan acknowledged that the region currently lacks the capacity to eliminate loadshedding altogether. However, he said that two power plants — one each in Diamer and Gilgit — will be made operational soon.\n\nHe added that a meeting with officials from the power department would be convened shortly to address the crisis. “The power situation will improve, and a loadshedding schedule will be issued to the public,” he assured.\n\nMeanwhile, protests continued in Jutal, Rahimabad, Faizanabad, Oshkindas and several other areas, where residents blocked the Karakoram Highway, Naltar Expressway and several main roads, leading to tourists and residents being stranded for hours.\n\nSimilar demonstrations took place in Hunza, Ghizer, Astore, Nagar and Diamer, where protesters burnt tyres, chanted slogans and accused the government of failing to ensure electricity supply during the summer — even after having endured prolonged outages in winter.\n\nProtesters also alleged widespread financial corruption within the power department. “Despite billions of rupees being spent annually on power projects, the authorities have failed to provide electricity,” they said, demanding accountability and urgent reforms.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:47:48.984Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920710/gb-assembly-echoes-public-anger-over-power-outages",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:15:50.000Z"
}
