{
  "title": "Two die from electrocution as rain continues in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Two young men died from electrocution in SITE and Surjani Town as light rain continued intermittently across the metropolis on Friday.\n\nWhile the Karachi Metropolitan Corporation (KMC) is yet to complete the de-silting of major storm water drains in the city, roads in many areas submerged by rainwater, causing vehicular traffic to move at a snail’s pace.\n\nThe condition of roads and streets under the town municipal corporations’ administrative control was also unimpressive.\n\nIn its weather advisory issued on Friday, the Met Office said that due to strong monsoon currents penetrating over the province, Karachi continues to receive intermittent rain on Saturday (today).\n\nAccording to the Met Office, Surjani Town received the highest count of rain, 16 millimetres, on Friday followed by Bahria Town 10.2mm, North Karachi 6.8mm, Orangi Town. 6.1mm, Gulshan-i-Maymar 5.4mm and Saddar 5mm. Other parts of the city received below 5mm or just traces.\n\nA factory worker was electrocuted inside the industrial unit in the SITE area.\n\nArea SHO Sajjad Khan Afridi told Dawn that Kamran Asghar, 20, died when he suffered an electric shock at around 1:30am.\n\nIn another incident, a 21-year-old man was electrocuted in Surjani Town.\n\nArea SHO Mohammed Ali Shah said that Ahmed Haider Ali suffered an electric shock when he touched the gate of his house during rain.\n\nMeanwhile, an unidentified young man died when a wall of a house collapsed near Bakra Piri. The body was shifted to the Dr Ruth Pfau Civil Hospital Karachi.\n\nThe Met Office said that rain / thunderstorm with moderate to isolated heavy falls is likely in Karachi, Hyderabad, Umerkot, Mirpurkhas, Badin, Thatta, Sujawal, Dadu, Sukkur, Larkana, Qamber Shahdadkot, Shikarpur, Khairpur, Naushahro Feroze, Shaheed Benazirabad, Matiari, Sanghar, Jamshoro, Tando Allahyar, Tando Muhammad Khan, Jacobabad, Ghotki, Kashmore and Tharparker districts till Sunday.\n\nProlonged power outages\n\nResidents of the metropolis spent a sleepless night as power supply in many parts of the metropolis disrupted with the first drop of rain and took up to 10 hours to restore.\n\nHowever, the K-Electric claimed in a press release that despite sporadic rain across the city, “uninterrupted power supply continued through over 1,600 out of 2,100 feeders”.\n\nIt said that the KE briefly isolated supply on feeders serving low-lying areas and field teams were mobilised to restore electricity.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/685f22deee19e.gif",
  "retrievedAt": "2025-08-20T04:30:39.626Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920677/two-die-from-electrocution-as-rain-continues-in-karachi",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:16:15.000Z"
}
