{
  "title": "NDMA issues urban flood warning as intermittent showers in Karachi to continue till tomorrow - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Disaster Management Authority (NDMA) on Saturday warned that there is a risk of urban flooding across the southern district of Sindh, as rains lash Karachi and are forecast to continue tomorrow.\n\nKarachi has been experiencing moderate to heavy rainfall since Thursday night, bringing on reprieve from the scorching summer heat. Monsoon rains continue to lash many parts of the country, prompting authorities to release an urban flooding warning for several cities. Monsoon rains fall across the region from June to September every year.\n\nAccording to an NDMA alert on X, there is a risk of urban flooding within the next 48 hours in the districts of Sujawal, Thatta, Badin, Karachi, Hyderabad and Mirpurkhas.\n\nThe authority also issued an urban flood warning for “the low-lying areas of Pothohar/northeast Punjab”, including Rawalpindi, Islamabad, Gujranwala, Gujrat, Sialkot and Lahore.\n\nMeanwhile, two people died in rain-related incidents in Karachi, according to police, hospital and rescue officials.\n\nPolice surgeon Dr Summaiya Syed told Dawn.com, a 30-year-old man was fatally electrocuted in New Karachi and his body was transported to Abbasi Shaheed Hospital for legal formalities.\n\n“The man was electrocuted in his home,” New Karachi Station House Officer Mohammed Saud told Dawn.com.\n\nSeparately, a 17-year-old boy was fatally electrocuted near Murtaza Chaurangi in Bilal Colony, according to an Edhi Foundation spokesperson.\n\nKorangi Industrial Area SHO Mohammed Ali Niazi said no one approached the police for legal proceedings regarding the teenager.\n\nEarlier, the Met Office forecast intermittent showers in Karachi till tomorrow as the city continues to receive rain for a third consecutive day on Saturday.\n\nAccording to a weather advisory issued by the Pakistan Meteorological Department (PMD), “strong monsoon currents are penetrating over the province”, causing thunderstorm/rain with moderate to heavy rainfall in Karachi along with Jamshoro, Dadu, Badin, Thatta, Sujawal, Hyderabad, Mitiari, Sanghar, Tando Allahyar, Tando Muhammad Khan, Shaheed Benazirabad, Nosheroferoz districts of Sindh.\n\nRainy weather is likely to persist in the city for the next two days. Karachi is expected to receive intermittent thunderstorms/rain with a few moderate to isolated heavy falls today, while the maximum temperature will be between 30-32 degrees Celsius with 78 per cent humidity.\n\nFor Sunday, the Met Office has predicted Intermittent rain with a few moderate to isolated heavy falls. The temperature is to remain between 30-32 degrees Celsius with the humidity levels of 75-85pc.\n\nOn Monday, the city will experience cloudy weather with chances of light rain/drizzle, with temperatures expected to stay between 32–34 degrees Celsius, with 75-85pc humidity.\n\nIn other parts of Sindh, including Tharparker, Umerkot, Mirpurkhas, Sukkur, Larkana, Kamber Shahdadkot, Shikarpur, Khairpur, Jacobabad, Ghotki, and Kashmore, rain/thunderstorm with few moderate falls will continue till tomorrow with occasional gaps.\n\nIn its weather advisory, the Met Office warned: “Heavy downpour/windstorm and lightning may affect daily routines, urban flooding, water logging in low lying areas and may damage weak structures like roof/wall of Kacha houses, electric poles, billboards, vehicles and solar panels, etc. during the forecast period.”\n\nIt advised farmers to manage their activities in light of the weather forecast.\n\nThe Met Office directed concerned authorities to remain alert and take all necessary measures to avoid any untoward situation.\n\nSeparately, an advisory issued by the traffic police advised people to avoid unnecessary travel, and to not take sudden brakes while on the road, as the roads may become slippery.\n\nThe advisory further asked commuters to maintain a low speed when driving, keeping a distance from the next vehicle and urged motorcyclists to use the left side of the road only.\n\nOn Friday, two young men died from electrocution in Karachi’s SITE and Surjani Town. A 20-year old factory worker, died after he suffered an electric shock at around 1:30am while another 21-year-old man died in Surjani Town from an electric shock when he touched the gate of his house during rain.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2815003205420e3.jpg",
  "retrievedAt": "2025-08-20T04:30:34.990Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920797/ndma-issues-urban-flood-warning-as-intermittent-showers-in-karachi-to-continue-till-tomorrow",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T09:54:32.000Z"
}
