{
  "title": "Pilgrims unable to perform Haj to get full refund - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Religious Affairs has been ordered to refund Rs36 billion to aspiring pilgrims who couldn’t perform Haj this year.\n\nThe money would be returned to over 67,000 Pakistani pilgrims who were supposed to go on Haj through private tour operators but couldn’t over delays in payments.\n\nThe sub-committee of Senate Standing Committee on Religious Affairs on Friday directed the ministry to fully reimburse the victims.\n\nThe sub-committee’s convener, Senator Aon Abbas Buppi, announced that Rs36.43 billion held in Saudi Arabia must be refunded by August 15.\n\nThere should be no deductions whatsoever, including currency exchange losses or service charges, Mr Bappi emphasised.\n\nReligious Affairs Secretary Dr Attaur Rehman informed the committee that Pakistan was allotted a quota of 179,210 pilgrims for the Haj in 2025 by the Saudi government.\n\nOf this quota, 90,830 slots were allocated to private Haj operators.\n\nHowever, the Saudi government later revised its policy to only allow operators with a group of 500 to 2,000 pilgrims.\n\nNone of the 903 registered private tour operators in Pakistan fulfilled this requirement, the official said.\n\nHe claimed that despite multiple communications from the min­­istry, the Haj Operators Associat­ion of Pakistan (HOAP) obtained a stay order from the Sindh High Court against the policy.\n\nThe stay was vacated on January 7 but by then, the window to deposit payments had nearly closed.\n\nDuring the legal deadlock, HOAP had transferred 50m riyals to the Pakistani Haj Mission’s account.\n\nAfter the stay was lifted, the ministry instructed the private operators to promptly deposit the remaining funds into a designated Saudi E-Wallet account.\n\nHowever, by the Saudi cut-off date of February 14, only 187m riyals had been deposited.\n\nAccording to Saudi policy, only pilgrims who had paid the full 14,000 riyals by Feb 14 were eligible to perform Haj.\n\nAs a result, only 26,986 remained eligible as their full payment was deposited.\n\nDirector General Haj Abdul Wahab Soomro reported that 667m riyals were transferred to Saudi accounts by Pakistani private operators, out of which 489m riyals — around Rs36.43bn — remained unutilised and are still held in Saudi Arabia.\n\nSenator Dinesh Kumar said the negligence of officials and tour operators deprived 67,000 Pakistanis of a chance to fulfil their religious obligation.\n\nSenator Bushra Anjum Butt strongly slammed HOAP’s absence from the meeting, stating that it was unacceptable for the main stakeholders to skip a session that directly concerned them.\n\nThe sub-committee also directed the ministry to submit the complete list of existing private tour operators, along with new applicants, to the standing committee.\n\nSenator Bappi suggested the federal government establishes a high-level commission to evaluate and regulate the operations of private Haj operators. “This would ensure that such failures are not repeated in future Haj”.\n\nHe further directed the government to ensure public awareness of the Saudi Haj policy for the next season.\n\nThe committee also discussed a letter written in March 2025 by former Religious Affairs minister Chaudhry Salik Hussain, expressing concerns over the award of contracts related to hotel bookings, transport, catering, and Mashaheer services.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:47:44.895Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920712/pilgrims-unable-to-perform-haj-to-get-full-refund",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:15:50.000Z"
}
