{
  "title": "Tarar assails KP administration as 11 bodies recovered from Swat River - Pakistan - DAWN.COM",
  "author": null,
  "content": "Information Minister Attaullah Tarar on Saturday slammed the Khyber Pakhtunkhwa government for its failure to address the Swat River flash flood a day prior, as 11 bodies have been dredged from the waterway by rescuers.\n\nAt least 19 people have been killed and six others injured in Khyber Pakhtunkhwa amid heavy rains and the consequent flash floods and landslides, according to data from the Provincial Disaster Management Authority (PDMA).\n\nSeparately, KP Chief Secretary Shahab Ali Shah suspended Swat Additional Deputy Commissioner for relief Ihsan-ul-Haq, Babuzai Assistant Commissioner (AC) Nida Iqbal and Khwazakhela AC Muhammad Amir Khan.\n\nTarar expressed his grief over the disaster in the Swat River, stating, “Whenever there’s a natural disaster, it is the government’s responsibility to extend relief.”\n\nSpeaking about the KP government suspending the Swat deputy commissioner, Tarar said that KP Chief Minister Ali Amin Gandapur should have been suspended instead.\n\n“The CM should have been suspended; a man who says ‘I cannot hand out tents, it’s not my job’,” Tarar stated.\n\n“Did the people of KP give you the mandate to work from Adiala?” the minister asked, referring to how Gandapur approaches incarcerated PTI founder Imran Khan for instructions and approval. “The people did not give you a mandate to operate like this; they gave you a mandate to serve the public.”\n\nTarar then noted how, despite advanced technology, the PTI’s KP government has been unable to implement effective infrastructure and attempts to rescue people who get trapped atop steep rock formations using makeshift arrangements.\n\n“The KP government helicopter, which is used by the CM and was used by Imran Khan, could not be flown to the rescue of women and children who were in grave danger,” he lamented.\n\n“Coming to Islamabad, armed with weapons and attacking policemen is not bravery, nor is it any sort of feat,” Tarar said, referring to the PTI’s Islamabad rally. “Real bravery is implementing an effective rescue system during 12 years of government.”\n\nHe addressed Gandapur: “If you could not procure rescue equipment, you should have just kept quiet. If handing out tents is not your job, then what is? Is rescuing people and keeping them safe not your job?”\n\nTarar noted that the KP taxpayer is bearing the brunt of inaction by the provincial administration. The minister suggested that Gandapur “abolish the PDMA … and stop taking taxes if you are not able to save people”.\n\nAccording to Rescue 1122 KP spokesperson Bilal Ahmed Faizi, the bodies of 11 of the 13 people who were swept away in the flood have been recovered so far.\n\n“Of the bodies, nine are from Sialkot, while two are from Mardan,” Faizi told Dawn.com. “Rescue 1122 is conducting a search operation to recover the remaining missing people.”\n\nFollowing the flooding, the KP government later on Saturday announced measures to mitigate the problems caused by flooding in rivers across the province.\n\nIn a post on X, the provincial government announced that among the decisions taken were a complete ban on all types of mining activities and encroachments along the riverbed, as well as declaring the office of the assistant deputy commissioner (relief) a response centre.\n\nAdditionally, all rivers will be effectively monitored, rescue teams will be provided with life jackets, drones and other modern equipment and irrigation early warning systems will be re-evaluated.\n\nThe KP government suspended the Swat deputy commissioner today, while another official faced disciplinary action for their alleged negligence during the floods.\n\nAn order from the KP government’s Establishment Department, seen by Dawn.com, read that Shahzad Mehboob was removed from his post as DC and transferred to the establishment department.\n\nThe same order, issued by the KP chief secretary, stated that Saleem Jan would be awarded the post.\n\nMeanwhile, the Tehsil Municipal Officer (TMO) for Khawazakhela, Zahidullah Khan, was also removed from his post, according to an order issued by the KP government’s local government, elections and rural development department.\n\nAccording to the order, seen by Dawn.com, Khan was removed from his post for “failure in delivery of municipal services and performance of assign lawful duties during emergency/floods situation”.\n\nUnder the powers conferred under the Local Councils PUGF (E&D) Rules, 1980, read with Local Council Board (Constitution and Conduct of Business) Rules, 1988, the chairman of the Local Council Board suspended Khan on administrative grounds with Immediate effect.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2819194695e5375.jpg",
  "retrievedAt": "2025-08-20T04:30:32.412Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920812/tarar-assails-kp-administration-as-11-bodies-recovered-from-swat-river",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T14:29:03.000Z"
}
