{
  "title": "Army to be deployed across country for security during Muharram - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The interior ministry on Friday approved the nationwide deployment of the Pakistan Army and civil armed forces for security during Muharram-ul-Haram.\n\nA notification issued by the interior ministry, a copy of which is available with Dawn, said the approval followed requests by all provincial governments, besides governments of Gilgit-Baltistan and Azad Jammu and Kashmir.\n\nIt added the federal government authorised the deployment of army troops and civil armed forces under Sections 4 and 5 of the Anti-Terrorism Act, 1997, for Muharram security duties in aid of civil power, subject to laws enforced in the country.\n\n“The exact number, date and area of deployment of Pakistan Army and CAFs troops/assets will be worked out by all provincial governments including Government of Gilgit-Baltistan, Azad Govt. of the State of Jammu and Kashmir and ICT administration in consultation with concerned stakeholders on the basis of on-ground requirement/assessment.\n\nDeployment approved on requests from provinces, GB and Azad Kashmir\n\n“The date of de-requisitioning of the said deployment will be decided subsequently after mutual consultation among all stakeholders,” the notification said.\n\nCopies of the notification besides others have been sent to the secretary to the prime minister, secretary of ministry of defence, secretaries of home departments, governments of Punjab, Sindh, KP, Balochistan, GB & AJK, chief commissioner of ICT, military operations directorate, GHQ, inspectors general of Frontier Corps, (North and South), inspectors general of Frontier Corps, Balochistan (North and South), director generals of Pakistan Rangers (Punjab and Sindh), commandant of Frontier Constabulary, director general of Gilgit-Baltistan Scouts, and inspectors general of Police, Punjab, Sindh, KP, Balochistan, GB, AJK and Islamabad.\n\nAshura, the 10th of Muharram, will be observed on July 6. Muharram is the month of mourning, observed in particular by Shia Muslims worldwide. It commemorates the Battle of Karbala in 680 AD, where Imam Hussain, the grandson of Holy Prophet Muhammad (Peace Be Upon Him), and his family members and companions were martyred.\n\nKeeping in view the need for extra security due to the spike in religious activity during the first 10 days of Muharram, authorities make arrangements accordingly.\n\nA day earlier, Interior Minister Mohsin Naqvi chaired a meeting on nationwide Muharram security plan at the Ministry of Interior.\n\nDuring the meeting, security plans for all provinces, Azad Kashmir, Gilgit-Baltistan and Islamabad were reviewed in detail.\n\nIt was decided in the meeting to launch a crackdown against elements spreading religious hatred on social media during Muharram and take strict legal action against them.\n\nMoreover, it was decided to send clear recommendations to Pemra and PTA to curb hate content on electronic and social media. It was also decided that all necessary measures will be taken to ensure peace and order during Muharram.\n\nIt was also agreed that any decision to suspend internet or mobile phone services will be made in consultation with provinces, keeping in view the security concerns.\n\nMr Naqvi directed the authorities to make decisions regarding internet and mobile service suspensions the basis of ground realities and the security situation.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:47:48.298Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920725/army-to-be-deployed-across-country-for-security-during-muharram",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:15:38.000Z"
}
