{
  "title": "IHC orders govt to dissolve CDA, transfer powers to Islamabad Metropolitan Corporation - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Islamabad High Court (IHC) on Saturday ordered the government to dissolve the Capital Development Authority (CDA) and transfer its powers to the Islamabad Metropolitan Corporation (MCI), according to a court order seen by Dawn.com.\n\nEstablished in 1960, the CDA is a civic organisation tasked with the development of the federal capital. The authority’s official website said that it plays a “pivotal role in the sustainable development and management” of the city.\n\nA day earlier, Justice Mohsin Akhtar Kayani heard two writ petitions challenging a Statutory Regulatory Order (SRO) issued by the CDA in 2015 imposing Direct Access and Right of Way (ROW) charges on petrol pump/CNG stations located on major roads in Islamabad.\n\nToday’s judgment said that the CDA charged the petitioners an amount of Rs337,442,856 for payment “under ROW charges”.\n\nIt said that the “issuance of SRO constitutes an illegal act and is unconstitutional” under Article 77 of the Constitution, which directs that taxation powers must be exercised with the parliament’s authority.\n\nJustice Kayani noted, “Essentially, the imposition of direct taxes, ROW charges, or access charges by the CDA under the CDA Ordinance, 1960 based on municipal functions derived from the Municipal Administration Ordinance, 1960 without following the statutory procedure outlined in Sections 88, 89, and 90 of the ICT Local Government Act, 2015, is unlawful.”\n\nThe order said, “It is now time for the federal government to take appropriate steps to terminate the functioning of the CDA in terms of Section 52 of the CDA Ordinance, 1960, and to formally dissolve the Authority, as its original mandate has been fulfilled.\n\n“The entire administrative, regulatory and municipal framework of Islamabad Capital Territory is now governed under the ICT Local Government Act, 2015, which is a special legislation enacted to regulate local governance through elected representatives.”\n\nWhile allowing both writ petitions, the order said that the SRO was declared “illegal” and “without lawful authority or jurisdiction”.\n\nJustice Kayani directed the government to “initiate and conclude the process for the dissolution of the CDA, and to transfer all powers, assets, and functions to the Islamabad Metropolitan Corporation (MCI)”.\n\n“This transition shall ensure that the Islamabad Capital Territory is administered under a transparent, accountable, and lawful municipal framework, and that the rights of its citizens are duly protected under the law,” the order noted.\n\nEarlier this month, Prime Minister Shehbaz Sharif directed the city managers to reverse the decision to increase the fare of the CDA buses, after the public criticised the authority for doubling the fare.\n\nLast week, the IHC rebuked the CDA for its failure to provide designated spaces for licensed pushcart vendors, terming the issue one of dignity and survival for the city’s working poor.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:30:31.207Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920811/ihc-orders-govt-to-dissolve-cda-transfer-powers-to-islamabad-metropolitan-corporation",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T14:53:26.000Z"
}
