{
  "title": "Over 20,000 cops deployed for security in Karachi during Muharram - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Police on Friday issued a security plan for Muharram, deploying a total of 20,350 officers and personnel across the city till Ashura.\n\nAccording to the Karachi police, as many as 829 processions and 5,227 majalis are scheduled to take place during the first 10 days of Muharram.\n\nTo ensure security, 7,004 officers will be stationed at 4,605 processions and gatherings, while 1,660 personnel will be deployed at highly sensitive sites and imambargahs. Additionally, 1,100 traffic police personnel will be on duty to manage traffic flow.\n\nAuthorities have urged citizens to stay vigilant and immediately report any suspicious or unusual activity to Police Helpline 15.\n\nMeanwhile, the provincial government, civil bodies and ulema belonging to various schools of thought sat together to review arrangements to ensure sectarian and interfaith harmony during the month Muharram.\n\nA meeting, chaired by Chief Minister Syed Murad Ali Shah and attended by provincial ministers, Karachi commissioner and mayor, representatives of K-Electric, Karachi Water & Sewerage Corporation, Sindh Solid Waste Management Board and prominent clerics was held at the CM House on Thursday.\n\nThe CM sought suggestions from the ulema to ensure smooth arrangements during Muharram and issued directives based on the recommendations provided by them.\n\nHe instructed the relevant authorities to ensure comprehensive preparations in Karachi, Hyderabad, Sukkur, Larkana, Mirpurkhas and Shaheed Benazirabad.\n\nLocal government institutions were directed to ensure cleanliness and sanitation in all neighbourhoods, especially around imambargahs and procession routes. The KE and other power distribution companies were directed to ensure uninterrupted power supply during Muharram.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/2807530328369ef.png?r=075324",
  "retrievedAt": "2025-08-20T04:30:38.164Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920673/over-20000-cops-deployed-for-security-in-karachi-during-muharram",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:16:15.000Z"
}
