{
  "title": "Same tune - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S Rs17.6tr ‘austerity’ budget for FY26, passed by the National Assembly on Thursday, focuses primarily on producing a primary budget surplus of 2.4pc to stay the debt sustainability course set by the IMF under its $7bn funding programme and $1.4bn climate-resilient facility.\n\nThe budget target is ambitious: to grow the economy by 4.2pc despite the private sector’s weakened appetite for investment and without any major public fiscal stimulus. The aim is also to collect Rs14.1tr in taxes to contain the fiscal deficit to 3.9pc, besides imposing new taxes worth Rs463bn, which include levies amounting to Rs36bn.\n\nThe powers the FBR would like in order to collect taxes of Rs389bn through enforcement measures have, however, been tempered on the PPP’s insistence. For example, the power to arrest tax evaders or short-filers will be used only in cases where the irregularity exceeds Rs50m.\n\nThere will be no arrest during the inquiry stage or without the approval of a committee. The offence has also been made bailable. Likewise, spending curbs on ineligible persons have been eased somewhat. The tax on imported solar panels has been reduced to 10pc from the proposed 18pc. Similarly, the rate of income tax on earnings between Rs600,000 and Rs1.2m has been reduced further from 2.5pc to 1pc.\n\nThe fact that interest payments of Rs8.2tr remain the single largest allocation expenditure highlights the small fiscal space for infrastructure development — needed for growth and provision of public services — on account of unsound policies. Defence spending is set to consume Rs2.55tr, followed by a subsidy bill of Rs1.1tr.\n\nAllocations for development have come down to Rs1tr — equal to the civil and military pension bill — compared with the original estimate of Rs1.4tr for the outgoing year. Despite the squeeze on resources and the government’s unwillingness to effectively tax politically important sectors like retail, agriculture and real estate, tax expenditure or exemptions to commercial for-profit civil and military organisations have jumped to over Rs5.3tr.\n\nThe next budget is more or less a reflection of previous ones; ie, it is an attempt to balance the books within the overarching framework dictated by the IMF, with a few changes here and there.\n\nThe macroeconomic targets are unrealistic, and we are likely to see all or most of them being missed at the end of the next fiscal year. Some might argue that the government has little leeway to manoeuvre the budget for fear of breaching the IMF’s guidelines. But this amounts to misleading the public.\n\nThe IMF programme focuses on debt sustainability; it does not stop policymakers from making the decisions that they chose not make for decades. We are where we are not due to any exogenous factors. The country cannot progress unless our ruling elites admit their part in its consistent economic decline.\n\nPublished in Dawn, June 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:30:35.818Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1920743/same-tune",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T00:16:50.000Z"
}
