{
  "title": "Solangi reiterates commitment to hold free, fair general elections in February next year",
  "link": "https://www.app.com.pk/national/solangi-reiterates-commitment-to-hold-free-fair-general-elections-in-february-next-year/",
  "date_published": "2023-12-22T10:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP):Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Friday reiterated the commitment of the government with regard to the holding of free, fair and transparent general elections on February 8 next year.\nRuling out any possibility of delay, he said the general elections would be held under the schedule, already given by the Election Commission of Pakistan.\nTalking to media persons, he said that  Chief Election Commissioner Raja Sultan did enjoy the confidence of majority people and there was no question of his resignation.\nTo a question, Solangi said he could not comment on internal issues of political parties as the caretaker government wanted to maintain cordial relations with all political forces.\nOn a question about termination of service of some employees, he said that media channels initially gave feasibility reports to PEMRA which was also required at the time of issuance of licence. He said that under PEMRA Amendment Act 2023, the journalist job was protected.\nMurtaza Solangi assured that the government would take legal measures to protect the employment of journalists.\nThe minister said an unpleasant and unwarranted situation had arisen regarding the protesters from Balochistan.\nand added their demands were long-standing.\nHe said all women and children had been released besides most of the men, adding their protection was being fully ensured.\nHe said that the committee, constituted by the Prime Minister, was doing its work. Currently the Governor Balochistan\nwas in Islamabad and consultations with him were underway, he added. Moreover, today a meeting of this committee\nwith the Prime Minister was also scheduled, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:09:55.756Z"
}
