{
  "title": "FDE announces winter vacations from Dec 25 to 29",
  "link": "https://www.app.com.pk/national/fde-announces-winter-vacations-from-dec-25-to-29/",
  "date_published": "2023-12-22T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP): The Federal Directorate of Education(FDE) has announced winter vacations for all public educational institutions in Islamabad Capital Territory from December 25 (Monday).\nAccording to the notification, FDE has directed all Heads of Institutions through Area Education Officers (AEOs) including Islamabad Model Schools/Colleges/Ex-F.G. Colleges (Boys/Girls) in Urban and Rural Areas, Islamabad, that the vacations will be observed from Dec 25 to Dec 29, adding that the education activities will be resumed from January 1, 2024.\nFurthermore, the officials also announced the school’s timings for all schools in urban and rural areas of the capital as cold wave grips parts of the country including the capital. FDE also mentioned that revised school timings will remain effective until January 31, 2024.\nIt said that the classes will start at 8:30 am and will end at 2:00 pm on Monday through Thursday in schools operating in single shifts. On Friday, the classes will culminate at 12:30 pm.\nHowever, for schools with double shifts, the morning session will run from 8:00 am to 1:00 pm from Monday to Thursday, and Friday classes will conclude at 12:30 pm. The evening shift will begin at 1:00 pm and end at 6:00 pm, Monday through Thursday, with Friday classes starting at 2:30 pm after Jumma prayer.\nEarlier, Punjab Caretaker Chief Minister Mohsin Naqvi announced the date for winter vacation at the schools and colleges in the province. He said the winter vacations for children will commence from Dec 18, 2023, to Jan 1, 2024.\nSimilarly, the Sindh Department of Education has announced winter vacation for all educational institutions, starting from December 22.  A notification issued by the education department said the vacations will be observed till December 31.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:09:19.087Z"
}
