{
  "title": "Pakistan delivers strong demarche to Afghan govt; seeks action against perpetrators of DI Khan attack",
  "link": "https://www.app.com.pk/national/pakistan-delivers-strong-demarche-to-afghan-govt-seeks-action-against-perpetrators-of-di-khan-attack/",
  "date_published": "2023-12-12T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Following the deadly attack that took place in Dera Ismail Khan on Tuesday and claimed by a terrorist group affiliated with the TTP, Pakistan delivered a strong demarche to the Afghan Interim Government calling for the investigation and strict action against the perpetrators.\nIn this connection, the foreign secretary called in the Chargé d’Affaires (Cd’A) of the Afghan Interim Government (AIG) to deliver Pakistan’s strong demarche in the context of Tuesday’s deadly terrorist attack on Pakistan’s security forces’ post in Daraban, Dera Ismail Khan.\nThe attack, whose responsibility has been claimed by Tehreek-e-Jihad Pakistan, a terrorist group affiliated with the Tehreek-i-Taliban Pakistan (TTP), resulted in multiple causalities, including the martyrdom of 23 security personnel, a Foreign Office statement said.\nThe Afghan diplomat was asked to immediately convey to the Afghan Interim Government to fully investigate and take stern action against the perpetrators of the recent attack.\nThe Afghan government was also asked to publicly condemn the terrorist incident at the highest level and take immediate verifiable actions against all terrorist groups including their leadership and their sanctuaries.\nPakistan also called for apprehending and handing over the perpetrators of the attack and the TTP leadership in Afghanistan to the Government of Pakistan, and taking all necessary measures to deny the persistent use of Afghan soil for terrorism against Pakistan.\n“Today’s terrorist attack is yet another reminder of the terrorist threat to peace and stability in the region. We must act resolutely with all our collective might to defeat this menace. On its part, Pakistan remains steadfast in its commitment to combat terrorism,” the Foreign Office statement added.",
  "retrievedAt": "2025-08-11T10:58:41.692Z"
}
