{
  "title": "Huawei, COMSTECH forms strategic partnership in Cybersecurity, AI and 5G advancement",
  "link": "https://www.app.com.pk/national/huawei-comstech-forms-strategic-partnership-in-cybersecurity-ai-and-5g-advancement/",
  "date_published": "2023-12-12T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):The Ministerial Committee for Scientific and Technological Cooperation of the OIC (Organization of Islamic Cooperation) and Huawei Technologies Pakistan signed a Memorandum of Understanding to raise awareness of national cybersecurity and build the capabilities of OIC member states in cybersecurity.\nProf. Dr. M. Iqbal Choudhary, Coordinator General of COMSTECH, signed the MoU on behalf of the Ministerial Committee for Scientific and Technological Cooperation of the OIC.\nOIC can extend its support to Huawei to reach out to universities not just in Pakistan but in all OIC member countries, by using the OIC platform Huawei can be introduced to all the OIC member countries including African countries where there is a fast pace of technological advancements with great potential.\nAs the ink dries on the signed MoU, the journey toward a future defined by robust cybersecurity, cutting-edge AI applications, and the seamless integration of 5G technologies takes a significant step forward.\nThis collaboration stands as a testament to the power of partnerships in shaping the trajectory of technological progress and ensuring a brighter, digitally empowered future for all. Huawei and COMSTECH will cooperate on ICT talent. Young people in OIC member countries can get new ICT technology training and enhance their skills for the future.\nWith the rapid transformation of industries and sectors into online or digital solutions providers, cybersecurity is integral to the continuity, stability, and growth of the economy. Cybersecurity expertise is needed across all industries, most urgently in government, financial services, and health care said a news release.\nCOMSTECH and Huawei would concentrate on the enhancement of OIC’s cybersecurity professional capability, such as security management, security incident response, vulnerability management, and insight into external new security technologies and oversight security requirements; Huawei is a leader in digital transformation, networking, and communication technologies in Pakistan and across the world.\nThe digital economy globally is the engine of economic growth and a driver for sustainable development.\nAs more and more essential services make use of digital transformation, science and technology will determine the economic future of countries. Huawei works closely with governments, communities, and people to expand the frontiers of science and technology, transcend engineering bottlenecks, and bring responsible and secure ICT technology to all industries.\nEthan Sun, CEO of Huawei Pakistan, said, “The MoU will lay the foundations for the OIC member states to access opportunities to promote cybersecurity awareness through knowledge sharing and cybersecurity training courses for governmental entities. Huawei is ideally positioned to share experiences and global best practices, and share expertise and methodologies that have proven successful.”\nHuawei would support COMSTECH to host cybersecurity training based on Huawei cybersecurity practices and experience sharing, to systematically promote cybersecurity awareness and capacity building for COMSTECH selected OIC governmental employees and officers, and participate in some influential regional cybersecurity events and activities, such as GISEC and GITEX.\nAs the leading global ICT solution provider, Huawei has established the first Huawei Global Cybersecurity Transparent Centre, which provides a platform to enhance communication and joint innovation with all stakeholders, public and private. Under the MoU, the COMSTECH members will engage with and at the Cybersecurity Transparency Centre to help build an environment to support the digital economy.\nCOMSTECH and Huawei would work together to catalyze cybersecurity innovation and create knowledge products such as white papers or technical guidelines to showcase OIC cybersecurity advancements and contribute to the industry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:59:07.618Z"
}
