{
  "title": "LESCO detects 307 power pilferers in a day",
  "link": "https://www.app.com.pk/national/lesco-detects-307-power-pilferers-in-a-day/",
  "date_published": "2023-12-12T13:51:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 12 (APP):Lahore Electric Supply Company (LESCO) has detected a total of 307 connections from where the customers were pilfering electricity in all its circles of five districts (Lahore, Sheikhupura, Nankana Sahib, Kasur and Okara) on the 94th day of grand anti-power theft campaign.\nThe LESCO spokesman told media here Tuesday that the company has also submitted FIR applications against 305 electricity thieves, out of which 151 FIRs have been registered in respective police stations, while 11 accused have been arrested.\nGrand anti-power theft operations against electricity thieves are being conducted on the directives of the Federal Power Division and the LESCO Chief Executive Officer (CEO) Engineer Shahid Haider is supervising these operations. The LESCO chief vowed that the operations would continue without discrimination until the complete end of electricity theft. The electricity pilferers as well as the LESCO officers and employees who facilitate them are also being brought to justice.\nOn the 93rd consecutive day of the anti-power theft campaign, the spokesman added, large commercial consumers were also found involved in electricity theft and all of them were disconnected. Among the seized connections were 13 commercial, one industrial and 293 domestic. All the power pilferers were charged with a total of 298,466 units as detection bill amounting to Rs 12.749 million.\nApprising the media about some major power pilferers, he explained that LESCO charged detection units worth Rs 210,000 to an electricity pilferer in Shahdara Town Lahore; Rs 125,000 detection bill to another customer stealing electricity in Factory Area; Rs 120,000 fine to a power thief also in Shahdara Town; and Rs 100,000 detection bill to a power thief in Sharqpur.\nDuring the 94 days of grand anti-theft campaign, the spokesman mentioned, the LESCO detected pilferage on 34,921 power connections and submitted 34,530 FIR applications against electricity thieves in the relevant police stations out of which 33,222 FIRs have been registered, while 15,823 accused have so far been arrested by the police. The LESCO has so far charged a total of 56,961,718 detection units worth Rs 2,234,973,256 to all the power pilferers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:59:10.241Z"
}
