{
  "title": "HEC announces LAW-GAT 2024, for LLB Graduates",
  "link": "https://www.app.com.pk/national/hec-announces-law-gat-2024-for-llb-graduates/",
  "date_published": "2023-12-12T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): The Higher Education Commission (HEC) has announced the schedule of the LAW Graduate Assessment Test (LAW-GAT), which will be held on January 07, 2024.\nAccording to official sources, the Law Graduate Assessment Test is compulsory for all LLB graduates who wish to seek Bar Council Registration. Applications for LAW-GAT 2023 can be submitted online at the HEC portal latest by December 25, 2023.\nThe candidates who have passed a Bachelor’s degree in Law or equivalent from a university recognized by HEC/PBC can register themselves online through http://etc.hec.gov.pk. Applications can be submitted online at the HEC website. The test is compulsory for all LLB graduates before entering the legal profession for practising law.\nThe test will consist of Multiple Choice Questions (MCOs). Applicants who have registered through the HEC online registration process will download their Roll Number Slip through http://etc.hec.gov.pk a week before the test date. Email/SMS will be sent to registered applicants regarding the test date time, and venue. Candidates are required to provide a valid email/mobile number while filling out the online application form. A print of the Roll Number Slip and original CNIC will be required to enter the Test Centre.\nAs per eligibility criteria for HEC Law GAT 2024, the persons having passed a Bachelor’s degree in Law from a university recognized by HEC and PBC are eligible to apply.\nMeanwhile, according to the details of HEC-Law GAT Test Centers, it will be conducted in Islamabad, Lahore, Karachi, Sukkur, Abbottabad, Quetta, Multan, Hyderabad, Turbat, Bahawalpur, Peshawar, Muzaffarabad, Faisalabad and Gilgit.\nThe applicants may select any test Centre from the list available in the application form. The test will only be held at any of the above Centers if a minimum of 250 applicants will select that Centre. Test Centre once selected will not be changed after registration.\nThe candidates are asked to visit the following link: http://etc.hec.gov.pk for online registration, in case of any difficulty during online registration, please visit onlinehelp.hec.gov.pk or visit HEC Secretariat or HEC Regional Centers for guidance.\nIt is worth mentioning here that A 50% score is required to pass the Law Graduate Assessment Test (Law-GAT). The applicants will have to meet other criteria, if any, as per the Rules and Regulations of PBC. The applicants will have a maximum of three chances to clear the Law-GAT test.",
  "retrievedAt": "2025-08-11T10:59:16.366Z"
}
