{
  "title": "Mushaal expresses deep concern over Indian SC’s decision",
  "link": "https://www.app.com.pk/national/mushaal-expresses-deep-concern-over-indian-scs-decision/",
  "date_published": "2023-12-12T18:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Special Assistant to Prime Minister for Human Rights and Women Empowerment, Mushaal Hussein Mullick on Tuesday expressed her deep concern over the Indian Supreme Court’s decision to uphold the revocation of the special status of Indian Illegally Occupied Jammu and Kashmir (IIOJK), stating that it is akin to death sentence for all Kashmiris.\nShe was addressing a seminar to commemorate International Human Rights Day organized by Parliamentarians Commission for Human Rights in collaboration with International Islamic University Islamabad.\nShafique Chaudhry (Executive Director, PCHR), Dr. Raheem Awan (DG Legal Aid and Justice Authority), Dr. Sameena Malik (Rector, IIUI), Dr. Noor Fatima and Syed Muhammad Anwar were among the participant of the Seminar.\nShe said that the ongoing human rights violations by India underscore the shortcomings of the United Nations.\nShe emphasized the necessity for the UN to go beyond mere resolutions and actively pursue their implementation.\nShe pointed out that resolutions related to the Jammu and Kashmir dispute have remained unresolved for 75 years.\nShe emphasized that amidst the conspicuous silence of the UN and international organizations, the alarming situations of genocide were unfolding in Jammu and Kashmir and Palestine.\nShe urged global bodies to break their silence and take proactive measures to address the escalating humanitarian crises in those regions.\nMushaal Hussein highlighted the profound impact of human rights violations when perpetrated by states, leading to extensive mass killings and even genocide.\nDrawing attention to the ongoing destruction in Gaza, she pointed out the restrictive measures preventing International Aid organizations from entering Gaza, exacerbating severe shortages of essential items like medicine and food.\nMoreover, Mushaal Mullick said that contrary to Indian claims, the recent decision by the Indian Supreme Court served evidence that India was not a secular country.\nShe emphasized that minorities in India were confronted with substantial challenges, rendering it nearly impossible for them to live freely.\nMushaal Hussein highlighted that International Human Rights Day stands as a global reminder of the fundamental principles that uphold human dignity, equality, and justice.\nShe emphasized the importance of utilizing this day as an opportunity for individuals, communities, and nations to reflect on the strides made in safeguarding human rights and to address persisting challenges.\nShe called for collective action to protect and promote the rights and freedoms of every individual, regardless of race, gender, religion, or nationality.\nIn discussing the 100-day plan initiated by the Ministry of Human Rights to enhance the state of human rights in Pakistan, she underscored that the plan was more than just a plan—it was a comprehensive human rights charter.\nShe highlighted the plan’s particular emphasis on eradicating gender-based violence and empowering women in society through microfinance schemes.\nShe further stressed the significance of establishing day care centers in prisons, workplaces and educational institutions.",
  "retrievedAt": "2025-08-11T10:58:38.694Z"
}
