{
  "title": "Indian SC verdict on IIOJ&K biased, has no legal standing: Experts",
  "link": "https://www.app.com.pk/national/indian-sc-verdict-on-iiojk-biased-has-no-legal-standing-experts/",
  "date_published": "2023-12-12T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):The recent affirmation by the Indian Supreme Court regarding the abrogation of the special constitutional status of Indian Illegally Occupied Jammu and Kashmir (IIOJ&K) has sparked fervent criticism from legal experts and global observers, who term it biased and politically motivated.\nThe experts see the 476-page biased judgment of the Indian Supreme Court as an attempt to twist the legal and historical facts to fit the agenda of the Indian government it had for future of the disputed region.\nFor Executive Director, Legal Forum for Kashmir (LFK) Advocate, Nasir Qadri the verdict of the Supreme Court seemed predictable under a regime that leaned towards fascism.\n“The observations made by the Chief Justice and other judges during the hearings showed their biased mindset. Now the 476-page judgment has twisted the legal and historical facts to fit their own agenda,” Qadri told APP.\nCritics, including legal scholars and international entities, have voiced apprehensions about the validity and credibility of the decision regarding an internationally recognized disputed territory.\nChairman Kashmir Institute of International Relations (KIIR) Altaf Hussain Wani told APP that the politically motivated decision by the Indian Supreme Court had no standing in front of United Nations Security Council Resolutions.\nHe said the resolutions clearly maintained that no assembly had any power to decide on behalf of state of Jammu and Kashmir or part of it. So, neither Indian parliament, nor Supreme Court or President of India have any legal standing to take decision over sovereignty of IIOJK.\n“I wish Supreme Court of India had courage to visit this resolution,” Wani remarked adding the decision was more political than legal or constitutional one.\nDirector General at Institute of Multi-Track Dialogue, Development and Diplomatic Studies, Professor Dr. Waleed Rasool while talking to APP said the verdict against the due justice was miscarriage of justice.\nHe also maintained that the local courts of India could neither surpass the UN resolutions nor the international law, treaties and conventions. “Kashmir was legitimized dispute and UN resolutions are its concrete base therefore, Indian SC verdict to augment Modi policies on Kashmir cannot change the legal dynamics of Kashmir dispute,”\nAdvocated Nasir Qadri also raised same questions and said, “India is acting under defacto constitutionalism in occupied territory, and no order or judgment can suppress the peoples’ right to self-determination guaranteed by United Nations.”\nHe said, Jammu and Kashmir was being treated as a testing ground by the occupying authorities, adding this judgment seems like another attempt to solidify India’s military occupation and illegal annexation.\n“The court brushed aside the fundamental legal issues related to Article 370 and 35-A and interpret them in a way that suits their own subjective satisfaction,” he remarked .\nMeanwhile, senior Hurriyat leader Mirwaiz Umar Farooq said in a statement in Srinagar, the verdict was not unexpected particularly in the present circumstances while another APHC\nSenior leader Yusuf Naqash maintained that the decision would not deter Kashmiris from pursuing their goal for freedom.\nIt is pertinent to mention that the decision has been vehemently criticized by the pro-India politicians in IIOJK. President Peoples’ Democratic President, Mehbooba Mufti said that it was India that suffered a defeat adding the betrayal has come from them, not us while National Conference President, Omar Abullah said the BJP succeeded in achieving its political objective after 70 years.",
  "retrievedAt": "2025-08-11T10:59:11.239Z"
}
