{
  "title": "Implementation Committee reviews progress on Diamer Basha, Mohmand Dams",
  "link": "https://www.app.com.pk/national/implementation-committee-reviews-progress-on-diamer-basha-mohmand-dams/",
  "date_published": "2023-12-12T09:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): The Implementation Committee on Diamer Basha and Mohmand Dams (ICDBMD), constituted by the Supreme Court of Pakistan reviewed progress on both projects in its meeting held here Tuesday at ICDBMD Secretariat.\nThe meeting which met with Water and Power Development Authority (WAPDA)/ ICDBMD Chairman Engr Lt Gen Sajjad Ghani (Retd) in the Chair, was also attended by Chief Secretary Gilgit Baltistan, Additional Secretary (Budget) Finance Division and Secretary/ Senior Member Board of Revenue Khyber Pakhtunkhwa (KP) via Zoom, said a press release.\nAdditional Chief Secretary (Development) KP, Joint Secretary PM Office, ICDBMD Secretary/Joint Secretary Ministry of Water Resources, Representative of Chief (Water) Planning, Development and Reforms Division and other senior officers were present on the occasion.\nThe Chairman WAPDA while addressing the meeting, expressed satisfaction over the progress made by the ICDBMD and its Sub Committees for early implementation of Diamer Basha and Mohmand Dam Projects.\nThe Chairman said that the Dams Committee has been contributing towards the implementation of both vital projects. He thanked the participants and expressed that the ICDBMD forum can play a pivotal and effective role in overseeing and resolving the issues being faced during the execution of both projects.\nMember (Finance) WAPDA later briefed the meeting on the financial matters of the two projects. General Manager Land Acquisition & Resettlement, Chief Executive Officer Diamer Basha Dam Company and General Manager Mohmand Dam also made detailed presentations to the participants about the progress and the issues relating to both Projects\nThe Committee was informed that the construction work on both Projects is progressing at a good pace. WAPDA has succeeded in diverting River Indus partially at Diamer Basha Dam Project last week through the diversion system constructed for the purpose. Whereas, the land mark for diverting River Indus will be achieved in a couple of days.\nBriefing the participants about the progress on Mohmand Dam, it was apprised that the concerted efforts are being made for completion of diversion of River Swat during the current low-flow season.\nThe Implementation Committee appreciated the progress vis-à-vis status of land acquisition for Mohmand and Diamer Basha Dams, adding that the efforts made by WAPDA and district administrations are commendable.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:59:33.815Z"
}
