{
  "title": "Education minister urges provinces to work with fed govt in resolving education sector problems",
  "link": "https://www.app.com.pk/national/education-minister-urges-provinces-to-work-with-fed-govt-in-resolving-education-sector-problems/",
  "date_published": "2023-12-12T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):Federal Minister for Education and Professional Training Mr Madad Ali Sindhi Tuesday said that all the provinces need to work together with the federal government to resolve all education-related problems.\nHe was charing the 37th Inter-Provincial Education Ministers’ Conference (IPEMC) held here yesterday. The Meeting has been specially called on by the Federal Minister for Education and Professional Training, Mr Madad Ali Sindhi to deliberate on the “Formulation of Uniform National Strategy to Cater the issue of Out of School Children (OOSC)”\nSpeaking on the occasion, Madad Ali Sindhi said that Out of out-of-school children is the biggest challenge we face in addition to quality of education. Madad said that these issues have been given top priority.\nHe said that the quality of education needs to be improved at all levels including schools, colleges and universities. Madad said that we have enough resources to make a difference, we just need to work hard with honesty.\nMadad Ali Sindhi said that the Education Ministry was ensuring that an inclusive approach is taken to devise strategies that benefit students, teachers and parents in every province.\nMadad Ali Sindhi in his remarks said that the meeting was going to play an instrumental role in developing a cohesive plan for providing access to education in all corners of Pakistan.\nHe reiterated that IPEMC’s contributions were going to be significant in the enrollment of Out of out-of-school children (OOSC) including the distance learning interventions.\nHe also assured the provinces that maximum facilitation would be given to them for reaping benefits from these projects.\nMadad said that the Federal Government has a steadfast commitment to address school-related challenges, which is why we have organised this conference to foster an inclusive environment for all provinces to fully participate. Each province will be given the platform to present its plans and formulate practical strategies to address challenges related to out-of-school children.\nMadad said that he hopes that the conference successfully fulfils its objective of formulating a uniform national strategy to tackle challenges faced by children outside the school system. The minister was told that Rs. 25 Billion has been allocated to address the out-of-school problem.\nHe was apprised of the out-of-school children crisis, in addition to pivotal updates on education initiatives. IPEMC discussed the establishment of a Challenge Fund of 25 billion for Out of School Children.\nThe conference delved into a detailed progress update on the Performance-Based Grants allocated to provinces, a crucial initiative through ASPIRE. IPEMC also discussed the establishment of a ‘Foundational Learning Hub’ in the Ministry of Federal Education and Professional Training which will launch a Foundational Literacy Policy in 2024.\nThe Federal Board of Intermediate and Secondary Education presented ongoing reforms in the assessment system, underscoring the commitment to elevate the educational landscape.\nSimilarly, a comprehensive presentation on E-Taleem, an electronic education initiative strategically designed to transform the education sector, was given to update all the stakeholders on the ongoing progress.\nHe was further briefed that the Federal Government has notified the Syllabus for 9th – 12th grade as well. Secretary Education, Waseem Ajmal Chaudhary welcomed the participants and provided an introduction to IPEMC and an overview of the core agenda of the meeting.\nHe said that the Federal Government intends to extend the special focus on the OOSC agenda by allowing all provinces to participate and brief regarding their statistics, strategies and challenges while working on catering for the problem of out-of-school children.\nSimilarly, he urged the provinces to cooperate with the federal in terms of sharing data, incorporating Reading Hour in schools and increasing the usage of the school App launched by the Ministry of Federal Education and PTCL.\nThe Ministry of Federal Education and Professional Training highlighted the achievements under the ASPIRE program, through which the federal government provides substantial performance-based financial grants to provinces to work against specific indicators.\nFor this year, under the program, it was highlighted that the following commitments will be achieved by the provincial education departments and federal ministry: development and notification of foundational literacy policies to ensure emphasis on foundational learning in early grades, data standardisation to enable standardised data collection and analysis across Pakistan, the implementation of the international assessment, Literacy and Numeracy Assessment (LaNA) and the establishment of the National Education Open-Source Data Portal at the Federal level.\nEducation Minister Punjab Mr Mansoor Qadir, Education Minister Balochistan Dr Qadir Bux Baloch, and Education Minister GB Mr Ghulam Shahzad attended the meeting in person. Education Secretaries of all provinces and Federal Education Secretary Mr. Waseem Ajmal Chaudhary in addition to representatives from FBISE, HEC department Lahore, PMDIU Lahore, Foundation Hub, ASPIRE,  PPDU, HEC, PIE and PTCL also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:59:04.264Z"
}
