{
  "title": "Only plebiscite, not any country’s court to decide future of Kashmiris: PM",
  "link": "https://www.app.com.pk/national/only-plebiscite-not-any-countrys-court-has-right-to-decide-future-of-kashmiris-pm/",
  "date_published": "2023-12-12T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday said that as per the United Nations Security Council’s resolutions, the sole method to determine the future of Kashmir and its people was through a plebiscite and no country’s high court or supreme court possessed the authority to decide on the matter.\nThe prime minister, in an interaction with the participants of the 12th National Balochistan Workshop, said that he would be attending the special session of the AJK Legislative Assembly the day after tomorrow from where he would lead the movement against the Indian Supreme Court’s decision to uphold the revocation of Article 370.\nHe said the laws could not help make colonies, though they could help establish occupation for a limited period.\nThe prime minister reiterated that Pakistan would continue extending moral, political and diplomatic support to the Kashmiris and would raise the issue at the European Union and other multilateral forums.\nTo a question, he said taxation was one of the biggest challenges for the country as 80% of the economy was undocumented with the informal private sector being a non-contributor but beneficiary of the government’s initiatives and facilities. Besides, the formal private sector feels resentful of undue taxation, he added\nThe prime minister said the government was trying its best to pursue the privatization spree without being scandalized by ensuring meritocracy and leaving behind a blueprint for the elected government.\nCalling the energy sector losses a nightmare, he said the PIA had a debt of Rs900 billion and called for choosing between running the country and the PIA.\nResponding to another query, he said the government was looking for financing for the Khuzdar-Karachi road and expected the same from any GCC countries through BOT basis.\nHe told a questioner that some agriculture-related projects were under consideration for Balochistan under the Special Investment Facilitation Council. He said some projects under climate finance had been identified.\nRegarding a question about the joint ventures with Iran in the field of film production, the prime minister said the government would facilitate it, if they received any such proposal. He said China had immense potential for such productions and that he had also raised the matter at the highest level which followed the interaction between the two sides.\nTo a question, Prime Minister Kakar said this was high time for an evaluation of spending of the NFC funding following the 18th amendment as accountability was essential to make the country a functional democracy.\nTo a question, he said women’s empowerment was inevitable for the country which should be ensured at all levels including homes by changing attitudes towards women.\nThe prime minister said that before thinking about the number of graduates, the country needed to review its education quality. He said he had appointed a special assistant to focus on the improvement of the quality of medical education.",
  "retrievedAt": "2025-08-11T10:58:38.711Z"
}
