{
  "title": "PM for collective efforts at sustainable educational opportunities for females",
  "author": null,
  "content": "ISLAMABAD, Jan 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday called upon the global and local organizations, philanthropists and entrepreneurs to join hands in creating scalable and sustainable opportunities for ensuring education to women.\nAddressing a two-day International Conference on “Girls’ Education in Muslim Communities: Challenges and Opportunities,” as a chief guest, the prime minister said that in the next decade, millions of young girls would enter the jobs market with immense prospects for social and economic prosperity. “As they do so, they have the potential to not just lift themselves, their families and the nation out of the poverty but also to enrich the global economy, new markets and find innovative solutions to their shared challenges,” he observed.\nThe prime minister also stressed that they should assure the womenfolk that their rights should be respected and their ambitions be met, besides, no cultural or social impediment stood in the way of achieving their dreams. He said despite their rich legacy, the Islamic world, including Pakistan, was facing numerous challenges in ensuring access to education for girls, adding that denying education to girls, amounted to denying their rights and voice and denying them their right to bright future.\nIn Pakistan, the prime minister said women made half of the total population, yet the female literacy rate stood at 49 percent only, while alarmingly around 22.8 million children, with age bracket of five to eight years, were out of schools, including a proportionate number of girls. The inadequate infrastructure, safety concerns, as well as deeply entrenched societal norms further exacerbated the issue, creating a cycle of deprivation, spanning over generations, he regretted.\nThe prime minister said the founding father Quaid-e-Azam Muhammad Ali Jinnah was a strong advocate for women’s role in nation building. Quaid-e-Azam had stated “No nation can rise to the height of glory unless your women are side by side with you,” and advised that the magnitude of these problems might be considerable but they should keep fighting for their cause by committing resources and raising their voice, he recalled.\nThe prime minister further elaborated that one of the major steps to addressing the educational disparities in Pakistan was the establishment of Danish schools during his tenure as chief minister Punjab. It was a unique initiative to provide quality education to the deprived population and to the unprivileged students in the under-developed rural areas. Without this opportunity, their talent would have been lost in the dusty streets of their remote villages, he added.\nThe prime minister said this initiative was now replicated in different far-flung areas of Pakistan, paving way for a promising and inclusive future. He also expressed his satisfaction over presence of girl students in the ceremony, who had graduated from these schools. Their presence was a testimony to their efforts and culmination of a collective dream as these students embodied the hope and nation’s bright future, he added.\nThe prime minister said through the youth programmes, the government was committed to providing quality education and creating jobs, and offering meaningful opportunities which included scholarships, vocational training and demand driven skills in AI, data and cyber security etc; as well as, provision of free laptops to the high achievers. He said the pursuit of knowledge was the sacred duty of every Muslim regardless of gender as emphasised upon by the Holy Prophet (Peace Be Upon Him).\nHis all-inspiring message was preached in the society which was still in darkness and in denial of the basic rights to women, and to address these grave injustices, Islam introduced a transformed social paradigm which declared the pursuit of knowledge as the true measure of social development, he added. The prime minister said history witnessed to the resilience and determination of women who thrived in the limited spaces afforded to them, breaking the shackles of societal servitude and leaving their deep marks on the society from the early days of Islamic history and cited Hazrat Khadijah (RA) who stood an inspiring example of a successful businesswoman.\nAt home, he said they celebrated, Mohtarma Fatema Jinnah, the mother of the nation, who stood shoulder to shoulder with her brother Quaid e Azam Muhammad Ali Jinnah while spearheading Pakistan Movement. Mohtarma Benazir Bhutto broke the political ceilings to become the first female prime minister in the Muslim world, inspiring and paving the way for women at all levels, he added. The prime minister also mentioned late Arfa Kareem who made history as the youngest Microsoft certified professional at the tender age of nine years.\nToday, he said the dynamic political leaders like Maryam Nawaz, the first chief minister in Pakistan was leading a province and continuing to inspire women in the political, social and economic empowerment. The prime minister expressed his gratitude to King Salman and Crown Prince Mohammed bin Salman for their support and patronage of the conference. He also extended gratitude to the Muslim World League for its unwavering commitment to education. The prime minister also announced the signing of Islamabad declaration in line with the UNSC objectives, and to reflecting a collective aspiration of the ummah. While speaking on the occasion, Minister for Education Khalid Maqbool Siddiqui said the government was taking steps to increase the number of schools in the country.\nSpecial attention was being paid on education of girls, free transport for girls, vocational training and training of teachers, he added. Secretary General of the Organization of Islamic Cooperation (OIC) Hissein Brahim Taha said education of girls was important for progress of a society. He expressed concern that girls were being deprived of education in Palestine.\nSecretary General of Muslim World League (MWL) Muhammad Bin Abdul Karim Al-Issa stressed that it was obligatory on men and women to acquire education, adding, “We have to stress on the importance of education of girls.” The conference aimed at addressing the challenges and opportunities in advancing girls’ education across Muslim communities worldwide; foster dialogue; and find actionable solutions to address the challenges. The event brought together over 150 international dignitaries, including ministers, ambassadors, scholars and academia from 44 Muslim and friendly countries, OIC Secretary General, General Secretary Muslim World League, representatives from the international organizations including UNESCO, UNICEF, and the World Bank.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:33:32.000Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-for-collective-efforts-at-sustainable-educational-opportunities-for-females/",
  "dateList": "2025-01-11",
  "date_published": "2025-01-11T08:27:00.000Z"
}
