{
  "title": "Pak-China relations to continue to grow stronger: Chinese ambassador",
  "author": null,
  "content": "ISLAMABAD, Jan 11 (APP): Ambassador of China to Pakistan Jiang Zaidong on Saturday said that Pak-China strategic cooperation would continue to deepen under the leadership of two countries.\nAddressing the launching ceremony of “Embracing the Chinese New Year 2025”, the ambassador said that last month, Khunjerab-Sost Pass realized the all-year-round function, becoming a landmark progress in China-Pakistan relations in the new era, and once again demonstrating the deep foundation of the ironclad friendship.\nHe said that the Chashma Nuclear Power Plant Unit 5, which can create 40,000 jobs directly and indirectly during the peak period of construction, has officially started, showing the huge potential of practical cooperation between the two countries.\nZaidong said, “We stand ready to continue to strengthen the development strategies with Pakistan, deepen mutually beneficial and win-win cooperation, forge an upgraded version of the CPEC construction, and accelerate the building of a closer China-Pakistan community of shared future in the new era, to better benefit the two countries and their peoples.”\nHe said that in the past year, President Xi Jinping maintained close communication with the President and Prime Minister of Pakistan and reached an important consensus on promoting China-Pakistan all-weather strategic cooperation, especially on forging an upgraded version of CPEC.\nHe said China’s economy has continued to stabilize and improve. The annual GDP is expected to exceed 130 trillion yuan.\nHe added total grain output has reached a new level of 1.4 trillion jin for the first time, the annual output of new energy vehicles has exceeded 10 million for the first time, the annual express delivery volume surpassed the 150-billion-parcel mark for the first time, and the annual passenger volume of China’s railway network has exceeded 4 billion for the first time.\nThis is the result of joint efforts of people of all groups across China, as well as the positive contributions of overseas Chinese, including those in Pakistan, he added.\nZaidong said, “I hope and firmly believe that everyone will further forge a strong sense of community of the Chinese nation, more actively support the development of China, promote China-Pakistan cooperation, and make new and greater contributions to comprehensively promoting the construction of a strong country and the great cause of national rejuvenation with Chinese modernization.”\nHe said that the embassy is the home of our compatriots overseas. “We will provide service with heart and soul so that everyone can feel the warmth of the motherland.”\nThe ambassador said, “We stand ready to provide new opportunities for the world with the new development of Chinese modernization, and first benefit to our iron friend Pakistan.”\nHe expressed gratitude to the President and Prime Minister of Pakistan for writing to President Xi Jinping on the earthquake in Dingri county, Xizang. In the letters, they expressed sincere condolences and Pakistan’s willingness to provide all possible assistance, he added.\n“We firmly believe that regardless of sudden natural disasters or complex and severe external environments, we can overcome difficulties and move forward courageously, and continuously push forward the great cause of building a strong country and achieving national rejuvenation.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:33:08.678Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-china-relations-to-continue-to-grow-stronger-chinese-ambassador/",
  "dateList": "2025-01-11",
  "date_published": "2025-01-11T12:56:00.000Z"
}
