{
  "title": "Pakistan’s IT exports to surpass $3billion this year: IT Minister",
  "link": "https://www.app.com.pk/national/pakistans-it-exports-to-surpass-3billion-this-year-it-minister/",
  "date_published": "2022-05-30T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Minister for IT & Telecommunications Syed Amin-Ul-Haque on Monday said that Pakistan would surpass $3 billion IT exports target this year due to export boosting steps taken by the ministry.\nAddressing a graduation ceremony held at incubation centre of Lahore University of Management Sciences (LUMS), he said country’s IT exports had crossed $2.1 billion due to congenial investment atmosphere provided in Pakistan.\nHe said that the investments of Pakistani start-ups grew by almost five times as compare to 2020 and MOITT through Ignite have been providing both local and international networking platforms to our start-ups to pitch their business ideas and products to potential customers and investors, said a message received here.\nMinister for IT and Telecommunication, Syed Amin Ul Haque advocated for the role of technology in the government’s mission to grow the entrepreneurial ecosystem of Pakistan.\nSyed Amin-Ul-Haque further said that National Incubation Centers (NIC) in Islamabad, Lahore, Peshawar, Karachi and Quetta has not only facilitated many like you to work and build on ideas which promote and encourage the investment infrastructure in Pakistan but also towards an accelerated economy.\nThese National Incubation Centers were the platform and Ministry was the facilitator.\n“The newly established incubation centers of Hyderabad and Faisalabad would help us expand and tap into the potential of Sindh and Punjab, we wish to provide the youth of a fora to bring your ideas into reality” he added.\nLUMS, Vice Chancellor, Dr. Arshad Ahmad, Ignite CEO, Asim Shahryar Husain, NITB Executive Director and Board of Ignite Chairman, Syed Husnain Abbas Kazmi other official were present at the occasion.\nMinister was introduced to NIC Lahore alumni and later visited the different parts of NIC including a state-of-the-art Makers Lab.\nIgnite, CEO Asim Shahryar Husain, stated that Ignite would launch at least five more NICs in new cities of Pakistan.\nNITB Executive Director & Ignite Board Chairman Syed Hussnain Abbas Kazmi in his address to the graduating start-ups encouraged the entrepreneurs to continue on the path of innovation and reaffirmed the support of the government in their endeavors.\n“We are eager to refurbish the infrastructure of our entrepreneurial endeavors with modern day ideas,” said LUMS, Vice Chancellor, Dr. Arshad Ahmed.\nEarlier while briefing the audience, Project Director NICL, Nauman Zaffar, reinforced the center’s vision to inspire, enable and facilitate the next generation of Pakistan’s problem solvers. He said, National Incubation Center Lahore at LUMS funded by Ignite passionately supports and enables ideas which create value in Pakistan.\nPitch presentations were also given by the winning start-ups about their products and future plans. Ignite’s forecast for investment in Pakistani start-ups this year was between $500-$600 million.\nEarlier, during the graduation and prize distribution ceremony, a cash prize was awarded to the three strongest graduates.\nThe first prize was given to QBio, a life sciences venture establishing Pakistan’s leading enzyme biotechnology company; the second prize went to Dawa Asaan, Pakistan’s first smart pharmacy providing pre-sorted and pre-packed medicines for chronic illness patients on a monthly subscription;\nand third prize went to Peervest Global, a digital equity-based crowd funding platform that connects tech-enabled start-ups with eligible investors to provide funding and networking opportunities.",
  "retrievedAt": "2025-08-11T14:59:29.914Z"
}
