{
  "title": "PM to pay 3-day official visit to Turkey from May 31: FO",
  "link": "https://www.app.com.pk/national/pm-to-pay-3-day-official-visit-to-turkey-from-may-31-fo/",
  "date_published": "2022-05-30T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): Prime Minister Muhammad Shehbaz Sharif will pay a three-day visit to Turkey from Tuesday to hold talks with President Recep Tayyip Erdogan on bilateral relations and exchange views on regional and international issues.\nThis will be the Prime Minister’s first visit to Turkey since assuming office.\nPresident Recep Tayyip Erdoğan was the first world leader to call the Prime Minister on 11 April 2022 to felicitate him. The two leaders also spoke on telephone on the occasion of Eid-ul-Fitr.\nThe Prime Minister will be accompanied by a high-level delegation including Ministers, Special Assistants to PM (SAPMs), and senior officials.\nA business delegation from Pakistan comprising representatives of leading companies across various sectors will travel separately to Turkey to participate in the business engagements, Foreign Office said in a statement issued here Monday.\nDuring the May 31-June 02 visit, the Prime Minister will have tete-a-tete with President Erdoğan. This would be followed by delegation-level talks.\nBesides covering the entire gamut of Pakistan-Turkey bilateral relations, the two leaders will exchange views on regional and international issues.\nBoth leaders will address a Joint Press Stakeout after their meetings. President Erdoğan will host a dinner in honour of the Prime Minister.\nThis year, Pakistan and Turkey are celebrating the 75th anniversary of the establishment of diplomatic relations.\nDuring the visit, the Prime Minister of Pakistan and the President of Turkey would jointly unveil a logo, marking the commencement of celebrations of this important milestone in the long history of exceptional bilateral ties.\nThe Turkish Ministers of Foreign Affairs, Trade, and Health would call on the Prime Minister during the visit.\nThe Prime Minister will have extensive interaction with leading Turkish businessmen and potential investors from diverse sectors. He will be hosted by President of the Union of Chambers and Commodity Exchanges of Turkey (TOBB).\nThe Prime Minister will also attend a Pakistan-Turkey Business Council Forum, hosted in collaboration with DEIK (Turkish Foreign Economic Relations Board).\nDuring these events, the Prime Minister will highlight Pakistan’s vast investment potential and encourage Turkish companies to invest in Pakistan and work to strengthen Pakistan-Turkey trade and economic ties.\nProminent businessmen from Pakistan will participate in these events and will also hold Business to Business (B2B) meetings on the sidelines.\nThe relationship between Pakistan and Turkey is underpinned by structured institutional mechanisms.\nThe High-Level Strategic Cooperation Council (HLSCC) is the primary platform at the leadership-level, which has been instrumental in further cementing bilateral relations. So far, six sessions of the HLSCC have taken place. The 7th session is slated to take place this year.\nThe historic and long-standing relations between Pakistan and Turkey are firmly anchored in common faith, shared history, and a glorious tradition of mutual support to each other on issues of core interest.\nThe Turkish leadership and government have steadfastly supported the just cause of Kashmir. Turkey is an important and active member of the OIC Contact Group on Jammu and Kashmir.\nThe two countries have convergent views on a range of issues including peaceful and stable Afghanistan, Palestine, and countering Islamophobia.\nA large number of Turkish companies have invested more than 1 billion USD in different sectors (construction, power, solid waste management, hygiene products, electronics and dairy etc) in Pakistan.\nProminent investors include Al Bayrak, Oz Pak, Zorlu, Arcelik, Siyahkalem, Sutas, Coca-Cola Icecek, and Hayat Kimiya. Heads of selected Turkish companies will also call on the Prime Minister during his stay in Ankara.\nBesides being part of regular high-level exchanges between the two countries, the Prime Minister’s visit to Turkey is important in the context of deepening and broadening bilateral cooperation in the areas of trade, investment, regional connectivity, health, education, culture and people-to-people relations.\nIt will help in further strengthening the leadership dialogue and existing multi-dimensional strategic relationship between the two countries and will impart fresh impetus to the efforts to take this unique partnership to new heights, the statement concluded.",
  "retrievedAt": "2025-08-11T14:59:29.117Z"
}
