{
  "title": "President rejects FBR’s 25 representations with direction to bring unregistered sugar dealers into tax net",
  "link": "https://www.app.com.pk/national/president-rejects-fbrs-25-representations-with-direction-to-bring-unregistered-sugar-dealers-into-tax-net/",
  "date_published": "2022-05-30T09:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP): President Dr Arif Alvi on Monday directed the Federal Board of Revenue (FBR) to bring into the tax net the unregistered wholesalers, dealers or distributors of sugar.\nThe president passed these directions while disposing of 25 identical representations filed by FBR against the orders of the Federal Tax Ombudsman (FTO), with a direction to the FBR to bring unregistered sugar dealers into the tax net to improve sales tax collection and reporting compliance within 90 days.\nHe observed that despite making huge monetary transactions and the availability of their data with FBR, these unregistered buyers of sugar largely remained outside the tax net and evaded the prime national responsibility of paying taxes.\nAs per details, FTO had initiated an Own Motion investigation against the failure of FBR to bring into the tax net the unregistered buyers of sugar from sugar mills in the country.\nThe FTO observed that non-NTN holders were buying huge quantities of sugar from mills and their data was fully accessible by the FBR, however this huge potential for tax collection remained unutilized.\nIn its report, the FTO highlighted that a large amount of sugar was supplied by the mills to various unregistered buyers, but the FBR did not pay due attention to broadening the tax base.\nIt further observed that this low-hanging fruit had not yet been harvested and despite making huge monetary transactions, the unregistered buyers of sugar remained out of the tax net.\nThe FTO underscored that unregistered persons were easily identifiable because sugar mills were required to maintain records of supplies made during the tax period and issue tax invoices indicating names, addresses, description, quantity, values of goods, CNIC, or NTN of persons to whom the supplies were made under the Sales Tax Act of 1990.\nFurthermore, the Department has full access to various bank accounts of Sugar Mills and thereof the actual buyers can be tracked by analysing major credits appearing in the said accounts.\nBased on these findings, FTO had directed to enforce compliance after obtaining data of unregistered persons from the sugar mills and sharing it with the concerned Regional Tax Offices to broaden the tax base.\nThe FBR had filed a representation with the President against this order of FTO contesting its jurisdiction of taking suo moto action in such matters.\nPresident Dr Arif Alvi disposed of the matter with the observations that FBR’s field formations were not vigilant in collecting information related to unregistered buyers and were content with just whatever was being submitted in the monthly sales tax returns of mills.\nHe regretted that the data of unregistered buyers were not being examined for the purpose of broadening the tax net.\nHe noted that FBR’s field formations held jurisdiction over sugar mills and could secure the complete particulars of all buyers by proper and timely analysis of withholding statements.\nHe said that serious negligence and inefficiency on part of the field formations of FBR in the discharge of its duties was tantamount to maladministration.\nHe observed that FTO’s recommendations were only a reiteration of the duty of FBR to strictly deal with unregistered sugar dealers to bring them under the tax net.\nThe President held that under section 9 (1) of the FTO’s Ordinance, 2000, FTO was authorized to initiate suo moto Investigation against any alleged maladministration on the part of the Revenue Division or any tax employee, therefore, the representations deserved to be disposed of accordingly.",
  "retrievedAt": "2025-08-11T14:59:21.115Z"
}
