{
  "title": "HEC academy launches National Faculty Development Programme",
  "link": "https://www.app.com.pk/national/hec-academy-launches-national-faculty-development-programme/",
  "date_published": "2023-11-17T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): The National Academy of Higher Education (NAHE) launched the first cohort of the In-Service National Faculty Development Programme (NFDP) for newly appointed faculty members in higher education institutions on Friday at Higher Education Commission (HEC).\nThe programme aims to equip new faculty members with the strategies and tools they need to overcome challenges faced by learners and develop critical thinking and practical skills in students, aligning them with the demands of the job market and society.\nTwenty-two faculty members from public sector Higher Education Institutions (HEIs) in the Federal Capital, Rawalpindi, Azad Jammu & Kashmir, and Gilgit Baltistan are actively participating in the training, which is scheduled to conclude on November 30, 2023.\nSpeaking at the inaugural ceremony of the programme, Awais Ahmed, Adviser (Global Engagement and Quality Assurance) at HEC, emphasized the significant impact of such programmes on teachers’ and students’ learning achievements. He urged participants to actively engage in knowledge sharing and idea exchange throughout the different sessions of the programme.\nNoor Amna Malik, Managing Director of NAHE, welcomed the participants and highlighted the value of the opportunity presented by the NFDP. She encouraged participants to make the most of the programme and noted that NAHE has engaged esteemed resource persons to deliver various modules, ensuring the highest quality of training.\nTo achieve the learning objectives of the programme, a variety of activities will be utilized, including daily interactive sessions, group projects, presentations, and assignments related to different modules. These activities are designed to foster active participation, engagement, and the practical application of the knowledge gained.\nThroughout the training, sessions will cover various topics, including Effective Teaching and Learning, Course Design, Lesson Planning and Delivery, Assessment and Evaluation, Technology in the Classroom, Learning Management Systems, Grant Writing, Publishing Research, Industry-Academia Linkages and Entrepreneurship, Personal and Professional Development, and Gender Harassment.\nThe NFDP is a valuable initiative that will help to improve the quality of teaching and learning in higher education institutions across Pakistan.",
  "retrievedAt": "2025-08-11T10:33:14.545Z"
}
