{
  "title": "FDE directs institutions’ heads to involve students in clean, healthy environment activities",
  "link": "https://www.app.com.pk/national/fde-directs-institutions-heads-to-involve-students-in-clean-healthy-environment-activities/",
  "date_published": "2023-11-17T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): Federal Directorate of Education (FDE) has directed the heads of educational institutions specifically to encourage students to actively participate in ensuring a clean and healthy environment without compromising routine academic activities.\nAccording to a notification regarding FDE guidelines on hygiene, the students are kept away from hazardous chemicals, students and staff are instructed on proper use of toilets, cleaning sinks and countertop surfaces and toilet floor after use.\n“Given the size of our educational institutions, it is often a challenging task for custodial staff to manage cleaning and maintenance tasks alone,” said Riffat Jabeen, Director Academics, Federal Directorate of Education (FDE) while talking to APP on Friday.\n“It is common that students litter the premises by throwing waste here and there even in the presence of waste bin,” she remarked. “Therefore, teachers emphasize the importance of cleanliness and hygiene during their lectures.” She said the Head Teachers ensure cleaning supplies like disinfectants, toilet brushes, mops and cleaning clothes.\nKeeping in view the importance of hygiene facilities, the Federal Government has started the “Oral Hygiene Program” at 423 public sector schools and colleges under the Federal Directorate of Education (FDE).\nUnder this Program, the Ministry of Federal Education and Professional Training distributes ‘Hygiene Kits’ among students of government educational institutions within the ICT jurisdiction.\n“Under the Hygiene Kits program started in April 2023, as many as 100,000 kits have been distributed among students,” Riffat Jabeen said. “Doctors are also engaged to guide students on health and hygiene issues.”\nBut, despite her claims, there are complaints of missing facilities especially at female schools, as poor cleanliness and substandard food supplied by canteens inside the institutions and private vendors outside, was proving to be hazardous for students’ health.\nIn many cases, there is also a deficiency of bathrooms as compared to the number of students with many needing immediate repair and up-gradation as Director Monitoring FDE Malik Sohail assured to bridge this gap and claimed that these facilities would be provided sooner. “Hygiene conditions are far better now than the past especially at institutions where the Principal and staff are active,” he said.\nAs most of the buildings are properly cared of, there are instances of old and worn out furniture, soggy walls with falling whitewash and dirty floors, making the rooms’ environment stinky.\nCaretaker Education Minister Madad Ali Sindhi had directed FDE to provide a detailed proposal for the maintenance of facilities. “The government would provide necessary funding for up-gradation of the facilities.”\nHe also directed the FDE to regularly conduct an audit of food quality and cancel the contract of those involved in selling unhygienic food.\nAlthough the government has initiated multiple measures to promote better hygiene at educational institutions, still there are challenges like inadequate attention to hygiene concepts in the curricula, an un-conducive environment and a communication gap between teachers and parents.\nTherefore, the authorities must adopt a holistic approach by involving all stakeholders to promote hygiene, revise the curriculum and raise awareness among teachers, parents and students.",
  "retrievedAt": "2025-08-11T10:33:34.832Z"
}
