{
  "title": "Improved screening facilities vital for early detection of breast cancer: Samina Alvi",
  "link": "https://www.app.com.pk/national/improved-screening-facilities-vital-for-early-detection-of-breast-cancer-samina-alvi/",
  "date_published": "2023-11-17T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): First Lady Samina Alvi on Friday called on the hospitals, non-governmental organizations, and civil society to work on improved screening facilities at medical setups to help detect breast cancer among women at early stages.\nSpeaking at a breast cancer awareness event, she said early diagnosis through mammogram and ultrasound could increase the survival rate of patients by 98 percent.\nThe event organized by Maroof International Hospital in collaboration with the National Press Club here at the Aiwan-e-Sadr highlighted the importance of a long-term and widespread campaign against breast cancer to reduce the alarming 40,000 deaths of women in the country every year.\nSamina Alvi expressed satisfaction that her sustained campaign from the platform of the Presidency helped increase reporting about breast cancer cases in the first and second stages.\nShe said early diagnoses could save the lives of thousands of women in the country.\nAs part of the breast cancer awareness drive, she mentioned that the Pakistan Telecommunication Authority through cellular services relayed 140 million text messages and ringtones in the Urdu language.\nThe relayed messages encompassed information for the general public about breast cancer, its symptoms, self-examination, and timely treatment, she added.\nShe urged women to practice five-minute self-examination on a monthly basis and urgently seek medical advice on detecting any abnormal lump.\nSamina Alvi lauded Maroof International Hospital for offering screening facilities of discounted mammograms and ultrasounds till December 31 for the detection of breast cancer and called upon other hospitals to follow suit.\nShe also urged national and local media to continue highlighting the disease through their programmes on a regular basis throughout the year.\nCEO Maroof International Hospital Haroon Naseer said the awareness campaign under the patronage of the First Lady resulted in an increased number of reported cases of breast cancer patients, thus reducing the mortality rate. He vowed continued support of the breast cancer awareness programme through screening facilities at his hospital.\nFinance Secretary Nayyar Ali said the National Press Club and the journalist community were committed to raising awareness about breast cancer through television programmes and newspaper articles.\nA panel discussion was held on the occasion in which doctors from the departments of oncology, radiology, and gynecology spoke about the importance of early screening.\nThe medical experts emphasized proper guidance for women on how they could approach medical advice after the detection of a lump during self-examination.\nThe panel also recommended screening and mammograms for women above 40 years of age to rule out any possibility of breast cancer.",
  "retrievedAt": "2025-08-11T10:33:41.153Z"
}
