{
  "title": "No space for intolerance, extreme behaviour against anyone: COAS",
  "link": "https://www.app.com.pk/national/no-space-for-intolerance-extreme-behaviour-against-anyone-coas/",
  "date_published": "2023-11-17T14:59:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 17 (APP): Chief of Army Staff (COAS) General Syed Asim Munir on Friday said there was no space for intolerance and extreme behaviour by against anyone, particularly against minorities and vulnerable segments of the society.\nHe made these remarks in an interaction with leading Islamic scholars (Ulema and Mashaikh) of all schools of thought here at the General Headquarters, an Inter-Services Public Relations (ISPR) news release said.\nThe Ulema and Mashaikh unanimously condemned extremism, terrorism and sectarianism, and pledged their continued support for the untiring efforts being made by the State and security forces for bringing tolerance, peace and stability in the country.\nThey underscored that “Islam is a religion of peace and harmony, and its any skewed and distorted interpretations by certain entities is for their vested interests only and has nothing to do with Islamic teachings”.\nThe COAS, while lauding the ‘Paigham-e-Pakistan’ decree by religious scholars to nullify misleading propaganda disseminated by extremists and terrorists, called upon the Ulema and Mashaikh for its propagation and implementation in letter and spirit, and shun internal schisms.\nThe Army Chief signified the role of Ulema in harnessing youth towards understanding of Quran and Sunnah and character-building alongside other academic knowledge and technical skills.\nThe forum unanimously supported the government’s steps, including repatriation of illegal foreigners, implementation of the One Document Regime, anti-smuggling and hoarding measures, and anti-power theft drive.\nIt also fully acknowledged Pakistan’s position and concerns on terrorism emanating from the Afghan soil and urged serious actions by Afghanistan to address Pakistan’s concerns.\nThe forum also expressed anguish on the ongoing conflict in Gaza and atrocities being committed against hapless people of Gaza and termed them crimes against humanity.\n“Pakistan belongs to all Pakistanis without any religious, provincial, tribal, linguistic, ethnic, sectarian or any other distinction. Use of force and armed action by any militia, entity or group other than state is unacceptable”, the COAS concluded.",
  "retrievedAt": "2025-08-11T10:33:13.790Z"
}
