{
  "title": "Pakistan, Turkiye vow to deepen ties in Science and Technology",
  "author": null,
  "content": "ISLAMABAD, Apr 16 (APP):Federal Minister for Science and Technology, Khalid Hussain Magsi in a meeting with the Ambassador of Turkiye to Pakistan, Irfan Neziroglu reaffirmed exploring new avenues for bilateral cooperation and enduring friendship between the two nations.\nDuring the meeting, the two dignitaries highlighted the historic ties between Pakistan and Turkiye and expressed a strong commitment to enhancing collaboration, particularly in the fields of science, education, and technology.\nKhalid Magsi emphasized the vast potential for scientific and technological cooperation between the two brotherly countries.\nHe underscored the significance of joint initiatives, collaborative research, and technology transfer in fostering development and innovation, and reiterated Pakistan’s resolve to open a new chapter of strategic partnership in science and technology with Turkiye.\nBoth sides agreed to elevate their partnership to new dimensions, reflecting their shared vision for regional peace, stability, and prosperity.\nKhalid Magsi noted the importance of long-term strategic cooperation rooted in mutual trust and shared values.\nIn addition to bilateral matters, the leaders condemned the ongoing Israeli aggression in Gaza.\nKhalid Magsi voiced serious concern over the targeting of innocent Palestinian civilians, particularly women and children, terming it a blatant violation of human rights.\nHe called on the international community to take concrete and practical steps in support of the oppressed Palestinian people. The meeting concluded with a renewed pledge to work closely for mutual progress and to uphold shared values on regional and global platforms.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:32:43.833Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-vow-to-deepen-ties-in-science-and-technology/",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T17:10:00.000Z"
}
