{
  "title": "PR overhauls 33 diesel electric locomotives",
  "author": null,
  "content": "ISLAMABAD, Apr 16 (APP):Pakistan Railways has completed special repairs of around 33 diesel electric locomotives and rehabilitated 36 German coach shells with bogies over the past three years.\nTalking to APP, an official from the Ministry of Railways said that the work was carried out at the Pakistan Locomotive Factory in Risalpur — the country’s only locomotive manufacturing facility, commissioned in 1993.\nThe factory has an annual production capacity of 25 locomotives on a single-shift basis and spans 257 acres, including a 100-acre factory and a 157-acre residential colony.\nIn addition to locomotive repairs, the factory has rehabilitated 200 BG-64 bogies and conducted special repairs on 15 AGE-30 class diesel electric locomotives under the Public Sector Development Programme (PSDP). Special repairs of 100 newer locomotives are currently in progress.\nThe official also said that production of 230 ZBKC wagons is underway, including 115 Semi-Knocked Down (SKD) ZBKC units under the 800 HCW project and 20 Brake Vans (BV) already completed. Manufacturing of the remaining 115 Completely Knocked Down (CKD) ZBKC wagons is in progress.\nPakistan Locomotive Factory is also manufacturing spare parts for other divisions of Pakistan Railways using in-house technology, reverse engineering, and design modifications to meet operational requirements.\nMoreover, rehabilitation of 500 BG-64 economy class coaches is currently ongoing, the official added.\nOn land management, the official said that Pakistan Railways leases its land through open auctions under the Railway Property & Land Rules, 2023, approved by the Federal Cabinet. Efforts to generate non-fare revenue are being spearheaded by Real Estate Development and Marketing Company (REDAMCO), a subsidiary of the Ministry of Railways.\nTo date, 14,042 acres of railway land have been leased out for various purposes through competitive bidding, generating Rs. 13.547 billion in revenue over the last five financial years.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:34:17.386Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pr-overhauls-33-diesel-electric-locomotives/",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T10:42:00.000Z"
}
