{
  "title": "Pakistan thanks Kuwait for extending oil credit facility",
  "author": null,
  "content": "ISLAMABAD, Apr 16 (APP):Federal Minister for Petroleum, Ali Pervaiz Malik, on Wednesday extended gratitude to Kuwait Petroleum for extending Pakistan’s oil credit facility for two years.\nDuring a meeting with the Kuwaiti Ambassador to Pakistan, Nassar Abdulrahman J Almutairi, the minister acknowledged Kuwait’s timely support and praised the longstanding bilateral partnership.\nHe said such cooperation has been pivotal in enabling the structural reforms led by Prime Minister Shehbaz Sharif, according to a news release.\nAmbassador Almutairi lauded Pakistan’s recent strides in economic stabilisation and investment facilitation under the leadership of Prime Minister Shehbaz Sharif. He expressed confidence in Pakistan’s economic trajectory and reaffirmed Kuwait’s commitment to deepening cooperation, especially in the energy sector.\nMalik appreciated the flexibility shown by Kuwait in accommodating Pakistan’s needs and highlighted the strengthening relationship between Pakistan State Oil (PSO) and Kuwait Petroleum Corporation.\nHe also welcomed the interest shown by Kuwait Foreign Petroleum Exploration Company (KUFPEC) in Pakistan’s offshore exploration activities.\nHe emphasised Pakistan’s strong commitment to expanding ties with Gulf countries, particularly in energy and trade. “Prime Minister Shehbaz Sharif holds deep respect and affection for the Amir and Crown Prince of Kuwait and the people of Kuwait,” he said.\nThe meeting concluded on a positive note, with both sides expressing a firm resolve to further enhance the enduring partnership between Pakistan and Kuwait.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:34:13.119Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-thanks-kuwait-for-extending-oil-credit-facility/",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T12:08:00.000Z"
}
