{
  "title": "Hungarian Foreign Minister to lead high-level business delegation on April 17th",
  "author": null,
  "content": "ISLAMABAD, Apr 16 (APP): Minister for Foreign Affairs and Trade of Hungary Péter Szijjártó, will undertake an official visit to Pakistan on April 17th and would lead a high-level business delegation to explore business opportunities in Pakistan.\nThe Hungarian Foreign Minister is visiting Pakistan on the invitation of Deputy Prime Minister and Minister of Foreign Affairs Senator Mohammad Ishaq Dar, a DPM’s Office news release said.\nBesides one-on-one meeting, Deputy Prime Minister/Foreign Minister Ishaq Dar, will have delegation-level talks with Foreign Minister Szijjártó. Deepening collaboration in economic, trade, energy and investment sectors, is the focus of the two governments.\nDuring the visit, Memorandums of Understanding (MoUs) and an Agreement on Cooperation in the fields of Culture (2025-2027), Archaeology and Cultural Heritage, and the Abolition of Visas for holders of Diplomatic Passports will be signed.\nForeign Minister Szijjártó, will also interact with other dignitaries.\nThis would be FM Szijjártó’s second visit to Pakistan, aimed at lending positive impetus to enhanced bilateral cooperation and mutually rewarding economic partnership.\nPakistan attaches high importance to bilateral relations with Hungary, which have gained strength due to regular high-level exchanges and commonality of views on regional and international issues. This year marks 60th year of establishment of diplomatic relations between the two countries. An important hallmark of strong bilateral relations has been Hungarian oil and gas company MOL’s successful investment in Pakistan since 1999.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:32:10.853Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/hungarian-foreign-minister-to-lead-high-level-business-delegation-on-april-17th/",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T17:45:00.000Z"
}
