{
  "title": "UK-Pakistan Parliamentary Friendship Group holds high-level meeting",
  "author": null,
  "content": "ISLAMABAD, Apr 16 (APP):The UK-Pakistan Parliamentary Friendship Group held a significant meeting on Wednesday at Parliament House, chaired by Minister of State for Railways and Group Convener Bilal Azhar Kayani.\nThe session was marked by the special participation of Lord Wajid Khan, Member of the UK House of Lords and Parliamentary Under Secretary of State for Faith, Communities, and Resettlement, along with British High Commissioner to Pakistan, Jane Marriott, said  a news release.\nUpon their arrival, Lord Wajid Khan and High Commissioner Jane Marriott received a warm welcome from Bilal Azhar Kayani and members of Parliament.\nIn their remarks, both guests expressed appreciation for the invitation and lauded the efforts of Bilal Azhar Kayani and fellow lawmakers in advancing the group’s objectives and fostering stronger Pakistan-UK relations.\nThe meeting featured in-depth discussions on bilateral cooperation, trade promotion, and a range of pressing global and regional issues, including the Kashmir and Palestine issues, Islamophobia, climate change, and other shared concerns.\nA dynamic question-and-answer session facilitated a constructive exchange between the UK guests and Pakistani parliamentarians.\nBoth sides agreed on the importance of enhancing collaboration between the UK Parliament’s All-Party Parliamentary Groups (APPGs) and the Pakistan-UK Friendship Group to build closer legislative and diplomatic ties.\nParliamentarians in attendance included Mirza Ikhtiar Baig, Latif Khosa, Tahira Aurangzeb, Shaista Pervaiz Malik, and Romina Khurshid Alam. Sharmila Faruqi, Dr. Shazia Soomro, and Daniyal Chaudhry participated virtually via video link.\nThe officials from the British High Commission and Pakistan’s National Assembly Secretariat were also present.\nThe meeting concluded with the exchange of commemorative shields to celebrate the continued partnership between the two countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:33:57.849Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/uk-pakistan-parliamentary-friendship-group-holds-high-level-meeting/",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T12:28:00.000Z"
}
