{
  "title": "Sardar Yousaf, Rana Mashhood discuss technical training in Madaris",
  "author": null,
  "content": "ISLAMABAD, Apr 16 (APP): Federal Minister for Religious Affairs Sardar Muhammad Yousaf and Chairman of the Prime Minister’s Youth Programme Rana Mashhood on Wednesday held an important meeting to discuss the integration of technical education into religious seminaries (madaris) and youth empowerment initiatives across Pakistan.\nRana Mashhood revealed that the government is planning to introduce technical and vocational training programs in madaris to empower students with practical skills. “We aim to provide 1.5 million employment opportunities abroad annually. Students of madaris, owing to their discipline and knowledge of Arabic, have significant potential in Gulf countries,” he said.\nHighlighting the significance of youth in national development, Rana Mashhood said, “Our provinces have individual youth policies, but we lacked a unified national youth policy. Now is the time to reflect on the kind of Pakistan we want to leave for future generations.” He also announced a nationwide survey to assess the needs and potential of school-going children, seminary students, and youth working in the fields.\nFederal Minister Sardar Yousaf emphasized the important role of madaris in Pakistani society. “Our seminaries are doing exemplary work. Students from madaris are second to none in terms of discipline and training,” he said adding that during the previous term, a Council of Ulema and Mashaikh comprising over 50 senior religious scholars was established, and now efforts are underway to revive it for guidance on social issues.\nReferring to past initiatives, Sardar Yousaf noted, “We worked significantly on the Nizam-e-Salat (prayer timings system) to promote national unity. Once again, we seek the guidance of our religious scholars in finalizing the National Youth Policy.”\nAppreciating the inclusion of scholars in the youth policy consultation process, prominent scholar Shabbir Usmani congratulated both Rana Mashhood and Prime Minister Muhammad Shehbaz Sharif. “This is the first time that scholars are being formally consulted in youth-related programs,” he remarked.\nThe meeting also acknowledged the contribution of Chief of Army Staff General Syed Asim Munir, who delivered a powerful speech recently and expressed strong support for the youth program.\nSardar Yousaf affirmed that the Ministry of Religious Affairs will play an active role in shaping and implementing the youth program and policy. “We have a close relationship with the seminaries and scholars. Their students display exceptional discipline and the examination systems in these institutions are commendable,” he concluded.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:33:26.958Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sardar-yousaf-rana-mashhood-discuss-technical-training-in-madaris/",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T12:47:00.000Z"
}
