{
  "article_id": "2025-08-01_d31e27f0b31eed48c69e65a457ab674c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-reaffirms-federal-support-for-gb-ajk-after-monsoon-devastation/",
    "retrieved_at": "2025-08-17T19:35:18.813Z"
  },
  "metadata": {
    "title": "PM Shehbaz reaffirms federal support for GB, AJK after Monsoon devastation",
    "author": null,
    "date_published": "2025-08-01T13:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 469,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 01 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday reaffirmed the support of the federal government to ensure relief and recovery in the monsoon devastation affected regions of Gilgit Baltistan (GB) and Azad Jammu and Kashmir (AJK). The prime minister chaired a high-level review meeting to assess the human and material losses caused by the ongoing monsoon season, particularly in Gilgit-Baltistan and Azad Jammu and Kashmir (AJK). The session focused on immediate relief efforts, future preparedness, and federal support to the affected regions, a Prime Minister's Office news release said. In his remarks, Prime Minister Shehbaz expressed deep sorrow over the tragic loss of lives and extensive damage inflicted by torrential rains across the country, especially in GB and AJK. He reiterated the federal government's unwavering solidarity with the regional governments and the affected people. \"The federal government stands shoulder to shoulder with the administrations and citizens of Gilgit-Baltistan and Azad Kashmir in this hour of grief,\" the prime minister stated. \"I will soon visit Gilgit-Baltistan to express solidarity with the victims, and a comprehensive federal relief package will be announced to support recovery and rehabilitation efforts,\" he added. The Prime Minister issued special directives to all federal agencies to collaborate closely with regional authorities to conduct damage assessments and expedite relief measures. He stressed the need to prioritize life-saving interventions and safeguard both human lives and property. Highlighting the need for better disaster preparedness, the Prime Minister ordered an urgent overhaul of the early warning system run by the Pakistan Meteorological Department to make it more proactive and effective. He also directed the concerned departments to restore and repair road networks and communication infrastructure on an emergency basis to ensure timely aid delivery and mobility in affected areas. The Prime Minister emphasized a coordinated and rapid response to minimize further damage and ensure that those affected receive timely assistance and rehabilitation. During the briefing, Chairman of the National Disaster Management Authority (NDMA), Lieutenant General Inam Haider Malik, informed the meeting that the monsoon-related disasters have so far resulted in 295 fatalities and over 700 injuries nationwide. More than 1,600 homes have been completely destroyed, and 376 livestock lost due to the severe weather. The NDMA chief also warned of continuing high flood threats in various rivers and streams. Minor flooding is expected at Tarbela, Chashma, Taunsa, and Kalabagh, while moderate flood levels may occur at Head Marala and Guddu on the Chenab River. He cautioned that the monsoon may intensify further towards the end of August. The meeting was attended by AJK Prime Minister Chaudhry Anwar-ul-Haq, Gilgit-Baltistan Chief Minister Haji Gulbar Khan, Deputy Prime Minister and Foreign Minister Senator Ishaq Dar, Federal Minister for Climate Change Dr. Musadik Malik, Federal Information Minister Attaullah Tarar, NDMA Chairman Lt. Gen. Inam Haider Malik, and other senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}