{
  "article_id": "2025-08-01_155d2c516ea9fe5c295603a8a66b2db6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-strongly-rejects-baseless-indian-claims-on-operation-sindhoor-fo-spokesperson/",
    "retrieved_at": "2025-08-03T10:22:55.153Z"
  },
  "metadata": {
    "title": "Pakistan strongly rejects baseless Indian claims on âOperation Sindhoorâ: FO spokesperson",
    "author": null,
    "date_published": "2025-08-03T14:37:12+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 528,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 01 (APP): Pakistan on Friday categorically rejected what it called abaseless and irresponsible statementsa made by Indian political leaders in the Lok Sabha regarding the so-called aOperation Sindhoor,a reiterating that such rhetoric only fuels instability in South Asia. Foreign Office spokesperson, Ambassador Shafqat Ali Khan, addressing the weekly press briefing, said, aThe world knows that India carried out attacks on Pakistani territory without a shred of credible evidence. The so-called strikes on alleged terrorist sites led to the martyrdom of innocent civilians. India failed to avail itself of Pakistanas immediate offer for a joint probe into the Pahalgam incident, which speaks volumes about the falsity of their claims.a Ambassador Khan underscored that Pakistanas defense capabilities remain a strong deterrent against any adventurism by India. aFor us, the only path to normalcy lies in mutual respect for sovereignty, territorial integrity, and adherence to international laws and UN charters. Indiaas continued reliance on jingoism, chest-thumping, and empty rhetoric is jeopardizing regional peace and stability,a he added. The spokesperson also dismissed recent remarks by the Indian Home Minister on the Indus Waters Treaty, saying such adisplaced assertions carry no legal weight and cannot alter established international agreements.a Updating on the Deputy Prime Minister and Foreign Ministeras (DPM) ongoing diplomatic outreach in the United States, Ambassador Khan said Pakistan remained actively engaged on key multilateral issues. The DPM chaired a high-level UN Security Council session in his capacity as its President, where he reiterated Pakistanas principled stance on peaceful dispute resolution and the right to self-determination for Palestinians and Kashmiris, he said. The DPM/FM also held meeting with U.S. Secretary of State Marco Rubio, during which both sides reaffirmed their commitment to strong bilateral ties and enhanced coordination at multilateral forums. Moreover, Pakistanas role in supporting a two-state solution for Palestine was highlighted during interactions with the foreign ministers of Kuwait, Norway, Egypt, and other OIC member states, he said. The spokesperson further said that Pakistan welcomed the successful de-escalation of tensions between Cambodia and Thailand, noting the USas continued support for peaceful conflict resolution worldwide. Commenting on key regional and bilateral updates, he said Pakistan and Iran are set to strengthen ties, with Iranian President Dr. Masoud Pezeshkian arriving in Islamabad on August 2 for his first official visit after assuming office. He added that Pakistan successfully launched a remote sensing satellite, enhancing its earth monitoring, climate change analysis, and water resource management capabilities. Bilateral consultations were also held with Somalia and China, focusing on trade, defense, and regional cooperation, he added. Reaffirming Pakistanas position on terrorism, Ambassador Khan stated: aGroups like BLA and TTP are recognized as terrorist organizations. Evidence shows they are being funded and facilitated from across the border. We have consistently raised this matter with Afghan authorities and expect decisive action.a On relations with India, he said Pakistan remained open to dialogue based on mutual respect and international law but would continue to vigorously defend its sovereignty against any false narratives or hostile actions. aOur message is clear: baseless claims and militaristic posturing will not bring peace to South Asia. Only diplomacy and adherence to international norms can pave the way forward,a the spokesperson concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}