{
  "article_id": "2025-08-01_93fa8776d9df5d7b3ea0fed17bc8529f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-china-armies-to-continue-safeguarding-shared-strategic-interests-coas/",
    "retrieved_at": "2025-08-17T19:36:07.592Z"
  },
  "metadata": {
    "title": "Pakistan, China armies to continue safeguarding shared strategic interests: COAS",
    "author": null,
    "date_published": "2025-08-01T10:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Aug 1 (APP):Chief of Army Staff (COAS) Field Marshal Syed Asim Munir, NI (M) on Friday emphasized that Pakistan Army and People's Liberation Army (PLA) of China enduring partnership will continue to play a pivotal role in promoting regional stability and safeguarding shared strategic interests. Speaking at a ceremony to commemorate 98th anniversary of the founding of the People's Liberation Army (PLA) of China here at General Headquarters, the COAS reaffirmed that the Pakistan Army and the PLA are true brothers-in-arms. Ambassador of the People's Republic of China to Pakistan Mr. Jiang Zaidong graced the occasion as the chief guest, said a news release issued by the Inter Services Public Relations (ISPR). The ceremony was also attended by Major General Wang Zhong, Defence Attache, officials from the Chinese Embassy, and senior military officers from the tri-services of Pakistan. Field Marshal Syed Asim Munir extended a warm welcome to the Chinese guests and congratulated the PLA on its 98th founding anniversary. He lauded the PLA's pivotal role in China's defence, security, and nation-building. The COAS underscored the strength and strategic significance of Pakistan-China relations, emphasizing that the bond between the two nations is unique, time-tested, and exceptionally resilient amid evolving regional and global challenges. The Field Marshal highlighted that the Pakistan-China strategic relationship exemplifies mutual trust, unwavering support, and shared commitment. He stressed that despite shifting strategic dynamics, the friendship between the two nations has remained steadfast and unshakable. Addressing the gathering, the Chinese Ambassador expressed his sincere gratitude to the COAS for hosting the event commemorating the PLA's 98th anniversary. He acknowledged the steadfast role of the Pakistan Armed Forces in the fight against terrorism and reaffirmed China's unwavering support for and commitment to its strategic partnership with Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}