{
  "article_id": "2025-08-01_85c696fc453489393802f1ae6e684e46",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/turkish-institute-npc-hold-one-day-wonders-of-turkiye-photo-exhibition-at-npc/",
    "retrieved_at": "2025-08-03T10:24:16.479Z"
  },
  "metadata": {
    "title": "Turkish institute, NPC hold one-day ‘Wonders of Türkiye’ photo exhibition at NPC",
    "author": null,
    "date_published": "2025-08-03T14:37:12+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 31 (APP): Yunus Emre Institute Turkish Cultural Center and National Press Club (NPC), Islamabad, on Thursday jointly organised a one-day 'Wonders of Turkiye' photo exhibition at NPC, showcasing the cultural richness of Turkiye. Governor of Khyber Pakhtunkhwa Faisal Karim Kundi attended the event as the chief guest, while Turkish Ambassador to Pakistan Irfan Naziroglu inaugurated the exhibition as the guest of honour. The event was also attended by Head of Yunus Emre Institute Dr. Khalil Tokar, TIKA Pakistan Head Saleh Tuna, NPC President Azhar Jatoi, Secretary Nayyer Ali and other officials from both the Turkish Embassy and NPC, said a press release. On this occasion, Faisal Karim Kundi praised the initiative, calling it an excellent photo exhibition where Turkish culture has been reflected in the best way. \"The Turkish people are very hospitable and long-standing friends of Pakistan,\" he said, adding that \"Turkiye has always supported Pakistan in times of difficulty.\" He further invited the Turkish ambassador and TIKA officials to visit the Governor House in Peshawar. Meanwhile, Turkish Ambassador Irfan Naziroglu said that Pakistan and Turkiye are brotherly Islamic nations enjoying exceptional relations across various fields, including health, education, tourism, and others. \"Both brotherly countries support each other in every difficult time. The relations between the two countries are getting better and better day by day,\" he said. NPC President Azhar Jatoi and Secretary Nayyar Ali thanked the guests for their presence at the Press Club and appreciated the exhibition for offering a vibrant glimpse into Turkish culture.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}