{
  "article_id": "2025-08-01_e5476954147eeef8db35aa9d1bf032f4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aphc-calls-for-complete-shutdown-in-iiojk-on-august-5/",
    "retrieved_at": "2025-08-17T19:36:38.582Z"
  },
  "metadata": {
    "title": "APHC calls for complete shutdown in IIOJK on August 5",
    "author": null,
    "date_published": "2025-08-01T07:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 276,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 1 (APP):The All Parties Hurriyat Conference (APHC) has urged the people of Indian illegally occupied Jammu and Kashmir (IIOJK) to observe a complete shutdown on August 5 and mark the day as Youm-e-Istehsal-e-Kashmir to condemn India's illegal actions of August 5, 2019. On this day in 2019, the Hindutva-inspired BJP government of India unilaterally abrogated Articles 370 and 35A, which granted special status to the internationally recognised disputed territory. The move was accompanied by a brutal military and police siege. Issued by APHC and various pro-freedom organizations, posters appeared in Srinagar and other parts of the valley calling for the observance of Black Day. The posters rejected the Indian actions of August 5, demanded the restoration of pre-2019 status, release of political detainees, resolution of the Kashmir dispute as per UN resolutions, and an end to Indian human rights violations in the territory. Posters also carried photographs of illegally detained APHC leaders including Masarrat Aalam Butt, Shabbir Ahmad Shah, Muhammad Yasin Malik and Aasiya Andrabi. The messages described India's actions as colonial and unilateral, adding that the people of Jammu and Kashmir continue to resist them. They further called upon international human rights organizations to send fact-finding missions to IIOJK to assess the situation on the ground, including the impact of custodial killings, fake encounters, detentions, injuries and mental health trauma in the territory. The posters noted that India had illegally occupied Jammu and Kashmir on October 27, 1947, and later merged it with the Indian Union on August 5, 2019, against the will of the Kashmiri people. The posters have also been widely shared on social media platforms including Twitter, Facebook, and WhatsApp.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}