{
  "article_id": "2025-08-01_0031f91c2a01ac3928124b8fd7d2890b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/governor-kp-urges-nadra-ogdcl-to-expand-services-in-remote-areas/",
    "retrieved_at": "2025-08-17T19:34:48.294Z"
  },
  "metadata": {
    "title": "Governor KP urges NADRA, OGDCL to expand services in remote areas",
    "author": null,
    "date_published": "2025-08-01T13:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 321,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 01 (APP): Governor Khyber Pakhtunkhwa Faisal Karim Kundi met with Chairman NADRA, Lieutenant General (R) Muhammad Munir Afsar, here on Friday to discuss the provision of identification documents and civic services in the province. During the meeting, the Governor expressed concern over the lack of NADRA facilities in remote and underdeveloped areas of KP, particularly highlighting the need for service expansion in large villages of Paharpur Tehsil, Dera Ismail Khan. He emphasized the importance of ensuring doorstep access to NADRA services for the local population. Chairman NADRA assured the Governor that the authority would soon increase the number of mobile registration vans in these areas and initiate consultations with local administrations to establish permanent offices. He also announced the creation of separate facilitation desks for women, elderly citizens, and persons with disabilities to streamline the registration process. Key issues discussed included CNIC issuance, child registration (B-Form), family record updates, and inheritance documentation. Governor Kundi praised NADRA's ongoing digitalization drive and cybersecurity initiatives, saying that the adoption of modern technology would enhance the efficiency and transparency of the institution. Meanwhile, Governor Faisal Karim Kundi held a meeting with the Managing Director of Oil and Gas Development Company Limited (OGDCL), Ahmed Hayat to discuss gas supply issues and expansion projects in the southern districts of the province. During the meeting, the Governor stressed the need to improve the gas distribution system and called for immediate action to meet the growing energy demands of the public. He directed OGDCL officials to prioritize ongoing gas supply projects in the southern districts and ensure their timely completion, particularly ahead of the winter season. The discussion also covered proposed expansion projects in Daraban and surrounding areas, including the laying of new gas pipelines, upgrading existing infrastructure, and exploring new gas reserves. Governor Kundi emphasized that these initiatives would not only provide much-needed relief to the local population but also contribute significantly to regional economic development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}