{
  "article_id": "2025-07-12_7208f740e30a391b081e6db867fd3c8d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-unveils-g6pd-deficiency-pilot-project-results/",
    "retrieved_at": "2025-08-27T09:29:48.144Z"
  },
  "metadata": {
    "title": "Govt unveils G6PD deficiency pilot project results",
    "author": null,
    "date_published": "2025-07-12T17:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 546,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 12 (APP): In a landmark step toward achieving a malaria-free Pakistan by 2035, the federal government has announced the successful completion of the country's first-ever G6PD Deficiency Pilot Project. The results were formally presented at a high-level dissemination event hosted by the Directorate of Malaria Control (DoMC) in Islamabad, reaffirming Pakistan's position as a regional leader in malaria elimination. Minister for Health, Dr. Mukhtar Ahmed Bharath, addressed a gathering of national and international health experts, expressing the government's resolute commitment to ending malaria in Pakistan. \"This pilot isn't the end, it's the beginning,\" he said. \"It provides the foundation we need to take scalable, sustainable, and science-based action.\" Implemented across nine high-burden districts with technical support from the Medicines for Malaria Venture (MMV), the pilot project focused on integrating G6PD testing into primary healthcare settings. This testing is critical to the safe administration of Tafenoquine, a revolutionary single-dose treatment for Plasmodium vivax malaria. Unlike the previous 14-day Primaquine regimen, which suffered from poor patient adherence, Tafenoquine offers a simplified and more effective treatment model. \"Many patients discontinued the Primaquine course within two to three days, increasing the risk of relapse and ongoing transmission,\" said Dr. Bharath. \"With Tafenoquine, we can change that trajectory.\" Dr. Muhammad Mukhtar, Director of the Directorate of Malaria Control, highlighted the scientific and operational milestones achieved through the pilot. \"This initiative is a significant step toward strengthening malaria case management and improving treatment outcomes,\" he noted. The pilot comes at a crucial time. In the aftermath of Pakistan's devastating 2022 floods, more than 2.8 million malaria cases were reported nationwide. These staggering figures underscore the urgent need for innovative strategies, such as G6PD testing and new treatment protocols, to control and eliminate the disease. Pakistan's Drug Regulatory Authority (DRAP) officially approved Tafenoquine for use in September 2024, following endorsement by the World Health Organization (WHO). This positions Pakistan among the first countries in the region to adopt the treatment. The dissemination event was attended by key representatives from WHO, UNICEF, The Global Fund, CMU, and other national and international partners. Stakeholders lauded the project as a model of technical innovation and collaborative leadership. Dr. Bharath also announced plans to host the National Summit for Malaria Elimination in early 2026 in Islamabad. The summit aims to evaluate progress, share global best practices, and foster partnerships across public, private, and development sectors. \"This summit will convene our partners to chart a unified path forward,\" he said. \"Our goal is to build political momentum, catalyze investment, and reinforce accountability from the federal to grassroots level.\" Further strengthening institutional coordination, the Directorate of Malaria Control signed a Memorandum of Understanding with DRAP's Pharmacovigilance Centre in March 2024. The agreement will ensure the continued safety and efficacy of anti-malarial drugs through rigorous regulatory oversight. In a powerful call to action, Dr. Bharath emphasized the moral and national imperative of malaria elimination: \"This is not merely a health target, it is a duty to our people. With continued unity, innovation, and determination, we will see a malaria-free Pakistan.\" He concluded by commending the leadership of Dr. Muhammad Mukhtar and acknowledging the vital contributions of Dr. Caroline Anita Lynch, Regional Advisor at MMV, along with national and international partners dedicated to the shared goal of eradicating malaria.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}