{
  "article_id": "2025-07-12_a5fb49eb22369798c095a1f1e45da271",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ncsw-and-unfpa-launch-groundbreaking-islamabad-gender-parity-report-paving-way-for-meaningful-change/",
    "retrieved_at": "2025-08-27T09:30:34.544Z"
  },
  "metadata": {
    "title": "NCSW and UNFPA launch groundbreaking Islamabad Gender Parity Report, paving way for meaningful change",
    "author": null,
    "date_published": "2025-07-12T12:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 246,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 12 (APP): The National Commission on the Status of Women (NCSW), along the Ministry of Human Rights and United Nations Population Fund (UNFPA) are proud to announce the launch of the Islamabad Gender Parity Report, a landmark study that sheds light on the current state of gender equality in the Islamabad Capital Territory. Ume Laila Azhar, Chairperson, NCSW in her address said \"Let's use this report as a launchpad for deeper reforms, stronger partnerships and more inclusive governance. Together, we can bridge the gaps and ensure that every woman and girl in Pakistan has the opportunity to thrive and contribute to the nation's progress. \"Senator Fauzia Arshad, Member Gender Mainstreaming Committee while addressing the audiences remarked, \"We must not allow our daughters' dreams to shrink as they grow. It's time for collective action to break down barriers and create a society where women and girls can reach their full potential.\" - Women's labor force participation in ICT remains low at 22.5% - Girls outnumber boys in public schools, but their representation declines in higher education and technical fields - Healthcare access, especially mental health and reproductive services, is alarmingly unequal - Conviction rates for violence against women remain dismally low This report provides a robust evidence base for policy-making and programming, highlighting systemic failures and areas for improvement. NCSW and UNFPA are committed to working with Ministry of Human Rights, policymakers, stakeholders, and civil society to implement the report's recommendations and drive meaningful change.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}