{
  "title": "Maqbool Butt remembered on 39th martyrdom anniversary",
  "link": "https://www.app.com.pk/national/maqbool-butt-remembered-on-39th-martyrdom-anniversary/",
  "date_published": "2023-02-11T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP):The people of Jammu and Kashmir are observing today the 39th martyrdom anniversary of Muhammad Maqbool Butt who had lived for a national cause for his people and ended his life by kissing gallows in Tihar Jail on 11 February 1984.\nFarooq Rehmani, Chairman J&K People’s Freedom League and ex-Convener All Parties Hurriyat Conference AJ&K paid a rich tribute to the struggle of the martyred Freedom fighter of Kashmir.\nHe said that Maqbool Butt first left his home in Kashmir during 1950s, crossed into Pakistan to organise the freedom movement in different ways and came back to the IIOJ&K in the 1960s with a fulfilled mission but was arrested and imprisoned and later sentenced, but again made his way to enter Azad Jammu and Kashmir, said a press release issued here on Saturday.\nOnce again seeing the conditions of his homeland akin to a political revolution, he made his 2nd attempt in 1976 to sneak into the IIOJ&K, but unfortunately, he was again arrested and kept in the high-security prison in Tihar Jail, where a good number of Kashmiri resistance leaders are languishing since 1990s or from the beginning of this century.\nMuhammad Farooq Rehmani said the Indian government made a revengeful decision to send him to the gallows without listening to his defence counsel and the execution was rightly described and condemned by many in the sub-continent, especially by a popular newspaper of Jammu Kashmir Times as judicial murder.\n“Today his mortal remains and that of Afzal Guru Shaheed remain buried in the premises of Tihar jail and the people of Kashmir especially the parents and the family members of both of these martyred sons have time and again demanded the international community to use their influence to hand over the last mortal remains to the concerned families in the IIOJ&K,” he said.\nHe further said that the political and economic life of the people of Jammu and Kashmir today had been squeezed and crippled by the racist Modi establishment of India and there was everywhere an atmosphere of fear due to arrests, long imprisonments.\nHe emphasized the UN to invoke its resolutions on Jammu and Kashmir and equally impressed upon other regional and European organizations, especially the Organization of Islamic Cooperation to play their part in resolving the problem of Kashmir to end an environment of fear and political and economic suffocation in the Occupied State of Jammu and Kashmir.",
  "retrievedAt": "2025-08-11T06:02:00.807Z"
}
