{
  "title": "Ministry of Human Rights hosts govt officials from Nepal on ‘Peer Learning Session’",
  "link": "https://www.app.com.pk/national/ministry-of-human-rights-hosts-govt-officials-from-nepal-on-peer-learning-session/",
  "date_published": "2023-02-11T08:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP):Ministry of Human Rights hosted the Mission of the Government of Nepal with the support of the United Nations Development Programme on a peer learning session on National Action Plan on Business and Human Rights.\nThe session was held to share the experiences of the Ministry of Human Rights, Government of Pakistan while drafting and implementing its National Action Plan on Business and Human Rights (2021 – 2026) (NAP-BHR). The Government of Nepal is in the process of drafting its own National Action Plan on Business and Human Rights; therefore, UNDP Nepal and Pakistan arranged for a peer-learning exercise between the relevant departments of the two governments so the Government of Pakistan could share its takeaways with the Government of Nepal\nThe Nepalese Mission comprised senior-level officials from the Ministry of Labour, Employment and Social Security; Ministry of Industry, Commerce and Supplies; Ministry of Law, Justice and Parliamentary Affairs Office of Prime Minister and Council of Minister; National Human Rights Commission of Nepal and UNDP Nepal.\nOpening the session, the Secretary, the Ministry of Human Rights, Mr Ali Raza Bhutta welcomed the Nepalese delegation to Pakistan and stated that such exchanges should be frequent and that South Asian countries have a lot to learn from each other in the context of development, human rights and other policies because of their regional proximity and shared values.\nDirector General, the Ministry of Human Rights, Mr Muhammad Arshad, stated that the Ministry of Human Rights is dedicated to implementing NAP-BHR. He further said that the Ministry is focusing on the areas of anti-discrimination, provision of equal opportunity and adherence to human rights due diligence in businesses for the current year.\nDuring the session, the Director Ministry of Human Rights, Mr Shahzad Ahmed Khan, gave a comprehensive presentation on the development and implementation of the NAP-BHR and shared key takeaways with the officials. The Government of Nepal also gave a presentation highlighting major areas of the first draft of their action plan detailing thematic and priority areas, issues faced and implementation mechanisms.\nThe Joint Secretary, Mr Jhakka Prasad Acharya, Ministry of Labour, Employment and Social Security, Government of Nepal stated that he was thankful for the warm welcome extended by the Ministry of Human Rights.\nHe further stated that the structure of the Inter-Ministerial and Inter-Provincial Steering Committee for implementation of National Action Plan on Business and Human rights and the objective of formalizing the informal sector were two key takeaways from this peer learning visit.\nFurthermore, he extended the invitation to the Ministry of Human Rights to attend the 4th UN South Asia Forum on Business and Human Rights which will be held in March 2023 to further learn from each other in the context of BHR.\nClosing the session, the Secretary, the Ministry of Human Rights, stated that the Government of Pakistan is willing to extend its support in the form of experiences with the Government of Nepal to develop their Action Plan on Business and Human Rights and expressed well-wishes to the Nepalese delegation in this regard.\nNational Action Plan on Business and Human Rights (2021 – 2026) Pakistan is a policy document developed by the Ministry of Human Rights. It pertains to 08 priority areas and 69 action points that reinforce following the “Protect-Respect-Remedy” framework of the United Nations Guiding Principles on Business and Human Rights to safeguard human rights in the business sector of Pakistan. NAP-BHR can be viewed at: www.bhrpak.org.",
  "retrievedAt": "2025-08-11T06:02:03.835Z"
}
