{
  "title": "Maqbool Butt’s execution was murder of justice: Mushaal",
  "link": "https://www.app.com.pk/national/maqbool-butts-execution-was-murder-of-justice-mushaal/",
  "date_published": "2023-02-11T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP): The Chairperson of Peace and Culture Organization, Mushaal Hussein Mullick paid glowing tributes to Shaheed-e-Azam Shaheed Maqbool Ahmed Butt and said that he rekindled the flame of freedom struggle by happily touching the glows, whose execution was the murder of justice.\nSpeaking as a chief guest at an event to mark the 39th martyrdom anniversary of Muhammad Maqbool But on Saturday, Mushaal said that Maqbool Butt was a versatile personality, who always led from the front to liberate the Kashmiris from the Indian brutal subjugation, said a press release issued here on Saturday.\nMaqbool Butt was sent to the gallows on February 11 in 1984 in notorious New Delhi’s Tihar Jail for his crime to spearheaded Kashmir freedom movement. She said that martyrs were the real asset of Kashmiris’ freedom struggle and Kashmiri people could not forget the sacrifices of their martyrs come what may.\nThe event was organized by Government Associate College (W) F-Block, which was attended by Principal Mrs Erum Asher, the Co-Chairperson Peace and Culture Organisation Rehana Hussein Mullick and Daughter of Kashmiri Hurriyat Leader, Yasin Malik, Raziyah Sultana.\nOn the occasion, Kashmir tableau were presented to mark Kashmir Martyrdom Day.Mushaal, wife of jailed Kashmiri Hurriyat leader Muhammad Yasin Malik, said that its was time to remember and pay tribute to Shaheed Maqbool Ahmed Butt, who was an icon of Kashmir resistance movement and sacrificed his life for the noble cause of freedom from Indian yoke.\nThe Hurriyat leader said that although the fascist Indian government silenced him by sending him to the gallows but failed to silence his ultimate desire–the struggle for the people of Kashmir for the right to self-determination.\nShe made it clear that the spirit of freedom of Kashmiris can never be suppressed through executions, illegal detentions and other brutal tactics by Indian fascist authorities in Indian Illegally Occupied Jammu and Kashmir (IIOJK) rather these fascist tendencies further ignite the fire of freedom struggle.\nThe chairperson said that the martyrs were the symbols of the Kashmiris’ freedom struggle against Indian yoke.Mushaal reiterated that the sacrifices of Kashmiri martyrs would not be allowed to go waste as Kashmiri people were duty-bound to safeguard the martyrs’ sacrifices by taking the mission of their martyrs to logical ends at all costs.\nThe chairperson urged notorious India government to accept the bitter reality and the Kashmiri people and decide their own fate, as the hindutva regime could not achieve the desired results by these brutal tactics for the last seven decades.",
  "retrievedAt": "2025-08-11T06:01:49.619Z"
}
