{
  "title": "Ghulam Sarwar visits CAA Headquarters",
  "link": "https://www.app.com.pk/national/ghulam-sarwar-visits-caa-headquarters/",
  "date_published": "2021-07-07T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP): Federal Minister for Aviation, Ghulam Sarwar Khan on Wednesday visited Civil Aviation Authority (CAA) Headquarters Karachi.\nDirector General (DG) CAA, Khaqan Murtaza, Additional DG, CAA (Air Vice Marshal) Jamal Arshad, senior officers from the Aviation Division and the Civil Aviation Authority were present on the occasion.\nGhulam Sarwar Khan also visited the Airport Security Force (ASF) Headquarters. He was briefed by DG, Major General, Abid Latif Khan, says a press release issued here.\nDG CAA, Khaqan Murtaza briefed the Minister on the responsibilities of the authority.\nThe Federal Minister was also briefed on the preparations for the International Civil Aviation Organization audit which is expected later this year. The Minister was also briefed on the issues of stranded passengers abroad.\nGhulam Sarwar Khan informed that on the directives of the Prime Minister, efforts are underway to bring back the stranded passengers on the occasion of Eid-ul-Azha.\nHe expressed satisfaction over the concerted efforts of the CAA for the timely return of Pakistanis through foreign airlines.\nGhulam Sarwar Khan also expressed satisfaction over the efforts of DG, CAA and his team in providing services to promote tourism at airports particularly in Northern Areas of Pakistan.\nFederal Minister visited Airport Security Force (ASF) HOs and said, it is imperative that all airports across the country be modernized on a priority basis.\nThe latest security systems would be activated at airports where airport officials and ASF would be equipped with modern technology and new vehicles, the Minister said, adding that, “We are taking all possible steps to ensure state-of-the-art security at all airports in Pakistan.",
  "retrievedAt": "2025-08-11T20:56:46.797Z"
}
