{
  "title": "Effective energy conservation measures needed to mitigate energy woes: Shibli Faraz",
  "link": "https://www.app.com.pk/national/effective-energy-conservation-measures-needed-to-mitigate-energy-woes-shibli-faraz/",
  "date_published": "2021-07-07T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP): Federal Minister for Science and Technology, Shibli Faraz Wednesday said that effective implementation of energy conservation measures could help a lot towards mitigating energy woes of the country.\nHe said this while chairing a meeting of all stakeholders of electrical appliances.\nChairman Oil and Gas Regulatory Authority (OGRA), Managing Director National Energy Efficiency and Conservation Authority (NEECA) and representatives of the private sector from leading producers of appliances like fans, electric motors and geysers were present in the meeting.\nThe minister highlighted that we had been wasting valuable energy resources by using sub standard products which in addition to having deleterious impact on the country’s economy, falls heavy on the pockets of consumers.\nHe emphasized that all the appliances especially fans, electric motors and geysers must meet the minimum requirements of energy efficient products.\nDuring the meeting progress on the decisions taken in the earlier meeting was also reviewed. Moreover, different proposals and measures to ensure the production of energy efficient appliances in the country were also discussed.\nThe minister reiterated that the public and private sector must join hands in this important task as it would not be possible to implement this policy without cooperation and ownership of the manufacturer.\nRepresentatives of the private sector present in the meeting assured the chair of their full cooperation.\nThe minister gave certain targets and directions to the different organizations including NEECA, OGRA, Pakistan Standards and Quality Control Authority, Pakistan Council of Scientific and Industrial Research and National Institute of Electronics in that regard.",
  "retrievedAt": "2025-08-11T20:56:40.848Z"
}
