{
  "title": "Multinational companies’ representatives call on IT Minister",
  "link": "https://www.app.com.pk/national/multinational-companies-representatives-call-on-it-minister/",
  "date_published": "2021-07-07T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP):Representatives of multinational companies called on Federal Minister for Information Technology and Telecommunication Syed Amin Ul Haque here on Wednesday.\nThe multinational companies whose representatives met with IT Minister included Microsoft, IBM, Oracle, VMware, Teradata, Huawei, S & P Global Pakistan, Amazon Web Services and SAP Middle East & North Africa, said a press release.\nSecretary Ministry of IT and Telecommunication Dr. Muhammad Sohail Rajput and Managing Director Pakistan Software Export Board (PSEB) Osman Nasir were also present in the meeting.\nMatters about information technology, connectivity, IT exports and investment opportunities in IT & Telecom sector Pakistan were discussed during the meeting.\nThe representatives of multinational companies apprised the Federal Minister for IT about their respective companies issues and reservations.\nAddressing the meeting, Federal Minister for IT Syed Amin Ul Haque said that there are great opportunities for business and investment present in Pakistan for multinational companies.\n“Pakistan is situated in best timezone for IT & software companies’ business. Multinational companies can create employment opportunities for Pakistani youth,” he added.\nHe said that the government was giving incentives and tax exemption to foreign investors. He also asked multinational companies to point out hurdles in the way of the promotion of their businesses besides giving recommendations.\nThe minister also urged multinational companies to start research and development process, adding that it was vital to give state of the art technological training to Pakistani youth.\nSenior officers of Ministry of IT and Telecommunication were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:56:48.895Z"
}
