{
  "title": "Govt. transforming minerals, gems sector into export industry: PM",
  "link": "https://www.app.com.pk/national/govt-transforming-minerals-gems-sector-into-export-industry-pm/",
  "date_published": "2021-07-07T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 7 (APP): Prime Minister Imran Khan Wednesday said that government was transforming the traditional techniques in minerals and gems sector by introducing the latest technology and for the first time in 74 years of country’s history, this sector was being turned into export industry.\nThe prime minister was chairing a meeting of gems, jewelry and minerals task force here. The meeting was attended by Minister for Industries Makhdoom Khusru Bakhtiar, Special Assistant to PM Dr Shabaz Gill, Chairman Gems and Jewelry Task Force Engineer Gul Asghar Khan, Atif Khan, members of the task force and relevant authorities.\nThe prime minister was apprised of the restructuring of the gems, jewelry and minerals sector and the recommendations over the proposed mineral city. The meeting was told that Pakistan had the capacity of exporting precious gems worth 5 billion dollars annually which would have positive effects upon the country’s economy, besides generating huge employment opportunities.\nAbout 99 different types of precious gems reserves were found in Pakistan, making it the eighth biggest country in the world in terms of its production, it was added.\nMoreover, according to an estimate, there was 200 tons gold consumption in Pakistan and through effective legislation and better arrangements, this sector could be turned into one of the biggest industry.\nThe prime minister directed that all those resources which were being wasted, should be utilized by framing a regular schedule for implementation of mechanism, besides removal of bottlenecks for the investors.\nThe meeting was apprised that the gems and jewelry had been given the status of industry and under the mechanism of Task Force, its implementation would be ensured.\nTo increase exports, support from Pakistan’s embassies and missions abroad would be sought for its promotion abroad.\nMoreover, gems and jewelry city would be established to bring all resources at one place, ensure resolution of issues through one window operation and provision of facilities to the investors.\nInitially, the available resources would be utilized to adopt public-private partnership model. To access the international markets, relevant certification would be obtained. Under it, not only standards for precious gems would be framed but also, the current standards would be brought at par with the international standards, it was further added.\nThe prime minister was apprised that due to lack of research resources in this sector, no tangible progress was made, however, under a strategy; the research sector would be made functional to introduce all the latest standards.\nThe meeting was further given a detailed briefing over the establishment of mineral city. For this purpose, area had been identified for setting up chemical and mineral industry where with the industrial value addition from raw minerals, imports would be reduced and exports be enhanced.",
  "retrievedAt": "2025-08-11T20:56:43.935Z"
}
