{
  "title": "OIC Secretary General underscores principled stance on J&K dispute: FO",
  "link": "https://www.app.com.pk/national/oic-secretary-general-underscores-organizations-principled-stance-on-jk-dispute-fo/",
  "date_published": "2021-07-07T11:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 7 (APP): Foreign Office spokesperson Wednesday said that during a recent meeting between Organization of Islamic Cooperation (OIC) Secretary General and the Indian ambassador to Saudi Arabia, the former had underscored the organization’s principled position on the Jammu and Kashmir dispute.\nResponding to media queries regarding a meeting between the OIC Secretary General and the Indian ambassador to the Kingdom of Saudi Arabia, the spokesperson in a press release said the meeting on July 5 at the OIC’s General Secretariat in Jeddah took place in the context of the mandate afforded by Resolution 10/47-Pol of the 47th Session of the OIC Council of Foreign Ministers.\n“The OIC CFM in Niamey in November 2020 categorically rejected India’s unilateral actions since 5 August 2019. It also demanded that India rescind its illegal actions and respect the inalienable right of the Kashmiri people to self-determination, as promised by numerous UNSC resolutions,” the spokesperson said.\nThe Jammu and Kashmir dispute had been amongst the longest standing issues on the OIC’s agenda. Indian illegal and unilateral actions in IIOJK and the continued violation of human rights of the Kashmiri people had been a top priority of the OIC, the spokesperson said, adding “Pakistan appreciates OIC’s consistent and longstanding support for the Kashmir cause and legitimate rights of the people of IIOJK”.\nThe OIC resolutions, inter alia, called on the secretary general to dispatch a fact-finding mission to IIOJK to ascertain the situation on ground and report its findings to the next Council of Foreign Ministers (CFM). The CFM resolutions also called on the secretary general to take up the matter with the Indian authorities.\nIndia has consistently ignored OIC resolutions and evaded its responsibility of protecting the fundamental rights of the Kashmiri people.\n“This is the first time that the principled position of the 57 OIC-member states has been duly conveyed to India. India should review its policies in IIOJK and fully implement UNSC and OIC Resolutions on the Jammu and Kashmir dispute,” it was added.",
  "retrievedAt": "2025-08-11T20:56:44.462Z"
}
