{
  "title": "NAB an effective deterrence against corruption: NA Speaker",
  "link": "https://www.app.com.pk/national/nab-an-effective-deterrence-against-corruption-na-speaker/",
  "date_published": "2021-07-07T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP): National Assembly Speaker Asad Qaiser has said that National Accountability Bureau (NAB) was rendering national service through creating deterrence against corruption in the country.\nTalking to National Accountability Bureau Chairman (NAB), Justice (r) Javed Iqbal at Parliament House, Wednesday, the Speaker opined that effective measures always help eliminate the menace of corruption from society.\nSpeaker said that the incumbent government believes in the promotion of transparency and accountability in the governance system. He said that corruption was a major challenge faced by the nation. It was the collective responsibility of all segments of society to discourage corrupt practices and support the government’s efforts to eradicate corruption from the country.\nChairman presented NAB Annual Report 2020 to National Assembly Speaker and briefed him about his organization’s performance which had recovered Rs. 323.29 billion during 2020.\nHe informed that NAB received 24,706 complaints and disposed-off 30,405 complaints including under-process complaints from the previous year. NAB processed 878 complaints verifications, besides conducting 369 inquiries, 175 investigations and filed 136 references before the Accountability Courts during the past year.\nHe apprised that the overall success ratio of prosecution was 66 percent during the year 2020. He apprised that reputed National and international organizations like Transparency International Pakistan, World Economic Forum, PILDAT and Mishaal Pakistan have appreciated the defrosts of NAB in eradication of corruption specially to aware people about the ill effects of corruption.\nAppreciating the performance of NAB, the Speaker said that the organization had done a commendable job by waging a war against corrupt elements and recovering Rs. 323.29 Billion during 2020.\nHe lauded the efforts of the Chairman NAB for his personal indulgence for recovery of billions of hard earned money of effectees of housing societies and money laundering.\nHe assured the Chairman of his complete support in strengthening the organization to weed out corruption from the society.",
  "retrievedAt": "2025-08-11T20:56:41.870Z"
}
