{
  "title": "NCOC expresses concern over spike in COVID-19 cases; takes notice of SOPs violations",
  "link": "https://www.app.com.pk/national/ncoc-expresses-concern-over-spike-in-covid-19-cases-takes-notice-of-sops-violations/",
  "date_published": "2021-07-07T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP): The National Command and Operation Centre (NCOC) on Wednesday expressed concerns over increase in COVID-19 cases across the country and took notice of violation of standard operating procedures (SOPs) in various sectors.\nThe NCOC session was held here under the chairmanship of Federal Minister for Planning, Development and Special Initiatives, Asad Umar whereas PM aide on health, Dr Faisal Sultan and all the provincial chief secretaries also attended the meeting through video link.\nThe Forum directed all provinces to take special measures to implement SOPs and expedite the vaccination process for stemming the disease spread.\nThe federating units were given special directives for implementation of SOPs issued in connection with Eid-ul-Azha, the forum said.\nThe forum was briefed that the Western Border (Pak-Afghan Border) was closed on June 4, 2021 due to the disturbing situation arising in Afghanistan after rampant outbreak of the contagion.\nThe forum was informed that besides Pakistani and Afghan nationals stranded on both sides during the Border closure, patients and students were given special exemption.\nThe Forum was informed that special arrangements were made for the repatriation of Pakistanis stranded in Afghanistan at the Chaman and Torkham Borders.\nThe Pakistanis, returning from Afghanistan, who have received both doses of COVID-19 vaccine, would be placed under mandatory quarantine for 10 days in case of testing COVID-19 positive, the forum decided.\nMoreover, the individuals (repatriating from Afghanistan), who have not been vaccinated or received only one dose, would be kept in quarantine in their respective province for ten days, it added.\nThe forum decided that the guidelines issued for emergency medical cases and Afghan students would remain in force.",
  "retrievedAt": "2025-08-11T20:56:40.849Z"
}
