{
  "title": "CPEC to augment Sino-Pak relations: Governor Punjab",
  "link": "https://www.app.com.pk/national/cpec-to-augment-sino-pak-relations-governor-punjab/",
  "date_published": "2021-07-07T17:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 07 (APP): Governor Punjab Chaudhry Mohammad Sarwar has said that the China Pakistan Economic Corridor (CPEC) is harbinger of prosperity and development in the country and will further cement Sino-Pak ties.\nTalking to a delegation of e-commerce company at the Governor’s House here on Wednesday, he said CPEC project was a great example of Pak-China friendship and the government will complete every project of the CPEC in time.\nGovernor Punjab said the people of Pakistan will get opportunities for employment under CPEC, adding that the project will usher in a new era of progress.\nSarwar, however, said the antagonistic forces like India were unable to digest Pakistan’s economic growth and stability, adding that the anti-Pakistan forces were conspiring against the country.\nHe said Pakistan had the services of the best Armed Forces in the world which was capable of thwarting the nefarious designs of the enemy on every front, adding that India will never succeed in its nefarious designs of harming Pakistan.\nGovernor Punjab said the Pakistan Tehreek-e-Insaaf (PTI) government will provide complete security to the investors at all levels. He further said all the economic policies will be formulated with the consultation of the business community.\nHe said country’s economy was growing fast and it had fared better than many other economies in the region.\nHe said it was due to the congenial business environment that the local and foreign businessmen were investing in the various sectors in Pakistan, adding that it was an expression of confidence in the policies of Prime Minister Imran Khan.\nEarlier, the CEO Hafiz Ahmad briefed the Governor Punjab on his work regarding making use of the business opportunities offered by the Amazon and PayPal.",
  "retrievedAt": "2025-08-11T20:56:48.762Z"
}
