{
  "title": "Burhan’s martyrdom, a beacon of hope for Kashmiris’ indigenous struggle against occupation",
  "link": "https://www.app.com.pk/national/burhans-martyrdom-a-beacon-of-hope-for-kashmiris-indigenous-struggle-against-occupation/",
  "date_published": "2021-07-07T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP): Representing an entire generation, Burhan Muzaffar Wani, otherwise a cricket-loving boy, defeated the fictitious Indian narrative about Kashmiris’ indigenous freedom struggle, to serve as a beacon of hope for the enthusiastic youth brimming for independence.\nKashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Azad Jammu and Kashmir, Pakistan and abroad will observe July 8—the martyrdom anniversary of the famous youth leader and his fellows— as Resistance Day to pay tribute to martyrs; reiterate their commitment for continuing freedom struggle; and remind the world of its promises made to Kashmiris.\nIndia had long been trying to equate the freedom struggle of Kashmir with terrorism to influence the world opinion in its favour and suppress the Kashmiris indigenous movement for right to self-determination.\nBlaming Pakistan for every wrong happening in India and most particularly, the anti-India activities in occupied Kashmir, was the strategic tact India had been using for decades now, particularly since post 9/11 to depict Kashmir issue as a case of terrorism instead of struggle for right to self-determination.\nHowever the extra-judicial killing of Kashmir leader, Burhan Muzzaffar Wani along with his associates on July 8, 2016 and the succeeding anti-India uprising spoiled all Indian efforts as the world was not ready to support Indian narrative of sponsored militancy in occupied Kashmir.\nWani was born to a highly-educated upper-class Kashmiri family in Dadsara village of Tral area of Pulwama, Jammu and Kashmir. His story began on a summer evening in 2010 –the deadly summer agitation in which 130 civilians were brutally gunned down by Indian forces. Wani, his brother Khalid and a friend were riding a motorbike in Tral, in South Kashmir, and were stopped by the Indian security forces, ordered to get cigarettes for them, and in return beaten and humiliated for no reason at all.\nIn 2015, Wani’s brother Khalid was martyred by Indian forces. The loss further strengthened Burhan’s resolve to fight the Indian occupation and entice Kashmiri youth through the social networking media.\nBurhan did not embark on a lonely journey. Many teenagers and youth in the Valley have been victims of similar oppression or were influenced by the excessive daily humiliations of tyranny and excessive militarization. Burhan Wani was being seen as a symbol defiance against oppression.\nOn the other hand, India had never been serious in resolving Kashmir issue as it had been using brute force as a strategy to quell the struggle of Kashmiris and the people of the soil have no option but to stand for resistance when they are pushed against wall, said an APHC leader Kifayat Hussain while talking to APP.\nHe said that Burhan Wani was the voice of youth and he represented the youth of Kashmir, determined to continue their struggle against Indian rule till the cherished goal of freedom was achieved.\nWani was part of a new generation of young, educated Kashmiri youth using social media to spread their quest for independence from Indian rule. Wani was extremely active on social media, and did not hide his identity behind a mask.\nHe was known for utilizing social media for promotion of freedom struggle and motivating youth to play their due role in getting freedom from Indian bondage.\n“Burhan Wani created awareness among Kashmiri youth about their rights using social media in a most effective manner and now the indigenous freedom movement had got further strength,” said another Hurriyat Leader Mushtaq Hussan Gilani.\n“The way he [Burhan] imbibed new spirit and gave a new direction to the movement is a proud legacy that would continue to inspire our coming generations”, said Shafiq-ur-Rehman another Kashmiri leader.\nFor many observers, it was Indian intransigence that had been pushing the Kashmiris towards choosing the hard path. Had India honoured its own promises made to Kashmiris and respected the United Nations resolutions, the situation would have been different. But instead, India remains hell bent to change the demography of Kashmir for its own benefit.\nThe August 5, 2019 illegal, immoral and unconstitutional actions of revoking article 370 and 35A was yet another onslaught on Kashmiris basic rights, which depicted Indian obduracy and stubbornness towards the issue. Soon after this, the United Nations maintained that its position on this region was governed by charter and applicable Security Council resolutions besides recalling Simla Agreement of 1972 which states that the final status of Jammu and Kashmir is to be settled by peaceful means”, in accordance with the UN Charter.\nThe resolution of Kashmir dispute would not only have positive impact on the lives of Kashmiris, but would be more beneficial for the whole sub-continent in terms of peace and prosperity. It would be more in the interest of India to get this issue resolved and slash its defence budget to feed millions of its people living below the poverty line.\n(Report by M. Ashraf Wani)",
  "retrievedAt": "2025-08-11T20:56:42.780Z"
}
