{
  "title": "CDA, district administration continue operation against illegal Afghan refugees",
  "link": "https://www.app.com.pk/national/cda-district-administration-continue-operation-against-illegal-afghan-refugees/",
  "date_published": "2023-10-26T08:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): In pursuance of the government’s decision the crackdown against the Afghan refugees living illegally in the federal capital, the Capital Development Authority (CDA) and the district administration bulldozed hundreds of illegally built homes of Afghans situated in several areas of the city.\nAccording to an official of CDA, large contingents of Islamabad Police, Rangers and district administration looked after the operation against illegal Afghan refugees and heavy machinery was used for the purpose.\nThe officials said that they had issued a notice to the residents of the Afghan settlement soon after the notification issued by the government asking them to vacate their homes otherwise action would be taken against them.\nIn order to maintain peace in the federal capital, the operation would continue till the last eviction of the Afghan refugees as they were involved in criminal activities and had been occupying the places in the city for a long time.\nPakistan has gathered pace in this operation during the recent days in view of the fast-approaching deadline of October 31 set by the government for these refugees to leave Pakistan while the Islamabad Police also assisted in the operation.\nDuring the last week, the Ministry of States and Frontier Regions (SAFRON) had said that the Afghan nationals staying legally in Pakistan will neither be harassed nor arrested.\nIn a notification, the ministry said that the Afghans possessing Proof of Registration and Afghan Citizen Cards issued by the National Database and Registration Authority (NADRA) were allowed to stay in Pakistan temporarily and that registered Afghans could only return to their homeland voluntarily because harassing or arresting them would bring a bad name to Pakistan.\n“The respect international community has given to Pakistan and the goodwill it has earned for hosting millions of Afghan refugees for the last 43 years will be history if the government does not spare even those Afghans who are staying legally in the country,” read the notification.",
  "retrievedAt": "2025-08-11T10:15:26.710Z"
}
