{
  "title": "IHC restores Nawaz’s appeals against conviction in Al-Azizia Steel Mills, Avenfield references",
  "link": "https://www.app.com.pk/national/ihc-restores-nawazs-appeals-against-conviction-in-al-azizia-steel-mills-avenfield-references/",
  "date_published": "2023-10-26T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): The Islamabad High Court (IHC) on Wednesday restored the appeals of Pakistan Muslim League-Nawaz’s (PML-N) Quaid Muhammad Nawaz Sharif against his conviction in the Al-Azizia Steel Mills and Avenfield property references.\nA two-judge bench comprising Chief Justice Aamer Farooq and Justice Miangul Hassan Aurangzeb heard the petitions of Nawaz Sharif for restoration his appeals. Former prime minister Nawaz Sharif appeared before the bench along with his daughter Maryam Nawaz and legal team.\nDuring the course of proceedings, the National Accountability Bureau (NAB) Prosecutor General adopted the stance that the petitioner had rendered himself at the mercy of the court after surrender.\nThe chief justice questioned from the NAB officials that whether the Bureau wanted to arrest the petitioner. The prosecutor replied that they did not require the custody of former prime minister.\nCJ Farooq asked what would be the status of bails of the petitioner if his appeals were restored. The NAB prosecutor replied that the court could again sought surety bonds from the petitioner.\nNawaz’s lawyer Azam Nazir Tarar said that the protective bail petition would become ineffective if the appeals were restored.\nTo a court’s query, the prosecutor general said that the references could be withdrawn only at the stage of trial. A reference could not be withdrawn if an appeal against the decision was submitted, he added.\nHe said that they had no objection on restoration of Nawaz’s appeals after he had surrendered.\nJustice Miangul Hassan asked that whether the Bureau would give argument in favour of the judgments in the references.\nThe NAB prosecutor said that his department would take a stance after viewing the evidence.\nGiving reference of Maryam Nawaz’s case, Amjad Pervaiz Advocate said the court had stated in its judgment that despite being given repeated opportunities, NAB had failed to prove the role of Nawaz Sharif in the graft case. The court had stated that NAB had not fulfilled its responsibility, he added.\nAfter hearing arguments, the court reserved its verdict and later restored the appeals of former prime minister Nawaz Sharif in the two references. Justice Aamer Farooq announced the verdict.\nThe IHC had previously granted protective bail to the petitioner and sought arguments from NAB regarding revival of his appeals.",
  "retrievedAt": "2025-08-11T10:15:07.434Z"
}
