{
  "title": "Pakistan embassy celebrates Turkiye Yuzyili over a traditional Pakistan brunch",
  "link": "https://www.app.com.pk/national/pakistan-embassy-celebrates-turkiye-yuzyili-over-a-traditional-pakistan-brunch-2/",
  "date_published": "2023-10-26T15:42:00.000Z",
  "source": "APP",
  "content": "ANKARA, Oct 26 (APP): Ambassador of Pakistan to Turkiye Dr. Yousaf Junaid on Thursday hosted a traditional Pakistani brunch for Turkish dignitaries to celebrate the 100th anniversary of the Republic Day of Turkiye.\nThe dignitaries in attendance including Governor Ankara Vasip Sahin , Ankara Mayor Mansur Yavas, MP Ali Sahin, MP Burhan Kayaturk, MP Mehmet Emin Simsek, MP Mustafa Kaya, MP Muhammet Mufit Aydin, MP Adurrahim Dusak, Mehmet Mehdi Eker Former Minister of Food and Agriculture, Rector Ostim University Murat Yulek, President SDE Guray Alpar, President ANKASAM Prof Mehmet Seyfettin Erol, former Turkish ambassadors to Pakistan Rauf Engin Soysal, Mustafa Yurdakul, DDG TRT Omer Faruk Tanriverdi and dignitaries from academia, business and media.\nSpeaking on the occasion, Chairman of Pakistan Turkiye Parliamentary Friendship Group Ali Sahin said that Pakistan-Turkiye relations were a gift from Allah Almighty for the peoples of both countries.\nThese centuries-old brotherly and strategic relations were not only a source of mutual strength but also served as an anchor for regional stability under the direction and vision of the leaderships of both countries, he added.\nAnkara Mayor Mansur Yavas underscored that Pakistan Turkiye enjoyed deep-rooted historical, cultural and brotherly ties and this friendship would grow stronger in the years to come, based on our shared values and mutual interests.\nIn his remarks, Governor Ankara Vasip Sahin stated that Pakistan and Turkiye relations were exemplary as both countries had always stood together in times of need and have consistently supported each other on regional and global platforms.\nWhile congratulating the Turkish nation, Ambassador Dr Yousaf Junaid paid rich tribute to Turkiye’s founder Ghazi Mustafa Kemal Ataturk’s leadership in war of liberation and subsequent founding of Republic.\nHe said that the centenary of the Republic was a testament to the unwavering commitment and vision of the Turkish leadership and people, who had worked tirelessly to build a prosperous and democratic nation despite serious challenges.\nThe ambassador also highlighted that under the visionary leadership of President Recep Tayyip Erdogan, Turkiye progress and development achieved new heights and Turkiye emerged as a strong prosperous country in the comity of nations.\nHighlighting glorious Pakistan-Turkiye bilateral relations, the ambassador reiterated that ‘One Nation- Two States’ best described the fraternal Pakistan-Turkiye relationship, founded on common religious, cultural and linguistic affinities and a shared history.\nHe underscored that these exemplary fraternal ties, have no match in the world in terms of warmth, depth and unanimity of views.\nReferring to the current situation in Palestine and Kashmir, the ambassador stated that Pakistan and Turkiye would continue to play their role in bringing peace to the oppressed people of Kashmir and Palestine.\nThe participants thanked the Ambassador for celebrating Turkiye Yuzyili with zeal and enthusiasm.\nThe participants prayed for even greater accomplishments, prosperity, unity and stronger Pakistan-Turkiye bonds of brotherhood and friendship.",
  "retrievedAt": "2025-08-11T10:14:56.546Z"
}
