{
  "title": "Saudi ambassador appreciates IIUI Sports Gala",
  "link": "https://www.app.com.pk/national/saudi-ambassador-appreciates-iiui-sports-gala/",
  "date_published": "2023-10-26T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): The Sports Gala of International Islamic University (IIU) concluded with a colorful ceremony at the male Campus on Thursday that was graced by Saudi Ambassador Nawaf bin Said Al-Malki.\nThe ambassador congratulated the president of IIU and the university administration for organizing a successful sports gala and the active participation of national and foreign students.\nHe said that technology has caused a decrease in sports activities and IIU’s recent effort is laudable in this regard as it will help promote healthy activities in youth. Referring to Pak-Saudi relations, he said that the whole world knows the brotherly and exemplary relations between Saudi Arabia and Pakistan.\nHe said Pakistan has a special place in our hearts. He furthered that the Custodian of the Two Holy Mosques and the Saudi government have always valued relations with Pakistan. Around 1,000 students from Pakistan and more than 30 countries participated in this week-long sports gala of the International Islamic University.\nMore than 50 departments of 11 faculties of the university participated in more than 30 sports categories in indoor, and outdoor games and athletics competitions.\nThe winner of the sports gala 2023 was the Faculty of Engineering and Technology, whose teams won most of the competitions. The Faculty of Social Sciences stood second, while the Faculty of Languages and Literature secured the third position.\nThe Faculty of Computing won the tug-of-war at the closing ceremony. The Faculty of Social Sciences also won the best participation award. The most appreciated performance in the ceremony was the performance of Indonesian students who demonstrated their traditional martial arts.\nSpeaking on the occasion, International Islamic University President Dr. Hathal Homoud Al-Otaibi said that the Sports Gala 2023 was a memorable event in the history of the university.\nHe said that sports give us an opportunity to prepare for winning and losing in life and they play a key role in improving the health and education of the youth. He said that the enthusiasm and dedication of the students and the hard work for the success of this event are commendable. He especially thanked the Ambassador of Saudi Arabia for his visit.\nHe said that today, the coordinators of students, coaches, their teams, administration and students deserve appreciation and felicitations. Dr. Hathal announced that a similar sports gala will also be organized in the women’s campus of the university which will be held from November 13 to 17. On this occasion, the Saudi Ambassador distributed prizes and trophies to the winning faculties.\nVice presidents, deans, DG, and a large number of teachers and students attended the concluding ceremony. The host of the event was Dr. Ghufran Ali Khan, the advisor of the students, who also presented the report of the event.\nLater, the honourable KSA ambassador along with the IIU President also visited the newly established food street and state-of-the-art students’ facilitation centre at the Directorate of Academics and Examinations of IIU.",
  "retrievedAt": "2025-08-11T10:15:14.019Z"
}
