{
  "title": "Govt to appeal SC’s military courts verdict over “serious” implications: PM",
  "link": "https://www.app.com.pk/national/govt-to-appeal-scs-military-court-trial-verdict-over-serious-implications-pm/",
  "date_published": "2023-10-26T18:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday said that the government would appeal the Supreme Court’s decision against the trial of civilians in the military courts as it had “serious” implications.\n“Yes Inshallah, we will go for appeal,” the prime minister said.\nIn interviews with two different private television channels, he said the law was promulgated by the parliament which was also the forum to change it but no one took up the issue there.\nHe said without being apologetic, the government would look into the citations and reasoning which the court verdict was based on.\n“After examining those reasons, we will definitely go for appeal because it (verdict) has serious implications. This is not just about one or the other group….” he commented and asked whether, any civilian would be let go based on this decision if he carries out any activity on anyone’s behest in the SPD (Strategic Planning Division).\nHe said the government would also look into the security situation as well as the social impacts and added that the military installations were directly linked with the national security.\nDiscussing the political situation, Prime Minister Kakar said the government was committed to assisting the electoral process and ensure level laying field to all the political parties.\nHe said the PTI was faced with the post-May 9 challenge and the party gatherings were disrupted after the police raided there to arrest the party leaders accused of the arson.\nHe said even during the martial laws, no one ever attacked the military installations which happened on May 9.\nThe prime minister said the arrest of a political worker was nothing extraordinary as the law enforcement agencies could not be barred from apprehending anyone.\nRubbishing the notion of caretaker government’s tilt towards PML-N, the prime minister called it a part of the political discourse which he did not believe as the government had the policy of fear or favour to none.\nHe said so far, he could not find any evidence of institutional interference in favour or against any party.\nPrime Minister Kakar said the government was in a good working relationship with the Election Commission which was carrying forward the electoral process to accomplish it soon with the holding of general elections.\nHe said the government had an also excellent working relationship with the Establishment and no individual or political party could alone address the country’s economic and other issues.\nAsked about the future of Imran Khan, he said it was subject to the judicial outcomes of the cases against him.\nHe told the interviewer that he had been following him since 1996 and had also voted his party in 2013 and 2018 polls getting impressed by his person, philanthropic services and considering him an answer to the country’s issues.\n“But I did not vote him to declare war against the state,” he commented.\nComing to the expulsion of illegal foreign nationals from Pakistan, Prime Minister Kakar said thousands of the people had left and many had also opted to go back voluntarily. The Afghan side is also mentally ready to accept them back, he added.\nHe reiterated that registered refugees were not being deported rather the operation was to do with the illegal residents as well as those living with identity theft.\n“We are are conscious and and careful. In extreme cases we may also go for DNA. An incentive-based mechanism will also be launched,” he remarked.\nHe said following the expiry of the deadline the law would be enforced more effectively through intelligence based actions as well as the spot checking through organised check posts.\nHowever, he said Pakistan was not going to ban such Afghans permanently rather would allow them back subject to the issuance of Pakistani visas.\nAsked how to end the terrorist attacks by TTP from Afghanistan, he said Pakistan would exercise any option to ensure security of its citizens and the return of the illegal foreign national was also linked with the process.\nComing to the economic situation, the prime minister said with depreciation of dollar value, the country’s debt burden declined by Rs4000 billion and provided relief to the people in form of reduced oil prices. The price control committees have been activated to trickle down impact on commodities’ prices.\nHe said the government was ready to go through the IMF review process and expressed the hope that the country would receive second tranche of the loan.\nTo another question, the prime minister said the next phase of the BRI was on the course for global cooperation comprising land, aerial and sea connectivity with Pakistan also being part of it.\nAsked about the controversy after his media interaction, the prime minister explained that he intended to initiate a conversation about the existing business model of the media outlets which was turning into dinosaurs.\nHe viewed that the government advertisements, in one way or the other could influence the editorial policy.\nHe said despite being a prime minister, he could contribute to a public discourse which should also not be held back out fearing some people’s annoyance.",
  "retrievedAt": "2025-08-11T10:14:53.652Z"
}
