{
  "title": "Afghanistan has no exception on visa issue, says Minister",
  "link": "https://www.app.com.pk/national/afghanistan-has-no-exception-on-visa-issue-says-minister/",
  "date_published": "2023-10-26T14:54:00.000Z",
  "source": "APP",
  "content": "QUETTA, Oct 26 (APP): Caretaker Information Minister of Balchistan, Jan Achakzai reiterating government resolve said any foreigner wanted to enter in Pakistan either through land or aerial route, will have to follow the visa policy of Pakistan and Afghanistan has no exception in this regard.\n“Each individual, may it be Afghan national or a national of any other country, he will have to show passport and valid visa before entering into Pakistan. This is the non-negotiable policy and a red line of our state,” he said while talking to APP here on Thursday.\nThe Information minister said the caretaker government is committed to convince the participants of Chaman sit-in to culminate their protest.\nWe have held three meetings, and it is third round wherein, the government is engaged with the protesting people of border town for reaching to an amicable solution.\nCommenting the protesting people demand, he said they want relaxation of visa to the people of Chaman in Pakistan and Boldak , a local border town of Afghanistan .\nHowever, he clarified that this demand is unacceptable as apex committee chaired by PM of Pakistan Anwarul Haq Kakar and COAS Asim Munir had decided that movement across the border would be subject to passports and visas, while electronic Afghan identity cards (or e-tazkiras) would only be accepted until October 31.\nTo a question, he said that a committee has been formed on the issue of blocked NICs. Hope, government will resolve this genuine issue of the people of Balochistan.\nAbout the repatriation of illegal immigrants, he emphasized that after the deadline, stern action will be taken against those living illegally.\n“Assembly points have been formed at Pishin, Qila Abdullah and Chaman for smooth repatriation of illegal immigrants”, he added.",
  "retrievedAt": "2025-08-11T10:15:02.292Z"
}
