{
  "title": "Tensions erupt in Sutlej villages over ‘dykes disputes’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALNAGAR: Tensions have intensified in several villages across the district as villagers have formed opposing factions over whether to demolish or further strengthen protective embankments in flood-affected areas following the continuous rise in water levels in the Sutlej, Dawn has learnt.\n\nCurrently, police have been deployed in several villages, including Hasil Sarho, Nasirpur Matan, Chak Araiyan, Chak Nurpur in Minchinabad tehsil.\n\nThe irrigation and police sources alleged that some influential landlords were breaking dykes to minimise damage to hundreds of acres of their lands, endangering the entire area. However, due to resistance from other residents of the areas, groups have emerged among them.\n\nShehar Farid Station House Officer Sajjad Ahmad told Dawn that clashes had also erupted in almost 40 villages of Chishtian, where several small and large dykes were established.\n\nHe said people tried to break these dykes to remove water from their area, however, people of adjacent localities resisted their efforts. This later turned into serious disputes and the administration had so far registered cases against 42 people involved in clashes, he added.\n\nLandlords accused of illegally breaching dykes to save farmland\n\nAlthough the water level in the Sutlej decreased from 130,000 cusecs to 127,000 cusecs in the last three days, according to the irrigation and revenue sources, protective dykes were built in inappropriate places in a non-technical manner, and they could not withstand the rapid flow of water for long. As a result, dozens of dykes broke which increased the number of affected villages from 134 to 143 within the past three days, they said.\n\nThe water level in the Sutlej is at its highest level of 138,000 cusecs. However, the district administration, in a recent notification, issued an alert about further increase in the water level in the river and appealed to the public to take precautionary measures.\n\nA report issued by the DC office on Monday, a copy of which is available with Dawn, stated that more than 100,000 acres of agricultural land had been affected by the floods, while the number of people displaced from the affected areas had reached 129,553. It said that 12,557 people and 47,614 livestock had been rescued from the affected areas so far.\n\nTalking to Dawn, Bahawalnagar Deputy Commissioner Zoulfiqar Ahmad expressed the hope about controlling the flood situation and also hinted at taking strict measures to stop breach of protective dykes or canals.\n\nHe said people planning to break protective dykes or canals had been strictly warned, and strict action would be taken against those involved in such activities.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:03:16.814Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940547/tensions-erupt-in-sutlej-villages-over-dykes-disputes",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:50.000Z"
}
