{
  "title": "BRICS leaders denounce protectionism, tariff ‘blackmail’ - World - DAWN.COM",
  "author": null,
  "content": "BRASILIA: Leaders of the 11-member BRICS bloc railed against economic protectionism and “tariff blackmail” during a virtual meeting on Monday held amid a damaging trade war with US President Donald Trump.\n\nThe group of emerging economies met via videoconference at the initiative of Brazil’s President Luiz Inacio Lula da Silva, whose office said it was necessary to address the “intensification of unilateral measures” in the world.\n\nThe BRICS represents nearly 40 per cent of global GDP and almost half of the world’s population.\n\nSeveral of its members are among those most affected by what Lula referred to Monday as “tariff blackmail” and “unjustified and illegal” trade practices.\n\nXi Jinping calls for building open global economy, sharing opportunities and achieving win-win results through fairness\n\nAddressing his colleagues, Chinese President Xi Jinping called for the upholding of “the multilateral trading system with the World Trade Organisation at its core” and for rejection of “all forms of protectionism.”\n\nBrazil’s exports to the United States plunged 18.5 per cent year-on-year in August after Trump slapped his highest level of trade tariff — 50pc — on a range of goods from Latin America’s biggest economy.\n\nTrump is punishing Brazil for what he calls a “witch hunt” against his ally, former president Jair Bolsonaro who is on trial for allegedly plotting a coup to take power back from Lula after losing the 2022 elections. A verdict in the trial is expected this week.\n\n“Tariff blackmail is being normalised as an instrument to conquer markets and interfere in domestic affairs,” Lula said.\n\n‘Great hardships’\n\nWashington also imposed tariffs of up to 50pc on Indian imports, accusing New Delhi of fueling Moscow’s deadly attacks on Ukraine by purchasing Russian oil.\n\nRussian President Vladimir Putin also took part in the virtual meeting, just days after meeting Xi, North Korea’s Kim Yong Un and India’s Narendra Modi in China where regional leaders slammed “bullying behavior” in a veiled reference to Trump’s United States.\n\nSouth Africa for its part, was hit with a 30 percent tariff — the highest in sub-Saharan Africa — amid soaring tensions with Washington over a range of domestic and international policies. Trump has said he would not attend the G20 summit in South Africa later this year.\n\nSouth African President Cyril Ramaphosa, in a prepared speech, said “unilateral tariff actions are contributing to an increasingly protectionist environment which poses great hardships and danger for the countries of the Global South.”\n\nIn July, Trump lashed out at the BRICS and threatened its members with additional tariffs after they voiced concern that his trade war was putting the global economy at risk.\n\n“No matter how the international situation changes, we must remain steadfast in promoting the building of an open global economy, sharing opportunities and achieving win-win results through openness,” Xi reiterated.\n\nOther BRICS members are Indonesia, Egypt, Ethiopia, Iran, Saudi Arabia and the United Arab Emirates.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:03:20.292Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940681/brics-leaders-denounce-protectionism-tariff-blackmail",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T03:51:26.000Z"
}
