{
  "title": "VIP visits, ‘media glare’ at Kasur’s Talwar Post relief camp irk flood victims - Pakistan - DAWN.COM",
  "author": null,
  "content": "KASUR: The district administration continues to evacuate, transport, provide food and fodder to the flood-hit villagers as the Sutlej is flowing with ‘exceptionally high’ flood level.\n\nHowever, flood victims have alleged discriminatory behaviour in relief efforts. They claim that Ganda Singh Talwar post has received undue attention due to visits by ministers and prominent political figures, while other severely affected areas like Kanganpur, Mandi Usmanwala, and Balloki, where relief camps were officially set up are being neglected.\n\nDuring a provincial assembly session on Saturday, PML-N MPA Ahsan Raza openly criticised his own government for the allegedly biased distribution of aid. He accused the administration of favouritism in distributing food and fodder, particularly at politically significant points.\n\nFlood victims across multiple areas continue to face severe hardships due to a shortage of boats. This shortage has not only hampered evacuation efforts but also delayed the supply of essential food, fodder, and medicines. Welfare organisations and stranded villagers seeking transport have reported waiting for hours, as boats were allegedly diverted for VIP movement and political visits.\n\nDC denies charges of discrimination in distribution\n\nAn official, speaking on condition of anonymity, lamented the scene at Ganda Singh Talwar, describing it as a recreational park for some people while it was a ray of hope for the stranded people waiting for food, fodder and medicines.At Kothi Fateh Muhammad, downstream from Sutlej, the water level has reached 15 feet, damaging dozens of villages.\n\nThe Ravi at Head Baloki is also experiencing a high flood, with 125,000 cusecs of water discharge, slightly reduced from a peak of 148,000 cusecs over the past 24 hours.\n\nAt Ganda Singh Headworks, the flood situation remains critical, with a discharge of 319,295 cusecs recorded on Monday. The region has been grappling with this emergency for nearly a week. Over 70 villages have been submerged and thousands of acres of crops have been destroyed.\n\nLocal residents reported that only five boats were available in the Mandi Usmanwala area on Monday. One boat broke down, and the remaining four were preoccupied with searching for the body of a youth who drowned while filming a TikTok video. As a result, no aid official or private could reach around a dozen villages due to the unavailability of boats.\n\nIn Kanganpur and Kothi Fateh Muhammad, a similar shortage persists. In case of medical emergencies, residents of villages like Doana, Shahbazkay, Rukanpura, Muradkay, Khanay Peer, and Sher Kot reportedly have to wait several hours for a boat.\n\nIn Phoolnagar’s Kamogil village, the revenue department declined to repair a broken embankment, citing the lack of machinery. Villagers later restored the dyke through self-help efforts.\n\nPrivate welfare organisations remain active in delivering aid to remote villages, including Kamogil, Nathay Jageer, Jaja Kalan, Chatri, Wazirpur, Thama Kamyana, and Dalu Multani. Residents say official relief from the district or provincial government in these areas is rare.\n\nTensions also arose earlier when the district administration reportedly dismantled a relief camp run by a political party merely because it had banners displaying the party leader’s picture even though it was operating during a medium flood phase.\n\nSpeaking to Dawn, Deputy Commissioner Imran Ali said the administration had deployed 85 boats across the district.He said the boats had been distributed as per the population proportion so that all could be helped.He denied allegations of discrimination and claimed that on Monday alone, 2,000 food boxes and ration bags were delivered.\n\nThe DC added that 250,000 people from 72 villages and hamlets have been displaced by the floods. So far, 95,000 people have been transported to safer areas, while 113,000 remain stranded in submerged zones. He emphasised that food and fodder are being provided without bias, in accordance with the vision of the Punjab chief minister.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/091215187eb9781.webp",
  "retrievedAt": "2025-10-12T04:03:27.330Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940558/vip-visits-media-glare-at-kasurs-talwar-post-relief-camp-irk-flood-victims",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:49.000Z"
}
