{
  "title": "PML-N’s Rana Sanaullah wins Senate by-election for Punjab seat - Pakistan - DAWN.COM",
  "author": null,
  "content": "Adviser to the Prime Minister on Political Affairs Rana Sanaullah Khan won the Senate by-election from Punjab on Tuesday, according to unofficial results.\n\nAccording to Form-56 of the election results, the government candidate Sanaullah won after getting 250 votes.\n\nThe polling was held at the Punjab Assembly. Out of 363 members of the provincial legislature, 251 cast their ballots and one vote was rejected.\n\nSanaullah and the opposition’s Salma Ejaz, wife of disqualified candidate Ejaz Chaudhry, were in the fray.\n\nHowever, the opposition PTI had boycotted the by-election for the seat that fell vacant due to the disqualification of party senator Chaudhry.\n\nThe government alliance had a majority of 263 voters, while the opposition had the support of 100 voters. The polling process in the Punjab Assembly continued uninterrupted from 9am to 4pm.\n\nAddressing the media after his victory, Sanaullah said, “The PTI did not choose to boycott the democratic process but chose to escape from the elections.\n\nTheir boycott of the elections is a lack of confidence in their members.“\n\nHe also condemned the attack on Aleema Khan during his interaction with the media.\n\nPunjab Chief Minister Maryam Nawaz and Punjab Information Minister Azma Bokhari were also present in the assembly to vote for Sanaullah.\n\nEarlier in the month, according to PTI’s media wing, the annou­ncement to boycott the by-election was made by the expected candidate Salma Ejaz herself. She made it clear that she will not contest the by-election as she does not want to become part of the ‘fraudulent elections’.\n\nTwelve PTI lawmakers in Punjab had been disqualified by the Election Commission of Pakistan (ECP) following their conviction in the May 9, 2023 cases. The disqualified lawmakers comprise eight National Assembly and four Punjab Assembly legislators. The NA-129, Lahore, fell vacant on the death of MNA and former governor Mian Azhar.\n\nPTI patron-in-chief Imran Khan has barred his party from contesting the by-polls except on NA-129 where Azhar’s son Hammad Azhar is likely to be the party’s candidate.\n\n“We will not field any candidates in the by-elections for the seats of our unjustly disqualified members. These individuals stood firm with PTI despite extreme challenges. Therefore, the party will completely boycott these by-elections,” Mr Khan had said in a recent tweet.\n\nAzma Bokhari claimed the PTI had already fled the by-election arena. “The PTI is unable to find candidates willing to face PML-N in the field,” she added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:31:46.981Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940757/pml-ns-rana-sanaullah-wins-senate-by-election-for-punjab-seat",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T13:06:20.000Z"
}
