{
  "title": "Gujrat flooding: Main commercial areas return to normalcy - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: Even after 72 hours of Chief Minister Maryam Nawaz’s ultimatum of cleaning Gujrat city’s flooding within 48 hours, some major areas of the city were still inundated for the sixth consecutive day on Monday.\n\nHowever, the city’s main commercial areas returned to normalcy after clearance of water and the traders resumed their businesses in Muslim Bazaar, on Circular Road, GT Road and other adjoining localities.\n\nSkin diseases, throat infections and gastroenteritis have also surfaced in the main affected areas of the city.\n\nThe crucial areas like Jinnah Road, Jail Road, Rehman Shaheed Road, Ghareebpura, Khawajgan Road, Prince Chowk, Shah Hussain Shafiabad, Bara Dari, Jalalpur Jattan Road, Zahoor Elahi Stadium Market and many other areas remained submerged with the floodwater throughout the day. The situation was still the same when this report was filed at night.\n\nSome major areas still under water; 11 booked for breaching dykes near Daulat Nagar\n\nSome locals forcibly breached the dykes near Malhu Khokhar and DC embankment on Sunday night, diverting the floodwater again towards the Gujrat city.\n\nHowever, the authorities reached there and again started the efforts to plug these breaches by Monday morning.\n\nOn the directions of the Gujrat DC, the police have booked 11 people, including a retired sub-inspector of police, on the charges of breaching the embankment at Malhu Khokhar. The case has been lodged with Daulat Nagar Police Station against a nominated suspect Fiaz Ahmed and his 10 unidentified accomplices.\n\nThe local traders have suffered huge losses after floodwater entered their shops and stayed there for at least five to six days as they could not even open their shops.\n\nThe patients and attendants of some private hospitals on the Jail Road and adjoining localities too were among the worst-affected people due to the severe flooding.\n\nMeanwhile, Punjab Minister for Local Bodies Mian Zeeshan Rafique, Gujranwala Commissioner Naveed Haider, Gujrat Deputy Commissioner Nurulain Qureshi and District Police Officer Rana Umar Farooq visited the different sore spots of the city as well as the points from where the floodwater entered it.\n\nA spokesman for the housing department said efforts were underway to clear the city of the urban flooding within the next few hours.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/09115233e78eaf5.webp",
  "retrievedAt": "2025-10-12T04:04:07.397Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940554/gujrat-flooding-main-commercial-areas-return-to-normalcy",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:50.000Z"
}
