{
  "title": "Israel targets Hamas leadership in military strikes on Qatar - World - DAWN.COM",
  "author": null,
  "content": "Israel launched an airstrike against Hamas leaders in Qatar on Tuesday, expanding military actions that have ranged across the Middle East to include the Gulf Arab state where the Palestinian group has long had its political base.\n\nQatar, which has acted as a mediator alongside Egypt in talks on a ceasefire in the almost two-year-old conflict in Gaza, condemned the attack as “cowardly” and called it a flagrant violation of international law.\n\nTwo Hamas sources told Reuters that Hamas officials in the ceasefire negotiating team survived the attack, which followed an evacuation order in Gaza City, where Israel is waging an offensive to try to destroy the group and its military capabilities in the Gaza Strip. A senior Hamas source told Al Jazeera that leaders of the group were targeted while discussing United States President Donald Trump’s proposal for a ceasefire in Gaza.\n\n“The IDF (Israeli military) and ISA (security agency) conducted a precise strike targeting the senior leadership of the Hamas terrorist organisation,” the Israeli military said, without specifying where the strike took place.\n\nAn Israeli military official told AFP that the military had carried out air strikes. “The name of the operation in Doha is Summit of Fire. These were air strikes,” a military official said.\n\nSome Israeli media outlets reported that United States President Donald Trump had allowed the attack.\n\nHowever, the Israeli prime minister’s office said, “Today’s action against the top terrorist chieftains of Hamas was a wholly independent Israeli operation. Israel initiated it, Israel conducted it, and Israel takes full responsibility.”\n\nResponding to a question about whether the US was alerted in advance and whether Trump had supported it, White House Press Secretary Karoline Leavitt said: “This morning, the Trump administration was notified by the US military that Israel was attacking Hamas, which, very unfortunately, was located in a section of Doha, the capital of Qatar.\n\n“Unilaterally bombing inside Qatar, a sovereign nation and close ally of the US, that is working very hard in bravely taking risks with us to broker peace, does not advance Israel or America’s goals. However, eliminating Hamas, who have profited off the misery of those living in Gaza, is a worthy goal. President Trump immediately directed special envoy Witkoff to inform the Qataris of the impending attack, which he did.\n\n“The president views Qatar as a strong ally and friend of the US and feels very badly about the location of the attack. President Trump wants all of the hostages in Gaza and the bodies of the dead released and this war to end now.”\n\nShe said Trump also talked to the Israeli prime minister after the attack, who said he quickly wanted peace. She said Trump believed the “unfortunate incident” could serve as an opportunity for peace, adding that the US president also talked with the Qatari emir and prime minister and thanked them for “their support and friendship to our country”.\n\nLeavitt added that Trump “assured them that such a thing will not happen again on their soil”.\n\n“We were informed in advance,” a White House official earlier told AFP on condition of anonymity about the strike on Qatar, a key ally that’s home to a large US military base.\n\nIsraeli Prime Minister Benjamin Netanyahu said he ordered the strikes following a deadly shooting in Jerusalem a day earlier, claimed by the Palestinian group.\n\n“Yesterday, following the deadly attacks in Jerusalem and Gaza, Prime Minister Netanyahu instructed all security agencies to prepare for the possibility of targeting Hamas leaders,” said a joint statement from Netanyahu and Defence Minister Israel Katz.\n\n“Today at noon, in light of an operational opportunity … the prime minister and the defence minister decided to implement the directive given last night. “\n\nThe assault is likely to deal a serious, if not fatal, blow to efforts to reach a ceasefire, especially since negotiations took place in the Gulf Arab country.\n\nQatari Foreign Ministry spokesperson Majed al-Ansari slammed the attack, saying: “The State of Qatar strongly condemns the cowardly Israeli attack that targeted residential buildings housing several members of the Political Bureau of Hamas in the Qatari capital, Doha. This criminal assault constitutes a blatant violation of all international laws and norms, and poses a serious threat to the security and safety of Qataris and residents in Qatar.”\n\nHe said the security forces, civil defence and relevant authorities immediately began addressing the incident and taking necessary measures to contain its repercussions and ensure the safety of the residents and surrounding areas.\n\n“While the State of Qatar strongly condemns this assault, it confirms that it will not tolerate this reckless Israeli behaviour and the ongoing disruption of regional security, nor any act that targets its security and sovereignty. Investigations are underway at the highest level, and further details will be announced as soon as they are available,” the spokesperson said.\n\nIsraeli media, citing a senior Israeli official, said the attack was aimed at top Hamas leaders, including Khalil al-Hayya, its Gaza chief.\n\nSmoke was seen rising over the Katara District in the capital, an eyewitness said.\n\nSmoke rises after explosions were heard in Doha on Tuesday. The Israeli military claimed it targeted senior Hamas leaders, after AFP journalists in Doha reported explosions and smoke rising above the Qatari capital, where the Palestinian group's political bureau is based. Via Reuters, AFP. #DawnToday\n\nPlumes of black smoke were billowing from the city’s Legtifya petrol station. Right next door to the petrol station is a small residential compound that has been guarded by Qatar’s emiri guard 24 hours a day since the beginning of the Gaza conflict.\n\nAmbulances and at least 15 police and unmarked government cars thronged the streets around the blast site an hour after the strike.\n\nAJ reported the head of the Palestine Liberation Organisation (PLO) condemned the “heinous” Israeli attack on the Qatari capital, saying it “constitutes a serious violation of international law and the sovereignty of the State of Qatar”.\n\n“It is considered a threat to security and stability in the region,” PLO Secretary General Hussein al-Sheikh said in a statement.\n\nPalestinian group Islamic Jihad, which has fought alongside Hamas in Gaza, condemned Israel’s targeting of its ally’s leaders.\n\nIsrael’s “targeting of a meeting of leaders of … Hamas in the Qatari capital, Doha, is a blatant criminal act that violates all human standards and values, as well as the most basic international laws and norms”, Islamic Jihad said in a statement.\n\nIsrael’s far-right Finance Minister Bezalel Smotrich praised the targeting of Hamas leaders.\n\n“Terrorists have no immunity and will never have immunity from Israel’s long arm anywhere in the world,” Smotrich wrote on X, hailing a “right decision and a perfect execution by the IDF (Israeli military) and the Shin Bet (security agency)”.\n\nThe US embassy in Qatar told citizens to shelter in place.\n\nChina’s embassy in Qatar issued a safety advisory to Chinese nationals after the Israeli strikes.\n\nIn a notice published on its social media platform, the embassy urged Chinese to “try to reduce unnecessary outings and avoid going to high-risk areas”.\n\nThe strikes come less than two weeks after armed forces chief Lieutenant General Eyal Zamir vowed to target the group’s leaders based abroad.\n\n“Most of Hamas’s leadership is abroad, and we will reach them as well,” Zamir had said on August 31.\n\nHamas and Israel have held multiple rounds of indirect ceasefire negotiations brokered by Qatar, Egypt and the United States throughout the nearly two-year Gaza conflict.\n\nDespite two temporary truces, the talks have failed to bring a lasting end to the fighting that has led to over 64,000 Palestinians killed.\n\nTrump said on Sunday he was issuing a “last warning” to Hamas, saying the Palestinian group must accept a deal to release Israeli prisoners.\n\n“The Israelis have accepted my terms. It is time for Hamas to accept as well. I have warned Hamas about the consequences of not accepting. This is my last warning,” he had said on social media.\n\n“We had some very good discussions. Good things could happen,” he told reporters. “I think we’re going to have a deal on Gaza very soon.”\n\nIn response to Trump’s comments, Hamas had said it was ready to “immediately sit at the negotiating table” following “some ideas received from the American side aimed at reaching a ceasefire agreement”.\n\nIn exchange for a truce, Hamas said it wanted “a clear declaration of the end of the war, a full withdrawal from the Gaza Strip, and the formation of a committee of independent Palestinians to manage the Gaza Strip, which would begin its duties immediately”.\n\nHamas had agreed last month to a ceasefire proposal that involved a 60-day truce and staggered prisoner releases.\n\nIsrael, however, has demanded that Hamas release all the prisoners at once, disarm itself and relinquish control of Gaza, among other conditions.\n\nToday’s attack came as Israel stepped up a deadly assault on Gaza City, the Palestinian territory’s largest urban centre.\n\nOn Monday, Israeli Prime Minister Benjamin Netanyahu issued a video statement addressing residents of the city: “I say to the residents: you have been warned, leave now!\n\n“All of this is just a prelude, just the opening, to the main intensified operation — the ground manoeuvre of our forces, who are now organising and assembling to enter Gaza City.“",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/09182552c9f7815.webp",
  "retrievedAt": "2025-09-19T14:31:52.039Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940759/israel-targets-hamas-leadership-in-military-strikes-on-qatar",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T13:03:26.000Z"
}
