{
  "title": "PM Shehbaz directs NDMA to speed up relief operations in flood-hit areas - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Mi­­n­i­ster Shehbaz Sharif on Monday directed the National Disaster Management Authority (NDMA) to expedite ongoing relief operations in flood-hit areas and ensure complete preparedness for potential flood situations due to rising water levels in rivers.\n\nChairing a meeting to re­­view ongoing rescue and relief operations in flood-hit areas, the prime minister instructed authorities concerned to ens­u­­re early warnings and timely evacuation of people living near rivers and areas facing flood risk.\n\nThe NDMA chairman briefed the prime minister on the current situation of flooding in rivers, the status of rising water level in rivers, and the relief operations for flood-affected people across the country.\n\nThe PM directed the NDMA to maintain full coordination with provincial governments and provincial disaster management authorities.\n\nHe also instructed authorities concerned to intensify search for missing people in flood-hit areas.\n\nOfficials told to ensure early warnings and timely evacuation of people living near rivers and areas facing flood risk\n\nThe prime minister was also briefed on the displacement of people due to floods and the ongoing rescue operations.\n\nThe participants of the meeting were apprised of the severe flooding conditions in the Chenab, Ravi, and Sutlej rivers at Trimmu and Panjnad barrages and Head Balloki, Head Sidhnai, Ganda Singh Wala, Head Sulemanki, and Head Islam.\n\nThe meeting was informed that convoys of relief goods were being sent continuously to flood-affected areas.\n\nOPF chief meets PM\n\nPrime Minister Shehbaz Sha­rif on Monday also met chief of Overseas Pakistanis Found­a­t­ion, Qamar Raza, and Managing director, Afzaal Bhatti, and reaffirmed that it was among the incumbent government’s priorities to provide them with all possible facilities.\n\nHe said that overseas Paki­stanis were rendering significant services as a strong workforce in the global market.\n\nDuring the meeting, the prime minister was briefed about the events held abroad to highlight Pakistan’s victory in the recent war with India.\n\nThe OPF chairman and MD apprised the prime minister of the issues faced by overseas Pakistanis and the measures taken by the government to address them.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68bf7d6a83c28.gif",
  "retrievedAt": "2025-09-19T14:32:29.252Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940635/pm-shehbaz-directs-ndma-to-speed-up-relief-operations-in-flood-hit-areas",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:26.000Z"
}
