{
  "title": "Four decades of dissent resumes despite Trump’s ‘take it down’ order - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Going back to the White House Peace Vigil is like stepping into another era. For decades, it has been a near-permanent presence in Lafayette Square, directly across from the White House, persistent in its call for world peace.\n\nVisitors from around the globe have encountered the ubiquitously small tent, with its handmade banners, which has persisted through rain, snow, and the summer heat — even on Christmas Day and the Fourth of July. But where past presidents respected its presence, the Donald Trump administration has taken a different approach, aiming to “take it down”.\n\nLast week, at a White House press briefing, someone described the vigil as an “eyesore” and asked President Trump about its presence. Trump bristled at the mention and interrupted: “I didn’t know that. Take it down. Take it down today, right now.”\n\nHours later, US Park Police dismantled the tent and banners, saying the action was part of a wider campaign to clear encampments in the capital. The White House defended the removal, calling the vigil a “hazard to those visiting the White House and the surrounding areas.”\n\nOrganisers of White House Peace Vigil remain defiant, vow to stave off legal challenges\n\nSupporters of the protest reject that reasoning, pointing out that the vigil has complied with federal park rules for more than four decades. But by Sunday night, only hours after police had cleared the square again that morning, the vigil was already back. The post had been reassembled, its red umbrella stretched tight against the evening breeze, and the familiar signs once more faced the White House.\n\nPassersby paused to read the weathered placards calling for peace and an end to war. Tourists lingered with cameras, while commuters slowed to glance at the scene.\n\nOrigin story\n\nThe vigil’s origins date back to June 1981, when activist William Thomas first began his demonstration across from the White House to advocate for nuclear disarmament and world peace. Soon after, Concepción Picciotto joined him, eventually becoming the face of the protest.\n\nIn the years after the Sept 11 attacks, Picciotto – the vigil’s most enduring presence – had explained the protest’s mission thus. “We condemn terrorism as strongly as any patriotic American… but we are also against America invading Afghanistan because that too would be a mistake.”\n\nShe maintained her daily watch for more than 35 years until her death in 2016, becoming a symbol of solitary defiance. Her successor, Philipos Melaku-Bello, has carried the vigil forward since then. Talking to Dawn, he said the activists are preparing a legal battle to prevent the vigil’s removal.\n\n“What we are doing is within our rights and is legal, so there’s no justification for removing it,” he said. “We have supporters all across the globe, and scores of lawmakers have offered to represent us in court.”\n\nNot everyone has embraced the vigil’s persistence, however. Rep. Jeff Van Drew (R-NJ) urged its removal, citing safety concerns and describing it as a blight on a historic space.\n\nTrump’s order also aligns with his broader push to clear homeless encampments ahead of the nation’s 250th anniversary in 2026.\n\nYet civil liberties advocates and local leaders have defended the vigil, noting its compliance with the First Amendment. Del. Eleanor Holmes Norton (D-DC.) has repeatedly drawn inspiration from its message, arguing that funding for nuclear weapons should instead go to housing, healthcare, and climate programs.\n\n“The First Amendment protects peaceful protests, even when they’re seen as unsightly or inconvenient,” she said. “If Representative Van Drew’s claim that the vigil creates public safety hazards were valid, it would have been removed long ago.”\n\nActivists also insist the vigil is not a mere ‘homeless camp’. “An encampment is where homeless people live,” Melaku-Bello explained. “As you can see, we don’t have beds here. We have signs — defending the right to freedom of speech and freedom of expression and condemning wars in Gaza and Iran,” he told Dawn.\n\nMaintaining the vigil requires constant staffing, a legal strategy designed to keep it within the boundaries of federal rules on overnight protests. Volunteers rotate shifts to ensure someone is always present, and Melaku-Bello himself often spends more than 100 hours a week on site.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68bf9f5fcf93d.jpg",
  "retrievedAt": "2025-10-12T04:03:28.001Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940664/four-decades-of-dissent-resumes-despite-trumps-take-it-down-order",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T03:30:01.000Z"
}
