{
  "title": "ATC extends Bushra, PTI leaders’ bail in Nov 26 protest case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Anti-Terrorism Court (ATC) Ju­­dge Abual Hasanat Moha­mmad Zulqarnain on Monday extended the pre-arrest bail of Bushra Bibi, Omar Ayub Khan and several other PTI leaders in cases pertaining to the Nov 26 protest and demonstrations held outside the Supreme Court.\n\nDuring the hearing, PTI leaders Sher Afzal Marwat and former Azad Jammu and Kashmir prime minister Abdul Qayyum Niazi appeared before the co­­u­rt, while exemption applications filed on behalf of Omar Ayub, Zartaj Gul and others were accepted.\n\nThe court observed that over 240 bail pleas of PTI leaders were pending and directed the parties to present arguments at the next hearing of the case on November 13. Cases against PTI leaders have been registered with Ramna, Sangjani, Tarnol and other police stations.\n\nMeanwhile, ATC Judge Tahir Abbas Sipra conducted proceedings in connected cases, where he noted that the letter written by the PTI founder requesting a jail trial in the Nov 26 election rigging and Azadi March protest cases had not yet received a response from authorities concerned.\n\n“If the state is serious about pursuing these cas­es, it should decide soon,” the judge remarked, adding that he would send a reminder on the matter. The court also distributed copies of the challan in the Kohsar police station case.\n\nDuring proceedings, ex­­emption applications were also filed by Omar Ayub and Ali Nawaz Awan. Re­­ferring to a viral video of Omar Ayub, Judge Sipra observed that “Omar Ayub is flying in the wind; he would have fallen ill in the courtroom”.\n\nDefence counsel, however, clarified that the video was old and not recent.\n\nSeparately, the procee­ding to indict KP Chief Mi­­nis­ter Ali Amin Ganda­pur in the audio leak case pending before an additional district and sessions judge was postponed once again.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:32:29.378Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940634/atc-extends-bushra-pti-leaders-bail-in-nov-26-protest-case",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:26.000Z"
}
