{
  "title": "GB prepares proposal for PM committee to restore trade - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: A 50-day-long protest sit-in intensified on Monday as traders in Gilgit-Baltistan (GB) shut down a customs and immigration office in Sost, blocking the Karakoram Highway and stranding thousands of travellers headed to China via the Khunjerab Pass.\n\nTraders have suspended all trade and travel activities, demanding the implementation of a two-point agenda related to taxation and stuck import consignments.\n\nIn response to the crisis, Prime Minister Shehbaz Sharif recently announced a one-time amnesty for the stuck consignments and formed a committee, chaired by Federal Minister for Power Division Awais Leghari, to find a resolution.\n\nThe GB cabinet submitted recommendations endorsing the traders’ demands and asking that the region be declared a non-tariff area. After the federal committee sent the recommendations back for review, the GB chief minister constituted a new nine-member committee on Thursday.\n\nThe new committee has recommended that all goods imported exclusively for consumption in GB be treated as tax-free and has suggested a special relief grant for traders to mitigate their financial losses.\n\nIt also suggested a special Consolidated SRO should be introduced to grant tax exemption for GB.\n\nOther recommendations include withdrawing a SRO 499/2009 imposed on certain containers, re-assessment and re-evaluation of those containers, waiving all demurrage charges, and delegating judicial powers to the local collector to expedite cases.\n\nThe committee’s recommendation is expected to receive approval from the GB cabinet and will be submitted to the prime minister’s committee this week.\n\nProtesters have announced they will continue their peaceful demonstration until their demands are accepted. They closed all entry and exit points for passengers between the two countries. The protest has garnered wider support, with a large solidarity demonstration held outside the GB Assembly hall in Gilgit.\n\nWomen protest marathon exclusion\n\nMeanwhile, female athletes are protesting after being excluded from the inaugural Sarfaranga National Marathon scheduled for Sept 14 at the Sarfaranga cold desert in Shigar.\n\nThe GB government, which announced the marathon as part of its Sarfaranga festival, initially sought applications from both male and female runners for the event, setting an online registration deadline of Sept 14.\n\nHowever, after women registered and paid the required bank deposit of Rs1000, the online application form was changed only to have male as a selectable option available.\n\nMona Khan, a woman adventurer from Islamabad, said that after she submitted her registration and fee, the application browser then showed only a male option.\n\n“When we talked to officials, they said only males can participate in the Marathon and women have been excluded,” she said.\n\nOfficials from Gilgit-Baltistan government departments did not respond to Dawn’s requests for comment.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:02:55.349Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940629/gb-prepares-proposal-for-pm-committee-to-restore-trade",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:27.000Z"
}
