{
  "title": "Karachi couple held for burning teenage maid gets bail - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate on Monday granted bail to a man and his wife who were arrested for allegedly burning their teenage maid with an electric iron at their home.\n\nThe couple, identified as Shahroz Muhammad Ali and Kanwal, were arrested on Sunday by the Ferozabad police, which registered a case against them under Sections 328-A (cruelty to a child) and 337-A (i) (shajjah) of the Pakistan Penal Code read with Section 14-(1) of the Sindh Prohibition of Employment of Children Act, 2017.\n\nThe said section of the child law states: “Whoever employs any child shall be punishable with imprisonment for a term which may extend to six months or with a fine which may extend to fifty thousand rupees, or with both.”\n\nOn Monday, the investigating officer produced the couple before Judicial Magistrate (East) Hameedullah and sought their physical remand for further interrogation.\n\nMeanwhile, the defence counsel requested the court to grant them bail, arguing that the offences mentioned in the FIR were bailable.\n\nAfter hearing both sides, the court granted bail to the couple against a surety bond of Rs30,000 each along with a personal bond. Subsequently, the couple was released and their handcuffs were removed after the surety amount was submitted before the court.\n\nSpeaking to Dawn, Police Surgeon Dr Summaiya Syed said that a 13-year-old girl from Ferozabad police station was brought to the Jinnah Postgraduate Medical Centre (JPMC) on Sunday night with “multiple burn marks in different stages of healing, all over the body.” She was “stable” but referred for treatment, the police surgeon added.\n\nAccording to the FIR, complainant Aasiya informed the police that around three months ago, she had sent her 13 to 14-year-old daughter to work as a house help at the residence of Shahroz and his wife Kanwal in PECHS Block 2, where the girl used to stay day and night.\n\nHowever, on Aug 31, Kanwal called the complainant and told her that her daughter was unwell and asked her to take the girl back.\n\nWhen Aasiya reached the flat, the girl told her that she had been burnt with an electric iron on different parts of her body and showed the marks.\n\nThe girl further stated to her mother that two days earlier, on Aug 29, while she was ironing Kanwal’s clothes, her dupatta had burnt. In reaction, Kanwal allegedly burnt her with the same iron, despite the girl begging her for forgiveness. She added that her husband had also physically assaulted her.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:32:16.798Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940590/karachi-couple-held-for-burning-teenage-maid-gets-bail",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:43.000Z"
}
