{
  "title": "113mm rain lashes Lahore, disrupts routine businesses - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Heavy rain lashed most of the areas of Lahore on Monday evening, inundating roads and localities and disrupting routine business. The first spell of rain started at about 4:30pm and continued non-stop for about one hour. After a gap of drizzle, the second spell of rain started at about 6:10pm and continued till 6:45.\n\nAccording to the Water and Sanitation Agency (Wasa), the city received maximum rain (113mm) till 7pm at Paniwala Talab and its surrounding localities, followed by Iqbal Town with 97mm, Jail Road 65mm, Airport 35mm, Gulberg, 77.5mm, Lakshami Chowk 96.5mm, Upper Mall 66.5mm, Mughalpura 32.5mm, Tajpura 40.5mm, Nishtar Town 79mm, Chowk Nakhuda 73.5mm, Farrakhabad 95mm, Gulshan-i-Ravi 64.5mm, Samanabad 83.5mm, Johar Town 66.5mm, Shadipura 58.5mm and Qartuba Chowk (Mozang) 67mm.\n\nAccording to the Met Office, Monday’s rain in Lahore and adjoining areas is the second last spell of the ongoing monsoon.\n\n“The last spell of monsoon will last for two days from Sept 15 to 16,” a Met official said while talking to Dawn. The heavy rain inundated several major roads in Gulberg, Johar Town, Mozang, Samanabad, Chowk Nakhudha, Farrukhabad, Lakshami Chowk, Railway Station, Township, Iqbal Town, Mughalpura, Tajpura, Jail Road, Gulshan-i-Ravi, the airport area and other parts of the city.\n\n“The city’s sewerage seems inadequate to timely drain out the rainstorm water. We have been seeing this mess for last many years,” deplores a motorist while talking to Dawn.\n\n“After a long time, I have seen various drainage projects being executed in Lahore these days. Let’s see what happens after completion of these projects — will they help the public in getting rid of inundating issues or not,” he argued.\n\nThe rain disrupted the electricity supply system in the provincial capital, tripping nearly 80 feeders of 11kV distribution capacity. According to a spokesperson for the Lahore Electric Supply Company (Lesco), efforts had been made to energise the tripped feeders in a bid to ensure restoration of electricity in various localities.\n\nThe spokesperson said that at 6:16pm, the Lesco’s demand was 3,461MW. On the other hand, the Lesco management has issued an advisory, requesting the public to remain away from the poles, wires etc.\n\n“Lahore has a combined drainage network/system that means the domestic/commercial sewage water and rainwater drain fall together into the Ravi after flowing into the main lines. Ideally, the drainage system for rainwater should be separate,” explained an official while talking to Dawn.\n\n“This is why the drainage system becomes choked and takes time to be drained fully in the rain season,” he added.\n\nOn the other hand, the Lahorites, despite efforts by Wasa, continue to suffer from the continuous rain. The situation is also adding to the miseries of residents of those localities where the floodwater is already accumulated for the last many days.\n\n“Our houses are already under floodwater and Monday’s rain has further increased level of water accumulated there for last many days,” said a flood-affected resident of the Theme Park — an illegal housing scheme where the floodwater drowned hundreds of houses completely.\n\nHe urged the government to speed up efforts to dry the area by draining out the accumulated floodwater.\n\nTHEME PARK: The Lahore district administration, led by DC Syed Musa Raza, visited Theme Park View housing scheme to review the water drainage activities there.\n\nOn this occasion, he directed the Water and Sanitation Agency (Wasa) to employ all resources to restore access of the people to the affected areas.\n\nThe DC emphasized the need for prompt action in response to complaints and warned of action on negligence in the water drainage process. To prevent dengue larva breeding, he sought fumigation after water drainage.\n\nHe also visited the new Ravi Bridge Shahdara to review the water flow in the river and relief operations. He directed all relevant departments and rescue agencies to maintain continuous monitoring and keep all machinery and equipment ready for relief operations. He urged the citizens not to pay heed to rumours.\n\nSyed Musa Raza said timely planning and proactive measures had been ensured for public safety and the district administration and all agencies were working together as a team to prioritise public safety.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68bf3ece87d6b.jpg",
  "retrievedAt": "2025-10-12T04:03:33.559Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940564/113mm-rain-lashes-lahore-disrupts-routine-businesses",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:09:49.000Z"
}
