{
  "title": "PkMAP protests suicide attack on Quetta public meeting - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Pakhtunkhwa Milli Awami Party (PkMAP) on Monday staged rallies across Khyber Pakhtunkhwa against a suicide blast targeting a public meeting in Quetta on Sept 2.\n\nThe Quetta gathering was attended by PkMAP chairman Mehmood Khan Achakzai, Balochistan National Party president Sardar Akhtar Jan Mengal and senior leaders of other parties.\n\nThe Pakistan Tehreek-i-Insaf leaders and workers joined protest rallies on the instructions of their detained leader, Imran Khan.\n\nIn Peshawar, a protest was staged outside the Peshawar Press Club, with PkMAP leaders Haji Inamullah and Niazbeen and PTI MNA Shandana Gulzar, leader Irfan Saleem and MPA Haji Fazal Ilahi in attendance.\n\nWarns if its leadership targeted again, entire province will be ‘shut down’\n\nThe speakers denounced the Quetta attack as an act against democratic values and praised Mr Achakzai as a voice for the oppressed and a symbol of constitutional resistance.\n\nMNA Shandana said that the PkMAP chief was targeted with a suicide bomber because Imran Khan had trusted him and he was making a struggle for the constitutional supremacy in the country.\n\nShe demanded those behind attacks on political leaders be exposed.\n\n“Some forces are trying to seize the mines and minerals in Pakhtun areas, so they’re spoiling the situation to grab those natural resources,” she said.\n\nAfzal Khan Khamosh, the central leader of the Mazdoor Kisan Party, said that unfortunately, the blood of Pakhtuns was being shed through bombs, but no one was bothered about it.\n\n“We [Pakhtuns] say that we are peaceful people, but no one listens to us,” he said.\n\nAddressing a large gathering in Swat, PkMAP provincial president Dr. Mohammad Ali said that such cowardly tactics could never silence Mehmood Achakzai or his party, according to a statement issued here on Monday.\n\nHe described the blast as an attack on the democratic voice of Pakhtun and Baloch nations.\n\nDr Ali called Achakzai a symbol of democracy and federalism in Pakistan.\n\n“Bombs attacks are actually attempts to silence him,” he said.\n\nIn Swabi, senior deputy chairman of PkMAP Arshad Khan termed the Quetta blast part of a conspiracy to suppress progressive voices.\n\nHe warned that if PkMAP leadership was targeted again, the party would shut down the entire province in protest.\n\n“These repeated attacks reflected a systematic effort to keep oppressed nations voiceless. They [perpetrators] want to silence Achakzai because he speaks the truth about democracy, exploitation of our resources, and the supremacy of the Constitution. Pakhtunkhwa’s streets will always echo with resistance,” he said.\n\nIn Kohat, former MPA and PkMAP senior vice president Mir Kalam said no amount of force or bombings could suppress a democratic movement.\n\n“Achakzai is our red line. Any attempt to target him is an attack on the entire Pakhtun nation’s rights,” he said.\n\nProtest rallies were also organised in Charsadda, Mardan and other cities of the province.\n\nPublished in Dawn, September 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:32:03.546Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940603/pkmap-protests-suicide-attack-on-quetta-public-meeting",
  "dateList": "2025-09-09",
  "date_published": "2025-09-09T01:10:02.000Z"
}
