{
  "title": "IHC dismisses petition seeking ex-PM Imran Khan’s name on ECL",
  "link": "https://www.app.com.pk/national/ihc-dismisses-petition-seeking-ex-pm-imran-khans-name-on-ecl/",
  "date_published": "2022-04-11T09:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 11 (APP): Islamabad High Court (IHC) on Monday dismissed a petition seeking orders for registration of high treason case against former prime minister Imran Khan and his former cabinet members, and placing their names on exit control list in ‘letter gate’ matter.\nThe court declared the petition as non-maintainable and imposed a fine worth Rs,100,000 against the petitioner citizen Molvi Iqbal Haider. Chief Justice Athar Minallah announced the verdict which was reserved earlier by the court after listening arguments from the petitioner.\nThe citizen had prayed the court to also place the names of ex-ministers including Chaudhry Fawad Hussain, Shah Mehmood Qureshi, Qasim Suri and Asad Majeed  on ECL after registering high treason case against them.\nAt the outset of hearing, the chief justice asked the petitioner that why he wanted to politicise the subject, adding that the state was as strong to view such matters.  The court in its decision said that the petitioner had leveled baseless allegations against an elected prime minister. It was the responsibility of every citizen for not politicising and create thrill in national security issues.\nDragging ambassadors and their classified reports into political disputes could weaken the national interests. The court also stopped the petitioner for comparing Imran Khan with ex-president Pervaiz Musharraf and said that Imran Khan was a democratic elected prime minister.\nThe petitioner had adopted the stance that if the government had received the letter on March 27, then it should have investigated it. The court said it was a cable instead of a letter. The petitioner further said that Imran Khan remained silent when the no confidence move was submitted against him.\nHe said it was necessary to interrogate the matter as it was related to foreign policy and relations with US.\nEarlier, the court reserved the judgment and later on dismissed the case while declaring it as non-maintainable.",
  "retrievedAt": "2025-08-11T14:41:25.268Z"
}
