{
  "title": "PM-elect announces in-camera parliament security committee session to ascertain veracity of letter",
  "link": "https://www.app.com.pk/national/pm-elect-announces-in-camera-parliament-security-committee-session-to-ascertain-veracity-of-letter/",
  "date_published": "2022-04-11T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 11 (APP): Prime Minister-Elect Mian Muhammad Shahbaz Sharif Monday announced that he would be soon arranging an in-camera session of the parliamentary security committee to ascertain the facts involved in the purported foreign letter regarding alleged foreign interference into country’s internal politics.\nShahbaz Sharif was delivering his maiden speech in the National Assembly after his election to the office of the prime minister.\nHe was elected as the 23rd Prime Minister of Pakistan after securing 174 votes in the 342-member lower House of the Parliament. Later, he will formally take oath of the office of the prime minister.\nShahbaz Sharif was a nominee of the joint opposition parties.\nEarlier, opposition nominee Makhdoom Shah Mahmood Qureshi opted to boycott the election process and announced that Pakistan Tehreek-i-Insaf members had decided to tender resignation from their seats.\nThe prime minister-elect in his speech said that a drama was staged in the country by the PTI and lies were churned over a purported foreign letter.\nHe expressed his wonder despite an announcement by the former speaker of the assembly, no one had brought the letter to him to see it.\nThe country of 220 million people and the members of the parliament wanted to know the reality involved in this drama, he said, stressing that the facts in the letter should be exposed before the nation and the world to end this debate.\nShahbaz Sharif said that as the prime minister, he would make arrangements to convene the in-camera security committee meeting in which a briefing would be given. Besides, other members, the top military and intelligence brass and Pakistan Ambassador would attend the meeting.\n“On behalf of this House, I assure the nation that if any involvement is proved, I will not stay as prime minister for even a second and go to home after tendering resignation,” he declared.\nShahbaz Sharif said that prior to the surfacing of the letter on March 7, the opposition parties, including PML-N, PPP and PDM had taken the decision over the vote of no confidence.",
  "retrievedAt": "2025-08-11T14:41:17.618Z"
}
