{
  "title": "NCOC directs provinces to ensure strict SOPs compliance on Eid-ul-Azha",
  "link": "https://www.app.com.pk/national/ncoc-directs-provinces-to-ensure-strict-sops-compliance-on-eid-ul-azha-encourage-public-adherence-to-safety-guidelines/",
  "date_published": "2020-07-18T05:55:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jul 18 (APP):The National Command and Operation Centre (NCOC) on Saturday directed the provinces to ensure strict compliance of Standard Operating Procedures (SOPs) on Eid-ul-Azha and during the holy month of Muharram along with encouraging public adherence to safety guidelines.\nThe NCOC special session was chaired by Federal Minister for Planning, Development and Special Initiatives Asad Umar here flanked by NCOC National Coordinator Lieutenant General Hamood Uz Zaman Khan and central team of the forum.\nChief Minister Sindh Syed Murad Ali Shah while hosting the NCOC exclusive session welcomed the NCOC central team and said that the role of NCOC in coping with the pandemic was significant. The sessions of NCOC in provincial capitals would enhance coordination and prove to be helpful for provincial management in fighting against the pandemic.\nHowever, at the outset of coronavirus outbreak, the provincial governments were facing issues related to hospitals’ facilities for COVID treatment which were collectively resolved by the federal and provincial governments.\nHe added that the health facilities were in a better position and the there was need to take preemptive measures to manage Eid-ul-Azha, Muharram and Rabi-ul-Awwal.\nSpeaking on the occasion, Asad Umar said the purpose of holding special sessions in provinces was to make consultations on core issues with provincial governments and acknowledge their efforts in fight against COVID.\nHe added that the wearing of masks and SOPs compliance along with a monitoring mechanism in place were crucial in cattle markets to contain coronavirus pandemic. “Decline in COVID patients’ deaths and cases does not mean to get complacent and avoid following safety protocols as it will further deteriorate the situation.”\nHe added that the doctors, paramedics, administration and law enforcement agencies of Sindh including all provinces had rendered meritorious services that deserve appreciation.\nFederal Minister for Interior Brig (R) Ejaz Ahmed Shah said all provinces were engaged in the process of devising SOPs and guidelines where as implementation was also being ensured. He added that the guidelines were shared with the provinces where punitive action was launched against illegal cattle markets.\nEjaz Ahmed Shah mentioned that a strong mechanism of control would also be made in place to ensure strict compliance of SOPs in cattle markets.\nHe added that the guidelines for holy month of Muharram were also underway and would be shared with the provinces.\nThe forum lauded the test and tracing mechanism of Sindh and also acknowledged that it had tremendously implemented the test, trace and quarantine (TTQ) Strategy.\nProvincial Ministers for Health, Education, Local government, Inspector General of Police Sindh, Provincial Chief Secretaries and others through video link participated in the meeting.",
  "retrievedAt": "2025-08-11T19:30:46.618Z"
}
