{
  "title": "From serenity to savour, outgoing UK diplomat carries along colorful memories of “amazing” Pakistan",
  "link": "https://www.app.com.pk/national/from-serenity-to-savour-outgoing-uk-diplomat-carries-along-colorful-memories-of-amazing-pakistan/",
  "date_published": "2020-07-18T01:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 18 (APP):Just a day before his departure to his homeland after completing two-year stint, British High Commission’s Counsellor Peter Abbott shared on Twitter an image of a room jammed with sealed cartons, carrying his belongings.\nBut more than this baggage, the diplomat would carry along the unlimited memories from what he said “amazing country” after spending two “extraordinary” and “eventful” years.\nIn a series of tweets, the outgoing diplomat shared some of his special memories starting from his memorable trips to cities, diverse landscape, the savour of delicious fruits, the cricket craze, cultural heritage, serenity of Margalla Hills and especially the globally famed truck art of the country.\n“So … we’re packed! Tomorrow we leave Pakistan after two extraordinary and eventful years. We will take with us many memories of our time in this amazing country,” Peter Abbott said who also served as Director Corporate Services at the high commission.\nWhile calling Lahore his and his family’s favorite city for being historically and culturally rich, the diplomat said “nowhere does cities like South Asia, and nowhere does South Asian cities like Pakistan.”\nRecalling their three-day visit to Chitral and Hindu Kush, Peter Abbott said he had not idea how diverse Pakistan’s landscapes were: green, lush forests, jagged, snow-capped mountains and hot, dusty deserts.\nHe said Pakistan had not only the best mangoes but also the best peaches, grapefruits, strawberries cherries and apricots. “We’ve made pies, jams, ice cream and chutney from them all,” he added.\nAbbott who was glad about the revival of cricket in Pakistan, was far more thrilled to see the energy and enthusiasm about cricket he had found during the only cricket match he went to played between Islamabad United and Peshawar Zalmay in March this year.\nThe outgoing diplomat also shared his “most ambitious and logistically challenging” memory of the work he had done along with the team during the historic visit of Britain’s Prince William and Catherine, Duchess of Cambridge to Pakistan in October last year.\nRecalling his brief visits to Islamabad, Taxila, Rohtas Fort, Nathia Gali and Katas Raj temples, Peter Abbott particularly mentioned the Margalla Hills.\n“In the heat of summer and the cool of autumn, our fondest memories will be of the hikes, picnics and swimming trips. The hills truly make Islamabad one of the greenest, most beautiful cities in the world. (And the kids loved the monkeys!),” he said.\nAbbott, who also tweeted multiple images of his memories throughout his stay here, found Pakistani people “some of the warmest, friendliest, most hospitable people you will ever meet.”\nHe could not forget to highlight Pakistan’s truck art what he said was “bright, beautiful and uniquely Pakistani art form.”\n“Thank you for taking us to your hearts. We’ll miss you… Goodbye Pakistan, we love you,” Abbott concluded.",
  "retrievedAt": "2025-08-11T19:30:53.599Z"
}
