{
  "title": "J. Salik arrives in Washington to launch worldwide interfaith campaign",
  "link": "https://www.app.com.pk/national/j-salik-arrives-in-washington-to-launch-worldwide-interfaith-campaign/",
  "date_published": "2023-01-29T09:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP):Former Federal Minister for Population Welfare and Convener World Minorities Alliance (WMA), Julius Salik has arrived in Washington D.C. to launch a worldwide interfaith campaign through the exhibition of portraits of international celebrities hailing from various faiths and segments of the society.\nThe former Federal Minister and veteran human rights defender through the platform of WMA has been organising different initiatives to promote peace, tolerance and coexistence among communities of different faiths and religions at the international level.\nHe had been elected as Councilor twice from Lahore, remained three times member of the Parliament on reserved Christian Seat with a countrywide constituency spanning over 33,000 polling stations. Salik was detained seven times during the Martial Law regime of General Zia ul Haq. He is the only Pakistani nominated for Noble Peace Prize for his services to promote and protect human rights.\nTalking to APP in a telephonic conversation from Washington D.C., J. Salik said the portraits made by his brother included that of the Head of the Catholic Church, Pope Francis, Archbishop of Canterbury, Justin Welby, first U.S. President Abraham Lincoln, Martin Luther king Jr, Imam-e-Kaba Abdul Rahman Ibn Abdul Aziz al-Sudais, and a special photograph of Princess of Wales Lady Diana that was captured during her visit to Riyadh.\nHe said Markus had attained mastery in fine arts by spending his time in the Libraries, exploring different artists and reading about their biographies, and viewing their work analytically was his daily routine.\n“Besides his artistic skills, his passion for photography was also remarkable as he used to take pictures in a unique manner which distinguished him from many traditional photographers.\nOn my suggestion, he presented a portrait of Queen Elizabeth of the United Kingdom. The Queen not only accepted the gift but appreciated him with a handwritten letter of appreciation in 1974,” he added.\nSalik said in 1976, Markus got an opportunity to work in the Kingdom of Saudi Arabia. He got an opportunity to present a portrait to the then Governor of Riyadh and now King of Saudi Arabia, Suleman Bin Abdul Aziz, who was so pleased to see his portrait by Salik and some of his photography that he asked him to work as an Official photographer in the office of Mayor of Riyadh.\n“Markus worked in that capacity for nine years, where he got the opportunity to work as a photographer in the close circles of the Royals, which was another landmark of his journey.\nOne of the highlights of his photographic career was to take pictures of Lady DIana and Princess of Bahrain during their visits to Riyadh.\nSalik had a lifetime opportunity to make a complete visual report by his photographs on the Governor’s vision of transformation of old Riyadh into a new look of the city.”\nHis photographs were exhibited by the Governor in many countries like France, Germany, Egypt and the United States of America, J. Salik said.\nThe list of the portraits to his credit is long but some of the portraits of renowned personalities of the world includes Lady Diana, Prince Charles, George W Bush, King of Jordan, Ameer of Kuwait, Ameer of Bahrain, KIng Abdullah of Saudi Arabia and many more, he said.\nCommenting on the exhibition, he said, “I am intending to hold a huge conference on Global Interfaith Harmony amid pressing times when violence against minorities is at an alarming level in the western civilized societies.”\nHe said throughout his 47-year-long career of activism and struggle for human rights he strongly defended the cause of equal rights for all without any discrimination.\nJ. Salik said there was an urgent need to make the world realise that activities like desacration of Holy Quran or other religious beliefs were injurious to local, regional and global peace.\n“The world is already at the brink of a major international conflict due to growing contestation among global powers whereas religious hatred and hate speech will further add fuel to fire,” he added.\nHe said the conference to be convened in Washington will call leaders of different faiths together at one platform to show solidarity with humanity not with a particular faith to demonstrate their full support for a peaceful and tolerant world for all.\nThe portraits, he said would help him bring attention of the leaders and the masses alike towards the efforts of the great personalities leading from Pope Francis to Abdul Rahman Al-Sudais and Martin Luther who all spoke the language of peace, mutual respect, tolerance, patience, respect and equality for all.\nJ. Salik said the portraits will be auctioned to raise charity for the humanitarian cause to help mankind in acute distress and facing problems due to inequalities.",
  "retrievedAt": "2025-08-11T05:51:25.091Z"
}
