{
  "title": "Expo 2020 Dubai records more than 2.3 million visits in first month",
  "link": "https://www.app.com.pk/national/expo-2020-dubai-records-more-than-2-3-million-visits-in-first-month/",
  "date_published": "2021-11-03T16:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP): Expo 2020 Dubai organisers have hailed the first month of the event as a “huge success”, announcing an impressive 2,350,868 visits from 1st to 31st October, with a host of memorable events, entertainment and seminars attracting people from the UAE, region and beyond.\nSo far, 28 percent of visits were made by persons under 18 years old, but this figure is expected to grow as the Expo School Programme expands during the cooler months ahead.\nTaking a global overview, an impressive 17 percent of the total visits came from overseas, which was notable considering the event takes place when many countries are still operating pandemic travel restrictions. Expo has counted 185 nationalities through its gates, WAM news agency reported .\nThe majority of visitors intend to visit multiple times, with more than half (53 percent) holding a Season Pass, more than a quarter (27 percent) entering with a Multi-Day Pass and 20 percent entering on a one-day ticket.\nIn keeping with Expo 2020’s sustainability aims, an impressive amount of people have travelled to and around the site using RTA transport methods. From a total of almost 3.6 million total journeys, more than 1.1 million trips were made to and from the site using the Dubai Metro.\nThe opening 31 days also saw the first two Thematic Weeks from Expo’s Programme for People and Planet, which is designed to inspire collective and meaningful action to address the world’s most critical challenges and opportunities.\nA truly international cast came together for Climate and Biodiversity Week, which took place ahead of the vital COP26 global environment summit, before Space Week blasted off into orbit to explore how the final frontier can help life on Earth.\nEight further Thematic Weeks will be held between now and the end of March, with Urban and Rural Development Week currently underway until 6th November.\nA total of 1938 government leaders, including ministers, presidents, prime ministers and heads of state, have graced the Expo site to open their country’s pavilions, speak at official events or celebrate their nation’s Expo National Day.\nAnd many of the 192 Country Pavilions – the first time in World Expo history that every participating nation has its own pavilion – have proved especially popular. The Saudi Arabia Pavilion, one of the largest on the Expo site, has attracted half a million visitors already.\nBringing Expo 2020 Dubai to a global digital audience, the number of virtual visitors has amounted to 12.8 million since 1st October.\nExpo 2020 Dubai runs until 31st March 2022, inviting the world to join a celebration of unity, opportunity, creativity and sustainability that will help to shape a better, brighter future for everyone.",
  "retrievedAt": "2025-08-11T21:32:47.492Z"
}
