{
  "title": "PM announces Rs120b food subsidy package for 130m people",
  "link": "https://www.app.com.pk/national/pm-announces-rs120b-food-subsidy-package-for-130m-people/",
  "date_published": "2021-11-03T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP): Prime Minister Imran Khan Wednesday announced “country’s biggest ever” subsidy package worth Rs 120 billion providing 30% discount on ghee, flour and pulses to support 130 million people by ebbing away the impact of inflation.\nThe prime minister, in his televised address to the nation, said 20 million families would benefit from the subsidy package to be funded jointly by the federal and provincial governments.\nUnder the package, the beneficiaries would avail a 30% discount on the said three food commodities for next six months.\nHe said the subsidy package was apart from the ongoing different programs under Ehsaas Initiative worth Rs 260 billion affecting 120 million families.\nThe prime minister particularly thanked the Ehsaas team for compiling the national database of households to enable the government provide direct subsidy to the entitled families.\n“Today, we have a data and now I am in the position to announce… country’s biggest ever welfare program,” he remarked.\nThe prime minister also announced Rs 1400 billion for Kamyab Pakistan Program aimed at providing interest free business loans to the entitled four million families.\nThe package consists of interest free loans for house construction, Rs 0.5 million each loan for farmers and businesses besides skill training to a member of the entitled family.\nHe said under Kamyab Jawan Program had so far given Rs 30 billion loan to 22,000 businesses. The program also featured a program to provide six million scholarship and stipends to the students.\nCalling it his dream project, the prime minister the Health Insurance Card has been extended to whole of KP province and would be replicated in Punjab, AJK, GB and federal capital by March next year.\nThe prime minister also asked the Sindh government to launch the program to provide Rs 1 million health insurance cover to every family.\nImran Khan said the government had inherited a Pakistan with the biggest ever fiscal deficit, foreign debt burden, heaviest mark up, reserves touching the lowest mark, and the kitty with no money to pay back debts.\nHe thanked Saudi Arabia, UAE and China which supported the country in difficult time to save the country from default.\nHe said it took almost a year to stabilize the economy which unfortunately followed the outbreak of COVID pandemic – the biggest ever crisis the world faced during last century.\nThe prime minister felt proud for his team in the NCOC comprising top doctors, cabinet members and Pakistan Army which took bold decisions based on the data and made the country steered through the crisis effectively.\n“One one side it was the fear of overcrowding of hospitals like India while the other fear was that the lockdown would destroy the economy. Pakistan opted for the middle course which also involved risks,” he said.\nThe prime minister recalled that he was pressured to impose India-like blanket lockdown but he said Pakistan was among few countries which successfully sailed through the situation which was also acknowledged by the World Bank, World Health Organization, World Economic Forum as well as the international media including The Economist magazine.\nGiving an overview of the COVID impact on world economy, the prime minister the United States spent $4,000 billion to support its economy while Pakistan could only scrape $8 billion to avert the burden of unemployment and support the industry, construction and agriculture.\nThe prime minister said owing to the government’s prudent policies, the country witnessed a 13.8% growth in rice production, pulses 8%, sugarcane 22%, wheat 8% and cotton 81% growth.\nMoreover, an additional Rs1100 billion went to the farmers  which was manifested by the record sale of motorbikes, tractors and urea.\nHe said following the incentives announced by the government, the construction projects worth Rs 600 billion were going on in the country and large scale manufacturing achieved record growth. Moreover, the profit of engineering sector increased by 350%, textile sector 160%, automobiles 138%, cement 113% and oil and gas 75%.\nBesides, the country’s tax collection also grew by 37% as the government had already surpassed the set target.\n“Our (economic) indicators are on right course. IT achieved 47% growth last year and this year it will touch 75%. This is good news for youth,” he remarked.\nThe prime minister said no doubt the inflation was an issue but instead of merely criticizing like opposition, the media should also teach the people about the worldwide inflation.\nQuoting the Bloomberg Commodity Price Index, the prime minister said commodities’ prices grew by 50% in a year against just 9% in Pakistan.\nHe said Turkey, US , China and Germany had been facing highest inflation. The gas prices surged by 116% in US, 300% in Europe but Pakistan had made no increase except for the one being imported.\nHe said oil prices in the global market had increased by 100%  but Pakistan shifted only 33% of the burden. Even in India oil prices surged to Rs 250, Bangladesh 200 while it was yet at Rs138 in Pakistan.\nThe government avoided to shift burden from the masses which otherwise could bring in additional Rs 450 billion revenue to the government.\nHowever, the prime minister said the government would have to increase the oil prices which otherwise would lead to swelling the deficit.\nGiving a comparison of food commodities in the region, the prime minister said flour rate was Rs83per kg in India while Pakistan had half of the world’s average price. Moreover, Daal Moong was being sold at Rs338 in India against Rs 162 in Pakistan.\nDespite that, the government decided to launch the subsidy program in order to avert the burden of inflation from the people, he remarked.\nThe prime minister particularly appealed the industrialists and businessmen to take special care of labour class and give them a pay raise considering the inflation.\nCommenting on the opposition’s criticism against the government, the prime minister committed to bring down prices of food commodities to half if the two opposition leaders’ families brought back even half of the money to the country they had looted over last three decades.\nAccording to the details of the subsidy package provided by the PM Office, the federal cabinet had approved the program on Tuesday which would affect 53% of the country’s population.\nUnder the package, a subsidy of Rs. 1,000 a month would be given to each of the 20 million families with a poverty score of less than 39 and an income of Rs. 31,500 per month.\nEhsaas has developed a digitally enabled mobile point of sale system in collaboration with National Bank of Pakistan (NBP) to serve beneficiaries through a network of Kiryana stores designated by NBP, all over the country.\nThis system will digitize parts of the retail sector; there will be use of real time data for decision making. This process will help make beneficiaries and storeowners more digitally adept.\nThe participating Kiryana store owners will be required to open bank accounts which will help further increase financial inclusion and settlement payments made through RAAST will help increase scale of digital transactions in Pakistan.\nFor online registration of beneficiaries, Ehsaas will open a registration portal next week.\nIn interest of transparency, the registered Kiryana stores and beneficiaries will undergo a rigorous verification process to minimize the incidence of fraud.\nThe federal government and all participating federating units will share fiscal resources in the ratio of 35/65.\nThe governments of Punjab, Khyber Pakhtunkhwa, Gilgit Baltistan and AJK have already agreed to participate in the programme.\nIn other federating units, federal share of subsidy worth Rs. 350 per month will be given for each eligible household.",
  "retrievedAt": "2025-08-11T21:32:52.704Z"
}
