{
  "title": "Economy back on track due to government’s initiatives: Tarar",
  "link": "https://www.app.com.pk/national/economy-back-on-track-due-to-governments-initiatives-tarar/",
  "date_published": "2024-12-17T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): Federal Minister for Information, Broadcasting, National Heritage, and Culture Attaullah Tarar, highlighting the government’s economic achievements on Tuesday, said that inflation had dropped to 4%, foreign reserves had risen to $12 billion, and remittances reached $8.8 billion in the first quarter of the fiscal year.\nSpeaking on the floor of the National Assembly, he said, “Our focus is on the economy and it is back on track due to steps taken by the government”.\nHe said that his party always promoted mutual political respect and added that the leadership of PML-N had never encouraged its workers to promote politics of hate.\nTarar said that in the past, PPP and PML-N were political opponents but both parties never engaged in political animosity.\nWhile recalling the 2013 elections when the PTI founder fell off a container, he said PML-N halted the election campaign, and senior leadership Muhammad Nawaz Sharif, Muhammad Shehbaz Sharif and Rana Sanullah along with other leaders visited Shaukat Khanum Hospital to inquire about his health. “This was our goodwill gesture,” he added.\nTarar regretted that this goodwill gesture was considered a weakness. He said that his party do not believe in politics of violence.\nThe minister said soon after winning the elections, the then prime minister Muhammad Nawaz Sharif visited the residence of PTI founder.\nHe underscored that PML-N’s politics focused on constructive engagement, unlike PTI’s confrontational approach.\nHe said that PTI failed to reciprocate such gestures, accusing them of exploiting propaganda and deceit, particularly during failed protests.\nThe minister said that after PTI’s failed protests in Islamabad, its leadership resorted to lies and propaganda.\nThe minister appreciated PTI leader Ali Muhammad Khan and Sher Afzal Marwat’s positive remarks about tolerance and dialogue, stating that Parliament was a symbol of democratic values, mutual respect, and patience. “We have never compromised on civility and tolerance and do not believe in violent politics,” he added.\nTarar said, that PTI leaders had encouraged their followers to attack their opponents, labelling them with derogatory terms like “thieves” and “traitors.” Despite this, Nawaz Sharif instructed party members to respond with civility and refrain from\nHe recalled that during the D-Chowk sit-in, the PTI leadership used abusive language against the PML-N leadership.\nHe said, “We learnt from the past and signed the Charter of Democracy and buried the politics of the past.\nHe said that during PTI’s tenure, opposition leadership were targeted with false accusations and fake cases. He said that their families, including women, were harassed, such as Maryam Nawaz’s arrest in front of her father and FIRs filed against the families of political rivals like Jahangir Tareen and Aleem Khan.\nThe minister said PTI narratives were inconsistent, with conflicting figures on incidents like protest-related deaths. He criticized the use of fake visuals, such as AI-generated images, to mislead the public.\nHighlighting the PML-N’s commitment to democratic principles, Tarar underscored their sacrifices during the Lawyers’ Movement and their peaceful political struggle. He urged the PTI to abandon its politics of revenge and join hands to address the country’s economic challenges.\n“We are all Pakistanis,” he said, calling for unity and cooperation. “It’s not too late to focus on the country’s betterment and contribute to its progress. If you cling to false narratives and vengeance, the nation cannot move forward.”\nThe minister stated that Pakistan was created with the sacrifices and efforts of our forefathers and emphasized, “We are here to stay.”\nHe highlighted that the common man’s primary concerns are poverty and inflation, and said, “Resolving these issues is our responsibility.”\nThe minister lauded Nawaz Sharif’s long-term vision in politics, recalling how he led train marches and held massive rallies without resorting to offensive language. Nawaz Sharif addressed even political adversaries like the PTI founder with respect. “Nawaz Sharif always called PTI founder Khan Sahib”.\nHe alleged that PTI had changed the whole political tradition.\nCondemning PTI’s approach, the minister accused them of prioritizing personal gains and fostering prejudice. Referring to a tragic incident at PTI’s Multan rally where 8–10 workers lost their lives, he questioned why the PTI leadership failed to visit the bereaved families for condolences. He said that no PTI leader including the PTI founder visited the bereaved families for condolence.\nHe said that workers of Tehreek-e-Labbaik were killed during PTI tenure and no one visited for condolence.\nThe minister also criticized the opposition for frequently mentioning casualties without providing accurate figures.\nHe said that the PTI leaders were offering conflicting numbers, which only served to spread false narratives. “They do not have the correct number of casualties; they are only spreading lies,\nHe further accused them of fabricating narratives, including using artificial intelligence to depict Islamabad’s streets covered in blood.\n“Why do their statistics vary if their narrative is truthful?” he asked, pointing out the inconsistency within PTI’s statements.\nHe criticized PTI for introducing political victimization of women and fabricating cases against leaders like Rana Sanaullah.\nReflecting on the PTI tenure, he accused the party of jailing opposition members and leaving opposition benches empty in Parliament.\nHe said that NAB was used against opposition members. He said that Prime Minister Shehbaz Sharif had never asked for the victimization of opponents.\nHe stated that he would ask non-political individuals within the PTI, including Shahzad Akbar and Shahbaz Gill, who provided misguided advice.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:51:44.680Z"
}
