{
  "title": "PM resolves to safeguard welfare of overseas Pakistanis",
  "link": "https://www.app.com.pk/national/pm-resolves-to-safeguard-welfare-of-overseas-pakistanis/",
  "date_published": "2024-12-17T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): Prime Minister Muhammad Shehbaz Sharif has said the government was fully committed to empowering, facilitating, and safeguarding the welfare of overseas Pakistanis.\n“We have passed the Special Court (Overseas Pakistanis Property) Act, 2024, ensuring timely justice and safeguarding the rights of overseas Pakistanis,” the prime minister said in his message on International Migrants Day.\nToday, Pakistan joins the  global community in celebrating —a day to honor the invaluable contributions of migrants and reaffirm our unwavering commitment to protect their rights, dignity, and well-being, he added.\nFor decades, he said Pakistan had been a welcoming host to migrants while also proudly witnessing its vast diaspora flourishing around the world. Be it for education, employment, business, or tourism, overseas Pakistanis have made their mark as ambassadors of our country.\nPM Shehbaz noted that migrants not only bring prosperity to their host nations but also remained a lifeline for their home countries.\nThe remittances sent back by our diaspora significantly contributes to Pakistan’s economic stability. In the first two months of FY25 alone, remittances worth $5.94 billion were received, reflecting their continued dedication and love for the homeland, he added.\nRecognizing their valuable contributions, he said the government had introduced the Mohsin-e-Pak Awards, a prestigious national honor to celebrate the services of our diaspora, both for Pakistan and their host communities.\nHowever, as we celebrate the strength, resilience, and achievements of migrants, we must also acknowledge the challenges they face which includes distance, exploitation, and discrimination. It is our shared responsibility to ensure their safety, dignity, and inclusion, no matter where they are, he remarked.\n“On this International Migrants Day, we reaffirm our pledge to advocate for migrants’ lawful rights, eliminate exploitation, and create an environment where migration becomes a symbol of opportunity and progress to pursue a brighter future,” the prime minister added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:51:16.806Z"
}
