{
  "title": "NAVTTC board approves new programs with guaranteed global employment",
  "link": "https://www.app.com.pk/national/navttc-board-approves-new-programs-with-guaranteed-global-employment/",
  "date_published": "2024-12-17T17:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): The National Vocational and Technical Training Commission (NAVTTC) here on Tuesday held its 29th Board of Management meeting to approve key policy initiatives aimed at enhancing manpower exports and addressing domestic labour market needs.\nThe meeting was presided over by Chairperson NAVTTC Gulmina Bilal Ahmad. Executive Director NAVTTC M Aamir Jan welcomed the newly inducted board members—Engr. Lt. Gen (R) Moazzam Ejaz, Asim Shahiryar Husain, and Engr.\nFaheem Iqbal Ch—and provided an update on NAVTTC’s ongoing programs and initiatives, said a press release. Mohyuddin Ahmad Wani, Federal Secretary, was also present at the meeting, further underscoring the importance of these initiatives for national development and global workforce participation.\nThe Board unanimously approved the following key training projects to maximize Pakistan’s participation in global labor markets such as training 50,000 youth for Sector-Specific Skills to address global needs, under the flagship initiative 50,000 youth will be trained in high-demand sectors to meet labor shortages worldwide and enhance economic growth.\nPriority sectors include Information Technology, Mining and Minerals, Agriculture and Livestock, Driving (LTV, HTV, HMO), Aesthetics, Healthcare, and Services, Construction, Electrical, and Energy, & Hospitality and Tourism.\nIn collaboration with Overseas Employment Promoters (OEPs), NAVTTC will train and export 10,000 skilled workers with guaranteed job placements in international markets, including GCC countries, Japan, and Europe. The program focuses on high-demand sectors such as health-care, construction, Agri-Tech, and manufacturing, ensuring Pakistan’s workforce actively contributes to the global labor market while increasing foreign remittances.\nNAVTTC has approved the targeted initiative to provide 500 youth from the Newly Merged Districts (NMDs) of Khyber Pakhtunkhwa with market-driven, industry-relevant skills. The program aims to uplift marginalized regions by improving employability and aligning training with both local and international labor demands. Developed in collaboration with international agencies like TAKAMOL, this initiative empowers under-served communities with opportunities for economic advancement.\nIn partnership with the Pakistan Nursing and Midwifery Council and the National Excellence Institute of Nursing, NAVTTC will train 500 nurses for the National Council Licensure Examination (NCLEX), enabling them to secure jobs internationally, particularly in the United States.\nThe NAVTTC approved a partnership with global platforms like Coursera to train 1,500 individuals in advanced technology fields. Blended learning programs through digital labs will equip participants with internationally recognized certifications improving their acceptance and employability in global markets.\nTo standardize the quality of workforce training, NAVTTC introduced a licensing regime for CBT&A assessors. The structured framework includes selection, training, and grading of assessors into three categories to ensure quality assurance in TVET programs.\nThe Board approved uniform SOPs for all TVET institutes nationwide, ensuring quality, consistency, and adherence to global standards in vocational education and training.The meeting reiterated the strategic focus on exporting skilled manpower to meet international market demands, highlighting the role of NAVTTC’s initiatives in strengthening Pakistan’s position as a provider of globally competitive labour.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:51:20.089Z"
}
