{
  "title": "PM directs ministries to address medicines shortage in Parachinar, establish contact with KPK govt",
  "link": "https://www.app.com.pk/national/pm-directs-ministries-to-address-medicines-shortage-in-parachinar-establish-contact-with-kpk-govt/",
  "date_published": "2024-12-17T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday directed the Ministry of Health and the Ministry of Interior to take immediate steps to address the shortage of medicines in Parachinar and to establish contact with Khyber Pakhtunkhwa government in this regard.\nThe prime minister chaired a meeting of the federal cabinet at the PM House during which several important decisions were made, PM Office Media Wing said in a press release.\nThe federal cabinet approved the Criminal Procedure (Code of Criminal Procedure) Amendment Bill 2024 on the recommendation of the Ministry of Law and Justice.\nThis amendment aims to simplify the process of registering FIRs, allow the use of modern technology in investigations, forensic technique and to enable the audio-video recording of witness statements.\nFurthermore, the amendment bill included provisions to strengthen the role of the prosecutor during investigations. The prosecutor will be able to point out any deficiencies or flaws in the police report.\nUnder these amendments, women, individuals under 12 years old, men over 70 years old, and persons with physical or mental disabilities will be able to record their statements at a place of their convenience.\nThe amendments also stipulated that the trial court would deliver its verdict within one year, and in case of delay, the relevant High Court would be held accountable. Additionally, the appellate court will be required to make a decision on any appeal within six months to one year.\nFurthermore, in cases where the police investigation finds the accused innocent and prepares a discharge report, the accused would be entitled to bail.\nThe cabinet was briefed by the Ministry of Information Technology, which reported that e-office had been fully implemented in 18 federal government divisions.\nThe meeting was informed that e-office has been fully implemented in 18 federal government divisions. It was further stated that this was the first time that such a large-scale implementation of e-office had been carried out in the federal government, marking a significant step towards a paperless economy.\nThe meeting was also informed that if e-office was fully implemented, there was a potential saving of up to 230 million rupees in stationery and fuel costs.\nThe prime minister praised Minister of State for Information Technology and Telecommunication Shaza Fatima and the officials of the Ministry of Information Technology and Telecommunication for their efforts.\nHe also commended the performance of the ministers and secretaries of those divisions where e-office has been fully implemented.\nThe federal cabinet also made several important decisions which included the approval to the National Registration and Biometrics Policy Framework 2024 on the recommendation of the Ministry of Interior.\nOn the recommendation of the Ministry of Law and Justice, the cabinet approved the establishment of the Intellectual Property Tribunal in Quetta.\nThe federal cabinet approved signing the United Nations Convention on International Settlement Agreements resulting from arbitration, based on the recommendation of the Ministry of Law and Justice, regarding December 20, 2018.\nIt also rejected the appeal of Arbab Ans manager HR of Karachi Port Trust against his dismissal.\nOn the recommendation of the Ministry of Petroleum, the cabinet approved amendments to Form EL-01 under the Explosives Rules 2010, regarding licenses for the preparation of high-density explosive materials.\nThe federal cabinet approved the transfer of the Upper Kohistan, Lower Kohistan, and Kolai Pallas Kohistan districts from Peshawar Electric Supply Company (PESCO) to Hazara Electric Power Company (HEPCO) on the recommendation of the Ministry of Energy, Power Division.\nOn the recommendation of the Ministry of Religious Affairs and Interfaith Harmony, the cabinet approved the inclusion of section related to oath of Finality of Prophethood in marriage certificates within the Islamabad Capital Territory.\nThe cabinet was presented with reports on the implementation of Principles of Policy for federal affairs for the years 2021-22 and 2022-23 by the Cabinet Secretariat.\nThe cabinet also received reports from the Cabinet Division regarding the National Electric Power Regulatory Authority (NEPRA) for the past three years. These reports will now be sent to the Council of Common Interests.\nThe federal cabinet confirmed the decisions made during the meeting of the Cabinet Committee on State Owned Enterprises held on December 4, 2024, and the meetings of the Cabinet Committee on Inter-Government Transactions held on November 20 and 21, 2024.",
  "retrievedAt": "2025-08-10T13:50:58.508Z"
}
