{
  "title": "ISSI, CSCCC host ‘Post-COP29 Dialogue’",
  "link": "https://www.app.com.pk/national/issi-csccc-host-post-cop29-dialogue/",
  "date_published": "2024-12-17T17:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): The Institute of Strategic Studies Islamabad (ISSI) along with the Civil Society Coalition for Climate Change (CSCCC) and Embassy of France on Tuesday organized a Dialogue titled “Post-COP29 Dialogue: Analysis of Outcome and Strategy on Way Forward.”\nThe keynote speakers for the event included Senator Sherry Rehman, Chair of the Senate Standing Committee on Climate Change & Environmental Coordination, and Justice Mansoor Ali Shah of the Supreme Court of Pakistan, said a press release.\nOther speakers in the opening sessions were Ms. Aisha, Moriani, Acting Secretary, MoCC & EC, and  Zakaria Haffar, Cooperation and Culture Attaché, Embassy of France in Pakistan.  The thematic session featured prominent experts such as Syed Haider Shah, Additional Secretary (UN & OIC); Dr. Abid Suleri, Executive Director of the Sustainable Development Policy Institute (SDPI); Mr. Arif Goheer, Executive Director of the Global Climate-Change Impact Studies Centre (GCISC); Mr. Olivier Mahu, Global Practice Manager for Climate Finance Mobilization at the World Bank; and Dr. Pema Gyamisho Director General ICIMOD.\nAt the subnational level, the speakers included  Nadeem Ur Rehman, Secretary Climate Change & Environment, Balochistan;  Mahmood Ghaznavi, Chief Conservator of Forests, Gilgit-Baltistan; Riaz Ahmed Wagan, Chief Conservator of Forests, Sindh Forest Department; Muhammad Shafique Abbasi, Director (HQ) AJK-EPA; and Muhammad Ibrahim, Deputy Project Director for the 10 Billion Tree Tsunami Project at the KP Climate Change Forestry, Environment & Wildlife Department. Additional contributions came from the Deputy Director of the Environmental Protection Agency (EPA), Punjab, and Ms. Pakiza Bukhari, Deputy Director (MEAs), Punjab.\nAmbassador Sohail Mahmood, in his welcome remarks, described COP29 in Baku as a testament to the global community’s resolve to tackle the escalating climate crisis, emphasizing its importance for frontline nations like Pakistan, ranked among the top ten most climate-vulnerable countries.\nHe highlighted the operationalization of the Loss and Damage Fund and the progress on Article 6 of the Paris Agreement as significant achievements. Stressing the centrality of climate finance, he pointed to the Baku Finance Goal’s $1.3 trillion target for developing countries by 2035, including a $300 billion annual commitment, while underscoring the need to address financing gaps, equitable disbursement, and private sector involvement.\nOn energy, he welcomed the call to triple renewable energy capacity and double energy efficiency by 2030 but noted the lack of timelines for phasing out fossil fuel subsidies. Ambassador Mahmood emphasized Pakistan’s alignment of domestic policies with international commitments, citing the unveiling of Pakistan’s National Climate Finance Strategy (NCFS) as a key milestone.\nThe NCFS identifies a $348 billion climate finance gap and proposes solutions such as green bonds and public-private partnerships to mobilize resources. He reaffirmed the importance of regional cooperation, particularly in water management and disaster preparedness, and underscored the private sector’s role in scaling up investments in renewable energy and green technologies.\nZakaria Haffar emphasized that climate action remains a top priority in France’s international cooperation agenda. He noted that since the Paris Agreement, France has maintained its commitment to the cause and contributed 7.2 billion Euros as of 2023.\nHe underscored France’s steadfast efforts in advancing the agenda for gender equality and human rights within climate diplomacy and negotiations, both with the European Union and international partners. Furthermore, France has reiterated its support for an exit strategy from fossil fuels and remains a signatory to the EU-led initiative against the use of coal.\nAisha Moriani highlighted that COP serves as a crucial platform for Pakistan to engage with development and international partners on climate change issues while highlighting its policies and ongoing projects. However, she noted that significant uncertainties persist regarding transparency in climate finance.\nAddressing the importance of public-private partnerships, she emphasized the need to mobilize funds through the private sector and blended financing. At the same time, she underscored the critical role of public finance, particularly in the form of grants, for supporting adaptation efforts and assisting those most affected. Looking ahead to COP 30, Ms. Moriani stressed the importance of the findings from the Intergovernmental Panel on Climate Change (IPCC) report, which will be instrumental in charting a course correction trajectory for climate action.\nIn her keynote remarks, Senator Sherry Rehman emphasized that while collaboration with international bodies is essential, it is equally critical for Pakistan to build its capacity to address climate challenges at the national level. She underscored the need to revitalize the climate sector and take a proactive approach to achieving national climate goals through effective stocktaking.\nAt the international level, Senator Rehman highlighted the importance of transitioning from reports to tangible action, recognizing where the world currently stands in its climate commitments. She further stressed that Pakistan must continue to voice its concerns and priorities at multilateral platforms such as the United Nations, as it successfully did for the Loss and Damage Fund, and take a leadership role in representing the Global South. She also stressed that global north-south financial transfers must accelerate, underlining the need for focusing on ‘Internationally Determined Contributions’ as well.\nIn his keynote address, Justice Mansoor Ali Shah discussed the judiciary’s perspective on climate justice, particularly about climate finance following COP29 in Baku. He highlighted that Pakistan’s constitution has been a pioneer in promoting environmental and climate justice within the country.\nWhile environmental justice tends to be more focused on domestic issues, climate justice is multi-sectoral, extending beyond national borders to address critical concerns such as health security, food security, human trafficking, and displacement.\nJustice Shah emphasized that climate justice is inherently more complex, with challenges rooted in the broader and more severe impacts of climate change. He stressed that this shift has introduced significant changes in jurisprudence, requiring a more sophisticated, multi-dimensional approach to address its wide-ranging effects across various sectors.\nIn the first thematic discussion, Syed Haider Shah highlighted the differing perceptions of climate vulnerability between developed and developing countries, often leading to national interests outweighing global objectives, and emphasized focusing on domestic strategies while using COP as a platform for negotiating frameworks. Mr. Olivier Mahu noted a $3 trillion annual gap in climate finance, with less than 20% reaching developing countries and private finance primarily targeting mitigation, stressing the role of organizations like the World Bank and Article 6 in mobilizing funds.\nDr. Abid Suleri pointed to the shift in climate discussions from scientific debates to finance, urging countries to factor in global inflation and highlighting the role of geopolitics, particularly in light of U.S. elections, while suggesting Pakistan could fill potential leadership gaps.\nMr. Arif Goheer emphasized Pakistan’s inclusive NDCs aligned with national climate policy, supported by committees focusing on adaptation, mitigation, and cross-sectoral efforts, displaying progress in solar energy, nature-based solutions, and projects like Recharge Pakistan.\nDr. Pema Gyamisho underscored the critical importance of the Hindukush and Himalayan cryosphere for 2 billion people’s food, water, and energy security, calling for strengthened efforts to address the ongoing climate crisis.\nIn the second session on subnational discussion, Mr. Rehman stressed that for countries like Pakistan and areas like Balochistan, the challenge remains with adaptation while mitigation is important the major challenge remains adaptation and survival. Mr. Ghaznavi touched upon the increase in glacier melt in the northern regions of Pakistan which is harming the ecosystem of the region impacting not just human lives but the ecology.\nMr. Wagan touched upon the support and interventions required by the federal government in the field of forestry and biodiversity.\nMr. Abbasi in his remarks stated that COP 29 did not meet the expectations of many falling short of its commitment. Mr. Ibrahim touched upon the KPK government’s stance on the NDCs and greenhouse emissions at the provincial level, target allocation by the NDCs to the provinces on the greenhouse emissions at the level that is proportionate to the targets, and the basing of NDCs on real-time GDP.\nMr. Noman in his remarks highlighted smog as the top major issue Punjab is facing while Lahore has been declared one of the most polluted cities for the past 3 years, hence, the majority of the policies and interventions in Punjab are focused on the improvement of air quality.\nIn her concluding keynote address, Ms. Romina Khurshid Alam emphasized the challenges faced by developing countries like Pakistan in advocating for their causes in international forums dominated by developed nations. She noted that Pakistan has remained resolute in its approach and trajectory at COP29, garnering significant recognition and praise for its efforts.\nMs. Alam highlighted the establishment of a consortium at the Climate Vulnerable Forum (CVF) during COP 29, where vulnerable nations would unite to create a collective risk pool and develop strategies for managing climate finance.\nPakistan played a key role in negotiations at COP 29, particularly regarding loans and grants for early warning systems to mitigate the impacts of natural disasters, in collaboration with like-minded countries. Ms. Alam pointed out that, in terms of mitigation, loans alone are not sufficient. There must be a focus on building capacity, providing adequate support, and addressing procedural delays to ensure effective action.\nShe further stressed that developed countries must be held more accountable for their contributions to climate-related disasters, as they are major contributors to the crisis. Rather than following the dictates of developed nations, Ms. Alam argued, developing countries should take the lead in guiding the developed world on how to support them, raising their voices collectively to demand meaningful assistance.\nShe also raised concerns about the actions of developed countries in fulfilling the pledges made during previous COPs, questioning whether they have followed through on commitments to support developing nations.\nFinally, Ms. Alam underscored the importance of exploring regional solutions to climate-related challenges, emphasizing the need for collaborative efforts that are tailored to the specific needs of different regions.\nThe Dialogue concluded with the presentation of ISSI’s memento to the esteemed keynote speaker by Chairman BoG ISSI Ambassador Khalid Mahmood.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:51:21.967Z"
}
