{
  "title": "Political dialogue mandatory for parliamentary democracy: Sanaullah",
  "link": "https://www.app.com.pk/national/political-dialogue-mandatory-for-parliamentary-democracy-sanaullah/",
  "date_published": "2024-12-17T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP):Adviser to Prime Minister on Inter-Provincial Coordination Rana Sanaullah Khan on Tuesday said that political dialogue is mandatory for parliamentary democracy.\nSpeaking in the National Assembly, he said, “This is a reality that in the parliamentary democratic system; until the opposition leader and leader of the house don’t sit and have dialogue, this system cannot work.”\nSanaulllah recalled that when Prime Minister Shehbaz Sharif was in the house a few weeks ago, he exchanged pleasantries with the opposition and extended an invitation for talks. He, however, lamented the response and tone used by the Opposition Leader Omar Ayub Khan.\n“Now, if [PTI leader] Sher Afzal Marwat is claiming we didn’t have any conversations, then maybe conversation didn’t happen from that side either,” he said.\nThe political adviser also recalled that before PTI’s Nov 24 power show, the party was offered Sangjani as a venue instead of the planned D-Chowk protest, “but that call was not heeded.” He regretted the loss of lives on both sides, referring to those in uniform and those without.\nSanaullah emphasised that despite cases being made against PML-N members and its leaders being sent to jail, the call for dialogue was extended. “If there is no dialogue between political parties and forces, the matter will not move forward.”\n“I request Marwat sahib that if you have made this committee for talks with us — which you have not said a word about till this day —then officially come and say you have formed this committee for dialogue with the government or PML-N or allied parties,” he said.\nSanaullah noted that the statement put forward by Afzal Marwat indicated that a committee has been formed for talks, and whoever wants to hold conversations can proceed to do it.\nHe went on to emphasise that the office of the House’s speaker was a “neutral venue”. “It is as much ours as it is yours, and current speaker Sardar Ayaz Sadiq has always maintained his neutrality,” he said.\n“Marwat sahib, if you find it suitable, I request that your committee at least sends an official message to the government that there is a committee [for talks].  “Don’t be constrained to TV talk shows and press releases, go and tell them there is this committee and we are serious and want political dialogue,” Sanaullah said.\nHe was optimistic that if this suggestion was implemented, it would yield results.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:51:26.366Z"
}
