{
  "title": "Bonded Warehouse Policy introduced to end dry outs in petroleum sector: Dr. Musadik",
  "link": "https://www.app.com.pk/national/bonded-warehouse-policy-introduced-to-end-dry-outs-in-petroleum-sector-dr-musadik/",
  "date_published": "2023-06-28T14:08:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 28 (APP): Minister of State for Petroleum Dr. Musadik Malik said on Wednesday that government had introduced a new policy of ‘bonded warehouse’ to do away with dry outs problem in the petroleum sector.\nUnder this policy, he explained, the foreign companies doing legal business of oil from around the world could construct bonded warehouse for oil storage in various major cities and it would not only bring in foreign exchange reserves to Pakistan but also ensure all the time availability of petrol and diesel in the country.\nIt would also break the monopoly of a few oil marketing companies, which used to create artificial shortage of oil in the country on various pretext, and also discourage illegal hoarding of oil to gain more profits, he added.Addressing a press conference here, he said the government was taking appropriate and comprehensive measures to maintain or gradually lower the prices of energy including petroleum, gas and electricity.\nDr. Musadik added that foreign companies which stored petroleum and diesel in the bonded warehouse, would definitely get themselves registered here in Pakistan and would have to open their business accounts in the local commercial banks. Consequently, it would resolve the issue of LCs (Letters of Credit) confirmation as these companies would make business transactions in dollar or in Pak rupee directly through banks and in a way, it would also release the pressure on country’s foreign reserves exchange and create a little bit space for the government in making various payments, he said. He added that this initiative would also do away with LCs charges, which so far were being passed on to the end consumer.\nHe asserted that it would be a great relief and facilitation for the small filling stations which faced even more problems during shortage of oil, and now they would be able to continue their business after buying oil from the bonded warehouses.\nDr. Musadik said, “On behalf of Prime Minister, I am giving this good news to people as this is Eid festivity so we should set aside the political talks for a while. Today, I will not speak about whatever the PTI is doing or had been doing to bring the country on the verge of collapse. It’s Eid gala, so it is responsibility of the government to give hope to the people.”\nThe Minister of State for Petroleum said that all the criticism by the PTI regarding Russian oil agreement and its shipment was now died down as second oil shipment from Russia also reached Pakistan. He mentioned that coalition government recently made a deal with Azerbaijan on its own terms and conditions for inexpensive gas, citing that under this deal, Azerbaijan would offer a gas tanker every month and it would up to Pakistan whether to purchase or not.\n“We will purchase this gas if it is in our favour price. This deal will also help end gas shortage in the country during winter season. We have arranged inexpensive oil and gas and also put in place an effective and viable solution to cope with dry outs problem in petroleum sector,” he remarked.\nIn addition, he said that as per commitment of the government for promotion of renewable energy, the Prime Minister had also launched four solar energy projects with an accumulative capacity of 10000 mega watt. The Prime Minister also issued directives for working out a comprehensive plan to divert all the major petroleum companies of Pakistan towards renewable energy, green hydrogen and green ammonia, he added.",
  "retrievedAt": "2025-08-11T08:49:03.634Z"
}
