{
  "title": "Senate chairman extends heartfelt felicitations to Saudi Arabia on its National Day",
  "link": "https://www.app.com.pk/national/senate-chairman-extends-heartfelt-felicitations-to-saudi-arabia-on-its-national-day/",
  "date_published": "2023-09-25T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP): Senate Chairman Muhammad Sadiq Sanjrani on Monday attended the National Day celebrations of the Kingdom of Saudi Arabia and conveyed warm regards and best wishes on behalf of the Senate and the people of Pakistan to King Salman bin Abdulaziz Al Saud, Royal Family, and Saudi nation.\nSpeaking on the occasion as the chief guest, he expressed his gratitude to Saudi Ambassador Nawaf bin Said Al-Malki, for extending the invitation and commended the progressive portrayal of Saudi Arabia on the event’s invitation card, highlighting its holistic development and inclusive vision. He emphasized the enduring and multifaceted bond between Pakistan and Saudi Arabia, founded on shared values, faith, and aspirations. He acknowledged Saudi Arabia’s significant support during challenging times and reaffirmed Pakistan’s unwavering commitment to reciprocate in diplomatic and security matters, highlighting recent high-level military engagements.\nSanjrani remarked that the partnership was fortified by an unwavering commitment to regional peace and stability, underlining both nations’ readiness to support each other in diplomatic and security matters. He lauded Saudi Arabia’s efforts to promote regional harmony through diplomacy, dialogue, and mutual respect. He expressed confidence that these initiatives would open doors to mutually beneficial opportunities for trade, cultural exchanges, shared initiatives, and collaborative endeavours, contributing to global progress. He underscored the importance of diplomacy, dialogue, and mutual respect in building a foundation for lasting peace and regional prosperity.\nThe Senate chairman said Crown Prince Mohammed bin Salman’s vision, epitomized by the Neom City project and initiatives like the Misk, showcases a holistic approach to modern society while remaining grounded in Saudi Arabia’s cultural heritage. Highlighting the close ties between Chagai and Saudi dignitaries, he looked forward to further collaboration with Ma’aden, a rapidly growing Saudi mining company, for mutual development and prosperity in mineral-rich areas. He also emphasized the importance of youth engagement and joint ventures in education, research, technology and innovation as avenues to deepen cooperation between the two nations.\nIn conclusion, Chairman Sanjrani reiterated Pakistan’s steadfast support, admiration, and warm wishes to the Kingdom of Saudi Arabia, pledging to continue fostering this enduring friendship and brotherhood.\nEarlier, Saudi Ambassador Nawaf bin Said Al-Malki, welcoming all the distinguished guests, shed light on the significance of National Day in the lives of the Kingdom’s people.\nHe was of the view that under the wise leadership of King Salman bin Abdulaziz Al-Saud and the dynamic vision of Crown Prince Mohammed bin Salman, Saudi Arabia had emerged as a beacon of progress and prosperity. He said their commitment to economic diversification, social reform, and global engagement had charted an inspiring path towards a brighter future.\nAmbassador Al-Malki said it was a day to celebrate the Kingdom’s significant contributions to regional stability, technological advancement, and cultural preservation. “The wise leadership’s unwavering dedication to diplomacy, science, and innovation has not only transformed Saudi Arabia but has also resonated on the global stage,” he maintained.\nAppreciating the historical ties between Pakistan and Saudi Arabia, Ambassador Al-Malki said the diplomatic relations between the two countries were nothing but sincere Islamic brotherhood and pure love for each other.\nOn this auspicious occasion, besides giving a standing ovation on the national anthems of the two countries, a cake-cutting ceremony was also witnessed by a large number of people from all walks of life including politicians, bureaucrats, diplomats, religious scholars, academia, businessmen and media persons etc.",
  "retrievedAt": "2025-08-11T09:47:59.074Z"
}
