{
  "title": "Pakistan achieves milestone of transitioning to second tier methodology for estimating GHG emissions",
  "link": "https://www.app.com.pk/national/pakistan-achieves-milestone-of-transitioning-to-second-tier-methodology-for-estimating-ghg-emissions/",
  "date_published": "2023-09-25T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):The Speakers at a  roundtable discussion to debate emissions released from Energy Sector on Monday said Pakistan had achieved a milestone of moving from Tier I to Tier II methodology in the country for estimating greenhouse gases (GHG) emissions that required more detailed data, complex calculations, and greater uncertainty analysis.\nThe Global Climate-Change Impact Studies Centre (GCISC) organised a stakholders’ consultation titled Moving towards Tier II Methodology for the Estimation of National GHG Emissions from Energy Sector in Pakistan under the Project ‘Third National Communications (TNC) of Pakistan.\nIn his opening remarks, Advisor (TNC) and former Director General Environment, Ministry of Climate Change, Irfan Tariq said it was a success of the GCISC as it was heading ahead in scientific endeavours.\n“GHG inventory is like a census for a country that reflects emissions of a country. Today we are looking that it had crossed a threshold of transitioning from Tier-I to Tier-II. Amid the available scientific human resource at present, it is a great success to achieve this level,” he said.\nGCISC, he said despite many challenges had established the fact that it was the only body to be approached on GHG inventory of Pakistan which was a milestone achieved after myriad  efforts.\nCommenting on the GHG inventory for Energy Sector, Irfan Tariq said the network being established through this system did not require any important framework to report the emissions.\nHowever, the development now could not be achieved without this inventory, whereas the Energy sector stakeholder contribution to this system was important and all sectors have to contribute to it, he added.\n“I will urge all partners to engage with GCISC and continue to participate in the process,” he said.\nHead of Coordination, GCISC, Dr Arif Goheer told the participants that he started working on GHGs from agriculture sector at the GCISC in 2007 and faced resistance from his own department.\nIn 2015, the country was unable to submit its first nationally determined contributions (NDC) and then GCISC was tasked to develop it.\n“We started worked on GHG inventory in 2016-17 and have completed the first round of developing GHG inventory,” he added.\nThe second step, he said was to prepare NDCs to be pledged by the provinces and the GCISC started capacity building workshops for the provinces including forest departments and currently efforts were underway for boosting the capabilities all the provinces.\nHe informed that the Ministry of Climate Change and Environmental Coordination had tasked GCISC to develop inventories for the provinces to start their foundation work.\n“We are going to form a working group on energy sector to achieve the set targets for the TNC. The  country specific emissions can make the NDCs more robust,” he said.\nEnergy, he said was the largest sector in terms of emissions, whereas it was a process of guidance and experience sharing through stakeholders consultation session for better results.\nHe highlighted that as per the United Nations Framework Convention on Climate Change (UNFCCC), the GHG inventories should be consistent whereas our inventories were developed on different guidelines since 1997.\n“We are working to convert previous inventories on modern global warming trends and factors for a consistent and focused document,” he added.\nThe roundtable intended to constructively engage and facilitate stakeholders in Pakistan Clean Energy Transition debate pertinent to uptake of Variable Renewable Energy sources (solar, wind), energy efficiency and conservation, Transmission & Distribution networks & off-grid systems, & decarbonization in (& beyond) the power sector.\nMoreover, to develop national emission factors for the estimation of GHG emissions in energy sector and to identify the key elements missing from Pakistan’s near- and long-term energy sector planning for reducing GHG emissions.\nThe session also held deliberations to identify the green financing opportunities & consult on development priorities for green infrastructure in Pakistan.\nHowever, the updated emission estimates will facilitate Pakistan’s Third National Communications (TNC) process and will feed into the final report to be submitted to UNFCCC and periodic report to the United Nations Environment Programme (UNEP).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:48:53.222Z"
}
