{
  "title": "Chairman PAEC highlights Pakistan’s achievements in peaceful nuclear uses at 67th IAEA session",
  "link": "https://www.app.com.pk/global/chairman-paec-highlights-pakistans-achievements-in-peaceful-nuclear-uses-at-67th-iaea-session/",
  "date_published": "2023-09-25T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):Chairman Pakistan Atomic Energy Commission (PAEC), Dr. Raja Ali Raza Anwar on Monday highlighted Pakistan’s achievements in peaceful nuclear uses at the 67th session of IAEA general conference held in Vienna, Austria.\nThe chairman PAEC is leading Pakistan’s delegation at the General Conference of the International Atomic Energy Agency (IAEA) which is underway in Vienna, Austria, at the IAEA Headquarters, according to a press release received here.\nDuring his statement, the Chairman underscored that Pakistan highly valued its cooperation with the Agency and remained committed to advance its collaboration by supporting the Agency’s role as per its motto, “atoms for peace and development”.\nThe Chairman appreciated the Agency’s continued assistance to member states in their efforts to meet developmental challenges through safe, secure and sustainable uses of nuclear science.\nHe also underscored that global issues require global solutions, highlighting that Pakistan remains one of the most vulnerable countries to climate change. He stressed that Pakistan views nuclear power as an affordable, reliable and clean source of energy and a part of the solution to the climate crisis.\nWhile acknowledging that Pakistan had been a beneficiary of the Agency’s assistance, the Chairman shared that Pakistan is effectively utilising nuclear science and technology in areas such as human health, food and agriculture, power generation, industry and environment protection.\nHe also highlighted that Director General Rafael Mariano Grossi’s visit to Pakistan earlier this year provided further impetus to strengthen the mutually beneficial and decades long collaboration between Pakistan and the Agency.\nThe Chairman stressed that nuclear technology in the human health sector remained a matter of national priority for Pakistan.\nHe shared that, at the moment, 19 cancer hospitals were being run by the Pakistan Atomic Energy Commission which were playing a vital role in providing quality treatment to over 80% of the country’s cancer patients.\nThe Chairman added that nuclear technologies were being deployed to enhance food security and agricultural productivity.\nIn this regard, Pakistan currently has four agriculture and biotechnology centres, out of which the Nuclear Institute for Agriculture and Biology (NIAB) has been designated as an IAEA collaborating Center and is also part of the Agency’s ZODIAC laboratories network. He further shared that, in a significant development, NIAB has been successful in producing coloured cotton and Pakistan is currently planning its large scale production.\nOn the margins of the General Conference, the Chairman will also hold multiple bilateral meetings to explore possibilities of collaboration in the peaceful uses of nuclear technology under the aegis of the IAEA.\nThe General Conference consists of representatives of the IAEA member states who meet in a regular annual session, usually in September, to consider and approve the IAEA’s budget and to decide on other issues raised by the Board of Governors, the director general and member states.",
  "retrievedAt": "2025-08-11T09:47:59.098Z"
}
