{
  "title": "Expert advise public to follow precautionary measures amid rising cases of Pink eye infection",
  "link": "https://www.app.com.pk/national/expert-advise-public-to-follow-precautionary-measures-amid-rising-cases-of-pink-eye-infection/",
  "date_published": "2023-09-25T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):Eye specialist Monday advised the citizens to follow precautionary measures amid rising cases of pink eye infection in the country and recommended people to seek medical attention promptly if they experience symptoms such as redness, itching, excessive tearing or a discharge from the eye, to prevent further spread of the infection.\nTalking to a private news channel, an ophthalmologist Dr Faisal Ayaz said that the Punjab government has issued an advisory in the wake of the viral conjunctivitis outbreak, adding, that people exposed to sunlight and dust for longer periods are being affected by conjunctivitis.\nThe recovery period for viral conjunctivitis was approximately two weeks, however, expert added that it took more than three weeks for complete recovery in the case of allergic conjunctivitis.\nHe further advised that public should avoid direct exposure to sunlight unless absolutely necessary, especially during peak heat hours of 10 am to 2 pm.\nPeople should maintain good personal hygiene by frequently washing your hands, he said, adding, patients should not to rub your eyes, clean eyes with cold water on a regular basis which will remove the dust particles and allergens that cause itching.\nHe stressed that people should not take over-the-counter eye medications as well consult an eye specialist in case people show symptoms of conjunctivitis.\n“For protection, it is advisable to wear black glasses, separate your bedding and utensils immediately, and exercise extreme caution to avoid further transmission,” he mentioned.\nReplying a question, he said there are different types of conjunctivitis, seasonal which is related to weather, and vernal conjunctivitis which affects children between the age group of 5-15.”\n“Increased screen time also causes dryness of the eye as the rate of blinking decreases, he said, adding, however it is important to blink our eyes frequently.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:49:09.850Z"
}
