{
  "title": "Capital gears up for Eid Milad-un-Nabi celebrations",
  "link": "https://www.app.com.pk/national/capital-gears-up-for-eid-milad-un-nabi-celebrations/",
  "date_published": "2023-09-25T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP): With only two days left in the Eid Milad-un-Nabi (Peace Be Upon Him) marking the birthday of the holy Prophet (Peace Be Upon Him), the devouts in the federal capital, like other parts of the country, are gearing up for celebrating this occasion through expressing enthusiasm and religious fervor.\nAs the Eid Milad-un-Nabi is being marked on September 29, people in the city have started illuminating their houses, vehicles and markets with colourful lights, buntings and banners to express their love for Prophet Muhammad (Peace Be Upon Him).\nA number of stalls carrying decorative items in connection with the celebrations set up in different corners of the city are attracting a number of buyers of all ages.\nThe day will be marked through taking out a Milad processions by the people across the federal capital.\nA number of schools, colleges and universities have been arranging Milad and Naat and Qirat competition since the advent of the month of Rabi-ul-Awal to highlight the importance of the day and educate the students about the exemplary life of Prophet Muhammad (Peace Be Upon Him).\nThe illuminations of the public and private buildings the city on the eve of Eid Milad-un-Nabi will also be the attraction for most of the residents, compelling them to visit main avenues along with their families.\nTo mark the day, the Ministry of Religious Affairs and Interfaith Harmony will host the two-day 48th International Seerat-un-Nabi Conference — Practical Wisdom for Economic Prosperity in the light of Sunnah — on September 28-29 in the federal capital.\nA number of other events including seminars, conferences and rallies will be organized on the day to highlight the importance of the day.\nThe day which has been declared as a public holiday by the government will be dawned with a 31-gun salute in the federal capital and 21-gun salutes in provincial capitals to pay homages to the Holy Prophet Muhammad (Peace Be Upon Him).\nSpecial prayers will be offered at mosques for peace, development and prosperity of the country.\nThe city administration has devised stringent security and traffic plans to ensure the smooth progress of rallies in the federal capital and its adjacent areas during the celebration of Eid Milad-un-Nabi.\nThe occasion of Eid Milad-un-Nabi holds special significance for Muslims as it is the month in which the holy Prophet (PBUH) was born. The whole month is marked by nationwide processions that feature large gatherings of people, with participants carrying banners, posters and flags adorned with Islamic calligraphy besides speeches and recitations of Naats.",
  "retrievedAt": "2025-08-11T09:48:31.452Z"
}
