{
  "title": "PM invites overseas Pakistanis to take advantage of investment opportunities in Pakistan",
  "link": "https://www.app.com.pk/global/pm-invites-overseas-pakistanis-to-take-advantage-of-investment-opportunities-in-pakistan/",
  "date_published": "2023-09-25T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday invited the overseas Pakistanis to take advantage of the opportunities offered by the government for investment in Pakistan.\nDuring a meeting with a delegation of prominent British Pakistani businessmen which called on him in London, the prime minister invited the diaspora businessmen to invest, especially in Special Economic Zones, to contribute to Pakistan’s economic recovery.\nThe prime minister highlighted positive economic indicators resulting from reforms pursued by the interim government, including a strengthening Pak. Rupee, reduced inflation, and expected economic growth.\nThe removal of import restrictions and efforts to restore the business community’s confidence are expected to further boost external accounts, he added.\nPM Kakar spoke about Pakistan’s investment-friendly approach, mentioning incentives and ease-of-business reforms. He introduced the Special Investment Facilitation Council (SIFC) to streamline investment in key sectors through a single-window platform. This initiative aims at enhancing ease of doing business, removing bureaucratic hurdles, and creating a long-term investment roadmap.\nMoreover, Prime Minister Kakar also shared the government’s resolve and commitment to privatize loss-making state-owned enterprises.\nThe British Pakistani business leaders expressed their appreciation for the prime minister’s outreach to the diaspora and conveyed their strong interest in expanding their business operations in Pakistan while actively seeking to increase their investments in the country.\nThey hoped that reforms undertaken by the government would continue in the long run and assured the prime minister of their support for putting Pakistan back on the growth trajectory.",
  "retrievedAt": "2025-08-11T09:48:24.294Z"
}
