{
  "title": "Parliamentary Caucus on Child Rights to host national symposium",
  "author": null,
  "content": "ISLAMABAD, Jan 15 (APP): The Parliamentary Caucus on Child Rights (PCCR) of the National Assembly of Pakistan, under the able leadership of its Convenor, Dr. Nikhat Shakeel Khan, MNA, is set to host the national symposium, titled “National Education Emergency: On Out of School Children”, in Islamabad on Thursday, tomorrow. This pivotal symposium will focus on addressing one of Pakistan’s gravest challenges; the staggering number of 26.3 million out-of-school children (OOSC).\nThe symposium will serve as a dynamic platform to bring together federal and provincial lawmakers, including members from Pakistan’s legislative assemblies, alongside the Federal Minister of Education and other esteemed dignitaries. Professionals will present comprehensive insights and excerpts while fostering informed discussions on innovative strategies to mitigate the barriers hindering educational access. These barriers include poverty, gender disparity, and insufficient infrastructure within the education system.\nConvenor PCCR, Dr. Nikhat Shakeel Khan has termed the out-of-school-children crisis a national emergency. She emphasized the urgency of a unified approach, stating that the PCCR was steadfastly committed to exploring collective decision-making avenues that encompass all stakeholders to address this monumental issue effectively.\nThe symposium aims to ignite meaningful dialogue and legislative momentum, aiming to chart a transformative path forward for Pakistan’s education sector. Through the synergy of legislators, educators and civil society, this event aspires to catalyze tangible progress in ensuring every child’s right to quality education.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:39:42.756Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/parliamentary-caucus-on-child-rights-to-host-national-symposium/",
  "dateList": "2025-01-15",
  "date_published": "2025-01-15T13:11:00.000Z"
}
