{
  "title": "Youm-e-Ashur observed with religious reverence, solemnity",
  "link": "https://www.app.com.pk/national/youm-e-ashur-observed-with-religious-reverence-solemnity/",
  "date_published": "2022-08-09T17:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 09 (APP): Youm-e-Ashur the tenth of Muharram-ul-Haram, was observed across the country with religious reverence and solemnity to pay homage to the supreme sacrifice rendered by Hazrat Imam Hussain (Razi Allah ho Ta’ala Anho) and his devoted companions in Karbala (Iraq).\nVarious processions were carried out in different cities of the division and thousands of security personnel were deployed to protect the mourners of the seventh-century martyrdom of Hazrat Imam Hussain (RA), the grandson of the last Prophet Hazrat Muhammad (SAW).\nThe mourning processions were  taken out in all the cities and towns of the country as Muslims were performing mourning rituals to mark the Ashura.\nStrict security measures were ensured by the local management of different cities and some road closures were also in place to avoid any untoward incident.\nLaw enforcers, including police, Rangers, FC and others have been deployed along the procession routes. The azadars (mourners) paid glowing tribute to sacrifices offered by Hussain (RA) and his companions for the supremacy of Islam.\nUlema and Zakireen highlighted the bright and candid teachings of Hazrat Imam Hussain (RS) and various aspects of Karbala tragedy.\nMedical camps, Sabeels and stalls were also provided drinking water, and food items to the participants. Mobile phone services was partially suspended as a security measure in different cities.\nPresident Dr Arif Alvi in his message said the supreme sacrifice of Hazrat Imam Hussain (RA) was a beacon of light for the Muslims and it carried the message that against the apparatus of oppression and tyranny one should be the flag-bearer of truth and righteousness.\nIn a message on the occasion of Youm-e-Ashur, he said in the Islamic history, Muharram-ul-Haram was a month of respect, dignity and blessings.  Hazrat Imam Hussain (RA), his family and loyal companions set a great example of bravery, courage and sacrifice, and gave a new life to Islam with their blood, he observed.\nPrime Minister Shehbaz Sharif said Islam was alive because of the sacrifices of Hazrat Imam Hussain (RA) and his companions and these sacrifices give courage and hope to the faithful in the face of difficulties and challenges.\nIn a message on the occasion of Youm-e-Ashur, he said this day reminded of the unparalleled struggle between good and evil, when a group led by Hazrat Imam Hussain (RA) refused to show allegiance to evil and stood before a seemingly powerful faction.\nHazrat Imam Hussain (RA) became a symbol of courage, determination and bravery, he remarked.\nIn Islamabad, the main procession emerged from  Imambargah Qasr Zainibia in G-6/4 and\nculminated at Imambargah Asna Ashri in G-6.\nIn Rawalpindi, the main Alam and Zuljinah procession was taken out from Imambargah Colonel Maqbool Hussain which culminated at Imambargah Qadeemi while passing through the designated routes.Over 2500 security personnel were deployed to guard the main procession while 3500 cops also provided security cover to other processions and majalis of the district.\nBesides, different processions emerged from various parts of the city and merged into the main procession.\nMain points of Rawalpindi from where processions were taken out include Imam Bargah Teli Mohalla, Imam Bargah Hifazat Ali Shah Bohar Bazar, Imam Bargah Darbar Sakhi Shah Chann Chiragh and Yadgar e Hussain Satelite Town.\nElaborate security arrangements have been made to avoid any untoward incident during the mourning processions. Over 6,000 security officials have been deployed to ensure security.\nIn Lahore, the main mourning procession was taken out from Nisar Haveli at Mochi Gate, which after passing through its traditional route will culminate at Karbala Gaamay Shah this evening, where Shaam-e-Ghareeban was being held.\nOverall 170 processions and 130 majalis were arranged in Multan district. The main procession was taken out from Imam Bargah Heera Haidri in the morning which concluded at Ghanta Ghar in the evening after passing its traditional route.\nIn Peshawar, the main Alam, Tazia and Zuljinah procession was taken out from Imam Bargah Agha Syed Ali Shah Qissa Khwani Bazaar this afternoon. Eleven other processions were also taken out from different Imam Bargahs which joined the main procession.\nSimilar processions of Tazia, Alam and Zuljinah were also taken out in Kohat, Khyber, Bannu, Hangu, Lakki Marwat, Kurram and Dera Ismail Khan districts.\nIn Karachi, the main procession was taken out from Nishtar Park after Majalis in the morning.\nAfter passing through its traditional route, the procession was concluded at Imam Bargah-e-Hussainan Iraniaan Kharadar in the evening.\nIn Quetta, the main mourning procession of Alam, Tazia and Zuljanah was taken out from Nichari Imambargah at Alamdar Road this morning, which culminated at the same place in the evening after passing through its traditional routes.\nIn Gilgit, Ashura procession was brought out from Markazi Imamia Masjid this morning which culminated at same place in the evening.\nIn Muzaffarabad, the main Tazia, Alam and Zuljinnah procession was taken out from Markazi Imam Bargah Pir EIam Shah Bukhari.\nElaborated Security measures have been put in place across the country to ensure secure and smooth movement of processions and holding of Majalis.",
  "retrievedAt": "2025-08-11T15:21:43.309Z"
}
