{
  "title": "PBM distributes 6,600 wheel chairs to deserving in last three years",
  "link": "https://www.app.com.pk/national/pbm-distributes-6600-wheel-chairs-to-deserving-in-last-three-years/",
  "date_published": "2021-08-22T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 22 (APP):Pakistan Bait-ul-Mal (PBM) has distributed some 6,600 wheel chairs among the deserving persons in the last three years, said an official.\nGiving breakup, he said that type of wheel chairs included some 2,100 customized wheel chairs and 4,500 standard wheel chairs. Assistive devices including ordinary wheel chairs, customized wheel chairs, artificial limbs, artificial knee caps, hearing devices, etc were provided to the needy patients during last three years.\nA sum of Rs 10,000 was being paid to the family with one person with disabilities (PWD) and Rs 25,000 to the family with two or more PWDs. Some 12,783 PWDs have been provided financial assistance of Rs 151,900,712 in last three years under special friend project.\nHe said the PBM had provided cochlear implants, (a small electronic device that electrically stimulates the cochlear nerve and nerve for hearing) to 118 patients. The implant has external and internal parts. The external part sits behind the ear.\nIt picks up sounds with a microphone. It then processes the sound and transmits it to the internal part of the implant. He said cochlear implants were being provided to the deserving in collaboration with private hospitals. Under such partnerships, PBM bears Rs1 million for each cochlear implant while the rest of the expenses were being met by the hospitals concerned.\nPBM has recently started enrollment of 30 street children in Pakistan Bait-ul-Mal School for Rehabilitation of Child Labour (SRCLs) of Provincial/Regional headquarters on pilot basis.\nRight now some 10 Panagahs were functioning countrywide including five in Sindh, four each in Khyber Pakhtunkhwa and Balochistan, five in Islamabad and Azad Kashmir and one Panagah is working in Gilgit-Baltista.\nEach Panagah has the capacity of overnight stay for 100 persons and 400 persons are provided with hygienic meals two times daily. Some 2,206,549 beneficiaries have been benefited from Panagahs and 132,927 have been provided shelter.",
  "retrievedAt": "2025-08-11T21:06:59.283Z"
}
