{
  "title": "Agri Research Center inaugurated in South Waziristan to provide production opportunities",
  "link": "https://www.app.com.pk/national/agri-research-center-inaugurated-in-south-waziristan-to-provide-production-opportunities/",
  "date_published": "2021-08-22T14:49:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 22 (APP):Special Assistant to Prime Minister for Food Security Jamshed Iqbal Cheema Sunday said that as per the vision of Prime Minister Imran Khan the record uplift projects in agriculture and livestock sectors have been initiated in the merged districts that would help eliminate sense of deprivation of tribal people.\nHe expressed these views while inaugurating an Agriculture Research Center (ARC) in Wana South Waziristan. Jamshed Iqbal Cheema said that Prime Minister Imran Khan has given special attention to the rapid development of merged districts like other areas of the country.\nHe said that agriculture research centers were being set up in merged districts to provide production opportunities in this sector. He said that special attention has also been given to develop livestock sector in tribal districts.\nHe said that previous governments had not done anything to eradicate poverty from the country. They had bankrupted the country for the sake of their own interest.\nHe said that terrorism has been eradicated and peace has been restored in tribal districts, adding after the eradication of terrorism, now the era of development has started here.\nProvincial Minister for Agriculture Mohibullah, Chairman Pakistan Agriculture Research Center Islamabad Dr. Azeem Khan and other also addressed the function.\nTribal elders besides MPA Faisal Amin Khan Gandapur, Secretary Agriculture KP Israr Khan, ADC South Waziristan Fahad Ullah Khan, DPO South Waziristan Shaukat Ali, Director General PARC Dera Ismail Khan Numan Latif Saduzai, Director Agriculture Anwar Khan Betani and others were also present on this occasion.",
  "retrievedAt": "2025-08-11T21:06:54.767Z"
}
