{
  "title": "Taliban’s swift transformation to a new normal more surprising than Kabul’s takeover",
  "link": "https://www.app.com.pk/national/talibans-swift-transformation-to-a-new-normal-more-surprising-than-kabuls-takeover/",
  "date_published": "2021-08-22T11:42:00.000Z",
  "source": "APP",
  "content": "Hasnain Raza Gardezi\nISLAMABAD, Aug 22 (APP): The Taliban’s abrupt takeover of Kabul was a shocking development but their swift transformation to a new normal, contrary to their past narrative and actions, seems a hard pill for the world to swallow.\nThe positive initiatives announced by Taliban spokesman, in an unprecedented press conference,  from the announcement of amnesty to the government officials to their assurance not to allow any group use Afghanistan’s territory against any country signal a change of heart.\n“I would like to assure the international community, including the United States, that nobody will be harmed,” the group’s spokesperson Zabiullah Mujahid has said in a recent statement. “We don’t want any internal or external enemies” he further said, was something beyond expectation, international media quoted.\nThe Taliban’s spokesperson in his first news conference pledged to honour women’s rights under “the framework of Islam” and also assured media freedom. The group also disassociated itself from the notorious Tehrik e Taliban Pakistan (TTP); involved in subversive activities in Pakistan.\nThis move and daily positive vibes from the seemingly strict “mujahideen commanders”,; particularly Taliban’s assurance not to allow use of the Afghan soil against any country was widely welcomed by Pakistan at official and public level.\nThe Taliban had gone far ahead in their consultation with the top local Afghan leaders and several rounds are being held daily at various locations at different leadership levels.\nThe recent round of discussions was held with former Afghan President Hamid Karzai and Abdullah Abdullah, coalition partners of the self-exiled President Ashraf Ghani, who hosted Taliban leaders to develop a consensus to form a government accepted by all factions and stakeholders, VOA reported.\nComprising Speaker Wolesi Jirga Mir Rehman Rehmani, Salahud din Rabbani and former Afghan vice president Mohammad Yunus Qanooni among others, an Afghan delegation recently concluded their visit and met with the Pakistan’s top leadership for an “inclusive government” in Afghanistan.\nAddressing a press conference at the conclusion of the visit, Rahmani said the next phase in Afghanistan was the formation of a government.\n“The new government will only succeed if all stakeholders are made part of it,” he added.\nInvolvement of different political and ethnic groups and the wide scale of consultations shows that a sort of national government with representatives from all major factions will be in place in the days ahead, ending uncertainty, and may lead to peace in the war-ravaged country.\nThe EU, China, Russia, Turkey and Iran have hinted to make “diplomatic overtures” with the Taliban on a condition the group honours human rights and assures a peaceful political transition in consultation with the all Afghan factions and stakeholders.\nEven the United States didn’t rule out to work with the Taliban and said “it is possible to maintain a diplomatic presence in Afghanistan beyond the August 31 deadline for troop withdrawal from the country.\n“Relations with a new Afghan government will depend on the actions of the Taliban” Edward Price the spokesman for the United States Department told reporters at a news briefing on Tuesday.\nOn the other hand the US also frozen nearly $ 9.5 billion in assets belonging to the Afghanistan central bank and stopped shipment of cash to the nation saying, “as it tries to keep a Taliban-led government from accessing the money” a US administration official confirmed on Thursday.\nSome western powers however have shown reluctance to go ahead with the Taliban and took counter measures. Germany said “it is ending development aid to Afghanistan in light of the Taliban’s takeover there, German Development Minister Gerd Mueller informed the international media about the step taken by his government.\nCanada had the toughest stance and its Prime Minister Justin Trudeau talking to the media in a categorical statement said, “Canada has no plans to recognise the Taliban as the Government of Afghanistan. They have taken over and replaced a duly elected democratic government by force.”\nThe World is now eyeing the UN’s Human Rights Council’s special session next week on the situation in Afghanistan to address “serious human rights concerns”. The Geneva forum is set to convene on August 24 at the request of Pakistan and nearly 90 other countries are supporting the move.\nConvening a special session requires support from one-third of the Council’s 47 member states.\nThe G7, world’s largest advance economies, foreign ministers are also scheduled to hold a video conference Thursday to discuss the ongoing crisis in Afghanistan and it is hoped that the world would soon come with a permanent solution to the Afghanistan’s issue.",
  "retrievedAt": "2025-08-11T21:06:58.049Z"
}
