{
  "title": "PM rejects President Biden’s statement as ‘factually incorrect, misleading’",
  "link": "https://www.app.com.pk/national/pm-rejects-president-bidens-statement-about-pakistan/",
  "date_published": "2022-10-15T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday said that Pakistan rejected the remarks reportedly made by US President Joe Biden which ‘are factually incorrect and misleading’.\n“Over the past decades, Pakistan has proven be a most responsible nuclear state, wherein its nuclear programme is managed through a technically sound and foolproof command and control system,” a press statement of the PM Office Media Wing quoted the prime minister as saying.\nPakistan had also consistently demonstrated responsible stewardship of its nuclear-weapons capability, marked by a very strong commitment to global standards, including those of IAEA on non-proliferation, safety, and security, the statement said.\nIn a separate tweet, the prime minister unequivocally reiterated that Pakistan ‘is a responsible nuclear state’ and no one should have any doubts in this regard.\nThe prime minister said that they were proud that their nuclear assets had the best safeguards as per requirements of the International Atomic Energy Agency (IAEA).\n“We take these safety measures with the utmost seriousness. Let no one have any doubts,” the prime minister further posted in his tweet.\nThe real threat to the international peace and security was posed by ultra-nationalism, violation of human rights in the regions that were struggling against illegal occupation, violation of global norms by some states, repeated nuclear security incidents and arms race among leading nuclear weapon states and introduction of new security constructs that disturbed the regional balance.\n“Pakistan and the US have a long history of friendly and mutually beneficial relationship. At a time, when the world is confronted by huge global challenges, it is critically important that genuine and durable efforts are made to recognize the real potential of Pakistan-US relationship, while avoiding unnecessary comments. It is our sincere desire to cooperate with the US to promote regional peace and security,” it was further added.\nAccording to a transcript of the White House published on its website, President Biden at a Democratic Congressional campaign committee reception yesterday, had remarked ‘what I think is maybe one of the most dangerous nations in the world: Pakistan. Nuclear weapons without any cohesion’.",
  "retrievedAt": "2025-08-11T15:43:53.442Z"
}
