{
  "title": "BNP enrols 2.78m beneficiaries nationwide till date",
  "author": null,
  "content": "ISLAMABAD, Jan 21 (APP): The Benazir Nashonuma Programme (BNP) has enrolled 2.78 million beneficiaries nationwide including 824,891 in Khyber Pakhtunkhwa till date.\nThese beneficiaries receive healthcare services, Special Nutritious Food along with Iron and Folic Acid supplements.\nKP ranks second in the country in terms of the number of enrolled beneficiaries.\nThis was revealed during a consultative meeting of Benazir Nashonuma Program chaired by Chairperson Benazir Income Support Programme (BISP) Senator Rubina Khalidon at the BISP Headquarters here Tuesday.\nThe meeting brought together key stakeholders, including Secretary Health KP, Adeel Shah, accompanied by his core team on BNP, and the Country Director of the World Food Programme (WFP), Ms. Coco Ushiyama, along with her team, to discuss ongoing program activities and strategies for enhanced collaboration.\nDuring the meeting, DG CCT/NSER Dr. Asim Ijaz provided an update on the ongoing activities of the Benazir Nashonuma Program in KP.\nThe Benazir Nashonuma Program is the flagship initiative of BISP which is being implemented in 147 districts across the country.\nIn Khyber Pakhtunkhwa, the BISP has partnered with the World Food Programme (WFP) and the Department of Health (DoH) to execute the program through 148 established Facilitation Centers.\nSpeaking during the meeting, Chairperson BISP Senator Rubina Khalid directed the steering committee to convene weekly meetings and emphasized the importance of transparency and efficient resolution of complaints through the Grievance Redressal Committee.\nSecretary BISP, Amer Ali Ahmad, encouraged all stakeholders to adopt a more proactive approach in addressing any concerns raised on various forums.\nIt was reaffirmed that the BISP is committed to continue the Benazir Nashonuma Program in KP.\nThe Chairperson BISP also rejected recent false media reports regarding BNP in KP, expressing BISP’s full confidence in the Department of Health (DoH) KP and highlighting its critical role in supporting the program.\nSecretary Health KP, Mr. Adeel Shah, appreciated WFP’s contributions in KP, particularly in supporting Internally Displaced Persons (IDPs), education and other projects.\nSenator Rubina Khalid commended the Department of Health, KP for facilitating and extending its structure and services to support the Benazir Nashonuma Program in the province.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:54:00.643Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/bnp-enrols-2-78m-beneficiaries-nationwide-till-date/",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T14:09:00.000Z"
}
