{
  "title": "Islamabad International Airport hits record Rs. 72.3 million in March 2025",
  "author": null,
  "content": "ISLAMABAD, Apr 18 (APP):Islamabad International Airport (IIAP) has reported an unprecedented surge in cargo throughput charges, collecting Rs. 72.3 million in March 2025, the highest monthly revenue recorded since November 2021, when the figure stood at Rs. 49 million.\nAccording to the Pakistan Airports Authority, the significant uptick in revenue is largely driven by the launch of dedicated import cargo operations by M/s SF Cargo. The service, which began in March, utilizes Boeing 757-200 aircraft operating under flight numbers 03-233/234 on the Urumqi-Islamabad-Urumqi (URC-ISB-URC) route.\nEach flight carries an estimated 22,775 kilograms of cargo. Initially scheduled twice a week ,every Tuesday and Friday, the flights arrive at IIAP around 11:30 a.m., contributing a steady and sizable flow of freight traffic to the airport. Given the promising early performance, SF Cargo has already indicated plans to double the flight frequency to four times a week in the near future.\n“The introduction of regular, high-capacity cargo operations by SF Cargo has brought a welcome boost to our revenue and has reaffirmed Islamabad Airport’s strategic importance as a regional logistics hub,” said a spokesperson for the Pakistan Airports Authority. “This initiative not only supports Pakistan’s trade connectivity with Western China but also opens the door for further expansion in air cargo services.”\nIndustry observers note that the increased cargo activity comes at a time when Pakistan is looking to modernize its logistics infrastructure and strengthen trade corridors under initiatives like the China-Pakistan Economic Corridor (CPEC). The growing use of air freight is seen as a sign of economic resilience and regional cooperation.\nAs SF Cargo expands operations and other regional carriers explore similar routes, IIAP is expected to continue its upward trajectory in cargo handling and revenue generation, reinforcing its role as a critical gateway for international trade.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:37:52.359Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-international-airport-hits-record-rs-72-3-million-in-march-2025/",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T11:41:00.000Z"
}
