{
  "title": "Training course “Orientation and Mobility Techniques for Visually Impaired Persons” concluded",
  "author": null,
  "content": "ISLAMABAD, Apr 18 (APP): The Directorate General of Special Education, Ministry of Federal Education & Professional Training, successfully concluded a two-week training course coordinated by National Mobility & Independence Training Centre, National Institute of Special Education, here on Friday.\nThe course titled “Orientation and Mobility Techniques for Visually Impaired Persons” from April 7 to April 18, 2025, said a press release. A total of 37 visually impaired persons from all over the country including Gilgit Baltistan, Azad Jamu & Kashmir, Punjab and Khyber Pakhtunkhwa participated in the training.\nThe closing ceremony, marked the culmination of an impactful program aimed at empowering visually impaired individuals with essential skills for independent navigation and mobility.\nThe ceremony was graced by the Chief Guest, Farah Naz Akbar, Parliamentary Secretary, Ministry of Federal Education & Professional Training, who lauded the efforts of Directorate General of Special Education in fostering inclusivity and independence for visually impaired persons.\nIn her address, she emphasized the importance of such initiatives in building a more equitable society, and pledged her continued support for programs that enhance accessibility and empowerment at the government front.\nThe event commenced with a welcome address by Capt. (R) Asif Iqbal Asif, Director General, Special Education, who highlighted the significance of the training in equipping participants with practical skills to navigate their surroundings confidently.\nHe briefed about the revamping initiatives being taken for special education in guidance of Federal Minister, State Minister, Parliamentary Secretary and Secretary M/o FE&PT. The success stories shared by visually impaired trainees were a source of immense motivation for the audience.\nDr. Ashfaq Ahmad, an esteemed Overseas Pakistani from Australia, commended the initiative for its transformative impact on the lives of visually impaired individuals. He stressed the need for global collaboration to advance assistive technologies and training methodologies. Sir Shamshad Ahmad Khan, another distinguished Overseas Pakistani, also shared his insights, applauding the commitment of Ministry in fostering independence and dignity for PWDs.\nHe encouraged continued efforts to expand such programs across the country. Both guests from overseas Pakistan expressed gratitude towards the Parliamentary Secretary M/o FE&PT for providing them opportunity to view the scope and efforts of Special Education in the country.\nAt the end the Chief Guest distributed the certificates among the participants and congratulated them on successful completion of training.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:38:43.955Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/training-course-orientation-and-mobility-techniques-for-visually-impaired-persons-concluded/",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T16:24:00.000Z"
}
