{
  "title": "NA speaker calls Palestine conflict a ‘Grave Moral Dilemma’ for world",
  "author": null,
  "content": "ISLAMABAD, Apr 18 (APP): Speaker of the National Assembly Sardar Ayaz Sadiq has said that the issue of Palestine continues to haunt the global conscience as it represents not just a political conflict but a crisis of humanity—a modern-day genocide that poses a grave moral dilemma for the civilized world.\nAddressing 1st Meeting of the Group of Parliamentarians in Support of Palestine, held at the Grand National Assembly of Turkey, he said, “This is not merely a political dispute, nor is it confined to religious or cultural affiliations. At its core, it is a crisis of humanity — a modern-day genocide that poses a grave moral dilemma for the civilized world.”\nWhile expressing solidarity with the people of Palestine, he said that for over seven decades, the people of Palestine have been denied their inalienable right to self-determination — a right enshrined in countless United Nations resolutions.\nHe lamented that the international community has largely failed to stop the oppression, as Palestinians continue to suffer under a brutal and illegal occupation.\nWhile expressing unwavering solidarity with the people of Palestine, Speaker Sardar Ayaz Sadiq has said that Pakistan stands with the people of Palestine in their just and noble struggle. This support is not episodic — it is principled, historic, and central to our foreign policy, he added.\nHe said that Pakistan’s stance on Palestine is rooted in national legacy. He further stated that soon after independence, Pakistan opposed the UN partition plan and the creation of the state of Israel. Furthermore, he noted that the Founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah, vocally championed Palestinian rights, asserting that the land rightfully belonged to its indigenous people. His decision not to recognize Israel has been upheld by every successive government to date, he added.\nSpeaker Sadiq has said that even as a nascent state, Pakistan took a firm stand — advocating for Palestine both nationally and globally. He further said that during his previous tenure as Speaker National Assembly, he had the honour of convening the first-ever Speakers’ Conference in 2017, with parliamentary leaders from Afghanistan, China, Iran, Pakistan, the Russian Federation, and Turkey.\nThe Conference, themed “Parliamentary Cooperation for Peace, Connectivity, and Prosperity,” was a platform where we resolved to support oppressed communities — whether in Kashmir, Rohingya, or Palestine — and to promote dialogue, justice, and solidarity across regions.\nHe reiterated in the strongest possible terms that the Government and people of Pakistan unequivocally condemn the continued aggression and atrocities committed by Israeli Occupation Forces in the Occupied Palestinian Territories, particularly in Gaza. The indiscriminate violence — which has claimed the lives of thousands, including women, children, medical personnel, and humanitarian workers — is a stain on modern history, he added.\nWhile denouncing Israel’s latest military offensive, including the illegal seizure of the Morag Corridor and the annexation of Palestinian land under the guise of “security corridors”, he expressed that this is a blatant violation of international law. These actions are part of a calculated strategy to displace Palestinians and alter regional demographics, he added.\nHe further stated, “Among the most heinous acts is the deliberate bombing of a UN-run clinic in Jabalia, which sheltered over 700 displaced civilians, this alongside the broader campaign to ethnically cleanse Palestinians, amounts to war crimes and demands urgent international accountability.”\nHe also highlighted South Africa’s decision to initiate legal proceedings against Israel at the International Court of Justice (ICJ), alleging that it violated the Genocide Convention — a significant development in international law. The ICJ has emphasized that Israel must end its unlawful occupation, halt settlement activities, evacuate from the settlements, and offer reparations for the destruction caused. Several states, including Nicaragua, Colombia, Libya, Mexico, Spain, and the State of Palestine, have filed interventions — a powerful testament to the gravity of this case and its global significance.\nSpeaker Sadiq strongly condemned Israel’s ongoing military campaign, which, as of 7 October 2024, has resulted in the killing of over 42,000 Palestinians—including 13,300 children—and left more than 97,000 injured due to Israeli forces’ actions. Many of these attacks were deliberate or indiscriminate, wiping out entire multigenerational families, he added.\nHe further stated that these are not mere numbers — they represent a moral failure of our time.\nSpeaker Sardar Ayaz Sadiq stated that equally disturbing was the storming of the Al-Aqsa Mosque by Israeli forces during the sacred festival of Eid-ul-Fitr — a sacrilegious act that violated the sanctity of one of Islam’s holiest sites and aimed to provoke and inflame regional tensions. He further stated that such provocations are unacceptable and must be condemned in the strongest possible terms.\nHe reiterated Pakistan’s firm call for the establishment of a viable, independent, and contiguous Palestinian State—based on the pre-1967 borders, with Al-Quds Al-Sharif as its capital. In addition, he stated that this remains the only just, comprehensive, and lasting solution, in accordance with UN and OIC resolutions.\nHe further said that the Israeli occupation is part of a broader colonial-settler project — one that closely parallels India’s illegal occupation of Jammu and Kashmir. In both cases, the fundamental rights of indigenous populations are being systematically violated, he added.\nSpeaker Sadiq further stated that “Pakistan will not — and must not — abandon its Palestinian brothers and sisters, just as we remain unwavering in our support for the people of Kashmir.”\nHe expressed resolve that the Parliament of Pakistan has passed numerous resolutions in support of Palestine — reflecting an unshakeable consensus among all political parties and communities across the country. This unity underscores our collective moral obligation to speak and act for justice.\nHe urged that the world must not normalize this occupation. The international community must move beyond rhetorical condemnation and take concrete, coordinated actions to ensure accountability and justice, he added.\nHe further said that the people of Gaza, the West Bank, and all occupied Palestinian territories deserve to live in dignity, security, and freedom. He also appealed to the conscience of the international community and the collective strength of the Muslim Ummah to act — and to act now. “Muslim countries possess the resources, the will of their people, and the moral authority,” he added. “What we need now is unity. It is unity — not division — that is our greatest strength. If we stand together with determination, our collective voice cannot be ignored.”\nSpeaker Sadiq stated that the Palestinian issue is a moral test — a test of whether the world will uphold the principles of justice and humanity, or allow the forces of occupation, apartheid, and oppression to prevail.\nHe reaffirmed Pakistan’s unwavering resolve to raise its voice — at every forum and on every platform — in steadfast support of the Palestinian people.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:38:22.945Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-speaker-calls-palestine-conflict-a-grave-moral-dilemma-for-world/",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T16:46:00.000Z"
}
