{
  "title": "Begum Alvi stresses upon greater awareness about ASD, change in society with conducive milieu",
  "link": "https://www.app.com.pk/national/begum-alvi-stresses-upon-greater-awareness-about-asd-change-in-society-with-conducive-milieu/",
  "date_published": "2023-04-01T08:38:00.000Z",
  "source": "APP",
  "content": "ISLAMBAD, April 1 (APP): First Lady Begum Samina Alvi on Saturday stressed upon greater awareness about Autism Spectrum Disorder (ASD) to create greater understanding, encourage parents to seek early intervention therapies and ensure greater integration of persons with autism in the society.\n“Despite the prevalence of disabilities in our society, individuals with disabilities face many barriers to inclusion and participation. They may face discrimination, stigma, and lack of access to essential services, such as education, healthcare, and employment,” the first lady was addressing a seminar on the occasion of World Autism day at Shifa International Hospital.\nShe said that it was their collective responsibility to work towards breaking down societal barriers for the individuals with disabilities by promoting their greater inclusion in all sectors of society.\n“This means creating accessible environments, promoting universal design, and ensuring that individuals with disabilities have access to the resources and support they need to participate fully in their communities,”\nShe said that the ASD was a complex neurodevelopmental disorder that affected communication, social interaction, and behaviour, and diagnosed in people of all genders, races, and socioeconomic backgrounds.\nReferring to the observance of the day, she said that it reminded of the challenges that individuals with Autism Spectrum Disorder (ASD) and other disabilities faced on a daily basis.\nAccording to statistics, approximately one in 59 children was affected by autism spectrum disorder, she observed.\nBegum Alvi underlined the need for provision of education, healthcare, employment opportunities, and other services that enabled individuals with disabilities to reach their full potential.\n“Today, we reiterate our resolve to continue to work together to ensure that their rights are protected and that they are fully included in all aspects of society,” she added.\nThe United Nations Convention on the Rights of Persons with Disabilities (CRPD) was an international treaty that outlined the rights of individuals with disabilities and set standards for their inclusion in society, she added.\nShe said Pakistan had already ratified this convention and it had already enacted laws that provided for the rights of persons with disabilities.\nEnumerating certain steps, she said, the Higher Education Commission (HEC) had introduced policies for students with disabilities and they were being provided fee waivers in Pakistan’s higher educational institutions.\nThe first lady mentioned that they also initiated a campaign on the rights and facilitation of persons with disabilities (PWDs) in 2022.\nWith the help of the Pakistan Telecommunication Authority (PTA) about 128.15 million awareness messages in Urdu had been sent on this topic in Pakistan, she said, adding through their awareness campaign on the rights of PWDs, they were sensitising the people of Pakistan about their rights and society’s responsibility towards them.\n“We are promoting the services and facilities that are already being offered by the governments, including their job quotas. We are also emphasising that these job quotas should be strictly implemented in their true letter and spirit and all PWDs, irrespective of the extent of their disabilities should be given jobs,” she opined.\nShe also highlighted that the banks, chambers of commerce and industries, private sector organizations, welfare foundations, and organizations were working for the cause of PWDs regarding skill development and employment of PWDs in all sectors of the economy.\nSimilarly, she said, the government and banks were now offering loans at discounted rates to PWDs for ensuring their financial independence, and these were working on a plan to make all their branches PWD-friendly and compliant with their special needs.\nShe further informed that they also held meetings with the representatives of PWDs, the provincial government, NADRA, and social welfare departments to highlight the issues being faced by PWDs. Similarly, laws had been enacted that have made it mandatory for the issuance of building permits to all future public buildings in the capital to be accessible and PWD-friendly, she added.\nShe said that the individuals with disabilities had the fundamental rights to education and employment, but they often faced significant barriers in accessing these rights.\nThese barriers might be due to a lack of accessible schools and classrooms, specialized support and services, or discrimination and stigma from employers, she added.\nIt was crucial to ensure that individuals with disabilities have access to quality education that met their unique needs and to created inclusive workplaces that valued their skills and abilities, she opined.\nSpeaking on the occasion, Chief Executive Officer of Shifa international hospital Dr. Zeeshan Bin Ishtiaque said that the hospital was committed to improving the lives of individuals with autism.\nDr. Nosheen Kazmi, a psychiatrist, said that every individual had to play a role in supporting autistic children and adults in society.\nMuhammad Kashif Khan, AGM rehabilitation department, said that role of rehabilitation was vital in making a child with ASD functional and independent.\nEarlier, the first lady also gave away shields among the notable speakers.",
  "retrievedAt": "2025-08-11T08:11:20.310Z"
}
