{
  "title": "Art exhibition of a Pakistani visual artist in Brussels highlights urbanization",
  "link": "https://www.app.com.pk/national/art-exhibition-of-a-pakistani-visual-artist-in-brussels-highlights-urbanization/",
  "date_published": "2022-12-03T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP): A solo art exhibition, of a young Pakistani visual artist Mina Arham, was launched in Brussels with main focus on rapid global urbanization and its profound transformation of the urban landscape, especially in Lahore, the cultural capital of Pakistan.\nA Solo Art exhibition, of a young Pakistani visual artist Mina Arham, was launched with a main focus on the rapid global urbanization and its profound transformation of the urban landscape, especially in Lahore, the cultural capital of Pakistan.\nThe exhibition was held at the Red Moon Art Incubator Brussels in collaboration with the Embassy of Pakistan in Brussels, said a press release received here Saturday.\nThe Red Moon Art Incubator is a not-for-profit organization promoting young female artists from under-represented countries by providing them residency and an opportunity to exhibit their art in Europe.\nIn his remarks, the Ambassador of Pakistan to Belgium, Luxembourg and the European Union, Dr. Asad Majeed Khan, who inaugurated the exhibition, highlighted the vibrancy and diversity of Pakistan’s rich history of visual arts, which presented the country as a shining spot on the global art canvass.\nThe ambassador underscored that the country has a distinct honor of producing a number of iconic and world-famous artists, such as Sadiquain, Abdur Rehman Chughtai, Ismail Gul Jee, Ghulam Rasool, etc.\nHe explained that the Pakistani art scene is evolving from its traditional mediums of miniature art and calligraphy into more contemporary mediums by a multitude of established and upcoming artists with fresh and innovative ideas presented across a variety of mediums.\nAppreciating the work of Mina Arham, Ambassador Khan underlined that the embassy had always promoted the creative talent of Pakistani artists and showcased them to the Belgian public.\nHe emphasized that more such events would be arranged in the series of exhibitions “Pakistan Panorama” to present the Belgian audience with a representative selection of talented upcoming visual artists from the Pakistani art scene.\nMina Arham explained her artwork to the visitors and also told the audience about her inspirations.\nThe exhibition was attended by a large number of art enthusiasts, civil society members, members of the diplomatic corps, and media representatives.\nThe exhibition will continue for two weeks, till December 11, 2022.",
  "retrievedAt": "2025-08-11T15:57:07.341Z"
}
