{
  "title": "Pakistan committed to well-being of persons with disabilities: President",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-well-being-of-persons-with-disabilities-president/",
  "date_published": "2022-12-03T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP): President Dr Arif Alvi Saturday said that Pakistan was committed to promoting the rights and well-being of persons with disabilities (PWDs) in all spheres of society.\nThe president, in his message on the International Day of Persons with Disabilities being observed under the theme ‘Transformative solutions for inclusive development: the role of innovation in fuelling an accessible and equitable world’ on December 3, called for the inclusion of persons with disabilities in all spheres of life.\nDr Alvi said the inclusion of PWDs in all spheres of life as equal and fully capable persons was paramount as over one billion people or almost 15 percent of the world’s population suffered from some form of disability.\n“Unfortunately, out of this 15 percent, 80 percent live in developing countries, which also include Pakistan where the population of PWDs is estimated to be more than 10 percent that is indeed an alarming figure.”\nThe president said,“On this day, we pledge ourselves to remove stereotypes attached to this huge population and take proactive steps to give them equal opportunities in all aspects of life.”\nHe stressed providing the PWDs with quality and customized education and skills, which “maximize their abilities, make them economically and financially empowered, besides creating enabling conditions for their participation as equals in political, social, economic and cultural mainstreams”.\nHe pledged to take on board everyone, including the PWDs, to achieve Sustainable Development Goal 10, “which strives to reduce inequality within and among countries by empowering and promoting the social, economic and political inclusion of all, including persons with disabilities”.\nHe expressed full faith in the country’s leadership, relevant institutions, and society for rising to the occasion and taking all necessary steps to promote an understanding of disability issues.\nIn this regard, he emphasized mobilizing support for the dignity, rights, and well-being of PWDs by increasing their access to technology, enhancing accessibility to public places, and creating legal, social, and economic conditions.\nThe president urged the members of the public and private sectors to undertake special efforts for the inclusion of PWDs into the mainstream of all sectors of life, particularly by providing them with education in mainstream institutions.\nHe called for ensuring the provision of quality and relevant healthcare facilities and treatment to the PWDs, besides providing employment to them as per their skills and abilities, and implementing their job quotas with creating an enabling and friendly environment for them.\nThe president urged the media to play its role as an important stakeholder in dispelling and discouraging negative attitudes and stereotypes attached to the PWDs through their media products.\n“I believe that if we join hands and direct our energies and efforts with commitment and determination, and take all stakeholders on board, we can succeed in integrating the PWDs as equal and normal members of our society,” he said.",
  "retrievedAt": "2025-08-11T15:57:12.481Z"
}
