{
  "title": "President urges business community, organizations to create opportunities for disabled persons",
  "link": "https://www.app.com.pk/national/president-urges-business-community-organizations-to-create-opportunities-for-disabled-persons/",
  "date_published": "2022-12-03T14:43:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 03 (APP): President Dr Arif Alvi has urged the business community and private organizations to create opportunities in collaboration with the government for Persons With Disabilities (PWDs) so as to help assist them to lead a better life and contribute to society.\nWhile addressing an Interactive Dialogue on ‘Persons with Disabilities’ (PWDs) organized by World Health Organization (WHO) at Governor House Sindh, he said that the government was making all-out efforts to provide disabled persons with their rights and facilities.\nPresident Dr. Arif Alvi said, “The government alone cannot do it all and the private sector should come forward in this regard.”\nFirst Lady Samina Alvi was also present on the occasion.\nHe said that the society needed inclusiveness and acceptability. He said that persons with disabilities including physically challenged, visually impaired, hearing impaired and mentally challenged persons be provided with more easy access to technology and increased accessibility to public places by making good conditions for them.\nThe president emphasized that the inclusion of PWDs into the mainstream would help them grow as more fruitful citizens of society. He said that mainstreaming would also help dispel prejudiced notions among our populations and transform the dependence of PWDs into their freedom through job creation opportunities for them.\nHe urged the federal all provincial government stakeholders for technologies to maximize the job opportunities for PWDs.\nHe said that educational and training institutes should be encouraged to enroll PWDs, especially those with physical, visual or hearing disabilities without discrimination and stressed on availability of the trained teachers.\nHe said that approximately 10 percent out of total population of the country was of PWDs. He said that the issuance of Disability Cards by NADRA to PWDs was appreciable.\nWhile stressing the need for accurate date of persons with disabilities, he said that there should be more effective and comprehensive awareness campaigns so that the PWDs could come forward to register themselves and avail facilities.\nDr. Alvi also stressed on ensuring moveable ramps and availability of wheel chairs in different places including education institutions and other organizations.\nHe on the occasion sought suggestions and inputs from the participants of the dialogue to overcome the challenges being faced by the PWDs.\nThe President also lauded and appreciated the role of federal and provincial governments, representatives of WHO, NADRA and others, participated in the dialogue.\nEarlier, WHO Technical Advisor Disability Dr. Maryam Mallick said that the International Day of Persons with Disabilities was observed every year and theme of this year was ‘Transformative Solutions for Inclusive Development: The Role of Innovation in Fueling an Accessible and Equitable World.\nShe said that it was the third Dialogue of the series and such two programmes had already been held in Islamabad and Khyber-Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T15:57:08.155Z"
}
