{
  "title": "Funeral prayer of Begum Najma Hameed to be offered on Sunday",
  "link": "https://www.app.com.pk/national/funeral-prayer-of-begum-najma-hameed-to-be-offered-on-sunday/",
  "date_published": "2022-12-03T05:55:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 03 (APP): The funeral prayer of former president of Pakistan Muslim League (N) Women’s Wing, senior parliamentarian Begum Najma Hameed will be held on Sunday, December 4, after Zuhr prayer at her residence (877, F Block Satellite Town) in Rawalpindi.\nShe was the elder sister of the member National Assembly Tahira Aurangzeb , and aunt of Minister for Information and Broadcasting Marriyum Aurangzeb. Najma Hameed had passed away on the night of Friday.\nNajma Hameed’s Qul and congregational prayer will be held on Monday, (December 5) after Zuhr prayer at Siddique Shadi Hall Satellite Town, Rawalpindi.\nNajma Hameed was a political figure and the identity of the Pakistan Muslim League who was given the title of a born Muslim Leaguer. She remained associated with the Muslim League throughout her life.\nShe was closely associated with Pakistan Muslim League (N) leader Muhammad Nawaz Sharif and Begum Kulsoom Nawaz and supported him from the first day of Nawaz Sharif’s political journey.\nWith clear principled and ideological commitment and thinking, she fought democratic and political struggles as a Muslim Leaguer all her life.\nDuring the arrest of Muhammad Nawaz Sharif and the political struggle of Begum Kulsoom Nawaz during the reign of Pervez Musharraf, she was right hand of Kulsoom Nawaz and one of prominent leaders. Begum Najma Hameed’s house in Rawalpindi remained a political stronghold of the Muslim League-Nawaz and Begum Kulsoom remained under house arrest at her residence.\nBegum Najma Hameed remained a member of the Senate twice. She also had the honour of being the president of the women’s wing of the party for the longest time. Since her resignation in 2011, the post has remained vacant and the party has not appointed anyone else as the president of the women’s wing.",
  "retrievedAt": "2025-08-11T15:57:14.960Z"
}
