{
  "title": "‘We must address internal fault line to maintain improved image’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: As Pakistan has emerged a confident nation after the recent battle with India, sustaining this confidence in global politics now depends on addressing domestic fault lines, including economic, educational and other internal issues such as corruption, ethnic and sectarian divisions, political instability and judicial weaknesses.\n\nThis was the concerted view of speakers at a seminar on ’India-Pakistan War: Global Responses and Domestic Fault Lines“, organised by the Pakistan Institute of International Affairs (PIIA) in its library here on Saturday.\n\nDefence and foreign relations experts said that following the Indian attack last month, Pakistan’s armed forces had proven their strength, united the entire nation and boosted the country’s’ confidence on international level. However, they added that the country is struggling with deep-rooted internal issues that threaten its stability, unity, long-term development and global image.\n\nFormer Defence Secretary Lt Gen (retd) Naeem Khalid Lodhi said that when India launched the attack, Pakistan’s deterrence had initially failed but the country reestablished it by downing five Indian Air Force jets and multiple Israel-made drones in a befitting response.\n\nExperts highlight unresolved internal issues after triumph in recent Indo-Pakistan battle\n\nIndians denied the losses and tried very hard to make the world believe in their narrative, but the world saw that they were only lying, Gen Lodhi said, adding that following the clash, Pakistan has emerged as a confident country globally and that it must sustain this confidence in the years to come.\n\n![ .](https://www.dawn.com/news/19105090\n\nHowever, despite being a nuclear power, Pakistan’s image and its role in international politics have not been noteworthy, mainly because of the country’s economic instability and certain other issues, he said.\n\nGen Lodhi added that the armed forces alone cannot make a nation stronger unless the internal fault lines, such as corruption, judicial weaknesses, weak economy, educational crisis and ethnic and sectarian divisions etc are fixed.\n\nIn response to a question about whether Pakistan should accept Donald Trump’s mediation on the Kashmir issue, he said the country should proceed with caution as the United States has traditionally been closer with India than with Pakistan. Instead, a better alternative to resolve the Kashmir dispute could be mediation through a consortium comprising the US, China and Russia, he suggested.\n\nAir Vice Marshal (retd) Dr Muhammad Abid Rao agreed that Pakistan needs to work on its domestic fault lines. And firstly, the issue of population growth needs to be tackled, but the country has not been paying any attention to it, particularly over the last 30 years. He said better management of resources is not possible when a population explosion takes place. Poverty caused by it also leads to many crises, such as poor law and order and unemployment.\n\nApart from that, the country needs to improve its education system, which is in a poor state, he said. “There is no unified syllabus, cheating takes place in exams, and the quality of education is very different in English and Urdu medium schools and the madressah system,” he said. He lamented that merit and justice, which are pillars of society, are not strong in the country.\n\nDr Rao also said that religion has always been misused by political, as well as religious entities. “And this affects our foreign policy,” he believed.\n\nAmbassador Syed Hasan Habib said India would continue to malign Pakistan as it has been doing for long. He spoke on the issue of Indus Water Treaty being held in abeyance by India, and said that legally, India cannot block Pakistan’s water. He stressed that the country needs to work on its agriculture sector as well as water management.\n\n“The lesson we have learnt in all this conflict is that rivals must talk,” Mr Habib said, stressing that only diplomacy and dialogue could lead to a better outcome for both the countries.\n\nEarlier, PIIA chairperson Masuma Hasan also spoke.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:22:57.921Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918836/we-must-address-internal-fault-line-to-maintain-improved-image",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T01:38:38.000Z"
}
