{
  "title": "Analysis: Pakistan’s ‘bizarre’ omission from Reuters report - Newspaper - DAWN.COM",
  "author": null,
  "content": "Pakistan, where press freedom has perpetually remained under curbs and the media landscape faces multiple challenges, has once again been excluded from the Reuters Institute for the Study of Journalism’s (RISJ) annual report — a North Star for insights on the state of the media industry.\n\nThe Digital News Report by RSIJ, a research centre at the University of Oxford, sheds light on trends in global digital news media and offers the most comprehensive snapshot of how news is consumed, trusted, paid for and shaped by technology globally.\n\nThe latest report, published last week, included data from six continents and 48 markets.\n\nThe 14th report found that the dependence on social media and video platforms is growing and that in some countries, influencers are playing a significant role in shaping debates.\n\nExperts say challenges like media curbs, lack of innovation make it all more important for insight from nation to be studied\n\nIt revealed news podcasts are reaching more younger and better-educated users and that TikTok is the fastest-growing social and video network.\n\nAI chatbots have become a key source of news, and digital subscriptions remain a challenge for media businesses.\n\nPakistan’s exclusion\n\nSince the report’s inception, Pakistan has not been surveyed.\n\nAsad Baig, a media trainer and strategist, called Pakistan’s absence “bizarre”.\n\n“Pakistan has significant internet penetration. The kind of digital revenue being generated through ads and monetisation from Pakistani viewers is substantial,” said Mr Baig, who is also the founder of Media Matters for Democracy.\n\n“Social media is one of the biggest sources of news in this report, and Pakistan is actively grappling with that right now. It would’ve been incredibly useful to include Pakistan in the demographics.”\n\nMr Baig stressed the population size, internet users and engagement rates make Pakistan “a major player” in the global media landscape.\n\nIn her foreword for the report, Mitali Mukherjee, the RISJ director, noted the institute’s focus remained on countries with high internet penetration since responses for the report were collected through online polling.\n\n“By every metric, we meet the criteria. This research would be invaluable to us. I’m quite disappointed,” Mr Baig pointed out.\n\nDigital rights activist and lawyer Nighat Dad also rued Pakistan’s absence from the report.\n\nShe said the exclusion coincided with “rising geopolitical tensions and shifting digital news dynamics, especially with the growing role of influencers and YouTubers”.\n\nJournalist Shahzeb Jillani said Pakistan’s inclusion as a market is vital given the country’s media landscape.\n\nMr Jilani, who is also the director of the Centre for Excellence in Journalism in Karachi, pointed out that business models of media houses are heavily reliant on government ads and “still prioritise TV news over other platforms… [even when] public disconnect with TV news growing”.\n\n“Media organisations are quietly adapting AI tools, ostensibly for job cuts and efficiency. And yet, there has hardly been any industry-wide conversation about ethical or problematic use of AI in our newsrooms,” he said.\n\nResponding to questions sent by Dawn via email, Ms Mukherjee said countries are included in the report based on “financial support from partners” there.\n\n“We are always looking at ways to improve and increase our reach, particularly in a region as important as South Asia,” she told Dawn.\n\nWhen asked who takes the initiative to include a market in the survey, Ms Mukherjee said the first step would be to assess the feasibility of conducting an online survey in a particular country and the second would be to connect with industry stakeholders and funders.\n\nShe also noted that Serbia has been included in the 2025 report for the first time, thanks to a new sponsor, which highlights the need for a sponsor from Pakistan if the country were to be included in the survey.\n\nLack of meaningful research\n\nJahanzaib Haque, the chief digital officer and editor of Nukta, pointed out that Pakistan is a challenging market for institutions like RISJ to do research, as the country “overall doesn’t invest in research or data transparency”.\n\nHe said there was a lack of researchers who could conduct such a study. “[E]ven if one tries, it will be hard to get meaningful results because the media is not transparent.”\n\n“The conglomerates are reactive, politically motivated and just lack transparency. I can see why Reuters would find it hard to get a partner here,” he added.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:22:59.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918905/analysis-pakistans-bizarre-omission-from-reuters-report",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T03:16:54.000Z"
}
