{
  "title": "4 drown, 1 missing as boat capsizes in Swat - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two women and as many children drowned while another child remained missing after a boat carrying tourists capsized in the Shahi Bagh lake in Kalam area of Khyber Pakhtunkhwa’s Swat, rescue officials said on Sunday.\n\nRescue 1122 North Region Spokesperson Shafiqa Gul told Dawn.com that the boat capsized yesterday evening due to strong winds and rain in the tourist attraction of Shahi Bagh lake.\n\n“The bodies of the two women were retrieved from the lake and transported to the Kalam hospital,” the spokesperson said earlier today.\n\nLater, Rescue 1122 Spokesperson Bilal Faizi said the bodies of two children were recovered from the lake. “Efforts to locate a third missing child are still underway,” he said.\n\nThe bodies of the two children — aged three and five — were taken to Matta and onwards to Sakhakot, Faizi added.\n\nFive others had been rescued earlier and were in “stable condition”, according to Gul. “They have been taken to Mata hospital and are undergoing treatment.”\n\nGul had said the rescue operation to retrieve the bodies involved rescue divers and was being monitored by the local administration of the Bahrain tehsil.\n\nMeanwhile, two girls drowned and another went missing in the Indus River at tehsil Kindar Kotka in Hazara division’s Torghar division, rescue officials said.\n\nRescue 1122 Torghar teams, along with local volunteers, reached the scene on the instructions of District Emergency Officer Hayatullah.\n\nThe victims included 15-year-old Emaan and 20-year-old Amina. The body of Amina was found at Satana in the Haripur district, while a search operation was ongoing to locate the other missing girl.\n\nIn another incident, five people were killed and three others were injured when two groups opened fire in Hadri Mamand Khel of district Bannu, rescue officials said.\n\nMuhammad Usama, Bannu Rescue 1122 spokesperson, said rescue teams took timely action and administered first aid to the injured after reaching the scene, and transported the bodies to the District Headquarters Hospital for legal formalities.\n\nAdditional input from Zahid Imdad",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2218390548b03cc.jpg",
  "retrievedAt": "2025-08-20T04:22:57.110Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919030/4-drown-1-missing-as-boat-capsizes-in-swat",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T09:36:13.000Z"
}
