{
  "title": "Six security men martyred in attacks across Balochistan, KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Six terrorists killed in police operations\n• Bodies of four men, including two soldiers, found in Mardan\n\nPESHAWAR / QUETTA: Six security personnel were martyred and as many terrorists gunned down in attacks and operations across Khyber Pakht­unkhwa and Balochistan, officials confirmed on Saturday.\n\nMeanwhile, the bodies of four men, including two army personnel, were found in Mardan.\n\nIn Swabi, two police personnel were martyred on Friday midnight when unidentified motorcyclists opened fire, according to Swabi District Police Officer Azhar Khan.\n\nThe martyred policemen were on duty in the Gadoon Amazai Industrial Estate police station and had stopped to drink water at a hotel when two assailants on motorcycles opened fire.\n\nVideos shared on social media showed the cops, Zahid Khan and Jamaluddin from Gadoon Amazai region, sitting on chairs when the attackers opened fire.\n\nTheir funerals were held at Shahmansoor Police Lines.\n\nMardan Regional Police Officer Najeebur Rehman, DPO Khan, SP Investigation Iftikhar Ali Khan, DSPs, SHOs, Swabi deputy commissioner and victims’ families attended the funeral.\n\nThe RPO and DPO paid tribute to the martyred cops and said they stood with the bereaved families in this hour of grief.\n\nPolice launched a search operation in the area to arrest the attackers. No arrests have been made yet.\n\nBodies found\n\nPolice have recovered four bodies in the mountainous Babuzai area of Katlang tehsil of Mardan.\n\nA preliminary investigation conducted by the police and Counter Terrorism Department (CTD) revealed the four men were “killed by militants led by Commander Abdul Hameed Hamasi”.\n\nAccording to the police, locals spotted the bodies and informed the police, who arrived at the scene and moved the bodies to a hospital.\n\nOne of the victims was identified as Hammad Ghafoor, son of Raham Ghafoor, a resident of Babuzai and owner of a crushing plant.\n\nAccording to sources, he was abducted by unknown persons four days ago.\n\nThe second victim was identified as Zubair Afridi, son of Fazal Akbar and a resident of Bara. He was the head of Aman Lashkar.\n\nThe other two victims were in the army. Their names have been withheld as official confirmation is awaited.\n\nAccording to police, the victims were killed two to three days ago.\n\nThe funeral of Mr Ghafoor was held in his native village, while the funeral prayers of the other victims were held in Nowshera.\n\nAccording to the district police spokesperson, a search operation has been launched and a case was registered with the CTD.\n\nSix alleged terrorists have been nominated in the FIR, including Qasim, Usman, Umar Sadiq, Zahid Khan, Muhammad Umar Khan and Mudasir.\n\n‘Terrorist commander’ killed\n\nIn D.I. Khan, an alleged terrorist commander, affiliated with the banned Tehreek-i-Taliban Pakistan Gandapur faction, was killed by police.\n\nAccording to the local police spokesman, Yaqub Zulqarnain, the exchange of fire took place when terrorists ambushed a police team returning from Takwara.\n\nThe cops repulsed the attack and managed to gun down the terrorist commander, who was later identified as Fatah.\n\nDistrict Police Officer Sajjad Ahmad Sahibzada and Sadar SP later led a search operation to apprehend the remaining suspects.\n\nKhyber Pakhtunkhwa IG Zulfiqar Hameed lauded the D.I. Khan police for their action. He also announced commendations and rewards for the personnel.\n\nBalochistan clashes\n\nIn Balochistan, four security personnel, including a senior CTD officer, were martyred in attacks and operations against terrorists.\n\nIn a bomb attack in Mongochar area of Kalat, two personnel of the Frontier Corps were martyred and four were injured.\n\nOfficials said a bomb disposal team was sweeping the area near Sheikh Haji post to clear landmines when an improvised explosive device, planted in the area, was remotely detonated, a senior official confirmed.\n\nIn a separate attack in Kalat, a CTD officer was gunned down by unknown armed men.\n\nThe victim, identified as Sub-Inspector Fida Ahmed, was targeted near his home.\n\nIn another firing incident in Mastung, unknown armed men gunned down two persons, including a police official.\n\nThe victims were identified as Shakeel Ahmed Bangulzai and Adnan Ahmed Dehwar.\n\nLevies station attacked\n\nOfficials said a group of armed men attacked a Levies station in Kirdgab area of Mastung late on Saturday night.\n\nThe attackers managed to overcome the Levies’ personnel after a heavy exchange of fire.\n\nThe armed men damaged official vehicles and looted weapons before escaping towards nearby mountains.\n\nUnknown armed men also attacked the house of the Khuzdar district council chairman Salahuddin Zehri late on Friday night.\n\nThey hurled hand grenades at the house, damaging its walls.\n\nMr Zehri, who belonged to PPP, was not at home at the time of the attack. No casualties have been reported.\n\nA roadside bomb blast also took place in Gandawah, Jhal Magsi on Saturday. No casualties were reported in the attack.\n\nMeanwhile, a CTD spokesman confirmed five terrorists belonging to a banned outfit were killed in Qila Abdullah on Saturday.\n\nThe CTD, after receiving intelligence reports about the presence of wanted terrorists, launched an operation in the Jungle Piralizai area, the spokesman said.\n\nAfter a heavy gun battle, five terrorists were killed. The spokesperson claimed arms, ammunition and maps of sensitive installations were recovered from the terrorists’ hideout.\n\nThe terrorists were allegedly involved in attacks on security forces.\n\nMuhammad Jamal Hoti in Mardan, Ali Jan Magsi in Nasirabad, Abdul Wahid Shahwani in Khuzdar and Saleem Shahid also contributed to this report\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:42:44.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918910/six-security-men-martyred-in-attacks-across-balochistan-kp",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T03:24:14.000Z"
}
