{
  "title": "First Congo virus case of the year reported in Wah - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: After Attock, Crimean-Congo Hemorrhagic Fever (CCHF) has now emerged in Wah, with three suspected cases—one confirmed—reported from Model Town, Wah Cantt, Taxila.\n\nAccording to sources in the health department, the confirmed patient is 38-year-old, a tailor by profession, who slaughtered four goats and two cows on Eidul Azha along with two others.\n\nSources said the patient, who tested positive, is currently in stable condition and has been isolated in the Intensive Care Unit (ICU) of a hospital.\n\nHe is the first confirmed CCHF case reported in Rawalpindi this year.\n\nDeputy District Health Officer Dr Shahzad Rasool confirmed that the patient was admitted to the hospital on June 17, 2025, after showing symptoms, beginning on June 15, including high-grade fever, body aches, gum bleeding and hematemesis.\n\nLab results revealed a white blood cell count of 1,910, a platelet count of 4,100 and infiltrates in the chest X-ray.\n\nHe added that another man has been isolated at Holy Family Hospital, while his aide is under isolation at Wah General Hospital. Their blood samples have been sent to the National Institute of Health (NIH) for PCR testing and results are awaited.\n\nIn response to a question, Dr Shahzad said 18 other identified contacts of the patients remain asymptomatic but are under quarantine for fever surveillance.\n\n“A joint response by the health and livestock departments was launched immediately after the confirmation of one positive case,” he said, adding that measures include indoor residual spraying (IRS) and vector surveillance in the affected areas to curb potential spread.\n\nHFH Medical Superintendent Dr Ijaz Butt told Dawn that the blood samples of the doctors, nurses and attendants were sent to NIH.\n\nHe said that we gave medication as per SOPs of health department.\n\nOn the other hand, District Health Authority spokesman said that the work started to test the contacts of the patient.\n\n“All necessary barrier nursing controls are meticulously implemented for these cases.\n\nThe remaining 18 identified contacts are currently asymptomatic and are under quarantine for fever surveillance,“ he said.\n\n“A joint case response was done with the livestock department for indoor residual spraying (IRS) and vector surveillance in the affected areas,” he said.\n\nHe said that total screenings of six suspects done. “One case from Rawalpindi tested negative.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:23:11.574Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918778/first-congo-virus-case-of-the-year-reported-in-wah",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T01:38:52.000Z"
}
