{
  "title": "Dollar shortage spurs exchange rate volatility - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: A growing shortage of dollars in the interbank market has unsettled the exchange rate, prompting banks to offer higher-than-official rates to attract remittances, while importers are forced to pay a premium for greenbacks.\n\nDespite healthy inflows, the recent geopolitical shocks — including the Iran-Israel conflict and a brief four-day skirmish between Pakistan and India — have shaken confidence in the rupee’s stability. The uncertainty has increased pressure on both the interbank and open markets.\n\n“Banks are offering higher rates to remitters while quoting even steeper prices to importers,” said Faisal Mamsa, CEO of Tresmark. “Importers have been paying Rs2-3 more per dollar than the official interbank rate.”\n\nOn Friday, the interbank market closed at Rs283.70 per dollar, its highest since December 2023. However, importers were being quoted at Rs284.25-284.50, while the open market rate hovered around Rs285.70. Some banks are offering Rs3-4 above the standard rate to remitters, reflecting the strain in dollar availability.\n\nRupee under pressure as importers pay premium for dollars\n\nZafar Paracha, Secretary General of the Exchange Companies Association of Pakistan, stated that there is no shortage in the open market, with the dollar trading at Rs285.70 on Saturday. However, he noted that the rupee’s performance against other major currencies has weakened. For instance, while international exchange companies paid Rs392.78 for a British Pound, local exchange firms were selling it at Rs380.\n\nMamsa added that the US dollar itself has weakened globally, slipping to around 98 against a basket of major international currencies.\n\nExporters, anticipating further rupee depreciation, are reportedly holding back on converting their proceeds, further tightening dollar supply. “This is compounded by concerns that the Iran-Israel conflict could escalate into a prolonged crisis,” said currency analysts.\n\nDespite the market’s nervousness, experts believe the government is unlikely to allow significant depreciation due to its inflationary and political impact. They expect the rupee to stabilise near Rs285 in the coming month.\n\nMeanwhile, the State Bank of Pakistan is actively purchasing dollars from the market to meet reserve targets ahead of the next IMF review. Pakistan anticipates $3.4bn in inflows over the next few months, which would raise the country’s reserves above $20bn. Traders estimate the market is short by $300-400m to achieve comfortable liquidity.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:23:24.979Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918865/dollar-shortage-spurs-exchange-rate-volatility",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T01:38:20.000Z"
}
