{
  "title": "SC bars FBR from making arrests before liability assessment - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Rules initiation of criminal proceedings unlawful without investigative audit and show-cause notice\n• Says taxes should be imposed reasonably and without discrimination\n\nISLAMABAD: The Supreme Court on Saturday barred the Federal Board of Revenue (FBR) from arresting or initiating criminal prosecution to recover tax due from defaulters without prior determination of their tax liability.\n\n“We have no hesitation to conclude that without investigative audit or issuance of show-cause notice or providing opportunity to explain the matters, registration of FIR, initiation of criminal proceeding and arrest of registered person is without jurisdiction and lawful authority,” observed Justice Aqeel Ahmed Abbasi in a judgement he authored.\n\nJustice Abbasi was a member of a three-judge SC bench, which was seized with a number of appeals against judgements of Lahore, Sindh and Islamabad high courts.\n\nThe controversy at hand revolves around determining the legality of pre-trial steps including arrest and detention of individuals pursuant to registration of FIR on the charges of tax fraud as well as ascertaining the legal scope and application of Section 37A of the Sales Tax Act, 1990.\n\nSince the LHC judgement was the first on the relevant legal issues, the SC decided to examine the facts giving rise to filing of a large number of petitions before the high court involving criminal prosecution for alleged offence of tax fraud against 134 persons along with other beneficiaries.\n\nIn its order the LHC had held that unless the sales tax liability of taxpayers was determined in accordance with Section 11 of the act, these penal provisions cannot be invoked, therefore, the criminal proceedings initiated by the sales tax department, the registration of FIRs and arrest made pursuant to FIRs, was illegal and without lawful authority. Accordingly, the same were quashed for being unconstitutional, violative of fundamental rights, and ultra vires to the act.\n\nThe facts involved in the LHC judgement suggested unearthing of a cartel by the additional director, Intelligence and Investigation (FBR), Regional Office, Lahore consisting of fraudsters involved in the issuance of fake sales tax invoices for the purposes of generating illegal/inadmissible input tax adjustments.\n\nAccordingly, criminal prosecution was initiated against some persons, which further led to unearthing of a mega scam of sales tax evasion of Rs7.5 billion involving 144 dummy suppliers and fake sales tax invoices.\n\nThe March 26, 2011 FIR suggested that this gang of fraudsters issued fake invoices to various registered persons who claimed input tax on the basis of the same causing a huge loss to the exchequer.\n\nThe SC judgement explained that the act does not authorise tax officials to presume any tax liability in the absence of assessment proceedings and to proceed against a registered person or any person within the supply chain.\n\nThe judgement explained that under the democratic system of government, run by the elected representatives of the people, unbridled powers and authority to impose tax arbitrarily, without having any rationale or reason was now being regulated under constitutional restraints, whereby taxes were to be imposed reasonably, without discrimination and in such a manner that those may not encroach upon the fundamental rights of a person as guaranteed under the Constitution.\n\nThe art of taxation is regarded as the art of plucking a goose so as to gather the largest amount of feathers by causing least squealing, the judgement explained.\n\nBefore invoking or adopting coercive measures for the recovery of tax amount due, the judgement contended, determination of tax liability through process of assessment or adjudication has to precede before initiating criminal proceedings, which otherwise depend upon wilful default, mens rea and commission of an offence of tax fraud with an intent to cause loss of tax involved or due.\n\nWithout determination of sales tax liability and the amount of tax allegedly evaded or short paid, through process of assessment/adjudication, recourse to initiation of criminal proceedings on the allegation of tax fraud, including registration of FIR and arrest of a registered person or any person within the supply chain, amounted to pre-empting the assessment of tax liability.\n\nWhereas, in the absence of lawful demand of sales tax pursuant to assessment of tax due, the penal provisions including Section 33 read with Sections 37A and 37B cannot be invoked.\n\nTherefore, the penal provisions including registration of FIR and arrest of any person on the above allegations is without jurisdiction and lawful authority, the judgement said while allowing the petition.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:23:26.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918884/sc-bars-fbr-from-making-arrests-before-liability-assessment",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T01:38:14.000Z"
}
