{
  "title": "Sindh opposition stays unimpressed as seven ministers present their performance - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Key members of the provincial cabinet on Saturday defended the Sindh government’s performance and achievements during the sixth day of the post-budget discussion in the provincial assembly and highlighted efforts to bring development and progress to the province.\n\nAs many as seven ministers were among nine lawmakers who spoke on the provincial government’s financial plan for 2025-26. They dismissed the opposition members’ criticism of the budget and asked them to fairly acknowledge the development work carried out in Karachi.\n\nOpening the budget debate, Health Minister Dr Azra Pechuho said the provincial government was striving to provide the best public health facilities to the people. She said that there were 19 chest pain units in Karachi and Rs1.12 billion had been allocated in the budget for CT scan and MRI machines.\n\n“An agreement has been signed with Aga Khan University to improve ICUs in government hospitals,” she added.\n\nMQM terms spending billions on Karimabad underpass ‘unnecessary’ as Sindh PA continues debate on budget\n\nDr Pechuho said that the maternal mortality rate had decreased in the province due to the government’s efforts, adding that 90 per cent of the immunisation target had been met.\n\nShe mentioned that there were 21 ongoing schemes of the health department in Karachi.\n\nThe health minister, who also gave a presentation in the House on the department’s performance during the previous financial year, spoke at length about health-related facilities in rural areas as well.\n\nIrrigation Minister Jam Khan Shoro said that had opposition members read the budget book first, they would not have protested over it. He lauded the chief minister for successfully defending Sindh’s case on the canals and water issue in the Council of Common Interests.\n\nThe minister expressed regret over the “unjustified accusations and criticism” by the opposition against the PPP.\n\nHe said that a gate of the Sukkur Barrage was installed within just six days. “So far, we have replaced sixteen gates of the barrage,” he said, adding that efforts were underway to solve the issue of water delivery to the right bank.\n\nMuttahida Qaumi Movement-Pakistan member Iftikhar Alam said the provincial government should stop treating Karachi like a stepchild. He said billions of rupees had been spent on the Karimabad underpass, which was unnecessary, and that no consultation was held regarding its construction.\n\nHe suggested that, just as provinces receive NFC Awards from the federation, districts should also be allocated funds using a similar formula.\n\nPresenting details of the education department’s allocations and expenditure, Education Minister Syed Sardar Shah said over 20,000 schools were damaged in the floods, and the provincial government had been reconstructing and rehabilitating the affected infrastructure on an emergency basis.\n\nHe rejected the Economic Survey of Pakistan report quoted by opposition members regarding the number of out-of-school children in the province.\n\nThe minister argued that the data in the survey was collected during the coronavirus pandemic and did not reflect the current figures.\n\nHe claimed it was incorrect to claim that 7.8 million children were out of school and clarified that the actual number was 6.2 million.\n\nMr Shah said that funds had been allocated for the renovation and repair of 155 colleges in Karachi, and two new colleges would be established in the city this year.\n\nHome Minister Zia-ul-Hassan Lanjar, who also holds the portfolio of law and parliamentary affairs, said there had been a significant reduction in crimes, including street robberies.\n\nLater, the Sindh Assembly session was adjourned until 9:30 am on Monday.\n\nResolution\n\nAmid the opposition’s boycott, the House adopted a resolution with a majority vote to pay tribute to Benazir Bhutto on her birthday.\n\nMQM-P members strongly protested when Acting Speaker Anthony Naveed allowed PPP’s Nisar Ahmed to table the resolution.\n\nThe protesting members said that they had been told by the CM that no resolution could be tabled during the budget discussion as per assembly laws when the opposition wanted to bring a resolution.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:23:12.720Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918839/sindh-opposition-stays-unimpressed-as-seven-ministers-present-their-performance",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T01:38:38.000Z"
}
