{
  "title": "PSX slides 1.7pc amid Middle East tensions - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) concluded a turbulent week on a bearish note, as geopolitical tensions — particularly in the Middle East — dampened investor confidence and triggered widespread profit-taking.\n\nDespite a positive start following the State Bank of Pakistan’s (SBP) Monetary Policy Statement (MPS), which met expectations by keeping the policy rate unchanged at 11pc, the KSE-100 index closed the week down 2,120 points, or 1.7pc, at 120,023.\n\nAccording to Arif Habib Ltd, the market sentiment quickly shifted to caution amid escalating regional conflict, overshadowing stable macroeconomic indicators and robust auction results. The SBP held a special 22-day Treasury Bill auction for the first time, raising Rs916bn against a target of Rs900bn. Additionally, Rs557bn was raised in a Pakistan Investment Bond (PIB) auction, surpassing the Rs300bn target, with total participation of Rs1.2tr. Cut-off yields ranged between 11.39pc and 12.70pc, reflecting mixed investor expectations on interest rate trends.\n\nThe SBP reported a current account deficit of $103m for May, improving significantly from $235m in the same month last year. Foreign exchange reserves rose by $46m to $11.7bn, while the rupee depreciated by Rs0.74 week-on-week, settling at 283.70 against the US dollar.\n\nInvestor sentiment falters as geopolitical risks eclipse economic stability\n\nSectoral performance reflected investor risk aversion, with the power sector dragging the index down by 652 points, followed by cement (475 points), fertiliser (193 points), pharmaceuticals (144 points), and oil and gas exploration (144 points). On the upside, the banking sector contributed 234 points, supported by gains in United Bank (107 points), Bank Al-Habib (90 points), and Habib Bank (72 points). Other positive contributors included oil and gas marketing (15 points), textiles (14 points), and insurance (9 points).\n\nNegative scrip-wise movers included Packages Ltd (566 points), Lucky Cement (-242 points), Fauji Fertiliser (114 points), Mari Petroleum (91 points), and Pakistan Petroleum Ltd (88 points). Among gainers, Oil and Gas Development Company and Systems Ltd each added 60 points.\n\nForeign investors recorded net buying of $0.46m, a reversal from last week’s net selling of $7.43m. Foreign inflows were largely concentrated in cement ($1.6m) and exploration and production ($1.0m). Locally, mutual funds and insurance companies remained net sellers, offloading $16m and $2.9m, respectively, while individuals absorbed the pressure with net buying of $15.6m.\n\nAverage daily trading volume fell 9.4pc week-on-week to 821.9m shares, while traded value plunged 40.4pc to $78.4m, signalling waning market participation amid heightened uncertainty.\n\nBroader economic indicators showed mixed trends. Large-scale manufacturing output rose 2.3pc year-on-year in April, while the real effective exchange rate (REER) fell to 97.8—the lowest since September 2023. Net foreign direct investment (FDI) in May stood at $194m, while repatriation of profits and dividends reached $264m. Pakistan’s trade deficit was recorded at $2.6bn during the month. Banking sector deposits and advances increased by 11.6pc and 7.0pc year-on-year, respectively, with the advance-to-deposit ratio at 39.8pc and the investment-to-deposit ratio at 105.7pc.\n\nOther major developments included a 19pc year-on-year increase in IT exports, reaching $3.5bn during the first 11 months of FY25, and a significant jump in urea and DAP sales by 5pc and 135pc, respectively, in May. The government also unveiled the National Electric Vehicle Policy and a draft tariff policy for 2025–30.\n\nSector-wise, woollen (up 18.3pc), jute (14.5pc), modarabas (6.7pc), close-end mutual funds (4.7pc), and transport (2.0pc) were among the top performers. In contrast, power (-10.2pc), engineering (-5.2pc), investment companies (-5.1pc), glass and ceramics (-3.5pc), and tobacco (-3.5pc) were the worst-hit sectors.\n\nOutlook\n\nAccording to AHL, market sentiment will continue to be shaped by geopolitical developments, particularly in the Middle East. Any signs of de-escalation could serve as a catalyst for recovery. The KSE-100 currently trades at a forward price-to-earning ratio of 6.4x for 2025, well below its 10-year average of 8.0x, and offers a dividend yield of 8.4pc, compared to the 10-year average of 6.5pc.\n\nAKD Securities echoed a cautious short-term view, citing continued investor anxiety over the Iran-Israel conflict. However, it projected a medium-term recovery, with the KSE-100 expected to reach 165,215 points by December 2025. The forecast is supported by strong earnings in fertilisers, a sustained return on equity in banks, and improving cash flows in exploration and marketing companies amid easing interest rates.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:23:15.920Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918860/psx-slides-17pc-amid-middle-east-tensions",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T01:38:20.000Z"
}
