{
  "title": "BUDGET 2025-26: Amid cash crunch, Senate panel proposes tax cuts, salary hikes - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Standing committee recommends 50pc raise in govt employees’ pay, 20pc increase in pension\n• Tax exemptions sought for individuals earning Rs1.2m annually\n\nISLAMABAD: As the government struggles to balance its revenue and expenses, the Senate Standing Committee on Finance and Revenue has recommended a 50 per cent increase in government employees’ salaries, raise in pensions, removal of import duties on solar panels and a significant cut in levies on small vehicles.\n\nThe committee, chaired by Senator Saleem Mandviwalla, has put forward more than 200 recommendations, including 48 general proposals, 133 changes to the Finance Bill 2025 and 21 related to the Public Sector Development Programmes.\n\nThe recommendations were presented in the upper house on Saturday and subsequently forwarded to the National Assembly for consideration. The recommendations only have an advisory value and the government is not bound to follow them.\n\nRecommendations\n\nThe Senate committee has proposed a 50pc salary increase for government employees, instead of 10 pc, proposed in the budget.\n\nThe panel also recommended a 20pc inc­r­e­­ase in pensions for retired employees, aga­inst the government-proposed hike of 7pc.\n\nAdditionally, the minimum monthly wage has been proposed to be increased from the existing Rs37,000 to Rs50,000, and doubling the Employees’ Old-Age Benefits Institution pension to Rs23,000 from its current of Rs11,500.\n\nThe committee also recommended the im­­­mediate regularisation of all daily wage workers, emphasising the need for job security.\n\nThe committee has further recommended income tax exemption to salaried individuals earning up to Rs1.2 million annually.\n\nThe government has proposed a 1pc tax rate on income from Rs600,000 to Rs1.2m.\n\nThe Senate panel has recommended abolishing the 18pc sales tax on solar panels to promote renewable energy adoption and reduce costs for consumers.\n\nAdditionally, it rejected the government’s proposed carbon levy, suggesting that it instead be restructured as a tax.\n\nThe distinction would allow provinces to get a share of tax revenue. In contrast, the federal government gets to keep 100pc of the levies collected on goods.\n\nReduced duty on cars\n\nAccording to the parliamentary committee’s recommendations, the sales tax on vehicles under 850cc should be reduced from 18 to 10pc.\n\nAdditionally, a 10pc tax has been proposed on agricultural income exceeding Rs5 million annually and imposing the tax on landholdings exceeding 12.5 acres.\n\nThe committee also suggested waiving the circular debt surcharge on monthly electricity consumption of up to 200 units, no tax on stationery items and cutting the sales tax on homoeopathic medicines from 18pc to 1pc.\n\nIt was recommended to eliminate the 3pc additional tax on grand chicken, introduce sales tax on dyes and chemicals under the Export Facilitation Scheme, reduce the excise duty on beverages and juices by 15pc and remove the 2pc income and sales tax on online purchases.\n\nThe committee proposed a wide array of fiscal and structural reforms, including a 15pc reduction in the Federal Excise Duty (FED) on the formal juice industry and equalising tax rates for both property buyers and sellers.\n\nIt recommended fixing the withholding tax between 1.2pc and 2pc for the construction sector and increasing the monthly conveyance allowance for disabled workers from Rs6,000 to Rs10,000.\n\nA 50pc reduction was recommended across indirect taxes such as GST, customs duty and sales tax to alleviate the financial burden on consumers.\n\nAdditionally, the committee urged the withdrawal of tax exemptions for the elite class to ensure a fairer taxation structure.\n\nThe committee called for an end to the designation of construction contractors as withholding agents and proposed allowing up to 40pc of contract values to be transac­t­­ed in cash without additional requirements.\n\nIt was recommended that essential commodities, such as flour, pulses, and medicines, be exempted from GST entirely.\n\nThe committee also called for increasing the Higher Education Commission’s grant to Rs80 billion and reducing the sales tax on local and imported tractors to 5pc.\n\nAnother key recommendation called for placing surplus cash reserves of public entities under the administrative control of the Finance Division, ensuring their effective deployment for public welfare initiatives and improved macroeconomic management.\n\nThe committee also urged the government to extend concessional withholding tax rates to print media.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:42:01.163Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918904/budget-2025-26-amid-cash-crunch-senate-panel-proposes-tax-cuts-salary-hikes",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T03:15:08.000Z"
}
