{
  "title": "Sarfraz Bugti condemns murder of ex-Balochistan CM’s son in Khuzdar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Balochistan Chief Minister Mir Sarfraz Bugti on Sunday condemned the murder of Mir Attaur Rehman Mengal, the son of former Balochistan chief minister Naseer Mengal, in an armed clash when gunmen opened fire in district Khuzdar’s Wadh.\n\nAtta Mengal was the brother of Mir Shafiqur Rehman Mengal, a prominent tribal leader and head of the Jhalawan Awami Panel, a political party.\n\nDawn.com has reached out to the police for a comment on the alleged murder.\n\nBugti condemned the “cowardly terrorist attack” and expressed his heartfelt grief and sorrow over the killing of the younger Mengal.\n\n“He prayed for the bereaved family and expressed his best wishes for the speedy recovery of the injured grandson,” a statement from his office read.\n\nBugti assured that the provincial government will conduct a thorough investigation into the incident and vowed that the terrorists will be brought to justice.\n\n“The people and government of Balochistan stand in solidarity against terrorism,” he added.\n\nAtta Mengal was killed while his son Mir Matiur Rehman Mengal was injured, after an ambush by terrorists allegedly belonging to the proscribed Balochistan Liberation Army (BLA), said a statement by Jhalawan Awami Panel spokesperson Nadeemur Rehman Baloch.\n\nThe spokesperson said Naseer Mengal’s family had “made countless sacrifices for the survival of Pakistan”.\n\nIn March, two leaders of JUI-F Balochistan were killed in the Zehri area of Khuzdar district, according to officials.\n\nThe JUI-F leaders, Wa­­dera Ghulam Sarwar and Molvi Amanullah, were on their way home in the Tarsani area of Zehri when unknown assailants riding motorcycles opened fire on them with automatic weapons.\n\nBoth died on the spot after being shot multiple times.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:22:54.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1919099/sarfraz-bugti-condemns-murder-of-ex-balochistan-cms-son-in-khuzdar",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T16:33:43.000Z"
}
