{
  "title": "Bombing Iran, Trump gambles on force over diplomacy - World - DAWN.COM",
  "author": null,
  "content": "For nearly half a century, the United States has squabbled with Iran, but the conflict has largely been left in the shadows, with US policymakers believing, often reluctantly, that diplomacy was preferable.\n\nWith President Donald Trump’s order of strikes on Iran’s nuclear sites, the United States — like Israel, which encouraged him — has brought the conflict into the open, and the consequences may not be clear for some time to come.\n\n“We will only know if it succeeded if we can get through the next three to five years without the Iranian regime acquiring nuclear weapons, which they now have compelling reasons to want,” said Kenneth Pollack, a former CIA analyst and supporter of the 2003 Iraq war who is now vice president for policy at the Middle East Institute.\n\nUS intelligence had not concluded that Iran was building a nuclear bomb, with Tehran’s sensitive atomic work largely seen as a means of leverage, and Iran can be presumed to have taken precautions in anticipation of strikes.\n\nTrita Parsi, an outspoken critic of military action, said Trump “has now made it more likely that Iran will be a nuclear weapons state in the next five to 10 years.”\n\n“We should be careful not to confuse tactical success with strategic success,” said Parsi, executive vice president of the Quincy Institute for Responsible Statecraft.\n\n“The Iraq war was also successful in the first few weeks, but President Bush’s declaration of ‘Mission Accomplished’ did not age well,” he said.\n\nYet Trump’s attack — a week after Israel began a major military campaign —came as the Iranian state is at one of its weakest points since the 1979 Islamic revolution toppled the shah.\n\nSince the October 7, 2023 attack on Israel by Hamas, Tel Aviv — besides obliterating much of Gaza and being accused of genocide — has decimated Lebanon’s Hezbollah, a militant group that would once reliably strike Israel.\n\nIran’s main ally among Arab leaders, Syria’s Bashar al-Assad, was also toppled in December.\n\nSupporters of Trump’s strike argued that diplomacy was not working, with Iran standing firm on its right to enrich uranium.\n\n“Contrary to what some will say in the days to come, the US administration did not rush to war. In fact, it gave diplomacy a real chance,” said Ted Deutch, a former Democratic congressman who now heads the American Jewish Committee.\n\n“The murderous Iranian regime refused to make a deal,” he claimed.\n\nTop Senate Republican John Thune pointed to Tehran’s threats to Israel and language against the United States and said that the state had “rejected all diplomatic pathways to peace.”\n\nIsrael possesses around 90 nuclear warheads, according to the US-based Centre for Nuclear Arms Control and Non-Proliferation. There are multiple United Nations (UN) resolutions concerning Israel’s nuclear arsenal, including UN General Assembly Resolution 41/93 (1986) , which urged Tel Aviv to renounce its weapons and place its facilities under International Atomic Energy Agency (IAEA) safeguards.\n\nTrump’s attack comes almost exactly a decade after former president Barack Obama sealed a deal in which Iran drastically scaled back its nuclear work —which Trump pulled out of in 2018 after coming into office for his first term.\n\nMost of Trump’s Republican Party and Israeli Prime Minister Benjamin Netanyahu, who has long seen Iran as an existential threat, attacked Obama’s deal because it allowed Tehran to enrich uranium at levels well beneath weapons grade and the key clauses had an end date.\n\nBut Trump, billing himself as a peacemaker, just a month ago said on a visit to Gulf Arab monarchies that he was hopeful for a new deal with Iran, and his administration was preparing new talks when Netanyahu attacked Iran.\n\nThis prompted an abrupt U-turn from Trump.\n\n“Trump’s decision to cut short his own efforts for diplomacy will also make it much harder to get a deal in the medium and long runs,” said Jennifer Kavanagh, director of military analysis at Defense Priorities, which advocates restraint.\n\n“Iran now has no incentive to trust Trump’s word or to believe that striking a compromise will advance Iran’s interests.”\n\nKarim Sadjadpour, a senior fellow at the Carnegie Endowment for International Peace, wrote on social media that Trump’s strikes could either entrench the Islamic Republic or hasten its downfall.\n\n“The US bombing of Iran’s nuclear facilities is an unprecedented event that may prove to be transformational for Iran, the Middle East, US foreign policy, global non-proliferation and potentially even the global order,” he said.\n\n“Its impact will be measured for decades to come.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:22:57.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918979/bombing-iran-trump-gambles-on-force-over-diplomacy",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T07:56:22.000Z"
}
