{
  "title": "Budget 2025-26: Curbs placed on FBR’s arrest powers, assures Aurangzeb - Business - DAWN.COM",
  "author": null,
  "content": "• Income tax for Rs50,000-Rs100,000 monthly salaries cut to 1pc\n• Solar panel import tax slashed from 18pc to 10pc\n• Opposition criticises lack of transparency on Senate finance committee report\n• Shibli Faraz says economy running unsustainably on loans\n\nISLAMABAD: Under fire from parliamentarians and business leaders over a clause allowing tax officers to detain suspected evaders, Finance Minister Muha­mmad Aurangzeb told the Senate on Saturday that more safeguards have been added to the law to prevent misuse of authority.\n\nSpeaking during the Senate debate on the Finance Bill 2025, Mr Aurangzeb said that detailed consultations were held with Senators Saleem Mand­viwalla and Farooq H. Naek, resulting in clearer and more balanced provisions, which will be shared during his upcoming speech in the National Assembly.\n\nThe rollback follows strong push-back from business lobbies and both parliamentary committees, which argued that the original clause — allowing officers to detain suspects without external approval — would lead to harassment.\n\nFor instance, in a letter to the finance minister earlier this week, the Overseas Investors Chamber of Commerce and Industry (OICCI) voiced serious concerns over proposed amendments in the Finance Bill 2025-26 related to Section 37AA of the Sales Tax Act, 1990.\n\nThe chamber criticised the proposal for granting sweeping arrest and prosecution powers without proper checks and balances, warning that such measures could enable misuse of authority and lead to harassment of businesses.\n\nTurning to relief measures, Mr Aurangzeb informed the Senate that income tax on individuals earning between Rs50,000 and Rs100,000 per month will be reduced to one per cent from the previously proposed 2.5pc.\n\n“This symbolic and practical step shows the state does not want to overburden this segment,” he said, expressing hope that the measure would increase disposable income and rebuild trust in the taxation system.\n\nThe minister also confirmed that the proposed 18pc tax on imported solar panels, aimed at supporting local manufacturers, has been lowered to 10pc. The tax will apply only to the 46pc of solar panel parts that are imported, which he said would result in a modest 4.6pc increase in prices.\n\nMr Aurangzeb condemned reports of hoarding and profiteering ahead of the tax’s implementation, warning that legal action would be taken against those stockpiling imported panels to exploit consumers.\n\nHe insisted that the government had demonstrated “seriousness and flexibility” in light of the discussions in both houses of parliament and the suggestions by lawmakers. Relief and social protection measures in the budget reflected the government’s sense of responsibility, he said, highlighting an increase in the Benazir Income Support Programme’s budget from Rs592 billion to Rs716bn.\n\nHe expressed the government’s commitment to take the country towards inclusive and sustainable economic growth, where everyone gets equal opportunities to make progress.\n\nRegarding overall federal expenditure, the minister noted it would rise by only 1.9pc in the next fiscal year, compared to increases of 10pc to 12pc in previous years.\n\nHe hoped that, like the previous year, over 50pc of the recommendations of the Senate Standing Committee of Finance would be included in the final budget.\n\n‘Economy being run on loans’\n\nHowever, at the start of the proceedings, Leader of the Opposition Syed Shibli Faraz criticised the government for failing to share the committee’s final report, questioning how members could claim ownership of recommendations they had not seen.\n\n“We have no idea how many of the recommendations we gave were included in the report,” he said.\n\nHe argued that the committee’s chair should come from the opposition to ensure proper oversight and lamented that the budget had imposed a heavier tax burden without cutting government spending.\n\n“The economy is being run on loans, which is unsustainable,” he said. “The budget lacks vision, relies entirely on borrowing, proposes no new revenue streams and has no clear plan to reduce poverty.”\n\nPTI parliamentary leader Senator Ali Zafar called for adhering to Article 73 of the Constitution. He was of the view that under the spirit of the Constitution, the recommendations of the Finance Committee should be shared with members at least a day in advance, so that they could thoroughly examine them before the stage of adoption of the report by the House.\n\nHe pointed out that presently, this article was not followed and the members were not given a report of the committee before the sitting. “The responsibility under the article should be fulfilled as the Senate can only give recommendations for which its relevant committee does the exercise, but it can’t approve them. These are to be adopted by the House,” he said.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:23:00.733Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918913/budget-2025-26-curbs-placed-on-fbrs-arrest-powers-assures-aurangzeb",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T03:33:30.000Z"
}
