{
  "title": "Israeli strikes kill 12 in Gaza as aid access remains deadly - World - DAWN.COM",
  "author": null,
  "content": "• Health ministry reports 450 killed while seeking aid since late May\n• Erdogan says UNRWA to open office in Turkiye\n\nGAZA CITY: Gaza’s civil defence agency said Israeli fire killed at least 12 people on Saturday, including eight who had gathered near aid distribution sites in the Palestinian territory suffering severe food shortages.\n\nCivil defence spokesman Mahmud Bassal told AFP that three people were killed by gunfire from Israeli forces while waiting to collect aid in the southern Gaza Strip.\n\nIn a separate incident, Bassal said five people were killed in a central area known as the Netzarim corridor, where thousands of Palestinians have gathered daily in the hope of receiving food rations.\n\nThe Israeli army told AFP it was “looking into” both incidents, which according to the civil defence agency occurred near distribution centres run by the US- and Israel-backed Gaza Humanitarian Foundation.\n\nThe health ministry in the Hamas-run territory said on Saturday that 450 people had been killed and 3,466 others injured while seeking aid in near-daily incidents since late May.\n\nThe Israeli blockade imposed in early March amid an impasse in truce negotiations had produced famine-like conditions across Gaza, according to rights groups.\n\nIsrael’s military has pressed its operations across Gaza more than 20 months since an unprecedented Hamas attack triggered the devastating war, and even as attention has shifted to the war with Iran since June 13.\n\nBassal told AFP that three people were killed on Saturday in an Israeli air strike on Gaza City in the north, and one more in another strike on the southern city of Khan Yunis.\n\nIsraeli forces also demolished more than 10 houses in Gaza City “by detonating them with explosives”, he added.\n\nUNRWA office in Turkiye\n\nPresident Tayyip Erdogan said on Saturday the United Nations’ Palestinian refugee agency UNRWA will open an office in Ankara, urging Muslim countries to give the agency more support after Israel banned it.\n\nIsrael last year banned UNRWA, saying it had employed members of Palestinian militant group Hamas who took part in the October 2023 attacks on Israel that triggered the Gaza war. Turkey has called Israel’s assault on Gaza genocide and its move to ban UNRWA a violation of international law, particularly amid worsening humanitarian conditions in Gaza, which has been reduced to rubble with millions displaced.\n\nAddressing foreign ministers of the Organisation of Islamic Cooperation in Istanbul, Erdogan said opening an Ankara UNRWA office would deepen Turkey’s support for the agency.\n\n“We must not allow UNRWA, which plays an irreplaceable role in terms of taking care of Pal­estinian refugees, to be paralysed by Israel. We expect our organisation and each member state to provide financial and moral support to UNRWA to thwart Israel’s games,” Erdogan said.\n\nAccording to Reuters, a Turkish diplomatic source said Foreign Minister Hakan Fidan and UNRWA chief Philippe Lazzarini were expected to sign an accord on the sidelines of the OIC meeting in Istanbul on establishing the office.\n\nTurkey has given UNRWA $10 million a year between 2023 and 2025. In 2024, it also transferred $2m and sent another $3m from its AFAD disaster management authority.\n\nPublished in Dawn, June 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6857748814877.jpg",
  "retrievedAt": "2025-10-12T03:41:46.297Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918901/israeli-strikes-kill-12-in-gaza-as-aid-access-remains-deadly",
  "dateList": "2025-06-22",
  "date_published": "2025-06-22T03:10:37.000Z"
}
