{
  "title": "2,333 Indian LoC violations in 2020 with 18 civilians martyred, 185 injured: ISPR DG",
  "link": "https://www.app.com.pk/national/2333-indian-loc-violations-in-2020-with-18-civilians-martyred-185-injured-ispr-dg/",
  "date_published": "2020-09-24T14:00:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Sep 24 (APP):Armed Forces Spokesman Major General Babar Iftikhar Thursday told foreign diplomats that there had been some 2,333 Indian ceasefire violations (CFVs) and unprovoked firing incidents across the Line of Control (LOC) during 2020 leaving 18 civilians martyred, 185 injured.\nInter Services Public Relations (ISPR) Director General and the Armed Forces Spokesman was briefing the delegation, including diplomats, attachés and representatives from Azerbaijan, Bosnia and Herzegovina, the European Union, Portugal, Saudi Arabia, South Africa, Turkey, Greece, Australia, Iran, Iraq, the United Kingdom, Poland, Uzbekistan, Germany, Switzerland, France, Egypt, Libya, Yemen and Afghanistan, as well as representatives from the United Nations World Food Program, during their visit to the LOC, according to an ISPR press release.\nHe said the Indian Army was deliberately targeting the civilian population with heavy weapons, which was a violation of international law whereas the Pakistan Army being a professional army only targeted the military posts.\nMajor General Babar said India was firing indiscriminately on the civilian population to increase provocation in an attempt to divert the global attention from the oppression in the Illegally Indian Occupied Jammu and Kashmir (IIOJK).\nIndia, he added, was committing grave human rights violations in the IIOJK and had increased ceasefire violations on the LOC since 2014.\nThe ISPR DG noted that India used cluster ammunition on innocent civilians in the Neelum Valley on July 30 and 31. International bodies, especially the United Nations Human Rights Commission (UNHCR), had highlighted Indian oppression in their various reports.\nMajor General Babar said the Kashmir issue needed to be resolved in accordance with the United Nations resolutions.\nPakistan, he said, had always welcomed the visit of the United Nations Military Observer Group for Pakistan and India, international media, and diplomats to any area of the LOC and provided them access to the local population to assess the ground situation themselves.\nHe highlighted that, on the contrary, India had never given access to anyone to visit the LOC. Even the UN military observer group was not allowed by India to visit the IIOJK or across the LOC areas. India had detained journalists and members of the international media for covering the situation in the IIOJK, he added.\nThe diplomats took stock of the violations of the ceasefire agreement by the Indian Army on the Line of Control. The delegation also met the victims affected due to Indian firing.",
  "retrievedAt": "2025-08-11T19:50:03.030Z"
}
