{
  "title": "Parliamentary panel for removing bottlenecks in CPEC SEZs",
  "link": "https://www.app.com.pk/national/parliamentary-panel-for-removing-bottlenecks-in-cpec-sezs/",
  "date_published": "2020-09-24T07:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP): Parliamentary Committee on CPEC Thursday directed the ministries concerned to remove all bottlenecks in the way of Special Economic Zones (SEZs) being established across the country under China Pakistan Economic Corridor (CPEC).\nThe meeting of the committee was held here under the Chairmanship of Sher Ali Arbab.\nThe committee was briefed by Board of Investment (BoI), Power and Petroleum Divisions regarding provision of Gas and Electricity to three Early Harvest Economic Zones-Rashakai, M-3 Industrial Estate Faisalabad and Dhabeji, Sindh.\nThe Chairman directed the ministries concerned to resolve this issue at the earliest because success of CPEC depends heavily on industrialization in these economic zones. “If these areas lack basic services for establishing industries, we will not be able to woo the business community to come and invest,” the Chairman said.\nThe committee directed the management of the SEZs to sit with the concerned authorities to sort out the issues and submit the timelines in a week time.\nThe default on timelines would not be tolerated anymore. The committee taking cognizance of the issues remarked if any legislation is needed to remove the bottlenecks this option could be exercised to make CPEC a success story.\nBoard of Investment was directed to consult with Federal Board of Revenue (FBR) for implementation of same tax regime as envisaged in the SEZs Act.\nSecretary, Railways also briefed the committee on the scope of project ML-1. Its approved cost is US$ 6.806 billion.\nThis project has been sub-divided into three packages and completion period is 8.5 years. It includes upgradation and doubling of main line-1 (ML-1) from Karachi to Peshawar (1733 KM) and Havelian Dry Port, rehabilitation and construction of bridges, provision of modern signaling and telecom systems and conversion of level crossings into underpasses/flyovers.\nEstablishment of Dry Port near Havelian and up-gradation of Walton Training Academy are components of this project.\nThe Committee directed the Ministry to look into the option of electric locomotives instead of diesel because modern Railway systems in the world have switched over to electric engines for their high speed and being environment friendly.\nPeshawar to Torkham Railway line may be made part of this project because it will enhance the connectivity upto Central Asian States.\nThe meeting was attended by MNAs Noor Alam Khan, Sadaqat Ali Khan Abbasi, Umar Aslam Khan, Nafeesa Inayatullah Khan Khattak, Sardar Ayaz Sadiq, Murtaza Javed Abbasi, Mehnaz Akber Aziz, Raza Rabani Khar, Zahid Akram Durrani.",
  "retrievedAt": "2025-08-11T19:50:09.581Z"
}
