{
  "title": "Pakistan Navy observes World Maritime Day",
  "link": "https://www.app.com.pk/national/pakistan-navy-observes-world-maritime-day/",
  "date_published": "2020-09-24T10:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):Pakistan Navy observes World Maritime Day (WMD) 2020 in harmonization with International Maritime Organization (IMO).\nWorld Maritime Day was being observed internationally during last week of September every year under the auspices of IMO, said a Pakistan Navy press release.\nThe theme adopted by IMO for this year’s World Maritime Day was ‘Sustainable Shipping for Sustainable Planet’.\nChief of the Naval Staff, Admiral Zafar Mahmood Abbasi in his message on World Maritime Day said that Pakistan Navy pledges full support towards development of maritime sector and reaffirms its resolve for eradication of marine pollution for clean and green environment. He said that shipping provides dependable connectivity and most economical means of transporting goods as International economies are overwhelmingly dependent on shipping activity which carries nearly 90 percent of global trade.\nThe Naval Chief also emphasized that sea trade is the backbone of our economy as CPEC and Gwadar Port are set in motion, maritime activities in Pakistan are bound to increase manifold and there is a growing realization to capitalize on the associated economic opportunities.\nThe Naval Chief also valued that declaration of 2020 as ‘The Year of Blue Economy’ by the GoP is a step in the right direction.\nThe Admiral also reiterated that Pakistan Navy is fulfilling its core responsibility of seaward defence of the country and enhancing regional maritime security through continuous constructive engagements with international partners and by undertaking Regional Maritime Security Patrols.\nCoastal Security & Harbour Defence Force comprising a network of coastal security stations and a state of the art Joint Maritime Information & Coordination Centre are working round the clock to ensure maritime security, maritime vigilance to respond any emerging situation all along our coast.\nBeing a major stakeholder in maritime domain, Pakistan Navy is leading the way to create maritime awareness in the country and promote Blue Economy.\nPakistan Navy is laying special focus on reducing maritime pollution and promoting safe and sustainable use of sea resources.\nPakistan Navy has also planted over 5 million mangrove saplings during the last three years along the coastal areas of Sindh and Balochistan to help protect maritime ecosystems.\nEvents like World Maritime Day play an important role in enhancing maritime awareness in the country.\nOn the occasion of World Maritime Day 2020, Pakistan Navy undertook a range of activities to underscore the importance of maritime sector. These included conduct of a webinar by National Institute of Maritime Affairs (NIMA) highlighting objective of IMO and importance of shipping being the backbone of the maritime industry, its impact on economy and global environment and its prospects for Pakistan.\nPakistan Navy Field Commands conducted various events at school/ colleges and at unit level to create awareness about importance of maritime sector.",
  "retrievedAt": "2025-08-11T19:50:03.798Z"
}
