{
  "title": "President for effective measures to make educational institutions safe, secure from drug abuse",
  "link": "https://www.app.com.pk/national/president-for-effective-measures-to-make-educational-institutions-safe-secure-from-drug-abuse/",
  "date_published": "2020-09-24T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):President Dr Arif Alvi on Thursday said the prevalence of drugs in the society, particularly in educational institutions, was a major source of concern and underscored the need for taking effective measures by the federal and provincial governments and the relevant agencies to make the institutions safe and secure from drug abuse.\nHe expressed these views while chairing a meeting on drug challenges in the educational institutions here at the Aiwan-e-Sadr, a press release issued by the President’s Media Office said.\nThe meeting was briefed by the Ministry of Narcotics Control about the prevalence of drugs in the country and its adverse impact on the young generation. The ministry highlighted the measures taken for prevention of drugs in the country.\nThe provincial governors and the Azad Jammu & Kashmir (AJK) president apprised the meeting about the challenge of drug abuse and suggested measures to eradicate it.\nThe meeting was attended by AJK President Masood Khan, Federal Minister for Narcotics Control Senator Muhammad Azam Khan Swati, Minister of State for Narcotics Control Shehryar Afridi, all the provincial governors, including Gilgit Baltistan Governor Raja Jalal Hussain Maqpoon, Special Assistant to the PM on National Health Services Dr Faisal Sultan and Anti-Narcotics Force (ANF) Director General Maj Gen Muhammad Arif Malik.\nPresident Alvi stressed upon the governors, who are also the chancellors of universities, to take the lead role in addressing the alarming challenge of drug addiction so as to save the young generation from the menace of drugs.\nHe urged the Ulema and media to play their role in creating awareness about the impacts of drug addiction.\nThe meeting emphasized the need for making coordinated efforts by the federal and provincial governments, and agencies concerned to tackle the menace of drug trafficking.\nIt also underscored the need to further strengthen the existing anti-narcotics laws with the consensus of federal and provincial governments. It was agreed to convene a meeting of all the vice chancellors of the country to devise a strategy to make the educational institutions free from all social evils, particularly the drug abuse.",
  "retrievedAt": "2025-08-11T19:50:16.833Z"
}
