{
  "title": "Federal Govt wants early ROW for laying 17-km pipeline to meet gas shortage in Karachi: Omar Ayub",
  "link": "https://www.app.com.pk/national/federal-govt-wants-early-row-for-laying-17-km-pipeline-to-meet-gas-shortage-in-karachi-omar-ayub/",
  "date_published": "2020-09-24T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):Minister for Energy Omar Ayub Khan on Thursday said the Federal Government wanted the Right of Way (ROW) for laying a 17-kilometer pipeline at the earliest to meet gas shortage being faced in the capital of Sindh – Karachi.\nAddressing a news conference along with Special Assistant to the Prime Minister (SAPM) on Petroleum Nadeem Babar here, he said the Federal Government had been requesting the Sindh Government for the last one-and-a-half years to give the Sui Southern Gas Company (SSGC) the ROW for a 30-inch dia pipeline to supply 150 MMCFD Liquefied Natural Gas (LNG) from Port Qasim to Pakland distribution network, which was still awaited.\n“We need the ROW of at the earliest to ensure improved supply of gas to Karachi in winter.”\nUnfortunately, the minister said, there was not significant discovery of gas during last several years due to failed policies of the previous governments of Pakistan Muslim League-Nawaz and the Pakistan Peoples Party. He said gas consumption had significantly increased in the country, while the existing gas reservoirs were depleting at a ratio of 7.5 percent annually.\nIn the given scenario, he said, the government was importing LNG to bridge the gap between demand and supply of the commodity.\nCurrently, he said, the Sindh province was facing shortage of 250 Million Cubic Feet per Day (MMCFD) gas, which would be met through the increased import and supply of LNG.\nOmar Ayub said there was over Rs 250 billion circular debt related to the gas sector.\nThe minister said the government had always given top priority to the domestic consumers in supplying the gas even during the peak winter season with readjustment in supplies of other sectors.\nSAPM Nadeem Babar said last year around 1120-1150 MMCFD gas was being supplied to Sindh during those days, which had declined to 960-70 MMCFD gas.\nSince last June, he said, around 100 MMCFD LNG was being supplied to K-Electric and the Federal Government could also provide more LNG to the province for which the 17-km pipeline was needed.\nAt present, the SAPM said two existing LNG terminals were regasifying around 1200 MMCFD gas that could be taken to 1300-1350 MMCFD to meet the increased commodity demand in winter to some extent.\nHe said there was not gas shortage in the network of Sui Southern Gas Pipelines Limited as its consumers requirement was being met through LNG on regular basis, but the consumers in Sindh wanted natural gas.\nNadeem Babar said the Federal Government was making all-out efforts to increase exploration and production activities in the country, for which a tender for award of around 20 new oil and gas exploration blocks would be floated in next month.",
  "retrievedAt": "2025-08-11T19:50:06.632Z"
}
