{
  "title": "Asad for visa, trade facilitation to boost Pak-Afghan trade ties",
  "link": "https://www.app.com.pk/national/asad-for-visa-trade-facilitation-to-boost-pak-afghan-trade-ties/",
  "date_published": "2020-09-24T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):National Assembly (NA) Speaker Asad Qaiser Thursday said the proposed changes in visa policy and according concessions for Afghan traders would improve people-to-people contacts and economic activities on both sides.\nHe made these remarks during his meeting with Acting Ambassador of Afghanistan Rahimullah Qatra.\nRecommendations of the task forces of Pak-Afghan Parliamentary Friendship Group aimed at boosting ties between two countries.\nIn a statement, he said recommendations had been finalized and sent to the government for implementation.\nThe Speaker said the task force deliberated on a spectrum of issues affecting trade and people to people contact between Pakistan and Afghanistan.\nHe said both the countries were not only neighbors but also intertwined in religious, cultural and historic bonds.\nEngagement between political hierarchy and parliamentarians from either side had further strengthened the existing relations.\nAsad said commitment and understanding between both the nations had foiled foreign attempts to create misunderstandings between both the countries.\nHe said a peaceful Afghanistan was in the best interest of the region and the world. It was also encouraging to see the positive developments on the Afghan peace process, he added.\nAfghan Acting Ambassador Rahimullah Qatra thanked Asad Qaiser for his kind remarks and said both the nations had increased affinity which had been growing with each passing day.\nHe praised the role of Speaker in taking the lead role in visa and trade facilitation and resolution of contentious issues.\nRahimullah Qatra said Afghanistan attached immense importance to its relations with Pakistan, adding: “Its efforts for bringing peace in Afghanistan are commendable.”\nHe said extending trade and cooperation in diverse sectors would be beneficial for both the countries.\nThe envoy also praised the role of Parliamentary Friendship Groups in augmentation of existing cordial relations between Pakistan and Afghanistan.",
  "retrievedAt": "2025-08-11T19:50:03.007Z"
}
