{
  "title": "President for value addition, diversification in industrial, agricultural products to boost exports",
  "link": "https://www.app.com.pk/national/president-for-value-addition-diversification-in-industrial-agricultural-products-to-boost-exports-2/",
  "date_published": "2020-09-24T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):President Dr Arif Alvi on Thursday stressed the need of value addition and diversification in industrial and agricultural goods and products, besides exploration of new destinations to help boost the country’s exports and getting its true share in the international market.\nHe was addressing the 8th Federation of Pakistan Chambers of Commerce and Industry (FPCCI) Achievement Awards ceremony here at a local hotel.\nThe president said the country’s industrialists and traders should focus on value addition and diversification through knowledge, skills and expertise, and experiences of developed countries.\nHe said Pakistan’s products such as sports and surgical goods were rebranded by various companies through some value addition or other efforts in the world to earn extra profits. “Why we cannot do it and earn more money,” he remarked.\nSimilarly, the president said Pakistan’s major crops included rice, wheat, cotton, sugarcane and maize. There was also a need of value addition and diversification in the agricultural sector to boost economy.\nHe said other than the traditional markets, Pakistan was also required to explore non-traditional markets for its exports, including Africa, Central Asia and South America, which had been ignored in the past.\nPresident Alvi said the government would ensure the ease of doing business and provide all possible facilities to the traders and industrialists.\nSpeaking about the COVID-19 pandemic, he said with the grace of Allah Almighty, Pakistan had been very successful in tackling the coronavirus through its strategy of smart-lockdown, which had also been acknowledged at international level.\nThe president said it was also due the government’s policy of taking care of the poor and disbursing Rs 1.2 trillion despite economic constraints that Allah Almighty blessed the county with success against the coronavirus.\nHe said the government also provided Rs 100 billion for refunds to the business community and Rs 50 billion for Small and Medium Enterprises (SMEs) to keep the wheel of economy running during the COVID-19 pandemic.\nPresident Alvi said the Pakistan Stock Exchange also touched 40,000 points during the COVID-19, which reflected the confidence of investors in the government’s economic policies and the economy.\nHe also underlined the importance of the country’s image in boosting trade and exports with other countries and said whenever Pakistan‘s ambassadors meet him, he urged them to work for image building and explore trade opportunities for Pakistan in the countries of their posting.\nThe president on the occasion also distributed achievement awards among representatives of various companies.",
  "retrievedAt": "2025-08-11T19:50:03.003Z"
}
