{
  "title": "Ehsaas delivers emergency cash to 15 mln families in 10 days of lockdown",
  "link": "https://www.app.com.pk/national/ehsaas-delivers-emergency-cash-to-15-mln-families-in-10-days-of-lockdown/",
  "date_published": "2020-09-24T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar Thursday said the government distributed a billion dollars as emergency cash to over 15 million families in 10 days of lockdown which was unprecedented.\nShe was speaking at a special event titled, ‘Poverty at a crossroad: using leadership and the Multidimensional Poverty Index (MPI)’ at this year’s United Nations General Assembly (UNGA) in New York to address the use of MPI and leadership to build back better as poverty reduction was currently at a crossroad.\nThe event was co-hosted by Karla Rubilar, Minister Social Development and Families, Chile and Dr Sania Nishtar, Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Pakistan.\nThis is the largest programme in Pakistan’s history, delivered end-to-end, digitally in the most difficult of circumstances.\n“Ehsaas, has taught us that it is possible to make quantum changes in the delivery capability of governments but it required bold policy, good data, and an unwavering commitment to integrity and transparency in delivery as well as the whole of government mobilization that has been the cornerstone of our poverty alleviating work.”\nDr Sania Nishtar paid rich tribute to the OPHI and the Multidimensional Poverty Peer Network not only for their thought leadership in introducing a new metric for measuring poverty but also for their efforts to institutionalize its adoption.\nShe said COVID-19 was threatening to wipe out the development gains of the last century and in doing so it was also reversing three decades of gains in poverty eradication.\n“Today we have a power to make decisions to reverse decades of neglecting past progress and provide social protection to the mission of families lacking it”, she said.\nShe said, “History shows that disasters and their tragic consequences have the tendency to catalyse the broader based social change so now we have a chance to work for poverty dedication and let’s not waste this chance”.\nDr Nishtar also highlighted that the special focus was being laid on the health and education sectors through Ehsaas’ different initiatives.\nThis high-level event was virtually convened on behalf of the Multidimensional Poverty Peer Network (MPPN.org), a South-South network of senior officials from 60 national governments and 20 international institutions that champions the use of multidimensional poverty measures alongside monetary measures at both the national and global levels.\nThe event brought together expertise and policy influence from heads of six states- Prime Minister of Pakistan Imran Khan, President of Chile Sebastian Piñera, President of Afghanistan Ashraf Ghani, President of Costa Rica Carlos Alvarado Quesada, President of Honduras Juan Orlando Hernández and Prime Minister of Nepal KP Sharma Oli.\nThe demonstrated commitment was convened at the event to address the multidimensional effects of the COVID-19 pandemic on the lives of people living in multidimensional poverty.\nGlobal leaders from six countries brought a rich poverty perspective to the table and discussed innovative uses of MPIs as a policy tools during the crisis to drive efficiency, targeting, and coordination for the response agenda.\nAlongside, the scheduled ministerial and institutional panel with 11 experts provided an engaging venue to the global community of leaders and innovative thinkers for collaboration aimed at tackling poverty.\nThe discussion made a collective call for collaboration to turn the corner on poverty during this tragic pandemic and recession, by creatively redefining policies that were implemented aiming to reduce poverty in all its dimensions.",
  "retrievedAt": "2025-08-11T19:50:06.600Z"
}
