{
  "title": "Railways completes ten rehabilitation projects in two years",
  "link": "https://www.app.com.pk/national/railways-completes-ten-rehabilitation-projects-in-two-years/",
  "date_published": "2020-09-24T08:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 24 (APP):Pakistan Railways completed as many as ten rehabilitation and development projects worth Rs 27,435.6 million during the last two years.\nThese projects include doubling of track from Khanewal to Raiwind-246 kilometers with a cost of Rs 14,261 million, an official in the ministry said on Thursday.\nThe other projects included mechanization of track maintenance (pilot project), rehabilitation of rolling stock and track, reopening of rail car from Kohat-Rawalpindi-Kohat section, up gradation of VHF communication system for operational staff, rehabilitation/procurement of re-manufactured 300 traction motors and others, he added.\nHe said Pakistan Railways, through special initiatives and projects, managed to generate an additional revenue of Rs 10 billion that helped in reducing its annual deficit by Rs 4 billion and an absorption of Rs 6 billion additional bill in respect of increasing cost of the fuel as well as of pay and pension bill.\nDuring financial year 2018-2019, he said earning of the department stood at Rs 54.59 billion compared to Rs 49.50 billion for financial year 2017-18 which was the highest revenue ever achieved by the department.\nThe Annual deficit lowered from Rs 36.00 billion to Rs 32 billion.\nHe said the revenue target has been increased from Rs 53 billions to Rs 58 billion for the current year.\nUp-till December 31, last year Rs 27,967.195 million has been earned against the budgetary target of Rs 27,499.967 million for the period.\nRegarding the freight business, the earning was increased to Rs 10,285.466 million against target of Rs 10,039.970 million upto December-2019.\nPakistan Railways had added 24 new passenger trains in its train operations and all were refurbished locally at the department installations in Lahore and Islamabad.\nThe new trains attracted around 08 million new passengers and grabbing additional revenue of Rs 5 billion.\nThe department had increased the number of rail passengers to 70 million, traveling in one year by trains. The Pakistan Railways have increased its freight volume form 4 percent to 7percent by introducing special container goods trains, he added.\nHe said Pakistan Railways introduced live tracking system, provided free Wi-Fi facility at major stations as well as initiated establishment of state of the art command & control center at Lahore headquarters to bring safety, efficiency and improvement in its network. Over one million customers are availing free live tracking through their smart phones.\nThe official said that under the clean and green Pakistan campaign Pakistan Railways have planted 500,000 saplings.\nHe said the department had finalized track access policy and was in implementation phase which would lead to the capacity utilization of the existing network for enhancing the earning of Pakistan Railways.",
  "retrievedAt": "2025-08-11T19:50:09.324Z"
}
