{
  "title": "PIC directs DC ICT to make public IESSI’s record",
  "author": null,
  "content": "ISLAMABAD, Mar 25 (APP):The Pakistan Information Commission (PIC) has directed the Deputy Commissioner Islamabad to disclose key records of the Islamabad Employees Social Security Institution (IESSI), following an appeal filed by a citizen.\nThe information to be made public includes budget details, audit reports, employee records, the institution’s legal framework, registered workers, affiliated hospitals, and issued death grants.\nDespite repeated notices from the Commission, the Deputy Commissioner’s office failed to appear before the PIC on Tuesday to justify withholding the requested information. Notices were issued on December 26, 2024, January 14, 2025, and February 28, 2025, via registered post, but no response was received.\nThe final notice explicitly warned that ex parte proceedings would be conducted if no representation was made.\nFinding no justification for withholding the requested records, the Commission ruled that the information sought is of significant public interest and must be disclosed under the Right of Access to Information Act, 2017.\nThe appeal was decided ex parte, as the public body failed to provide any response.\nThe appellant had requested comprehensive data regarding IESSI, including budget allocations, third-party audit reports for the past three years, details of employees, contractual and permanent staff, legal status, and the registration of industrial and commercial workers within Islamabad Capital Territory (ICT).\nAdditional information sought includes financial transactions with hospitals, contracts with medical facilities, and records of death grants issued over the last three years.\nIn its order, the Commission instructed the Deputy Commissioner, who also heads IESSI, to furnish the required information to both the appellant and the PIC within 10 days.\nCopies of the order have been dispatched to the Deputy Commissioner and the Chief Commissioner Islamabad for compliance.\nThe directive reinforces the legal obligation of public bodies to ensure transparency and uphold citizens’ right to access information concerning public institutions and financial expenditures relating to their right and welfare.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:59:50.316Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pic-directs-dc-ict-to-make-public-iessis-record/",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T17:56:00.000Z"
}
