{
  "title": "Pakistan highly values its relations with Ethiopia: Gilani",
  "author": null,
  "content": "ISLAMABAD, Mar 25 (APP):Chairman Senate Syed Yousaf Raza Gilani has said that Pakistan highly values its relations with Ethiopia and desires to further expand bilateral ties in diverse sectors.\n“Pakistan and Ethiopia have a long history of working together on multilateral forums in support of international peace and stability” the Chairman expressed these views in a meeting with Jemal Beker Abdula Ambassador of Ethiopia.\nHe termed trade and economic relations crucial for bringing people of the two sides closer. He said that trade and business cooperation in diverse sectors can help in building lasting relations between Islamabad and Addis Ababa.\nHe said that a Special Investment Facilitation Council (SIFC) to bring all stakeholders on a single platform. SIFC promises a win-win paradigm for our brotherly and friendly countries through symbiotic projects.\nHe welcomed the direct flights between Karachi and Addis Ababa. He informed that NADRA has successfully launched projects in Nigeria, Sudan, Kenya and Somalia relating to the digitalization of Passports and National Identity documents and Ethiopia can also avail of the services.\nHe further thanked the Ethiopian Government for extending an online visa facility to Pakistani nationals to promote people-to-people exchanges.\nThe volume of bilateral trade, however, he said,  does not reflect the true potential of our two economies and both sides need to work together to make progress in economic and trade links. Pakistan is firmly committed to broadening cooperation with African countries in diverse fields, especially in trade, investment, and economic spheres, he observed.\nGilani said that Pakistan has been exporting medical and surgical equipment, pharmaceutical products, and medicines to Ethiopia which can be further enhanced.\nHe said that Pakistan is known for producing high-quality footballs that are frequently used in global soccer tournaments. Pakistan offers scholarships to Ethiopian students in various disciplines.\nHe further informed that Ethiopian diplomats have been receiving training at the Foreign Service Academy and we are ready to offer training courses to more Ethiopian diplomats.\nHe also considered the Defense Cooperation important as both countries are faced with identical challenges of terrorism and extremism. He said that such cooperation would further boost our defense ties.\nHe said that terrorism is a great threat. Pakistan has been a victim of terrorism, saying that, we lost Shaheed Mohtarma Benazir Bhutto was also the victim of terrorism.\nThe Chairman Senate also extended an invitation to his counterpart in the Ethiopian parliament to visit Pakistan as both countries have a history of high-level exchanges.\nGilani said that Zulfiqar Ali Bhutto Shaheed was the architect of Pakistan-Ethiopian bilateral relations as he first visited Ethiopia in 1972. He said that parliamentary exchanges play a pivotal role in promoting people-to-people contacts. He emphasized that parliamentary friendship groups in the respective parliaments can be highly beneficial in this regard.\nThe Ambassador of Ethiopia thanked the chairman Senate for his remarks. He said that Pakistan is an important country and we also desire to further deepen diversified ties.\nHe said that both countries have a shared history of cooperation at different levels. “ Our countries are cooperating at international levels and there is huge scope for further boosting cooperation in different sectors”, the Ambassador observed.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:00:43.581Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-highly-values-its-relations-with-ethiopia-gilani/",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T10:42:00.000Z"
}
