{
  "title": "Resignation to not annul SJC’s proceeding against judge: SC",
  "link": "https://www.app.com.pk/national/resignation-to-not-annul-sjcs-proceeding-against-judge-sc/",
  "date_published": "2024-02-21T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):The Supreme Court of Pakistan on Wednesday ruled that the resignation or retirement of a judge would not stop the underway proceeding of the Supreme Judicial Council (SJC) against him.\nThe court announced the verdict with the majority of 4/1 as Justice Hassan Azhar Rizvi gave disagreement.\nA five-member bench of the top court headed by Justice Amin ud Din Khan announced the verdict which was earlier reserved after hearing arguments from respondents in the intra court appeal (ICA).\nJustice Jamal Khan Mandokhail, Justice Syed Hasan Azhar Rizvi, Justice Musarrat Hilali and Justice Irfan Saadat Khan were also part of the bench.\nThe written order said, “For the reasons to be recorded later, the delay in filing both the appeals is condoned.\nBoth the appeals are partially allowed to the extent that if the proceedings have already been initiated by the Supreme Judicial Council (‘SJC’) against a Judge, same shall not abate on his resignation or retirement, as the case may be, during such proceedings.\nIt is the prerogative of the SJC to proceed with the matter accordingly. The impugned judgment is modified to that extent.\nThis order is with the majority of four by one disagreeing (Syed Hasan Azhar Rizvi, J.) on the point of limitation as well as on merits.”\nEarlier during hearing, Attorney General of Pakistan (AGP) Mansoor Usman Awan said that it was the provision of SJC to take action on a misconduct of a judge during his service.\nThe Judiciary used to play a role of mediation between government and people, he said, adding that the accountability was essential for the independence of judiciary as the judges used to be appointed against the constitutional slots of election commission, Shariat Court or tribunals after the retirements.\nThe AGP said that it was necessary that the SJC would give its opinion on the conduct of a judge as no other institution could take legal actions against judges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:51:29.128Z"
}
