{
  "title": "Pakistan needs innovative financing mechanisms to expedite its energy transition away from fossil fuels: Experts",
  "link": "https://www.app.com.pk/national/pakistan-needs-innovative-financing-mechanisms-to-expedite-its-energy-transition-away-from-fossil-fuels-experts/",
  "date_published": "2024-02-21T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):The experts at a public-private dialogue on Wednesday called for opting innovative financing mechanisms and technological transformation to upscale renewable energy resources for a just and clean energy transition in the country.\nThe dialogue titled: “Beginning of the End Transitioning away from Coal: Forging an Orderly, Equitable and Just Energy Transition in Pakistan”, was organized by Sustainable Development Policy Institute (SDPI) as part of its Clean Energy Transition Programme here. The aim of the dialogue was to share the preliminary findings of an ongoing SDPI study with the stakeholders.\nAli Nawaz, Director-General (Coal), Private Power and Infrastructure Board (PPIB), Ministry of Energy (Power Division) said that if we do a regional comparison, the coal power generation in Pakistan is way less than other regional countries.\n“The coal power projects brought a paradigm shift in the lives of local communities of Thar region through their corporate social responsibility initiatives,” he said.\nPakistan needs huge financing for early retirement of coal power plants, he said, adding that the coal contributed to the energy security of Pakistan and its early retirement would pose bigger challenges, especially since the coal fleet of Pakistan was young, highly efficient, high on merit, and had legal constraints.\nAsad Ullah, Specialist (Market Pricing & Simulations), Central Power Purchasing Agency (CPPA-G), pointed out that the energy access and affordability were the leading challenges in the country.\nHe said the cost of externalities such as environmental social footprint was not a part of the government’s planning, whereas there was a need to develop such financial models.\n“Environmental sustainability should be our priority that is now the future,” he said.\nHe maintained that the local coal resources were considered reliable, as they had limited effect on foreign exchange reserves and ensure the economic security of the country.\nEhtasham Khattak, Senior Project Officer of Asian Development Bank, said the objective was not only to transition away from coal but to transition towards the low carbon fuels.\n“It is incumbent upon the government to address concerns of the communities whose resources are being utilized for power generation,” he added.\nMichael Williamson, a representative of the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP), said the Clean Energy Transition was the toughest question faced by the regions and states along the Pacific region and beyond.\nHowever, he said, Pakistan had just begun its coal power projects’ journey, whereas no country could afford retiring an asset which is just a few years old.\n“The financial burden in retiring the 5,000 MW power plants should be compared with the investments in other energy projects to assess the financial burden of shutting down the asset,” he said.\nHe emphasized that Pakistan must invest in its massive renewable energy resources of wind and solar as the coal power stations would have to operate in a different environment in the future.\nHe suggested that power integration with neighbouring countries could help resolve the issue like Singapore imports renewable energy from its neighbours.\nZafar Mahmood, Director-General (Fuel) Energy Wing, Ministry of Planning Development & Special Initiatives, stressed the need to focus on its domestic energy resources.\n“We cannot afford an immediate retirement of coal power plants; it will gravely complicate the matter. We need a strategy for orderly retirement of coal power plants,” he added.\nDr Khalid Waleed, Senior Energy Expert, SDPI, in his detailed presentation, cited various solutions to shift from coal to Clean Credit Initiative.\nBasit Ghauri, Manager Research & Networks, Renewables First, said the country’s nationally determined contributions (NDCs) for shifting over renewables was already five times more than the global threshold making it a leading country in achieving the ambitious goal. However, it entailed a responsibility on the country to aggressively work on its goals pertaining to renewable energy solutions. “We need to realign our narrative as we have no more Chinese funding for coal power plants after President Xi’s moratorium on coal power plants,” he added.\nAqeel Jafri, Director Policy, PPIB said that the government is cautious about environment and it had three objectives that are accessibility, affordability, and security in energy sector. However, its goal is to decarbonize the country’s energy mix, he said, adding, “Coal power plants retirement is not an easy task and might be a huge financial burden on the government that will hit the sustainability and affordability part of the country’s policy.” “If we want to move away from coal then options are cross border energy trade. We need to have sustainable supplies and technically and economically feasible renewable energy options to reduce dependence on fossil fuels,” he suggested.\nAman Ullah Mangrio, Energy Finance Expert, said that the political and fiscal commitments are crucial for energy transition.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:51:52.498Z"
}
