{
  "title": "JazzCash assigned task of BISP fund disbursements",
  "link": "https://www.app.com.pk/national/jazzcash-assigned-task-of-bisp-fund-disbursements/",
  "date_published": "2024-02-21T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP):JazzCash, country’s leading fintech organisation, has been assigned the task for disbursements of  Benazir Income Support Program (BISP) aimed at empowering underserved communities, with a particular emphasis on women inclusion.\nJazzCash, as part of this partnership, will leverage its extensive nationwide network of agents and retailers to disburse funds to over 1.3 million beneficiaries, said a news release issued on Wednesady.\nAamir Ibrahim, CEO of Jazz, said, “In collaboration with BISP, we are working to uplift the economic well-being of Pakistani women. Leveraging JazzCash’s network, we aim to provide accessible digital financial services, hence, contributing to the gradual financial empowerment of BISP’s beneficiaries. This effort is a reflection of our purpose of improving the lives and livelihoods of women through digital and financial inclusion.”\nSpeaking at the signing ceremony, Murtaza Ali, Head of JazzCash, said, “JazzCash and BISP, together, envision a future where financial inclusion acts as a catalyst for social upliftment, breaking barriers and providing equal opportunities for all. This partnership reflects our shared commitment to positively impacting the lives of those who need it the most.”\nBISP, the prominent social protection organisation, provides financial assistance to over 9 million women who will be given cash assistance amounting to Rs. 10,500 per quarter for a period of 3 years. Under the 3-year partnership, JazzCash will facilitate cash withdrawals through biometrically enabled services.\nChairperson BISP, Muhammad Amjad Saqib, in his address, emphasized the importance of collective responsibility towards uplifting the marginalized. “Irrespective of designation, as human beings and citizens of Pakistan, we must perform our duties. Through our love and respect for our women, we can bring about positive change in their lives,” he added. This ceremony, he stated, further strengthened the commitment of all parties fort he mission of serving the most vulnerable members of society with dignity and transparency.\nThe partnership aims to make timely disbursements to beneficiaries across the country, focusing on districts in Sindh, including Sanghar, Nawabshah, Mirpurkhas, Tharparkar, Matiari, Umerkot, Sujawal, Tando Allahyar, Tando Mohammad Khan, and Hyderabad.\nIn addition to this, JazzCash will be making disbursements in the districts of Kaharan and Chaghai in Balochistan, Rahim Yar Khan in Punjab, and Malakand in Khyber Pakhtunkhwa.\nThe signing ceremony was witnessed by the Chairperson BISP, Muhammad Amjad Saqib, Secretary BISP, Amer Ali Ahmed, Head of JazzCash, Murtaza Ali, CEO Mobilink Microfinance Bank, Ghazanfar Azzam, Chief Operating Officer MMBL, Haaris Mahmood Chaudhary, Head of Public Sector Partnerships JazzCash, Arif Mahmood Chaudhary, and heads of partner banks and development partners of BISP.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:51:52.225Z"
}
