{
  "title": "Pak delegation visits Kenya to explore inter-agency coordination frameworks in immigration & border",
  "link": "https://www.app.com.pk/national/pak-delegation-visits-kenya-to-explore-inter-agency-coordination-frameworks-in-immigration-border/",
  "date_published": "2024-02-20T19:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP): A high-level Pakistan delegation in collaboration with the International Organization for Migration (IOM) Pakistan and IOM Kenya, embarked on a comprehensive study visit to Kenya from Jan 22 to 26.\nThe purpose of the visit was to exchange information and knowledge about border management, specifically on developing and operationalizing inter-agency coordination frameworks, said a press release.\nThe study visit drew upon Kenya’s proven successes and best practices in migration and border management and provided GOP firsthand insights on effective national and regional cooperation frameworks on border management.\nLed by Khushal Khan, Additional Secretary Internal and Foreigners Security, Ministry of Interior (MOI) Pakistan, the delegation from Pakistan included officials from the MOI, Ministry of Foreign Affairs (MOFA), Federal Investigation Agency (FIA) and the National Database and Registration Authority (NADRA).\nDuring the visit, the delegation visited key stakeholders in Kenya’s immigration and border governance sector, such as the Ministry of Interior and National Administration, Kenya Coastguard, and Kenya Airports Authority. The delegation also met with senior officials such as the Principal Secretary of Internal Security and National Administration, the Principal Secretary of Immigration, the Secretary Border Management Secretariat, the Director General Kenya Coastguard, and the General Manager of Kenya Airports Authority.\nThe delegation gained valuable insights into Kenya’s strategies for effective immigration and border governance through facilitated exchanges of knowledge and experiences during meetings with Kenya’s Border Management Secretariat, responsible for managing border operations at a technical and operational level.\nFurthermore, the delegation visited three significant border crossing points of Kenya—the Jomo Kenyatta International Airport, Nairobi; Namanga One Stop Border Post, Namanga; and Kilindini Seaport, Mombasa. These site visits provided the delegation with firsthand insight into the operational aspects of border management and allowed them to observe the joint operations of all agencies involved in the respective border crossing points.\nReflecting on the visit, Khushal Khan outlined the importance of the study visit to Kenya and highlighted the valuable insights gained into Kenya’s inter-agency coordination frameworks, such as the establishment of the Border Control Operations and Coordination Committee (BCOCC), which aims to bring stakeholders together in managing border operations for the country. “The learnings during this visit will inform Pakistan’s efforts to strengthen immigration and border governance in Pakistan. We extend our sincere appreciation to IOM Pakistan and IOM Kenya for facilitating the experience,” expressed Khushal Khan",
  "retrievedAt": "2025-08-11T00:50:41.842Z"
}
