{
  "title": "BISP partners with six banks to expand payment system;serve 9.3 mln beneficiaries",
  "link": "https://www.app.com.pk/national/bisp-partners-with-six-banks-to-expand-payment-systemserve-9-3-mln-beneficiaries/",
  "date_published": "2024-02-21T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): In a landmark development, the Benazir Income Support Programme (BISP) signed an agreement with six banks for disbursement of funds among its 9.3 Million beneficiary households in a ceremony held here Wednesday.\nThe agreement was signed in an impressive ceremony that was witnessed by the Chairperson, Dr Muhammad Amjad Saqib, Secretary BISP, Amer Ali Ahmed, Heads of partner banks and development partners of the programme.\nThe secretary BISP speaking at the event explained that initially, the programme was utilizing the services of only two banks and the contracts of the same had expired some years back.\nHowever, this expansion signifies the introduction of wider service provider banks thus leading to greater transparency.\nThe BISP will annually save Rs 2 billion on account of competition introduced through this new payment system.\nAs a consequence, there will be 15 clusters and 6 banks providing service to BISP beneficiaries now with broader partnership service being provided by Bank Al Falah, Bank of Punjab, Mobilink Microfinance, Telenor Microfinance Bank, Habib Bank Limited, and HBL Microfinance.\nHe further stated, “With beneficiary awareness and a grievance redressal system created in collaboration with banks, we are poised to overcome challenges and achieve a more responsive System”.\nChairperson BISP Dr. Muhammad Amjad Saqib, in his address, emphasized the importance of collective responsibility towards uplifting the marginalized.\n“Irrespective of designation, as human beings and citizens of Pakistan, we must perform our duties. Through our love and respect for our women, we can bring about positive change in their lives,” he asserted.\nThis ceremony, he stated, solidified the commitment of all parties involved to the mission of serving the most vulnerable members of society with dignity and transparency.\nThe ceremony witnessed the participation of key representatives from Bank Alfalah, Bank of Punjab, Habib Bank Limited, HBL Microfinance, Mobilink Microfinance, and Telenor Microfinance, along with representatives of international development partners.\nAfter the ceremony, an exchange took place as representatives of the partner banks and Naveed Akbar, DG NSER on behalf of Benazir Income Support Programme (BISP) signed the agreements.",
  "retrievedAt": "2025-08-11T00:51:31.869Z"
}
