{
  "title": "Saudi Embassy marks ‘Founding Day’ with show of cultural festivity",
  "link": "https://www.app.com.pk/national/saudi-embassy-marks-founding-day-with-show-of-cultural-festivity/",
  "date_published": "2024-02-21T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): The Cultural Mission of the Royal Embassy of Saudi Arabia on Wednesday celebrated the Founding Day of Kingdom, with the show of cultural festivity.\nThe event witnessed a congregation of foreign dignitaries and individuals hailing from diverse backgrounds. A focal point of the celebration was the customary cake-cutting ceremony, emblematic of unity and jubilation, a news release said.\nA lavish luncheon offering an array of delectable traditional Saudi Arabian dishes was also served. The guests savored the intricate flavours and culinary marvels that epitomize the cultural richness of Saudi Arabia.\nCultural Attaché Khalid Bin Modhi Al Toom, in his welcome address, accentuated the profound historical bonds between Pakistan and Saudi Arabia. He expounded upon the enduring camaraderie and collaborative endeavours that have defined the relationship between the two nations over the years.\nPress Attaché Dr. Naif Al Otaibi said,”As we mark the Founding Day of Saudi Arabia, it offers a momentous opportunity to reflect on the shared values, cultural heritage, and enduring friendship with Pakistan.”\nHe emphasized that the day not only signified the genesis of a nation but also underscored the robust bilateral relations and mutual respect between the two countries.\nDr. Al Otaibi commended the pivotal role of the cultural attaché in fostering understanding and bolstering cooperation between Saudi Arabia and Pakistan through cultural exchange, educational collaboration, and diplomatic initiatives.\nHe reiterated his commitment for fortifying ties, advancing cultural diversity, and collectively striving towards a brighter and more prosperous future for both nations.\nThe guests on the occasion expressed their gratitude to the hosts for the opportunity to partake in the joyous occasion and reaffirmed their commitment to further fortifying the bilateral relations between Pakistan and Saudi Arabia.",
  "retrievedAt": "2025-08-11T00:51:06.960Z"
}
