{
  "title": "PM inaugurates Pakistan TV Digital to counter propaganda, deliver Pakistan’s voice globally",
  "author": null,
  "content": "ISLAMABAD, Sep 17 (APP): Prime Minister Shehbaz Sharif on Wednesday inaugurated Pakistan TV Digital as an English news channel aimed at delivering Pakistani voice to the world and offering country’s perspective on national and international developments, besides countering anti-Pakistan narrative and propaganda.\nDuring the visit to the Pakistan TV Digital, the prime minister unveiled the plaque to launch the news channel which aims at enabling Pakistan to communicate with the world and deliver its perspective first.\nThe event was attended by Minister for Information and Broadcasting Attaullah Tarar, Secretary Information Ambreen Jan, and other senior officials.\nThe prime minister visited various sections of the new channel, interacted with the young professionals and praised their enthusiasm, stressing their crucial role in countering external narratives.\nHe said that the primary objective of launching this digital news channel was to provide an authentic news while effectively countering misinformation and propaganda about Pakistan.\nPrime Minister Shehbaz also recorded his first interview for Pakistan TV Digital’s broadcasts.\nAs per the excerpts of the interview aired by Pakistan Television, the prime minister said, “If you are in right direction committing yourself with all your passion and energy to serve the cause of your country, that is a huge inspiration.”\nAsked how he wanted to see Pakistan decade from now, he said he desired to see Pakistan as a nation standing tall with remarkable achievements in economic prosperity, peace, and happiness.\nAt the ceremony, Minister for Information and Broadcasting Attaullah Tarar briefed the prime minister on the objectives of Pakistan TV Digital.\nHe explained that the platform would serve as an active and authentic voice for Pakistan to global audiences, bridging information gaps and promoting public diplomacy through an English-language platform.\nThe strategic goal is to enable Pakistan to communicate with the world and deliver its perspective first. The platform will cover critical issues related to Pakistan, including international affairs, cultural insights, economic progress, and analyses, all presented from Pakistani perspective, he added.\nThe minister said that by leveraging an efficient production workflow, the channel would integrate in-house reporting with a global network of freelancers and partnerships with renowned wire services like Reuters and Associated Press (AP), and would ensure real-time, verified, and high-quality coverage.\nIt aims to counter one-sided narratives prevalent in Western and Indian-influenced regional media, Tarar explained and emphasized that Pakistan TV Digital would be a hub for major news, viewed from a Pakistani perspective.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:58:32.115Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-inaugurates-pakistan-tv-digital-to-counter-propaganda-deliver-pakistans-voice-globally/",
  "dateList": "2025-09-17",
  "date_published": "2025-09-17T09:26:00.000Z"
}
