{
  "title": "Court hands over 7 accused to FIA on 3-day remand in APP mega corruption case",
  "author": null,
  "content": "ISLAMABAD, Sep 17 (APP): A lower court on Wednesday handed over the seven accused to Federal Investigation Agency (FIA) on a three-day physical remand in Associated Press of Pakistan (APP) mega corruption case.\nThe accused were produced before the court and facing charges of misappropriating funds amounting to Rs 380 million.\nCivil Judge/Judicial Magistrate Ahmad Shehzad Gondal heard the case when FIA investigators presented the accused — Muhammad Ghawas, Imran Munir, Azhar Farooq, Tahir Ghumman, Khurram Shehzad, Idrees Chaudhry, and Sajid Ali Warraich. The FIA requested the court to grant 14-day physical remand, arguing that further interrogation was required to recover funds, examine records, and trace the financial trail.\nFIA’s investigating officer Muhammad Junaid informed the court that crucial records, including salary credit sheets, were needed from the Accountant General Pakistan Revenues (AGPR). He said the AGPR was not providing the documents, and requested the court to direct the concerned officials to cooperate in this regard.\nJunaid further informed the court that Rs 170 million and Rs 210 million were transferred into the accounts of the suspects, requiring detailed scrutiny. He argued that the case involved a total of Rs 380 million, and further custody was necessary to complete the probe.\nDuring the hearing, defence lawyers opposed the request for physical remand. They maintained that the suspects should not be kept in further custody and sought their release.\nOn behalf of APP, advocates Hasnain Haider Thaheem, Khurram Butt, and Rohail Asghar appeared before the court. Advocate Rohail Asghar contended that the accused, along with other co-suspects, had prepared fake vouchers and unlawfully gained benefits. He said that the matter was earlier discussed in the Public Accounts Committee, after which a First Information Report (FIR) was registered. He urged the court to grant remand for further investigation into the alleged irregularities.\nAfter hearing arguments from both sides, Civil Judge Ahmad Shehzad Gondal granted FIA three-day custody of the seven suspects. The court observed that given the allegations and the financial transactions under scrutiny, further investigation in FIA custody was justified.\nThe FIA had registered a case against 16 individuals linked to APP over alleged corruption worth hundreds of millions. According to investigators, fake salary vouchers were prepared, leading to the transfer of large sums into private accounts.\nOn Tuesday, Special Judge Central Humayun Dilawar had dismissed the pre-arrest bail applications of 13 suspects and ordered their immediate arrest. Following the court’s order, FIA teams arrested seven accused from the court premises, while several others managed to escape.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:58:00.569Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/court-hands-over-7-accused-to-fia-on-3-day-remand-in-app-mega-corruption-case/",
  "dateList": "2025-09-17",
  "date_published": "2025-09-17T15:27:00.000Z"
}
