{
  "title": "Ethiopian Airlines arrival in Pakistan to boost relations with African countries: Ambassador Jemal Beker Abdula",
  "link": "https://www.app.com.pk/national/ethiopian-airlines-arrival-in-pakistan-to-boost-relations-with-african-countries-ambassador-jemal-beker-abdula/",
  "date_published": "2023-02-18T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP): Ambassador Extraordinary and Plenipotentiary of the Federal Democratic Republic of Ethiopia to Pakistan Jemal Beker Abdula on Saturday said the arrival of Ethiopian Airlines in Pakistan would give a major boost to the relations between Pakistan and Africa by bolstering contacts among their people.\n“Ethiopian Airlines which is starting its operation from Karachi by next month will be a game-changer for the relations of Pakistan and Africa as the contacts among its people is not as strong as it should be,” the ambassador said during a meeting with the members of Gujranwala Chamber of Commerce and Industry here.\nHe said two major issues which hampered the growth of bilateral relations especially trade between Pakistan and African countries were the absence of institutional linkages and weak people-to-people contacts.\nHowever, Ethiopia which was a gateway to Africa had the potential to bring the people of Pakistan and African countries closer, he added.\nThe Embassy of Federal Democratic Republic of Ethiopia had worked out a comprehensive strategy to resolve those issues, he said, while highlighting the steps so far taken to promote people-to-people contacts and establish institutional linkages between Ethiopia and Pakistan.\n“Our embassy is inching closer to achieving its first target of bringing Ethiopian Airlines in Pakistan,” said the ambassador, who added that a trade agreement had already been signed between Pakistan and Ethiopia to formalize the trade between the two countries.\nMore agreements would soon be signed to strengthen bilateral relations between the two countries in diverse sectors, he added.\nHe said the embassy had also finalized preparations for a trade delegation to Ethiopia which would not only connect the Pakistani business community with the right people in his country but also increase its presence in Africa.\nThe delegation which was bound to Ethiopia on March 5 would include subsidized airfares and accommodation, business-to-business and government-to-business meetings as well as grand receptions and cultural nights hosted by the country’s leadership.\n“Do not mislocate yourself as this is right time to enter in Ethiopia which will connect you with the entire Africa,” he remarked.\nHe said Ethiopia was the fastest growing economy in the world offering lucrative business, trade and investment opportunities with the cheap cost of production including clean energy and skilled labour.\n“We have almost completed the largest Grand Ethiopian Renaissance Dam with 6,500 MW capacity,” he said, adding his country had already been exporting energy to Kenya, Sudan, Djibouti and others.\nJemal Beker said the government of Ethiopia was supportive of foreign investors as it has opened up its economy and encouraged private sector to take lead for development of the country.\nMultiple incentives and one-window services were among the other initiatives to attract Foreign Direct Investment, he added.\nEthiopia and Pakistan had a vast potential for bilateral trade in the diverse sectors of economy including manufacturing, agriculture, agro processing, textile, cement, steel, chemicals and others, the ambassador remarked.\nJemal Beker Abdula also visited the International Institute of Science, Art and Technology and addressed the students on the history of Pakistan and Ethiopia relations and its future prospects.\nHe highlighted the role of academia in promoting the people-to-people ties between the two countries.\nOn the occasion, the University of Sialkot Chairman Board of Governors Faisal Manzoor said Pakistanis had a religious association with Ethiopia which was a land of Hazrat Bilal Habeshi (RA). Nothing could stop these two nations from coming closer as their long-standing relations were anchored in shared values, culture and beliefs.\nHe said the University of Sialkot and IISAT would offer fully-funded scholarships to Ethiopian students.\nMeanwhile, the ambassador also inaugurated the Sustainable Development Goals center at the International Institute of Science, Arts and Technology (IISAT).",
  "retrievedAt": "2025-08-11T06:07:19.091Z"
}
