{
  "title": "Nawaz Sharif always called in during testing times: Maryam Nawaz",
  "link": "https://www.app.com.pk/national/nawaz-sharif-always-called-in-during-testing-times-maryam-nawaz/",
  "date_published": "2023-02-17T19:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP): Chief Organizer of Pakistan Muslim League (Nawaz) Maryam Nawaz on Saturday in a much-anticipated interview said that Nawaz Sharif had always played an important role in the development of the country.\n“Nawaz is called in whenever the country is leading towards disaster. He returns only to make the country self-reliant,” said Maryam in a special interview with a private news channel.\n“The people have had always been looking towards Nawaz Sharif in the hour of trial,” she added, blaming the previous Pakistan Tehreek-e-Insaf government for current economic woes.\nShedding light on the agreement made with the Intentional Monetary Fund (IMF), Maryam said the masses were facing problems and inflation due to tough conditions placed by the IMF in an agreement with the former PTI government.\nIn reference to the deteriorating security situation in the Khyber Pakhtunkhwa, Maryam stated that Pakistan Tehreek-e-Insaf (PTI) had been handling the affairs of the provincial government for a decade.\nIn reply to a question about reassembling of party supporters, Maryam said, that they had visited Hazara division and the party was planning to launch the drive across the country to strengthen its basis.\nTo a question about the senior leader of PML(N) Shahid Khaqan Abbassi, she said, the former prime minister had a vast experience as the party members were taking benefits of his political experience.\nTo a question about ex- PML-N member and interior minister Chaudhry Nisar, Maryam held that the former had chosen his path for the future course of action.\nShe also said that the PML(N) regards Chaudhry Shujat Hussain but had reservations over the former chief minister of Punjab Chaudhry Pervez Elahi.",
  "retrievedAt": "2025-08-11T06:07:27.054Z"
}
