{
  "title": "YPP hosts ceremony in honor of British MP Lord Shafique Mohammad",
  "author": null,
  "content": "ISLAMABAD, Oct 05 (APP): The Youth Parliament of Pakistan (YPP) organized a dignified ceremony under the leadership of its President Obaid ur Rehman Qureshi and Secretary General Hammad Malik, to honor Lord Shafique Mohammad, Member of the British Parliament, currently visiting Pakistan.\nExecutive Member & In Charge, KPK Chapter, Faisal Jamshed was also part of the meeting.\nThe event brought together distinguished guests from Pakistan’s political, journalistic, and religious circles.\nProminent participants included Chairman of Ausaf and ABN Group Mian Mehtab Khan, Member of the National Assembly and former Senator Sehar Kamran, spiritual Sahibzada Saad Jameel ur Rehman (Eidgah Sharif), and Hurriyat Conference leader Abdul Hameed Lone. Members of the Youth Parliament delegation who recently visited the United Kingdom, Ms. Bakhtawar Mahmood and Ms. Sidra Akhtar, also shared their experiences from the visit.\nSpeaking at the occasion, Lord Shafique Mohammad praised the active participation of Pakistani youth in democratic and political processes, terming it a positive sign for the country’s future. He emphasized that stronger people-to-people ties between Pakistan and the United Kingdom could be achieved through dialogue and youth engagement. Appreciating the efforts of the Youth Parliament, he said the platform plays a vital role in nurturing young leadership.\nMs. Sehar Kamran, MNA, highlighted that Pakistani youth are not merely beneficiaries of democracy but its true stakeholders. She stressed the importance of women’s participation in politics and underscored that the country’s future development depends on the active involvement of young people.\nSahibzada Saad Jameel ur Rehman urged that young leaders must also seek moral and spiritual guidance alongside political training so they can serve the nation with sincerity and compassion.\nChairman of Ausaf and ABN Group Mian Mehtab Khan stated that the media plays a pivotal role in amplifying the voices of the youth nationwide. He affirmed that the collaboration between journalism and youth would steer Pakistan’s democratic narrative in the right direction. He appreciated the initiatives of the Youth Parliament and reiterated his group’s commitment to supporting youth-led causes.\nHurriyat leader Abdul Hameed Lone noted that the Kashmiri freedom movement could be further strengthened by the support and advocacy of Pakistani youth at the international level.\nExecutive Member Faisal Jamshed said that the Youth Parliament provides a vital platform for young people to prepare for future leadership roles. He added that the recent UK visit served as an opportunity for practical learning and for presenting Pakistan’s positive image globally.\nDuring the event, Bakhtawar Mahmood and Sidra Akhtar shared their reflections on their UK visit, recounting their experiences at the House of Lords and their admiration for British democratic values.\nIn his address, President Obaid ur Rehman Qureshi reaffirmed the organization’s mission to engage youth in national decision-making processes. He said that the Youth Parliament has consistently played a constructive role both nationally and internationally,  and vowed to continue its efforts.\nSecretary General Hammad Malik, who conducted the proceedings, said that the organization aims to train youth in democracy, dialogue, and social service. He expressed gratitude to all the distinguished guests and reaffirmed the Youth Parliament’s commitment to empowering the next generation of leaders.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:50:48.081Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ypp-hosts-ceremony-in-honor-of-british-mp-lord-shafique-mohammad/",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T11:02:00.000Z"
}
