{
  "title": "A wind of change begins to blow in Sindh: Qureshi",
  "link": "https://www.app.com.pk/national/a-wind-of-change-begins-to-blow-in-sindh-qureshi/",
  "date_published": "2022-03-04T16:07:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 04 (APP): Pakistan Tehreek-e-Insaf (PTI) Vice Chairman and Foreign Minister Shah Mehmood Qureshi Friday said a wind of change had begun to blow in Sindh and the people of the province would reject the Pakistan Peoples Party in the next general election.\nOnly one side of the picture was being presented before the people of Sindh, but now the Haqooq-e-Sindh March had unveiled the real face of the ‘corrupt rulers’, he said while addressing a huge public gathering in Tando Muhammad Khan.\nEarlier in the morning, the Sindh Haqooq March led by Shah Mahmood Qureshi, PTI Sindh President Syed Ali Zaidi and General Secretary Mubeen Jatoee, MNAs and MPAs, started its journey on the seventh day after a night stay in Badin, and reached Tando Allahyar via Talhar, Matli, Tando Muhammad Khan and other towns. A large number of people along with the party workers warmly welcomed the participants at various places.\nQureshi said he could only sympathize with Bilawal Bhutto Zardari as he had to address empty chairs in Multan. The people of Sindh were fed up with the “Zardari League” and would snub its leadership like their brethren in Punjab, Khyber Pakhtunkhwa, Balochistan, Gilgit Baltistan and Azad Kashmir, who had already rejected the party, he added.\nHe also condemned the suicide attack in a Peshawar mosque and expressed grief on loss of precious lives. The nation, armed forces, police and other law enforcing agencies had unitedly defeated the terrorists and and Pakistan was moving fast on the path of economic growth with foreign investment pouring in. But it was not acceptable to some antagonist forces, which were carrying out such incidents to create uncertainty among the people, he added.",
  "retrievedAt": "2025-08-11T14:27:58.680Z"
}
