{
  "title": "Pakistan strongly condemns arrest of Hurriyat leader by Indian Occupation forces in IIOJK",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-arrest-of-hurriyat-leader-by-indian-occupation-forces-in-iiojk/",
  "date_published": "2022-03-04T17:36:00.000Z",
  "source": "APP",
  "content": "Pakistan Friday strongly condemned the cowardly arrest of Hurriyat Conference Vice Chairman Ghulam Ahmad Dar by Indian occupation forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK) under the draconian Public Safety Act (PSA).\nAccording to Foreign Office spokesperson, arbitrary arrests of Hurriyat leaders, political activists, human rights defenders, and civil society members on orchestrated charges manifestly reflected India’s frustration at the freedom struggle by the Kashmiri people that continued unfazed despite increasing intimidation, harassment and reprisal attacks by the occupation forces. Almost the entire Kashmiri leadership including Asiya Andrabi, Shabbir Ahmed Shah, Yasin Malik, and Masarat Alam Bhat were either detained in crowded jails in India or under house arrest on made-up charges.\nHe said the relentless witch-hunt of Hurriyat leaders and political activists by the Hindutva driven RSS-BJP dispensation on motivated allegations and their persecution on fictitious charges under draconian laws was in clear violation of the UN Charter, UN Security Council and UN General Assembly resolutions, and international human rights and humanitarian law.\nRegrettably, the Indian occupation forces were yet to account for the death of senior All Parties Hurriyat Conference (APHC) leader and Tehreek-e-Hurriyat Jammu and Kashmir Chairman Ashraf Sehrai who was arrested last year on trumped up charges under the oppressive Public Safety Act in IIOJK and remained under illegal Indian custody till the time of his death despite his worsening health condition, he added.\nIndia must remember that no amount of systematic brutality, unbridled use of force and atrocious clamp-downs against Kashmiri leadership will suppress the Kashmir freedom movement nor would it delude the world into accepting India’s false claims of ‘normalcy’ in the IIOJK and portraying itself as a victim of terrorism, he asserted.\nHe said, “Pakistan calls upon the international community to compel India to abjure its policy of state-terrorism in IIOJK and immediately release all arbitrarily arrested Kashmiri political leaders and activists including Mr. Ghulam Ahmad Dar.”",
  "retrievedAt": "2025-08-11T14:28:02.107Z"
}
