{
  "article_id": "2025-06-11_c2c07207d5ad8e56c6e3ca569c13124a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/chairman-senate-approves-summer-internship-program-2025-for-university-students/",
    "retrieved_at": "2025-08-27T11:03:44.094Z"
  },
  "metadata": {
    "title": "Chairman Senate approves summer internship Program 2025 for university students",
    "author": null,
    "date_published": "2025-06-11T12:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 11 (APP): Chairman Senate, Syed Yousaf Raza Gilani, has formally approved the launch of the Summer Internship Program 2025 in the Senate of Pakistan for 21 university students. The program, beginning June 16, 2025, will run for eight weeks and will include selected students from the Foundation for Advancement of Science and Technology (FAST), National University of Modern Languages (NUML) and the National University of Sciences and Technology (NUST). Part of the Senate's flagship Outreach Program, the initiative aims to provide young graduates in social sciences and technology with firsthand exposure to the legislative and administrative workings of the Senate, particularly during the federal budget session. Prior to commencement, the participants will undergo a two-day orientation at the Pakistan Institute of Parliamentary Services (PIPS), focusing on the Constitution of Pakistan and the procedures of the Senate, its Secretariat, and Standing Committees. This internship follows earlier successful cohorts, including 20 students from Quaid-i-Azam University, National Defence University, Bahria University and NUST (June-August 2022) and 18 students from seven Islamabad-based schools (July-August 2024). Since assuming office in March 2024, the Chairman has actively advanced the inclusivity of the legislative process through an expanded unpaid internship program, which has so far engaged 426 students from various universities across the country. As part of this inclusive vision, the Senate Secretariat also plans to launch a second-phase internship program tailored to A- and O-Level students in Islamabad, further widening access for Pakistan's youth to understand and contribute to democratic governance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}