{
  "article_id": "2025-06-11_56bbe4d60c58c53df7f56700b107834e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/danyal-chaudhry-lauds-budgets-sdg-focus/",
    "retrieved_at": "2025-08-27T11:03:19.373Z"
  },
  "metadata": {
    "title": "Danyal Chaudhry lauds budget’s SDG focus",
    "author": null,
    "date_published": "2025-06-11T15:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 294,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 11 (APP): Parliamentary Secretary for Information & Broadcasting, Barrister Danyal Chaudhry on Wednesday participated as Member of the Parliamentary Sustainable Development Goals (SDGs) Taskforce in a briefing session titled 'Sustainable Development Goals in Focus: A Critical Post-Budget Analysis' at the Parliament House. Addressing the session, Barrister Danyal commended the Federal Budget 2025-26 for its strong alignment with Pakistan's commitment to the United Nations Sustainable Development Goals. He highlighted the substantial expansion of the Benazir Income Support Programme (BISP) allocation to Rs 7.16 billion, a 20% increase benefiting approximately 10 million households, as a decisive step directly advancing SDG 1 (No Poverty), said a press release. Barrister Danyal emphasized that prudent fiscal management, resulting in reduced current expenditures, a significant decrease in the debt-servicing burden (from 60% to 47%), and a lower policy rate (down from 22% to 11%), has generated crucial fiscal space. This space, he stated, is being strategically redirected towards development initiatives. This shift actively supports progress on SDG 5 (Gender Equality), SDG 6 (Clean Water and Sanitation), SDG 9 (Industry, Innovation, and Infrastructure), and SDG 11 (Sustainable Cities and Communities). Further demonstrating the budget's pro-people and growth-oriented focus, Barrister Danyal noted the reduction in income tax for the salaried class from 5% to 2.5%, aligning with SDG 8 (Decent Work and Economic Growth). He also lauded the groundbreaking simplification of the tax-filing process, streamlined from requiring 800 columns to just 7 basic pieces of information, as a major reform enhancing 'ease of doing business' and economic formalization. \"This budget demonstrates a practical translation of our SDG commitments into fiscal policy. By strategically reallocating resources towards poverty eradication, infrastructure, social protection, and economic simplification, we are laying a stronger foundation for sustainable and equitable development for all Pakistanis,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}