{
  "article_id": "2025-06-11_c65f6a0aad50c4bf6d8233b5e38267ef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-philippines-commit-to-strengthening-bilateral-ties-envoy-presents-credentials-to-president-marcos/",
    "retrieved_at": "2025-08-27T11:04:32.944Z"
  },
  "metadata": {
    "title": "Pakistan, Philippines commit to strengthening bilateral ties, envoy presents credentials to President Marcos",
    "author": null,
    "date_published": "2025-06-11T08:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 188,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "MANILA, PHILIPPINES, Jun 11 (APP):Dr. Asima Rabbani, the newly appointed Ambassador Extraordinary and Plenipotentiary of the Islamic Republic of Pakistan to the Republic of the Philippines, formally presented her credentials to His Excellency Ferdinand R. Marcos Jr., President of the Philippines, in an official ceremony held at Malacanan Palace. The ceremony, which included a traditional guard of honour inspection by Ambassador Rabbani, marked the beginning of her diplomatic mission in the Philippines, a news release on Wednesday said. Following the presentation of credentials, the Ambassador held a constructive meeting with President Marcos to discuss opportunities for expanding bilateral cooperation in key areas, including trade, investment, leadership exchanges, and collaboration in international forums. Ambassador Rabbani reiterated Pakistan's commitment to deepening its longstanding friendship with the Philippines and highlighted the potential for enhanced economic and strategic partnerships. She emphasized the importance of people-to-people ties and mutual support on global platforms. President Marcos welcomed Ambassador Rabbani and expressed his government's readiness to work closely with Pakistan to further strengthen relations between the two nations. Both sides acknowledged the shared values and common interests that serve as a foundation for future collaboration.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}