{
  "article_id": "2025-06-11_66935c53c88f5eec3748c2bed5dcd364",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-hosts-knowledge-sharing-session-on-federal-budget-to-enhance-oversight/",
    "retrieved_at": "2025-08-27T11:04:05.920Z"
  },
  "metadata": {
    "title": "Senate hosts knowledge-sharing session on federal budget to enhance oversight",
    "author": null,
    "date_published": "2025-06-11T12:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 11 (APP):A high-level knowledge-sharing session titled \"Understanding the Federal Budget: Analysis and Recommendations\" was held at the Parliament House on Wednesday to enhance parliamentary oversight and promote informed debate on the national budget. Organized in collaboration with the Pakistan Institute for Parliamentary Services (PIPS), the session was designed to empower senators with the necessary tools and knowledge to scrutinise the federal budget effectively through parliamentary committees. Chairman of the Senate Standing Committee on Finance and Revenue, Senator Saleem Mandviwala, led the session by sharing his extensive experience in financial governance and budgeting. He emphasized the growing importance of Senate recommendations in shaping the national budget. Mandviwala said that in the previous fiscal year, 52 per cent of the Senate's recommendations were incorporated into the federal budget, marking a record high. He called this a significant reflection of the Senate's active and informed participation in the budgetary process. A key feature of the session was the introduction of a special proforma exclusively developed for senators. The proforma aims to standardize and formalize the process of submitting budget recommendations, enhancing transparency and encouraging structured input. \"This proforma will not only ensure proper documentation but also foster more active and result-oriented participation by parliamentarians in the budget process,\" Mandviwala stated. The session also featured insights from officials of the Ministry of Finance, including Joint Secretary (Budget) Rana Obaid Ullah Anwar, who elaborated on budget preparation and execution mechanisms. Adding academic depth, Dr. Waseem Shahid Malik delivered an expert lecture on sectoral budget analysis, offering analytical frameworks to assess allocations and financial planning across key economic sectors. The session concluded with a reaffirmation of the Senate's commitment to ensuring that the Federal Budget 2025-26 reflects the values of transparency, institutional learning, and effective legislative scrutiny, thereby aligning with the expectations and needs of the people of Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}