{
  "article_id": "2025-05-31_a4617fbb58c81d953ae7b8a0e272f004",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-aims-to-enhance-electric-bus-services-with-digital-integration-discount-offers/",
    "retrieved_at": "2025-08-27T16:06:10.967Z"
  },
  "metadata": {
    "title": "CDA aims to enhance electric bus services with digital integration & discount offers",
    "author": null,
    "date_published": "2025-05-31T15:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 307,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 31 (APP):Capital Development Authority (CDA) has announced major upgrades to Islamabadas electric bus service, focusing on digital accessibility, expanded payment options, and discounted fares for students, seniors, and persons with disabilities. The decisions were made during a high-level meeting chaired by CDA Chairman and Chief Commissioner Islamabad, Muhammad Ali Randhawa on Saturday. Senior officials, including CDA board members and the CEO of the National Radio & Telecommunication Corporation (NRTC), attended the session, where they reviewed the performance of the electric feeder buses and discussed strategies to improve commuter convenience. The CDA chairman directed that all electric bus routes, stops, and schedules be integrated into Google Maps for easy public access. The routes will be highlighted with distinct colors, and real-time updates will help passengers plan trips efficiently. To streamline fare collection, passengers will soon be able to pay via Mastercard, Visa, and other bank cards. The CDA will collaborate with financial institutions to facilitate this feature. Special discount passes for daily, weekly, monthly, and quarterly commuters will be introduced to make the service more affordable. Students, senior citizens, and persons with disabilities will benefit from additional fare reductions. The chairman emphasized expanding routes based on passenger demand and boosting daily ridership. Efforts will also be made to reduce reliance on subsidies by exploring revenue streams such as digital advertising at bus terminals. Officials reported that the electric bus project has surpassed expectations, with current ridership reaching approximately 95,000 passengersaexceeding initial estimates. Despite rising operational costs, fares have remained unchanged since launch. Chairman Randhawa reaffirmed the CDAas commitment to elevating service standards, ensuring the system aligns with international best practices. aOur goal is to provide Islamabadas residents with a modern, eco-friendly, and technologically advanced transport network,a he stated. The CDAas latest measures aim to enhance passenger experience while promoting sustainable urban mobility in the federal capital.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}