{
  "article_id": "2025-05-31_c634afb1ab04796a1d2f6bcf285597b7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/raheem-yar-khan-emerges-as-top-destination-for-healthy-40-50kg-goats-ahead-of-eid-ul-azha/",
    "retrieved_at": "2025-08-27T16:06:39.910Z"
  },
  "metadata": {
    "title": "Raheem Yar Khan emerges as top destination for healthy 40-50kg goats ahead of Eid ul Azha",
    "author": null,
    "date_published": "2025-05-31T10:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 294,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 31 (APP):Raheem Yar Khan, nestled in the heart of Punjab has become a notable livestock hub, especially recognized for its thriving goat farming industry, where farmers take great care in raising healthy goats weighing between 40 to 50 kilograms, attracting buyers from across the region. According to a recent report aired on a state news channel, the buyers were flocking to cities like Raheem Yar Khan, renowned for their thriving livestock markets, in anticipation of Eid festivities. Rahim Yar Khan's goats are the best I have seen, healthy and strong. I am definitely buying one for Eid.\" said a buyer. Rahim Yar Khan's livestock market is the go-to place for high-quality goats. I am buying one for my family's Eid celebration.\" said a citizen from Lahore. \"The breed selection in of these farmers are incredible. I have found the perfect goat for Eid, thanks to the local farmers,\" said another buyer. Another citizen Ahsan Farid u Din, echoed similar sentiments, \"I have observed that the maximum weight of goats in Rahim Yar Khan ranges from 40 to 50 kilograms, which is ideal for Eid sacrifices. What impresses me is the high attention paid by local farmers to their animals' health and well-being, he added. It is no surprise that around 4 lakh goats are fed and cared for throughout the year in this region, making it a hub for quality livestock, he also mentioned. \"Raheem Yar Khan's farmers truly know their craft, producing high-quality goats that meet the exacting standards of buyers.\" said another local resident. \"The 40-50kg goats in Raheem Yar Khan are incredibly healthy and well-cared for, making them perfect for Eid sacrifices.\" said a seller. \"The demand of these goats high many buyers paying high prices\", said another buyer.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}