{
  "article_id": "2025-05-31_463e0fc4c2361f431b74977147774345",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/global-south-unites-amid-climate-setbacks-sdpi-hosts-pivotal-dialogue-on-ndcs-3-0-climate-diplomacy/",
    "retrieved_at": "2025-08-27T16:06:10.969Z"
  },
  "metadata": {
    "title": "Global South unites amid climate setbacks: SDPI hosts pivotal dialogue on NDCs 3.0, climate diplomacy",
    "author": null,
    "date_published": "2025-05-31T16:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 829,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 31 (APP):In the wake of the United States' withdrawal from the Paris Agreement and an escalating crisis in global climate financing, the Sustainable Development Policy Institute (SDPI) convened a high-level virtual policy dialogue that brought together influential climate voices from across the Global South. The session focused on recalibrating climate governance under Nationally Determined Contributions (NDCs) 3.0 and rethinking diplomatic strategies for a just and resilient energy transition, said a press release issued here on Saturday. The dialogue, live-streamed under SDPI's Network for Clean Energy Transition (NCET), featured a cross-regional panel of policymakers, academics, and climate finance experts, including Dr. Shafqat Munir Deputy Executive Director, SDPI, Muhammad Faisal Sharif, Director, Environment and Climate Change, Private Power and Infrastructure Board (PPIB), Ministry of Energy, Dr. Alexandra Soezer Director, Climate Action Centre of Excellence, Ma Yue Analyst, IGDP, China, Anjali Viswamohanan Director of Policy, AIGCC, Dr. Zainab Naeem Head, Ecological Sustainability, SDPI and Engr. Ubaid ur Rehman Zia, Head of Energy Unit at SDPI among others. In his opening remarks, Dr. Shafqat Munir outlined the sobering reality of the climate finance gap: only $300 billion of the projected $1.3 trillion demand has been pledged through 2035. He warned that the withdrawal of key players like the U.S. threatens to derail the $100 billion global climate finance pledge, leaving developing nations exposed. Dr. Munir criticized Pakistan's current NDC framework for its lack of transparency, unrealistic sectoral targets, and weak stakeholder inclusion, calling for a more grounded, equitable, and participatory model for NDCs 3.0. \"We must move from ambitious rhetoric to resourced, transparent, and inclusive climate action,\" he stated, urging regional cooperation to amplify the Global South's voice in international negotiations. Engr. Ubaid ur Rehman Zia, Head of Energy Unit at SDPI mentioned that the NDCs represent a critical component of South Asia's climate governance, however the US withdrawal from Paris Agreement has threatened the changing landscape, consequently impacting the financing needs of the global south that is at the forefront of climate change. He highlighted the need to shift towards market based financing mechanisms to address climate action, while improving the south-south cooperation to bring in climate-tech products and clean energy technologies. Mr. Faisal Sharif from PPIB and University of Bath offered a sector-specific lens on Pakistan's efforts toward climate sustainability. He acknowledged policy advancements, such as expanding net metering, retiring fossil-intensive IPPs, and incorporating climate justice and inclusivity into national policy. However, he emphasized systemic challenges remain, including the fossil-heavy grid and limited technology transfer mechanisms. \"NDCs 3.0 offer a strategic opportunity to realign our development trajectory with global low-carbon norms, including CBAM compliance and just transition planning,\" Sharif said. He stressed the need for institutional coordination and private sector engagement to ensure ambitious but achievable climate targets. Ma Yue from IGDP (China) shared insights from China's climate journey, noting that electric vehicles now account for over 40% of new sales and that integrated environmental policies are becoming central to governance. She emphasized the role of South-South cooperation and global transparency as critical pillars for effective NDC implementation. Future climate strategies, she added, must integrate GHG lifecycle accounting and inclusive sectoral participation to be effective. \"Collaboration and inclusivity are key. Climate action must be integrated, transparent, and forward-looking,\" she stated. Anjali Viswamohanan highlighted the growing recognition of climate risk among institutional investors - with 75% acknowledging its long-term economic impact. She emphasized that while private capital is increasingly available, governments must offer policy clarity, risk mapping, and enabling frameworks to mobilize it effectively. She called for governments to create incentives and de-risking mechanisms to unlock investment in Nature-Based Solutions (NBS) and transition finance. \"There is significant investor momentum. Now it's about access, policy clarity, and building trust,\" she noted. Dr. Zainab Naeem urged a bottom-up approach to climate adaptation, warning that current NDCs neglect local realities and often exclude marginalized voices, including women, youth, and indigenous communities. She advocated for embedding community-led adaptation into policy structures at all governance levels. \"Adaptation must be people-first. Without community ownership, climate strategies will not work-and we risk deepening the vulnerabilities we aim to solve,\" she warned. Delivering a strong geopolitical perspective, Dr. Alexandra Soezer cautioned that external shocks and global uncertainty are undermining climate finance flows to developing countries. She emphasized the importance of Article 6 of the Paris Agreement and called for market-based engagement and strategic resilience through diversified finance sources and regional cooperation. \"The global climate regime is shifting. Developing countries must be geopolitically agile, financially diversified, and institutionally prepared to make their NDCs more than just symbolic,\" Dr. Alexandra asserted. Mr. Shakeb Elahi, Senior Advisor at SDPI, concluded the dialogue by emphasizing that NDCs 3.0 must be inclusive, finance-ready, and anchored in both community-led adaptation and private sector participation. He called for regional cooperation, robust policy frameworks, and institutional resilience as key drivers of meaningful implementation. The dialogue is part of SDPI's broader mission under NCET to foster inclusive, evidence-based discussions on climate diplomacy, energy transitions, and sustainable development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}