{
  "title": "Registrar SCP tasked to draft rules for Constitutional Bench",
  "link": "https://www.app.com.pk/national/registrar-scp-tasked-to-draft-rules-for-constitutional-bench/",
  "date_published": "2024-11-20T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP):Registrar SCP is tasked to draft rules regulating the practice and procedures of the Constitutional Bench in consultation with Justice Muhammad Ali Mazhar with the final draft to be reviewed for approval.\nA dedicated branch at the Supreme Court of Pakistan will be established to adequately handle Constitutional matters under Article 191A of the Constitution of Pakistan.\nThis was decided by the Committee constituted under Article 191A of the Constitution. The meeting of the Committee was held under the Chairmanship of Justice Ammin-ud-Din Khan, Senior Judge of the Supreme Court and head of the Constitutional Bench.\nThe meeting was attended by Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar and the Registrar Supreme Court of Pakistan.\nTo expedite the disposal of pending appeals, the committee directed the office for categorization and compilation of the cases within one week and fixation of five chamber appeals daily for hearing before each member of the committee.\nIn the matter regarding hearing Intra Court Appeal (ICA), trial of civilians by military courts, the committee noted that Justice Ayesha A Malik, being a member of the earlier Bench, whose judgment is under challenge, cannot serve on the Constitutional Bench for these appeals.\nSince the original ICAs were heard by seven-member bench, the committee resolved to approach the Judicial Commission of Pakistan for Constitutional Bench to ensure the matter is heard promptly.\nThe dedicated branch to handle constitutional matters will adequately be staffed to ensure the smooth processing of cases. Additionally, cases already transferred to the Constitutional Bench by the Supreme Court will be scheduled in accordance with the approved roaster.",
  "retrievedAt": "2025-08-10T15:28:47.772Z"
}
