{
  "title": "HarimauMarkhor ceremony concludes successfully at NCTC",
  "link": "https://www.app.com.pk/national/harimaumarkhor-ceremony-concludes-successfully-at-nctc/",
  "date_published": "2024-11-20T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP):The closing ceremony of exercise HarimauMarkhor Series 2/2024 was successfully held at the National Counter Terrorism Centre (NCTC) here on Wednesday.Pakistan has significantly strengthened the military-to-military cooperation between Malaysia and Pakistan.The event was attended by Malaysia’s High Commissioner to Pakistan, Ambassador Dato’ Mohammad Azhar Mazlan, who highlighted the exercise’s success in fostering closer defence ties between Malaysia and Pakistan.The ceremony was officiated jointly by the Commander of the 2nd Infantry Division Malaysia (2 Div), Major General Dato’ Hj Fazal Hj Abdul Rahman, and the Commander of the 23rdDivision of the Pakistan Army, Major General Muhammad Intikhab Alam, said a press release issued by Malaysian High Commission in Islamabad.\nThe two-week joint exercise, which ran from 4 to 15 November 2024, focused on Counter-Terrorism Operations in jungle environments.\nIt facilitated the exchange of tactics, techniques, and procedures, along with valuable insights into Pakistan’s diverse and challenging terrain.\nThe 2nd HarimauMarkhor exercise has significantly strengthened the military-to-military relationship between Malaysia and Pakistan and developed greater understanding through the exchange of ideas, knowledge, and operational skills.\nThe exercise involved five (5) officers and 13 personnel from the 5th Battalion of the Royal Ranger Regiment (5RRD), along with a Doctrine Evaluation Officer from the Headquarters of Army Training and Doctrine Command (MK PLDTD). The Pakistan Army was also represented by five (5) officers and 28 personnel from the 4thLight Commando Battalion (LCB).\nAs part of the closing ceremony, attendees witnessed a Clearance of Stronghold demonstration, followed by a formal Closing Parade.\nDuring the visit, the Malaysian delegation, led by the Commander of 2 Div, conducted courtesy calls on the Commander of the 23rd Division of the Pakistan Army and the Commandant of the NCTC.\nThe event was also attended by key dignitaries, including Malaysia’s Defense Adviser in Islamabad, Colonel Noraripin Othman, the Staff Officer 1 (Operations) of 2 Div HQ, Lt Colonel Ku Syairi Ahmad, the Commanding Officer of 5 RRD, Lt Colonel Chai Kean Seng and the First Secretary of the High Commission of Malaysia in Islamabad, Mr. Muhammad Zulasri bin Rosdi.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:30:03.881Z"
}
