{
  "title": "Pakistan to convert 30% vehicles to electric by 2030, Aleem Khan tells COP29",
  "link": "https://www.app.com.pk/national/pakistan-to-convert-30-vehicles-to-electric-by-2030-aleem-khan-tells-cop29/",
  "date_published": "2024-11-20T18:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP): Federal Minister for Communications, Privatization, and Board of Investment Abdul Aleem Khan on Wednesday announced that Pakistan aims to convert 30% of its vehicles to electric by 2030, under the government’s approved Electric Vehicle (EV) policy.\nThis ambitious target reflects Pakistan’s commitment to combating climate change and promoting sustainable transportation.\nThe Minister emphasized that significant steps are already underway to support the widespread adoption of electric vehicles in Pakistan. Aleem Khan assured that the government is actively working on infrastructure development for EVs, including the installation of charging stations, and enhancing public awareness about the benefits of electric mobility.\nLeading the Pakistani delegation at the two-day session on “Transport and Digital Middle Corridor and Beyond” at COP29 in Baku, Azerbaijan, Khan highlighted the participation of ministers and delegates from various countries including Turkiye, Georgia, Bulgaria, Netherlands, Kyrgyzstan, Romania, Italy, and Azerbaijan, as well as international organizations such as the UN, European Commission, UIC, IRU, and ITF.\nSpeaking at the Ministerial Roundtable, Aleem Khan underscored the urgent need for green urban transport solutions, renewable energy projects, and the adoption of electric vehicles to address the mounting challenges of population pressure and deteriorating air quality in major cities.\nAleem pointed out that Pakistan is already taking steps to implement essential infrastructure, such as EV charging stations, to ensure a smooth transition to electric mobility.\nAleem Khan also shared exciting developments, including the introduction of Karachi’s first fleet of biomethane hybrid buses, which are set to save 100% on fuel costs. Furthermore, Aleem noted that the National Green Transport Project may explore Public-Private Partnership (PPP) models to ensure long-term sustainability and success.\nDuring the forum, the minister stressed the pressing need for developing countries to confront the dual challenges of climate change and smog, which severely impact human health and quality of life. Minister called for targeted, micro-level interventions in the transport sector to bring about tangible and lasting change.\nIn addition, Aleem Khan participated in the session on “Digital Middle Corridor and Beyond,” which focused on green technology, smog reduction, and the digitalization of the transport sector. He noted that the forum provided valuable opportunities for knowledge exchange and the formulation of actionable, long-term policies.\nAleem Khan extended special thanks to Azerbaijan’s Minister of Transport Rashid Nabiov and Minister of Economy Mikael Jabarov, noting fruitful discussions with ministers and delegates from other participating countries.",
  "retrievedAt": "2025-08-10T15:28:15.597Z"
}
