{
  "title": "CDA to auction prime luxury hotel plots for overseas investors by Dec 17",
  "link": "https://www.app.com.pk/national/cda-to-auction-prime-luxury-hotel-plots-for-overseas-investors-by-dec-17/",
  "date_published": "2024-11-20T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP):Capital Development Authority (CDA) was informed on Wednesday that two luxury hotel plots have already been offered for international auction by 17th December, 2024 targeting overseas Pakistanis and companies.\nIt was disclosed in a meeting chaired by CDA chairman which discussed best possible options for utilizing hotel plots in Islamabad.\nThe meeting focused projects specifically designed for overseas Pakistanis, offering lucrative investment opportunities in Islamabad’s thriving real estate sector.\nThese projects aim to attract investments and foster economic growth while providing a platform for overseas Pakistanis to contribute to their homeland’s development.\nDuring the meeting, Chairman CDA received a detailed briefing on integrated solid waste management for the capital city. It was highlighted that the study on solid waste management has been thoroughly reviewed, and bidding documents for outsourcing the services are finalized and undergoing review.\nThe incorporation of a specialized solid waste management company with the Securities and Exchange Commission of Pakistan (SECP) is actively being pursued.\nThe meeting was also briefed about the way forward for unsolicited proposals received by CDA. The preliminary assessments of unsolicited proposals for waste management were also discussed.\nThe chairman directed further evaluation of these proposals to ensure viability and efficiency of the proposals received so far.\nRandhawa was also briefed on IT initiatives to digitize and modernize the city’s infrastructure.\nThe recently introduced digital parking system is one of many measures aimed at enhancing service delivery for Islamabad’s residents through advanced technological solutions.\nThe authority chairman emphasized the importance of transparency, innovation, and citizen-centric planning and efficient public service delivery in all CDA initiatives.\nHe reaffirmed CDA’s commitment to making Islamabad a model city by implementing sustainable, forward-looking, and inclusive development initiatives and projects\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:28:57.412Z"
}
