{
  "title": "IT exports surge by 42% due to prudent govt policies: Daniyal",
  "link": "https://www.app.com.pk/national/it-exports-surge-by-42-due-to-prudent-govt-policies-daniyal/",
  "date_published": "2024-11-20T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP): The country’s IT exports have risen by 42 percent compared to the previous corresponding period, due to the government’s effective policies, Parliamentary Secretary for Information and Broadcasting Barrister Daniyal Chaudhry said Wednesday.\nSpeaking at a news conference, he stated that in the first four months, the country’s IT exports have doubled compared to the same period last year. He also noted that the Federal Board of Revenue (FBR) has met its highest-ever tax collection targets.\nHe mentioned that the Pakistan Muslim League-Nawaz (PML-N) has always led the country out of crises whenever it came to power, even when the country was in ruins, and that PML-N was the only political party voted into power based on its performance. He also highlighted that in September, the country’s IT exports increased by $292 million, with total exports nearing the $1.3 billion mark.\nHe stated that performance is the sole criterion for earning the people’s mandate on multiple occasions. PML-N took power during challenging times, while PTI spread claims that the country was on the brink of default. They also alleged that the budget would be anti-poor. Despite this propaganda, the government provided relief to the people through the budget.\nHe stated that the country was on the path to progress due to the government’s persistent efforts, noting a 16% growth in the livestock and agriculture sectors. He further projected that the country’s agricultural growth would triple over the next 1.5 to 2 years.\nHe stated that Pakistan will be transformed into an Asian tiger by rejecting the forces aiming to incite unrest and destruction in the country.\nHe stated that the politics of destruction must end. We must decide whether we stand with progressive thinking or with the enemies of the country who seek to bring about destruction and unrest.\nThe country’s manufacturing sector has shown a 5.86 percent growth. The PTI leadership is aware that the country’s progress signifies political demise for their party. They were unsettled by the decline in inflation to single digits, the reduction in interest rates from 22 percent to just 15 percent, and the stock market index reaching unprecedented heights.\nThe government has effectively demonstrated that the country is safe for investment, as economic indicators continue to show steady growth.\nCriticizing Pakistan Tehreek-e-Insaf (PTI), he stated that despite ruling Khyber Pakhtunkhwa for eleven years, PTI has nothing to show for it. Citing the example of the Bus Rapid Transport (BRT) project in Peshawar, he pointed out that the cost of the project had risen from Rs 7 billion to Rs 11 billion, and in the end, the doors were installed in the wrong direction.\nDue to PTI’s frequent protests, the country faced daily losses of $5 to 6 million from the closure of internet services, with IT companies suffering losses in the millions. The federal capital alone incurred a loss of Rs 4 billion, in addition to affecting 800,000 people. Non-state actors were also disturbed by the improving economy. The politics of destruction will not be tolerated, and strict action will be taken against those seeking to disrupt peace and hinder economic progress.\nResponding to a question, he stated that PTI will be assisted if they hold a public meeting peacefully after obtaining approval; however, closing down a metropolitan city will not be allowed.",
  "retrievedAt": "2025-08-10T15:28:41.684Z"
}
