{
  "title": "HRW warns of migrant worker deaths in 2034 World Cup hosts Saudi Arabia - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Human Rights Watch on Wednesday said grave abuses were being committed on giant construction sites in Saudi Arabia and warned the risks to migrant workers could increase as the building of stadiums for the 2034 World Cup gathers pace.\n\nHRW said that “scores of migrant workers in Saudi Arabia die in gruesome yet avoidable workplace-related accidents, including falling from buildings, electrocution, and even decapitation”.\n\nThe NGO, which has studied nearly 50 cases of deaths in Saudi Arabia, said Saudi authorities had “failed to adequately protect workers from preventable deaths, investigate workplace safety incidents, and ensure timely and adequate compensation for families” including through life insurance policies and benefits to survivors.\n\n“The risks of occupational deaths and injuries are further increasing as the Saudi government ramps up construction work for the 2034 World Cup as well as other ‘giga-projects’,” HRW added.\n\nThe Gulf kingdom was handed the right to host the 2034 World Cup at a FIFA Congress last December despite concerns about its human rights record, the risks to migrant labourers and criminalisation of same-sex relationships. It was the only candidate.\n\nThe NGO called on FIFA to ensure all work-related deaths in Saudi Arabia are properly investigated and that bereaved families receive compensation.\n\nFIFA has committed to establishing a workers’ welfare system, which it says includes “dedicated mandatory standards and enforcement mechanisms applicable to all companies and workers involved in… World Cup-related construction and service delivery” in Saudi Arabia.\n\nBut HRW said football’s world governing body did not provide “details on concrete measures to prevent, investigate, and compensate migrant worker deaths such as risk-based heat protection measures or life insurance”.\n\nThe NGO claimed “FIFA is knowingly risking yet another tournament that will unnecessarily come at a grave human cost”, referencing the decision to award the 2022 World Cup to Qatar.\n\nSimilar concerns over workers’ welfare dogged Qatar ahead of its hosting of international football’s showpiece tournament.\n\nAmnesty International and other rights groups claimed thousands of migrant workers died in the lead-up to the 2022 tournament, though Doha has said only 37 workers on World Cup projects perished — and only three in work-related accidents.\n\nHRW stated in its report that the majority of migrant worker deaths in Saudi Arabia are attributed to “natural causes” and are therefore neither investigated nor compensated.\n\nAccording to figures provided by the NGO, for example, 74 percent of 1,420 Indian migrant worker deaths recorded at the Indian embassy in Riyadh in 2023 were attributed to natural causes.\n\nHRW added “even work-related death cases categorised as such in a migrant worker’s death certificate are sometimes not compensated as they should be according to Saudi law and international labour standards”.\n\n“In migrant death cases that are compensated, the process is long and burdensome,” the report said, providing an example of one such compensation process that took a decade to be completed.\n\n“My sons are 11 and 13 years old. When my husband died, they were 11 months and two years old. If we had received compensation right after his death, it would have provided so much relief,” the wife of a deceased worker, who was not named, told HRW.\n\nIn response to the report, FIFA shared with AFP a letter it sent last month to HRW from its secretary general Mattias Grafstrom.\n\nThe letter says Saudi Arabia has “in the past years been investing heavily in the development of its society and economy”, using international companies.\n\nGrafstrom notes that Saudi Arabia “has taken significant steps to reform its labour laws since 2018”, including the abolition of parts of the kafala system which ties workers to their employers, and introducing standardised contracts for workers.\n\nThe Saudi government, he says, has also committed to working with the United Nations’ International Labour Organization (ILO) “on the further expansion and effective implementation of these reforms”.\n\n“In line with its human rights commitments, FIFA seeks to play its part in ensuring strong protections for workers employed by third parties in the construction of FIFA World Cup sites,” Grafstrom adds.\n\nAFP has also contacted the Saudi government for comment.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:14:14.595Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911097/hrw-warns-of-migrant-worker-deaths-in-2034-world-cup-hosts-saudi-arabia",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:53:08.000Z"
}
