{
  "title": "Pakistan invites India for ‘comprehensive dialogue’ on Kashmir - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PM Shehbaz asserts Islamabad ready for both war and peace\n• Shares with UN chief concerns about inflammatory remarks by Delhi\n• Pakistan returns Indian border guard\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Wednesday invited India to a comprehensive dialogue to address all contentious issues, including the Kashmir dispute and the water distribution, between the two nuclear-armed neighbours.\n\nThe prime minister floated this offer during his visit to the frontline area of Pasrur Cantonment in Sialkot, where he lauded the armed forces for giving an exemplary response to India under the ‘Operation Bunyanum Marsoos’ conducted in response to Indian strikes inside Pakistan following the Pahalgam incident. Pakistan had struck 26 Indian military facilities, including its airbases, using jets and missiles.\n\nHe said Pakistan’s response to the Indian attack on May 6-7 caused huge losses to the neighbouring country, in which the Pakistan Air Force downed multiple Indian Rafale aircraft. In reference to the Pakistani strikes on 26 military targets, the PM said Pakistan had “avenged” the 1971 war.\n\n“You have taken revenge for the 1971 war…and now the whole nation is standing with you,” PM Shehbaz told troops during his address. He warned Indian Prime Minister Narendra Modi against future aggression.\n\n“If you again attack us, you will lose everything…,” the PM said in a warning to his Indian counterpart. “We are ready for war and dialogue. Now the choice is yours,” he said.\n\nWith reference to PM Modi’s recent address to the nation, PM Shehbaz said: “Do not dictate us. Water is our red line; don’t even think about diverting our water. Yes, water and blood do not flow together. You have also hit our Neelum-Jhelum water project. If the damage was severe, we could have destroyed your major dams, including Baglihar Dam.”\n\nPM Shehbaz again asked PM Modi to shun differences and sit for a dialogue. “Let us extinguish this fire. Let us sit together to talk on Kashmir and water,” he added.\n\nAfter the Pahalgam attack, India put the water treaty with Pakistan in abeyance, prompting a strong response from Pakistan. In an interview with an Indian media outlet last week, World Bank President Ajay Banga said there was no suspension clause in the Indus Waters Treaty.\n\n“There is no provision in the treaty to allow for suspension the way it was drawn up. It either needs to be gone, or replaced by another one, and that requires the two countries to want to agree,” he said. He also said that the bank played no decision-making role and acted solely as a facilitator.\n\nPM Shehbaz said the blatant aggression against innocent civilians resulting in the martyrdom of children, women and the elderly and calling them terrorists was utterly shameful and against all international laws, norms and morality.\n\nAccording to the PM, despite Pakistan’s offer for a neutral probe, India deliberately evaded this path, as it had nothing to prove, and India launched the offensive based on a false pretext and bloated arrogance and ego, “for which it has got a very befitting response”.\n\nDuring the visit, the prime minister received a comprehensive briefing on the conduct of the battle and the current operational preparedness of the troops. He met the officers and soldiers actively participating in the military operation, a statement issued by the Prime Minister’s Office said.\n\nIn a show of continued support for all branches of the military, the prime minister is scheduled to visit various air bases and naval bases in coming days to meet troops of the Pakistan Air Force and Pakistan Navy.\n\nThe PM noted that Pakistan had agreed to the ceasefire understanding in the larger interest of peace in the region. He reaffirmed Pakistan’s strong resolve to promote peace in South Asia, while defending its sovereignty and territorial integrity at all costs.\n\nConcerns shared with UN chief\n\nIn his afternoon telephone call with UN Secretary General Antonio Guterres, the premier expressed his deep appreciation for the UN secretary general’s leadership and diplomatic efforts to defuse the situation in South Asia.\n\nHe stated that the UN chief’s continued engagement and preventive diplomacy demonstrated his enduring commitment to the protection of the UN Charter’s principles and purposes, as well as to fostering peace in South Asia.\n\nThis was the third phone call between the two leaders in the last two weeks.\n\nHe also expressed concern over the continued provocative and inflammatory remarks made by the Indian leadership, which were a threat to the fragile regional peace. He emphasised that the just resolution of the Jammu and Kashmir dispute, in accordance with UN Security Council resolutions, was imperative to ensuring durable peace in South Asia.\n\nThe UN secretary general welcomed the ceasefire, while expressing condolences over the loss of civilian lives. He expressed his commitment to continued engagement with both sides to advance regional peace and stability.\n\nSpeaks to UAE president\n\nPM Shehbaz held a telephone conversation with Sheikh Mohamed bin Zayed Al Nahyan, president of the United Arab Emirates.\n\nAccording to a statement, the PM conveyed profound gratitude for the UAE’s diplomatic efforts and constructive role during the recent crisis. He added that the UAE had stood by Pakistan through thick and thin.\n\nPM Shehbaz also met Khazar Farhadov, Ambassador of Azerbaijan to Pakistan, in Islamabad and expressed profound gratitude to President Ilham Aliyev for the unwavering solidarity and support during the recent tensions with India.\n\nIndian guard repatriated\n\nPakistan returned a captured border guard to India on Wednesday, reported AFP. The guard was captured a day after the April 22 Pahalgam attack, which killed 26 people and sparked tit-for-tat missile, drone and fighter jet attacks.\n\nNo group claimed responsibility for the attack, but India blamed Pakistan. Islamabad rejects the accusations and has called for an independent probe.\n\n“Purnam Kumar Shaw, who had been in the custody of Pakistan Rangers since April 23, was handed over to India,” India’s Border Security Force said in a statement.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/15075130291b73f.png",
  "retrievedAt": "2025-10-12T03:05:13.514Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911132/pakistan-invites-india-for-comprehensive-dialogue-on-kashmir",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:52:48.000Z"
}
