{
  "title": "The fallout - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE battle is over. Now brace for the fallout. This changes everything. Rarely have we seen fortunes reverse as rapidly as they just did.\n\nThe military’s standing has skyrocketed, and a long line will now form outside the general’s door of people and groups and parties waiting their turn to shower him with honorifics. Banners are going up in cities, ads in newspapers, by business and industry groups.\n\nLet’s start with this. India’s aggressive intent regarding Pakistan has been made so clear now that there is no room left for debate on the need for defence preparedness. The J-10s that brought down the Rafales had been procured in 2022, the year Pakistan came close to default. In hindsight, it was a necessary decision. Remember the rushed summoning of a joint session of parliament in January 2022, during which the amendments to the State Bank Act were passed within minutes of being tabled? All that was done to hurriedly comply with IMF requirements that the government had spent the previous year resisting.\n\nThe programme review received Board approval on Feb 2, 2022, paving the way for the release of $1 billion from the facility that had been stalled since the outbreak of Covid. The first batch of six J-10Cs landed in PAF base Minhas in Kamra on March 4, barely four weeks later.\n\nThe second batch of six landed on Aug 30, literally days after the IMF Board approved another tranche of $1.1bn. And the subsequent batches all landed in the months ahead. At the time it was possible to ask questions about why a country that was struggling with husbanding its foreign exchange reserves should be buying such advanced fighter planes. But not anymore.\n\nReality is stubborn, and two things bring home reality better than anything else: war and the economy.\n\nFor someone who has been a peace dove all his life, who has advocated for redirection of defence expenditures towards peaceful, development purposes, these words are not easy to write. But reality is stubborn, and two things bring home reality better than anything else: war and the economy.\n\nBoth are enterprises ruthless in exacting the costs of folly and mistakes. Neither of the two can be wished away, spun into something other than what they are, or otherwise argued away.\n\nThe reality today is that Pakistan faces an adversary to the east that requires the highest levels of preparedness to confront. Two nuclear powers have never before exchanged missile fire of this magnitude. No nuclear power has initiated hostilities against another on the basis of a casus belli manufactured out of thin air.\n\nIn the case of Pahalgam, no evidence linking Pakistan to the attack has been provided. Not even an iota. In fact, at the time the Indian authorities had started blaming Pakistan they could not even answer simple questions about the attack in Pahalgam. How many attackers were there? What weapons did they carry? How many bullets were fired? What route did they take to get to the site? What conveyance did they use? How did they leave the site? Were they in touch with any handlers during the attack? And so on.\n\nThis is irresponsible behaviour on the part of a nuclear-armed state. It was also extreme recklessness to use the dual-use, nuclear-capable Brahmos missile to attack Pakistani cities and air force bases during the missile exchanges. These actions — leaping to kinetic hostilities even before any evidence has come in, using nuclear-capable missiles for delivery of conventional payloads — belie a political intent behind the aggression.\n\nIt is hard to figure out what military objectives India sought to achieve through this war. It is easier to see that their political leadership is using a muscular assertion of military power to score political points back home.\n\nExcept it backfired. As per the political script, Pakistan was supposed to wilt in the face of such bellicosity and aggression. Instead, Pakistan fired back and they hurried to call for a ceasefire. Perhaps they thought that because Pakistan is strapped for cash and on an IMF programme, relatively isolated from the world, it will not be able to take fire for very long and will sue for peace early in the engagements.\n\nWhatever the calculus at the other end, it is clear now that Pakistan has no option but to upgrade its defences and prepare for another round. India was once living proof that a pluralist democracy is not a luxury only rich countries can afford. But its democracy succumbed to demagoguery almost a decade ago. Now that the demagogue whom they have elected as their prime minister, a man who has told his citizenry that he is not naturally born but a divine being sent down with a mission, is consolidating his place and using war as entertainment with which to power his politics. Pakistan cannot take this threat lightly.\n\nAs the government prepares its budget for fiscal year 2026, it will have to keep in mind the elevated requirements that will come from the upgradation of its defences and replenishment of inventory consumed during the war.\n\nEverybody will seek to ride on the revitalised political capital of the military. Politicians and business leaders will compete with each other to sing their praises, and try to weld their own particular interests with those of the military. ‘You need dollars to maintain readiness, and we exporters can bring you dollars’, they will say. ‘But we need the cost of doing business to be brought down to be able to do so’, and so on.\n\nThe government, which was looking forward to a little more fiscal space in the year ahead compared to the year past, will have to postpone some of its plans to spend its way back into people’s hearts perhaps. And the opposition, the poor PTI, lost at sea as they already were after the collapse of their ‘final call’ last November, will struggle to find its voice amid the din of applause for the military. This is what the fallout of the war will look like.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682551c65f80e.jpg",
  "retrievedAt": "2025-08-23T14:13:57.272Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911140",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T02:31:35.000Z"
}
