{
  "title": "Over 300 Haj pilgrims arrive in Jeddah as 2nd phase of Road to Makkah initiative launched - Pakistan - DAWN.COM",
  "author": null,
  "content": "The first of 180 Pakistani Hajj flights scheduled to fly to Saudi Arabia’s Jeddah — part of the Road to Makkah Initiative — arrived at the King Abdul Aziz International Airport from Islamabad carrying 310 Haj pilgrims, the Associated Press of Pakistan reported today.\n\nLaunched in 2019 at the Islamabad airport and later extended to Karachi, the Road to Makkah initiative offers an exemption to Haj pilgrims from the immigration process at Saudi airports by clearing them at their respective airports in Pakistan by Saudi immigration officials before boarding their flights.\n\nMarking the second phase of the initiative, the passengers were received at the airport by Minister of Religious Affairs & Interfaith Harmony Sardar Muhammad Yousaf, Consul General of Pakistan in Jeddah Khalid Majid, DG Hajj Abdul Wahab Soomro and the senior officers of the Consulate General of Pakistan. The pilgrims were presented bouqets by the receiving party.\n\nThis year, an estimated 50,500 Haj pilgrims will travel to Saudi Arabia under the initiative, with 28,000 departing from Islamabad and 22,500 from Karachi throughout 180 flights, out of which 100 will depart from Islamabad and 80 from Karachi.\n\nHousing and other essential facilities have been arranged for all the pilgrims, including service personnel such as medical staff and officials from the Ministry of Religious Affairs, to facilitate the Haj pilgrims.\n\nIn April, a Saudi immigration team arrived in the country to process Pakistani Haj pilgrims at Jinnah International Airport and Islamabad International Airport.\n\nIn 2025, Pakistan’s Haj quota was set at 179,210, with half of the quota meant to be managed by private Haj operators. However, only 23,000 people were able to go under private operators.\n\nHaj, one of the fundamental pillars of Islam, is performed each year by millions of Muslims worldwide. Pakistan receives one of the highest Haj quotas from Saudi Arabia.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:13:56.261Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911187/over-300-haj-pilgrims-arrive-in-jeddah-as-2nd-phase-of-road-to-makkah-initiative-launched",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T09:06:01.000Z"
}
