{
  "title": "Grenade attack on PPP rally in Quetta leaves two dead - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: A Pakistan Peoples Party (PPP) rally came under grenade attack in Quetta on Wedn­esday, leaving a party worker and another man dead, police said. Ten persons were injur­ed.\n\nThe PPP rally led by its former Balochistan chapter president Ali Madad Jattak and MPA Obai­dullah Gorgag was on its way to Railway Hockey Stad­ium to attend a public meeting to celebrate Paki­s­tan’s victory against the recent Indian aggression when it was attacked, officials said.\n\nEyewitnesses said arm­ed men before hurling hand grenades fired into the air as the rally was passing through Munir Mengal Road in the Sariab area.\n\nAli Madad Jattak and Obaid Gorgag, who were leading the rally, rema­ined unhurt as their personal guards covered them before shifting them away, they said.\n\nPolice official Asif Ghafoor said, “The grenade exploded near the rally, injuring 11 party workers.” He said the injured were rushed to the Trauma Centre of the Civil Hospital, Quetta. “A PPP worker, Mehboob Ali Kurd, who received multiple injuries, lost his life during treatment at the hospital,” said Dr Wasim Baig.\n\nWhile the law enforcement agencies immediately cordoned off the blast site and launched a search operation to trace out the attackers, most participants in the rally continued their journey towards the stadium where they later attended the public meeting.\n\nHospital sources said nine of the 10 injured were identified as Qurban Ali, Abdul Razaaq, Muhammad Asim, Muhammad Umar, Abdul Manan, Syed Naqibullah, Imran Khan, Mohammad Sadiq and Maharullah.\n\nAnother man passing through the area in a rickshaw also died during treatment, hospital sources said. His identity, however, could not be ascertained till the filing of this report in the late hours of Wednesday night.\n\nBalochistan Chief Minister Mir Sarfraz Bugti has strangely condemned the grenade attack at the political rally and said the elements involved in the terrorist attack would be brought to justice.\n\nHe expressed grief over the casualties and visited the hospital to inquire after the injured. He directed the health authorities to provide the best available treatment to them.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1508123754c1ce5.jpg",
  "retrievedAt": "2025-08-23T14:14:27.375Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911130/grenade-attack-on-ppp-rally-in-quetta-leaves-two-dead",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:52:48.000Z"
}
