{
  "title": "Bangladesh to receive $1.3bn from IMF - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: The International Monetary Fund (IMF) is set to release $1.3 billion to Bangladesh in June, after completing a fourth review of its $4.7-billion loan programme and a key breakthrough in talks on exchange rate reforms, the finance ministry said.\n\nThe funds, covering both the fourth and fifth tranches, had been held up as the IMF pressed for greater exchange rate flexibility, particularly the adoption of a crawling peg mechanism.\n\nThe fourth review in Dhaka in April was followed by further discussions during the Bank-Fund Spring Meetings in Washington DC that month, focused on critical reforms in revenue management, fiscal policy, and the foreign exchange regime.\n\n“After carefully reviewing all the issues … both parties have agreed on the revenue management, currency exchange rate and other reform frameworks,” the finance ministry said in a statement on Wednesday.\n\nWith completion of a staff-level agreement on the fourth review, the IMF is expected to release $1.3 billion set for the fourth and fifth installments together by June, it added.\n\nThe government has also dissolved the National Board of Revenue (NBR), replacing it with two divisions under the finance ministry, to meet a key IMF condition.\n\nOne division will handle tax policy with the other managing tax collection and administration, aiming to enhance efficiency, transparency, and accountability, the government said.\n\nIn addition to the IMF funds, the government expects budget support of $2 billion from development partners, the finance ministry added.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2022/07/62e0ae86496b3.jpg",
  "retrievedAt": "2025-08-23T14:14:13.909Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911116/bangladesh-to-receive-13bn-from-imf",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:53:15.000Z"
}
