{
  "title": "Pakistan welcomes US decision to lift sanctions on Syria, calls it ‘pivotal step towards regional stability’ - World - DAWN.COM",
  "author": null,
  "content": "Pakistan has welcomed the United States’ decision to lift all sanctions on Syria, terming the move a “pivotal step towards regional stability”, according to a statement from the Foreign Office.\n\nUS President Donald Trump, on his Gulf tour, met with Syrian President Ahmed al-Sharaa on Wednesday. Despite concerns within sectors of his administration over Syria’s leaders’ former ties to Al Qaeda, Trump said on Tuesday during a speech in Riyadh that he would lift sanctions on Syria in a major policy shift.\n\n“Pakistan has consistently advocated for constructive engagement and dialogue. The easing of sanctions is expected to facilitate economic growth, improve access to essential services, and support the rebuilding efforts of the Syrian authorities,” the FO statement read.\n\nReaffirming Pakistan’s commitment towards Syria’s unity, sovereignty, and territorial integrity, the statement said, “Pakistan supports a Syrian-led and Syrian-owned resolution.”\n\n“We commend the commitment of all countries, in particular the US, Turkiye, Saudi Arabia, and Qatar, working constructively towards a peaceful Syria,” the statement read.\n\nThe decision is a major boost for Sharaa, who has been struggling to bring the country under the control of the Damascus government after toppling former President Bashar al-Assad in December.\n\nAccording to Al Jazeera, the US was one of many countries that sanctioned Syria under the al-Assad regime (1971–2024). It labelled Syria a “State Sponsor of Terrorism” in 1979, triggering arms and financial restrictions.\n\nSanctions expanded in 2004 and intensified after the 2011 war, targeting regime-linked individuals, freezing assets, banning US investments, and restricting oil imports.\n\nThe US also offered a $10 million reward for Syria’s current leader, al-Sharaa, and designated his former group, Hayat Tahrir al-Sham, a “Foreign Terrorist Organisation”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:13:53.086Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911207/pakistan-welcomes-us-decision-to-lift-sanctions-on-syria-calls-it-pivotal-step-towards-regional-stability",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T11:58:37.000Z"
}
