{
  "title": "Trump asks Syria to establish ties with Israel - World - DAWN.COM",
  "author": null,
  "content": "DOHA: US President Donald Trump met Syria’s president in Saudi Arabia on Wednesday and urged him to normalise ties with longtime foe Israel after a surprise US announcement that it would lift sanctions on the new government.\n\nTrump then flew to Qatar, where he oversaw the signing of a deal for the Gulf Arab country to buy jets from US manufacturer Boeing.\n\nHe did not mention a controversial separate offer by Qatar to donate a Boeing jet to serve as the US president’s official airplane. That would be one of the most valuable gifts ever given to the US and it has triggered alarm in Washington over its security and ethics implications.\n\nUS president oversees Boeing jets deal during visit to Qatar\n\nAfter Trump’s declaration that he would lift sanctions on Syria, he met interim President Ahmed al-Sharaa, who swept to power at the head of a group that Washington has called a terrorist organisation and once pledged allegiance to Al Qaeda.\n\nAccording to the White House, Trump urged Sharaa to join the United Arab Emirates, Bahrain and Morocco, which normalised relations with Israel under the US-brokered Abraham Accords in 2020. “I told him, ‘I hope you’re going to join when its straightened out. He said, Yes. But they have a lot of work to do,” Trump said, according to a White House pool report.\n\nPhotos posted on Saudi state television showed the two men shaking hands in the presence of Saudi Arabia’s Crown Prince Mohammed bin Salman. Trump said the meeting with Sharaa, who he described as a young, attractive guy with a very strong past, was “great”.\n\n“He’s got a real shot at holding it together,” said Trump. Trump’s four-day visit highlights the United States’ growing ties to the oil-rich region, where his real-estate company is also developing several projects.\n\nTrump’s Middle East trip — which does not include a visit to Jerusalem — has fuelled doubts in Israel about where the country stands in Washington’s priorities.\n\nIsrael opposes lifting sanctions on Syria, which would clear the way for greater engagement by humanitarian organisations and boost foreign investment. But Trump told reporters the fact he has relationships with countries in the Middle East is “very good for Israel”.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682534e24490e.jpg",
  "retrievedAt": "2025-10-12T03:05:08.389Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911119/trump-asks-syria-to-establish-ties-with-israel",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:52:53.000Z"
}
