{
  "title": "Maryam announces metrobus for Faisalabad, seals petrol pump in Kamoke - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH/GUJRANWALA: Chief Minister Maryam Nawaz Sharif on Wednesday unveiled development plans for Faisalabad, including a metrobus service and electric buses. She also carried out a surprise visit to Kamoke in Gujranwala, where she sealed a petrol pump for under-measuring fuel and reviewed sanitation efforts.\n\nAddressing the Laptop and Talent Scholarship Phase II ceremony at GC University Faisalabad, Ms Nawaz announced that a metrobus service will be launched in Faisalabad next year, alongside the introduction of green electric buses. She added that a comprehensive development plan, modelled on Lahore, would be implemented for Faisalabad, extending to its surrounding cities and villages, which would be transformed into model communities.\n\nShe said the nation’s recent victory against the enemy had been possible only due to unity among the leadership, armed forces and the people. “We were up against a big enemy, but the Pakistani forces fought bravely, and the nation stood together,” she said. “We not only won the war, but also secured a brighter future for our country.”\n\nShe paid tribute to those who made sacrifices for the country’s defence and reminded the audience that jets like the Rafale, once thought invincible, were brought down by Pakistan’s JF-17 Thunder jets. Referring to the nuclear tests of 1998, she said Nawaz Sharif made a bold decision despite international pressure and sanctions.\n\nIn Kamoke, Ms Nawaz conducted a surprise inspection of various areas, ordering a petrol pump to be sealed after it was caught under-measuring fuel.\n\nShe checked several fuel stations, visited GT Road Kamoke, service roads, Tiba Muhammad Nagar, Kasoki Road underpass, and surrounding areas under the Suthra Punjab (Clean Punjab) campaign. She expressed displeasure over poor sanitation and directed daily waste collection and strict action against violators.\n\n“No garbage heaps will be tolerated in any locality,” she warned, urging public cooperation. Ahead of the monsoon season, she instructed officials to clean drainage systems and repair open or broken sewer covers.\n\nThe chief minister also ordered renovation, painting, and lighting of the Kasoki Road underpass for public safety.\n\nAssistant Commissioner Kamoke Maham Wahid and local authorities were directed to ensure the complete removal of encroachments.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:05:06.535Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911053/maryam-announces-metrobus-for-faisalabad-seals-petrol-pump-in-kamoke",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:53:28.000Z"
}
