{
  "title": "Israeli bombardment kills 80 Palestinians - World - DAWN.COM",
  "author": null,
  "content": "• Mahmud Abbas says Netanyahu wants to continue the war ‘for his own reasons’\n• Italy’s premier warns humanitarian situation in Gaza Strip ‘ever more dramatic and unjustifiable’\n\nGAZA CITY: Gaza rescuers said at least 80 people were killed in Israeli bombardment across the Palestinian territory on Wednesday, as the IDF intensified their massive invasion of the conflict-stricken Palestinian territories.\n\nCivil defence official Mohammed al-Mughayyir said 80 people had been killed by Israeli bombardment since dawn, including 59 in the north.\n\nFootage from the aftermath of a strike in Jabalia, northern Gaza, showed mounds of rubble and twisted metal from collapsed buildings. Palestinians, including young children, picked through the debris in search of belongings.\n\nFootage of mourners in northern Gaza showed women in tears as they kneeled next to bodies wrapped in bloodstained white shrouds. “It’s a nine-month-old baby. What did he do?” one of them cried out.\n\nHasan Moqbel, a Palestinian who lost relatives, said: “There are no homes fit for living. I have no shelter, no food, no water. Those who don’t die from air strikes die from hunger, and those who don’t die from hunger die from lack of medicine.”\n\nIsrael’s military on Wednesday warned residents in part of a Gaza City neighbourhood to evacuate, asserting that its forces would “attack the area with intense force”.\n\nPrisoners situation\n\nIsraeli Prime Minister Benjamin Netanyahu on Wednesday spoke to US envoy Steve Witkoff about the release of prisoner held in Gaza.\n\nNegotiations for the release of the captives held in Gaza have been ongoing, with the latest talks taking place in the Qatari capital Doha, where US President Donald Trump was visiting on Wednesday.\n\nNetanyahu’s office said the premier had discussed with Witkoff and his negotiating team the issue of the prisoners and the missing.\n\nWitkoff later said Trump had “a really productive conversation” with the Qatari emir about a Gaza deal, adding that “we are moving along and we have a good plan together”.\n\n‘Unjustifiable’\n\nFrom the occupied West Bank, Palestinian president Mahmud Abbas said on Wednesday he favoured a “ceasefire at any price” in Gaza, accusing Netanyahu of wanting to continue the war “for his own reasons”.\n\nMohammad Awad, an emergency doctor in northern Gaza’s Indonesian Hospital, said that supply shortages meant his department could not properly handle the flow of wounded from the Jabalia strike. “There are not enough beds, no medicine, and no means for surgical or medical treatment, which leaves doctors unable to save many of the injured who are dying due to lack of care”, he said.\n\nAwad added that “the bodies of the martyrs are lying on the ground in the hospital corridors after the morgue reached full capacity. The situation is catastrophic in every sense of the word.”\n\nIsrael imposed an aid blockade on the Gaza Strip on March 2 after talks to prolong a January 19 ceasefire broke down.\n\nUN Secretary General Antonio Guterres on Wednesday called for the immediate and unconditional release of all prisoners, unimpeded humanitarian access and an immediate cessation of hostilities in Gaza.\n\nItalian Prime Minister Giorgia Meloni said the humanitarian situation in Gaza was “ever more dramatic and unjustifiable”. A US-led initiative for aid distribution under Israeli military security drew international criticism as it appears to sideline the United Nations and existing aid organisations, and would overhaul current humanitarian structures in Gaza.\n\nMedical charity Medecins Sans Frontieres said the plan would make “aid conditional on forced displacement” and vetting of the population. It added in a statement that Israel was creating “conditions for the eradication of Palestinian lives in Gaza”.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/150924091e649e0.jpg",
  "retrievedAt": "2025-10-12T03:04:23.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911120/israeli-bombardment-kills-80-palestinians",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:52:53.000Z"
}
