{
  "title": "Germany aims to have Europe’s ‘strongest conventional army’ - World - DAWN.COM",
  "author": null,
  "content": "BERLIN: German Chancellor Friedrich Merz pledged on Wednesday to build up “the strongest conventional army in Europe” as the continent faces a hostile Russia while the Ukraine war rages on.\n\n“This is appropriate for Europe’s most populous and economically powerful country,” Merz told parliament. “Our friends and partners also expect this from us. Indeed, they practically demand it.”\n\nIn his first major address to the Bundestag since his government was inaugurated last week, Merz vowed to “provide all financial means necessary” for the long-underfunded defence forces.\n\nGermany, with its dark World War II history, has long been reluctant to spend big on its military and funding dropped off sharply after the Cold War as European countries relied on Nato heavyweight the United States for security.\n\nChancellor Merz vows to ‘provide all financial means necessary’ for underfunded defence\n\nUS President Donald Trump has demanded that Germany and other allies spend more on common defence and thrown into doubt Washington’s future commitment to the transatlantic military alliance.\n\nMerz has pledged a greater diplomatic and security role for Berlin in Europe at a time of high geopolitical tensions. He warned on Wednesday that “anyone who seriously believes that Russia would be satisfied with a victory over Ukraine or with the annexation of parts of the country is mistaken”.\n\nHis government has already cleared the way for a spending “bazooka” worth hundreds of billions of euros in extra funding for defence and infrastructure by getting a fiscal plan passed by the previous parliament. “Strengthening the Bundeswehr (armed forces) is our top priority,” Merz said.\n\n“The German government will provide all the financial resources the Bundeswehr needs to become Europe’s strongest conventional army.” “Strength deters aggressors, while weakness invites aggression,” he added.\n\nHe also emphasised continued support for Ukraine but also said that “we are not a party to war, and we don’t want to become one”.\n\n‘Strong together’\n\n“Our goal is a Germany and a Europe that are so strong together that we never have to use our weapons,” Merz said. “To achieve this, we will have to assume more responsibility within NATO and the EU.”\n\nFor now, the challenges are huge. In recent years, Germany’s Bundeswehr has been mocked for equipment failures, including helicopters that cannot fly and rifles that do not shoot straight.\n\nRussia’s full-scale invasion of Ukraine over three years ago jolted the centre-left former chancellor Olaf Scholz into action. He announced 100 billion euros ($112 billion) in extra defence spending, which has allowed Germany to meet the Nato target of 2pc of GDP.\n\nPublished in Dawn, May 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:04:24.842Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911113/germany-aims-to-have-europes-strongest-conventional-army",
  "dateList": "2025-05-15",
  "date_published": "2025-05-15T00:53:15.000Z"
}
