{
  "title": "MDCAT retake exam conducted in Sindh",
  "link": "https://www.app.com.pk/national/mdcat-retake-exam-conducted-in-sindh/",
  "date_published": "2024-12-08T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 08 (APP):Pakistan Medical and Dentil Council (PMDC) has conducted the Medical and Dental College Admission Test (MDCAT) retake exam-2024 across Sindh on Sunday.\nOn the directives of the Sindh high Court, Karachi the IBA University Sukkur was assigned the task to conduct the retake MDCAT exam across Sind.\nPesident PM&DC Prof. Dr. Rizwan Taj in a statement issued by PM&DC apprised that the exam was held in seven centers in five divisions including Karachi, Hyderabad, Shaheed Banazirabad, Sukkur and Larkana.\nA total 38,684 candidates appeared in the retake exam.\nDr. Rizwan Taj said that as the IBA University Sukkar was given the task to conduct the MDCAT retake exam, PM&DC assigned officers to observe the MDCAT retake exam at all the centers at the request of IBA University Sukkar.\nHe said that the examination commenced at 11:55 a.m. simultaneously across Sindh and was successfully concluded after a duration of three hours and 30 minutes. He visited all examination centers in Karachi during the MDCAT exams and met with Sakandar Asif Sheikh, Vice chancellor of IBA University Sukkar and Secretary of Health Sindh.\nPM&DC officers were also present at all the centers for supervision, he said and added that the provincial, divisional and district authorities including security agencies, FIA and IB were also deputed for necessary support. IBA Sukkur authorities gave fool-proof arrangements for the smooth conduct of the test.\nThe President PM&DC had a high high-powered vigilance committee meeting a day before the MDCAT examination with key stakeholders to discuss the preparations and security arrangements.\nAmong the participants were the Secretary Health Sindh, the Secretary universities and boards, special Secretary Home department and Vice-Chancellor of IBA University Sukkar and Director of examination PM&DC.\nThe discussions focused on enhancing coordination, streamlining examination logistics, and addressing any challenges faced by candidates during the process.\nHe emphasized the collaboration among provincial authorities, educational institutions, and examination bodies to maintain the maximum standards in medical education.\nProf.Taj highlighted that PM&DC is committed to ensuring uniformity and transparency in future examinations across the country. To achieve this, a dedicated committee of experts has been meeting regularly at PM&DC to develop a comprehensive plan for upcoming exams, emphasizing fairness and consistency in the evaluation process, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:57:52.331Z"
}
