{
  "title": "Tobacco industry shifting over manipulative tactics to influence public opinion: Experts",
  "link": "https://www.app.com.pk/national/tobacco-industry-shifting-over-manipulative-tactics-to-influence-public-opinion-experts/",
  "date_published": "2024-12-08T13:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP):The experts at a stakeholder seminar on Sunday highlighted that the Tobacco Industry under the garb of corporate giants is perpetrating manipulative tactics to influence public opinion hindering progress on public health.\nThe Sustainable Development Policy Institute (SDPI) hosted a high-level stakeholder seminar on “Unveiling the Smoke Screen: Tobacco Industry Interference and Monitoring in Pakistan” that convened local and global experts to stock take Tobacco Industry propaganda tactics to permeate misleading narrative regarding emerging tobacco products among the masses.\nSenior Research Associate, SDPI, Syed Ali Wasif Naqvi in his opening remarks underlined that the Tobacco Industry (TI) has long been a powerful force that hinders progress in global public health. In Pakistan, the battle against tobacco’s harmful influence has become increasingly complex, with corporate giants using a range of tactics to manipulate public opinion, influence policies, and obscure their detrimental impact, he added.\nA recent presentation by Consultant, Health Centre, SDPI, Dr. Waseem Iftikhar Janjua shed light on these insidious efforts, emphasizing the need for greater vigilance and transparency in monitoring tobacco industry activities. “The Southeast Asia Tobacco Control Alliance’s Tobacco Industry Interference Index (TII) revealed the extent of the industry’s meddling, including attempts to influence national policy through standardization bodies,” he said.\nDr. Janjua highlighted that Pakistan allows travelers to import tobacco and electronic products, which can be purchased at duty-free shops, raising concerns about the absence of proper regulations and protocols for dealing with the tobacco industry. A new initiative, the Tobacco Harm Reduction Project, has been launched to investigate the industry’s role in spreading tobacco-related harm in Pakistan, he added.\nAccording to research conducted by the Sustainable Development Policy Institute (SDPI), the tobacco industry has manipulated public media, with Radio Pakistan, a state-owned entity, being employed to promote pro-tobacco narratives. SDPI researchers reviewed nearly 20 hours of radio programming to assess the industry’s influence on public opinion, he said.\n“The tobacco industry, using strategies such as astroturfing, lobbying, and greenwashing, has sought to sanitize its image. In response, SDPI has actively engaged with government entities, including the Ministry of Health and the Pakistan Broadcasting Corporation, to expose these tactics. The institute has also released six op-eds and produced radio programs to counter the industry’s narrative, while utilizing social media platforms for broader outreach,” Dr Janjua said.\nSDPI’s research team, he said has been working on mapping the tobacco industry’s affiliates and front groups, reinforcing the importance of adhering to the World Health Organization’s Framework Convention on Tobacco Control (FCTC). This effort aims to identify and curb the industry’s future interference and its harmful effects on public health, he added.\nResearch Associate, University of Bath in global tobacco control, Dr. Sophie Braznell stressed that governments worldwide are increasingly susceptible to the tobacco industry’s influence, making it crucial to recognize all instances of interference. “Identifying these instances is the only tool we have to push back against their tactics,” she said.\nSTOP UK, Dr. Tracy Johnston pointed out that the tobacco industry’s claims of fostering economic growth through new investments in the pharmaceutical sector are misleading. These claims, often touted by the industry as part of its “transformation,” have been rejected by the global public health community.\nShe further emphasized that the economic growth promoted by the tobacco industry is contributing to an escalating health burden, which governments must address.\nDr. Siraj also revealed how the tobacco industry has tried to influence the implementation of the FCTC at the international level, including attempts to manipulate draft sections regarding transit routes for tobacco trade. Pakistan, with its key role in global tobacco trade routes, successfully resisted these attempts, quashing the industry’s influence over legislative processes.\nAt the local level, Sania Ali Khan, Technical Lead, STOP Project, Vital Strategies noted that the tobacco industry frequently engages in corporate social responsibility (CSR) initiatives, which, though legal, mask its damaging effects. “The tobacco industry is responsible for the deaths of 274 people daily and the addiction of 1,200 youth each day. Yet, they continue to present themselves as socially responsible by investing in welfare programs,” she said.\nKhan also highlighted the need for a crackdown on celebrities who promote tobacco products and nicotine pouches through advertising.\nSenior Technical Lead, Vital Strategies, Pakistan for stronger tobacco control policies, Khurram Hashmi emphasized that although there have been significant efforts to curb tobacco proliferation, the interference of the tobacco industry remains a critical issue. “SDPI is actively fighting this battle, and we are committed in moving this cause forward to protect public health,” he concluded.\n“As the tobacco industry continues to challenge public health efforts, organizations like SDPI are pushing back by exposing its tactics, calling for stronger regulations, and ensuring that public policies prioritize the health of the population over corporate interests. The fight is far from over, but with continued research, public awareness, and international cooperation, there is hope for a tobacco-free future,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:57:33.217Z"
}
