{
  "title": "Musical evening at PNCA captivates audience with mesmerizing performances",
  "link": "https://www.app.com.pk/national/musical-evening-at-pnca-captivates-audience-with-mesmerizing-performances/",
  "date_published": "2024-12-08T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 08 (APP):A spectacular musical evening titled “Sham-e-Mauseeqi” was held at the Pakistan National Council of the Arts (PNCA) on Sunday evening, captivating the audience with brilliant performances.\nThe event, graced by Director General PNCA, Muhammad Ayoub Jamali, as the chief guest, drew a large crowd of music enthusiasts from the capital.\nThe evening featured captivating performances by renowned artists such as Sitara Younis and singer Naseem Siddiqui, while the program was eloquently hosted by Tasawwar Zaman Babar. Their performances left the audience mesmerized, showcasing a blend of Sufi poetry, folk melodies, and timeless ghazals. Among the highlights were iconic renditions of Dil Dhadakne Ka Sabab Yaad Aya and Rafta Rafta Woh Meri, which had the audience swaying and clapping along.\nThe event also included a special segment on instrumental music, emphasizing its significance in enriching cultural expressions.\nAdding to the evening’s charm, the Raasta Band delivered a high-energy performance that was met with thunderous applause from the audience.\nThe two-hour cultural extravaganza successfully celebrated Pakistan’s artistic diversity and left attendees thoroughly entertained.\nEarlier, in his opening remarks, Director General PNCA, Ayub Jamali dedicated the evening to the people of Islamabad, highlighting the role of PNCA in promoting Pakistan’s rich cultural heritage.\nHe praised the outstanding performances of the participating artists, acknowledging their talent and contribution to the country’s cultural landscape.\nAyub Jamali noted that PNCA aims to provide a platform for artists, singers, and musicians to showcase their skills and receive appreciation for the diverse art forms.\nIn his address, the Director General elaborated on PNCA’s commitment to the performing arts, emphasizing its three core areas that ate dance, drama, and music.\nHe stated that PNCA not only offers opportunities for established artists but also serves as a training ground for aspiring performers, enabling students to enhance their creative and artistic abilities.\nAyub Jamali concluded the event by reiterating PNCA’s dedication to promoting arts and culture, ensuring more such programs in the future to bring joy and inspiration to the community.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:55:32.593Z"
}
