{
  "title": "Railways reunite around 684 vulnerable children with heirs in ten months",
  "link": "https://www.app.com.pk/national/railways-reunite-around-684-vulnerable-children-with-heirs-in-ten-months-2/",
  "date_published": "2024-12-08T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP): Pakistan Railways Police have rescued and reunited as many as 684 vulnerable children with their legal heirs and different welfare institutions during the last ten months with the help of train staffers.\n“During the operation, the Railways Police have retrieved and returned around 2,263 lost luggage valued Rs 23.7 million to the passengers,” an official in the Ministry of Railways told APP.\nAdditionally, the official said that around 14,793 handicapped, injured and old passengers were provided with first aid, wheelchairs, and stretcher facilities during their journey in trains.\nGiving details of division wise, he said that Rawalpindi division reunited 151, Lahore 164, Karachi 137, Sukkur 69, Peshawar 79, Multan 65 and Quetta division 19 runaway children to their parents and different welfare institutions.\nThe official said that most of the children were found unaccompanied and loitering at stations after they left their house following a fight or getting scolded or in search of better life.\nSimilarly, he said that Rawalpindi division assisted 3,837 passengers, Lahore 2,761, Karachi 6,135, Peshawar 1195, Sukkur 449, Multan 533 and Quetta 442 in retrieving lost luggage.\n“The valuables that were returned to the passengers included laptops, smart-phones, gold and artificial Jewelry, ladies and gents’ handbags and local or international currencies,” he added.\nHe said the Railways Police Help Desks had been established at all the major railway stations across the country, and the performance of the Railways Police has been quite satisfactory during the last year.\n“Police are performing duties efficiently despite the limited resources while steps would be taken to further improve their performance to the optimum level during the next year,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:00:23.556Z"
}
