{
  "title": "AAIB preparing final report on PIA plane crash-2020: Aviation Division",
  "link": "https://www.app.com.pk/national/aaib-preparing-final-report-on-pia-plane-crash-2020-aviation-division/",
  "date_published": "2022-05-22T10:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): A spokesperson for the Aviation Division on Sunday said the Aircraft Accident Investigation Board (AAIB) team was in process of preparing the draft of a final report on the PIA plane crash that occurred two years ago near Jinnah International Airport, claiming 98 precious lives.\n“Despite restrictions due to COVID-19 pandemic and related challenges, by now the team has collected all required evidence and is presently working on the draft of a final report,” the spokesperson said in a news release here.\nOn May 22, 2020, the Pakistan International Airlines (PIA)’s ill-fated flight (PK8303) from Lahore – Karachi had crashed close to Jinnah International Airport, Karachi. As many as 97 out of 99 passengers and crew on board had lost their lives.\nOnly two passengers had miraculously survived, while there was one fatality on the ground, the spokesperson added.\nSoon after the tragedy, a probe was ordered immediately by the federal government with the constitution of the air crash accident investigation team, which submitted its preliminary report within a month that was made public.\nIn the light of the preliminary investigation report, the spokesperson said the AAIB team had been undertaking an extensive search for relevant evidence in collaboration with foreign stakeholders to probe the root cause of the accident, following the ICAO (International Civil Aviation Organization) protocols.\nIn accordance with the ICAO requirements, the second interim statement had been issued by AAIB Pakistan, which is available on Aviation Division’s website.\nOn the second anniversary of the tragedy, Minister for Aviation Khawaja Saad Rafique\nextended deep condolences and sympathies to the grieved families and friends of victims of the ill-fated air crash, assuring that the final report would be compiled and made public at the earliest.",
  "retrievedAt": "2025-08-11T14:56:59.681Z"
}
