{
  "title": "PM Imran Khan to perform groundbreaking of REZ on Nov.18: Khattak",
  "link": "https://www.app.com.pk/national/pm-imran-khan-to-perform-groundbreaking-of-rez-on-nov-18-khattak/",
  "date_published": "2020-11-01T14:59:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 01 (APP): Defence Minister Pervez Khan Khattak Sunday said that Prime Minister Imran Khan would perform groundbreaking ceremony of the Rashakai Economic Zone (REZ) on November 18, 2020.\nHe said that Rashakai Economic Zone is a project included in China Pakistan Economic Corridor (CPEC). Under this crucial project, he said thousands of industrial units would be established wherein millions of the residents of Nowshera and its adjacent districts would get employment and usher a new era of progress and development in the area.\nHe was addressing two separate gatherings at the residence of Amjad Azam, alias Quaid-e-Azam at Union Council, Badrashi and a joining public meeting at Risalpur wherein an ANP activist, Gohar Taj announced joining PTI along with his family and associates.\nThe federal minister said that the people of Nowshera will accord warm welcome to Prime Minister Imran Khan that would prove a referendum against the opposition.\nHe termed Pakistan Democratic Movement (PDM) a bunch of jobless politicians that have joined hands on a single point agenda of hiding their corruption. He said that till tomorrow they were accusing each other of corruption and now have embraced each other for protection of their personal interests.\nPervez Khattak said that opposition had nominated a jobless politician, Maulana Fazalur Rehman to struggle for finding employment. However, this jobless bunch had to wait till 2023, when Imran Khan would be elected Prime Minister once again.\nHe asked the opposition to avoid attempts of putting national security at risk as it is harmful for Pakistan. Opposition’s tirade against Pak Army is strengthening the narrative of the neighbouring country India and asked them to refrain from becoming instrumental in this conspiracy.\nThe defence minister said that Pak-Army had rendered unprecedented sacrifices for the country and opposition should not do politics on it, otherwise, he said 220 million population of the country would not forgive them in any circumstances.",
  "retrievedAt": "2025-08-11T19:57:54.074Z"
}
