{
  "title": "Opposition narrative totally against stance of Pakistan: CM",
  "link": "https://www.app.com.pk/national/opposition-narrative-totally-against-stance-of-pakistan-cm/",
  "date_published": "2020-11-01T14:37:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 01 (APP): Punjab Chief Minister Sardar Usman Buzdar has said that the current narrative of the opposition parties is totally against the stance of Pakistan.\nAccording to a handout, issued here on Sunday, the opposition leaders should shun their negative politics.\nHe said that 22 crore Pakistanis would not let any nefarious conspiracy succeed against Pakistan.\nThe opposition leaders did not care about the coronavirus standard operating procedures (SOPs) despite start of the second wave of the virus in the country.\nHe said that the opposition leaders had no sentiments for the people as they were unaware of problems of the common man.\nThey are only busy in scoring political points instead of standing with the people, the opposition made a vicious attempt to divide them. He strongly condemned the negative role of the opposition.\nThe CM said that Prime Minister Imran Khan had always given priority to the national interest, whereas, opposition parties had always ignored the interests of Pakistan for their personal gain.\nThe opposition leaders would be held accountable for their anti-Pakistan statements.\nHe said that it is unfortunate that the opposition leaders’ statements were benefiting the enemy of Pakistan.\nThe mentality of the party leaders, who have been in power for last three decades, has been exposed. Politics is the name of serving people, but the opposition parties had damaged Pakistan’s interests for the sake of their vested interests.\nHe said that people of Pakistan strongly condemned every effort for making the national institutions controversial. Pakistanis are standing with their institutions and will continue to support them.\nThere is no future for those who are speaking against the institutions, the CM added.\nHe said said that the people have now recognized the faces of the looters and plunders in the guise of leaders.\nBy issuing such irresponsible statements, the oppositions leaders are pleasing Narendra Modi and his followers. The opposition has proved that it only wants protection of their personal interests.",
  "retrievedAt": "2025-08-11T19:57:56.207Z"
}
