{
  "title": "“Accountability for All” policy aims to eradicate corruption with iron hands: Chairman NAB",
  "link": "https://www.app.com.pk/national/accountability-for-all-policy-aims-to-eradicate-corruption-with-iron-hands-chairman-nab/",
  "date_published": "2020-11-01T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): Chairman National Accountability Bureau (NAB) Justice (Retd) Javed Iqbal has said the anti graft watchdog strongly believed in “Accountability For All” policy to root out corruption in all its forms and manifestations with iron hands.\nIn a statement, he said that corruption was a major hurdle in progress and prosperity of the country depriving a deserving person of its due right on merit. NAB’s enjoys one of the best 68.8 percent conviction ration which is one of the best as compared to other anti corruption organizations.\nNAB was the only institution of Pakistan, to which China has signed Memorandum of Understanding (MoU) to oversee China Pakistan Economic (CPEC) Corridor projects being undertaken in Pakistan.\nNAB has adopted a three pronged strategy of awareness, prevention and enforcement which has been considered one of the best strategies in the world. Due to its effective anti corruption strategy, NAB has recovered Rs 466 billion since its inception which were deposited in the national exchequer.\nThe chairman said that the logical conclusion of mega corruption white collar crimes cases was top priority of NAB.\nNAB has established witness handling cells at all the regional bureaus besides Anti Money Laundering Cell at NAB headquarters.\nMoreover, NAB has established complaint cells in NAB headquarters and in all the regional bureaus.\nThe number of complaints received till Oct 2020 are almost much more than 2019 which shows people trust upon NAB.\nNAB has devised a monitoring and evaluation system to track implementation and outputs systematically, and measure the effectiveness of performance which helps in enhancing the operational, monitoring and evaluation capabilities of the bureau.\nMonitoring and Evaluation System (MES) was an important management tool to track progress and it facilitates in decision making as well as establishes links between the past, present and future actions.\nNAB is a people friendly institution who strongly believes in self respect of people visiting the bureau on the directions of the chairman.\nNAB had set up special desks at all bureaus across the country with a mandate to redress grievances of entrepreneurs.",
  "retrievedAt": "2025-08-11T19:57:54.056Z"
}
