{
  "title": "President PMDC holds MDCAT post-exam analysis meeting",
  "link": "https://www.app.com.pk/national/president-pmdc-holds-mdcat-post-exam-analysis-meeting/",
  "date_published": "2023-09-15T16:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): President Pakistan Medical and Dental Council (PMDC) Prof. Dr. Rizwan Taj on Friday conducted a post-examination analysis meeting of the MDCAT 2023 to assess the holding of the examination process, hurdles in the compilation of results, and difficulty index.\nThe meeting started with a review of the performance of individual exam questions, difficulty index, and whether any question appeared ambiguous or confusing. During the meeting feedback and issues from the candidates were also considered.\nDuring the meeting, it was learned that in the MDCAT exam, there were a few out-of-syllabus questions in some provinces on which the President PMDC took notice of the same.\nPresident PMDC directed Vice Chancellors of all public universities to re-check their question papers and analyze any discrepancy found in the paper which may be addressed at the earliest.\nHe added that conducting universities must take serious action and hold inquiries against all those involved in using unfair means in the examination with substantial proof.\nHe stated that transparency must be ensured and all issues related to the exam must be addressed on priority without any delay.\nThe President PMDC said that the meeting holds crucial importance for evaluating the effectiveness of the exam and making improvements.\nDuring the meeting, President PMDC showed concerns and inquired regarding the news floating in the media regarding the MDCAT paper and its authenticity.\nVice Chancellor Khyber Medical University (KMU) stated that almost 46,439 students were registered wherein 45,640 appeared in the exam. Similarly, 799 candidates were absent from the exam.\nHe apprised that during the exam 219 students were caught red-handedly using unfair means and informed that necessary legal action has been taken against all those candidates involved in the practice.\nHe informed that they had prior knowledge from the intelligence agencies of the cheating device. Therefore, all the candidates were checked properly in all the centers with four-layered security checks and body searches.\nThe KMU clarified that there are few videos circulating on social media that are four to five years old as no KMU exam was held outdoor.\nThe Vice Chancellor of Jinnah Sindh Medical University in the meeting informed that a total of 40,528 candidates were registered from Sindh province from which 98% of candidates appeared in the exam in four cities.\nFor the purpose of secrecy, TCS was hired to move the confidential examination material at the venues. He apprised that a total of three cases of impersonation were caught and FIRs have been registered against them.\nHe informed after four hours of uploading the key he received pictures and complaints regarding the leakage of paper. He informed that a five-member inquiry committee has been constituted of senior officials to probe into the complaints including members from FIA, Cyber Crime, which will submit the report and findings in 48 hours.\nHe added that till the outcome of the inquiry, the announcement of the result will be delayed.\nRepresentative of Vice Chancellor Bolan University of Medical and Health Sciences stated that 9,234 students were registered from which 97% of candidates appeared in the exam.\nHe apprised that no issue or complaint was observed or received during the exam. The Provincial minister, serving Judges, lawyers, and other officials were also invited to monitor the exam.\nHe said that students showed satisfaction with the exam conducted and the necessary arrangements regarding it.\nVice Chancellor of University Health Sciences shared that the MDCAT exam was successfully conducted without any issue in 11 different cities and 29 centers of the province. As many as 66,725 candidates were registered, of which 65,226 candidates appeared in the exam.\nHe informed that after the conduct of the exam, a team of experts was invited to analyze the paper to check whether the paper was according to the guidelines given by PMDC. After the review, it was learned that a total of five questions were deleted and full credit to all the candidates will be given to all the students.\nThe President PMDC appreciated all vice-chancellors of the provincial exam-conducting universities for making unprecedented efforts to conduct a smooth and transparent exam.\nHe expressed gratitude to the participants for their contributions and emphasized the commitment to maintaining the integrity and quality of the exam.\nIt was decided that all the universities will announce their results as soon as possible through their official websites and their links will also be available at PMDC websites. The Jinnah Sindh University shall announce its results after the outcome of the inquiry.\nLater Caretaker Federal Minister For National Health Services Regulations and Coordination (NHRS&C) Dr. Nadeem Jan held a meeting with provincial health Ministers and the president of PMDC.\nThe minister expressed satisfaction with the conduction of the MDCAT examination and directed that all complaints should be taken seriously.\nHe advised that the future MDCAT should involve a mechanism with the use of technology to make it transparent and fair in every way and uphold merit at all costs. After the completion of conducting the MDCAT exam in national and foreign venues, around 187,000 students appeared in the exam.\nThe meeting was attended by Vice Chancellors of all provincial conducting universities including the University of Health Sciences (UHS), Khyber Medical University (KMU), Jinnah Sindh Medical University (JSMU), Shaheed Zulfiqar Ali Bhutto Medical University (SZABMU), Balochistan University of Medical and Health Sciences (BUMHS) and the examination department of the PMDC.",
  "retrievedAt": "2025-08-11T09:38:54.073Z"
}
