{
  "title": "First ‘Diplomats’ Discourse’ underlines importance of BRI, opportunities for participating countries",
  "link": "https://www.app.com.pk/national/first-diplomats-discourse-underlines-importance-of-bri-opportunities-for-participating-countries/",
  "date_published": "2023-09-15T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): The speakers at the First Diplomat’s Discourse on Friday underlined the importance of the Belt and Road Initiative (BRI) and the opportunities it had for the participating countries.\nThe First Diplomat’s Discourse on “Regional Connectivity: In Asian Context” was convened here at Foreign Service Academy, a news release said.\nBesides several Islamabad Ambassadors, diplomats, think-tank representatives, serving and former Pakistan Ambassadors, under training Foreign Service of Pakistan officers as well as ASEAN Country diplomats currently undergoing training at the Academy attended the event.\nThe one-day event was organized in collaboration with COMSATS University, Islamabad and Islamabad Policy Research Institute (IPRI).\nThe inaugural Session was addressed by Senator Mushahid Hussain Syed, the newly arrived Ambassador of China, Jiang Ziadong and the Director General Foreign Service Academy, Ambassador Mazhar Javed.\nTwo-panel discussions were held, one themed around BRI and ASEAN and the other on Pakistan as the hub of regional connectivity.\nParticipants included Senator Mushahid Hussain Syed, Ambassadors of Kazakhstan and Azerbaijan in Pakistan, Pakistan Ambassadors to Philippines, Thailand, UAE, Oman and Azerbaijan and former Ambassador of Pakistan to China Naghmana Hashmi and former Ambassador to Indonesia Muhammad Hassan.\nSpeakers underlined the importance of the Belt and Road Initiative and the opportunities it had for participating countries.\nPakistan’s potential to become a hub of regional connectivity was highlighted. Progress already made in that direction and what was needed to be done came under discussion. Discussions were followed by a lively question-and-answer session.",
  "retrievedAt": "2025-08-11T09:39:01.640Z"
}
