{
  "title": "Religious, ethnic minorities enjoys full freedom in Pakistan: AJK President",
  "link": "https://www.app.com.pk/national/religious-ethnic-minorities-enjoys-full-freedom-in-pakistan-ajk-president/",
  "date_published": "2023-09-15T15:23:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): , Sep 15 (APP) : Azad Jammu and Kashmir President Barrister Sultan Mahmood Chaudhry has said that all religious and ethnic minorities in Pakistan are not only treated with respect but also live together in peace and harmony.\nTalking to a delegation of a social organisation “All Neighbours” that called on him at AJK President House in the federal metropolis on Friday the AJK President said, ” Islam is a religion of peace and brotherhood that guarantees equal rights to all ethnic and religious minorities”.\nBarrister Sultan Mehmood Chaudhry further said that the Jaranwala incident was condemned at all levels and caretaker Prime Minister of Pakistan Anwarul Haq Kakar, Chief Minister of Punjab and other government functionaries visited the spot and expressed sympathy with the victims.\nHe said that the leadership of all the political and religious parties of Pakistan denounced the incident and stood in solidarity with the Christian community. He said that Army Chief General Asim Munir also strongly condemned the incident and made it clear that nobody would be allowed to disturb inter-religious harmony in the country.\nHe, however, maintained that concerted and collective efforts were required to prevent such incidents in the future.\nReferring to the ruthless suppression of religious minorities in India, Barrister Chaudhry said minorities in India were being treated as third-class citizens.\nHe said that the mistreatment of Christians in the Indian state of Manipur speaks volumes about the repression religious minorities have faced in the country.\nOn the contrary, the president said that minorities in Azad Kashmir enjoy equal rights and live peacefully together with the majority community in the region.\nThe president said that All Neighbors should highlight this less talked about aspect of our society in the world and raise its voice in favour of Kashmiri people who were suffering from Indian oppression and tyranny in Occupied Kashmir.\nHe urged the members of the delegation to raise their voices to help the Kashmiri people achieve their basic right, the right to self-determination guaranteed to them by the international community.\nThe AJK president appreciated the services rendered by the All Neighbours in promoting interfaith and inter-religious harmony within the USA and other parts of the world.\nOn the occasion, memorable shields were presented to the visiting delegation.\nThe delegation also invited President AJK to visit America, which was accepted by the president.\nThe delegation was comprised of Bruener B. Newton, Ayesha Khan, Alia Mehreen Khan, Dr. Joe Knight Knight, Dr. Raj Rathore, Anwar Qasmi, Ilyas Masih, Miss Meena Younis and others.",
  "retrievedAt": "2025-08-11T09:38:55.222Z"
}
