{
  "title": "Pak-India relations examined in new book by veteran diplomat",
  "author": null,
  "content": "ISLAMABAD, Sep 8 (APP):A new book examining Pakistan-India relations, with a focus on the key aspects of a bilateral dynamic long defined by mistrust rather than meaningful engagement, was launched at a well-attended event in Islamabad on Monday.\nThe book titled Pakistan-India Relations – Fractured Past, Uncertain Future, authored by Ambassador Aizaz Ahmad Chaudhry, launching event was jointly organized by the Institute of Regional Studies Islamabad and the Sanober Institute Islamabad.\nIntroducing the book, Ambassador Chaudhry informed the audience that this book raises a fundamental question and then seeks to answer it: Is the failure to establish good neighbourliness because of the unresolved disputes or is there a larger dynamic in play?.\nThe book examines the reasons behind India’s refusal to resolve the Kashmir dispute, its politicization of the issue of terrorism, and quest for regional assertiveness. It also examines the missteps of the past and explores whether a different and more hopeful future might yet be possible for South Asia.\nThe highlight of the launch event was an address by the chief guest, Minister for Information and Broadcasting, Attaullah Tarar.\nEarlier, welcoming the guests, Ambassador Jauhar Saleem, President of Institute of Regional Studies, called upon the present Indian leadership to shift away from zero-sum thinking and move toward a framework based on mutual respect with opportunities for peaceful coexistence.\nEngineer Khurram Dastgir recalled how since its independence Pakistan has countenanced Indian hostility and bellicosity.\nHe observed that under the leadership of the Modi-led BJP, India has pursued its Hindutva-based narratives much more intensely than in the past.\nMurtaza Solangi, Spokesman of the President of Pakistan, spoke about the recent military aggression by India that was effectively and robustly countered by Pakistan. Solangi referred to the chapter of the book on May 2025 confrontation that explains in detail how India’s quest for dominance will remain a major source of regional instability.\nLt. General Aamer Riaz (retd), former President of National Defense University, commended the detailed manner in which the book has explained how India’s obstructionist attitude has kept the Kashmir dispute unresolved. He also alluded to the book chapter on terrorism, which clearly underlines that India’s bogey of cross-border terrorism was used politically rather than objectively.\nProfessor Arshi Saleem Hashmi, Dean of the Faculty of Contemporary Studies at the National Defense University Islamabad, expressed her commendation for the last chapter of the book, which brings on record a large number of agreements and confidence building measures, to potentially serve as solid foundation for cooperation should there be a government in India that would wish to rethink its hostile policy towards Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:25:32.124Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-india-relations-examined-in-new-book-by-veteran-diplomat/",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T17:22:00.000Z"
}
