{
  "title": "ISSI inks MoU with China’s leading think-tank SIIS",
  "author": null,
  "content": "ISLAMABAD, Sep 08 (APP):The Institute of Strategic Studies Islamabad (ISSI) has concluded a Memorandum of Understanding (MoU) with the Shanghai Institutes for International Studies (SIIS) to institutionalise and deepen academic collaboration.\nThe MoU was signed on September 2 in Shanghai, on the sidelines of the “High-level Seminar on Development and Cooperation between China and South Asian Countries” that brought together scholars, experts, and policymakers to deliberate on contemporary global and regional challenges, said a press release issued on Monday.\nThe signing ceremony was attended by senior officials and scholars from both institutions.\nAmbassador Sohail Mahmood, Director General ISSI, and Professor Chen Dongxiao, President of SIIS, signed the MoU on behalf of their respective sides. The MoU establishes a framework for long-term cooperation in areas such as joint research, policy dialogue, academic exchanges, co-publications, and participation in seminars and conferences on issues of mutual interest at regional and global levels.\nIn his remarks on the occasion, Ambassador Sohail Mahmood highlighted the importance of enhanced academic and intellectual engagement between Pakistan and China, particularly in the context of far-reaching geopolitical and geo-economic shifts. He underscored that this MoU would serve as a sound foundation for sustained collaboration and knowledge-sharing between ISSI and SIIS.\nProfessor Chen Dongxiao welcomed the partnership and reaffirmed SIIS’s commitment to deepening research collaboration with ISSI on a wide spectrum of themes, noting that closer academic linkages would further enrich\nThe ISSI–SIIS partnership represents a significant step in strengthening scholarly and policy-oriented exchanges between Pakistan and China. It is expected to contribute meaningfully to bilateral understanding and regional dialogue through joint research, publications, and academic cooperation.\nIt is pertinent to mention that SIIS is one of China’s leading think-tanks with a strong global reputation for policy-oriented research.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:25:30.235Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/issi-inks-mou-with-chinas-leading-think-tank-siis/",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T17:25:00.000Z"
}
