{
  "title": "KP Govt to launch digital E-Pension System",
  "author": null,
  "content": "PESHAWAR, Sep 08 (APP):The Khyber Pakhtunkhwa government has taken another revolutionary step towards digital governance as Chief Minister Ali Amin Khan Gandapur has approved the launch of the Ehsaas E-Pension System for government employees. The system will become operational from January 2026.\nA concept paper for the rollout has already been prepared by the Chief Minister’s Secretariat, and formal instructions have been issued to the Finance Department for its implementation. From January 2026, pensions for all new retirees will be processed through the E-Pension System, while the existing paper-based mechanism will be fully transformed into a paperless, digital pension system.\nAs part of the initiative, an Ehsaas Pension Dashboard will be launched, serving as a centralized platform with a completely paperless workflow.\nEmployees will be able to submit their pension cases six months prior to retirement through a simple digital form on the portal. All required documents can be securely scanned and uploaded directly to the system.\nThe E-Pension System will automatically generate time-bound tasks for relevant authorities, eliminating the need for physical files at any stage. The entire verification and approval process will be completed digitally.\nThe system will also auto-generate sanction orders, retirement orders, pension papers, and pension payment orders, all with legally recognized digital signatures.\nThe initiative includes a robust monitoring mechanism for departmental performance. The Chief Minister, Chief Secretary, and Finance Secretary will be able to track progress through the central dashboard.\nThe system will be integrated with NADRA, Account General Office, and banks to ensure that pensions are directly transferred into the retirees’ bank accounts within the set timelines.\nTo ensure sustainability, necessary amendments in relevant laws have been proposed.\nA ten-point roadmap with clear timelines has been developed to guarantee timely implementation, with the formal inauguration of the E-Pension System scheduled for January 15, 2026.\nWith the new system, the pension processing time will be reduced from months to just 2–4 weeks, sparing retirees from repeated office visits.\nIn his statement, the Chief Minister said that the new system would eliminate the hardships faced by employees under the current pension process. He added that the initiative would establish a truly paperless system, promoting transparency and accountability.\nKhyber Pakhtunkhwa will become the first province in the country to introduce an E-Pension System. So far, the provincial government has successfully digitized 36 different public services, while work on digitizing the remaining services is underway at an accelerated pace.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:25:52.163Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kp-govt-to-launch-digital-e-pension-system/",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T16:55:00.000Z"
}
