{
  "title": "Chairman WAPDA, World Bank’s Country Director discuss financial matters of Dasu, Tarbela 5th Extension HPP",
  "author": null,
  "content": "ISLAMABAD, Sep 08 (APP):Chairman WAPDA Lt Gen Muhammad Saeed (Retd) was called on by World Bank’s Country Director for Pakistan Ms. Bolormaa Amgabbazar to review financial matters of Dasu and Tarbela 5th Extension hydropower projects.\nDuring the meeting, the Chairman appreciated the World Bank for its role as key development partner in harnessing vital resource of hydel electricity in Pakistan, said a press release.\nHighlighting the importance of Dasu and Tarbela 5th Extension hydropower projects for energy security of Pakistan, he said that both projects will help ensure affordable and clean electricity for socio-economic development in the country.\nThe Chairman was of the view that IARC would further strengthen institutional capacity and efficiency, transforming WAPDA into a more efficient and robust organization aligned with international best practices.\nThe Country Director reaffirmed World Bank’s commitment to continued financial support for WAPDA’s hydropower portfolio. She acknowledged WAPDA’s efforts in advancing the shared vision of promoting clean, green and sustainable energy development in Pakistan.\nIt is important to note that World Bank is providing financial support worth US$ 1517 million for under-construction Stage-I of Dasu Hydropower Project and US$ 390 million for Tarbela 5th Extension Hydropower Project. Besides, the World Bank is also funding Institutional Assessment and Reforms Consultancy Services (IARC) for WAPDA.\nIt is pertinent to mention that the 4320 MW-Dasu Hydropower Project is being constructed across River Indus in Upper Kohistan district of Khyber Pakhtunkhwa. At present, WAPDA is constructing Stage-I of the Project, which will generate 2160 MW electricity. While, Tarbela 5th Extension Hydropower Project is being constructed on Tunnel No. 5 of Tarbela Dam with installed generation capacity of 1530 MW.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:25:02.892Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairman-wapda-world-banks-country-director-discuss-financial-matters-of-dasu-tarbela-5th-extension-hpp/",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T18:50:00.000Z"
}
