{
  "title": "President for gearing up nationwide campaign for mainstreaming differently-abled people",
  "link": "https://www.app.com.pk/national/president-for-gearing-nationwide-campaign-for-mainstreaming-differently-abled-people/",
  "date_published": "2023-01-06T16:08:00.000Z",
  "source": "APP",
  "content": "The president expressed these views while chairing a meeting on the facilitation of persons with disabilities (PWDs) here at the Aiwan-e-Sadr.\nThe meeting was attended by Minister for Zakat, Ushr, Social Welfare, Special Education and Women Empowerment Department of Khyber Pakhtunkhwa Anwar Zeb Khan, Special Assistant to Sindh Chief Minister for the Department of Empowerment of DAP, National Database Registration Authority Chairman Muhammad Tariq Malik, senior officials of the Federal Ministry of National Health Services, Regulations and Coordination, Social Welfare Departments of Punjab, Sindh, KP & Balochistan, Elementary and Secondary Education Department of AJK, Labour and Human Resource Development Department of Punjab, and representatives of NAVTTC, Pakistan Bait-ul-Mal, Directorate of Special Education, Islamabad, NIRM, WHO and NADRA.\nGilgit-Baltistan Chief Minister Khalid Khursheed Khan also attended the meeting through video-link.\nDuring the meeting, the president asked the Federal Ministry of Education and Professional Training (FEPT) to play a lead role and come up with a proposal on national curricula for providing targeted and quality education and market-oriented skills to differently-abled people (DAPs) in a systematic manner in consultation with all stakeholders including provinces, international organizations, NGOs and private sector to provide a definite and agreed upon world class direction for the educational institutions both at the public and private sectors, besides determining teacher to differently-abled- students ratio in schools.\nHe also emphasized enlisting of skills which could be imparted to the DAPs keeping in view their disability which might also include sign language, braille, software development, setting of businesses and selling the products and services online, besides creating a repository of DAP-compliant material containing SOPs, skill enlistment, disability specific reading, research and reference material and should be made accessible to DAPs around the country.\nHe underlined the need to develop an accelerated system for the mass registration of PWDs around Pakistan so that definite data could be obtained for planning and other interventions.\nThe president appreciated NADRA for its outreach for the registration of DAPs across the country and emphasized that Authority should introduce a nationwide user-friendly telephonic information and registration system for the DAPs and their family members to create data on location and nature of disability and later with the help of the relevant departments issue them Disability Cards while ensuring maximum facilitations to the DAPs. The data so created would help the governments to develop authentic and meaningful policies, strategies and actions plan for mainstreaming of the DAPs as full and dignified members of the society.\nHe emphasised developing out-of-the-box solutions for complete registration of the PWDs as the number of currently registered persons with NADRA around 600,000 was low as compared to the estimated number of the DAPs in Pakistan which might exceed 20 million.\nThe president emphasized consultation by provinces, NGOs, private sector, NAVTTC, TEVTA, chambers of commerce and industry and other stakeholders with International Labour Organization (ILO) and other relevant international entities to seek their knowledge and expertise to finetune the database, develop world class curricula, enlistment of disability relevant skills, adopt world’s best practices for mainstreaming of the DAPS, their barrier free movement providing them assistive technologies and world class synthetic body parts, enacting new laws and improving the existing ones, and fulfilling the quota of the DAPs jobs.\nHe said a comprehensive and all-inclusive media campaign involving social and conventional media should be launched to impart education and information to the DAPs with respect to their rights and to educate the family members, the neighbourhood and the general society regarding their responsibilities and obligations towards the DAPs after setting in place the DAPs-oriented and responsive systems like the DAPs mapping in different areas with regard to their disability and skill level, the enlisting of advantages and incentives offered to them, and concrete employment opportunities open to them in the public and private sectors.\nHe said all government and private sector organizations were duty-bound to provide jobs to the DAPs as per quota which ranged from 2-5% by creating disability specific gainful and productive jobs. He said the charity-based employment approach should be discouraged as such employment did not give dignity and honour to the employees and also created no value for the organizations.\nThe participants of the meeting suggested different solutions for mainstreaming of the DAPs. The president proposed that next meeting should be held in three months’ timeline to take stock of the decisions already made, review progress and to further sharpen and finetune the future course of action to ensure mainstreaming of the DAPs in all aspect of life in an accelerated but meaningful and quantifiable manner.\nWhile outlining the facilities provided by NADRA for the PWDs, the NADRA chairman said that all the PWDs were being issued executive category CNICs (Computerized National Identity Cards) with the international disability logo with lifetime validity on top priority without requiring them to wait in queues. He said that NADRA had also created biker services to provide registration services at the doorsteps of PWDs.\nHe said children of ages 9-18 years were being issued juvenile cards whereas NADRA had also recruited the PWDs who had successfully completed the compiling of the list of 121 million voters.",
  "retrievedAt": "2025-08-11T05:41:31.237Z"
}
