{
  "title": "PM seeks OIC’s strong support for resolution of Kashmir, Palestine issues",
  "link": "https://www.app.com.pk/national/pm-seeks-oics-strong-support-for-resolution-of-kashmir-palestine-issues/",
  "date_published": "2022-03-22T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Prime Minister Imran Khan on Tuesday stressing the unity of the Muslim world said a strong voice of the Organization of Islamic Cooperation (OIC) as the representative body of 1.5 billion population was crucial to address the lingering issues of Kashmir and Palestine.\n“We have failed both the Palestinians and Kashmiris. I am sad that we have not been able to make an impact despite being the massive voice of 1.5 billion,” the prime minister said in his keynote address at the 48th Session of the OIC Council of Foreign Ministers after Pakistan assumed the Chair.\nThe two-day meeting of the 57-member body of Muslim countries held here at the Parliament House under the theme of ‘Building Partnerships for Unity, Justice, and Development’ highlighted the challenges facing the Muslim world and the common opportunities through joint efforts.\nSecretary-General OIC Hissein Brahim Taha, President Islamic Development Bank Dr Muhammad Suleiman Al-Jasser, Foreign minister of Saudi Arabia Prince Faisal bin Farhan Al-Saud, Chinese State Councilor and foreign minister Wangi Yi and other foreign ministers joined the session.\nThe prime minister, who commenced his speech with the prayer of seeking Allah Almighty’s guidance for the righteous path, focused on issues including Islamophobia, global conflicts and the situation regarding Afghanistan, Kashmir, Palestine and Ukraine.\nImran Khan pointed out that the international community decades ago had made a pledge with Kashmiris to let them decide their fate.\nHowever, he regretted that the status of the Valley had been changed illegally with the residents facing severe human rights situation.\n“I ask OIC that unless we have a united front, we keep having seen these abuses,” he said, adding that altering the demography of a population by turning the majority Kashmiri Muslims into minority was a war crime under Geneva Convention.\nImran Khan warned that the world was heading towards a cold war with the chances of the countries being divided into blocs. “Unless we as Islamic platform get united, we will stand nowhere,” he said.\nOn the Ukraine situation, he proposed to consider the ways where the OIC countries along with China could play their role in diffusing the rising conflict.\nKhan said he would hold a discussion with the visiting Chinese foreign minister Wang Yi on how China and OIC could step in to mediate towards a ceasefire of Ukraine war which had already started impacting the world in the shape of rise in prices of oil, gas, wheat.\nOn Afghanistan, he termed the stability of the country extremely important after the 40 years of conflict and called for the lifting of international sanctions to avert the looming humanitarian crisis.\nHe said the only way to stop terrorism in Afghanistan was to encourage and support a stable government in place.\n“As a word of caution, please do not push the proud and independent-minded people of Afghanistan. Let us help them and involve into the international community,” he said.\nImran Khan stressed that self-belief could help the Islamic world revive its glory to address their common challenges.\nThe prime minister welcomed the visiting foreign ministers at the OIC platform which coincided the occasion of Pakistan Day.\nHe especially congratulated the OIC members over the landmark resolution passed in the United Nations for declaring March 15 as the Day to Combat Islamophobia.\nThe March 15, he mentioned, was in connection with the barbaric incident when a gunman opened fire on Muslims at a mosque in New Zealand calling all Muslims terrorists.\nHe stressed that Islam did not equate terrorism and rejected the notion of differentiating between a “moderate and terrorist Muslim”.\n“The moment someone describes as moderate Muslims automatically tags others as radical,” he said, urging the Muslim countries to take a stand on this.\nHe emphasized that there were no different forms of Islam and Muslims, but the one in line with the teachings of Prophet Muhammad (Peace be upon Him).\nHe pointed out that the 9/11 incident led to demonizing of Muslims across the world and said that mocking or ridiculing the Prophet (PBUH) in the name of freedom of expression was unjustified and unacceptable.\nImran Khan said Pakistan was the only country that was created in the name of Islam with its Objective Resolution based on the vision of Islam’s first socio-welfare State of Medina.\nHe said Prophet Muhammad (PBUH) was sent to the world as a blessing for the entire humanity and not specific for the Muslims only.\nImran Khan regretted that the world was witnessing a situation where the poor countries were being robbed with almost 1.6 trillion dollars illegally transferred to rich countries.\nHe said an Islamic state must protect the rights of minorities, and imbibes the spirit of compassion and humanity for all.\nThe prime minister mentioned that one of the ideals of the OIC was to protect Islamic values, however, expressed concern over the culture of obscenity on of social media, which he said was leading to sex crimes.\nHe sought consideration by the Islamic platform to suggest ways for combating vulgarity impacting the social values and family system.",
  "retrievedAt": "2025-08-11T14:35:26.178Z"
}
