{
  "title": "Asad for cementing Pak-Uzbek ties through enhanced parliamentary interaction",
  "link": "https://www.app.com.pk/national/asad-for-cementing-pak-uzbek-ties-through-enhanced-parliamentary-interaction/",
  "date_published": "2022-03-22T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):National Assembly Speaker Asad Qaiser on Tuesday reiterated his resolve to strengthen ties with Uzbekistan through enhanced interaction between the parliaments of two countries, and cooperation in trade and investment sectors.\nUzbekistan had immense importance for Pakistan as it could serve as a gateway to Central Asia and beyond due to its geographical location, he said in a meeting with Uzbek Deputy Foreign Minister Furqat Sidiq here on the sidelines of the 48th Session of Organisation of Islamic Cooperation’s Council of Foreign Ministers.\nThe NA speaker said Pakistan highly valued its close ties with Uzbekistan, anchored in shared history, culture, and religion.Uzbekistan, he said, was a leading trading partner of Pakistan in the Central Asia and extending cooperation in diverse sectors would further boost economic activity for the mutual benefit of two countries.\nHe invited Uzbekistan to join economic activity generated through the China Pakistan Economic Corridor. The Parliament would extend all-out support to pave way for enhancing Uzbek trade and investment in Pakistan, he added.\nSpeaker Asad Qaiser said Pakistan remained deeply committed to the eternal Islamic virtues of amity and brotherhood.He further said that promoting solidarity and cooperation between members of the Islamic Ummah was an element of faith and mainstay of Pakistan’s foreign policy.\nHe stressed on the Ummah to join hands for efforts to counter Islamophobia and myriad of issues faced by the Muslims.Uzbek Deputy Foreign Minister Furqat Sidiq congratulated the speaker on hosting the 48th OIC-CFM session in Islamabad, which also coincided with the 75th-anniversary celebrations of Pakistan’s independence.\nHe said the quantum of bilateral trade had witnessed an upward momentum during recent times. He agreed that Uzbekistan could serve as a gateway to the Eurasian markets for Pakistani trade, and that immense economic potential existed in both the countries.",
  "retrievedAt": "2025-08-11T14:35:15.712Z"
}
