{
  "title": "President, OIC ministers discuss bilateral cooperation",
  "link": "https://www.app.com.pk/national/president-oic-ministers-discuss-bilateral-cooperation/",
  "date_published": "2022-03-22T17:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):State Councillor and Foreign Minister of China Wang Yi, Deputy Prime Minister and Minister of Foreign Affairs of Iraq Dr Fuad Hussein, Foreign Minister of Egypt Sameh Hassan Shoukry and Foreign Minister of Palestine Riyad al-Maliki, made separate calls on President Dr Arif Alvi at Aiwan-e-Sadr here on Tuesday and exchanged views on bilateral cooperation.\nWhile welcoming the Chinese Foreign Minister, the President said that relations between the two countries were deep-rooted and were progressing with every passing year.He stated that Pakistan and China were “All-Weather Strategic Cooperative Partners” and Pakistan would continue to adhere to the “One China” policy by firmly supporting China on all of its core issues, including Taiwan, Tibet, Hong Kong and South China Sea.He expressed his gratitude to China for supporting Pakistan on the Kashmir issue and FATF as well as providing J10CE aircrafts.The President stated that both countries were making efforts to promote peace and stability in Afghanistan and were working together for the prosperity of the region.\nHe emphasized the need for enhanced cooperation in the areas of agriculture, automobiles and information technology.Wang Yi reiterated that China would support Pakistan and continue its cooperation for its economic and industrial development. He said that cooperation between the two countries was growing very well and the CPEC project would greatly help towards the sustainable development of Pakistan. He also thanked President Dr Arif Alvi for his visit during the Covid-19 pandemic in March 2020, saying that it was a valuable support for the Chinese people. He further said that China was the most reliable partner and wanted to further strengthen strategic cooperation with Pakistan.Talking to the Iraqi Deputy Prime Minister, the President highlighted that Pakistan and Iraq enjoyed close brotherly relations which needed to be further cemented for the mutual benefit of the two countries. Both sides emphasized the need for increasing high-level bilateral exchanges to further expand relations between the two countries.\nIn his meeting with the Palestinian Foreign Minister, the President said that Pakistan had consistently extended support to the Palestinian cause and wanted the resolution of the Palestine issue in accordance with the relevant UN Security Council resolutions. The meeting underscored the need for promoting unity among the Muslim countries to address the issues being faced by the Islamic world, particularly Islamophobia.\nDuring his meeting with the Foreign Minister of Egypt, the President said that Pakistan considered Egypt as an important country in the region and was keen to promote economic, political and cultural ties with the brotherly country. Both sides underlined the need for increasing communication and strengthening cultural linkages between the two countries. The President remarked that Pakistan had shifted its focus from geo-strategic to geo-economics and wanted to promote trade and commercial relations with Egypt. He also highlighted the Indian atrocities in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), saying that India was involved in genocide against the Muslims and the international community needed to stop India from committing these violations.\nThe President thanked the foreign ministers for their participation in the 48th Council of OIC Foreign Ministers Summit being held in Islamabad.Later, the President hosted a banquet in honour of the foreign ministers from OIC countries.",
  "retrievedAt": "2025-08-11T14:35:13.776Z"
}
