{
  "title": "From Kashmir, Palestine to Islamophobia: Galaxy of OIC leaders highlights Muslim world issues",
  "link": "https://www.app.com.pk/national/from-kashmir-palestine-to-islamophobia-galaxy-of-oic-leaders-highlight-muslim-world-issues/",
  "date_published": "2022-03-22T16:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): The Muslim countries’ flags fluttering along avenues, floodlit roads and trees, besides the red carpet rolled out in Parliament House’s foyers featured Tuesday’s Islamabad hosting a galaxy of Muslim leaders for OIC CFM who highlighted a variety of issues including Kashmir, Palestine and Islamophobia.\nThe two-day 48th Session of the Organization of Islamic Cooperation’s Council of Foreign Ministers (OIC-CFM), was the second gathering of the Muslim world leaders hosted by Pakistan at picturesque Islamabad, after an extraordinary session on Afghanistan in December last.\nThe delegates from across the Muslim world as well as non-member countries including Chinese State Councilor and Foreign Minister Wang Yi attended the moot with a virtual presence of United Nations Secretary-General Antonio Guterres.\nSecretary-General OIC Hissein Brahim Taha, Saudi Foreign Minister Prince Faisal bin Farhan Al-Saud and President Islamic Development Bank Dr Muhammad Suleiman Al-Jasser were among the prominent guests.\nBesides enjoying the serenity of Islamabad, the visiting dignitaries would also witness the thunderous aerobatics maneuvers of the fighter jets of the Pakistan Day parade on Wednesday.\nThe citizens who have been adoring the rehearsing performances of the fighter jets and paratroopers during last week from different strategic locations, have to experience the pre-announced detours owing to the frequent movement of the guests attending the international event.\nFour local holidays have been announced in the federal capital to save the residents from facing any inconvenience.\nElaborate security arrangements were made for the high-profile event as Foreign Minister Shah Mahmood Qureshi said India was poised to fail the event just to avert Pakistan from highlighting the Kashmir issue.\nHowever, contrary to the Indian desire, the Muslim world leaders including Prime Minister Imran Khan, OIC secretary-general, Saudi foreign minister, Chinese foreign minister and others, in their respective addresses, called for resolution of the Kashmir and Palestine issues in accordance with the aspirations of the people as well as the United Nations resolutions.\nThe meeting of the OIC Contact Group on Kashmir, held after the opening session, also thoroughly discussed the Kashmir issue and called for the resolution as guaranteed by the international community.\nPrime Minister Imran Khan joined the gathering of the foreign ministers at the session which started with the recitation of Quranic verses and the national anthem.\nThe summit also coincided with the 75th anniversary celebrations of Pakistan’s independence.\nHassoumi Massoudou, Foreign Minister of the Republic of Niger and also the Chair of the 47th session of the OIC Council of Foreign Ministers handed over the Chair of the 48th session of the OIC-CFM to Pakistan represented by Foreign Minister Qureshi.\nForeign Minister Qureshi as well as other cabinet members received the visiting foreign ministers on their arrival at the Parliament House.\nBesides Kashmir and Palestine, the foreign ministers also discussed the developments in Afghanistan and its humanitarian consequences for the Afghan people, Islamophobia, the situation in Mali, the Sahel region, and Lake Chad, and the situation in Central Africa and the Republic of Guinea. They also discussed the developments in Yemen, Libya, Sudan, Somalia, Syria, and other regions.\nIn his keynote address, Prime Minister Imran Khan said a strong voice of the OIC as the representative body of 1.5 billion population was crucial to address the lingering issues of Kashmir and Palestine.\n“We have failed both the Palestinians and Kashmiris. I am sad that we have not been able to make an impact despite being the massive voice of 1.5 billion.”\n“I ask OIC that unless we have a united front, we keep having seen these abuses,” he said, adding that altering the demography of a population by turning the majority Kashmiri Muslims into minority was a war crime under Geneva Convention.\nOn the Ukraine situation, he proposed to consider the ways where the OIC countries along with China could play their role in diffusing the rising conflict.\nHe especially congratulated the OIC members over the landmark resolution passed in the United Nations for declaring March 15 as the Day to Combat Islamophobia.\nForeign Minister Shah Mahmood Qureshi said it was time for the Muslim Ummah to forge a collective response to the current turmoil inside its borders and the ongoing global transition.\n“We must be a reliable partner in forging unity, justice, and development across the globe, but not anyone’s accomplice in aggression or domination.”\nQureshi regretted that even after 50 years of the OIC’s establishment, the organization was far from seeing justice for Muslims in many parts of the world.\n“The Muslims of Palestine and the Indian Illegally Occupied Jammu and Kashmir (IIOJK) are still reeling under abominable subjugation,” he said.\nThe OIC Secretary-General Hissein Brahim Taha while said the Indian government’s unilateral acts of August 5, 2019 to change the status of occupied Jammu and Kashmir were in violation of the UNSC resolutions.\nHe termed the establishment of Afghanistan Humanitarian Trust Fund on the margin of the OIC-CFM session as another effort by the member states for the financial and humanitarian support to the Afghan people.\nHe also welcomed the recent adoption of the UN resolution by designating March 15 of each year as a day to fight against Islamophobia.\nThe secretary general further said that fighting terrorism was an absolute priority of the OIC and called for capacity building of the Muslim youth in the fields of latest science and technological fields and modern education.\nHe also lauded Pakistan for its strong commitment to the charter of the OIC and its contributions for the unity and solidarity of the Muslim Ummah.\nChinese Foreign Minister Wang Yi said China was ready to build partnerships with the Islamic world for the promotion of multilateralism and democracy in international relations as well as for unity and cooperation.\n“China is ready to build four partnerships with Islamic countries. We should be partners of unity and cooperation… We need to be partners in development and revitalization… We need to be safe and stable partners.”\nHe said China would continue to stand firmly on the side of the Palestinian people. China would respect the choice made by the Afghan people, and support Afghanistan in achieving an inclusive government and steady governance.\n“On the Kashmir issue, we have once again heard the call of many Islamic friends. China shares the same aspiration,” he remarked.",
  "retrievedAt": "2025-08-11T14:35:17.602Z"
}
