{
  "title": "CPEC second phase to reinforce Pakistan’s efforts for economic development: PM",
  "link": "https://www.app.com.pk/national/cpec-2nd-phase-to-reinforce-pakistans-efforts-for-economic-development-pm/",
  "date_published": "2022-03-22T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Prime Minister Imran Khan Tuesday said that the ongoing second phase of the China-Pakistan Economic Corridor (CPEC) would reinforce Pakistan’s efforts for economic development with enhanced cooperation in areas such as industrial development, agriculture, and information technology.\nThe prime minister, in a meeting with Chinese State Councilor and Foreign Minister Wang Yi on the sidelines of 48th Session of Council of Foreign Ministers of the Organization of Islamic Conference, also welcomed Chinese investors to benefit from attractive opportunities in Pakistan.The prime minister warmly welcomed State Councilor Wang Yi to Pakistan and conveyed his heartfelt condolences on the loss of precious lives in a crash of China Eastern flight yesterday.\nThe state councilor conveyed the most cordial greetings of President Xi Jinping and Premier Li Keqiang and reaffirmed the centrality of Pakistan-China All-Weather Strategic Cooperative Partnership.\nThe prime minister and state councilor discussed the current trajectory of bilateral ties and the evolving regional and international scenario.\nThe prime minister fondly recalled his recent visit to China for the opening ceremony of the Beijing Winter Olympics and his meetings with the Chinese leadership.\nThe two sides discussed the situation in Ukraine and reiterated the imperative need for an immediate cessation of hostilities and continued efforts for a solution through sustained dialogue and diplomacy.\nPrime Minister Imran Khan briefed on India’s egregious human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and its irresponsible behaviour that was an impediment to regional peace and security.\nThe prime minister also apprised about the so-called “accidental” firing of a missile from India into Pakistan’s territory and underlined Pakistan’s call for a joint probe, and stressed the need to ensure that it does not occur again.\nThe prime minister also emphasized that Pakistan and China must continue deeper engagement to promote peace and stability in Afghanistan and avert the humanitarian crisis there.",
  "retrievedAt": "2025-08-11T14:35:23.641Z"
}
