{
  "title": "Mirza urges citizens to use face mask in public places",
  "link": "https://www.app.com.pk/national/mirza-urges-citizens-to-use-face-mask-in-public-places/",
  "date_published": "2020-06-07T02:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP):Special Assistant to the Prime Minister on National Health Services, Dr Zafar Mirza on Sunday advised the citizens to strictly follow standard operating procedures (SOPs) on use of face mask to prevent from COVID-19 in the country.\nIn a media briefing, he said that strict action will be taken on violation of these SOPs and on not wearing mask in public places. He also asked the citizens to follow social distancing and other precautionary measures to stop increasing local transmission of COVID-19 in the country.\nHe said that now the use of mask was compulsory during shopping in markets and in public transport as locally transmitted case ratio was very high.\nHe also appealed citizens to avoid hand shaking and leaving home without any reason. He said that there were complaints about violation of SOPs in markets by the citizens and shopkeepers.\nHe asked the citizens to support the efforts of government in its fight against COVID-19 and effectively implementing its lockdown relaxation policy to continue business activities and normalizing the lives of citizens.\nHe said that this relaxation policy could be successfully implemented if citizens were fully cooperated with the government and implemented all SOPs otherwise there were chances of spread of disease.\nHe said that still there were threats of spread of the disease and asked the citizens to continue implementing protective measures as per directions to stem the increase in coronavirus cases.\nHe said that in order to create awareness in public about preventive measures, the government had tried its level best to publically share all SOPs. He said that SOPs had been prepared for all persons concerned keeping in view the prevailing disease situation and asked the citizens to read these SOPs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:35.027Z"
}
