{
  "title": "Govt taking steps for stopping sugar crisis in future: Shazad Akbar",
  "link": "https://www.app.com.pk/national/govt-taking-steps-for-stopping-sugar-crisis-in-future-shazad-akbar/",
  "date_published": "2020-06-06T23:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP):Special Assistant to the Prime Minister on Accountability Barrister Shahzad Akbar on Sunday said impartial investigations had done about the sugar crises in the first time in the country and the government was taking solid steps for stopping to create these type of crisis in future.\nTalking to a private TV channel, he said the government had constituted a committee which would be formulated policy of sugar for future.\nHe said a full charge sheet was available now in the shape of sugar commission report, adding action would be taken against those people of SECP whom names were identified in the report.\nHe said the matter was transferred to the National Accountability Bureau (NAB) and it would be investigated the issue now.\nNAB was an independent institution which was performing its duties without any pressure, adding the federal government had referred the matter of subsidy of the Punjab government to the NAB and it would investigate the issue by its own ways.\nReplying to a question, he said in the past rules and regulations had violated during the appointments in the institutions.\nthe Commission had submitted all the matters to the independent institution of the NAB.\nShazad Akbar said every institution would work regarding the sugar and institutions would be submitted their answers within 90 days.\nHe said mafia would try to create hurdles in the government work and that would also try to fail the government.\nReplying to another question, he said the government would try its best level to resolve all issues regarding the sugar before starting new crushing season.\nHe said the Commission had called the Chief Minister of Sindh Syed Murad Ali Shah twice time but he did not appear a single time before the Commission and he replied that he was not bound to appear before it.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:44.254Z"
}
