{
  "title": "Time to reaffirm commitment, resolve for preserving sustainable use of oceans, marine resources: Naval Chief",
  "link": "https://www.app.com.pk/national/time-to-reaffirm-commitment-resolve-for-preserving-sustainable-use-of-oceans-marine-resources-naval-chief/",
  "date_published": "2020-06-06T21:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP):Chief of Naval Staff Admiral Zafar Mahmood Abbasi Sunday said it was the time to reaffirm their commitment and resolve for preserving sustainable use of the oceans and marine resources.\n“PN will continue to play an important role in the global and national efforts to protect and preserve the oceans; mankind’s shared resource for sustenance and prosperity,” he said on the World’s Ocean Day.\nWorld Oceans Day was celebrated globally to highlight the significance of oceans and promote awareness for sustainable use of oceans and marine resources, said a Pakistan Navy press release.\nThis year’s theme is, ‘Innovation for a Sustainable Ocean’.\nOceans are an essential component of the earth’s ecosystem and sustainable oceans are critical for sustenance of life on earth. As the challenges to the oceans continue to grow, so does the need for novel solutions to fight these challenges.\nThe purpose of observing this day is to inform the public of the impact of human actions on oceans and mobilize global efforts for sustainable management of world’s oceans. It is a day to join hands and pledge for making coordinated efforts to protect our oceans from various types of threats.\nIn line with the spirit of celebrating the World Oceans Day, Pakistan Navy is playing a leading role in promoting safe and sustainable use of ocean resources.\nSome of the major PN initiatives undertaken over the years include: beach cleaning, construction of harbour debris collection boats, Mangroves plantation, banning use of destructive fishing nets, tackling oil pollution at sea and coordination with industrial community to reduce waste dumping into the sea.\nA number of events and activities have been arranged on the day to highlight the spirit of the day and raise awareness about oceans and their resources. An active and forthcoming participation, with due regard to the prevailing COVID-19 situation, by all under Command will help promote the essence of the day.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:42.239Z"
}
