{
  "title": "PTDC announces photographic competition to mark Int’l Mountain Day",
  "link": "https://www.app.com.pk/national/ptdc-announces-photographic-competition-to-mark-intl-mountain-day/",
  "date_published": "2024-11-21T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP):The Pakistan Tourism Development Corporation (PTDC) has announced a photographic competition to commemorate International Mountain Day 2024, to be observed on December 11.\nAccording to an official source, this day will be marked under this year’s theme, “Mountain Solutions for a Sustainable Future-Innovation, Adaptation, and Youth,” which highlights the importance of preserving mountainous landscapes and promoting sustainable development.\nThis initiative aims at engaging youth, inspire innovation, and raise awareness about the role of mountains in fostering a sustainable future.\nThe event is part of ongoing efforts to celebrate Pakistan’s natural heritage and encourage responsible tourism.\nThe photographers and nature enthusiasts are encouraged to participate in this unique opportunity to showcase their talent while supporting a meaningful cause.\nThe competition invites both amateur and professional photographers to capture the beauty of mountains while reflecting the spirit of sustainability.\nIn the amateur category, the top three prizes are Rs. 30,000, Rs. 15,000, and Rs. 10,000, respectively. Meanwhile, the professional category offers prizes of Rs. 50,000, Rs. 30,000, and Rs. 20,000 for first, second, and third place winners.\nThe entries must be submitted by December 02 through the provided online portal, and selected photographs will be exhibited at the Pakistan National Council of Arts (PNCA) on International Mountain Day.\nThe competition will engage photographers to showcase their creativity by capturing mountain-related elements such as culture and heritage, mountain people and their lifestyles, Pakistan’s mountainous landscapes, adventure sports, and the flora and fauna of mountain areas.\nThe intending participants can visit www.tourism.gov.pk for more information. The event encourages responsible tourism with the motto “Leave Nothing but Footprints.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:30:34.489Z"
}
