{
  "title": "Ethiopian embassy, TDAP agree to join hands for Single Country Exhibition in Addis Ababa",
  "link": "https://www.app.com.pk/national/ethiopian-embassy-tdap-agree-to-join-hands-for-single-country-exhibition-in-addis-ababa/",
  "date_published": "2024-11-21T14:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): The Embassy of Ethiopia and the Trade Development Authority of Pakistan (TDAP) on Thursday agreed to forge collaboration for holding the Single Country Exhibition in Addis Ababa, Ethiopia during the next year in a successful manner.\nThe crucial collaboration came under discussion during a meeting between Dr. Jemal Beker Abdula, Special Envoy and Ambassador Extraordinary of Ethiopia to Pakistan, and Zubair Motiwala, Chief Executive of the TDAP.\nThe meeting was also attended by Sheryar Taj, Secretary TDAP, Abdul Karim Memon DG TDAP, and Ibrahim Tawab, Honorary Consul to Ethiopia in Karachi.\nDuring the meeting, both sides discussed strategies to sensitize the traders of both the countries about the business and trade opportunities in each other countries’ major economic sectors including agriculture and agro processing, pharmaceutical, surgical items, automotive, Information Technology, leather and leather products, construction material, steel and aluminum.\nThey agreed to launch a joint awareness campaign in all the major cities of the Islamic Republic of Pakistan to mobilize the business community for their maximum participation in the Single Country Exhibition.\nAmbassador Dr. Jemal said the Government of Ethiopia has undertaken the Home Grown Economic Reforms which had shown promising results, addressing macro-economic imbalances, increasing productivity, creating ease of doing business and providing a conducive environment for attracting the foreign direct investment.\nHe said the capital city of Ethiopia — Addis Ababa –is a third diplomatic hub hosting a number of international conferences every year including the African Union Summit. “This shows the strategic importance of Ethiopia and safe and secure environment for the global citizens.”\nHe said Ethiopia offered a comparative advantage to the Pakistani investors in terms of strategic location, cheap, clean and green energy, skilled labour, and on top of that full-fledged support from the Government.\nThe TDAP Chief Executive highlighted the business and trade potential of Pakistan in different economic sectors including pharmaceutical, surgical, steel, aluminum, automotive, construction material, leather and leather products, and others.\nHe said the Government of Pakistan was committed to the Look Africa and Engage Africa policy and has been taking significant measures to strengthen bilateral relations with all the African countries including Ethiopia.\nHe acknowledged the growing economic relations between the two countries and assured the Ambassador that all possible steps would be taken to boost the bilateral trade between the two countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:31:29.864Z"
}
