{
  "title": "PM for ensuring third party validation in all government procurements",
  "link": "https://www.app.com.pk/national/pm-for-ensuring-third-party-validation-in-all-government-procurements/",
  "date_published": "2024-11-21T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday directed the relevant authorities to ensure third party validation including quality insurance in all the government procurements.\nChairing a meeting held here to review good governance and public procurements, the prime minister also directed to bring reforms in Public Procurement Regulatory Authority (PPRA) and purge the authority of any type of influence.\n“Procurement of services and purchasing in all government institutions in a transparent way is the top priority of the government,” the prime minister said adding that ensuring transparency in the government institutions’ procurement would help building the foreign investors’ confidence on Pakistan.\nThe prime minister directed to establish a committee, separate from the procurement agency, to address complaints related to the procurement process.\nHe also stressed to appoint qualified, professional, and experienced experts at PPRA on merit.\nThe prime minister instructed all government departments to use e-Procurement (e-PADS) besides establishing special procurement cells in government departments for purchasing and acquiring services.\nTransparency in government affairs is essential for national development, the prime minister said.\nDuring the meeting, the prime minister was informed that the review of the PPRA Ordinance and related rules and regulations had been completed, and the amendments would soon be presented to the federal cabinet for approval.\nThe aim of these amendments is to ensure transparency in the procurement process and to align them with contemporary requirements, the meeting was told.\nFinance Minister Aurangzeb, Minister for Economic Affairs Ahad Khan Cheema, Petroleum Minister Dr Musadik Malik, Minister of State for Information Technology Shaza Fatima Khawaja, PPRA Board members, World Bank Country Director and other relevant high officials attended the meeting.",
  "retrievedAt": "2025-08-10T15:31:10.401Z"
}
