{
  "title": "JI emir urges lawyers to rise if Constitution is amended",
  "author": "Our Correspondent",
  "content": "MARDAN: Jamaat-i-Islami Pakistan emir Hafiz Naeemur Rehman has said that if the “Form-47 parliament” tampered with the Constitution, the lawyers should rise against it.\n\nAddressing members of the District Bar Association Mardan here on Friday, he stated that Jamaat-i-Islami’s stance on the proposed 27th amendment was clear — the party would not engage in it and any political party that became part of it would, in effect, be supporting the amendment.\n\nHafiz Naeem said that the judicial system did not need patch-work repairs but real reform, which is the need of the hour.\n\nHe added that the 27th amendment, like the 26th Amendment, was shrouded in secrecy — no one knows what it contained or where its draft originated from.\n\nThis, he said, is a mockery of the Constitution that will further weaken the judiciary.\n\nThere were reports that under the proposed 27th amendment, judges’ opinions in transfer matters were being done away with, alleging, “Such measures by the government were meant to secure decisions of its choice.\n\nHowever, he warned, “A society that loses justice cannot achieve peace.”\n\nThe JI emir further stated that nearly 27.5 million children were out of schools, while government schools were being rendered non-functional.\n\nEducation, he emphasised, is not charity — it is a fundamental right and cannot be divided by class.\n\nHe remarked that the state represents the people, not official positions.\n\nParliament’s job, he criticised, seems has been rendered to extending tenures and increasing salaries only, while the public remains neglected.\n\nThe elite class, in collusion with the establishment, has taken the nation hostage, as one percent of the people rule over the remaining 99 percent.\n\nHafiz Naeem ur Rehman said that his party did not believe in coming to power through conspiracies but\n\nwas seeking to win power by shaping public opinion, and efforts were underway to prepare people for that goal.\n\nHe added that peace could not be achieved until Pakistan reviewed its policy of subservience to the United States.\n\nAfghanistan and Pakistan, he said, are two separate countries and there must be meaningful dialogue between them.\n\nHe also remarked that political parties claiming to be champions of democracy lack democracy within themselves — they are run through inheritance, wills, and personalities.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/08092616380b50d.webp",
  "retrievedAt": "2025-11-08T23:12:48.897Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953737/ji-emir-urges-lawyers-to-rise-if-constitution-is-amended",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:53:43.000Z"
}
