{
  "title": "SP given ‘sought-after’ division after LHC declares him misfit",
  "author": "Wajih Ahmad Sheikh",
  "content": "LAHORE: A superintendent of police (SP) on Friday was given the charge of a relatively more ‘sought-after’ division in the provincial metropolis soon after the Lahore High Court (LHC) declared the officer a misfit for any field posting.\n\nInspector General of Police (IGP) Punjab Dr Usman Anwar and other officers appeared before the court of Justice Shehram Sarwar Chaudhry in a case related to an inheritance of property in Karachi. The judge had summoned the police chief after expressing displeasure over the performance of Model Town SP (Operations) Akhlaqullah Tarar in the case.\n\nThe judge observed that SP Tarar should not be assigned any field posting, otherwise, the IGP would keep appearing before courts repeatedly. Justice Chaudhry asked the IGP whether he examined the matter.\n\nDr Anwar said he did view that matter, admitting that the SP acted wrongly. He pointed out that a notice for disciplinary action had been issued to the SP. The IGP said the SP was an honest officer, but he committed a mistake.\n\nIGP admits before the court that SP acted wrongly and a notice had been issued to him; Issues transfer orders after court proceeding with the SP getting the ‘coveted’ posting\n\n“Do not assign this SP to field duty. Keep him at your office instead. It’s a suggestion. If he remains in the field, he’ll cause you trouble,” the judge warned the IGP. The judge noted that the case pertained to property in Karachi, but the SP took it up on his own.\n\nDr Anwar informed the court that the matter had now been referred to Karachi.\n\nJustice Chaudhry also showed his displeasure to DIG Operations Faisal Kamran for trying to support SP Tarar. “This means you are backing him (SP)?” the judge asked the DIG. Finally, the judge disposed of the petition as the petitioner sought to withdraw it.\n\nEarlier, petitioner Bilal Muhammad Khan appeared before the court along with his counsel Shan Gul. The petitioner had challenged an application filed by his sister regarding inheritance of property.\n\nAfter the court’s proceedings, the IGP issued a notification No 99/2025, regarding transfer and posting of eight police officers of the province.\n\nAccording to the notification, SP Akhlaqullah Tarar was transferred and posted from Model Town to Cantonment division against an existing vacancy. Many see Cantonment as the most desired division for an SP-level officer in Lahore.\n\nSources told Dawn that a federal minister intervened in the matter and rescued the SP from the ‘punishment’ of desk job. They said it would be noteworthy to see how the IGP manages to avoid the possible court’s wrath.\n\nASP Operations Defence Syeda Sheharbano replaced SP Tarar.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/08085449db6868c.webp",
  "retrievedAt": "2025-11-08T23:13:10.995Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953776/sp-given-sought-after-division-after-lhc-declares-him-misfit",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:53:31.000Z"
}
