{
  "title": "Premier builds consensus on 27th Amendment",
  "author": "Syed Irfan Raza",
  "content": "• Meets allies to secure their support; tweaks top agenda as Cabinet meets today; draft may be tabled following nod\n• PPP rejects any cut to provinces’ NFC share; backs limited changes to Article 243\n• Remains non-committal on constitutional court for now\n• Tarar sees no ‘major roadblocks’ to new legislation\n• PTI says current govt lacks mandate to amend Constitution\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Thursday held consultations with ruling allies to secure support for the controversial 27th Constitutional Amendment, with the government expected to table the bill in the Senate within days.\n\nThe prime minister has also convened a meeting of the federal cabinet today (Friday), with the 27th Amendment topping the agenda. Sources said the amendment could be introduced in parliament after cabinet approval.\n\nThe premier is due to depart for Azerbaijan later in the day for a one-day official visit.\n\nSome media reports suggested PM Shehbaz has decided to establish a parliamentary committee bringing all parties together to fine-tune the draft and seek consensus. However, there was no confirmation from the Prime Minister’s Office.\n\nIt has been learnt that all government allies, except the Pakistan Peoples Party (PPP), have assured conditional support, provided the 18th Amendment is not rolled back.\n\nThe PPP leadership, which met the prime minister earlier this week, reiterated at its Central Executive Committee meeting on Thursday that it would safeguard the 18th Amendment.\n\nOn the other hand, the government is said to be adamant about getting the 27th Amendment passed next week. The plan is to move the 27th Amendment first in the Senate and then in the National Assembly.\n\nAs constitutional amendments require a two-thirds majority in both houses, winning over the PPP remains pivotal. The next two days are said to be quite crucial in this regard.\n\nMeetings with ruling coalition\n\nMeanwhile, a delegation of Muttahida Qaumi Movement (MQM) led by its convener Khalid Maqbool Siddiqui called on PM Shehbaz on Thursday.\n\nA statement by the Prime Minister’s Office (PMO) said “discussion and consultation took place on the proposed 27th Amendment” during the meeting.\n\nThe delegation also included Sindh Governor Kamran Khan Tessori, Health Minister Syed Mustafa Kamal, MNAs Dr Farooq Sattar, Jawed Hanif Khan, Syed Aminul Haque and Khawaja Izharul Hassan, the statement added.\n\nDeputy Prime Minister Ishaq Dar, National Assembly Speaker Sardar Ayaz Sadiq, Defence Minister Khawaja Asif, Law Minister Azam Nazeer Tarar and others also attended the meeting. They were also present in PM Shehbaz’s meetings with the delegations of the Istehkam-i-Pakistan Party (IPP) and Pakistan Muslim League (PML-Q).\n\nThe IPP delegation was led by party president and Communications Minister Abdul Aleem Khan and Minister of State for Overseas Pakistanis Aun Chaudhry, while the PML-Q team was led by Overseas Pakistanis Minister Chaudhry Salik Hussain, with Senator Kamil Ali Agha and MNAs Mohammad Ilyas Choudhary and Farukh Khan in attendance. The premier also held separate meetings with Balochistan Awami Party (BAP) chief Khalid Hussain Magsi, PML-Zia president Ijazul Haq, and an Awami National Party (ANP) delegation led by Senator Aimal Wali Khan.\n\nIn a separate development, MQM has presented its own version of additions to the 27th Amendment, calling for strong, autonomous local governments across the country, and has sought JUI-F’s support for constitutional protection of the system.\n\nAn MQM delegation led by Mr Siddiqui met JUI-F chief Maulana Fazlur Rehman at his residence to present the amendment’s draft. MQM leader Mustafa Kamal said the party’s proposal aims to ensure powers and resources “reach the people’s doorsteps”, arguing that the current federal and provincial set-up “fails to deliver services effectively”.\n\nThe party said it would now await JUI-F’s formal response.\n\nMeanwhile, JUI-F Senator Kamran Murtaza confirmed that the MQM delegation had called on Maulana Fazlur Rehman and presented the draft amendment.\n\n“The 27th Amendment relates to Article 140-A, which deals with local government powers,” he said. “We will review and study the draft carefully before giving our feedback,” he added.\n\nMeanwhile, Pakistan Peoples Party (PPP) on Thursday drew a red line against any change to the provinces’ share under the National Finance Commission (NFC) Award, while indicating conditional support for limited amendments to Article 243 governing federal control of the armed forces.\n\nAnnouncing decisions of the party’s Central Exe­cutive Committee (CEC) at Bilawal House late in the night, PPP Chairman Bil­awal Bhutto-Zardari said discussions on the government’s proposed constitutional changes would continue on Friday but stressed the PPP “can never compromise on the financial rights of the provinces”.\n\n“The PPP rejects the proposal for constitutional protection of the provinces’ share,” he said, adding that the CEC had, however, authorised support for specific adjustments in Article 243.\n\n“The government has proposed giving the Joint Chiefs a new designation, creating a new position for Strategic Command and a position of Field Marshal. Only this amendment the CEC has allowed me to support,” Mr Bhutto-Zardari added.\n\nOn the question of establishing a constitutional court, the PPP remained non-committal, saying further internal deliberation was required before arriving at any decision.\n\n‘No roadblocks to amendment’\n\nInformation Minister Attaullah Tarar on Thursday said there are no major roadblocks and impediments with respect to the 27th Amendment, according to a Dawn.com report.\n\nSpeaking to Geo News, the minister said consultations among political parties on the proposed amendment were taking place in a “positive environment” and that a broad consensus appeared to be emerging.\n\n“The feeling I got during today’s (Thursday’s) meetings, in which different political parties were present … I got the feeling that there is no major roadblock or impediment,” he said.\n\n“There was no need for any further discussions or debate. Ideas were shared in a positive environment, some of which were agreed upon.”\n\n‘Govt lacks mandate’\n\nSeparately, PTI Chairman Barrister Gohar Khan said the current parliament lacks the mandate and moral authority to amend the Constitution, arguing that such changes require a “genuine two-thirds majority”.\n\nSpeaking to the media at the Lahore High Court, he warned the proposed 27th Amendment would harm both the federation and the provinces, noting that the 18th Amendment had faced no provincial objections. He also pointed out that the fate of the 26th Amendment remains pending before the Supreme Court.\n\nMr Khan said an independent judiciary is essential to democracy and parliamentary sanctity and made clear the PTI would not support the government on the latest amendment.\n\nReferring to the process adopted for the 26th Amendment, he said a committee had been formed, but “no draft ever surfaced”, adding that the PTI has resigned from that body.\n\nHe said the release of the party’s incarcerated founder Imran Khan would come “under the law, not through any deal”, and that no protest call had been given for November.\n\n“We are working within the law for his release, and he is satisfied with the ongoing efforts,” Barrister Gohar said, dismissing rumours of foreign involvement.\n\nIkram Junaidi and Kalbe Ali in Islamabad, Imran Ayub in Karachi and Wajih Ahmad Sheikh in Lahore also contributed to this report\n\nPublished in Dawn, November 7th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/070812100cf7895.webp",
  "retrievedAt": "2025-11-08T23:15:22.519Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953635/premier-builds-consensus-on-27th-amendment",
  "dateList": "2025-11-08",
  "date_published": "2025-11-07T02:13:51.000Z"
}
