{
  "title": "Govt posts rare Rs2.12tr surplus in first quarter",
  "author": "Khaleeq Kiani",
  "content": "ISLAMABAD: Backed by record interest income of the State Bank of Pakistan (SBP), a 30 per cent surge in petroleum levy collection and strong provincial cash surpluses, the government on Friday reported one of its rare fiscal surpluses — at 1.6pc of GDP — in the first quarter of the current fiscal year, slightly below last year’s 1.7pc.\n\nAccording to the Ministry of Finance’s fiscal operations report for July-September 2025, the overall budget balance showed a surplus of Rs2.12 trillion in absolute terms, up 10pc from Rs1.896tr in the same period last year. As a share of GDP, the surplus slipped marginally from 1.7pc to 1.6pc.\n\nLast year eventually closed with a 5.4pc deficit, as rising expenditures gradually offset the one-time impact of SBP profits.\n\nThe primary balance — the difference between total revenue and expenditure, excluding interest payments — stood at 2.7pc of GDP this year, slightly lower than last year’s 2.8pc. In absolute terms, however, the primary surplus grew 8.4pc to Rs3.497tr, compared to Rs3.2tr a year earlier.\n\nBehind these headline numbers, the report indicated weak revenue performance and limited expenditure control. Total revenues rose only 6pc to Rs6.2tr from Rs5.83tr, equivalent to 4.8pc of GDP, compared to 5.1pc a year earlier.\n\nRecord SBP profits, 30pc jump in petroleum levy, strong provincial balances key contributors\n\nTax revenues stayed flat at 2.4pc of GDP, while non-tax revenues fell to 2.4pc from 2.7pc last year. Despite this, total tax receipts grew 12pc to Rs3.15tr, compared to Rs2.77tr a year earlier.\n\nThe Federal Board of Revenue (FBR) collected Rs2.884tr, up 11pc from Rs2.563tr last year, but its share of GDP remained steady at 2.2pc.\n\nThe four provinces together mobilised Rs270bn in tax revenues, up 21pc from Rs213bn last year. They also more than doubled their combined cash surplus to Rs781bn, compared to Rs360bn a year ago — a 54pc increase.\n\nTotal expenditure in the first quarter rose 3.6pc to Rs4.08tr, from Rs3.93tr last year. As a percentage of GDP, spending edged down to 3.1pc from 3.4pc. The statistical discrepancy widened to Rs262bn from Rs117bn, apparently due to slower or delayed federal transfers to the provinces.\n\nCurrent expenditure climbed 12.6pc to Rs4.07tr from Rs3.54tr but remained unchanged at 3.1pc of GDP. Within this, markup payments increased 5pc to Rs1.378tr from Rs1.31tr, holding steady at 1.1pc of GDP.\n\nDefence spending rose 8.4pc to Rs447.5bn, up from Rs410bn last year, but declined slightly as a share of GDP — to 0.3pc from 0.4pc.\n\nOf the total federal non-tax revenue of Rs2.984tr, down slightly from Rs2.997tr last year, the bulk — Rs2.43tr — came from SBP profits, compared to Rs2.5tr last year. These were driven by the lagged impact of the record-high 22pc policy rate. Markup and dividend income from state-owned enterprises fell 35pc to about Rs40bn from Rs62bn a year earlier.\n\nThe report attributed the 54pc rise in provincial surpluses largely to slower or last-minute fund releases from the centre. Punjab led the way, posting a record Rs442bn surplus in the first quarter — a tenfold increase from Rs40bn last year.\n\nSindh followed with a surplus of Rs209bn, up 37pc from Rs131bn a year earlier. Khyber Pakhtunkhwa’s surplus, however, dropped 35pc to Rs77bn from Rs104bn, while Balochistan’s contribution fell over 57pc to Rs54bn, compared to Rs85bn last year.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/08072049938513c.webp",
  "retrievedAt": "2025-11-08T23:12:10.808Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953814",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:32:21.000Z"
}
