{
  "title": "Karachi judge rejects police report on custodial death, orders FIA to launch probe into suspect’s killing",
  "author": "Sumair Abdullah",
  "content": "• Asks IGP to take departmental action against Kalakot police\n• Findings proved that Sikander’s death was custodial homicide, court observes\n\nKARACHI: While rejecting the opinion of an investigating officer (IO) in a case pertaining to the custodial death of a man detained on charges of motorcycle theft, a judicial magistrate has directed the Sindh police chief to take departmental action against the officials of the Kalakot police station allegedly involved in torture, negligence, and abuse of authority and referred the case to the FIA for further investigation.\n\nThe direction was made by Judicial Magistrate (South) Naeem Akhtar, who referred the case to the Federal Investigation Agency under Section 5 of the Torture and Custodial Death (Prevention and Punishment) Act, 2022, for an impartial and transparent investigation into the matter.\n\nIn its detailed order against a final charge sheet submitted by the IO in which he had suggested to take cognizance against private persons and attempted to “cover up a custodial killing”, the court noted that it disagreed with the final report submitted under Section 173 of the CrPC.\n\n“The inquest and post-mortem findings conclusively prove that Sikander’s death was a custodial homicide, resulting from torture, unlawful confinement and gross negligence,” it added.\n\nRegarding the delay and concealment of facts, the judge wrote in its order that the record reflects that the incident allegedly occurred in March, 2025 when some private persons accused the deceased (Sikander) of motorcycle theft and later the police registered a case against the suspect under Section 381-A of the Pakistan Penal Code.\n\n“It is important to note that at the time of receiving the custody, a memo of arrest and recovery dated 13.03.2025 at 06:30 hours was prepared. A careful examination of this memo reveals that there is no mention whatsoever that the accused was in an injured or critical condition. Likewise, no roznamcha entry has been produced to indicate that Sikander was brought to the police station in such a condition.\n\n“It further appears that after arrest, the accused was directly confined in the lock-up, and no intimation was made to the Anti-Vehicle Lifting Cell (AVLC), although the alleged offence under Section 381-A of the PPC exclusively falls within the jurisdiction of the AVLC for investigation. No record has been produced showing that the mandatory information was conveyed to the AVLC or that custody was transferred.\n\n“Instead, Sikander continued to remain in the lock-up of police station Kalakot until his health deteriorated to a gasping state, ultimately resulting in his death. Sikander died on 13.03.2025. However, the FIR regarding his abduction and subsequent events was lodged belatedly on 18.03.2025 at 21:30 hours — almost six days after the incident. This inordinate and unexplained delay strongly indicates an attempt to conceal the true circumstances, alter the timeline, and manipulate the sequence of events surrounding Sikander’s illegal detention and custodial death. Such delay is wholly inconsistent with transparency and raises serious doubt regarding the bona fides of police action,” the court observed.\n\nThe court noted that the police claimed that Sikander was brought to the police station by the private persons in an already injured and critical condition. However, the court rejected their contention as it was not supported by any credible evidence.\n\n“The deceased was detained from 06:30 hours on 13.03.2025 until 15:18 hours on 13.03.2025, when he was finally shifted to Civil Hospital Karachi in a gasping condition. He was declared dead at 15:30 hours. This amounts to 07 hours of unlawful confinement without medical treatment. If he was indeed critical upon arrival, the failure to transfer him to a hospital immediately reflects culpable negligence and intentional disregard for human life,” the court observed.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/080947088e21b0d.webp",
  "retrievedAt": "2025-11-08T23:13:10.015Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953796/karachi-judge-rejects-police-report-on-custodial-death-orders-fia-to-launch-probe-into-suspects-killing",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:53:26.000Z"
}
