{
  "title": "Iraqis sceptical of political system ahead of elections",
  "author": "Reuters",
  "content": "BAGHDAD: Iraqis will elect a new parliament on Tuesday (Nov 11), in a key test for Prime Minister Mohammed Shia al Sudani and for a system seen by the country’s young population as merely enriching those already in power.\n\nMany ordinary voters are disillusioned with Iraq’s 20-year-old experiment with democracy, saying it has brought only corruption, unemployment and poor public services, while parties, politicians and armed groups divide the spoils of their country’s vast oil wealth and distribute jobs to loyalists.\n\nIraq began voting for its politicians in 2005, after the 2003 US invasion which toppled Saddam Hussein.\n\nSectarianism has lar­gely subsided, especially among younger Iraqis, but remains embedded in a political system that shares out government posts among Shias, Sun­nis, Kurds, Christians and other ethnic and religious groups.\n\nRoughly 40 per cent of the registered candidates are under 40, highlighting attempts by the new generation to challenge the political domination of older power networks. Sudani, who took office in 2022 and is seeking a second term, leads the Reconstruction and Deve­lopment Coalition, which groups several Shia parties and is campaigning on improving services, fighting corruption and consolidating state authority.\n\nHe has been a rare strong prime minister who has pushed through reconstruction projects and fostered cordial ties with both Iran and the US, Iraq’s main foreign allies.\n\nThe State of Law Coalition, led by former premier Nouri al Maliki, remains influential and competes with Sudani’s camp for dominance. A collection of parties with ties to Iran and with their own armed groups are running on separate lists.\n\nThe main Sunni political force is former parliamentary speaker Moha­mmed al Halbousi’s Taqa­ddum (Progress) Party. It draws support from Iraq’s mainly Sunni west and north — Saddam’s former heartlands.\n\nThe Kurdistan Democ­ratic Party (KDP) of veteran leader Masoud Bar­zani dominates the semi-autonomous government of the northern Kurdistan Region. It seeks a greater share of the oil revenues that shore up the national budget.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/690e873a8947f.gif",
  "retrievedAt": "2025-11-08T23:13:47.438Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953838/iraqis-sceptical-of-political-system-ahead-of-elections",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:53:20.000Z"
}
