{
  "title": "New MBBS admission policy in Punjab draws flak",
  "author": "The Newspaper's Staff Reporter",
  "content": "LAHORE: A new admission policy for public sector medical colleges in Punjab has drawn criticism from the current-year aspirants who have labelled it ‘severe injustice’ that squanders the legitimate rights of deserving students.\n\nThe controversy appeared after a recent announcement by the Punjab government, allowing the candidates from the 2023 and 2024 admission cycles to reapply for seats in 2025, using their old MDCAT scores. The policy, which shifts the implementation responsibility to the Pakistan Medical and Dental Council (PMDC), has been called unprecedented and discriminatory.\n\nRepresentatives of the 2025 student cohort held a press conference, saying that the purpose of conference was to bring to the attention of the government and authorities to the disparity and injustice faced by the deserving and capable medical aspirants of 2025.\n\nProtestors argued that the three-year validity of the MDCAT scores had no global or national precedent. They pointed to the admission authority in Sindh, which had rightly decided that admissions would be granted solely based on the 2025 entry test, ensuring impartiality.\n\n“Why should medical students alone be subjected to such an unprecedented policy?’ the speakers questioned. They highlighted that other leading Pakistani institutions, including NUST, AKU, UET, PU and GCU, based their admissions strictly on the current year’s entry test.\n\nThe policy has been described as a ‘backdoor entry’ for students who failed to secure admission in their respective years.\n\n“It implies that the aspirants of 2025 are being treated as less competent or less deserving than the repeaters — an assumption that is illogical,” the conference was told.\n\nTo underscore their point, the speakers presented compelling data, noting that the 2024 MDCAT had 200 questions, with a staggering 2,750 students scoring between 190 and 200 marks. In contrast, the 2025 test was more compact with 180 questions, and only 817 students managed to score between 170 and 180.\n\n“This reduction in both the number of questions and the proportion of high scorers clearly indicated that the 2025 test was more challenging,” they argued.\n\n“Treating both examinations as equivalent would, therefore, deprive the 2025 aspirants of their lawful right to fair competition.”\n\nThe students feared that candidates who already secured admission to 2024 — particularly those with scores higher than last year’s closing merit of 94.30 per cent for MBBS — might reapply  to upgrade to more prestigious colleges or secure a seat in their hometowns.\n\n“This would trigger a massive wave of seat upgrade and replacements, leading to administrative chaos and wastage of seats,” they cautioned.\n\n“Such a scenario would ultimately spiral beyond control.”\n\nIn light of these concerns, the 2025 medical aspirants appealed to the Punjab government to follow the example set by institutions like NUST, AKU, and Sindh’s admission authority by restricting admissions for 2025 exclusively to those who appeared in the 2025 MDCAT, they concluded.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/080859062715647.webp",
  "retrievedAt": "2025-11-08T23:12:48.834Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953772/new-mbbs-admission-policy-in-punjab-draws-flak",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:53:31.000Z"
}
