{
  "title": "(Un)constitutional amendments: Why the 27th could mean the death of justice",
  "author": "Asad Rahim Khan",
  "content": "“I looked around in that ceremony, at the majority of recipients, and realised the rot that had set in: a constitutional colossus like him being honoured in the company of pygmies and dwarves … we have violated our oath to uphold the Constitution, and the result is a stark regression in the judicial protection of human rights.”\n\n— Justice Shahid Karim on the conferment of Hilal-e-Imtiaz on the late Justice Fazal Karim, 17 November 2023\n\nA year ago today, Qazi Faez Isa departed as the chief justice of Pakistan.\n\nHis parting gift was to reverse the ruling on dissident votes in the parliament. This, we know, kicked the gates open to the 26th amendment, as once-unbothered lawmakers were promptly forced into voting for the judiciary’s funeral rites.\n\nThe bill was passed, and the third branch was destroyed.\n\nBut while obeying His Lordship’s decision, the unity regime felt free to disobey that of the other lordships in a different case — reserved seats. It was just enough defiance to secure the numbers for their amendment.\n\nHow, you ask, does the executive override the Supreme Court whenever it feels like? By precedent. Two years earlier, it had shrugged off the Bandial Court’s orders to hold elections in 90 days. Only, once the state learns to ignore some judges, it learns to ignore the lot of them.\n\nAs several worthies deciding the reserved seats matter found out: it should have come as no surprise that their 12-member verdict was flung away as casually as that of the Bandial Court’s five — they’d enabled it via bizarre dissenting notes in the 90 days case, and then by supporting the trash-fire practice and procedure law chaining their own hands.\n\nPer historian Edward Gibbon, “Those princes … permitted for a while to hold a precarious sceptre, were dismissed from their thrones as soon as they had performed their appointed task of fashioning to the yoke the vanquished nations.”\n\nAnd that yoke’s latest form — the Constitutional Bench — has more than delivered: out go reserved seats, in come military trials of civilians, and from the skies new lords parachute into the last holdout: the Islamabad High Court.\n\nNor is the unity regime satisfied. Its eyes are on a bigger prize: the creation of a so-called Constitutional Court. If allowed to go through, what was the worst judicial regression in over 30 years risks becoming the worst in Pakistan’s history. We look at the facts.\n\nFor starters, Pakistan’s entire justice system is built on common law, as opposed to that of civil law countries. To explain, common law systems (such as the United Kingdom and its former colonies, Pakistan and India) develop the law case by case, through precedent.\n\nThis can’t be overstated: stare decisis — to stand by what’s decided — makes the law dependable and predictable, with judges leaning on verdicts that have been handed down over decades and centuries. It also means trusting the courts to interpret the law and protect the people.\n\nHistory is in play here: in common law countries, it was thought that empowered, independent judges would shield the citizen from tyrannical kings (a recurring problem in Pakistan).\n\nCivil law systems believe in no such thing: there is no strong doctrine of precedent; the code is all; and judges are considered best when applying the law’s black letter as faceless, nameless robots.\n\nBut civil law countries are also born from specific nightmares: France, their prime example, was forged in the fire of revolution, when judges were thought enemies of the people and instruments of class privilege. Restoring order to madness, Napoleon made sure to straitjacket the judges into ‘la bouche de la loi’ — the mouth of the law, and no more.\n\nThat’s already the opposite of Britannia and its South Asian heirs, where the courts only ever gained in legitimacy when opposing despots. While Napoleon’s France codified against judges, we developed the common law through them.\n\nTake also Germany, another well-known civil law buff: its constitutional court sits atop a culture of obedience and bureaucratic discipline. Pakistan, on the other hand, is always at risk from the gloved hand; its most basic rules of the road remain unsettled; and its judges are routinely pressed into service as the final frontier against democracy’s derailment.\n\nDoes that sound like a place where judges should be reduced to bean-counters?\n\nInterestingly, ours is the first ruling class pleading for a civil law system to escape neither degenerate elites (France) nor fascist dictatorship (Germany), but its own Supreme Court.\n\nThough stating the obvious, constitutional review is already vested in our superior courts: the high courts and the Supreme Court. They are also more than happy to exercise that jurisdiction under Articles 4 and 199 (judicial review of executive action and fundamental rights), with the Supreme Court acting as the final arbiter through Articles 184, 185, and 187.\n\nBut the unity regime wishes to strip them of that core function. The demoted Supreme Court, as this writer has said previously, shall now concern itself with civil nosebleeds, land disputes, maybe the odd buffalo wandering into a stranger’s rice paddy. That is no apex court, nor what it’s for.\n\nThis also breaks the third branch altogether: from a relatively clear path — trial courts to appellate High Courts to a final Supreme Court — we now get a new forum with a dozen detours.\n\nFor one, meaningless distinctions between ‘ordinary’ and ‘constitutional’ judges will fragment what’s already considered one of the most broken legal systems in the world.\n\nFor another, constant litigation over jurisdictional boundaries — what is a ‘constitutional’ question and what is not — will fill more dockets, burn more time, and nudge out more cases.\n\nFinally, instead of our judicial structure as one coherent pyramid, we’re set for two competing apexes, with doctrinal chaos as a result.\n\nWhich brings us to why this amendment is being brought in the first place.\nIt’s certainly not pendency; a fallacious reason that only the most cynical and intellectually dishonest lawyers can put across with a straight face. As of 2024, per the Law and Justice Commission’s report, Supreme Court cases make up just 2 per cent of total pendency in the country.\n\nThat’s right: the main focus of the 26th and 27th amendments — for all the wide-ranging havoc they have brought and will bring to the judiciary — leaves 98pc of cases and 98pc of the litigant public untouched. (Even if we toss in all superior courts, it’s still over 80pc in the cold).\n\nBecause the litigant public was never worth securing, so much as a unity regime, that same public threw out in the last election. As yet another doorstop for the unelected, the new federal court will now serve as a warehouse for pliant judges: think Constitutional Bench with a hundred times the square footage.\n\nAnd as a means of executive capture, what a joy it will be: a smaller court will require fewer appointments to control; its members can be packed in a single political cycle; favourites can audition from the provinces; and the Supreme Court’s senior career judges with decades of independence baggage can be skipped over at once.\n\nNot least, by stripping their consent from the equation, independent judges will be transferred from province to province in the manner of common bureaucrats. Imagine if, at the first sign of resistance, the centre keeps ping-ponging courageous judges between Quetta and Karachi.\n\nIt even works out in converse: those timid souls making a career of doing the executive’s bidding will have added incentive not to get any funny ideas, and continue churning out one mindless judgment after the other.\n\nThe selling point of any new system is its lack of a difficult past: why sweat history?\n\nAnd given federal constitutional courts — Europe’s, at least — tend to turn up their nose at precedent anyway, we arrive at the real bonus: decades of rights-friendly case law can be distinguished, overruled, or declared ‘inapplicable’ under the new amendment.\n\nThe Constitutional Bench has shown us a helpful preview: its reserved seats decision is gloriously bereft of even the most basic logic, while its military trials verdict seems to be labouring under the impression that Pakistan remains frozen in Bhutto’s emergency, and that judicial independence and the right to fair trial never happened in the interim.\n\nHence, also, the crux of our neo-PCOs, the 26th and 27th amendments: an embarrassed state of exception can become proud law. Yes, there have been a fair few outliers. But generally, from 2009 to 2023, the post-restoration judiciary guarded its turf.\n\nSo the deep state has seen fit to raise a new judiciary instead, and upend the very terms of that restoration: a process begun in earnest when the unity regime crowed with glee that democracy could be overridden based on a fictional 4-3 verdict in the 90 days case. It was the beginning of the end, with that end turbo-charged by the year of Qazi.\n\nIn other ways, however, the judicial branch may well be regressing to the mean. After all, Pakistan has never suffered from a shortage of constitutional courts — what has forever plagued it is a lack of constitutional courage.\n\nOr perhaps ignorance.\n\nIt can be assumed the vast majority of regime tools punching the air for a constitutional court haven’t the first idea of the difference between common law and civil law countries (or that Pakistan is a common law country at all); of the role of precedent in shaping the law over decades; of how the the forced transfer of judges is a humiliation; or of how foolish it is to blindly transplant alien organs into a republic with its own zaman, makan, and ikhwan; of how an entire judicature mustn’t be sacrificed to win sordid little grudge matches.\n\nYet it can equally be assumed they will become domain experts the very second the levers of power fall from their hands, and the benefit of independent judges becomes clear to them as thunder.\n\nSooner, one can only hope, than when drafting their own bail petitions.\n\nThe author is a lawyer and columnist.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://www.dawn.com/_img/social-default.jpg",
  "retrievedAt": "2025-11-08T23:31:38.054Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953108/unconstitutional-amendments-why-the-27th-could-mean-the-death-of-justice",
  "dateList": "2025-11-08",
  "date_published": "2025-11-06T06:46:31.000Z"
}
