{
  "title": "Secrecy again",
  "author": "Editorial",
  "content": "THE race is on. With the ruling PML-N attempting to build consensus around the proposed 27th amendment and opposition parties scrambling to present a united front, the next few days are expected to see a fresh round of wheeling and dealing over what fresh constitutional alterations will be approved.\n\nIt is telling that no draft of the proposed amendment has yet come to the fore, even though the prime minister himself is rallying allies for the vote. This, of course, is not unprecedented. It was much the same when the 26th Amendment was being prepared for the vote — few knew what was in the legislation, but the expectation, given the pressure, was that lawmakers would vote in favour of it, without any questions asked. How the amendment was passed is now part of the historical record. It remains to be seen if the 27th amendment will be made part of the Constitution in the same way.\n\nIt is unfortunate that this has become the new normal. The onerous conditions placed on parliament for the passage of a constitutional amendment were meant to ensure that the process would be treated with the seriousness and sobriety it deserves. The ‘two-thirds of the total vote’ requirement, for example, was put in place to ensure that the Constitution would not be trifled with, and that any changes to it could only be enacted through parliament when there was an overwhelming consensus.\n\nA series of unfortunate decisions from the country’s top court over the past year have all but ensured that those checks and balances have been reduced to minor inconveniences, and that, too, which mostly exist on paper. And yet, there is such secrecy around the next set of major alterations to the law that the government will not even talk about them openly, let alone host a debate on their implications.\n\nFor now, any legislation to roll back the 18th Amendment has drawn a ‘no’, not only from opposition parties, but also from the PPP, whose votes are vital for any amendment to pass. One may, therefore, rest a little easier on this subject.\n\nHowever, at stake is also the future of two other institutions, and it appears at the moment that while the government may concede on the rollback of the 18th Amendment, it could get its way on the other subjects. This ‘lesser of the two evils’ way of enacting legislation does not convince anyone.\n\nIt remains necessary for the acceptance and legitimacy of any amendment that it be debated openly and at length. Therefore, the incumbent regime should not set even a tentative date for voting on it till the public’s representatives make clear where they stand. Parliament must not be reduced to a rubber-stamp for the whims of the powerful.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/08075141015b260.webp",
  "retrievedAt": "2025-11-08T23:12:09.110Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953860/secrecy-again",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T01:01:33.000Z"
}
