{
  "title": "Silence or surrender: The 27th Amendment and the unmaking of justice",
  "author": "Waqas Ahmad",
  "content": "“The judiciary must be independent of every other power; otherwise, there is no liberty, no security, no justice.” — John Adams\n\nCenturies after John Adams spoke these words, their resonance feels almost prophetic today, as the government tables the 27th Constitutional Amendment. For those who have witnessed the slow, deliberate erosion of judicial independence in Pakistan, this moment feels less like reform and more like resignation.\n\nThe judiciary, already weakened and weary after the 26th Amendment, now stands on the precipice of collapse. What is being framed as an administrative restructuring — the creation of a separate constitutional court — in truth, threatens to hollow out the very authority of an institution that has long stood as the final line of defence between power and the people.\n\nIt is not merely an amendment to a document; it is an assault on the idea that justice must stand apart from politics. The judiciary is not an accessory to government; it is the conscience of the nation. When that conscience begins to fade, when its voice trembles under pressure, the entire structure of liberty begins to shake.\n\nI remember vividly why I, and so many of my generation, chose this path. We are the first-generation lawyers — young once, idealistic, and uncertain about the future — but we came into this profession not for wealth or prestige, not to wear robes or titles. We were drawn to the law because we had seen something extraordinary: the courage of those who stood in the streets during the movement of 2009. The lawyers, judges, and ordinary citizens who rose to defend the Constitution then did so not for themselves but for a belief — a belief that justice must forever remain beyond the reach of politics and power.\n\nThat movement was not about personalities; it was about a principle. It restored a dignity that had been stripped away from our courts and reminded a nation that justice could still prevail when conscience awakened. The videos still available on YouTube show us those days — the chants, the tear gas, the arrests, the sheer defiance etched on every face. People carried nothing but the Constitution in their hands, yet it was enough to move mountains. The law, in that moment, stood taller than fear.\n\nIt was a time when truth walked unarmed, and yet, it conquered.\n\nToday, that same spirit feels painfully distant. The silence of those entrusted with defending the judiciary now hangs heavy over every courtroom and every lawyer’s heart. We had placed our hopes in the judges — believing they would guard the independence of the bench, believing that when the moment came, they would remember the blood and courage that restored this institution. And yet, their silence has become deafening. It is not neutrality — it is surrender. It is the quiet undoing of everything that was once fought for.\n\nOur silence in this defining moment will be a grave injustice and a treason with the blood of those who shed theirs in the 2009 movement. It will be a betrayal of their courage, their conviction, and their sacrifice. Those who once stood for justice, who faced batons, tear gas, and imprisonment, did not suffer so that we could fall silent today. To remain unmoved now is to desecrate the memory of that struggle and the spirit that once lifted this nation. Silence in this hour is not just inaction — it is complicity. It is the surrender of the very ideals we once promised to protect.\n\nBut this is not the end. Not yet. There is still time to reclaim what was won with such sacrifice. There is still time for courage, humility, and reflection. We owe it to those who stood before us, and to those who will come after us, to raise our voices once more — to remind those in power that the judiciary does not belong to them. It belongs to the people, to the Constitution, and to every citizen who still believes in fairness and truth.\n\nHistory does not forget such moments. No political party will be remembered for the amendments it passed or the power it grasped. But history will remember the silence — or the courage — of those who were entrusted with justice and chose how to respond in this hour of testing. The question is not whether power will prevail (it always tries to). The question is whether conscience will resist, whether courage will still find a voice when silence feels safer.\n\nThe choice before us could not be clearer. Either we allow this moment to pass in quiet resignation, or we rise, as those before us did, to defend the sanctity of justice. The judiciary’s independence is not a ceremonial value; it is the living heart of democracy. When it falters, the people lose their last defence against tyranny. Every lawyer, every judge, and every citizen must understand — the fight for judicial independence is not a fight for the judiciary alone; it is a fight for the soul of constitution and country itself.\n\nTo stand up now is not to be reckless; it is to be responsible. It is to remind ourselves that independence of judiciary is not merely a clause in a Constitution — it is the beating heart of a free people. When the judiciary trembles, the nation’s conscience shakes with it. When we remain silent, we allow that tremor to grow into collapse. The independence of the judiciary was never gifted; it was earned — with struggle, with resilience, and with blood. And it will survive only if we defend it with the same fire that once lit our streets.\n\nBecause at the end of all laws and amendments, it is not power that endures — it is principle. Power fades, regimes fall, but the courage to defend justice, even when it costs you everything, becomes eternal. The history of this nation will not be written by those who silenced dissent, but by those who dared to speak when silence was safer.\n\nAs Martin Luther King Jr reminded us, “In the end, we will remember not the words of our enemies, but the silence of our friends.”\n\nThe author is a lawyer based in Islamabad.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://www.dawn.com/_img/social-default.jpg",
  "retrievedAt": "2025-11-08T23:11:16.636Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953885/silence-or-surrender-the-27th-amendment-and-the-unmaking-of-justice",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T09:31:11.000Z"
}
