{
  "title": "PPP, PML-N dismiss claims of 27th Constitutional Amendment being passed in haste",
  "author": "News Desk",
  "content": "The PML-N and the PPP on Saturday rejected the impression that the 27th Constitutional Amendment was rushed through without proper debate, saying the draft has undergone “extensive scrutiny”.\n\nEarlier today, after getting approval from the federal cabinet, the bill for the 27th Constitutional Amendment was tabled before the Senate and subsequently referred to the standing committees on law and justice.\n\nSpeaking on Geo News programme Naya Pakistan, Minister of State for Law and Justice Barrister Aqeel Malik said there was “no urgency” in convening the cabinet meeting even though Prime Minister Shehbaz Sharif attended the session virtually from Baku, Azerbaijan.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%Remaining Time -0:00MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nMalik said there was “a lot of discussion” about the proposed constitutional amendment, adding that deliberations were continuing within party committees and that it was the parliamentarians’ right to propose amendments.\n\nHe maintained that a “wrong impression” had been created that the process was being hurried. The state minister also said that some changes can be made to the draft as it is under debate in parliamentary committees.\n\nWhen informed by the show’s host that the 18th Amendment was passed after over a year of consultations and the 26th Amendment was debated for more than a month, while the proposed 27th Amendment appeared to have moved from draft to agreement in less than a week, with PPP Chairman Bilawal Bhutto-Zardari receiving the draft on Monday, holding a Central Executive Committee (CEC) meeting, and reaching consensus shortly after, Malik acknowledged the unusually rapid pace of the process.\n\nPPP’s Nadeem Afzal Chan, however, credited his party, highlighting that hours-long sessions were held during the two-day CEC, with every member participating in a detailed and open discussion on issues ranging from Article 243 to dual nationality. He assured that there was adequate debate within the PPP on the proposed changes.\n\n“If law-making is done in a hurry, the public becomes suspicious for no reason,” Chan said.\n\nWhen asked about revision in the NFC formula, Chan said that the federation grants tax exemptions worth Rs300 billion and oversees around 25 departments that do not even conduct audits.\n\n“You cannot fix your own tax system and then say you will take money from the provinces,” he said.\n\nThe bill, which was tabled in the Senate by Law Minister Azam Nazeer Tarar, proposed the formation of a Federal Constitutional Court, changes in the process for appointing high court judges, changes to the threshold for provincial cabinets, and changes to the military leadership structure.\n\nAt the outset of the session, Tarar, who had earlier in the day briefed the media on some features of the proposed legislation after the federal cabinet meeting), requested the suspension of the question hour and other house business so he could brief lawmakers on the amendment.\n\nThe law minister then moved the bill before the upper house, with Chairman Yousuf Raza Gillani referring it to the National Assembly and Senate standing committees on law and justice for review and consideration. He said that both committees may hold joint meetings for a detailed review and consideration, and the report would be presented before the House.\n\nDuring the Senate session, PTI’s Ali Zafar said debating the constitutional amendment was not appropriate when the leader of the opposition’s seat remained vacant. He said that the government and its allied parties appeared to be in a hurry to pass the bill.\n\nThe PTI did not attend the subsequent session of the parliamentary committees and called it a “conspiracy against the Constitution”.\n\nOn November 3, PPP Chairman Bilawal Bhutto-Zardari revealed that the government’s proposed amendments included “setting up [of] constitutional court, executive magistrates, transfer of judges, removal of protection of provincial share in NFC, amending article 243, return of education and population planning to the federation and breaking [the] deadlock on appointment of ECP”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/08213126ff3ddc6.webp",
  "retrievedAt": "2025-11-08T23:10:49.126Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953906/ppp-pml-n-dismiss-claims-of-27th-constitutional-amendment-being-passed-in-haste",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T17:25:21.000Z"
}
