{
  "title": "British army chief meets COAS Munir; both discuss enhancing bilateral defence cooperation",
  "author": "Dawn.com",
  "content": "The British Army’s Chief of the General Staff (CGS) Gen Sir Charles Roland Vincent Walker on Thursday met Chief of Army Staff (COAS) Field Marshal Asim Munir in Rawalpindi, where the two discussed boosting bilateral defence cooperation.\n\nThe meeting between the army chiefs took place at the General Headquarters (GHQ), a press release from the Inter-Services Public Relations (ISPR) said.\n\n“During the meeting, matters of mutual interest, regional security and measures to further enhance bilateral defence cooperation were discussed,” it said.\n\n“Both sides reiterated the need for continued collaboration to ensure peace and stability in the region,” the military’s media affairs wing added.\n\nGen Walker “appreciated Pakistan Army’s achievements and sacrifices in the fight against terrorism and its efforts for regional peace and stability”, according to the ISPR.\n\nUpon his arrival at the GHQ, the British CGS laid a floral wreath at Yadgar-i-Shuhada to pay homage to the martyrs. He was presented with a guard of honour by a smartly turned-out contingent of the Pakistan Army.\n\nThe field marshal’s meeting today comes about two weeks after his visit to Egypt, where he held discussions with the Egyptian Armed Forces’ Chief of Staff Lt Gen Ahmed Khalifa Fatehi and Minister of Defence and Defence Production Gen Abdul Maged Saqar.\n\nCOAS Munir had last met with Gen Walker during his five-day official visit to the United Kingdom in February, where he attended and delivered a keynote address at the annual 7th Regional Stabilisation Conference at the Royal Military Academy in Sandh­urst.\n\nDuring his visit, the army chief had also engaged with the UK’s then-chief of defence staff Admiral Toney Radikin and National Security Adv­i­ser Jonathan Nicholas Powell, and Home Secretary Yvette Cooper to discuss shared security challenges and the importance of enhanced collaboration between the two nations.\n\nIn May 2024, then-CGS Gen Sir Patrick Sanders had paid a visit to Pakistan, where he met COAS Munir, with Gen Walker present as well as the CGS-designate. Gen Sanders had also addressed the sixth Pakistan-UK Regional Stabilisation Conference at Islamabad’s National Defence University.\n\nCOAS Munir and then-CGS Gen Sanders had also met in May 2023 as the latter visited Rawalpindi, where he acknowledged the Pakistan Army’s sacrifices in the fight against terrorism.\n\nSeparately, Chairman Joint Chiefs of Staff Committee (CJCSC) General Sahir Shamshad Mirza has held meetings with the sultan of Brunei Darussalam and other officials during an official visit to the country, expressing the commitment to “further strengthen military-to-military ties and defence cooperation”, the ISPR said today.\n\nAccording to the ISPR, apart from meeting the sultan of Brunei, Sultan Haji Hassanal Bolkiah Mu’izzaddin Waddaulah Ibni Al-Marhum Sultan Haji Omar ‘Ali Saifuddien Sa’adul Khairi Waddien, General Shamshad also held meetings with  Yang Berhormat Pehin Datu Lailaraja Major General (Retired) Dato Paduka Seri Awang Haji Halbi bin Haji Mohd Yussof, Brunei’s minister at the PM’s office and minister of defence-II, as well as Major General Dato Paduka Seri Haji Muhammad Haszaimi bin Bol Hassan, commander of the Royal Brunei Armed Forces.\n\nDuring the meetings, both sides discussed the evolving global and regional security environment in the meetings, the ISPR statement said, adding that the CJCSC “underscored Pakistan’s cordial relations with Brunei Darussalam and expressed his commitment to further strengthen military-to-military ties and defence cooperation”.\n\nThe CJCSC also visited the ship KDB Darulaman at Muara Naval Base and the Defence Academy of the Royal Brunei Armed Forces.\n\nAt the defence academy, he “delivered a talk on ‘Pakistan’s contributions to regional peace and stability’ and interacted with the students of command and staff course, including officers from 19 foreign countries”.\n\nAccording to the ISPR statement, the sultan and civil-military leadership of Brunei Darussalam “appreciated [the] high professional standards of Pakistan’s armed forces and their achievements and sacrifices in [the] fight against terrorism”.\n\nThe statement also said that upon his arrival at the Royal Brunei Armed Forces headquarters, “a smartly turned-out military contingent presented a ‘Guard of Honour’” to the CJCSC.\n\nThe CJCSC’s Brunei’s visit comes roughly around a week after his trip to Bangladesh, where he called on Chief of Army Staff General Waker-Uz-Zaman at Army Headquarters in Dhaka. The two leaders expressed appreciation for the “positive trajectory” of growing defence cooperation between Pakistan and Bangladesh during the meeting, the ISPR said.\n\nDuring the visit, the CJCSC also met with Bangladesh Chief Adviser Muhammad Yunus, Chief of Naval Staff Admiral Mohammad Nazmul Hassan, Chief of Air Staff Air Chief Marshal Hasan Mahmood Khan and Principal Staff Officer (PSO) of the Armed Forces Division Lt Gen S.M. Kamrul Hassan.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/061729307bc7522.webp",
  "retrievedAt": "2025-11-08T23:14:47.074Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953492/british-army-chief-meets-coas-munir-both-discuss-enhancing-bilateral-defence-cooperation",
  "dateList": "2025-11-08",
  "date_published": "2025-11-06T07:32:07.000Z"
}
