{
  "title": "‘Illegal’ structures razed during Shinkiari anti-encroachment drive",
  "author": "Our Correspondent",
  "content": "MANSEHRA: The district administration on Friday demolished structures and commercial buildings constructed on the land belonging to the forest department in the Shinkiari area.\n\n“We have launched the operation to reclaim government land where shops and other commercial buildings had been illegally constructed,” Baffa-Pakhal assistant commissioner Nayab Abbasi told reporters.\n\nPersonnel from the police, tehsil municipal administration, and forest department took part in the operation and demolished over a dozen buildings and structures built along the Karakoram Highway to ensure the smooth flow of traffic.\n\nHeavy machinery was used to pull down the structures, which, according to the district administration, had been occupied by land grabbers despite repeated notices.\n\nTemporary stalls and handcarts were also removed and shifted to the TMA godowns.\n\nThe local residents said that some of the shops and buildings had previously been demolished by the authorities but were rebuilt by encroachers, challenging the writ of the government.\n\nMs Abbasi urged traders assembled on the occasion to cooperate with the administration in clearing government land instead of creating hurdles in the anti-encroachment drive.\n\n“We will expand this operation to other parts of the tehsil and remove all illegal structures raised on government land or within the right-of-way along the Karakoram Highway and other arteries,” she said.\n\nARTIFICIAL LIMBS: Helping Hand for Relief and Development (HHRD) has provided artificial limbs to over 62,000 persons with disabilities (PWDs) affected by natural calamities and accidents across Khyber Pakhtunkhwa.\n\n“We are marking the 20th anniversary of our operations launched in the aftermath of the 2005 devastating earthquake, during which we have provided prosthetics to more than 62,000 PWDs free of cost,” said HHRD director Waseem Saleem while speaking at a ceremony held to commemorate the occasion.\n\nHe said HHRD had been providing financial assistance, education, and healthcare services to over 10,400 orphans across eight clusters nationwide, including 3,700 in Khyber Pakhtunkhwa, and 200 in Mansehra.\n\nSpeaking on the occasion, Dr Pirzada Khattak, the faculty head at the HHRD rehabilitation centre here, said over 80,000 people had lost their limbs in the 2005 earthquake in KP and AJK, and 48,000 of them had been provided artificial limbs by the centre.\n\n“These persons with disabilities continue to visit the centre for follow-up care, and their cumulative visits have now exceeded 400,000,” Dr Khattak said.\n\nPublished in Dawn, November 8th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/690e5c2aeaef8.jpg",
  "retrievedAt": "2025-11-08T23:12:05.770Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953731/illegal-structures-razed-during-shinkiari-anti-encroachment-drive",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T00:53:43.000Z"
}
