{
  "title": "Saim, Abrar star as Pakistan seal historic home series victory against South Africa",
  "author": "Umaid Wasim",
  "content": "A capacity crowd at the Iqbal Stadium got what it so desperately wanted: flowing strokes off the bat of Babar Azam. Normally, home supporters would’ve quietened at seeing Fakhar Zaman cleaned up early on in a small chase – potentially a harbinger of things to come; perhaps an all too familiar collapse in the offing.\n\nBut here on Saturday night, there were loud roars with chants of “Babar” echoing across the venue with Pakistan’s batting superstar set to come next. Babar didn’t disappoint, dispatching the South African bowlers with his trademark elan, and alongside Saim Ayub set Pakistan on their way to a rousing seven-wicket victory that sealed the three-match One-day International series 2-1 in their favour.\n\nThe venue had gone silent after Babar’s departure in the 11th over, disappointment filling the air that they weren’t able to see more of him when he was looking close to his best, run out for 27 after stroking five crisp fours.\n\nBut they soon found their voice as Saim tore into the South African attack with a 70-ball 77 that featured 11 fours and a six and although he fell with Pakistan nearing victory, Mohammad Rizwan (32 not out) took them through with Salman Ali Agha hitting the winning boundary.\n\nThe foundation for Pakistan’s victory, under new skipper Shaheen Shah Afridi for this series, had been laid by the spinners as the visitors were bundled out for 143 in 37.5 overs. South Africa captain Matthew Breetzke had elected to bat and his side were coasting smoothly with openers Quinton de Kock (53) and Lhuan-dre Pretorius (39) well set until their lineup collapsed in the face of spin.\n\nSalman (2-18) provided the first two wickets before Mohammad Nawaz (2-31) followed with the big dismissal of De Kock until Abrar Ahmed (4-27) ran through South Africa’s spine and Pakistan eventually secured their first-ever ODI series triumph at home against their opponents.\n\n“The credit goes to the players,” reflected Shaheen at the post-match ceremony. “We didn’t get much help in the first five or six overs but when the spinners came in, they made it really tough for them.”\n\nOn a sun-kissed afternoon, the 72-run opening stand between Pretorius and De Kock ended after the former, who had hit four fours and a six, was caught at long-off by Babar and Salman struck again four overs later when Tony de Zorzi chipped him to the cover fielder.\n\nDe Kock, whose splendid century in the second game had helped South Africa level the series, completed his half century off 68 deliveries with his sixth four, a sweep of Nawaz, only to be trapped lbw by the spinner two deliveries later. The left-hander also hit a six.\n\nSouth Africa then slipped from 106-2 to 109-4 with player-of-the-match Abrar cleaning up debutant Rubin Hermann on the first ball of the 26th over. Bails were flying once again, twice off two balls, two overs later as Abrar worked his magic. First Donovan Ferreira was bowled round his legs before a googly that stayed low knocked back Corbin Bosch’s off-stump.\n\nPakistan had South Africa on the ropes with Breetzke (16) running out of partners quick and fast as Nawaz had Bjorn Fortuin lbw, and the writing was on the wall for the Proteas when their skipper was caught behind off Abrar, who recorded his career-best ODI figures, as they slipped to 130-8.\n\nPakistan captain Shaheen (2-18) then cleaned up the tail with two wickets in two balls – both of them bowled, including the wicket of Nqabayomzi Peter who made a defiant 16.\n\n“Batting conditions were pretty tough and we didn’t get enough runs and they batted freely because of that,” rued De Kock, who was named player-of-the-series.\n\nThe sentiment was echoed by Breetzke. “Not enough runs… we were probably looking at 250. It was tough conditions and unfortunately we lost too many wickets there.”\n\nNandre Burger’s dismissal of Fakhar, knocking his stumps through the gate, brought Babar to the crease and after a quiet opening couple of overs, the right-hander, who had scores of seven and 11 in the opening two matches, got Pakistan off the mark in the third which ended with a boundary of Saim’s bat – a punch through the covers.\n\nA deft touch of Lundi Ngidi then brought Babar’s first boundary before Saim flicked away the pacer for four. Babar then pulled Burger away for four before treating the crowd to two delightful boundaries off Ngidi in the sixth over.\n\nBoundaries were flowing for Pakistan – three of them coming off the eighth over off Bosch, all of them from Saim with the first a six. At the other end, Babar showed his elegance with a scrumptious cover drive for four as Pakistan reached 59-1 after the first 10.\n\nBabar would soon be run out, but Saim took over and was unrelenting. He reached his 50 of just 39 balls with his eighth four, pulling away Burger. Fortuin and Ferreira were then swept for boundaries before the latter was hit for a one-bounce four.\n\nSaim fell when he couldn’t get the distance off Fortuin but by then the job was done with Rizwan closing it out. Rizwan, who was replaced by Shaheen as skipper ahead of the series, hit three fours and a six – over midwicket – to leave Pakistan four runs away and Salman finished it off with 24.5 overs to spare.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/08200436295530f.webp",
  "retrievedAt": "2025-11-08T23:10:42.217Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953887/saim-abrar-star-as-pakistan-seal-historic-home-series-victory-against-south-africa",
  "dateList": "2025-11-08",
  "date_published": "2025-11-08T09:45:05.000Z"
}
