{
  "title": "No new notification needed for COAS’ 5-year term, says state minister",
  "author": "Dawn.com",
  "content": "Minister of State for Law and Justice Barrister Aqeel Malik said on Thursday that there was no need for a notification to specify the army chief’s five-year term, as it was established in Section 8C [of the Pakistan Army Act].\n\n“I do not think there is a need [for a notification] and the reason is the lawmaking we did, which specifies that [section] 8C, will be read in the same manner as it has always been part of this legislation and hence, it is five years,” said the state minister.\n\nSection 8C of the Pakistan Army Act outlines the “retirement age and service limits prescribed for a general, under the rules and regulations made under this Act, shall not be applicable to the Chief of the Army Staff, during his tenure of appointment, reappointment or extension, subject to a maximum age of sixty-four (64) years. Throughout such tenure, the Chief of the Army Staff shall continue to serve as general in the Pakistan Army”.\n\nIn November 2024, the government passed six bills, including three related to the extension of the terms of armed services chiefs, amid deafening protests by the opposition. The three bills were The Pakistan Army (Amendment) Bill, 2024, The Pakistan Air Force (Amendment) Bill, 2024 and The Pakistan Navy (Amendment) Bill, 2024.\n\nThe salient features of the bills stated that the tenure of all three services chiefs (chief of army staff, chief of air staff and chief of naval staff) will be five years, instead of three. The retirement age bar of 64 years (for generals, air chief marshals and admirals) won’t apply to these three functionaries and\nextensions, re-appointments for these posts (if any) will also be for five years.\nHowever, the tenure of chairman joint chiefs of staff remained unchanged, at\nthree years.\n\nIn an interview with Independent Urdu today, Barrister Malik said no new notification is required for the COAS’ 5-year term and the section has always been a part of legislation.\n\nWhen asked his opinion on whether the government intends to keep the designations of field marshal and army chief separate, Malik pointed out that army chiefs are 4-star generals while the field marshal’s rank is a 5-star position.\n\n“When there are ranks, other things are associated with them, and they should be considered as well,” he said.\n\nWhen asked about the possibility of Pakistan becoming a part of the Gaza International Stabilisation Force, the state minister said a definitive answer at this time would be premature.\n\nHe highlighted that the foreign ministers of eight Muslim countries met in Istanbul and any announcement would be made accordingly. “My comment would be premature,” Barrister Malik said.\n\nField Marshal Asim Munir was appointed the army chief on November 29, 2022. He is the 17th army chief to assume the command of the Pakistan Army.\n\nThe government promoted the COAS to the rank of field marshal in recognition of his ‘strategic leadership and decisive role’ in defeating India during the war in May this year.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/062146067cf9bc2.webp",
  "retrievedAt": "2025-11-08T23:15:23.066Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1953525/no-new-notification-needed-for-coas-5-year-term-says-state-minister",
  "dateList": "2025-11-08",
  "date_published": "2025-11-06T18:31:14.000Z"
}
