{
  "title": "CDNS to launch four Shariah compliant product from July 1st",
  "link": "https://www.app.com.pk/national/cdns-to-launch-four-shariah-compliant-product-from-july-1st/",
  "date_published": "2023-06-26T10:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): Minister for Finance and Revenue Senator Mohammad Ishaq Dar on Monday reiterated firm resolve of the government to implement Shariah Compliant financial system to promote and encourage interest-free Islamic banking and finance in the country.\nAddressing the launching ceremony of the Shariah Compliant products by the Central Directorate of National Saving (CDNS), the minister said the directorate has designed and introduced Shariah-compliant investment and saving scheme which would be formally launched by July 1, 2023.\nIn a first, the minister said the CDNS has launched four investment and saving products based on one-year, three-year and five-year terms, besides initiating saving account facility, adding that it is a flexible scheme with monthly profit and to withdraw principle amount that would encourage savings and ensure full returns.\nIshq Dar informed that soon after assuming the charge as finance minister, he had directed the State Bank of Pakistan (SBP) and National Bank of Pakistan (NBP) to withdraw their petitions against the decision of the Federal Shariah Court in which the Court had ordered to implement interest-free banking and financing system in the country.\nMeanwhile, a high power steering committee headed by the Governor SBP was formed to find ways and means to promote Shariah-compliant financial system in the country. The committee was comprised of other prominent scholars and experts from the banking and finance sectors.\nHe said during the last tenure of the Pakistan Muslim League-Nawaz government, a committee was also constituted, which had taken several steps and produced positive results as due to these efforts, the spread of Islamic banking grew by 21 percent, adding that the balance sheets of banks with Shariah Compliant finance products witnessed a remarkable increase.\nThe minister said the government had recently promised to introduce Islamic finance products, adding in this regard all the concerned departments of the Ministry of Finance and other attached departments worked hard to materialize the commitment.Besides, all the commitments made in the federal budget 2023-24 would be fulfilled one by one to achieve sustainable economic growth and social prosperity in the country, he added.",
  "retrievedAt": "2025-08-11T08:48:16.229Z"
}
