{
  "title": "No reprieve for perpetrators of May 9 mayhem on pretext of HR issues: DG ISPR",
  "link": "https://www.app.com.pk/national/no-reprieve-for-perpetrators-of-may-9-mayhem-on-pretext-of-hr-issues-dg-ispr/",
  "date_published": "2023-06-26T16:19:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 26 (APP): Director General of Inter Services Public Relations (DG ISPR) Major General Ahmed Sharif Chaudhry on Monday said there would be no reprieve or leniency for the facilitators and perpetrators of the May 9 mayhem on account of fake human rights narrative.\nA thorough probe had clearly indicated that May 9 riots and arson were a pre-planned and orchestrated conspiracy against the armed forces, he said, adding there was no substance in the concocted narrative of any human rights abuses.\nAddressing a news briefing at the ISPR Directorate, Major General Ahmed Sharif informed the media about the actions and investigations with regard to the violent incidents against military installations on the Dark Day of May 9.\nHe said the May 9 was the darkest chapter in the 76-year history of Pakistan, and in its aftermath, the process of self-accountability within the Army was carried out without any discrimination.\n“Two comprehensive institutional inquiries were conducted into the incidents of violence at various garrisons on May 9. The inquiries were presided over by officers of the rank of Major General,” he added.\nHe said a disciplinary action had been initiated against the officials concerned who failed to maintain the security and sanctity of the garrisons and the Jinnah House.\n“There is no distinction of rank or social status in the accountability process of the Army. The bigger the post, the bigger the responsibility.”\nThe DG ISPR said the investigations clearly established the point that the May 9 tragedy was being planned for several months and accordingly the brainwashing of the people was done to mislead them against the armed forces.\n“It is clear from the evidence regarding the May 9 tragedy that the planning was done a month earlier, and first an atmosphere of uncertainty was created and then the public unrest was made. However, the probe is underway and further proofs are being collected,” he added.\nThe Pakistan Army, relatives of the martyrs and veterans were perturbed and saddened over the May 9 tragic incidents, he said, adding, “The relatives of the martyrs are questioning whether their loved ones sacrificed their lives for the nation so that their symbols are desecrated? Will the evil elements continue disrespecting the sacrifices of martyrs and Ghazis to achieve their political goals? When will the planners of May 9 tragedy be brought to justice?”\nHe said the heirs of the martyrs were asking the Army Chief whether he would be able to protect the sanctity of the martyrs in future.\n“The heirs of the martyrs and all the ranks are raising the question that if the sanctity of the sacrifices of martyrs were to be desecrated, then what is the need to sacrifice one’s life?”\nThe Pakistan Army, he said, represented all the (federating) units, schools of thought and classes and not a particular elite. “The basis of the stability of any country and nation is the relationship of trust and respect between the people, the government and the army.”\nThe DG ISPR reaffirmed that neither the black day of May 9 would be forgotten in the country’s history nor the miscreants, planners and facilitators of the tragic incidents would be forgiven.\n“Those who obstructed all the measures against the facilitators related to this tragedy will also be dealt with iron hands with the support of the nation,” he added.\nMajor General Ahmed Sharif said 17 military courts, which already existed in the country, were dealing with the cases under the Army Act.\n“About 102 miscreants are being tried in the military courts and this process will continue as their cases have been transferred from civil courts after proper investigation and proofs,” the DG ISPR said.\nHe said the security forces carried out some 13,619 intelligence-based operations against terrorists and their facilitators during the current year. About 1,172 terrorists were arrested in the operations.\n“This year, 95 officers and men embraced martyrdom,” he said, adding around 77 operations were conducted on daily basis against the scourge of terrorism.\nThe entire nation paid rich tribute to the sons of the soil who had sacrificed their lives for the defence of the motherland, he added.\nThe DG ISPR said the Pakistan Army initiated the self-accountability process in the aftermath of the May 9 tragedy to ascertain the reasons of failure to protect its installations.\n“After detailed departmental inquiries, three officers including a lieutenant general have been dismissed from service. Strict disciplinary action has been taken against 15 officers, including three major generals and seven brigadiers,” he stated.\nMoreover, he added, the granddaughter of a retired four-star general, the son-in-law of a retired four-star general, the wife of a retired three-star general, and the wife and son-in-law of a retired two-star general were undergoing the same accountability process based on irrefutable evidence.\nResponding to media queries, the DG ISPR said 17 standing military courts, currently functioning across the country, were established much before the May 9 incident under the Army Act.\nThe May 9 incident accused under trial in military courts had complete legal rights, including that of appeal to the High and Supreme Courts.\nHe added that the International Court of Justice after due process of observation had validated the military courts’ procedures.\nHe brushed aside the misleading impression about the armed forces vis-a-vis the May 9 tragedy, saying it was a part of the venomous mindset and dirty political motives propagated by a particular political party.\nReplying to another query, he said the human rights violations’ narrative was propagated against the Government of Pakistan by some elements from abroad and unfortunately by some internal ones.\nHe said firstly social media was used as a weapon to propagate “fake and old content” to promote anti-state narrative.\nSecondly, he said, secret links and money were used to engage people, agencies and non-governmental agencies abroad to flag so-called human rights abuses in Pakistan.\nThirdly, in a very dangerous move a case was built in capitals of foreign countries to halt economic and trade assistance to Pakistan, he added.\n“The state is aware of these inimical designs and taking proper measures to address them. It’s high time in Pakistan to end the currency of lies and develop the ability to embrace bitter facts and truth.”\nThe DG ISPR said in order to overcome May 9 like incidents it was necessary to identify the factors that had caused the tragedy and “take to task all the abettors and facilitators of such violence. The thinkers, politicians, media and judiciary among all have to play their role for this cause.”\nHe said internal chaos was a major risk to the state’s stability. “If this intolerance is created for political gains and its peak seen on May 9 goes unabated then it will pave the way for external onslaught of inimical forces.”\nReferring to Pakistan-India defence budgets gap, he said it was widening due to the country’s depleting economic situation and it would narrow with improvement and strengthening of national economy.\nHe rest assured the media that it was not impacting the operational preparedness of the armed forces, rather helped them in augmenting indigenous capacities to meet defence needs.",
  "retrievedAt": "2025-08-11T08:48:10.250Z"
}
