{
  "title": "Over 49,000 Hajj Pilgrims receive medical care in Madinah",
  "link": "https://www.app.com.pk/national/over-49000-hajj-pilgrims-receives-medical-care-in-madinah/",
  "date_published": "2023-06-26T10:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): Over 49,000 pilgrims have received medical care services in seasonal health centres and facilities in Madinah since the beginning of the month of Dhul Qaeda, 1444 AH.\nSaudi Arabia’s Ministry of Health has provided comprehensive medical care services to the pilgrims during their stay in the province of Madinah.\nSince the beginning of the previous Hijri month, a total of 43,445 pilgrims have received healthcare services in the seasonal health centres near the Prophet’s Mosque and in the central area, as stated by the Ministry of Health, Saudi Press Agency reported.\nFurthermore, the emergency departments of hospitals have attended to 5,654 pilgrims during the same period.\nThe medical services in Madinah have included six open-heart surgeries, 88 cardiac catheterizations, 76 other surgeries, and 134 dialysis sessions. 192,552 pilgrims have received health education and awareness services in their hotels, shelters, shuttle buses, and public facilities.\nThese medical care services complement the comprehensive services by the government to ensure the highest quality standards are met around the clock at all air and land arrival and departure ports during the Hajj season, according to the Ministry.\nThe Ministry deploys medical personnel at these ports and offers awareness, educational, and field health guidance services to pilgrims and visitors in Madinah before their departure to Makkah for Hajj. On Saturday, the Ministry launched a medical convoy of 16 ambulances to transport pilgrims admitted to hospitals in Madinah to Jabal Al-Rahma Hospital in the Arafat area.\nThe convoy has a specialized medical team comprising 83 doctors, nurses, and paramedics. Furthermore, four additional ambulances are stationed on the Hijra Highway that connects Madinah and Makkah.\nThese ambulances are supported by two ICU ambulances, an integrated oxygen cabin, a mobile first aid unit, and a bus to transport patients’ escorts.",
  "retrievedAt": "2025-08-11T08:48:20.913Z"
}
