{
  "title": "Experts call for mechanisms, legal frameworks for better employment prospects for migrant labor",
  "link": "https://www.app.com.pk/national/experts-call-for-mechanisms-legal-frameworks-for-better-employment-prospects-for-migrant-labor/",
  "date_published": "2023-06-26T17:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): Sustainable Development Policy Institute (SDPI) Executive Director Dr Abid Qaiyum Suleri on Monday urged the government to sign MoUs and agreements for safe and legal labour migration and prevention of exploitation.\nHe was speaking at a seminar on “International Labour Migration: Development Outlook and Policy Options for Pakistan” organized by SDPI.\nHe stressed devising mechanisms under SDG-8 to ensure legal, organized and safe immigration to avoid tragedies like the recent boat capsizing incident in Greece.\nHe added that strengthening legal frameworks for labour migration, proactive role of diplomatic missions in host countries and urged media to raise the plight of migrant workers to the attention of the world.\nDr Kailash Chandra Das, South Asia Centre for Labour Mobility and Migrants (SALAM) remarked that the lack of scientific and gender-disaggregated data on migration trends hinders effective policymaking.\nHe further highlighted that managing the cost of migration and protecting of labour rights are pertinent issues that require robust policy dialogues and attention from the government.\nReintegration of returned migrants is a crucial issue and consultation with them can improve the perspective on policies for imparting competitive skills to enable access to better economic opportunities, he added.\nAmish Karki, Technical Officer, International Labour Organization (ILO), India stressed that Covid-19 and the recent incident in Greece highlight that the migrant workers are left on their own.\nHe emphasized that several issues faced by the migrant workers from South Asia are quite similar including the high cost of migration, ambiguous contract terms, substitution of contract terms, delayed and non-payment of dues as witnessed during Covid-19, limited access to health services, social and wage protection, access to justice.\nHe highlighted that Sri Lanka was the only country to have an effective reintegration of policy and the other countries in South Asia failed to harmoniously reintegrate returned labour migrants and the labour migration policies must be revisited and updated to cater to the recent issues.\nKashif Salik, Associate Research Fellow, SDPI, highlighted that lack of comprehensive data prevents timely prediction of changes in trends in labour migration, thus leading to weak policy interventions and difficulties for labour migrants. “Labor migration culture increases access to information and resources among migrants, which helps to facilitate the migration process and associated cost”, he added.\nHe elucidated that after the travel restriction from Covid-19 was softened, migration from Pakistan increased by 59% between 2021-2022. “Pakistani workers going to the UAE witnessed an increase of 189% followed by Saudi Arabia registering an increase of 77% and remittances from overseas Pakistanis rose 27% to USD 29.4 billion in FY21 and USD 31.3 billion in FY22.”\nHowever, he said that migrant labour is confronted with salary reduction despite the rise in inflation, decline in access to healthcare, issues in visa renewal with employers refusing payment of visa renewals, decline in employment and increased lay-offs ranging up to 40% during Covid-19 for unskilled and semi-skilled.\nKhansa Naeem, Research Associate, SDPI, taking a gendered analysis of migration elucidated that “Feminization of international migration is linked to a global demand for domestic workers, reproducing the traditional gendered division of labour, in which women are relegated to lower-wage jobs” and South Asia is experiencing a rise in low and semi-skilled female labour migration to Gulf and East Asian Countries.\nShe added that women face discrimination in legal and governing practices and are more vulnerable to gendered risks of exploitation, and gendered working conditions.\nShe urged for building institutional capacity and gender sensitization of policies and policymakers to upskill female workers and protect their rights.\nFarrukh Jamal, Director of Research BEOE, elucidated that the National Immigration Policy is being articulated for the protection of the rights of migrant workers and to protect them from exploitation and complaint registration mechanisms have been set up at embassies, and an online portal Overseas Employment Corporation has been initiated to match job seekers with legal and safe jobs.\nShahzad Ahmed, Program Officer, ILO Pakistan emphasized skill development to tap into the competitive human resource export gap across the world. He urged the government to present a comprehensive policy to protect the right of migrant workers.",
  "retrievedAt": "2025-08-11T08:48:10.358Z"
}
