{
  "title": "Govt placed promotion of blue economy in its growth agenda: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/govt-placed-promotion-of-blue-economy-in-its-growth-agenda-ahsan-iqbal/",
  "date_published": "2023-06-26T16:49:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 26 (APP): Federal Minister for Planning, Development and Special Initiatives, Ahsan Iqbal, on Monday said that the blue economy possesses enormous potential for sustainable financial stability and development of Pakistan and the incumbent government has placed it in its futuristic agenda of national growth.\nThe minister talking to media persons during the visit of the Pakistan Maritime Security Agency (PMSA) here said that more than one thousand kilometres long coastal line and over 2 million kilometres of vast exclusive economic zone offer unfathomable opportunities to the country.\nPakistan being an agricultural country had relied on the green economy at the time while the volume of its blue economy was greater than the green one, he observed and noted that integration of both economies could boost the pace of the journey of development to a greater extent.\nThe federal minister said that PML-N led government has expedited important projects under China Pakistan Economic Corridor (CPEC) that were integrated with the global Belt and Road initiative and open new vistas of growth and prosperity of the country.\nHe said that under the sustainable development approach, it was our responsibility to secure and efficiently monitor the country’s coastal line and maritime frontiers.\nThe minister while lauding the services of PMSA for the protection of the borders of Pakistan said that the agency was equipped with state-of-the-art equipment and fleet and was vigilantly securing the maritime frontiers of Pakistan.\nAdditionally, PMSA has also earned a good name for the country across the globe due to its rescue and relief operations in the deep sea, he added.\nAhsan Iqbal recalled that in 2014 operational capacity of PMSA was limited to a few old boats and it lacked an effective monitoring system. Then PML-N government vowed to modernise the agency and approved projects for the induction of 6 modern ships and boats in PMSA which had significantly improved the operational capacities of the agency, the minister said.\nHe hoped that PMSA with its enhanced capacities would keep securing the maritime frontiers of the country and preventing the dumping of hazardous materials and elimination of illegal trade within their jurisdiction.\nHe further said that PMSS Kolachi was developed at the Karachi shipyard and inducted into a fleet of PMSA. The Karachi shipyard had the capability to manufacture even bigger ships that would not only further enhance the country’s maritime forces but Pakistan could also earn precious foreign exchange.\nEarlier, Director General PMSA Rear Admiral Imtiaz Ali, DDG Commodore Amir Iqbal Khan, Captain Shahid Sati and other officers received the federal minister on his arrival at the PMSS Kolachi and briefed him about the performance and future strategy of the agency.",
  "retrievedAt": "2025-08-11T08:48:10.367Z"
}
