{
  "title": "CDA launches emergency operation after heavy downpour in Islamabad",
  "author": null,
  "content": "ISLAMABAD, Jul 06 (APP):Capital Development Authority (CDA), in a swift response to the heavy rainfall and hailstorm that lashed Islamabad on Saturday night, launched a citywide emergency operation to clear roads, restore traffic, and assist citizens affected by the weather.\nThe teams of Metropolitan Corporation Islamabad (MCI), and the District Administration jointly personally monitoring the situation on ground following directions of Chairman CDA, Chief Commissioner Islamabad Muhammad Ali Randhawa.\nAll field teams of CDA, MCI and the District Administration were immediately mobilized following the storm.\n“Clear instructions were issued to all formations to provide maximum relief and assistance to the public using all available resources,” a CDA spokesperson told APP on Sunday.\nMultiple departments—including the CDA’s Emergency and Disaster Management Directorate, Environment and Sanitation Wings, Road and Maintenance Division, Islamabad Water Agency, and Building Control Section—were directed to act swiftly to remove fallen trees, clear debris, and unblock roads. The goal, officials said, is to restore normal traffic flow as quickly as possible.\nHeavy rainfall and hail led to the accumulation of water in underpasses and low-lying areas, as well as widespread tree fall and road blockages.\nIn response, machinery and manpower were deployed throughout the capital to clear stormwater drains, underpasses, and key arteries.\n“A special monitoring system has been activated to ensure drainage in sensitive areas and prevent waterlogging,” the spokesperson added.\nTraffic police also joined the operation to help redirect vehicles and keep movement smooth while road clearance work continued.\nThe CDA chief assured that the joint operation will continue until all affected areas are cleared and full normalcy is restored.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:17:50.904Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-launches-emergency-operation-after-heavy-downpour-in-islamabad/",
  "dateList": "2025-07-06",
  "date_published": "2025-07-06T10:29:00.000Z"
}
