{
  "title": "NA to hold daylong event to highlight PWDs’ services",
  "link": "https://www.app.com.pk/national/na-to-hold-daylong-event-to-highlight-pwds-services/",
  "date_published": "2020-12-02T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP): National Assembly Secretariat would hold a daylong event on Thursday to commemorate international day of persons with disabilities (PWDs) in a befitting manner.\nThis year, the day would be observed under the theme of “A Better Inclusive Post COVID-19 World For PWDs” with special focus to highlight the services of the PWDs and acknowledging their contributions in spite of their physical hardships and limitations, a National Assembly Secretariat news release said.\nThe commemoration of the day at the Parliament House is the result of special initiatives taken by Speaker National Assembly Asad Qaiser for the welfare of PWDs and making them inclusive part of the society.\nSpeaker’s initiatives for the welfare of the PWDs include formulating special parliamentary committee on PWDs and issuance of directions to make the Parliament building PWDs’ friendly.\nHe had also directed to make official website of the national assembly readable for visually impaired, and inaugurated the special mobile app “Equal Access” for integrating their data.\nBesides, Asad Qaiser focused on taking legislative initiatives for PWDs, which would serve as policy interventions.\nHe pledged that the day would be the ‘day of resolution’ to continue this journey of efforts aimed at making the PWDs part and parcel of socio-economic strata.\n“This parliamentary supervision and oversight will prove a catalyst to support the efforts of all striving to bring positive changes in the lives of PWDs.”\nThe one-day event would include address by speaker national assembly Asad Qaiser, Minister for Human Rights Shireen Mazari and  convener, subcommittee on PWDs member national assembly Munaza Hasan.\nA documentary regarding special initiatives for socio-economic inclusion of PWDs by Asad Qaiser would also be aired.\nZala Qaiser, emerging disability leader, Muhammad Atif Sheikh executive director STEP and Lina Mousa, Country representative UNFPA would also address the event.\nAmong others, parliamentarians, intelligentsia and media representatives would participate in the event.",
  "retrievedAt": "2025-08-11T20:05:30.384Z"
}
