{
  "title": "2,829 new Coronavirus cases reported; 75 deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/2829-new-coronavirus-cases-reported-75-deaths-in-past-24-hours/",
  "date_published": "2020-12-02T06:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP): The total active COVID-19 cases in Pakistan on Wednesday were recorded 49,780 as 2,829 more people tested positive for the deadly virus during the last 24 hours.\nSeventy Five corona patients, 68 of whom were under treatment in hospital and seven out of hospital died on Tuesday, according to the latest update issued by the National command and Operation Centre (NCOC).\nNo COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan, while 311 ventilators were occupied elsewhere in Pakistan, out of 1,746 allocated for COVID-19 patients.\nSome 35,197 tests were conducted across the country on Tuesday, including 9,752 in Sindh, 15,239 in Punjab, 4,204 in Khyber Pakhtunkhwa (KP), 5,008 in Islamabad Capital Territory (ICT), 271 in Balochistan, 336 in GB, and 387 in AJK.\nAround 345,365 people have recovered from the disease so far across Pakistan making it a significant count with over 86 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 403,311 cases were detected so far, including AJK 6,982, Balochistan 17,215, GB 4,667, ICT 30,748, KP 47,701, Punjab 120,356 and Sindh 175,642.\nAbout 8,166 deaths were recorded in country since the eruption of the contagion, including 2,962 Sindh among 24 of them died in hospital and four out of hospital on Tuesday, 3,066 in Punjab 28 of them died in hospital and two out of hospital on Tuesday, 1,375 in KP six of them died in hospital on Tuesday, 324 in ICT among six of them died in hospital on Tuesday, 169 in Balochistan two of them died in hospital on Tuesday, 97 in GB and 1,73 in AJK three of them died in hospital and one out of hospital on Tuesday.\nA total of 5,584,635 corona tests have been conducted so far, while 615 hospitals are equipped with COVID facilities. Some 2,810 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:05:32.254Z"
}
