{
  "title": "CM takes stock of ongoing development schemes in south Punjab",
  "link": "https://www.app.com.pk/national/cm-takes-stock-of-ongoing-development-schemes-in-south-punjab/",
  "date_published": "2020-12-02T14:34:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 02 (APP): Punjab Chief Minister Sardar Usman Buzdar on Wednesday chaired a marathon session of video link meeting at his office to take stock of ongoing development schemes, DG Khan development package, and law and order situation in south Punjab.\nAddressing the meeting, the CM said that the development process was going on speedily as the government launched several public welfare projects worth billions of rupees and third-party monitoring of every development scheme would be done.\nThe Chief Minister said that enquiry would be held on public complaints to punish those responsible. The government was the custodian of national resources and those involved in any embezzlement would not be spared, he warned.\nThe CM directed that timely utilization of funds be ensured for public welfare schemes as an inordinate delay was not acceptable.\nHe further directed the officers to go into field to ensure transparency, adding that the mantra of lip-service would not work as everyone will have to perform,stated a hand out issues here.\nThe CM complaint cell would hold an inquiry against those involved in corruption in development projects, he said.\nThe CM asked the officers to speed up the development work. The development projects should be completed in time by doing work in double shifts wherever needed, he said and warned that action would be initiated on complaints about the use of agri machinery.\nProspect of a women university in DG Khan should be reviewed and recommendations be forwarded, he maintained.\nHe directed early completion of Koh-e-Suleman Development Authority board, adding that the authority should submit a comprehensive plan about the development of the area.\n“South Punjab would be developed as a role model as a new era of development has started in the province”, he emphasised.\nHe asked the officers to work hard for the protection of life and property of people, adding that crackdown should continue against gangs. Similarly, indiscriminate action be initiated against the criminals, he added.\nACSs Home and higher education department, secretaries of housing, P&D, finance, local government, primary and secondary health, irrigation, livestock, C&W, agriculture, sports & youth affairs departments and DG PHA attended the meeting at CM Office, while Commissioner, DC, RPO and DPO DG Khan and secretary P&D (south Punjab) participated from Commissioner’s Office DG Khan.\nAdditional IG (south Punjab) joined the meeting from Commissioner’s Office Multan, while ACS (south Punjab) took part in the meeting from Commissioner’s Office Bahawalpur.\nAdministrative secretaries attended the meeting from Darbar Hall of the Civil Secretariat through video link.",
  "retrievedAt": "2025-08-11T20:05:28.164Z"
}
