{
  "title": "People not cooperating in second wave of COVID-19 : Asad Umar",
  "link": "https://www.app.com.pk/national/people-not-cooperating-in-second-wave-of-covid-19-asad-umar/",
  "date_published": "2020-12-02T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP): Minister for Planning and Development Asad Umar on Wednesday said the people were not supporting the government in the second wave of the COVID-19 pandemic as they were assuming that coronavirus was not a danger for them.\nTalking to a private news channel, he said during the first wave of coronavirus, political,social and religious leadership were on same page but unfortunately that position was not being sighted in the second wave of the deadly virus.\nThe minister said the government adopted stance that not to imposed complete lockdown in the country during the first wave of coronavirus and still it was stood with its first time stance in that regard.\nHe said the opposition attitude was inappropriate during the second wave of coronavirus, adding according to the National Command and Control’s (NCC) decisions people could not hold gathering more then 300 figure.\nHe said the government of Azad Jammu and Kashmir had implemented complete lockdown to combat coronavirus.\nHe said the numbers of the coronavirus patients were increased after the opposition’s public gatherings of Gujranwala, Peshawar,Multan and Karachi. He urged the opposition to take the situation of coronavirus seriously in the country.\nAsad Umar said the court had ordered to implement all standard operating procedures (SOPs) for controlling coronavirus spreading.\nReplying to a question, he said the federal cabinet had approved to buy the coronavirus vaccine and $150 million were allocated for the purpose and hoped that the vaccine would be available in the country in January to March of 2021.\nThe coronavirus vaccine would be given to health workers in fist phase, he added.\nTo another question, he said the government would be implemented majority of the cabinet members decision regarding the matter of the Pakistan Steel Mills (PST).\nHe said the PST was a profitable institution during the regime of General (R) Pervez Musharraf and it had become in loss during the Pakistan Peoples Party’s government.\nResponding to another query about Nawaz Sharif , he said the government would utilise all legal options to bring Nawaz Sharif back in Pakistan, adding the court had declared him absconder now.\nHe said the narrative of Nawaz Sharif and his daughter which they had adopted against the national institutions was against the national security.\nThe minister said the government would not make any compromise over the issue of accountability of the corrupts but the opposition was trying to get National Reconciliation Ordinance (NRO) so they were using different tactics for the purpose but they would not succeed in that regard.",
  "retrievedAt": "2025-08-11T20:05:26.840Z"
}
