{
  "title": "On UN Day, Dar says Pakistan dedicated to playing role in building just and prosperous world",
  "author": "Dawn.com",
  "content": "Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar on Friday reaffirmed Pakistan’s dedication to playing its part in building a “just and prosperous” world while marking United Nations (UN) Day.\n\nUN Day marks the anniversary of the entry into force in 1945 of the UN Charter. This year marks the 80th anniversary of the UN and its charter.\n\nIn a statement issued by the Foreign Office (FO), Dar reaffirmed Pakistan’s steadfast commitment to multilateralism along with the international community.\n\n“We believe the UN, as the world’s most representative multilateral institution, remains uniquely placed to address shared global challenges, including grave threats to international peace and security, [the] worst humanitarian crises, persistent development gaps, and the existential climate crisis,” he said.\n\nDar added that Pakistan’s foreign policy was firmly rooted in the UN Charter’s principles: the sovereign equality of states, non-interference, the right to self-determination, and the peaceful settlement of disputes, according to the Quaid-i-Azam’s vision.\n\n“Our history reflects a consistent preference for diplomacy over confrontation, engagement over isolation, and partnership over polarisation,” he said.\n\nAccording to the foreign minister, the country’s commitment to multilateralism is demonstrated through decades of active engagement with the UN system.\n\nHe pointed out that Pakistan has ranked among the top Troop-Contributing Countries to UN peace operations since 1960, and hosts the United Nations Military Observer Group in India and Pakistan (UNMOGIP), one of the oldest peacekeeping missions.\n\nDar said that the charter affirmed “our collective resolve to uphold international law and self-determination”. However, he added that these values were not being universally upheld, referring to occupied Kashmir and Gaza.\n\n“Regrettably, these ideals continue to be violated with impunity, most egregiously in Indian Illegally Occupied Jammu and Kashmir and Palestine,” he said.\n\n“The legitimate aspirations of the Kashmiri people for self-determination, upheld by relevant UN Security Council (UNSC) resolutions, continue to be denied by brutal repression by India.\n\n“Similarly, Gaza has become a graveyard for our shared humanity and global conscience,” he added.\n\nHe said that Pakistan remained dedicated to playing its role in building a “more peaceful, just, and prosperous world” as a non-permanent member of the UNSC for 2025-26.\n\nHe highlighted the country’s reputation as a consensus builder, pointing out its presidency of the UNSC in July of this year. He added that its “active role” in promoting UN charter principles “enables us to work towards outcomes that reflect the aspirations and priorities of the wider UN membership”.\n\nHe reiterated that Pakistan “stands ready to work with fellow UN member states and with the United Nations system to reinvigorate the UN charter’s promise to pursue peace, development and human dignity for all”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/24115940f575740.webp",
  "retrievedAt": "2025-10-25T01:59:40.819Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950950/on-un-day-dar-says-pakistan-dedicated-to-playing-role-in-building-just-and-prosperous-world",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T07:21:43.000Z"
}
