{
  "title": "Mohsin Naqvi adamant on ceremony for Asia Cup trophy handover as India increase pressure",
  "author": "Dawn.com",
  "content": "The deadlock over the Asia Cup trophy — which India refused to collect at the closing ceremony last month amid Pakistan-India hostilities — continued on Tuesday as the Board of Control for Cricket India (BCCI) contacted Asian Cricket Council (ACC) head Mohsin Naqvi to hand over the trophy, Indian media reported citing sources.\n\nNaqvi, who is also the chairman of the Pakistan Cricket Board, told reporters in Karachi on Tuesday that the ACC has informed the BCCI that a formal ceremony will be held in Dubai on December 10 to present India with the trophy.\n\nDawn.com understands that Naqvi, as ACC chief, is keen on handing over the trophy himself following the farcical scenes that followed after last month’s final between Pakistan and India.\n\nDefending champions India edged Pakistan by five-wickets in a last-over thriller to win the Asia Cup title at the Dubai International Stadium last month.\n\nHowever, the closing ceremony descended into farce as the Indian cricket team refused to collect the winners’ trophy from Naqvi.\n\nThere were no customary handshakes before the match between the teams after India refused. Pakistan captain Sal­m­an Agha said India had “disrespected cricket”, whe­­­r­­eas his counterpart Surya­ku­mar Yadav complained his side were denied the trophy after winning the Asia Cup, which has been overshadowed by ill-will on both sides.\n\nA couple days after the incident, Naqvi posted on X saying: “If they truly want it, they are welcome to come to the ACC office and collect it from me.\n\nThe Press Trust of India reported today that the cricket boards of Afghanistan and Sri Lanka backed BCCI’s correspondence to Naqvi.\n\n“A top ACC source told PTI that Naqvi has insisted that a BCCI representative collect the trophy from him at the body’s headquarters in Dubai but the Indian board has rejected that stance,” PTI said.\n\n“The BCCI will bring this matter up in an ICC meeting next month.”\n\nAccording to the ACC source: “The BCCI secretary, BCCI’s ACC representative Rajeev Shukla and representatives of other member boards including Sri Lanka Cricket and Afghanistan had written to the ACC president last week over handing the trophy to India.”\n\nThe eight-nation Asia Cup remained under spotlight due to political strains between India and Pakistan, the nuclear-armed neighbours, who were competing in an international cricket event four months after a brief but intense military conflict in the aftermath of the April 22 Pahalgaam attack that killed 26 local tourists in the Indian-occupied Kashmir.\n\nThe tension between New Delhi and Islamabad spilled over into the cricketing field during the Sept 9-28 Asia Cup staged in the UAE when Indian cricketers refused to shake hands with their Pakistan counterparts when the arch-rivals met in their group stage match in Dubai.\n\nSuryakumar was widely criticised for politicising the Asia Cup when he mentioned Pahalgaam incident and Indian armed forces during his post-ma­tch talk and subsequent news conference.\n\nThe Pakistan camp, on their part, had avoided media interaction on the occasion of the India match. The tense situation remained the same, rather aggravated as on-field verbal skirmishes between some players took place, when the two sides met in the Super Four stage of the event.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/212039529cf2965.webp",
  "retrievedAt": "2025-10-25T02:02:47.355Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950381/mohsin-naqvi-adamant-on-ceremony-for-asia-cup-trophy-handover-as-india-increase-pressure",
  "dateList": "2025-10-24",
  "date_published": "2025-10-21T13:50:48.000Z"
}
