{
  "title": "Pak-Afghan border closures push up prices of essentials",
  "author": "Saleem Shahid | Mubarak Zeb Khan",
  "content": "• Customs clearance suspended at border stations; tomatoes among items becoming dearer\n• Official sees no chance of opening border before Istanbul summit on 26th\n\nQUETTA / ISLAM­ABAD: Border closures between Pakistan and Afghanistan for over 12 days on Thursday have pushed up prices of essential goods in both nations, with tomatoes now costing five times more in Pakistan since fighting broke out between the two neighbours this month and transit trade coming to a halt.\n\nBorder crossings bet­ween the two countries have remained closed since Oct 11, following ground fighting and Pakistani airstrikes across their 2,600km frontier that killed dozens on both sides in the worst fighting since the Taliban’s 2021 takeover of Kabul.\n\n“We have no information when the border with Afghanistan will be opened,” a senior official of the Chaman administration said.\n\nThe official added that even though the traders and the people involved in import and export are demanding the reopening of the border, but no decision has been made so far.\n\nAll trade and transit have been blocked since the fighting erupted, Khan Jan Alokozay, the head of the Pak-Afghan Chamber of Commerce in Kabul, told Reuters on Thursday.\n\n“With each passing day, both sides are losing aro­und $1 million,” he said.\n\nFresh fruit, vegetables, minerals, medicine, wheat, rice, sugar, meat and dairy products make up most of the $2.3 billion annual trade volume between the two countries.\n\nThe prices of tomatoes, used extensively in Pak­i­s­tani cooking, have jumped by over 400 per cent to around Rs600 per kg. Apples, which mostly come from Afghanistan, are also seeing a price surge.\n\nAround 5,000 containers of goods are stranded on both sides of the border, said a Pakistani official at the main Torkham border crossing.\n\nHe said there was already a shortage of tomatoes, apples and grapes in the market.\n\nA senior official said that there is no chance of opening the border before the meeting between Islamabad and Kabul in Istanbul on Oct 26 where both sides will decide future plans in view of the recent clashes.\n\n“The trade and business activities between Pakistan and Afghanistan will be restored under what will be the outcome of the Istanbul review meeting,” Imran Khan Kakar, a leading businessman, told Dawn.\n\nThe border authorities opened the Friendship Gate for a limited time for the repatriation of Afghan refugees, who were reaching Chaman from different areas of Balochistan and Karachi.\n\nThe activities at the immigration section of Federal Investigation Age­ncy (FIA) was also suspe­nded and those who were going to Afghanistan using visas and passports were also stuck in Chaman due to the border closure.\n\n“Over 5,000 Pakistanis are stranded in Spin Boldak as they visit there and Vesh on a daily basis for their small businesses,” an FIA official said.\n\nAccording to customs officials, more than 1,009 trucks carrying transit cargo, exports, and imports goods are stranded because of a suspension in customs clearance owing to “unprovoked aggression” from Kabul.\n\nThe disruption follows the suspension of customs clearance for both exports and imports at key border crossings — including Tor­k­ham, Ghulam Khan, Kha­rlachi, and Angoor Adda — effective from October 12 and at the Chaman border from October 15.\n\nAccording to the officials, the suspension was prompted by unprovoked aggression from the Afghan side that posed serious security risks to customs inspectors and personnel stationed at these posts.\n\nAn official announcement from the FBR confirmed that around 500 vehicles carrying transit trade cargo remain stra­nded at the Torkham and Chaman border crossings.\n\nThe transit consignments, imported by Afghan traders, are awaiting customs clearance.\n\nOn the bilateral trade front, congestion remains acute at the Torkham border, where 255 export vehicles and 24 import vehicles are currently held at the terminal.\n\nAn additional 200 trucks, stranded along the Jamrud–Landi Kotal road, are awaiting clearance.\n\nIn contrast, the Chaman border has comparatively lighter traffic, with 25 export vehicles and five import vehicles still pending processing.\n\nIn light of prevailing security concerns, the FBR has confirmed that the majority of customs personnel have temporarily relocated to headquarters.\n\nHowever, a limited number of inspectors and support staff remain stationed at each border post to resume clearance operations promptly once conditions stabilise and trade routes reopen.\n\nTo mitigate disruption and ensure the continued availability of essential consumer goods in the market, the collectorates of the Northern Region have proactively cleared import consignments that had arrived prior to the border closures.\n\nWith input from Reuters\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/24074910b5f9d15.webp",
  "retrievedAt": "2025-10-25T02:01:11.362Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950907",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T01:53:41.000Z"
}
