{
  "title": "Foreigners show interest in T-bills Pakistan",
  "author": "Shahid Iqbal",
  "content": "KARACHI: Foreign investors have shifted their focus towards government treasury bills, investing $138.4 million in the first 17 days of October, according to data released by the State Bank of Pakistan (SBP) on Thursday.\n\nThe inflow marked a significant increase compared to previous months, with October alone accounting for 49pc of total foreign investment inflows in FY26. The total investment in T-bills during the current fiscal year reached $228.2m, showing renewed interest despite lower returns and a reduced policy rate.\n\nThe returns on T-bills currently stand around 11pc, nearly half the rate recorded a year earlier. Analysts attribute the shift to rising participation from Middle Eastern investors, particularly the UAE and Bahrain, replacing the UK, which had been the leading investor in the past.\n\nOf the $138.4m invested in the first half of October, the UAE accounted for $85m and Bahrain for $48.5m, making up most of the inflows from Arab countries. Outflows during the same period stood at $47.8m from T-bills, compared to $138.4m in inflows.\n\nIn contrast, foreign investment in the equity market remained subdued despite record performance at the Pakistan Stock Exchange. During FY26, inflows into equities stood at $91.5m against outflows of $251.5m. In the first 17 days of October, outflows reached $45m against a modest inflow of $15m.\n\nBankers and analysts said the trend reflects a prefer­ence for low-risk government securities amid sustained exchange rate stability. “The longer stability in the rupee has encouraged investors to park funds in risk-free instruments,” one banker said.\n\nHowever, foreign direct investment (FDI) continues to decline, with inflows falling 34pc in the first quarter compared to the same period last year, indicating persistent caution toward private-sector projects.\n\nMeanwhile, SBP’s foreign exchange reserves increased by $14m during the week ending Oct 17, reaching $14.455bn — close to the June 2025 peak of $14.506bn. The country’s total liquid reserves stood at $19.853bn, including $5.398bn held by commercial banks.\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/240838275152400.webp",
  "retrievedAt": "2025-10-25T02:00:32.914Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950922/foreigners-show-interest-in-t-bills-pakistan",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T02:44:57.000Z"
}
