{
  "title": "Palestinian factions agree to hand Gaza to technocrat committee",
  "author": "AFP",
  "content": "The main Palestinian political factions, including Hamas, said on Friday they had agreed that an independent committee of technocrats would take over the running of post-conflict Gaza.\n\nDuring a meeting in Cairo, according to a joint statement published on the Hamas website, the groups agreed to hand “over the administration of the Gaza Strip to a temporary Palestinian committee composed of independent technocrats”.\n\nIt said the committee would “manage the affairs of life and basic services in cooperation with Arab brothers and international institutions”.\n\nThe statement also said the factions had agreed to work on unifying a common position “to confront the challenges facing the Palestinian cause”.\n\nIt called for a meeting of all forces and factions to “agree on a national strategy and to revitalise the Palestine Liberation Organization (PLO) as the sole legitimate representative of the Palestinian people”.\n\nHamas is not part of the PLO, which is dominated by its longtime rival Fatah.\n\nAn informed source told AFP on Thursday that delegations from Hamas and Fatah met in Cairo to discuss the second phase of a US-backed ceasefire plan in Gaza.\n\nThe source, who spoke on condition of anonymity, said that both sides agreed to “continue meetings in the coming period and to work on organising the Palestinian internal front in the face of the challenges posed by the Israeli government”.\n\nAlongside the Hamas-Fatah talks, Egypt’s intelligence chief Hassan Rashad met senior officials from key Palestinian factions.\n\nThey included Islamic Jihad, an ally of Hamas, as well as the Democratic Front for the Liberation of Palestine and the Popular Front for the Liberation of Palestine — both factions within the PLO.\n\nHamas and Fatah have a history of deep political rivalry, which flared into fighting for a time after a 2006 election, and which has hindered efforts at Palestinian national unity.\n\nIn December 2024, they agreed to create a committee to jointly administer post-conflict Gaza. The agreement was criticised, particularly by members of Fatah.\n\nHamas, which seized power in the territory in 2007, has already made it clear that it does not wish to govern the post-conflict territory, but has pushed back against the insistence that it disarm its fighters.\n\nSeparately, top US diplomat Marco Rubio voiced hope of soon putting together an international force to police the ceasefire in Gaza.\n\nThe secretary of state visited Israel on the heels of Vice President JD Vance as part of an all-out effort by the United States to persuade both Hamas and Israel to respect the truce.\n\nRubio said it was critical for the deal to create “the conditions for the stabilisation force to come in as soon as it possibly can be put together”.\n\nHe expressed optimism for a durable end to the two-year Gaza conflict as he met Israeli, US and other Western forces monitoring the ceasefire from inside a vast converted warehouse in southern Israel.\n\nThe deal, spearheaded by President Donald Trump, calls for an international force to oversee security after Israel’s ceasefire with Hamas.\n\nIn Gaza, families were still trying to find their way back to their ruined homes — in many cases only to find they lie in areas controlled by Israeli forces beyond the so-called “Yellow Line”.\n\n“Some young men from our family risked their lives, they went to inspect the destruction in our area, and told us that my house was destroyed,” said 42-year-old Hani Abu Omar, a displaced Palestinian speaking to AFP at a tented encampment in Al-Zawayda.\n\n“All my life I’ve been working, earning, and doing everything I can to build a house.”\n\nIsrael’s campaign in Gaza since October 2023 has killed more than 68,000 Palestinians and left hundreds of thousands homeless and hungry.\n\nFighting has died down since the October 10 ceasefire, but aid flows are still restricted and Gaza is divided between Hamas territory in the ruined cities and a wide band of land outside the Yellow Line still held by Israel.\n\nThe arrival of an international security force may unlock reconstruction funds — US officials vow none will go to Hamas-held areas — but the troop-contributing countries have yet to be confirmed.\n\nRubio confirmed that Israel would enjoy vetoes on the force’s composition, amid reports Israel has objected to Turkiye’s participation.\n\n“There’s a lot of countries that have offered to do it. Obviously as you put together this force, it will have to be people that Israel is comfortable with,” he said.\n\nTurkiye, a Nato member and one of the region’s strongest militaries, was the first Muslim-majority country to recognise Israel.\n\nBut, under President Recep Tayyip Erdogan, it has welcomed Hamas leaders and been a vociferous critic of Israel, which Erdogan accuses of committing genocide in Gaza, an allegation Israel denies.\n\nIndonesia, the world’s largest Muslim-majority state, has said it is ready to send troops to Gaza.\n\nThe United Arab Emirates, which normalised ties with Israel in 2020, has already been involved in ceasefire monitoring.\n\nRubio said the US may seek a UN mandate for the force, as some countries need the world body’s imprimatur to deploy troops.\n\nBut he again rejected any future role for UNRWA, the UN agency for Palestinian refugees, which Israel has banned from its territory.\n\nSome 200 US soldiers have deployed to the Civil-Military Coordination Centre, where uniformed troops from a dozen countries were seen mingling in the hastily-assembled rented space.\n\nOverhead screens showed the staff’s latest findings, including what it said was a new abundance of fruit, vegetables, cheese and coffee getting into Gaza.\n\nAnother projection showed the day’s schedule and ended with words from Trump that read like a motivational saying: “A new and beautiful day is rising. And now, the rebuilding begins.”\n\nThe Trump administration has been increasingly firm with Prime Minister Benjamin Netanyahu, who in March brushed aside an earlier ceasefire and ordered a major new offensive.\n\nNetanyahu has sought to downplay any perception of tension with the US, his most crucial military and diplomatic backer.\n\nIsrael is still waiting for Hamas to return the remains of 13 of 28 dead hostages it promised to hand over.\n\nHamas said today it had received “clear guarantees” from mediators Egypt, Qatar and Turkiye that “the war has effectively ended”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/24220009a516c65.webp",
  "retrievedAt": "2025-10-25T01:58:43.618Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950991/palestinian-factions-agree-to-hand-gaza-to-technocrat-committee",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T17:00:38.000Z"
}
