{
  "title": "Imperial College London refutes Punjab govt’s claims of campus in Lahore, says has no such plans",
  "author": "Dawn.com",
  "content": "Imperial College London has refuted the Punjab government’s claims that it is opening a campus at the Nawaz Sharif IT City in Lahore, saying that all of its campuses are based in the United Kingdom (UK).\n\nOn October 18, the PML-N had posted on its official X account about a meeting chaired by Punjab Chief Minister Maryam Nawaz. The post said that a campus of Imperial College London would open at the Nawaz Sharif IT City, adding that the foundation stone would be laid in November.\n\n“A modern 300-bed hospital will also be built within the college campus,” it said.\n\nIn a separate post on X, Punjab Senior Minister Marriyum Aurangzeb had also made a similar statement about the meeting chaired by the chief minister.\n\n“A campus of Imperial College London will be established in the Nawaz Sharif IT City which will also include a state-of-the-art 300-bed hospital and its foundation stone will be laid in November,” she had said. The post has since been deleted.\n\nThe official X account for the Punjab government had also reiterated the same.\n\nHowever, the educational institute refuted these claims, terming them “incorrect”.\n\n“Reports that Imperial College London plans to open a campus overseas are incorrect,” the college said in a post on its official website on Monday.\n\n“There have been erroneous reports in the media and online that Imperial is opening a campus at Nawaz Sharif IT City in Lahore, Pakistan. Imperial has no such plans, with all the university’s campuses based in the UK,” it said.\n\nIt further directed those interested in the college’s global activity to its International Relations Office webpage.\n\nMeanwhile, the Punjab Central Business District (CBD), a department under the provincial government set up to establish urban regeneration projects, also issued a statement, saying the planned college will be a collaboration between a trust of the UK’s National Health Service (NHS) and NovaCare.\n\n“The upcoming healthcare university and affiliated medical college at CBD NSIT (Nawaz Sharif IT) is a collaborative initiative between NovaCare and Imperial College Healthcare NHS Trust (UK) — an independent NHS institution,” it said.\n\nThe CBD added that the project “remains firmly on track under the NovaCare–ICHT partnership, advancing our mission to establish a world-class hub for healthcare education, research, and innovation at CBD NSIT, Lahore, under the direct supervision” of the Imperial College Healthcare trust.\n\nEarlier, former chairman of the National Vocational and Technical Training Commission (NAVTTC), Javed Hassan, said that as an alumnus of Imperial College London, he was “briefly bemused by the bold claim of a campus in Nawaz Sharif IT City”.\n\n“Turns out Imperial College is less adventurous — its campus plans remain firmly UK-bound. Verification, it seems, is still a novel concept,” he said.\n\nPunjab CM Maryam had officially inaugurated the Nawaz Sharif IT City project commercially in May last year. During the ceremony, the chief minister had stated that several international tech giants were showing interest, with 10 companies already planning to establish their offices there. The IT city spans 853 acres and is designated as tax-free for 10 years.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/220815415ff8871.webp",
  "retrievedAt": "2025-10-25T02:02:27.447Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950541/imperial-college-london-refutes-punjab-govts-claims-of-campus-in-lahore-says-has-no-such-plans",
  "dateList": "2025-10-24",
  "date_published": "2025-10-22T04:34:25.000Z"
}
