{
  "title": "Pakistan’s final Women’s World Cup encounter against Sri Lanka ends in washout",
  "author": "Dawn Sport",
  "content": "Pakistan’s final ICC Women’s World Cup encounter against Sri Lanka ended in a washout at the R. Premadasa Stadium in Colombo on Friday.\n\nThe Green Shirts end their World Cup campaign second from the bottom on the table with three points and a negative net run rate of 2.65.\n\nRains had delayed the toss, and after Pakistan were put into bat, almost two hours later and with the match reduced to 34 overs, Fatima Sana’s side had reached 18-0 in 4.2 when further rains proved decisive in effecting a washout.\n\nOpeners Muneeba Ali was on seven and Omaima Sohail on nine when they returned to the dugout before Fatima and her Sri Lankan counterpart Chamari Athapaththu, along with the match officials, decided that the match should be called off.\n\nFatima’s side had crashed out of the race for the semi-finals on Tuesday after a crushing 150-run defeat (DLS method) to South Africa in their penultimate match of the league stage.\n\nLeft-arm spinner Sadia Iqbal also lamented the inclement weather at the pre-match press conference.\n\n“Yeah, it’s been quite difficult because many of our matches were affected by rain. That made things a little tough for us, but we’ll still try to give our best in the upcoming matches,” Sadia said at the R. Premadasa Stadium on Thursday.\n\nPakistan: Omaima Sohail, Muneeba Ali (wicket-keeper), Sidra Amin, Aliya Riaz, Natalia Pervaiz, Fatima Sana (captain), Eyman Fatima, Rameen Shamim, Syeda Aroob Shah, Nashra Sandhu, and Sadia Iqbal.\n\nSri Lanka: Vishmi Gunaratne, Chamari Athapaththu (capt), Hasini Perera, Harshitha Samarawickrama, Kavisha Dilhari, Nilakshika Silva, Anushka Sanjeewani (wk), Sugandika Kumari, Dewmi Vihanga, Malki Madara, and Inoka Ranaweera.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/242005101b9a7b8.webp",
  "retrievedAt": "2025-10-25T01:59:23.382Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950970/pakistans-final-womens-world-cup-encounter-against-sri-lanka-ends-in-washout",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T10:59:59.000Z"
}
