{
  "title": "COAS Munir reiterates any violation of Pakistan’s territorial integrity will be met with ‘firm and decisive response’",
  "author": "Nadir Guramani",
  "content": "Chief of the Army Staff (COAS) Field Marshal Asim Munir on Tuesday reiterated that any violation of Pakistan’s territorial integrity would be met with a ’firm and decisive response\n\nThe army chief’s affirmation came in the wake of a border conflict with the Taliban regime in Afghanistan as long-simmering tensions over cross-border terrorism boiled over into outright fighting, along with charged statements from India’s civil-military leadership.\n\nThe military’s top brass had warned India earlier this month that any “imaginary new normal” its leadership might be entertaining about bilateral dynamics would be met with a “new normal of swift retributive response”.\n\nA press release issued from the Inter-Services Public Relations (ISPR) today said the army chief interacted with participants of the 17th National Workshop Balochistan at the General Headquarters.\n\n“The COAS reiterated that while Pakistan seeks regional peace and stability, any violation of its territorial integrity, direct or indirect, will be met with a firm and decisive response to safeguard the lives and well-being of its citizens,” the ISPR said.\n\nThe military’s media wing added that the army chief underscored that “Indian sponsored proxies” Fitna al-Hindustan and Fitna al-Khawarij propagated “anti-people and anti-development agendas with malicious intent to perpetrate violence”.\n\nHe reaffirmed that all necessary actions were being taken to pursue them and rid Balochistan of their menace.\n\nFitna al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan. In May, the government designated all terrorist organisations in Balochistan as Fitna al-Hindu­stan — a new phrase aimed at framing India’s alleged role in terrorism as a deliberate destabilisation strategy, potentially to galvanise domestic support.\n\n“The COAS, during his interaction with the participants, remarked that Balochistan is the pride of Pakistan, endowed with highly vibrant, resilient and patriotic people who are its true wealth. He also highlighted the federal and provincial governments’ development initiatives, being undertaken to uplift the socio-economic landscape of Balochistan through a people-centric approach. He emphasised upon realisation of the immense economic potential of the province for the benefit of the people of Balochistan.”\n\n“Acknowledging the constructive role of civil society, particularly in engaging and empowering the youth, the COAS underscored their pivotal role in sustainable development, negating vested political agendas in the interest of long-term prosperity in Balochistan,” the ISPR added.\n\nOn Saturday, the army chief had cautioned India that there was “no space for war in a nuclearised environment” as he hailed Pakistan’s “clear victory” during the May conflict with the neighbouring country.\n\nHe had also urged the people of Afghanistan to choose mutual security over perpetual violence and called on the “Afghan Taliban regime to rein in the proxies who have sanctuaries in Afghanistan”.\n\n“Rest assured, like our victory in the conventional domain, every state proxy of our neighbour will be razed to dust, God-willing,” he had asserted, vowing to never bow before “misguided terrorists having a perverted interpretation of Islam”.\n\nTensions between India and Pakistan escalated sharply in early May 2025 after an attack in Indian-occupied Kashmir’s Pahalgam prompted New Delhi to launch “Operation Sindoor” on May 7, targeting sites inside Pakistan and causing civilian casualties. India blamed Pakistan without presenting evidence, further inflaming hostilities between the two nuclear-armed neighbours. Pakistan later launched a retaliatory “Operation Bunyanum Marsoos”, leading to heavy artillery and drone exchanges before a US-led push helped broker a ceasefire.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/21184501ce65ee8.webp",
  "retrievedAt": "2025-10-25T02:02:50.042Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950386/coas-munir-reiterates-any-violation-of-pakistans-territorial-integrity-will-be-met-with-firm-and-decisive-response",
  "dateList": "2025-10-24",
  "date_published": "2025-10-21T13:36:00.000Z"
}
