{
  "title": "Bringing disinformation campaigners on social media to justice major challenge: Tarar",
  "author": "Kalbe Ali",
  "content": "ISLAMABAD: Federal Minister for Information and Broadcasting Attaullah Tarar said on Thursday that disinformation campaigners could not be brought to justice because major social media platforms do not have offices in the country, which limits direct engagement and accountability mechanisms.\n\nHe added that misinformation and disinformation had become the most powerful weapon to distort facts, spread unrest, and threaten the integrity of the state.\n\n“National security remains the government’s top priority, demonstrated by Pakistan’s successful handling of information warfare during the Pakistan-India tension and the recent conflict involving Afghanistan,” he said while addressing at the Strategic Dialogue on Media Literacy and Digital Resilience.\n\nThe event was organised by the High Commission of Canada in Pakistan, in collaboration with the Department of Digital Media, University of the Punjab.\n\nThe minister added that the government is working to bring these platforms to Pakistan to enable collaborative efforts to address digital manipulation more effectively.\n\nHe highlighted that Media and Information Literacy (MIL) can empower citizens to think critically, assess information responsibly, and engage ethically in the digital space.\n\nHe further endorsed the idea that MIL should be integrated into national education curricula, and vowed to send this recommendation to the authorities concerned. Canadian High Commissioner to Pakistan Mr Tarik Ali Khan highlighted Canada’s continued commitment to supporting free, open, and secure digital spaces.\n\n“The cyber and digital ecosystem is an increasingly dangerous space, the world needs an informed and engaged citizenry that can participate meaningfully both online and offline.” Mr Khan said. He said this requires digital literacy, online safety, and improved cybersecurity and  Canada was actively supporting media freedom and digital inclusion.\n\nHe called for joint efforts to support informed citizenship, democratic participation, and the safety of those who report the truth.\n\nWhile, UNESCO Country Representative Fuad Pashayev said that the theme of Global Media and Information Literacy Week 2025 was that ‘Media and Information Literacy’ remains the strongest defence in the age of generative AI and algorithmic influence.\n\nProf. Dr. Savera Mujib Shami, Chairperson of the Department of Digital Media, University of the Punjab, stressed that media literacy was a necessity for everyone, as it influences not only political awareness but also the social fabric and moral compass of society.\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/241004469fec48b.webp",
  "retrievedAt": "2025-10-25T02:01:13.067Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950816/bringing-disinformation-campaigners-on-social-media-to-justice-major-challenge-tarar",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T01:59:58.000Z"
}
