{
  "title": "PCB suspends Multan Sultans over contract breach",
  "author": "Mir Shabbar Ali",
  "content": "The Pakistan Cricket Board (PCB) has issued a suspension notice to the Pakistan Super League (PSL) franchise Multan Sultans, citing breach of contractual obligations, it emerged on Thursday.\n\nAccording to sources, the PCB has also sent a formal notice for termination of the franchise’s contract “after completing all necessary legal procedures”. The move marks a significant escalation in the simmering tensions between the board and the Multan franchise.\n\nSources revealed that the action followed repeated public statements by franchise owner Ali Tareen, who allegedly criticised the PCB and PSL management.Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%Remaining Time -MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nIn April, Ali shared a podcast clip on X questioning the PCB’s pre-season build-up, writing:\n\n“How is PSL 10 bigger and better? Same games, same teams – what’s new? Fed up with hollow words. PCB had time to plan innovations, but we’re repeating last year. Our biggest brand deserves more. Explain the vision!”\n\nA few days later, he sought to clarify his stance amid backlash from other franchise owners, posting:\n\n“I love PSL — it’s a MADE-IN-PAKISTAN success story we all benefit from. My words were about pushing for real growth, not negativity. Salman Naseer & PCB team are giving their all. Let’s unite as owners to back them and elevate the league. No more stagnation!”\n\nHowever, tensions persisted. In July, Ali renewed his criticism in response to a PCB post-season debrief video celebrating PSL 10’s “success”.\n\nHe wrote: “Applause? You must be kidding. TV ratings down, attendance plummeting, digital engagement slowing — yet we’re celebrating? PCB, wake up. PSL deserves better planning, not self-congratulation. Time to fix these issues before it’s too late.”\n\nA PCB source said the repeated statements “damaged the league’s reputation and violated the terms of the agreement”.\n\nThe board’s notice reportedly outlines specific clauses of the franchise agreement that were breached. PCB officials maintained that the board remains committed to upholding the integrity and professional standards of the PSL.\n\nA Multan Sultans spokesperson told Dawn on Thursday that “the PCB last month sent a legal notice which is not a notice of termination”.\n\n“The notice threatens termination of our franchise agreement and a lifetime blacklist of Mr. Tareen from owning any cricket team in the future,” a statement by the franchise said later.\n\n“Every statement he (Ali) has made has been in the best interest of the PSL, urging the league to aim higher and do better.\n\n“For the PCB management to treat constructive criticism as a crime is outrageous. It demonstrates the pettiness of the current management and clearly shows that the PSL is not open to questions or accountability, even from those who have given the most to make it stronger.\n\n“Silencing honest feedback is not how great leagues are built.”\n\nMultan Sultans added that the legal notice by the PCB demanded Ali to “retract all recent critical statements and issue a public apology to the PSL management”.\n\nThe development comes amid growing concerns over franchise-board relations within the PSL framework, with several stakeholders calling for greater transparency and consistency in the PCB’s dealings with team owners.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/23113041f6c1437.webp",
  "retrievedAt": "2025-10-25T02:02:55.981Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950764/pcb-suspends-multan-sultans-over-contract-breach",
  "dateList": "2025-10-24",
  "date_published": "2025-10-23T06:45:23.000Z"
}
