{
  "title": "Pope, King Charles pray together in a 500-year first",
  "author": "Reuters",
  "content": "VATICAN: Britain’s King Charles and Pope Leo prayed together in the Vatican’s Sistine Chapel on Thursday, in the first joint worship including an English monarch and a Catholic pontiff since King Henry VIII broke away from Rome in 1534.\n\nLatin chants and English prayers echoed through the chapel, where Leo was elected the first US pope by the world’s Catholic cardinals six months ago in front of frescoes by Michelangelo depicting Christ delivering the Last Judgment.\n\nCharles, supreme governor of the Church of England, was seated at the pope’s left near the altar of the chapel as Leo and Anglican Archbishop Stephen Cottrell led a service that featured the Sistine Chapel Choir and two royal choirs.\n\nAlthough Charles has met the last three popes, and Popes John Paul II and Benedict XVI travelled to Britain, their previous encounters never included joint prayers.\n\nThe King and Queen Camilla are on a state visit to the Vatican, marking the closening ties between the Catholic Church and the Anglican Communion, five centuries after their turbulent separation.\n\n“There is a strong sense that this moment in the extraordinary setting of the Sistine Chapel offers a kind of healing of history,” Anglican Rev. James Hawkey, canon theologian of Westminster Abbey, said.\n\n“This would have been impossible just a generation ago,” he said.  “It represents how far our churches have come over the last 60 years of dialogue.”  Cottrell, the Ang­lican Archbishop of York, stood in at the Sistine Chapel service for Sarah Mullally. She was recently announced as the first woman to serve as Archbishop of Canterbury, the spiritual head of the Anglican Communion, but will not take the role until next year.\n\nThe split between the Catholic Church and the Church of England was formalised in 1534, after Pope Clement VII refused to annul King Henry VIII’s marriage to Catherine of Aragon.\n\nHenry’s desire for a male heir—and a new wife who might provide one—was the immediate catalyst, but other factors were also at play, involving the English crown’s seizure of church assets and the growth of Protestant ideas in England. As England swung between Cath­olicism and Protestantism during the reigns of Henry’s daughters, Mary I and Elizabeth I, hundreds of Catholics and Prot­estants were executed for their faith, often burned at the stake.\n\nCharles and Camilla, who visited the Vatican earlier this year to see Pope Francis, also had a private meeting with Leo on Thursday morning. At home in Britain, Charles’ disgraced brother, Prince Andrew, is engulfed in a deepening crisis over abuse allegations and his ties with sex offender Jeffrey Epstein.\n\nThe King will travel in the afternoon to Rome’s Basilica of St Paul Outside the Walls, one of Catholicism’s four most venerated churches, where Leo has approved giving him a new title of  “Royal Confrater”, or brother, at the connected abbey.\n\nCharles will also be gifted a special seat in the apse of the basilica. The wooden chair, reserved in the future for use only by British monarchs, is decorated with the king’s coat of arms and the ecumenical motto  “Ut unum sint” (That they may be one).\n\nBishop Anthony Ball, the official Anglican representative to the Vatican, said the honours  “show the commitment that both of our Churches have to working for a shared future.”\n\nTies improving since 60s\n\nThe Church of England is one of 46 autonomous churches across some 165 countries that together form the Anglican Communion.\n\nThe Catholic Church, which has 1.4 billion members, and the Anglican Communion, with 85 million members, have been improving ties since the 1960s.\n\nThe teachings of the two traditions align on many major issues, but the Catholic Church does not ordain women and generally does not allow priests to marry.\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/240925162d6e50e.webp",
  "retrievedAt": "2025-10-25T02:02:00.431Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950894/pope-king-charles-pray-together-in-a-500-year-first",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T01:59:37.000Z"
}
