{
  "title": "AJK High Court strikes down appointments, promotions order in its own establishment",
  "author": "Tariq Naqash",
  "content": "MUZAFFARABAD: The Azad Jammu and Kashmir (AJK) High Court on Thursday annulled dozens of appointment, promotion, and transfer orders or notifications made in its own establishment — mostly during the tenure of former Chief Justice Sadaqat Hussain Raja — declaring that they had been carried out in violation of law, service rules, and transparency requirements.\n\nIn a detailed judgment authored by Justice Chaudhary Khalid Rasheed, the court accepted two writ petitions after hearing them together.\n\nIn the first petition, filed in May, the petitioners had challenged amendments made to the AJK High Court Establishment (Appointment and Conditions of Employment) Rules, 2020, in July 2023 and February 2025. The second petition, filed in August, assailed various appointments, promotions, and transfers of private respondents through different notifications issued over the past few years.\n\nThe petitioners contended that the amendments were never published in the official gazette and therefore had no legal force.\n\nWhile the petitioners were represented by Waheed Arif, Khawaja Mohammad Akbar, and Imranul Haq Khan, as many as 16 lawyers appeared on behalf of the respondents.\n\nThe court held that the recruitment and promotion processes were marred by irregularities, including excess appointments, improper constitution of selection committees, withdrawal of posts from the National Testing Service (NTS) without justification, and alteration of advertised qualifications to favour certain candidates.\n\nJustice Rasheed observed that the High Court had engaged the NTS for recruitment under a Memorandum of Understanding requiring 30 days’ prior notice for revocation. However, the High Court administration selected candidates internally “without assigning any reason to withdraw selection through NTS”, in an act that the judgment described as “malevolent and unjust.”\n\nThe court found that while ten posts of IT Assistants were advertised, 14 appointments were made. Similarly, nine clerical posts were re-designated as Office Coordinators and upgraded from grade-11 to grade-14 without re-advertisement. It further noted that the appointing authority chaired its own selection committee, which “amounts to being a judge of his own cause.”\n\nRegarding stenographers, Justice Rasheed recorded that five posts had been advertised but ten appointments were made. During proceedings, a test for stenographers was conducted in the judge’s chamber on October 16, where “only one candidate could qualify as per requirements of relevant rules,” while eight others were “found unaware of shorthand,” leading the court to conclude that “the selection for the posts of stenographers was not transparent.”\n\nThe court also set aside several promotions, including those of the Secretary to Chief Justice, the Additional Registrar, and the Assistant Registrar (Record), terming them coram non judice or void ab initio. It observed that some promotions had been granted despite the absence of rules for those posts, or apparently in favour of relatives of serving officers, calling such decisions “a glaring pick and choose.”\n\nThe court dismissed objections raised by several respondents that the petitions were time-barred or motivated by mala fide intent, noting that the petitioners had acted promptly after obtaining certified copies of the disputed orders. It also rejected arguments that the High Court’s internal rules did not require publication.\n\nIn a significant passage, Justice Rasheed referred to a “regrettable” incident on October 9, noting that former Chief Justice Sadaqat Hussain Raja, who had acted as the authority during the disputed appointments and promotions, “approached the office of the Registrar, shouted upon him and other staff, and used abusive language and gestures towards the Hon’ble Chief Justice and Judges of this Court… in order to influence the process of the Court hearing.”\n\nThe Judge directed that all illegal appointments and promotions stand annulled and ordered the sitting Chief Justice to constitute inquiry committees to fix responsibility for misconduct and misuse of authority within 90 days.\n\n“It is inevitable to observe that a High Court is among the sacred establishments that stand as a beacon of justice,” Justice Rasheed wrote, adding that an institution expected to administer justice could not itself act in disregard of the law.\n\n“Only transparent and rule-based recruitment can sustain public confidence in the judiciary.”\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2410122110a9003.webp",
  "retrievedAt": "2025-10-25T02:01:13.079Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950812/ajk-high-court-strikes-down-appointments-promotions-order-in-its-own-establishment",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T01:59:58.000Z"
}
