{
  "title": "Interior ministry notifies ban on TLP following federal cabinet’s approval",
  "author": "Umer Mehtab | Dawn.com",
  "content": "The interior ministry on Friday notified the ban on the Tehreek-i-Labbaik Pakistan (TLP), saying that the federal government had “reasonable grounds” to believe the religiopolitical party was connected to terrorism.\n\nThe notification, a copy of which is available with Dawn.com, said: “The federal government has reasonable grounds to believe that TLP is connected with and concerned in terrorism.\n\n“In exercise of the powers conferred by Section 11B(1)(a) of the Anti-Terrorism Act, 1997 (XXVII of 1997), the federal government hereby orders TLP to be a proscribed organisation for the purpose of the Act and list the aforesaid organisation in the first schedule to the said Act,” the notification said.\n\nThe development comes a day after the federal cabinet approved a proposal to proscribe party under the Anti-Terrorism Act, days after nationwide protests over Gaza claimed the lives of several protesters and police officers and paralysed major highways and city roads from Karachi to Islamabad.\n\nThe decision was taken at a meeting chaired by Prime Minister Shehbaz Sharif on a proposal from the Punjab government. A statement issued by the Prime Minister’s Office (PMO) after the meeting said the ban was “unanimously” approved by the federal cabinet.\n\nThe interior ministry briefed the cabinet on what it called the TLP’s “violent and terrorist activities”, stressing that the organisation had repeatedly incited unrest across the country.\n\nThe group, founded in 2015 as a movement, turned into a political party in 2016. It was previously banned by the PTI government in 2021 after violent protests.\n\nThe interior ministry informed the cabinet that the 2021 ban on TLP was lifted after six months on the assurance that it would refrain from violence. It added that the current ban on TLP stemmed from its reneging on those guarantees.\n\n“In the past, security personnel and innocent bystanders have been killed in violent protests and rallies by the TLP,” the PM Office statement said.\n\nA source privy to the meeting told Dawn that participants were asked to share their views on TLP’s “firebrand” approach, and “almost everyone was of the view that the organisation must be barred from paralysing the country time and again”.\n\nLater, speaking on Geo News, Adviser to the Prime Minister on Political Affairs Rana Sanaullah said the intent behind a ban was not to eliminate a party but to purge it of “anti-state and terrorist elements”.\n\nHe said no one had any issue with the TLP’s religious views. But whenever the party staged protests in the past, it “led to violence and loss of life, such as the 2017 Faizabad demonstrations”.\n\nIn separate remarks to Geo News, Minister of State for Interior Talal Chaudhry said that the TLP had acted like an extremist group and violated its prior commitments.\n\nChaudhry said the government had no other option in light of reports submitted by the Punjab government than to ban the party. He said the interior ministry had summoned reports from all provinces about the party’s conduct in the past decade regarding its involvement in violence, targeting of minorities, incitement of sectarianism and other such matters.\n\nUnder the country’s legal framework, the Nat­ional Counter-Terrorism Aut­hority (Nacta) maintains lists of proscribed persons and groups. Those designated as terrorists or associated with terrorism face severe consequences, such as travel bans and financial sanctions.\n\nIndividuals may also be placed on the Fourth Schedule of the ATA for monitoring.\n\nHistorically, proscribed entities have included the Tehreek-i-Taliban Pakistan (TTP), Hizbut Tahrir, Lashkar-i-Jhangvi, Jaish-i-Mohammad and the Baloch Liberation Army (BLA).\n\nThe provincial government can request a ban on a party, as in the case of the TLP.\n\nIn turn, the federal government has the power to refer this request to the Supreme Court by declaring that the party “has been formed or is operating in a manner prejudicial to the sovereignty or integrity of Pakistan”, according to Article 17(2) of the Constitution.\n\nHowever, according to analysts, the final decision to ban a political party rests with the Supreme Court under the Constitution.\n\n“The federal government shall, within 15 days of such declaration, refer the matter to the Supreme Court, whose decision on such reference shall be final,” the article says.\n\nThe government can also invoke Section 212 of the Elections Act 2017 to seek the dissolution of a political party. Any declaration is subject to adjudication by the Supreme Court.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/24141823ddc8024.webp",
  "retrievedAt": "2025-10-25T01:59:51.538Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950962/interior-ministry-notifies-ban-on-tlp-following-federal-cabinets-approval",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T09:18:36.000Z"
}
