{
  "title": "French court convicts oil giant over ‘misleading’ climate claims",
  "author": "AFP",
  "content": "PARIS: A French court ruled on Thursday that oil and gas giant TotalEnergies had engaged in “misleading commercial practices” by overstating its climate pledges and ordered it to remove certain claims, in what activists said was the first such ruling worldwide against a major oil company for climate misinformation.\n\nThe case could help set a legal precedent for the kind of environmental claims corporations, which are starting to face tighter regulations in the European Union, can make.\n\nIn Europe, courts ruled against Dutch airline KLM in 2024 and Germany’s Lufthansa in March for misleading consumers about their efforts to reduce the environmental impact of flying.\n\nClientEarth, an organisation that closely monitors law cases against the oil and gas industry, welcomed the ruling as a  “historic win against greenwashing”.\n\nGreenwashing is the act of claiming to be more environmentally responsible than in reality.\n\n“It is the first judgment in the world ruling that an oil and gas major has misled the public by greening its image,” said ClientEarth.\n\nThe Paris court found that TotalEnergies had made environmental claims on its French consumer-facing website that  “misled” consumers into believing that it could achieve carbon neutrality by 2050 while increasing oil and gas production.\n\nTotalEnergies noted in a statement following the ruling that the court dismissed claims against its corporate communications as well as those related to fossil gas and biofuels, which activists argued had been deceptively promoted as clean energy.\n\nGreenpeace and two other environmental NGOs said the ruling was still  “a major legal precedent against climate misinformation”.\n\n“This is the first time anywhere in the world that a major oil and gas company has been convicted by the courts for misleading the public by greenwashing its image regarding its contribution to the fight against climate change,” said the organisation, one of the plaintiffs in the case.\n\nClientEarth lawyer Jonathan White said the “landmark judgment” sent “a clear war­n­ing shot to other oil and gas majors in Eur­ope and beyond: claiming to be part of the transition while backing new fossil fuel projects comes at a tried-and-tested legal price.”\n\nSome claims ordered removed\n\nThe civil case stems from a March 2022 lawsuit by three environmental groups, which accused TotalEnergies of  “misleading commercial practices” over claims it could reach carbon neutrality while continuing oil and gas production.\n\nThe plaintiffs took that legal route because  “greenwashing” is not specifically covered under French law.\n\nStarting in May 2021, TotalEnergies indicated to the public its goal of  “net zero by 2050, together with society” and touted gas as “the fossil fuel with the lowest greenhouse gas emissions”.\n\nAt the time, the company had changed its name from Total to TotalEnergies to emphasise its investments in wind turbines and solar panels for electricity production.\n\nBut there was a  “big gap” between their claims, which focused on carbon neutrality and clean energy, and  “their activities, which are still mostly based on fossil fuels,” said Juliette Renaud from the French chapter of Friends of the Earth activist group, one of the plaintiffs.\n\nThe lawsuit targeted around 40 claims and requested that TotalEnergies be required to stop using them.\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/240931378f14fc4.webp",
  "retrievedAt": "2025-10-25T02:01:58.905Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950898/french-court-convicts-oil-giant-over-misleading-climate-claims",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T01:59:37.000Z"
}
