{
  "title": "Randy Andy and…",
  "author": "F.S. Aijazuddin",
  "content": "THE late King Farouk of Egypt once said there would be only five kings left in the end — four in the pack of cards, and the king of England. The public disrobing of Prince Andrew, Duke of York, KG, KCVO, has put the survival of the British monarchy in jeopardy. A report claims that when her doctors told the late Queen Elizabeth II that she was suffering from bone marrow cancer, she asked them to prolong her life until at least February 2022, the Platinum Jubilee of her accession. (She died in September 2022.)\n\nAnother personal reason must have been her determination to shield her favourite son Andrew from the consequences of his own indiscretions. In addition to the titles awarded to him as the son of a reigning monarch, Prince Andrew received an unwelcome but accurate accolade from the British press — ‘Randy Andy’.\n\nThis rhyming epithet might have remained fodder for comedians desperate for a quick laugh, had Andrew’s friendship with the disgraced Jeffery Epstein not been exposed. Epstein had been a procurer of under-age escorts for the lusty prince and other VIPs.\n\nThe Epstein scandal reminds one of a similar episode in the early 1960s that rocked the administration of prime minister Harold Macmillan, when it was revealed that his defence secretary John Profumo had been having an affair with a call girl, Christine Keeler. Infidelity might have remained a private matter between Profumo and his actress wife Valerie Hobson, except that Ms Keeler shared her favours also with the then Soviet naval attaché Yevgeny Ivanov. Profumo denied the relationship until forced into a confession.\n\nHow Andrew must wish he lived in Edwardian England.\n\nThe Profumo scandal had a messy aftermath. Profumo resigned in disgrace. Stephen Ward who had introduced Profumo and Ivanov to Christine Keeler committed suicide. Keeler served a prison sentence for an unrelated crime. Ivanov was recalled to Moscow, where he rejoined the Soviet navy and later received the Order of Lenin.\n\nThe Prince Andrew/ Epstein connection has caused similar fatalities. Epstein (like Ward) apparently committed suicide. Ms Guiffre ended her misshapen life herself. However, she haunts Prince Andrew even after death. Her ghost-written memoirs — Nobody’s Girl — were released on Oct 21.\n\nIn them, she accuses Andrew of taking advantage of her on three occasions when she was still 17 years old. Andrew denies one allegation. Specifically, on March 10, 2001, he says (with commendable recall) that he was buying pizzas that night in Woking with his daughter Beatrice.\n\nAndrew hoped to silence Ms Guiffre with a payment of £12 million, part of which went to a charity Guiffre founded for survivors of sex trafficking. It is suspected that the hush money was paid by the late Queen. Some MPs are questioning the propriety of such a payment by a sovereign to protect a prince, especially if the money went out of the privy purse.\n\nThere is public clamour to have the prince stripped of his titles. That is possible only through an Act of Parliament. The present PM Keir Starmer is reluctant. Like his predecessor PM Harold Macmillan, he intends to ride the storm.\n\nHow Andrew must wish he lived in Edwardian England. His libidinous ancestor King Edward VII had numerous affairs which agitated his prim mother Queen Victoria but were overlooked by his Danish wife Alexandra. Even as King Edward lay dying, Alexandra magnanimously escorted his last mistress Alice Keppel into his bedroom for a final farewell. (Alice Keppel is the great-grandmother of the present Queen Camilla.)\n\nKing Charles III intends to be remembered for more than his errant sibling. His decision to join Pope Leo XIV in prayer in the Vatican’s Sis­tine Chapel this week is a brave affirmation of the power he intends to exercise as Sup­re­­me Head of the Chu­rch of England. With that one symbolic gesture of conciliation, King Charles will end 500 years of estrangement between Protestants and Catholics. It began in the 1520s, when King Henry VIII had a disagreement with Pope Clement VII who refused to annul the king’s first marriage. That schism led to Henry’s excommunication and the English Reformation.\n\nIt took another 400 years before any British monarch could meet a Pope. In 1903, King Edward VII expressed his intention of visiting Pope Leo XIII. His ministers objected. His Catholic subjects insisted. Eventually, Edward met the Pope as “a private visitor and not as King or the head of the church”.\n\nTime heals even spiritual wounds. Sixty years ago, Pope Paul VI and Ecumenical Patriarch Athenagoras I of Constantinople papered over their doctrinal differences and jointly lifted the mutual excommunications that dated from 1054 C.E. Reco­n­c­i­l­i­ation between the various churches of Christ is one peace deal that (deo gratias) has not needed President Trump’s intervention.\n\nThe writer is an author.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68f98a9e2040e.jpg",
  "retrievedAt": "2025-10-25T02:03:23.893Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950713/randy-andy-and",
  "dateList": "2025-10-24",
  "date_published": "2025-10-23T01:54:31.000Z"
}
