{
  "title": "Snow leopard population in Pakistan dwindling amid climate threats",
  "author": "Jamil Nagri",
  "content": "GILGIT: Snow leopards living in Pakistan are severely threatened by climate change, poaching, and habitat fragmentation, experts have warned after a first-of-its-kind scientific survey that revealed only 167 of these rare animals remain in the country.\n\nThe research by the Snow Leopard Foundation of Pakistan (SLF) provides a scientific population estimate for the species, which was previously counted on the basis of suggestions and assumptions, said Dr Hussain Ali, the paper’s author and a senior regional programme manager at the SLF.\n\nConducted between 2010 and 2019, the study used extensive camera trapping over 40,000 square kilometres, with 1,000 cameras and 1,200 genetic samples.\n\nClimate change, along with shifting weather patterns, threaten the snow leopard’s habitat, Dr Ali said, a sentiment echoed by other conservationists.\n\n“Less snowfall and drought at the mountains force snow leopards either to migrate or move to low-lying areas,” he added. This movement results in snow leopards attacking livestock, and “in retaliation, owners attempt to kill the snow leopard”.\n\nThe snow leopard is considered a key indicator of the health of mountain ecosystems, which are a vital source of water for billions of people. Threats to its survival signal a danger to the entire region.\n\nIncreasing human activity, including the development of roads and infrastructure near their habitat, also threatens the elusive cat, Dr Ali added.\n\nMeanwhile, the United Nations marked International Snow Leopard Day on Thursday, releasing new videos showing the elusive mountain cat in Pakistan’s northern ranges and other parts of its habitat, while urging stronger efforts to protect the species from extinction.\n\nIn messages to Pakistan and 12 other range countries, the UN said snow leopards remain at high risk of extinction in the wild, even though they were reclassified as “vulnerable” — rather than “endan­gered” — on the Intern­ational Union for Conservation of Nature (IUCN) Red List in 2017.\n\nIn 2024, the UN General Assembly declared Oct 23 as International Day of the Snow Leopard to promote international and regional cooperation for conserving the species, which plays a vital role in maintaining the ecosystem of high mountain regions.\n\n“The snow leopard is not just a symbol of wilderness; it is vital to the health of our mountain ecosystems,” the UN said, urging local communities, park authorities, and conservation groups in Pakistan to intensify protection efforts.\n\nAnwar Iqbal in Washington also contributed to this report\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68fad89d30c3b.jpg",
  "retrievedAt": "2025-10-25T02:02:26.249Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950902/snow-leopard-population-in-pakistan-dwindling-amid-climate-threats",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T01:39:01.000Z"
}
