{
  "title": "Pakistan among possible destinations to resettle exiled Palestinian captives",
  "author": "AFP",
  "content": "Pakistan is among four possible destinations that are being considered to receive exiled Palestinian captives, according to the Palestinian Prisoners Club (PPC), a non-governmental organisation established in 1993 to support political prisoners in Israeli occupation jails.\n\nThey were freed in exchange for Israelis held in Gaza, but instead of going home, 154 former Palestinian prisoners were exiled to Egypt, where they are confined to a hotel and kept under tight surveillance. All of them had been sentenced by an Israeli military court to life in prison on charges of murder, belonging to Palestinian resistance groups banned by Israel and more.\n\nBut when a ceasefire took effect in Gaza earlier this month, the group was put on buses and sent to Egypt, where authorities have put them in a five-star hotel that they cannot leave without clearance. Egypt first received 150 exiled prisoners in January, and more than eight months later, most of them are still in the same hotel, their fate undecided.\n\nPPC official Hasan Abd Rabbo told AFP that the men remain in Egypt with accommodation costs covered by Qatar, while talks are underway over resettlement. He said possible destinations include Pakistan, Qatar, Turkiye and Malaysia.\n\n“We were separated from our families for 20 years,” Murad Abu al-Rub, a 45-year-old who spent two decades behind bars for alleged murder and for belonging to a Palestinian organisation banned by Israel, told AFP.\n\nNow, he is living in uncertainty and under close surveillance, far from the Palestinian city of Jenin where he was born.\n\n“Nothing has changed. I still can’t see my mother or my siblings,” Abu al-Rub told a team of AFP journalists who were able to access the hotel.\n\nSince the US-brokered ceasefire took hold on October 10, Hamas has freed all 20 surviving Israelis in exchange for nearly 2,000 Palestinians, most of whom returned to Gaza and the West Bank.\n\nDuring previous truces in the conflict, thousands of other Palestinian prisoners were freed in similar exchanges.\n\nThe vast majority of those with life sentences were exiled to Egypt, which has formal ties with Israel and played a key mediation role.\n\nRights groups have long criticised Israel’s use of military courts to try Palestinians suspected of security offences, saying they do not offer fair trial guarantees.\n\nIn Egypt, the 154 men are not free to move, and they have no work permits and no idea what comes next. The government has not issued any formal statement about their status.\n\n“No Arab country wanted to take us in,” said Abu al-Rub, who was imprisoned for the alleged killing of four Israeli soldiers in 2006 in an operation by the Al-Aqsa Martyrs’ Brigade.\n\nIn the hotel corridors, the men spend hours on the phone, speaking to relatives.\n\n“When I was arrested, my little sister was 15,” Abu al-Rub said. “I didn’t recognise her when I saw her on a video call.”\n\nOver 19 years, he was shuffled through eight different Israeli prisons, never staying more than a few months in each.\n\nKamil Abu Hanish, who spent 22 years in Israeli prisons, was jailed allegedly for murder and for belonging to the Popular Front for the Liberation of Palestine (PFLP), according to Israel’s justice ministry records.\n\nHe described the relief of being freed from jail.\n\n“It was like moving between two worlds … from a world of shackles and locked doors to a world of freedom and open space,” he said.\n\nBut he also described his final hours in custody as some of the harshest.\n\n“Dozens of prisoners were tied together with ropes. They blindfolded us and forced us to kneel. Then they made us lie face down with our hands bound,” said Abu Hanish.\n\nBefore Hamas’s October 7 attack, prisoners could study, play sports and attend daily discussion groups, he said, with inmates recounting a tradition of protest and rebellion in order to obtain these rights.\n\n“We played volleyball and table tennis and held three educational sessions a day,” Abu al-Rub said.\n\n“We had no rights left — even the simplest,” he said, adding that pens, paper, films, TV and newspapers were banned after October 7.\n\n“Everything we had, including clothing and blankets, was confiscated. We were left sleeping on iron beds” during winter.\n\nPalestinian, Israeli and international rights groups have documented similar claims of mistreatment, but Israel denies any such violations and says its prison service operates in accordance with the law.\n\nAccording to the Palestinian Authority, nearly 11,000 Palestinians remain in Israeli custody, on charges related to the Palestinian-Israeli conflict.\n\nMahmoud al-Ardah, 50, also jailed on murder and other security charges, said the last two years were the worst.\n\n“Daily beatings and humiliation,” said the man, accused of belonging to the Islamic Jihad organisation.\n\n“In the last two years, I suffered more than in the previous 30.”\n\nIn 2021, Ardah was one of six inmates who escaped Israel’s Gilboa prison by digging a tunnel with spoons and improvised tools. He was rearrested and put in solitary confinement.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/24214944f4423d0.webp",
  "retrievedAt": "2025-10-25T01:58:44.822Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950987/pakistan-among-possible-destinations-to-resettle-exiled-palestinian-captives",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T17:02:28.000Z"
}
