{
  "title": "SP, 2 other policemen martyred as back-to-back blasts rock KP’s Hangu",
  "author": "Zahid Imdad",
  "content": "Three cops, including a superintendent of police (SP), were martyred as back-to-back blasts rocked Khyber Pakhtunkhwa’s Hangu on Friday, according to police.\n\nKP Inspector General of Police (IGP) Zulfiqar Hameed shared these details with Dawn.com, saying that the first blast targeted a police checkpost in the jurisdiction of Bilyamina police station.\n\nHe said no policemen were usually deployed at the checkpost, adding that some policemen were on their way to the site when a second blast took place near their vehicle.\n\nThree policemen were martyred in the second blast, which was caused by an improvised explosive device, the IG said.\n\nKohat division’s Regional Police Officer (RPO) Abbas Majeed shared further details of the incident while speaking to the media in Hangu.\n\nHe said police security was on high-alert today in Hangu, as well as in other districts of Kohat.\n\nPolice had been carrying out a search and strike operation in the area and had also cordoned off a location at a distance of around 100 metres from the targeted checkpost since 10am, the RPO said. He added that the checkpost, an old one, was used by law enforcement personnel to rest during breaks when they would cordon off a nearby location.\n\n“There was no one at the checkpost at the time of the incident,” he said, adding that an IED blast took place at the checkpost at 2pm. “However, since no police personnel were present there, there were no casualties.”\n\nThe RPO said SP (Operations) Asad Zubair, along with a police party, had left for the checkpost following the first blast. “As their vehicle approached the location, an IED blast occurred near the checkpost. Fitna-al-Khawarij had planted a more powerful IED there in comparison to the one used in the first blast.”\n\nFitna-al-Khawarij is term designated for the banned terror outfit Tehreek-i-Taliban Pakistan (TTP) by the state.\n\nRPO Majeed said the second blast was a “big” one, which resulted in the death of two policemen on the spot. Meanwhile, SP Zubair was taken to a hospital where he succumbed to his injuries, he added.\n\nThe official said a large police party was carrying out a search operation at the site of the incident.\n\nKP Chief Minister Sohail Afridi sought an immediate report from the IG following the incident and called a session of the apex committee on the law and order situation in the province, a statement from the CM office said.\n\nIt added that the CM had “strongly condemned” the incident and termed it “unfortunate”.\n\nThe statement further quoted him as saying that the “elements involved [in the incident] would be taken to task at all costs. Cowardly attacks cannot demoralise the CTD (counter-terrorism department) and police”.\n\nHe added the sacrifices of the martyred police personnel, which also included a superintendent of police, “will not go in vain” and that  “all resources will be used to establish peace”.\n\nCM Afridi also prayed for the martyred personnel and their families, the statement said.\n\nPresident Asif Ali Zardari “strongly condemned” the “attack in Hangu carried out by India-backed Fitna-al-Hindustan terrorists,” a statement on the PPP’s X account said.\n\nFitna al-Hindustan is a term used by the state to frame India’s alleged role in terrorism as a deliberate destabilisation strategy, potentially to galvanise domestic support.\n\nThe statement on the PPP’s account quoted President Zardari as saying: “Terrorists are enemies of the country’s peace and stability. Their cowardly acts are unacceptable.”\n\nHe paid tributes to the policemen martyred in today’s blasts, saying that the nation was “proud of the sacrifices of its brave soldiers”.\n\nThe president lauded the resolve and courage of police in the fight against terrorism and prayed for the martyred policemen, as well as their families, the statement said.\n\nPrime Minister Shehbaz Sharif said that the police had always played a frontline role in the war against terrorism.\n“We are determined to completely eradicate terrorism from the country,” he said.\n\nEarlier, Interior Minister Mohsin Naqvi also “strongly condemned” the blasts, a statement posted on his ministry’s X account said, adding that he paid tributes to the martyred police, including SP Zubair.\n\nHe also extended condolences to the families of the martyred policemen.\n\n“The sacrifice of martyred SP Asad Zubair and two other police personnel will not go in vain. The sacrifices of the officers and personnel of KP Police cannot be forgotten,” the statement quoted him as saying.\n\nFormer KP chief minister Ali Amin Gandapur also expressed sorrow over the martyrdom of policemen in the incident.\n\n“Saddened to hear about the martyrdom of SP (Operations) Asad Zubair and two [other] policemen during an IED attack in Hangu. KP police, security forces and the brave people of KP have been paying the price for our peace with their blood,” he posted on X.\n\nPakistan has been witnessing an uptick in terrorist activities, mainly in KP and Balochistan since TTP broke a ceasefire deal with the government in November 2022. Ending the ceasefire agreement, the TTP had vowed to escalate attacks against the security forces, the police, and other law enforcement agencies’ personnel.\n\nToday’s blasts take place five days after law enforcers foiled an attack by terrorists at a police station in KP’s Bannu district on Oct 19. According to police, the failed attack was carried out by the TTP and targeted the Baka Khel police station and three terrorists were killed as cops opened fire on them.\n\nPreviously on Oct 18, unkn­own assailants had launched a rocket and gun attack on the Azam Warsak police station in South Waziristan. According to police, the attackers targeted the police station from multiple directions, but the police and the Frontier Corps personnel responded swiftly, forcing the assailants to flee. No casualties were reported in the incident.\n\nPrior to that, on the night of Oct 17, police had intercepted an explosive-laden rickshaw in the Bannu district, killing three terrorists and foiling a potential suicide attack on a police post in Mazanga in the jurisdiction of the Havaid police station.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/24151616cd35282.webp",
  "retrievedAt": "2025-10-25T01:59:45.523Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950966/sp-2-other-policemen-martyred-as-back-to-back-blasts-rock-kps-hangu",
  "dateList": "2025-10-24",
  "date_published": "2025-10-24T09:59:24.000Z"
}
