{
  "title": "Entire nation united, stands with Armed Forces for country’s defense: Tariq",
  "author": null,
  "content": "ISLAMABAD, May 07 (APP): Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry on Wednesday said that the entire nation was united and stood with the Pakistan Armed Forces for the defense and security of Pakistan.\nIndia could not convince the international community, including the United States and the European Union, about its false and baseless narrative, he said while talking to APP here.\nHe said that Indian aggression has targeted our civilian population which was highly condemnable.\nThe minister stated that when India attacked civilians inside Pakistan, in the darkness of night, Pakistan Air Force had given a befitting reply and shot down its planes.\nDr Tariq said that this achievement of defence forces made the nation prouds and the passion and spirit of the masses were exemplary.\nHe said that Army Chief General Syed Asim Munir was leading the Pakistan Army with passion and professionalism and by the grace of Allah Almighty, the defence of the nation was in safe hands due to the expertise of the Pakistan Army.\nIn response to a question, he said that the allegations leveled by India against Pakistan regarding the Pahalgam incident and the false flag operation were before the entire international community and India has not been able to provide any evidence for them.\nIt has also not been able to convince the international community in this regard.\n“We have undeniable evidence of Indian involvement the terrorist incidents taking place inside Pakistan. Pakistan is a country that is a victim of terrorism. The international community and the media are watching this entire situation”, he maintained.\nHe said that India has targeted the civilian population but Pakistan did not target their civilian population.\nIn response to another question, he said that the international community, including the US and the European Union, know that both Pakistan and India were nuclear powers and the conflict between the two could trigger a major war.\n“We have always said that Pakistan is a peace-loving country. We do not believe in aggression, but if there is any aggression, we will respond to it with full force. “",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:12:44.975Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/entire-nation-united-stands-with-armed-forces-for-countrys-defense-tariq/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T16:58:00.000Z"
}
