{
  "title": "Pakistan, Canada discuss bilateral cooperation in clean energy",
  "author": null,
  "content": "ISLAMABAD, May 07 (APP):Federal Minister for Petroleum Ali Pervaiz Malik and Daniel Arsenault, Political and Trade Counsellor at the Canadian High Commission, discussed opportunities for enhanced bilateral cooperation in clean energy, minerals and geological survey.\nThe Minister congratulated Canadian Prime Minister Mark Carney on assuming office, said a news release.\nExpressing concern over recent escalations between India and Pakistan, Arsenault emphasised the need for restraint to prevent further instability in the region.\nHe underscored Canada’s apprehension regarding attacks in densely populated areas and called for calm and better sense to prevail. He expressed hope that the situation would calm down soon.\nAli Pervaiz Malik strongly condemned India’s attacks on the civilian population.\nHe said it is a blatant violation of international law and humanitarian principles. It is a display of India’s frustration over its inability to protect its citizens.\nPakistan had already offered to investigate on Pehalgam incident. Without any substantial evidence, such Indian aggression is uncalled for. Pakistani forces are ready and fully prepared to defend our country.\nThe meeting also explored avenues for collaboration in sustainable energy development. Both sides acknowledged the potential for joint initiatives in clean energy technologies, minerals, and enhancing trade between Canada and Pakistan.\nThe Minister invited Canadian companies to Pakistan’s exploration sector, given the huge potential in both onshore and offshore exploration.\nA Canadian Counsellor highlighted the opportunities for cooperation between the Geological Survey of Pakistan and Canada under the Technical Assistance Partnership (TAP) project. He also extended an invitation to the Global Energy Show that happens annually in Canada.\nPervaiz Malik welcomed the Canadian interest in enhancing cooperation with Pakistan.\nHe said that Pakistan has made great progress in a short time and has undertaken bold steps to strengthen its economy. Pakistan has a keen interest in leveraging Canadian expertise and investment to advance its economic transformation goals.\nThe meeting concluded on a positive note, with both parties agreeing to maintain regular communication to foster mutual understanding and economic cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:13:35.272Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-canada-discuss-bilateral-cooperation-in-clean-energy/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T14:49:00.000Z"
}
