{
  "title": "Pakistan calls India’s ‘blatant aggression’ a violation of UN charter, int’l law",
  "author": null,
  "content": "ISLAMABAD, May 7 (APP):Pakistan on late Tuesday strongly condemned India’s “cowardly action” of missile strikes, terming it a flagrant violation of the UN Charter, international law, and established norms of inter-state relations.\n“Pakistan reserves the right to respond appropriately at a time and place of its choosing, in accordance with the Article-51 of the UN Charter, and as enshrined in international law,” the Foreign Office said in a statement issued here.\nIndia on late Tuesday conducted missile strikes at five locations in Pakistan, killing a child and injuring two others including a woman.\nThe FO statement said, “In an unprovoked and blatant act of war, the Indian Air Force, while remaining within Indian airspace, has violated Pakistan’s sovereignty using standoff weapons, targeting civilian population across international border in Muridke and Bahawalpur, and across Line of Control in Kotli and Muzaffarabad, Azad Jammu and Kashmir.”\nIndia’s act of aggression has resulted in martyrdom of civilians, including women and children. This act of aggression has also caused grave threat to commercial air traffic, it said.\nThe Foreign Office said in the wake of Pahalgam attack, the Indian leadership had once again used the bogey of terrorism to advance its “sham narrative of victimhood, jeopardizing regional peace and security.”\nIt mentioned that India’s reckless action ha brought the two nuclear-armed states closer to a major conflict.\n“The government, armed forces and people of Pakistan stand united in the face of Indian aggression. They will always act with iron resolve to protect and preserve the sovereignty and territorial integrity of Pakistan,” it said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:12:17.782Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-calls-indias-blatant-aggression-a-violation-of-un-charter-intl-law/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-06T22:34:00.000Z"
}
