{
  "title": "Pakistan, Italy sign MoU to stop illegal immigration: Chaudhry Salik",
  "author": null,
  "content": "ISLAMABAD, May 7 (APP): Ministry for Overseas Pakistanis and Human Resource Development, Chaudhry Salik Hussain on Wednesday said that Pakistan and Italy have signed Memorandum of Understanding (MoU) to stop illegal immigration and provide employment to Pakistani workforce.\nThe federal minister and Italian Interior Minister Matteo Pente Duce inked the agreement to take joint steps to prevent illegal immigration and human trafficking, said a press release.\nUnder the MoU, a comprehensive framework will be established to protect the rights of Pakistani workers in Italy. Labor mobility corridors will be set up for training and recruitment of Pakistani skilled workers.\nPilot mobility programs will be launched for vocational and language training of Pakistanis for employment in Italy. Migrant Resource to streamline the process of employment abroad centers will be established.\nOn the occasion, Chaudhry Salik Hussain emphasized that Italy is the first European country to directly sign an MoU to recruit Pakistani workforce. The MoU will create more employment opportunities for Pakistanis in European countries, he added.\nAfter 9 years of hard work, the federal minister said that the MoU with Italy is of great importance in terms of providing Pakistani workforce, adding that an annual quota will be earmarked for Pakistanis in jobs in Italy.\nHe said that the immigration process will be made easy and foster for Pakistanis seeking employment in Italy, noting that cooperation between relevant institutions of Italy and Pakistan will be facilitated to provide modern technical education to Pakistanis.\nThe minister concluded that a joint working group will be formed between Pakistan and Italy to prevent illegal immigration, adding that Pakistan construction, agriculture, hospitality, health will provide skilled and semi-skilled workforce to Italy in the fields of care and Information Technology.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:12:47.730Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-italy-sign-mou-to-stop-illegal-immigration-chaudhry-salik/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T16:44:00.000Z"
}
