{
  "title": "India  admits defeat by raising white flag at Line of Control: Tarar",
  "author": null,
  "content": "ISLAMABAD, May 07 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Wednesday stated that India had effectively admitted defeat by raising the white flag at the Line of Control.\nSpeaking to the media at the Pak-China Friendship Centre in Islamabad, Tarar praised Pakistan Air Force (PAF) for its swift and powerful response following Indian missile strikes that targeted civilian areas in Punjab and Azad Jammu and Kashmir. He told reporters that the PAF had shot down five Indian fighter jets and a drone.\nTarar added that Prime Minister Shehbaz Sharif was closely monitoring the situation.\nThe minister emphasized that the entire Pakistani nation stood united and firmly supported the armed forces. He said the Pakistani Armed Forces had given a tough response to the aggressors.\nCondemning the Indian attacks, Tarar called the targeting of innocent civilians “highly regrettable.” He stressed that Pakistan’s forces had only targeted Indian warplanes involved in the aggression.\nHe noted that Indian media itself was acknowledging the downing of the aircraft. “The entire nation prayed for the success of the Pakistan Army throughout the night,” he added.\nTarar reiterated that Pakistan has long been a victim of terrorism, having sacrificed 90,000 lives in its war against terror.\nHe also pointed out that Pakistan had offered an independent investigation into the Pahalgam incident—an offer that was rejected by Indian authorities. This, he argued, clearly revealed India’s intent to conceal the truth and pursue malicious agendas.\n“Pakistan has been a victim of terrorism for years,” he said, adding that Indian propaganda was a deliberate attempt to damage Pakistan’s image on the international stage.\nHighlighting the human cost, Tarar stated, “We have lost more than 90,000 lives in the war on terror.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:12:06.338Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/india-admits-defeat-by-raising-white-flag-at-line-of-control-tarar/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T03:12:00.000Z"
}
