{
  "title": "Crushing blow makes India realize Pakistan’s preparedness, capabilities: PM",
  "author": null,
  "content": "ISLAMABAD, May 07 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday while stressing upon a display of unity in the aftermath of India’s previous night gutless attack, said that a crushing blow delivered by the country’s armed forces had made India realize the preparedness and capabilities of Pakistan.\nAddressing a session of the National Assembly, the prime minister said in the darkness of night, India tried to infiltrate into Pakistan like it did in the past, but with the grace of Allah Almighty and with the prayers and support of the nation, the brave forces had given them a befitting reply.\nIn that cowardly attack, a number of people had lost their lives; including women and children.\nThe prime minister said that Pakistan had reports about an aerial attack by Rafale combat planes and the entire house and 240 million people of the country should feel pride that its armed forces were ready to counter the attack and destroyed their intruding combat planes.\nThe prime minister paid tribute to Air Chief Zaheer Ahmed Babar Sidhu, on behalf of the entire nation and the parliament for his vigilance and inspiring leadership.\nHe said last night, they had information about the nefarious designs of India who tried to carry out attacks with 80 warplanes, at six different places inside Pakistan, including in AJK, Bahawalpur, Shakargarh, and Sialkot, but Pakistan’s eagles shot down five planes including three Rafale planes; one of which fell down in Bhatanda, besides a number of drones.\n“The response left the enemy in disarray and make them realized the power, prowess and strength of Pakistan as a nuclear state, and it has made them sleepless. Our armed forces are battle-hardened force,” he said.\nHe said their eagles were ready and had also locked communication system of the Indian war planes who had to return back to Srinagar.\nThe prime minister said the entire nation deserved congratulations on the great victory as their armed forces with their professionalism and patriotism, acted in unison, after consultations and planning. The number of shot down Indian places could have been swelled.\nThe prime minister invited all the parties including main opposition PTI legislators to fully support their efforts in making Pakistan a great and invincible by showing unity.\nHe said that he was ready to sit with the opposition leaders in their chamber.\nThe prime minister said it was an opportunity to tell the world that they were one which was the only way to making Pakistan a great one among the comity of nations.\nOn April 22, in Pahalgam, he said, an incident took place in Jammu and Kashmir which had been under illegal occupation of India, but India, within a short period of ten minutes, registered FIR. The Indian media started false allegations against Pakistan and tried to misguide the world.\nOn the other hand, the prime minister said, Pakistan had irrefutable evidences about India’s involvement in Balochistan train hijack incident, fully backing terrorist organizations of BLA and TTP. In the incident, a number of innocent people lost their lives while others were injured. The SSG unit with its professional skills saved innocent people and took them to safe places.\n“India did not condemn this incident but made a mockery of it which would be remembered in the history with repugnant words,” he added.\nThe prime minister further apprised that he held conversations with a number of the global leaders over the escalating situation.\nIn Kakul, he had openly stated that Pakistan had no relation with the incident and offered for an international probe commission to investigate the issue in a transparent and credible way, he said, adding but India had not accepted its offer.\nThe prime minister suggested adoption of a resolution by the national assembly to acknowledge the services of the military leadership in the defence of the country.\nUpon prime minister’s request, the house also prayed for the high ranks of those shaheeds in Jannah who lost their lives in the Indian attack.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:13:38.371Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/crushing-blow-makes-india-realize-pakistans-preparedness-capabilities-pm/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T12:55:00.000Z"
}
