{
  "title": "India’s grave mistake of aggression to entail consequences: PM",
  "author": null,
  "content": "ISLAMABAD, May 07 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday said that India had committed a grave mistake last night by resorting to aggression and thought that Pakistan would back off,  but India would have to face the consequences of its actions.\nIn a televised address to the nation, the prime minister said “India forgets that Pakistani nation had the brave sons who always fought for the respect and defence of the motherland by shedding the last drop of their blood.”\nHe said the entire world witnessed that within few hours, their enemy though large in numbers was bowed down after Pakistan Air Force eagles shot down five Indian combat jets and reduced them to pile of fragments and ashes which was once considered as their pride.\n“It (response) has the thunderous sound of squadron leader MM Alam that struck the enemy strongly,” he observed.\nThe prime minister said India’s cowardly attack took lives of 26 innocent people while injuring 46 others including women and children.\nHe referred to funeral prayer of Shaheed Irtaza Abbas, 7 years old, who lost his life after hit with a splinter in his home where he was present with his mother and a brother.\n“A tender flower withered away and attained shahadat,” he said, adding the nation paid tribute to shaheeds and their families and prayed for the recovery of the injured.\nThe prime minister said that they had resolved that each drop of blood would be accounted for.\n“The timid enemy is attacking innocent people. Pakistan has proved how to respond with solid blow,” he added.\nThe prime minister said that in one-hour fight on the Line of Control, PAF pilots while flying inside territory and with display of bravery and professionalism, reduced enemy’s jets to ashes. In conventional warfare, Pakistan also proved its superiority over its enemy.\nHe said that he along with the entire 240 million people of the country saluted Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza, Chief of Army Staff General Syed Asim Munir, Air Chief Marshal Zaheer Babar Sidhu, Naval Chief Admiral Naveed Ashraf and every officer and soldier of Pakistan.\nThe prime minister regretted that accusations against Pakistan with regard to Pahalgam attack were unreasonable.\nAs a peaceful country, he said, Pakistan had offered an international transparent and credible probe which was acknowledged by the world, but India obliterated all the international laws and norms by resorting to aggression.\nUnder the international laws and the UNSC resolutions, Jammu and Kashmir had been and would remain as a globally recognized dispute until Kashmiris exercised their right to self-determination in a free and impartial environment in accordance with the UN resolutions.\n“India can take a hundered decisions, but it cannot change the reality,” he emphasised.\nIn this region, he said, Pakistan had been the most affected country from the scourge of terrorism and in this fight, a total of 90,000 people had lost their lives with damages to the tune of $152 million dollars.\nHe said that it was a vain thinking on part of India that her aggression would divert attention of Pakistan from fighting terrorism, but it was committed to end it forever.\nFor the protection of Pakistan’s sovereignty and solidarity, the prime minister said, the armed forces and people were standing in unity.\nThe nation fully backed its valiant armed forces and would face and defeat the enemy together, he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:12:30.630Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/indias-grave-mistake-of-aggression-to-entail-consequences-pm/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T17:46:00.000Z"
}
