{
  "title": "SC allows trial of civilians in military courts",
  "author": null,
  "content": "ISLAMABAD, May 07 (APP): The Supreme Court of Pakistan has upheld the constitutionality of military trials for civilians, overturning a previous ruling that had declared such trials null and void.\nThe landmark judgment came on Wednesday from a seven-member constitutional bench led by Justice Amin-ud-Din Khan, which accepted intra-court appeals against the earlier judgment.\nDelivering a brief but decisive ruling, the court ruled by a 5-2 majority in favour of allowing military trials for civilians.\nJustices Jamal Khan Mandokhail and Naeem Akhtar Afghan dissented from the majority opinion. A ten-page written order was also issued following the announcement.\nAccording to the verdict, the court concluded that Sections 2(d)(1) and 2 of the Pakistan Army Act cannot be struck down under the Constitution. It also clarified that Article 233 of the Constitution, which deals with the suspension of fundamental rights during emergencies, was not applicable in this case.\nThe ruling referenced the events of May 9, describing them as among the darkest in the country’s history, as per the Attorney General. The decision stated that multiple cases were registered as a result of the May 9 incidents and disciplinary actions were also taken against several officers.\nThe judgment maintained that while peaceful protest is protected, all constitutional rights are subject to legal restrictions. It noted that the counsels for the petitioners did not deny the events of May 9, though they argued the accused should be tried in anti-terrorism courts. The court emphasized that lawbreakers should be held accountable and punished if found guilty.\nSignificantly, the court underscored the importance of the right to appeal as a fundamental component of a fair and transparent trial. It directed that all individuals convicted by military courts be given the right to appeal in the High Court. It also recommended an amendment to the Pakistan Army Act within 45 days to formalize this provision. Appeals would begin from the date of this amendment.\nThe verdict added that decisions to transfer cases from anti-terrorism courts to military courts can be challenged in High Courts, which must adjudicate these matters on merit. Copies of the ruling have been sent to the Attorney General, the Secretaries of the National Assembly, Law and Defence Ministries, and the Law Commission.\nA dissenting note authored by Justices Jamal Khan Mandokhail and Naeem Akhtar Afghan was also appended to the ruling, disagreeing with the majority’s stance on the legitimacy of civilian trials in military courts.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:13:43.014Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-allows-trial-of-civilians-in-military-courts/",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T12:04:00.000Z"
}
