{
  "article_id": "2025-03-24_824e92c8e9e6bbcdeb2e2c0b7f88ac75",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hanif-abbasi-inspects-islamabad-carriage-factory/",
    "retrieved_at": "2025-08-27T13:59:19.419Z"
  },
  "metadata": {
    "title": "Hanif Abbasi inspects Islamabad Carriage Factory",
    "author": null,
    "date_published": "2025-03-24T11:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 400,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 24 (APP):Federal Minister for Railways Hanif Abbasi on Monday visited the Islamabad Carriage Factory (ICF) for a detailed inspection. This factory is the largest industrial unit under Pakistan Railways, which operates under the Ministry of Railways, Government of Pakistan. The factory has the capacity to produce 120 new passenger coaches annually. During the visit, the Minister inspected various departments of the factory and received a detailed briefing on the production process, quality, and use of modern technology. The Minister also reviewed the passenger coaches being manufactured at the facility. In response to the evolving needs of the industry, the factory entered into an agreement with the Chinese company, Changchun Car Company, to manufacture a new generation of Chinese-designed coaches. These coaches include advanced features such as air spring bogies, electric hot axle detection, improved ride quality, durability, and speed capabilities, with a top speed of 180 kilometers per hour. The Minister met with Project Director Wulei during the visit and discussed increasing the factory's production capacity. He emphasized the need to enhance the factory's production capabilities so that Pakistan Railways can reduce its reliance on imports and become self-sufficient. The Minister also issued instructions for measures to enhance the factory's capacity. Furthermore, Minister Abbasi met with the factory's workers. He expressed pride in the workers and stated, \"Our railway workers are our strength, and it is with their help that we run the railway system.\" The Minister listened to the workers' concerns and issued orders for the immediate resolution of their issues. He assured the workers that the government would take all necessary steps to ensure their welfare. Minister Abbasi praised the factory's workforce and emphasized that the local transfer of technology and modernization of the facility is critical for the future of Pakistan Railways. He assured full cooperation to further enhance the factory's production, quality, and efficiency. The Minister also issued directives to the Director-General of Food to visit railway stations immediately and inspect the quality of food at station hotels and tuck shops, providing a detailed report. Islamabad Carriage Factory was established in 1970 with the cooperation of the French company Alstom (formerly known as Linke Hofmann Busch). The purpose of the factory was to promote the local production of electric and diesel locomotives and coaches in Pakistan, reducing the reliance on imported machinery. Initially, German-style coaches were produced using technology transferred from Linke Hofmann Busch.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}