{
  "article_id": "2025-03-24_708850ae7b6c4a536c2422a33b8d7486",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-scbap-calls-on-jui-f-chief/",
    "retrieved_at": "2025-08-27T13:58:52.086Z"
  },
  "metadata": {
    "title": "President SCBAP calls on JUI-F Chief",
    "author": null,
    "date_published": "2025-03-24T15:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 327,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 24 (APP):In an effort to build a broad-based national consensus on the situation in Balochistan, and as part of his ongoing meetings with national leaders on the issue, President The Supreme Court Bar Association (SCBAP), Mian Muhammad Rauf Atta, held a meeting today with the Ameer of Jamiat Ulema-e-Islam (JUI-F), Maulana Fazal ur Rehman. The Provincial Ameer of JUI-F, Senator Maulana Abdul Wasiay, and the Opposition Leader of the Provincial Assembly, Mr. Mir Younas Aziz Zehri, were also present on the occasion. President SCBAP was accompanied by Mir Atta Ullah Langove, President High Court Bar Association, Balochistan. The meeting took place at the residence of Senator Maulana Abdul Wasiay. The discussion centered on the deteriorating law and order situation in the province which has led to wider unrest, an increase in insurgent activities, and road closures that have directly impacted the daily lives of ordinary citizens. President SCBAP urged the JUI-F Ameer, as a national leader, to take an active role in uniting all political and national leaders of Balochistan on a single platform to find a long-term solution to the province's issues, thereby restoring peace and stability for the public. The JUI-F Ameer also expressed deep concern over the current law and order situation in both Balochistan and the country as a whole. He assured his full cooperation in resolving the disputes and committed to playing his role in restoring peace, progress, and development in Balochistan. To this end, the JUI-F Ameer directed party leaders, particularly in Balochistan, to submit a detailed report on the current situation and their assessments. This would help in formulating a peace restoration plan, which will be pursued after the Eid holidays. Both sides agreed that the only viable solution to Balochistan's issues lies in a democratic approach. In the end, prayers were offered for those who lost their lives in the recent unrest and agreed to continue such consultative meetings until the situation in Balochistan is fully resolved.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}