{
  "title": "Qureshi hopes, new setup in Afghanistan to strive for peace, work towards betterment of all Afghan people",
  "link": "https://www.app.com.pk/national/qureshi-hopes-new-setup-in-afghanistan-to-strive-for-peace-work-towards-betterment-of-all-afghan-people/",
  "date_published": "2021-10-01T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 1 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Friday hoped that the new setup in Afghanistan would make concerted efforts for peace and stability as well as work towards the betterment of all Afghan people.\nHe noted that a peaceful and stable Afghanistan was in Pakistan’s best interest as well as the region.\nThe Foreign Minister expressed these views as he held wide-ranging talks with Foreign Minister of Denmark Jeppe Kofod.\nRecalling their earlier telephone conversations, the two Foreign Ministers had extensive exchange of views on the latest developments in Afghanistan as well as on bilateral cooperation, a press release issued here by the Ministry of Foreign Affairs said.\nThe Foreign Minster emphasized the importance of international community to remain engaged with Afghanistan and support the Afghan people.\nThere was an urgent need to provide assistance to prevent a humanitarian crisis and to take steps to ensure economic stability, he added.\nForeign Minister Qureshi also briefed the Danish Foreign Minister on his interaction with his counterparts from the European countries and said that the views on both sides were largely convergent.\nHe apprised the Danish Foreign Minister of his regional outreach on the situation in Afghanistan and to evolve a coordinated approach.\nIn the context of bilateral relations, Foreign Minister Qureshi reaffirmed the resolve to further expand the growing cooperation, particularly in the fields of trade and investment and renewable energy. He appreciated the ongoing energy cooperation with Denmark.\nBoth the Foreign Ministers looked forward to the early conclusion of the Green Partnership Framework Agreement between Denmark and Pakistan.\nForeign Minister Qureshi also highlighted the importance of high-level exchanges, parliamentary visits and enhanced people-to-people contacts for furthering bilateral ties.\nForeign Minister Kofod reiterated profound gratitude for Pakistan’s facilitative role in evacuation of their nationals and others from Afghanistan.\nForeign Minister Qureshi said that Pakistan had facilitated the transit of more than 14,000 people from over 30 countries and international organizations.\nForeign Minister Kofod extended an invitation to Foreign Minister Qureshi to undertake a visit to Denmark, which he accepted.\nPakistan and Denmark enjoy longstanding friendly relations and diverse bilateral cooperation. A sizeable Pakistani origin community acts as a bridge between the two countries.",
  "retrievedAt": "2025-08-11T21:22:01.716Z"
}
