{
  "title": "Govt evolves strategy to facilitate SMEs: Farrukh Habib",
  "link": "https://www.app.com.pk/national/govt-evolves-strategy-to-facilitate-smes-farrukh-habib/",
  "date_published": "2021-10-01T16:56:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Oct 01 (APP): Minister of State for Information and Broadcasting Farrukh Habib said on Friday that the government has evolved a comprehensive strategy to facilitate the business community, especially small and medium traders in the country.\nHe was addressing a function organized by the Faisalabad Chamber of Small Traders and Small Industry at a local hotel here. Chairman Standing Committee on Finance Faizullah Kamoka, Provincial Minister for Colonies and Culture Mian Khayal Kastro, Provincial Minister for Public Prosecution Ch Zaheer Uddin, MNA Khurram Shahzad and a large number of traders were present.\nThe minister said that the tax paying culture plays a key role to run the country as taxes were the major source of revenue hence we should collectively work for elimination of the negative approach of not paying tax. He said that the trader community could play an important role to steer the country out of foreign debts.\nMinister of State for Information and Broadcasting Farrukh Habib said that loans of Rs 445 billion were being provided at the rate of 6 percent interest to the SMEs sector adding that the government would provide guarantee up to 40 percent on return of loans. He said that SME would also get a loan up to Rs 10 million without any guarantee.\nFarrukh Habib said that reforms were being introduced in the Federal Board of Revenue (FBR) besides introducing an online system that would reduce substantially human contact in all tax related matters.\nHe said that increasing income of the people was among the top priorities of the government. He said that overseas Pakistanis had sent foreign exchange of $ 31 billion in one year.\nThe minister said that the construction sector was being encouraged in the country and this sector had left a positive impact of Rs 5,000 billion on the national economy due to large scale investment.\nHe said that an investment of Rs 1,000 billion had been made so far in the construction sector and about 120 its related businesses had also got growth in the country besides creating 800,000 employment opportunities.\nHe said that SME policy was in the pipeline and it would be approved within a month aiming to promote small and medium business in the country. Under the policy, lease models would be introduced to provide loans to small and medium traders through banks on easy terms and conditions, he added.\nFarrukh Habib said that according to a report of SMEDA, SMEs had the capacity to contribute up to 45 percent in GDP and 25 percent in national exports.\nHe said that funds amounting to Rs 60 billion had been allocated for health cards in Punjab which would be issued to all families by the end of this year.\nHe said that the government was also taking measures to prepare hundreds of thousands acres of barren land for irrigation. Working on food security was also underway while keeping in view the ever increasing population in the country, he said.\nThe minister said that for the first time in the country’s history, the PTI government had focused on the agriculture sector. He said that cultivation of olive oil was being promoted to reduce the import bill. Palm oil cultivation was also being focused as its prices had increased from $ 500 dollars per ton to $ 1200 dollars per ton in the international market.\nAbout the recent increase in petroleum prices, the minister said that petroleum prices in the international market had also increased from $ 40 dollars per barrel to $ 80 dollars per barrel adding that even coal prices had increased up to 200 percent. He said that in India per liter petrol price was Rs 235, in Bangladesh Rs 195 and in Saudi Arabia Rs 104 per liter.\nMinister of State for Information and Broadcasting Farrukh Habib said that Prime Minister Imran Khan had listened to the traders’ problems and also directed the authorities concerned to resolve these accordingly.\nHe said that the government had also provided Rs 50 billion direct relief in electricity and gas bills to the people during the coronavirus pandemic.\nHe said that the government was also improving the condition of the roads network adding that tenders had been called in this regard for many roads.\nMinister of State for Information and Broadcasting Farrukh Habib also highlighted the ongoing development projects in the district Faisalabad.",
  "retrievedAt": "2025-08-11T21:21:57.918Z"
}
