{
  "title": "Talented youth country’s most valued assets; govt ensuring supremacy of merit: PM",
  "link": "https://www.app.com.pk/national/talented-youth-countrys-most-valued-assets-govt-ensuring-supremacy-of-merit-pm/",
  "date_published": "2021-10-01T11:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 1 (APP): Prime Minister Imran Khan Friday describing talented youth as one of “our most valued assets” said that the government was ensuring supremacy of merit in the country.\n“Pakistan is fortunate as the major portion of its population comprises youth. Pakistan is rich in resources and the talented youth is one of our most valued assets”, he added.\nThe Prime Minister was talking to a delegation of National Youth Council (NYC) which called on him here.\nThe meeting was attended by Special Assistant to PM for Youth Affairs Usman Dar, Provincial Ministers Rai Timur Khan Bhatti, Raja Nasir Ali Khan Maqpoon and concerned senior officials.\nThe Prime Minister while emphasizing on the significance of youth in the development of a country said that the progress of Pakistan country depended on the development of the youth.\nYouth must struggle to achieve success as hard work was the path that leads to glory, he said.\nThe Prime Minister further said that youth must follow great leaders.  “Holy Prophet Muhammad (PBUH) is the only greatest leader in history”, he said, adding, that a leader is always truthful and honest.\nEmphasizing on the skill development, the Prime Minister said that Pakistan needs to increase the exports of value added goods.\nHe recalled that when the government came to power, Pakistan’s exports stood at only USD 20 Billion, adding, but due to government’s focus, the country’s exports have increased by 35%.\nThe meeting was briefed by SAPM Usman Dar about the National Youth Council and the steps taken for youth under Kamyab Jawan Program.\nA comprehensive National Youth Development Framework comprising six thematic areas has been made that was in line with the Prime Minister’s vision of empowering youth to play the role of a major contributor in national development.\nIt was further told that Social Protection, Health and Wellbeing, Youth-Focused Institutional Reforms, Mainstreaming Marginalized Youth, Employment and Economic Empowerment and Civic Engagement will collectively help the youth to bring positive change in the country.\nKamyab Jawan Youth Entrepreneurship scheme plans to disburse PKR 100 billion till 2023 out of which PKR 23 billion have already been distributed which led to creation of 33,000 jobs.\nMoreover, the meeting was told that under the program 200,000 Hunarmand Pakistan Scholarships will be given to impart market competitive skills to the youth.\nThe program emphasizes on converting the youth bulge into demographic dividend.\nIn addition to that, the meeting was told that Kamyab Jawan Youth Engagement Initiatives included Kamyab Jawan Markaz (106 public universities), Kamyab Jawan Talent Hunt (22 games, National Sports league, Youth Olympics), Sports Academies (including Ski and Sports Tourism in GB), Green Youth Movement and Kamyab Innovation League (Entrepreneurship).\nNational Youth Council was one of the initiatives of Kamyab Jawan Program that focused on youth inclusion in policy making, youth empowerment and development and meaningful engagement of youth.\nIt includes 33 members hailing from different regions of the country and also had trans-genders, minorities and specially enabled people whereby both genders have equal representation.",
  "retrievedAt": "2025-08-11T21:22:04.136Z"
}
