{
  "title": "Oxford Pakistan Programme launched at HC London",
  "link": "https://www.app.com.pk/national/oxford-pakistan-programme-launched-at-hc-london-2/",
  "date_published": "2021-10-01T18:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 1 (APP):Pakistan High Commission in London has hosted the launch of the Oxford Pakistan Programme.\nThe initiative, spearheaded by Pakistani students, academics and alumni of Oxford University, establishes a framework for support, scholarships and facilitation for students from Pakistan for academic and research pursuits in the world renowned University. In addition to promoting Pakistan-centric research, the programme will also sponsor a lecture series on eastern philosophy.The event was attended by a large number of Oxonians, senior Oxford academicians, scholars, and writers including Malala Yousafzai; former editor of The Guardian, Alan Rusbridger; President of Wolfson College, Sir Tim Hitchens; Principal of Lady Margaret Hall, Prof. Christine Gerrard; and Principal of Linacre College, Prof Nick Brown; and renowned author Victoria Schofield.\nProfessor Adeel Malik, the academic lead for the Programme, and two Oxford alumni and founders of the initiative, Haroon Zaman and Talha Pirzada gave an overview of the programme, its aims and objectives, and the ways and means proposed for achieving these.\nWarmly welcoming the strong contingent of Oxford academics and students, High Commissioner of Pakistan to the UK, Moazzam Ahmad Khan said Pakistan had abiding linkages with Oxford and counted among its luminaries many eminent personalities including leadership.\nHe termed the Oxford Pakistan Programme a timely initiative that would help address the critical challenges of lack of resources and guidance faced by many bright Pakistanis aspiring to secure admission in the prestigious University.\nIt would, he said, help cement academic relationships and foster understanding through in-depth research.\nArticulating his expectations from the programme, he said he wished to see it achieve its objective by allowing an increasing number of Pakistani students to break down barriers, exceed expectations and realise their potential. On behalf of the High Commission, he assured the programme of all possible support.",
  "retrievedAt": "2025-08-11T21:21:57.894Z"
}
