{
  "title": "Export of services reaches $676m in November - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Export of services grew 6.51 per cent to $675.69 million in November 2024 as against $634.39m in the corresponding month last year.\n\nThe growth has returned since February 2024 thanks to a consistent increase in information technology exports, except August, which saw a 6.5pc contraction.\n\nIn rupee terms, the exports improved by 3.63pc to Rs187.713 billion in November against Rs181.131bn in FY24, according to statistics issued by the Pakistan Bureau of Statistics on Friday. In the first five months, export of services rose 7.58pc to $3.27bn against $3.04bn in the corresponding months last year.\n\nIn FY24, the services exports posted a paltry growth of 2.77pc to $7.8bn from $7.59bn in the preceding year.\n\nPakistan emerged as the second top country with the number of freelancers in the world last year and IT products and services were exported to 170 countries.\n\nA new framework for freelancers has been introduced to further ease the opening of their bank accounts and allow higher amounts to be retained in their foreign currency accounts.\n\nThe government has an export target of $15bn for IT exports in the next five years.\n\nThe State Bank of Pakistan has increased the allowable retention limit in Exporters’ Specialised Foreign Cur­­rency Accounts from 35 to 50pc. This development has motivated IT exporters to bring back profits to Pak­istan, significantly increasing overall export numbers.\n\nThe exchange rate stability incentivised IT companies to engage in business activities and repatriate their earnings.\n\nAt the same time, the import of services increased by 4.60pc year-on-year to $828.56m in November. In July to Nov FY25, the import of services recorded an increase of 2.88pc to $4.43bn as against $4.30bn over the corresponding months of last year.\n\nThe import of services increased by 17.14pc to $10.119bn in FY24 against $8.638bn in the corresponding period last year.\n\nThe trade deficit in services decelerated by 8.48pc to $1.15bn in July-November FY25 compared to $1.25bn in the corresponding period last year.\n\nIn November, the trade deficit in services increased by 3.10pc to $152.87m against $157.76m last year.\n\nPublished in Dawn, January 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:26:29.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882976/export-of-services-reaches-676m-in-november",
  "dateList": "2025-01-04",
  "date_published": "2025-01-04T00:48:13.000Z"
}
