{
  "title": "CDA’s electric buses deployed for Diplomatic Enclave shuttle service in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Electric buses of the Capital Development Authority (CDA) have been deployed for the Diplomatic Enclave shuttle service as the Directorate of Municipal Administration (DMA) took over the controversial bus service on Friday.\n\nAs many as eight CDA buses have been set aside to start operations on the route from Monday after the expiry of a three-year contract with a private firm on Friday.\n\nAn official said the electric buses will continue operating on the route until a new contract is awarded.\n\nHowever, many other officials said the civic agency should continue the operation for good to avoid exploitation of citizens by private contractors.\n\nAs per an agreement, the contractor was supposed to charge Rs500 per person for a round coaster ride and Rs1,000 in a high-roof van.\n\nHowever, there had been complaints about overcharging by the contractor who also used his private cars to transport visa seekers to the Diplomatic Enclave and back, charging them in the thousands.\n\nLast year, a European diplomat had also informed the then CDA chairman about the overcharging issue faced by visitors to embassies.\n\nCivic agency should continue operation to avoid exploitation of citizens by private contractors, says official\n\nFollowing the complaint, the then chairman of the CDA Anwarul Haq chaired a meeting and reprimanded DMA officials, prompting them to issue a warning letter to the contractor on September 25.\n\nA number of citizens had also informed Dawn about the high fares being charged by the shuttle service contractor.\n\nThe shuttle service is available for citizens from outside the Diplomatic Enclave to different embassies inside the high-security area.\n\nThe bus service was launched after 9/11 as a security measure after the government banned the entry of private vehicles into the enclave.\n\nHowever, the shuttle service still continues, forcing visitors to use it for entry to the enclave. Sources said many officials of the DMA had been its ardent “advocates”.\n\nAn official said there should be no such service. “Why citizens are not allowed to enter the Diplomatic Enclave in their own vehicles? There should be proper security arrangements and checking before allowing the visitors to enter the enclave in their vehicles or even on foot,” he added.\n\nAnother official, however, said instead of running it on a temporary basis the civic agency and the DMA should manage it on a permanent basis to avoid exploitation of citizens by private contractors.\n\nThe last contract was awarded in 2020 for Rs102.6 million per year. Sources said some officials of the DMA had been supporting continuation of the service through contracts.\n\nThe CDA has allocated eight electric buses that would charge Rs1,000 per passenger trough a computerised fare system.\n\nIt may be noted that on December 27, DMA had tried to award the contract in a controversial manner, but at the eleventh hour the tender was postponed.\n\nPublished in Dawn, January 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:26:24.125Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882930/cdas-electric-buses-deployed-for-diplomatic-enclave-shuttle-service-in-islamabad",
  "dateList": "2025-01-04",
  "date_published": "2025-01-04T00:48:48.000Z"
}
