{
  "title": "Malaysia detains 196 Rohingya migrants after boat capsizes - World - DAWN.COM",
  "author": null,
  "content": "KUALA LUMPUR: Malay­sian police on Friday detained almost 200 migrants “believed to be Rohingya” from Myanmar after their boat ran aground on the northern resort island of Langkawi.\n\nThe group comprises 68 men, 57 women, 32 boys and 39 girls, police said.\n\n“All detainees are believed to be from the Rohingya ethnic group, who are believed to have departed Myanmar by boat approximately 10 days ago,” Langkawi police chief Shariman Ashari said in a statement.\n\nThey have been referr­ed to the immigration department in Langkawi and had undergone health screenings, he added.\n\nThe Malaysian Maritime Enforcement Agency (MMEA) said it had intensified patrols to locate boats carrying undocumented Myanmar migrants.\n\n“Based on information received by the MMEA, there are two more boats carrying undocumented Myanmar migrants at sea, but their exact location is still unknown,” director general Rosli Abdullah said in a statement.\n\n“We are also in communication with Thai authorities to identify the movement of the boats carrying the migrants,” he said.\n\nThe Rohingya experience persecution in their predominantly Buddhist homeland of Myanmar, with many fleeing to affluent, Muslim-majority Malaysia or refugee camps in Bangladesh.\n\nThey often endure harrowing, months-long sea journeys to arrive in Malaysia by boat or sneak into the country via its porous border with Thailand.\n\nIf caught, they are often sent to detention centres that rights groups say are typically overcrowded.\n\nBetween 2010 and 2024, Rosli said, the MMEA and other enforcement agencies had detained 2,089 undocumented migrants from Myanmar who atte­mpted to enter Malaysia in 18 boats.\n\nPublished in Dawn, January 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/0410262739c4f75.jpg",
  "retrievedAt": "2025-08-26T07:26:26.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882994/malaysia-detains-196-rohingya-migrants-after-boat-capsizes",
  "dateList": "2025-01-04",
  "date_published": "2025-01-04T00:48:27.000Z"
}
