{
  "title": "Police promise foolproof security to Chinese engineers in Balakot - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Deputy Inspector General of Police Hazara Range Nasir Mehmood Satti on Friday visited the site of the Balakot hydropower project here and assured Chinese engineers and workers of their foolproof security.\n\n“The Khyber Pakhtunkhwa police have been taking every possible step to ensure your foolproof security so that you could work with a complete peace of mind,” the DIG told Chinese engineers and workers at the Balakot project site.\n\nAccompanied by District Police Officer Shafiullah Khan Gandapur, Mr Satti also held a meeting with army officials to discuss security and other relevant matters.\n\nMr Satti praised Chinese nationals for contributing to Pakistan’s development and prosperity.\n\nDIG visits site of Balakot power project\n\n“You [Chinese engineers and workers] have been executing energy projects from Mansehra to Kohistan in the Hazara division and otherparts of the country to address Pakistan’s power shortfall, so we highly appreciate your efforts and are ready to go to every extent to protect your lives,” he said.\n\nAddressing police personnel deployed for the security of Chinese nationals, Mr Satti emphasised zero tolerance for negligence.\n\n“You must ensure that no unauthorised person gains access to project sites, while the movement of Chinese engineers and workers should be managed in line with stringent security protocols,” he said.\n\nThe DIG said that a multi-layered security mechanism, which was already in place for the safety of Chinese engineers, should be strengthened to foil any mishap.\n\nThe Chinese officials briefed him about progress on projects being carried out along the Kunhar River.\n\nThey said that the 300-megawatt Balakot hydropower project in Kaghan Valley was the largest such initiative by the Pakhtunkhwa Energy Development Organisation, with the financial assistance coming in from the Chinese government.\n\nINJURED: Four people suffered critical injuries when two rival groups clashed over a marriage dispute in a tent village here on Friday.\n\nAccording to police, both groups hurled stones and rocks at each other injuring four people, who were rushed to the King Abdullah Teaching Hospital.\n\nThe incident occurred after those groups settled in the tent village along Abbottabad Road quarrelled over a marriage dispute.\n\nPolice registered an FIR and began raids to arrest attackers, who fled after the clash.\n\nResidents of the Channia area, which houses the tent village, claimed that the groups had migrated from Punjab and were involved in beggary.\n\nThey demanded of the police to take strict action against those engaged in such activities and other crimes.\n\nPublished in Dawn, January 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:26:20.356Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882916/police-promise-foolproof-security-to-chinese-engineers-in-balakot",
  "dateList": "2025-01-04",
  "date_published": "2025-01-04T00:48:55.000Z"
}
