{
  "article_id": "2025-03-12_2643f2b31be5447671e7991efc90cfc4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ecosf-to-host-webinar-on-the-unsolved-moving-sofa-problem/",
    "retrieved_at": "2025-08-27T13:37:51.924Z"
  },
  "metadata": {
    "title": "ECOSF to host webinar on the unsolved ‘Moving Sofa Problem’",
    "author": null,
    "date_published": "2025-03-12T09:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 389,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 12 (APP):The ECO Science Foundation (ECOSF), in collaboration with the Imran Pervez Khan Institute (IPKI) and the Union of Iranian Societies of Mathematical Sciences (UISMS), is organizing a thought-provoking webinar as part of its Science Chronicles Webinar Series. The session, titled \"The Moving Sofa Problem,\" will take place on March 13, 2025, at 7:00 PM Pakistan Time (GMT+5) and 5:30 PM Iran Time. The keynote speaker for the event is Dr. Abdullah Naeem Malik, a highly accomplished mathematician with expertise in data-driven modeling, deep learning, and graph data science. A Fulbright Scholar, Dr. Malik earned his PhD in Mathematics from Florida State University and has over a decade of experience in academia. He has trained and mentored hundreds of students, supervised multiple theses, and contributed to groundbreaking research in quantum computing, machine learning, and applied mathematics. Dr. Malik is an advocate for interdisciplinary collaboration and is actively involved in the Azimuth Project, which focuses on leveraging mathematics for solving real-world challenges. His research interests span across computational approaches to mathematical problems, robotics, motion planning, and engineering applications. The Moving Sofa Problem is a well-known unsolved problem in geometry and mathematics, originally formulated by Leo Moser in 1966. It seeks to determine the largest possible sofa shape that can be maneuvered around a right-angled hallway turn. This deceptively simple question has puzzled mathematicians for decades, leading to groundbreaking insights in geometry, optimization, and computational mathematics. Dr. Malik's talk will explore the mathematical foundations of the problem and discuss notable solutions, including Gerver's sofa shape, which is the best-known solution so far. He will introduce various approximations and computational approaches and highlight their broader applications in robotics, motion planning, material science, and engineering. The webinar aims to make these complex mathematical concepts accessible to a broad audience, from students to researchers, and will highlight how abstract mathematical problems can have practical implications in technology and real-world problem-solving. The webinar will be conducted via Zoom, allowing global participation. The intended participants can visit the ECO Science Foundation website: www.ecosf.org. This webinar promises to offer deep insights into both the theoretical beauty and real-world significance of the Moving Sofa Problem. It is a unique opportunity for students, researchers, and professionals in mathematics, physics, and engineering to engage with an expert and explore one of the most intriguing unsolved problems in mathematics.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}