{
  "article_id": "2025-03-12_21357ebc701a944bcc0cf20bdbf35b8a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/who-representative-calls-on-health-minister/",
    "retrieved_at": "2025-08-27T13:36:31.342Z"
  },
  "metadata": {
    "title": "WHO Representative calls on Health Minister",
    "author": null,
    "date_published": "2025-03-12T15:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 237,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 12 (APP): The Representative of the World Health Organization (WHO) in Pakistan, Dr. Luo Dapeng, along with his delegation, met with Federal Minister for Health Syed Mustafa Kamal to discuss ongoing collaboration and key health priorities. During the discussion, the WHO Representative briefed the minister on various health initiatives being implemented in partnership with the organization. Mustafa Kamal acknowledged WHOas longstanding support in strengthening Pakistanas healthcare system and appreciated its continued assistance during challenging times. Dr. Luo Dapeng congratulated the minister on assuming office and extended his best wishes for his tenure. The meeting focused on mutual areas of interest, including ongoing WHO-supported projects across Pakistan. aThe WHO has played a vital role in Pakistanas health sector for decades, and we deeply value its contributions,a said Minister Mustafa Kamal. aWHO has stood by Pakistan in every difficult moment, and we remain committed to enhancing this collaboration for the well-being of our people.a Dr. Luo Dapeng expressed confidence in the ministeras leadership, stating, aYour vision and leadership will bring significant improvements to Pakistanas healthcare system.a The minister assured the WHO delegation that his office and the Ministry of Health are fully committed to making healthcare services more accessible and efficient for the public. At the conclusion of the meeting, Minister Mustafa Kamal thanked the WHO delegation for their visit and reaffirmed Pakistanas dedication to working closely with the global health body to achieve shared health goals.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}