{
  "title": "PM, Bill Gates discuss COVID-19 situation, polio eradication efforts",
  "link": "https://www.app.com.pk/national/pm-bill-gates-discuss-covid-19-situation-polio-eradication-efforts/",
  "date_published": "2020-12-09T18:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP): Prime Minister Imran Khan Wednesday held a telephone conversation with Bill Gates, co-chair of the Bill & Melinda Gates Foundation and exchanged views on the COVID-19 situation and polio eradication efforts in Pakistan.\nThe prime minister shared Pakistan’s policy to control and mitigate the deleterious impacts of the COVID-19 pandemic on health and economy, PM office media wing in a press release said.\nHe told Gates of Pakistan’s national coordinated efforts, being implemented through ‘smart lockdowns’ aimed at saving people from dying from the virus and hunger.\nNoting the surge in COVID-19 cases, the prime minister underscored the government’s commitment to combat the second wave through similar interventions.\nHe, however, noted that implementation of standard operating procedures (SOPs) was more challenging this time.\nThe prime minister acknowledged the Gates Foundation’s continued support of the Ehsaas programme, which would help the most vulnerable segments of Pakistan’s population benefit from its expertise in health, nutrition and financial inclusion.\nThe prime minister commended the Gates Foundation’s strong advocacy for the provision of safe and effective COVID-19 vaccines to all developing countries.\nHe also reaffirmed that eradication of Polio remained a key priority of the government.\nWhile thanking the Gates Foundation for its critical support in building Pakistan’s emergency management capacity for Polio eradication, the prime minister highlighted that anti-Polio campaigns were being intensified across the country.\nHe added that his Special Assistant on Health Dr Faisal Sultan and his team would continue to collaborate with the Foundation for eradication of polio.\nBill Gates acknowledged Pakistan’s efforts to combat the COVID-19 pandemic while stimulating economic growth.\nThe prime minister and Gates agreed to continue working together on the shared objectives of eradicating Polio and combating the COVID-19 pandemic.",
  "retrievedAt": "2025-08-11T20:07:15.502Z"
}
