{
  "title": "Rs 17 bln development package to change fate of Sialkot: PM",
  "link": "https://www.app.com.pk/national/rs-17-bln-development-package-to-change-fate-of-sialkot-pm/",
  "date_published": "2020-12-09T14:20:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Dec 9 (APP): Prime Minister Imran Khan Wednesday said the mega development package of Rs 17 billion, encompassing water supply, sewerage system, solid waste schemes and parks, would change the fate of Sialkot city.\nAddressing a business loan cheques’ distribution ceremony under the Kamyab Jawan Programme here, he congratulated Punjab Chief Minister Sardar Usman Buzdar for launching development works in cities after thorough review of their needs.\nThe prime minister, who also launched the first phase of public welfare projects under the package, including the groundbreaking of sewage system and water supply schemes costing Rs 9.5 billion, a recreational park at the cost of Rs 300 million and the latest machinery for solid waste management worth Rs 600 million.\nThe projects have been announced under the Punjab Intermediate Cities Improvement Investment Programme (PICIIP). The water supply project include replacement of 260-kilometer stretch of water pipelines, installation of 15 new tube-wells, seven filtration plants and five overhead reservoirs to be completed by 2022. It will have the capacity to supply clean drinking water to around 322,000 people till 2044.\nThe prime minister said the people expected a lot from his government and it was easy for them to dole out the public money extravagantly just to win public applause. But, the chief minister’s decision of launching need-based development schemes after proper review and planning was laudable.\nHe said the cities’ unplanned growth always created troubles for governments to provide amenities like water supply and sewerage. In order to address the issue, he said, his government had decided to design master plans of the cities to contain their haphazard growth, which, otherwise, would eat up green areas to beget food insecurity for future generations.\nHe said the civic amenities like water supply and sewerage systems were essential to prevent water borne diseases and infections particularly among the children.\nHe congratulated the Sialkot’s business community for launching a private airline after establishing the first private airport in the city.\nThe prime minister also performed ground breaking of Rs 14 billion project of the Sialkot University of Applied Engineering and Technology, which, he said, would be applauded by the future generations.\nHe said due to the efforts by Dr Attaur Rehman, a university had already been made operational in Haripur and he was also making efforts for collaboration of the newly announced university with the world’s renowned universities in Austria, Italy and China.\nThe prime minister, who earlier distributed cheques among the beneficiaries, believed that the nations always progressed on the basis of higher education and technical education institutions.\nHe said despite minimal support and the previous government’s anti-industrialization policies, the Sialkot’s business community always acted vibrantly and made the city a hub of exports.\nContrary to the past, he said, the current government was fully backing the industrialists and also agreed to their demand for provision of 1,000 acre land to develop an industrial estate for convergence of the scattered industrial units.\nIt would also make it easier for the government to provide amenities to the industries, besides addressing the difficulties faced by the people by the industries operating in residential areas, he added.\nThe proposed industrial estate, he said, would especially accommodate the SMEs (small medium enterprises, which created most of the jobs. He also assured that the government would further enhance the volume of loans for the sector.\nHe especially appreciated the Bank of Punjab for supporting the government’s pro-poor initiatives of Kamyab Jawan Programme as well as Naya Pakistan Housing Programme.\nImran Khan also announced establishment of a laborers colony in Sialkot under the Naya Pakistan Housing Programme to provide them house on easy installments.",
  "retrievedAt": "2025-08-11T20:07:20.119Z"
}
