{
  "title": "Shehryar Afridi urges more proactive role of parliamentarians in raising voice for Kashmir resolution",
  "link": "https://www.app.com.pk/national/shehryar-afridi-urges-more-proactive-role-of-parliamentarians-in-raising-voice-for-kashmir-resolution/",
  "date_published": "2020-12-09T11:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP): Chairman of the Parliamentary Committee on Kashmir Shehryar Khan Afridi Wednesday urged for a more proactive role of the parliamentarians of the world in raising voices for the Kashmir cause and to make India accountable for its crimes against humanity in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAddressing the participants at Parliamentary Kashmir Conference held here at Institute of Regional Studies, Shehryar Afridi said that the implementation of UNSC Resolutions on Kashmir was a collective responsibility of all the member states of the United Nations Security Council.\nShehryar Afridi said, “There is growing momentum among international Parliamentarians worldwide to work together to galvanize world conscience to halt India’s aggression and make it accountable for its atrocities against Kashmiris in IIOJK.” He gave these remarks on the celebration of 72nd anniversary of the Universal Declaration of Human Rights.\nHe said that the political leaders and legislators in several countries, including the US, Canada and Europe, including the Chairperson of the European Parliament have also expressed their concerns on IIOJK.\nAfridi said, “Pakistan is committed for peaceful resolution of Jammu and Kashmir dispute under Prime Minister of Pakistan’s emphatic narrative set in the UNGA Sessions through a full spectrum of Parliamentary and diplomatic outreach, engagement with media, think-tanks, academia, intelligentsia and civil society.”\nWhile advocating for the right of self-determination to People of IIOJK, Shehryar Afridi said that Indian Occupation Forces cannot strip off the right of Kashmiri people to determine its own destiny as enshrined in UNSC resolutions under the auspices of UN.\nHe said that Kashmiris’ struggle for self-determination has gained a new impetus recently under Modi’s regime.\nShehryar Afridi said, “India has lost currency on its narrative of foreign involvement in Kashmir. He said that BJP regime’s actions are propelled by racist ideologies of fascist RSS.”\nIndian occupation forces are martyring innocent Kashmiris in staged encounters under the garb of so-called cordon and search operations, “India’s extra-judicial killing of hundreds of innocent Kashmiris including women and children is in complete violation of the fundamental precepts of international humanitarian law,” said Afridi.\nAfridi said, “Pakistan has been constructively engaging with the international Human Rights mechanisms at the United Nations. Nationally, Pakistan has enacted wide ranging legislation, established strong institutional machinery and is putting in place robust policy measures in the field of Human Rights.”\nReferring to a statement given by Noam Choamsky, Afridi said that India is constantly endangering regional peace by clinging to its Hindutva expansionist ideology. Narendra Modi is crushing Muslim rights and placing Kashmir under a vicious brutal rule.\nHe said that the world knows that Jammu and Kashmir is an international dispute whose just solution lies in plebiscite so that innocent Kashmiris are free to determine their political status and freely pursue their economic, social and cultural development.\n“The demographic apartheid is aimed at affecting the outcome of a plebiscite envisaged in the UN Security Council resolutions,” said Afridi.",
  "retrievedAt": "2025-08-11T20:07:23.845Z"
}
