{
  "title": "2,963 new Coronavirus cases reported; 60 deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/2963-new-coronavirus-cases-reported-60-deaths-in-past-24-hours/",
  "date_published": "2020-12-09T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP): The total active COVID-19 cases in Pakistan on Wednesday were recorded 45,324 as 2,963 more people tested positive for the deadly virus during the last 24 hours.\nSixty corona patients, 57 of whom were under treatment in hospital while three patients died out of the hospital in their respective homes on Tuesday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab and followed by Sindh where increase in the number of critical patients was observed in Punjab mainly Lahore, Multan and Rawalpindi and followed by Peshawar.\nIt added that out of the total 60 deaths during last 24 hours 39 patients died on ventilators.\nNo COVID affected person was on ventilator in Balochistan and Gilgit Baltistan (GB) while 348 ventilators were occupied elsewhere in Pakistan, out of 1,765 allocated for COVID-19 patients.\nThe maximum ventilators were occupied in four major areas including Multan 63 percent, ICT 49 percent, Peshawar41 percent and Lahore 36 percent.\nThe Oxygen beds (oxygen providing facility other than ventilator as per patient’s medical requirement) were also occupied in four major areas as in ICT 61 percent, Multan 47 percent,Peshawar46 percent and Abbottabad 37 percent.\nSome 38,092 tests were conducted across the country on Tuesday, including 11,242 in Sindh, 15,691 in Punjab, 4,051 in Khyber Pakhtunkhwa (KP), 5,719 in Islamabad Capital Territory (ICT), 604 in Balochistan, 406 in GB, and 379 in AJK.\nAround 372,271 people have recovered from the disease so far across Pakistan making it a significant count with over 86 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 426,142 cases were detected so far, including AJK 7,427, Balochistan 17,540, GB 4,761, ICT 33,420, KP 50,506, Punjab 124,804 and Sindh 187,684.\nAbout 8,547 deaths were recorded in country since the eruption of the contagion, including 3,081 Sindh among 20 of them died in hospital and one out of hospital on Tuesday, 3,242 in Punjab 22 of them died in hospital and two out of hospital on Tuesday, 1,429 in KP 10 of them died in hospital on Tuesday, 345 in ICT four of them died in hospital on Tuesday, 169 in Balochistan, 98 in GB and 182 in AJK.\nA total of 5,865,944 corona tests have been conducted so far, while 613 hospitals are equipped with COVID facilities. Some 3,030 corona patients were admitted in hospitals across the country",
  "retrievedAt": "2025-08-11T20:07:24.671Z"
}
