{
  "title": "AJK President thanks Muslim Ummah for unwavering support to Kashmir cause",
  "link": "https://www.app.com.pk/national/ajk-president-thanks-muslim-ummah-for-unwavering-support-to-kashmir-cause/",
  "date_published": "2020-12-09T11:55:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Dec 09 (APP): Azad Jammu Kashmir President Sardar Masood Khan has said that the unanimous passage of a Kashmir resolution at the Organization of Islamic Cooperation-Council of Foreign Ministers (OIC-CFM) has brushed away Indian propaganda of Kashmir not being included in the agenda.\nThe AJK President made these comments while speaking to various news networks at Jammu and Kashmir House on Wednesday, AJK President office told media.\nIndia, he said, had used diplomatic manoeuvring and made demarches to persuade fellow OIC member states to not include Kashmir in the main agenda and also not to allow the True Representatives of the Kashmiri People – led by the AJK President himself – to address the participants of the conference. He said that all these efforts of India did not see fruition as the OIC-CFM has once again extended the unwavering support of the Muslim Ummah for the right to self-determination of the Kashmiri people\nThe President said that the Foreign Minister of Saudi Arabia H.H. Faisal bin Farhan Al-Saud as the Chair of the Islamic Summit also clearly stated in his inaugural speech that peace in South Asia is not possible without the resolution of the Kashmir issue. He said that this clear and bold message by the Saudi, Foreign Minister quashed all rumours that the Saudi government was not serious about the Kashmir issue.\n“We hope that Gulf States that enjoy close economic ties with India will use their clout to influence India into ending its tyrannical occupation in Indian Occupied Jammu and Kashmir (IOJK)”, he said.\nThe President said that the people of Kashmir have positively received the statements of US President-elect Joe Biden and US Vice President-elect Kamala Harris in support to the right to self-determination of the Kashmiris. He said that even if the US leadership does not directly engage in the Kashmiri peace process, it should, as a permanent member of the UN Security Council, take up this dispute at the Security Council and bring an end to the gross human rights violations taking place in IOJK.\nMasood Khan said that in people are being murdered, incarcerated, maimed, disappeared, deprived of livelihood; in short, genocide is taking place there and it is the Biden administration’s responsibility to stop this tyranny as any dereliction from this obligation would lead to anarchy and the world will have to suffer from the dire consequences of fascism in the guise of religious supremacy being peddled under the Hindutva doctrine.\nPresident Masood Khan said that Palestine, like Kashmir, is a the core issue of the Muslim Ummah and Pakistan in its principled stance for the right of a separate Palestinian State has always championed the just cause of the Palestinian people. “Our stance on not recognizing Israel is evidently based on public sentiment, the rule of international law and preservation of human rights. Pakistan’s position has not changed since the time of Quaid-e-Azam”.\nPresident of Azad Kashmir added that Israel had under the Balfour declaration occupied the land of the indigenous Palestinians over a period of a century and India is doing the same in IIOJK but at an unprecedented pace. “India has taken a page out of the Israeli occupation playbook. The model of illegal settlements seen in Palestine is being replicated by India in IIOJK and here too they are also permanently transforming the demography”.\nThe President said that the people of Kashmir will not give up their legitimate and peaceful struggle for their liberation from Indian occupation. Masood Khan said that unless we transform Kashmir into an international people’s movement, in the same manner when international public opinion was mobilised against Apartheid or the Vietnam War, the UN will not act and instead would continue with its hands-off approach in this matter. “UN is not going to give us Kashmir on a silver platter; Kashmir’s freedom will materialize only through our efforts and freedom-loving people around the globe”, he said.",
  "retrievedAt": "2025-08-11T20:07:23.538Z"
}
