{
  "title": "Planning ministry launches National Population Situation Analysis",
  "link": "https://www.app.com.pk/national/planning-ministry-launches-national-population-situation-analysis/",
  "date_published": "2020-12-09T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP): The ministry of planning and development Wednesday launched National Population Situation Analysis (PSA) here in collaboration with the United Nations Population Fund (UNFPA).\nThe event in this regard was held here which was attended by among others President Dr Arif Alvi and Minister for Planning Development and Special Initiatives Asad Umar.\nAsad Umar, on the occasion, said the population control in Pakistan should have gained momentum much earlier due to which Pakistan became the fifth most populous country in the region having the highest population growth rate.\nThe minister said that one of the key areas of PTI manifesto was to tackle the population growth challenge.\nThe government was committed to deploy efforts to reduce the population growth rate for the health of mothers, children and families and the prosperity of Pakistan by reducing the impending burden on its resources.\nThe PTI manifesto, he said seeks to ensure the adequate availability of contraception to all married women of reproductive age (MWRA) through the population welfare and healthcare network of Basic Health Units, Lady Health Workers and Community Midwives.\nAsad Umar said that they are committed to revitalize national family planning programmes, including providing air-time on national television to promote behavior change and increase uptake and continuation of contraception.\nHe emphasised that there should be inter-provincial harmony on the subject and provincial goals and targets must be aligned to national goals so that we adhere to our commitments made for the United Nations SDGs.\nDr. Faisal Sultan, Special Assistant to Prime Minister on Health said “Pakistan is the fifth most populous country in the world. A comprehensive analysis of the population situation was required, in order to provide the basis for an integrated appraisal of Population and Reproductive Health (RH) dynamics, their linkages, and impacts on poverty, inequality and development. He said that new projects related to mother & Child Health is under preparation for next PSDP”.\nDeputy Chairman, Mohammad Jehanzeb Khan said “The Government of Pakistan under the leadership of the President of Pakistan are fully committed to ensuring a balance population growth.\nThere is a high demand for family planning in the country, lowering maternal and child mortality is a priority that we are working towards.”\nHe said that Pakistan’s total fertility rate is 3.5%, where need for family planning is 17.3% and the contraceptive prevalence rate is 34.2% and the inter-censal population growth rate is 2.4% which is twice the annual growth rate for Southern Asian Countries and about double the growth rates for countries such as Bangladesh, India, India and Iran.\nLina Mousa, Representative, UNFPA Pakistan shared in her remarks, “In terms of its depth and scope the PSA covers all aspects related to socio-economic and human development.\nIt is one of the most extensive PSA which will generate wealth of data providing strategic information for population and development planning and programming in Pakistan, especially at this critical time challenged by COVID 19.”",
  "retrievedAt": "2025-08-11T20:07:18.747Z"
}
