{
  "title": "PM’s historic package for Sialkot city will lead to economic development: Usman Dar",
  "link": "https://www.app.com.pk/national/pms-historic-package-for-sialkot-city-will-lead-to-economic-development-usman-dar/",
  "date_published": "2020-12-09T06:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 9 (APP): Special Assistant to Prime Minister on Youth Affairs Usman Dar Wednesday said that laying the foundation stone of five mega development projects in Sialkot is ‘just a beginning’ as this package will lead to further economic development of the city.\nTalking to a private news channel, he said the up-gradation and beautification of Sialkot city was the top priority of his government as Sialkot was an important economic hub and totally export-oriented city of the country.\nHe said under the vision 2050, PM was announcing five mega projects for Sialkot city, adding, a water filtration plant project while five big green parks also included in the PM’s development package.\nHe said Sialkot transformation plan was aimed at addressing the city’s long-standing problems such as “Clean drinking water, traffic system, sewerage systems, poor waste disposal, water supply and other basic problems of masses.\nDar said that completion of these projects would directly benefit to millions of residents of Iqbal city which would truly prove to be a game changer.\nHe said that PM Khan Sialkot is going to announce a Rs17billion development package for the city, adding, the first aircraft of the newly established private airline, AirSial would also landed at the Sialkot International airport which would further increase the opportunities of employment for locals.\nHe emphasized that we need to bring more Airlines in the country which would inject healthy competition among local airlines.\nSpeaking over Kamyab Jawan Program, Usman Dar said, “Rs15 billion would be distributed among deserving youth in the next six months while Rs2 billion had already been distributed under the scheme.”\nHe said making the country’s youth self-sufficient was the vision of Prime Minister Imran Khan to help them become useful part of a developed Pakistan.\nHe said providing opportunities to skilled and professional youth would ensure a corruption-free and strong Pakistan, adding,\nPrime Minister Imran Khan will also distribute cheques amongst the successful applicants for Youth Entrepreneurship Scheme under the Prime Minister’s Kamyab Jawan Programme (PMKJP).\nTalking about Tiger Force, he lauded the performance of the prime minister’s Tiger Force volunteers and said they were playing an active role in ensuring implementation on Standard Operating Procedures (SOPs) to prevent spread of the coronavirus.\nHe said the pandemic had badly affected the world economy, including Pakistan, but the PTI government was making all-out efforts to provide relief to the citizens despite financial constraints.\nHe also criticized Opposition for their ill manner behavior and said the opposition has no regard for the lives of the common man.\nHe said people must avoid public places where SOPs are not followed, adding ,\nthe common man has nothing to do with these rallies as people have already rejected the narrative of the opposition.",
  "retrievedAt": "2025-08-11T20:07:26.042Z"
}
