{
  "title": "Asad Umar warns of locking down more sectors if SOPs ignored",
  "link": "https://www.app.com.pk/national/asad-umar-warns-of-locking-down-more-sectors-if-sops-not-followed/",
  "date_published": "2020-12-09T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 9 (APP): Minister for Planning, Development, and Special Initiatives Asad Umar Wednesday once again warned that the government would have to close down more sectors amid rising cases of COVID-19 and non-compliance of the SOPs.\nAddressing media conference after chairing the National Command and Operation Center (NCOC) meeting here, the minister said that the nation was not observing SOPs as much as it did during the first wave of the pandemic.\n“If we will not take it (the pandemic) serious, I fear that after a couple weeks, the situation can become so worst that we will have no other choice but to close down more sectors.”\n“The most dangerous move is that some political parties are insisting to arrange big public gatherings despite ban on assembly of more than 300 people at one place,” he said.\nHe said Pakistan had successfully fought against the coronavirus during its first wave with the efforts of the armed forces, the government, civil administration, media, Ulemas and with greater contribution of the general public.\nAsad Umar pointed out that the world institutions including World Economic Forum and United Nations had praised the Pakistan government policies during COVID-19.\nBut, he said this was not the only responsibility of NCOC to look back and see what had happened in the past but the prime responsibility was that “we should look forward” as the NCOC has been mandated to safeguard the nation’s health and employment.\nBy the mid of October, the minister maintained that the NCOC presented recommendations before the National Coordination Committee (NCC) meeting. By mid of October, the positivity ratio was only two percent however by last week it increased to 8.7 percent.\nHe said by that week, only 8 people were dying daily, however the number of daily casualties due to COVID-19 had increased to abut 60 people per day. Similarly, he said the ratio of COVID patients being admitted and on oxygen had also increased by 400 percent.\nThe minister said that during the second wave, the government had to announce early winter vacation of education institutions which restricted movement of over 50 million students and two million teachers.\n“The government knows that the businesses related to education, marriages, and hotels got hampered but the decision was inevitable to stop further spread of Corona virus.\nHe informed that keeping in view the loss of businesses of selected sectors, the government was also mulling over preparing a relief package for such sectors.\nMinister for Planning, Development and Special Initiatives Asad Umar Wednesday again warned of locking down more sectors amid rising cases of COVID-19 in the country if the people continued non-compliance of the instructions issued by the government to restrict spread of the deadly virus.\nAddressing a news conference after chairing the meeting of National Command and Operation Center (NCOC) here, the minister said the nation was not properly observing the anti-COVID standard operating procedures (SOPs) like it had done during the first wave of the pandemic.\nHe said unfortunately, some political parties had adopted a dangerous past by persistently holding big public gatherings despite a ban on the assembly of more than 300 people at one place.\nSuch a move on their part would prove to be fatal as it would further spread the pandemic.\nHow the people could take the government’s instructions serious as their political leaders were terming the same tactics to pressurize its opponents. They were misleading the people that there was no threat of COVID-19, he added.\n“This is very dangerous. Unlike the common message conveyed to the people by all the sectors and political parties during the first wave to observe the SOPs, this time the situation.”\nThe opposition parties should show maturity keeping in view the severity of the deadly virus, he stressed.\nPakistan, he said, was a democratic country. The democratic system was structured to better the people’s lives, by establishing peace, and bringing prosperity and economic development in the society, but on the contrary the opposition was following undemocratic norms, putting the people’s lives and property at risk through their irrational act, he added.\nHe said the government had successfully fought the coronavirus during its first wave with the joint efforts of armed forces, civil administration, media and Ulema, and the general public had also contributed greatly.\nAsad Umar pointed out that the world institutions, including the World Economic Forum and the United Nations, had praised the policies adopted by the Pakistani government during the COVID-19.\nThe chief economist of former US President Barack Obama had said that the United States saved over one trillion dollars, had it followed he policies adopted by Pakistan, he added.\nHe, however, stressed that now the prime responsibility of NCOC was to look forward as it was mandated to safeguard the people’s health and their livelihoods.\nBy the mid of October, he said, the NCOC presented its recommendations to the National Coordination Committee (NCC), with the warning that due to non-implementation of SOPs, the COVID positivity ratio might rise in future.\nAt that time, the corona positivity ratio was 2 percent with eight people dying daily, which had increased to 8.7 percent 60 deaths last week, he added.\nSimilarly, he said, the ratio of COVID patients being admitted and on oxygen had also increased by 400 percent.\nThe minister observed that though the implementation of NCOC decisions had been started to contain the loss during the second wave, but unfortunately it was not like that of the first wave of the pandemic.\nThe government, he said, had to announce early winter vacation for educational institutions, restricting over 50 million students and two million teachers to their homes.\nSimilarly, indoor marriages were also banned, allowing gathering of not more than 300 people in outdoor events.\nThe businesses related to education, marriages, and hotels, he said, were affected due to such decisions, which, however, were inevitable to stop further spread of the coronavirus.\nThat was why, the government was also mulling to announce a relief package for such sectors, he added.",
  "retrievedAt": "2025-08-11T20:07:24.889Z"
}
