{
  "title": "Industrialization a must for poverty alleviation, inclusive development: PM",
  "link": "https://www.app.com.pk/national/industrialization-a-must-for-poverty-alleviation-inclusive-development-pm/",
  "date_published": "2020-12-09T09:40:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Dec 9 (APP): Prime Minister Imran Khan Wednesday said that his government was striving to revive industrialization as the only method to alleviate poverty and achieve inclusive growth through wealth creation.\n“This is the first government which has a policy to industrialize and incentivize (industry) by bringing ease of doing business to increase investment and thus alleviate poverty and uplift the backward areas,” the prime minister said addressing the business community after inauguration of AirSial, the private airline launched by Sialkot’s business community.\nFederal Ministers Hammad Azhar and Ghulam Sarwar, Advisor to PM Abdul Razzak Dawood, Chief Minister of Punjab Sardar Usman Buzdar and provincial cabinet members attended the event.\nThe prime minister, who earlier cut the ribbon to inaugurate the airline, said the industrialization would help uplift the neglected areas like Gilgit Baltistan, merged tribal areas and South Punjab.\nExemplifying China for steering 700 million people out of poverty through industrialization, the prime minister said the country was now executing China Pakistan Economic Corridor to connect its less-developed areas with sea through Gwadar for their uplift.\nHe believed that no country could prosper without inclusive and equal growth.\nCalling Sialkot’s business community as “most vibrant” for launching their own airline after an airport and development of roads, the prime minster assured them to resolve all of their issues related to Federal Board of Revenue, State Bank and utility companies within single meeting scheduled after two weeks.\nHe congratulated the business community for the new airline which he hoped would create a competitive atmosphere for PIA to bring efficiency in services.\n“This is a tremendous initiative. The business community knows how to run the airport and airline. It will benefit Sialkot and Pakistan in every aspect,” he hoped.\nThe prime minister told the business community that the government had faced difficult times during COVID-19 but successfully navigated through it which was also acknowledged by the World Health Organization.\nHowever, he said the opposition which had earlier been advocating India-like blanket lockdown during first spike, was now holding public gatherings despite sharp surge in second wave of cases.\nReiterating his call for observing precautions like face masks and social distancing, the prime minister said both the countries and economy could be saved only by adhering to SOPs.\nThe prime minister appreciated Industries Minister Hammad Azhar and Commerce Advisor Dawood for maintaining good interaction with business community and conveying their issues to him.\nHe said the encouragement and support to Sialkot’s business community was in country’s interest and the government would fully assist the areas including Wazirabad, Gujrat and Sialkot to boost the productivity and exports.\nMoreover, he also reiterated his government’s resolve to support SMEs for contributing to most of the jobs.\nThe prime minister also announced to set up a Haripur-like university to in Sialkot too, to train youth in engineering, technology and artificial intelligence for coping with the industry’s needs.\nHe said the PTI government was about to introduce a local government system after April to make the cities directly elect their mayors to help resolve their municipal issues independently on the models of New York, Paris and London without the intervention of provincial government.\nHe hoped that the business community which could run airport and airline and construct roads would get an opportunity to administer their city effectively.",
  "retrievedAt": "2025-08-11T20:07:25.312Z"
}
