{
  "title": "World’s coral reefs crossing survival limit, experts warn - World - DAWN.COM",
  "author": null,
  "content": "PARIS: The world’s tropical coral reefs have almost certainly crossed a point of no return as oceans warm beyond a level most cannot survive, a major scientific report announced on Monday.\n\nIt is the first time scientists have declared that Earth has likely reached a so-called “tipping point” — a shift that could trigger massive and often permanent changes in the natural world.\n\n“Sadly, we’re now almost certain that we crossed one of those tipping points for warm water or tropical coral reefs,” report lead Tim Lenton, a climate and Earth system scientist at the University of Exeter, said.\n\nThis conclusion was supported by real-world observations of “unprecedented” coral death across tropical reefs since the first comprehensive assessment of tipping points science was published in 2023, the authors said.\n\nIn the intervening years, ocean temperatures have soared to historic highs, and the biggest and most intense coral bleaching episode ever witnessed has spread to more than 80 per cent of the world’s reefs.\n\nUnderstanding of tipping points has improved since the last report, its authors said, allowing for greater confidence in estimating when one might spark a domino effect of catastrophic and often irreversible disasters.\n\nScientists now believe that even at lower levels of global warming than previously thought, the Amazon rainforest could tip into an unrecognisable state, and ice sheets from Greenland to West Antarctica could collapse.\n\n‘Unprecedented dieback’\n\nFor coral reefs, profound and lasting changes are already in motion.\n\n“Already at 1.4°C of global warming, warm water coral reefs are crossing their thermal tipping point and experiencing unprecedented dieback,” said the report by 160 scientists from dozens of global research institutions.\n\nThe global scientific consensus is that most coral reefs would perish at warming of 1.5°C above preindustrial levels—a threshold just years away.\n\nWhen stressed in hotter ocean waters, corals expel the microscopic algae that provide their distinct colour and food source.\n\nUnless ocean temperatures retu­­rn to more tolerable levels, bleached corals simply cannot recover and eventually die of starvation.\n\nSince 2023, marine scientists have reported coral mortality on a scale never seen before, with reefs turning ghostly white across the Pacific, Indian and Atlantic oceans.\n\n“I am afraid their response confirms that we can no longer talk about tipping points as a future risk,” Lenton said.\n\nRather than disappear completely, scientists say reefs will evolve into less diverse ecosystems as they are overtaken by algae, sponges, and other simpler organisms better able to withstand hotter oceans.\n\nThese species would come to dominate this new underwater world, and over time, the dead coral skeletons beneath would erode into rubble.\n\nSuch a shift would be disastrous for the hundreds of millions of people whose livelihoods are tied to coral reefs, and the estimated one million species that depend on them.\n\n‘Danger zone’\n\nSome heat-resistant strains of coral may endure longer than others, the authors said, but ultimately the only response is to stop adding more planet-warming greenhouse gases into the atmosphere.\n\nExceeding 1.5°C “puts the world in a greater danger zone of escalating risk of further damaging tipping points”, Lenton said, including the collapse of vital ocean currents that could have “catastrophic” knock-on impacts.\n\nScientists also warned that tipping points in the Amazon were closer than previously thought, and “widespread dieback” and large-scale forest degradation were a risk even below 2°C of global warming.\n\nThat finding will be keenly felt by Brazil, which on Monday is hosting climate ministers in Brasilia ahead of next month’s UN COP30 conference in Belem on the edge of the Amazon.\n\nIn good news — the exponential uptake of solar power and electric vehicles were two examples of “positive” tipping points where momentum can accelerate for the better, said Lenton.\n\n“It gives us agency back, policymakers included, to make some tangible difference, where sometimes the output from our actions is sometimes disproportionately good,” he said.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68edaa2c3cf04.jpg",
  "retrievedAt": "2025-10-16T23:36:33.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948756/worlds-coral-reefs-crossing-survival-limit-experts-warn",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:04:51.000Z"
}
