{
  "title": "Farm lending slumps as finance minister warns of ‘alarming’ crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Farmers face cash-flow crunch; repayments delayed by price volatility\n• ZTBL lending nearly halves in two years to Rs39.66bn\n• Aurangzeb blames farmers for ‘inefficient practices’\n\nISLAMABAD: Finance Mi­­nister Muhammad Aurangzeb has painted an alarming picture of the country’s agriculture sector — the backbone of the economy — citing crop failures, low yields, farmer migration to cities and compounding climate and economic crises.\n\n“Farmers face cash-flow issues due to crop failures, low yields and open-market price fluctuations, leading to delayed repayments,” Mr Aurangzeb said in a written reply to parliament.\n\nHe stressed that credit disbursement to the farm sector by the frontline agriculture support institution — Zarai Taraqiati Bank Limited (ZTBL) — plunged almost 54 per cent in two years to just Rs39.66 billion. The figure was Rs85.563bn in 2023 and Rs61.362bn in 2024.\n\nAttributing the aggravating situation in the agriculture sector to climate and economic crises, the minister said that floods, droughts or pest attacks destroy crops, leaving farmers unable to pay loans while economic challenges like inflation increase input costs (seeds and fertilisers), reducing farmers’ profit margin.\n\nMr Aurangzeb also blamed the farming community for inefficient practices, stressing that the low productivity was caused by outdated techniques, poor seeds and inadequate fertiliser use besides limited knowledge of modern agricultural practices.\n\nOn top of that, socio-economic challenges were quoted as another reason for low credit disbursement by the ZTBL. This included poverty and dependence on agriculture as the sole income source, migration of farmers to cities leaving land uncultivated and high health emergencies or family issues consuming available funds.\n\nThe finance minister volunteered the detailed report on the agriculture sector in response to a question from Senator Syed Masroor Ahsan, who wanted to know the status of credit disbursement by ZTBL in Punjab and Sindh over the past three years along with the recovery progress. Senator Ahsan also asked if recovery targets against these disbursements were achieved and, if not, what were the reasons behind it.\n\nMr Aurangzeb reported that ZTBL’s credit disbursement had declined by 53pc in Punjab and 59pc in Sindh — the country’s top two agriculture and food baskets.\n\nIn Punjab, credit to the farm sector in 2023 amounted to Rs75.167bn, followed by Rs61.362bn in 2024, down by more than 18pc. It dropped further to Rs35.43bn in 2025, he said.\n\nIn Sindh, the farm credit amounted to Rs10.4bn in 2023 and fell to Rs7.22bn in 2024, down 30.6pc. It further decreased to Rs4.23bn in 2025.\n\nThe report said that the outstanding loan portfolio moved in a narrow band in both provinces. For example, total outstanding loans, including non-performing loans and charged-off portfolio (default over three years), in Sindh stood at Rs32bn in 2023, which slightly moved up to Rs32.76bn in 2024 and Rs32.96bn in 2025.\n\nIn Punjab, the outstanding portfolio amounted to Rs147.7bn in 2023, rose to Rs154.2bn in 2024 and came down to Rs150.1bn in 2025.\n\nIt said that the overall recovery rate against the target in Punjab stood at 77pc in 2023, which jumped to 82pc in 2024 but dropped again to 78pc in 2025.\n\nConversely, in Sindh, the recovery rate against the target was reported at 60pc in 2023, which fell to 57pc in 2024 and remained there in 2025 as well.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/140906035293bc9.webp",
  "retrievedAt": "2025-10-16T23:36:34.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948770/farm-lending-slumps-as-finance-minister-warns-of-alarming-crisis",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:04:35.000Z"
}
