{
  "title": "Pakistan cricketer Shawaal Zulfiqar’s father passes away - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan women’s cricket team player Shawaal Zulfiqar’s father passed away in Sialkot, the Pakistan Cricket Board said on Tuesday.\n\nShawaal is currently in Sri Lanka, representing the national side at the ICC Women’s World Cup.\n\n“Pakistan women’s cricket team batter Shawaal Zulfiqar’s father, Zulfiqar Ahmad, has passed away,” the PCB said in a statement.\n\nHe was laid to rest in a suburban area of Sialkot, the statement added.\n\nTeammates, coaching staff, and management have expressed their condolences to Shawaal on the sad demise of her father, the PCB said.\n\nThey extended heartfelt sympathy and offered their prayers for the departed soul, the statement added.\n\nShawaal will remain with the squad, the PCB confirmed to Dawn.com.\n\nTeam-mate Syed Aroob Shah also conveyed the team’s condolences at the pre-match press conference ahead of Pakistan’s match against England on Wednesday.\n\n“First of all, I would like to say that our teammate Shawaal Zulfiqar’s father passed away yesterday, and as a team, we express our condolences to her and her family on this irreparable loss. It’s very sad news for us,” the all-rounder said at the onset of the press conference.\n\nPCB Chairperson Mohsin Naqvi also conveyed his grief and expressed his condolences to Shawaal and her family.\n\n“Chairman PCB Mohsin Naqvi expresses heartfelt sympathy and condolences to Shawal Zulfiqar and the bereaved family,” the PCB said on X.\n\nLast week‘s defeat against Australia left their knockout hopes hanging by a thread.\n\nA superb century from Beth Mooney dragged defending champions Australia back from the brink of disaster after being 76-7 before they completed a crushing 107-run win over the Green Shirts.\n\nThe 20-year-old batter played the practice matches for the World Cup in Colombo but hasn’t featured in Pakistan’s World Cup campaign so far.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:36:17.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948861/pakistan-cricketer-shawaal-zulfiqars-father-passes-away",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T09:18:06.000Z"
}
