{
  "title": "Americans feel the squeeze as government gridlock grinds on - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The US government shutdown dragged into a third week on Monday, with Congress gridlocked in a clash over spending and no resolution in sight to a crisis that has already cost thousands of jobs.\n\nWith hundreds of thousands of federal employees already on enforced leave, President Donald Trump is following through on threats to take a hatchet to the workforce to pressure Democrats to agree to Republican funding demands.\n\nTrump has vowed to find a way to pay troops due to go without their paychecks for the first time, although the uncertainty is already leading to long lines of men and women in uniform at food banks.\n\nAnd Trump has warned that continued refusal by Democrats to support a House-passed resolution to fund the government through late November would result in mass layoffs targeting workers deemed aligned with the opposition party.\n\nUncertainty already leading to long lines of men and women in uniform at food banks\n\n“We’re ending some programmes that we don’t want — they happen to be Democrat-sponsored programmes,” Trump told reporters. “But we’re ending some programmes that we never wanted and we’re probably not going to allow them to come back.”\n\nVice President JD Vance told Fox News at the weekend that Democrats could expect more pain ahead if they did not cave.\n\nCourt documents filed by the Department of Justice show more than 4,000 employees were fired on Friday, with the US Treasury and health, education and housing departments hardest hit.\n\nThe reductions in the workforce are part of a campaign of threats on multiple fronts to amp up pressure on Democrats to back Republican moves to reopen the government. But Chuck Schumer and Hakeem Jeffries, the Democratic leaders in the Senate and House respectively, have dismissed the threat, predicting that layoffs will be reversed in court.\n\nSticking point\n\nAbout 1.3 million active-duty military personnel are set to miss their first paycheck on Wednesday. The Stronghold Food Pantry, a charity supporting military families, told Time magazine it had seen an “unprecedented increase in need since the shutdown began”.\n\nTrump announced on Saturday that he would direct Secretary of Defence Pete Hegseth to use “all available funds to get our Troops PAID” by Wednesday.\n\nPentagon officials are reportedly diverting $8bn in research and development funding, and while it is not clear that the move would be lawful, it has received little pushback from either party.\n\nRepublican Speaker Mike Johnson — who has kept the House on recess since Sept 19 — is resisting pressure to bring back members to vote on a standalone bill to release military salaries for the duration of the shutdown.\n\n“We have voted so many times to pay the troops. We have already done it. We did it in the House three weeks ago,” Johnson told reporters. “The ball is in the court of Senate Democrats right now. That’s it.”\n\nThe key sticking point is a Republican refusal to agree to Democratic demands for language in its government funding resolution to extend expiring health insurance subsidies for 24m Americans.\n\nCongress was out on Monday for a federal holiday — guaranteeing that the shutdown would enter a 14th day — and while Trump’s vow to ensure military pay was welcomed, it also eased pressure for either side to end the stalemate. The Senate was set to return on Tuesday to take an eighth swing at reopening the government — with little hope of a different outcome from previous votes.\n\nAirports are seeing increasing delays as the shutdown drags on, with Transportation Security Administration workers calling in sick rather than working without pay. The Smithsonian Institution has also closed its National Zoo and museums as of Sunday.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/14073107705e444.webp",
  "retrievedAt": "2025-10-16T23:36:33.465Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948766/americans-feel-the-squeeze-as-government-gridlock-grinds-on",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:04:52.000Z"
}
