{
  "title": "Gill wins first series as India captain with 2-0 West Indies sweep - Sport - DAWN.COM",
  "author": null,
  "content": "Shubman Gill on Tuesday won his first Test series since becoming India captain as his side beat the West Indies by seven wickets at Delhi’s Arun Jaitley Stadium for a 2-0 sweep.\n\nChasing 121 for victory in the second Test, India resumed on day five at 63-1 and reached their target in the first session with KL Rahul unbeaten on 58.\n\nWest Indies captain Roston Chase struck twice with his off-spin to send back Sai Sudharsan for 39 and Gill, who made 13.\n\nRahul hit the winning four as India reached 124-3 after a spirited fightback from the West Indies, who made 390 in their second innings with centuries from John Campbell and Shai Hope after being forced to follow on.\n\nIndia are a team in transition under 26-year-old Gill, after the retirements of Rohit Sharma and Virat Kohli.\n\nThey won the opening Test by an innings and 140 runs after a thrilling 2-2 draw in their five-Test series in England from June to August, Gill’s first in charge.\n\n“It’s a really big honour and I would say I’m getting used to it,” Gill said at the post-match presentation.\n\n“Managing all the players and leading this team is a great honour.”\n\nIndia head coach Gautam Gambhir said the young leader was marching on after having passed his “toughest test as a Test captain” in England.\n\n“No one has done him a favour by appointing him the Test and one-day captain,” the former batsman told reporters.\n\n“I think he deserves every bit of it. I think he’s worked hard, and he ticks all the boxes.”\n\nGill has been in the form of his life after being named Test captain in May, scoring 754 runs in the five England Tests and then a half-century and a hundred in the two West Indies matches.\n\nIndia’s left-arm wrist spinner Kuldeep Yadav’s match haul of eight wickets, including 5-82 in the first West Indies innings, earned him the player of the match accolade.\n\nKuldeep claimed 12 wickets in the series and pace bowler Mohammed Siraj took 10 to be India’s leading wicket-taker this year with 37 wickets in eight matches.\n\nIndia’s batsmen set up the victory as Yashasvi Jaiswal top-scored with 175 in India’s mammoth first-innings total of 518-5 declared. Gill made an unbeaten 129.\n\nThe West Indies have endured years of decline and, despite the late fight shown in Delhi, suffered their second successive Test sweep after a 3-0 home series defeat to Australia.\n\nThere were some positives to take from the series.\n\nLeft-handed opener Campbell made 115 and Hope 103 in a 177-run stand for the third wicket on Monday as India’s bowlers tired on a slow pitch offering little help.\n\n“It’s just for us to use this last Test match as a stepping stone and a confidence booster going into the upcoming series,” Chase said of West Indies’ next tour, to New Zealand in November.\n\n“We just have to keep improving as much as we can from here.” India enforced the follow-on after they bowled out the West Indies for 248, a deficit of 270 from the hosts’ first innings.\n\nThe visitors sprung into life in their second innings through Campbell and Hope, with Justin Greaves and Jayden Seales also offering tail-end resistance.\n\nGreaves with an unbeaten 50 and Seales, 32, put on 79 runs for the final wicket to frustrate India and force play into the fifth day.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/14122818eba989f.webp",
  "retrievedAt": "2025-10-16T23:36:18.582Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948851/gill-wins-first-series-as-india-captain-with-2-0-west-indies-sweep",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T07:29:39.000Z"
}
