{
  "title": "Punjab finalises study for elevated Murree-Islamabad glass train project - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Punjab government has completed a feasibility study of monorail project to connect Islamabad with Murree as Punjab Chief Minister Maryam Nawaz wants the project to start at the earliest.\n\nIf all goes as planned, work on the 40km track of the said project will start soon. The government of Punjab initially wanted to start the project from near Lake View Park to Pindi Point Murree in the first phase.\n\nHowever, sources in the Punjab government told Dawn the provincial government now wanted to connect the proposed rail track with the Islamabad International Airport.\n\n“Yes, our feasibility has been completed and soon we will go for the procurement process to lay tracks,” said an official of the provincial government, adding that a major portion of the track will be elevated.\n\nTrack laying to start soon; govt plans to link Murree monorail with Islamabad International Airport\n\nHe said the Punjab chief minister had been monitoring progress of the proposed project and wanted to get it started as soon as possible, adding that recently, the chief minister, while addressing in Murree, also announced this public welfare project.\n\nThe official said the track would pass through somewhere near to old Murree Road.\n\nTo a query about the elevation and hilly terrain of Murree, the official said this rail project was very much feasible, as Murree was situated at a height of over 2,200 metres and during the British era, a rail link was laid to Shimla, India, back in 1906, which was situated at a height of 2,205 metres.\n\n“British rulers laid rail tracks in Shimla more than a century ago, and some people are still showing concerns about Murree,” he said, adding that the project could be completed within two years.\n\nHe said that for connecting this project with Islamabad Airport, a team of the Punjab government, headed by Chief Minister’s Advisor Shahid Ashraf Tarar and his team, held a meeting with CDA officers here at CDA headquarters.\n\nAfter getting a briefing from the team, the official of the provincial government said that a representative of the Punjab government discussed various options with CDA for connecting this project with Airport.\n\n“Our team informed CDA that the right of way of Srinagar Highway is already available; therefore, CDA can utilise it easily from the Airport to Peshawar Mor. Then a track can be laid from Peshawar Mor to the proposed Lake View site,” the official stated. He said that during the meeting, CDA officials offered that the monorail should be linked with Margalla railway stations or Rawat railway station.\n\n“Actually, we want to get the monorial/glass train link with the Airport to help public, tourists and foreign delegations to reach Islamabad city and Murree in shortest possible time,” he said and added that no final decision was made in the meeting, however, it was decided that Punjab Government will help CDA in getting pre-feasibility study done from Airport to Lake View. “I was told that this was an initial meeting and in future more meetings will be held as both organisations [CDA and Punjab Government] want to see completion of this monorial project completed at the earliest.“\n\nIt is relevant to note here that, in 2015, the PML-N government headed by Nawaz Sharif got a feasibility study conducted for a rail link from Rawalpindi to Muzaffarabad. In that feasibility, there was no direct link for Murree city’s prime location like Pindi and Kashmir Points, and that proposal was limited to Bastal Morr, Bhurban and then Muzaffarabad onward. However, in the new feasibility, the project is limited to Pindi Point, Murree.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:36:22.655Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948732/punjab-finalises-study-for-elevated-murree-islamabad-glass-train-project",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:05:07.000Z"
}
