{
  "title": "Senators flag procurement irregularities - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary panel on Monday raised serious fiduciary concerns over the procurement of several multi-billion-rupee foreign-funded transport and energy projects, particularly in Sindh and Punjab.\n\nA meeting of the Senate Standing Committee on Economic Affairs, presided over by Senator Saifullah Abro, reviewed the performance of the National Highway Authority (NHA), Economic Affairs Division (EAD) and other relevant departments regarding the ongoing projects financed by the Asian Development Bank (ADB) and World Bank.\n\nWhile examining the ADB-financed Central Asia Regional Economic Cooperation (CAREC) tranches I, II, and III — covering the Rajanpur-Dera Ghazi Khan-Dera Ismail Khan corridor — the committee expressed serious reservations over irregularities in procurement and evaluation processes.\n\nSenator Abro described the case as “one of the most significant procurement controversies in recent years”, noting that despite repeated directives, local companies had failed to furnish complete documentation to the NHA and the committee.\n\nVoice concern over delays, poor oversight of foreign-funded projects in Sindh and Punjab\n\nThe committee observed that the “mis-procurement issue, involving an estimated Rs172 billion, required immediate corrective action,” and directed that all correspondence with the ADB, including the letter issued by the PM Office, be shared with the committee. It also called for holding the responsible officials accountable.\n\nSenator Abro regretted that despite the prime minister’s instruction for an inquiry within seven days, no tangible progress had been reported. The NHA management informed the committee that the mis-procurement matter had not yet been finalised as ADB’s concurrence was still awaited.\n\nThe committee directed the NHA to share its findings with the ADB within the next few days and not to wait for approval of revised estimates by the Executive Committee of the National Economic Council. It also instructed that issues related to land acquisition, project delays, and cost escalations under tranche-III be resolved to ensure completion by June 2026.\n\nThe meeting was also briefed by the managing director of the Public Procurement Regulatory Authority (PPRA) on the implementation of the e-Pak Acquisition and Disposal System (EPADS). The panel appreciated the adoption of the system for transparent bidding in Punjab and said Balochistan should also adopt the system to prevent manipulation in the tendering process.\n\nExpressing concern over irregularities in Sindh’s tendering practices, the committee chairman noted the poor response to PPRA’s repeated letters to the Sindh Public Procurement Regulatory Authority (SPPRA) seeking training of its officers on EPADS.\n\nThe committee was informed that most major departments in Sindh had already implemented EPADS, except for the irrigation and works and services departments, which had deliberately avoided adopting the system.\n\nIt was reported that SPPRA initially issued a letter allowing the manual tendering process to continue until May 30, 2025, before transitioning to EPADS. However, the committee expressed surprise that SPPRA later issued another letter on Sept 17, exempting these two departments and extending the manual tendering deadline to Oct 21, even as Rs30bn worth of projects were set to be tendered by Oct 20.\n\nSenator Abro suggested referring the matter to the FIA for investigation.\n\nThe meeting also reviewed the WB-funded Sindh Solar Energy Project (SSEP) and ADB-financed Sindh road sector projects. The committee expressed serious concern over procedural lapses and verification gaps in both initiatives.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/14082410ddcc9c1.webp",
  "retrievedAt": "2025-10-16T23:36:20.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948794",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:31:45.000Z"
}
