{
  "title": "Pakistan briefly opens Chaman border to let Afghan refugees return to their homeland - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Pakistan opened the border with Afghanistan at Chaman on Monday for some time for repatriation of hundreds of Afghan refugees who were living illegally in various towns and cities of Balochistan.\n\nOfficials in Chaman said that a large number of Afghan refugees including, women and children, who arrived in Chaman for their return to Afghanistan, were stranded at the border after Pakistani authorities closed the border with the neighbouring country and shut the Friendship Gate following armed clashes between Pakistan and Afghan troops.\n\nThe Chaman administration and security officials decided to open the border for some time on humanitarian grounds to let Afghan families cross into Afghanistan.\n\n“We opened the Friendship Gate at around 3 pm only for Afghan refugees to go back to their country,” the Deputy Commissioner of Chaman, Habibullah Bangulzai, said, adding that refugees’ families were sent back to their country with due respect.\n\nThe border remained open for two and a half hours while around 200 Afghan families returned to Afghanistan along with their belongings.\n\n“The border will remain closed for trucks carrying fresh fruit, vegetables, import and export and Afghan transit goods, other transport, pedestrians and passport traveling will remain suspended till further orders,” Mr Bangulzai told Dawn.\n\nMeanwhile, hundreds of trucks and other vehicles were stranded on the border of the two countries.\n\nIn Chaman, loaded trucks and other vehicles were shifted to a parking area. The Afghan refugees’ families which were waiting to go back to Afghanistan were taken to the camps where the local administration provided food, drinking water and other facilities to them.\n\nThe situation at Chaman, Qila Abdullah, Bubandi, Badini, Zhob and Baramcha in Chagai district remained calm and no untoward incident took place. Pakistani security forces are alert in all areas of Balochistan.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/14090014b627431.webp",
  "retrievedAt": "2025-10-16T23:36:34.377Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948771/pakistan-briefly-opens-chaman-border-to-let-afghan-refugees-return-to-their-homeland",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:04:35.000Z"
}
