{
  "title": "Aurangzeb discusses investments with International Finance Corporation, Islamic Development Bank in Washington - Business - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Finance Minister Muhammad Aurangzeb on Monday discussed private sector investment, infrastructure financing, and development cooperation in meetings with senior officials of the International Finance Corporation (IFC) and the Islamic Development Bank (IsDB).\n\nThe discussions focused on accelerating the IFC’s investment plans, including the Reko Diq project, expediting IsDB-funded initiatives such as the M-6 Motorway, and advancing a new framework to deepen economic collaboration with both institutions.\n\nDuring his meeting with Riccardo Puliti, the minister highlighted Pakistan’s improving macroeconomic indicators and the importance of strengthening IFC’s partnership with the country. “We value IFC’s role in scaling up private sector investment, particularly through multi-billion-dollar commitments under the 10-year Country Partnership Framework.”\n\nBoth sides agreed to work toward early financial closure of IFC’s flagship Reko Diq project, and the minister welcomed IFC’s new regional set-up, including a regional office in Islamabad, describing it as a “significant step to deepen collaboration and support sustainable investment in Pakistan.”\n\nIn his meeting with Dr Muhammad Sulaiman Al-Jasser, the finance minister thanked IsDB for its long-standing support to Pakistan and reviewed the current project portfolio. He emphasised the need for faster implementation of ongoing initiatives and welcomed the IsDB Board’s approval of financing for two sections of the M-6 Motorway.\n\nMr Aurangzeb also discussed continued cooperation in Pakistan’s polio eradication efforts and the oil financing facility, noting that both sides had agreed to develop a new Country Engagement Framework to guide future collaboration.\n\nPublished in Dawn, October 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/140831276944db8.webp",
  "retrievedAt": "2025-10-16T23:44:37.768Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948789/aurangzeb-discusses-investments-with-international-finance-corporation-islamic-development-bank-in-washington",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T02:26:52.000Z"
}
