{
  "title": "Levies constable shot dead while guarding polio team in KP’s Swat: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Levies constable deployed for the security of a polio team was killed when unidentified assailants opened fire on him in Khyber Pakhtunkhwa’s Swat district on Tuesday, according to the police.\n\nThe attack comes a day after the government launched a nationwide polio eradication campaign, aiming to vaccinate over 45 million children. A special order was issued for the campaign, with the deployment of 285 police personnel across the country to provide security to the vaccination teams.\n\nAccording to Swat’s District Police Officer (DPO) Muhammad Umar Khan, the martyred Levies constable was performing his duty along with a polio team comprising two female health workers.\n\n“The workers were administering vaccines inside a house while the constable was standing guard outside when he was attacked,” he said. “The assailants fled the scene after the incident.”\n\nKhan added that police and law enforcement officials had reached the area and launched an investigation.\n\n“The area has been cordoned off, and a search operation is underway to arrest the culprits. No anti-state elements will be allowed to sabotage peace in Swat,” he said, adding that those involved in the attack would be brought to justice.\n\nInterior Minister Mohsin Naqvi condemned the incident and paid tribute to the official who was martyred in the shooting. In a statement, he expressed his heartfelt sympathy and condolences to the family of the deceased.\n\n“The assailants who fired on the team that was securing the future of children do not deserve any concession,” the statement quoted him as saying.\n\nKhyber Pakhtunkhwa Governor Faisal Karim Kundi also condemned the “tragic attack”.\n\n“Those who target polio workers strike at the very future of our nation. My deepest condolences to the bereaved family,” he said on X.\n\n“Such cowardly acts will never deter our resolve to protect our children from polio and secure a healthier, stronger Pakistan,” he added.\n\nPrime Minister Shehbaz Sharif also expressed grief over the attack, APP reported.\n\n“The government is committed to the complete eradication of polio from the country. Despite such resistance from terrorists, the anti-polio campaign continues with full momentum and will go on until the disease is completely eradicated,” the PM resolved, as per APP.\n\nPolio vaccinators, who go door-to-door to inoculate children, are frequently targeted by militants, esp­e­cially in KP and Balochistan. In 2024 alone, 20 people were killed and 53 were injured during anti-polio campaigns in KP.\n\nData from September showed that the number of vaccine refusals in KP dropped in the most recent immunisation drive. However, in some areas, such as Lowi Mamund tehsil, residents announced a boycott of the drive.\n\nIn May, a policeman guarding a polio vaccination team was martyred in a gun attack by unidentified assailants in Balochistan’s Noshki district, while another was killed in KP’s Bajaur district in February.\n\nMeanwhile, in August, two more polio cases were reported in KP, bringing the national tally to 23 this year.\n\nNo group has claimed responsibility for the attack, but the banned Tehreek-i-Taliban Pakistan (TTP) had previously claimed similar attacks on polio teams, falsely portraying the inoculation campaigns as a Western conspiracy to sterilise children.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Challenges such as security issues, vaccine hesitancy, and misinformation have slowed the progress of eradication efforts.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/14140707e50307a.webp",
  "retrievedAt": "2025-10-16T23:36:16.803Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948868/levies-constable-shot-dead-while-guarding-polio-team-in-kps-swat-police",
  "dateList": "2025-10-14",
  "date_published": "2025-10-14T09:31:41.000Z"
}
