{
  "title": "Asad Umar urges nation to show discipline in controlling COVID-19",
  "link": "https://www.app.com.pk/national/asad-umar-urges-nation-to-show-discipline-in-controlling-covid-19/",
  "date_published": "2020-06-06T06:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP):Minister for Planning, Development Asad Umar on Saturday urged the nation to show sense of responsibility and discipline as much as to contain the spread of coronavirus as it had shown in the early days of the virus.\n“In the early days of virus, people had shown a great discipline and followed the guidelines to restrain spread of the disease, however I was much disappointed to see clear violation of Standard Operating Procedures (SOPs) issued by the government during last days of Ramazan and during eid celebrations,” he said while addressing media here after chairing a meeting of National Command and Operation Center (NCOC).\nThe minister urged the people to follow the guidelines and show discipline again so that the increasing number of corona cases could be restricted.\n“The most successful and powerful strategy is that all people should bring changes in their lives in order to defeat this pandemic,” he added.\nHe said the people who were not following the SOPs were not only endangering their own life but they were also threatening lives of others.\nHe specifically urged the trade and industries leadership to play role in acting upon the guidelines agreed by them.\nAsad Umar said slowing the pace of the spread of coronavirus was still top most priority of the government and it was acting upon the smart lock down strategy.\n“The basic strategy has not been changed that is to limit the pace of spread of disease to that extent that our health system should not be choked.”\nThe minister informed that administrative actions were being taken against those who were violating the SOPs.\nAt present, he said 884 places across the country were sealed due to corona cases in particular areas and almost 200,000 people were affected by such lockdowns. However, he said troubling 200,000 people at the cost of saving 210 million people was a reasonable step.\nAsad Umar said the disease was not as fatal in Pakistan as it was in the Western countries. In Pakistan, he said only nine people out of one million population had died of COVID-19 whereas in United Kingdom (UK), 600 corona patients were died out of one million population.\nHowever, he said the life of every person was very important and all 1935 people who died so far were definitely dear ones of their family members and nothing could replace them.\nBriefing about 100 days of coronavirus in the country, Asad Umar said on February 26, only 8 laboratories were working and 472 tests were taken on that day.\nToday, he said over 100 labs were working across the country and around 22000 tests were being taken daily. But the testing capacity was even more as the country had a testing capacity of 35000 in a day.\nHe said number of ventilators had also been increased and National Disaster Management Authority had also kept ventilators in reserve which were being provided to the hospitals on demand.\nNumber of masks and protection kits was also increased and today the country was not only meeting local demand but was exporting to other countries.\nHe said direct helpline was also being established to receive complaints about the corona related issues.\nFurther he informed that a mobile Application was being launched to provide people information about availability of healthcare facilities in different hospitals across the country.\nHe specifically asked doctors and other healthcare staff to download this app so that they could provide information to common people.\nHe said in order to mitigate sufferings of those affected by lockdown, the government announced Rs 1200 billion stimulus relief package besides corona relief fund and other several packages by State Bank of Pakistan.\nThe minister specifically thanked workers and doctors of healthcare system who were playing role on front line besides he also thanked administration for working diligently during COVID-19 He said police was the second most important sector after health care who worked hard to enforce SOPs during lock down.\nAsad Umar also thanked the ministry of information and Inter Services Public Relations (ISPR) who were timely conveying the message of the government regarding coronavirus to the people.\nHe said the NCOC team was working day and night since March 27 without any break and their dedication and spirit was commendable.\nOne the occasion, Chief Executive Officer of National Information Technology Board (NITB) Shabahat Shah said that the Pak Negehban Emergency Response mobile Application would be functional from today for hospitals while it would be functional for common people in a couple of days.",
  "retrievedAt": "2025-08-11T19:18:15.730Z"
}
