{
  "title": "NCOC provides 250 additional ventilators to provinces for capacity enhancement",
  "link": "https://www.app.com.pk/national/ncoc-provides-250-additional-ventilators-to-provinces-for-capacity-enhancement/",
  "date_published": "2020-06-05T22:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP):National Command and Operation Centre (NCOC) has provided around 250 additional ventilators to enhance capacity and meet requirements of provinces including Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Islamabad Capital Territory (ICT).\nAccording to NCOC, the allocated 250 additional ventilators had been released over the last one week to overcome challenges in critical care.\nThe distribution of latest issued vents was as under where in Punjab, 72 new ventilators were issued for Faisalabad, Multan Rawalpindi and Lahore. In Sindh, 52 new ventilators were issued for Karachi and Sukkur, 52 in Khyber Pakhtunkhwa (KP) for Peshawar and Abbotabad, while in Balochistan 20 new ventilators were issued for Quetta.\nMeanwhile, in GB the total new ventilators issued were 10, AJK 10, while in ICT, 24 ventilators were provided to PIMS and 24 to Poly Clinic 10.\nAs of today, the total number of hospitals with COVID isolation/ cases management facility were 747, where the total no of beds allocated for COVID patients were 22589, total patients admitted 5060, total no of beds with oxygen facility for COVID patients 5060, and total ventilators available for COVID 1400.\nThe availability of ventilators was as only 32 percent ventilators allocated for COVID occupied till date in Punjab. In Faisalabad, total 150, allocated-for COVID 57, Occupied 5, in Lahore total available 793, allocated for COVID 214, Occupied 77, Multan total available 150, allocated for COVID 18, Occupied 6, Rawalpindi total 229, allocated for COVID 64, Occupied 22, In Sindh Karachi Total 461, allocated for COVID 136, Occupied 62, in Hyderabad total available 50, allocated for COVID 20, Occupied 0, in KP Peshawer total available 171, allocated for covid 75, Occupied 47, Abbotabad total available 25, allocated for covid 12, Occupied 4, in Balochistan Quetta total available 61, allocated for covid 29, Occupied 0, in Islamabad total available 246, allocated for covid 92, Occupied 13, in GB Gilgit total available 26, allocated for covid 05, Occupied 01, in AJK Mirpur total available 11, allocated for COVID 11, Muzaffarabad total available 28, allocated for COVID 18.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:18:25.350Z"
}
