{
  "title": "Sindh govt lockdown failed; no plan to save vulnerable segments from starvation: Murad Saeed",
  "link": "https://www.app.com.pk/national/sindh-govt-lockdown-failed-no-plan-to-save-vulnerable-segments-from-starvation-murad-saeed/",
  "date_published": "2020-06-06T00:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP):Minister for Communications and Postal Services Murad Saeed said on\nSaturday that the Pakistan People’s Party government lockdown in\nSindh proved a failure as it had no plan and strategy to provide\nration and cash assistance to the vulnerable segments of the society\nfor saving them from starvation.\nAddressing a media conference along with Minister for Information and\nBroadcasting Senator Shibli Faraz, he said that the people in Karachi and\nmany other cities of Sindh came out and protesting, as the they were\nfacing death due to hunger and starvation.\nAnswering the PPP’s leaderships’ criticism of federal government, he\nreminded that after 18th amendment health was provincial subject but\nstill federal government was trying its best to facilitate provinces\nin dealing with the pandemic.\nMurad Saeed said that coronavirus was a pandemic which had affected\nthe whole world including developed countries and Pakistani government\nwas fighting with it with limited resources. He said the measures of\nthe federal government in containing the pandemic and providing relief\nto the corona affected people have been appreciated by the\ninternational community. PTI government made all decisions keeping in\nview the corona-affected people’s miseries and provided a support\npackage for industrial sector and the people who have lost their jobs,\nhe said.\nMurad Saeed said it was a matter of great satisfaction that the\ncountry has domestically started production of sanitizers and masks\nand now was in a position to export Personal Protective Equipments\nincluding masks and sanitizers. He regretted that the health sector\nwas neglected in the past but the present government has now enhanced\nits capacity in a short span of time.\nHe said more than twenty thousand doctors have been trained in a short\nperiod of time to deal with the pandemic effectively. He said the\ncountry’s testing capacity per day has gradually been enhanced from\none hundred per day to thirty thousand. The Minister said strict\nactions are being taken for the implementation of Standard Operating\nProcedure to deal with the coronavirus and 1311 markets have been\nsealed so far for violation of the SOPs.He said smart lockdown has\nbeen imposed on 848 points across the country.\nCriticizing the PPP Chairperson Bilawal Bhutto Zardari, he said that\nhe read a written speech before the media, but in 40 minute press\nconference he could not point out one step taken by the Sindh\ngovernment for helping the poor. He said in Sindh, people were dying\nwith hunger due to lack of good governance in the province.\nHe said that after the 18th amendment, 62 percent of the national\nresources were given to provinces and Sindh was given trillions of\nrupees for improvement of health sector but the money was plundered.\nHe said that federal government provided cash assistance to poor\npeople of Sindh through Ehsaas Cash Emergency Programme but Sindh\ncould not provide proof and giving any ration or cash assistance in\nthe province.\nHe alleged that Sindh Chief Minister Murad Ali Shah was a facilitator\nof Asif Zardari in his activities of loot and plunder of economic\nresources of the province.\nHe said that there was difference between the PPP, PML-N regimes and\nthe PTI government as the world was appreciating Pakistan for its\nhandling of coronavirus and World Bank report was its proof.\nHe said that the previous governments of the PPP and PML-N could not\nbuild even a single hospital from where they could get medical\ntreatment.\nMurad Saeed said that after 50 years, twice Kashmir issue was\ndiscussed at the United Nations Security Council as it had become an\ninternational issue again thanks to Prime Minister Imran Khan’s\nefforts and advocacy. He said that Imran Khan not only advocated the\ncause of Kashmir but highlighted all issues of Islamic Ummah. He said\nthat Kashmir as national cause for every Pakistani and nobody would be\nallowed to do petty politics on the issue.\nHe said that Imran Khan had built ‘Langar Khanas’ and Shelter Homes\nfor the poor people and no government in the past made\nany policies.\nHe said that in KPK over 60 percent population was provided health\ncover through Sehat Insaf Card and after next budget, this figure\nwould reach hundred percent of the population of the province. While\non the contrary, in Sindh people were dying due to non-availability of\nvaccine for dog bites.",
  "retrievedAt": "2025-08-11T19:18:21.391Z"
}
