{
  "title": "75 percent beds available for COVID-19 patients at hospitals’ ICUs: Mirza",
  "link": "https://www.app.com.pk/national/75-percent-beds-available-for-covid-19-patients-at-hospitals-icus-mirza/",
  "date_published": "2020-06-06T03:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 06 (APP):Special Assistant to the Prime Minister on National Health Services, Dr Zafar Mirza on Saturday said that 75 percent beds at intensive care units (ICU) of hospitals are unoccupied, dispelling the impression of shortage of facilities for COVID-19 patients.\nIn a media briefing, Dr Mirza said that only 25 percent beds with ventilators are being used at hospitals to support corona patients while sufficient quantity is available for incoming patients and there is no any shortage of bed, ventilator or any other facility for Covid-19 patients.\nHe said that lockdown policy is being implemented in 700 areas of the country to avoid spread of the disease while only such places are sealed where there are threats of massive local transmission.\nHe said that the there is no shortage of Personal Protection Equipment (PPE) kits for frontline health workers and doctors as the government was regularly providing PPE kits to 450 hospitals across the country.\nHe said that the government is committed to ensure availability of medical services for corona patients at hospitals and provision of best possible medical treatment. In this regard a Resource Management System (RMS) has been developed to collect and provide real-time information about Corona patients throughout the country.\nHe said that the government has developed this system with having update on status of available facilities at public sector hospitals for COVID-19 patients. He said that with this system the government will be able to know the beds and ventilators’ occupancy and availability at ICU and allocated wards of hospitals.\nHe said that with the help of this system, the authorities concerned can easily manage the situation in hospitals to properly treat the corona patients. He added shortage of any necessary equipment could be managed.\nHe said that all the hospitals across Pakistan have been linked with this system.\nHe added these hospitals can update real time data to provide a unified and consolidated picture of the resources available to treat Corona patients in respective hospital.\nHe said that steady and adequate direct supplies of the PPEs is being handled by National Disaster Management Authority (NDMA). He said that the federal government has started ‘We Care’ campaign for protecting and supporting frontline health workers in the context of Covid-19.\nHe said that ‘We care’ aimed at providing adequate personal protective equipment to the health workers, orienting them on using various PPE items as per international standards, and creating an overall psycho-social environment of care and support.\nHe said that this initiative also aimed at sensitizing the public, including patients and visitors at healthcare facilities, to supports frontline healthcare workers by following preventive behaviors to not only reduce the risk of infection to themselves but also reduce the work burden on and health risks for the health providers.\nDr Mirza appealed citizens to follow all standard operating procedures (SOPs) during these days and avoiding hand shaking and leaving home without any reason. He said that there were complaints about violation of SOPs in markets by the citizens and shopkeepers.\nHe asked the citizens to support the efforts of government in its fight against COVID-19 and effectively implementing its lockdown relaxation policy to continue business activities and normalizing the lives of citizens.\nHe said that this relaxation policy could be successfully implemented if citizens are fully cooperated with the government and implemented all SOPs otherwise there are chances of spread of disease.",
  "retrievedAt": "2025-08-11T19:18:15.743Z"
}
