{
  "title": "COVID-19 vaccine is safe, over 140,000 health workers have inoculated against deadly virus: Dr Faisal",
  "link": "https://www.app.com.pk/national/covid-19-is-a-safe-vaccine-dr-faisal/",
  "date_published": "2021-02-26T09:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):Special Assistant to the Prime Minister on Health Dr Faisal Sultan Friday said over 140,000 health workers had been vaccinated for COVID-19 across the country.\nTalking to a private news channel, he said the COVID-19 vaccination should be mandatory for all the front-line workers to break the chain of infection as he himself got the first dose of vaccine a couple of days ago.\nHe asked the health professionals who had been immunized the COVID-19 vaccine to share their experience with their colleagues so that those who were a bit hesitant to be convinced and inoculated against the deadly virus.\nHe alarmed that vaccine hesitancy could lead to rise in the number of coronavirus cases.\nThe special assistant said the World Health Organisation had approved it and nearly 35 countries were using it, including the United Kingdom.\n“It is a safe vaccine,” he added.\n“It is a serious matter, we need to take a disciplinary action against those health workers refusing for COVID-19 vaccine and there acceptance is yet slow,” he added.\nFaisal said people around the world had been receiving COVID-19 vaccine, reports of temporary side effects such as headache and fever were rolling in, adding, normalcy would only return in the country and all over the world when people were being protected from this disease.\nHe explained that in first phase, two categories of people would be administered the vaccine – front-line healthcare workers and people over 65 years of age.\n“We have set a target to achieve herd immunity by vaccinating 70 million people by the end of the current year, however, we are hopeful of achieving the target by November,” he added.\nEveryone above the age of 65 would be able to get COVID-19 vaccine from March for free at governmental facilities, he mentioned.\nReplying to a query, he said Prime Minister Imran Khan would likely to get vaccinated for the novel coronavirus in the second phase, it may happen in March and the national leadership would take this step as an example to encourage the people.\nHe said the priority of vaccination had been decided as per the advice of the experts after consultation.\nThe prime minister’s aide said people above 65 years of age would be given the AstraZeneca-Oxford vaccine that Pakistan had to receive under the COVAX programme.\nHe said till March, Pakistan would receive 2.8 million doses of the vaccine.\n“This is a positive development as we will be able to kick-start our second phase,” he added.\nHe also urged the people above 65 years to get themselves registered for the vaccine as they were an important part of the society.\nHe expressed the hoped that the vaccination process would further speed up and it would set new examples for other nations on the globe.",
  "retrievedAt": "2025-08-11T20:24:42.406Z"
}
