{
  "title": "AJK President calls for extra preparedness to respond Corona-like deadly virus in future",
  "link": "https://www.app.com.pk/national/ajk-president-calls-for-extra-preparedness-to-respond-corona-like-deadly-virus-in-future/",
  "date_published": "2021-02-26T13:59:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 26 (APP):Azad Jammu and Kashmir (AJK) President, Sardar Masood Khan has said that Azad Jammu & Kashmir fared well in their fight against COVID-19 as confirmed corona virus cases were still low and the overall recovery rate stood high in the region.\nThe President expressed these views while addressing as the chief guest at the 13th Annual CSR Summit 2021, organized by National Forum for Environment & Health (NFEH), an affiliate of the United Nations Environmental Program (UNEP), AJK President office said Friday evening.\nThe event was also addressed by Governor Punjab, Chaudhry Muhammad Sarwar, Muhammad Naeem Quarashi, President NEFH, Mr Ishtiaq Baig founder of Make-A-Wish Foundation Pakistan, Engineer Nadeem Ashraf, Ambassador of Morocco and others.\nThe 13th CSR Summit with the theme “Let’s Unite to beat Pandemic was participated by national and multinational companies, industries, corporate sectors, banks, NGOs and related organizations.\nThe AJK President said people of AJK have been fortunate that the number of confirmed coronavirus cases in the state is still very small. It is 10,022 with 296 deaths and 9,097 recoveries. All this happened due to enforcement of effective but smart lockdown from the very beginning along with other preventive measures that have been taken by the government.\nHe said that in the beginning, we had some problems but later on, we got the ventilators, the PPEs, the masks, the sanitisers and the government under the leadership of Prime Minister Raja Farooq Haider Khan was able to establish 60 plus quarantine centres and isolation facilities in different districts of the state.\nOur doctors and nurses, paramedics, police and administration officials have done a wonderful job and they have been on the front lines, he added.\nSardar Masood underlined that the people of Azad Jammu Kashmir have cooperated with the government and so have the Ulama and civil society in guiding the masses about the importance of cooperation to respond to the pandemic with unity. The Ulema, Khan said, have especially played their part to create awareness about the size of minimal congregations in the mosques and the protocols for funerals and handling dead bodies.\nSimilarly NGOs, social sector organization and well off people of AJK also came forward and worked tirelessly to help tackle the pandemic and support the most vulnerable communities.\nHe paid special tributes and compliments to the National Command and Operation Centre (NCOC) and the National Coordination Committee (NCC) for providing leadership in guiding the nation at the time of national crisis.\nThe AJK President, however, regretted that rest of the world has not been so fortunate as 112 million people have been infected by the coronavirus globally and the deaths from this deadly virus stood at 2.49 million. In US alone 500,000 people were killed by this deadly virus and this number was more than combined number of fatalities in Vietnam War and World War-II.\nHe pointed out that that the threat of coronavirus is not over as the new strain of COVID-19 has appeared in many parts of the world including here in Pakistan. He said we cannot rule out the possibility of biological war or biological warfare in future as any hostile enemy can use this kind of virus to destroy and sabotage. So it is very important that we must invest in preparedness and response to a deadly virus like a corona.",
  "retrievedAt": "2025-08-11T20:24:50.272Z"
}
