{
  "title": "Balochistan govt enacts significant legislation to provide enabling environment to women",
  "link": "https://www.app.com.pk/national/balochistan-govt-enacts-significant-legislation-to-provide-enabling-environment-to-women/",
  "date_published": "2021-02-26T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):The Balochistan government has enacted significant legislation to punish the culprits of harassing women and domestic violence aiming to provide enabling environment to women workers to contribute in national economy in smooth manner, an official of Balochistan government said.\nTalking to APP, he said a number of laws had already been passed like domestic violence, women protection act, action against harassment of women in the workplace and others such laws to ensure safe environment to women in the province.\nThe provincial government was working to ensure safe environment for the female, especially working class.\nHe said it was the responsibility of the government to provide security and protection to women and encourage them for utilizing their capabilities for the society, adding that the involvement of women folk was imperative for progress of any country.\nThe provincial Cabinet has also okayed the ‘Balochistan Gender Equality and Women Empowerment Policy 2020-2024’ to ensure provision of equal rights to the women.\nThe policy would ensure inclusion of the women in the provincial and national development by providing them equal opportunities in socio-political and spheres.\nThe provincial government has also set up an endowment fund for women with disabilities, which will provide financial assistance and make them self sufficient.\nThe provincial government has fixed special quotas for women in jobs while women have been included in the top priorities at the government level.\nThe government has also launched ‘Balochistan Women Helpline: 1089’ for registration of complaints against women harassment at home and work place.\nThe women could register their complaints on the helpline regarding harassment, domestic violence, harassment at work place and property issues, said the official.\nStrict action would be taken on the complaints of women to ensure safe and free environments for women in the province, he added.\nHe said the helpline would cater women’s complaints about harassment.\nThe anti-harassment cells would also be established at Commissioner and Deputy Commissioner Offices to strictly tackle harassment issues in the province. He said the cells would also include an investigative arm besides collection of complaints.\nAccording to the official, the government has also established baby care centres in the province.",
  "retrievedAt": "2025-08-11T20:24:49.582Z"
}
