{
  "title": "Zulfi praises Sri Lankan govt for allowing COVID burial for Muslims",
  "link": "https://www.app.com.pk/national/zulfi-praises-sri-lankan-govt-for-allowing-covid-burial-for-muslims/",
  "date_published": "2021-02-26T07:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (OP&HRD) Sayed Zulfikar Abbas Bukhari has appreciated the Sri Lankan government for issuing official gazette notification allowing burial of COVID-19 deceased in the island country on PM Imran Khan’s request.\n“Appreciate Sri Lankan government’s official gazette notification allowing burial of COVID19 deceased in Sri Lanka within few hours of PM Imran Khan’s visit,” he tweeted.\nAppreciate SriLankan govt’s official gazette notification allowing burial of #COVID19 deceased in #SriLanka within few hours of PM @ImranKhanPTI’s visit. It is every Muslim’s final right to be buried as was requested by #PMIK.\nThankyou Govt of Sri Lanka for this gesture! pic.twitter.com/y4PMseHArA\n— Sayed Z Bukhari (@sayedzbukhari) February 25, 2021\n“It is every Muslim’s final right to be buried as was requested by Prime Minister (PM) Imran Khan,” he added to his tweet.\nIn the recent past, the SAPM has also formally requested High Commissioner of Sri Lanka to Pakistan, Vice Admiral Mohan Wijewickrama for the initiative.\nZulfikar Bukhari, in the letter, drew attention of the high commissioner towards the viral video in Pakistan which showed the Sri Lankan government cremated all dead bodies of the COVID-19 victims including Muslim and expressed the fear that such news could create unrest in his country.\nHe requested the high commissioner to take up the issue with his government on priority to review their decision regarding cremation of Muslims COVID dead bodies by allowing them burial according to their religious rites and the World Health Organization’s guidelines.",
  "retrievedAt": "2025-08-11T20:24:45.359Z"
}
