{
  "title": "COVID-19 claims 32 lives, infects 1,541 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-32-lives-infects-1541-more-people/",
  "date_published": "2021-02-26T07:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):The national tally on Friday of total active COVID-19 cases recorded 22,285 with 1,541 more people tested positive for the deadly virus and 2,502 people recovered from the disease during the last 24 hours.\nThirty two corona patients have died during past 24 hours, 28 of them were under treatment in hospital and three in their respective quarantines and homes on Thursday, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Sindh and Khyber Pakhtunkhwa.\nOut of the total 32 deaths, 16 people died, were under treatment, on ventilators.\nThe maximum ventilators were occupied in four major areas including Multan 20 percent, Islamabad Capital Territory (ICT) 31 percent, Peshawar 19 percent and Lahore 36 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in Four major areas of Gujrat 61 percent, Peshawar 34 percent, Multan 25 percent, and Lahore 23 percent.\nAround 216 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 41,849 tests were conducted across the country on Thursday, including 8,709 in Sindh, 18,079 in Punjab, 6,995 in Khyber Pakhtunkhwa (KP), 6,252 in Islamabad Capital Territory (ICT), 802 in Balochistan, 348 in GB, and 664 in AJK.\nAround 542,393 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 577,482 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 10,101, Balochistan 19,035, GB 4,956, ICT 44,032, KP 71,728, Punjab 170,222 and Sindh 257,408.\nAbout 12,804 deaths were recorded in country since the eruption of the contagion. Around 4,322 perished in Sindh among seven of them died during past 24 hours. Four people had expired in the hospital and three out of the hospital.\n5,323 in Punjab had died with 15 deaths in past 24 hours have occurred in the hospital. 2,065 in KP where seven of them died in hospital on Thursday, 496 in ICT among two of them perished in the hospital on Thursday, 200 in Balochistan among one of them perished in the hospital in past 24 hours, 102 in GB and 296 in AJK among succumbed to the deadly virus.\nA total of 8,873,741 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 2,018 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:24:44.473Z"
}
