{
  "title": "Pakistan, Qatar sign LNG supply agreement",
  "link": "https://www.app.com.pk/national/pakistan-qatar-sign-lng-agreement/",
  "date_published": "2021-02-26T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP): Qatar will provide Pakistan three million ton Liquified Natural Gas (LNG) for 10 years as the two countries entered into an agreement on Friday.\nPrime Minister Imran Khan witnessed the signing of agreement that took place here at the PM House.\nFederal Minister for Energy Omar Ayub Khan and Qatar’s Energy Minister Saad Sherida al-Kaabi inked the agreeement.\nQatar’s Minister al-Kaabi termed as “historic” the agreement with Pakistan and expressed confidence that it would open up new vistas of development.\nHe said Qatar would also promote bilateral cooperation in other areas of mutual interest.\nSpecial Assistant to PM on Petroleum Nadeem Babar said the agreement would prove helpful in fulfilling Pakistan’s energy needs.\nMeanwhile Special Assistant to the Prime Minister (SAPM) on Petroleum Nadeem Babar, while sharing the details of the agreement with media, said Pakistan would save an amount of around $ 3 billion in import of Liquefied Natural Gas (LNG) under a 10-year agreement signed with Qatar at 10.2 percent of the Brent, which would be effective from January 2022.\n“Today we have signed a very important agreement with Qatar. Our earlier agreement [signed by the PML-N government] with Qatar is of 13.37% of the Brent, under which an average five cargoes arrive every month. But, we [the PTI government] has inked the deal at 10.2% of the Brent,”.\nThis contract, he said, was almost 31 percent low as compared to the previous agreement signed by the Pakistan Muslim League-Nawaz (PML-N) government. “It is a 10-year agreement and the price can be renegotiated after a period of four years.”\nThe SAPM said the existing agreement was of 15 years, under which the price was fixed for a period of 10 years.\nUnder the new agreement, he said, Pakistan would save around $ 317 million annually and $3 billion collectively during a period of 10 years.\nNadeem Babar said there were a number of amendments in the 10-year agreement. As per the old contract, Pakistan had given a letter of credit (LC) of $ 170 million to the Qatar government, but under the new agreement, the LC would be of only $ 84 million.\nIn the new arrangement, he said, the import would be started with average two ships per month, which would be increased to four vessels in a period of three years.\nJustifying the new deal, he said a contract of the Gunvor Company, which was operating at 13.37 of the Brent, had expired in December 2020, while its second contract would be ending after 14 months.\nThe new contract, he said, would be replacing the two expensive contracts [of Gunvor].\nThe SAPM said there would be a cushion for Pakistan to import additional volume of LNG during the upcoming peak winter season, on need basis, at the same10.2 percent of the Brent.\n“This agreement will be effective from next January, and if needed it can be executed two-three months before the commencement date, keeping in view the winter needs.”\nSince the start of LNG import and till December, 2019, he said Pakistan’s spot LNG purchase remained at average 11.90 percent. “The contract was of 13.37 percent of the Brent and the spot buying at 11.90 percent.”\nNow, Nadeem Babar said, Pakistan would be importing the LNG at 10.2 percent of the Brent under the agreement, almost 15 percent more cheap than the spot purchase.\nHe termed the new LNG supply deal ‘historic’ as it would ensure economic stability. “In the LNG trade, this price [10.2% of the Brent] is the lowest publicly disclosed contract ever.”\nAnswering a question, he said the imported LNG was mostly being consumed by commercial, industrial, power and Compressed Natural Gas sectors. The LNG was not supplied to a common residential consumer, who rather got natural gas.\nThe SAPM said the process to strike the deal was started around two years ago, when he had accompanied the PM during his first visit to Qatar. “It is correct that the deal was discussed at the highest level of the government.\nThe PM himself had talked to the Amir of Qatar thrice. It took long time to strike the deal at 10.2 percent of the Brent, which is the lowest publicly known contract in the world today.”",
  "retrievedAt": "2025-08-11T20:24:42.393Z"
}
