{
  "title": "Situationer: Wheat worries: how the deregulation experiment went awry - Newspaper - DAWN.COM",
  "author": null,
  "content": "• For Punjab, deregulating the flour industry seemed like a good idea, until floods exposed the lack of safeguards in its framework\n• Subsequent policy reversals, restrictions on wheat movement have spooked millers, disincentivised grain cultivation\n\nPUNJAB’S controversial step to deregulate the wheat market has rapidly turned into a tale of policy confusion and economic disarray.\n\nWhat began as a move towards a ‘free market’ has, within mon­ths, exposed glaring gaps in planning — such as the absence of a roadmap for imports or exp­orts, lack of a mechanism to check price volatility, and no safety net for farmers or consumers.\n\nAnnounced just ahead of the recent harvest, the policy has eff­ectively ended the government’s decades-old role in wheat procurement and support pricing.\n\nThe initial idea was to allow the private sector, including flour mills, traders and even foreign investors, to buy directly from farmers. Officials claimed this would ease the fiscal burden of massive public stocks and ensure competitive grain prices.\n\nBut the plan proved half-baked and directionless, lacking even basic safeguards. There were no provisions for import or export, no mechanisms to check hoarding or speculation, and no institutional structure to monitor or step in, if prices spiralled out of control.\n\nThose privy to the experiment now concede it was pushed through without adequate preparation. “We deregulated without a legal or operational framework,” said an official involved in the process, adding that there were no means to stabilise prices or manage stocks once the market was left to its own devices.\n\nInitially, we saw private investors stepping in. Flour mills, traders and a multinational grain company collectively purchased over one million tonnes, keeping prices from collapsing after harvest.\n\nStill, the rate slid to Rs2,300 per maund, lower even than the price of maize. Only the feed industry’s unexpected purchases — around 150,000 tonnes — prevented a complete market crash.\n\nTurning tide\n\nBy mid-summer, however, heavy floods in southern Punjab disrupted supply chains. As demand from flour mills surged, wheat prices shot up to Rs4,000 per maund. With no price monitoring system or anti-hoarding mechanism in place, profiteering flourished unchecked.\n\nAlarmed by the surge in flour and bread prices, the government abruptly abandoned its market-reform rhetoric. Invoking the Essential Commodities Act 2024, it capped wheat prices at Rs3,000 per maund and notified new rates for atta and roti.\n\nAn unannounced ban on the inter-provincial movement of wheat followed, and millers were told to obtain permits for even inter-district transport — measures that effectively reversed the process of deregulation. Provi­n­cial authorities, including the Punjab Enforcement and Regu­latory Authority (PERA) and district administrations, were instructed to raid private warehouses and seize wheat stocks.\n\nThe same investors, once praised for “supporting the market”, suddenly found themselves under investigation. Flour millers and traders denounced the move as policy whiplash.\n\n“The arbitrary reversals have left everyone confused and insecure,” says Khaleeq Arshad, Chairman of the Progressive Flour Millers Group (PFMG). In his view, those who legally bought wheat were being punished, while the government itself was violating its own principles of deregulation.\n\nThe repercussions are now being felt by farms. Low grain prices and official interventions have discouraged growers from planting wheat for the next season.\n\nSensing the waning interest, the government has directed departments to cultivate maximum acreage on state-owned farms to avert a potential production shortfall — a move that underscores official anxiety, rather than foresight.\n\nPFMG President Majid Abdullah warns that the damage may linger.\n\nIn his view, private investment is the backbone of a deregulated system. “But when the state punishes investors, the message to farmers is simple — next year, there will be no one left to buy their crop.”\n\nDisregard for fundamentals\n\nAccording to experts, Punjab’s wheat reform ignored the fundamentals. Wheat is not just another crop; it underpins food security and price stability. Yet, the policy offered no clarity on trade flows; whether imports would be allowed in case of shortage, or exports in case of surplus.\n\nWithout such guidelines, Punjab’s wheat market became vulnerable to both manipulation and external shocks. The absence of price monitoring or risk management systems means that the government can only react to crises, instead of managing them.\n\nIn the words of an agricultural economist, “You cannot liberalise food markets without institutional preparedness.”\n\nIndustry insiders now fear a return to the old quota-based regime, where a handful of millers enjoyed privileged access to subsidised grain. The state’s re-entry into the market, they argue, has revived inefficiency and rent-seeking — the very ills that deregulation aimed to eliminate.\n\nFlour millers also lament that the promised reforms — like the Electronic Warehouse Receipt system and subsidised bank financing — never materialised.\n\n“The infrastructure was never built; deregulation was done on paper only,” one investor said.\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:13:28.899Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947358/situationer-wheat-worries-how-the-deregulation-experiment-went-awry",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T01:50:00.000Z"
}
