{
  "title": "Apologised to PM Shehbaz on presumptions about supposed minerals deal with US: Senator Aimal Wali - Pakistan - DAWN.COM",
  "author": null,
  "content": "Awami National Party (ANP) Senator Aimal Wali Khan has said he has apologised to Prime Minister Shehbaz Sharif after the latter provided him with a clarification on the questions he had earlier raised during a Senate speech regarding a presumed rare earth minerals deal with the US.\n\nIn a post on X on Tuesday, he said the PM had invited him for a meeting after his speech in the upper House of Parliament, and during the conversation, he told the premier: “If I can criticise openly, I also have the courage to apologise if I make a mistake”. He added that he had told the PM that if he was wrong in his presumptions about the deal, “I apologise”.\n\nIn his Senate speech, Khan had referred to a photograph circulating on social media that showed PM Shehbaz, US President Donald Trump and Chief of Army Staff (COAS) Field Marshal Asim Munir, who was holding an open briefcase that appeared to contain minerals. The photograph was released by the White House, after a September meeting of the three in the US, and showed Field Marshal Munir pointing to the contents of the briefcase and Trump looking at them.\n\nKhan said in his speech in the Senate on Sept 30 that in the photograph, it seemed that a deal for the trade of rare earth minerals was being proposed. “Under what agreement, which law and the Constitution? This is dictatorship. This is, sorry to say, not democracy.”\n\nHe went on to question whether parliament held any importance.\n\nKhan also spoke of the rights of smaller provinces and accused the ruling party in the Centre, the PML-N, of working on the terms of the military establishment.\n\nThe ANP leader also termed the Special Investment Facilitation Council (SIFC) — a committee that helps with foreign investments — an “unconstitutional institution”.\n\n“The SIFC is financially taking Pakistan towards one unit. All your decisions are being made at one place … The SIFC is making Punjab’s agriculture policy […] It is the SIFC that is dealing with rare earth minerals,” he alleged.\n\nFollowing Khan’s speech, Law Minister Azam Nazeer Tarar mentioned in the Senate on Tuesday that PM Shehbaz had met Khan and clarified details regarding his meeting with the US president.\n\nSubsequently, Khan posted on X that after his speech in the upper house of parliament, the premier invited him for a briefing on his visit to the US.\n\n“At the beginning of the meeting, he apologised to me and said that all of this should have happened in parliament prior to the US visit. I accepted his apology right away and said: “‘Look at my speech. I only talked about the supremacy of parliament. I did not ridicule anyone.’”\n\nAccording to Khan, the premier clarified that he needed to take the army chief along with him on some visits. “Due to some strategic constraints, he takes the Field Marshal along with him,” he said.\n\n“Referring to the picture of Trump, the Field Marshal and himself, [Shehbaz] said that the gift of minerals presented to the American president was purchased by the army chief from his own pocket and had nothing to do with any mineral deal — domestic or foreign,” Khan claimed.\n\nThe ANP leader said that he replied: “When I have the courage to criticise openly, I also have the courage to apologise for my mistake. If this picture has nothing to do with the minerals of KP and Balochistan or any deal, then I apologise.”\n\nHe added that the people of KP and Balochistan had a right on the minerals in their respective provinces and they “should be included in this. We are neither against development nor betterment of the economy”.\n\nOn Monday, Dawn reported that the federal and provincial governments withdrew police and Federal Constabulary security protection to Khan and his family following his critical speech in the upper house of parliament.\n\nToday, ANP spokesperson Engineer Ehsanullah Khan said Khan’s recent speech in the Senate was an “unconditional affirmation of parliamentary supremacy”.\n\n“The ANP has always been a torch-bearer of the supremacy of parliament. It was also the central idea of the party president’s speech in the Senate,” his statement posted on the ANP’s X account said. It added that Khan’s statement also made it “clear that the government will ensure implementation regarding the rights of smaller provinces, as they were stated in the Constitution.”\n\nHe further stated that the ANP valued the national role of defence institutions, but was also clear that “all institutions should work within the bounds of the Constitution”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/081209545f13eec.webp",
  "retrievedAt": "2025-10-12T13:13:17.415Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947416/apologised-to-pm-shehbaz-on-presumptions-about-supposed-minerals-deal-with-us-senator-aimal-wali",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T07:08:00.000Z"
}
