{
  "title": "Man arrested in KP’s Shangla district for allegedly raping teenage daughter: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A man was arrested on Wednesday on charges of allegedly sexually assaulting his teenage daughter in Khyber Pakhtunkhwa’s Bisham area of Shangla district, officials said.\n\n“The victim reached the police station on Wednesday,” Bisham Station House Officer (SHO) Afzal Khan told Dawn.com. “A first information report (FIR) was lodged, and the suspect has been arrested.”\n\nAccording to the FIR, the victim’s mother was divorced by her husband, who later married another woman from Swat. However, nine years ago, the stepmother also left and returned to her parents’ home.\n\n“I live with two of my stepbrothers, one of whom is paralysed, and my father in a rented house,” she said, per the FIR.\n\nThe victim reported that she was at home and her brother had gone to Rawalpindi for work when her father called her to his room, where he showed her a knife and sexually assaulted her.\n\nShe alleged that her father also threatened her with murder if she told anyone about the ordeal.\n\nThe victim added that she went to the police station when she got the chance to lodge an FIR against her father and to get protection from him.\n\nPolice registered the FIR under Sections 376 (rape) and 506 (criminal intimidation) of the Pakistan Penal Code and started further investigation into the case.\n\nA senior doctor at the tehsil headquarters hospital, Bisham, who wished not to disclose his name, examined the victim and confirmed that she was raped.\n\nThe United Nations Population Fund (UNFPA -Pakistan), citing the Pakistan Demographic and Health Survey 2017–18, said 28 per cent of women aged 15–49 have reported experiencing physical violence and 6pc have endured sexual violence, while 34pc of ever-married women have faced spousal physical, sexual, or emotional abuse.\n\nIt said that among them, 5pc reported experiencing spousal sexual violence. Alarmingly, 56pc of women who have endured physical or sexual violence have not sought help or confided in anyone about their experiences, largely due to socio-cultural barriers, economic dependency, lack of information and accessibility, and the absence of adequate support systems such as healthcare and psycho-social services.\n\nEarlier this month, the National Cybercrime Investigation Agency arrested three people suspected of gang-raping and blackmailing a minor in KP’s Abbottabad, according to a police official.\n\nIn July, the KP police said they arrested a suspect after a 13-year-old maid was allegedly raped and murdered in Abbottabad.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:13:15.560Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947465/man-arrested-in-kps-shangla-district-for-allegedly-raping-teenage-daughter-police",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T14:43:01.000Z"
}
