{
  "title": "Trump unlikely to win Nobel Peace Prize, but who will? - World - DAWN.COM",
  "author": null,
  "content": "When it comes to this year’s Nobel Peace Prize, one thing is almost certain: United States President Donald Trump will not win, no matter how much he wants it. But who will? The Norwegian Nobel Committee in Oslo will bring the suspense to an end when it announces the winner on Friday at 11am (2pm PKT).\n\nThe backdrop is bleak: the number of armed conflicts worldwide involving at least one state has never been as high as in 2024, since Sweden’s Uppsala University started its global conflict database in 1946.\n\nTrump has repeatedly said he deserves the prestigious prize for resolving “eight conflicts”, but experts predict he will not be the committee’s choice — at least not this year.\n\n“No, it will not be Trump this year,” Swedish professor Peter Wallensteen, an expert on international affairs, told AFP.\n\n“But perhaps next year? By then the dust will have settled around his various initiatives, including the Gaza crisis,” he added.\n\nNumerous experts consider Trump’s “peacemaker” claims to be exaggerated and express concerns over the consequences of his “America First” policies.\n\n“Beyond trying to broker peace for Gaza, we have seen policies that actually go against the intentions and what’s written in the will of [Alfred] Nobel, notably to promote international cooperation, the fraternity of nations and disarmament,” said Nina Graeger, who heads the Peace Research Institute of Oslo.\n\nFor Graeger, the list of Trump’s actions not aligned with the ideals of the Nobel Peace Prize is long.\n\nTrump has withdrawn the US from international organisations and multilateral treaties, launched trade wars against allies and enemies alike, threatened to take Greenland from Denmark by force, ordered the National Guard into US cities and attacked universities’ academic freedoms as well as freedom of expression.\n\n“We take the complete picture into account,” explained Jorgen Watne Frydnes, chair of the five-member committee awarding the peace prize.\n\n“The whole organisation or the complete personality of that person matters, but what we first and foremost look at is what they have been actually achieving for the sake of peace,” he said.\n\nThis year, 338 individuals and organisations have been nominated for the peace prize, with the list kept secret for 50 years.\n\nTens of thousands of people are eligible to propose candidates, including lawmakers and cabinet members of all countries, former laureates, certain university professors and Nobel committee members.\n\nIn 2024, the award went to Japan’s atomic bomb survivors’ group Nihon Hidankyo for its efforts to ban nuclear weapons.\n\nWith no clear favourite this year, several names have been doing the rounds in Oslo ahead of Friday’s announcement.\n\nSudan’s Emergency Response Rooms — a network of volunteers risking their lives to feed and help people enduring war and famine — have been mentioned, as has Yulia Navalnaya, the widow of Kremlin critic Alexei Navalny, and the Office for Democratic Institutions and Human Rights election watchdog.\n\nThe Nobel committee’s choices in recent years have demonstrated “a return to more micro things, somewhat closer to classical ideas of peace”, with a focus on “human rights, democracy, freedom of the press and women”, said Halvard Leira, the director of the Norwegian Institute for International Affairs.\n\n“My hunch would probably just perhaps be for a not that controversial candidate this year,” he said.\n\nThe Nobel committee could also choose to reaffirm its commitment to a world order currently being challenged by Trump by giving the prize to United Nations Secretary General Antonio Guterres, or a UN body such as the Office of the UN High Commissioner for Refugees or the UN Relief and Works Agency for Palestine Refugees.\n\nIt could also give the nod to international tribunals such as the International Court of Justice or the International Criminal Court, or champion press freedoms currently under attack by giving it to the Committee to Protect Journalists or Reporters Without Borders.\n\nBut the committee could also do as it has done many times before and pick a completely unexpected winner.\n\nTrump has made no secret of the fact that he is obsessed with winning the Nobel Peace Prize. But so far the award has eluded him throughout his two US presidencies.\n\nTrump’s push for the prize is fuelled by a potent mix of a desire for prestige and a long rivalry with former president Barack Obama.\n\nSometimes Trump, who is often better known for his divisive rhetoric, anti-migration drive and embrace of foreign authoritarians, has appeared to acknowledge that he is an unlikely candidate.\n\n“Will you get the Nobel Prize? Absolutely not. They’ll give it to some guy that didn’t do a damn thing,” Trump said during a speech to hundreds of the US military’s top officers in September.\n\nBut in the same breath Trump revealed his true feelings.\n\n“It’d be a big insult to our country, I will tell you that. I don’t want it, I want the country to get it. It should get it because there’s never been anything like it,” he said at the same gathering.\n\nAs the Norwegian committee’s announcement has drawn nearer, the steady drumbeat of Trump’s campaigning for the peace prize has intensified to unprecedented levels.\n\nIn recent weeks, barely a public event has gone by without Trump bragging about what he says is his role in ending seven wars.\n\nTrump’s administration recently listed them as being between Pakistan and India; Cambodia and Thailand; Kosovo and Serbia; the Democratic Republic of Congo and Rwanda; Israel and Iran; Egypt and Ethiopia; and Armenia and Azerbaijan.\n\nBut while Trump has been quick to claim credit for some — for example announcing a ceasefire between nuclear-armed Delhi and Islamabad in May — many of the claims are partial or inaccurate.\n\nTrump has even bombed one of the countries he mentions. He ordered US military strikes on Iran’s nuclear programme in June.\n\nBut perhaps the biggest issue is that the two main wars that Trump promised to end within days of his inauguration — in Gaza and Ukraine — are still raging.\n\nHis push for a deal between US ally Israel and Hamas to end the brutal two-year conflict in Gaza has reached a climax just days before the Nobel announcement — but is almost certainly too late to sway the committee.\n\nForeign leaders seeking to curry favour with Trump have been quick to talk up Trump’s chances.\n\nIsraeli Prime Minister Benjamin Netanyahu nominated Trump for the prize, as did an Israeli advocacy group campaigning for the release of hostages in Gaza.\n\nPakistan also nominated Trump while the leaders of several African countries paid tribute to his supposed peacemaking efforts in a visit earlier this year.\n\nBut while Trump wants international recognition as “peacemaker-in-chief”, there is another driving factor.\n\nSince the beginning of his presidential ambitions 10 years ago, “he has put himself in opposition to Barack Obama, who famously won the Nobel Peace Prize in 2009”, Garret Martin, a professor of international relations at American University, told AFP.\n\nThe prize awarded to the Democratic former president, barely nine months after he took office, sparked heated debate — and continues to annoy Republican Trump.\n\n“If I were named Obama I would have had the Nobel Prize given to me in 10 seconds,” Trump complained in October 2024, during the final stretch of the presidential campaign.\n\nThree other US presidents have also won the award: Theodore Roosevelt, Woodrow Wilson and Jimmy Carter, although Carter won his decades after his presidency for his subsequent peace efforts.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/08225142a9c3301.webp",
  "retrievedAt": "2025-10-12T13:13:15.422Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947482/trump-unlikely-to-win-nobel-peace-prize-but-who-will",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T17:52:51.000Z"
}
