{
  "title": "Djokovic vanquishes exhaustion to reach Shanghai quarters - Sport - DAWN.COM",
  "author": null,
  "content": "SHANGHAI: Novak Djoko­vic banished exhaustion and played through an ankle injury scare to make it to the quarter-finals of the Shanghai Masters on Tuesday, beating Spain’s Jaume Munar 6-3, 5-7, 6-2.\n\nThe hard-won victory keeps Djokovic on track as the favourite to take a record-extending fifth title in the Chinese financial hub, with other top seeds already withdrawn or knocked out.\n\nThe 38-year-old almost looked unable to continue when the match went to a decider, but he conjured up the energy to break his decade-younger opponent twice in the third set.\n\n“Thank you, thank you everyone, I love you!” he shouted in Chinese to the adoring crowd before leaving court almost immediately after play finished.\n\nThe 24-time Grand Slam champion had a good start despite the 84 percent humidity, breaking in the fourth game.\n\nHis problems began shortly afterwards when his left ankle slid out behind him as he rushed towards the net, and he had to take a medical timeout.\n\nHe grimaced in pain as he was attended to by an on-court physio, but managed to resume to hold the fifth game.\n\nDjokovic received treatment again in the second set, and looked increasingly fatigued, crouching over frequently in between rallies and throwing up on court.\n\nSerbian-flag-waving Chinese fans roared in support, but 41st-ranked Munar ultimately broke in the 12th game of the second set after an unforced error from his opponent.\n\nAn agonised Djokovic dropped to the floor and remained splayed out on court with his chest heaving, as a medic rushed over.\n\nBut he picked himself up for an incredible third-set revival, breaking in the first and seventh games and sending the stadium into a frenzy.\n\nDjokovic is now the oldest player to reach an ATP Masters 1000 quarter-final, and the highest-ranking player left in the competition in Shanghai.\n\nWorld number one Carlos Alcaraz withdrew from the tournament to rest, and second, third and fourth-ranked Jannik Sinner, Alexander Zverev and Taylor Fritz have all been eliminated.\n\nThe event in Shanghai has been beset by injuries, as players have battled the humidity coupled with temperatures over 30 Celsius.\n\nSinner was forced to retire on Sunday after being seized with extreme cramps.\n\nWorld number 11 Holger Rune, who has also struggled with the conditions, called on Tuesday for tennis authorities to bring in a heat policy for events like Shanghai.\n\nThe Dane is through to the last eight after he took out France’s Giovanni Mpetshi Perricard 6-4, 6-7 (7-9), 6-3.\n\nDjokovic will next face 44th-ranked Zizou Bergs.\n\nThe Belgian took Canada’s Gabriel Diallo down to the wire, prevailing in a prolonged third set tiebreak 3-6, 7-5, 7-6 (10-8).\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/08080036fc97b23.webp",
  "retrievedAt": "2025-10-16T20:47:00.358Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947326/djokovic-vanquishes-exhaustion-to-reach-shanghai-quarters",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T01:50:50.000Z"
}
