{
  "title": "OpenAI, Anthropic eye investor funds to settle AI lawsuits: report - World - DAWN.COM",
  "author": null,
  "content": "OpenAI and Anthropic are exploring the use of investor funds to settle potential multibillion-dollar lawsuits, the Financial Times reported on Wednesday.\n\nCopyright owners have launched a series of high-stakes lawsuits against tech firms, including OpenAI, Microsoft, and Meta Platforms, alleging unauthorised use of their material to train AI systems.\n\nOpenAI, which has tapped Aon, has secured coverage of up to $300 million for emerging AI risks, the report said, citing people familiar with the company’s policy.\n\nHowever, another person disputed this figure, claiming it was significantly lower, the newspaper said, adding that all agreed the coverage falls far short of what is needed to protect against potential losses from a series of multibillion-dollar legal claims.\n\nKevin Kalinich, head of cyber risk at Aon, told the newspaper that the insurance sector broadly lacks “enough capacity for (model) providers.”\n\nOpenAI has considered “self-insurance” by setting aside investor funding, with discussions about establishing a “captive,” a ringfenced insurance vehicle used by large companies to manage emerging risks, the report said.\n\nOpenAI, Anthropic and Aon did not immediately respond to Reuters’ request for comment. Reuters could not immediately verify the report.\n\nLast month, a federal judge in California preliminarily approved a landmark $1.5 billion settlement of a copyright class action brought by a group of authors against Anthropic.\n\nAnthropic is partly using its own funds to cover potential settlements, the FT report said, citing a person with knowledge of the matter.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/081245124341e42.webp",
  "retrievedAt": "2025-10-12T13:13:17.421Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947431/openai-anthropic-eye-investor-funds-to-settle-ai-lawsuits-report",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T07:52:48.000Z"
}
