{
  "title": "200 troops arrive in Illinois, angering Democrats - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Two hundred Texas National Guard troops have arrived in Illinois, a Pentagon official said Tuesday, ahead of a planned deployment in Chicago that is opposed by local Democratic officials.\n\nThe troops were sent as part of a mission to protect “federal functions, personnel, and property”, the official said, adding that the Guardsmen have been mobilised for “an initial period of 60 days”.\n\nThe planned deployment of troops from Texas has infuriated Democratic Governor J. B. Pritzker, who said they “should stay the hell out of Illinois”.\n\nPresident Donald Trump over the weekend authorised the deployment of 700 National Guard troops to Chicago, sparking a lawsuit by Illinois state officials.\n\nIn their suit, Illinois Attorney General and counsel for Chicago accused Trump of using US troops “to punish his political enemies”.\n\n“The American people, regardless of where they reside, should not live under the threat of occupation by the United States military, particularly not simply because their city or state leadership has fallen out of a president’s favour,” they said.\n\nBut Judge April Perry, an appointee of President Donald Trump’s Democratic predecessor Joe Biden, declined to issue an immediate temporary restraining order, instead scheduling a full hearing for Thursday.\n\nHomeland Security Secretary Kristi Noem has defended the plan to send troops to Chicago, claiming that the third-largest US city is “a war zone”.\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:13:42.298Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947340/200-troops-arrive-in-illinois-angering-democrats",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T01:51:02.000Z"
}
