{
  "title": "Indians lead drop in US university visas - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The United States issued nearly one-fifth fewer student visas in August following a crackdown by President Donald Trump, led by a steep drop for India which was overtaken by China as top country of origin, data showed.\n\nThe United States issued 313,138 student visas in August, the most common start month for US universities, a drop of 19.1 per cent from the same month in 2024, according to the International Trade Administration.\n\nIndia, which last year was the top source of foreign students to the United States, saw the most dramatic drop with 44.5pc fewer student visas issued than a year earlier.\n\nVisa issuance also dropped for Chinese students but not nearly at the same rate. The United States issued 86,647 visas to students from mainland China in August, more than double the number issued to Indians.\n\nThe statistics do not reflect overall numbers of US-based international students, many of whom remain on previously issued visas. Trump has put a top priority since returning to the White House both on curbing immigration and on weakening universities, which his administration sees as a key power base of the left.\n\nSecretary of State Marco Rubio briefly suspended processing of student visas in June, a peak month, as he issued orders that US embassies vet applicants’ social media.\n\nRubio has revoked thousands of student visas, often due to criticism of Israel, on the grounds that he can refuse entry to people who go against US foreign policy interests.\n\nIn rules that affect Indians in particular, the Trump administration has made it more difficult for applicants to apply for visas outside jurisdictions of the US consulates in their home countries, even if there are backlogs.\n\nTrump has taken a series of actions at odds with India, which for decades had been courted by US policymakers of both parties who saw the billion-plus nation as a natural counterweight to China.\n\nTrump has also imposed a hefty new fee on H-1B visas, which are used largely by Indian technology workers. Trump, however, has voiced hope for ramping up the number of Chinese students to boost relations between the two powers, a sharp contrast to earlier messaging from Rubio who had vowed to “aggressively” revoke visas from Chinese students he accuses of exploiting US technical knowhow.\n\nThe latest figures also show a sharp drop in student visas from many Muslim-majority countries, with admissions from Iran dropping by 86pc.\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:13:42.182Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947339/indians-lead-drop-in-us-university-visas",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T01:51:02.000Z"
}
