{
  "title": "ECP decides to hold local govt polls in Punjab in last week of December - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Election Commission of Pakistan (ECP) decided on Wednesday to hold Punjab’s long-delayed local government (LG) elections in December’s last week and that the process of delimitation would initiate from tomorrow to be completed within two months.\n\nUnder Article 140-A of the Constitution and Section 219(4) of the Elections Act, the ECP is bound to hold elections within 120 days of the expiry of the term of the local government institutions. In April 2019, the then PTI-led Punjab government dissolved the local government institutions, which were later restored by the Supreme Court and subsequently completed their term on December 31, 2021. That means the elections were supposed to be held by the end of April 2022, but it could not be made possible as the provincial government kept on amending the LG law from time to time.\n\nThe order, a copy of which is available with Dawn.com, was issued by a four-member ECP bench comprising Chairman Sikandar Sultan Raja, Nisar Ahmed Durrani, Shah Muhammad Jatoi and Babar Hassan Bharwana.\n\nIt stated that the election regulator had “decided to hold the local government elections in the province of Punjab on the basis of the existing local government law, i.e. the Punjab Local Government Act 2022 and Rules framed thereunder”.\n\nThe bench ordered the ECP office to initiate the process of delimitation from tomorrow (October 9) and complete it within two months.\n\n“Thereafter, the election programme should be announced and the election should be held in the last week of December 2025. The office is expected to follow the timelines strictly,” the order said.\n\nIt referred to another one released after a June hearing held by the ECP on the matter, which stated that the ECP had accepted the Punjab government’s request for three months’ time for the completion of various activities pertaining to the election “in the interest of justice”.\n\n“In case of failure, the commission will issue appropriate orders regarding the conduct of local government elections in the province of Punjab,” the June order had said.\n\nReferring to it, today’s order stated that having received no response from the Punjab government after a period of three months, the ECP again fixed the matter for a hearing today and issued a notice to the local government secretary.\n\nIt said it the local government secretary appeared in person and said that the process of legislation for the Punjab Local Government Act was under the process of completion after being delayed by the floods. He added that the standing committee had finalised the process and the bill would be laid down in the Punjab Assembly for passage, requesting that some time be granted till the assembly session was convened.\n\nThe ECP said it had “exhausted all possible efforts’’ for the conducting of the Punjab local government elections in Punjab, but the provincial administration “acted in a dilatory manner to delay the conduct” of polls each time on one or the other pretext.\n\nThe bench added that it was the ECP’s constitutional obligation to organise and conduct elections in accordance with the Constitution and law, which entrusted it with “exclusive, broad and extensive powers to fulfil its constitutional responsibilities’’.\n\nAt the same time, it pointed out that it was also the constitutional responsibility of the provincial governments to ensure the establishment of a local government system in accordance with the Constitution and the law.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/081554159c9a4e7.webp",
  "retrievedAt": "2025-10-12T13:13:17.924Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947455/ecp-decides-to-hold-local-govt-polls-in-punjab-in-last-week-of-december",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T10:55:59.000Z"
}
