{
  "title": "Rate cut unlikely this month, says SBP governor - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: State Bank of Pakistan (SBP) Governor Jameel Ahmed has indicated that an interest rate cut is unlikely in the upcoming monetary policy announcement on Oct 27, citing uncertainty over inflation and the ongoing talks with the International Monetary Fund (IMF).\n\nIn an interview with Bloomberg, the governor said any adjustment in the policy rate would depend on the outcome of the IMF negotiations and the economic impact of the recent floods. He added that inflation may temporarily exceed the SBP’s medium-term target range of 5 per cent to 7pc in early 2026 but is expected to remain within the range on average during the current and next fiscal years.\n\nAnalysts and independent economists have also ruled out a rate cut, citing the recent rise in inflation and the central bank’s cautious stance, which favours macroeconomic stability over short-term growth. Inflation rose to 5.6pc in September from 3pc in August, partly due to flood-related disruptions.\n\nThe SBP’s Monetary Policy Committee kept the benchmark interest rate unchanged in its last meeting, reflecting concern over inflationary pressures despite a generally stable trend since May 2025. During much of this period, inflation had remained subdued, but the central bank opted for caution.\n\nMonetary policy decision hinges on IMF talks, inflation outlook\n\nThe World Bank, in a report released on Tuesday, projected Pakistan’s GDP growth at 2.6pc for FY26, reflecting subdued expectations amid structural challenges and ongoing macroeconomic adjustments.\n\nMr Ahmed told Bloomberg that the SBP had managed to build up its foreign exchange reserves by purchasing around $20bn from the interbank market over the past three years. “This was a carefully planned move. Without these purchases, our position would have been very different,” he said.\n\nCommenting on trade, the SBP chief said Pakistani textile exporters are seeing increased interest from US buyers despite a 19pc tariff on their products. He noted that Pakistan has an opportunity to expand its exports as Indian textile goods face a 50pc tariff in the US. However, he acknowledged that high domestic production costs remain a significant barrier to fully leveraging the shift in global trade dynamics.\n\nExporters have raised concerns that, despite the apparent opportunity in the US market, the existing 19pc tariff — on top of a 10pc base tariff — makes it difficult for Pakistani goods to remain competitive due to rising input and energy costs. The governor said that while the window of opportunity exists, it would take time and policy support for exporters to benefit from the shifting trade environment fully.\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/08075244497914e.webp",
  "retrievedAt": "2025-10-12T13:13:42.939Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947335/rate-cut-unlikely-this-month-says-sbp-governor",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T01:50:35.000Z"
}
