{
  "title": "PPP escalates, PML-N tempers attacks on coalition ally - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PPP lawmakers say they refuse to allow their party to be get dragged into ‘Sharif family dispute’\n• CM Maryam avoids direct broadsides against ally; targets PTI instead\n• Bigwigs wade in for behind-the-scenes efforts to secure rapprochement\n\nISLAMABAD / LAH­ORE: After several days of an acrimonious back and forth between the two main partners in the ruling coalition, Tuesday saw a slight shift in tone from both sides.\n\nWhile the PPP stepped up its criticism of the Punjab government, Chief Minister Maryam Nawaz avoided direct broadsides against the PPP, instead shifting her focus to their common foe, the PTI.\n\nThe change of tack was ostensibly the outcome of concerted efforts by leading figures, such as Prime Minister Shehbaz Sharif and President Asif Ali Zardari, who have stepped in to defuse tensions, with the latter also calling on Interior Minister Mohsin Naqvi to play his role for a possible rapprochement.\n\nThe war of words that began some weeks ago with a disagreement over aid mechanisms for flood victims has now expanded to include a row over the water rights of Sindh, the lower riparian.\n\nThe bad blood has escalated to the point that leaders from both sides hold near-daily press conferences to take potshots at the other side.\n\nAt the latest such pres­ser in Islamabad, Senator Palwasha Khan claimed that they were being dragged into “Sharif family’s internal dispute”, going as far as alleging that CM Maryam could not bear to see her uncle sitting in the PM’s chair.\n\nShe also warned that their alliance could be broken off if the tirades continued. “The PPP joined the coalition only to protect democracy, but if it comes to dignity, no alliance is worth maintaining,” Sena­tor Khan warned.\n\nSenator Waqar Mehdi was more direct, saying: “A niece is now conspiring against her uncle,” adding that the PPP should not be dragged into a family quarrel.\n\nHe pointed out that during the previous floods, the PPP had helped 2.8 million people through the Benazir Income Supp­ort Programme (BISP). “It is the only programme with reliable data,” he added.\n\nThe PPP had only suggested that the BISP be used to assist the public, Senator Shahadat Awan said. But the Punjab government, he claimed, was creating controversies to hide its failures.\n\nChange of tact\n\nBut while the PPP ratcheted up the rhetoric, Punjab CM Maryam Nawaz was more guarded in her remarks.\n\nAddressing a ceremony in connection with the “Suthra Punjab Prog­ramme” here on Tuesday, CM Maryam avoided making any direct references to the PPP, focusing instead on their common foe, the PTI.\n\nHowever, she did allude to the part, saying: “I am also cleaning the minds of those who are jealous of Punjab’s development. I am the chief minister of this province. If I don’t speak for Punjab, who will?”\n\n“The waste management system collapsed after Shehbaz Sharif’s government ended. During the four years of the ‘Gogi-Pinky’ era, Pakistan faced the worst administrative conditions, with heaps of garbage piling up in Lahore and other cities across Punjab,” she said, referring to incarcerated PTI founder Imran Khan’s wife Bushra Bibi and her close friend, Farah Khan.\n\nShe said she wished to see Sindh, Balochistan, and Khyber Pakht­unkhwa as clean and developed as Punjab is today. “It is our duty to ensure that the people of Punjab receive their due rights,” Maryam said and urged the people of other provinces to demand better services from their governments.\n\nEven her cabinet colleague, Agriculture Minister Ashiq Hussain, lashed out at the opposition party, alleging that it had broken all global records in ruining the country. “The PTI turned an entire province (KP) into archaeological ruins within 14 years,” he said.\n\nBehind the scenes\n\nLast week, PM Shehbaz met his elder brother and PML-N chief Nawaz Sharif to discuss – among other issues – the growing tensions between the PPP and PML-N.\n\nAccording to party insiders, the PM asked his older brother to play a role in defusing tensions between the two partners.\n\nHowever, Nawaz subsequently travelled to London, while the PM headed to Malaysia.\n\nIn the interim, President Zardari tasked Mohsin Naqvi to try and broker a rapprochement.\n\nIt is believed that Mr Naqvi might could ask the relevant quarters to intervene and get the warring sides to stand down, an insider told Dawn.\n\nAccording to him, the PPP’s grouse in Punjab was not limited to the flood issue.\n\nThe party has made no secret about its unhappiness with CM Maryam’s unwillingness to ‘share power’, especially in terms of bureaucratic appointments.\n\n“The flood and canal issues have increased the already existed distrust between the two parties on this matter,” the source said.\n\nAlthough the PPP has been seeking an apology from CM Maryam for her harsh words, sources say the matter may well be settled without such an apology coming to pass.\n\nPublished in Dawn, October 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:46:37.668Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947364/ppp-escalates-pml-n-tempers-attacks-on-coalition-ally",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T01:49:23.000Z"
}
