{
  "article_id": "2025-01-08_14ecc1cd8b452211d5fef6e0f124aebb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pak-embassy-brussels-commerce-ministry-organize-traces-training-session/",
    "retrieved_at": "2025-08-27T11:27:30.943Z"
  },
  "metadata": {
    "title": "Pak Embassy Brussels, Commerce Ministry organize TRACES training session",
    "author": null,
    "date_published": "2025-01-08T16:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 244,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan08 (APP): Pakistan Embassy in Brussels, in coordination with the Ministry of Commerce, has organized a training session on digital portal Trade Control and Expert System (TRACES) of the European Union. Relevant officials from the government regulators and support organizations including Ministry of National Food Security and Research, Ministry of Maritime Affairs, Animal Quarantine Department (AQD), Marine Fisheries Department and Trade Development Authority of Pakistan participated in the training, a press release on Wednesday said. EU experts from the Directorate General of Health and Food Safety (SANTE) of the European Commission sensitized the participants on portal functionalities, emphasizing its role in facilitating transparent and paperless compliance with international food safety standards. Omar Hameed, Economic Minister at the Pakistan Embassy in Brussels thanked the officials of DG SANTE and emphasized on the importance of collaboration between Pakistan authorities and the European Commission on TRACES to further facilitate the traders and to ensure compliance with EU regulations. TRACES is an official online platform for animal and plant health certification required for importation of animals, animal products, food and feed of non-animal origin and plants into the European Union. It is an indispensable tool used by about 90 countries with more than 113,000 users worldwide for the issuance of sanitary and phyto sanitary certificates and official documents required for import. The main objective of the TRACES system is to streamline the certification process of related entry procedure and to offer a fully digitized and paperless workflow.",
    "summary": "Pakistan Embassy in Brussels, in coordination with the Ministry of Commerce, has organized a training session on digital portal TRACES to facilitate compliance with international food safety standards.",
    "keywords": [
      "TRACES",
      "EU regulations",
      "digital portal",
      "Trade Control and Expert System",
      "animal and plant health certification"
    ]
  },
  "entities": {
    "people": [
      {
        "name": "Omar Hameed",
        "wikidata_id": "Q11319165",
        "sentiment": "Positive"
      }
    ],
    "organizations": [
      {
        "name": "Pakistan Embassy in Brussels",
        "wikidata_id": null,
        "sentiment": "Neutral"
      },
      {
        "name": "Ministry of Commerce",
        "wikidata_id": null,
        "sentiment": "Neutral"
      },
      {
        "name": "European Union",
        "wikidata_id": "Q14847",
        "sentiment": "Neutral"
      },
      {
        "name": "Directorate General of Health and Food Safety (SANTE)",
        "wikidata_id": null,
        "sentiment": "Neutral"
      },
      {
        "name": "European Commission",
        "wikidata_id": "Q11481",
        "sentiment": "Neutral"
      },
      {
        "name": "Trade Development Authority of Pakistan",
        "wikidata_id": null,
        "sentiment": "Neutral"
      }
    ],
    "locations": [
      {
        "name": "Brussels",
        "wikidata_id": "Q84",
        "sentiment": "Neutral"
      },
      {
        "name": "Pakistan",
        "wikidata_id": "Q1511",
        "sentiment": "Neutral"
      }
    ]
  }
}