{
  "article_id": "2025-01-08_e6879facd00b195e434a679327dd8b47",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-committed-to-ensure-optimum-healthcare-facilities-to-people-pm/",
    "retrieved_at": "2025-08-27T11:28:21.162Z"
  },
  "metadata": {
    "title": "Govt committed to ensure optimum healthcare facilities to people: PM",
    "author": null,
    "date_published": "2025-01-08T12:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 880,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "KARACHI, Jan 08 (APP): Prime Minister Shehbaz Sharif on Wednesday said the government was committed to ensure optimum healthcare facilities to people, as these were the foundation for a thriving society and hallmark of clinical excellence, professionalism and ethics. Addressing at the launching ceremony of the AKU Manual of Clinical Practice Guidelines AKU Auditorium, the PM said it was a honour and privilege to be here at the Aga Khan University, a beacon of knowledge and innovation with its unwavering commitment to excellence in medical education, research, and patient care. The launch of the AKU Manual of Clinical Practice Guidelines was a landmark achievement that reflected this institutionas resolve to elevate standards of healthcare, he added. Prime Minister Shehbaz also commended the legacy of the Aga Khan family towards supporting initiatives for the social and economic uplift of our country. He said AKUas Manual of Clinical Practice Guidelines was a valuable resource that could serve as a guiding manual for hospitals and health facilities to provide people with the high-quality, evidence-based care they deserve, which was also the vision of his government. He expressed the optimism that the University would continue to work closely with government institutions and professional organizations to ensure that such practice guidelines were widely distributed and readily accessible. The Prime Minister said countryas healthcare system was unfortunately riddled with many hurdles and challenges, such as limited access to quality care in rural areas, shortages of skilled professionals, and the dual burden of communicable and non-communicable diseases. The quality healthcare for all Pakistanis had always been a critical priority for him, as reflected in Punjabas exemplary track record during his tenure as Chief Minister, he said, adding afrom establishing world-class tertiary care hospitals like Sheikh Zayed to equipping every district with advanced diagnostic tools such as MRI machines, we made significant strides.a He said Pakistan Kidney and Liver Institute and Research Center (PKLI) had also been launched, with the aim to provide advanced care, promote prevention, offer top-tier education, and foster research to bridge science and clinical practice for all, irrespective of specific distinctions. He said PKLI was the first public sector hospital in South Asia to achieve the highest accreditation in healthcare awarded by Joint Commission International (JCI). More than 1200 kidney and liver transplants have been performed successfully to date, with 75% of the patients receiving free or subsidized treatment, he added. He said ainstitutions of global standards and international prestige like AKU and PKLI give us hope, bridging the gap between the many challenges we face and solutions we need, and empowering our healthcare system to evolve and respond to the needs of every citizen.a PM Shehbaz said ain todayas rapidly advancing world, the integration of modern technology, artificial intelligence, and tele-medicine into healthcare is no longer a luxury a it is a necessity.a aBy embedding the best practices outlined in this manual into these advancements, we can revolutionize patient care, expand access to remote regions, and enhance outcomes for millions of Pakistanis,a he added. The Prime Minister said he firmly believed that partnerships and collaborations between visionary institutions like Aga Khan University and the public sector were pivotal for transforming the healthcare landscape of Pakistan. Shehbaz Sharif also congratulated the authors, researchers and contributors of this manual and said the AKU teamas hard work and dedication to improving clinical practices will have a lasting impact on Pakistanas healthcare system. aThese efforts are investments in our nationas future a a future where every citizen, regardless of their background, has access to affordable healthcare.a He said the Aga Khan University had established itself as a shining example of what can be achieved with vision, passion, and perseverance. Earlier, Prime Minister Shehbaz Sharif launched the AKU Manual of Clinical Practice Guidelines, a groundbreaking resource, tailored to Pakistanas diverse healthcare landscape. The launch event was attended by Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar, Governor Sindh Muhammad Kamran Khan Tessori, Chief Minister Sindh, Syed Murad Ali Shah, Federak Minister for Finance & Revenue Muhammad Aurangzeb, State Minister for Information Technology and Telecommmunication Shaza Fatima Khwaja, Ms. Shaza Fatima Khawaja, Coordinator to Prime Minister on National Health Services on Regulation & Coordination Dr. Malik Mukhtar Ahmad Bharath, Chairman of the Aga Khan University Board of Trustees Dr Sulaiman Shahabuddin, Zakir Mahmood and President Aga Khan University (AKU) Dr. Sulaiman Shahabuddin, President of Aga Khan University (AKU). This manual reflects years of rigorous research and dedication to address Pakistanas lack of standardised clinical practice guidelines. Using the GRADE-ADOLOPMENT methodology, it integrates global best practices with local expertise to ensure relevance. The initiative seeks to improve patient outcomes, reduce burden on tertiary care system, and strengthen the countryas healthcare infrastructure. President AKU Dr. Sulaiman Shahabuddin and Dr. Adil Haider and Dean of AKUas Medical College and Editor-in-Chief of the manual also spoke on the occasion. Deputy Prime Minister and Foreign Minister Ishaq Dar, Federal Minister for Finance and Revenue Muhammad Aurangzeb, Federal Minister for Information and Broadcasting Attaullah Tarar, Federal Minister Dr Khalid Maqbool Siddiqui, State Minister Pervez Malik, Coordinator to PM on Health Dr Mukhtar Ahmed Bhart, Sindh Governor Kamran Khan Tessori, Chief Minister Sindh Syed Murad Ali Shah, President Aga Khan Foundation Sultan Ali Alana and experts in health sector were present on the occasion.",
    "summary": {
      "text": "The Prime Minister of Pakistan, Shehbaz Sharif, launched the AKU Manual of Clinical Practice Guidelines at Aga Khan University in Karachi. The manual aims to provide a standardized framework for clinical practices in Pakistan's diverse healthcare landscape.",
      "sentiment": "Positive"
    },
    "keywords": [
      "healthcare",
      "AKU Manual of Clinical Practice Guidelines",
      "clinical excellence",
      "professionalism",
      "ethics",
      "Prime Minister Shehbaz Sharif"
    ]
  },
  "entities": {
    "people": [
      {
        "name": "Shehbaz Sharif",
        "wikiDataId": "Q21618159",
        "sentiment": "Neutral"
      },
      {
        "name": "Sulaiman Shahabuddin",
        "wikiDataId": null,
        "sentiment": null
      },
      {
        "name": "Dr. Adil Haider",
        "wikiDataId": null,
        "sentiment": null
      }
    ],
    "organizations": [
      {
        "name": "Aga Khan University (AKU)",
        "wikiDataId": "Q1438594",
        "sentiment": "Positive"
      },
      {
        "name": "Pakistan Kidney and Liver Institute and Research Center (PKLI)",
        "wikiDataId": null,
        "sentiment": null
      }
    ],
    "locations": [
      {
        "name": "Karachi",
        "wikiDataId": "Q1484",
        "sentiment": null
      },
      {
        "name": "Pakistan",
        "wikiDataId": "Q33",
        "sentiment": null
      }
    ]
  }
}