{
  "article_id": "2025-01-08_2bf90f1bf881c209897625f49ca33d61",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/igp-islamabad-declares-traffic-emergency-targets-crime-free-capital-by-2025/",
    "retrieved_at": "2025-08-27T11:28:19.313Z"
  },
  "metadata": {
    "title": "IGP Islamabad declares traffic emergency, targets crime-free capital by 2025",
    "author": null,
    "date_published": "2025-01-08T13:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 326,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 8 (APP):Inspector General of Police (IGP), Syed Ali Nasir Rizvi, has declared atraffic emergencya in the federal capital, aiming to transform the traffic system and make the city crime-free by 2025 chairing key meetings at the Central Police Office (CPO), on Wednesday. A police spokesperson told APP that the meeting, attended by Chief Traffic Officer (CTO) Islamabad Muhammad Sarfraz Virk, SP CIA Rukhsar Mehdi, SP Traffic, divisional DSPs, in-charge investigation units, and other police officers, focused on IGP Rizvias emphasis on enhancing traffic management and adopting a professional approach to criminal investigations to ensure the safety and convenience of citizens. He said during the meeting, IGP Rizvi has imposed a atraffic emergencya in the federal capital Islamabad, to make the traffic system ideal by 2025. IG Rizvi issued orders to the police officers to maintain the flow of traffic, reduce violations of traffic rules, create convenience for citizens, deploy additional personnel during rush hours, and prevent illegal parking. IG further said that the citizens of Islamabad will experience a noticeable difference in the performance of the Islamabad Traffic Police in 2025. He urged citizens to comply with traffic rules to avoid accidents. He also reviewed the performance of officers in the Investigation Wing, Homicide and SSOIU Units. IGP emphasized that making the city crime-free by 2025 is their main goal. Rizvi instructed all investigation officers to complete investigations in a professional and meritorious manner and to increase the case completion rate this year compared to last year. He also issued orders for all officers to expedite the consolidation of cases under investigation at the start of the New Year and to complete the investigations on a scientific and technical basis. IG Rizvi further said that no accused involved in serious crimes, theft, robbery, or other offenses should escape the grip of the law. Ensuring the security of Islamabadas citizens and providing justice at their doorstep is the top priority of Islamabad Police, he added.",
    "summary": "Inspector General of Police (IGP) Syed Ali Nasir Rizvi has declared a traffic emergency in Islamabad, aiming to make the city crime-free by 2025. He emphasized the need for professional approach to criminal investigations and urged citizens to comply with traffic rules.",
    "keywords": [
      "IGP Islamabad",
      "traffic emergency",
      "crime-free capital",
      "2025 target",
      "Islamabad Traffic Police"
    ]
  },
  "entities": {
    "named_entities": [
      {
        "type": "PERSON",
        "name": "Syed Ali Nasir Rizvi",
        "wiki_data_id": "Q76014431"
      },
      {
        "type": "ORGANIZATION",
        "name": "Islamabad Traffic Police",
        "wiki_data_id": null
      },
      {
        "type": "LOCATION",
        "name": "Islamabad",
        "wiki_data_id": "Q15489"
      }
    ]
  }
}