{
  "article_id": "2025-01-08_1a4e9f487eb2c4f51e59c7e9b3ba1488",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/reforms-in-housing-sector-under-consideration-riaz-pirzada/",
    "retrieved_at": "2025-08-27T11:27:52.298Z"
  },
  "metadata": {
    "title": "Reforms in housing sector under consideration: Riaz Pirzada",
    "author": null,
    "date_published": "2025-01-08T17:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 147,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 08 (APP):Federal Minister for Housing and Works, Riaz Hussain Pirzada said on Wednesday that proposals for reforms in the housing sector are under active review to address the growing challenges in this domain. Speaking informally with journalists, the minister said that a task force has been formed to compile a comprehensive report on the proposed reforms, which will be presented to Prime Minister Shehbaz Sharif within the next two weeks. Key recommendations under consideration included the construction of high-rise residential buildings in various sectors of Islamabad, aimed at meeting the rising demand for housing in the capital city, he added. To alleviate the strain on government-provided housing, the task force is also exploring measures to streamline and enhance the hiring process for private accommodations, the minister added. He said, aThe final decision regarding the implementation of these housing reforms will rest with the prime minister.a",
    "summary": "Federal Minister for Housing and Works, Riaz Hussain Pirzada, announced that proposals for housing sector reforms are under review to address growing challenges. A task force has been formed to compile a comprehensive report on the proposed reforms.",
    "keywords": [
      "housing reforms",
      "Riaz Hussain Pirzada",
      "Shehbaz Sharif",
      "Islamabad",
      "prime minister"
    ]
  },
  "entities": [
    {
      "name": "Riaz Hussain Pirzada",
      "type": "PERSON",
      "wikidata_id": "Q10855158",
      "sentiment": "Neutral"
    },
    {
      "name": "Shehbaz Sharif",
      "type": "PERSON",
      "wikidata_id": "Q16466153",
      "sentiment": "Neutral"
    }
  ]
}