{
  "title": "CCP organizes seminar to mark International Women’s Day",
  "link": "https://www.app.com.pk/national/ccp-organizes-seminar-to-mark-international-womens-day/",
  "date_published": "2022-03-08T16:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP): The Competition Commission of Pakistan (CCP) on Tuesday organized a seminar titled “Policy and Regulation through Gender Lens–for Creating a Level Playing Field”, to marked International Women’s Day.\nThe event discussing the importance of policy and regulation in the context of gender issues and to deliberate ways and means to bridge the existing gaps.\nOver a hundred female participants from different regulatory bodies including State Bank of Pakistan, Federal Board of Revenue, Securities and Exchange Commission of Pakistan and from others attended the seminar, said a press release.\nSpeaking on the occasion, Chairperson CCP Rahat Kaunain Hassan said that the objective of selecting the topic was to recognize share and pursue the seriousness of purpose that was entrusted to the regulators in their respective domains.\nShe said that for ensuring and enhancing economic participation of women on a level playing field, prioritized policy areas with the gender focus may include, education, health, trade and labour policy and promoting women in leadership roles.\nShe also proposed the National Commission on Status of Women to consider building a sectoral data bank of all working or professional women in regulation, law, accountancy, engineering, media, judiciary, IT, medicine, art, architecture or any other field; to break the myth that there are not many qualified women.\nAddressing the seminar, Shahera Shahid, Secretary, Ministry of Information and Broadcasting said that despite the social and economic difficulties, women are excelling in every field with honesty and dignity, where the number of women in key leadership positions in Pakistan has gradually increased.\nSpeaking on the occasion, Sadia Khan said that the SECP has taken various initiatives to promote gender diversity at the workplace by issuing circulars to various sectors to develop gender diversity policy at board levels.\nSima Kamil, Deputy Governor of State Bank of Pakistan (SBP), highlighted the ‘Banking on Equality’ policy, which focuses on increasing the number of women in the banking workforce, moving from gender-neutral to gender intentional policies, ensuring women’s champions at all access points, and overcoming women related data challenges.",
  "retrievedAt": "2025-08-11T14:29:44.032Z"
}
