{
  "title": "Opposition’s no-trust move to be effectively fought, defeated: Qureshi",
  "link": "https://www.app.com.pk/national/oppositions-no-trust-move-to-be-effectively-fought-defeated-qureshi/",
  "date_published": "2022-03-08T16:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Tuesday said that since the opposition had constitutional right to bring a no-trust motion, the government will fight and defeat them in a constitutional, legal and political manner.\n“Imran Khan is an elected prime minister, who was given a heavy mandate by the people of Pakistan in 2018. Who are these people, seeking the resignation of Imran Khan?”, Qureshi questioned said in a statement.\nThe Foreign Minster referred to his conversation with Prime Minister Imran Khan earlier in the day and said, “We will fight back effectively”.\n“This is politics, they will make their efforts and we will defend ourselves,” he said and questioned as to why Pakistan Muslim League – Quaid-e-Azam (PML-Q), Muttahida Quami Movement (MQM) and Baluchistan Awami Party (BAP) – the government’s allied parties – would support them (the opposition parties).\nThe Foreign Minister said that he apprised the Prime Minister of the factors behind the moves of opposition parties, which he said were fighting for their (political) survival.\n“I have some information about the opposition’s movement, which I will soon share with the nation”, he said and added that the people should also ponder over the timing [of the move] and whether it was right or wrong.\nThe Foreign Minister said that the opposition parties, who did not have same manifesto and even did not trust each other, were just striving for their protection and political survival.\nReferring to the bad governance of Pakistan People’s Party (PPP), he said, “if they felt any pain for people, they would not have misgoverned in Sindh so badly, indulged in country’s loot and plunder and damaged the institutions”.\n“PPP has not come out to protect the country but their wealth,” Qureshi remarked and claimed that “Most of the people in their March [political rally] have been brought from Sindh on a package of Rs a 30,000 each.”\nThe Foreign Minister said that the government did not have any fear at all about any of their ultimatum and would fight them effectively.\nHe said that the opposition parties had submitted the no-trust motion by keeping in view their personal interests and it had nothing to do with the interests of common man.\n“Prime Minister Imran Khan will neither not come under pressure, nor, he can be brought under pressure,” Qureshi said and added that whatever decision will be taken by the Prime Minister will be in the interest of country and party.\nThe Foreign Minister said that Pakistan Tehrik-e-Insaf (PTI) members of parliament, who had any reservations, have been contacted.\n“In democracy, some people always have grievances. I believe all party members will take the right decision and will support the Prime Minister in his decisions”, he added.\nThe Foreign Minister referring to the PML-Q said that he had spent a lot of time with Chaurdhry brothers and they were the people of commitment.\n“Chaurdhry brothers have expressed their commitment of support [for the Prime Minister] and we trust their words,” he maintained.",
  "retrievedAt": "2025-08-11T14:29:49.387Z"
}
