{
  "title": "President calls for skills development of Balochistan youth",
  "link": "https://www.app.com.pk/national/president-calls-for-skills-development-of-youth-of-balochistan/",
  "date_published": "2022-03-08T12:55:00.000Z",
  "source": "APP",
  "content": "QUETTA, March 8 (APP): President Dr Arif Alvi Tuesday stressed upon utilizing the potential of youth in Balochistan province through means of modern education and skills development for the country’s progress and prosperity.\nThe president said different avenues were being opened for the talented youth of Balochistan to fully exploit these opportunities.\nAddressing the concluding ceremony of colourful Sibi Mela as the chief guest, the president further said that distances had shrunk in this fast paced world, therefore, every youth in each family of the province should get skill education.\nThe world was anxiously looking towards the youth bulge of Pakistan to tap their true potential, he said, and stressed that youth in Balochistan should avail of the existing skill development facilities in Quetta and Khuzdar.\nThe president said the world was wide open and its ever expanding market was looking towards the skilled youth. “The nations that took advantage of pace of time have always succeeded. My nation requires such progress at a rapid speed,” he added.\nGovernor Balochistan Syed Zahoor Ahmad Agha, provincial ministers and officials and a large number of people witnessed the ceremony.\nEmphasizing the significance of economic stability, he said Pakistan was on the path of becoming a developed nation and Balochistan province was blessed with the wealth of mineral resources, rich coastline and fishery.\nHe stressed upon maximum utilization of modern technology for the progress and prosperity of the province.\nThe president said the government was making efforts to provide such facilities across the length and breadth of the country and resolved that digital skills programmes would be soon provided in all areas of the province.\nHe said under Kamyab Naujawan and Kamyab Pakistan programmes, interest-free loans were being provided by the banks.\nThe president opined that a total of 700 youth in Balochistan were being imparted skills development at Gwadar facility, annually to get jobs. About 2.2 million youth in the country got skilled development education in the last two year ,including those who belonged to the far flung areas, he added.\nExpressing condolences over the loss of lives in the terrorist incidents in the province, the president lauded the armed forces and the nation for their resolve and fortitude. He said Pakistan was the only country in the world that had emerged successful in its war against the scourge of terrorism.\nHe said the way the nation showed solidarity in the past, had set it on the path to become stronger.\nThe president also cautioned that they should remain vigilant over conspiracies against a prosperous and developing Pakistan.\nHe said Pakistani nation had hosted the Afghan refugees on its soil for decades which reflected its humane values, but on the other hand, he regretted that migrating refugees had been left to drown in the open seas.\nThe president said that Pakistan had entrusted the United Nations to resolve the Kashmir issue.\nThe president reiterated that Pakistan is an independent country and it desired friendly ties with all the countries.\nHe observed that global principles should be based upon equity. The Holy Prophet (Peace Be Upon Him) had manifested these principles by declaring that all people, irrespective of caste or creed were equal.\nThe president mentioned the two areas where more focus should be made; including the steps for poverty reduction and provision of health facilities.\nThe government through issuance of health cards had introduced an unmatched state run health insurance system.\nThe president also emphasized upon women’s health, including the malnutrition issues.\nHe said under Ehsaas programme, the government was providing nutrition package and financial support, besides extending scholarships to the girls. The womenfolk must avail of the available opportunities to excel in different fields of life, he added.",
  "retrievedAt": "2025-08-11T14:29:52.819Z"
}
