{
  "title": "FM, Chinese counterpart discuss bilateral ties, regional & global situation",
  "link": "https://www.app.com.pk/national/fm-chinese-counterpart-discuss-bilateral-ties-regional-global-situation/",
  "date_published": "2022-03-08T16:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Tuesday spoke on telephone with China’s State Councilor and Foreign Minister Wang Yi.\nThe two Foreign Ministers discussed bilateral ties and exchanged views on the regional and global situation.\nState Councilor Wang Yi conveyed his condolences on the loss of precious lives in the cowardly terrorist attack in Peshawar and sympathies with the families of the victims.\nThe Foreign Minister underlined that the terrorist act was an attack on the peace-loving people of Pakistan who had rendered tremendous sacrifices to eliminate the scourge of terrorism from the country.\nHe shared the resolve of the government to continue its unrelenting counter-terrorism efforts and bringing the perpetrators to justice, a press release issued here by the Ministry of Foreign Affairs said.\nRecalling successful visit of Prime Minister Imran Khan to China in which various important decisions were taken to advance bilateral practical cooperation, Foreign Minister Qureshi stressed the importance of close coordination between the two sides for early realization of agreed ventures and projects.\nHe expressed satisfaction on the high-quality development of China Pakistan Economic Corridor (CPEC) and accelerating industrial relocation and investments to Pakistan.\nThe Foreign Minister conveyed Pakistan’s concern at the situation in Ukraine and underscored the need for a diplomatic solution in accordance with the relevant multilateral agreements, international law and provisions of the UN Charter.\nHe also shared Pakistan’s concerns over the adverse economic consequences for developing countries resulting from escalating fuel and food costs and disruption of supply chains.\nThe Foreign Minister apprised State Councilor Wang Yi of his outreach to the Foreign Ministers of Ukraine, Poland, Romania, Hungary, Russia and the High Representative of the European Union.\nMaintaining the principled position based on respect for sovereignty and territorial integrity of all states, Pakistan had called for de-escalation and resolution of disputes through dialogue and diplomacy.\nThe Foreign Minister expressed the hope that the talks between Russia and Ukraine would succeed in finding a diplomatic solution.\nThe two Foreign Ministers discussed the continued efforts for peace and stability in Afghanistan and emphasized the need for the international community to sustain humanitarian assistance for the Afghan people.\nThe two Foreign Ministers agreed to remain in close contact.",
  "retrievedAt": "2025-08-11T14:29:42.520Z"
}
