{
  "title": "India fated to see independence of Junagadh state: Nawab Jhangir Khan",
  "link": "https://www.app.com.pk/national/india-fated-to-see-independence-of-junagadh-state-nawab-jhangir-khan/",
  "date_published": "2022-03-08T17:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 8 (APP): Nawab of Junagadh, Nawab Jahangir Khan Jee and Dewan of Junagadh Shahibzada Ahmed Ali on Tuesday said India should keep in mind that Junagadh was and would continue to be part of Pakistan.\nCalling the independence of Junagadh state as predestined for India, they said that time was not far when the Pakistani flag would flutter over the princely state.\nNawab Jahangir Khan Jee and Shahibzada Ahmed Ali were addressing the faculty and students of the National University of Modern Languages (NUML) Rawalpindi Campus to apprise the participants about the Junagadh dispute.\nThey described the slogan of United India as the “biggest fraud” and said that rather India was fated to see the independence of Junagadh state.\nThey also thanked Prime Minister Imran Khan for including Junagadh in the political map of Pakistan and said that even the Hindu population of the state was in favour of acceding to Pakistan.\nNawab Jahangir Khan Jee and Shahibzada Ahmed Ali also called for making Junagadh issue part of the education curriculum both at federal and provincial levels.\nThey told the students and faculty that despite its agreement for accession to Pakistan in 1947, the Muslim-ruled Junagarh state remained under illegal Indian occupation for the last over 74 years.\nThe geostrategic importance of Junagarh and access to the Arabian Sea gave it unique importance for a regional trade route.\nJungadh had the unique dispensation of being the second-largest among Muslim states and a rich one, ranked fifth in terms of revenue generation among the 561 British India princely states.\nIt was one of the major princely states of British India with an area of around 4000 square miles and its own standing army besides a proper system of governance.",
  "retrievedAt": "2025-08-11T14:29:42.964Z"
}
