{
  "title": "IUCN Pakistan, HRDN plants mangroves at Port Qasim to mark International Women’s Day",
  "link": "https://www.app.com.pk/national/440376/",
  "date_published": "2022-03-08T16:18:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 8 (APP): International Union for the Conservation of Nature (IUCN Pakistan) in collaboration with its member organizations Human Resource Development Network (HRDN), Health And Nutrition Society (HANDS) and National Rural Support Programme (NRSP) celebrated International Women’s Day at Tor Island, Port Qasim.\nThe members of HRDN and IUCN staff members also participated in this activity. The participants planted saplings of Rhizophora specie of mangroves to mark the International Women’s Day 2022, said a news release received here.  Chief Executive Officer of HRDN Robeela Bangash briefed the participants on the importance of the day and benefits of mangroves in safeguarding the coast.\nThe activity was carried out under the awareness and capacity building initiatives of the Climate Change Gender Action Plan (ccGAP) project.  IUCN Pakistan is supporting Ministry of Climate Change, Government of Pakistan in developing the first National Climate Change Gender Action Plan (ccGAP) with the readiness grant of Green Climate Fund. ccGAP is built around six priority sectors including forest and biodiversity, integrated coastal management, disaster risk reduction, agriculture and food security, water and sanitation, and energy and transport.\nInternational Women’s Day is a global day to celebrate and acknowledge the social, economic, cultural and political achievements and contribution of women. The day also marks a call to action for accelerating gender equality. Significant activity is witnessed worldwide as groups come together to celebrate this day and highlight the achievements of the shining stars.\nThe campaign theme for International Women’s Day 2022 is ‘BreakTheBias’. Whether deliberate or unconscious, bias makes it difficult for women to move ahead.    “Knowing that bias exists isn’t enough. Action is needed to level the playing field”, it said.\nCoordinator, Coastal Ecosystem, IUCN Pakistan Dr. Babar Hussain briefed the participants about IUCN’s efforts towards mangroves plantation and restoration which spans over more than three decades.   He also appreciated the contribution of the participants by planting the mangroves saplings on the International Women’s Day.",
  "retrievedAt": "2025-08-11T14:29:45.367Z"
}
