{
  "title": "‘Skipper PM’: Ready to fight the match with political dacoits",
  "link": "https://www.app.com.pk/national/pm-confident-ventures-of-political-dacoits-against-him-to-face-defeat/",
  "date_published": "2022-03-08T08:16:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 8 (APP): Prime Minister Imran Khan on Tuesday said all designs and attempts by the gang of corrupt politicians against the government would meet a failure.\nThe prime minister said a skipper in a match was always ready to counter the attack of his opponent.\n“No matter what planning such corrupt do, I am ready to thwart their attempts,” he said in his address at an event in connection with International Women’s Day here at Fatima Jinnah Women University (FJWU).\nImran Khan reiterated that he was committed to continuing waging war against corrupt politicians.\nImran Khan said Pakistan on its creation was envisioned as a country with a rule of law and vowed that he would not give any relief to the corrupt elite who had plundered the national wealth.\n“Once again, I make it loud and clear that I will not extend the gang of thieves and dacoits any relief in the shape of NRO (national reconciliation ordinance),” he said.\nHe said a ‘powerful thief’ was more detrimental to the country for blatantly quashing the sanctity of rule of law.\nHe mentioned that the corrupt politicians owning the exponentially expensive apartments in London were denying to surrender before the law.\nPM Khan said his government of Pakistan Tehreek-e-Insaf would be remembered for the historic steps taken for the empowerment of women in the country.\nHe mentioned that Islam gave inheritance rights to women 1500 years ago, however, regretted that a large population in Pakistan was denying such compulsory rights.\nImran Khan said his government made powerful amendments in inheritance law to ensure ownership of property.\nHe urged the university students to raise awareness among women to get a realization about their rights.\nHe emphasized the role of educated women in the refinement of society and recalled how his mother helped him grow in life.\nThe prime minister mentioned that his government was providing an increased number of scholarships and stipends to girls than boys with a ratio of 60 to 40 percent.\nFederal Minister for Law and Justice Dr Farogh Naseem said Islam provided rights to women including ownership of property.\nHe said during four years of government, structural amendments were made in laws relating to women to avoid delay in the dispensation of justice.\nInterior Minister Sheikh Rashid Ahmed recalled that his efforts in the 90s led to the establishment of FJWU as the country’s first woman university, besides opening up a number of schools for girls.\nHe announced to donate his residence Lal Haveli to be turned into an educational facility for women in the future.\nParliamentary Secretary for Law and Justice Maleeka Bokhari said the government was focusing on ensuring the rights of women, including their economic empowerment.\nShe urged the students of FJWU to raise awareness about the campaign regarding the protection of women’s property rights and help the victim in filing an application in case of denial of her such rights.\nA documentary film highlighting the importance of the inheritance rights of women was screened on the occasion.",
  "retrievedAt": "2025-08-11T14:29:58.035Z"
}
