{
  "title": "UNDP delegation meets Convener of Parliamentary Taskforce on SDGs",
  "link": "https://www.app.com.pk/national/undp-delegation-meets-convener-of-parliamentary-taskforce-on-sdgs/",
  "date_published": "2024-07-18T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 18 (APP): A delegation from the United Nations Development Programme (UNDP) Thursday met with Bilal Azhar Kayani, the Convener of the Parliamentary Taskforce on Sustainable Development Goals (SDGs).\nThe delegation included Regional Advisor Najia Hashemee, Chief Technical Advisor Mary Cummins, Deputy Chief Technical Advisor Ali Al-Bayati, and Program Advisor M. Qasim Janjua.\nThe delegation briefed the Convener on UNDP’s interest in providing assistance and facilitation to the Parliamentary Taskforce on several SDG goals: Goal 5 (Gender Equality), Goal 10 (Reduced Inequalities), and Goal 16 (Peace, Justice, and Strong Institutions).\nThey also discussed plans to initiate a five-year project titled “Integrated Governance Inclusion Program,” set to begin in January 2025 and conclude in December 2029.\nDuring the meeting, Bilal Azhar Kayani elaborated on the plans of the Parliamentary Taskforce on SDGs. He explained that the task force has divided the 17 SDG goals into four categories defined by the United Nations—People, Prosperity, Planet (Earth), and a combined category of Peace & Partnerships—to ensure the dedicated and effective pursuit of the goals.\nEach sub-group within the task force has a sub-convener representing one of the four major parliamentary political parties, both genders, and both houses of Parliament to promote bipartisanship and gender equality.\nThe UNDP delegation expressed confidence in Kayani’s leadership and agreed to extend assistance and support.\nThey aim to maintain a meaningful working relationship with various UN departments and to conduct, participate in, and facilitate sessions aimed at knowledge-building and capacity-building for MPs.\nThese sessions will equip MPs with the knowledge required for meaningful contributions to the legislative process and parliamentary committee meetings related to achieving the 17 SDGs, which are also part of Pakistan’s National Agenda.",
  "retrievedAt": "2025-08-11T03:57:37.000Z"
}
