{
  "title": "NDMA establishes 32 medical camps, 56 relief camps for flood affectees",
  "link": "https://www.app.com.pk/national/ndma-establishes-32-medical-camps-56-relief-camps-for-flood-affectees/",
  "date_published": "2020-09-02T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP):National Disaster Management Authority (NDMA) on Wednesday established 32 medical camps and 56 relief camps in Karachi, besides evacuating some 8,716 marooned persons from the flash flood hit areas of Karachi.\nAccording to latest data released by NDMA, as many as 175 families (1,245 individuals) were evacuated by Armed Forces and District Administration from Yousaf Goth, Sanjrani Town and adjoining Goths, District Karachi.\nSome 299 persons were evacuated with the help of 10 boats in District Dadu by Armed Forces and District Administration.\nIn total, as many as 14,985 tents, 832.2 ton food items, 2,200 mosquito nets, 2,350 plastic mats, 6,000 tarpaulins were distributed among the flood hit area people, besides using 222 de-watering pumps for clearing the stagnant water from the affected areas.\nAccording to break up of distributed items, NDMA distributed 6,000 tents, Balochistan 2,100, Sindh 6,800, Khyber Pakhtunkhwa 72 and  Gilgit-Baltistan distributed 13 tents among flash flood hit areas.\nOut of 832.2 tons food items distributed, NDMA distributed 422.6 tons, Sindh 385 tons, Khyber Pakhtunkhwa 23 tons and relief agencies of Gilgit-Baltistan distributed 1.6 tons food items among the flood hit people.\nSimilarly, from out of 2,956 blankets distributed in flood hit areas, Balochistan distributed 2,150 blankets, Sindh 800, Gilgit-Baltistan 6 among the flood hit people.\nLikewise, 2,200 mosquito nets were distributed among flood affected areas, 450 mosquito nets were distributed by Balochistan and 1,800 by Sindh to save the flood affectees from contracting diseases.\nSimilarly, 1,307 houses were damaged fully and 853 partially in flashflood hit areas of Sindh, Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB) out of which some 368 houses were damaged partially and 254 fully in Sindh, 94 houses were damaged partially and 35 fully , one shop was also damaged in AJK.\nLikewise, 89 houses were damaged partially, 39 fully in Gilgit-Baltistan. One mosque and four bridges were also damaged in GB due to flash floods.",
  "retrievedAt": "2025-08-11T19:45:29.470Z"
}
