{
  "title": "Heavy downpour: Eight died, four injured in district Manshera",
  "link": "https://www.app.com.pk/national/heavy-downpour-eight-died-four-injured-in-district-manshera/",
  "date_published": "2020-09-02T07:18:00.000Z",
  "source": "APP",
  "content": "MANSEHRA, Sep 02 (APP): At least 8 people died and 4 others injured in a flash flood and land sliding triggered by the devastating heavy rains in district Mansehra.\nAccording to the rescue 1122 sources, 8 people died in different accidents including drowning in the river, flash flood and land sliding debris hitting houses.\nIn Hussain Banda village of Tehsil Oghi four people of the same family including one woman and one child buried under the roof as a landslide hit the mud house and lost their lives while Rescue 1122 recovered one injured woman from the rubble of the house and shifted her to King Abdullah Hospital Manshera for treatment. The dead bodies were identified as Fazal Elahi, Muhammad Shabeer and Noor Islam.\nNandhihari stream in Tehsil Oghi was overflooded and threatened residential areas on the banks of either side, many people have evacuated from their houses after the alert from the district administration.\nDC Manshera also constituted a committee which would estimate the losses owing to the heavy downpour, flash flood and land sliding in the area.\nIn another incident a heavy boulder which fell from the nearby hill on a house killed one and injured three others of the same family at the village Chamri Darband, locals have rescued the injured and also recovered the dead body from the debris.\nOn Tuesday late night husband Abdul Majeed son of Said Faqeer and his wife drowned in the flooded river when the Baila Munawar bridge collapsed at village Seemian while another person Basheer son of Kalo also lost his life at Tanda by a flash flood.\nOwing to devastating heavy rain triggered the flash flood and land sliding which also blocked roads and thoroughfares all across the district Mansehra while many electricity feeders were also tripped.\nDC Mansehra issued directives to all concerned departments to remain alert round the clock to tackle any emergency situation.",
  "retrievedAt": "2025-08-11T19:45:39.421Z"
}
