{
  "title": "Electric buses to revolutionize country’s transport sector: Chaudhry Fawad",
  "link": "https://www.app.com.pk/national/electric-buses-to-revolutionize-countrys-transport-sector-chaudhry-fawad/",
  "date_published": "2020-09-02T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Wednesday said efforts were under-way to make Islamabad as the first-ever city of Pakistan to convert its public transport into electric vehicles in near future.\nAddressing a press conference here, the federal minister said “this project would revolutionalize the entire transport sector of Pakistan”.\nChaudhry Fawad said that his keen interest was to launch especially designed bikes for the girls who face transport problems on daily basis while going to their schools and colleges.\nLaunch of electric buses would help reduce travel hazards for these girls and increase their accessibility, he said.\nChaudhry Fawad said around 50 million dollars investment would be made initially in the project of electric buses being implemented by Pakistan and China based companies while manufacturing of the electric buses would be started in the second phase.\nHe said now we were spending billion of rupees on electric wires and poles which would be replaced by batteries in future.\nAfter buses, houses will also be shifted on batteries in future and every house will be able to establish its own grid station.\n“It will be the best scenario for Pakistan that it can produce its own renewable energy through solar and wind resources in the next 10 years and our own Lithium-ion batteries to store that electricity”, he added.\nChaudhry Fawad said after a long period with the support of Special Assistant to the Prime Minister on Petroleum, Nadeem Babar and Energy Minister, Omer Ayub Khan, renewable energy policy had been launched in the country.\nThe biggest failure in the last 20 years, he said, was the country’s inability to manufacture its own combustion engine and related equipment which hindered local manufacturing of cars.\nReferring to another project of Precision Agriculture, the minister stated that high technology farms would be developed including hydroponic, green and open fields farms of two, five and 12.5 acres land with focus on non-traditional agriculture.\nHe said black pepper, avocadoes, cherry tomatoes and other exotic vegetables would be given a complete technology package including drones and censors etc to facilitate the small farmers. Such technology would help revamp the agriculture sector of the country, he added.\nHe said one part of this agriculture initiative had recently got approval from the cabinet which issued license industrial and medical use of hemp which was confused by some people.\nHe said industrial hemp plant (Cannabidiol) had medicinal and industrial uses.\nThe oil extracted from its seeds can be exported internationally, its plant is effective for relieving chronic pains while stem of its plant produces fiber which can replace cotton and boost textile industry.\nHemp has the 25 billion dollars share in the global market and Pakistan can contribute up to one billion dollars in the next three years.\nThe sites for the production of hemp plant had been identified with the help of top bio technology experts in Chakwal, Peshawer and Jehlum due to the favorable climate, he said.\nDirector, International Center for Chemical and Biological Sciences, Dr. Iqbal Chaudhry the hemp plant had the medicinal as well industrial use. It can help relieve chronic pain which is the biggest challenge of the world to cope with.\nOn the industrial side, one option is to grow and export its oil and the other is to create value added products through this oil after thorough research.\n“Billion dollar export target is possible to achieve through making premium product through its oil besides its usage in cosmetics, soaps shampoos and many other personal care items”, he added.\nMember Science and technology Planning Commission, Dr Hussain Abdi, was of the view that the country cannot achieve progress until its science and technology sector would not grow.\nHe termed the issuance of license to allow medical and industrial use of Hemp as an advantageous step and said it will help acquire double production of fiber than the cotton and stimulate local economy.\nAfter extracting the chemical out of Hemp, it can be used in production of bio-energy while there were many ways to monetize this plant, he added.",
  "retrievedAt": "2025-08-11T19:45:36.956Z"
}
