{
  "title": "President directs State Life to pay Group Insurance profit to widow of PTC teacher",
  "link": "https://www.app.com.pk/national/president-directs-state-life-to-pay-group-insurance-profit-to-widow-of-ptc-teacher/",
  "date_published": "2020-09-02T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP): President Dr Arif Alvi while rejecting a representation of State Life Insurance Corporation of Pakistan (SLICP) has directed it to compensate the widow of late PTC teacher within thirty days by paying due profit on the deposited amount since 2006.\nThe president expressed concern over the state of affairs of the petitioner insurance company which initiated unnecessary litigation and delayed payment of profit amount to the widow of a PTC teacher in Multan.\nThe State Life Insurance Corporation Pakistan (SLICP) had made a representation to the president against rejection of a review petition moved before the Wafaqi Mohtasib.\nThe group insurance claim was submitted by Mst. Sakina Begum to the State Life seeking payment of profit on her late husband’s deposit. The State Life had issued a cheque worth Rs 25,000 despite the facts that in other identical cases, an amount of Rs140,000 was paid as Group Insurance.\nThe president rejected the representations with an observation; “it is very unfortunate that a widow is running around since the death of her husband in 2006 to claim a petty sum of an additional Rs 115,000.”\n“It is actually shameful to see such incidents happen in Pakistan,” he pointed.\nThe president directed the petitioner company to hold an inquiry into the matter and report to the Wafaqi Mohtasib in 3 months to identify the reasons and the individuals responsible. He said that individuals or policies responsible for such delay must be identified.\nHe also regretted that the instant case cost the petitioner company time and money as well as testing and wasting time and cost of the institutions like Wafaqi Mohtasib and Presidency.\nThe president advised the State Life Insurance to take a deeper look and modify its unjust regime.\nAccording to details, the deceased Wali Muhammad was working as PTC Teacher (BPS-10) at Government M.C primary school Taraf Daira Multan in BPS-10 and deposited premium at rate of Rs 44 per month under Punjab Govt. Employees Welfare Amended Ordinance. He died on 18.12.2006 while in service.\nAccording to details, the SLICP had filed a representation with the president on 18.03.2020 assailing the order of Wafaqi Mohtasib dated 28.01.2020 in which its review petition was rejected.\nIn an order received by the Company on 17.02.2020, the Wafaqi Mohtasib upheld its earlier ruling in the case dated 27.09.2019 finding no infirmity or illegality and observed that no interference was called for, thus rejecting the review plea filed ‘by the Agency as being devoid of merits’.\nThe Wafaqi Mohtasib in its order on 27.09.2019 held that the complainant was “victimized and discriminated” by the Agency on the payment of Group Insurance Claim of her late husband.\nThe office of Wafaqi Mohtasib directed the agency to redress the grievance of the complainant keeping in view its rules, regulations, policy and the relevant laws, and take disciplinary action against the delinquent officials and inform the office within thirty days over compliance.\nThe Presidency while upholding the verdict of Wafaqi Mohtasib observed on the representation that in the instant case, the original order was made on 27.09.2019 which was forwarded to the petitioner company on 16.10.2019. The company did not assail it by preferring to make a representation before the president. Its review plea was rejected on 28.01.2020 and received by the company on 17.02.2020.\nThe instant representation was filed on 18.02.2020 beyond the statutory period of 30 days so it was fatally hit by the time bar limitation and liable to be rejected outrightly without any condonation of delay, the president further observed.",
  "retrievedAt": "2025-08-11T19:45:29.512Z"
}
