{
  "title": "Pakistan develops first bloodless kidney dialysis machine",
  "link": "https://www.app.com.pk/national/pakistan-develops-first-bloodless-kidney-dialysis-machine-2/",
  "date_published": "2020-09-02T10:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP):Pakistan’s first bloodless risk-free dialysis machine has been developed by Byonyks with collaboration of Ministry of Information, Technology and Telecommunication.\nThe testing and trial data is being gathered for feedback and patient health progress. Pakistan will be 5th country in the world to have its indigenously produced “Bloodless” Dialysis Technology after the US, Germany, Japan, France and China.\nFounder of Byonyks, the medical devices company that developed Pakistan’s first bloodless dialysis machine, Farrukh Usma met with the Minister for IT and Telecommunication Syed Amin Ul Haque, said a news release issued here on Wednesday.\nFarrukh Usman, a Harvard graduate has developed a painless and risk-free dialysis machine with the support of Ignite SEED funding and angel investors.\nByonyks’ unique technology does not require extracting blood out of the human body to perform dialysis.\nPatients can perform bloodless dialysis at home without any supervision with protection from life threatening infections.\nByonyks is Pakistan’s first biomedical device startup that is developing affordable healthcare technologies using state-of-the-art medical engineering.\nSyed Junaid Imam, CEO Ignite, was also present in the meeting.\nDuring the meeting Farrukh apprised the Minister that multiple patients have used the painless dialysis procedure under prescription and supervision of Pakistan’s leading nephrologists.\nSyed Amin Ul Haque appreciated the spirit of Byonyks team for developing first of its kind electromedical equipment in Pakistan and putting the country among the leading comity of the world.\nHe said that this machine would be beneficial for common man and kidney patients would get rid of expensive treatment.\nHe hoped that kidney patients from lower strata of society would also be equally benefited from this technology.\nThe minister said that the Ministry of IT was fully committed to serve the masses and equip country’s youth with technical skills. He assured full support to Byonyks.\nSyed Junaid Imam, CEO Ignite said that our SEED funding continuously looks out for the innovative ideas that could be turned into a commercially viable product.\nByonyks has exceeded our expectations by developing this state-of-the-art dialysis machine that saves the patients from frequent hospital visits, recurring procedural hassles, pain and infections.\nCurrent Blood based dialysis that is being used in Pakistan consumes One Million Liters of water for every 10 patients (per year).\nByonyks’ BloodlessTM Technology saves 97% water in the process. Current Blood based method leads to Hepatitis C and other blood related infections.\nTransporting older parents to a dialysis center twice a day is another pain for both parents and working class people.\nByonyks is preparing for industrial manufacturing of its bloodless dialysis machine.\nThe company hopes to reduce the cost of dialysis significantly.\nThe company was founded by MIT, Harvard graduates and medical device experts, Farrukh Usman, Michael Wollowitz, Eric Flachbart, and Dr. Frank Rudolph, it is backed by Angel investors.",
  "retrievedAt": "2025-08-11T19:45:29.041Z"
}
