{
  "article_id": "2025-03-11_3c2283b52eabb79464818f58ad581d6e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-reveals-plan-to-build-daanish-university-using-190-mln-from-uks-nca-2/",
    "retrieved_at": "2025-08-27T13:34:37.045Z"
  },
  "metadata": {
    "title": "PM reveals plan to build Daanish University using £190 mln from UK’s NCA",
    "author": null,
    "date_published": "2025-03-11T10:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 431,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 11 (APP):Prime Minister Muhammad Shehbaz Sharif on Tuesday announced to construct Daanish University of Applied and Emerging Sciences in Islamabad utilizing 190 million amount that was transferred from the UK's National Crime Agency (NCA) to the Supreme Court of Pakistan's account. The prime minister, while chairing the Steering Committee meeting for the establishment of Daanish University of Applied and Emerging Sciences expressed his gratitude to the Chief Justice of Pakistan for ensuring the smooth transfer of the 190 million to the federal government account. The UK's National Crime Agency (NCA) had returned 190 million to Pakistan, which has been transferred from the Supreme Court to the federal government's account. As per the vision of Prime Minister Shehbaz Sharif, this amount will be utilized for building a state of the art Daanish University. Speaking on the occasion, the prime minister highlighted that Daanish University would be an institution where deserving and talented students will receive high-quality research-based education. He directed the early completion of legal formalities for acquiring land in Islamabad for the university. The prime minister also instructed the swift finalization of the university's charter and other legal matters. Furthermore, he emphasized that Daanish University should be developed as an international-standard technical and applied sciences university. He further directed that the university's architecture should reflect simplicity, with buildings constructed using red bricks and avoiding unnecessary expenditures to minimize costs. He also instructed to recruit highly qualified faculty and teachers for the university, which would be equipped with state-of-the-art technology and advanced research facilities. PM Shehbaz said that the university's curriculum should be prepared as per the international standards. He further directed to form a committee for the appointment of the Vice-Chancellor and a committee for nominating the Board of Trustees. During the meeting, a briefing was given on Daanish University and Daanish Schools and it was highlighted that the prime minister would be the patron of Daanish University, which will be registered as a Section 42 company, with all necessary formalities to be completed within a few days. The university's land has been selected in Sector H-16. Daanish University will operate under the Daanish Trust to ensure financial independence and minimal government intervention. Additionally, it was announced that Daanish Schools would soon be established in Shigar, Gilgit, and Bagh, as well as in Neelum Valley (AJK) and underprivileged areas of Karachi. The meeting was attended by Minister for Planning Ahsan Iqbal, Minister for Economic Affairs Ahad Khan Cheema, Minister for Education and Vocational Training Dr. Khalid Maqbool Siddiqui, Minister for Information and Broadcasting Attaullah Tarar, and senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}