{
  "article_id": "2025-03-11_d2947fd8a8c2d64341d0838c7cc9a410",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-admin-price-checks-in-ramazan-535-raids-100-arrests-rs-157000-fines-in-a-day/",
    "retrieved_at": "2025-08-27T13:34:39.843Z"
  },
  "metadata": {
    "title": "ICT admin price checks in Ramazan: 535 raids, 100 arrests, Rs 157,000 fines in a day",
    "author": null,
    "date_published": "2025-03-11T10:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 11 (APP):The Islamabad district administration escalated its crackdown on overpricing during Ramazan, conducting 535 inspections and arrested 100 shopkeepers, imposed fines exceeding Rs 157,000, and sealed one store for violating government-mandated prices. Meanwhile, 20 subsidized fair-price shops and six Ramazan bazaars reported record sales in the first nine days of the holy month, with citizens praising the measures. According to the spokesman of ICT administration here, eight Assistant Commissioners (ACs) and 30 Magistrates accompanied by district administration teams present in markets for price checks. On Tuesday, district teams launched targeted raids across markets to curb overpricing. Authorities sealed a shop in a prominent commercial area for selling essentials above official rates, marking the strictest action this Ramazan. Price Control Magistrates issued fines totaling Rs 157,000 to violators, while 100 retailers faced arrests for repeated breaches. On the occasion, residents expressed relief as subsidized stalls and Ramazan bazaars maintained stable prices. Over 20 government-run fair-price shops and six seasonal markets witnessed unprecedented footfall, with officials attributing the surge to strict price monitoring. \"The administration's visibility has deterred overcharging,\" said a customer at a Ramazan bazaar. Meanwhile, Deputy Commissioner (DC) Islamabad, Irfan Memon, led daily inspections of markets, directing staff to resolve complaints immediately. \"No grievance will be deferred to tomorrow. Action must be instant,\" he stated. All Assistant Commissioners and Price Control Magistrates remained on-site across zones to enforce compliance. The DC warned that no exceptions would be made for overpricing. \"Legal action will continue indiscriminately,\" he emphasized. Teams were instructed to prioritize public complaints, with a dedicated helpline operational 24/7. The administration highlighted its commitment to providing affordable essentials during Ramazan. Over 6,000 price checks have been conducted since the month began, with fines totaling over Rs 1.2 million. Officials confirmed that subsidized flour, sugar, and cooking oil remained available at fixed rates in designated outlets. Residents were encouraged to contact the district helpline or use a mobile app to report overpricing. The DC assured that all claims would be addressed within hours, with follow-up inspections to ensure compliance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}