{
  "article_id": "2025-03-11_59e1348afbb5c4657b1cd25b6f42039e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/wafaqi-mohtasib-inaugurates-official-whatsapp-channel/",
    "retrieved_at": "2025-08-27T13:33:15.219Z"
  },
  "metadata": {
    "title": "Wafaqi Mohtasib inaugurates official WhatsApp Channel",
    "author": null,
    "date_published": "2025-03-11T15:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 318,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 11 (APP):Wafaqi Mohtasib, Ejaz Ahmad Qureshi on Tuesday said Wafaqi Mohtasib's Office is committed to redressing public complaints relating to maladministration in the federal government agencies and it will continue to make efforts to build greater awareness about the role and scope of work of the institution. He was addressing the inaugural of official WhatsApp channel at the Wafaqi Mohtasib Secretariat. He said that any person aggrieved by the administrative excesses of the government agencies can approach this Office for speedy and free of cost redressal of his complaint. Ejaz Qureshi said that during the year 2024, it received 226,372 complaints out of which as many as 223,198 complaints were redressed within the statutory time limit of 60 days. The institution has also achieved an impressive implementation rate of 93.21% of his decisions in 2024 as against 85.7% in 2023. He stated that expanding outreach and accessibility has always been a high priority for this Office. He observed that the institution has witnessed significant expansion since1983 when it started operation with only four regional offices at provincial capitals which now has presence in 24 major cities including Azad Jammu and Kashmir and Gilgit Baltistan. He said that opening of new regional offices and the greater use of IT tools has introduced further efficiency in the handling of complaints. \"Now, multiple means are available for the general public to lodge their complaints including website, mobile phones, email, hearing via zoom link etc. which provide easy accessibility to the complainants for availing services being offered by this Office\", he maintained. Ejaz Ahmad Qureshi invited the members of civil society and media fraternity to follow the official WhatsApp Channel to remain updated about the activities of the institution. He expressed confidence that the active presence on various social media platforms will greatly contribute towards raising awareness about the institution and enhance its outreach and connectivity with the general public.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}