{
  "article_id": "2025-03-11_61ef0a790c4010684284b00432173da3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cabinet-briefed-on-monitoring-of-essential-commodities-prices-during-ramazan/",
    "retrieved_at": "2025-08-27T13:32:57.094Z"
  },
  "metadata": {
    "title": "Cabinet briefed on monitoring of essential commodities’ prices during Ramazan",
    "author": null,
    "date_published": "2025-03-11T14:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 434,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, March 11 (APP): A meeting of the federal cabinet chaired by Prime Minister Muhammad Shehbaz Sharif on Tuesday was briefed about the monitoring of essential commodities prices during the holy month of Ramazan. This was the first formal meeting of the cabinet following its recent expansion. The prime minister welcomed the new cabinet members and expressed his best wishes for them, PM Office Media Wing said in a press release. The cabinet was briefed by Minister for Planning Ahsan Iqbal regarding the monitoring of essential items prices during the holy month of Ramazan. The prime minister observed that the performance of the Price Control Committee for Islamabad had been very effective and efficient. The cabinet, on the recommendation of the Ministry of Federal Education and Professional Training, approved the Directorate of Religious Education as an affiliated department of the Ministry of Federal Education. On the recommendation of the Ministry of Information Technology and Telecommunication, the meeting also approved the signing of a Memorandum of Understanding (MoU) between Pakistan's National Cyber Emergency Response Team and the National Computer Emergency Response Technical Team/Coordination Center of China to strengthen cooperation in the field of cyber-security. The objective of the MoU is to promote collaboration in research, consultation, and training related to cyber-security. Furthermore, under this MoU, coordination on preventing cyber-attacks, policy development, cyber-security drills, exchange of cyber-security intelligence, capacity building, and awareness promotion in the field of cyber-security would be ensured. The cabinet, on the recommendation of the Ministry of Information Technology and Telecommunication, approved an agreement between the United Nations' International Telecom Union (ITU) and the Ministry of IT & Telecom, Government of Pakistan, for the establishment of an ITU Accelerator Center. Under this agreement, Pakistan's National Incubation Center in Islamabad would function as an IT Accelerator Center, by enhancing its capacity. The meeting, on the recommendation of the Ministry of Maritime Affairs, approved the appointment of Syed Jarrar Haider Kazmi as the Chief Executive Officer of Pakistan National Shipping Corporation. While on the recommendation of the Ministry of Maritime Affairs, it also approved a one-year extension in the secondment period of Commodore (OPS) Rizwan Ali Munawar as Commandant of the Pakistan Marine Academy, Karachi. The cabinet, on the recommendation of the Ministry of Human Resource Development and Overseas Pakistanis, approved the appointment of Engineer Syed Musarat Hussain as the Chief Executive Officer of Pakistan Real Estate Investment & Management Company (Private) Limited. The meeting endorsed the decisions made during the Economic Coordination Committee meeting held on February 20, and the decisions taken in the Cabinet Committee on Legislative Cases meeting held on March 4.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}