{
  "title": "NDMA directs departments to strengthen coordination for disaster mitigation, contingencies",
  "link": "https://www.app.com.pk/national/ndma-directs-departments-to-strengthen-coordination-for-disaster-mitigation-contingencies/",
  "date_published": "2023-07-25T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP): The Acting Chairman NDMA on Tuesday presided over a special NEOC session with key stakeholders on the current monsoon situation and instructed relevant departments to strengthen coordination among all departments concerned to streamline disaster mitigation and contingencies plans.\nThe session was attended by representatives of Pakistan Meteorological Department (PMD), Federal Flood Commission (FFC), Provincial Disaster Management Authorities, State Disaster Management Authority and Gilgit Baltistan Disaster Management Authority (PDMAs/SDMA/GBDMA), Armed Forces, Flood Forecasting Division (FFD), Mangla and Tarbela Dam Management Authorities, SUPARCO and Pakistan Commissioner for Indus Waters (PCIW), a news release said.\nThe Acting Chairman NDMA reviewed the situation of major Dams and the regulation of river flows during ongoing monsoon spells.\nThe Tarbela Dam Management briefed that 80 percent has been filled of its full capacity, howsoever there is no flood-like situation expected and impacts on downstream population as of now.\nThe Mangla Dam Management Authority briefed that the facility is nearly 76 per cent filled of its full capacity and experiencing low-level flood conditions. It was informed that detailed mock exercises were planned with relevant authorities to handle monsoon contingencies.\nThe FFD reported that there is less chance of rainfalls over catchment areas of major rivers till July 26. However, heavy rain spells are expected from July 27th to 30 over catchment areas of rivers Indus & Kabul which may trigger flash flooding and high flows in the tributaries of these rivers.\nThe SUPARCO provided updates on the current situation of Badswat Glacial lake and shared satellite images of hazard-prone GLOF sites in Gilgit-Baltistan and Khyber Pakhtunkwa.The PCIW briefed about the current situation of Indian Dams including Bakhra, Pong and Thein and informed that releases from these reservoirs are still within limits.\nThe Acting Chairman NDMA also emphasized undertaking public awareness campaigns to maximise the general public’s knowledge on risk associated with monsoon season and enhance vigilant monitoring of rivers and reservoirs during monsoon season.",
  "retrievedAt": "2025-08-11T08:59:30.303Z"
}
