{
  "title": "Rana Tanveer inaugurates IIUI’s Academic & Exams Block",
  "link": "https://www.app.com.pk/national/rana-tanveer-inaugurates-iiuis-academic-exams-block/",
  "date_published": "2023-07-25T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP): Federal Minister for Education and Professional Training Rana Tanveer Hussain on Tuesday inaugurated the Academics and Examination Block at International Islamic University Islamabad (IIUI.\nThe block has been built with the Saudi funding to facilitate the students as per international standards and modern technology requirements.\nThe minister on the occasion was given a briefing by IIUI President Dr Hathal Homoud Alotaibi. He was told that the new academic block and the Students Facilitation Centre would be equipped with modern technology, state of the art gadgets and well-trained staff.\nSenator Dr Hafiz Abdul Karim, Special Assistant to the Prime Minister, was also present on the occasion.\nSpeaking on the occasion, Rana Tanveer thanked the Custodian of the Two Holy Mosques King Salman bin Abdul Aziz Al Saud and Saudi Crown Prince Mohammed bin Salman for extending consistent cooperation to the university, which was one of the best universities in Pakistan.\nHe said the IIU was a promising seat of learning as it was providing quality education to more than 30,000 students, including those from more than 40 countries.\nHe appreciated the efforts and vision of Dr Hathal Homoud Alotaibi, saying his student centric approach was laudable and “this new facility to solve the issues of the students with use of modern technology is a useful addition”.\nHe said the university was heading towards right direction under his leadership, and called upon the universities to replicate the IIUI approach for students facilitation.\nTalking about the Saudi assistance to the university, Rana Tanveer said since its inception Sauid Arab had been extending cooperation to the IIUI.\nThe establishment of the new facility with the financial assistance of Saudi government was an omen of that cooperation, he said, adding Pakistan and Saudi Arabia were time tested friends, and their ties were getting stronger by each passing day.\nPakistanis had a strong emotional attachment to the holy land of Saudi Arabia, he added.\nThe minister also appreciated the role of the university leadership in its progress and appreciated keen interest of the Pro-Chancellor Dr. Prof. Dr. Ahmed bin Salem Al Ameri.\nThe minister along with the IIU President also visited different offices of the Directorate of Academics and Examination including international office, admission office and fee section at both male and female sides.\nHe was also briefed about the mechanism and procedures to resolve the issues of students related to academics and examination under one roof without any delay.",
  "retrievedAt": "2025-08-11T08:59:23.310Z"
}
