{
  "title": "PM for owning IT talent through maximum financial, professional support",
  "link": "https://www.app.com.pk/national/pm-for-owning-it-talent-through-maximum-financial-professional-support/",
  "date_published": "2023-07-25T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 25 (APP): Prime Minister Shehbaz Sharif on Tuesday said that maximum financial and professional support to the youth was inevitable to untap their immense potential in information technology which could also guarantee the county’s prosperity.\nThe prime minister, addressing the launching ceremony of PM’s Freelancer and Venture Capital Initiative, and National Innovation Award Investor Connect here, said the network of incubation centers needed to be spread across the country by carving out maximum funding keeping in view the country’s future.\nHe said considering the talent and importance of the IT, Rs 2 billion allocated for venture capital was just “peanut”, though it was scraped by the government despite financial constraint.\nThe prime minister was “taken aback” as he visited the stalls and was briefed about the innovative projects prepared by the youngsters including drones for agriculture purposes, IT-led medical systems, and usage of banana peels for different products.\n“I really salute all of you,” the prime minister remarked and particularly lauded Sahar Munir, a girl from Naushki for her vision and ideas to promote the IT sector.\nHe said the network of incubation centres should have been spread countrywide some 10 years ago and recalled the establishment of such a center at Arfa Karim Tower in 2009 while being the Punjab chief minister.\n“This is the untapped talent across Pakistan which we have to own. This is our responsibility to arrange trainings and provide maximum funding,” he said and called for holding similar innovation award ceremonies in other parts of the country.\nHe said the funding for the IT endowment fund should be increased by billions annually to capacitate the youngsters and support their research and development.\nPrime Minister Shehbaz, who earlier launched the initiatives and gave away awards among top 10 winners of the second round National Innovation Award, also instructed the formulation of a coordinated mechanism and a policy framework for the IT sector for onward cabinet approval so that the interim government could carry the projects forward without any impediment.\nHe said the whatsoever party forms the next government, they should facilitate the IT sector which, if supported for next five years, could bring in billions of dollars to the country.\nIn his address, Minister for IT and Telecommunications Syed Aminul Haq said his ministry was coordinating and cooperating to execute the prime minister’s vision of Digital Pakistan.\nHe said the ministry was facilitating around 20 incubation centres in various parts of the country.\nHe told the gathering that the efforts were underway to enhance women participation in the IT start-ups as during last five years, out of 1387 start-ups, 37% were were women.\nHe said the IT ministry was endeavoring to increase connectivity as a prerequisite for the IT growth. He said during his ministerial term, the cellphone users grew from 160 million to 195 million and broadband users from 70 million to 122 million.\nSpecial Assistant to PM on Youth Affairs Shaza Fatima Khawaja said that the ceremony marked the second round of National Innovation Award with 50 winners and connect them with the investors to capitalise their ideas.\nShe said the government had allocated Rs5 billion for the IT sector including Rs2 billion for venture capital and Rs 1 billion each for IT training and IT endowment fund. Besides, Rs 200 million have also been specified for the women-led business venture, she added.\nThe event also marked the playing of a short documentary on two rounds of PM National Innovation Awards as well as the testimonials by two award winners who apprised the audience about their projects and vision.",
  "retrievedAt": "2025-08-11T08:59:25.658Z"
}
