{
  "title": "Governor KP invited eunuchs to Governor House, distributed ration",
  "link": "https://www.app.com.pk/national/governor-kp-invited-eunuchs-to-governor-house-distributed-ration/",
  "date_published": "2024-03-31T12:10:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 31 (APP): Governor Khyber Pakhtunkhwa Haji Ghulam Ali Sunday invited transgender women to Governor House and handed over Ramadan Ration packages to more than three hundred transgender women.\nIt is for the first time that the Governor KP Haji Ghulam Ali invited us and gave hospitality to us, the lower classes of the province and city, a Transgender told media men, soon after visiting the Governor House.\nGovernor Haji Ghulam Ali welcomed hundreds of eunuchs from across the city to the Governor House. Governor Khyber Pakhtunkhwa and Mayor Peshawar Haji Zubair Ali have given Ramadan ration packages to more than three hundred transgender women on this occasion.\nThe three groups of eunuchs headed by eunuchs Arezo, Farzana and Subia are present in the Governor House. A Ramadan ration package worth thousands of rupees per person is being distributed to more than three hundred transgender women.\n“I will be a voice in the departments responsible for transgender,” the Governor said on this occasion. There is full hope that the federal and provincial governments would play their full role in solving the problems of transgenders,” said Governor Haji Ghulam Ali.\nTechnical education is very important for transgenders, the Governor said. Transgender will be made employable, allocation of quota in government recruitment is the need of the hour and they have the right, Governor Haji Ghulam Ali in his address at the ration distribution ceremony to eunuchs.\nHaji Ghulam Ali was heartbroken to hear the problems of eunuchs. Some legitimate issues are necessary for the federal and provincial governments, Haji Ghulam Ali said. Among the important issues are burial and funeral prayers in the graveyard, Haji Ghulam Ali said.\nEunuchs have problems in the hospital, Haji Ghulam Ali said, adding, “I will talk to the provincial government and the federal government about the issues of eunuchs.” Haji Ghulam Ali will try for a separate cemetery. He also directed Deputy Commissioner Peshawar to include eunuchs in the package of 10,000.\nThis is the first time that packages are being given to eunuchs in the Governor House and for this we are morally and ethically bound to do so, Haji Ghulam Ali said.",
  "retrievedAt": "2025-08-11T01:39:11.753Z"
}
