{
  "title": "President reaffirms commitment to breast cancer eradication efforts",
  "author": null,
  "content": "ISLAMABAD, Oct 18 (APP):President Asif Ali Zardari said that Pakistan stood in solidarity with the global community and renewed its firm commitment to save lives throughbreast cancer awareness, prevention and access to care efforts.\nThe president, in a message, said each year, the world observed International Breast Cancer Awareness Day on 19th October to unite efforts for early detection, effective treatment and improved survival.\n“Breast cancer remains the most frequently diagnosed cancer among Pakistani women, accounting for nearly one-third of all cancers that affect women in the country,” he observed.\nThe president said it affected women across all age groups and socio-economic backgrounds yet, if detected early, it was highly treatable with a survival rate exceeding 90 percent.\n“Our collective challenge lies in breaking the silence, dispelling stigma and ensuring that no woman delays screening or treatment due to fear or financial barriers,” President Secretariat Press Wing, in a press release, quoted the president as saying.\nThe Government of Pakistan, under the leadership of the Ministry of National Health Services, Regulations & Coordination (M/o NHSR&C), is taking comprehensive measures to address this growing health concern, he said, adding key interventions included, establishment of dedicated breast cancer clinics at tertiary hospitals and selected provincial teaching hospitals, providing free mammography and diagnostic services and training of lady health workers (LHWs) and primary care providers to identify early symptoms and guide women toward screening and treatment facilities.\nThe integration of breast cancer screening into Primary Health Care (PHC) and Reproductive, Maternal, Neonatal, and Child Health (RMNCH) programs to promote community-based awareness and nationwide awareness and advocacy campaigns every October through media, universities, and public institutions, in collaboration with partners such as WHO, UNFPA and provincial health departments.\nThe president said “The Government is working for development of the National Cancer Registry and Cancer Control Program which includes population-based data on breast cancer to inform evidence-based policies. The expansion of telemedicine and digital health services to reach women in remote and underserved areas for consultations, follow-up and counseling has added value to the prevention of breast cancer.” Beyond these interventions, the president stressed that the government continued to promote public-private partnerships, encouraging philanthropic and private sector investment in cancer prevention, research and patient support initiatives.\nOn this day, he called upon all Pakistanis—men and women alike—to join the national movement for awareness and early detection.\n“Encourage your mothers, sisters, wives and daughters to conduct regular self-examinations, participate in clinical screenings and seek medical help without hesitation. Early diagnosis can save lives, preserve families and strengthen our nation,” he emphasised.\nAs president of the Islamic Republic of Pakistan, he reaffirmed the government’s unwavering commitment to eliminate preventable deaths from breast cancer through awareness, access and accountability. Together with compassion, science and sustained national effort, he said they can ensure that every woman in Pakistan lives with health, dignity and hope.\nThe president also prayed for success of their efforts, grant healing to the ailing and for nation’s health and resilience .\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-20T18:07:46.375Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-reaffirms-commitment-to-breast-cancer-eradication-efforts/",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T22:59:00.000Z"
}
