{
  "title": "Pakistan moving forward to achieve economic growth: PM",
  "author": null,
  "content": "JAHANIAN, Oct 18 (APP): Prime Minister Muhammad Shehbaz Sharif Saturday said that Pakistan’s economy had achieved stability, financial indicators were positive and the country was moving forward to gain economic growth.\nHe was speaking to ministers, members of Parliament and Punjab assembly at the residence of member National Assembly Chaudhry Iftikhar Nazir.\nHe said when his government came in power, the country was facing difficult economic conditions and the government had to sign an agreement with International Monetary Fund (IMF) to save Pakistan from economic default.\nHe said that during the last one and a half year, the federal and Punjab governments had served Pakistan and Punjab well.\nDuring a recent meeting, he said he appreciated Chief Minister Punjab and her team for their efforts to help people during floods.\nHe appreciated the Punjab government for its excellent performance in the areas of health, education, transport, communication and road construction.\n“We are serving Pakistan day and night with hard work, honesty and sincerity,” he remarked.\nHe said Pakistan defeated India in the four day war and achieved victory with the prayers of the people and bravery of the Pakistan army, navy and air force.\nPakistan’s armed forces led by Field Marshal Syed Asim Munir and Air Chief Marshal Zaheer Ahmed Baber wrote a new chapter as they resoundingly defeated India, he observed adding the government also achieved success on the diplomatic front and signed a defence pact with Saudi Arabia.\nThe Saudi leadership expressed its strong affinity with Pakistan, he mentioned.\nThe Prime Minister said during his visit to New York and Washington, he held meetings with the US President Donald Trump and along with leaders of the Islamic countries, played role to stop the oppression in Gaza.\nThe situation in Gaza was very bad as women, children, youth and elders were getting martyred and schools and hospitals were being destroyed, he continued.\nThe prime minister said ceasefire had been reached in Gaza and the massacre had stopped for which the credit went to the Islamic countries and President Donald Trump.\nHe urged the political leadership to work together for the economic progress of Pakistan and develop the country according to the vision of Quaid e Azam Muhammad Ali Jinnah and Allama Iqbal.\nHe said Field Marshal Syed Asim Munir was fully supporting the government’s efforts for economic development.\nHe said that he congratulated the newly elected Khyber Pakhtunkhwa chief minister and told him that the federal government was ready to work with him in the interest of Pakistan.\nThe federal government is supporting the governments of Balochistan, Azad Kashmir and Gilgit Baltistan in their endeavours for the welfare of their people, he added.\nEarlier, the prime minister visited the residence of Member National Assembly Muhammad Khan Daha in Khanewal and offered Fateha for former provincial minister Punjab late Haji Irfan Ahmed Khan Daha.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-20T18:07:26.071Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-moving-forward-to-achieve-economic-growth-pm/",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T18:11:00.000Z"
}
