{
  "title": "PML-N pursues dangerous narrative of targeting state institutions: Ch Fawad",
  "link": "https://www.app.com.pk/national/pml-n-pursues-dangerous-narrative-of-targeting-state-institutions-ch-fawad/",
  "date_published": "2020-10-17T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP):Federal Minister for Science and Technology, Chaudhry Fawad Hussain Saturday said Pakistan Muslim League (N) is pursuing a dangerous narrative of targeting army and judiciary which would never be succeeded.\nThe opposition parties, gathered on the issue of accountability, must understand that they would not be given any relief in their cases today, tomorrow or in future, the federal minister said while talking to the media here.\nChaudhry Fawad said Nawaz Sharif will be brought back to the country to face imprisonment or pay back the looted money to the masses.\nThe minister stated that the opposition parties have miserably failed in the yesterday’s public meeting after facing masses’ rejection. They should learn a lesson and cancel the next public meetings from now, he said.\nHe said the opposition parties after spending crore of rupees could manage to gather only 15,000 to 18,000 people in the Gujranwala city which has a big population.\nThe people of Gujranwala, Sialkot and Narowal people whose hearts beat with the Kashmiri people rejected the agenda of Pakistan Democratic Movement (PDM).\nHe said Maulana Fazal-ur-Rehman who is the head of the alliance was given opportunity by the Pakistan Muslim League (N) and Pakistan People’s Party at 2:00 am to address in front of empty chairs.\nCommenting on the Nawaz Sharif speech, the federal minister said Nawaz Sharif behaved like an angry beloved who is still unable to understand that how he could take revenge of his rejection.\nCriticizing the insulting narrative about the army, the federal minister warned the Muslim League N leaders not to indulge in dangerous games.\nHe said he belonged to Jhelum which is the city of martyrs and had great respect for the soldiers who render their lives for integrity of the country.\nHe also criticized the PML-N narrative of favoring soldiers and insulting generals and said the political party was trying to create divisions and conflict between the higher ranked and lower ranked officials of army which is the Indian agenda.\nThe minister said that he was not in favour of granting permission to Nawaz Sharif to move out of country as when such people move abroad, they become Altaf Hussain and an asset for international establishment.\nHe said there is not even a single lieutenant general, general, brigadier and even head of intelligence agencies who has not faced bullets during the last 20 years.",
  "retrievedAt": "2025-08-11T19:54:55.069Z"
}
