{
  "title": "CM approves reform plan to improve utilization of Primary healthcare facilities",
  "link": "https://www.app.com.pk/national/cm-approves-reform-plan-to-improve-utilization-of-primary-healthcare-facilities/",
  "date_published": "2020-10-17T11:35:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 17 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan has agreed to the proposed reforms plan to improve utilization of Primary Healthcare Facilities and approved in principle the establishment of Primary Care Management Committees along with composition for Basic Health Units and Rural Health Centers.\nChairing a meeting of health department held here at CM House, Mahmood Khan said that establishment of Separate Management Committees for Primary Health Care Institutions was need of the hour.\nHe added that the ultimate goal of overall efforts was to ensure efficient services delivery for which billions of rupees were being spent.\n“We would have to ensure result-oriented utilization of these resources at all cost”, he added.\nOn the occasion, meeting was briefed about proposed reforms in Primary Healthcare System, establishment of Management Committees and other related matters. It was said that almost Rs. 10 billion was being spent as the operational budget of over thousand Primary Healthcare Facilities in the province.\nThe meeting was apprised that the health department was also developing a policy to introduce rapid diagnostic tests at all Primary Healthcare Facilities including blood glucose, hemoglobin, Pregnancy, HIV, Malaria, Dengue and Hepatitis B&C.\nIt was told that proposed model was tested in a total of 20 BHUs and RHCs of Peshawar district and positive results had been noticed.\nThe forum was apprised that in primary health care facilities some 882 primary care management committees would be constituted whereas in secondary health care hospitals 108 health management committees would be formed .\nThe forum was also briefed in detail about the proposed constitution of committees, their objectives, responsibilities and utilization of funds.\nProvincial Minister for Health Taimur Saleem Jhagra, Special Assistant to CM on Information Kamran Bangash, Principal Secretary to CM Shahab Ali Shah, Secretary Health Imtiaz Hussain Shah and other concerned officials attended the meeting.",
  "retrievedAt": "2025-08-11T19:54:53.079Z"
}
