{
  "title": "Ehsaas celebrates Int’l Day for Poverty Eradication through interacting with beneficiaries",
  "link": "https://www.app.com.pk/national/ehsaas-celebrates-intl-day-for-poverty-eradication-through-interacting-with-beneficiaries/",
  "date_published": "2020-10-17T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP):Ehsaas hosted a high-level virtual event on Saturday to celebrate the International Day for the Eradication of Poverty through interacting with the beneficiaries of various mainstream Ehsaas programs to get their valuable suggestions for making this initiative more effective.\nThe event brought together four executing agencies of Poverty Alleviation and Social Safety Division (PASSD)- BISP, Pakistan Poverty Alleviation Fund (PPAF), Pakistan Bait-ul-Mal (OBM) and Trust for Voluntary Organizations (TVO) along with beneficiaries of various priority programs of Ehsaas.\nThis was the first time in the history of the country that marginalized came to the table with the government and policy makers and gave valuable suggestions to make the Ehsaas strategy more responsive in the context of post COVID-19.\nSAPM Dr. Sania Nishtar moderated the session along with Secretary PASSD Muhammad Ali Shahzada.\nThe main highlight of the occasion was an engaging interaction with beneficiaries of various mainstream Ehsaas programs and initiatives particularly Ehsaas Kafaalat, Ehsaas Interest Free Loans, Ehsaas Amdan and Ehsaas Nashonuma.\nThis session was followed by an insightful conversation with partner NGOs of TVO.\nConnecting with Ehsaas beneficiaries, SAPM Dr. Sania Nishtar said, “Fighting poverty has always been one of the top priorities of our government. Ehsaas is fully determined to ensuring social and environmental protection for all. The growing recognition of the multi-dimensionality of poverty indicates that these two issues are inseparably interlinked, and that social protection cannot be fully grasped without addressing environmental issues at the same time.”\nShe said, “At the core of each of the Ehsaas initiatives- Kafaalat, interest free loans, Amdan, undergraduate Scholarship, Nashonuma, emergency cash, Langars and Panagahs which fall under Ehsaas is the principle of inclusivity centered on social and environmental protection.”\nLater in the day, Dr. Sania Nishtar visited Pakistan Poverty Alleviation Fund and Pakistan Bait-ul-Mal and spent the day with Ehsaas beneficiaries. Dr. Sania sat and interacted with them to gain insights on their aspirations and key problems being confronted by them. She listened to their concerns and assured full cooperation to address their problems.\n“To make the Ehsaas programme more responsive, the voices of the marginalized are critical”, she said.\n“The cash disbursal arrangements were very well made at Ehsaas Emergency Cash campsites as compared to those at small retail outlets for Kafaalat”, said Memoona Bibi, a Kafaalat beneficiary from Peshawar.\nTahira Bibi, an Ehsaas interest free loan beneficiary from Layyah shared, “I want to act as a role model for women in my village to get them involved in income generation activities supported by Ehsaas poverty graduation programmes”.\nHakeem Khan, a beneficiary of Ehsaas Amdan from Battagram has set up a small enterprise to generate income for his family.\nHe said, “The rule-based procedures and demand driven approaches adopted under Ehsaas are highly commendable.”\n“I am running an online trading business through a computer training provided to me under Ehsaas though Pakistan Bait-ul-Mal’s Women Empowerment Centre in Islamabad.” “With the support of Ehsaas”, she asserted, “we can tackle poverty”.\nSamina Waseem and Khalida Parveen are Kafaalat beneficiaries from Lahore and they happily shared that their children have also been enrolled in the ongoing Waseela-e-Taleem recently reformed under Ehsaas.\nAt the occassion, Makhdoom Hashim Jawan Bakht Provincial Minister for Finance Punjab, Hasham Inamullah Khan Provincial Minister for Social Welfare KP, senior representatives from other provinces including GB and AJK, and senior officials of international development organizations also joined virtually.\nGlobal extreme poverty is expected to rise in 2020 for the first time in over 20 years as the disruption of the COVID-19 pandemic compounds the forces of conflict and climate change, which were already slowing poverty reduction progress, the World Bank said today.\nThe COVID-19 pandemic is estimated to push an additional 88 million to 115 million people into extreme poverty this year, with the total rising to as many as 150 million by 2021, depending on the severity of the economic contraction.\nThis year marks the 27th anniversary of the declaration by the General Assembly, in its resolution 47/196 of 22 December 1992, of 17 October as the International Day for the Eradication of Poverty.",
  "retrievedAt": "2025-08-11T19:54:53.542Z"
}
