{
  "title": "Rana Sana Ullah directs establishment of CTD, SPUs in AJK",
  "link": "https://www.app.com.pk/national/rana-sana-ullah-directs-establishment-of-ctd-spus-in-ajk/",
  "date_published": "2023-02-14T12:50:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Feb 14 (APP): Interior Minister Rana Sana Ullah has directed the authorities to establish a counter-terrorism department (CTD) and special protection units (SPUs) for the security of foreigners working in different projects in Azad Jammu and Kashmir (AJK).\nThe federal minister issued these directives while chairing a high-level meeting here on Tuesday to review the security arrangements for foreign nationals working in AJK and counter-terrorism measures being enforced by the region’s government.\nThe meeting was attended by Federal Secretary Interior Division Yousaf Naseem Khokhar, NECTA chief Rai Tahir, Chief Secretary and IGP AJK, Special Secretary home affairs AJK, Commissioner Muzaffarabad Division and other officials of the AJK government.\nChief Secretary Muhammad Usman Chachar and Inspector General Police (IGP) Ameer Shaikh gave a detailed briefing about the law and order situation, security measures adopted by the law enforcement agencies, details about foreign nationals working in different projects in the region, security measures for their protection and counter-terrorism measures taken by the authorities.\nFederal Minister while addressing the meeting said that government will never compromise on the issue of law and order and security measures, particularly the security of foreign nationals.\nHe directed the management of projects where foreign nationals were working to take foolproof security arrangements within 30 days and strictly implement the law for spending one percent of their income on security measures and protection of foreign workers.\nThe meeting decided to provide the required funds for the establishment of CTD and SPUs in AJK and every cooperation will be extended to AJK in order to enhance the capacity of security institutions and maintain law and order besides preparing the Police to fight terrorism.",
  "retrievedAt": "2025-08-11T06:04:09.950Z"
}
