{
  "title": "Senate body directs to take actions against encroachment",
  "link": "https://www.app.com.pk/national/senate-body-directs-to-take-actions-against-encroachment/",
  "date_published": "2023-02-14T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): The meeting of Senate Standing Committee on Housing and Works held on Tuesday deliberated on the illegal construction and encroachment in government residences.\nThe meeting was chaired by its chairman Senator Haji Hidayatullah Khan.\nSenior Joint Secretary of the Ministry of Housing and works Asfaq Ghuman apprised the committee that no construction in government residences could be done without prior approval from the ministry concerned, said a press release.\nHowever, a committee had been constituted in the Estate office which had conducted a survey of residences and issued notices to the allottees involved in illegal construction, the joint secretary apprised.\nSenator Haji Hidayatullah directed the ministry to provide the list of allottees to whom the notices had been issued and recommended the departments of alleged allotees to take stern action against them under the efficiency and discipline rules.\nMoreover, as to the matter relating to appointments made by FGEHA during the last two years. Director Admin Zeshan Qasim informed the committee that jobs in various positions were advertised last year and the recruitment process was conducted through NUST and NTS testing services.\nSenator Saifullah Abro asked the ministry to provide a copy of the advertisement and tender through which the services of former agencies had been acquired. However, the ministry failed to provide the same.\nSenator Haji Hidayatullah Khan questioned how many persons had been appointed in the recent period. To which, Director Admin told that 95 persons had been appointed against the 97 advertised posts.\nThe chairman stated that these appointments had been made without following due process and therefore directed the ministry to initiate an inquiry against the persons appointed to the said posts.\nThe committee was also briefed about the budgetary proposals relating to Public Sector Development Program (PSDP) for the financial year 2023-24. Senior Joint Secretary for Ministry of Housing and Works apprised the committee that a total of 413 projects had been selected for the year 2023-24 which included 149 ongoing projects, 20 approved unfunded projects, 244 new Projects and the estimated cost of these projects was around Rs 344,767.271 million.\nSenator Saifullah Abro questioned as to why the nominal amount had been fixed for the development schemes in Larkana, Sukkur and Shaeed Benazeerabad Division.\nOfficials told that the reduction in funds allocation was mainly because the government had curtailed the PSDP budget to great extent. The chairman committee recommended the ministry to increase the budget allocation for the aforementioned projects.\nMeanwhile, the meeting was attended by Senator Saifullah Abro, Senator Saifullah Sarwar Khan Nyazee, Senator Bahramand Khan Tangi, Senator Fida Muhammad, Senator Falak Naz, Federal Minister for Housing and Works Maulana Abdul Wasay, Secretary for Ministry of Housing and Works Iftikhar Ali Shallwani, Senior Joint Secretary for Ministry of Housing and Works Muhammad Ashfaq Ghumman, Director Admin Zeeshan Qasim, and other senior officers of relevant departments were also in attendance.",
  "retrievedAt": "2025-08-11T06:04:09.697Z"
}
