{
  "title": "Pakistan, Ivory Coast reiterate to enhance bilateral cooperation",
  "link": "https://www.app.com.pk/national/pakistan-ivory-coast-reiterate-to-enhance-bilateral-cooperation/",
  "date_published": "2023-02-14T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): Pakistan and Ivory Coast (Cote D’Ivore) on Tuesday reiterated the resolve to promote bilateral cooperation in the fields of economy, trade, and culture.\nBoth sides emphasized the need to encourage exchanges at high levels to boost bilateral relations.\nThis was discussed during a meeting of the visiting Parliamentary delegation of Ivory Coast, led by the President of the National Assembly of Ivory Coast Adama Bictogo that called on President Dr Arif Alvi at the Aiwan-e-Sadr, President Secretariat Press Wing said in a press release.\nSpeaker of the National Assembly, Raja Pervez Ashraf, was also present on the occasion.\nWelcoming the delegation, the president said that Pakistan considered Ivory Coast an important country and wanted to promote ties with African countries under its “Engage Africa” policy.\nHe observed that both countries enjoyed good relations in various fields and needed to help each other in the development process.\nThe president said that both countries had great prospects for promoting political and economic cooperation, and urged the need for the businessmen of Ivory Coast to visit and invest in Pakistan.\nHe expressed satisfaction over the current level of bilateral ties as both countries had unanimity of views on different issues and supported each other at various international fora.\nThe president said that Pakistan played an important part in UN Peacekeeping operations in Ivory Coast under UNOCI from 2004 to 2017, adding that Pakistan had always supported international efforts for the stability and development of Ivory Coast.\nPresident Dr Alvi also asked the President of National Assembly of Ivory Coast to open their resident diplomatic mission in Islamabad that would help to further improve bilateral cooperation.\nThe president further said that Pakistan had successfully overcome the menace of terrorism, besides effectively managing the COVID-19 pandemic.\nThe president asked the delegation to convey his greetings to the leadership of Ivory Coast and expressed the hope that the visit of the delegation would prove to be a significant step in expanding bilateral relations.\nAdama Bictogo said that the leadership of his country wanted to improve relations with Pakistan in all areas of mutual interest and briefed the president about the steps taken by his country for the transformation of its economy.\nHe further said that parliamentarians needed to play a role in improving political and economic relations between the two countries.\nHe also thanked the president for the warm welcome and hospitality extended by the government of Pakistan.",
  "retrievedAt": "2025-08-11T06:04:05.449Z"
}
