{
  "title": "MNAs to donate one-month salary to quake victims in Turkiye, Syria",
  "link": "https://www.app.com.pk/national/mnas-to-donate-one-month-salary-to-quake-victims-in-turkiye-syria/",
  "date_published": "2023-02-14T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP): The Members of National Assembly (MNAs) on Tuesday decided to donate one-month salary to the earthquake victims in Turkiye and Syria.\nTalking on a point of order during the Joint Session of Parliament, Pakistan Tehreek-e-Insaf (PTI) MNA Rana Muhammad Qasim Noon proposed the National Assembly (NA) Speaker Raja Pervaiz Ashraf to donate the one-month salary of all the respective members of lower house of parliament to the earthquake victims in the brotherly countries.\nSeconding the proposal of Qasim Noon, Pakistan Muslim League (Nawaz) MNA Chuadhry Mahmood Bashir Virk said the quake affected people were facing a difficult time, therefore “we must help them at this hour of trials and tribulations”.\nPTI’s MNA Ramesh Kumar Vankwani said “we must go beyond one-month salary and support the marooned people with a huge financial assistance individually”.\nHe went on to say that all the respective members of this august house were well off and they could support this noble cause by donating millions of rupees in their personal capacity.\nLeader of the Opposition in the National Assembly Raja Riaz Ahmad said it was a positive move as both the treasury and opposition benches had mutually agreed to donate their one-month salary to the earthquake victims.\nMeanwhile, Jamaat-e-Islami’s MNA Abdul Akbar Chitrali, expressing his apprehensions, said he would prefer to “donate his salary to AlKhidmat Foundation which was already conducting welfare activities in Turkiye and Syria”.\nAfter taking sense of the house, NA Speaker Raja Pervaiz Ashraf said the house had reached the consensus to donate one-month salary to the earthquake victims of Turkiye and Syria except Abdul Akbar Chitrali.",
  "retrievedAt": "2025-08-11T06:04:27.412Z"
}
