{
  "title": "British HC awards “Chevening Mentoring” certificates to Pakistani Journalists",
  "link": "https://www.app.com.pk/national/british-hc-awards-chevening-mentoring-certificates-to-pakistani-journalists/",
  "date_published": "2023-02-14T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 14 (APP):The British High Commission hosted a reception to award certificates to the participants of the “Chevening Mentoring Scheme” for budding journalists from across Pakistan.\nThe mentorship programme, which was launched in 2022, is designed to provide capacity-building opportunities to young female and male journalists by engaging senior journalists from the flagship Chevening South Asia Journalism Programme Fellowship (SAJP) to act as mentors, said a news release issued here on Tuesday.\nSAJP is aimed at mid-career journalists from South Asian countries including Afghanistan, Bangladesh, Bhutan, India, Nepal, Pakistan, Sri Lanka, and the Maldives.\nAs part of the programme, four experienced journalists two male and two female developed bespoke training modules that selected young journalists and then shared their knowledge and experience with their mentees in one-on-one leadership sessions and group discussions.\nZoe Ware, Acting Deputy High Commissioner to Pakistan said, “I was delighted to host such inspiring Chevening mentors and mentees at the High Commission. The Chevening mentorship programme for journalists is a fantastic addition to our internationally renowned scholarship programme. It promotes inclusion, and unlocks talent, which will inevitably lead to a more diverse media landscape in Pakistan.”\nChevening scholarships are a cornerstone of the UK’s public diplomacy efforts in Pakistan which is an important member of the Commonwealth community.\nThe British High Commission is actively encouraging more women to apply for Chevening scholarships. This focus has resulted in the female intake of Chevening scholars rising to around 60% of the 2021 intake from 6% in 2013.",
  "retrievedAt": "2025-08-11T06:04:09.551Z"
}
