{
  "title": "Pakistan, Turkey all-weather friends; stars of same sky: Head Advisor to Turkish President",
  "link": "https://www.app.com.pk/national/pakistan-turkey-all-weather-friends-stars-of-same-sky-head-advisor-to-turkish-president/",
  "date_published": "2020-02-03T00:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP):Describing Pakistan and Turkey as all-weather friends, Head Advisor to the President of Turkey, Yalcin Topcu stated that the two brotherly were like stars of the same sky.\n“Pakistan and Turkey are two friendly and brotherly countries, who support each other in the most difficult times, and that the economic, political and cultural relations of the two countries are increasing day by day,” he added.\nYalcin Topcu expressed these views while speaking at a “Symposium on Pakistan-Turkey Relations: Past to Present”, organized by The Turks Abroad and Related Communities Presidency (YTB), in coordination with Pakistani students in Ankara, Turkey on Saturday, a message received here from Ankara on Monday said.\nThe symposium was attended by Yalcin Topcu, Head Advisor to the President; Metin Gundogdu, Member of Parliament from Ordu (AKP); Syrus Sajjad Qazi, Ambassador of Pakistan to Turkey; Murat Kazanci, Head of Cultural and Social Affairs of YTB; Turkish and Pakistani Professors; Pakistani students as well as students of other nationalities; members of Turkish intelligentsia; representatives from Think-Tanks; besides others.\nHead Advisor to the President of Turkey concluded his speech with the remarks that “the founder of the Islamic Republic of Pakistan, Quaid-e-Azam Muhammed Ali Jinnah, was one of the most important statesmen of the Islamic world. He and the national poet Allama Muhammed Iqbal, gathered 1.5 Million Muslims to support the Turkish brothers’ struggle for independence. I commemorate them with mercy and gratitude”.\nSpeaking on the occasion, Ambassador of Pakistan to Turkey, Syrus Sajjad Qazi, remarked that, while 2020 marks 73 years of the establishment of Pakistan-Turkey diplomatic relations, the fraternal ties between the two peoples go back several centuries.\nTurkey and Pakistan were important members of the international community including the Muslim World, and had a history of speaking up for the cause of truth and justice, globally, the ambassador said.\nIn addition, the two countries had always stood by one another under the most difficult and challenging circumstances, he further added.\nHighlighting the Kashmir cause, the ambassador thanked the Turkish leadership and people for standing by Pakistan, on international forums, particularly in raising its voice for the right of self-determination of the people of Indian occupied Jammu & Kashmir.\nDr. Hatice Celin from SDE think-tank; Dr. Cemil Kutluturk, Dr. Haroon Muzaffar, and Students from Cozum College, Ankara, also spoke on the occasion.",
  "retrievedAt": "2025-08-11T18:44:23.422Z"
}
