{
  "title": "Radio Pakistan National Songs to infuse new life to Kashmir movement: Firdous",
  "link": "https://www.app.com.pk/national/radio-pakistan-national-songs-to-infuse-new-life-to-kashmir-movement-firdous/",
  "date_published": "2020-02-03T10:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Monday said the two national songs, produced by Radio Pakistan, in connection with Kashmir Solidarity Day, would help infuse new life to Kashmiris’ struggle for freedom.\nShe expressed these remarks while launching two national songs in line with government’s\npolicy to mark February 1 to February 5 as solidarity events with the Kashmiri brethren here at the Pakistan Broadcasting Corporation.\nFirdous said Radio Pakistan was playing the lead role in connecting Pakistan’s narrative\nwith the world, by means of the latest technology.\nShe said : “There is complete information and connectivity blackout in the Occupied Jammu\nand Kashmir as the valley is facing Internet, TV channels, social media shutdown, for the last several months. Radio Pakistan is the only means to connect Kashmiris and their sentiments with the world.”\nShe said “We were dedicating these songs to the innocent Kashmiris struggling against\nthe Indian occupation, oppression and discrimination for their constitutional right to the\nself-determination.” “Radio is playing a role in defending Pakistan at its ideological and\ngeographical fronts and would be made stronger and more efficient,” she added.\nRadio Pakistan, she said, has always had the distinction of playing a vibrant and active\nrole in the peace and war times on the broadcasting front. Radio Pakistan’s services regarding Kashmir issue would be written in golden letters as Azad Jammu and Kashmir Radio and freedom of Kashmir were indispensable, she added.\nThe SAPM said: “Let it be the story of Kashmiris’ sacrifices, UN Resolutions in favor of Kashmir, deviations from the Constitution of India, Radio Pakistan had broadcast effective programmes at national and international levels, highlighting Kashmir cause along with special coverage of the day-to-day violations of international and human rights laws in the occupied valley.”\nShe thanked the entire production team for composing an enthusiastic piece of music that\nwas portraying the true imagery of the emotions of Kashmiris, fighting against Indian oppression with great courage and perseverance.\nShe also thanked PTV for its impressive video visuals that enhanced the impact of the songs and its lyrics.\nDirector General Radio Pakistan Samina Waqar and Secretary Information and Broadcasting Akbar Durrani were also present on the occasion who lauded the efforts of the artists for amicably composing the national songs, highlighting Kashmiris’ struggle for freedom.\nThe SAPM also distributed shields and certificates among the production team members for\ntheir meritorious efforts for the Kashmir cause.",
  "retrievedAt": "2025-08-11T18:44:05.022Z"
}
