{
  "title": "Coronavirus disease: WHO provides 700 personal protection equipment kits to Pakistan",
  "link": "https://www.app.com.pk/national/coronavirus-disease-who-provides-700-personal-protection-equipment-kits-to-pakistan/",
  "date_published": "2020-02-03T01:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP):World Health Organization (WHO) has provided 700 personal protection equipment kits to the Ministry of Health, Pakistan to protect the medical staff from carrying coronavirus disease.\n“We have planned to provide 500 more personal protection equipment kits to Pakistan besides ensuring technical support to prevent coronavirus disease outbreak,” WHO Representative in Pakistan, Dr Palitha Gunarathna Mahipala said while talking to APP on Monday.\nHe said that the WHO supported the government of Pakistan in many ways like it had provided support to establish isolation wards by giving necessary technical guidance and by giving 100 Infrared thermo guns to measure the temperature without touching the individual to identify suspected cases of coronavirus.\nThese guns are being used at ports of entry (PoE), he added.\nHe said WHO had also provided support in setting up of information booth at Islamabad Airport, which was functional 24 hours while two more booths were being established at airports in Lahore and Karachi.\nFurther technical guidance was also being given to the medical staff of Pakistan for case identification, case management and isolation, he added.\nThe Representative said disease information documents had also been handed over to the government of Pakistan.\nDr Palitha Mahipala said that WHO was closely working with the Ministry of Health and supporting in all activities from points of entry screening to isolation and to lab testing and then again to isolation and case management.\nAppreciating the steps of Pakistan, WHO representative said “At the moment tremendous efforts have been made by the Minister and Ministry of Health and things are in place very well now. Organized steps are being taken by the government of Pakistan to minimize the challenges.”\nCommenting on challenges to mitigate the disease threats, he said “It’s a viral disease which is spreading, so we need to focus on areas including disease surveillance, identification of cases as early as possible, isolation and case management and how to mitigate the risks.”\nHe advised the People of Pakistan that they should not get panic on this situation and follow the guidelines and information being shared by the Ministry of Health.\nHe said WHO was working at global level by setting standards and guidelines and at country level, it was supporting the ministry of health. He acknowledged that the Pakistan had taken all steps recommend by the WHO.\nHe said that WHO was also facilitating acquisition of Lab testing material, PoE assessment for preparedness for case management, infection prevention and control along with surveillance.\nHe said that WHO had also provided information materials like flyers and leaflets to raise the health awareness of the travelers and general masses about the prevention and control of coronavirus had also been printed and disseminated.",
  "retrievedAt": "2025-08-11T18:44:15.169Z"
}
