{
  "title": "Atta Tarar assumes charge of National Heritage & Culture Division",
  "link": "https://www.app.com.pk/national/atta-tarar-assumes-charge-of-national-heritage-culture-division/",
  "date_published": "2024-05-20T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Minister for Information and Broadcasting Attaullah Tarar on Monday assumed the charge of the National Heritage and Culture Division.\nPrime Minister Shehbaz Sharif assigned the additional portfolio of National Heritage and Culture to Attaullah Tarar the other day.\nThe Federal Secretary for National Heritage and Culture and other senior officials welcomed the minister on his arrival at the National Heritage and Culture Division.\nFederal Secretary for Information and Broadcasting Shaheera Shahid and Principal Information Officer Mubashir Hassan were also present on the occasion.\nThe National Heritage and Culture secretary gave a detailed briefing to the minister about the functioning of the Heritage and Culture Division.\nOn the occasion, the minister said, “I am proud to have an opportunity to serve Pakistan at the national and international levels.”\nResponsibility of the National Heritage and Culture Division was both an honour and a challenge for him, he added.\nTarar said Pakistan had a diverse history, culture and strong cultural heritage. “Culture is an important part of our national identity,” he added.\nVowing to promote the cultural identity of Pakistan at the global level, he said drama and music were major components of the national culture, which were recognized internationally.\nHe said the positive image of the country would be promoted worldwide through culture, music and drama.\nThe minister resolved to work with all stakeholders of the cultural sector, including artists, cultural institutions and the public for betterment and development of artists community.\n“We have to preserve the cultural heritage of Pakistan for future generations,” he remarked.",
  "retrievedAt": "2025-08-11T02:36:39.319Z"
}
