{
  "title": "Pakistan, Turkiye agree to strengthen cooperation in multiple areas",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-agree-to-strengthen-cooperation-in-multiple-areas/",
  "date_published": "2024-05-20T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Pakistan and Turkiye on Monday reviewed the state of bilateral relations and agreed to further strengthen mutually beneficial cooperation in trade, investment, defence and security domains.\nThe agreement was reached during the visit of the Turkish Foreign Minister Hakam Fidan who is on an official visit to Pakistan at the invitation of his Pakistani counterpart.\nDeputy Prime Minister and Foreign Minister, Senator Mohammad Ishaq Dar held comprehensive talks with the Minister for Foreign Affairs of the Republic of Türkiye, Hakan Fidan.\nDeputy Prime Minister Dar appreciated Türkiye’s firm and consistent support for the oppressed people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK). He also reiterated Pakistan’s support for the legitimate rights of the people of Northern Cyprus.\nThe two Ministers also discussed regional and global developments, especially the ongoing genocide and the dire humanitarian situation in Gaza.\nThey stressed the need for urgent and unconditional ceasefire in Gaza and the provision of urgent humanitarian relief for the besieged Palestinian people.\nThey reiterated the imperative for the creation of an independent Palestinian state for lasting peace in the Middle East.\nThe two leaders also discussed the need to combat Islamophobia and stressed the urgency of addressing it in a holistic manner.\nThey also assessed preparations for the upcoming 7th session of Pakistan-Türkiye High-Level Strategic Cooperation Council (HLSCC) to be held in Islamabad in the near future.\nPakistan and Türkiye enjoy special bonds of friendship and brotherhood rooted in history, culture and religion. Regular dialogue and exchange of high-level visits are the hallmark of Pakistan-Türkiye robust bilateral relations.",
  "retrievedAt": "2025-08-11T02:36:35.589Z"
}
