{
  "title": "Pakistan debut at International Olympiad Informatics (IOI) 2024 in Egypt",
  "link": "https://www.app.com.pk/national/pakistan-debut-at-international-olympiad-informatics-ioi-2024-in-egypt/",
  "date_published": "2024-05-20T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): For the first time in its history, the Federal Board of Intermediate and Secondary Education (FBISE) will represent Pakistan at the prestigious International Olympiad Informatics (IOI) to be held in Egypt this year.\nEarlier, the federal government formally nominated FBISE to represent Pakistan at the prestigious global level of IOI, said a press release on Monday.\nIn response, FBISE launched a nationwide initiative to identify and train the nation’s most talented young programmers.\nThe selection process was conducted through the Pakistan Olympiad Informatics (POI), a series of rigorous competitive rounds that began with 360 promising top students from across Pakistan.\nOnly 66 of these students passed the challenging first round hosted on the online Codeforces Russian platform.\nThese selected students then received extensive training from renowned programming experts and university professors.\nFrom this group, the top 15 students from the second round of the POI competition to be held on 27 April 2024 progressed to the final round.\nThese elite 15 students showcased their talent in the final round of POI on May 18, 2024, through the online Chinese platform Asia-Pacific Informatics Olympiad (APIO), a milestone for IOI.\nNotably, students from 35 other countries also participated in this competition.\nAPIO 2024 presented three problems, each carrying 100 marks, from which important targets were achieved.\nTwo Pakistani students scored 200 marks, one scored 115 marks, three scored 110 marks, and three others scored 105 marks.\nFederal Board hoped that with these results, it is expected that our team will do well in this year’s IOI competition in Egypt.",
  "retrievedAt": "2025-08-11T02:36:37.832Z"
}
