{
  "title": "PM urges Turkish firms to expand investment, relocate industries to Pakistan",
  "link": "https://www.app.com.pk/national/pm-urges-turkish-firms-to-expand-investment-relocate-industries-to-pakistan/",
  "date_published": "2024-05-20T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Prime Minister Shehbaz Sharif on Monday invited Turkish companies to further expand their investment portfolio in Pakistan, also urging them to consider relocating their industrial units to the country.\nThe prime minister, talking to Turkish Foreign Minister Hakan Fidan who called on him here, said that the current level of bilateral trade was not commensurate with the existing potential.\nHe emphasized to undertake concerted efforts for achieving the bilateral trade target of US$ 5 billion in the next three years as already agreed by the leadership of the two brotherly countries.\nWhile underscoring the special bonds of brotherhood between Pakistan and Turkiye, the prime minister expressed satisfaction over the positive momentum in bilateral relationship.\nHe reaffirmed Pakistan’s firm commitment to further expansion of bilateral cooperation, in all areas of mutual interest, including trade, investment, technology and defence.\nRegional and global developments, particularly the worsening humanitarian situation in Gaza were also discussed in the meeting.\nPrime Minister Shehbaz appreciated President Erdogan’s staunch advocacy for a permanent ceasefire in Gaza and lasting peace in the Middle East.\nHe stressed the urgency and importance of the realization of the two-state solution as the key to attainment of durable peace in the Middle East.\nThe prime minister also reiterated his invitation to President Recep Tayyip Erdogan to undertake an early official visit to Pakistan for co-chairing with Prime Minister the 7th meeting of High Level Strategic Cooperation Council.\nBoth sides reaffirmed their strong and abiding support to each other on the core issues of national interest.",
  "retrievedAt": "2025-08-11T02:36:41.620Z"
}
