{
  "title": "Pakistan, Turkiye target $5b bilateral trade; call for permanent Gaza ceasefire",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-target-5b-bilateral-trade-call-for-permanent-gaza-ceasefire/",
  "date_published": "2024-05-20T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Pakistan and Turkiye on Monday vowing to strengthen bilateral and regional cooperation in multiple spheres, agreed to take the annual bilateral trade from existing $1 billion to $5 billion.\nIn a joint press stakeout following their “extensive” delegation-level talks, Deputy Prime Minister and Foreign Minister Ishaq Dar and Turkish Foreign Minister Hakan Fidan told the media that they had reviewed bilateral cooperation including trade, investment, connectivity and defence.\nIn his remarks, Deputy Prime Minister Ishaq Dar said the bilateral cooperation in all areas was improving and measures were being taken to take the trade volume to $5 billion.\nCalling Pakistan and Turkiye “two countries and one nation,” Dar said the strategic and comprehensive bilateral relations were manifested by elaborate institutional mechanisms and high-level exchanges and visits at the level of political leadership.\nHe said both sides also discussed the Pakistan-Turkiye High-Level Strategic Cooperation Council (HLSCC) scheduled to take place in Islamabad in the near future to carry out a comprehensive review of cooperation including a holistic review of the strategic economic framework\nThe deputy prime minister said that Pakistan and Turkiye had a history of defence cooperation and that both countries always supported each other on core issues, also during national calamities and disasters.\nHighlighting bilateral cooperation on Islamophobia, he told the media that consequent to their joint efforts, the OIC, in its recent summit, agreed to appoint Turkish Ambassador to Pakistan Dr Mehmet Pacaci as secretary-general’s special envoy on Islamophobia.\nIshaq Dar also thanked Turhiye for its continuous support on the issue of Kashmir and reiterated Pakistan’s support for the legitimate struggle of the people of the Turkish Republic of Northern Cyprus.\nDiscussing the Gaza situation, both leaders agreed on an immediate need for a permanent ceasefire and the establishment of an independent Palestine state to achieve lasting peace in the Middle East.\nMentioning the tragic helicopter crash in Iran killing President Ebrahim Raisi along with the country’s Foreign Minister Hossein Amir Abdollahian and others, Ishaq Dar called it a “very sad day” for Muslim Ummah. He said the delegation-level talks started with condolence and Fateha for the departed souls and prayer for patience for the bereaved families.\nIn his remarks, Hakan Fidan told the media that Pakistan was a strategic partner of Turkiye as there had been an unshakeable friendship and brotherhood between the two people who always supported each other.\nHe said the delegation-level talks identified the ways to strengthen ties and exploit the potential besides the steps to take the bilateral trade to $5 billion from the current $1 billion.\nHe said both sides decided in principle to broaden and strengthen ties in trade, defense, investment, banking science and technology and innovation.\nFidan said the situation in Afghanistan also impacted Pakistan and they expressed their common desire for permanent peace and stability in the country.\nDiscussing the Palestine situation, he said Israel had crossed all limits of the human rights violations in Gaza.\nBoth sides agreed to proceed with a close cooperation with international partners including the OIC on the issue.",
  "retrievedAt": "2025-08-11T02:36:43.496Z"
}
