{
  "title": "PMD advises citizens to adopt precautionary measure amid heat wave conditions",
  "link": "https://www.app.com.pk/national/pmd-advises-citizens-to-adopt-precautionary-measure-amid-heat-wave-conditions/",
  "date_published": "2024-05-20T15:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Pakistan Meteorological Department (PMD) Monday forecast increased day temperatures from May 21 -27, advising the citizens to adopt precautionary measures to protect them from severe heat wave conditions.\nThe PMD revealed that the day temperatures were likely to remain 4 to 6 celsius degree above normal in Islamabad, Khyber-Pakhtunkhwa, Kashmir, Gilgit-Baltistan and Balochistan from May 21-27.\nThe day temperatures are likely to remain 4 to 6 degree celsius above normal in Sindh and Punjab from May 21-23 and from 6-8 degree celsius from May 23-27.\nAccording to the synoptic situation, continental air was prevailing over most parts of the country.\nOn Tuesday, mainly hot and dry weather is expected in most parts of the country, while very hot weather is likely in central and southern parts..\nThe PMD advised the general public to avoid unnecessary exposure to direct sunlight and use water judiciously.\nThe extreme dry/heatwave conditions may trigger bush fires and forest fires in the vulnerable areas of Punjab, Khyber-Pakhtunkhwa and Northeast Balochistan.\nDuring the last 24 hours, hot and dry weather prevailed in most parts of the country, while very hot in southern and central parts.\nHowever, rain-thunderstorm occurred at isolated places in upper Khyber Pakhtunkhwa and Gilgit Baltistan.\nThe rainfall recorded was Khyber Pakhtunkhwa: Parachinar 8mm, Kalam 2, Gilgit Baltistan: Bagrote 04, Gilgit 03, Bunji, Hunza 2mm.\nThe highest maximum temperatures recorded were Sibbi 48C, Bahawalnagar, Bhakkar, Kot Addu, Mohenjodharo, Shaheed Benazirabad, Jacobabad 47, Sakrand, Bahawalpur, Dera Ghazi Khan, Jhang, Khanewal and Larkana 46C.",
  "retrievedAt": "2025-08-11T02:36:16.486Z"
}
