{
  "title": "Images of Pakistan: photo exhibition held at Tehran",
  "link": "https://www.app.com.pk/national/images-of-pakistan-photo-exhibition-held-at-tehran/",
  "date_published": "2024-05-20T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): The Pakistan Tourism Development Corporation (PTDC) and ECO Culture Institute Tehran jointly organized a Photographic Exhibition by renowned Pakistani photographer Muzammil Hussain Toori in the Gallery of ECI Tehran.\nAlmost 65 high quality photographs from across Pakistan showcasing the rich natural and cultural heritage of the country are part of this exhibition. Abound 30 photographs from across Iran by Toori are also on displayed, said a press release issued here on Monday.\nThe inaugural ceremony was attended by renowned Iranian intellectuals, Chair of Saadi Foundation and former Speaker of Iranian Parliament Haddad Adel. The Guest of Honor was Ambassador of Pakistan to Iran Mudasser Tipu. Diplomats from different countries and other notables attended this event in large number. President of ECO Culture Institute Dr Saad Khan welcome the participants on the occasion.\nMD PTDC Aftab-ur-Rehman Rana virtually participated in the inaugural ceremony of this exhibition. In his opening remarks, Rana said that this joint photographic exhibition of Pakistan and Iran is a step forward to celebrate the beauty and diversity of our two the nations through the lens of our very talented photographer Muzamal Husain Toori.\nHe said this exhibition is an evidence to the power of photographic art to bridge the cultures, showcasing the unique perspectives and experiences of his travels in both the countries.\nHe expressed the hope that this exhibition will also play a greater role in promoting tourism between the two countries as it will motivate many to visit each other counties and help in promoting people to people contact among the citizens of both the brotherly nation.",
  "retrievedAt": "2025-08-11T02:36:38.400Z"
}
