{
  "title": "Time to reinforce political commitment within SAARC: Golam",
  "link": "https://www.app.com.pk/national/time-to-reinforce-political-commitment-within-saarc-golam/",
  "date_published": "2024-05-20T17:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): SAARC Secretary General, Ambassador Md. Golam Sarwar Monday called for a fresh and committed approach to address the challenges that have hindered South Asian for Regional Cooperation (SAARC)’s progress for decades.\nDuring an interactive session organized by the Institute of Regional Studies (IRS), he stressed that the organization’s future success depends on member states setting aside political differences and prioritizing regional cooperation.\nThe Secretary General said that the recent positive gestures from both India and Pakistan with regard to the SAARC were indeed a good sign and he hoped that these gestures could potentially be served as ‘icebreaker’ in the future.\nIn response to a question regarding the scope of cooperation within SAARC, the Secretary General said that the organization has broadened its cooperation spectrum in various development areas over the time. He specifically noted that food security and sustainable agriculture are central to SAARC’s collaborative framework, along with other significant areas of cooperation.\nThe SAARC Secretary General acknowledged the challenges faced by the organization but stressed its unwavering commitment to achieving core objectives such as enhancing intra-regional trade, promoting people-to-people interactions, combating poverty, addressing climate change, improving public health, and advancing women and youth development. He also touched upon the progress achieved made in these key areas thus far.\nCommenting on the Secretary General’s remarks, President of the Institute of Regional Studies (IRS), Ambassador Jauhar Saleem, said that the Secretary General’s remarks duly conveyed a sense of SAARC’s renewed resolve to tackle the challenges and continue its efforts to promote regional cooperation and development across a wide range of sectors.\nHe further stated that ‘Pakistan is fully committed to the SAARC vision and has remained steadfast in promoting the SAARC objectives’.  at the event, senior journalist Shaukat Paracha, emphasized the media’s crucial role in advancing the SAARC agenda.\nHe expressed concern over the lack of media focus on SAARC developments in recent years. Paracha proposed reviving the South Asian Free Media Association (SAFMA) to enhance media collaboration among member states, aiming to increase awareness and coverage of SAARC’s initiatives and activities while fostering closer ties between the people of member nations.\nAmbassador Ghulam Dastagir, former Director at the SAARC Secretariat said that there was a need to move beyond formal proclamations, and sincerely work on promoting the people-centric agenda of the SAARC. He identified several areas within SAARC that require comparatively little investments and efforts such as agriculture, medical cooperation, tourism, media cooperation, and women and youth development. He suggested that the SAARC member states should focus on these areas to make progress and benefit the people of the region.\nDr Shaban Fayyaz, Associate Professor at QAU said that the visit of the SAARC Secretary General to Pakistan was a positive development for the region. It would help rebuild the confidence of SAARC member states in the organization, she added. She further stated that ‘people-to-people contact is the core of regional integration in South Asia, therefore, SAARC member states should facilitate visiting people through a more relaxed visa regime, she emphasized.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:36:34.538Z"
}
