{
  "title": "PM thanks MD IMF for assistance in concluding $3 bln agreement",
  "link": "https://www.app.com.pk/national/pm-thanks-md-imf-for-assistance-in-concluding-3-bln-agreement/",
  "date_published": "2023-07-14T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP): Prime Minister Muhammad Shehbaz Sharif had a telephonic conversation with Managing Director International Monetary Fund (IMF) Kristalina Georgieva on Friday and he conveyed profound gratitude to her for support and assistance in materializing the recently concluded Stand-by Agreement for $3 billion.\nThe Prime Minister appreciated the MD for her leadership and professionalism. He also acknowledged that MD felt for the poor and termed her support as invaluable.\nThe IMF MD said that Prime Minister of Pakistan built a very convincing case, though the IMF Board was skeptical about Pakistan’s commitment to fulfilling the conditions of the agreement due to the past trust deficit. However, in the light of her continued engagement with the Prime minister, she assured the Board that Pakistan will deliver on its commitments as she had personally met the Prime Minister and seen his seriousness to deliver. She acknowledged the leadership shown by Prime Minister. She underlined that there was strong partnership and mutual trust between both parties now. Terming Pakistan as an important member of IMF, she reassured to continue to help Pakistan.\nThe Prime Minister on the occasion appreciated MD Ms. Georgieva for her positive approach and her frank comments during the Prime Minister’s interaction with her in Paris. Eventually, the hard work on both sides paid off and Standby Arrangement (SBA) was signed.\nThe Prime Minister reassured that he will not tolerate an iota of violation of this agreement.“This government is here till August after which an interim government will take over and he is confident that they will continue to fulfill the obligations.”\nAfter elections, if the people of Pakistan re-elected his government, he was committed to turning around the economy with the help of IMF and development partners, said the Prime Minister.\nReferring to Pakistan”s best quality mangoes, the Prime Minister said it will be an honour to send a gift of Pakistani mangoes to the Managing Director as a token of respect and deep appreciation.",
  "retrievedAt": "2025-08-11T08:55:02.173Z"
}
