{
  "title": "PML-N formally launches election campaign: Rana Sana",
  "link": "https://www.app.com.pk/national/pml-n-formally-launches-election-campaign-rana-sana/",
  "date_published": "2023-07-14T17:23:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 14 (APP):Interior Minister and Pakistan Muslim League-Nawaz (PML-N) Punjab President Rana Sanaullah on Friday said the party had formally launched its election activities and it would field candidates in all constituencies of the province.\nAddressing a press conference at the party secretariat in Model Town, he said the PML-N had a strong organizational set-up at division, district and union council levels in the Punjab province.\nRana Sanaullah said the party meeting was called to discuss the agenda of effective participation in the upcoming general election, and fielding of candidates in all the Punjab and National Assembly constituencies.\nThere were a total of 297 Punjab Assembly and 141 NA constituencies in the province, and the PML-N would not leave any of them uncontested, he added.\nThe minister said the Muslim League was the founding party of Pakistan, which after a long journey since its creation, stabilized the country on strong footing.\nHe said the PML-N Quaid Nawaz Sharif, by conducting the nuclear tests on May 28, 1998, had further stabilized Pakistan. However, the world then imposed sanctions on the country, but it was Nawaz Sharif who as prime minister at that time steered it out of the crises, he added.\nHe said had the “October 12, 1999 adventure” [Musharraf martial law] not been happened, today Pakistan would have been a developed country, with no jobless people. Pakistan was going to become an Asian tiger, but it was pushed into crises under a conspiracy with the ousting of Nawaz Sharif and his party from power, he added.\nThe minister recalled that the PML-N government had overcome many challenges, including terrorism and power outages just in four years, but then again Nawaz Sharif was punished for that “sin”, which, in fact, was an enmity towards the country.\nAfter 2017, he said, a “project” was launched to divide the country politically again like that of 1999, which stopped development process was stopped, and brought Pakistan to the brink of default. However, Prime Minister Shehbaz Sharif ‘s government, under the guidance of Nawaz Sharif, brought the country again out of crises in a short time span of one year, the minister added.\n“We promise that after the success in the upcoming elections, we will continue working for development of the country. We will overcome inflation, increase the people’s livelihood and resolve their problems, and ensure supremacy of the law. We will provide a better future to the youth and promote tolerance,” Rana Sanaullah vowed.\nHe expressed the hope that there would be no conspiracy against the PML-N in the next elections and the country would continue its journey of development under the leadership of Nawaz Sharif.\nThe PML-N did not believe in the politics of ‘revenge and hatred’, he added.\nRana Sanaullah said that the PML-N would not compromise on its electable candidates, asserting that in 2018, the party contested the elections despite many candidates had returned its tickets, and maintained its political existence.\nResponding to a query, the minister said action being taken against individuals and groups involved in the May 9 incidents according to the laws, was not a political revenge. No innocent person was arrested, he added.\nRegarding the arrest of Pakistan Tehreek-e-Insaf (PTI) chief, he said the relevant institutions were continuing their investigation in that regard. Some miscreants had been caught so far, while the masterminds of May 9 mayhem would also be brought to book.\nThe minister said in the upcoming elections, the people would vote for the parties keeping in view their past performance.\nThe PML-N parliamentary party would decide about the prime ministerial or chief ministerial candidate, whereas Nawaz Sharif’s consultation would be mandatory in that regard, he added.\nTo another question, he said political dialogue had continued for a whole year, but one party had refused to engage in the talks process. The PML-N, after coming to power again, would steer the country out of all crises, besides taking action against those who had rigged the 2018 elections, he added.\nLater, Rana Sanaullah also chaired the PML-N Punjab party meeting, which was also attended by senior leader Pervaiz Rasheed, Anusha Rehman and others.\nDuring the meeting, it was decided that lists would be sought from all party organisations about the party candidates in all constituencies. The meeting also decided to field the PML-N candidates in each and every constituency, and finalise preparations to accord a warm welcome to party Quaid Nawaz Sharif upon his arrival in the country.",
  "retrievedAt": "2025-08-11T08:55:01.145Z"
}
