{
  "title": "NAB Balochistan organizes seminar, walk against corruption",
  "link": "https://www.app.com.pk/national/nab-balochistan-organizes-seminar-walk-against-corruption/",
  "date_published": "2023-07-14T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP):In an effort to raise awareness about corruption and instill a sense of responsibility among students, the National Accountability Bureau (NAB) Balochistan on Friday organized a seminar and walk in Quetta Cantt School.\nThe primary objective of the seminar was to educate students about the consequences of misconduct and promote a culture of intolerance towards such actions.\nThe event was attended by Saima Nazir and Henna, representing the school, along with Zahid Kassi and Khurram Shahzad, Deputy Directors from NAB Balochistan.\nThe speakers expressed their views on the subject and shed light on NAB’s strategies and the role of students in combating corruption. They emphasized the negative impacts of corruption on society and highlighted the valuable initiatives taken to eradicate it.\nDuring the seminar, effective measures were also highlighted, empowering students to actively contribute to the development of a transparent and accountable society.\nThe overall objective of the seminar was to serve as an informative platform, motivating students to actively participate in actions against misconduct. The participants gained insights into the negative effects of misconduct and the steps being taken to prevent it.\nIn a symbolic gesture, a walk was organized at the conclusion of the seminar, in which students enthusiastically participated. The walk aimed to symbolize their commitment to fighting misconduct and their dedication to building a more transparent society.\nThe seminar and walk organized by NAB Balochistan in collaboration with Quetta Cantt School successfully raised awareness about misconduct and encouraged students to play their part in eradicating it. This initiative serves as a stepping stone towards fostering a responsible and accountable society.",
  "retrievedAt": "2025-08-11T08:55:14.585Z"
}
