{
  "title": "First ever Pashto-Chinese mix song on Pak-China friendship attracts applause from KP dwellers",
  "link": "https://www.app.com.pk/national/first-ever-pashto-chinese-mix-song-on-pak-china-friendship-attracts-applause-from-kp-dwellers/",
  "date_published": "2023-07-14T07:20:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 14 (APP):The first ever Pashto-Chinese song on seventy years old phenomenal friendship between Pakistan and China is attracting applause from dwellers of Khyber Pakhtunkhwa, terming the melody as true reflector of inner emotions of peoples of both the countries.\nThe song is prepared by `China Window’ around an year earlier and re-launched it on the occasion when both the countries are celebrating the completion of ten years of gigantic China-Pakistan Economic Corridor (CPEC) agreement.\nHeaded by prominent journalist, Amjad Aziz Malik, China Window is a Chinese cultural center established in Peshawar for providing opportunity to the people to explore the culture of their brotherly neighbor.\nWithin few years after its establishment, China Window has provided opportunity to more than 100,000 people for exposure visit to the Chinese culture, literature, art and history through exhibitions, movie screenings and training.\nPakistan embassy in Beijing, Khyber Pakhtunkhwa Culture and Tourism Authority (KPCTA), Archeology Department, Youth Directorate KP and Islamia College Peshawar extended cooperation in preparation of the song.\nThe five minutes and fifty two seconds long song titled as `Two bodies one soul’ is sung by famous Pashto music duo of Sitara Younas and Sajjad Khan from Pakistan. While from China the singers who performed are Lan Yueliang and Shao Feng.\nThe unique song starts with the wording that `We China and Pakistan are two bodies and one soul, the friendship is selfless and whole world knows it”.\nThe same lyric is sung in both Pashto and Chinese languages by different performers amid display of very beautiful and historic pictures depicting leadership, culture, development, landscape and historical sites of the both the countries.\n“Lyrics are simple and meaningful while composition and voices are awesome. So well represented the deep cordial relationship between the two brotherly countries, Pakistan and China. Well done China Window,” commented a viewer on social media.\n“For the first time in the history, we heard Chinese and Pashto mix song, very awesome,” wrote another viewer.\nSome of the netizens while terming the song as very good initiative, suggested people to must watch and listen.\n“This is a very unique initiative taken by China Window by involving culture in promotion of sentiments of friendship between Pakistan and China,” observed Zia-ul-Haq Sarhadi, Chairman Abaseen Column Writers Association.\nTalking to APP, Zia Sarhadi said the Pashto-Chinse song has been liked by people and has renewed the strong and deep friendship bond being felt by people of both the countries from the core of their hearts.\nZia appreciated the efforts made by Amjad Aziz Malik for measure he took for introduction and promotion of Chinese culture in Pakhtunkhwa region of Pakistan.\nThe China Window is playing the role of a bridge between people of both the countries and will further strengthen the strong friendship between Pakistan and China, Zia hoped.\nTalking to APP, founder of China Window, Amjad Aziz Malik said the idea behind composing of Pashto-Chinese song was to reflect the love people of Pakistan and especially of Pakhtunkhwa have for their all times tested Chinese friends.\nThe song has received tremendous applause from people, especially Pashto speaking, who are sending their appreciation through different channels over the initiative aimed at further strengthening of already cemented friendly ties between Pakistan and China, Malik added.",
  "retrievedAt": "2025-08-11T08:55:18.758Z"
}
