{
  "title": "Heavy rains cause 107 deaths, 62 injured in Balochistan: PDMA",
  "link": "https://www.app.com.pk/national/heavy-rains-cause-107-deaths-62-injured-in-balochistan-pdma/",
  "date_published": "2022-07-28T11:23:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jul 28 (APP): At least 107 people, including, 42 men, 34 children and 30 women lost their lives in various rain-related incidents in different parts of Balochistan during the monsoon floods.\nAccording to a report issued by Balochistan Provincial Disaster Management Authority (PDMA), around 62 people were injured due to heavy rains in the current monsoon season in various districts of the province while over 1000 people were displaced.\nThe report informed that the deaths in rain-related incidents were reported from Chaman, Kachi, Barkhan, Dera Bugti, Zhob, Duki, Pishin, Panjgur, Kohlu, Harnai, Killa Saifullah, Sibi, Lasbela, Loralai, Jaffarabad, Kalat, Kach, Khuzdar and other districts.\nThe PDMA report also informed that 6077 houses were completely or partially damaged in Kech, Barkhan, Dera Bugti, Zhob, Jhal Magsi and Khuzdar.\nThe report said that the current rain and floods had also caused damages to 4 highways consisting of 565 kilometers and 44 bridges.\nThe heavy rains also caused loss of 712 livestock and damage 197,930 acers agricultural land.\nThere was no loss occurred to major dams, however 1020 small dams were damaged on which rehabilitation work was underway.\nBalochistan Chief Minister, Mir Abdul Quddus directed relevant departments to remain functional to address problems of public in rain affected areas.\n“Rehabilitation of rain affected National Highway and roads should be ensured as soon as possible for provision of facilities in the areas”, he directed saying that irrigation sector would continue monitoring water level of dams and spillway of Hub dam to release extra water timely.\nThe PDMA has finalized all arrangements following the weather conditions, adding that data was being collected on daily basis in liaison with all the divisional commissioners and deputy commissioners.\nDifferent types of machinery including loaders, tractors, excavators was also deployed in the field to carry out relief operation in smooth way.\nThe officials of PDMA timely responded on local administration and DDMA’s demand and distribute relief items including 10375 tents, 7630 Quilts, 1400 plastic mats, 2570 kitchen set, 100 charpoy, 734 solar light, 8260 tarpaulin and others items to the people of areas mostly affected by flood and heavy rain.\nKech, Turbat Lasbela and Jhal Magsi were the most affected areas. Roads were disconnected, however, after provision of helicopter by the Pakistan Army and the provincial government the relief operations were being carried out on war footing.\nThe PDMA, district administration and other departments were pursuing the relief and rescue operations in the rain-affected areas to protect the life and property of the people in the current emergency situation.",
  "retrievedAt": "2025-08-11T15:18:34.245Z"
}
