{
  "title": "Marriyum for aligning SDGs with climate change",
  "link": "https://www.app.com.pk/national/marriyum-for-aligning-sdgs-with-climate-change/",
  "date_published": "2022-07-28T16:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb Thursday underlined the need for aligning the Sustainable Development Goals (SDGs) with climate change, which was having more impact on the developing countries as compared to the developed ones.\n“The developing countries do invest more in disaster response, but their budget for disaster risk management has been meager,” she said while addressing the closing session of a two-day seminar on SDGs.\nThe minister said the country was currently facing severe flooding due to the climate change. Balochistan had been severely affected by the torrential rains during the ongoing monsoon season.\nShe said Prime Minister Shehbaz Sharif, chairing a meeting regarding disaster management today, ordered to make disaster preparedness and disaster risk management national plans, using GIs and geo-spatial radar and satellite systems, and also align development projects with changing climatic conditions and population growth.\nMarriyum said the role of parliamentarians and local government representatives was crucial to achieve the development goals. “For achievement of Sustainable Development Goals, we have to do legislation as we can create an enabling environment through legislation to remove the difficulties.”\nThe minister said under the leadership of Ayaz Sadiq, Pakistan’s Parliament was the first legislature in the world which institutionalized SDGs.\nShe said today the provinces had representation in the SDGs framework, which was in line with the real spirit of the initiative.\nShe said in 2016, the SDGs office was established within the parliament, and mobilization was done at the provincial level by establishing its offices in PIPS premises.\nLauding the efforts made by the then Speaker Ayaz Sadiq for implementation of the SDGs, she said its results were in front of everyone.\nShe said the world was moving beyond the Sustainable Development Goals ,as from 2022 to 2030, the SDGs would be monitored and evaluated to see how the targets had been met.\nShe said the number of women in the SDGs had increased for which Chairperson of Parliamentary Task Force on SDGs Romina Khursheed Alam deserved appreciation.\nThe minister said about 65% of Pakistan’s population consisted of youth and their engagement in implementation of the SDGs had also witnessed an increase.\nThe minister opined that even at the district and union council levels, there was a need to involve youth in policy making for sustainable development goals.\nShe said in 2016, the budget was allocated for the SDGs for the first time, the budget line was given to the SDGs at the government level.\nMarriyum said unless there were sufficient budget and financial resources, the development goals could not be achieved.\nThe minister said those countries had achieved their development goal in which the SDGs agenda was given at the local level.\nSimilarly, she said, the developing countries in which government institutions, representatives, members of national and provincial assemblies joined in policy making, also achieved sustainable development goals and millennium development goals.\nMaryam Aurangzeb said when the SDGs Secretariat was set up in 2016, there was no political colour in it, now all the provincial governments were representing the event which was a welcome development.\nShe said there were issues of governance within the developing countries related to the SDGs, along with the allocation of funds received from international partners and multinational donor agencies.\nShe said there was a check and balance at the provincial level on the use of that money and there was a need to check governance issues at the national level.\nShe offered all possible support to the SDG Secretariat in achieving its goals.\nShe said the parliamentarians, local government representatives and civil society had to look at what legislation could improve the SDGs.\nAppreciating the role of media regarding implementation of the SDGs, she said the Parliamentary Reporters Association was also made a part of the SDGs team.\nThe minister said it was the responsibility of all to work for the improvement of education, health facilities, environment, development, energy and economy as it was a national agenda, everyone should work together to achieve the goals.",
  "retrievedAt": "2025-08-11T15:18:24.679Z"
}
