{
  "title": "Govt committed to unlock full economic, connectivity potential of CPEC: PM",
  "link": "https://www.app.com.pk/national/govt-committed-to-unlock-full-economic-connectivity-potential-of-cpec-pm/",
  "date_published": "2022-07-28T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 28 (APP): Prime Minister Muhammad Shehbaz Sharif Thursday underlined the government’s commitment to unlock the full economic and connectivity potential of China Pakistan Economic Corridor (CPEC) through expedited and high-quality development of CPEC projects.\nHe emphasized the importance of key projects like Main Line One (ML-1) and Karachi Circular Railway (KCR) in Pakistan’s development plans and expressed desire to move towards finalization of these projects in the upcoming 11th meeting of the CPEC Joint Cooperation Committee.\nThe Prime Minister expressed these views as he received Chinese Ambassador to Pakistan Nong Rong here at the PM House, a press release issued here by the PM Media Office said.\nExpressing satisfaction on the upward trajectory of high-level exchanges between Pakistan and China, the Prime Minister recalled his comprehensive and wide-ranging discussions with Premier Li Keqiang in a telephone call on 16 May 2022, and their consensus to further deepen and strengthen Pakistan-China All-Weather Strategic Cooperative Partnership.\nHe underscored that Pakistan and China were best friends, staunchest partners and Iron brothers, adding, the two nations had always stood by each other through fair weather and times of challenges, and extended support on key issues of core interest.\nThe Prime Minister appreciated China’s support to Pakistan’s sovereignty, territorial integrity and development, including in dealing with the emerging economic challenges and volatility in global supply chains and commodities.\nSharing Pakistan’s focus on early development of CPEC Special Economic Zones (SEZs), he welcomed the increased investments of Chinese enterprises especially in the country’s industrial development.\nReferring to the increasing bilateral trade volumes and Pakistan’s record exports of US $ 3.6 billion in 2021, the Prime Minister emphasized that enhanced market access for Pakistani exports to China would help realize the full potential of Pakistan-China Free Trade Agreement.\nThe Prime Minister was accompanied by Minister for Planning Ahsan Iqbal, Finance Minister Miftah Ismail, Minister of State Foreign Affairs Hina Rabbani Khar and Special Assistants to PM Tariq Fatemi, Zafarullah Mahmood and Jehanzab Khan.",
  "retrievedAt": "2025-08-11T15:18:32.649Z"
}
