{
  "title": "Army, FC troops rescue, relief efforts continue in flood-hit areas: ISPR",
  "link": "https://www.app.com.pk/national/army-fc-troops-rescue-relief-efforts-continue-in-flood-hit-areas-ispr/",
  "date_published": "2022-07-28T09:11:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 28 (APP): The Pakistan Army and Frontier Corps (FC) troops continued assisting civil administration in rescue and relief efforts due to recent flooding in various parts of the country.\nThe Inter Services Public Relations on Thursday shared recent relief activities update being carried out in various parts off the country.\nIn Balochistan, two army aviation helicopters were flown from Karachi to Othal and Lasbella areas.\nThese helicopters had also attempted a sortie during last 48 hours but could not fly due to bad weather conditions.\n“The helicopters will now shift stranded people to safer places and also transport necessary relief items,” it said.\nThe General Officer Commanding at Gwadar visited Othal area to oversee rescue and relief efforts.\nThe senior local commander at Khuzdar would also visit flood affected areas of Khuzdar and surroundings (on Thursday).\nMoreover, ground rescue and relief teams were busy in Othal, Jhal Magsi in shifting people to safer places and provision of food and water to local residents.\nThe doctors and paramedics were providing medical care to the affected people.\nThe coastal highway was opened for all kinds of traffic whereas efforts were in hand to repair the damaged communication infrastructure and restore utilities.\nThe protection bund in Turbat which was breached was also repaired.\nIn Punjab, the troops were assisting civil administration in relief efforts in Dera Ghazi Khan due to flash flooding and hill torrents. Two medical camps were established by the Army to provide medical care to local people affected due to floods.\nIn Sindh, apart from dewatering efforts in Karachi, troops were busy in relief efforts in Jamshoro and Gharo areas.",
  "retrievedAt": "2025-08-11T15:18:34.487Z"
}
