{
  "title": "Telenor participates in launch of Pakistan’s first ESaaS project",
  "link": "https://www.app.com.pk/national/telenor-participates-in-launch-of-pakistans-first-esaas-project/",
  "date_published": "2024-08-28T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): Telenor Pakistan on Wednesday announced its participation in the historic launch of Pakistan’s first low-carbon Energy Storage as a Service (ESaaS) project, marking a significant milestone in the country’s telecom and energy sectors.\nThe ESaaS project represents a transformative step in Pakistan’s journey toward sustainable development said a news release.\nHosted by Brillanz Group in collaboration with key stakeholders, including the Ministry of Climate Change, Telenor Pakistan, Bank of Punjab, and Saudi-Pak Investment Company, this initiative underscores the critical intersection of environmental responsibility and technological innovation.\nKhurram Ashfaque, CEO of Telenor Pakistan, emphasized the company’s commitment to sustainability, and said, “Our participation in this groundbreaking project underscores Telenor Pakistan’s dedication to reducing our environmental footprint while ensuring the long-term sustainability of the operations.\n“By embracing low-carbon energy storage solutions, we are not only transforming our infrastructure but also contributing to a greener, more sustainable Pakistan.”\nAwais Vohra, Telenor Pakistan’s Chief Technology Officer, highlighted the technical advancements that make this project a game-changer for the industry. “With the deployment of 25 MWh of battery infrastructure, we are taking a significant step towards reducing our reliance on diesel generators,” said  Vohra.\n“This initiative will not only reduce approximately 1.1 million generator run hours annually while driving both environmental and operational excellence, setting a precedent for the entire industry.”\nBilal Qureshi, Founder and CEO of Infralectric by Brillanz Group, highlighted the immense responsibility of the Telecom sector in addressing climate change, noting that the industry’s carbon footprint exceeds even that of global aviation.\n“Today, we are not merely launching a project — we are pioneering a transformative revolution in how the Telecom sector in Pakistan powers its infrastructure. This groundbreaking initiative is not just an investment for us – it is a statement of intent. This project will not only set new standards for Pakistan but also serve as a global benchmark for sustainable innovation. Over the life of this project, we will eliminate more than 21 million liters of diesel consumption, driving significant cost savings of over PKR 5 billion,” Qureshi said.\nThe ESaaS project is expected to decrease the telecom sector’s carbon footprint by approximately 8.33 kilotons annually, which is equivalent to planting nearly 295,000 trees each year. This initiative aligns seamlessly with Telenor Pakistan’s broader vision of integrating sustainability into the core of its business operations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:06:07.995Z"
}
