{
  "title": "Corruption case hearing against Parvez Elahi, others adjourned till Sept 10",
  "link": "https://www.app.com.pk/national/corruption-case-hearing-against-parvez-elahi-others-adjourned-till-sept-10/",
  "date_published": "2024-08-28T14:22:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 28 (APP): An accountability court on Wednesday adjourned the hearing of a corruption reference related to Gujrat development projects against former chief minister Punjab Chaudhry Parvez Elahi and others till September 10.\nAccountability Court Judge Zubair Shahzad Kiyani conducted the proceedings, during which the former principal secretary to the chief minister, Muhammad Khan Bhatti, was produced. The other co-accused also appeared and marked their attendance.\nAt the start of the proceedings, Elahi’s counsel, Amjad Parvaiz, submitted that his client was ill and had been advised bed rest by doctors. He submitted an application requesting a one-day exemption from personal appearance for his client.\nHowever, the court observed that it wanted Parvez Elahi to appear so that the indictment could take place.\nIn response, Amjad Parvaiz submitted that his client would appear at the next hearing, but requested that the necessary documents be provided beforehand. He informed the court that it had previously ordered the National Accountability Bureau (NAB) to provide copies of the witnesses’ statements, but these had not yet been supplied. He argued that the indictment should not proceed until the copies of the witnesses’ statements were provided.\nAt this, the court addressed the NAB prosecutor and inquired when the copies would be provided.\nThe prosecutor stated that the bureau would challenge the high court’s decision in the Supreme Court and sought a 15-day time.\nSubsequently, the court allowed Chaudhry Parvez Elahi’s exemption application and adjourned further proceedings till September 10.\nNAB had accused Parvez Elahi and Moonis Elahi of receiving over Rs 1 billion as kickbacks through intermediaries in more than 200 development projects in the Gujrat district during his second term as Chief Minister of Punjab. It is worth mentioning that Moonis Elahi has already been declared a proclaimed offender in the case due to his continuous absence.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:06:27.754Z"
}
