{
  "title": "ISSI launches latest book on ‘The Return of the Taliban’",
  "link": "https://www.app.com.pk/national/issi-launches-latest-book-on-the-return-of-the-taliban/",
  "date_published": "2024-08-28T15:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP):The Centre for Afghanistan, Middle East and Africa (CAMEA) at the Institute of Strategic Studies, Islamabad (ISSI) organised the launch its latest book, ‘The Return of the Taliban: International and Regional Perspectives,’ edited by Director Amina Khan.\nThe Chief Guest for the event was Ambassador Asif Durrani, Pakistan’s Special Representative on Afghanistan. Distinguished discussants included  Zahid Hussain, Journalist and Analyst; Ambassador Omar Samad, Non-resident Senior Fellow at the Atlantic Council’s South Asia Centre, Washington; and Ms. Rangina Hamidi, Former Minister of Education, Afghanistan, a news release said.\nAmbassador Sohail Mahmood, Director General, ISSI; Ambassador Khalid Mahmood, Chairman BOG, ISSI; and Ms. Amina Khan, Director CAMEA also spoke on the occasion.\nAmbassador Asif Durrani, in his address, appreciated ISSI for the launch of the book, underlining that individual contributions of scholars on Afghanistan and the region offer a better insight into the governance aspects of the country since the takeover by the Afghan Interim Government in 2021.\nOn terrorism, he said that valuable insights by the authors should help policymakers to take a serious note and tailor their responses.\nTalking about the Pakistan-Afghanistan relationship, he said that the two countries were bound in a symbiotic relationship and have suffered together in the last four decades. It was important for Afghanistan to address the issues relating to cross-border terrorism. He concluded by saying that given the neglect that Afghanistan faces, the book was a breath of fresh air for scholars searching for intellectual inputs about Afghanistan.\nAmbassador Sohail Mahmood, while expressing his views, stated that the volume comes out at an important time, just as the Taliban rule marks completion of three years. He further said that August 2021 indeed marked another crucial turning point in the history of Afghanistan, as the Taliban regained power.\nThis was a development fraught with wide implications for the region and the world. The concomitant completion of withdrawal of U.S. forces further enhanced the salience of that moment. Ever since, the international community’s attention has been focused on questions relating to governance, security, and human rights issues as well as regional and international diplomacy.\nHe also said that Pakistan has long stressed that a peaceful, stable and prosperous Afghanistan was in its vital interest. Similarly, regional economic integration and connectivity; including through initiatives like the China-Pakistan Economic Corridor (CPEC), would greatly benefit Afghanistan, Pakistan and the broader region.\nFor this to materialise, however, sustainable peace remained indispensable requirement. The interim government in Kabul needs to abide by the pledges they made in Doha, relating to inclusivity, respect for the rights of all Afghans, and above all, not allowing its territory to be used against any country.\nThe Afghan side must address Pakistan’s specific concerns relating to terrorism, in an effective, credible and sustainable manner. With meaningful forward movement on this account, he underlined, the two countries should be able to work together to realise the full potential of Pakistan-Afghanistan relations in all dimensions.\nMs. Amina Khan, while introducing the book said that CAMEA’s 4th edited book comes out at a very important juncture in Afghanistan’s history, as the ‘Islamic Emirate of Afghanistan’  completes three years in power as the de facto, though not de jure, political authority in Afghanistan. She added that over the past 3 years, the Taliban’s governing structure has evolved and taken shape, into what can be defined as an authoritarian yet selectively pragmatic governing style. The IEA have managed to establish a fair degree of stability and security throughout the country.\nThey have increased their diplomatic outreach and enhanced trade with neighboring and regional countries. She concluded by saying that achieving durable peace necessitated a comprehensive approach on the part of the international community but more so the Islamic Emirate, who must fulfill their responsibilities by ensuring governance is inclusive, responsible, accountable and one that serves the Afghan people.\nMs. Rangina Hamidi, while expressing her views, appreciated the diverse perspectives in the book and stated that in her opinion, the Taliban movement was not strictly Pashtun movement, although the movement mainly comprises of Pashtuns.\nShe spoke of the importance of education for both boys and girls and lamented the restrictions on girl’s education and women’s rights. She concluded by saying that while the Taliban have not changed, the international community must promote engagement as there was no alternative and no military solution.\nAmbassador Omar Samad, in his remarks, said that Afghanistan was a complex country and this comes across in many of the chapters in this book, not only as a pre and post-colonial nation state in the region with shifting allegiances and emerging power centers.\nHe also said that the country was also a multi-ethnic society, a geostrategic linchpin, a resilient and unconquerable land, a proxy battlefield, and as a crossroad for trade and movement of people and ideas over the centuries. He concluded by saying that it was incumbent on the Islamic Emirate leadership to seek stability and prosperity.\nMr. Zahid Hussain, in his remarks, stated that the book’s timing is ideal, given the Taliban’s unexpected return to power after twenty years of war. While legitimate concerns exist regarding women’s education and human rights, the Taliban now fully control Afghanistan and are not isolated despite lacking formal recognition. He stressed the need for Afghanistan and Pakistan to work together, particularly on issues like the TTP, and emphasized resolving other issues. Ultimately, he argued that the Taliban must evolve internally to gain international recognition.\nAmbassador Khalid Mahmood, in his concluding remarks, was of the view that the book gives several perspectives, giving a holistic picture of Afghanistan and is a valuable addition to the current discourse.\nThe book includes individual chapters form scholars, experts and practitioners from Pakistan, China, Russia, Iran, Central Asian Republics, Gulf States, Japan, Europe, U.S. and Afghanistan. The event was attended by a cross-section of people including academics, practitioners, foreign diplomats, and members of civil society and the media.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:05:42.518Z"
}
