{
  "title": "Seven soldiers embraced martyrdom, 23 terrorists killed in three separate IBOs: ISPR",
  "link": "https://www.app.com.pk/national/seven-soldiers-embraced-martyrdom-23-terrorists-killed-in-three-separate-ibos-ispr/",
  "date_published": "2024-05-27T11:40:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 27 (APP): A Captain among seven soldiers of Pakistan Army embraced martyrdom while gallantly fighting against terrorists in three separate intelligence-based operations (IBOs) that resulted in eliminating 23 terrorists by the security forces.\nAccording to the Inter Services Public Relations (ISPR) news release, the security forces conducted three separate operations from May 26-27 in Khyber Pakhtunkhwa Province.\nOn May 26, an intelligence based operation was conducted in general area Hassan Khel, Peshawar District, where six terrorists were successfully neutralized by the security forces and multiple hideouts were busted.\nCaptain Hussain Jehangir and Havildar Shafiq Ullah also embraced Shahadat on May 26, while fighting gallantly.\nOn May 27, in another operation conducted in Tank District, the Army troops effectively engaged the terrorists’ location, as a result of which ten terrorists were killed.\nThe third engagement occurred in general area Bagh, Khyber District, wherein, the security forces killed seven terrorists, while two terrorists were injured.\nHowever, during the intense exchange of fire, five brave soldiers; Naik Muhammad Ashfaq Butt (age 32 years; resident of district Kahuta), Lance Naik Syed Danish Afkar (age 30 years; resident of district Poonch), Sepoy Taimoor Malik (age 32 years; resident of district Layyah), Sepoy Nadir Sageer (age 22 years; resident of district Bagh) and Sepoy Muahmmad Yasin (age 23 years; resident of district Khushab), having fought gallantly, embraced Shahadat.\nA large quantity of Weapons, ammunition and explosives was also recovered from the killed terrorists, who remained actively involved in numerous terrorist activities against the security forces as well as the innocent civilians.\n“Sanitization operations are being carried out to eliminate any other terrorist found in the area. Security forces are determined to wipe out the menace of terrorism from the country and such sacrifices of our brave soldiers further strengthen our resolve,” the ISPR said.",
  "retrievedAt": "2025-08-11T02:45:32.606Z"
}
