{
  "title": "Amir Muqam applauds IOM services for Afghan refugees in Pakistan",
  "link": "https://www.app.com.pk/national/amir-muqam-applauds-iom-services-for-afghan-refugees-in-pakistan/",
  "date_published": "2024-05-27T08:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Federal Minister for States and Frontier Regions, Kashmir Affairs and Gilgit Baltistan, Engr. Amir Muqam has said that Pakistan continues to bear the world’s largest refugee burden, having done so for the past 40 years, and urged the international community to acknowledge this.\nTalking to a delegation led by Ms. Mio Sato, Chief of Mission for the United Nations International Organization for Migration (IOM) in Pakistan, the federal minister commended the International Organization for Migration (IOM) for its services to Afghan citizen card holders and the host community, said a press release here on Monday.\nChief Commissioner for Afghan Refugees Mohammad Abbas Khan, Joint Secretary of SAFRON, and other senior officials were also present on the occasion.\nFederal Minister Engr Amir Muqam said that more support is needed in health, education, and infrastructure building.\nThe federal minister expressed the desire for Afghan refugees to return to their country with dignity, noting that there have been no incidents of forced expulsion or harassment. He emphasized the need for screening to determine their locations and activities.\nEngr Amir Muqam stated that Pakistan is aware of the business activities, education, and relationships of Afghan refugees within the country. He highlighted that many Afghans are involved in businesses that are beneficial to both Pakistan and its citizens.\nThe federal minister said that he will travel to Geneva in June at the invitation of the High Commissioner of UNHCR, and he plans to meet with the DG of IOM. The ministry of SAFRON and IOM have agreed to maintain ongoing communication.\nChief of Mission MIO Sato expressed gratitude to the federal minister for meeting despite the holiday and stated her intention to maintain close contact with the ministry.",
  "retrievedAt": "2025-08-11T02:46:13.921Z"
}
