{
  "title": "Isolated rain in upper parts of country to subside severe heat wave conditions:PMD",
  "link": "https://www.app.com.pk/national/isolated-rain-in-upper-parts-of-country-to-subside-severe-heat-wave-conditionspmd/",
  "date_published": "2024-05-27T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):Duststorm/thunderstorm and isolated rain expected in the upper parts of the country from May 28 to June 01 will help subside severe heatwave conditions, providing relief to the heat stricken people.\nAccording to the Pakistan Meteorological Department (PMD), a shallow westerly wave was likely to affect upper parts of the country on May 28 (evening/night).\nUnder the influence of this weather system, duststorm/thunderstorm is expected in Balochistan including Quetta, Zhob, Ziarat, Sherani and Barkhan from May 27 (night) to May 29.\nIn Khyber Pakhtunkhwa, duststorm/thunderstorm with isolated rain is expected in Chitral, Dir, Swat, Abbottabad,\nMansehra, Haripur, Kohistan, Shangla, Buner, Malakand, Waziristan, Kohat, Lakki Marwat, Bajaur, Mohmand, Karak, Khyber, Peshawar, Mardan and Kurram from May 28 (evening/night) to June 01 with occasional gaps.\nIn Gilgit-Baltistan, rain-wind/thunderstorm is expected in Gilgit-Baltistan including Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar while in Kashmir including Neelum valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli,\nSudhanoti, Kotli, Bhimber, Mirpur) from May 28 (evening/night) to June 01.\nIn Punjab/Islamabad, duststorm/thunderstorm with isolated rain is expected in Islamabad/Rawalpindi, Murree, Galliyat,\nAttock, Chakwal, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Sialkot, Narowal, Lahore, Kasur, Okara,\nFaisalabad, Toba Tek Singh, Jhang, Khushab, Sargodha and Mianwali from May 28 (evening/night) to June 01 with\nIn Sindh, duststorm/gusty winds is expected in Karachi, Thatta, Badin and Hyderabad on May 28 and May 29.\nThe PMD has advised the farmers to manage the crops accordingly.\nThe department also warned that the duststorm/windstorm and lightning may affect daily routines, standing crops, loose structures like electric poles, vehicles and solar panels etc during the period.\nSevere heatwave conditions are likely to subside in upper parts from May 28.\nHeatwave-like conditions are likely in central and southern parts of the country.\nDay temperatures are likely to remain 03-04 degree celsius above normal in the areas bearing heatwave conditions.\nThe general public is advised to avoid unnecessary exposure to direct sunlight.\nAll concerned authorities are advised to remain alert  and take necessary measures to avoid any untoward situation during the heatwave spell.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:45:50.389Z"
}
