{
  "title": "Chairman PRCS visits Pakistani Embassy in Kuwait",
  "link": "https://www.app.com.pk/national/chairman-prcs-visits-pakistani-embassy-in-kuwait/",
  "date_published": "2024-05-27T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Chairman Pakistan Red Crescent Society (PRCS), Sardar Shahid Ahmed Laghari Monday visited the Embassy of Pakistan in Kuwait.\nHe was warmly received by Malik Muhammad Farooq, the Ambassador of Pakistan to Kuwait, along with the Deputy Head of Mission and senior embassy staff, said a press release.\nDuring his meeting with Ambassador Farooq, Chairman Laghari acknowledged the significant support from Kuwait, which has been crucial for Pakistan’s development and progress.\nHe highlighted the longstanding humanitarian partnership with the Kuwait Red Crescent Society (KRCS), which has greatly aided the PRCS’s efforts over the years.\nChairman Laghari discussed his recent meeting with KRCS at their headquarters and the memorandum of understanding (MoU) signed between PRCS and KRCS. This agreement aims to enhance humanitarian collaboration to address the needs of vulnerable communities in Pakistan. The focus areas of this collaboration include Disaster Management, Health, Climate Change, Youth Engagement, Resource Mobilization, Organizational Development, and Migration.\nHe also emphasized PRCS’s commitment to strengthening ties with national societies in the Gulf States and seeking meaningful engagements with affluent nations to explore collaborative opportunities that support Pakistan’s vulnerable populations.\nThe discussion at the embassy covered the history, mandate, and services of the PRCS, particularly the significant assistance provided to millions in 55 districts during the 2022 monsoon flood response.\nChairman Laghari spoke about fostering relationships with KRCS and developing strategies to improve humanitarian efforts for those affected by floods in Pakistan.He provided an overview of PRCS’s various programs and initiatives, including health services, blood donor centers, ambulance services, water, sanitation and hygiene (WASH) projects, shelter, livelihood cash voucher assistance, migration and displacement support, and aid for outgoing Afghan migrants.\nHe also highlighted PRCS’s representation at CoP27 and CoP28, advocating for Pakistan’s cause.\nChairman Laghari stressed the importance of exploring further collaboration with international humanitarian organizations in Kuwait to ensure ongoing support for recovery programs benefiting flood-affected families in Pakistan.\nAmbassador Farooq praised the exemplary services of the PRCS and lauded Chairman Laghari’s leadership in advancing humanitarian initiatives.\nHe pledged his support in engaging the Pakistani diaspora and business community in Kuwait to raise awareness and mobilize resources for PRCS’s humanitarian mission, nurturing program collaborations, and connecting PRCS with like-minded organizations in Pakistan.\nThe visit concluded with the exchange of commemorative shields and souvenirs between PRCS and KRCS. Chairman Laghari also shared his impressions in the visitor’s book at the embassy.",
  "retrievedAt": "2025-08-11T02:46:25.095Z"
}
