{
  "title": "Ahsan Iqbal inaugurates ‘Clean and Safe Drinking Water’ plant",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-inaugurates-clean-and-safe-drinking-water-plant/",
  "date_published": "2024-05-27T09:47:00.000Z",
  "source": "APP",
  "content": "NAROWAL, May 27 (APP):Under the community engagement program, Clean and Safe Drinking Water facility was formally inaugurated by Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal and Chief Executive Officer (CEO) Nestlé Pakistan Limited Jason Avancena here in Narowal.\nSpeaking on the occasion, the federal minister said that the modern water filtration plant would provide 24,000 liters of clean water to 10,000 people on a daily basis which was a blessing.”I thank Nestle Pakistan for providing this facility on behalf of the people of Narowal”,he maintained.\nHe said that there was a severe shortage of clean drinking water in our country due to which Pakistan was suffering from fatal diseases like hepatitis.\nAhsan Iqbal said that Prime Minister had launched the National Nutrition Program at a cost of 8 billion rupees, through which malnutrition will be tackled.\n“A healthy nation can only be build by focusing on clean drinking water and balanced nutrition”, he added.\nHe said that Nestlé for Healthy Kid program should be started at every school so that the children could learn about a balanced diet and its importance in daily life.\nCEO Nestlé Pakistan Limited Jason Avancena while addressing the participants, told about the community development projects across Pakistan under the Community Engagement Program on behalf of his company.\nLater, Federal Minister for Planning, Development and Special Initiatives Prof. Ahsan Iqbal along with Deputy Commissioner Narowal Syed Hassan Raza,  CEO Nestlé Pakistan Limited Jason Avancena and CEO Health Narowal Dr. Naveed Haider inaugurated the “Clinic on Wheels” project which is run according to the vision of the Chief Minister of Punjab.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:46:17.044Z"
}
