{
  "title": "Second Zone of CPEC a game changer for Pakistan’s economy: Salma Butt",
  "link": "https://www.app.com.pk/national/second-zone-of-cpec-a-game-changer-for-pakistans-economy-salma-butt/",
  "date_published": "2024-05-27T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):PMLN Member Punjab Assembly Salma Butt Monday said that Pakistan was enjoying excellent ties with China and expressed confidence that under the dedicated leadership of Prime Minister Shahbaz Sharif Pakistan will soon successfully enter into the second phase of CPEC which will prove a game changer for Pakistan’s economic.\nTalking to PTV news channel, she said that Prime Minister Shahbaz Sharif has pledged to raise millions out of poverty and turning country into a progress country, adding, Shehbaz Sharif will take China-Pakistan Economic Corridor (CPEC) forward with new vigor, vitality and in a rejuvenated manner.\nShe said the PML-N government does not believe in the politics of anarchy and hatred but in the practical measures and not in mere hollow slogans, adding, we have founded the CPEC that is a game changer project to improve the economic condition of the country.\nShe said it is also very significant that a high level Saudi foreign delegation and UAE leadership is visiting Pakistan, adding, these recent visits will not only open new doors of investment in Pakistan but will also inject new momentum in the business activities.\nThe better foreign exchange reserves will improve the credibility of a country in front of the international financial organizations, she added.\nIn addition to CPEC, China has expressed willingness to invest in different projects in our country, she mentioned.\nShe added that Prime minister’s foreign policies will give fruitful results and will increase export opportunities as well.\nReplying to a question, she said that Pakistan is in dire need of the foreign investment and we must expect huge foreign investment in Pakistan in near future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:46:36.339Z"
}
