{
  "title": "Ali Suleman Habib 3rd Engineering Excellence Award announced",
  "link": "https://www.app.com.pk/national/ali-suleman-habib-3rd-engineering-excellence-award-announced/",
  "date_published": "2024-05-27T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP): Pakistan Engineering Council (PEC) in collaboration with the Institution of Engineers Pakistan (IEP) has announced Ali Suleman Habib 3rd Engineering Excellence Award to celebrate the achievements of engineers who have made exceptional and significant contributions to society and nation’s advancement.\nAccording to the eligibility criteria shared by the PEC, the candidate applying for the award must possess a degree in any Engineering field recognized by the PEC.\nThe Bachelor’s degree in Engineering is the minimum education qualification required while the maximum age of the applicant should be less than 55 years.\nThe award is open to all the individuals who have made significant contributions to the field of Engineering in Pakistan, the PEC said.\nThe winning candidate/team will be awarded an amount of Rs. one Million and a Gold Medal. The last day to submit application for this award is May 31.\nThe details about submission of the application is available at the weblink: https://hoh.net/excellenceawards/.\nThe evaluation committee will evaluate and assess all applications submitted for Ali Suleman Habib Engineering Excellence Award and shortlist the candidates for the final selection by the jury members.\nThe evaluation committee included Engr. Muhammad Farooq Arbi, Prof. Dr. Syed Amir Iqbal, Syed Umair Ahmed, Engr. Neelofer Hameed Khan, Engr. Syed Asim Ali Tirmizi and Ayaz Mirza.\nThe jury members have been given the responsibility to determine the winners of the prestigious Ali Suleman Habib Engineering Excellence Award. After evaluating all the shortlisted candidates, the final decision made by the Jury will be absolute.\nThe jury members are comprised of Tariq Ahmed Khan, Inayat Ullah Babar, Engr. Sohail Bashir, Sohail P. Ahmed, Engr. Asim Murtaza Khan, Dr. Shahid Ikramullah Butt and Dr. Sarosh Hashmat Lodi.\nThe Institution of Engineers, Pakistan (IEP) was founded with the blessing of the Father of the Nation, Quaid-e-Azam Muhammad Ali Jinnah, in 1948 with its Headquarters at Dhaka. In 1972 the Headquarters was shifted to Lahore.\nIEP is the largest body of professional Engineers in Pakistan and provides a forum for the professional development of Engineers through a wide range of activities and programs.\nThe Institution plays an important role for the dissemination of knowledge amongst the fellow Engineers and in the development of Engineering and Science in the country.",
  "retrievedAt": "2025-08-11T02:45:54.392Z"
}
