{
  "title": "On Youm-e-Takbeer, Gilani emphasises constant efforts to make country’s defence impregnable",
  "link": "https://www.app.com.pk/national/on-youm-e-takbeer-gilani-emphasises-constant-efforts-to-make-countrys-defence-impregnable/",
  "date_published": "2024-05-27T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):As the nation observes Youm-e-Takbeer on Tuesday to commemorate the 26th anniversary of Pakistan’s nuclear tests, Acting President Syed Yusuf Raza Gilani called for drawing inspiration from that success to make the country’s defence impregnable through technological and economic advancements.\nThe acting president, in his message to the nation, termed the day a pivotal moment in the nation’s history and called for a renewed pledge to continue working towards a peaceful and stable world.\nHe said on that day, Pakistan successfully demonstrated its nuclear capabilities and joined the ranks of nuclear powers. “Youm-e-Takbeer serves as a testament to our nation’s resilience, unwavering determination, and commitment to maintaining regional peace and stability,” he added.\nHe said the journey to becoming a nuclear state was not without its difficulties as the national leadership and scientists braved various challenges to achieve the remarkable feat.\n“Today, as we reflect on this journey, we acknowledge the hard work of our scientists and engineers without whom this achievement would not have been possible. Today, we also recognize the contributions of Shaheed Zulfikar Ali Bhutto whose efforts led to making Pakistan a nuclear state. We also appreciate Mohtarma Benazir Bhutto’s decision as the opposition leader of the time to support Nawaz Sharif for conducting nuclear tests. Indeed, it was the collective determination of our civil and military leadership as well as our scientific acumen, and unwavering dedication to national defence that propelled us forward,” Acting President Gilani remarked.\nHe said that Pakistan, as a responsible nuclear state, firmly believed in the peaceful resolution of conflicts. “We are also strictly adhering to international standards, and have implemented stringent controls and comprehensive safety measures to safeguard our nuclear assets,” he maintained.\n“Pakistan remains committed to maintaining Credible Minimum Deterrence, preserving the balance of power and deterring aggression. Pakistan’s strategic capability serves as a powerful deterrent and a weapon for peace. Nuclear deterrence stands as a cornerstone of stability in South Asia, and we remain steadfast in our resolve to uphold this principle,” Acting President Gilani reiterated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:47:00.358Z"
}
