{
  "title": "Dermatologists advise precautions as skin ailments on rise due to heatwave",
  "link": "https://www.app.com.pk/national/dermatologists-advise-precautions-as-skin-ailments-on-rise-due-to-heatwave/",
  "date_published": "2024-05-27T04:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):Dermatologist Monday warned that citizens need adequate steps to avoid skin ailments during this weather as the harsh ultraviolet rays and the increasing humidity can lead to a lot of sweating, which in turn result in skin ailments like skin burns and infections.\nTalking to PTV news channel, a renowned Skin Specialist Dr. Mubashir Mushtaq Daha said that skin allergies and heat rashes are most common during the scorching months when the mercury shoots up, adding, sunburn can increase chance of skin cancer.\nHowever, citizens should protect their skin from harmful rays all year round, but especially in the extra-sunny days of summer, he added.\nDr further explained that the sun and heat can dry out your skin. Dry skin in the summer can occur due to a variety of factors, such as excessive sun exposure, hot showers, and not drinking enough water.\nThe cases of fungal infection are at their peak this summer. The cases are common in all age groups, mostly in the moving population one city to another, he added.\nAloe vera and rose water can soothes the skin, so people can apply to skin to bring relief from itching, he advised.\nCitizens should wear lightweight and breathable fabrics like cotton or linen which allow human skin to breathe and prevent the build-up of moisture.\nWearing tight clothes can cause more sweating which creates an ideal environment for growth, increasing the susceptibility of infection, he warned.\nInsects become more active during the summer, and their stings or bites can cause allergic reactions in susceptible individuals. Bee stings, ant bites, and mosquito bites are common triggers. These reactions can vary from mild redness to severe swelling, Dr. Khurram Mushir another skin specialist added.\nSeasonal allergies can also affect the skin, especially during the high pollen season. Allergic individuals may experience contact dermatitis. The typical symptom is an itchy rash after contact or indirect exposure to plants or grasses, he mentioned.\nAdditionally, keep in mind that home remedies provide soothing relief for mild reactions, but for severe symptoms, it is best to seek medical attention, expert added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:46:37.453Z"
}
