{
  "article_id": "2025-09-15_cae301273e47227102fb4747c56174df",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-hosts-roundtable-on-afghanistans-religious-political-dynamics/",
    "retrieved_at": "2025-09-19T16:55:18.396Z"
  },
  "metadata": {
    "title": "ISSI hosts roundtable on Afghanistan’s religious & political dynamics",
    "author": null,
    "date_published": "2025-09-15T16:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 209,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 15 (APP):The Centre for Afghanistan, Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI) organised an in-house discussion with Dr. Annika Schmeding, Senior Researcher for Afghanistan, at the Royal Netherlands Academy of Arts and Sciences. Ms. Amina Khan, Director CAMEA, moderated the discussion, and stated that it is important to understand the religious and cultural dimensions within Afghanistan, said a press release issued on Monday. Director General ISSI, Ambassador Sohail Mahmood, in his welcome remarks, shed light on the evolving situation in Afghanistan, especially since August 2021. He also highlighted the significance of understanding Afghanistan's socio-political dynamics through cultural, religious and spiritual dimensions and underlined the importance of such scholarly engagements in shaping informed discourse regarding the country and its future. Dr. Schmeding delivered a comprehensive presentation on her book Sufi Civilities: Religious Authority and Political Change in Afghanistan. The discussion revolved around the role of Sufi orders, religious authority, and their political significance in Afghanistan. The meeting was attended by academics, diplomats, and practitioners, and concluded with an engaging exchange of views among the participants. Ambassador Khalid Mahmood, Chairman BOG, ISSI, in his vote of thanks, appreciated Dr. Schmeding's work and said that the exchange had enriched perspectives on Afghanistan's socio-political dynamics.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}