{
  "article_id": "2025-09-15_55db38d43c6223146ccdf9499367ed6f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-meets-egypt-president-says-arab-summit-vital-step-to-show-muslim-world-unity/",
    "retrieved_at": "2025-09-19T16:54:09.927Z"
  },
  "metadata": {
    "title": "PM meets Egypt president; says Arab Summit vital step to show Muslim world unity",
    "author": null,
    "date_published": "2025-09-15T22:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "DOHA, Sep 15 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday met with President of Egypt Abdel Fattah El Sisi wherein he called the Doha Arab-Islamic Summit as an important step to demonstrate unity within the ranks of the Muslim world against Israel which must be held accountable for its behavior. In the meeting, held on the sidelines of the Emergency Arab-Islamic Summit convened here following Israel's recent attack on Qatar, the prime minister conveyed Pakistan's strongest condemnation of Israeli aggression against Qatar on September 9 and also appreciated Egypt's proactive diplomacy at this difficult juncture. Deputy Prime Minister and Foreign Minister Senator Muhammad Ishaq Dar and Field Marshal Syed Asim Munir, Chief of Army Staff were also present in the meeting. Both leaders expressed their solidarity with Qatar and termed the violation of its sovereignty and territorial integrity by Israel as reckless and a blatant violation of international law. Recalling his meeting with the Egyptian President last December at the D-8 Summit in Cairo, as well as their telephone conversations on the occasion of Eid earlier this year, the prime minister reaffirmed Pakistan's desire to enhance its bilateral relations with Egypt, particularly in the areas of trade, investment and health. The two leaders agreed to continue to remain in close contact, particularly in view of the regional situation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}