{
  "article_id": "2025-09-15_7fb8d44f369fb2d3864442d88ab63b05",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-rawalpindi-to-get-high-speed-rail-service-cutting-travel-time-to-20-minutes/",
    "retrieved_at": "2025-09-19T16:56:00.110Z"
  },
  "metadata": {
    "title": "Islamabad–Rawalpindi to get high-speed rail service, cutting travel time to 20 minutes",
    "author": null,
    "date_published": "2025-09-15T11:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 317,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 15 (APP):The federal government has approved a modern high-speed rail project that will connect Islamabad and Rawalpindi, reducing travel time between the twin cities to just 20 minutes. The initiative is expected to save time and fuel, ease traffic congestion, and provide residents with a fast and affordable transportation option. The decision was made during a high-level meeting on Monday chaired by Interior Minister Mohsin Naqvi and Railways Minister Hanif Abbasi. Minister of State for Interior Talal Chaudhry, along with senior officials including the Federal Interior Secretary, Secretary of Railways, Chairman of the Capital Development Authority (CDA), Rawalpindi Commissioner, Islamabad Police Inspector General, and Frontier Corps representatives, attended the session. Participants agreed to expedite completion of the rail link from Margalla Station in Islamabad to Saddar Station in Rawalpindi. The framework agreement for the project will be finalized and signed next week. Under the plan, the Ministry of Railways will provide the track infrastructure while the CDA will manage the service. The government also decided to import state-of-the-art trains to ensure modern, comfortable, and efficient operations. Speaking after the meeting, Railways Minister Hanif Abbasi called the rail service a milestone for public welfare, emphasizing that residents would be able to travel between the two cities quickly and conveniently. Interior Minister Mohsin Naqvi said the initiative reflects Prime Minister Shehbaz Sharif's commitment to providing public relief and modern transport solutions, adding that thousands of citizens will benefit from high-quality travel facilities once the project is complete. Minister of State Talal Chaudhry described the new service as a low-cost and high-speed option that will significantly reduce traffic pressure on roads connecting Islamabad and Rawalpindi. Officials believe the high-speed rail will not only transform commuting but also promote economic activity and environmental sustainability. By offering a faster, more efficient mode of travel, the project is set to mark a new chapter in urban transportation for the twin cities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}