{
  "title": "Education Minister welcomes World Bank delegation",
  "link": "https://www.app.com.pk/national/education-minister-welcomes-world-bank-delegation/",
  "date_published": "2022-06-16T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Federal Minister for Education and Professional Training Rana Tanveer Hussain Rana Tanveer said that the challenge of out of school children (OOSC) was the top priority and the government was making efforts to gather in-depth data on OOSC to design effective and efficient strategies to tackle this challenge.\nHe made these remarks during a meeting with a delegation led by Practice Managers World Bank Christian Aedo and Keiko Inoue. The meeting was also attended by Federal Secretary Naheed S. Durrani.\nTanveer welcomed the delegation and praised the work being done by the World Bank in Pakistan. He said that critical projects were underway in collaboration with World Bank that needed to be expedited on emergency basis.\nRana Tanveer said that the issue of OOSC was a top priority that needed urgent focus. He continued that the challenge of OOSC cannot be efficiently tackled unless we have accurate and relevant data.\nRana Tanveer said that we needed in-depth data on OOSC in order to design effective and efficient strategies. He emphasized the need to form a body that was able to gather data and convert it into actionable information.\nHe said that distance learning should be embedded in the formal education system and the outbreak of COVID-19 pandemic had already set ground for this development. The minister said that it should not be treated as an alternate in the COVID era but rather as a permanent system to allow students to gain education.\nHe said that it was a cost-effective way in comparison to the traditional system of schools and thus allows much greater reach. He gave the example of learning-based channels developed by Saudi Arabia. He said that a special team has been sent there to learn from the experience of KSA.\nChristian Aedo acknowledged the role of Ministry of Federal Education and Professional Training in the implementation of the on-going World Bank funded projects such as Response, Recovery and Resilience in Education (RRREP), Actions to Strengthen Performance for Inclusive and Responsive Education Program (ASPIRE), Pandemic Response Effectiveness Project for COVID-19 (PREP), and Data and Research in Education (DARE).\nHe thanked the minister for his relentless support and said that the priorities of World Bank and the Ministry of Federal Education and Professional Training align. He assured Rana Tanveer that the issues raised by him would be addressed on priority.\nRana Tanveer also assured the delegation of full cooperation and support. He said that it is imperative to work together to ensure progress. “We should leverage the global knowledge base and experience of World Bank and use it to our advantage.”\nThe minister said that youth is the future of Pakistan and a successful youth means successful Pakistan, hence all of their issues should be addressed on top priority.",
  "retrievedAt": "2025-08-11T15:05:40.481Z"
}
