{
  "title": "Ombudsman calls for resolving grievances of overseas Pakistan",
  "link": "https://www.app.com.pk/national/ombudsman-calls-for-resolving-grievances-of-overseas-pakistan/",
  "date_published": "2022-06-16T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Federal Ombudsman Ejaz Ahmad Qureshi on Thursday called for resolving the grievances of more than 9 million overseas Pakistanis, who are not only helping their families back home but also taking part in the socio-economic development of Pakistan by remitting around 30 billion dollars annually to the country.\nHe was chairing a high level meeting to resolve the grievances of overseas Pakistanis and to review the functioning of One Window Facilitation Desks (OWFD) at the international airports in Pakistan.\nDuring the meeting, the Grievance Commissioner for Overseas Pakistanis briefed that 54,000 complaints of overseas Pakistanis were resolved in the year 2021 including 39604 complaints handled and disposed of at OWFDs.\nHe further said that 22,295 complaints of overseas Pakistanis have been resolved in the first quarter of 2022 with the increase of 112% as compared to 10,473 in 2021.\nThe grievance commissioner said that the number of complaints have increased due to robust awareness campaign launched to sensitize the overseas about the functioning of the Office of the Federal Ombudsman.\nAddressing the meeting, Federal Ombudsman said that being a public servant, we are duty bound to serve the overseas Pakistanis with utmost zeal.\nHe directed the Special Secretary Foreign Affairs to start holding open courts once a month in the Pakistan’s missions abroad to resolve grievances of the overseas Pakistanis.\nHe also directed to appoint an officer of BS-20 as focal person in their respective departments for liaison with the Wafaqi Mohtasib Secretariat (WMS).\nHe took a serious note of non-functioning of the OWFD at Quetta International Airport and directed the concerned authorities to ensure its functioning within a week. The Director Civil Aviation Authority (CAA) assured that the OWFD would be revived in the shortest possible time.\nThe Ombudsman further directed all the heads of the departments to constitute monitoring team to randomly check the functioning of OWFDs.\nTaking cognizance of delay in submission of monthly progress reports by the Pakistan missions, the Ombudsman directed that an online interface with the Foreign Office should be established through the complaint management information system (CMIS) of the WMS to avoid delays.\nThe meeting was attended by the Special Secretary Foreign Affairs Khalid H. Memon, Acting Chairman NADRA Brig. Khalid Latif, DG Bureau of Immigration Dr. Tahir Noor, DG Overseas Pakistanis Foundation (OPF), Director Immigration FIA Mr. Masood Bangash, Director ASF Mr. Ehsanullah, Director CAA Mr. Sadiq ur Rehman, AC Customs Islamabad Int. Airport Dr. Shaista, Director Central Health Services, GM(Coord) PIA, senior representatives of other relevant departments, and senior officers of WMS.",
  "retrievedAt": "2025-08-11T15:05:38.295Z"
}
