{
  "title": "Lawmakers for more incentives to agriculture sector",
  "link": "https://www.app.com.pk/national/lawmakers-for-more-incentives-to-agriculture-sector/",
  "date_published": "2022-06-16T12:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Lawmakers both from treasury and opposition benches in the National Assembly on Thursday suggested the government to announce more incentives in the budget 2022-23 for the agriculture sector to make the country self-sufficient in agrarian products.\nParticipating in the budget 2022-23 debate, independent MNA Muhammad Aslam Bhootani said the government had announced a good budget in the difficult economic situation.\nHe expressed concern over withdrawal of the subsidies on electricity that would affect the farming community of his constituency.\nHe also appreciated the incentive package for the areas of Gwadar and said that it would help uplift the lives of local people.\nMir Muhammad Khan Jamali of Pakistan Tehreek-e-Insaf (PTI) made it clear that he never tendered resignation from the membership of National Assembly.\nHe criticized the government for increasing the price of petroleum products as it would trigger a new wave of inflation.\nHe said the incumbent coalition government while coming into power had claimed to provide relief to inflation-hit people but they acted otherwise.\nHe asked the government to make it possible for people to buy daily use items at controlled rates.\nJamali while highlighting the issue of his constituency NA-261 Jafarabad-cum-Sohbatpur and said that his area was facing the issues of water shortage for irrigation and prolonged load-shedding.\nHe asked the government for allocating more finance for the province of Balochistan.\nSyed Javed Hussain of the Pakistan Muslim League-Nawaz (PML-N) said the coalition government in the proposed fiscal plan preferred to work for the betterment of “the State” instead of doing politics on the national issues.\nHe asked the government to provide maximum relief to farmers so that they could produce better results.\nHe suggested constituting a parliamentary committee on agriculture sector for devising a more prudent policy to increase the agri production.\nMuhammad Jamal-Ud-Din of Muttahida Majlis-e-Amal Pakistan (MMAP), said that suggestions of the parliamentarians should be incorporated in the budget 2022-23.\nHe was of the view that sufficient funds had not been allocated for the development of merged districts of the erstwhile Federally Administered Tribal Areas (FATA).\nHe asked the government to release the funds for the people affected by operations in districts of previous FATA, besides providing facilities to local people for developing the mining sector.\nHe also asked the government for allocating special funds for establishing educational institutions.\nMoulana Abdul Akbar Chitrali of MMAP criticized the recent hike in the prices of petroleum products, fearing that it would multiply miseries of the common people.\nHe was of the view that the government was taking directions from the International Monitoring Fund (IMF) for imposing unnecessary burden on the people.\nRamesh Kumar Vankwani of PTI said on May 9, 2022 a unanimous resolution was passed by the House, recommending constituting a task force for compiling recommendations for welfare of minorities living in the country.\nAccordingly, he said the Prime Minister had approved a Task Force consisting of five senators and ten members of the National Assembly for resolving the issues and problems of minorities.\nHe also thanked the government for appointing him as Chairman of Task Force and all political parties for reposing confidence in him. He assured his community of taking them on board to resolve their problems.",
  "retrievedAt": "2025-08-11T15:05:46.502Z"
}
