{
  "title": "OICCI organizes industry dialog on climate actions",
  "link": "https://www.app.com.pk/national/oicci-organizes-industry-dialog-on-climate-actions/",
  "date_published": "2022-06-16T14:23:00.000Z",
  "source": "APP",
  "content": "The industry dialog builds on the effort started by the OICCI earlier this year through the Pakistan Climate Conference, which built on learnings from COP 26 to identify and implement efforts needed to promote positive climate actions and reduce climate change impact in Pakistan, said a press release issued on Thursday.\nThe dialog brought together local climate experts, policy makers and corporate decision-makers to share learning and best practices to help Pakistan reduce climate impact.\nThe main speakers at the event include; Waqar Hussain Phulpoto, focal person, Department of Climate Change, Government of Sindh and Ahmad Rafay Alam, prominent Environment Lawyer.\nSince the beginning of 2022, the OICCI has taken a leading role to organize a national discourse on several critical areas to support Pakistan’s efforts for the commitments made at COP 26.\nThe OICCI has committed to organizing multiple Industry Dialogs to get national alignment on actions needed and will also be releasing a detailed white paper in Q3 2022 on learnings from global climate experts, policy makers and corporate decision makers to help Pakistan craft its climate journey.\nGhias Khan, President OICCI said, “Pakistan has much to do to meet its ambitious Nationally Determined Commitments (NDCs). The Pakistan Climate Conference was just the beginning and today’s industry dialog is the next step towards highlighting the climate best practices needed by the country.”\nAmir Paracha, Vice President, OICCI said, “Climate change has a real and visible economic impact. I am confident that the efforts being made by the OICCI will lay the foundation for an action plan to help Pakistan meet its global climate commitments and ensure the sustainability of its economy.”\nThe OICCI is the representative body of international investors operating in Pakistan, aiming to leverage the expertise of OICCI members for the benefit of the investor and the country. The OICCI draws on a diverse membership both in terms of sector and geography with the current 210 members representing 31 different countries and 14 different sectors of trade and industry.",
  "retrievedAt": "2025-08-11T15:05:44.484Z"
}
