{
  "title": "KP govt extends Sehat Card Plus programme to 14 million more people of province",
  "link": "https://www.app.com.pk/national/kp-govt-extends-sehat-card-plus-programme-to-14-million-more-people-of-province/",
  "date_published": "2021-01-01T10:49:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 01 (APP): The Khyber Pakhtunkhwa government on Friday extended the Sehat Card Plus programme to 14 million more people of six districts of the province including Peshawar.\nA ceremony, in this regard was held here to mark the extension of the initiative to six new districts of the province where Chief Minister Mahmood Khan addressed the participants and said that the programme was being extended to Haripur, Swabi, Nowshera, Mardan, Charsadda and Peshawar.\nAs a result, 14 million populations of these districts would now get free health facilities on the basis of their national identity cards, the CM said, adding that it was a flagship programme of the present government towards accomplishment of the vision of the State of Madina.\nHe said that the scheme had already been extended to merged districts of the province and they could get free health treatment up to one million rupees, adding that now kidney and liver transplant facility was also being included in the scheme in the larger interest of the poor people of the province.\nHe said the revolutionary health sector project was being extended to the whole province in phases and from January 31, 2021, 100 percent of the population could utilize free health facilities in the province.\nHe further said that under Sehat Card Plus, all residents of the province will get free health facilities up to Rs1 million. In the first phase and second phase free health facilities were provided to the residents of Malakand and Hazara divisions.\nHe said that all the promises the present government had made with masses were being gradually fulfilled and its masses’ welfare-oriented initiatives and policies had started yielding results, the chief minister added.",
  "retrievedAt": "2025-08-11T20:12:27.097Z"
}
