{
  "title": "PM inaugurates 100-bed Tarnol Panagah for down-and-out people",
  "link": "https://www.app.com.pk/national/pm-inaugurates-100-bed-tarnol-panagah-for-down-and-out-people/",
  "date_published": "2021-01-01T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 1 (APP): Prime Minister Imran Khan Friday inaugurated Panagah at Tarnol to provide food and shelter for down-and-out people free of charge in the federal capital.\nAccompanied by Special Assistant to PM Dr Sania Nishtar, Managing Director Pakistan Baitul Mal and Senator Faisal Javed, the prime minister cut the ribbon to formally open up the facility.\nThe Panagah initiative is very close to the prime minister’s heart which was launched in the very beginning of his term.\nThe prime minister spent the first evening of the new year with the poor people at the facility. He joined the beneficiaries over the dinner and interacted with them.\nThis is the fifth such facility in the federal capital being run according to the defined standards to ensure quality and serve the poor people with dignity.\nThe 100-bed facility had been established with the collaboration between PBM and Turkish cultural ministry.\nAt the Panagah, 10 beds had been specified for the women\nHe questioned them about the condition of their livelihood and assured them that consequent to the government’s economic policies, the employment opportunities would enhance in the near future.\nEarlier, in the day, the prime minister had also announced that as his new year resolution, he would execute a project to ensure that no one slept hungry across the country.\nThe prime minister also visited EZ Shifa telehealth kiosk set up at the Panagah to provide free medical checkups to people and consult with 500 doctors from across the world.\nThe Healthcare kiosk setup at shelter homes – panahgahs – would be hooked up with volunteer teams of doctors, from Pakistan and abroad who would provide prescriptions and medicines to those who never could otherwise afford to visit a private doctor. The kiosk would also help these people directly interact with the doctors and get their basic health tests.",
  "retrievedAt": "2025-08-11T20:12:27.731Z"
}
