{
  "title": "Petroleum minister urges PTI to shun hate rhetoric, promote peace",
  "link": "https://www.app.com.pk/national/petroleum-minister-urges-pti-to-shun-hate-rhetoric-promote-peace/",
  "date_published": "2024-08-23T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Minister for Petroleum Dr. Musadik Masood Malik on Friday warned the Pakistan Tehreek-e-Insaf (PTI) leadership, particularly Khyber Pakhtunkhwa (KPK) Chief Minister should desist from making hate-based statements and spreading chaos in the country.\nTalking to a Private news channel, he urged the Pakistan Tehreek-e-Insaf (PTI) leadership to abandon their hate-filled rhetoric and instead embrace a peaceful and constructive approach to politics.\nThe Minister’s warning comes amidst concerns that the PTI leadership has been engaged in a systematic effort to destabilize the country through various means, including the provocative events of May 9.\nBy perpetuating divisive rhetoric and promoting unrest, the PTI leadership is not only undermining national harmony but also compromising the country’s stability and security, he added.\nMalik’ s warning serves as a reminder to the PTI leadership to prioritize the nation’s interests over political expediency and to refrain from actions that could further weaken the country.\nMinister for Petroleum revealed that the Khyber Pakhtunkhwa (KPK) Chief Minister had openly threatened to lead a procession to Islamabad, not for a peaceful protest, but for a “qabza” (occupation).\nMalik emphasized that such a move would not be tolerated at any cost, as it would pose a direct challenge to the law and order situation in the country.\nHe asserted that the government would not permit anyone to disrupt the peace and stability of Islamabad, and would take all necessary measures to maintain law and order.\nThe Minister’s warning comes as a clear message to the PTI leadership that any attempts to incite chaos or occupy public spaces would be met with firm resistance from the government.\nResponding to a query, Dr. Musadik Masood Malik reiterated that peaceful protest is a fundamental right of every citizen and the government respects and protects this right. However, he made it clear that anyone who attempts to destabilize the country or disrupt the peace and stability of the nation will have to face the consequences.\nDr. Malik emphasized the need for political parties should work together in a spirit of cooperation and mutual respect, rather than resorting to divisive and inflammatory language.\nBy shunning hate rhetoric and promoting peace, the PTI leadership can play a positive role in building a more stable and prosperous Pakistan, the minister argued.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:55:22.572Z"
}
