{
  "title": "HEC Chairman urges collective push to keep young talent in Pakistan",
  "link": "https://www.app.com.pk/national/hec-chairman-urges-collective-push-to-keep-young-talent-in-pakistan/",
  "date_published": "2024-08-23T05:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP):Chairman, Higher Education Commission Dr Mukhtar Ahmed Friday called upon for a collective push serves as a timely reminder of the need for a cohesive strategy to stem brain drain and empower young Pakistanis to achieve their dreams within the country.\nTalking to a Private news channel , Chairman HEC expressed deep concern regarding the prevailing mindset among young people in Pakistan, who prefer to seek job opportunities abroad rather than staying in their home country.\nHe emphasized the need for a collective effort from society, media, and parents to instill trust and confidence among youngsters about their prospects for a bright future in Pakistan.\nChairman HEC, Dr. Mukhtar Ahmad, emphasized the crucial role of society, media, and parents in rebuilding the trust of young Pakistanis in their homeland and its future.\nHe urged these stakeholders to join hands in creating an enabling environment that fosters a sense of belonging, security, and opportunity among the youth.\nResponding to a question regarding the 97 students who were awarded scholarships and sent abroad but have\nsince disappeared, Dr Mukhtar Ahmad acknowledged that the incident highlighted a deeper issue of trust deficit and lack of continuity in policies.\n“The brain drain phenomenon is a complex problem that cannot be addressed overnight, and that it requires sustained efforts and consistent policies to rebuild trust among the youth,” he emphasized.\n“To address this the HEC is taking concrete steps, including introducing scholarships and research opportunities that incentivize students to stay in Pakistan, as well as collaborating with industry leaders to create job opportunities and career prospects,” he informed.\n“Moreover, the HEC is working to establish a robust monitoring and evaluation system to track the progress of scholarship recipients and ensure their return to Pakistan upon completion of their studies,” he mentioned.\n“By taking these measures, the trust deficit can be bridged, and young Pakistanis can be encouraged to contribute their skills and talents to the country’s growth and development,” , Dr. Ahmad concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:55:45.998Z"
}
