{
  "title": "Malaysia can help Pakistan deepen cooperation with ASEAN: High Commissioner",
  "link": "https://www.app.com.pk/national/malaysia-can-help-pakistan-deepen-cooperation-with-asean-high-commissioner/",
  "date_published": "2024-08-23T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): High Commissioner of Malaysia to Pakistan, Muhammad Azhar Mazlan Friday said that Malaysia can help Pakistan deepen cooperation with the ASEAN community.\nHe made these remarks during his keynote address on “Fostering Multidimensional Malaysia-Pakistan Relations in the Context of ASEAN” at the National University of Sciences and Technology. Organised by NUST Institute of Policy Studies (NIPS).\nThe keynote was attended by an overwhelming number of incumbent and erstwhile government functionaries, senior diplomats, veteran defence officials, academics, experts, researchers, and students. Azerbaijan’s Ambassador to Pakistan, Khazar Farhadov also graced the occasion with his presence.\nSpeaking on the occasion, the High Commissioner stressed that Pakistan had immense development potential, adding that Malaysia could help Pakistan deepen cooperation with the ASEAN community of 10 nations, comprising a population count of approx. 670 million people with over $3 trillion in GDP.\nHe maintained that ASEAN-Pakistan trade of nearly $11 billion in 2022, could reach $20 billion by 2030.\nThe dignitary highlighted that while benefiting from the complementary strengths being natural partners for cooperation, both Malaysia and Pakistan ought to work in unison towards fostering partnerships in agriculture, education, IT, digital economy, capacity building, textile industry, Halal industry, tourism, green energy, and sustainable development.\nThe keynote was followed by comments from the audience, highlighting the security, economic, political, social, and cultural aspects of bilateral cooperation.\nAzhar Mazlan said that Pakistan and Malaysia hold similar stances on key international issues, underscoring deep understanding between the two friendly countries.\nThe elevation of the Pakistan-Malaysia relationship to the level of strategic partnership in 2019, had provided a comprehensive bilateral cooperation framework that would continue reinforcing this commonality.\nHe said that Malaysia would host ASEAN Summit 2025 under its chairmanship, opening up new vistas of growth, development, and cooperation.\nEarlier, NUST Pro-Rector Academics, Dr Osman Hasan, in his remarks highlighted that Malaysia-Pakistan higher education cooperation was one of the key drivers of the long-term development of the bilateral relationship.",
  "retrievedAt": "2025-08-11T04:53:47.602Z"
}
