{
  "title": "Ahsan Iqbal announces model Teachers Training Center for quality education, HR development",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-announces-model-teachers-training-center-for-quality-education-hr-development/",
  "date_published": "2024-08-23T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP):Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Friday said the government would establish a state-of-the-art Teachers Training Center within two years to improve education quality and produce manpower meeting contemporary needs.\nMaking this announcement at the launch of the District Education Performance Index-2023, he said the Pakistan Muslim League Nawaz (PML-N) government had initiated this project during its last tenure but couldn’t complete it due to political instability.\nHe said the center, in collaboration with provincial education departments, would be the best in South Asia, where students could get quality education focusing on improving their critical thinking, creativity, problem-solving and team learning skills.\n“It will be a paradigm shift from memorization-based education,” Iqbal said, adding that the initiative would also reform the existing examination system.\nAhsan Iqbal said that memorization-based education was irrelevant in the modern era, where innovation and creativity derived development.\nHe believed that the country could not achieve the required goals of progress and prosperity without improving the education standard and developing human resources. “The development of infrastructure alone cannot be useful.”\nCiting examples from the world, the minister said no single country has attained development and prosperity without achieving at least a 90 percent literacy rate.\n“Development is not possible without achieving the universal primary enrollment education target.”\nHe also mentioned some other challenges, including the lack of an export-led economy and political instability.\n“Unfortunately, our socio-economic platform is fractured due to which we are enlisted in the low-middle income countries’ club and among the backward nations,” he said highlighting the importance of economic and social alignment for the national development.”\nRecounting past efforts of the PML-N government initiatives for the socio-economic uplift of the country, he said it gave the Vision-2010 in 1998, the world’s best road map for development, and the Vision-2025 in 2013 to place the country among the top economies of the world, but all fell victim of the political instability.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:55:19.982Z"
}
