{
  "title": "Legal Aid Society delegation calls on Azam Nazeer Tarar",
  "link": "https://www.app.com.pk/national/legal-aid-society-delegation-calls-on-azam-nazeer-tarar/",
  "date_published": "2024-08-23T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP):A delegation of Legal Aid Society called on Federal Minister for Law and Justice & Human Rights, Senator Azam Nazeer Tarar on Thursday and discussed issues related to sexual and gender based violence and the organization’s extensive work across Pakistan.\nThe representatives provided detailed briefings on the ongoing efforts to combat sexual violence and the challenges in delivering legal aid to victims.\nThe minister expressed his commitment for a strategic collaboration between the Legal Aid and Justice Authority (LAJA) and the Legal Aid Society, noting that reforms to LAJA are already underway to enhance legal aid services across the country.\nHe further emphasized the ministry’s commitment to introducing comprehensive reforms in the Qanoon-e-Shahadat and the Code of Criminal Procedure (CrPC) to protect the rights of victims and witnesses, ensuring that criminal proceedings remain free from external influence.\nTarar reiterated that these legal reforms will ensure the protection of every victim’s rights and that no influential party can manipulate or subvert the law.\nHe also commended the Legal Aid Society for its significant contributions and tireless efforts in combating sexual and gender-based violence (SGBV) across the country.\nHe said the Legal Aid Society has been at the forefront addressing SGBV by providing legal aid, enhancing protection mechanisms, and working to build the capacity of stakeholders. Their efforts in creating a safer environment for women and children, particularly those affected by sexual and gender-based violence, have been crucial to advancing justice and human rights in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:54:56.940Z"
}
