{
  "title": "Competition Appellate Tribunal upholds Rs50m fine on ghee makers body - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After nearly 14 years, the Competition Appellate Tribunal (CAT) has dismissed the appeal filed by the Pakistan Vanaspati Manufacturers Association (PVMA), upholding the Competition Commission of Pakistan’s (CCP) 2011 decision to impose a Rs50 million penalty on the association for engaging in anti-competitive conduct and discriminatory practices.\n\nThe PVMA, an association representing nearly 100 ghee and cooking oil manufacturers across the country, had challenged the CCP’s decision that found it in violation of Sections 3 and 4 of the Competition Act, 2010.\n\nThe case originated from an inquiry and subsequent show-cause proceedings initiated in April 2011, after the CCP observed coordinated price hikes in the edible oil sector.\n\nThe commission concluded that the PVMA had used its platform to orchestrate price-fixing arrangements, negotiating prices with government authorities and advising its members to implement uniform pricing.\n\nThough the PVMA claimed that these were mere recommendations, the commission found that such directives were, in fact, enforced — resulting in reduced price competition. The CCP also established that the PVMA had entered into agreements with oil tanker associations and the National Logistics Cell (NLC) to fix transportation rates. These arrangements, in the commission’s view, distorted fair competition in the logistics sector and disadvantaged non-member market players.\n\nIn addition to collusive pricing and logistics agreements, the PVMA was also found to have abused its dominant position by charging discriminatory fees for the verification of import invoices — a responsibility delegated to it by customs authorities to address under-invoicing concerns.\n\nThe PVMA charged its own members Rs4 per tonne for this service, while charging commercial importers Rs10 per tonne, without offering a valid justification.\n\nIn its defence, the PVMA argued that its members paid substantial membership fees and annual dues, and that commercial importers ultimately sold their products to PVMA’s member manufacturers.\n\nIt further claimed that it lacked the statutory authority to enforce any pricing arrangements and had only acted under government pressure to stabilise prices in response to fluctuating international palm oil rates.\n\nHowever, both the CCP and CAT rejected these justifications. The tribunal observed that the verification service was delegated to the PVMA by customs authorities for all importers, and that distinguishing between members and non-members in charging service fees was unjustified.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:45:05.615Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906641/competition-appellate-tribunal-upholds-rs50m-fine-on-ghee-makers-body",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:11.000Z"
}
