{
  "title": "Minister reiterates govt’s priority to reduce taxes on essential food items - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Minister for National Food Security and Research Rana Tanveer Hussain has said that the quality of Pakistan’s agricultural products continues to improve and reiterated the government’s priority to reduce taxes on essential food items to ease the burden on consumers.\n\n“There should be no tax on basic food products,” he said, pointing to efforts aimed at curbing food inflation and ensuring affordability.\n\n“Access to sufficient and quality food is a fundamental right of every citizen,” Rana Tanveer said while discussing ongoing and future collaborative initiatives with Director Agri-Food, David Laborde of the Food and Agriculture Organisation (FAO) of the United Nations on Friday.\n\nIn a pivotal step toward enhancing national food security, the government and FAO reaffirmed their commitment to joint efforts aimed at improving access to affordable and nutritious food for all citizens.\n\nThe FAO official acknowledged these initiatives, noting the impact of global and local inflation on food accessibility. “Due to rising prices, fruits have become out of reach for many people,” he added.\n\nDavid Laborde emphasised FAO’s role in monitoring food security worldwide and expressed the organisation’s ongoing support for Pakistan’s efforts. The two sides expressed strong resolve to address food insecurity and agricultural challenges facing the country.\n\nThe meeting concluded with a shared commitment to deepen cooperation in the agriculture and food sectors, with the ultimate goal of ensuring that no one in Pakistan goes hungry.\n\nPakistan has taken a significant step toward strengthening its food safety and quality regulatory regime with the launch of a comprehensive food control system assessment. The initiative, led by FAO in collaboration with the Ministry of Planning, Development and Special Initiatives and co-leadership of Ministry of National Food Security and Research, aims to enhance governance, strategic planning and compliance with international food safety standards.\n\nTheinitiative marks the beginning of a systematic approach to modernising the country’s food safety governance.\n\nThe FAO/WHO Food Control System Assessment Tool will evaluate the existing system across Punjab, Sindh, Balochistan and Khyber-Pakhtunkhwa to identify areas for improvement. The government has co-signed the project, reinforcing its commitment to a science-based and internationally recognised food safety framework.\n\nPakistan’s request for this assessment signifies its dedication to aligning with international food safety regulations, including those set by the Codex Alimentarius and the World Trade Organisation’s agreements on sanitary and phyto-sanitary measures (SPS) and technical barriers to trade (TBT).\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:36:19.478Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906550/minister-reiterates-govts-priority-to-reduce-taxes-on-essential-food-items",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:41.000Z"
}
