{
  "title": "Pakistani shares partially recover overnight losses - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Volatility continued on the Pakistan Stock Exchange (PSX) on Friday due to escalating tensions between the nuclear-armed neighbours following the Phalgham attack and Pakistan’s retaliation in response to Indian moves. However, value-hunting allowed the benchmark index to recover from its overnight losses partially.\n\nTopline Securities Ltd said the market remained range-bound most of the session on account of border tensions, but some recovery was observed towards the end of the trading, as the index gained to close at 115,469.35, up 449.53 or 0.39 per cent day-on-day.\n\nThe top positive contribution to the index came from Habib Bank Ltd, Fauji Fertiliser, Meezan Bank Ltd, MCB Bank and National Bank, as they cumulatively contributed 570 points to the index.\n\nAhsan Mehanti of Arif Habib Corporation said stocks turned bullish after the United Nations urged the nuclear-armed arch-rivals to show maximum restraint and resolve issues with mutual engagement.\n\nHe added that strong financial results, rising global equities, expected SBP policy easing, and the release of the IMF tranche next month supported bullish sentiments.\n\nAli Najib, Head of Sales at Insight Securities, said the index opened in the green, went into a negative zone and then displayed some recovery near the session end to stay above the psychological barrier of 115,000.\n\nMost investors were confused about market direction amidst war-mongering vibes created by heightened tensions between the neighbours.\n\nThe market participation was low as the trading volume fell 7.03pc to 471.07 million shares, while the traded value rose 11.52pc to Rs27.31 billion day-on-day.\n\nStocks contributing significantly to the traded volume included World­Call Telecom (22.78m shares), Power Cement (21.96m shares), Sui Southern Gas Company Ltd (21.56m shares), The Bank of Punjab (19.82m shares) and K-Electric (17.03m shares).\n\nThe shares registering the most significant incre­ases in their share prices in absolute terms were PIA Holding Company [B] (Rs298.39), Rafhan Maize (Rs150.00), Sazgar Eng­in­eering Works Company (Rs55.76), The Thal Indus­tries (Rs33.02), S.S.Oil Mills Ltd (Rs32.46).\n\nThe companies registering significant decreases in their share prices in absolute terms were Unilever Foods (Rs491.71), Hoechst Pakistan (Rs104.86), Siemens Pakistan (Rs56.95), JDW Sugar Mills (Rs50.82) and GlaxoSmithK Pak (Rs34.89).\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680c1b6cec510.gif",
  "retrievedAt": "2025-08-25T14:36:27.796Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906638/pakistani-shares-partially-recover-overnight-losses",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:11.000Z"
}
