{
  "title": "Better emergency response could have saved more lives, Pahalgam survivors say - World - DAWN.COM",
  "author": null,
  "content": "SRINAGAR: Survivors of the Pahalgam attack have criticised Indian authorities’ response to the attack, saying that more lives could have been saved had the emergency response been quicker, and better security was ensured.\n\nThe attack, which left 26 men dead, has enraged India, which is now accusing neighbouring Pakistan of supporting “cross-border terrorism”, a claim that Islamabad flatly denies.\n\nEyewitness accounts and Indian media reports suggested the attack was a well-planned and targeted operation, designed to send a brutal message.\n\nHolidaymakers escaping the sweltering heat of India’s lowland plains were enjoying the tranquil meadows of the Baisaran Valley on Tuesday.\n\nVictim’s wife surprised by lack of security at tourist site\n\nThe popular site lies beneath snowcapped mountains near the town of Pahalgam, around 250km from Muzaffarabad, the capital of Azad Kashmir and some 80km southeast of Srinagar.\n\nIndian media claimed that some of the gunmen wore body cameras to record their attack. The shooters — one of whom was identified by police as an Indian citizen — reportedly separated men from the women and children.\n\nA witness told AFP that they “very clearly spared women and kept shooting at men”.\n\nThe cousin of one of the men killed said he was asked by the attackers if he was Muslim before they shot him in the head, but spared his wife.\n\n“They pointed the gun… and said ’tell your government what we have done,” Shubham Dwivedi’s cousin told India Today.\n\nOther survivors told broadcaster NDTV that if the emergency response had been quicker, the lives of some of those shot but not killed outright might have been saved.\n\nShital Kalathiya, whose husband was among those killed, said what happened “broke” her.\n\n“What shocked us the most was that there was not a single security person present,” she told the Hindustan Times newspaper.\n\n“If they knew that such risks were present at that place, they shouldn’t have let anyone go up there.”\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/26102156f882d95.jpg",
  "retrievedAt": "2025-08-25T14:36:23.542Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906647/better-emergency-response-could-have-saved-more-lives-pahalgam-survivors-say",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:23.000Z"
}
