{
  "title": "Real boycott Copa final build-up over referee complaints - Sport - DAWN.COM",
  "author": null,
  "content": "SEVILLE: Real Madrid boycotted pre-match activities ahead of their Copa del Rey final against rivals Barcelona after the match referee gave an emotional press conference in which he called out Real for criticising the official on their in-house tv channel, the club told media in Seville.\n\nThe referee for Saturday’s match against rivals Barcelona, Ricardo de Burgos Bengoetxea, welled up when speaking about pressure officials have faced from Real Madrid TV this season.\n\nSpanish champions Real boycotted the press conference, the open training in front of media, the traditional presidents’ dinner and a pre-match photo-call.\n\n“Real Madrid told the RFEF they will not take part in the press conference or the official training session looking forward to the [final],” said the Spanish football federation.\n\nThis week the club’s television channel launched a new video attacking the referee for the final, something they have done to various officials this season.\n\nDe Burgos Bengoetxea had spoken about the effect criticism from Real Madrid’s television channel was having on his family life.\n\n“When a child of yours goes to school and there are kids telling him that his father is a ‘thief’ and comes home crying, it’s totally messed up,” De Burgos Bengoetxea told a news conference.\n\nPablo Gonzalez Fuertes, the VAR official for Saturday’s final who was sat next to De Burgos, said referees would soon take action due to the continuous pressure they face.\n\nBarca manager Hansi Flick said on Friday that action should be taken to protect referees due to the pressure they face.\n\n“For me, it’s only a sport. It’s only a game. It’s only football... It is our responsibility to protect not only the players but all the people involved in the game,” Flick told a press conference. “It’s not nice that happened today. Of course, sometimes on the pitch that are some decisions that are about emotion but after the match, we should be done with it. Something must be done.”\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:44:54.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906633/real-boycott-copa-final-build-up-over-referee-complaints",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:17.000Z"
}
