{
  "title": "World Food Programme runs short of food stocks in Gaza - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: The UN’s World Food Programme on Friday warned it has depleted all its food stocks in war-ravaged Gaza, where the entry of humanitarian aid has been blocked by Israel since March 2.\n\n“Today, WFP delivered its last remaining food stocks to hot meals kitchens in the Gaza Strip. These kitchens are expected to fully run out of food in the coming days,” WFP, one of the main providers of food assistance in Gaza, said in a statement.\n\nAfter 18 months of war, the UN’s humanitarian agency OCHA said the situation in Gaza “is probably the worst” now.\n\nIsrael blocked the entry of all aid into the Palestinian territory of around 2.4 million people days before it resumed its aerial and ground offensive this year.\n\nIsraeli strikes kill 23 Palestinians\n\nThe UN agency added that all 25 WFP-supported bakeries in Gaza were forced to close on March 31 as wheat flour and cooking oil ran out.\n\n“No humanitarian or commercial supplies have entered Gaza for over seven weeks as all main border crossing points remain closed,” it added.\n\n“This is the longest closure the Gaza Strip has ever faced, exacerbating already fragile markets and food systems.”\n\nAt least 1,978 people have been killed in Gaza since Israel resumed its assault in mid-March, bringing the overall death toll of the war to 51,355, according to the Hamas-run territory’s health ministry.\n\nGaza’s civil defence agency reported on Friday that the death toll from an Israeli air strike the day before on a house in the north of the Palestinian territory had risen to 23.\n\n“Civil defence teams recovered 11 bodies last night and this morning following the Israeli bombing that targeted a residential house ... in Jabalia,” Mohammed al-Mughayyir, an official with the agency, said.\n\nIsraeli strikes continued on Friday.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680c0cfc7c30e.jpg",
  "retrievedAt": "2025-08-25T14:36:42.305Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906594/world-food-programme-runs-short-of-food-stocks-in-gaza",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:20:54.000Z"
}
