{
  "title": "Sindh cities bake as temperature surges to 47°C in Nawabshah - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: People in many cities and towns across the province experienced harsh weather conditions on Friday with Nawabshah (Shaheed Benazirabad) becoming the hottest place in the country where temperature soared to 47 degrees Celsius.\n\nAccording to the Met department, temperature in Jacobabad was 46°C, followed by Dadu, Larkana and Mithi (45°C), Mohenjo Daro, Khairpur and Sakrand (44°C), Sukkur, Paddidan, Mirpurkhas, Chhor and Rohri (43.5°C), Hyderabad (43°C), Tandojam (42.5°C) and Badin (41°C).\n\nHowever, the maximum temperature in Karachi was 35°C.\n\nThe Met Office has predicted a countrywide heatwave from Saturday (today) under the influence of an approaching high pressure area.\n\nIn Sindh, which is already experiencing intense weather in most parts, this weather system will lead to a prolonged episode of the heatwave, now expected to last till May 1.\n\n“The daytime maximum temperature is likely to remain 6-8°C above normal in Dadu, Kambar-Shahdadkot, Shaheed Benazirabad, Jacobabad, Kashmore, Ghotki, Shikarpur, Khairpur, Naushahro Feroze, Larkana, Sukkur, Jamshoro, Matiari, Tando Mohammad Khan, Tando Allahyar, Hyderabad and Badin districts.\n\n“Similar weather conditions are likely to prevail in Tharparkar, Umerkot and Mirpurkhas districts with daytime temperature soaring to 4-6°C above normal,” the department’s advisory says.\n\nHot and humid weather is expected in Karachi tomorrow with maximum temperature ranging between 36°C and 38°C.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:36:19.780Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906614/sindh-cities-bake-as-temperature-surges-to-470c-in-nawabshah",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:28.000Z"
}
