{
  "title": "Mengal slams PPP over women’s arrest - Pakistan - DAWN.COM",
  "author": null,
  "content": "GWADAR: In a sharp criticism of the provincial administration, Balochistan National Party President Sardar Akhtar Mengal has accused the PPP-led government of arresting women — a move he said was unprecedented even during colonial rule and martial law regimes.\n\n“We are not here for political point scoring, but to raise our voice for the rights that have been denied to Balochistan,” said Mr Mengal while addressing a public meeting in the port city of Gwadar on Friday evening.\n\nA large number of women were also in attendance at the gathering.\n\nMr Mengal said they were not afraid of arrests, recalling that his party workers and colleagues had been detained during various authoritarian regimes. “We were arrested whether it was the dictatorship of General Ayub Khan or the era of Zulfikar Ali Bhutto,” he said.\n\nHe accused the PPP of consistently targeting Baloch youth, citing the Lyari gang war and the 1973 military operation in Balochistan as examples. “They still say ‘Bhutto Zinda Hai’ — thank God he is not [alive], otherwise no home in Balochistan would have been spared,” he remarked.\n\nMr Mengal lamented that while courts can open at midnight to topple a government, they fail to hear the grievances of the people of Balochistan.\n\nSimilarly, he said, parliament can swiftly convene to pass legislation, but has no space to address the suffering of the Baloch people.\n\n“The state labels every voice raised against the atrocities in Balochistan as terrorist. Today, Mahrang and Beebow Baloch [rights activists] are being labeled terrorists; tomorrow, I too will be called one,” he said.\n\nDespite possessing advanced technology, arms and nuclear weapons, Mr Mengal said, the state is afraid of Dr Mahrang, the chief organiser of Baloch Yakjehti Committee.\n\nThe public meeting was also addressed by other BNP leaders, including Sana Baloch, Hammal Kalmati and Shafqaat Langove, and BSO Chairman Balaach Qadir.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680c2112a5f46.gif",
  "retrievedAt": "2025-08-25T14:36:40.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906660/mengal-slams-ppp-over-womens-arrest",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:02.000Z"
}
