{
  "title": "Imran seeks top judges’ intervention over jail ‘harassment’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Letter written by Salman Akram Raja to IHC, SC chief justices says family not allowed to meet ex-PM\n• Requests hearing of bail pleas\n\nISLAMABAD: PTI leader and former prime minister Imran Khan was being subjected to harassment in prison while his family and party leaders were not allowed to meet him despite court orders, according to a letter written on his behalf to top judges of the Supreme Court and Islamabad High Court (IHC).\n\nThe nine-page letter, written by PTI Secretary General Salman Akram Raja, said the chief justice of Pakistan (CJP), Yahya Afridi, and IHC Acting Chief Justice Sardar Muhammad Sarfraz Dogar should take note of the alleged disregard by authorities of the law and Constitution.\n\nThe letter highlighted that Mr Khan, the “undisputed premier leader of the Pakistani nation”, was being kept in prison as a part of a “misguided strategy”.\n\nIt said Pakistan was facing the threat of external aggression and only Mr Khan can “bind the entire nation, from Karachi to Khyber to a common purpose”.\n\nAll that stood between Mr Khan and his liberty was decisions on his bail applications and suspension of convictions in about a dozen cases, the correspondence added.\n\nMr Raja also requested the IHC acting chief justice to fix different appeals — in cases involving Mr Khan — which are pending in the high court.\n\nExcept for the Al Qadir Trust case, bail has already been granted to several of the co-accused in every other case, the letter highlighted.\n\nMr Khan has been “entangled in over two hundred frivolous cases”, and four of his five convictions since 2022 have been overturned or suspended on appeal, revealing the flimsy foundations of the charges against him.\n\nHowever, Mr Khan’s appeal in the Al-Qadir Trust case was yet to be heard by the court while other PTI leaders, including Shah Mehmood Qureshi and Dr Yasmeen Rashid, have been incarcerated for more than 600 days “without justification”.\n\nThe PTI also requested the top adjudicators to take action to restore “decency, justice, and the belief that the people of Pakistan matter”.\n\nThe letter alleged Mr Khan was facing “relentless harassment” in prison since March 20.\n\nHe has not been allowed to meet his sisters and for the past three weeks, when his sister came to meet him in prison on Tuesdays, roads leading to the Adiala Jail were blocked with trucks and other obstructions along with police contingents several miles away from the prison.\n\nThe IHC has ordered jail authorities to allow Mr Khan’s meetings with his family, lawyers and party leaders on Tuesday and Thursday every week.\n\nThese obstructions and coercion, the letter stated, were “widely reco­rded and reported by the media”.\n\nThe treatment accorded to Mr Khan in the prison continues to remain subject to the “whims of the authorities, whoever they might be”.\n\nDespite court orders, Mr Khan was not allowed weekly telephone conversations with his sons, the letter added.\n\nHe has only been allowed to speak with his sons twice over the last four months.\n\nMoreover, Mr Khan is also not allowed to meet his wife, also incarcerated in the Adiala Jail, as per the jail manual.\n\nThe letter alleged that books brought for Mr Khan by family and friends are not given to Mr Khan for several weeks.\n\nHis access to two newspapers in accordance with the jail manual is repeatedly interrupted “as part of a scheme of harassment” and at times, Mr Khan had been subjected to “long periods of solitary confinement in his small cell”.\n\nLikewise, for the past two years, Mr Khan’s trial was conducted within the jail premises and not in the open court.\n\nAccess to the ad hoc court set-up in prison was provided to the family of Mr Khan and his spouse, Bushra Bibi, after the intervention of IHC.\n\nHowever, the general public is still unable to witness the trial.\n\nThe letter regretted that friends and political associates were not allowed to meet Mr Khan even after the IHC order issued on March 24.\n\nDespite their names being included in lists provided to jail authorities, they were forcefully removed, detained and humiliated, the letter alleged.\n\nThe conduct of the jail authorities reflected an “assault on the legal system of Pakistan at the core of which is obedience to court orders”.\n\nThe letter concluded the nation “needs belief in the decency of the State and the people need to be assured that they matter as human beings”.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:44:46.666Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906663/imran-seeks-top-judges-intervention-over-jail-harassment",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:02.000Z"
}
