{
  "title": "Developing countries should fast-track US trade deals: World Bank president - Business - DAWN.COM",
  "author": null,
  "content": "Developing countries should strike swift trade deals with the United States at the “earliest possible” opportunity, the president of the World Bank told AFP Friday, after a busy week with global financial leaders in Washington.\n\nAjay Banga was interviewed by AFP at the World Bank and International Monetary Fund’s Spring Meetings, which have been held this year under a cloud of uncertainty about President Donald Trump’s stop-start tariff rollout.\n\nThe Bank has been advising developing countries to get a deal done quickly with the United States, and to then focus attention on cutting trade barriers and boosting regional flows of goods, Banga said.\n\n“You need to negotiate trade systems with the US at the earliest possible (opportunity),” he said. “If you delay, it hurts everyone.”\n\nTrump’s tariffs have roiled financial markets, sent volatility surging and spooked investors and consumers.\n\nSince returning to office in January, the US leader has imposed a “baseline” 10 per cent tariff on most countries, with much higher duties on China, and 25pc sector-specific levies on areas including steel, aluminium, and automobiles not manufactured in the United States.\n\nHe also introduced much higher tariffs on dozens of countries — which have since been temporarily paused — accusing them of having an unfair trade balance with the United States.\n\nBanga also addressed the criticism levelled by US Treasury Secretary Scott Bessent at the Bank earlier this week.\n\nBessent criticised China’s “absurd” developing country status and called on Banga and IMF Managing Director Kristalina Georgieva to “earn the confidence of the administration”.\n\n“I don’t think he’s wrong,” Banga said of Bessent’s comments on China.\n\n“A country that is the size of China and the capability of China, at some point, should no longer be taking money from IBRD,” he said, referring to the International Bank for Reconstruction and Development — an arm of the World Bank that lends largely to middle-income countries.\n\nSuch a move would require the support of the World Bank’s executive board, which is made up by member states.\n\nChina, Banga said, borrowed around $750 million from the IBRD last year, while paying billions of dollars to the institution in repayments and donations.\n\n“My view is, I’ve brought it down to 750 (million), and I’m trying to figure out a way to deal with China to bring it down further,” he said. “I want to get it done. And that’s what I’m talking to the Chinese about.”\n\nBanga said the Trump administration’s criticisms of the World Bank, which included “expansive policy overreach,” were not unusual, citing newly elected governments in countries including France, Japan and Korea.\n\n“I keep telling people this is a perfectly constructive request, to say, tell me and show me that you guys are the kind of people that advance the interests of my taxpayer, of my country,” he said.\n\n“I take it in that spirit,” he said. “There’s nothing wrong with it.”\n\nSince taking the helm of the Washington-based development lender in 2023, Banga has pushed to streamline operations and encourage private sector participation, while focusing on job creation and electricity connectivity.\n\nAmong the Bank’s current priorities is a push with the African Development Bank to connect 300 million people in sub-Saharan Africa to electricity by 2030 — a process that will require a vast amount of new energy to be brought online.\n\n“You should try and get (energy) in the best, accessible way and the lowest possible cost,” Banga said, suggesting that in addition to renewable power, nuclear and gas could help provide a base load — two energy sources the World Bank is currently hesitant to finance.\n\nThe Bank’s executive board is set to discuss its energy strategy in June, Banga said, adding that funding for both nuclear and gas would likely be on the agenda.\n\nBanga said the Bank is also pushing to encourage private sector job creation in developing countries — beyond simply outsourcing jobs from advanced economies.\n\n“Because then you end up with challenges in (advanced economies), and you can see that people are speaking about them with their votes,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/26125715d857cfb.jpg",
  "retrievedAt": "2025-08-25T14:36:13.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906700/developing-countries-should-fast-track-us-trade-deals-world-bank-president",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T08:08:51.000Z"
}
