{
  "title": "US in talks with China to strike tariff deal: Trump - World - DAWN.COM",
  "author": null,
  "content": "• Predicts Saudi Arabia will enter the Abraham Accords\n• Says US will ‘lead the pack’ against Iran if N-talks fail\n\nWASHINGTON: US President Donald Trump said his administration is talking with China to strike a tariff deal and that Chinese President Xi Jinping had called him, Time magazine reported, as Beijing has so far disputed the US characterisation of talks.\n\nThe Republican president, in an interview with the magazine published on Friday, did not say when President Xi called or what the two leaders discussed. Trump said he would not call Xi.\n\n“He’s called. And I don’t think that’s a sign of weakness on his behalf,” Trump said.\n\nChina’s Foreign Ministry did not immediately respond to a request for comment on Trump’s statement. Before Trump’s latest remarks were published, it had urged Washington to stop “misleading the public” on bilateral tariff negotiations, a comment reiterated by Beijing’s embassy in Washington.\n\nTrump in the interview said he has made 200 tariff deals and expected to finish negotiations in about three or four weeks, likening the United States to a department store where he sets the price. He gave no details of any such deals.\n\nCrimea to stay with Russia\n\nTrump also laid out his plans to make various other deals with world leaders from Russia’s war in Ukraine to the Middle East with Iran and Saudi Arabia.\n\nTrump wants a quick end to the fighting and told reporters that he thinks they are close to a deal. He also said he had his own deadline, which he did not detail, while his special envoy met Putin on Friday.\n\nIn his comments published on Friday, Trump told Time that Crimea, which Russia seized from Ukraine in 2014, would remain in Moscow’s hands.\n\n“Crimea will stay with Russia. And (Ukrainian President Volodymyr) Zelensky understands that, and everybody understands that it has been with them for a long time. It has been with them long before Trump came along,” he said.\n\nSaudis to enter Abraham Accords\n\nIn the Middle East, Trump predicted that Saudi Arabia will enter the Abraham Accords, the series of normalisation agreements Trump’s administration negotiated between Israel and some Gulf countries during his first term.\n\n“I think Saudi Arabia will go into the Abraham Accords,” he said. “That will happen.”\n\nIn reply to a question about Iran, Trump said the United States will “lead the pack” in attacking Iran if talks over Tehran’s nuclear programme do not result in a new deal. He, however, expressed the hope that such a deal could be reached.\n\nAsked if he was open to meeting Supreme Leader Ali Khamenei or President Masoud Pezeshkian, Trump replied: “Sure.” Trump has said he will visit Saudi Arabia and the region next month.\n\nLawsuits at home\n\nTrump, who promised on the campaign trail to use his term in office as “retribution”, also defended his use of presidential power domestically in targeting law firms, foreign students and former US officials.\n\n“I’ve gotta be doing something right, because I’ve had a lot of law firms give me a lot of money,” he told Time.\n\nHe defended the revocation of student visas, saying “they can protest, but they can’t destroy the schools like they did with Columbia and others”. Asked if he would direct the US Department of Justice to disclose any evidence it had tying a Tufts University student who was arrested to militant group Hamas, Trump said he was not aware of the particular case but would look into it.\n\nTurkish national Rumeysa Ozturk has said US immigration authorities unlawfully arrested her based on her pro-Palestinian advocacy, including co-authoring an opinion piece in Tufts’ student newspaper.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:44:36.097Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906598/us-in-talks-with-china-to-strike-tariff-deal-trump",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:20:54.000Z"
}
