{
  "title": "Prolonged heatwave hits country today - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Pakis­tan Meteorological Depart­m­ent (PMD) has predicted a heatwave in the country from April 26 to April 30 while the National Disaster Management Autho­rity (NDMA) predicted isolated rain in northern, central and southern regions of the country from May 1 to May 7.\n\nThe PMD said that a high pressure is likely to approach the upper atmosphere from April 26 and grip most parts of the country on April 27.\n\nUnder the influence of these conditions, day temperatures are likely to remain five to seven degrees Celsius above nor­mal in southern half of Sin­dh, southern Punjab and Balo­c­h­istan from April 26 to May 1.\n\nOn the other hand, day temperatures are likely to remain four to six degrees Celsius above normal in upper half of central and upper Punjab, Islamabad, Khyber Pakhtunkhwa, Azad Jammu and Kashmir and Gilgit-Baltistan from April 27 to 30.\n\nIsolated rains forecast in first week of May\n\nA weather system is expe­cted to enter upper parts of the country from April 30. Under the inf­luence of that system, rain-wind/thunderstorm (isolated heavy rains/hailstorm) are exp­ected in Kashmir, Isla­m­abad, Pothohar region including nor­theast Punjab, upper Khyber Pakhtunkhwa and Gilgit-Baltis­tan from April 30 to May 1.\n\nThis system will subside the heatwave conditions in the country from May 1 onwards. It said that due to heatwave in the country, people, especially children, women and senior citizens should take precautionary measures.\n\nRising temperatures in northern areas may enhance snowmelt rate, especially from April 27 till May 1st.\n\nWind-dust storm/hailstorm and lightning may damage loose structures like electric poles, trees, vehicles and solar panels in Islamabad, Pothohar region including northeast Pun­jab and parts of Khyber Pakht­u­nkhwa on April 30 and May 1.\n\nMeanwhile, NDMA has issued a weather outlook indicating unstable weather conditions from May 1 to 7.\n\nMoisture influx from eastern regions and the Arabian Sea, coupled with rising temperatures and humidity, is expected to trigger moderate to heavy rainfall, windstorms, thunderstorms, lightning, and isolated hailstorms across Khyber Pakhtunkhwa, Gilgit-Baltistan, AJK, upper and central Punjab, northern Balochistan and southern Sindh.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:36:44.432Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906599/prolonged-heatwave-hits-country-today",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:20:48.000Z"
}
