{
  "title": "Rickshaw owners protest ban on three-wheelers on Karachi’s 11 major roads - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The city administration has faced strong criticism over a complete ban on operation of rickshaws on the city’s two major thoroughfares and partial ban on nine other roads amid severe shortage of public transportation facilities in the metropolis.\n\nThe Karachi commissioner has imposed a complete ban on operation of all types of rickshaws on I.I. Chundrigar Road and Sharea Faisal for a period of two months.\n\nHe also imposed similar restrictions on operation of One-Plus-Four rickshaws on nine other main roads — Shahrah-i-Quaideen (from Numaish to Sharea Faisal Nursery), Sher Shah Suri Road (from Matric Board Office to Nagan Chowrangi), Shaheed-i-Millat Road (from Jail Chowrangi to Shaheed-i-Millat Expressway), Abdullah Haroon Road (from Do Talwar to Hashoo Centre via Hoshang, Khayaban-i-Iqbal), Do Talwar to Shahrah-i-Firdous and Abdullah Shah Ghazi Mazar, Stadium Road (from Millennium Mall to New Town Police Station), Sir Shah Suleman Road (from Sir Habib Ibrahim Rehmatullah Road to Hasan Square and Karsaz), Rashid Minhas Road (from Drigh Road to Sohrab Goth), and Mauripur Road (from Gulbai to ICI Bridge) — across the city.\n\nOn Friday, a large number of rickshaw drivers, from the platform of the All Karachi Rikshaw Ittehad Union, staged a protest demonstration at Fawara Chowk near Sindh Governor House.\n\nCommuters face hardship amid shortage of buses; officials claim curbs will improve traffic flow in city\n\nThey parked their tri-wheelers on the main road causing suspension of vehicular traffic on the key road link for quite some time. It was their demand that the authorities withdraw the ban on all types of rickshaws on the 11 roads across the metropolis.\n\nThe disappearance of an important mode of transportation from roads amid severe shortage of public buses sparked criticism and disapproval from the people as a large number of them, mostly women, suffered due to disruption in transport facilities.\n\nThe authorities claimed that the ban was imposed to ease out traffic congestion in certain strategic tracks where public transport was available while the people said that the decision had led to a great deal of hardship for those who travelled short distances to reach their destinations by the two- or four-seater rickshaws.\n\nThe worst affected are the ones who have their offices located on the major arteries of the city, including Sharea Faisal, which has been closed for operation of both One-Plus-Two and One-Plus-Four rickshaws.\n\nSimilarly, the restriction on two-seater and four-seater rickshaws on Shaheed-i-Millat Road from Jail Chowrangi to Shaheed-i-Millat Expressway also piled miseries on people going to their offices in the neighbourhood.\n\nCommissioner Syed Hassan Naqvi told Dawn that the basic reason of imposing the ban was to discourage the exponential growth of uncontrolled and unregistered rickshaws.\n\nHe claimed that operation of rickshaws was banned on only a few strategic tracks where public transport was available keeping in view the underdeveloped mass transit systems and public needs.\n\nThe ban, enforced under Section 144 of the criminal procedure code (CrPC), was recommended by the DIG-traffic and it would remain effective from April 15 to June 14.\n\nOfficials sources said that the traffic police had reported to the city administration that the number of unauthorised and self-established illegal routes and rickshaw stands in different parts of the city were the main contributors to traffic congestion on certain roads.\n\nThey said that the ban on operation of rickshaws on certain roads would help end the unauthorised and self-established illegal routes and improve the traffic flow.\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680c149504c74.gif",
  "retrievedAt": "2025-10-12T02:45:21.011Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906617/rickshaw-owners-protest-ban-on-three-wheelers-on-karachis-11-major-roads",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:28.000Z"
}
