{
  "title": "Liverpool braced for Premier League title party - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Liverpool have one hand on the Premier League trophy as they seek the solitary point they need against struggling Tottenham Hot­spur on Sunday that would guarantee a record-equalling 20th English title.\n\nA draw at an expectant Anfield would take Arne Slot’s men 13 points clear of Arsenal with just four games remaining, meaning they could not be caught.\n\nBelow them, Chelsea and Newcastle United have the chance to press their case for Champions League qualification with Manchester City, Nottingham Forest and Aston Villa all involved in the FA Cup semi-finals.\n\nAt the bottom of the table, Ipswich Town’s fate could be sealed.\n\nIt is tough to see struggling Tottenham delaying Liverpool’s title party at Anfield.\n\nAfter Arsenal’s home draw against Crystal Palace in midweek, Arne Slot’s men just need a draw to seal the deal and pull level with bitter rivals Manchester United on 20 English titles.\n\nOut-of-form Tottenham are 16th in the league table and have a miserable record at Anfield — not winning there since 2011.\n\nLiverpool won the reverse fixture this season 6-3 and were 4-1 winners on aggregate in their two-legged League Cup semi-final.\n\nCaptain Virgil van Dijk said it had been an “outstanding season” but that there was still work to do after Liverpool’s 1-0 at Leicester last week.\n\n“Now we have the chance to finish it off on the weekend against a very good Tottenham, in my opinion,” he said. “We played three times already against them this season and every game was very intense. To be in this position now, it’s a good position but we’re not there yet.\n\n“We all have to realise that and we will. We’ll make sure of that. It’s a good week of preparation and then we have to be ready.”\n\nMeanwhile, just four points separate third-placed Manchester City from Aston Villa in seventh in the race for Champions League spots next season.\n\nFor the first time the Premier League’s top five will all qualify for Europe’s top club competition, due to strong performances in continental competition.\n\nLiverpool are already guaranteed a spot and Arsenal, 10 points clear of Chelsea in sixth, are practically there, leaving three places open.\n\nCity stole a march this week in the mini-league with a last-gasp win agai­nst Villa after Nottingham Forest, now fourth, beat Tottenham on Monday.\n\nVilla play Crystal Palace in the FA Cup semi-finals on Saturday, with Forest taking on City the following day at Wembley.\n\nIt means Newcastle, who could have Eddie Howe back on the touchline after a bout of pneumonia, would leapfrog City if they beat lowly Ipswich.\n\nChelsea badly need to beat Everton at home with a tough run of games to come against Liverpool, Newcastle, Manchester United and Forest.\n\nSouthampton’s 1-1 draw at West Ham United last week meant they drew level with Derby’s record-low points tally of 11 from the 2007/08 season, with five games to go to better the Rams’ total.\n\nBut it will be of limited comfort after a miserable season for Saints, who were relegated earlier this month.\n\nLeicester City are already down and Ipswich appear certain to follow them barring a miracle — a draw for West Ham at Brighton and Hove Albion on Saturday would seal their fate.\n\nIt would be the second successive season in which all three promoted clubs had been relegated straight back to the Championship.\n\nPrior to the 2023/24 campaign, this had last occurred in 1997/98.\n\nAll the evidence points to a worrying and widening chasm between English football’s top two tiers as the season nears its end.\n\nFA CUP\n\nPalace have never won the FA Cup, Villa last lifted the trophy in 1957 and Forest have not managed it since 1959 but all three clubs go into the semi-finals genuinely believing this could be their year.\n\nCity, who face Forest on Sunday, make up the quartet and would ordinarily be huge favourites to win the historic knockout competition for the eighth time.\n\nBut with Pep Guardiola’s City experiencing a disappointing campaign, it looks wide open.\n\nPalace face Villa on Saturday while City are aiming for a third straight appearance in the final, having won and lost the title match to Manchester United over the past two years.\n\nPremier League fixtures: Saturday (1400 GMT unless stated): Chelsea v Everton (1130), Brighton and Hove Albion v West Ham United, Newcastle United v Ipswich Town, Southampton v Fulham, Wolverhampton Wanderers v Leicester City; Sunday Bournemouth v Manchester United (1300), Liverpool v Tottenham Hotspur (1530).\n\nFA Cup semi-finals fixtures: Saturday: Crystal Palace v Aston Villa (1615 GMT); Sunday: Notting­ham Forest v Manchester City (1530 GMT).\n\nPublished in Dawn, April 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:36:26.371Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906625/liverpool-braced-for-premier-league-title-party",
  "dateList": "2025-04-26",
  "date_published": "2025-04-26T00:21:17.000Z"
}
