{
  "article_id": "2025-08-06_bbfaba1fa32bb2a6c3826e90ed9dbd13",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/high-commission-of-malaysia-hosts-3c-forum-for-mtcp-alumni/",
    "retrieved_at": "2025-08-10T10:20:33.131Z"
  },
  "metadata": {
    "title": "High Commission of Malaysia, hosts 3C Forum for MTCP, alumni",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 511,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 06 (APP): The High Commission of Malaysia in Islamabad Wednesday hosted the 3C Forum: Culture, Cuisines and Connections, a special engagement featuring alumni of the Malaysian Technical Cooperation Programme (MTCP) and former students of Malaysian universities. The event was officiated by the High Commissioner of Malaysia to Pakistan, H.E. Ambassador Dato' Mohammad Azhar Mazlan, and graced as Chief guest by Attaullah Tarar, Federal Minister for Information and Broadcasting. The forum brought together a diverse group of attendees, including the Dean of Diplomatic Corp, Heads of Missions from ASEAN countries, Pakistani government officials, MTCP alumni, media professionals, and members of academia. This people-to-people initiative aimed to deepen Malaysia-Pakistan bilateral ties through cultural exchange, alumni diplomacy, and enhanced mutual understanding. During the event, guests were shown series of corporate videos promoting Malaysia's education system, the Visit Malaysia 2026 initiative, and the wide-ranging impact of the MTCP, which has benefited over 37,000 participants from 144 countries since its inception in 1980, including more than 800 Pakistani professionals across various sectors. In his keynote remarks, Ambassador Dato' Azhar Mazlan highlighted the growing importance of alumni networks as strategic assets in fostering long-term diplomatic, educational, and economic partnerships. He also emphasized Malaysia's aspiration to be a center of excellence in higher education and technical cooperation, underscoring its strong performance in global university rankings and niche sectors such as the halal industry, Islamic finance, aerospace, and semiconductors. Federal Minister for Information and Broadcasting, Mr. Attaullah Tarar, in his address, recalled his personal visit to Malaysia, where he experienced firsthand the warmth of Malaysian hospitality and the country's robust tourism offerings. He noted that Malaysia's integration of culture, heritage, and modern development offers a valuable model for countries like Pakistan. The Minister reaffirmed Pakistan's commitment to strengthening bilateral ties with Malaysia, referencing the successful Official Visit of Prime Minister Dato' Seri Anwar Ibrahim to Pakistan in October 2024, which revitalized cooperation in trade, investment, education, and the digital economy. Minister Tarar shared that Malaysia holds a special place in his heart, not only due to his visit but also because of the deep and longstanding people-to-people connections that continue to flourish. Minister Tarar also expressed optimism about the forthcoming Official Visit of Prime Minister Muhammad Shehbaz Sharif to Malaysia later this year, which is expected to further enhance strategic collaboration, particularly in high-tech sectors, TVET cooperation, and tourism exchange. He emphasized the need to capitalize on platforms like the MTCP and alumni networks to translate goodwill into tangible outcomes. A highlight of the forum was the alumni panel discussion, where former MTCP participants and graduates of Malaysian universities shared insights on their experiences in Malaysia and their current contributions to Pakistan's development. This was followed by an engaging Q&A session, promoting interactive dialogue among stakeholders. The event concluded with a networking high tea featuring Malaysian cuisine, allowing guests to further engage and explore areas of potential cooperation. The 3C Forum served as a meaningful platform to celebrate shared values, expand alumni engagement, and contribute to the strengthening of Malaysia-Pakistan relations through soft diplomacy and cultural connectivity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}