{
  "article_id": "2025-08-06_44944a7804a9a9be1838422880aaa6da",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/new-polio-case-reported-from-lakki-marwat/",
    "retrieved_at": "2025-08-10T10:20:25.988Z"
  },
  "metadata": {
    "title": "New Polio case reported from Lakki Marwat",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 498,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 05 (APP): The Regional Reference Laboratory for Polio Eradication at the National Institute of Health (NIH) has confirmed a new case of polio from District Lakki Marwat in South Khyber Pakhtunkhwa. The case involves a five-month-old child from Union Council Sulemankhel. This is the 12th polio case reported from the KP this year, bringing the total number of polio cases in Pakistan in 2025 to nineteen. The continued detection of polio cases highlights the ongoing threat to children, especially in areas with low vaccine acceptance. It is crucial for communities to understand that repeated vaccination is essential to protect every child against poliovirus. Multiple doses are needed to build and maintain immunity. Every unvaccinated child remains at risk and may contribute to further transmission of the virus. Polio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine (OPV) for every child under five during each campaign, along with the timely completion of all essential immunizations.Polio vaccination drive Despite significant improvements in the quality of polio vaccination campaigns nationwide, the southern districts of Khyber Pakhtunkhwa remain a key area of concern due to restricted access, lack of female vaccinators and operational challenges in conducting house-to-house vaccination. These barriers continue to hinder immunization efforts in southern Khyber Pakhtunkhwa, leaving thousands of children unvaccinated. Over the past year, the Pakistan PEI has achieved significant progress. Since September 2024, six high-quality immunization campaigns, including four nationwide campaigns, have successfully reached over 45 million children each. The National Emergency Operations Centre is planning to conduct two nationwide and one sub-national campaign between September and December 2025, besides targeted campaigns in selected high-risk districts. These sustained efforts are essential to interrupt poliovirus transmission and protect children across the country. A special high-level meeting was chaired by Chief Secretary KP, Shahab Ali Shah, in Peshawar on August 2nd and 3rd. District teams from South KP presented customized operational plans highlighting microplanning innovations, gap analyses, and strategies to overcome persistent challenges in high-risk areas. After in-depth deliberations, a consensus roadmap was finalized, aligning district strategies with the provincial vision for a polio-free KP. The next polio vaccination campaign in Pakistan will begin on 1st September, with a special focus on high-risk and priority areas including South Khyber Pakhtunkhwa. The campaign aims to vaccinate all children under the age of five, quickly boosting their immunity and closing any gaps. Parents and caregivers have been asked to ensure their children receive polio drops during this important campaign to help protect them from lifelong paralysis. Polio eradication is a collective responsibility that requires unified efforts at all levels. While dedicated frontline polio workers continue to deliver life-saving vaccines, it is equally critical for parents and caregivers to ensure their children receive every dose of the polio vaccine.Polio vaccination drive Communities must play an active role by supporting vaccination efforts, dispelling misinformation, and encouraging others to protect their children through timely immunization.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}