{
  "article_id": "2025-08-06_bd54c369f7284cc54497c273abc1aafe",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bangladesh-national-flag-hoisted-at-new-chancery-to-mark-peoples-uprising-day/",
    "retrieved_at": "2025-08-10T10:34:11.974Z"
  },
  "metadata": {
    "title": "Bangladesh national flag hoisted at new chancery to mark People’s Uprising Day",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 207,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, August 06 (APP): The national flag of Bangladesh was hoisted for the first time at the newly constructed Chancery Complex of the Bangladesh High Commission in Islamabad to mark the People's Uprising Day. Bangladesh High Commissioner to Pakistan, Md. Iqbal Hussain Khan, raised the flag atop a 49-foot pole as the national anthem played, symbolizing a significant diplomatic milestone for the country's presence in Pakistan. A large gathering attended the historic occasion, including the mission's defence advisor, deputy high commissioner, press counsellor, head of chancery, other diplomatic staff, and employees of the high commission. Also in attendance were expatriate Bangladeshi architect Mazhar who contributed to the project and Pakistani engineers Latif and Mozammel, along with many local citizens. Speaking at the ceremony, High Commissioner Iqbal Hussain Khan emphasized the symbolic significance of the event. \"This Chancery Complex and today's flag hoisting mark an important milestone in the 49-year history of Bangladesh's diplomatic mission in Islamabad. It stands as a proud testament to our independence, sovereignty, and national identity,\" he said. Located in the heart of Islamabad's Diplomatic Enclave, the new complex is set to enhance the high commission's diplomatic outreach and operational capacity in Pakistan, opening a new chapter in bilateral engagement between the two countries.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}