{
  "article_id": "2025-08-06_19780352cf4f4819c2fb69515b19ef0a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-mart-to-rise-in-uae-a-game-changer-for-pakistani-exports/",
    "retrieved_at": "2025-08-10T10:19:52.182Z"
  },
  "metadata": {
    "title": "‘Pakistan Mart’ to rise in UAE: a game-changer for Pakistani exports",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 350,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 6 (APP):In a major leap towards boosting Pakistani exports, a delegation from National Logistics Corporation (NLC) and DP World, led by Director General NLC, met the Federal Minister for Commerce, Jam Kamal Khan. Also present were Mr. Fakhr Alam, Vice Chairman DP World and CEO of Pakistan Mart Project in the UAE, Rana Ihsaan Afzal, Coordinator to the Prime Minister, and Muhammad Ashraf, Executive Director General from the Ministry of Commerce, said a release issued here on Wednesday. The delegation unveiled a comprehensive presentation on the upcoming \"Pakistan Mart\"-a landmark commercial hub to be established near Jebel Ali, UAE. The DP World has pledged its full support by constructing this flagship project at zero construction cost for Pakistani stakeholders. The proposed Pakistan Mart will include commercial units, designed to house warehouses, retail shops, showrooms, and e-commerce fulfillment centers for Pakistani exporters and traders. It is envisioned as a one-stop marketplace to showcase Made-in-Pakistan products to Middle Eastern, African, and international buyers. Minister Jam Kamal Khan hailed the initiative as a \"transformational project\" for Pakistani trade and export visibility. He emphasized the potential of sectors such as textiles, garments, surgical instruments, sports goods, food items, perishables, and nutraceuticals, noting that they are well-positioned to take advantage of this opportunity. He added that the mart must also cater to e-commerce fulfillment and logistics solutions to tap into the growing digital export market. The Commerce Minister directed all relevant departments of the Ministry of Commerce, including TDAP (Trade Development Authority of Pakistan), to urgently coordinate and support the development of this initiative. He assured the delegation of the government's full facilitation in streamlining processes and identifying export-ready enterprises to occupy the upcoming facility. The delegation of NLC and DP World urged the Ministry of Commerce to play an enabling role in selecting tenants, ensuring awareness campaigns, and supporting exporters in utilizing this golden opportunity. The minister thanked the delegation and leadership for their support and such initiative. Pakistan Mart in UAE is poised to become a landmark step in export diversification, trade facilitation, and Pakistan's economic diplomacy in the Gulf region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}