{
  "article_id": "2025-08-06_e87ea93b88111b0d0c39649da883446e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/no-targeted-operation-against-any-specific-tribe-na-told/",
    "retrieved_at": "2025-08-10T10:19:10.272Z"
  },
  "metadata": {
    "title": "No targeted operation against any specific tribe: NA told",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 217,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 06 (APP):Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry on Wednesday strongly refuted allegations that the federal government was conducting targeted operations against any particular area or tribe and termed such assertions unfounded and damaging to national unity. Responding to points raised by various members, he said Pakistan had long been at the forefront of the fight against terrorism, standing as a \"steel wall\" to protect not only its own citizens but also the wider world from the scourge of militancy. He said that Pakistan had made immense sacrifices in this war against terror. \"Terrorists choose their own targets and locations - whether it is an attack on the Jaffar Express in Balochistan, an assault on children, or incidents in tribal areas,\" he said adding that naturally, operations are carried out where the incidents take place. The minister warned against attempts to create divisions between state institutions and tribal people, stressing that such narratives only served the interests of enemies of the country. Dr. Tariq Fazal Chaudhry emphasized that the war against terrorism was a collective national struggle that required unity, without any discrimination on the basis of sect, province, or ethnicity. He paid tribute to the tribal people for their sacrifices in this fight, acknowledging the hardships they had endured in defending the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}