{
  "title": "Senate body expresses displeasure over absence of senior officers from Communications Ministry, NHA",
  "author": null,
  "content": "ISLAMABAD, Oct 06 (APP): The Senate Standing Committee on Communications on Monday expressed concern over the absence of senior officers from the Ministry of Communications and the National Highway Authority (NHA) during its meeting held at the Parliament House.\nThe meeting, chaired by Senator Pervaiz Rashid, was attended by Senators Jam Saifullah Khan, Niaz Ahmad, Kamil Ali Agha, Saifullah Abro, Dost Ali Jeesar, Mohammad Abdul Qadir, and Zamir Hussain Ghumro, said a press release.\nThe members emphasized the importance of the Committee as a vital parliamentary forum dedicated to addressing issues in the national interest and serving the people of Pakistan.\nThe Chairman of the Committee, Senator Pervaiz Rasheed, took strong notice of the non-serious attitude displayed by the concerned Ministry and departments. He directed that, in future, the Chairman NHA must inform the Committee in advance in case of any unavoidable absence. The Chairman further instructed that a strong message of displeasure be conveyed to the relevant authorities for showing disregard toward such an important parliamentary forum.\nSenator Saifullah Abro informed the Committee that not a single meeting of the Sub-Committee, constituted under the main Standing Committee on Communications, had been attended by the senior management of the Ministry of Communications. He alleged that officials were attempting to conceal major irregularities within their departments and lacked the courage to appear before the parliamentary body. He further stated that the Ministry had failed to address the concerns of the Sub-Committee and had not produced relevant documents before the committee.\nSenator Abro also appreciated the recent action taken by the Prime Minister regarding the suspension of three members and eight officers of the concerned Ministry/ Department for neglecting their duties and alleged involvement in corrupt practices. The Committee expressed grave concern over the awarding of the Gilgit–Shandur contract to a blacklisted company that had previously failed to deliver on multiple projects.\nMembers of the Committee unanimously appreciated the sincere efforts of Senator Saifullah Abro and lauded his decision to continue serving in the Senate.\nIn view of the absence of senior officials from the Ministry of Communications and NHA, the Committee unanimously decided to postpone the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:53:49.474Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-body-expresses-displeasure-over-absence-of-senior-officers-from-communications-ministry-nha/",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T15:22:00.000Z"
}
