{
  "title": "Pakistan values its longstanding ties with UK, says Mohsin Naqvi",
  "author": null,
  "content": "ISLAMABAD, Oct 6 (APP): Federal Minister for Interior Mohsin Naqvi held an important meeting on Monday with British Member of Parliament Lord Shaukat Mahmood, during which both sides discussed ways to strengthen Pakistan–United Kingdom bilateral relations and promote mutual cooperation in various sectors of shared interests.\nDuring the meeting, Minister Naqvi emphasized that Pakistan holds its historic and multifaceted relationship with the United Kingdom in the highest regard, noting that the partnership between the two countries is rooted in mutual respect, trust, and people-to-people connections.\nHe highlighted the significant contribution of the Pakistani diaspora in the United Kingdom, describing it as a vibrant, multidimensional community that continues to play a pivotal role in the social and economic development of both nations.\n“The Pakistani community in Britain acts as a strong bridge of understanding and collaboration between the two countries,” Naqvi stated.\nAddressing issues related to criminal activities by individuals of Pakistani origin abroad, the Interior Minister made it clear that Pakistan strongly condemns any involvement of its citizens in unlawful acts anywhere in the world.\n“It is our responsibility to take back those who are genuinely Pakistani and involved in criminal activities, but not those who have renounced their Pakistani citizenship,” he asserted.\nLord Shaukat Mahmood expressed appreciation for Pakistan’s efforts to strengthen bilateral relations and assured that he would continue to play a proactive role in further deepening cooperation between the two nations.\nSenior officials, including Federal Secretary for Interior Muhammad Khurram Agha, Deputy Commissioner Islamabad, and other government representatives, were also present during the meeting.\nThe discussion reaffirmed both sides’ commitment to enhancing cooperation in security, governance, and community development, and underscored the shared determination to further solidify Pakistan-UK ties for mutual progress and prosperity.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:53:52.770Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-values-its-longstanding-ties-with-uk-says-mohsin-naqvi/",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T11:57:00.000Z"
}
