{
  "title": "Malaysia to import $200m meat from Pakistan as countries vow to strengthen multisector ties",
  "author": null,
  "content": "PUTRAJAYA, Oct 6 (APP): Pakistan and Malaysia on Monday vowed to deepen bilateral cooperation across various sectors, including trade, education, Halal certification, and anti-corruption efforts, with Malaysia announcing to import $200 million worth of Halal meat from Pakistan.\nPrime Minister Shehbaz Sharif and his Malaysian counterpart Anwar Ibrahim, following their “very productive” discussions at their meeting and delegation level talks, told a joint press stakeout that their deliberations encompassed bilateral cooperation as well as international issues including the Israel’s oppression in Gaza.\nPrime Minister Shehbaz, who is on his first visit to Malaysia, said that Pakistan desired to join hands with Malaysia to learn from its expertise and pursue joint ventures and mutually beneficial projects as both sides could collaborate in areas agriculture, IT, and vocational and skills training, where Pakistan was doing “wonderfully well.”\nReferring to huge number of students studying in each other’s countries, he called for harnessing this potential to make the two economies stronger and move forward in unison through win-win cooperation.\n“You announced a quota of $200 million for meat exports from Pakistan to Malaysia. Let me assure our Malaysian importers and officials that this quota will be regulated by market price mechanisms and will fully comply with all Halal certification requirements set by Malaysian customs and food authorities. I guarantee that we will make every possible effort to meet all your conditions, ensuring not only that we achieve this $200 million quota but also that we surpass it with a quantum leap. When consumers are satisfied, the sky is the limit,” the prime minister remarked.\nThe prime minister, who earlier presented Anwar Ibrahim with an Urdu version of his book “SCRIPT: For a Better Malaysia,” repeatedly spoke highly of his leadership skills marking compassion, kindness, outstanding courage, resilience, and patience with a sharp focus on building Malaysia as one of the strongest economies in the world.\nHe said the book’s translated version added another bridge between Pakistan and Malaysia as Anwar Ibrahim’s work was guiding framework for his Madani vision of sustainability, mutual respect, care, innovation, research and development, prosperity, and mutual trust.\nHe appreciated that last year, the works of Allama Iqbal—Shikwa Jawab-e-Shikwa, Asrar-e-Khudi, and The Reconstruction of Religious Thought in Islam—were translated into Malay, emphasising that Iqbals’a philosophy called for self-realization and self-discovery and that nations were built not through magic wands but through hard work, tireless efforts, and unwavering commitment.\nExpressing gratitude to the Malaysian government for “exceptionally warm” welcome to him and his delegation, the prime minister said that he would leave Malaysia – my second home – for Pakistan on Tuesday as far more informed and inspired of Malaysia’s development journey which Pakistan – a 240 million nation- also wanted to achieve.\nHe said that Pakistan would forge a great partnership with Malaysia to achieve shared goals as the country had infinite blessings from Allah, including minerals, water, brilliant minds, fertile land, and the will to succeed.\nIn his remarks, Malaysian Prime Minister Anwar Ibrahim said that over the years, Pakistan and Malaysia had established strong ties in education, defense, and other fields, while continuously expanding economic cooperation.\nHe said in this era of geopolitical uncertainties, both sides saw immense potential to deepen partnership in defense, agriculture, digital technologies, energy, and emerging fields.\nHe said to strengthen bilateral economic ties, Malaysia would facilitate Pakistan’s interest to export meat to Malaysia and would do whatever was necessary to achieve these goals.\nOn regional issues, he emphasized that peace between Pakistan and India was vital for regional stability.\nAppreciating Pakistan’s stance on Gaza, Anwar Ibrahim said both countries reaffirmed call for concrete action to end Gaza suffering.\nHe said that Malaysia supported the 20-point peace initiative proposed by US President Donald Trump, while maintaining certain reservations on its framework.\nHe also appreciated the the contributions of Pakistani professionals, skilled workers and students who had long been part of the Malaysian development landscape.\nExpressing gratitude for the translation of his book, he said Malaysia had also undertaken the great work of translating the scholarly contributions of Allama Iqbal as his profound intellectual legacy continued to inspire them.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:53:54.138Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/malaysia-to-import-200m-meat-from-pakistan-as-countries-vow-to-strengthen-multisector-ties/",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T10:00:00.000Z"
}
