{
  "title": "Modi’s tax overhaul to strain finances but boost image amid US trade tensions - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi’s deepest tax cuts in eight years will strain government revenues but are winning praise from businesses and political pundits who say they will bolster his image in an ongoing trade fight with Washington.\n\nIn the biggest tax overhaul since 2017, Modi’s government on Saturday announced sweeping changes to the complex goods and services tax (GST) regime which will make daily essentials and electronics cheaper from October, helping consumers and also companies like Nestle, Samsung and LG Electronics.\n\nAt the same time, in his Independence Day speech on Friday, Modi urged Indians to use more goods made domestically, echoing calls from many of his supporters to boycott US products after Donald Trump hiked tariffs on imports from India to 50 per cent as of August 27.\n\nThe tax cut plan comes with costs given GST is a major revenue generator. IDFC First Bank says the cuts will boost India’s GDP by 0.6 percentage points over 12 months but will cost the state and federal government $20 billion annually.\n\nBut it will improve weak stock market sentiment and bring political dividends for Modi ahead of a critical state election in the eastern state of Bihar, said Rasheed Kidwai, a fellow at New Delhi-based Observer Research Foundation.\n\n“GST reduction will impact everyone, unlike cuts to income tax, which is paid by only 3-4pc of the population. Modi is doing this as he is under a lot of pressure due to US policies,” said Kidwai.\n\n“The move will also help the stock market, which is now politically important as it has a lot of retail investors.”\n\nIndia launched the major tax system in 2017 that subsumed local state taxes into the new, nationwide GST to unify its economy for the first time.\n\nBut the biggest tax reform since India’s independence faced criticism for its complex design that taxes products and services under four slabs — 5pc, 12pc, 18pc and 28pc.\n\nLast year, India said caramel popcorn would be taxed at 18pc but the salted category at 5pc, triggering criticism about a glaring example of GST’s complexities.\n\nUnder the new system, India will abolish the 28pc slab — which includes cars and electronics — and move nearly all of the items under the 12pc category to the lower 5pc slab, benefitting many more consumer items and packaged foods.\n\nGovernment data shows the 28pc and 12pc tax slabs together garner 16pc of India’s annual GST revenue of roughly $250 billion last fiscal year.\n\nBihar is a key state politically and goes to the polls by November. A recent survey by the VoteVibe agency showed Modi’s opposition has an edge largely because of a lack of jobs.\n\n“Any tax cut has wide public appreciation. But of course, the timing is purely determined by political exigencies,” said Dilip Cherian, a communications consultant and co-founder of Indian public relations firm Perfect Relations.\n\n“It seems to be an indication of some mixture of frustration as well as recognition that there is a broad public pushback against high and crippling rates of taxation.”\n\nModi’s ruling Bharatiya Janata Party has seized on his tax announcement, posting on X that on the Hindu festival of lights, Diwali, “a brighter gift of simpler taxes and more savings is waiting for every Indian.”\n\nModi has vowed to protect farmers, fishermen and cattlemen, following Trump’s surprise tariff announcement on India, after trade talks between New Delhi and Washington collapsed over disagreement on opening India’s vast farm and dairy sectors and stopping Russian oil purchases.\n\nThe latest round of trade talks between the two nations set for August 25-29 has also been called off.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/171445066ea6699.jpg",
  "retrievedAt": "2025-08-18T02:37:05.681Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931462/modis-tax-overhaul-to-strain-finances-but-boost-image-amid-us-trade-tensions",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T09:49:39.000Z"
}
