{
  "title": "Business leaders seek rate cut, power relief to spur exports - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Business leaders on Saturday called on the government to create a pro-business environment by cutting interest rates, lowering power tariffs, and supporting export-led growth.\n\nSpeaking at a joint press conference on the economic roadmap, Federation of Pakistan Chambers of Commerce and Industry (FPCCI) President Atif Ikram Sheikh and United Business Group Patron-in-Chief S.M. Tanveer said reducing the policy rate from the current 11pc to 6-7pc would not only stimulate investment but also help the government save about Rs3.5tr annually in debt servicing.\n\nThey noted that the power tariff had already fallen to Rs31 per unit from Rs48 through FPCCI’s efforts, with further negotiations underway to bring it down to nine cents (around Rs26 per unit). Lower energy costs, they argued, would improve competitiveness for domestic producers and exporters.\n\nThe business leaders stressed that Pakistan’s $40bn trade deficit could be narrowed by promoting exports and increasing local productivity. They pledged FPCCI’s full support to the government in pursuing the $100bn export target, provided consistent pro-business policies were implemented.\n\nThey also urged the government to focus on “district economies” by empowering local business leadership to spearhead growth initiatives. “Every district can export its product and earn valuable foreign exchange,” they said, adding that public–private partnerships were vital for sustainable export growth.\n\nPakistan-Ethiopia Business Council\n\nSeparately, the fourth meeting of the Pakistan-Ethiopia Business Council was held at the FPCCI headquarters to explore new avenues of cooperation in trade, climate resilience, and coastal development.\n\nEthiopia’s Ambassador to Pakistan, Dr Jamal Bakar Abdullah, led a high-level delegation to the session. Sindh Environment Secretary Zubair Ahmed Channa, SEPA Director General Waqar Hussain Phulpoto, FPCCI office-bearers, and environmental experts also participated.\n\nThe meeting agreed to strengthen bilateral ties in green energy, environmental sustainability, and coastal development, according to a Sindh government statement.\n\nMr Sheikh highlighted that bilateral trade currently stands at $67m, mostly in textiles and machinery, but opportunities also exist in agriculture. “Ethiopia is one of Africa’s fastest-growing economies and Pakistan is keen to deepen economic engagement,” he said.\n\nMr Channa underlined the need for international partnerships to tackle climate challenges. He announced that joint Pakistan-Ethiopia teams would be formed to conduct research and projects in environmental sustainability, renewable energy, and coastal development.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0910020881aad5d.jpg?r=100214",
  "retrievedAt": "2025-08-18T02:38:21.807Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931344/business-leaders-seek-rate-cut-power-relief-to-spur-exports",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:35:41.000Z"
}
