{
  "title": "Faceless clearance lifts vehicle imports, not revenues - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The import of used vehicles jumped by nearly 41 per cent in the second half of FY25 following the introduction of faceless customs clearance, though revenue growth remained marginal, indicating limited fiscal gains despite higher volumes.\n\nBetween Dec 16, 2024 and June 30, 2025, a total of 25,347 vehicles were imported under the new system compared to 17,958 units cleared during June 1 to Dec 15, 2024, under the old regime.\n\nRevenue collection in the post-faceless period stood at Rs62.94bn, barely above the Rs62.17bn collected earlier, reflecting an increase of just 1.22pc.\n\nThe government allows imports of used cars up to three years old and other vehicles up to five years old under three schemes for overseas Pakistanis: personal baggage, transfer of residence, and gift. In the FY25 budget, commercial imports of used vehicles outside these schemes were permitted but subjected to higher duties and taxes.\n\n41pc surge in used vehicle imports offset by mere 1.2pc revenue gain\n\nFBR data showed that 3,721 vehicles were cleared in July 2025 alone, underscoring the impact of the revised tax regime. Officials said depreciation is calculated at 1pc per month, meaning vehicles imported in the initial six months fetched relatively higher duties compared to later arrivals.\n\nSegment-wise breakdown\n\nA closer look at the data highlights contrasting trends across engine categories.\n\nIn the sub-850cc segment, clearances rose from 9,734 units in the pre-faceless period to 13,522 post-faceless, while duties collected increased from Rs9.67bn to Rs13.64bn. Average duty per unit, however, barely moved — from Rs0.993m to Rs1.009m.\n\nThe 850-1000cc category also expanded sharply, with volumes more than doubling from 4,126 to 9,486 units. Revenue climbed from Rs5.28bn to Rs10.84bn, though the average per-unit duty fell to Rs1.14m from Rs1.28m, suggesting buyers tilted toward lower-value models.\n\nBy contrast, demand collapsed in higher segments. Clearances of 1,000-1,500cc vehicles plunged from 1,492 units to 473, with revenue falling to Rs2.59bn from Rs6.59bn. Yet per-unit duty rose from Rs4.42m to Rs5.49m, indicating imports skewed toward pricier models despite lower volumes.\n\nThe 1500-1800cc category recorded the steepest contraction, from 376 to just 36 units, with revenue tumbling from Rs1.95bn to Rs257m. Per-unit duty increased to Rs7.14m from Rs5.18m.\n\nIn the 1800cc and above bracket, volumes held steady — rising slightly from 1,113 to 1,144 units — but revenue dropped to Rs25.83bn from Rs29.95bn. The average duty per vehicle declined to Rs25.83m from Rs26.91m.\n\nHybrids and EVs\n\nHybrid imports remained uneven. Small non-PHEV hybrids up to 1,300cc vanished entirely after the new regime. Imports of 1,500-1,800cc hybrids halved to 86 units from 177, though the average duty rose to Rs3m per unit from Rs2.66m.\n\nLarger hybrids (1,800cc and above) fell dramatically to 36 units from 349, yet the average duty soared to Rs17.14m from Rs4.38m. Diesel/semi-diesel hybrids dropped to 15 units from 70, with per-unit duty dipping to Rs25.21m from Rs27.36m.\n\nPlug-in hybrids (PHEVs) moved against the tide: just 17 units were cleared post-faceless, but per-unit duty leapt to Rs58.89m from Rs26.49m, pushing up overall revenue.\n\nElectric vehicles showed steadier demand. Imports inched up to 532 units from 473 earlier, though average duty per unit slipped to Rs7.16m from Rs8.32m, reflecting a possible shift toward smaller or mid-range EVs.\n\nPolicy implications\n\nAnalysts note that while the faceless clearance system has boosted transparency and reduced discretionary powers, the skew in demand towards smaller vehicles and EVs has curbed potential fiscal gains. Imports in higher-duty segments have dropped sharply, reducing overall revenue despite higher aggregate volumes.\n\nThe development underscores a recurring dilemma for policymakers: balancing revenue needs with consumer demand for affordable mobility and the government’s drive to promote greener, energy-efficient transport.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/2107550101ef2c9.jpg?r=104523",
  "retrievedAt": "2025-08-18T02:38:21.106Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931345/faceless-clearance-lifts-vehicle-imports-not-revenues",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:35:41.000Z"
}
