{
  "title": "Mayor urges prime minister to take notice of Sindh governor’s political activities - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: City Mayor Barrister Murtaza Wahab on Saturday criticised Sindh Governor Kamran Tessori over his recent statement and asked the prime minister to take immediate notice of his involvement in political activities.\n\n“Can a governor be engaged in politics? The governor should not carry any political party’s flag. He should raise the slogan of Pakistan Zindabad, not represent any party,” he said while talking to the media after laying the foundation stone of several development projects in district Korangi.\n\nIn a thinly veiled comment on Mr Tessori’s recent statement in which he talked about the comeback of “bhai” and revival of “old MQM”, the mayor said: “Perhaps he thinks of himself as ‘Bhai’.”\n\nAs the office of the president and provincial governors are apolitical, the mayor called on the prime minister to take immediate notice of the matter.\n\nWahab lays foundation stone for uplift schemes in Korangi district; says Karachi is transforming under Bilawal’s leadership\n\nMr Wahab said that public convenience and urban development were his top priorities.\n\n“Today’s Karachi is transforming under the leadership of Bilawal Bhutto-Zardari, and the people are expressing full confidence in the Pakistan Peoples Party,” he said. “We are serving without discrimination or bias. We don’t care which UC belongs to whom; if there are Karachiites living there, then Bilawal Bhutto’s party will certainly deliver services. We see serving the people of Korangi as an opportunity and are passionate about it,” he added.\n\nMayor Wahab highlighted that after 22 years, an improvement was finally made to Karachi’s water infrastructure with the completion of the new Hub Canal. “This revolutionary step is a slap in the face of those who only made promises.”\n\nHe added that the K-IV project has already been inaugurated five times by five different prime ministers and leaders, but no real progress was made. “Now, your jiyala mayor and deputy mayor have completed the new Hub Canal, which is improving water supply for citizens. We’ve also begun work on the parts of the K-IV project assigned to our government.”\n\nHe also mentioned that a center for special children has been established in Korangi by the PPP, where free medical treatment, education, and training are provided.\n\nWith the support of the Sindh chief minister and the health minister, a Child Health Center has also been set up in the district, fully equipped by the PPP government, he said.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T02:37:46.996Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931316/mayor-urges-prime-minister-to-take-notice-of-sindh-governors-political-activities",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:36:02.000Z"
}
