{
  "title": "Salman Agha to lead Pakistan’s Asia Cup squad as Babar, Rizwan left out - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan left out Babar Azam and Mohammad Rizwan from the T20 squad named on Sunday for the Asia Cup and a warm-up tri-series beginning this month against Afghanistan and the United Arab Emirates, according to a press release issued by the Pakistan Cricket Board.\n\nAzam and Rizwan have been star performers in the shortest format in the past, but have not played since December, which head coach Mike Hesson put down to other players performing well while addressing a press conference.\n\n“We know what a fine player Babar (Azam) is,” said Hesson.\n\n“Babar has been asked to improve in certain areas, like taking on spin and in terms of his strike rate, and he is working hard on these things.\n\n“The players we have are performing well and having a positive impact,” said Hesson.\n\nSince Hesson took over as head coach in May, Pakistan have played three T20 series — winning 3-0 at home but losing 2-1 away to Bangladesh. They then beat the West Indies 2-1 in the United States.\n\n“Our focus is to win the tri-series and the Asia Cup, and the aim is to peak from these pinnacle events,” said Hesson.\n\nAll-rounder Salman Agha will lead the side, which also sees the return of fast bowlers Mohammad Wasim and Salman Mirza.\n\nMirza took seven wickets in Bangladesh but was left out of the squad against the West Indies.\n\nOpener Fakhar Zaman also returns after being injured for a one-day international series in the West Indies last week, which Pakistan lost 2-1.\n\nThe tri-series, which starts on August 29, and the Asia Cup from September 9 will both take place in the UAE.\n\nPakistan squad: Salman Agha (captain), Saim Ayub, Fakhar Zaman, Sahibzada Farhan, Hasan Nawaz, Salman Mirza, Mohammad Haris, Mohammad Nawaz, Shaheen Shah Afridi, Haris Rauf, Hasan Ali, Hussain Talat, Sufiyan Muqeem, Abrar Ahmed, Khushdil Shah, Faheem Ashraf, Mohammad Wasim.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/031141580237ffc.jpg?r=114208",
  "retrievedAt": "2025-08-18T02:37:12.619Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931457/salman-agha-to-lead-pakistans-asia-cup-squad-as-babar-rizwan-left-out",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T07:40:28.000Z"
}
