{
  "title": "Villagers throng Nauseri Dam to collect timber after Neelum floods - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Villagers have been thronging the Nauseri Dam on the Neelum River for the past two days to collect floating timber, risking their lives amid efforts by the forest department to stop what it terms “unlawful” grabbing of logs.\n\nThe dam, located about 41km northeast of Muzaffarabad, has been blanketed by logs and firewood carried downstream by clo­udburst-induced floods in Nee­lum Valley on Aug 14. The river forms the reservoir for the Nee­lum-Jhe­lum Hydropower Project (NJHP).\n\nThe sudden accumulation of timber has triggered a debate on social media, with many questioning the government’s claims of halting deforestation.\n\nThe coalition government in Azad Jammu and Kashmir (AJK) has repeatedly boasted that it ended large-scale timber felling and smuggling. However, some users remarked that the presence of so many logs at the dam suggested otherwise.\n\nMany question govt’s claims of halting deforestation after sudden accumulation of logs\n\n“This means trees had been cut in areas hidden from the public eye on a large scale,” said Mir Naveed, a social activist from the vicinity of the dam.\n\nAJK’s Chief Conservator of Forests Asad Mahmood dismissed the allegations.\n\n“Social media reports alleging large-scale forest damage and departmental losses are baseless,” he told Dawn.\n\nHe explained that a cloudburst in the upper catchment areas of Kamoh and Bangas streams in Neelum Valley had triggered flash floods on Thursday, uprooting trees and sweeping large quantities of timber into the Nauseri reservoir. The affected area, he pointed out, was previously under lease to the now-defunct Azad Kashmir Logging and Sawmills Corporation.\n\n“Around 80 per cent of the accumulated wood at Nauseri Dam is firewood, while only a small portion is construction-grade timber,” he added.\n\nMr Mahmood said the forest department had launched an eme­­­rgency operation to retrieve usable timber from the reservoir. However, he lamented, villagers from surrounding areas repeatedly disrupted the process by collecting wood themselves, raising risk of potential law and order issue.\n\nHe added that Conservator Mir Naseer Ahmed and DFO Mazhar Naqvi were stationed at the site to supervise the operation.\n\n‘Opportunity to earn’\n\nOn Saturday, hundreds of people on both sides were seen frantically hauling floating logs to the roadside in small heaps. “We have sacrificed our land and submerged our graves for this dam. In return, we got nothing.\n\n“Today, if we have found an opportunity to earn something [from this timber] we should not be stopped,” said one villager.\n\nVillagers also blocked traffic on the main road for some time, but the forest department appeared unyielding.\n\nLater, the department set up a boom in the dam to prevent timber from being drifted.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a12f2c49940.jpg",
  "retrievedAt": "2025-08-18T02:38:50.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931371/villagers-throng-nauseri-dam-to-collect-timber-after-neelum-floods",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:35:35.000Z"
}
