{
  "title": "Welfare bodies in Swabi send relief supplies to Buner - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: Local charities sent the much-needed relief supplies collected in Swabi to the calamity-hit areas of Buner district on Saturday.\n\nSpeaking to Dawn before leaving for Buner, activists of welfare organisations said that the people in their neighbouring district were in dire need of foodstuff and drinking water after flash floods swept away their houses and crops and badly damaged road infrastructure.\n\nAl-Khidmat Foundation, Swabi, president Wajid Ali Shah said that they had sent medicines worth Rs1 million along with five doctors and 15 paramedical staff to Buner.\n\n“Similarly, on our request five trucks containing dry foodstuffs have reached Buner from our Rawalpindi wing and 15 ambulances of medicines and paramedical staff have also commenced their duty in the affected areas,” Mr Ali said.\n\n“We have also planned to dispatch more foodstuff, tents and medicines to Buner by Saturday evening,” he said. “Right now, we are focused on three areas, including medicines, foodstuffs and tents. These things are badly required in Buner.”\n\nSimilarly, Bahrul Amin, president of Sitara Welfare Organisation, Maneri Bala, said that they have collected sugar, rice, drinking water, and about Rs0.2 million cash, which would be distributed among the affected people.\n\n“We have just informed our United Arabs Emirates wing, which will soon send donations. Another team would be dispatched soon to Buner,” he said. “We have decided to go to Pir Baba area, which is worst-hit by the calamity.”\n\nIn addition, Al-Salfiya Welfare Organisation, Pabini, members said that they had started collecting donations for the flood-hit people of Buner, while concentrating on medicines and foodstuffs.\n\nReady-made food and rations are needed for the homeless people, they said.\n\nVarious other welfare bodies were seen in action to help people of Buner district.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/162139008503629.jpg",
  "retrievedAt": "2025-08-18T02:37:26.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931411/welfare-bodies-in-swabi-send-relief-supplies-to-buner",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T03:11:02.000Z"
}
