{
  "title": "KP governor calls for collective efforts to help flood-hit people - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Khyber Pakhtunkhwa Governor Faisal Kareem Kundi on Saturday said that while science and technology had taken mankind to the moon, governments worldwide still could not prevent natural catastrophes such as cloudbursts.\n\n“We cannot stop cloudbursts from happening as we cannot fight with nature, but all political parties and both federal and provincial governments must join hands for immediate rescue and rehabilitation of families affected by this calamity in our province,” he told media after offering Fateha for two brothers, who lost their lives when floodwaters swept away the car they were travelling in, in Bisian area here.\n\nPakistan Peoples Party’s provincial president Mohammad Ali Shah, general secretary Shujah Salim Khan, and divisional president Malik Mohammad Farooq also accompanied him.\n\n“My visit here to condole with this bereaved family, who lost two loved ones in the flooding, is a message for all the affected people that both the federal and provincial governments stand with them in this difficult time,” the governor said.\n\nFederal minister announces Rs2 million compensation for each affected family\n\nMr Kundi praised the efforts of both the federal and provincial governments in coping with the natural disaster, which has claimed hundreds of lives across Khyber Pakhtunkhwa.\n\nThe governor said this was not a time for politics, stressing that both tiers of government were focused on ensuring swift rescue and relief operations across the province.\n\n“Prime Minister Shehbaz Sharif has personally called me and the Khyber Pakhtunkhwa chief minister to offer condolences and assured the federal government’s all-out support in tackling the emergency triggered by the cloudburst,” he said.\n\nThe governor added that President Asif Ali Zardari and PPP chairman Bilawal Bhutto Zardari were deeply concerned about the situation.\n\n“Mr Bhutto-Zardari summoned me to Islamabad, where we discussed the emergency in detail. He directed me to ensure that the party’s provincial and divisional leadership comes forward to help affected families,” Mr Kundi said.\n\nHe further urged both the prime minister and the chief minister of Khyber Pakhtunkhwa to declare Malakand division a calamity-hit area, as five of its districts had been the worst-hit during the recent series of cloudbursts.\n\nCOMPENSATION: Federal Minister for Religious Affairs Sardar Mohammad Yousuf on Saturday announced Rs2 million as compensation for each family that lost their loved ones in the recent cloudburst in Haleem Dehri Neelband area of the district.\n\n“I spoke with Prime Minister Shehbaz Sharif and apprised him of the catastrophic situation, and he announced Rs2 million for each bereaved family,” Mr Yousuf told mourners in Haleem Dehri Neelband.\n\nThe minister, who also led the funeral prayers of those who perished in the tragedy, said that no amount of compensation could replace the loss of human lives, but the financial support might help ease the immediate hardships of affected families.\n\nAmong the bereaved was Janas Mohammad, who lost his wife and five sons when torrents swept away his family while seeking safer place after rushing out from his residence.\n\n“My wife, five children, and I were rushing out of the house holding hands to reach a safer place, but lightning struck the nearby mountains and water gushed down, sweeping us away. I was trapped among heavy rocks and survived, but all my family members embraced martyrdom,” he recounted in grief.\n\nThe minister consoled Janas Mohammad and other families, assuring them that federal government would provide tents and shelters, along with other necessary assistance to them.\n\nHe said that rescue and relief teams had already reached the affected areas and rehabilitation of victims would be ensured at the earliest.\n\n“The federal government will extend all possible help and logistical support to Khyber Pakhtunkhwa in this difficult time as Malakand and Hazara divisions are the worst affected,” said the minister.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a14b8074757.jpg",
  "retrievedAt": "2025-08-18T02:37:17.400Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931417/kp-governor-calls-for-collective-efforts-to-help-flood-hit-people",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T03:22:38.000Z"
}
