{
  "title": "Jirga in Lower Dir denounces supporters of terrorists as enemy of humanity - Pakistan - DAWN.COM",
  "author": null,
  "content": "LOWER DIR: The elders of Khall tehsil of Lower Dir district have resolved not to provide any support to militants, declaring that anyone found facilitating them would be considered enemy of the community.\n\nAddressing a jirga at Gopalum Khall here on Saturday, leaders from various political parties, including ANP, JI and PPP, said both militants and the military should stay away from their area, adding that residents would not migrate under any circumstances.\n\nAddressing the jirga, elders including ANP Lower Dir general secretary Malik Muhammad Zaib Khan, Malik Aftab Khan, JI’s Malik Faramosh Khan, PPP’s Talimand Syed, Inayat, Habibur Rehman, Malik Alam Zaib, Malik Hayat Khan, Malik Zahir Khaliq and others recalled that during 2008-09, the people of Khall had resisted militants’ entry, as a result the region remained peaceful.\n\nThe elders said ensuring peace was the responsibility of the state, but its reluctance to take decisive action against a handful of militants had raised doubts.\n\nKhall residents vow not to migrate come what may\n\nThey warned the government not to shed Pashtun blood for “foreign interests” and demanded the return of weapons earlier taken from local tribes, so they could defend themselves.\n\nThe jirga participants pledged cooperation with police in maintaining order but said if the situation worsened, they would call in the army.\n\nFAREWELL PARTY: A farewell ceremony was held at the Dir Scouts Fort in Balambat for outgoing commandant Brigadier Sanaullah.\n\nPolitical leaders from Upper and Lower Dir, peace jirga members, and the newly-appointed commandant Colonel Arsalan attended the party.\n\nSpeaking on the occasion, the tribal and political elders lauded Brigadier Sanaullah’s efforts for peace and extended him the best wishes.\n\nIn his address, the outgoing commandant said the support of local elders had been crucial in maintaining stability in both the districts.\n\nHe said during his two-year tenure he worked to strengthen coordination between the public and security forces, ensuring unity against anti-state elements.\n\nBrigadier Sanaullah noted that several disputes were resolved through jirgas to promote harmony, adding that the people of Dir were patriotic, brave and had always supported the forces in difficult times.\n\nHe urged the political and community elders to remain united for peace, development and prosperity and to extend full support to state institutions against militants.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/14150410df4f3c8.jpg",
  "retrievedAt": "2025-08-18T02:37:25.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931410/jirga-in-lower-dir-denounces-supporters-of-terrorists-as-enemy-of-humanity",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T03:10:12.000Z"
}
