{
  "title": "Sindh earmarks land for first B2B green power project - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government has allotted 300 acres of land in Jhimpir to Moro Power Company (MPC) for establishing a 100-megawatt hybrid wind and solar project, the first business-to-business (B2B) electricity venture under the province’s own regulator.\n\nOfficials said the project, to be executed under the Sindh Electric Power Regulatory Authority (SEPRA), will enable MPC to supply power directly to industries in Nooriabad through the Sindh Trans­mission and Despatch Company (STDC).\n\nThe initiative is aimed at providing industries with reliable and cheaper renewable energy, reducing costs and strengthening the provincial industrial base.\n\nSindh is the only province in Pakistan to have its power regulator, giving it authority to set tariffs and oversee generation, transmission and distribution independently of the federal government. The Jhimpir project is therefore viewed as a pioneering step towards decentralised power generation in the country.\n\nMoro Power to set up 100MW wind-solar hybrid project in Jhimpir\n\nEnergy Minister Syed Nasir Hussain Shah said the provincial government was determined to tap Jhimpir’s wind corridor, which has the potential to produce up to 50,000MW at a record-low rate of Rs8 per unit. “We are making all-out efforts to exploit this natural resource, which can spur industrial growth and economic development in Sindh,” he said.\n\nMPC Chief Executive Officer Mustafa Abdullah said the company would install 65MW of wind turbines and 35MW of solar panels. “We have already signed a term sheet with a dozen industries in Nooriabad to supply power at Rs20/kWh and are in talks with Alfalah Asset Management and other banks for project financing,” he said.\n\nMr Abdullah added that MPC was negotiating with Bank of Punjab, Faysal Bank and JS Bank to form a consortium for 80pc debt financing under the $7bn green funds made available by the World Bank for Pakistan. “This will be the first project under SEPRA to supply affordable electricity to industries by 2026,” he noted.\n\nHe said STDC would build transmission lines to link the Jhimpir site with the Nooriabad Industrial Estate, only 20 kilometres away. “This initiative will not only improve industrial competitiveness but also promote a low-carbon future,” he remarked.\n\nGrowing renewable footprint\n\nThe Jhimpir wind corridor has already attracted 36 power producers with a combined generation capacity of 1,845MW. Officials believe the provincial government’s push for renewable energy could draw billions of dollars in further investment and create employment opportunities.\n\nMPC pointed out that countries such as China, Germany and India have made major strides in wind energy, with installed capacities of 700,000MW, 120,000MW and 50,000MW, respectively.\n\nPakistan, though endowed with strong wind corridors in Sindh and Balochistan, remains at an early stage of harnessing its potential. Analysts believe provincial-led projects such as this can accelerate progress by bypassing federal bottlenecks.\n\nObservers also see Sindh’s B2B model as a potential template for other provinces, particularly in the face of recurring disputes over circular debt and grid constraints at the federal level.\n\nA senior energy official said the Jhimpir initiative could mark a turning point for Sindh’s energy landscape. “With its vast renewable resources, Sindh can lead Pakistan’s clean energy transition. By supplying industries with affordable power, such projects can fuel sustained industrialisation and economic stability.”\n\nMr Abdullah echoed this view, saying the project would demonstrate how private investment, international green funds and provincial autonomy could converge to deliver sustainable energy solutions.\n\nThe provincial government, meanwhile, is counting on renewable projects to cut reliance on costly imported fuels, reduce carbon emissions and expand its industrial footprint. If successful, the Jhimpir hybrid plant could not only reshape Sindh’s power sector but also serve as a model for the rest of the country.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a12a0e60d6d.jpg",
  "retrievedAt": "2025-08-18T02:38:22.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931343/sindh-earmarks-land-for-first-b2b-green-power-project",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:35:41.000Z"
}
