{
  "title": "Land for peace? - Newspaper - DAWN.COM",
  "author": null,
  "content": "BACK in the days when a two-state solution to the Israeli occupation of Palestinian lands did not seem absurdly unviable, ‘land for peace’ was a familiar trope, implying that both sides would cede roughly equivalent territories in the interests of geopolitical coherence.\n\nThose vague plans never came close to fruition. With the US serving as dishonest broker, the Bantustan-style deals Israel offered were understandably unacceptable to the Palestinians — as the Zionist state likely intended. The genocidal aim has simmered beneath the surface of every Israeli action since 1948. The difference now is that it is no longer latent.\n\nThe concept of ‘land for peace’ has re-emerged, though, in a different context. The czar-like ruler of Russia appears to have demanded the entire Donbas region in eastern Ukraine, including parts that his troops have so far failed to conquer, as the price for halting the aggression he embarked upon over three years ago. The idea of ‘territorial exchanges’ presumably implies no more than a Russian withdrawal from some of the areas in the southeast.\n\nPresident Donald Trump went into last week’s Anchorage summit with Vladimir Putin threatening “severe consequences” for Russia unless a ceasefire was agreed. He emerged somewhat chastened after three hours of what he had earlier described as a “listening exercise”, only to declare that a comprehensive peace agreement made more sense than a truce that might not last long. The notion that a ceasefire — desirable under any circumstances — could facilitate the trilateral Russia-Ukraine-US negotiations he wishes to arrange appears not have crossed his mind.\n\nAnnouncement of the summit in Alaska — which was a Russian colony until Tsar Alexander II sold it to the US for less than two cents per acre — unleashed a flurry of diplomatic activity in Europe, with Ukrainian President Volodymyr Zelensky hopping across the capitals where he is admired, and culminating in several European leaders deciding to rearrange their summer holiday schedules to accompany him to Washington. The heads of the EU and Nato were accompanied by the prime ministers of Italy and Britain and the presidents of France and Finland, alongside the German chancellor.\n\nSave Ukraine, but don’t stop there.\n\nThe ‘Magnificent Seven’ (as they might see themselves) are likely to claim that they were there to safeguard Zelensky against the kind of bullying he experienced on his last visit to the White House. They could also be perceived as facilitators of the seven deadly sins that Trump revels in, given the level of kowtowing to his imperial majesty. Respectable economists have decried the EU’s recent trade deal with the US as a self-abasing disaster, involving commitments to, inter alia, invest in American fossil fuels and spend hundreds of billions on US weaponry.\n\nZelensky, too, resorted to abject obsequiousness after the tongue-lashing he received from the vacation-loving Vice-President J.D. Vance, and on Monday dressed up in a black suit for his White House appearance, while mouthing ‘thank yous’. Whether the brown-nosing will lead to direct talks between Putin and Zelensky, with Trump as a biased referee, remains to be seen. Trump dialled the Kremlin while the seven European leaders plus Zelensky were still in the White House, for what Putin’s spokesman described as a “frank and very constructive” discussion, implying some disagreement.\n\nIn Alaska, Putin was reportedly amenable to Western ‘security guarantees’ for what remains of Ukraine after an ongoing conflict that is said to have claimed a million lives on both sides. That’s a horrific toll, and there can be no question that ending the Russian-launched war would be a spectacular achie­vement.\n\nCeding a substantial chunk of its territory to the aggressor would be anathema to any Ukrainian leader, but it’s a bitter way out of an unwinnable war that Zelensky or any successor might eventually feel obliged to swallow as the price of peace. If that’s bound to be the unfortunate outcome, the sooner the better.\n\nMeanwhile, it’s worth noting that while Trump trumpeted his discussions with the EU’s Ursula von der Leyen about “the massive Worldwide problem of missing children”, and in Alaska handed Putin a letter from first lady Melania Trump, touchingly requesting him to “restore … the melodic laughter” of children, neither of the women has offered evidence of concern about Gaza.\n\nWashington Post reported recently that, according to the UN, “at least 55 children have been killed this year” in Ukraine, 43 of them in Russian attacks. That is a huge tragedy — while Israel’s Western-supplied munitions and starvation are killing an estimated 30 Palestinian children daily.\n\nUnlike the Russian-Ukrainian conflict, Trump could halt the Palestinian genocide at a stroke. But he won’t, yet he hankers after the Nobel Peace Prize.\n\nmahir.dawn@gmail.com\n\nPublished in Dawn, August 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a513b98d200.png",
  "retrievedAt": "2025-08-20T04:53:59.729Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931984",
  "dateList": "2025-08-17",
  "date_published": "2025-08-20T00:22:34.000Z"
}
