{
  "title": "Ring Road project set to miss deadline as monsoon rains slow down work - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The much triumphed Rawalpindi Ring Road project worth Rs32.9 billion will likely miss the deadline of December 2025 with its cost set to further escalate by 40 to 50 per cent.\n\nA senior official of the divisional administration told Dawn that more than 70 per cent work had been completed. However, for the last one month, work has slowed down and is likely to get momentum after the monsoon season next month.\n\nHe said work on the revised PC-I had started as prices of construction material and loading vehicle charges increased manifold during the last two years. The revised PC-I will be sent to the Central Development Working Party (CDWP) and then Ecnec for final approval.\n\nThe current monsoon badly impacted the mega project as the last seven spells of rains slowed down the construction work.\n\nRevised PC-I will be sent for final approval after increase in construction material prices, says official\n\nIt is likely to miss the deadline of December 2025 fixed by Punjab Chief Minister Maryam Nawaz.\n\nThe official said the construction work also slowed down due to a lack of timely decision on how to merge the traffic from Thalian to the motorway. The National Highway Authority wanted to construct two additional lanes on the motorway to cater to the traffic coming from Ring Road.\n\nHowever, he said, the NHA project of expansion of motorway lanes was still pending in the planning division, so the contractor gave a suggestion to the Punjab government that it would construct one kilometer-long merger road from its own funds and later the NHA should expand the lanes.\n\nProject cost escalation\n\nA senior official of the divisional administration told Dawn that the contractor, Frontier Works Organization (FWO), demanded an increase in the cost by more than 50 per cent. It will be the second increase in the project cost. Initial project construction cost was estimated to be Rs26 billion and it was increased early this year to Rs32.9 billion after getting approval from Ecnec. The total cost of the project increased to Rs39 billion - Rs6 billion for land acquisition and Rs32.9 billion for the construction of the road.\n\nThe official said the cost of construction material had increased as compared to August 2023. He said the consultant of the project – Nespak - had been asked to revise the PC-I.\n\nWhen contacted, Deputy Project Director Ashfaq Sulheri confirmed to Dawn that the project deadline would be extended due to the slow work.\n\n“Commissioner Rawalpindi Division who is project director of Rawalpindi Ring Road visited the project site last week and asked the contractor to speed up the work in coming days to meet the deadline but the work will get momentum after monsoon,” he said.\n\nHe said that the contractor had demanded more than 50 per cent price escalation but the government will allow 44 per cent. About the merger of traffic at Thalian, the deputy project director said that the NHA had given a non-objection certificate to construct a one-kilometre road along the motorway to merge the traffic.\n\n“We were trying to solve the issue of merging traffic on the motorway with NHA but it delayed it.” However, he said FWO will construct the patch and the remaining expansion of two lanes will be completed by NHA.\n\nAbout the construction work, he said the 38.3km Ring Road had five interchanges at Baanth, Chak Beli Khan, Adiala Road, Chakri Road and Thalian and the work on these interchanges was in progress and would be completed soon.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T02:37:48.064Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931306/ring-road-project-set-to-miss-deadline-as-monsoon-rains-slow-down-work",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:36:11.000Z"
}
