{
  "title": "Four IHC benches constituted to clear backlog of tax, commercial cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has constituted four specialised benches to hear financial and commercial cases.\n\nAccording to a notification issued by the IHC additional registrar (judicial), the bench comprising Justice Babar Sattar and Justice Sardar Ejaz Ishaq Khan has been assigned exclusively to decide matters related to the “Commercial Litigation Corridor” (CLC).\n\nIt “will adjudicate references filed under the Income Tax Ordinance, Sales Tax Act, Federal Excise Act and Customs Act,” according to the notification.\n\nSources said the two judges will not hold single benches until a backlog of around 2,000 CLC cases is cleared. In the meantime, petitions on their individual dockets will be taken up by other available benches.\n\nThe decision was taken by Chief Justice Sardar Muhammad Sarfraz Dogar under the IHC Practice and Procedure Rules 2025 (Volume-V), in line with the directives issued by the National Judicial (Policy Making) Committee (NJPMC) in its 53rd meeting on July 11 this year.\n\nJustices Babar Sattar, Ejaz Ishaq Khan limited to tax matters only\n\nAccording to the notification, a specialised company bench comprising Chief Justice Sarfraz Dogar, Justice Mohsin Akhtar Kayani and Justice Saman Rafat Imtiaz will hear matters under Section 5(4) of the Companies\n\nAct 2017, as well as cases under Section 8(B) of the Corporate Restructuring Companies (Amendment) Act 2021, and the SECP Act 1997.\n\nJustice Arbab Muhammad Tahir has been designated as a single-judge bench to hear cases relating to educational institutions, including medical colleges.\n\nIn addition, Justice Tariq Mehmood Jehangiri and Justice Saman Rafat Imtiaz will take up cases under the Financial Institution (Recovery of Finances) Ordinance 2001, exercising the court’s original civil jurisdiction, as well as civil suits under the Privatisation Commission (Amendment) Act 2020. This order supersedes Office Order No. F. (126)GenI/IHC/152 dated July 18, 2025.\n\nThe four notifications (Nos 32, 33, 34 and 35 dated Aug 13, 2025) will be published in Part-III of the Gazette of Pakistan and circulated among relevant stakeholders, including bar councils, government departments and registrars.\n\nLegal experts said that with this development, IHC’s senior judges, including those who had challenged the transfer and subsequent seniority of the incumbent chief justice, would now be occupied with clearing the years-long backlog of financial cases.\n\nPublished in Dawn, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/05074215e7ce28b.jpg?r=074231",
  "retrievedAt": "2025-08-18T02:38:48.782Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931337/four-ihc-benches-constituted-to-clear-backlog-of-tax-commercial-cases",
  "dateList": "2025-08-17",
  "date_published": "2025-08-17T01:35:27.000Z"
}
