{
  "title": "Jazz partners with Huawei to accelerate network digitization through WISDOM framework",
  "link": "https://www.app.com.pk/national/jazz-partners-with-huawei-to-accelerate-network-digitization-through-wisdom-framework/",
  "date_published": "2024-03-27T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): Pakistan’s leading digital operator, has entered into a strategic partnership with Huawei to accelerate its network digitization efforts using the WISDOM (WizTech, Innovative, Service assurance, Diversification, Operation Excellence & Mobile Money) framework.\nThe collaboration signifies Jazz’s commitment to enriching the customer experience through the strategic implementation of innovative methodologies across its network infrastructure, said a news release.\nThe partnership entails Huawei implementing the WISDOM framework, a comprehensive approach aimed at boosting digital maturity and stimulating innovation within the organization.\nHuawei will assess Jazz’s current network components using industry standards, aiming to pinpoint immediate accomplishments through the identification of Minimum Viable Products (MVPs). By incorporating the WISDOM principles, Jazz aims to maintain a leading position in the ever-evolving telecom industry.\nCommenting on the development, Abdul Rehman Usmani, VP Network Development Jazz, said, “We are excited to partner with Huawei and leverage the WISDOM framework, aligning with our vision to embrace digital innovation, as well as our DO1440 strategy to stay relevant to our customers throughout the day. By embracing the principles of WISDOM, Jazz seeks to build a resilient and future-ready network infrastructure that meets the evolving needs of its customers and stakeholders.”\nAlso sharing his thoughts on the occasion, Justin Zhang , Deputy CEO Huawei Pakistan, said, “We are thrilled to partner with Pakistan’s foremost digital operator, empowering them to maintain their industry leadership and advance their digital operator vision.\nThrough the integration of our WISDOM framework, Jazz will fortify its network, ensuring its readiness for future expansion and digital solutions. This initiative is poised to significantly enhance customer experience and engagement across the Jazz network.”\nJazz remains steadfast in its mission to deliver world-class digital solutions, setting a precedent for excellence in the industry. The company recently partnered with Huawei to elevate its long-haul network to a groundbreaking 400G per wavelength capacity with the deployment of C+L band systems.\nPreviously, Jazz introduced industry-leading Voice Over LTE (VoLTE) and JazzFi (WiFi calling service) to elevate customer experience, gaining over 22 million and 3 million customers respectively in record time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:36:24.812Z"
}
