{
  "title": "ANF Academy organizes workshop on anti money laundering, counter financing of terrorism",
  "link": "https://www.app.com.pk/national/anf-academy-organizes-workshop-on-anti-money-laundering-counter-financing-of-terrorism/",
  "date_published": "2024-03-26T22:03:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 27 (APP):Anti Narcotics Force (ANF) Academy here on Wednesday organized a three-day Workshop/Seminar on Anti Money Laundering and Counter Financing of Terrorism.\n53 Investigation Officers and Public Prosecutors from ANF and sister law enforcement agencies benefited from the Workshop/Seminar.\nChief Instructor ANF Academy Sahib Khan highlighted the importance of the workshop.\nThe experts from relevant stakeholders on Anti Money Laundering and Counter Financing of Terrorism, including Financial Monitoring Unit (FMU), State Bank of Pakistan (SBP), National Accountability Bureau (NAB), Federal Investigation Agency (FIA), FATF Secretariat and Counter Terrorism Department (CTD) Islamabad were invited as guest speakers.\nHonorable Commandant, ANF Academy Brigadier Ghazi Kamal Kiani graced the closing ceremony on the final day of the workshop/seminar.\nCommandant ANF Academy appreciated the earnest efforts of ANF Academy to provide a platform for capacity building on money laundering and terrorism financing related issues relevant to various stake holders.\nHe also highlighted Pakistan’s efforts at policy, procedural and operational level to fulfill the requirements of FATF.\nHe underscored the importance of ANF as a vital link in “National Integrated Approach” being a key member of various national forums on money laundering and terrorism financing. As the task is multi sectoral endeavor, ANF is actively engaged with all stakeholders namely MoI, NACTA, FATF Secretariat, FMU, Police, FIA, NAB, CTD and FBR for information sharing, cooperation and provision of data through a desk involving a dedicated focal person.\nANF Academy strives to remain at the forefront of holding specialized courses and workshops for capacity building that in turn, feeds into the national efforts against money laundering and terrorism financing, he added.\nThe Commandant stressed the need for continuous capacity building of investigation officers and prosecutors to better deal with the dynamics of assets investigation including financial intelligence to undertake proactive pursuance of assets investigation and money laundering cases.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:36:52.773Z"
}
