{
  "title": "Meeting to discuss reforms in Health Department soon: Qasim Shah",
  "link": "https://www.app.com.pk/national/meeting-to-discuss-reforms-in-health-department-soon-qasim-shah/",
  "date_published": "2024-03-27T13:20:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 27 (APP): Khyber Pakhtunkhwa Minister for Health Syed Qasim Ali Shah held a meeting with a delegation from UNICEF at his office here on Wednesday.\nThe delegation, led by the Chief of UNICEF Peshawar Office, Radoslaw Rzehak was comprising of Dr. Inamullah, Health Specialist, Aien Khan Afridi, Nutrition Specialist, and Dr. Kamran Qureshi, Immunisation Officer.\nDuring the meeting, the provincial minister expressed the need to form a team of health donors to ensure that reforms in the Health Department adhere to international standards.\nHe also mentioned that a meeting with donors and implementing partners with the Health Department would be convened soon to discuss future reforms in health and ongoing changes within the department. He emphasized that the doors of his office were always open for donors and partners.\nThe delegation briefed the minister about ongoing projects in the province under UNICEF’s cooperation. They briefed him about the support provided to the Health Department so far. It was informed that UNICEF is currently running two major health and nutrition programs in Khyber Pakhtunkhwa.\nSolarization of the Charsadda Women and Children Hospital has been completed, and a Health Education Cell has been established in the DG Health Office with the support of UNICEF for public awareness.\nThe minister expressed gratitude for UNICEF’s cooperation with the Health Department, stating that donors like UNICEF were essential for sustainable healthcare provision in the future.\nThe minister was informed that UNICEF is collaborating with government departments in the field of nutrition, including health department, three teaching hospitals, Khyber Medical University, and other seven universities, as well as Provincial Disaster Management Authority, besides working with UN agencies and non-governmental organizations in the private sector.\nHe was also informed that this year, UNICEF’s collaboration has initiated a School Nutrition Program. Additionally, to tackle polio challenges in southern districts, UNICEF is supporting the Integrated Service Delivery Program through nutrition, wash, and social and behaviour change communication.\nThe minister was also briefed that efforts will be made to introduce a vaccine against cervical cancer by next year to combat the disease in Pakistan.",
  "retrievedAt": "2025-08-11T01:36:05.058Z"
}
