{
  "title": "Gandapur directs for expediting work on Peshawar Valley Project",
  "link": "https://www.app.com.pk/national/gandapur-directs-for-expediting-work-on-peshawar-valley-project/",
  "date_published": "2024-03-27T13:15:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 27 (APP): Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur has directed the authorities concerned to speed up the pace of work on the new Peshawar Valley Housing Project.\nPresiding over an important meeting regarding housing sector development here at Chief Minister’s House on Wednesday, he directed that the project be executed on BOT mode and in a phase wise manner and urged upon authorities that all ongoing and newly approved housing schemes should also be completed as soon as possible.\nBesides, the Provincial Minister for Local Government and Rural Development (LG&RD), Arshad Ayub Khan and Minister for Housing Fazal Hakeem, the meeting was also attended by Tehsil Chairman Mathra Inaam Ullah Khan, administrative Secretaries of concerned department, Commissioner Peshawar, Deputy Commissioner Peshawar and other relevant officials.\nImportant matters related to public and private-sectors new housing schemes came under discussion.\nTalking on the occasion, the CM said that housing infrastructure development in accordance with the contemporary requirements especially at the urban periphery was much needed.\nThat’s why, he said the government, alongside taking other priority initiatives, was also committed for infrastructure and urban development, promoting investment and Ease of doing business in the province.\n“Incumbent provincial government will not only encourage private-sector investment in the province but will also extend its all-out support to investors interested in investment here”, he remarked and directed the quarters concerned to take pragmatic steps for attracting and facilitating private-sector investment in the province.\nNecessary amendments in the relevant legal framework be proposed for simplifying the entire process of investment so that maximum private investment could be attracted towards province, he directed.\nHe said that the all these efforts would bring positive change in the life style of people by promoting conducive environment, creating employment opportunities and boosting the overall economic landscape of the province.\nHe maintained that provincial housing department and all other stakeholders would have to work under realistic and integrated strategy for this purpose.\nAll these projects and initiatives once completed, will not only provide conducive residential facilities to the people, rather will also result in substantial increase in the revenue of the provincial government, through generating investment and economic activities in the province, he expressed.",
  "retrievedAt": "2025-08-11T01:36:05.492Z"
}
