{
  "title": "IGP orders crackdown on kite flyers, sellers, and manufacturers",
  "author": null,
  "content": "LAHORE, Oct 22 (APP):Inspector General of Police (IGP) Punjab Dr Usman Anwar has taken strict notice of the incident in which a citizen, Noman, lost his life allegedly due to kite flying in the jurisdiction of Police Station Nawan Kot, Lahore.\n\nThe IG has sought a detailed report from the CCPO Lahore and directed DIG Operations Lahore to ensure the immediate arrest of the individuals involved in the incident.\n\nDr. Usman Anwar emphasized that there will be zero tolerance for violations of the Anti-Kite Flying Act, instructing RPOs, CPOs, and DPOs across the province to intensify the crackdown against kite flyers, sellers, and manufacturers. He said that strict implementation of the Kite Flying Prohibition Amendment Bill must be ensured at all levels.\n\nThe IG Punjab made it clear that no leniency will be shown towards those endangering lives through this illegal and deadly activity. He further directed that those involved in the online sale of kites and metal strings should also be brought under the ambit of law.\n\nAppealing to the public, Dr. Usman Anwar urged parents to keep their children away from kite flying and requested citizens to report any such activity to Police Helpline 15 as part of responsible citizenship.\n\nAccording to a Punjab Police spokesperson, a total of 5,967 individuals have been arrested and 5,784 cases registered across the province this year for violations of the Anti-Kite Flying Act. During operations, police seized 529,814 kites and 21,301 reels of string, while challans were submitted in 5,362 cases.\n\nIn Lahore alone, 1,654 individuals were arrested and 1,620 cases registered, with 35,420 kites and 1,753 reels of string recovered during police operations.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/05/IG-Police-Punjab-Dr-Usman-Anwar-768x436-1.jpg",
  "retrievedAt": "2025-10-22T12:46:30.917Z",
  "source": "APP",
  "link": "https://www.app.com.pk/domestic/igp-orders-crackdown-on-kite-flyers-sellers-and-manufacturers/",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T12:46:03.000Z"
}
