{
  "title": "Kashmir committee urges timely completion of feasibility studies for airport in AJK",
  "author": null,
  "content": "ISLAMABAD, Oct 22 (APP):The Parliamentary Committee on Kashmir directed the relevant authorities to complete the feasibility studies in a timely manner for the establishment of airports in all three divisions of Azad Jammu & Kashmir (AJK).\n\nThe 11th meeting of the Parliamentary Committee on Kashmir held on Wednesday at the New Civil Secretariat, Muzaffarabad, under the chairmanship of Federal Minister and Chairman of the Parliamentary Committee on Kashmir, Rana Muhammad Qasim Noon.\n\nDuring the session, a comprehensive review was conducted on the implementation status of the decisions made during the 10th meeting of the Parliamentary Committee on Kashmir.\n\nChief Secretary of Azad Kashmir, Khushhal Khan provided the committee with a detailed briefing on the current political, social, and economic situation in Azad Jammu & Kashmir.\n\nParticipants of the meeting emphasized the need to effectively highlight the Kashmir issue both nationally and internationally, and to further organize efforts in support of the Kashmiri people’s right to self-determination.\n\nThe meeting reaffirmed Pakistan’s unwavering commitment to continue its political, diplomatic, and moral support to the Kashmiri people.\n\nFurthermore, the committee agreed on the need to ensure political and economic stability in Azad Jammu and Kashmir, promote good governance, prioritize public welfare, and complete development projects in accordance with the needs of the people.\n\nConcluding the meeting, Chairman and Federal Minister, Rana Muhammad Qasim Noon directed all concerned institutions to strengthen national unity, adopt an effective strategy, and intensify diplomatic efforts at international forums to ensure that the voice of the Kashmiri people is heard across the globe.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/noon.jpg",
  "retrievedAt": "2025-10-22T17:05:05.152Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kashmir-committee-urges-timely-completion-of-feasibility-studies-for-airport-in-ajk/",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T16:43:49.000Z"
}
