{
  "title": "Canada strengthens media freedom and digital resilience in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Oct 22 (APP):The High Commission of Canada in Pakistan, in collaboration with the Department of Digital Media, University of the Punjab, hosted a high-level Strategic Dialogue on Media Literacy and Digital Resilience to advance collective efforts in strengthening media freedom, digital inclusion, and information integrity in Pakistan.\n\nThe event showcased the outcomes of a capacity-building initiative funded under Canada’s Cyber and Digital Resilience Fund (CDRF).\n\nThe initiative focuses on countering misinformation, enhancing online safety, and promoting media literacy as an essential civic competency in Pakistan’s rapidly evolving digital landscape.\n\nThe dialogue brought together senior government officials, media practitioners, civil society representatives, academia, and international partners.\n\nThe session was moderated by Ms Aniqa Nisar and featured distinguished speakers, including Federal Minister for Information and Broadcasting Attaullah Tarar, Presidential Spokesperson Murtaza Solangi, UNESCO Country Representative Fuad Pashayev, Canadian High Commissioner H.E. Tarik Ali Khan, and Prof Dr Savera Mujib Shami, Chairperson of the Department of Digital Media, University of the Punjab.\n\nAddressing the gathering, Federal Minister Attaullah Tarar underscored that misinformation and disinformation have emerged as potent tools of modern warfare, capable of distorting facts and undermining national stability.\n\nHe emphasized that Pakistan’s security depends not only on military preparedness but also on the nation’s ability to manage information threats responsibly.\n\nThe Minister highlighted the absence of local offices of major social media platforms in Pakistan as a major challenge to accountability and digital governance. He announced that the government is working to engage these platforms directly to ensure responsible digital practices.\n\nMr Tarar further stressed that Media and Information Literacy (MIL) should be integrated into the national education curriculum to empower citizens with critical thinking and ethical digital engagement skills. He called for coordinated, multi-stakeholder collaboration among government, academia, media, and civil society to strengthen Pakistan’s digital resilience framework.\n\nPresidential Spokesperson Murtaza Solangi described the modern era as a “digital deluge,” noting that contemporary conflicts are fought not on borders but on social media, where narratives shape public perception and national stability. He warned that the weaponization of information is eroding trust and deepening social divisions, calling for collective vigilance and responsible information practices.\n\nUNESCO Representative Fuad Pashayev highlighted that Global Media and Information Literacy Week underscores the urgency of developing informed societies capable of navigating the age of generative AI and algorithmic influence. “The ability to question, verify, and understand how technology shapes our perceptions will define resilient societies,” he said.\n\nCanadian High Commissioner H.E. Tarik Ali Khan reaffirmed Canada’s commitment to supporting free, open, and secure digital environments.\n\n“The cyber and digital ecosystem is becoming increasingly dangerous. Canada remains committed to promoting digital literacy, online safety, and media freedom. We must stand together to protect informed citizenship and those who risk their lives to report the truth,” he stated.\n\nProf Dr Savera Mujib Shami emphasized that media literacy is not a privilege but a necessity, vital to shaping political consciousness and social ethics. She called for integrating MIL into school curricula to help young citizens differentiate between truth and manipulation, fostering responsible participation in digital spaces.\n\nBuilding upon the dialogue, the High Commission of Canada and the Department of Digital Media, University of the Punjab announced a series of five capacity-building workshops to be conducted in Lahore, Islamabad, and Multan.\n\nThese workshops will train journalists and press club members in cyber-security, digital safety, and trauma-informed peer support—essential skills for safeguarding media professionals in high-risk digital environments.\n\nThis joint initiative underscores the shared commitment of Canada and Pakistan to strengthening institutional resilience, promoting ethical media practices, and advancing freedom of expression and democratic participation in the digital age.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/dd3732a6-b930-4c08-b9fe-3710a3bb5c9b.jpg",
  "retrievedAt": "2025-10-22T17:05:04.704Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/canada-strengthens-media-freedom-and-digital-resilience-in-pakistan/",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T16:43:49.000Z"
}
