{
  "title": "Jordan Police delegation visits NHMP headquarters, lauds road safety initiatives",
  "author": null,
  "content": "ISLAMABAD, Oct 22 (APP):A delegation of police officers from the Jordan Police College, led by Major Abdullah Raja Muhammad Al-Nuaima, visited the National Highways and Motorway Police (NHMP) Headquarters here on Wednesday.\n\nThe delegation was warmly received by NHMP officials and later held a special meeting with Inspector General NHMP, B.A. Nasir, said a press release.\n\nDuring the visit, the Jordanian officers were given a comprehensive briefing on the operational activities, performance, training, modern traffic management systems, community policing, and ongoing initiatives aimed at promoting road safety awareness among the public.\n\nDuring the briefing, it was highlighted that the Motorway Police has played a remarkable role in improving traffic discipline and reducing road accidents on national highways through quality training, effective use of modern technology, transparency, community policing, and equal enforcement of the law.\n\nSpeaking on the occasion, IG NHMP B.A. Nasir said that the Motorway Police had emerged as a model institution in Pakistan, known nationwide for its professionalism, courtesy, and integrity.\n\nHe further said that the Motorway Police is making every possible effort to promote the culture of community policing and safe travel on national highways.\n\nHe added that the Motorway Police is actively working to reduce road accidents and improve travel facilities for commuters through road safety awareness campaigns, driver training programs, and modern traffic management systems.\n\nThe IG also mentioned that 53 officers of the Motorway Police have laid down their lives in the line of duty, setting a great example of bravery, dedication, and commitment.\n\nAt the conclusion of the visit, the Jordanian officers also visited the Command and Control Center of the Motorway Police and appreciated its professional excellence.\n\nIn the end, IG B.A. Nasir presented shields to the Jordanian Police Officers.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/WhatsApp-Image-2025-10-22-at-16.19.58-e1761133505119.jpeg",
  "retrievedAt": "2025-10-22T12:44:45.986Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/jordan-police-delegation-visits-nhmp-headquarters-lauds-road-safety-initiatives/",
  "dateList": "2025-10-22",
  "date_published": "2025-10-22T12:37:13.000Z"
}
