{
  "title": "Fashion show held in Paris to promote Pakistan’s rural women artisans",
  "link": "https://www.app.com.pk/national/fashion-show-held-in-paris-to-promote-pakistans-rural-women-artisans-2/",
  "date_published": "2024-01-24T06:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):The Embassy of Pakistan in France held a fashion show in Paris to honor the Pakistani rural women artisans and promote their works.\nThe fashion show was held in collaboration with renowned designer Omar Mansoor and Kaarvan Crafts Foundation, according to an embassy’s press release received on Wednesday.\nIn his remarks, Ambassador of Pakistan Asim Iftikhar Ahmad welcomed the guests and highlighted the contribution of rural women including artisans-entrepreneurs towards national development and shaping the hopes and dreams of millions in Pakistan.\nThe ambassador noted that known as the ‘cradle of civilization’, Pakistan had a lot to offer to the world when it comes to colorful, versatile and mystique arts and crafts.\nGiving an insight into how the journey of the fashion show “Culture to Couture” took shape, the ambassador introduced the two partners behind the event and said that he was extremely delighted to see the way Kaarvan Crafts Foundation Pakistan promoted women empowerment, while Omar Mansoor has taken up the task of transforming the vision and work of the young generation through creative designing and sustainable quality.\nFashion in Pakistan has always been a captivating fusion of tradition and modernity, noted the ambassador, apprising the guests of Pakistan’s rich heritage of handcrafted clothing and textiles: intricate embroideries, block printing, ajrak, phulkari work, chunri making, ralli and so on.\nFashion designers are incorporating these artisanal techniques into contemporary designs, giving them a fresh and modern twist.\nThe ambassador said that fashion was an instant language that could help communicate among different cultures.\nHe said that France and Pakistan shared ties in fashion – as one is the couture capital of the world while the latter is a producer of fine garments for world-renowned brands.\nFor the interest of all, he recalled that it was famous French designer Pierre Cardin who designed in 1966 the outfit carried by the air hostesses of Pakistan International Airlines.\nOmar Mansoor whose designs captivated the Parisian audience is a London-based Pakistani fashion designer and is best known for his couture occasion wear.\nHe was the first Pakistani to showcase at London Fashion Week in 2008 and has been credited with re-introducing fusion clothing into modern fashion.\nKaarvan Crafts Foundation led by Danish Khan was established in 2004 and it provides life skills to Pakistani rural women.\nTo date, Kaarvan has mobilized, trained and capacitated more than 29,000 women in over 1,000 of villages of 26 different districts across Pakistan. With its Theory of Change revolving around education, enablement and empowerment of women’s economic capacities –  Kaarvan places women at the heart of development.\nThe fashion show held at the Embassy’s beautiful hall enthralled the audience with a diversity of designs and universal appeal. The bond between the designer and the gorgeous models made the dreamy creations come to life appearing even more spectacular.\nIn a mix of Pak-France art and culture, the audience was also captivated by a mesmerizing performance by the ever-vivacious opera singer Clara Bellon with her fascinating voice.\nA documentary featuring testimonials of female artisans-at-work facilitated by Kaarvan was also displayed. Guests were treated with traditional Pakistani cuisine.\nA large number of people from different walks of life including French officials and friends, diplomats, fashion and business circles, students and media attended the fashion show.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:54:08.521Z"
}
