{
  "title": "Civil society, environmentalists berate civic agency for intending to repossess Islamabad Zoo",
  "link": "https://www.app.com.pk/national/civil-society-environmentalists-berate-civic-agency-for-intending-to-repossess-islamabad-zoo/",
  "date_published": "2024-01-24T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): The civil society and environmentalists of the federal capital on Wednesday berated the Capital Development Authority (CDA) for its intention to repossess the erstwhile Islamabad Marghazar Zoo currently operating as the only Wildlife Rescue and Rehabilitation Center under the ambit of the Islamabad Wildlife Management Board (IWMB).\nThe CDA, development agency of the federal capital, in a recent news article published in a national daily expressed its intention to regain the control of the Zoo from the IWMB. However, IWMB already has plans to revive the closed Zoo as a visitors’ information and educational center on wildlife.\nA civil society member running a wildlife rescue and rehabilitation organization on the premises of old zoo while requesting anonymity told APP that the Islamabad High Court (IHC) 2020 verdict has clearly stated that Islamabad zoo should be permanently shut down and that management handed over to IWMB and that IWMB should work towards prevention of cruelty to animals in ICT with help of govt agencies like Chief Commissioner and IG police offices.\nThe Wildlife Rescue non-governmental organization is also partnering with the IWMB to assist its operations at the Rescue Center.\nHe said that through donations from civil society they are supporting IWMB in running the Rescue and Rehabilitation centre as they have little funding from the Ministry of Climate Change and Environmental Coordination due to paucity of govt funding after 2022 floods.\nThe IWMB, he said under the leadership of its chairperson, Rina Saeed Khan had planned to resurrect a “most-modern” ‘Wildlife Conservation and Information Centre’. Khan said the blueprint for the Wildlife Centre was ready, designed by famous architect Raza Ali Dada who had created the conceptual design of the Centre.\nThe wildlife enthusiast was of the view that the CDA already had the land possession of Shakarparian National Park and Lake View Park where it could conduct its endeavours pertaining to public education and recreation so why was it after the land of the Zoo?\nThe Zoo is located next to the Margalla Hills National Park which is home to a thriving species of plants, insects, mammals, reptiles and anteaters etc. “This zoo should be transformed into a well designed and better managed public information and education center on the wildlife of the national park as many people are unaware of the species existing in the national park. We have to co-habitat with wildlife as MHNP is the only living ecosystem of leopards and pangolins next to a human population in the world,” he added.\nHe mentioned that many countries were banning and declaring wildlife captivity in zoos as illegal like Costa Rica whereas in the US and Pakistan there were laws that declare wildlife captivity illegal.\nHe regretted that the Parliament of Pakistan had approved the Islamabad Nature Conservation and Wildlife Management Act, 2023 aimed at empowering the IWMB but it was not enacted so far as it was not being sent to the President for signing due to red tape.\nWhile citing a similar example to Islamabad Zoo that faced the worst administration and maltreatment of animals under the CDA regime prior to be shut down, he said that the King’s Zoo in Nepal was converted into an education and wildlife rehabilitation center after the end of the King’s rule in Nepal. It is currently being visited by school students for sensitization and education and headed by a vet who got his professional degree from Norway in wildlife management.\nThe Chitwan National Park was managed by the Nepali Army that resulted in zero poaching in the protected area, whereas the elephants being released in the national park were used for patrolling by the Nepalese Army that made it the best example of an environment friendly patrolling without fuel-based jeeps.\nWhen contacted, Chairperson IWMB, Rina Saeed Khan said the IHC verdict was not challenged by any stakeholder including the CDA after judgement was passed in 2020 that made the decree a law which must be followed in all cases. However, in terms of repossession of the Zoo which was out of the question as per the IHC verdict the relevant forum was the Court, she added.\nThe Zoo’s poor governance and maltreatment of animals brought a bad name to the country whereas the Margalla Wildlife Center (currently the Wildlife Rescue Center component is up and running in Islamabad Zoo) has so far successfully rescued and rehabilitated approximately 381 animals since 2020, including mammals, birds, and reptiles.\nMoreover, some 51 different animals including seven Black Bears, a Bengal Tiger, 15 Rhesus Monkey, an Indian Palm Civet Cat, a Steppe Eagle, 21 Indian Kites, a White Eyed Buzzard, a Booted Eagle and three Spiny Tailed Lizards were under the rehabilitation process, she added. Once funding is arranged the Visitor Information Centre will be added for public with digital displays (virtual zoo) and an amphitheater and educational centre for children.\nWhen contacted the Ministry of Climate Change and Environmental Coordination official opined that the issue was communicated in the Ministry whereas the possession of the Zoo could only be done through the court otherwise it would be an illegal occupation of the land. It should have to be contested on strong reasons that would permit the CDA to take possession whereas earlier the Zoo issue was taken to court due to poor upkeep of the wildlife by the CDA officials which resulted into the decree allowing the IWMB to take over the management of the Zoo for better management of the site he added.",
  "retrievedAt": "2025-08-10T23:53:25.408Z"
}
