{
  "title": "International Day of Education marked on Wednesday",
  "link": "https://www.app.com.pk/national/international-day-of-education-marked-on-wednesday/",
  "date_published": "2024-01-24T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):The sixth International Day of Education was celebrated on Wednesday through different activities highlighting the role of education in ensuring peace and development.\nThe day was celebrated through several activities including seminars, conferences, discussion programmes, rallies and competitions projecting this year’s theme “learning for lasting peace” which seeks to illuminate the path to global harmony through the voices of our youth.\nTo mark the day, the Federal Board of Intermediate and Secondary Education (FBISE) organized the sixth annual `International Day of Education English Speech Contest’ on Tuesday where many students from Secondary School Certificate and Higher Secondary School Certificates students shared their perspectives on fostering peace, tolerance, interfaith harmony and gender equality.\nThrough this opportunity, the students exhibited their extraordinary oratorical skills, showing their eloquence and originality and igniting discussions on critical global issues while representing their institutions at a national level.\nThe Ministry of Federal Education and Professional Training hosted celebrations at the National Library to promote the power of learning. The event featured awareness activities about social issues affecting youth and opportunities for vision screening and career counseling.\nThe National Education Foundation (NEF) also participated by setting up a stall with the help of their transgender learners and community school students.\nBy providing education to vulnerable groups, NEF is helping fulfill the promise of quality education as a human right.\nUNESCO has dedicated this year’s International Day of Education to the crucial role education and teachers play in countering hate speech, a phenomenon which has snowballed in recent years with the use of social media, damaging the fabric of our societies.\nThe United Nations General Assembly proclaimed 24 January as the International Day of Education, in celebration of the role of education in peace and development.\nEducation is a human right, a public good and a public responsibility. Without inclusive and equitable quality education and lifelong opportunities for all, countries will not succeed in achieving gender equality and breaking the cycle of poverty that is leaving millions of children, youth and adults behind.\nAccording to UNESCO, today, 250 million children and youth are out of school, and 763 million adults are illiterate. Their right to education is being violated and it is unacceptable. It’s time to transform education.\nThe world is seeing a surge of violent conflicts paralleled by an alarming rise of discrimination, racism and hate speech. The impact of this violence transcends any boundary based on geography, gender, race, religion, or politics, offline and online.\nAn active commitment to peace is more urgent today than ever: Education is central to this endeavour, as underlined by the UNESCO Recommendation on Education for Peace, Human Rights and Sustainable Development.\nLearning for peace must be transformative, and help empower learners with the necessary knowledge, values, attitudes skills and behaviours to become agents of peace in their communities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:53:06.534Z"
}
