{
  "title": "Youth, guardians of nation, country’s bright traditions : COAS",
  "link": "https://www.app.com.pk/national/youth-guardians-of-nation-countrys-bright-traditions-coas/",
  "date_published": "2024-01-24T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): Chief of Army Staff (COAS), General Syed Asim Munir on Wednesday said youth were the guardians of the bright and sublime traditions of the nation and country, the epitome of Allama Iqbal and Quaid-e-Azam’s visionary leadership.\nAddressing ‘Pakistan National Youth Conference’ at Jinnah Convention Center, he said: “It gives me great pleasure to address the future builders of Pakistan and Shaheen of Iqbal.”\nThe Army Chief said the establishment of Pakistan highlighted the core issue that Islamic culture and civilization were different from Hindus in all respects and Muslims might not adopt Western civilization and culture.\nThe youth, he said should have immense confidence in their country, nation, culture, civilization and themselves. “The youth should be sure that they are scion of a great homeland and nation,” he added.\nHe said Pakistan Army could fight against terrorists, but the cooperation of the entire nation was imperative in that\nregard.\nThe COAS said that the main objective of social media and propaganda was to spread uncertainty, chaos and despair, whereas social media news verification was critical as without research and positive thinking, society remained chaotic.\nCiting verses of the Holy Quran on disinformation, he saida news : “Allah Almighty says : ‘O believers! If a transgressor brings news, you should firstly confirm it’.”\nThe establishment of Pakistan was just like the Tayyaba state (referring to Islamic State of Medina), that were founded under the sublime banner of Kalima-e-Tayyaba, the Army Chief said. “Allah Almighty has blessed Pakistan with abundant natural resources, agriculture and young manpower,” he added.\nHe said that a Muslim always offered gratitude to Allah Almighty for patience in turbulent and good times adding, “Our forces are always ready against any kind of threat and conspiracy. If Pakistan exists, so we do, if there is no Pakistan then we are nothing.”\nHe said that Pakistan would not compromise on its sovereignty. He urged the youth for having full faith in the bright future and maintaining the legacy of the ancestors.\nDuring the address of COAS, the students also raised slogans of Pakistan Army Zindabad, Pakistan Zindabad and Quaid-e-Azam Zindabad.",
  "retrievedAt": "2025-08-10T23:52:52.873Z"
}
