{
  "title": "All citizens are equal before law regardless of their faith, caste, race in Pakistan: Mushaal",
  "link": "https://www.app.com.pk/national/all-citizens-are-equal-before-law-regardless-of-their-faith-caste-race-in-pakistan-mushaal/",
  "date_published": "2024-01-24T18:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): Special Assistant to the Prime Minister Mushaal Hussein Mullick has highlighted the core principles of equality saying that all citizens of Pakistan are equal before the law regardless of their faith, caste and race.\nShe was addressing a consultative session on the promotion of interfaith harmony in Pakistan. The consultative session was attended with equal representation by members from all faiths and organizations working for interfaith harmony.\nShe actively listened to the participants to gain insight into the challenges faced by minorities across Pakistan. In response, she assured that meaningful and effective measures would be taken to address these issues.\nMushaal Mullick said that Pakistan derives its policies regarding minorities from the golden principles laid out by the Founder of Pakistan Quaid-e-Azam Muhammad Ali Jinnah, in his address to the 1st constituent assembly of Pakistan.\nShe highlighted that Pakistan’s first cabinet comprised of members of all faiths which was a powerful illustration of Pakistan’s commitment to unity in diversity. She also drew attention to the representation of unity in the national flag’s colors.\nThe SAPM underscored the universal teachings of co-existence, humanity, and peace inherent in all faiths. She expressed concern over the misrepresentation of religions by certain factions which was leading to the promotion of hatred on a global scale. In particular, she highlighted the menace of Zionist and Hindutva ideologies and emphasized that both posed a significant and grave threat to global peace.\nMushaal threw light on the invaluable contributions of Pakistan’s minorities in the nation’s progress. She also highlighted the efforts of people of all faiths in the creation of Pakistan.\nShe expressed Pakistan’s unwavering commitment to ensure that minorities had the opportunity to visit their sacred sites within the country. Kartarpur Corridor was an example of such commitment through which thousands of Sikh Yatries visited their holy places across the border on annual basis. This initiative served as a testament to Pakistan’s dedication to the promotion of religious harmony in its diverse population, she added.\nThe SAPM reiterated her firm commitment to the establishment of interfaith societies within educational institutions throughout Pakistan. She advocated for adjustments in the educational curriculum to promote values of peace and respect for all faiths.\nShe expressed her intention to collaborate with the Higher Education Commission to introduce scholarships specifically tailored for minorities across all levels in educational institutions.\nShe further said that steps were being taken to effectively implement education and employment quotas reserved for minorities.\nMushaal emphasized the empowerment of district-level interfaith committees. She said that instructions to district administrations would be issued to convene regular meetings of these committees.\nShe said that the empowerment of these committees would ensure that the challenges faced by minorities were promptly and effectively addressed at the grassroots level.\nThe SAPM announced the establishment of two churches in AJK, one in Mirpur and the other in Muzaffarabad.\nShe expressed her commitment to restoring and refurbishing temples all across the country. She stressed collaborative efforts and action oriented measures to promote interfaith harmony for the lasting peace in the country.",
  "retrievedAt": "2025-08-10T23:52:36.679Z"
}
