{
  "title": "Workshop held to strengthen Parliamentary practices",
  "link": "https://www.app.com.pk/national/workshop-held-to-strengthen-parliamentary-practices/",
  "date_published": "2024-01-24T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):A workshop titled “Parliamentary Interface: Learning Experience of Provincial Assembly Secretariats” commences at the National Assembly on Wednesday in order strength Parliamentary practices.\nThe workshop, jointly organized by National Assembly and Mustehkam-Parlimaan aimed at nurturing a constructive dialogue and deliberation among national parliaments’ on crucial issues influencing parliamentary and legislative agenda.\nThe participants received a comprehensive overview of the National Assembly, its functions, procedures, and a detailed explanation of the committee system and legislative processes from Muhammad Mushtaq, Special Secretary (Legislation) of the National Assembly in different sessions of the event.\nDuring the session on ‘Committee System and Legislative Process’, Muhammad Mushtaq provided an in-depth briefing on the committee system and its importance in the legislative process.\nHe also conducted a walkthrough explaining how bills are introduced, reviewed, and passed within the National Assembly and joint sessions of the Parliament.\nThe senior officers from National Assembly and Provincial Assemblies of Balochistan, Sindh and Khyber Pakhtunkhwa are actively contributing to the dynamic exchange of knowledge taking place at Parliament House.\nThe Executive Director of Pakistan Institute for Parliamentary Services (PIPS) Muhammad Anwar shared valuable insights to foster collaborative learning environment in order to promote best Parliamentary practices.\nHe elucidated the technicalities of the committee system and legislative processes.\nThe session proceeds with a question & answer segment, where the officers from Provincial Assemblies actively seek clarification on the elaborated topics.\nThe officers from Provincial Assemblies were taken on a guided tour of the National Assembly, encompassing the National Assembly Hall, Women’s Parliamentary Caucus (WPC), Sustainable Development Goals (SDGs) Secretariat, library, media and various departments.\nDuring the tour, they were briefed on the roles and responsibilities of different units within the Secretariat.\nIn the last session of the Parliamentary Interface, the participants from Provincial Assemblies recommended for organizing similar programs, workshops, and seminars to facilitate meaningful global exchanges among stakeholders and governance experts.\nThe event focused on knowledge-sharing, strategic discussions, and interactive learning to enhance governance at both the National and Provincial levels.\nThe session concluded with a vote of thanks. The officers expressed appreciation for the National Assembly Secretariat for providing the opportunity to visit this prestigious institution and gain insights into its procedures, functions, and key.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:53:26.104Z"
}
