{
  "title": "Experts call for devising RE industry localization policy",
  "link": "https://www.app.com.pk/national/experts-call-for-devising-re-industry-localization-policy/",
  "date_published": "2024-01-24T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): With emphasis on developing a long-term integrated energy plan based on renewable energy (RE) transition to resolve the issue of circular debt and remove economic uncertainties, experts at a high-level policy discourse on Wednesday suggested devising a country specific policy for the localization of RE industry.\nThe roundtable discourse on “Energy Reforms Agenda and Priorities for Pakistan post-2024 Election” was organized by Sustainable Development Policy Institute (SDPI).\nThe experts said that tariffs could be brought down by exploiting the wind sector’s potential through locally developing concrete towers and using local manpower.\nThey emphasized on putting a much broader focus on demand side management through a better policy approach and monitoring mechanism for energy efficiency and conservation.\nThe new government would have to upscale and expedite the transition from imported fossil fuel-based projects towards local resources, they viewed.\nHighlighting the potential solutions to affordability, reliability, and accessibility, ex-chairman of NEPRA Tauseef H. Farooqi recommended to diversify the power generation mix by increasing the share of renewables for a sustainable energy portfolio, reduce reliance on imported fuels to increase resilience to vulnerability to external factors such as exchange rates and global conflicts and tackle losses and theft in the power sector.\nSenior Public Policy Advisor Dr Khaqan Najeeb said a small team in the Ministry of Power with clear targets to meet power transition could help in that regard. “We need to have small human resource, finance and energy experts to resolve IPPs (Independent Power Producers) deficit, petrol and diesel prices deregulation, and privatization of power sector,” he maintained.\nNEPRA and OGRA should come as market makers, he said, and stressed the need to engage external expertise.\nEarlier, in his opening remarks, SDPI Executive Director Dr Abid Qaiyum Suleri said the new government would have to move towards the solution of the challenges like energy, economy, and digital transformation, with a practical and pragmatic approach.\nHe said connecting the dots revealed that all challenges were intertwined, and none of them could be addressed in isolation.\nHe added that a collective working on all sectors would help boost economy and “enable us to better energy governance and adoption of better energy technologies”.\nHe said the forum was ready to guide the new government on what concrete steps could be taken to improve the system for a resilient and sustainable economy.\nSDPI Research Fellow Dr Khalid Waleed, who also moderated the session, said that reliance on renewable energy should be the priority of the new government as the energy landscape of Pakistan was dominated by affordability crisis.\nThe outdated transmission system, he said, was also a big problem and should be upgraded to bear renewable energy load.\nTanveer Mirza, a representative of the Wind Industry, suggested legislation for ensuring policy continuity for over a decade or so to achieve desired dividends.\nHe said that the new government should bring clarity in the state decisions on renewable energy adoption.\nCEO of PRIED Badar Alam said the policy discourse needed to bring public at its center to ensure inclusive policy development. The new government would have to come up with a plan for a decentralized energy industry to ensure cost efficient solutions.",
  "retrievedAt": "2025-08-10T23:52:44.601Z"
}
