{
  "title": "Pakistan benefiting from first CPEC phase; engaged with China for next one: PM",
  "link": "https://www.app.com.pk/national/pakistan-benefiting-from-first-cpec-phase-engaged-with-china-for-next-one-pm/",
  "date_published": "2024-01-24T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday said that having achieved the first phase of China Pakistan Economic Corridor (CPEC), Pakistan was benefiting from its early harvest projects while remaining engaged with China to execute the next phase.\n“We have already achieved the CPEC’s first phase and we are benefiting from its early harvest projects. We are entering the second phase. We do need more deliberations when it comes to the second phase,” he said in an interview with China Global Television Network (CGTN) during his visit to Davos to attend the World Economic Forum.\nHe said the CPEC’s second phase required road and air connectivity around the industrialisation projects.\n“Both sides are engaged and we have developed a lot of connectivity – road, air and rest of connectivity corridor. We are benefiting from the ecosystem of doing trade with one another,” he remarked.\nAsked how he articulated the Chinese economy, Prime Minister said, “I am always sanguine about it. There are 1.5 billion consumers and 1.5 billion producers… How can you divorce 1.5 billion people from 8 billion people? It has to remain connected.”\nHe said being a huge marketplace, both China and the world were interested in each other.\nQuestioned about his government’s priorities, the prime minister highlighted the economic revival, the transformation of technology and taxation reforms.\nHe said Pakistan was on the middle ground amidst the discourse between Global North and South and other conflicts in the region.\nDomestically, he said the government needed to earn more and spend less.\nThe prime minister said that Pakistan should remain focused on taking the advantage of opportunities in the region including the Belt and Road Initiative and the relocation of Chinese industry.\nHe advocated the policy envisaging to encourage business and provide them electricity on competitive price to help the businesses produce competitive goods for export to the international market.\nPrime Minister Kakar said the government was also focusing on the Special Economic Zones and formulating policies for the advantage of the the foreign direct investment.\nHe said divide between Global South and North needed to be bridged for mutual co-existence.\nTo a question, the prime minister said Pakistan was heading towards general elections and wished well for the contestants with a hope that they would have a plan for economic revival in their respective agendas.",
  "retrievedAt": "2025-08-10T23:53:00.514Z"
}
