{
  "title": "LESCO recovers over Rs 2.10b from 71,997 defaulters in 132 days",
  "link": "https://www.app.com.pk/national/lesco-recovers-over-rs-2-10b-from-71997-defaulters-in-132-days/",
  "date_published": "2024-01-24T14:02:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 24 (APP):Lahore Electric Supply Company (LESCO) in collaboration with Tehsildars (Recovery) has recovered more than Rs 2.10 billion from 71,997 dead defaulters in all the five districts – Lahore, Sheikhupura, Nankana Sahib, Kasur and Okara – during 132 days of its recovery campaign.\nLESCO spokesman told media here Wednesday that during the 132 days, Chief Engineer O&M (T&G) Zafar Iqbal with the support of Tehsildar City Mujahid Ziaand Tehsildar Shalimar Noreez Humayun recovered outstanding dues of Rs 290.13 million from 10,155 defaulters in Northern Circle and Rs 509.96 million from 9,374 defaulters in Eastern Circle respectively.\nSimilarly, LESCO Manager (Material Disposal) Engineer Anwar Watto along with Tehsildar Model Town Rana Arsal and Tehsildar Cant. Sajjad Qureshi recovered Rs 273.54 million from 8,116 defaulters in Central Circle and Rs 115.76 million from 4,166 defaulters in South Circle, while Manager (Technical) Engineer Muhammad Farooq with the assistance of Tehsildar Nankana Sahib Muhammad Iqbal Rasheed and Tehsildar Sheikhupura Muhammad Aslam Gujjar recovered Rs 175.34 million from 6,431 defaulters in Nankana Circle and Rs 315.43 million from 8,816 defaulters in Sheikhupura Circle.\nHe added that LESCO Manager E&S (PMU) Engineer Abbas Ali in collaboration with Naib Tehsildar Kasur and Okara Mirza Zahid Baig recovered outstanding dues of Rs 131.46 million from 11,439 defaulters in Okara Circle and Rs 296.94 million from 13,500 defaulters in Kasur Circle.\nOn the 132nd day of the recovery campaign, the LESCO with the help of Tehsildars (Recovery) recovered more than Rs 22.4 million from 584 dead defaulters in its all circles of operation.\nHe elaborated that LESCO recovered outstanding dues of Rs 6.83 million from 125 defaulters in Northern Circle; Rs 4.27 million from 69 defaulters in Eastern Circle; Rs 2.51 million from 69 defaulters in Central Circle; Rs 0.92 million from 36 defaulters in South Circle; Rs 0.65 million from 33 defaulters in Nankana Circle; Rs 4.94 million from 73 defaulters in Sheikhupura Circle; Rs 0.67 million from 83 defaulters in Okara Circle and Rs 1.96 million from 96 defaulters in Kasur Circle.\nFor the recovery campaign started on September 13, the Lahore Division’s Commissioner had assigned additional charge of Tehsildar Recovery (from LESCO defaulters) to relevant Tehsidars, while LESCO Chief Executive Officer Engineer Shahid Haider has also designated four senior officers to assist them in the dues recovery from defaulters. LESCO Chief Executive Officer Engineer Shahid Haider said that the company is facing loss due to dead defaulters, and vowed to continue action against them.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:53:06.398Z"
}
