{
  "title": "CG COMSTECH emphasizes increase in pharmaceutical exports",
  "link": "https://www.app.com.pk/national/cg-comstech-emphasizes-increase-in-pharmaceutical-exports/",
  "date_published": "2024-01-24T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):Coordinator General COMSTECH, Prof. Dr. M. Iqbal Choudhary Wednesday emphasized increasing pharmaceutical exports of the country which are very low.\nSpeaking at an International Seminar on Pharmaceutical Manufacturing in OIC Member States: Status and Future, he pointed out that Pakistan was producing very high-quality medicines but unfortunately, its exports were very low which needs to be enhanced.\nHe said that Pakistan needseda hydrocracking facility, biomass fermentation base, medicinal plant and salt and mineral based pharmaceutical manufacturing.\nProf. Choudhary assured that COMSTECH can bring expertise in pharmaceutical manufacturing from different OIC member states which are doing excellently well in this area, like Iran, Indonesia, Bangladesh, and Turkey. He said that the most important factor was to implement the recommendations of this seminar to excel.\nSpecial Assistant to the Prime Minister on Finance and Revenue, Dr. Waqar Masood Khan, who graced the occasion as the chief guest, said that pharmaceutical manufacturing was a key indicator of economic development of any country.\nHe said the most important goal of any nation is to achieve good health and good health cannot be possible without quality medicine. He informed that the pharmaceutical sector is the next up and coming sector to contribute to exports. He suggested finding ways to reduce the imports in this sector which are too high at the moment.\nDr. Waqar hoped that this seminar would lead to real manufacturing of pharmaceutical products. He suggested preparing a database of OIC countries and striving for intra-OIC trade in this sector. He indicated that Islamic Development Bank could provide cheap trading financing to help boost intra-OIC trade.\nProf. Dr. Mohammad Wasay, from Neurology Department, Agha Khan University said that pharmaceutical manufacturing was very good in Pakistan and we were also exporting pharmaceutical produce, but are importing raw material extensively.\nHe said we need to draw a framework to manufacture pharmaceuticals at a wide level to export.\nProf. Wasay said that this is a seminar that brought all stakeholders under one roof to discuss how to produce, export, and be innovative in this industry.\nCEO, Drug Regulatory Authority Pakistan, Asim Rauf said that Pakistan was struggling in terms of pharmaceutical manufacturing and export. Eight manufacturing units of Pakistan have international recognition, he said and informed that USD 1 billion export of pharmaceuticals was this year’s target.\nRauf said that despite the challenges, we are doing in our capacity to achieve this goal. He also informed that DRAP has been made fully automated and by one click all imports and exports are tracked.\nHe suggested that we can have joint ventures with OIC states, like conducting clinical trials, signing MoUs and devising joint programs under COMSTECH.\nThe seminar was also addressed by industry experts and practitioners. More than 60 people participated in the seminar in-person, and online from various OIC member states.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:53:06.563Z"
}
