{
  "title": "Mushaal urges world to take notice of gruesome HR violations in IIOJK",
  "link": "https://www.app.com.pk/national/mushaal-urges-world-to-take-notice-of-gruesome-hr-violations-in-iiojk-2/",
  "date_published": "2023-03-05T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP): Chairperson of Peace and Culture Organization Mushaal Hussein Mullick on Sunday has said that the fascist Narendra Modi regime is snatching ancestral lands of Kashmiri Muslims to make a way for Hindu settlements under the nefarious plan to change the demography of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nIn a strong reaction to the Indian notorious government’s ongoing drive to evict the local residents of their lands and render them homeless, Mushaal said that Modi’s Hindutva regime started attaching properties of the Kashmiris in the occupied valley to put pressure on them to give up their legitimate struggle for internationally recognized right to self-determination, said a press release received here on Sunday.\nShe revealed that the occupation authorities attached two more Kashmiris’ houses under draconian law Unlawful activities (Prevention) Act (UAPA) in Srinagar and Sopore, besides 168 properties of Kashmiris in Doda, Kishtwar, Rajouri and Poonch district in last few days.\nMushaal, the wife of incarcerated Hurriyat leader Yasin Malik, said that supremacist Hindutva regime got inspiration from Zionist government in Israel, which encroached upon Palestinians properties through various brutal tactics and Modi government was replicating the same model in the occupied Kashmir, which would be resisted at all fronts.\nShe went on to say that occupation authorities were hell-bent on rendering Kashmiris homeless in their own homeland on one pretext or the other, demolishing their houses and snatching their ancestral lands to make way for non-residential settlers in the occupied territory and snatch the Muslim identity of the territory.\nThe chairperson noted that attaching properties of Kashmiris was a sheer political vendetta on part of the Indian regime and was meant to bully them to shun the legitimate struggle to break the shackles of Indian slavery.\nShe expressed her surprise that notorious Modi regime gave a free hand to over nine hundred thousand brutal Indian troops to commit atrocities on the people of the occupied territory to terrify them through different tactics to silence the dissenting voices in IIOJK.\nMushaal stated that in the wake of repealing the special status of IIOJK, Indian fascist government issued domicile certificates to thousands of Indian Hindus and was now evicting the Kashmiri Muslims of their lands so as to render them homeless.\nThe Chairperson said that Indian authorities were confiscating properties of Kashmiris to punish them for their affiliation with freedom movement, adding that occupation troops were regularly destroying Kashmiris’ houses during violent military operations.\nShe said that the killing of Kashmiris in fake encounters and destroying their properties was a norm in the occupied valley, as Modi regime was planning not only to render Kashmiris homeless but to deprive them of their identity as well.\nMushaal stated that Indian government was using every brutal and highhanded tactic to stifle the freedom voice of Kashmiris. However, the Hurriyat leader vowed that Indian machinations would not deter the Kashmiris from taking to legitimate struggle to its logical ends.\nShe lamented that the world power and human rights organizations observed a criminal silence over the naked violations of human rights and fundamental rights of Kashmiris.\nMushaal urged the world powers and UN bodies to wake up from their sweet slumber and take notice of the Modi regime’s brutal actions in the occupied valley.",
  "retrievedAt": "2025-08-11T06:16:43.094Z"
}
