{
  "title": "Media awareness stressed for countrywide first-ever Digital Population Census 2023",
  "link": "https://www.app.com.pk/national/media-awareness-stressed-for-countrywide-first-ever-digital-population-census-2023/",
  "date_published": "2023-03-05T07:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP):Spokesperson of Pakistan Bureau of Statistics, Muhammad Sarwar Gondal on Sunday stressed for media awareness for the society about the first-ever digital population census 2023 in the country which would continue for one month to help make future development plans, creation of jobs, assembly seats and for keeping development funds for urban and rural areas. Around 121000 field enumerators have been deployed for the purpose, he said while talking to PTV news channel.\nMuhammad Sarwar Gondal further said during this phase, the enumerators are visiting door-to-door with the latest tablet technology to collect household family data, adding that the aim of the census was to collect and collate details about property usage, types of businesses and the demographics of individuals, nationals and residents alike. “The government aims to conduct this census to plan better policies for the growth and development of the society”, he added.\nTo a question, Gondal replied, “There are already many reservations over the sixth population census conducted in 2017, and now after a long gap of five years, we are again conducting a digital population census with the coordination of all provincial stakeholders.”He urged the citizens to actively participate in the census and their personal information would remain confidential.\n“All the nationals and residents, families and private sector companies should co-operate with the census teams, as it benefits everyone and contributes to advancing the development of the country’s services.”“Every piece of information provided to the census teams contributes to serving the community, whose members are an integral part of the country’s comprehensive developmental policy plans,” he mentioned.\nHe said, “The census teams, instead of recording complete details, will only collect UTN numbers, which will be provided to those citizens who will save their data digitally.”To another question, Gondal replied, “A web portal with the address self.pbs.gov.pk has already been launched for the purpose.”\n“Evidence-based authentic data as per international standards will be used for delimitation of constituencies in the next general elections as well as for public policy planning.”The success of the census only depends upon the quality of data collection, therefore, we had conducted quality training programs for enhancing the capacity of field staff on concept and tablet usage, he concluded.",
  "retrievedAt": "2025-08-11T06:16:52.711Z"
}
