{
  "title": "Legislation being enacted for the protection of rape witnesses :Faisal Javed",
  "link": "https://www.app.com.pk/national/legislation-being-enacted-for-the-protection-of-rape-witnesses-faisal-javed/",
  "date_published": "2020-09-16T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP):Chairman Senate Standing Committee on Information and Broadcasting Faisal Javed said on Wednesday that legislation was being enacted for the protection of rape witnesses, besides to keep the identities of rape survivors secret.\n“Such criminals blackmail victims of abuse,” he told media outside the parliament house along with Senator Zeeshan Khanzada.\nA centralize database of rapists would be set up and a mobile phone app also be developed under which message would be circulated timely to the masses to prevent such incidents, he added.\nHe stressed that an example would be made out of sexual abusers and child rapists through legislation. “There needs to be a debate on laws of public execution,” he said,\nFaisal Javed said the government would table a bill in the parliament house soon through evolving consensus to set an example for the perpetrators of rape incidents.\n“Those who abuse children and women will be punished severely,” adding that , “If the police did not register a case of child abuse, a case would be registered against the police,” he added.\nAbout PML-N President Shehbaz Sharif’s insensitive comments on the Lahore motorway gang-rape case a day prior, the senator said the former Punjab chief minister should apologised for his statement.\n“Shehbaz Sharif should resign over his statement,” he said, adding that the PML-N representatives in the House were banging the desks following the party president’s comments.\nHe said opposition was blackmailing the government regarding the legislation of Financial Action Task Force (FATF) instead supporting it over the issue of national interest.\nThe opposition was demanding National Reconciliation Ordinance (NRO) in return of the bill but Prime Minister Imran Khan would not give NRO to those who looted national wealth.\nIn response to a question, the senator said Federal Minister for Law and Justice Farogh Naseem and Special Assistant to the PM on Interior Shehzad Akbar had been given the responsibility to bring Nawaz Sharif back to Pakistan.\nSenator Zeeshan Khanzada said that FATF is a global issue and it has a history. The opposition should support the government on this issue, he said and stressed the need to recognize the international law regarding money laundering.",
  "retrievedAt": "2025-08-11T19:48:35.162Z"
}
