{
  "title": "USAID benefits 1.7 mln children in reading instruction across Pakistan",
  "link": "https://www.app.com.pk/national/usaid-benefits-1-7-mln-children-in-reading-instruction-across-pakistan/",
  "date_published": "2020-09-16T08:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP):The Pakistan Reading Project (PRP) working under United States Agency for International Development (USAID) has benefitted 1.7 million children so far through training more than 27,000 teachers in reading instruction across Pakistan.\nThe project developed and distributed 7.3 million copies of learning material for teachers and students in five languages, including Urdu, Sindhi, Pashto, Balochi, Brahui; and two dialects of Sindhi and Pashto spoken in Balochistan.\nTo mark the occasion, education officials from Pakistan and the United States, along with USAID’s implementing partner, the International Rescue Committee, held here a ceremony to showcase the program’s success, a press release said on Wednesday.\nAfter seven years of partnering with the Government of Pakistan’s federal and provincial education leaders to improve the reading skills of more than a million Pakistani school children, the United States Agency for International Development’s (USAID) Pakistan Reading Project concluded its programming on September 14.\n“One of the successes of the project was to further validate the importance of learning to read in local languages in the early grades of school,” said Deputy Mission Director Michael Nehrbass.\n“Our hope is that the project’s methodology can expand to all public schools around the country through the support of the Pakistan government and PRP’s partners.\nAs we have seen from the schools where the project was successful, this initiative can improve the foundational reading skills of early grades students, which will lead to more success in the later grades.”\nAll of the Project’s material is available on Pakistan’s government education department websites in Khyber Pakhtunkhwa, Balochistan, Sindh, and the Islamabad Capital Territory for free public access.\nThe reading learning materials was also available at the Global Digital Library portal for free downloads at www.digitallibrary.io.\nPRP’s work with provincial curriculum departments and textbook boards resulted in the adoption of Urdu and Sindhi language curricula and improved textbooks for grades one and two, which incorporated phonics-based teaching instruction, assessment, and gender inclusion and equity.\nPRP also supported developing the curriculum for teacher education and training for more than 7,700 youth through tertiary education programs. Consequently, 41 percent of teacher trainees are now employed and 21 percent are pursuing higher education.\nDespite the COVID-19 outbreak, the PRP still reached 5.9 million people through various means. As an example, PRP used WhatsApp to share COVID-19 awareness, reading learning resources, and a radio program to increase awareness of their activities to a broader audience. PRP was selected as one of eight projects from among 80 projects around the world for a learning scale research study by RTI International, which is an effort funded by the Bill & Melinda Gates Foundation.\nIn addition, the United States Library of Congress selected the PRP as the International Literacy Program of the Year. This award is intended to draw public attention to the importance of literacy and the need to promote literacy and encourage reading.",
  "retrievedAt": "2025-08-11T19:48:38.389Z"
}
