{
  "title": "Cabinet approves launching of Kissan Dost Program",
  "link": "https://www.app.com.pk/national/cabinet-approves-launching-of-kissan-dost-program/",
  "date_published": "2020-09-16T08:45:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sep 16 (APP): A meeting of Khyber Pakhtunkhwa cabinet, chaired by Chief Minister, Mahmood Khan, here on Wednesday approved launching of Kissan Dost Program under which per annum wheat production target would be increased from 1.1 to 1.6 million metric tons.\nCabinet also approved an initial grant of Rs.397 million for launching the program under which farmers would also be facilitated through provision of certified seeds and fertilizers. The meeting was attended by Cabinet Members, Chief Secretary, Additional Chief Secretary, Secretary SMBR and Administrative Secretaries.\nCabinet also approved writing the name of Prophet Muhammad Peace Be Upon Him as “Hazrat Muhammad Rasoolullah Khatamunabeyen Sallalaho Alaihy Wa Aalehy Wa Ashabehi Wassalam” in all official and unofficial correspondence.\nCabinet decided to import an additional three lac metric tons of wheat through Trading Corporation of Pakistan (TCP). Cabinet doubled import with sole aim to stabilize prices of flour and to ensure uninterrupted supply to consumers on cheaper rates.\nThe cabinet also approved establishment of three new special purpose development authorities including Kelash Development Authority, Kumrat Development Authority and Kalam Development Authority.\nMeeting also decided to establish hundred more camping pods in different tourists’ spots, approved an additional grant of 400 million for renovation and up-gradation of Hayatabad Sport Complex.\nThe cabinet also approved amendments in PEDO Act to improve its performance and encourage private sector to invest in power sector. Members also decided to digitalize mines and minerals sector to ensure transparency in the grant of mineral titles.\nThe cabinet also approved keeping of censor board of motion films under the control of provincial government to ensure quality production and depict norms and culture of province.\nThe cabinet also approved increasing rates of penalties against sugar mill for delay in sugarcane crushing. The cabinet approved draft Khyber Pakhtunkhwa Minerals and Minor Minerals (Temporary Permit Rules 2020).\nCabinet also approved enhancement of Mineral Royalty Rates of various minerals including Barytes, Ballclay, Baczytes, Bentonite, Chinaclay, Marble, Dolomite etc. Approval of appointing Raza Habib (BS-18) officer of Railway Group as Director General Galiyat Development Authority was also given by cabinet.\nThe cabinet also approved appointment of Saliha Asif as Member Board of Director Bank of Khyber, compensation amount of Rs.1 million for heirs of Naik Muhammad of District Shangla who had died in Coal Mine incident in Darra Adam Khel.\nThe CM directed all the boards and authorities being established under various departments to prepare a brief on their performance for cabinet. He also congratulated cabinet on signing of agreement on Rashkai Economic Zone and welcomed Shahram Khan Tarakai and Anwar Zeb in the cabinet.",
  "retrievedAt": "2025-08-11T19:48:38.372Z"
}
