{
  "title": "CM Buzdar inaugurates Rs 4bln Mailsi siphon project, Daanish school",
  "link": "https://www.app.com.pk/national/cm-buzdar-inaugurates-rs-4bln-mailsi-siphon-project-daanish-school/",
  "date_published": "2020-09-16T08:43:00.000Z",
  "source": "APP",
  "content": "VEHARI, Sep 16 (APP):Chief Minister Sardar Usman Buzdar Wednesday inaugurated Rs 4 billion Mailsi Siphon project and remodelling of SMB link canal enhancing its capacity by 1600 cusec and to irrigate another 3000 acre area of the district.\nEarlier, Buzdar also inaugurated Daanish School at Tibba Sultan Pur during his visit to the district and announced to set up Daanish schools at Taunsa Sharif and Bakhar.\nSpeaking on the occaaion, he said that Rs 4 billion project would bring about further improvement in the irrigation system.\nBuzdar said that agriculture was the backbone of national economy and government was making all out efforts to improve infrastructure supporting agriculture and to bring about positive change in the lifestyle of farming community.\nBuzdar said that SMB canal remodelling would increase capacity by 1600 cusecs and resultantly the Lower Bahawal canal would get additional 1600 cusec water sufficient to irrigate another 3000 acre agriculture area. The project would enhance agriculture production and improve financial standing of farmers.\nThe secretary irrigation and chief engineer gave detailed briefing to the CM on the project and said that SMB canal was lined up to a length of 25 kilometres and height of its both sides was elevated.\nProvincial ministers Sardar Mohsin Leghari, Jahanzeb Khan Khichchi, MPAs, commissoner Multan, DC and other officials were present.\nEarlier, the CM visited Daanish school Tibba Sultan Pur where he formally inaugurated the school and also planted a sapling as part of ongoing plantation drive.\nBuzdar visited classrooms besides laboratories of physics, Biology and IT sections.\nLater, the CM also presided over the 32nd meeting of Daanish School Authority.\nSpeaking on the occasion, the CM said that it was the first meeting of Daanish school authority held outside Lahore.\nBuzdar also announced ‘Honhar Punjab’ programme to reward talented students for their encouragement.\nThe chief minister said that students showing good performance in academic, sports, fine arts and science and technology and position holders would get cash awards.\nThe CM also gave approval for teachers training programme.\nTalking to media persons after Daanish school authority meeting, the CM said that PTI government did not believe in closing down projects initiated by the past government. He added that it was for the first time that authority meeting was held outside Lahore at an under developed area like Tibba Sultan Pur.\nThe chief minister said that work on Orange line was completed and Metro train would operate soon.\nHe said that PTI government did not close down Metro Bus service. He said that previous government closed many projects of the past governments adding that the project to build new Punjab Assembly remained halted during last ten years of previous government and resumed only after PTI government took over.\nThey halted work on Wazirabad Institute of Cardiology but incumbent government resumed work on it and completed the cardiac care hospital project.\nHe said that Lahore-Sialkot motorway incident was highly condemnable and added that he himself conveyed information to the people regarding arrest of an accused at a press conference.\nThe other accused would also be arrested soon to make him face the law, the CM added.\nDaanish school authority chairperson Sumaira Ahmad gave briefing to CM on the occasion.\nProvincial Ministers Murad Raas, Jahanzeb Khichchi and authority members attended the meeting.",
  "retrievedAt": "2025-08-11T19:48:40.372Z"
}
