{
  "title": "No rules, constitution violated to run proceeding of NA: Dr Babar Awan",
  "link": "https://www.app.com.pk/national/no-rules-constitution-violated-to-run-proceeding-of-na-dr-babar-awan/",
  "date_published": "2020-09-16T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): Advisor to the Prime Minister on Parliamentary Affairs Zaheer ud Din Babar Awan said no rules and constitution was violated to run the proceeding of the National Assembly.\nSpeaking in the National Assembly, the advisor said worldwide parliaments were being run through certain rules and procedures which were framed under the constitution.\nCiting Article 55 of the constitution, Dr Babar Awan said that the speaker had two options if the House was not in quorum- either adjourn the session or suspend the proceeding for certain time.\nHe said let the house to run under the constitution and it should not be hostage to the wishes of any person.\nHe categorically said no rule and procedure was violated in today’s house proceeding. Referring to rule 288 of the Rules of Procedure and Conduct of Business in National Assembly 2007, Babar Awan said any member of the house could move a motion for suspension of the rules with the permission of the speaker.\nEarlier, lawmakers from both sides of aisle in National Assembly developed difference of opinion over the assembly rule related to suspension of sitting due to lack of quorum for more than one hour.\nPML-N MNA Sheikh Fayyaz Uddin pointed out the quorum at 11:08 hours following which the sitting remained suspended for an hour and 18 minutes.\nThe House passed a motion moved by Minister of State for Parliamentary Affairs Ali Muhammad Khan under Rule 288 to suspend the Rule (5) for consideration of the agenda.\nThe opposition protested over it and sitting was again suspended by the Speaker Asad Qaiser.\nOn resumption of the proceedings, Babar Awan quoted Rule 288 of the Rules of Procedure and Conduct of Business in National Assembly and Article 55 (2) of the Constitution. The Article 55 (2) says that “If at any time during a sitting of the National Assembly the attention of the person presiding is drawn to the fact that less than one-fourth of the total membership of the Assembly is present, he shall either adjourn the Assembly or suspend the meeting until at least one-fourth of such membership is present”.\nThe House failed to transact regular agenda but passed a motion for consideration of the Anti-Terrorism (3rd Amendment) Bill, 2020 in the joint sitting of the Parliament. The bill was passed by the National Assembly on September 15, 2020 but rejected by the Senate on September 16, 2020.",
  "retrievedAt": "2025-08-11T19:48:31.345Z"
}
