{
  "title": "Fakhar Imam for enhancing Pak-Netherlands cooperation in agri-sector",
  "link": "https://www.app.com.pk/national/fakhar-imam-for-enhancing-pak-netherlands-cooperation-in-agri-sector/",
  "date_published": "2020-09-16T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): Minister for National Food Security and Research Syed Fakhar Imam on Wednesday urged the need for enhancing Pakistan-Netherlands cooperation in the fields of agriculture and livestock, particularly in floriculture to promote high value crops production in the country\nThe minister also invited the Netherlands to invest in dairy farming, agribusiness and food processing of Pakistan in order to further strengthen the bilateral trade and investment relations of both the countries.\nTalking to the Ambassador of Netherlands Woulter Plomp, who called on him, the minister said that both countries can collaborate in fresh cut plants, flowers and bulbs to enhance farm income, says a press release.\nFakhar Imam also highlighted the longstanding partnership between Pakistan and Netherlands, which spans over last many years and appreciate its assistance for ensuring food security in the country.\nHe also appreciated Netherlands for providing technical assistance, trainings and said Pakistan and Netherlands have vast potential for collaboration in the field of research in food security and livestock sector development.\nPakistan imports more than 7,000 metric tons seed potato from Netherlands valuing Euro 1 million per annum, he said adding that both the countries enjoying friendly relations as it is one of the largest trading partners of Pakistan in the European Union.\nThe Netherlands has a highly mechanized agricultural sector that provides large surpluses for the food-processing industry and for exports. After the United States, the Netherlands is the biggest exporter of agricultural produce in the world, exporting around 65 billion Euros worth of vegetables, fruit, flowers, meat and dairy products each year.",
  "retrievedAt": "2025-08-11T19:48:33.461Z"
}
