{
  "article_id": "2025-09-10_18a6637481a240e8f6c89ad34082a0ad",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/first-ever-buddhist-cultural-and-information-center-to-be-established-in-capital-aurangzeb-khichi/",
    "retrieved_at": "2025-09-19T16:47:15.924Z"
  },
  "metadata": {
    "title": "First-ever Buddhist Cultural and Information Center to be established in capital: Aurangzeb Khichi",
    "author": null,
    "date_published": "2025-09-10T16:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 476,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 10 (APP):Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi Wednesday said Pakistan will soon establish first ever Buddhist Cultural and Information Center as a part of government efforts to promote inter-faith harmony and religious tourism. Talking to APP, the federal minister said that the Buddhist Cultural and Information Center will be established at National Institute of Folk and Traditional Heritage (Lok Virsa). The landmark initiative that underscores the government's commitment to promoting interfaith harmony, preserving heritage, and welcoming global visitors and reflect Pakistan's determination to showcase its rich history of tolerance and harmony. He said the center will provide facilities for international visitors, including meditation spaces and cultural resources, while serving as a hub for promoting Pakistan's Buddhist heritage. \"Just as the Sikh community and other tourists come here, we want to warmly welcome the global Buddhist community. Pakistan is home to sacred sites that deserve international recognition and respect,\" he added. The initiative is part of a broader cultural revival under the upcoming National Culture Policy, being developed on the directives of Prime Minister Shehbaz Sharif. \"This policy is a national mission to preserve our identity, empower artists and writers, and project Pakistan's true image of peace and creativity,\" Aurangzeb Khichi said. He emphasized that all provinces are being taken on board, with their input incorporated into the policy. \"We are rejecting narratives that link us with guns and conflict. Pakistan is a land of civilizations like Mehrgarh, Harappa, Mohenjodaro, and Taxila - our culture spans thousands of years and must be shared with the world,\" he noted. The minister said Pakistan is also working to revive its place on the UNESCO World Heritage List, with four new sites proposed. He added that important Buddhist landmarks, including the Shah Allah Ditta Caves, are being developed with improved infrastructure, which will soon make them major international tourist attractions. On the global front, Pakistan has cultural agreements with 86 countries and is expanding them to 125. \"Our artists are representing Pakistan worldwide. A group recently visited China with great success, and another is preparing to visit Uzbekistan,\" he said. The federal minister also highlighted preparations for this year's Lok Mela, where12 foreign countries are expected to set up cultural pavilions, up from six last year. \"More than a dozen ambassadors have already shown keen interest in participating,\" he added. To strengthen cultural education, Pakistan will establish its first degree-awarding fine arts institution by the end of the year, alongside art classes already underway at Lok Virsa. \"This will give young artists recognized qualifications, enabling them to study abroad and build professional careers,\" he said. Aurangzeb Khichi said, \"With the initiatives like first-ever Buddhist Cultural and Information Center and the upcoming National Culture Policy, Pakistan is taking bold steps to protect its heritage, support its artists, and share its true image with the world.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}