{
  "article_id": "2025-09-10_861ef0eaef94d6eedb25746f57dab46a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bolo-campaign-being-launched-to-counter-terrorism-extremism-tarar/",
    "retrieved_at": "2025-09-19T16:45:50.498Z"
  },
  "metadata": {
    "title": "Bolo campaign being launched to counter terrorism, extremism: Tarar",
    "author": null,
    "date_published": "2025-09-10T21:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 489,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 10 (APP): Minister for Information and Broadcasting Attaullah Tarar on Wednesday said the ministry was launching the \"Bolo\" campaign against terrorism and extremism by encouraging people to stand up and speak against the menace. Briefing the Senate Standing Committee on Information and Broadcasting, he stated that the campaign will broadcast human stories to empower citizens to speak out against terrorism. He added that Pakistan is undergoing a cultural shift on multiple fronts, from combating terrorism to addressing tax evasion. He noted that billions of rupees in business transactions have long been conducted informally, often recorded only on handwritten chits. To address this, the Federal Board of Revenue (FBR) has introduced public awareness initiatives and launched a simplified two-page tax return form to make compliance easier, promote formal documentation, and ensure greater transparency in financial dealings. Minister said reforms are underway at Pakistan Television (PTV) to boost revenue, including live broadcasts of major events like the Asia Cup to ensure access for viewers in remote areas. He noted that financial challenges have eased following grants from the Finance Division, allowing clearance of salaries and dues, though the prime minister has directed further revenue enhancement. Tarar confirmed the abolition of the Rs 35 TV fee in electricity bills, based on Power Division recommendations, and highlighted global practices like the BBC's licensing model to support public broadcasters. He added that PTV anchors are now appointed on merit and have the freedom to invite guests from opposition parties. Minister proposed the formation of a sub-committee under the Senate Standing Committee on Information and Broadcasting to review existing laws concerning job security and dues protection for electronic media journalists. The proposed sub-committee would assess gaps in existing legislation and, in consultation with journalist bodies, recommend comprehensive reforms. Minister Attaullah Tarar underscored the importance of a robust legal framework to protect electronic media journalists from arbitrary dismissal and ensure timely payment of dues. The committee is expected to propose refined legislation aimed at strengthening safeguards for journalists in the electronic media sector. Tarar informed the Senate committee that the issue of Rawalpindi Islamabad Union of Journalist (RIUJ) President Tariq Virk's illegal arrest has been amicably resolved through cooperation between police and journalist bodies. He confirmed the transfer of the police officer involved and acknowledged the ministry's intervention following the committee's urging. Tarar also proposed forming a sub-committee to examine unauthorized Prevention of Electronic Crimes Act (PECA) cases registrations by provincial authorities, stressing the importance of stakeholder collaboration. The committee, chaired by Senator Ali Zafar, convened to discuss the agenda items. Attendees included Senators Irfan ul Haq Siddiqui, Pervaiz Rashid, Syed Waqar Mehdi, Jan Muhammad Buledi, and Faisal Javed. The meeting was also attended by Secretary of Information and Broadcasting Ms. Ambreen Jan, PIO Mobashir Hassan, Managing Director of APP Muhammad Asim Khichi, senior officers from the Ministry of Information and Broadcasting, RPO Rawalpindi Babar Sarfraz, directors general of NCCI, and other distinguished guests.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}