{
  "article_id": "2025-09-10_1a1383c3436e71bfc53cc5abc86997dc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/telenor-celebrates-ai-day-to-drive-innovation-future-ready-skills/",
    "retrieved_at": "2025-09-19T16:47:04.200Z"
  },
  "metadata": {
    "title": "Telenor celebrates AI Day to drive innovation, future-ready skills",
    "author": null,
    "date_published": "2025-09-10T16:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 450,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 10 (APP): Telenor Pakistan marked AI Day with a series of interactive sessions, awards, discussions and Expo showcasing the transformative potential of Artificial Intelligence (AI) in reshaping industries, redefining skills, and influencing society. The initiative was designed to raise awareness, encourage dialogue, and provide practical insights into how AI can be responsibly applied across diverse sectors. The event, held at Telenor Pakistan's headquarters, 345 in Islamabad, brought together leaders, experts, and employees to explore the transformative potential of AI. A key highlight was the launch of \"AI Verse\" an AI-focused learning path designed to equip employees with future-ready skills. The agenda also included a panel discussion where industry leaders discussed AI's role in driving Pakistan's economic growth while addressing regulatory challenges. To further simplify adoption, Telenor introduced \"AI for Everyone\", an introductory session on prompt engineering and practical AI tools. The event also featured AI Expo, showcasing 10 ongoing AI projects, presented by the teams behind them. Telenor Group, through its AI Awards, celebrated groundbreaking projects from across its business units, where Telenor Pakistan's project 'Thunder', recognised for its pioneering application of AI in energy management, won the top honour in the AI for Innovation category. AI Hackathon at Telenor saw remarkable participation from Pakistan, with 105 teams submitting ideas-the second-highest across the Group. Speaking at the occasion, Fridjtof Rusten, CEO of Telenor Pakistan, highlighted the broader vision: \"AI is no longer a distant concept-it is here, reshaping industries, redefining skills, and transforming the way we live and work. For Pakistan, this is a tremendous opportunity to leapfrog into a digital-first future and unlock new pathways for progress. We are committed to harnessing AI not just to drive innovation, but to empower people, strengthen businesses, and accelerate inclusive economic growth-so its benefits extend to every corner of society.\" Awais Vohra, Chief Technology Officer at Telenor Pakistan, said, \"AI is a paradigm shift as it moves beyond a specialised tool to general-purpose technology which has a far-reaching impact across various industries and society. For our industry, Telecommunications, AI is a powerful enabler to help in planning and operating smart & efficient networks delivering personalised services. AI provides the brain for automated systems, services and decision making. We believe in ethical use of AI, that is transparent, in line with human values, society and is inherently secure protecting privacy. AI day is a step forward in fostering a culture where our people can learn, experiment and apply AI responsibly, contributing to a sustainable future.\" With initiatives like AI Day, Telenor Pakistan continues to strengthen its role as a leader in digital transformation, fostering collaboration between industry and talent, and preparing Pakistan's workforce to embrace the opportunities of an AI-driven future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}