{
  "article_id": "2025-09-10_f7aa1009a7aa09a5436ce67adab84423",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-bahrain-pledge-stronger-cooperation-on-security-counter-narcotics-and-immigration/",
    "retrieved_at": "2025-09-19T16:47:07.139Z"
  },
  "metadata": {
    "title": "Pakistan, Bahrain pledge stronger cooperation on security, counter-narcotics and immigration",
    "author": null,
    "date_published": "2025-09-10T15:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 273,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 10 (APP): Bahrain's Interior Minister, Lieutenant General Rashid bin Abdullah Al Khalifa, on Wednesday visited Pakistan's Ministry of Interior on Wednesday, where he was warmly received by Federal Interior Minister Mohsin Naqvi. The two sides held high-level and delegation-level talks aimed at strengthening bilateral cooperation in security and law enforcement. During the meeting, Pakistan and Bahrain agreed to establish a Joint Working Group to enhance collaboration across multiple sectors, including counter-narcotics, counter-terrorism, coast guard operations, border security, immigration, and police training. Both sides also decided to sign Memoranda of Understanding (MoUs) covering extradition, mutual legal assistance, and specialized battalion training. Interior Minister Naqvi emphasized the importance of intensified efforts against drug trafficking, noting, \"Cooperation in counter-narcotics is of utmost importance-it concerns the future of our coming generations.\" He praised Pakistan's Anti-Narcotics Force (ANF) for achieving a record-breaking $146 million recovery despite limited resources, and welcomed Bahrain's move to appoint a Drug Liaison Officer at its embassy in Islamabad. Highlighting the strong people-to-people ties, Naqvi pointed out that over 120,000 Pakistanis living in Bahrain contribute significantly to the development of both countries. Bahrain's Interior Minister reaffirmed his country's commitment to Pakistan, stating, \"Bahrain attaches great importance to its brotherly relations with Pakistan and seeks to advance cooperation in all sectors.\" He added that the formation of the Joint Working Group and signing of MoUs would provide fresh momentum to bilateral relations. The talks were attended by Bahrain's delegation members, Pakistan's Minister of State for Interior Talal Chaudhry, senior officials from the Interior Ministry, the Director General of ANF, the Commandant of the National Police Academy, and Islamabad's Chief Commissioner and Inspector General.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}