{
  "article_id": "2025-09-10_48c2ed2b2aa6dac62129ad447be87eb1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cabinet-approves-nationwide-climate-agricultural-emergency/",
    "retrieved_at": "2025-09-19T16:46:41.065Z"
  },
  "metadata": {
    "title": "Cabinet approves nationwide climate, agricultural emergency",
    "author": null,
    "date_published": "2025-09-10T17:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 527,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 10 (APP): Prime Minister Shehbaz Sharif on Wednesday announced in-principle the approval for climate and agricultural emergency in view of the ongoing monsoon and flood situation across the country. In this regard, the prime minister will soon chair a meeting comprising the Chief Ministers of all four provinces and relevant officials to deliberate on a future strategy to mitigate further damage caused by the adverse effects of climate change. The meeting of the federal cabinet was held here under the chairmanship of PM Shehbaz Sharif where the cabinet was briefed on the current flood situation and its damages. After thorough consultation, the decision to approve the emergency in principle was taken. The cabinet members highlighted the damage to millions of acres of agricultural land and crops, and presented suggestions regarding the restoration of infrastructure, compensation for agricultural losses, and support for farmers. The cabinet also strongly condemned derogatory and offensive content and statements being spread on social media against the martyrs and the armed forces of Pakistan. Tribute was paid to the officers and soldiers of the armed forces who are tirelessly defending Pakistan's borders, as well as to the martyrs and their families who made great sacrifices for peace in the country. The cabinet directed that strict action be taken against such malicious elements. On this occasion, the prime minister said that discouraging such elements at every forum and responding to their derogatory campaigns was a national responsibility. He emphasized that the Pakistani nation can never forget the immense sacrifices of its martyrs and their families. \"I, along with the entire nation, am proud of our martyrs and their families\". The cabinet also prayed for the elevation of ranks of Major Adnan Aslam Shaheed in Jannah, who sacrificed his life in the Bannu Operation. The cabinet also offered condolences and prayers for the late mother of Federal Minister for Maritime Affairs, Junaid Anwar Chaudhry, the late elder brother of Minister of State for Food Security, Malik Rasheed Ahmad Khan, and the late father of former Senate Chairman Sadiq Sanjrani, Asif Sanjrani. The prime minister strongly condemning the illegal and heinous bombing by Israeli forces in Doha, which resulted in loss of innocent lives and damage to property, expressed deep sympathy and solidarity with the Emir of Qatar, the Qatari royal family, and the people of Qatar. Meanwhile, the cabinet approved, on the recommendation of the Ministry of Petroleum, the provision of RLNG connections to consumers waiting for gas connections. Following the approval, Sui Southern and Sui Northern Gas Companies will begin providing these connections. The cabinet was informed that RLNG will cost 30% less for consumers compared to LPG. The cabinet approved, the trilateral intergovernmental framework agreement for a joint feasibility study between Uzbekistan, Afghanistan, and Pakistan, based on the recommendation of the Ministry of Railways. The agreement, signed last month, is considered a key project for regional trade and connectivity. The cabinet's endorsement reaffirms the government's commitment to the completion of this strategic initiative. The cabinet also endorsed decisions made by the Economic Coordination Committee (ECC) of the Cabinet, Cabinet Committee on Inter-Governmental Commercial Transactions (CCoIGCT), and Cabinet Committee for Legislative Cases (CCLC).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}