{
  "title": "PM approves 2000MW solar power projects in public sector",
  "link": "https://www.app.com.pk/national/pm-approves-2000mw-solar-power-projects-in-public-sector/",
  "date_published": "2022-09-29T15:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): Prime Minister Shehbaz Sharif on Thursday principally approved the construction of solar power projects of 2000 megawatts in the public sector to generate low-cost and environment-friendly electricity.\nThe prime minister, who chaired a meeting to review progress on the installation of 10,000 megawatts solar projects across the country, said it would also reduce country’s dependence on power projects running on costly fuels also burdening the foreign exchange reserves.\nHe said that under the project, the agricultural tube wells would be converted to solar power on an urgent basis. The solar power projects would also help overcome the issues related to line losses, power theft, and circular debt.\nThe prime minister, who was given a detailed briefing on solar projects, told the meeting that the government would give sovereign-guarantee to the companies investing in the solar projects.\nThe meeting was told that an investors conference on solarisation was held on September 14 which was attended by local and international investor companies including from Saudi Arabia, United Arab Emirates, China and Qatar, which also expressed interest to invest in the sector.\nIt was told that work on the identification of suitable sites for solar power projects had been started. Such a site near Muzaffargarh has already been identified for the installation of 600MW solar power project.\nMoreover, the planning for the installation of 11KV solar-powered feeder is also underway.\nThe meeting was told that work on a framework and tariff on solar energy was in process with ongoing consultation between Power Division, Alternate Energy Development Board, Central Power Purchasing Company, NEPRA and other departments.\nThe prime minister directed the authorities concerned to further improve the timelines to ensure the injection of solar energy into the national grid.\nThe meeting was told that work on solarisation of government buildings was also being done on priority.\nFor the solarisation of tube wells, the prime minister formed a committee comprising National Food Security Minister Tariq Bashir Cheema, Secretary Power Division and a representative of the water resources ministry.\nFormer Prime Minister Shahid Khaqan Abbasi, Finance Minister Ishaq Dar, Commerce Minister Naveed Qamar, National Food Security Minister Tariq Bashir Cheema, Advisor to PM Ahad Cheema and Special Assistant to PM Jahanzeb Khan attended the meeting.",
  "retrievedAt": "2025-08-11T15:39:06.302Z"
}
