{
  "title": "Imran Khan’s irresponsible, conspiratorial narrative on ‘Cipher’ exposed before nation: Azam Nazeer Tarar",
  "link": "https://www.app.com.pk/national/imran-khans-irresponsible-conspiratorial-narrative-on-cipher-exposed-before-nation-azam-nazeer-tarar/",
  "date_published": "2022-09-29T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): Federal Minister for Law and Justice Azam Nazeer Tarar on Thursday said that former prime minister and Pakistan Tehreek-e-Insaf chairman Imran Khan’s irresponsible and conspiratorial narrative on Cipher had revealed before the nation.\nAddressing a press conference here, the minister castigated the PTI chief over yesterday’s audio leak.\n“The painful thing is, when you’re in high constitutional offices, more than the political interest, your oath makes you bound to take decisions in the greater national interest,” he said.\nHe said that Imran had played a dangerous game with the country.\nHe said that then principal secretary Azam Khan should have realized he was a state servant and not advanced a political party’s agenda.\nIt would have been much better if he (Azam) made Imran understand that this was not an issue that could be played with, instead he should have shut it down and told the Foreign Office to do whatever appropriate action since it was its domain, he added.\nTarar said that when the oath was taken as a member of Parliament or as a Prime Minister, they pledge that they would not give priority to personal interest over national interest, as a public office holder had to take important decisions in the wider national interest.\nHe said that Imran Khan’s conspiracy narrative had exposed before the people, Imran Khan preferred personal interest over national interest. The former prime minister took irresponsible behavior on the cipher issue, he added.\nThe Law Minister said that we should take such decisions which were in the interest of the state. The former prime minister played a dangerous game against the country’s interest, he added.\nHe said that Pakistan had a long history of diplomatic relations with America.\nHe said that the present government had not yet withdrawn the letter sent by the former prime minister to the Supreme Court to form a judicial commission to investigate the Cipher, but the Supreme Court did not consider it appropriate to take action after its decision.\nThe Law Minister said that the issue of audio leak was reviewed in detail in the meeting of the National Security Committee and the decisions and priorities regarding the future were determined.\nIn this regard, the government had formed a special committee headed by the interior minister. The committee would review these audio leaks and secret recordings, he added.\nHe said that the world was facing the challenge of cyber security as there were cyber security attacks in different ways. Pakistan is a responsible state and we have to move forward keeping balance between state laws and fundamental human rights, he added.\nHe said that legislation was the need of the hour in the context of modern technology, especially cyber security.\nAzam Nazeer said that state institutions had carried out an exercise to secure the Prime Minister Office security.\nHe said he some SOPs had been changed. It was a government responsibility as many sensitive matters were discussed in such places and there should be an environment where everyone should be 100 per cent satisfied that he was making national decisions in a secure environment, he added.\nTarar said that talks regarding a cleansing process were underway. He said that the government was mulling on steps that should be taken in the future.\nHe said that basic SOPs were already in place for sensitive buildings. Orders had further been given to make security measures effective and prevent any such breaches in the future, he added.",
  "retrievedAt": "2025-08-11T15:39:06.283Z"
}
