{
  "title": "COMSTECH Launches S&T Cooperation Program with Nigeria",
  "link": "https://www.app.com.pk/national/comstech-launches-st-cooperation-program-with-nigeria/",
  "date_published": "2022-09-29T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP):The Ministerial Standing Committee on Scientific and Technological Cooperation (COMSTECH) of the Organization of Islamic Cooperation on Thursday launched COMSTECH-Nigeria S&T Cooperation Program for capacity building of Pakistani and Nigerian nationals.\nOIC’s Standing Committee on Scientific and Technological Cooperation (COMSTECH) launched COMSTECH-Nigeria Science and Technology Cooperation Program today in a press conference. For more details https://t.co/zC0uNgkf1T.@OIC_OCI @OICatUN @NigeriaMFA @SciDipPak @PakinNigeria pic.twitter.com/W6A74klJiV\n— COMSTECH (@OIC_COMSTECH) September 29, 2022\nCoordinator General, COMSTECH, Prof. Dr M. Iqbal Choudhary and High Commissioner of Nigeria, Mohammed Bello Abioye jointly launched the program at COMSTECH Auditorium.\nThe High Commissioner of Nigeria appreciated the efforts of COMSTECH and offered full support from his office to COMSTECH-Nigeria S&T Cooperation.\nThe Government of the Federal Republic of Nigeria has constituted an inter-ministerial committee comprising Ministry of Science, Technology and Innovation, Ministry of Education, National Universities Commission, and National Agency for Science and Engineering Infrastructure to explore the implementation of the initiatives.\nThe Raw Materials Research and Development Council (RMRDC), Abuja, Nigeria will be the focal organization to implement the program.\nPakistan and Nigeria have also agreed on launching of Women Scientist Research Fellowship Program. Under this fellowship program, Nigerian women scientists will be selected and offered fellowships to conduct research in leading R&D institutions of Pakistan such as International Center for Chemical and Biological Sciences (ICCBS), Karachi, University of Lahore (UoL), NUST, and GIKI, etc.\nThe COMSTECH-Nigeria S&T Cooperation Program would also involve institution linkages between Nigeria and Pakistan will also be developed for collaborative research, exchange of knowledge and technology transfer.\nMoreover, capacity building of Nigerian scholars and students, launch of book consisting of joint research publications and patents of Pakistani and Nigerian scientists, industrial internship of Nigerian professionals in food processing and value addition, and study visit of Pakistani students to Nigeria would also be part of the program.",
  "retrievedAt": "2025-08-11T15:39:10.418Z"
}
