{
  "title": "Minister brush asides hearsay on caretaker nominations of cabinet",
  "link": "https://www.app.com.pk/national/minister-brush-asides-hearsay-on-caretaker-nominations-of-cabinet/",
  "date_published": "2023-07-24T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP): Federal Minister for Climate Change and Environmental Coordination, Senator Sherry Rehman Monday rebuked hearsay and fake information on various media outlets pertaining to nominations of caretaker setup.\nThe minister was flanked by Special Assistant to the Prime Minister (SAPM) Poverty Alleviation & Social Safety Faisal Karim Kundi here at the Pakistan Peoples Party (PPP) Secretariat to clarify media on propagated stories pertaining to the nominations of interim setup.\nSenator Rehman said there were many rumours proliferating on the reputed media outlets.\nShe clarified that the PPP had two clear views, one that there was no nomination shared with the party whereas SAPM Kundi also informed media in that regard.\nThe minister that no nominations were decided by the PPP leadership for interim cabinet and the Party had maintained its previous and constitutional stance.\n“There has been news circulating that PPP had completed the caretaker. It is visible that after the 18th Constitutional Amendment this process has been made transparent and inclusive whereas it engages all the parties including the opposition leader in the consultative process,” she said.\nThe minister said that there was no agreement on caretaker set up but rather it was a fake news.\nHowever, she said a three-member committee was constituted to hold consultations in this regard.\nShe urged the media to avoid perpetrating fake news. Senator Rehman underlined that her party had repeatedly demanded on time polls as it was important for the stability of the country.\nShe also mentioned that Co-Chairman PPP, Asif Ali Zardari, Foreign Minister Bilawal Bhutto Zardari and the entire leadership had been demanding to hold the general elections as per the constitution.\n“We expect a level playing field for all the political parties in the upcoming elections. However, there will be surely a consensus on the nomination of interim Prime Minister but it will take time. However, we are listening to all the parties at the moment,” she said.\nThe senator mentioned that Chairman PPP Bilawal Bhutto Zardari recently handed over property papers to women in flood affected areas as they were denied possession rights earlier in Sindh.\nShe said that the initiative was as per the vision of Shaheed Zulfiqar Ali Bhutto.\n“50,000 houses reconstruction have been approved and the process has started in the flood-affected areas. We have focused the most vulnerable and weak the women on top priority in flood rehab and reconstruction,” she added.\nThe minister said due to the heavy monsoon rains, from June 25, some 133 deaths had been reported in the country which was not more powerful than the previous one, however, national emergency was declared in lower, upper Dir, and Chitral.\nShe informed the government was in contact with the National Disaster Management Authority (NDMA) and it would like to review the damaged incurred to the house infrastructure as in KP some 388 houses got destructed whereas a total of 2,015 people injured.\nThe deaths recorded so far were 38 in KP, six in Balochistan, 65 in Punjab, 11 in ICT, five in AJK, and one in GB and a total of 245 livestock animals perished due to heavy monsoon rains and other disasters, the minister added.\nShe urged the tourists to take care while visiting the northern areas during monsoon and should stay in the urban areas so that someone could reach them for help in any emergency situation.\nThe government, she said had provided Rs 20 million to the provincial authorities to manage the national emergency in KP’s lower, upper Dir and Chitral areas.\nThe NDMA and PDMAs were active and the masses were advised to be aware of weak foundations and dilapidated walls as most of the deaths occurred due to collapse of weak walls.\nResponding to media queries, she said the Elections Act was pending in the Parliament’s committee and many of its clauses were under discussion whereas no unilateral decision would be allowed to usurp the constitutional mandate of the legislation.\n“We will demand a free and fair elections and the Constitution would be our plan A and in case of any maneuver the PPP will take precautionary measures and will brief media on it,” she added.",
  "retrievedAt": "2025-08-11T08:59:05.696Z"
}
