{
  "title": "Senate passes eight bills, refers others to relevant committees for review",
  "link": "https://www.app.com.pk/national/senate-passes-eight-bills-refers-others-to-relevant-committees-for-review/",
  "date_published": "2023-07-24T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP): The Upper House of Parliament approved eight bills and sent several others to relevant committees for further review and discussion during Senate proceedings on Monday.\nAdditionally, during the same session, several other bills were referred to relevant committees.\nThis move is part of the parliamentary procedure to ensure thorough consideration and detailed examination of these bills before they can be potentially passed into law.\nDuring Monday’s Senate proceedings, the Upper House of Parliament approved a series of bills, including The Horizon University Bill, 2023, which received unanimous support.\nSenator Hidayatullah presented this bill.\nAnother bill, titled Imam Bukhari International Islamic University Sialkot Bill 2023, was also successfully passed by the Senate, and Senator Professor Sajid Mir played a key role in its presentation.\nAdditionally, the Senate approved the National University of Security Sciences Islamabad Bill 2023, which was moved by Senator Rana Mehmood ul Hassan.\nFurthermore, the Contempt of Parliament Bill, 2023, was presented by Senator Kauda Babar and others, and it received the Senate’s approval.\nAmong the bills passed during the proceedings, the NFC Institute of Engineering and Technology Multan (Amendment) Bill, 2023, stood out, and credit for its presentation goes to Minister of Federal Education and Professional Training, Rana Tanveer Hussain.\nLastly, the Senate approved the Institute of Management Sciences and Technology Bill, 2023, which was presented by Senator Rana Maqbool Hussain.\nDuring the recent Senate session, Senator Bahramand Khan Tangi introduced The Code of Criminal Procedure (Amendment) Bill 2023, which was subsequently passed by the House.\nIn addition, Senator Saleem Mandviwalla presented the Pakistan Nursing Council (Amendment) Bill 2023, which received approval with certain amendments.\nMoreover, the Trade Organisation (Amendment) Bill 2023, moved by Federal Minister for National Health Services, Regulations, and Coordination, Abdul Qadir Patel, was also passed by the Senate, accompanied by amendments.",
  "retrievedAt": "2025-08-11T08:59:05.559Z"
}
