{
  "title": "Sherry exposes timber mafia’s role in illegal deforestation; urges action to protect Chitral’s environment, tourists",
  "link": "https://www.app.com.pk/national/sherry-exposes-timber-mafias-role-in-illegal-deforestation-urges-action-to-protect-chitrals-environment-tourists/",
  "date_published": "2023-07-24T18:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP): Minister for Climate Change and Environmental Coordination, Senator Sherry Rehman on Monday, addressed the pressing issue of floods caused by climate change, highlighting deforestation as a significant contributing factor.\nDuring the session, Pakistan Peoples Party’s Senator Rubina Khalid drew attention to the escalating deforestation in Chitral, Khyber Pakhtunkhwa, and Senator Sherry Rehman acknowledged receiving reports from reliable non-government organizations, indicating illegal tree cutting in the affected areas.\nThe minister exposed the involvement of a timber mafia operating in cahoots with certain government officials, engaging in the unlawful felling of trees.\nShe stressed the urgent need to thoroughly investigate and halt this illegal activity, emphasizing the detrimental impacts of deforestation on the environment.\nTo address this critical issue, she urged the formation of a fact-finding committee to take decisive action against the ongoing illegal deforestation in the region.\nFurthermore, she expressed concern about certain tourist resorts located perilously close to the river in Chitral. “While these resorts attract visitors, they also pose significant risks to the lives of tourists.”\nSherry firmly asserted that authorities must refrain from permitting any further constructions near the riverside, thereby ensuring the safety of tourists.\nIn response to Senator Rubina Khalid’s concerns, she advocated for the improvement of infrastructure in the region and called for an inquiry into the department responsible for granting permissions for constructions perilously close to the river, spanning from Swat to Kalam.\nThe government is now faced with the responsibility of taking immediate and appropriate measures to combat deforestation, protect the environment, and safeguard the lives of both the local populace and tourists in the picturesque region of Chitral.",
  "retrievedAt": "2025-08-11T08:59:02.435Z"
}
