{
  "title": "Pakistan to host 3rd D-8 Ministerial Meeting on Tourism Cooperation on August 4-5",
  "link": "https://www.app.com.pk/national/pakistan-to-host-3rd-d-8-ministerial-meeting-on-tourism-cooperation-on-august-4-5/",
  "date_published": "2023-07-24T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP):Pakistan will host the 4th D-8 Senior Officials Meeting and 3rd D-8 Ministerial Meeting on Tourism Cooperation for the first time in the country on August 4-5 at Bhurbhan, Murree.\nThe meeting, being organized by the Pakistan Tourism Development Corporation (PTDC), will be followed by the technical visit to the Federal Capital on August 6.\nIt was decided in the 2nd D-8 Ministerial Meeting held in Malaysia in 2019 that Pakistan will host the 3rd D-8 Ministerial Meeting preceded by 4th D-8 Senior Officials Meeting. However, the meeting was postponed in 2021 due to the Covid-19 pandemic.\nAwn Chaudhry, Advisor to the Prime Minister on Tourism & Sports / PTDC Chairman, called on the Secretary General of D-8 Secretariat in March and decided to organize the meeting later this year.\nThe advisor, while chairing an inter-ministerial meeting here on Monday on the preparation and organization of the D-8 Ministerial Meeting, said it was aimed at promoting Pakistan’s tourism potential and exploring tourism trade opportunities of the member states.\nThe meeting could also open new avenues of socio-economic development, he added.\nThe objective of this meeting is to identify potential pathways (incentives and initiatives) to enhance intra D-8 tourism in line with the objectives and goals of D-8; to bring together tourism experts of member states to strengthen their capacities and develop effective strategies for the post COVID-19 tourism era; to provide a platform for member states to exchange knowledge and best practices to facilitate cooperation opportunities, and to explore possibilities to promote bilateral tourism among the member states.\nThe D-8 (Developing Eight) organization for economic cooperation is an inter-governmental organization which was established in 1997. It comprises eight developing countries, namely Bangladesh, Egypt, Indonesia, Iran, Malaysia, Nigeria, Pakistan and Turkiye.",
  "retrievedAt": "2025-08-11T08:59:10.041Z"
}
