{
  "title": "Commonwealth Secretary-General confers Rana Mashhood as “Commonwealth Year Youth Champion”",
  "link": "https://www.app.com.pk/national/commonwealth-secretary-general-confers-rana-mashhood-as-commonwealth-year-youth-champion/",
  "date_published": "2024-08-02T06:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP): Commonwealth Secretary-General RT Patricia Scotland on Friday conferred the “Commonwealth Year Youth Champion” award to the Chairman of Prime Minister Youth Programme Rana Mashhood Ahmed Khan for his unwavering commitment and hard work to empowering youth.\nWhile inaugurating the Exhibition and Launching of the Prime Minister Youth Programme(PMYP) initiatives ceremony here at the Prime Minister’s office,RT Patricia Scotland said that Rana Mashhood has done an outstanding job in providing opportunities, resources and support to the youth and taking crucial steps for empowering youth through various initiatives and programmes.\nRecognizing the services of Chairman PMYP, she expressed her gratitude to Rana Mashhood by calling three times Hip; Hip; Yeh, Yeh as per Commonwealth traditions.\nShe said that the commonwealth distinguishes the courage and determination of the PMYP team for the country’s youth as young people are the driving force to bring a change.\nThe Commonwealth Secretary-General inaugurated the six initiatives of the PMYP by pressing the button including Commonwealth Asia Youth Alliance, Digital Learning Portal, LOGO for National Volunteer Corps, AI education programme in collaboration with British Council and Intel corporation and setting up of Commonwealth Youth Parliamentary Forum.\nEarlier speaking on the occasion, the Chairman PMYP Rana Mashhood acknowledged the love and passion of the Commonwealth Secretary-General Patricia Scotland for Pakistan and for strengthening the relations with the Commonwealth.\nHe said that the mutual interest between Pakistan and the Commonwealth will help promote cooperation in various fields of youth development programmes.\nThe PMYP’s Chairman emphasised the potential of Pakistani youth and highlighted the initiatives originated by the Youth Program to promote their growth.\nIn the end, RT Patricia Scotland awarded Rs 100,000 prize to the winner of the National Volunteer Corps Logo designer Miss Aqsa from Baluchistan while Prime Minister motivational awards were given to students of various educational institutions on their outstanding performance in different fields.\nChairman PMYP Rana Mashhood also presented souvenirs to the Commonwealth General Secretary RT Patricia Scotland for her services for the betterment of the countries of the Commonwealth and Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:19:50.508Z"
}
