{
  "title": "Senate body reviews regulatory performance, emphasizes accountability",
  "link": "https://www.app.com.pk/national/senate-body-reviews-regulatory-performance-emphasizes-accountability/",
  "date_published": "2024-08-02T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP):The Senate Standing Committee on Cabinet Secretariat on Friday reviewed the regulatory performance, emphasized the accountability and legislative reforms in various departments to get desirous results.\nThe meeting was presided over by Senator Rana Mehmood-ul Hassan. Senator Saifullah Sarwar Khan Nyazee, Senator Mohammad Abdul Qadir, Senator Jam Saifullah Khan, the Secretary of the Cabinet Division, the Chairman of the National Electric Power Regulatory Authority (NEPRA), senior officials from the Oil & Gas Regulatory Authority (OGRA), Ministry of Interior and other affiliated departments were present on the occasion, said a press release.\nThe meeting commenced with a briefing on the functional structure of the National Electric Power Regulatory Authority (NEPRA), its mandate, the formation of its authority, and its regulatory values.\nThe officials, while reporting on the principles of regulation, emphasized that their focus is to ensure regulation is consistent, transparent, and open to the general public.\nData on NEPRA’s performance over the last three years was also presented to the committee members.\nThe officials presented information on tariff determinations, adjustments, and transmission service charge components.\nSenator Mohammad Abdul Qadir recommended that NEPRA provide a special briefing on the power sector, as the lack of accountability could lead to unrest in the country.\nSenator Saifullah Khan Nyazee advised that an audit report be provided to the committee members, and a forensic audit of the IPPs was unanimously recommended.\nThe Chairman of the Committee, Senator Rana Mehmood ul Hassan, advised the officials to come up with solutions, as the entire nation bears the brunt of inefficiency in tariff monitoring.\nHe also suggested that the officials ensure accountability in the determination of tariffs and report on the authority responsible for overseeing this matter.\nAdditionally, senior officials from the Oil and Gas Regulatory Authority (OGRA) briefed the committee members on its operations and performance.\nThe meeting also covered the outlook for oil and gas licensees and complaint resolution.\nSenator Mohammad Abdul Qadir suggested that OGRA should enhance legislation by implementing area responsibility.\nThe committee members expressed serious concern over the loss of precious life caused by the cylinder blast.\nThey recommended increasing the penalties and fines for unauthorized cylinder manufacturing.\nFurthermore, the committee members advised the Interior Ministry to produce a report within one week on the legislative aspects related to the incident.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:19:38.321Z"
}
