{
  "title": "27 outlaws held; drugs, weapons seized",
  "link": "https://www.app.com.pk/national/27-outlaws-held-drugs-weapons-seized/",
  "date_published": "2024-08-02T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP):The Islamabad Capital Police (ICP) apprehended twenty-seven outlaws from different areas of the city during the last 24 hours and recovered drugs and weapons from their possession.\nA police spokesman said on Friday that responding to the special directions of Inspector General of Police (IGP) Islamabad Syed Ali Nasir Rizvi, the Islamabad Police intensified crackdown against the criminal elements to eliminate crime from the city.\nThe Secretariat police team arrested an accused namely  Zahir Abbas and recovered one 30-bore pistol from his possession, while police team arrested two accused namely Atif Khan and Naqib Ullah involved in illegally selling petrol.\nThe Sumbal police team arrested an accused namely Abdullah and recovered one 30-bore pistol from his possession, while the police team arrested an accused Muhammad Ikram involved in illegally selling petrol.\nLikewise, the Ramna police team arrested an accused namely Muhammad Javed and recovered 247 grams hashish from his possession.\nThe Noon police team arrested an accused namely Ameer Haider and recovered one 12 bore gun from his possession.\nThe Shams Colony police team arrested an accused namely Nasib and Zoheb and recovered one pistol and 80 litres of liquor from their possession.\nSimilarly, the Khanna police team arrested four accused namely Muhammad Atiq, Muneeb Zulfiqar, Muhammad Ansar and Waqas and recovered 800 grams hashish, 300 grams heroin and one 30 bore pistol from their possession.\nThe Sihala police team arrested an accused Faisal Rehan and recovered 210 grams hashish from his possession.\nFurthermore, the Humak police tram arrested an accused namely Waqar involved in illegally selling petrol.\nThe Bani Gala police team arrested an accused namely Shahbaz and recovered 180 grams heroin from his possession.\nCases have been registered against the nabbed accused and further investigation is underway.\nDuring the crackdown against proclaimed offenders and absconders, the Islamabad Police teams arrested eight absconders and targeted offenders from various areas of the city.\nDIG Islamabad Syed Ali Raza directed the police officials to further intensify the crackdown against the criminal elements. “Safety and security of the citizens is our foremost priority and no laxity will be tolerated in this regard”.\nCitizens are urged to cooperate with police and report any suspicious activity or information through the emergency helpline “Pucar-15” or the “ICT-15”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:19:14.603Z"
}
