{
  "title": "Public, tourists asked to download ‘PAK NDMA-Disaster Alert’ app for real-time weather updates",
  "link": "https://www.app.com.pk/national/public-tourists-asked-to-download-pak-ndma-disaster-alert-app-for-real-time-weather-updates/",
  "date_published": "2024-08-02T08:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): As the country braces for another monsoon spell of severe weather, Zahra Hassan, Team Lead Manager at the National Disaster Management Authority (NDMA) Friday urged citizens to take proactive measures to ensure their safety and asked them to download ‘Pak NDMA Disaster Alert app for real-time weather updates.\nTalking to a private news channel, she explained that this app was being designed for early warning alerts and Community engagement, adding that it enables NDMA, PDMA and DDMAs to provide timely risk communication through necessary information and critical alerts before disasters.\nShe said it also features regular Updates during and after emergencies, adding, developed with the primary goal of enhancing public safety and awareness, this application is serving as a vital tool to keep users especially tourists informed and prepared in the face of various crises.\nResponding a query, she said the NDMA alert warns that torrential rains which will continue till August 15 and can lead to urban flooding in low-lying areas including AJK, Lahore, Rajanpur, Malakand, Sheikhupura, Kasur, Sialkot, Sargodha, Hyderabad Faisalabad, Multan, Sahiwal, Nowshera, and Peshawar.\nAdditionally, heavy rains may further cause an increase in water levels in rivers of Chinab and Ravi, she added.\nShe said the National Disaster Management Authority (NDMA) is closely monitoring the situation and issuing regular advisories to ensure public safety during the monsoon season.\nWith the ‘PAK NDMA-Disaster Alert’ app, the authority is providing real-time updates on weather forecasts, flood\nwarnings, and other disaster-related information to help citizens make informed decisions, she added.\nNDMA’s dedicated team is working around the clock to track weather patterns, monitor water levels, and coordinate with provincial authorities to respond swiftly to emerging situations, she highlighted.\nBy issuing timely advisories, NDMA aims to minimize the impact of natural disasters, reduce risk to life and property, and promote a culture of disaster preparedness and resilience across the country.\nResponding to another query, Zahra Hassan revealed that the NDMA had identified flood-prone areas in March, demonstrating the authority’s proactive approach to disaster management.\n‘We did not wait for the monsoon season to arrive; we anticipated the risks and took proactive measures,’ she\nexplained.\nShe mentioned that to ensure strong coordination and unified response, the NDMA initiated the Provincial Coordination Forum, bringing together stakeholders from provincial authorities, emergency services, and other relevant agencies.\nThis collaborative platform enables real-time information sharing, resource mobilization, and swift decision-making, ensuring a robust and effective response to potential floods, she added.\nBy identifying vulnerable areas and fostering strong coordination, the NDMA has laid a solid foundation for mitigating the impact of floods and protecting communities at risk, she concluded.",
  "retrievedAt": "2025-08-11T04:19:26.191Z"
}
