{
  "title": "BISP pivotal role in crisis caused by climate change acknowledged",
  "link": "https://www.app.com.pk/national/bisp-pivotal-role-in-crisis-caused-by-climate-change-acknowledged/",
  "date_published": "2024-08-02T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 02 (APP):Chairperson of the Senate Standing Committee on Climate Change and Environmental Coordination, Sherry Rehman Friday acknowledged the role of Benazir Income Support Programme (BISP) during the crisis caused by climate change and disasters.\nDuring her visit to the BISP headquarters, Senator Sherry Rehman praised BISP’s achievements, describing it as a success story for Pakistan.\nShe underscored the importance of international partnerships and maintaining strong relationships with donor organizations for the continued support and well-being of BISP beneficiaries.\nEarlier, Sherry Rehman was briefed on BISP’s core initiatives, with a special emphasis on its role in addressing the crises caused by climate change and natural disasters.\nEarlier, speaking on the occasion, Chairperson BISP, Senator Rubina Khalid along with Additional Secretary Dr. Muhammad Tahir Noor, provided an overview of BISP’s crucial interventions, particularly during the devastating floods of 2022.\nThey highlighted that BISP was the first to reach flood-affected communities across the country through its dynamic database, disbursing Rs. 70 billion to 2.7 million families in need.\nSenator Rubina Khalid also discussed BISP’s proactive measures to handle emergencies caused by climate change.\nShe introduced the Hybrid Social Protection Scheme, designed to promote savings culture among beneficiaries, ensuring they are better prepared for unforeseen climatic events.\nAdditionally, Senator Rubina Khalid shared BISP’s ongoing efforts to implement a transparent payment mechanism in consultation with the State Bank, following the directives of President Asif Ali Zardari.\nThis initiative aims to enhance transparency and uphold the dignity of women beneficiaries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:19:38.337Z"
}
