{
  "title": "Apple to open up underlying AI technology to developers - World - DAWN.COM",
  "author": null,
  "content": "Apple said on Monday it will open up the underlying technology it uses for Apple Intelligence and announced an overhaul of its operating systems.\n\nThe tone and content of the presentations at its annual Worldwide Developers Conference (WWDC) focused more on incremental developments, including live translations for phone calls, that improve everyday life rather than the sweeping ambitions for AI that Apple’s rivals are marketing.\n\nApple software chief Craig Federighi said the company is opening up the foundational AI model that it uses for some of its features to third-party developers.\n\n“This work needed more time to reach our high-quality bar,” Federighi, senior vice president of software engineering, said of the delays of some features, such as improvements to the Siri virtual assistant.\n\nIn an early demonstration of how partners could improve Apple apps, the company added image generation from OpenAI’s ChatGPT to its Image Playground app, saying that user data would not be shared with OpenAI without a user’s permission.\n\nApple is facing an unprecedented set of technical and regulatory challenges as some of its key executives kicked off the company’s annual software developer conference on Monday.\n\nShares of Apple, which were flat before the conference, slipped 1.5 per cent after executives took the stage in Cupertino, California.\n\nFederighi also said Apple plans a design overhaul of all of its operating systems.\n\nApple’s redesign of its operating systems centred on a design it calls “liquid glass”, where icons and menus are partially transparent, a step Apple executives said was possible because of the more powerful custom chips in Apple devices versus a decade ago.\n\nFederighi said the new design will span operating systems for iPhones, Macs and other Apple products.\n\nHe also said Apple’s operating systems will be given year names instead of sequential numbers for each version.\n\nThat will unify naming conventions that have become confusing because Apple’s core operating systems for phones, watches and other devices kicked off at different times, resulting in a smattering of differently numbered operating systems for different products.\n\nIn other new features, Apple introduced “Call Screening”, where iPhones will automatically answer calls from an unknown number and ask the caller the purpose of their call. Once the caller states their purpose, the iPhone will show a transcription of the reason for the call, and ring for the owner.\n\nApple also said it will add live translation to phone calls, as well as allow developers to integrate its live translation technology into their apps.\n\nApple said the caller on the other end of the phone call will not need to have an iPhone for the live translation feature to work.\n\nApple’s Visual Intelligence app, which can help users find a pair of shoes similar to ones at which they have pointed an iPhone camera, will be extended to analysing items on the iPhone’s screen and linked together with apps.\n\nApple gave an example of seeing a jacket online and using the feature to find a similar one for sale on an app already installed in the user’s iPhone.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0923230214a1128.jpg",
  "retrievedAt": "2025-08-20T03:50:07.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916112/apple-to-open-up-underlying-ai-technology-to-developers",
  "dateList": "2025-06-09",
  "date_published": "2025-06-09T18:25:44.000Z"
}
