{
  "title": "Los Angeles police order immigration protesters downtown to go home - World - DAWN.COM",
  "author": null,
  "content": "Police declared all of downtown Los Angeles to be an unlawful assembly area and ordered protesters to go home on Sunday night after a third day of demonstrations against President Donald Trump’s immigration policy that sometimes included burning cars and hurling bottles at officers.\n\nNational Guard troops, deployed by Trump over the weekend to help quell the protests in a move that California Governor Gavin Newsom called unlawful, guarded federal government buildings on Sunday.\n\nThe unrest in Los Angeles has become a flashpoint in Trump’s signature effort to clamp down on illegal immigration.\n\nThe Republican president has pledged to deport record numbers of people who are in the country illegally and to lock down the US-Mexico border, setting the Immigration and Customs Enforcement (ICE) border agency a daily goal of arresting at least 3,000 migrants.\n\nCalifornia state and local officials, mainly Democrats, accuse Trump of inflaming initially small-scale protests by mounting a federal response. He calls the protesters insurrectionists.\n\nSeveral self-driving cars from Alphabet’s Waymo were set ablaze on a downtown street on Sunday evening.\n\nLos Angeles police said some protesters had thrown concrete projectiles, bottles and other items at police. Police declared several rallies to be unlawful assemblies and later extended that to include the whole downtown area.\n\nPolice on horseback tried to control the crowds. Some officers used flash-bang grenades and tear gas, CNN reported.\n\nDemonstrators shouted “Shame on you!” at police and some appeared to throw objects, video images showed. One group blocked the 101 Freeway, a downtown thoroughfare.\n\nCity Police Chief Jim McDonnell told a media briefing on Sunday evening that people had a right to protest peacefully, but the violence he had seen by some was “disgusting” and the protests were getting out of control.\n\nPolice said they had arrested 10 people on Sunday and 29 the previous night, adding that arrests were continuing.\n\nNewsom, a Democrat, said he requested the Trump administration withdraw its order to deploy 2,000 National Guard troops in Los Angeles County, calling it unlawful.\n\nNewsom said in a post on X on Monday that he planned to sue the administration over the deployment.\n\n“This is exactly what Donald Trump wanted. He flamed the fires and illegally acted to federalise the National Guard. The order he signed doesn’t just apply to CA. It will allow him to go into any state and do the same thing,” Newsom said, using California’s abbreviation. “We’re suing him.”\n\nIn response, White House press secretary Karoline Leavitt posted on X that “Newsom did nothing as violent riots erupted in Los Angeles for days.”\n\nAsked if the National Guard was needed, the police chief, McDonnell, said police would not “go to that right away,” but added, “Looking at the violence tonight, I think we’ve got to make a reassessment.”\n\nIn a social media post, Trump called on McDonnell to do so. “He should, right now!!!” Trump added. “Don’t let these thugs get away with this. Make America great again!!!”\n\nThe White House disputed Newsom’s characterisation, saying in a statement, “Everyone saw the chaos, violence and lawlessness.”\n\nEarlier on Sunday, about a dozen National Guard members, along with Department of Homeland Security personnel, pushed back a group of demonstrators outside a federal building in downtown Los Angeles, video showed.\n\nThe US Northern Command said 300 members of the California National Guard had been deployed to three spots in the Los Angeles area.\n\nHomeland Security Secretary Kristi Noem told CBS programme ‘Face the Nation’ that the National Guard would provide safety around buildings to people engaged in peaceful protest and to law enforcement.\n\nThe Trump administration’s immigration enforcement measures have also included residents who are in the country legally, some with permanent residence, spurring legal challenges.\n\nIn a social media post on Sunday, Trump called the demonstrators “violent, insurrectionist mobs” and said he was directing his cabinet officers “to take all such action necessary” to stop what he called riots.\n\nDespite Trump’s language, he has not invoked the Insurrection Act, an 1807 law that empowers a president to deploy the US military to suppress events such as civil disorder. Asked on Sunday whether he was considering doing so, he said, “It depends on whether or not there’s an insurrection.”\n\nDefence Secretary Pete Hegseth said on Saturday the Pentagon is prepared to mobilise active-duty troops “if violence continues” in Los Angeles, saying Marines at nearby Camp Pendleton were on high alert.\n\nLos Angeles Mayor Karen Bass blamed the Trump administration for inciting tension by sending in the National Guard. She also condemned protesters who became violent.\n\n“I don’t want people to fall into the chaos that I believe is being created by the administration completely unnecessarily,” she told a press conference.\n\nVanessa Cardenas, head of the immigration advocacy group America’s Voice, accused the Trump administration of “trumping up an excuse to abuse power, and deliberately stoke and force confrontations around immigration.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/09200523a977c63.jpg",
  "retrievedAt": "2025-08-20T03:50:09.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916065/los-angeles-police-order-immigration-protesters-downtown-to-go-home",
  "dateList": "2025-06-09",
  "date_published": "2025-06-09T06:33:17.000Z"
}
