{
  "title": "3 terrorists killed, one cop martyred in gun battle with Lakki Marwat police, local peace committee - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three terrorists were killed in Lakki Marwat’s Kot Kashmir on Wednesday in a gun battle with the police and local peace committee in which a cop was also martyred.\n\nThe incident reflects the escalating militant presence in Khyber Pakhtunkhwa’s Lakki Marwat district, where attacks have become more frequent in recent months despite ongoing efforts by local peace committees to maintain order and resist terrorist influence.\n\n“In the exchange of fire, three Khawarij, including a key local terrorist, Commander Chhota Waseem Gundi Khankhel, were killed,” a statement by Lakki Marwat police spokesperson Shahid Marwat said.\n\nFitna Al Khawarij is the state-designated term for the banned Tehreek-i-Taliban Pakistan (TTP).\n\n“Policeman Shahidullah Gundi Khankhel was seriously injured and was sent to the District Headquarters Hospital, where he was embraced martyrdom while succumbing to his injuries on the way,” the statement continued.\n\nKP Inspector General of Police Zulfiqar Hameed praised the courage and bravery of the Lakki Marwat police, the statement said.\n\nHe also paid tribute to the patriotic spirit of the brave people of Lakki Marwat, who are standing by their police to cleanse their area from the Fitna al-Khawarij. He further announced cash rewards and certificates of appreciation for this successful operation.\n\nThe police received information that some terrorists were going from Gundi towards Kot Kashmir.\n\nOn the instructions of Bannu Regional Police Officer Sajjad Khan and District Police Officer Lakki Marwat Jawad Ishaq, the local police and peace committee chased the terrorists.\n\nPolice and local peace committees came face to face with Fitna-ul-Khawarij terrorists at Kot Kashmir, during which the latter opened fire.\n\nDuring this, there was a fierce exchange of fire between the police and the terrorists, in which one terrorist was killed on the spot, while two terrorists entered a house and tried to use the women and children in the house as shields, the police said.\n\n“However, the police surrounded the house and continued the fight with great skill, which lasted for two hours. At the same time, the police strategically took out the women and children trapped in the house and continued the fight with the terrorists there and killed them,” the statement said.\n\nThe police also recovered weapons and ammunition from the possession of the terrorists.\n\n“One of the killed terrorists was officially confirmed as a major terrorist commander, Chhota Waseem. The slain terrorist commander was wanted by the police for terrorist operations, while the formal identity of the other two slain terrorists is being confirmed,” the statement concluded.\n\nIn April, the killing of an elderly man and the injuring of his two relatives and a neighbour by terrorists sparked a fierce gun battle between the assailants and members of a local peace committee in the Begukhel area of Khyber Pakhtunkhwa’s Lakki Marwat district, according to police.\n\nLast month, the police and CTD commandos launched a joint operation against terrorists in rural areas of the district.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:50:08.832Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916076/3-terrorists-killed-one-cop-martyred-in-gun-battle-with-lakki-marwat-police-local-peace-committee",
  "dateList": "2025-06-09",
  "date_published": "2025-06-09T10:32:02.000Z"
}
