{
  "title": "FIO plays vital role in providing free-of-charge, prompt justice to complainants: President Alvi",
  "link": "https://www.app.com.pk/national/fio-plays-vital-role-in-providing-free-of-charge-prompt-justice-to-complainants-president-alvi/",
  "date_published": "2021-11-13T10:58:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 13 (APP): Appreciating the performance of Federal Insurance Ombudsman (FIO), President Arif Alvi said that the FIO played a significant role in providing free-of-charge and prompt justice to the complainants against the injustices done to them. It had settled a large number of Complaints amicably with consent of both parties i.e. insurance policy holders and insurance companies.\nAddressing the seminar titled “Importance of Transparency in Insurance Sector” organized by Federal Insurance Ombudsman here at Governor House, on Saturday, he apprised that last year, FIO has provided the monetary relief worth of Rs.410 million to complainants and this year figure of the monetary relief registered an increase to Rs.2.13 billion. This figure of monetary relief is expected to rise to Rs.2.30 billion in next year, he told.\nThe success of the FIO in providing speedy and cost-free justice to complainants caused a rise in registration of complaints by 50% when compared it with last year, he said, adding disposal of the complaints was 90%. Of total registered, more than 90% of cases were being handled within 60 days, the President recounted. Besides, the FIO has handled the issue of mis-selling wisely.\nExpressing concerns over the low awareness among the public about ombudsman, Alvi mentioned that hardly, 4 to 5% of people were aware about the ombudsman and emphasized the need for creating awareness through media about the services being provided by the institution for the relief of the complainants.\nRealizing the potential of insurance sector, the president informed that the agriculture sector should be focused as insurance companies should develop products for this sector. More than 60% of people are associated with this sector and they should be covered under insurance plans.\nOn the risk factors, he said that the risk sharing was very important and it should be shared among stakeholders. As the government has introduced health card to cover or share the risks.\nOn the scams, he told that banks should aware the public through the sms and calls about the scams, saying that the scammers were minting money through different techniques.\nAssuring the Federal Insurance Ombudsman of his full support and cooperation in the performance of his duties, the president underscored the need for further intensifying the efforts by the Ombudsman to provide maximum relief to the aggrieved policyholders against the malpractices.\nFederal Insurance Ombudsman, Dr Muhammad Khawar Jameel said the contribution of insurance sector to the national GDP is low and efforts were taken to increase its contribution to national exchequer.\nHe said that a major chunk of complaints was relating to Bancassurance, adding that a bank manager has become a sales agent of insurance policies under the scheme, which is not part of his job description. It is also highly unfortunate that a bank manager misstates facts to banking customers regarding the insurance schemes to trap innocent customers.\nHe said he has approached to the Securities & Exchange Commission of Pakistan (SECP), State Bank of Pakistan (SBP) and Pakistan Banks’ Association to take stock of the situation and save policyholders from fraudulent activities\nLater, President Alvi handed over the claim settlement cheques to the complainants.",
  "retrievedAt": "2025-08-11T21:36:01.935Z"
}
