{
  "title": "Sania starts tour of 30 cities to register retailers in Ehsaas Rashan Riayat",
  "link": "https://www.app.com.pk/national/sania-starts-tour-of-30-cities-to-register-retailers-in-ehsaas-rashan-riayat/",
  "date_published": "2021-11-13T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Creating awareness among masses on Ehsaas Rashan programme, Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar visited six small cities and towns along the G. T. Road.  She went to Rawat, Mandra, Gujjar Khan, Sohawa, Dina and Jhelum.\nThe visit aimed to guide Kiryana merchants in small areas about the Ehsaas Rashan enrollment process and the programme modalities. “This week, I shall visit 30 small cities to speak to Kiryana retailers and the public. This is important to guide people on the ground about the new programme, encourage them to participate in the programme and factor in their voices in the delivery”, commented Dr. Sania.\nDuring the visit, Dr. Sania walked in the mini markets on the G. T. Road and met with the Kiryana merchants, local trader associations and public.\nShe herself enrolled several Kiryana owners on the portal at various sites. Dr. Sania was accompanied by senior officials of National Bank of Pakistan (NBP), Ehsaas and district administrations of Rawalpindi and Jhelum.\nShe also spoke to local trader associations and youth in the rural suburbs of Rawalpindi and Jhelum and made an appeal to them to help Kiryana merchants and low-income families in online registration.\nThe portal can be accessed online at: https://ehsaasrashan.pass.gov.pk/. With the opening of the portal, Dr. Sania had also released an instructional video on the Ehsaas Rashan registration and execution.\nThe video can be watched on the ‘Ehsaas Official’ channel on YouTube. Dr. Sania also held a series of media briefings with local press and electronic media at each of the visited sites.\n“Along with the deserving families, the Ehsaas Rashan portal also registers Kiryana retailers nationwide including home based Kiryana enterprises. It is compulsory for the Karyana merchants to have a bank account. Kiryana retailers without bank accounts can open their bank accounts in any branch of NBP”, said Dr. Sania.\nAt the NBP branch in Jhelum, she also joined a meeting with local Kiryana retailers, local media and NBP team. She briefed that the authorized Kiryana retailers having bank accounts will download ‘mobile Point of Sale’ (mPOS) App in their cell phones through which they will be able to ascertain the eligibility of the eligible buyers to deliver the subsidy.\nShe also informed that the government would give 5-8% commission to Kiryana retailers on Ehsaas’ subsidy amount and there will also be a quarterly lucky draw to give away cars, motorcycles, mobile phones and various other prizes to best Kiryana performers.\nUnder the Ehsaas Rashan programme, a subsidy of Rs. 1,000 a month will be granted to 20 million eligible families on the purchase of flour, pulses, cooking oil. Per unit purchase, a 30% subsidy will be given on these three commodities.\nIn the current fiscal year, the budget of the programme for the next six months is Rs. 120 billion under the federal-provincial cost sharing arrangement.",
  "retrievedAt": "2025-08-11T21:35:58.599Z"
}
