{
  "title": "CM KP visits Karak, inaugurates projects",
  "link": "https://www.app.com.pk/national/cm-kp-visits-karak-inaugurates-projects/",
  "date_published": "2021-11-13T10:52:00.000Z",
  "source": "APP",
  "content": "KARAK, Nov 13 (APP): The Chief Minister Khyber Pakhtunkhwa Mahmood Khan Saturday visited southern district Karak and inaugurated several development projects worth billions of rupees that include gas network, supply of clean drinking water, construction of new colleges and roads.\nThe Chief Minister inaugurated the project for rehabilitation and expansion of the gas network in gas producing districts. The project will be completed at a cost of Rs 9 billion. After the completion of the said project, it would provide gas to 257 villages in these districts.\nChief Minister Khyber Pakhtunkhwa during his visit to the southern district Karak also laid the foundation stone of Gravity Water Supply Scheme for Karak.\n” The project will be completed at a cost of Rs. 173 million. Completion of the project will provide clean drinking water to 91,000 people,” the Chief Minister said during the inauguration ceremony.\nTo provide best education facilities to the youth of the areas and on demand of the local people, Mahmood Khan also inaugurated the new building of Commerce College. The building has been constructed at a cost of Rs. 31 million.\nThe Chief Minister also laid the foundation stone for construction of a bypass road. The 9 km long road will be completed at a cost of Rs 2.8 billion. He laid the foundation stone for black topping of a 5 km road in the area and the project would be completed at a total cost of Rs. 11 million.\nThe Chief Minister also laid the foundation stone of four other projects for providing clean drinking water to the people and completion of these projects will cost a total of Rs. 440 million. These projects will provide clean drinking water to a population of about 1.5 million people in the areas.",
  "retrievedAt": "2025-08-11T21:36:02.630Z"
}
