{
  "title": "PDM, a bunch of politically abandoned persons: Fawad",
  "link": "https://www.app.com.pk/national/pdm-a-bunch-of-politically-abandoned-persons-fawad/",
  "date_published": "2021-11-13T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP):Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain Saturday said that Pakistan Democratic Movement (PDM) is a bunch of politically abandoned leaders having prime aim to deceive the masses.\nCommenting on the speech of Maulana Fazlur Rehman in PDM rally, the minister said these politically unemployed leaders have become insolvent after miserable failure of their various protest plans such as plan A,B and C to topple the government.They can do nothing but only issue statements.\nHe recalled that PDM had issued such statements against the government before failed attempt to dislodge the government.\nMaulana Fazlur Rehman had ended his party’s sit-in against the government on Nov 13, 2019, after a failure.PDM and Maulana Fazlur Rehman have lost their senses after successive failures.\nThe people had not been deceived by Fazl before and will not pay heed to Maulana’s adventures in future also. The minister advised the Maulana to try his luck of holding protest demonstrations against government in winter also.Despite repeated setbacks and failures, he said the PDM still wanted to hamper the country’s development and prosperity. However the opposition would never succeed in their nefarious designs.\nHe said PDM has no role left in the politics of the country as Prime Minister Imran Khan has completely exposed the true nature of the corrupt gang.\nThe minister said whether it’s a long march, a short march or a quick march, government don’t care about such marches.Opposition is trying to save their sinking politics by starting protest demonstrations.\nPDM Chief Maulana Fazlur Rehman has already attempted various failed such long and short marches.Fazlur Rehman’s key to join every government has become rusty.\nThe minister advised PDM to wait for election for two years and then wait for five more years as Imran Khan is poised to form the next government also after winning next general elections.\nThe opposition is leaning on each other’s shoulders to save their theft, he said adding that interestingly the opposition had already stabbed each other in the back before.\nHe said the entire nation has unshakable faith in the leadership of Prime Minister Imran Khan and all and sundry is united under Imran’s leadership.",
  "retrievedAt": "2025-08-11T21:35:58.579Z"
}
