{
  "title": "PTI govt to complete its tenure: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/pti-govt-to-complete-its-tenure-sheikh-rashid-2/",
  "date_published": "2021-11-13T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Minister for Interior, Sheikh Rashid Ahmed Saturday said the present government of Pakistan Tehreek-e-Insaf (PTI) would complete its tenure and expressed the confidence that it will also return again for the next tenure.\nTalking to the media, the minister said that opposition parties were in a state of disappointment and stress as against their wishes, the present government was successfully running the state affairs.\nHe said that the government had already completed its three and half year tenure while the opposition need further warm-up time.\nSheikh Rashid said, “The opposition has been saying since last year that PTI is going to lose power, but it should clear any misunderstanding about the government. Prime Minister Imran Khan is so lucky to have got such incompetent and ineffective opposition.”\nHe said the present opposition had no vision to understand the prevailing situation and they had selected the wrong time for holding rallies and protests. “They already lost their time and now they will get nothing but to spoil their and our time. Islamabad Police will not take any action against peaceful protests.”\nHe fully endorsed the idea of using electronic voting machines (EVMs) as Prime Minister said that this device will resolve the issue of mistrust in the electoral system, he added.\nHe said that the agreement with Tehreek-e-Labbaik Pakistan will be public soon. “I was part of the first round of talks on the wishes of Saad Rizvi.” He said that the government had revoked the TLP’s proscribed status on the recommendation of the government of Punjab.\nHe said the issue of inflation was connected with the changing international economic situation as no one in the government wants inflation in the country. He said the government was taking sincere steps to control inflation and making a change in the life of the common man.\nHe said that police are a frontline force and added that it is necessary to keep the morale of police high. He directed the police officials of ICT to boost the morale of their subordinates which is also necessary for improving the performance of the police.\nHe said that efforts were being made to include additional 1,000 policemen in Islamabad Police.He added Islamabad Capital Territory (ICT) Police had recently launched its air patrolling unit equipped with state-of-the-art 14 drones, besides having 130 persons Shaheen squad.\nHe said that the MoU has been signed with the Punjab government for the start of ‘1122 service’ in the federal capital initially with 20 vehicles.\nHe said that the government was planning to allow the construction of high-rise buildings in the federal capital. He added for the purpose high-rise cranes will be purchased.\nEarlier, during a display at ITP Family Gala, the minister was informed about the air patrolling unit of the ICT police which consists of high-tech drones and locators for live surveillance and tracking purposes.\nHe was informed that these drones were capable of flying in a radius of more than 1 kilometer. They will initially patrol areas with high rates of burglaries, robberies, snatching, street crimes, and auto theft.\nPolice officials said that apart from airborne tracking and surveillance, it will also be responsible for providing additional support to the on-ground patrol and specialized teams of the ICT Police.\nThey added the air patrolling unit will significantly increase the safety of both police officials and the public, decrease the crime rate, and consolidate the overall security of the federal capital.\nThey said that ICT Police are the most advanced police force in the country as they have adopted modern technology to tackle crimes, automate different processes, making the city safer for both residents and visitors.\nThe minister was apprised that the ICT police had also installed security cameras across the capital under the Safe City project.",
  "retrievedAt": "2025-08-11T21:36:00.975Z"
}
