{
  "title": "PNS ZULFIQAR visits St. Petersburg; reaffirms growing collaboration with Russian Navy",
  "link": "https://www.app.com.pk/national/pns-zulfiqar-visits-st-petersburg-reaffirms-growing-collaboration-with-russian-navy/",
  "date_published": "2021-07-28T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):Pakistan Navy Ship (PNS) ZULFIQUAR returns to operational deployment after successful visit of Saint Petersburg Russia participated in 325th Russian Navy Day Parade.\nDuring the ship stay at Saint Petersburg, Mission Commander and Commanding Officer PNS ZULFIQUAR called on Commander Leningrad Naval Base Captain Saloshin Andrev and Deputy Governor External Relations Evgeny D Grigoriev at St Petersburg, said a Pakistan Navy news release.\nDuring the meetings, matters of mutual interest were discussed. The dignitaries expressed enormous goodwill and warmth for Pakistan Navy and thanked for its participation in Russian Navy Day Parade.\nThe Mission Commander conveyed well wishes from Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi for the people of Russia in general and Russian Federation Navy (RFN) in particular.\nMission Commander also extended his gratitude for whole hearted support provided by RFN in making ship’s stay comfortable.\nLater, Mission Commander and Commanding Officer also attended wreath laying ceremony at Piskaryevskoe Cemetery.\nIn addition, a ceremony and Press briefing were hosted onboard PNS ZULFIQUAR to acknowledge Russian Navy Day.\nLarge number of Russian government officials, diplomatic core and Russian Federation Navy officers attended the event.\nPNS ZULFIQUAR‘s port visit and participation in Russian Naval Parade to commemorate 325th Russian Navy Day is a reaffirmation of growing Pakistan Navy and Russian Federation Navy collaboration and to further foster friendly relations between Pakistan Navy and Russian Federation Navy.\nPakistan Navy Ship also conducted bilateral Exercise ARABIAN MONSOON with Russian Federation Ship ODINTSOVO on return passage.",
  "retrievedAt": "2025-08-11T21:00:43.386Z"
}
