{
  "title": "People’s satisfaction over Govt facilities increases, PSLM Survey",
  "link": "https://www.app.com.pk/national/peoples-satisfaction-over-govt-facilities-increases-pslm-survey/",
  "date_published": "2021-07-28T09:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP): The overall satisfaction of people across the country over the basic facilities or services provided by the government witnessed increase, according to latest Pakistan Social and Living Standards Measurement Survey (PSLM-2019-20) conducted by Pakistan Bureau of Statistics (PBS).\nAccording to the PSLM findings, households were also asked to give opinion about their satisfaction with the use of facilities or services and it was observed that overall satisfaction of the services used has increased for all facilities.\nThe denominator included only those household who were using the facility, it said adding that, 67 percent of the household were satisfied with government basic health facility in 2019-20 as compared to 57 percent in 2014-15, when the last PSLM survey was conducted.\nLikewise, 86 percent of the household were satisfied with the family planning service in 2019-20, as compared to 83 percent in 2014-15, whereas 97 percent households were satisfied with primary schools as compared to 94 percent in 2014-15.\nSatisfaction from veterinary services were 77 percent as compared to 71 percent in 2014-15, 76 percent of household showed satisfaction after using agriculture extension\nas compared to 69 percent in 2014-15 regarding satisfaction with police service it has increased to 57 percent as compare to 48 percent in 2014-15.\nThe PSLM survey observed that in Punjab satisfaction with facilities has increased in almost all services, but there was decline in agriculture extension from 80 percent to 77 percent in 2019-20.\nIncrease in satisfaction from Basic Health Unit (BHU) has been observed 72 percent as compared to 66 percent in 2014-15. The satisfaction from family planning services with 89 percent, schools with 98 percent, veterinary with 81 percent, police with 57 percent have increased while as compared to family planning with 86 percent, schools with 96 percent, veterinary with 81 percent, police with 50 percent in 2014-15 respectively.\nIn Sindh Satisfaction from services of BHU, family planning, schools, agriculture, veterinary& police increased. satisfaction from services of BHU increased to 64 percent from 51 percent in 2014-15, satisfaction from family planning service is 92 percent, schools 95 percent, agriculture extension 83 percent, veterinary with 78 and police with 49 percent in 2019-20, while comparing with the situation in 2014-15 , family planning with 81 percent, schools with 90 percent, agriculture with 58 percent, satisfaction of services of veterinary with 58 percent and police with 35 percent\nIn Khyber Pakhtunkhwa increase in satisfaction from all services has been observed as compared to 2014-15.\nThe situation showed that satisfaction from BHU is 65 in 2019-20 has increased to50 percent in 2014-15, family planning to 88 percent, primary schools to 97 percent, veterinary to 72 percent, agriculture extension to 83 percent & police to 71 in 2019-20, while comparing with situation in 2014-15, family planning 82 percent, School 93 percent, veterinary 58 percent, agriculture 57 percent and Police with 66 percent.\nThe situation of Balochistan need immediate attention as only increase in satisfaction from services like school and police has been observed. While satisfaction from services of BHU, family planning, veterinary services and agriculture extension decreased as compared to the situation in 2014-15.\nIncrease in satisfaction from services like school with 84 percent and police with 56 percent observed in 2019-20,while comparing with the situation in 2014-15 schools with 82 percent and police with 50 percent. Satisfaction from BHU decreased to 40 percent, family planning to 50 percent, veterinary to 41 percent and agriculture with 42 percent in 2019-20, while comparing with the situation in 2014-15 BHU 43 percent, family planning 62 percent, veterinary 47 percent and agriculture extension with 55 percent.",
  "retrievedAt": "2025-08-11T21:00:47.391Z"
}
