{
  "title": "COVID-19 claims 44 more lives, positivity ratio recorded 7.8%",
  "link": "https://www.app.com.pk/national/covid-19-claims-44-more-lives-positivity-ratio-recorded-7-8/",
  "date_published": "2021-07-28T09:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):The national tally of total active COVID-19 cases was recorded as 56,952 on Wednesday with 4,119 more people tested positive for the deadly virus and 7,020 people recovered from the disease during the last 24 hours.\nForty-four (44) corona patients have died during past 24 hours, 39 of whom were under treatment in the hospitals and five of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Punjab. Out of the total 44 deaths occurred, 20 of them died were under treatment on ventilators.\nThere were 2,898 Covid infected patients under treatment in critical condition with 176 of them admitted during past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 7.8 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad\n34%, Lahore 20%, Peshawar 17% and Karachi 17%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 43%, Karachi 52%, Abbottabad 27% and Islamabad 29%.\nAround 294 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan.\nSome 52,291 tests were conducted across the country on Tuesday, including 18,737 in Sindh, 18,029 in Punjab, 8,600 in Khyber Pakhtunkhwa (KP), 3,404 in Islamabad Capital Territory (ICT), 1,878 in Balochistan, 782 in GB, and 861 in AJK.\nAround 935,742 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,015,827 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 23,370, Balochistan 29,861, GB 7,896, ICT 86,226, KP 142,400, Punjab 354,312 and Sindh 371,762.\nAbout 23,133 deaths were recorded in country since the eruption of the contagion. Around 5,860 people perished in Sindh, 17 of them died in the hospitals and three out of the hospitals on Tuesday.\n10,978 people died in Punjab died with 12 deaths occurred in past 24 hours. 10 individuals died in the hospitals and two out of the hospital.\nAs many as 4,428 people expired in KP, five of them died in hospitals on Tuesday, 796 individuals died in ICT, 326 people died in Balochistan, 127 infected people perished in GB, three of them died in the hospital in past 24 hours and 618 people in AJK died, four of them succumbed to the deadly virus in the hospitals on Tuesday.\nA total of 15,818,764 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 3,286 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:00:47.966Z"
}
