{
  "title": "Sheik Rashid visits low lying areas to inspect arrangements finalized to cope with flood emergency",
  "link": "https://www.app.com.pk/national/sheik-rashid-visits-low-lying-areas-to-inspect-arrangements-finalized-to-cope-with-flood-emergency/",
  "date_published": "2021-07-28T10:10:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 28 (APP):Interior Minister Sheikh Rashid on Wednesday visited Gawalmandi and other city areas to inspect arrangements finalized by the administration to cope with any emergency situation after heavy downpour in the encatchment area of Nullah Leh.\nTalking to media, Sheikh Rashid said that the administration including Water and Sanitation Agency (WASA), Rawalpindi Municipal Corporation, Rescue-1122, Police, Army troops and other departments concerned were on high alert to deal with any situation particularly in low lying areas of the city.\nHe informed, the troops had also been deployed in federal capital particularly in areas adjacent to the Nullahs.\n“Although, the downpour has decreased but, the administration is fully alert,” he said adding, in case of emergency, all available resources would be utilized to help and facilitate the citizens.\nTo a question he informed that the government was going to launch Nullah Lai project within 90 days as Prime Minister Imran Khan and Chief Minister Punjab Sardar Usman Buzdar had chaired meetings on the project and directed the authorities concerned to decrease the construction cost of the project as low as possible.\nNullah Leh had been taking lives of the citizens, he said adding, the government wanted to launch the project as soon as possible to permanently resolve the issue and save precious lives and properties of the citizens.\nThe minister said, the living standards of the residents of the localities adjacent to Nullah Leh would be uplifted as the areas would be declared commercial and the residents would be allowed to construct multi-story buildings along side of the Leh Expressway.\nThe Nullah Lai project could not be launched during last 20 years and when the project was conceived, its construction cost was RS 26 billion which had reached to Rs 90 billion, he added.\nTo another question he said, Rawalpindi is the city of the colleges and universities, adding, another college for women is going to be upgraded as women university.\nCommissisoner Rawalpindi Division, Syed Gulzar Hussain Shah, Deputy Commissioner, Rawalpindi Amir Attique Khan and other officers were present on the occasion.\nCommissioner Rawalpindi informed that all the machinery of WASA had been mobilized and deployed in low lying areas.\nHe directed the authorities concerned to keep the alert system updated and timely apprise the citizens about all the situation.\nHe directed the MD WASA to clear roads and streets and remove stagnant rain water from all the areas within shortest possible time frame.\nCommissioner directed the officers to focus low lying areas particularly of Ratta Amral,\nKatrian, Tippu Road, Dhoke Naju, Gawalmandi and Zia ul Haq colony and report about all the situation should be submitted to commissioner office.",
  "retrievedAt": "2025-08-11T21:00:46.269Z"
}
