{
  "title": "MoST determined to improve EVM as per ECP requirements",
  "link": "https://www.app.com.pk/national/most-determined-to-improve-evm-as-per-ecp-requirements/",
  "date_published": "2021-08-23T16:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP):Federal Minister for Science and Technology, Senator Syed Shibli Faraz Monday said that Electronic Voting is the only way forward for ensuring free and fair elections in the country.\n“The Ministry of Science and Technology is determined to improve the Electronic Voting Machine (EVM) to the maximum level as per requirements of Election Commission of Pakistan (ECP)”, the minister said in a meeting held with representatives of Free and Fair Election Network (FAFEN) and United Nations Development Program (UNDP) in the Ministry of Science and Technology.\nThe members were given a detailed demonstration of the working of Electronic Voting Machine (EVM) and its role in the electoral process.\nSpeaking on the occasion, Shibli Faraz Said, “It is the need of time to use technology for improving our electoral system. The EVM reduces the human interface. Hence, it is a tool towards efficient, free and credible elections.”\nThe members asked in detail their questions and concerns regarding the use of EVM. Members of FAFEN and UNDP congratulated and praised the efforts of Senator Syed Shibli Faraz and also shared their viewpoints about the importance of public trust in the voting process.\nMoreover, he said that the government aims to take all stakeholders including opposition on board.\nOpposition members are invited to join hands in improving the electoral process to make it more credible and reliable, he added.\nThe members from FAFEN were Muddasir Rizvi (Director Programme) and Ghulam Sarwar Bari (Ex- Chairperson FAFEN) while team from UNDP included Mr. Darren Scott Nance (Chief Technical Advisor) and Muhammad Qasim Janjua (Training Specialist).\nSecretary Ministry of Science and Technology Dr. Akhtar Nazir was also part of the meeting.",
  "retrievedAt": "2025-08-11T21:07:10.796Z"
}
