{
  "title": "AJK government to go for reforms, accountability",
  "link": "https://www.app.com.pk/national/ajk-government-to-go-for-reforms-accountability/",
  "date_published": "2021-08-23T16:32:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD Aug 23 (APP): Azad Jammu and Kashmir (AJK) Prime Minister Sardar Abdul Qayyum Niazi Monday reiterated his government’s resolve to extend health and education facilities to the people and revolutionary steps would be taken for the improvement of infrastructure to bring the state on the road to progress and prosperity.\nHe was talking to various delegations who called him including Azad Kashmir Newspapers society (AKNS) and others from different walks of life at his office.\nElaborating the priorities of his government, the prime minister said that reforms in the police and patawari culture would be introduced and merit would be restored .Steps would be taken for the development of tourism and dispensation of justice to the people, he added.\nThe prime minister said that local bodies’ elections would be held within a year while police reforms would be introduced in the state on the patron of KPK and added that the problems of the people would be addressed on priority.\nHe said fast track development activities would be started to bring socio economic development in the state.\nThe prime minister said that drastic steps would be taken to overcome unemployment and the work on the implementation of the billion tree project would also be intensified and added that effective steps would be taken for the rehabilitation of the affected people on Line of control (LoC).\nHe said accountability process without any discrimination would be started and corrupt element would be taken to task.\nThe prime minister lauded the role of the state media for highlighting the Kashmir issue and projecting the problems being faced by the people of Azad Kashmir.\nHe assured that a comprehensive policy would be chalked out to resolve the problems of the journalist community.\nThe prime minister reaffirmed to serve the masses in accordance with the vision of the Prime Minister of Pakistan Imran Khan.\nHe said a sports academy would also be set up within a month to start sport activities in the state.",
  "retrievedAt": "2025-08-11T21:07:10.700Z"
}
