{
  "title": "Punjab Police submits report in TikToker’s assault case",
  "link": "https://www.app.com.pk/national/punjab-police-submits-report-in-tiktokers-assault-case/",
  "date_published": "2021-08-23T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): The Punjab Police on Monday submitted a report in response to a notice taken by the Supreme Court’s Human Rights Cell regarding assault of a female TikToker by a mob at Greater Iqbal Park Lahore on Independence Day.\nIn line with the apex court’s order, the Human Rights Cell had directed the Punjab Police chief, Inam Ghani, to submit a report on the incident by today afternoon.\nAccording to the report submitted to the SC, the police formed four special teams for a comprehensive investigation into the matter after the incident, and so far at least 92 suspects have been arrested through NADRA identification and geo-fencing.\nThe report maintained that the police sent 30 videos, 60 photographs to NADRA for identification, adding that nine people were arrested after identified by the national database authority.\nThe police investigated these nine accused and made more arrests on the basis of the information extracted from them, it added.\nThe report maintained that at least 700 people have been declared suspects after the police collected call data records of more than 28,000 people from 6:30 pm to 7:47 pm on August 14.\nThe geo-fencing data was collected with the help of intelligence agencies, as per the report.\nApproximately 407 suspected persons have been interviewed so far and among them 92 were marked as accused.\nThe report said 40 of these accused were sent to judicial lockup on August 21 while 30 more on August 22 for identification parade as per law and procedure. “The rest of the suspects are being processed and shall be sent for an identification parade in due course,” the report added.\nMoreover, the report quoted the police chief as saying that a thorough investigation into every aspect of the incident would be carried out, adding, all resources would be utilized for impartial proceedings and exemplary punishments would be awarded to the people involved in this incident, the Inspector General of Police assured the top court.",
  "retrievedAt": "2025-08-11T21:07:16.903Z"
}
