{
  "title": "Committee expresses concerns over selection of MPhil, PhD scholars without any methodology",
  "link": "https://www.app.com.pk/national/committee-expresses-concerns-over-selection-of-mphil-phd-scholars-without-any-methodology/",
  "date_published": "2024-10-01T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP): National Assembly Standing Committee on Science and Technology in its third meeting held here Tuesday expressed concerns over selection of MPhil and PhD scholars under the project “Data Repository of Scientific Instrumentation of PCSIR” without following any methodology.\nIn the meeting chaired by Member National Assembly, Khawaja Sheraz Mehmood, the committee expressed grave displeasure over the absence of Chairman Pakistan Council of Scientific and Industrial Research (PCSIR) in the meeting.\nThe agenda was to obtain briefing from the Chairman PCSIR regarding functions and responsibilities of the Council who was reportedly engaged in another meeting at Skardu.\nThe Committee, taking notice over absence of the Chairman PCSIR, expressed displeasure and directed that recurrence of such practice should be avoided in future and parliamentary business should be given priority over every other assignment.\nThe committee has deferred the important issues due to the absence of the Chairman of the PCSIR.\nThe committee members raised pertinent questions regarding the ongoing PSDP projects 2024- 2025.\nThe Member of PCSIR briefed about the ongoing projects, which are Cultivation and Processing of  Industrial Cannabis at PCSIR Karachi, Lahore and Peshawar, Data Repository of Scientific Instrumentation, Development of  Computer Controlled Fermentors, Digital transformation, strengthening and automation of PCSIR, Research development and Innovation Programing PCSIR Medical Equipment and Devices Innovation Center(MEDICen) ,Gene Editing of Biological Agents for Nutritional Biochemical and Therapeutical purpose, Material Resource Centre and development of additive manufacturing and Reverse Engineering Centre, Upgradation of Medicinal Botanic Centre as National Centre for Herbal Medicine, Establishment of Medical Cannabis Greenhouses and Cannabis Analytical Laboratory.\nThe member PCSIR briefed the scope and functions of the PCSIR, which are Technology Development Industrial Linkages, Research and Development, Human Resource Development, Quality Control, Conformity Assessment Body (CAB) Consultancy, Troubleshooting Cultivation and Processing of Industrial Cannabis at PCSIR Karachi, Lahore and Peshawar.\nThe meeting was attended by MNAs including Abdul Karim Bijjar, Sadiq Iftikhar, Khuram Shahzad Virk, Ghous Muhammad, and senior officers of the Ministry of Science and Technology and PCSIR.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:45:26.017Z"
}
