{
  "title": "Our struggle for strengthening institutions: Bilawal",
  "link": "https://www.app.com.pk/national/our-struggle-for-strengthening-institutions-bilawal/",
  "date_published": "2024-10-01T17:24:00.000Z",
  "source": "APP",
  "content": "QUETTA, Oct 01 (APP): Chairman Pakistan Peoples Party (PPP) Bilawal Bhutto Zardari has stated that his struggle is not for any particular individual but aimed at delivering justice to the people and strengthening the institutions.\nAccording to a press release issued by the Bilawal House Media Cell, Chairman PP, while addressing the Balochistan High Court Bar here on Tuesday, lauded the lawyers’ community in Balochistan for their sacrifices and struggle in restoring democracy. He expressed his deep connection with the lawyers of Balochistan and termed the terrorist attacks on the legal fraternity a great tragedy. He recalled visiting Quetta for condolence after the attack and noted how his tears were ridiculed at the time.\nChairman Bilawal Bhutto Zardari emphasized that his family’s and his party’s journey did not begin with the no-confidence motion against Imran Khan’s puppet regime but has been an ongoing struggle across three generations. This struggle was not a quick revolution achieved in a day or a year but rather a persistent fight that began long ago.\nThe PPP Chairman highlighted that while the entire country now stands united in support of the 1973 Constitution, it was Shaheed Mohtarma Benazir Bhutto who struggled for over 30 years to restore it. Although she twice became the Prime Minister, she could not see the dream of restoring the Constitution come true. However, through the Charter of Democracy, PPP succeeded in restoring the 1973 Constitution via the 18th Amendment.\nChairman Bilawal Bhutto Zardari also shared his personal experiences of witnessing the hardships his family endured for the sake of democracy. He recounted how Shaheed Zulfikar Ali Bhutto was hanged, Shaheed Mohtarma Benazir Bhutto was imprisoned in the scorching heat of Sukkur jail, and PPP workers and those of other democratic parties faced atrocities during their struggle. He also described the hardships faced during the Nawaz Sharif and Shahbaz Sharif governments of the 1990s, recalling vivid images of his mother holding his and his sister’s hands, waiting outside jail in extreme heat to meet his father.\nChairman Bilawal Bhutto Zardari expressed disbelief at the claims made by PTI, suggesting that they understood Shaheed Benazir Bhutto’s struggle better than him. .\nHe acknowledged the difficult times Pakistan is facing today, but reminded the audience that the situation was equally dire during the era of a dictator who could not be spoken against. He criticized contempt of court laws, which he said have been used to silence criticism of the judiciary while undermining freedom of expression. He condemned how courts allowed military rulers to make unconstitutional amendments but denied elected representatives the same powers.\nChairman Bilawal Bhutto Zardari clarified that his struggle is not for the current Chief Justice or any individual. He said his agenda is not to serve any one person, emphasizing that Pakistan needs a constitutional court to address provincial issues equally. He voiced concerns over judicial reforms being undermined and questioned whether delays in reforms would lead to decisions similar to Article 63(A) and further restrictions on constitutional amendments.\nIn response to questions, the PPP Chairman said his demand for a constitutional court is not new and reiterated that the creation of such a court would focus judges’ attention on constitutional matters, ensuring timely justice for the common man. He argued that it would also ensure accountability within the legal community.\nChairman Bilawal Bhutto Zardari concluded that Pakistan’s judiciary, in the past, has never allowed parliamentarians or politicians to draft laws concerning the judiciary but has allowed military rulers to amend the Constitution at will. He stressed that PPP’s goal is not to serve any individual but to ensure a judiciary that functions independently and provides justice efficiently.\nThe demand for a constitutional court, he added, is not an attempt to target any specific judge but a necessary reform for the country.\nChairman Bilawal Bhutto Zardari stressed that PPP is committed to seeing these reforms through and will continue its struggle to ensure that justice and democracy prevail in Pakistan.",
  "retrievedAt": "2025-08-10T19:44:39.889Z"
}
