{
  "title": "Salik for holistic approach in education with focus on character building, technological advancement",
  "link": "https://www.app.com.pk/national/salik-for-holistic-approach-in-education-with-focus-on-character-building-technological-advancement/",
  "date_published": "2024-10-01T13:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP): Minister for Religious Affairs and Interfaith Harmony, Chaudhry Salik Hussain on Tuesday emphasized the need for a multifaceted approach to the education system with focus on character building, technological advancement, and the enhancement of spiritual, moral, and intellectual values.\nHe expressed these views during the inauguration of a new international campus of Pakistan School in Al-Seeb, Oman.\nThe minister said the purpose of education is not merely material success, but to nurture spiritual growth and develop abilities to contribute to the well-being of society.\nAddressing the negative impact of social media and modern communication tools on the ethics of society, particularly the younger generation, Salik urged scholars, educators, and all stakeholders to play their role in addressing the situation and improving the moral fabric of the youth.\nHe called on teachers to not only impart knowledge but also focus on character building, enabling students to become true ambassadors of Pakistan.\nHe highlighted that students from diverse backgrounds are studying harmoniously in Pakistan Schools, which reflects the values of tolerance, understanding, and unity promoted by the institution.\nThe minister further noted that the Pakistan School System takes pride in educating students from 27 different nationalities, a testament to the trust placed in these schools by residents of Oman. Due to the growing number of students, he said the Omani government has granted two acres of land for the new Pakistan International School, which is expected to be completed in 18 months.\nSalik lauded the efforts of the Pakistani Embassy and the school board in improving Pakistan Schools in Oman. The event was attended by Pakistan’s Ambassador to Oman, Chaudhry Imran Ali, Dr. Khadija Al Salami, Director General of Private Schools at Oman’s Ministry of Education, and members of both the Pakistani and Omani communities.\nThe Pakistan School System already operates seven campuses in Oman, educating over 8,500 students in morning and evening shifts. The new state-of-the-art campus will provide education from kindergarten to A-levels and is expected to accommodate 3,000 students.",
  "retrievedAt": "2025-08-10T19:45:30.377Z"
}
