{
  "title": "SC adjourns Article 63A review petition till Wednesday",
  "link": "https://www.app.com.pk/national/sc-adjourns-article-63a-review-petition-till-wednesday/",
  "date_published": "2024-10-01T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP): The Supreme Court on Tuesday adjourned the hearing of a review petition pertaining to the interpretation of Article 63A of the Constitution till Wednesday.\nA five-member larger bench headed by Chief Justice of Pakistan Qazi Faez Isa heard the case. Justice Amin ud Din Khann, Justice Jamal Khan Mandokhail, Justice Mazhar Alam Miankhel and Justice Naeem Akhtar Afghan were part of the bench.\nThe top court in its order regarding the hearing said that the review petition was filed three days late after the time bar, on which Ali Zafar raised an objection. The petitioner’s lawyer adopted the stance that it was filed late due to non-availability of the detailed judgment. The Registrar Office has been asked to tell that when the detailed order was issued.\nIt further said that on interpretation of Article 63A, former President Arif Alvi sent a reference either by himself or on the advice of the Prime Minister.\nThe order added that Justice Munib Akhtar excused himself from being a part of the bench while Justice Naeem Akhtar Afghan was made a part of the bench after calling a meeting of the Judges Committee.\nThe SC said that during the hearing, some questions came up and the respondents had been directed to assist the court regarding it.\nEarlier during the hearing, CJP Qazi Faez Isa said that Justice Munib Akhtar had been requested after last day’s hearing to be part of bench but he maintained his position.\nHe said that he recommended to include Justice Syed Mansoor Ali Shah in the bench, Judges Committee was convened at 9:00am which kept waiting but Justice Shah excused from being part of the bench. After this Justice Afghan was included in the bench, he added.\nOn the occasion, PTI’s lawyer Barrister Ali Zafar raised objection on the bench.\nSupreme Court Bar Association President Shehzad Shaukat said that tere were a presidential reference and 184/3’s petition pertaining to the Article 63A, which should be clubbed.\nThe chief justice remarked that both were separate things and could not be heard together. Only an opinion could be given on a presidential reference and not a decision.\nShehzad Shaukat said that the presidential reference had sought an opinion on four questions.\nThe Additional Attorney General on the occasion said that there was no order of de-seating of any member of the Parliament in decision regarding the interpretation of Article 63A. As per the verdict only the vote of a member against the party’s instruction would be accepted.\nThe chief justice said that there was an explanation of no-confidence motion, the election of the Prime Minister and the Chief Minister in the Constitution. When it was clear in the constitution, how one could add something to it.\n“Tell me, what is your objection to this decision? The objection is on the minority decision or on the majority,” the CJP questioned.\nThe SCBA president said that they had objection on the majority verdict.\nThe chief justice said that where it was written in the decision that the members would be disqualified if their votes were not counted.\n“In the decision, the matter is left to the head of the party, it is his will not to disqualify the members if he wants. What will happen if the head of the party doesn’t send the declaration of disqualification?” he asked.\nThe CJP said that the voting was used to be done so that it would be counted.\nHe asked that whether the court said anything on Article 95 in the decision. “What will be done if a member of a party does not like the party leader and wants to leave? What will be done if the votes of the members cannot be counted?”\nThe chief justice observed that it was difficult to decide the matter of one’s conscience. “Does the decision affect Article 95 and 163? Isn’t it like changing the parliamentary system to a presidential system/” he asked.\nPTI’s Barrister Ali Zafar on the occasion said that he would oppose the review petition.\nLater, the further hearing of the case was adjourned till Wednesday.",
  "retrievedAt": "2025-08-10T19:45:02.201Z"
}
