{
  "title": "ETPB reclaims 6,140 acres of land illegally occupied nationwide",
  "link": "https://www.app.com.pk/national/etpb-reclaims-6140-acres-of-land-illegally-occupied-nationwide/",
  "date_published": "2024-10-01T16:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP): The Senate Standing Committee on Religious Affairs on Tuesday held a meeting at the Parliament House under the chairmanship of Senator Atta-ur-Rehman and focused on various critical issues, including the implementation of the Supreme Court’s orders regarding the removal of illegal constructions from the ETPB lands and the review of the Muslim Family Laws (Amendment) Bill, 2024.\nDuring the meeting, Evacuee Trust Property Board (ETPB) Chairman, Dr. Syed Ata-ur-Rehman informed the committee that the Supreme Court had directed the removal of illegal constructions from the occupied lands.\nIn compliance with these orders, he informed that a total of 247 acres, 4 kanals, and 13 marlas of land were reclaimed in Tehsil Fateh Jang with the assistance of the Federal Investigation Agency (FIA) out of a total of 283 acres, 4 kanals, and 9 marlas. The remaining 35 acres, 7 kanals, and 16 marlas are yet to be recovered, he added.\nAdditionally, the ETPB chairman informed the committee that, with the cooperation of the FIA, a total of 6,140 acres, 2 kanals, and 3 marlas of illegally occupied land across the country had been reclaimed as of August 2024, with an estimated value of Rs. 39 million.\nThe committee also reviewed the Muslim Family Laws (Amendment) Bill, 2024, introduced by Senator Syed Ali Zafar during the Senate session on September 2, 2024.\nSenator Zafar emphasized the bill’s importance for addressing pressing social issues in Pakistan. He said the Council of Islamic Ideology (CII) had been consulted for feedback on the bill, and its response is expected after their meeting, scheduled for October.\nSenator Zafar highlighted that he had been working on this bill for 30 years, gathering input from experts across various prestigious educational institutions globally. He said the bill aims to ensure that women receive their rightful share of assets accumulated during a marriage in cases where the husband divorces the wife after 30 years of cohabitation. He further said 26 experts, who have authored books on the subject, had provided their insights, which he plans to present to the committee.\nSenator Atta-ur-Rehman, the committee chair, noted the importance of awaiting the CII’s recommendations before further reviewing the bill. He also suggested that the bill be sent to prominent religious seminaries across the country to gather their opinions.\nSenators Husna Bano, Bushra Anjum Butt, Taj Haider, and Syed Ali Zafar, along with senior officials from the Ministry of Religious Affairs and Interfaith Harmony, ETPB, and the CII attended the meeting.",
  "retrievedAt": "2025-08-10T19:45:01.992Z"
}
