{
  "title": "Ayaz calls for elimination of violence in Middle East, IIOJK",
  "link": "https://www.app.com.pk/national/ayaz-calls-for-elimination-of-violence-in-middle-east-iiojk/",
  "date_published": "2024-10-01T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP):National Assembly Speaker Sardar Ayaz Sadiq has emphasized the urgent need for elimination of violence and human right violations in the Middle East and Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nHe also called for a united stance against violence and the promotion of global peace.\nThe NA Speaker, in his message on the International Day of Non-violence being observed on Wednesday (October 2), condemned the Israeli atrocities in Gaza and Lebanon, saying,”Establishment of a violence-free and just society is essential for peace and progress.”\nHe further said that Pakistan’s Constitution enshrined principled that advocate for non-violence, reflecting the moral and cultural values of Islam.\n“The Constitution of Pakistan provides protection to the children, women, and men from all forms of violence,” he added.\nHe said the Women’s Parliamentary Caucus along with the Parliamentary Caucus on Child Rights, and the Parliamentary Taskforce on Sustainable Development Goals had been established in the National Assembly to ensure the legislation aimed at enhancing protection of the rights of every individual, regardless of religion, gender, race, or socio-economic status.\nThe Parliamentary Committee on Kashmir, he said, also worked tirelessly to raise the voice of oppressed Kashmiri people, while the Standing Committee on Human Rights had been formed to protect the fundamental rights of the citizens.\n“The Parliament of Pakistan is committed to protect its citizens from any form of violence and injustice,” the Speaker added.\nAyaz Sadiq urged the international community to prioritize dialogue, establishing a culture of peace and a society free from violence for durable peace and progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:45:00.036Z"
}
