{
  "article_id": "2025-10-24_4b1f1f52977a16fe24f6a2fcb614dfc3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-training-course-on-speech-disorders-therapeutic-management-concluded/",
    "retrieved_at": "2025-10-25T02:04:09.802Z"
  },
  "metadata": {
    "title": "National Training Course on âSpeech Disorders & Therapeutic Management concluded",
    "author": null,
    "date_published": "2025-10-24T17:54:31.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/473798301_1107797724689975_2615341889845676077_n.jpg",
    "categories": [
      "National"
    ],
    "word_count": 374,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 24 (APP):The National Institute of Special Education (NISE), Directorate General of Special Education (DGSE) in collaboration with Ministry of Federal Education and Professional TrainingA successfully concluded a three-day National Training Course on aSpeech Disorders and Therapeutic Managementa on Friday. The training aimed to enhance the professional capacity of speech and language therapists, special educators, and rehabilitation experts working in special education institutions across Pakistan. Participants from Punjab, Sindh, Khyber Pakhtunkhwa, Azad Jammu and Kashmir, and considerable numbers of multi professionals from DGSE centres took part in the sessions, which were designed to address both foundational and advanced aspects of speech therapy and communication rehabilitation. The course covered a wide range of critical topics, including fundamental concepts and classification of speech disorders, management of dysphagia in cerebral palsy children, stuttering and voice disorders, neuromotor speech disorders, and therapeutic strategies for dysarthria and articulation impairments. Renowned professionals led the sessions, including Dr. Sadaf Noveen Head of the department dealing speech disorders at National Institute of Rehabilitation Medicine , Speech Pathologists Tehmina Yousaf, Dr. Shehnaz Kausar YousafA andA Shehbaz Akhtar Khalid. At the concluding ceremony of the National Course, the Director of institute along with her team, warmly welcomed the Director General, Directorate General of Special Education, whose visit as the Chief Guest brought encouragement and appreciation for the ongoing capacity building efforts at NISE. Earlier in the day, officers from the Project Coordination Unit (PCU) of the Ministry of Federal Education and Professional Training also visited and commended DGSEas sustained initiatives to strengthen rehabilitation services and human resource training for persons and children with disabilities throughout the country, a mission pursued with dedication beyond its post-devolution mandate restricted to Islamabad, reflecting DGSEas national spirit and inclusive vision. Captain (R) Asif Iqbal in his remarks, he lauded the course organizers and resource persons for conducting an impactful and practical training, emphasizing that DGSE is undergoing a transformation through innovation in accessible technologies, professional development, and field-based capacity building. He highlighted that under the visionary guidance of Nadeem Mehbub, Federal Secretary, Ministry of Federal Education and Professional Training , DGSE and its affiliated centres are actively working to modernize rehabilitation practices. At the end the chief guest distributed certificates among participants and trainers of training course.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}