{
  "article_id": "2025-10-24_910fc65bacdb830c6515ea31e3676976",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/novacare-clarifies-recent-media-reports-regarding-project-at-cbd-nsit/",
    "retrieved_at": "2025-10-25T02:04:21.905Z"
  },
  "metadata": {
    "title": "Novacare clarifies recent media reports regarding project at CBD NSIT",
    "author": null,
    "date_published": "2025-10-24T18:56:19.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/913669_49377895-696x392-1.jpg",
    "categories": [
      "National"
    ],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 24 (APP): Clarifying recent media reports and social media discussions that have misrepresented the organizations and relationships involved in its upcoming project at CBD NSIT Lahore, Novacare has said that since March 2024, it has been affiliated with Imperial College Healthcare NHS Trust under the Trust's International Affiliate Network. This partnership supports Novacare's first state-of-the-art, 250-bed tertiary hospital in Islamabad, which is now more than 50% complete and scheduled to open in the fourth quarter of 2026, said a press release. Through the International Affiliate Network, expert multidisciplinary teams from Imperial College Healthcare NHS Trust collaborate with healthcare organizations worldwide to help them establish and maintain world-class clinical standards and practices. Novacare was proud to become the second organization globally to join this prestigious network. As part of its vision to build a nationwide healthcare network across Pakistan, Novacare has been allotted land in CBD NSIT Lahore for its second major initiative, an Academic Medical Centre. The centre will integrate healthcare delivery, education, research, and innovation in a world-class environment, leveraging the advanced technological and academic ecosystem being developed by the Punjab government. The Lahore project will match the scale, quality, and structure of Novacare's Islamabad facility and will further strengthen its collaboration framework with the Imperial College Healthcare NHS Trust. It is important to clarify that Imperial College Healthcare NHS Trust and Imperial College London are separate organizations. The Trust is a UK National Health Service (NHS) organization operating five major hospitals in London and leading one of the country's largest teaching hospital groups. While Imperial College London is a distinct academic institution that collaborates with the Trust in several areas, it is not involved in the Trust's International Affiliate Network. The university's recent statement correctly reflects that it has no direct presence in Pakistan. Novacare remains committed to delivering world-class healthcare across Pakistan, guided by the principles of excellence, transparency, and innovation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}