{
  "article_id": "2025-10-24_4ac9cd0a9e30f3b4aae7593603bf8de7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/sports/maaz-israrullah-hit-centuries-for-peshawar-on-opening-day-of-fourth-quaid-e-azam-trophy-round/",
    "retrieved_at": "2025-10-25T02:04:51.871Z"
  },
  "metadata": {
    "title": "Maaz, Israrullah hit centuries for Peshawar on opening day of fourth Quaid-e-Azam Trophy round",
    "author": null,
    "date_published": "2025-10-24T17:07:38.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/quaid-trophy.webp",
    "categories": [
      "National"
    ],
    "word_count": 458,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 24 (APP):The fourth round of the Quaid-e-Azam Trophy 2025-26 saw three teams, Peshawar, Sialkot and Karachi Blues posting scores in excess of 300-run mark, while Faisalabad were in driving seat against Fata. Bahawalpur too had a productive day against Multan. Maaz Sadaqat and Israrullah struck centuries to help Peshawar dominate Abbottabad on the opening day - where they posted 346-5 in 84 overs - at the Imran Khan Cricket Stadium in Peshawar. The two southpaws got together after Peshawar lost their opening batters in quick succession to Aqib Khan with 70 runs on the board. The duo then gathered 213 runs for the third wicket as Israrullah (117, 210b, 12x4s) registered his 15th first-class century, while Maaz reached his second first-class century (114, 140b, 11x4s, 16). Abbottabad's Israr Hussain (2-63) and Shahnawaz Dahani (1-83) then took three wickets to provide their team some much needed solace after a toiling day. Sialkot motored to 365-8 in 90 overs against Islamabad at the Shoaib Akhter Cricket Stadium in Rawalpindi courtesy opening batter Azan Awais' unbeaten 99 off 135 balls. Azan, who went to stumps awaiting his seventh first-class century, was retired hurt in the 22nd over of the innings and then returned to bat at 282-5. No.3 batter Aashar Mehmood came out all guns blazing hitting 73 off 49 balls inclusive of 10 fours and three sixes, while no.6 batter Mohammad Waleed (59, 102b, 7x4s, 16) was the other half-centurion for the defending champions. For Islamabad, Mohammad Hammad Khan, Haris Rauf and Jawad Ali picked up two wickets each. Karachi Blues had a commanding opening day against Lahore Blues as they posted 326-5 in 83.3 overs with the help of half-centuries from Rameez Aziz (77 not out, 127b, 8x4s), Omair Bin Yousuf (73, 131b, 9x4s) and Danish Aziz (51, 59b, 8x4s). For Lahore Blues, Haseeb-ur-Rehman picked up two wickets. Faisalabad's opening batters Hasan Raza (59 not out, 89b, 9x4s) and Faham-ul-Haq (40 not out, 67b, 6x4s) took their team to stumps unscathed with 127 runs on the board in 26 overs and 64 runs behind Fata at the Marghzar Cricket Ground, Islamabad. Earlier, Faisalabad dismissed FATA for 191 in 52.2 overs as pacers Jahandad Khan (3-26), Afaq Afridi (3-56) and Asad Raza combined to take eight wickets. For Fata, Rehan Afridi (56, 66b, 8x4s, 16) and Mohammad Sarwar Afridi (41, 75b, 7x4s, 16) stitched a 50-run sixth-wicket stand but they slipped from 157-5 to 191 all out. Bahawalpur's Saad Khan (74, 116b, 10x4s), Mohammad Ammar (71, 150b, 12x4s) and Mohammad Sheharyar (50 not out, 102b, 6x4s) struck fifties to lead their team to 276-5 in 88 overs against Multan at the Diamond Cricket Ground in Islamabad. Test fast bowler Kashif Ali and Mohammad Ismail snapped two wickets each.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}