{
  "article_id": "2025-10-24_1de22b104a680ed3441240f0185900bc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/foreign-correspondent/make-this-chamber-worthy-of-hopes-of-every-man-woman-child-un-chief-tells-unsc-marking-un-day/",
    "retrieved_at": "2025-10-25T02:04:43.109Z"
  },
  "metadata": {
    "title": "‘Make this chamber worthy of hopes of every man, woman, child,’ UN chief tells UNSC marking UN Day",
    "author": null,
    "date_published": "2025-10-24T18:31:59.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2022/09/Fall-Back-Image-2.png",
    "categories": [
      "National"
    ],
    "word_count": 628,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "UNITED NATIONS, Oct 25 (APP): UN Secretary-General Antonio Guterres Friday warned that the \"fragile\" legitimacy of the Security Council could endanger global peace if it remains gridlocked and fails to fulfill its primary purpose. He told the 15-member Council in the iconic chamber in New York on United Nations Day, marking 80 years since its founding. Guterres spoke via video link from the capital of Viet Nam, Hanoi, during a robust open debate on how the UN navigates an uncertain future. As the UN's primary body for maintaining international peace and security, the Council wields significant power, including the authority to impose sanctions and authorize military action. Five of its 15 members have a permanent seat and were granted veto power under the UN Charter. While the Council has played a central role in peacekeeping, conflict resolution and upholding international law, its veto system has often stalled action and sparked criticism. The body's structure is viewed by many countries and top officials as unrepresentative, leaving regions like Africa and Latin America without a permanent voice. Invoking those who have looked to the Council over 80 years to end wars, Guterres said that \"the privilege to sit at this table carries a duty - above all - to \"Make this Chamber worthy of the hopes of every man, woman and child.\" Presiding over the Council for October, Russia praised the UN's achievements but criticized the actions of Western governments, while elected (non-permanent) member Guyana, said the body was unrepresentative, advocating for greater and meaningful global representation. The United States focused on operational reform, accountability, and called for a merit-based selection of the next Secretary-General - who takes the helm in January 2027 - emphasizing the primacy of national sovereignty and transparency in the selection process. The US representative called for an end to a selection process based on regions taking it in turns, arguing it was time to choose from a global roster of candidates. The UN chief painted a vivid picture of how Council decisions can impact citizens worldwide: \"The Security Council is not about hegemons and empires. It is about parents who have lost their children, refugees flung far from their homes, soldiers who have sacrificed their limbs. \"In every shadow of this Chamber, you are surrounded by the ghosts of the dead. But beside them stands something else - the hopes of the living.\" He urged Council members to listen to those hopes. \"Listen closely and you will hear the cries of your citizens who rally for peace; the whispers of families who long for safety...The United Nations emblem does not bear the laurel wreath of a victor, but the olive crown of a peacemaker.\" Guterres highlighted the Council's successes over eight decades, from helping Cambodia emerge from genocide to supporting South Africa's transition from apartheid and deploying missions in Sierra Leone, Timor-Leste, and Liberia. Yet its legitimacy remains fragile, he stressed, noting that violations of the UN Charter by some Member States erode trust and risk global stability. He called for and expanded membership to better reflect the world's demographics, including permanent representation for Africa, Latin America and the Caribbean. Guterres also encouraged discussions on proposals to limit the use of the veto. Russia's Ambassador Vassily Nebenzia praised the UN's achievements but cautioned against the actions of Western powers. \"In an effort to maintain its waning influence, the West divided the world into 'us' and 'them' - 'democracies' and 'autocracies' - a group of those who are chosen, and those who are violating their imposed order,\" he said. As a result, many of the UN Charter's principles remain concepts, not a reality. \"Adventures\" - from the Iraq invasion and Colour Revolutions to the recent invasion of Iran - have only led to tragedy, he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}