{
  "title": "Administrative measures stabilized rupee’s value: Senate told",
  "link": "https://www.app.com.pk/national/administrative-measures-stabilized-rupees-value-senate-told/",
  "date_published": "2023-11-27T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): Caretaker Minister for Parliamentary Affairs, Information and Broadcasting Murtaza Solangi on Monday informed the Senate that the value of rupees has stabilized owing to the administrative measures of the incumbent government.\nWinding up the discussion on the motion raised by Kamran Murtaza regarding the devaluation of the Pakistan Rupee and shortage of US dollars in the market resulting into high inflation, the minister said that the government controlled the informal channels/hundi business in the country.\nHe expressed the hope that the value of the country’s currency would further improve after receiving a second tranche from the IMF after its review. The position of balance of payments was much better than earlier, he said.\nThe minister said that the State Bank of Pakistan (SBP) was also going major restructuring in exchange companies.\nEarlier moving the motion, Kamran Murtaza said that the value of the dollar had continuously been increasing against Pakistani rupees which caused inflation.\nHe called for adopting prudent policies and measures to grow the national economy and controlling the dollar exchange rate.\nMohsin Aziz said that the economy has been deteriorating, adding that low exports and remittance besides smuggling were major causes of the increase in the value of the dollar and inflation.\nDanish Kumar lauded the caretaker government for controlling the dollar and bringing back its value to Rs 275 from Rs 340. He also called for supporting the policies of the incumbent government to win the confidence of the business community.\nEarlier there were problems with opening LC and now there was no such hurdle to open LC for imparting materials for industries, he added.\nDilawar Khan also appreciated the caretaker government for taking pragmatic steps to control the prices of the dollar. The dollar price was not only controlled but also the Stock Exchange witnessed an upward trend owing to the measures of the government, he added.\nHamayun Mohmand said special focus should be given to enhancing the country’s exports. The export-oriented economy of Pakistan was the sole solution to strengthen the rupee, he added.\nHe also called for lowering the interest rate as higher rates curtailed the circulation of money.\nMohammad Ishaq Dar said there was no doubt that the devaluation of the currency was a dangerous thing which also disastrous to the economy. Unfortunately, we have not unlimited resources like other developed world, he added.\nHe said as per his assessment the real effective exchange rate of the dollar should be Rs 244 to Rs 250.",
  "retrievedAt": "2025-08-11T10:43:03.460Z"
}
