{
  "title": "Pakistan, UAE reaffirm resolve to further strengthen economic, strategic cooperation",
  "link": "https://www.app.com.pk/national/pakistan-uae-reaffirm-resolve-to-further-strengthen-economic-strategic-cooperation/",
  "date_published": "2023-11-27T17:07:00.000Z",
  "source": "APP",
  "content": "ABU DHABI, Nov 27 (APP):Pakistan and the United Arab Emirates on Monday reaffirmed their resolve to further strengthen economic and strategic cooperation.\nThis reaffirmation was expressed during a meeting between Caretaker Prime Minister Anwaar-ul-Haq Kakar and the UAE President, Sheikh Mohamed bin Zayed Al Nahyan here.\nChief of Army Staff General Syed Asim Munir, NI (M) was also present on the occasion.\nThe two leaders underlined that Pakistan and the UAE had historic and deep-rooted fraternal ties which had stood the test of time.\nThey also witnessed the signing of Memorandum of Understandings (MoUs) between Pakistan and the UAE pertaining to investment cooperation in the sectors of energy, port operations, waste water treatment, food security, logistics, minerals, and banking and financial services.\nThe MoUs will unlock multi-billion dollars of investment from the United Arab Emirates into Pakistan and will help realize various initiatives envisioned under the Special Investment Facilitation Council (SIFC).\nThe prime minister termed the signing of MoUs as a historic event that will usher in a new era of Pak-UAE economic partnership.\nDuring the meeting, Prime Minister Kakar expressed profound gratitude for the UAE’s firm support to Pakistan in the economic and financial domain.\nThe UAE is home to 1.8 million Pakistanis, contributing to the progress, prosperity and economic development of the two brotherly countries.\nRegional and global developments were also discussed during the meeting with particular reference to the deteriorating human rights and humanitarian situation in occupied Palestine.\nThe prime minister expressed Pakistan’s support for a just and durable solution to the Palestinian question anchored in international law and in line with relevant United Nations and OIC resolutions.\nThe prime minister reiterated Pakistan’s full support to the UAE’s Presidency for COP 28, underlining its importance as an opportunity for meaningful progress towards effective and result-oriented global actions in key areas to mitigate climate impact including establishment of the Loss and Damage Fund.",
  "retrievedAt": "2025-08-11T10:42:58.171Z"
}
