{
  "title": "HEC calls for applications from private sector institutions to recognise their BICs",
  "link": "https://www.app.com.pk/national/hec-calls-for-applications-from-private-sector-institutions-to-recognise-their-bics/",
  "date_published": "2023-11-27T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):The Higher Education Commission (HEC) has called for application for recognition of Business Incubation Centers (BICs) aims to facilitate young and budding entrepreneurs through administrative, consulting, and networking services with provision of in-expensive startup spaces.\nAccording to HEC official sources,  the applications are invited from higher education institutions (private sector) to recognise their BICs.\nAs per details, the institution should have an operational BIC in line with the minimum requirements as per HEC BIC Policy 2021. They also have an HEC-recognised/funded BIC under the consortia model.\nFurthermore, the institutions must have proven and tangible research commercialization and entrepreneurial ecosystem.\nIt is worth mention here that recognition of BICs does not involve any funding and financial commitment from the commission.\nThe official sources added that HEC encouraged development of innovative companies, startups, and spin-offs to stimulate and support economic growth through rigorous incubation process.\nThe BICs are active players for creation of new jobs, and revival of innovative communities.\nThe commission is offering two routes for interested universities to establish their BICs.\nThe proposals for establishment of BIC at Public Sector HEIs are invited through Call for proposals.\nThe public sector HEIs having HEC recognized and fully functional ORIC interested in establishment of Business Incubation Center can apply of establishment of BIC.\nThe private sector universities which have established the incubation facility through their own resources, and are not part of the HEC led entrepreneurial initiatives and programs can apply for recognition of their BIC to HEC.\nThe recognition of BIC is open for application submissions throughout the year\nFor further details, the HEC asked the candidates to visit useful resources section or write to us at bic@hec.gov.pk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:43:43.791Z"
}
