{
  "title": "Senate defers seven bills, refers three bills on legislative agenda to committees",
  "link": "https://www.app.com.pk/national/senate-defers-seven-bills-refers-three-bills-on-legislative-agenda-to-committees/",
  "date_published": "2023-11-27T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): The House of Federation (Senate) on Monday deferred seven bills at the request of the relevant minister who was not present during the consideration.\nThe deferred bills, related to the Ministry of Interior, included the Price Control and Prevention of Profiteering and Hoarding (Amendment) Bill, 2023; the Guardians and Wards (Amendment) Bill, 2023; the Provincial Motor Vehicles (Amendment) Bill, 2023; the Prevention of Electronic Crimes (Amendment) Bill, 2023; the Prevention and Control of Human Trafficking (Amendment) Bill, 2023; the Factories (Amendment) Bill, 2023; and the Control of Narcotic Substances (Amendment) Bill, 2023.\nThe Chairman acceded to the minister’s request for deferring the bills, stating that the relevant minister is usually present, and this deferment is due to his absence. The movers and the House agreed to the deferment.\nAdditionally, three bills on the ‘Orders of the Day’ were referred to the relevant committees after their introduction in the House.\nThese bills were the Factories (Amendment) Bill, 2023; the National Occupational Health and Safety Bill, 2023; and the Federal Institute of Management Sciences Bill, 2023.\nAn introduced bill, the Federal Institute of Management Sciences Bill, 2023, faced opposition from the Caretaker Federal Minister for Parliamentary Affairs and Information, Murtaza Solangi.\nHe expressed that the institute falls under HEC, and necessary requirements, including NOC and feasibility, have not been fulfilled, leading to their opposition.\nHowever, the chair referred it to the committee as the mover acknowledged that it might face opposition in the relevant committee if necessary requirements are not met.",
  "retrievedAt": "2025-08-11T10:43:18.137Z"
}
