{
  "title": "BISP opens portal for applications of “BISP Savings Scheme”",
  "link": "https://www.app.com.pk/national/bisp-opens-portal-for-applications-of-bisp-savings-scheme/",
  "date_published": "2023-11-27T11:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): Benazir Income Support Program (BISP) has started receiving applications for its recently launched initiative of “BISP Savings Scheme” to make people self-reliant.\nAccording to the BISP, the scheme is currently being launched in Islamabad, Muzaffarabad, Neelam, Peshawar, Lucky Marwat, Quetta, Qila Saifullah, Lahore, Multan, Karachi, Sukkur, Gilgit and Astore\nThe applicants, having PMT score below 40, are required to apply through a web portal: savings.bisp.gov.pk for becoming a part of this scheme without paying any fee.\nThe applicants will open a saving account in the bank to participate in the scheme. Those who will participate in the scheme will deposit money from 500 to 1000 rupees monthly in their bank account.\nThe beneficiaries will get an additional 40 percent of their savings from the BISP.\nThe duration of the scheme is two years at the end of which the beneficiaries will be able to withdraw their entire amount.\nThe beneficiaries will not be able to withdraw their principal amount during this two-year period. However, the share given by BISP and the profit given by the bank will be able to be withdrawn.\nThe beneficiary can withdraw from the scheme at any time but rejoining will not be possible until the end of the scheme.\nChairperson BISP, Dr. Muhammad Amjad Saqib said that BISP is an important initiative of the government to stand with the deserving women and their families in their difficult times to reduce the intensity of their poverty level by providing them financial relief.\n“We have taken a step towards ensuring self-sufficiency through this programme by enabling those families having their poverty score below PMT 40 to open their accounts for saving some amount for their future”, he said.\n“BISP will not only help them open accounts but also add 40 percent of the total amount into their bank accounts”, he said.\nThe chairperson said that the purpose of this scheme is to motivate the people towards saving. “The amount they save will become an asset for the beneficiary families in the future”, the chairperson said.\nThe ultimate objective is to take a step towards creation of a welfare state with a strong belief on self-sufficiency, Dr. Saqib said while urging the deserving people to become part of the pro-poor initiative.\nSecretary BISP, Amer Ali Ahmed said that the portal has been opened for registration of the deserving people for this purpose.\nThe portal will only receive applications from the specific districts for now. If the applicants have any complaint, they can contact BISP through its toll-free number 0800-26477.\nBISP office will inform those applicants who are having PMT score below 40 about their eligibility status and they will become part of this scheme after confirmation through the toll- free number, he said.",
  "retrievedAt": "2025-08-11T10:43:17.584Z"
}
