{
  "title": "No wheat shortage ; ample stocks in country : Minister",
  "link": "https://www.app.com.pk/national/no-wheat-shortage-ample-stocks-in-country-minister/",
  "date_published": "2023-11-27T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): Minister for Parliamentary Affairs and Information, Murtaza Solangi on Monday said Pakistan currently had ample wheat stocks and concrete measures would be initiated to address any flour shortage due to supply chain problems.\nResponding to a motion under Rule 218 by Senator Sania Nishtar, focused on addressing gaps in the wheat supply chain that may lead to flour shortage, the minister stated that currently there was no wheat shortage in the country.\nSenator Nishtar had pointed out the specific lacuna in wheat policy, citing the conversion of green bags to white bags at the retail level. She also hinted at the smuggling as a factor, contributing to wheat shortages in addition to creation of systematic artificial shortages and hoarding.\nThe minister emphasized that there was an adequate stock of wheat in the country as public wheat stock included 39,24,367 metric tons in Punjab, 8,17,394 metric tons in Sindh, 2,15,082 metric tons in Khyber Pakhtunkhwa, and 89,354 metric tons in Balochistan. Pakistan Agricultural Storage & Services Corporation Ltd (PASSCO) accounted for 17,18,177 metric tons, he added.\nPrivate wheat stock comprises 3,37,270 metric tons in Punjab, 93,165 metric tons in Sindh, 14,918 metric tons in Khyber Pakhtunkhwa, and 4,157 metric tons in Balochistan.\nThe Minister for Parliamentary Affairs said that Pakistan had over seven million (7,213,884) metric tons of wheat, with an additional imported stock of 10,33,845 metric tons, ensuring there was no shortage.\nHe said the support price for provinces differed, being Rs 4600 in Punjab and Rs 4700 in Sindh.\nDuring discussions on the motion, Senator Dilawar Khan said that Pakistan should export wheat rather than its import and called for concessions to the agriculture sector.\nMaulana Abdul Ghafoor Haidri highlighted Balochistan’s agricultural challenges, emphasizing the lack of canal systems. He expressed concern about the removal of subsidies for poor farmers on electricity.\nSenators Dr. Zarqa Suharwardy Taimur and Rukhsana Zuberi stressed the need for a concrete solution to address the issue.\nThe minister acknowledged the collective wisdom of the Senate which ultimately provided guidance to the government. He said that discussions on the topic would be tabled before the Cabinet and Prime Minister for positive consideration.",
  "retrievedAt": "2025-08-11T10:43:15.044Z"
}
