{
  "title": "National media should amplify sufferings of flood-impacted communities at COP-28: Experts",
  "link": "https://www.app.com.pk/national/national-media-should-amplify-sufferings-of-flood-impacted-communities-at-cop-28-experts/",
  "date_published": "2023-11-27T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): The national media should amplify the sufferings of flood-affected communities during the upcoming International Climate Conference (COP-28) in Dubai, from 30th November to 12 December 2023.\nThis was discussed in an online training session on COP28 and the Role of National Media, organized by Resilient Future International -an Islamabad-based research and training company. Journalists and university students participated in the training session, a news release said.\nAftab Alam Khan, the lead trainer, has pointed out that while more than 5000 journalists are expected to attend COP28, many journalists from poor countries may not be able to attend due to financial constraints. He has emphasized the need for media houses and donors to support Pakistani journalists in attending such climate conferences.\nAftab Alam Khan noted that national media can play three roles during COP28, a) reminding the world about the continuous sufferings of flood-affected people, especially women, children, transgenders, elderly and disabled b) supporting the demands of meaningful Loss and Damage Fund and drastic cuts in greenhouse gases (GHGs) and c) to keep the nation aware of the proceedings of the climate conference.\nAftab Alam Khan emphasized that the International Conference of Parties (COP-28) on climate change was scheduled in Dubai, but the sufferings of climate injustice were evident in the flood-affected communities in Pakistan. COP28 presents an exceptional opportunity for Pakistani media to amplify the miseries of the climate victims. By playing such a role the media would complement the efforts of Pakistan and other countries in COP28 towards a meaningful agreement on Loss and Damage Fund. Last year, during COP27, Pakistan’s leadership in G77+China and a vigorous presentation of climate vulnerabilities brought the Loss and Damage Fund to the negotiation table.\nAftab added that the media should highlight the issue of the continuous rise in greenhouse gases (GHGs) generated from fossil fuels, which is the primary cause of climate change. The UN’s Intergovernmental Panel on Climate Change’s (IPCC) 2018 report stated that GHG emissions needed to be reduced by 45% by 2030. However, the current plans of top-emitting countries would lead to an increase in GHG emissions by 10.6%, which is insufficient to stop climate change. Those countries should commit to a drastic reduction in GHG emissions in COP28.\nThe Chair of the session, Dr Shafqat Munir, Deputy Executive Director of the Sustainable Development Policy Institute noted that journalists should also keep an eye on the preparatory work run up to COP28.\nThe Transitional Committee on Loss and Damage Fund met 5 times this year to deliberate on the nature and structure of the Fund.\nHe also added that the most important resource documents for journalists are, Nationally Determined Contributions and the National Adaptation Plan.\nSadia Bukhari appreciated the training session and narrated the impact of heatwaves and floods on women whereas, Mr Adeel Saeed, termed the session very useful and reflected on the impact of climate change on transgenders.",
  "retrievedAt": "2025-08-11T10:43:19.865Z"
}
