{
  "article_id": "2025-09-17_1bfa9c8b2dbe94e776ec323f14d353ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/terrorist-attacks-on-miryan-police-station-mazangah-checkpost-foiled/",
    "retrieved_at": "2025-09-19T16:58:44.558Z"
  },
  "metadata": {
    "title": "Terrorist attacks on Miryan police station, Mazangah checkpost foiled",
    "author": null,
    "date_published": "2025-09-17T13:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 227,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "BANNU, Sep 17 (APP):Police have foiled a terrorists attack on Miryan police station and mazangah checkpost on late Tuesday night. Sajjad Khan, Regional Police Officer Bannu told media that terrorists belonged to the Khawarij militants group launched heavy-weapon attacks on late Tuesday night on Miryan police station and mazangah checkpost. However, due to the timely, brave, and effective response by the police, both attacks were repelled and the terrorists were forced to flee. He said the terrorists attacked Miryan police station from all sides in large numbers, but were forced to escape as a result of a strong police counteraction. After the attack on the Miryan police station, the terrorists also targeted Mazangah police checkpost but had to retreat due to the police's retaliatory fire. The terrorists used rocket launchers and other heavy weapons in both attacks. Reports indicated that the outlaws suffered heavy losses due to the police's effective response. During the operation, four police officers sustained minor injuries and were provided with immediate medical assistance. According to RPO Bannu, the situation is completely under control. RPO Sajjad Khan, said that such cowardly acts by terrorists cannot weaken the morale of the brave officers. He affirmed that the police personnel are always ready to deal with any emergency situation, and the protection of the lives and property of the public will be ensured at all costs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}