{
  "title": "PM for sustained Pak-Belarus exchanges to enhance cooperation in investment, joint tractors production",
  "link": "https://www.app.com.pk/national/pm-for-sustained-pak-belarus-exchanges-to-enhance-cooperation-in-investment-joint-tractors-production/",
  "date_published": "2024-10-15T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): Prime Minister Shehbaz Sharif on Tuesday called for sustained exchanges between Pakistan and Belarus to realise the potential of bilateral cooperation, particularly in the areas of trade, investment, agricultural machinery and joint production of tractors and connectivity.\nThe prime minister, who held a bilateral meeting with Belarusian Prime Minister Roman Golovchenko, on the sidelines of SCO Council of Heads of Government (CHG) meeting here, recalled his “warm and productive” meeting with President Aleksandr Lukashenko in Astana in July earlier this year and stressed sustaining regular high-level exchanges considering their positive momentum on bilateral ties, according to a PM Office press release.\nWelcoming Belarus’ participation in the SCO CHG meeting, Prime Minister Shehbaz felicitated Belarus on becoming SCO’s full member and reiterated Pakistan’s commitment to working closely with Belarus in fostering the “Shanghai Spirit”.\nGolovchenko warmly congratulated Pakistan on successful conduct of the SCO CHG meeting and its positive outcomes.\nHe thanked Pakistan for the warm welcome and hospitality extended to him and his delegation.\nPrime Minister Roman Golovchenko assured that Belarus would closely collaborate with Pakistan, in its capacity as SCO CHG Chair, to promote the organization’s purposes, principles and priorities.\nHe expressed satisfaction over the positive direction of bilateral relationship between the two countries and reciprocated Pakistan’s desire to further strengthen mutually beneficial cooperation across all spheres of shared interest through joint efforts.",
  "retrievedAt": "2025-08-10T20:04:43.588Z"
}
