{
  "title": "Pakistan, China agree to continue deepening bilateral cooperation in various fields",
  "link": "https://www.app.com.pk/global/pakistan-china-agree-to-continue-deepening-bilateral-cooperation-in-various-fields/",
  "date_published": "2024-10-15T17:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): Pakistan and China have agreed to continue to deepen cooperation in various fields and accelerate efforts to build an even closer Pakistan-China community with a shared future in the new era.\n“The two sides noted that in a transforming and turbulent world where major changes are unfolding at a faster pace, the Pakistan-China relationship is of strategic significance, and any attempt to disrupt or undermine Pakistan-China cooperation is bound to fail. Pakistan and China enjoy an all-level, cross-board and high-quality relationship. The Chinese side reiterated that the China-Pakistan relationship is a priority in its foreign relations. The Pakistani side underscored that the Pakistan-China relationship is the cornerstone of its foreign policy while the Chinese side highlighted that the China-Pakistan relationship is of special significance in China’s foreign policy,” a joint statement between the Islamic Republic of Pakistan and the People’s Republic of China, shared by Foreign Office Spokesperson on Tuesday, said.\nThe two sides expressed grave concern over the protracted conflict in Gaza and the dire and rapidly deteriorating humanitarian situation, and urged for an immediate and permanent ceasefire as well as efforts to ensure unimpeded humanitarian assistance.\nThe two sides reaffirmed their support for the right of the Palestinian people to self-determination, including their right to establish an independent State of Palestine.\nBoth sides expressed support for resuming the process of political settlement and their readiness to work with the rest of the international community to promote a comprehensive, just and lasting settlement of the Palestinian question.\n“The two sides expressed grave concern over recent Israeli aggression on Lebanon, which further escalated the tension in the region. We oppose practices that violate the purposes and principles of the Charter of the United Nations, the violation of Lebanon’s sovereignty, security and territorial integrity and oppose moves that fuel antagonism and escalate tensions. Pakistan and China call on the international community, especially major countries with influence, to play a constructive role and avoid further turmoil,” it was added.\nPakistan and China reaffirmed their commitment to an upgraded version of China Pakistan Economic Corridor (CPEC) by jointly building a growth corridor, a livelihood-enhancing corridor, an innovation corridor, a green corridor and an open corridor, and develop CPEC into a demonstration project of high-quality Belt and Road cooperation.\n“The two sides agreed to further synergize China’s eight major steps for supporting Belt and Road cooperation with Pakistan’s 5Es framework based on Exports, E-Pakistan, Environment, Energy, and Equity & Empowerment.”\nThe Pakistani side positively assessed the visit by the Chinese working team on economic cooperation, and expressed its willingness to continue experience-sharing on development in various areas with the Chinese side.\nAt the invitation of Muhammad Shehbaz Sharif, Chinese Premier Li Qiang paid an official visit to Pakistan from October 14 to 17.\nThe two sides underscored that since the establishment of diplomatic ties, Pakistan-China relations have withstood the test of times and have remained rock-solid.\nSince President Xi Jinping’s historic state visit to Pakistan in 2015, the All-Weather Strategic Cooperative Partnership between the two countries has made significant progress.\nAfter Prime Minister Shehbaz Sharif’s successful official visit to China in June 2024, the two countries have enjoyed even stronger political mutual trust, more vibrant cooperation, and closer strategic coordination. Both sides expressed satisfaction with the momentum of Pakistan-China relations and agreed to further strengthen the ironclad friendship and cooperation between the two countries.\nThe Pakistani side highly commends and firmly supports major visions and propositions put forth by President Xi Jinping, such as fostering a community with a shared future for mankind, the Belt and Road Initiative, the Global Development Initiative, the Global Security Initiative, and the Global Civilization Initiative. Both sides advocate for an equal and orderly multipolar world and a universally beneficial and inclusive economic globalization, and are committed to working together with all countries around the world for a bright future of peace, security, prosperity and progress.\nThe two sides agreed to maintain the momentum of exchanges under the strategic guidance of the top leaders for the development of bilateral relations. They agreed to further strengthen exchanges and cooperation at all levels and across various fields between governments, legislative bodies and political parties.\nThe Pakistani side expressed warm congratulations on the 75th anniversary of the founding of the People’s Republic of China and the successful conclusion of the Third Plenary Session of the 20th Central Committee of the Communist Party of China and highlighted that China’s endeavor to further deepen reform comprehensively and advance high-standard opening up will bring new development opportunities for Pakistan and all other countries around the world. The Chinese side commends the new achievements attained by Pakistan in economic reform and development under the leadership of Prime Minister Shehbaz Sharif. The two sides reaffirmed their firm support to each other in independently choosing a development path that suits their respective national realities, and agreed to strengthen exchanges of governance experience and foster greater synergy between their development strategies.\nThe two sides reaffirmed their unyielding support for each other on the issues concerning their respective core interests and major concerns.\nBoth sides stressed that the authority of the U.N. General Assembly Resolution 2758 brooks no question or challenge. The Pakistani side reaffirmed its firm commitment to one-China principle, and reiterated that Taiwan is an inalienable part of the territory of the People’s Republic of China, and that Pakistan firmly supports all efforts made by China to achieve national reunification, firmly opposes any form of “Taiwan independence,” and will firmly support China on issues concerning Xinjiang, Xizang, Hong Kong and the South China Sea. The Chinese side reiterated its unwavering support for Pakistan in defending national sovereignty, independence, and territorial integrity, and its support for Pakistan’s efforts to safeguard national security, stability, development and prosperity.\nFollowing the important common understanding between leaders of the two countries, the two sides reaffirmed their readiness to advance the upgradation of ML-1, and agreed to build Karachi-Hyderabad section in line with the modality of “implementing in a phased manner.” The two sides will work together to refine and optimize the construction plan of Karachi-Hyderabad section and formulate financing and implementation plans that are feasible and sustainable at the earliest.\nThe two sides agreed to actively seeking financial support for the Karakoram Highway (Raikot-Thakot) realignment project under the terms of the Framework Agreement of the project.\nMeanwhile, the two sides agreed to continue harnessing the Intergovernmental Joint Technical Working Group for the Karakoram Highway (Raikot-Thakot) realignment project, and see to it that it provides technical guidance during the entire process of implementation, so as to facilitate the project’s early execution.\nRecognizing the significance of the Gwadar Port as a key hub for cross-regional connectivity, the two sides reaffirmed their readiness to speed up the development of the auxiliary infrastructure of the Gwadar Port, to steadily attract more cargo shipments to the port, to find a solution to inadequate water and power supply at an early date, to accelerate the development of the port’s industrial zone, and to solidly enhance connectivity between the port and other parts of Pakistan. During the visit, leaders of both sides attended the completion ceremony of the New Gwadar International Airport.\nThe two sides agreed to further strengthen industrial cooperation suited to local conditions, and promote international cooperation on industrial and supply chains.\nThe Chinese side reiterated its support for Chinese companies to invest in Pakistan’s Special Economic Zones in line with the market and commercial principles.\nThe Pakistani side reiterated its commitment to improving its business environment and providing a favorable policy framework for Chinese investment. Both sides welcome the active participation of third parties in CPEC cooperation.\nThe two sides reaffirmed their willingness to actively encourage Chinese companies to engage in investment and cooperation in Pakistan’s mining industry, and jointly explore the planning of mining industrial parks, including downstream mineral processing.\nThe two sides agreed to further strengthen their practical cooperation in areas such as crop cultivation, animal husbandry, epidemic prevention and control for plants and animals, agricultural mechanization, agricultural technical exchange, and capacity building for modernization & resilience of Pakistan’s agriculture. The two sides agreed to continue to promote agricultural cooperation between China’s Xinjiang and Pakistan.\nThe two sides positively assessed the achievements of Pakistan-China energy cooperation, and agreed to continue to promote the CPEC energy cooperation in a practical, prudent and orderly manner.\nThe two sides will jointly explore solutions for specific issues based on scientific research and friendly consultation. The two sides agreed to strengthen professional exchanges on improving the efficiency and management of the power system of Pakistan.\nThe two sides agreed to continue advancing practical cooperation in such areas as basic geological survey, resource potential evaluation, offshore oil and gas resources exploration, and natural gas hydrates, carrying out exchanges and training on geological technology, and work toward conducting a new round of Pakistan-China joint survey of marine geology. The two sides agreed to conduct further consultation on promoting trade liberalization under the framework of the Phase-II of China-Pakistan Free Trade Agreement, and actively explore the possible bilateral concessional arrangements based on the spirit of mutual benefit and win-win cooperation.\nThe Chinese side welcomed Pakistani enterprises to make full use of platforms such as the China International Import Expo to expand bilateral trade, and supports Pakistan enhancing its exports to China.\nThe Pakistani side welcomed Chinese enterprises to expand investment in priority sectors for enhancing export-oriented industries as identified by Pakistan.\nThe two sides agreed to facilitate deeper exchanges and cooperation between business communities of the two countries.\nThe Pakistani side expressed high appreciation for China’s valuable support for the fiscal and financial stability of Pakistan.\nThe two sides spoke highly of the extension of the China-Pakistan Bilateral Currency Swap Arrangement, and agreed to further strengthen bilateral cooperation in the financial and banking sectors, and support each other within regional and international multilateral financial platforms.\nThe Chinese side expressed willingness to continue supporting Pakistan in improving the well-being of its people, aiming to ensure that development benefits reach all regions and communities.\nThe Pakistani side expressed its appreciation for China’s support, particularly in providing solar lighting equipment and health kits as well as contributing to the development of key projects such as the China-Pakistan Friendship Hospital, the China-Pakistan Technical and Vocational Institute, and the desalination plant in Gwadar.\nBoth sides agreed to strengthen their cooperation under the framework of the CPEC Working Group on Socio-Economic Cooperation, particularly in areas like healthcare, agriculture, education, climate response, and disaster prevention, while continuing to promote projects that improve people’s livelihoods.\nThe Chinese side spoke highly of Pakistan’s unremitting efforts and tremendous sacrifices in combating terrorism, and its contributions to maintaining international peace and security.\nThe two sides reiterated their commitment to combating terrorism in all its forms and manifestations with a zero-tolerance attitude, and agreed to further strengthen bilateral and multilateral cooperation in counterterrorism, and jointly oppose the politicization and instrumentalization of counterterrorism. The two sides expressed readiness to work with the international community to strengthen multilateral counter-terrorism cooperation within frameworks such as the U.N. and the SCO.\nThe Pakistani side strongly condemned the terrorist attack on the vehicle of Chinese personnel working on the Dasu Hydropower Project in Pakistan on March 26, 2024, and the terrorist attack on the Chinese convoy of the Port Qasim Power Plant on October 6, 2024, and pledged to find out the whole truth of the above incidents, and hunt down and bring to justice all the perpetrators.\nThe Pakistani side emphasized its firm and unswerving commitment to further enhancing security input and coordination, further strengthening security measures, and making comprehensive efforts to ensure the safety and security of Chinese personnel, projects and institutions in Pakistan.\nThe two sides underscored that strategic defence and security cooperation between Pakistan and China plays an irreplaceable and critical role in maintaining peace, stability and strategic balance in the region.\nThe two sides expressed satisfaction that the two militaries have long enjoyed high-level of mutual trust, high-level cooperation, and high-level coordination. The two sides agreed to maintain the momentum of high-level military-to-military visits and exchanges, and to continuously elevate cooperation in areas of joint training, exercises and military technology.\nThe two sides reaffirmed their commitment to jointly upholding the international system with the U.N. at its core, the international order based on international law, and the basic norms governing international relations underpinned by the purposes and principles of the U.N. Charter.\nThe two sides will continue to uphold the core values and basic principles of the World Trade Organization, oppose decoupling and disrupting supply chains, and firmly resist unilateralism and protectionism.\nThe two sides reaffirmed the importance of maintaining peace and stability in South Asia and the need for resolution of all outstanding disputes, and their opposition to any unilateral action.\nThe Pakistani side briefed the Chinese side on the latest developments of the situation in Jammu and Kashmir.\nThe Chinese side reiterated that the Jammu and Kashmir dispute is left over from history, and should be properly and peacefully resolved in accordance with the U.N. Charter, relevant U.N. Security Council resolutions and bilateral agreements.\nThe two sides agreed to strengthen communication and coordination on the issue of Afghanistan.\nBoth sides call for concerted efforts of the international community to encourage the Interim Afghan Government to build an inclusive political framework, adopt moderate policies and pursue good-neighborliness.\nThey also called for strengthening counter-terrorism cooperation at bilateral and multilateral levels to support Afghanistan in taking comprehensive measures to eradicate terrorism and called on the Interim Afghan Government to take visible and verifiable actions to dismantle and eliminate all terrorist groups based in Afghanistan which continue to pose a serious threat to regional and global security, and to prevent the use of Afghan territory against its neighbors, the region, and beyond.\nThe two sides also agreed to play a constructive role in helping Afghanistan achieve stable development and integrate into the international community.",
  "retrievedAt": "2025-08-10T20:05:13.164Z"
}
