{
  "title": "Pakistan considers China one of its closest friends: Gilani",
  "link": "https://www.app.com.pk/national/pakistan-considers-china-one-of-its-closest-friends-gilani/",
  "date_published": "2024-10-15T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): Chairman Senate Syed Yousaf Raza Gilani met with the Premier of the People’s Republic of China, Mr. Li Qiang, on Tuesday and said that Pakistan considers China one of its closest friends, with both nations committed to mutual trust, respect, and goodwill.\nThe meeting, aimed at deepening the bond of friendship and enhancing bilateral cooperation, particularly in the fields of economics, trade, and investment said a news release issued by the Senate Secretariat.\nHe underscored the historic ties between Pakistan and China, tracing back over 2,000 years to the ancient Silk Road, which served as a bridge of friendship between the two ancient civilizations.\nHe acknowledged the strong amity that has characterized Pakistan-China relations since the establishment of diplomatic ties in May 1951 and said that Pakistan was one of the first countries to recognize the People’s Republic of China.\nPaying tribute to the visionaries who built this enduring relationship, including former Prime Ministers Shaheed Zulfikar Ali Bhutto and Shaheed Benazir Bhutto, as well as Chinese leadership, he reflected on their contributions to solidifying ties between the two nations.\nRecalling his tenure as Prime Minister, Gilani highlighted the importance of high-level interactions that have consistently strengthened bilateral relations.\nHe also highlighted the crucial role of parliamentary cooperation, referencing recent visits by Pakistani delegations aimed at advancing this essential partnership.\nAddressing the issue of security, he condemned terrorism in all its forms and reaffirmed Pakistan’s commitment to ensuring the safety of Chinese nationals working on development projects within the country.\nHe said that any attack on Chinese citizens would be considered an attack on Pakistan itself, underscoring the solidarity between the two nations in combating extremism and terrorism.\nHe also praised the robust defense cooperation between Pakistan and China, noting significant joint projects such as the production of the JF-17 Thunder fighter jet. He expressed gratitude for China’s continued support in enhancing Pakistan’s national defense capabilities.\nOn the economic front, the Chairman discussed the progress made under the China-Pakistan Economic Corridor (CPEC), which serves as a vital framework for strengthening trade relations.\nHe noted the commendable growth in bilateral trade, with imports from China reaching $13.50 billion and exports to China increasing to $2.707 billion in FY24.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:05:46.041Z"
}
