{
  "article_id": "2025-08-02_097d8b3f33f1853428d17f36ee6f8e27",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/business/pakistan-romania-eye-stronger-trade-strategic-cooperation/",
    "retrieved_at": "2025-08-03T10:25:33.518Z"
  },
  "metadata": {
    "title": "Pakistan, Romania eye stronger trade, strategic cooperation",
    "author": null,
    "date_published": "2025-08-03T14:21:12+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 02 (APP): Federal Minister for Commerce Jam Kamal Khan and Romanian Ambassador Dan Stoenescu held a productive meeting in Islamabad, discussing enhanced cooperation in trade, logistics, defense, energy, and culture. Ambassador Stoenescu proposed using Romania's Constan?a Port as a direct trade route for Pakistani exports into Europe via the Black Sea and Danube River. The Minister welcomed this as a viable step toward diversifying Pakistan's export logistics,said a release issued here on Saturday. Both sides discussed boosting agri-trade, meat exports, and potential cooperation in pharmaceuticals, surgical goods, fans, and green energy. On energy, Romania expressed readiness to support Pakistan's shift to green energy, offering technology in solar and wind power. Romania acknowledged Pakistan's competitive edge in several sectors and expressed interest in deeper industrial collaboration. The Commerce Minister apprised the Ambassador that Government of Pakistan has started reducing tariff and non-tariff barriers. This offers lucrative incentives for Romanian companies to invest in Pakistan through JVs. Ambassador Stoenescu acknowledged the remarkable growth of Pakistan's IT industry and commended the talent and capabilities of Pakistani professionals in this sector. He noted that Romania offers significant opportunities for Pakistani tech professionals and expressed willingness to facilitate such exchanges. The Commerce Minister highlighted the policy initiatives undertaken by the Government to promote the IT sector, emphasizing that Pakistani professionals are successfully competing with their regional peers and possessing the expertise to deliver world-class services to international clients. Both sides agreed to strengthen cooperation in the technology sector. Cultural diplomacy and community integration were also addressed, with calls to improve connectivity and visa facilitation. The meeting ended on a positive note, with both sides committed to strengthening ties through follow-up engagements and trade exhibitions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}