{
  "title": "KP govt taking practical steps to promote industrialization",
  "link": "https://www.app.com.pk/national/kp-govt-taking-practical-steps-to-promote-industrialization/",
  "date_published": "2020-02-16T21:28:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 17 (APP):Khyber Pakhtunkhwa Chief Minister Mahmood Khan Monday said the provincial government was taking practical steps to promote industrialization and attract investors.\nAddressing the agreement signing ceremony between PEDO & PESCO for wheeling of electricity, the chief minister termed the agreement a landmark achievement for the KP government.\nMahmood Khan stated that under the agreement, 18 MW electricity from Pehur Power Project will be provided to industries in Khyber Pakhtunkhwa including Gadoon Textile Mills Limited, Cherat Packaging Limited, AG Textile Limited, Premier Chip Board Industries Limited and Cherat Cement Company Limited, at a cheaper price which will help in revival of local industries along with attracting investors and promoting industrialization in the province.\nAccording to details, the Wheeling Regime will not only generate Rs 305 million revenue every year but also generate 3000 employment opportunities directly.\nThe chief minister clarified that due to the successful policies of the incumbent government, 74 MW of electricity produced from hydel power stations in the province has successfully been included in the national grid which will generate Rs 1.9 billion revenue every year.\nHe said the provincial government was committed to exploit the hydel potential in the province for generating cheap electricity which would help in overcoming power shortages across the country and would attract investors into the province thereby increasing the provincial revenue generation.\nHe stated that through investment friendly policies, the provincial government was attracting investors whereas implementation on energy and power action plan was also being carried out under which various hydel power projects have been completed. The work progress is underway on numerous small, medium and large hydel power projects, he added.\nMahmood Khan clarified that the Wheeling Model for provision of cheap electricity to industrial consumers and initiation of public private partnership was evidence enough to show the government’s commitment to increase the provincial revenue generation through rapid industrialization and strengthening of communication networks.\nThe ceremony was also attended by Advisor to CM on Energy & Power Hamyatullah Khan, Secretary Energy & Power Muhammad Zubair Khan, Chief Executive PEDO Engr Naeem Khan, PESCO Chief Dr. Amjad Ali Khan and other officials.\nAdvisor to CM on Energy & Power Hamayatullah Khan, on this occasion, stated that the incumbent government has also planned four new public sector projects including Balakot Hydro Power project, Barikot, Patral Sheringal and Gabral Kalam Hydro power project in the energy sector on which construction work is expected to begin during the current fiscal year and will be completed in 2025. Once completed, the projects will generate Rs17860 million revenue annually.",
  "retrievedAt": "2025-08-11T18:48:46.412Z"
}
