{
  "title": "PAC Kamra hands over three JF-17 Thunder aircrat to Nigerian Airforce",
  "link": "https://www.app.com.pk/national/pac-kamra-hands-over-three-jf-17-thunder-aircrat-to-nigerian-airforce/",
  "date_published": "2021-05-21T07:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Pakistan Aeronautical Complex (PAC) Kamra formally handed over three JF-17 Thunder aircraft to Nigerian Air Force, during a graceful ceremony held at Nigerian Air Force Base, Makudri to mark the 57th anniversary of Nigerian Air Force.\nMinister of Defence of Nigeria Major General (R) Bashir Magashi was the Guest of Honour representing the President, at the occasion, whereas Vice Chief of the Air Staff, Pakistan Air Force Air Marshal Syed Noman Ali was invited to attend the ceremony as special guest of Nigerian Air Force, said a Pakistan Air Force (PAF) media release here received.\nAddressing the ceremony, the Guest of Honour expressed his gratitude to Pakistan and PAF for sustained bilateral cooperation and partnership for enhancing Nigerian Air Force capabilities to meet Nigeria’s security challenges.\nReferring to the new induction, he said, “We are happy and excited on the addition of JF-17 fighter aircraft from Pakistan”.\nExpressing his views at the occasion, Air Marshal Syed Noman Ali said that today’s event was not only a historical landmark for Pakistan’s JF-17 programme but was also a reflection of strong military cooperation and mutual trust between Nigeria and Pakistan.\nHe further said that the JF-17 aircraft with its unique fighting capabilities would prove to be a potent platform in addressing the security requirements of Nigeria.\nHe also assured that Pakistan Air Force and Pakistan Aeronautical Complex would continue to provide all out support to Nigerian Air Force in meeting all its requirements.\nNigeria has inducted JF-17 Thunder aircraft from Pakistan. It is pertinent to note that PAC Kamra delivered the aircraft to NAF as per the scheduled timelines earlier this year in March, despite the impediments of COVID-19 pandemic.",
  "retrievedAt": "2025-08-11T20:45:05.685Z"
}
