{
  "title": "President urges China, Pakistan to lead towards multilateralism, establish morality-based institutions",
  "link": "https://www.app.com.pk/national/president-urges-china-pakistan-to-lead-towards-multilateralism-establish-morality-based-institutions/",
  "date_published": "2021-05-21T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): President Dr Arif Alvi Friday said as both China and Pakistan stood for peace, they had the great opportunity to lead the world towards multilateralism and ensure the establishment of morality-based institutions in the future.\nThe president, in his address as chief guest at the Virtual Reception on 70th Anniversary of China-Pakistan Diplomatic Relations, said the vested interests instead of the morality were dominating in international affairs at diffident forums in the world, that was why the oppressed people of Kashmir and Palestine did not get any hearing.\nEven, the promises made to the Kashmiri and Palestinian people were not fulfilled just because of the vested interests, he told the event also attended by Senate Chairman Sadiq Sanjrani, Chairman Joint Chiefs of Staff Committee General Nadeem Raza, federal ministers, politicians and Chinese Ambassador in Pakistan Nong Rong.\nThe virtual reception was jointly organized by Ministry of Foreign Affairs and Chinese Embassy in Islamabad to mark the 70th anniversary of bilateral diplomatic relations established on May 21, 1951.\nThe president said the goals of China and Pakistan was friendship but both the countries cemented their goals for humanity.\nHe said at a time when environment and global warming were the issues, peace was also essential and both China and Pakistan also believed in that endeavor.\n“China and Pakistan have great opportunity to lead the world, in the matter of trade towards multilateralism, towards not creating or raising walls for each other’s products as well as to establish institutions and ensure that the institutions in future are morality based which is the foundation of our relationship. The more we move forward in that direction, the more peace we will have,” the president remarked.\nHe thanked President Xi Jinping for the congratulatory letter to him and congratulated China on successful landing on Mars which he said proved that the country was second to none in the field of science and technology.\nReferring to China’s journey towards a developed country by uplifting around 800 million people out of poverty, the president said Pakistan should also strive for and learn from it.\nHe said the during the seven decades, the bilateral friendship stood firm and even got stronger into strategic partnership and people to people contacts.\nCalling both the countries “Iron brothers”, the president said Pakistan and China believed in a future which bound the people together and lead them to prosperity and peace.\nPresident Alvi said China was the largest trading and investment partner of Pakistan having collaboration in the fields of agriculture, trade, finance, education, science and technology was strengthening , beside the cooperation between the two people.\nHe said Pakistan fully supported President Xi Jinping’s Belt and Road Initiative of which CPEC was important part. From the beginning, when Pakistan needed to improve its energy supplies, establish industry not only along the route but across the country, special economic zones, CPEC was going to be a harbinger.\nHe highly appreciated China for “exemplary handling” of COVID-19 pandemic and recalled his China visit in March last year. He also thanked China for sending medical team and now vaccine to Pakistan and added that the Chinese assistance and advance learning helped Pakistan a lot.\nHe said currently, around 30,000 Pakistani students are studying in China, benefiting from China’s advanced educational system. We have established seven sister-province and fourteen sister-city relationship with China. Seven Pakistan study centers, eleven Urdu language departments in various Chinese universities, and four Confucius Institutes in Pakistan are promoting cultural understanding and further reinforcing the everlasting friendship between the two countries, he added.\nThe president said that Pakistan had done reasonably well to handle the pandemic comparing the regional countries but the country still needed to be careful during the third wave.\nHe said both the countries stood for humanity and Pakistan was learning from China as how it focused on health, education and investment to encourage people to rise on their own.\nHe said both countries had a vision for peace and improvement in the health and education standards and ensure food security.\nHe reaffirmed the commitment to build a closer Pakistan-China community of shared future in the new era where the people of China and Pakistan stood together in friendship leading the world towards peace and prosperity.\n“It is important that this message goes out and this camaraderie spreads throughout the world,” the president concluded.\nStarted with the national anthems of China and Pakistan, the ceremony also featured a documentary showing the 70—year journey of bilateral ties and a special song with a mix of Chinese and Urdu lyrics sung by Singer Sahir Ali Bagga.\nIn his address, Senate Chairman Sadiq Sanjrani said Pakistan was the first Muslim nation to recognize China and establish diplomatic ties and since then, both the countries maintained a close cooperation.\nReferring to the institutional cooperation including the parliaments, the Senate chairman said construction of KKH, Heavy Industries Complex, JF-17 Thunder, multiple hydropower projects and CPEC were the fruits of the seven-decade old friendship.\nHe hoped that the CPEC would prove to be an example of bilateral cooperation for the world and added that the bilateral cooperation also got strengthened by the cultural exchanges and establishment of sister cities.\nChairman Joint Chiefs of Staff Committee General Nadeem Raza said the China-Pakistan ties withstood pressure of geopolitics.\nHe said starting from the construction of Karakorum Highway, the bilateral cooperation had entered into many further avenues.\nReiterating Pakistan’s support for One-China Policy, the Chairman JCSC said the defence and security cooperation also played key role during last seven decades.\nChinese Ambassador Nong Rong said since establishment of bilateral ties, the China-Pakistan friendship remained rock solid and also became role model of state to state relations.\nHe recalled that President Alvi’s visit to China last year amidst COVID-19 pandemic was manifestation of the bilateral friendship, adding that the friendly and pragmatic cooperation remained fruitful during the seven decades.\nMoreover, the ambassador said CPEC had become an important platform for cooperation between the two nations which had been extended to multiple areas like energy, agriculture, S$T and livelihood covering all aspects of Pakistan’ development.\nThe ambassador also thanked Pakistan for allowing clinical trial of Chinese vaccine in the country.",
  "retrievedAt": "2025-08-11T20:45:01.501Z"
}
