{
  "title": "Alvi, Xi vow to deepen Pak-China ties, achieve high quality CPEC development",
  "link": "https://www.app.com.pk/national/alvi-xi-vow-to-deepen-pak-china-ties-achieve-high-quality-cpec-development/",
  "date_published": "2021-05-20T19:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): As Pakistan and China observe 70th anniversary of the establishment of bilateral diplomatic relations on Friday, President Dr Arif Alvi and Chinese President Xi Jinping vowed to deepen bilateral cooperation and achieve high quality development of China-Pakistan Economic Corridor (CPEC).\nBoth the leaders exchanged congratulatory letters to each other wherein they extended greetings to each other on behalf of their respective governments and people.\n“On this historic occasion, we reaffirm our commitment to further elevate Pakistan-China friendship to new heights and build Closer China-Pakistan Community of Shared Future in the new era,” President Alvi said in his letter to President Xi Jinping.\nHe also conveyed his best wishes for the Chinese president’s good health and happiness, and continued progress and prosperity of the people of China.\nIn his letter, Xi Jinping said China and Pakistan were all-weather strategic cooperative partners that stood firmly by each other on issues of core interests and major concerns.\n“The mutual trust and friendship between the two countries have gone through the test of 70 years of international changes and remain rock-solid, and have become the most valuable strategic asset of the two peoples,” he stated.\nHe said in recent years, with the joint efforts of both sides, the construction of the China-Pakistan Economic Corridor (CPEC) had achieved remarkable results, bringing tangible benefits to the people of both countries, and adding strong impetus to the regional prosperity.\n“In the face of the COVID-19 pandemic, China and Pakistan have shared weal and woe, and sincerely helped each other, and the ironclad friendship between the two countries has been further sublimated,” President Xi said.\nHe said he attached great importance to the development of China-Pakistan relations.\n“I am ready to work with Your Excellency to deepen strategic communication and pragmatic cooperation between the two countries, promote the high-quality development of the CPEC, and work together to build a closer China-Pakistan Community of Shared Future in the new era, for the benefit of the two countries and the two peoples,” he remarked.",
  "retrievedAt": "2025-08-11T20:45:07.616Z"
}
