{
  "title": "Murad, Chinese envoy unveil postage stamp on 70th anniversary of diplomatic relations between Pak-China",
  "link": "https://www.app.com.pk/national/murad-chinese-envoy-unveil-postage-stamp-on-70th-anniversary-of-diplomatic-relations-between-pak-china/",
  "date_published": "2021-05-21T12:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Federal Minister for Communications and Postal Services Murad Saeed said on Friday issuance of commemorative postage stamp on 70th anniversary of diplomatic relations between Pakistan and China was a testimony to the time-tested and everlasting friendly relations.\nHe stated this while addressing at the unveiling ceremony of the Commemorative Postage Stamp on the 70th anniversary of diplomatic relations between Pakistan and China here at ECO Postal Staff.\nAmbassador of the People’s Republic of China Nong Rong, Secretary Communication Zafar Hasan, Director General Pakistan Post Khalid Javed and other senior officials of Pakistan Post were also present on the occasion.\nThe minister said that friendly relations between Pakistan and China are higher than Himalaya and deeper than the ocean. He further stated that China Pakistan Economic Corridor (CPEC), a joint venture is going to change the future course of history in the region in terms of socio-economic development. “For both the countries and region, CPEC will be a game changer, he further added.\nMurad also extended special gratitude to the Ambassador of the People’s Republic of China for gracing the occasion. He said China is the most trusted and time tested friend of Pakistan and both the neighboring countries cherish their friendship more than any other.\n“Since its establishment on May 21, 1951, the relationship between both the countries has built on its strength of its successive achievements and has become formidable with each passing day and year”, he said, adding that the leadership of the both countries is committed to taking this relationship forward.\nMurad Saeed said the commemorative stamp has a special significance to highlight the importance of both the ports i.e. Gwadar Port Pakistan and Zhuhai Port China. “Gwadar Port, as a part of China Pakistan Economic Corridor (CPEC) is a game changer not only for Pakistan but the whole region as the socio-economic development of the region is largely dependent upon as this project. Due to its unique geographical location Gwadar port provides crosscut link to all Central Asian states including Afghanistan and Russia”, he added.\nThe minister said that China has always extended its support to Pakistan in time of needs. He also appreciated China support to Pakistan on the Indian Occupied Jammu and Kashmir (IOJK). He said that Pak-China friendship was not only at government level but also enjoying people to people contact.\nThe minister further said that next week Multan-Lodhran Motorway project foundation stone would be laid; adding that after 20 days, work would also be started on Sialkot-Kharian Phase-1. He said work would also be commenced on Khariyan-Rawalpindi in current year.\nHe said that Hakla-Dera Ismail Khan Motorway project would be completed by July and will be inaugurated in August.\nMurad said entire nation was standing with brothers of Palestine and Solidarity Day with Palestinians was observed today in the country.\nAmbassador of China Nong Rong said that great honour to participate in the inauguration ceremony of commemorative postage stamp. He said that it was jointly designed by Pakistan and China.\nHe said that Pakistan and China was iron brothers and our relations have become a role model.\n“We are working together under the leadership of Pakistan and China to further strengthen our bilateral and friendly relations. He said that this stamp was small in size but great in influence, adding that mutual understanding allow Pak-China to further move forward and promote people to people contact between the two brotherly countries.\nChina Ambassador highly appreciated the issuance of commemorative stamps on the eve of 70th diplomatic relationship between the two friendly counties and stated that the unprecedented Pak-China friendship is cherished equally by both countries,\nEarlier, In his welcome remarks, Secretary Ministry of Communications Zafar Hasan said that Gwadar Port has immense potential to connect Pakistan and China with the world.\nHe said that Pakistan Post and China Post both administration have great opportunities to further strengthen its partnership.",
  "retrievedAt": "2025-08-11T20:45:01.460Z"
}
