{
  "title": "PM sees ray of hope amidst changing world public opinion for Palestinians",
  "link": "https://www.app.com.pk/national/pm-sees-ray-of-hope-amidst-changing-world-public-opinion-for-palestinians/",
  "date_published": "2021-05-21T15:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Prime Minister Imran Khan Friday said that with the changing world public opinion, he was hopeful that Israel would soon fall under pressure of the global powers to grant equal rights to the oppressed Palestinian people.\n“I am seeing a welcoming change. What is that? The world’s public opinion is changing… This is for the first time that the voices were raised from there. Their newspapers criticized it. Their media spoke against it. And politicians also stood against it which I never thought would happen in US and western states,” the prime minister said in his televised message to the nation on Palestine situation.\nHe said having spent plenty of time in West, he never saw their newspapers, media and politicians criticizing Israel as the country had already been attacking Palestinians. Rather they all used to portray Israel as victim, he added.\nHe said the social media was major reason behind that change of world’s public opinion which disseminates all the information which the mainstream media censors.\nAs the country observed Palestine Solidarity Day on Friday, the prime minister paid gratitude to the countrymen who took to streets in huge number to support the Palestinians and condemn the Israeli aggression.\nImran Khan said since the creation of Israel, Pakistan remained stick to Quaid-e-Azam Muhammad Ali Jinnah’s stance that it was an injustice to the Palestinian people and supported them at every forum.\nLIVE #APPNews : Prime Minister Imran Khan message on Palestine Solidarity Day #UnitedForPalestine\nhttps://t.co/U7uFNOJoQZ\n— APP  (@appcsocialmedia) May 21, 2021\nReferring to the recent wave of Israeli aggression, the prime minister said he was at Holy Prophet’s (Peace Be Upon Him) Mosque (Masjid-e-Nabvi)  in Madina Munawara when the Israeli forces attacked worshippers at Al-Aqsa Mosque in the holy night of 27th Ramazan.\nMoreover, the Palestinian families were also evicted from their homes and the attack by the “world’s most powerful army” also left the Palestinian children killed, he said.\nHe said while being in Saudi Arabia, he met the OIC Secretary General and called for OIC’s stand as well as taking the matter to the United Nations.\nLater, he said he also talked to Saudi King Salman, received calls from Turkish President Recep Tayyip Erdogan, former Malaysian Prime Minister Mahathir Mohamad who called for taking the matter to the world body.\nDuring his telephonic conversation with him, the prime minister said he had assured Palestinian President Mahmoud Abbas of all out support from Pakistan, the Muslim as well as other right minded world stood by them.\nThe prime minister said he assigned Foreign Minister Shah Mahmood Qureshi to raise the issue at United Nations as well as with OIC and other Muslim world leaders, who did it effectively which was laudable.\nHe said some 30 years ago, the world public opinion was changed when there had been racial bias against the Africans in South Africa with major powers also supporting that time South African government.\nBut he said, when the world public opinion changed, the same powers compelled the South African regime to grant equal rights to the Africans and Asians.\n“I am seeing the similar beginning. The world’s public opinion is changing. Insha Allah the world public opinion will force the big powers, who have so far been supporting Israel, to exert pressure for Palestinians’ equal rights. Insha Allah, the day will come when Palestinian people will get their country, a just settlement and will live as equal citizens as the Israelis do. We pray the day comes soon,” he said.",
  "retrievedAt": "2025-08-11T20:44:58.771Z"
}
