{
  "title": "PM forms committee to work out DISCOs handover to provinces",
  "link": "https://www.app.com.pk/national/pm-forms-committee-to-work-out-discos-handover-to-provinces/",
  "date_published": "2023-03-15T15:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): Prime Minister Shehbaz Sharif on Wednesday formed a committee to outline the terms of reference (ToRs) for transferring the power distribution companies (DISCOs) to the provinces, in collaboration with the provincial governments, and define the timeline.\nThe prime minister, who chaired a high-level meeting to discuss the handing over of DISCOs to the provinces, directed the said committee to finalise the strategy without any delay.\nThe meeting was told that transferring the DISCOs to the provinces was a constitutional step that would help curb the power theft considerably.\nIt was also told that Sindh government was the first to approach the center seeking the transfer of DISCOs.\nThe prime minister told the meeting that the government was prioritising to curb power theft. Besides, the federal government, in collaboration with the provincial governments, had devised a strategy to reduce losses of the DISCOs.\nReiterating his resolve to curb the elements involved in the power theft, he said the federal government would also extend technical support to the provinces for their capacity building.\nHe said an administrative infrastructure for recovery of the electricity bills already existed in the provinces that would play a key role to overcome the circular debt.\nFormer Prime Minister Shahid Khaqan Abbasi, federal ministers Ishaq Dar, Engineer Khurram Dastgir and Abid Hussain Bhaiyo, State Minister Dr Musaddik Malik, Advisor to PM Ahad Cheema, Special Assistant to PM Jahanzeb Khan, Sindh Chief Minister Syed Murad Ali Shah, Khyber Pakhtunkhwa Caretaker CM Azam Khan, Punjab and Balochistan chief secretaries and relevant senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T06:22:44.971Z"
}
