{
  "title": "Golden Jubilee celebration of Constitution to be kicked off from 23rd March",
  "link": "https://www.app.com.pk/national/golden-jubilee-celebration-of-constitution-to-be-kicked-off-from-23rd-march/",
  "date_published": "2023-03-15T07:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The Parliamentary Advisory Committee to oversee the preparations for the Golden Jubilee celebrations of the Constitution 1973 in its fourth meeting approved the media strategy for the celebrations and decided to start the celebrations from 23 March.\nThe committee also approved designs for the commemorative stamps and coins. Moreover, the meeting reviewed the progress regarding the construction of the Constitutional Monument, and restoration of its old National Assembly Hall in the State Bank building in Islamabad.\nFederal Minister for Information and Broadcasting Marriyum Aurangzeb while sharing details of the media strategy for the coverage of the commemoration said that all departments of the ministry including PTV, Radio Pakistan, DEMP, PID, EP Wing, PEMRA had planned certain activities related to the celebrations.\nSome of which were airing of special programs, documentaries, podcasts, exhibitions, quiz contests, mushairas, publications of articles, news supplements etc, she added.\nIt was shared that all activities would be given ample coverage on print, electronic and digital media both in private and public spheres with special emphasis on regional channels.\nThe Chair of the Committee Senator Mian Raza Rabbani and other Members lauded the comprehensive strategy and also gave their input, where required, to make it more inclusive and comprehensive.\nFederal Minister for Finance Ishaq Dar apprised the Committee that matters related to the restoration of the old Assembly Hall at the SBP building had been addressed, and hopefully would be completed in a few months.\nThe Committee proposed to declare the said Hall a national heritage. Moreover, he also shared sample designs for the commemorative coin, one of which was approved by the Committee. The Committee lauded the speedy response of the Minister concerning dedicated tasks.\nAdditionally, the meeting also took cognizance of the; reports of the Sub-Committees on Education and Declamations, the construction of a constitutional monument, and finances related to the event among others.",
  "retrievedAt": "2025-08-11T06:22:38.558Z"
}
