{
  "title": "PTDC to organize NTCI to attract tourism",
  "link": "https://www.app.com.pk/national/ptdc-to-organize-ntci-to-attract-tourism/",
  "date_published": "2023-03-15T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The Pakistan Tourism Development Corporation (PTDC) with the financial assistance of the World Bank would organize the dissemination event on National Tourism Competitiveness Index (NTCI) on Thursday (tomorrow) to promote the country’s rich tourism potential aimed to attract immense people.\nThe PTDC with technical support of the World Bank Group has already engaged a team of international and national experts to develop the NTCI, said a press release received here on Wednesday.\nThe formation of this index will help benchmarking, monitoring, and improving the competitiveness of the tourism industry at the national and provincial level, based on a standardized framework derived from the World Economic Forum’s (WEF)\nThe index will also allow the country to gather reliable tourism related data and statics, supporting policymakers, industry associations and tourism sector businesses to make informed decisions promote sustainable tourism development and disseminate the findings of the report and share the action plan with public and private sector stakeholders.\nAdviser to Prime Minister on Tourism Aun Chaudhry will be the chief guest on the occasion.\nThe PTDC is developing the tourism sector as a national priority in a sustainable and acceptable manner, taking full advantage of regional and international trends so that it can significantly contribute to the improved quality of life in Pakistan whilst promoting the country’s cultural and natural heritage.\n“PTDC is creating an enabling environment for Pakistan’s tourism industry by providing world-class facilities that commensurate with our rich cultural heritage, rare archaeological treasures and exquisite environmental beauty in close partnership and coordination between the public and the private sector.”",
  "retrievedAt": "2025-08-11T06:23:21.084Z"
}
