{
  "title": "Willful desecration of Holy Quran punishable by life imprisonment: Govt tells print publications",
  "link": "https://www.app.com.pk/national/willful-desecration-of-holy-quran-punishable-by-life-imprisonment-govt-tells-print-publications/",
  "date_published": "2023-03-15T08:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The federal government has asked the newspapers and magazines to strictly observe the reverence of the Holy Quran as any willful desecration of a copy or extract of the holy book was punishable for imprisonment in life.\nIn a letter to the publications, the Ministry of Information and Broadcasting observed that the verses and translations of Holy Quran after being published in the newspapers were treated in disrespectful manner which was highly regrettable and in violation of existing laws regarding offences relating to defiling of Holy Quran.\n“Whoever willfully defiles damages or desecrates a copy of the Holy Quran or of an extract therefrom or uses it in any derogatory manner or for any unlawful purpose shall be punishable with imprisonment for life,” said the letter citing chapter XV Section 295B of Pakistan Penal Code.\nThe ministry had also requested the Council of Islamic Ideology for issuance of guidelines regarding preservation of the sanctity of the Holy Quran/Ahadis-e-Nabwi (PBUH), sacred names and pictures of holy places in publications.\nIn its response, the Council, a constitutional body responsible for giving legal advice on Islamic issues to the government and the Parliament, argued that there was no harm in printing Quranic verses and holy names in the advertisements as it meant for conveying the information to the masses.\nThe body had urged the government for the steps to aware the masses to ensure the reverence of sacred names and literature published in the newspapers and advertisements.\nIn this regard, the Press Information Department (PID) also held meetings with All Pakistan Newspapers Society (APNS), Council of Pakistani Newspaper Editors (CPNE), and Pakistan Broadcasters Association to apprise all media representative bodies about the matter.\nIn light of the Council’s guidelines, the ministry instructed all the publications to ensure observance of and due preservation/reverence of holy texts and sacred material in newspapers and periodicals.",
  "retrievedAt": "2025-08-11T06:22:51.168Z"
}
