{
  "title": "Envoys present credentials to President Alvi",
  "link": "https://www.app.com.pk/national/envoys-present-credentials-to-president-alvi/",
  "date_published": "2023-03-15T11:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The newly appointed envoys of Malaysia, Portugal, Kosovo, Lithuania and Ecuador presented their credentials to President Dr Arif Alvi, at a ceremony, held here at the Aiwan-e-Sadr.\nThe High Commissioner-designate of Malaysia, Mohammad Azhar Mazlan; Ambassador-designate of Portugal, Manuel Frederico Pinheiro da Silva; Non-Resident Ambassador-designate of Kosovo, Agon Vrenezi; Non-Resident Ambassador-designate of Lithuania, Ricardas Degutis, and Non-Resident Ambassador-designate of Ecuador, Pascual Del Cioppo Aragundi, presented their credentials and also made separate calls on President Alvi.\nWelcoming the High Commissioner of Malaysia, the President said that Pakistan and Malaysia enjoyed good relations and Pakistan wanted to further strengthen bilateral relations with Malaysia in the areas of economy, trade, defence, education, tourism, science and technology.\nHe underscored the need for further expanding bilateral trade for the mutual benefit of the two countries.\nHe stated that Pakistan produced quality fruits, vegetables, dairy products, pharmaceuticals, sports and surgical goods, and access to Pakistani commodities in Malaysian and adjacent ASEAN markets could help meet Malaysia’s requirements and enhance bilateral trade. He also thanked Malaysia for its consistent support to Pakistan at international fora on various issues.\nDuring his meeting with the Ambassador of Portugal, the President said that Pakistan and Portugal had great scope of cooperation in the fields of trade, agriculture and investment.\nHe emphasised the need for greater interactions at the highest level to boost bilateral cooperation. He said that Pakistan was a large market with a population of over 220 million, and would like to invite Portuguese companies to invest in Pakistan in diverse fields.\nHe said that business delegations should be facilitated to explore areas of cooperation.\nHe expressed satisfaction over the formation of Parliamentary Friendship Groups between the two countries that would further boost bilateral ties.During his meeting with the Ambassador of Kosovo, the President said that Pakistan was desirous of promoting closer cooperation with Kosovo in all areas of mutual interest.\nHe added that the expansion of economic relations with Kosovo remained an important priority for Pakistan.\nHe stated that Pakistan was an emerging market and offered numerous investment opportunities, adding that the establishment of linkages between the Chambers of Commerce of the two countries would be an important step in promoting bilateral trade and investments.\nHe also urged the need for an increased exchange of high-level visits between the two countries.\nTalking to the Ambassador of Lithuania, the President highlighted the need to develop a mechanism for the exchange of views on trade, commerce, and investment matters between the two countries to further increase mutual trade and cooperation.\nHe stated that Pakistan and Lithuania enjoyed cordial relations and Pakistan wanted to improve cooperation in all fields of mutual interest for the benefit of the two countries.\nTalking to the Ambassador of Ecuador, the President said that Pakistan and Ecuador enjoyed cordial bilateral relations, and Pakistan looked forward to enhancing political, economic, trade and cultural relations with Ecuador.\nHe stressed the need for developing institutional frameworks between the two countries to enhance bilateral relations.",
  "retrievedAt": "2025-08-11T06:23:21.278Z"
}
