{
  "title": "Govt wary of holding elections in piecemeal; assessing financial impact, says Kaira",
  "link": "https://www.app.com.pk/national/govt-wary-of-holding-elections-in-piecemeal-assessing-financial-impact-says-kaira/",
  "date_published": "2023-03-15T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): Adviser to Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira on Wednesday said the incumbent government and other stakeholders were deeply assessing the financial impact of holding elections piecemeal.\nIn a press conference, here, Kaira said that the government was thinking about to find a mid-way to save the resources of the country and hold elections one-time across the country.\n“The result of the ongoing conflict in the country for a long time is that the implementation of the law on Imran Khan seems to be weak,” he regretted.\n‘Since yesterday, the situation in Zaman Park has gripped the entire nation, it is a serious situation. Imran Khan’s workers are fighting with state institutions,” said Kaira.\nHe said the matter of arrest of Imran was purely an implementation of the court order, adding if the latter had appeared on the court’s notice, this deteriorating situation would not have occurred.\n“Even when the police went to give notice, they were not treated well. The court extended time till March 13 but Imran did not not appear,” he recalled the bid by Islamabad police to furnish court summons of the former prime minister’s arrest, last week.\nKaira also deplored that Imran “gives a hypothetical statement to incite his workers”. “There is a danger in appearing before the Islamabad court, but there is no danger in leading rallies,” he quipped.\n“After throwing sticks, now petrol bombs are being thrown at the police from Zaman Park,” he added.\nKaira said that the PTI chief should surrender himself before the court as he remembered the cases were also filed against them when they were in opposition. He argued that they always respected the law and appeared before the judiciary for the rule of law.",
  "retrievedAt": "2025-08-11T06:22:32.407Z"
}
