{
  "title": "Ejaz Ahmad Qureshi highlights role of ombudsman in good governance at international summit",
  "link": "https://www.app.com.pk/national/ejaz-ahmad-qureshi-highlights-role-of-ombudsman-in-good-governance-at-international-summit/",
  "date_published": "2024-12-03T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP):Wafaqi Mohtasib, Ejaz Ahmad Qureshi has said that addressing maladministration and protection of human rights is inextricably linked to good governance, accountability and inclusivity.\nAddressing an International Ombudsman Summit – 2024 in Hong Kong organized on the eve of the 35th anniversary of the establishment of the Office of the Ombudsman in Hong Kong, China, said that the United Nations, too, recognizes the importance of the institution of the Ombudsman in strengthening democracy, good governance and the rule of law, said a press released issued on Tuesday.\nQureshi, who is the current President of the 47-member strong Asian Ombudsman Association (AOA), said that good administration and efficient service delivery constitute the most essential features of the Sustainable Development Goals (SDGs).\nHe said that these goals have a direct bearing on the role and functions of Ombudsman institutions working to build peaceful and inclusive societies, accountable institutions at all levels and providing easy access to justice. He added that the scope of work of Ombudsman institutions is witnessing speedy expansion and now includes issues like climate change, business rights, public accessibility and inclusivity.\nAlluding to Pakistan’s experience, Qureshi said that Ombudsmanship has taken firm roots in the country. He said that following the success of Wafaqi Mohtasib Institution in providing free and expeditious administrative justice to the general public, the concept has been replicated in other essential areas impacting the welfare of the general public.\nHe said that 14 Ombudsman Institutions are functioning in the country at the Federal and Provincial levels and contributing to improving service delivery of the government agencies in their respective areas of competence.\nThe International Ombudsman Summit at Hong Kong is being attended by over 140 Overseas participants, representatives of the UN bodies including a large number of the member institutions of the AOA.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:06:07.214Z"
}
