{
  "title": "CEO Telenor Pakistan honored with WEPs award",
  "link": "https://www.app.com.pk/national/ceo-telenor-pakistan-honored-with-weps-award/",
  "date_published": "2024-12-03T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP):Chief Executive Officer (CEO) of Telenor Pakistan Khurrum Ashfaque has been recognized with the prestigious UN Women 2024 Asia-Pacific Women’s Empowerment Principles (WEPs) Award in the Leadership Commitment category.\nAccording to a news release this accolade underscores his steadfast dedication to fostering a workplace culture that prioritizes gender equality and inclusivity.\nUnder the leadership of Khurrum Ashfaque, Telenor Pakistan successfully implemented a robust suite of Diversity, Equity, and Inclusion (DEI) initiatives in line with the company’s strategic objectives. Notable programs such as “Naya Aghaaz” for returning female professionals and “Parvaaz” for female sales trainees were introduced to increase female representation across the organization.\nAdditionally, tailored initiatives like “EmpowHer for Today” and “EmpowHer to Lead” were developed to enhance the skills and leadership capabilities of women at various career stages. These initiatives, alongside the implementation of policies such as flexible work arrangements and enhanced daycare and transport allowances, have fostered a supportive and inclusive environment for female talent.\nCommenting on the achievement, Khurrum Ashfaque, CEO Telenor Pakistan stated: “At Telenor Pakistan, we believe gender equality is both a moral imperative and a business advantage. Our commitment goes beyond policies to foster a culture where everyone has equal opportunities to thrive. We focus on leadership training, empowering women in male-dominated roles, mentorship programs and driving digital inclusion in rural areas. This award reflects the collective effort of our people and partners. I am grateful to UN Women for this recognition, which inspires us to continue breaking barriers and pushing boundaries.”\nThe UN Women Asia-Pacific WEPs Awards celebrate private sector contributions to gender equality and the UN Sustainable Development Goals (SDGs). The Leadership Commitment category honors individuals and organizations making significant strides toward creating gender-inclusive workplaces and communities. The WEPs framework, introduced in 2010 by UN Women and the UN Global Compact, serves as a guide for companies to implement gender-sensitive practices.\nThis recognition highlights the critical role of leadership in fostering systemic change and advancing gender equality. By prioritizing inclusivity and equitable practices, Khurrum Ashfaque exemplifies how corporate leaders can drive meaningful progress toward a more diverse and sustainable future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:01:36.613Z"
}
