{
  "title": "EU, WFP to strengthen Sindh’s health system",
  "link": "https://www.app.com.pk/national/eu-wfp-to-strengthen-sindhs-health-system/",
  "date_published": "2024-12-03T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP):European Union (EU) in collaborative project with the World Food Programme (WFP) is helping Sindh’s health system tackle malnutrition more effectively.\nWith a focus on self-reliance, the initiative equips local health centers to manage acute malnutrition without external aid.\nIn Sindh’s Tharparkar district, where malnutrition spikes are frequent, the EU and WFP have implemented the Community Management of Acute Malnutrition (CMAM) Surge approach.\nThis initiative aims to bolster the local health system’s ability to anticipate, prepare for, and respond to malnutrition cases, particularly during high-demand periods.\nThe project was rolled out in 12 health centers in Chachro, a town grappling with poverty, food insecurity, and limited access to clean water and sanitation. Seasonal infections and droughts often worsen the situation. The CMAM Surge approach enables health workers to handle increased malnutrition cases without overloading existing resources.\nTaheeni Thammannagoda, who oversees EU humanitarian aid in Pakistan, highlighted the importance of building local capacity.\n“Frequent climate shocks in Sindh exacerbate malnutrition,” she said, adding, “This collaboration aims to help health systems manage surges effectively during crises.”\nWFP Country Director Coco Ushiyama noted that the initiative has set a precedent for cost-effective expansion. “Our partnership with the Government of Sindh and stakeholders in Umerkot and Tharparkar shows that this evidence-based model can be scaled to other districts,” she said.\nThe CMAM Surge approach is structured around eight steps. It begins with a situational analysis to identify factors driving malnutrition, such as health challenges and seasonal trends. Health workers are then trained to manage case spikes, analyze data, and ensure the timely delivery of nutrition supplies.\nTools provided to provincial and district health authorities include a real-time e-dashboard. This platform tracks data, detects cases early, and facilitates timely referrals to health facilities, ensuring no delay in care for malnourished individuals.\nThe approach was first piloted in 30 health centers in Umerkot district in 2021. Its success there encouraged the Government of Sindh to consider expanding the program to other vulnerable districts.\nThe next step involves rolling out the approach in Jamshoro district. This expansion reflects the Government’s commitment to addressing malnutrition and ensuring better health outcomes across Sindh.\nThe collaboration between the EU and WFP underscores a shared goal: building stronger, self-reliant health systems to combat malnutrition effectively and sustainably.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:03:27.612Z"
}
