{
  "title": "FIA foils fake visa scam at Islamabad airport, arrests key suspects",
  "link": "https://www.app.com.pk/national/fia-foils-fake-visa-scam-at-islamabad-airport-arrests-key-suspects/",
  "date_published": "2024-12-03T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP): Federal Investigation Agency (FIA) Immigration Unit carried out a major operation at Islamabad International Airport, successfully preventing two passengers from traveling abroad using forged documents.\nThe suspects, identified as Wajid Ali and Irfan Khan, were attempting to board flight QR633 to Poland with counterfeit visas affixed to their passports. Forensic analysis conducted by the Second Line Office revealed that the visas lacked essential security features, confirming their fraudulent nature.\nThe suspects, residents of Islamabad and Rawalpindi, were immediately offloaded and handed over to the Anti-Human Trafficking Circle for further investigation. The FIA spokesperson confirmed that a thorough inquiry is underway to identify potential accomplices in the human trafficking network.\nMeanwhile, In a separate operation, the FIA Anti-Corruption Circle arrested three former officials of the Rawat Union Council, including ex-chairman Azhar Mehmood, ex-secretary Mirza Tanveer, and former daily wage employee Sajid Muhammad.\nThe arrests were made on charges of corruption and misuse of authority, resulting in a loss of over 40 million rupees to the national treasury. The suspects were found guilty of illegal recruitments, including hiring 116 daily wage workers and unauthorized teachers. They also engaged in unlawful professional tax agreements.\nThe FIA has initiated further investigations to uncover the full extent of the corruption and ensure accountability.\nThe FIA spokesperson reiterated the agency’s commitment to combating fraud, human trafficking, and corruption to safeguard public interests.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:05:14.830Z"
}
