{
  "title": "NA body directs to ensure implementation of minimum salary in media houses",
  "link": "https://www.app.com.pk/national/na-body-directs-to-ensure-implementation-of-minimum-salary-in-media-houses/",
  "date_published": "2024-12-03T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):Sub-Committee of the National Assembly Standing Committee on Information and Broadcasting on Tuesday directed the Ministry of Information and Broadcasting and PEMRA to ensure that all media houses pay 37,500 minimum salary fixed by the government.\nThe 1st meeting of the committee was held here under the convenorship of Syed Aminul Haque to discuss the current state of payment of salaries and outstanding dues and to suggest measures for ensuring rights of media workers.\nSyed Aminul Haque directed to take steps in accordance with the policy for complaints regarding dummy newspapers and payment of PBA dues.\nSecretary Information and Broadcasting, Ms. Ambreen Jan, Chairman PEMRA Muhammad Saleem Baig, Chairman ITNE Shahid Mehmood Khokhar and Principal Information Officer Mubashir Hasan briefed the Committee on redressal of grievances and payment of salaries to journalists and media workers.\nEarlier, the committee was apprised by the various representatives of the journalist bodies including NPC, PFUJ, RIUJ, PRA etc. about the non-payment of timely salaries, absence of job security, lack of fringe benefits to journalists.\nThe meeting was attended by Secretary Information and Broadcasting Ms. Ambreen Jan, Chairman PEMRA Muhammad Saleem Baig, DG (IP) Ashique Hussain, Chairman Implementation Tribunal for Newspaper Employees (ITNE) Shahid Mehmood Khokhar, members of the committee, members of the Assembly, Ms. Sahar Kamran, Maulana Abdul Ghafoor Haideri and Moazzam Ali Khan.\nRepresentatives of Pakistan Federal Union of Journalists (PFUJ) GM Jamali, Afzal Butt, Nasir Zaidi, All Pakistan Newspapers and Electronic Media Employees Confederation’s Mohammad Siddique Anzhar, National Press Club’s Azhar Jatoi, Parliament Reporters Association’s Usman Khan, Rawalpindi Islamabad Union of Journalists’ Shakeel Khan, Tariq Warraq, Pakistan Broadcasters Association’s Basit Riaz Sheikh, APNS and CPNE were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:04:08.891Z"
}
