{
  "title": "Ahsan Iqbal highlights Islamic finance’s role in sustainable development at World Islamic Finance Forum",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-highlights-islamic-finances-role-in-sustainable-development-at-world-islamic-finance-forum/",
  "date_published": "2024-12-03T12:00:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 03 (APP): Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal, on Tuesday emphasized the critical role of Islamic finance in driving sustainable economic growth and addressing global challenges such as climate change.\nHe wa speaking as the chief guest at the 4th World Islamic Finance Forum, organized by the Institute of Business Administration (IBA) Karachi here Tuesday, that brought together experts to explore the theme, “Islamic Finance, Innovation, Climate Finance and Sustainable Growth.”\nAhsan Iqbal noted the projected growth of the Islamic finance industry to over $6 trillion by 2027, as per the 2023 Islamic Finance Development Report, and highlighted its foundation in the ethical and sustainable principles of Sharia law. These principles, he explained, ensure an equitable and just economic system through practices such as profit and loss sharing (Mudaraba and Musharaka), the prohibition of interest (Riba) and social responsibility through zakat and waqf.\nHe stressed that Islamic finance, unlike conventional systems, ties economic activities to real assets and promotes shared risk, social justice, and poverty alleviation, with global estimates indicating that zakat and waqf contributions exceed $1 trillion annually.\nAhsan Iqbal also underscored the growing relevance of Islamic finance in addressing environmental issues, citing the example of Green Sukuk. He pointed out that global issuance of green sukuk surpassed $20 billion in 2023, financing projects in renewable energy, sustainable agriculture, and green infrastructure. He referenced Indonesia’s issuance of $2.5 billion in green sukuk and Malaysia’s leadership in this sector.\nThe Federal Minister said that Pakistan, which has suffered significant economic losses from climate-related disasters, is now following suit. The government recently announced its first green sukuk worth $500 million, aimed at financing renewable energy projects. Iqbal emphasized Pakistan’s commitment to increasing its renewable energy share to 60 percent by 2030 in line with the United Nations Sustainable Development Goals.\nHighlighting the rise of Islamic fintech, which was valued at $79 billion in 2023 and projected to reach $179 billion by 2028, he stressed the importance of innovation, regulatory frameworks, and international cooperation in the future of Islamic finance.\nConcluding his speech, Ahsan Iqbal commended IBA for hosting the forum and emphasized that Islamic finance, rooted in justice, equity and sustainability, offers a road map for aligning wealth creation with moral and ethical values, benefiting both humanity and the planet.",
  "retrievedAt": "2025-08-10T12:05:09.271Z"
}
