{
  "title": "Govt providing opportunities to youth in IT, other Sectors: Shaza Fatima Khawaja",
  "link": "https://www.app.com.pk/national/govt-providing-opportunities-to-youth-in-it-other-sectors-shaza-fatima-khawaja/",
  "date_published": "2024-12-03T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP):Minister of State for Information Technology and Telecommunication, Shaza Fatima Khawaja, on Tuesday reaffirmed the government’s commitment to providing opportunities for youth in various sectors, including IT.\nDigitization would reduce bureaucratic hurdles and significantly enhance efficiency in the country she said while speaking at the UNDP Digital Skills Graduation Ceremony for Khyber Pakhtunkhwa youth.\nShe highlighted the pivotal role of young people in national development.\nShe said that the government is offering a range of IT courses to equip students with essential skills.\nThe minister said training programs are being conducted to familiarize youth with diverse IT-related fields, encouraging them to contribute to society through dedication and hard work.\nThe minister underscored the government’s dedication to advancing the IT sector by leveraging all available resources.She stressed that digitization remains a top priority, aiming to provide online access to services to streamline processes and boost productivity.\nShe also highlighted the importance of specialized courses, such as cloud computing and artificial intelligence, in driving the digitization agenda.\nShe elaborated on the “One Patient, One ID” initiative, explaining that patients’ medical records would be accessible online, enabling healthcare providers to retrieve their complete history using their ID card.\nShe said that the system would help save a patient’s entire medical record, which would be accessible across all hospitals operating in the federal capital, including basic health units.\n“This will eliminate the need for patients to visit the hospital where they had initially received medical care. They can visit any hospital in the federal capital, and the doctors there will access their medical records using the identity issued under the ‘One Patient, One Identity’ system,” she added.\nShe called on the private sector to support these efforts to ensure broader implementation and success.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:04:16.677Z"
}
