{
  "title": "PTI trying to hoodwink masses through false narrative of bodies: Tarar",
  "link": "https://www.app.com.pk/national/pti-trying-to-hoodwink-masses-through-false-narrative-of-bodies-tarar/",
  "date_published": "2024-12-03T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 03 (APP):Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar said on Tuesday that Pakistan Tehreek-e-Insaf was trying to hoodwink the people through fake narrative and lies.\nLambasting Pakistan Tehreek-e-Insaf, in a media talk, he said that the party was creating a false narrative of firing on the protesters.\nHe once again challenged the PTI to present a single piece of evidence showing a law enforcement agencies personnel firing bullets directly on the protesters.\n“There is not a single video in which law enforcement agencies person can be seen directly firing upon protesters. They have all kinds of videos but there is no video evidence ( of direct firing) as this never took place”, he maintained.\nThe minister said that a video of a man running away in which he was saying that he hit by a gunshot,  went viral.\nAttaullah Tarar said the same person  in another video was claiming that he had got an injury on his hand.\nHowever when in the video, he opened  the bandage on his hand  no bullet mark was visible on his hand.\nTarar stated that the PTI was defaming the state through their concocted stories based on lies.\nThe PTI is spreading lies about bodies and different leaders were giving different figures of fatalities ranging from a dozen to 4000. A senior leader of the PTI Lateef Khosa claimed that over 150 bodies were lying at his residence.\nHe said even the PTI Chairman, Barrister Gohar remarked that there were only 12 bodies and all other claims were bogus.\nHe said there was no dead, if the PTI had any dead bodies they should present in front of the media.\nTaking a dig on the PTI, he said these bodies were found on Tik Tok, Facebook, X, WhatsApp and other social media platforms, but in reality, there were no dead bodies.\nHe said the PTI was trying to hoodwink the nation through its lies and misleading statements.\nHe said that it was  unfortunate  that such people form political parties who had no sense.\nHe also pointed out four Rangers personnel and  a police officer were martyred, but no one from the PTI  expressed sympathy with the bereaved families.\nThe PTI miscreants target security forces and police personnel but later claim of make hue and cry of killing of their party workers.\nThe minister said that on social media,  it was claimed that Jam Amanullah, a boy from Khanpur was killed in law enforcement agencies firing. Now his father Jam Tahir has issued a video in which he clarified that his son was alive and sitting beside him in his home.\nHe also made it clear that neither United States nor United Kingdom could allow armed rioters to protest outside White House and 10 Downing Street.\nAbout the economic situation, the minister said that due to the prudent policies of the government, inflation has fallen to a 70-month low which was a manifestation that Pakistan’s economy was growing.\nHe said that foreign exchange reserves have exceeded $ 11 billion  mark and Consumer Price Index was going down every month.\nHe said that the stock market had broken several records and  crossed the 100,000 points mark whereas the interest rate had been reduced to 15 percent and the KIBOR rate to 13 percent.\nHe said following reduction in  interest rates, investment in the country was increasing.\n“Due to the day and night hard work and efforts of Prime Minister Muhammad Shehbaz Sharif, the inflation had fallen to record low”, he added.\nHe recalled that this achievement was made from a point of default when Shehbaz Sharif became Prime Minister for the first time.\nTarar said that Managing Director of International Monetary Fund had rightly pointed out that had  Prime Minister Shehbaz Sharif not taken this matter seriously, it would not have been possible for Pakistan to avoid default.\nHe also recalled that when the country was on the verge of default, a political party was writing to the IMF not to grant any assistance to Pakistan,  so that it was forced to default.\nToday, he said inflation had fall2n to 4.8 percent, interest rate down to 15 percent, foreign remittances had reached $ 8.8 billion mark, foreign exchange reserves had reached $ 11 billion.\nHe expressed the hope that there will be further improvement in economic development of the country in coming times.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:07:01.046Z"
}
