{
  "title": "Opposition is fighting its last battle: Afridi",
  "link": "https://www.app.com.pk/national/opposition-is-fighting-its-last-battle-afridi/",
  "date_published": "2020-10-19T12:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 19 (APP):Chairman Kashmir Committee, Shehryar Khan Afridi Monday accused leadership of Pakistan Democratic Movement (PDM) for putting Kashmir cause on the backburner.\nAddressing a press conference along with Kashmiri activists, Afridi shared 10-year performance of his predecessor, Maulana Fazlur Rehman as Chairman Kashmir Committee, and accused him of compromising the Kashmir cause for vested interests.\nFlanked by APHC leader Nabila Irshad, Dr Wilayat Hussain and Dr Mujahid Gilani, Afridi said that during 10-year tenure as Kashmir Committee Chairman, Maulana Fazlur Rehman spent Rs 463 million out of allocated amount of Rs 474 million but did nothing for the Kashmir cause.\n“During the past ten years, the committee met only 24 times and 62 press releases were issued, Hence, each press release cost Pakistani exchequer 76 lakh.\nOnly one press release was issued in two months precisely,” he added.\nAfridi said that Maulana did not hold even a single meeting with the foreign dignitaries to lobby on Kashmir in ten long years and when Maulana Fazlur Rehman was supposed to visit Europe in 2016 as part of lobbying after Burhan Wani’s martyrdom, Ijaz-ul-Haq had to lead a 22-member parliamentary delegation but Maulana did not join them.\nSimilarly, he added, Maulana was not available to present a memorandum to the UN representative in Pakistan on the first anniversary of Burhan Wani’s martyrdom in 2017, and Ijaz-ul-Haq had to do the same with a delegation.\n“Due to consistent reluctance of the Maulana to speak on Indian forces massacre in Indian Illegally Occupied Jammu & Kashmir, a sub-committee headed by Ijaz-ul-Haq was formed to deal with Kashmir diplomacy. Maulana however kept enjoying perks as Kashmir Committee Chairman,” he added.\n“The manner in which the opposition parties conducting a political circus for last three days by using Kashmir dispute for personal gains is is unfortunate, sad and worrying,” he said.\nOn the one hand, he added, Kashmiris are proudly burring their martyrs wrapped in Pakistani flags.\n“Since taking office, Prime Minister Imran Khan vowed to act as Kashmir’s ambassador and has taken the Kashmir issue out of the cold and made it the focus of UN General Assembly (UNGA) and global debate,” he said.\nHe said due to effective diplomacy, the Kashmir dispute was raised in the UNGA for three times after 55 years which is unprecedented success in our foreign policy front.\nThe sacrifices of Kashmiris and Imran Khan’s advocacy have internationalized the Kashmir dispute and today Kashmir has become a major issue at international forums, he added.\n“After being rejected by the people and convicted by the courts, now the opposition has taken to the streets to take the country away from the path of development. But inshallah, this time too, defeat is their destiny,” he added.\nThese three parties ruled the country for forty to fifty years and kept Kashmir in the cold.\nDr Wilayat Hussain underscore the need for political stability in Pakistan to counter the Indian hegemonic designs while urging the opposition parties to stay united behind the present government to plead the case of Kashmiris in befitting manner.\nNabila Irshad expressed disappointment over the nexus of political parties at the time when Kashmir issue need more attention.\nShe appealed the patriotic leaders of opposition parties to detach themselves from such campaigns that reflects the Indian narrative.",
  "retrievedAt": "2025-08-11T19:55:13.723Z"
}
