{
  "title": "FAO, KP Agri Dept observe World Food Day",
  "link": "https://www.app.com.pk/national/fao-kp-agri-dept-observe-world-food-day/",
  "date_published": "2020-10-19T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 19 (APP): The Food and Agriculture Organization (FAO) and the Agriculture Department of Khyber Pakhtunkhwa jointly observed the World Food Day 2020 (October 18) with the theme “Grow, Nourish, Sustain. Together. Our actions are our future”.\nThe day was aimed at to pay tribute to the food heroes who, no matter the circumstances, continue to feed their communities, besides highlighting how essential food security is for everyone to create a better and prosperous society, a FAO press release issued here on Monday said.\nAn event arranged in Peshawar focused on supporting global Sustainable Development Goal (SDG) 2, ending hunger in the world by 2030.\nAddressing the event, KP Secretary Agriculture Dr Muhammad Israr said the poor and the hungry had been affected the most due to the pandemic-induced lockdowns, economic slowdown and loss of income.\n“It is high time to realize the importance of food security especially in the wake of COVOD-19 situation and recognize the efforts of every single person involved in efforts to bring food to our tables,” he stressed\nDr israr said,”We appreciate the efforts of FAO in supporting our agricultural projects in the province generally, and in newly merged districts especially where the farming community is more vulnerable.”\nWFP representative in KP Wurie Alghassim, Director General Agriculture Extension KP Abid Kamal, DG Fisheries Khisro Kaleem, DG Onfarm Javed Khattak, DG Livestock Alamzeb Khan, DG Agriculture Research Rauf Khan, Director Onfarm Water Management Rab Nawaz Khan, Director Agriculture Merged Area Districts Shams Ur Rehman, DG Sustainable Development Unit Bakhtiar khan participated in the event.\nStudents of Pakistan International Public School (PIPS) and farmers community also participated in celebrations. Kids were involved in activity with comic books that raised awareness on food security, food safety, and nutrition.\nFarmers brought agriculture produce straight from their fields/tunnel-farms established with support from FAO.\nTribute to farmers was paid by presenting shields of appreciation.",
  "retrievedAt": "2025-08-11T19:55:13.487Z"
}
