{
  "title": "AJK President calls for tripartite talks on Kashmir issue under UN supervision",
  "link": "https://www.app.com.pk/national/ajk-president-calls-for-tripartite-talks-on-kashmir-issue-under-un-supervision/",
  "date_published": "2020-10-18T19:00:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Oct 19 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Monday said that as a matter of principle, talks with India should be held only under the UN auspices, and side by side with Pakistan and India, presence of the Kashmiris on the negotiations table is a must.\nHe asserted that the UN supervision of the talks is essential in order to carry forward and implement the Security Council resolutions on Kashmir.\nIn an interview with a private TV channel on Monday he said that India had always used the bogey of bilateral talks to consolidate its illegal occupation of Kashmir and to keep the United Nations and the Kashmiris out of the negotiation process, and now it can once again use the talks as a ploy to divert attention from its recent illegal actions in IIOJK, AJK President office said on Monday\nThe AJK President maintained that since the Kashmir issue has been once again raised in the UN Security Council, the talks as a matter of principle should be held in not Islamabad or New Delhi, but in New York. However, to ensure participation of Kashmiris, these can also be conducted in Islamabad, New Delhi or Muzaffarabad and Srinagar.\nIn any case, we will have to ensure that the talks are held within the framework of the UN Security Council resolutions on Kashmir only, he asserted.\nResponding to a question, he said that Pakistan’s stand on talks is very clear that Kashmir is not a bilateral dispute between Pakistan and India but it is an international issue which must be resolved by the UN Security Council. However, India does not consider it even a bilateral issue and describes it as its internal matter.\nHe said that India will also not accept Pakistan’s condition of involvement of Kashmiris in the talks process.\n“Pakistan has always adopted the stand that the Kashmiri people themselves are to decide their future destiny as has been laid down in the UN resolution”, he said adding that the Kashmir issue must remain with the international community so as to prevent India from turning occupied Kashmir into its colony, and stop it from depriving the Kashmiri people of their land and homes.\nAnswering another question, Sardar Masood Khan said that the Pakistani and the Kashmiri community living across the world including Pakistan and Azad Kashmir should rise up, and established contacts with the international community on the political level to muster their support in order to stop India from the illegal process of demographic change in occupied Jammu and Kashmir.\nYet to another question about anti-India stance recently adopted by pro-India Farooq Abdullah and Mehbooba Mufti, the AJK president said that these elements have never been Kashmiri leaders, but these were the people who had sold Kashmir to India in the lust of power, and after they have lost power and privileges, they wanted to strike some deal with India through blackmailing.",
  "retrievedAt": "2025-08-11T19:55:19.922Z"
}
