{
  "title": "IHC adjourns Nawaz Sharif’s appeals till June 9 in graft references",
  "link": "https://www.app.com.pk/national/ihc-adjourns-nawaz-sharifs-appeals-till-june-9-in-graft-references/",
  "date_published": "2021-05-25T10:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): The Islamabad High Court (IHC) on Tuesday adjourned hearing till June 9, on appeals in graft references against former prime minister Nawaz Sharif and his family members pertaining to Al-Azizia Steel Mills, Avenfield Property and Flagship Investment.\nA division bench comprising Justice Aamer Farooq and Justice Mohsin Akhter Kiyani heard the appeals filed by National Accountability Bureau (NAB) against former prime minister Nawaz Sharif, his daughter Maryam Nawaz and son-in-law Capt (retd) Muhammad Safdar Awan. Maryam Nawaz, her husband Captain (retd) Safdar, Deputy Prosecutor General NAB Sardar Muzafar Abbasi and prosecutor Jahanzeb Bharwana appeared before the court.\nDuring the course of proceeding the NAB prosecutor requested the bench to dismiss the appeals of former prime minister against his imprisonment sentences due to non pursuance and absence. Jahanzeb Bharwana prayed the court to hear the appeals of Nawaz Sharif on merit and give the judgment in his absence.\nJustice Aamer Farooq instructed the senior lawyer Azam Nazir Tarar to assist the bench on the point that how the proceedings on appeals could be forwarded in absence of the accused.\nTarar suggested the court to turn down the appeals of Muhammad Nawaz Sharif due to non appearance. He said that the situation could be different if a representative was appointed for court in presence of the accused.\nHe further argued that usually, the courts used to adjourn appeals for indefinite time in such circumstances. There were also precedents that the appeals were dismissed in absence of the accused and later these were reopened after the appellants surrendered before the concern courts.\nHe said that the petitioner could give application to the court after surrendering for restoration of his dismissed appeals.\nJustice Aamer Farooq remarked that this bench was not going to pass any order currently. The bench, however, instructed the two sides to assist the court regarding legal points in light of court decisions of top courts in similar cases.\nMaryam Nawaz’s lawyer Amjad Pervaiz couldn’t appear due to engagements in Lahore and requested the bench to grant one-day exemption from hearing.\nIt may be mentioned here that Maryam Nawaz and her husband Capt. (reted) Safdar had filed appeals against their sentences in Avenfiled reference while former prime minister Nawaz Sharif had challenged his imprisonment sentences in Al-Azizia Steel Mills and Avenfiled property cases. However, the NAB had challenged the acquittal of Nawaz Sharif in Flagship Investment reference and also pleaded to extend the imprisonment sentence of Nawaz Sharif in Al-Azizia Steel Mills case.\nThe former prime minister Nawaz Sharif was handed a total of 11 year imprisonment sentence and slapped 1.3 billion fine while his daughter Maryam Nawaz was sentenced eight year jail along with a fine of Rs335 millions in Avenfield Apartment reference by the accountability court. Capt (retd) Safdar has been given one-year sentence without any fine.\nSimilarly, Nawaz Sharif was awarded seven year jail along with Rs1.5 billion and US $25 million fine in Al-Azizia Steel Mills reference.",
  "retrievedAt": "2025-08-11T20:45:50.291Z"
}
