{
  "title": "Farrukh visits DEMP, calls for making documentaries on pro-people initiatives",
  "link": "https://www.app.com.pk/national/farrukh-visits-demp-calls-for-making-documentaries-on-pro-people-initiatives/",
  "date_published": "2021-05-25T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Tuesday visited the Directorate of Electronic Media and Publications (DEMP) and got a detailed briefing on its working.\nDirector General DEMP Imrana Wazir briefed the Minister on the functioning of the department including its efforts for holding exhibitions to display the historical pictures, said a news release.\nOn the occasion, the Minister stressed the need for producing documentary films on the pro-people initiatives of the present government.\nFarrukh said the National Command and Operation Center had rendered valuable services in controlling the spread of coronavirus in the country. Likewise, the Ehsaas initiative was succeeding in improving the living standards of the downtrodden segments of the society.\nHe said steps were taken on war-footing to deal with the coronavirus pandemic, adding such initiatives were needed to be highlighted in the form of documentary films.\nHe said that the Ministry of Information and Broadcasting would make all-out efforts to transform the DEMP on modern lines.\nThe department had a key role in sensitizing the new generation of the country about the services of its national heroes.\nDG DEMP Imrana Wazir apprised the minister that the department had developed an effective mechanism to monitor the airing of government advertisements on electronic media.\nShe said the DEMP regularly arranged exhibitions to put historical photos on display and painting competitions on the national days including March 23, August 14, December 25, October 27 and February 5. The department produced special documentaries, publications and national songs, she added.",
  "retrievedAt": "2025-08-11T20:45:55.547Z"
}
