{
  "title": "Talha returns Rs 4.5bln to pilgrims, implements cost-cutting measures",
  "link": "https://www.app.com.pk/national/talha-returns-rs-4-5bln-to-pilgrims-implements-cost-cutting-measures/",
  "date_published": "2023-06-05T14:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): Minister for Religious Affairs and Interfaith Harmony Senator Muhammad Talha Mahmood said the ministry, taking significant measures to ease the financial burden on pilgrims, had returned an impressive sum of Rs 4.5 billion, demonstrating its commitment to ensuring the well-being of those embarking on the holy journey.\nHe, in a talk with APP, highlighted the efforts made by the ministry to reduce costs associated with the Hajj pilgrimage.\nHe disclosed that this year’s expenses for the Hajj had been lowered to $3,900 from $5,000, presenting a substantial decrease in comparison to the previous year. However, despite this decrease, he acknowledged that the current Hajj remained the most expensive in history due to the depreciation of the Pakistani rupee and the increase in the value of the US dollar, he added.\nAddressing concerns about accommodation for pilgrims in Saudi Arabia, Senator Talha emphasized that the ministry had taken steps to secure buildings at more affordable rates.\nHe revealed that the ministry had rented buildings between SR1,800 and SR2,300, compared to the higher rental fee of SR2,600 in 2019. Despite the significant difference in inflation rates between 2023 and 2019, the ministry managed to secure accommodations at lower prices, he maintained.\nFurthermore, the minister emphasized the importance of efficient management of medicines for the pilgrims stating that more than fifty per cent of the required medicines could be obtained through donations, while the remaining medications could be purchased from pharmaceutical companies at their actual cost of production. By effectively managing these resources, the ministry could have saved a substantial amount of money allocated for the pilgrims’ medications, he observed.\nRegarding the pilgrims’ food, Senator Talha informed that the contract was already awarded but it could be further improved with a good menu at discounted rates providing a satisfactory dining experience for the pilgrims, while also optimizing the allocated budget.\nHe said in order to streamline the immigration process for the pilgrims, the Saudi government had introduced the “Road to Makkah” project at the Islamabad International Airport.\nHe expressed his enthusiasm for this state-of-the-art programme, which was set to benefit more than 26,000 pilgrims by allowing them to complete their immigration procedures in Islamabad, reducing waiting times in the host country.\nHe further confirmed that the Saudi government had plans to extend this pilgrim-friendly service to other airports, including Lahore and Karachi, in the upcoming year.\nSenator Talha also highlighted the ministry’s focus on training of Moavineen-e-Hujjaj, responsible for assisting the pilgrims throughout their spiritual journey.\nHe emphasized that the staff members from various government institutions had received adequate training to effectively handle the affairs of the pilgrims, ensuring their comfort and safety.\nResponding to concerns about VIP culture, the minister pledged to eradicate it completely if given the opportunity.\nHe firmly stated that he would spare no effort in eliminating any form of preferential treatment during the Hajj pilgrimage.\nIn response to a question about corruption, Senator Talha assured that if presented with concrete evidence, he would take decisive action to bring the culprits to justice without any bias or discrimination.",
  "retrievedAt": "2025-08-11T08:37:28.884Z"
}
