{
  "title": "Development process can be augmented by active women participation: Law Minister",
  "link": "https://www.app.com.pk/national/development-process-can-be-augmented-by-active-women-participation-law-minister/",
  "date_published": "2023-06-05T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): Federal Minister for Law and Justice Senator Azam Nazeer Tarar on Monday said there should be no discrimination in terms of services as women had performed outstandingly in every profession over the years.\nHe said the women constituted half of the population in Pakistan and by ensuring their active participation in the socioeconomic sphere the development process could be augmented in true letter and spirit.\nThe was addressing the seminar “Reclaiming the Space: Reading the Constitution from Women’s Perspective”, jointly organized by the Ministry of Law and Justice and the Women Parliamentary Cacus ( WPC).\nThe minister said he stood there not just as a government’s representative but also as a proponent of progress, equality and justice for all. The Constitution of Pakistan was a beacon of hope, a guiding force that laid the foundation for the  nation’s values and principles, he added.\nHe said it was essential that “we view it through a diverse lens that encapsulates the struggles and aspirations of all the members of the society, specifically of the women. When we speak of reading the Constitution from women’s perspective we aim to enhance our understanding and ensure that all individuals are treated equally under the law”.\nHe said the gender-based discrimination still existed in various forms withing our society and it was more visible in remote areas.\nHe said,”We have abundance of laws for the protection of the rights of women but the issue lies in the implementation of those laws. Let us all pledge to work together to strengthen the implementation mechanism and to enhance the parliamentary oversight in this regard.”\nThe minister said first there should be examination of the situation and then an implementation and monitoring plan should be devised in cooperation with all the stakeholders.",
  "retrievedAt": "2025-08-11T08:37:29.886Z"
}
