{
  "title": "PMNH Researchers to preserve remains of Dead Blue Whale",
  "link": "https://www.app.com.pk/national/pmnh-researchers-to-preserve-remains-of-dead-blue-whale/",
  "date_published": "2023-06-05T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):The Pakistan Museum for Natural History (PMNH) will preserve the specimen of recently discovered 36-feet long dead Blue Whale from Balochistan, for  public awareness and research.\nAccording to the PMNH, the 36-feet long lifeless Blue Whale body reached to shore on coast of Jiwani, Gwadar, Balochistan on last Friday.\nThe concerned authorities identified it as a blue whale, one of the three whale species found in Pakistan’s waters, alongside Bryde’s whale and Arabian humpback whale.\nDirector General, Gwadar Development Authority (GDA), Mujeeb Ur Rehman Qambrani pronounced to preserve dead specimen of Blue Whale for public awareness and research.\nOn the request of GDA, a team of PMNH zoologists comprising on  Muhammad Asif Khan, Dr. Muhammad Abbas, Dr. Shabbir Ali Aamir and Dr. Rifaqat Masroor reached onsite to inspect the dead specimen of Blue Whale to preserve its remains and skeleton.\nDirector, Administration, GDA,  Zahid Ahmed Lango and Deputy Director Administration,  Abdul Rahim Baloch also accompanied the PMNH team to facilitate them in preserving dead Blue Whale remains and skeleton for the purpose of public awareness and scientific research.\nThe PMNH officials are of the view that the specimen of Blue Whale will be a valuable addition to the existing collection of the natural history specimen in the museum.\nThe PMNH was established in 1976, under the patronage of Pakistan Science Foundation (PSF), Ministry of Science and Technology, Pakistan.\nIt has four divisions namely Botanical Sciences, Earth Sciences, Zoological Sciences and Public Services.\nThe first three divisions are engaged in the collection, preservation, identification, and research activities related to plants, animals, fossils, rocks, and minerals resources of Pakistan, while the latter is responsible for public education through dioramas, exhibits, lectures, workshop, seminar, posters and film shows, etc.\nPMNH also provides consultancy and advisory services to public and private sector organizations. Its scientists work on various projects for the popularization of natural history through research publications, displays, exhibits, and dioramas.",
  "retrievedAt": "2025-08-11T08:37:36.375Z"
}
