{
  "title": "SECP approves IPO application of Symmetry Group",
  "link": "https://www.app.com.pk/national/secp-approves-ipo-application-of-symmetry-group/",
  "date_published": "2023-06-05T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):Symmetry Group Limited after the approval of the Securities Exchange Commission of Pakistan (SECP) started its Initial Public Offering (IPO) application on Monday.\n“This significant milestone allows Symmetry Group to move forward with its plans to launch the IPO and offer shares to the public, said a press release,” said a press release issued here.\nSymmetry Group is a leading player in the digital industry and has been at the forefront of transforming and digitalizing marketing, sales, and other consumer-centric functions for organizations.\nThe Company has received approval for listing on the main board of the Pakistan Stock Exchange Limited, paving the way for its IPO.\nThe IPO will be conducted by the ‘Book Building’ method of offering, where shares are allotted to investors on the Dutch auction method.\nThe offering will consist of 101,240,082 shares obtainable at a floor price of PKR 4.25 per share, including a fresh capital raise of PKR 375. million. Additionally, the Company sponsors, Sarocsh Ahmed and Adil Ahmed will offer shares worth PKR 55 million.\nChief Executive Officer (CEO) & Co-Founder of Symmetry Group, Sarocsh Ahmed was enthusiastic about this milestone and said “Symmetry Group is driven by its pioneering legacy of transforming possibilities for businesses and organizations for over two decades.\nOur customers trust our creativity, innovation, and expertise in producing ground-breaking digital experiences. As we expand our capabilities and strengthen our core, our talented team sustains the trust of our stakeholders.\nFrom seamless digital integration to a re-imagined suite of transformative products and services, partnering with us allows businesses to unlock their true potential.\nWith aggressive local and global growth plans, the IPO boosts our financial standing, enabling us to develop cutting-edge, AI-driven products and intellectual properties.",
  "retrievedAt": "2025-08-11T08:37:22.865Z"
}
