{
  "title": "Speakers call for collaborative research on infectious diseases",
  "link": "https://www.app.com.pk/national/speakers-call-for-collaborative-research-on-infectious-diseases/",
  "date_published": "2023-06-05T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):Speakers at a one-day international seminar on “Infection Related Features of Microorganism” arranged by COMSTECH on Monday emphasized having collaborative research work by the academia and health sector in the area of infectious diseases which are increasing day by day.\nThe seminar on infection-related features of microorganisms was arranged in collaboration with Karolinska Institutet at COMSTECH with the presence of a number of national and international experts.\nSpeaking during the seminar, Prof. Dr. Ute Rumling, department of microbiology, tumour and cell biology, Karolinska Institutet, said that infectious diseases are a major cause of morbidity and/or mortality in developing as well as industrialized countries. She said that sub-clinical infections lead to gradual impairment of functionality.\nShe mentioned that susceptibility for infectious diseases is increasing. She informed that up to 80% of human microbial infections are caused by biofilm-forming bacteria and microbes in biofilms are tolerant against antibiotics and immune response. New pathogens are emerging due to changes in lifestyle, industrial processes, altered microbiome, and immune status.\nProf. Dr. Shazia Anjum, Dean, Faculty of Chemical and Biological Sciences, Islamia University Bahawalpur said that this field of study is very important, as microbes are the enemies of the human being.\nShe emphasized that we all need to collaborate and work together to fight infectious diseases.She appreciated the health capacity-building initiatives of COMSTECH and the seminar where people from the field will be able to learn and network to collaborate to combat diseases.\nThe Coordinator General COMSTECH, Prof. Dr. M. Iqbal Choudhary welcomed and thanked the participants of the seminar.\nHe said infectious diseases are a major threat to human well-being. He lamented that we spend a lot on other areas of research like technology but we are unconscious of the major killer of human beings since its inception.He said that the pharmaceutical industry is not interested in investing in the development of antibiotics, academics must focus on infectious diseases research to solve this problem.\nProf. Choudhary stressed the need for collaborative work in the area of infectious disease research.He said this seminar is organized with the objective to understand the infections at the molecular level, and let the researchers to network and collaborate.\nThe seminar was attended by the Ambassador of Yemen and the diplomats from Qatar and Uzbekistan.A large number of national and international researchers participated in the seminar in person and online.International and national speakers delivered ten lectures on different aspects of infectious diseases. Each lecture was followed by the question and answer session.",
  "retrievedAt": "2025-08-11T08:37:38.575Z"
}
