{
  "title": "Ensuring gender parity pivotal for socio-economic progress: NA Speaker",
  "link": "https://www.app.com.pk/national/ensuring-gender-parity-pivotal-for-socio-economic-progress-na-speaker/",
  "date_published": "2023-06-05T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): The National Assembly Speaker Raja Pervez Ashraf while appreciating the active participation of women Parliamentarians in the country’s August House Monday stressed the need for ensuring gender parity for socio-economic progress.\n“Social progress and development are interlinked with women’s inclusion in every sphere of life,” said the NA Speakerwhile inaugurating the seminar, “Reclaiming the Space: Reading the Constitution from Women’s Perspective” organized by the Women Parliamentary Caucus (WPC).\nHe said the struggle of Pakistani Parliamentarians to further the cause of democracy is unmatchable in the annals of world political history.\n“The need of the hour is to focus on the implementation of laws regarding ensuring gender equality in every sphere of life,” he remarked.\nThe NA Speaker said he has been honoured and proud to learn politics from the unmatchable and astute leadership of Mohtrama Shaheed Benazir Bhuttoo.\nWhile demanding for establishment of a Women Federal Ministry for empowering women, he said, “It is time that our men must come forward for empowering their women”.\nRaja Pervez Ashraf emphasized the need for direct elections of women Parliamentarians and said the text of the Constitution is above gender discrimination.\nShahida Rehmani General Secretary of WPC stressed the need for gender parity and gender equality as enshrined in the constitution.\nShe expressed her gratitude to the NA Speaker for supervising with a dedication to the whole procedure of Gender Budgeting for this financial year.\nShe said that WPC would continue to strive for women and children-friendly legislation. She said that since its inception in 2008, WPC has achieved milestones in increasing chances for women’s participation.\nMNA Mehnaz Akbar Aziz Convener of the Parliamentary Caucus On Child Rights signified the struggle of women parliamentarians for finding space in the Parliament of Pakistan.\nShe also emphasized that reading the Constitution from a women’s Perspective would be the right step on the occasion of the golden jubilee celebration of the Constitution.\nFurthermore, MNA Shaista Pervaiz Malik briefly pointed out the women-friendly legislation initiated by the platform WPC. She also demanded Women parliamentarians must have space in politics for direct election.\nAttorney General of Pakistan Mansoor Usman Awan demanded including women parliamentarians’ suggestions for gender budgeting.\nFederal Minister for Law and Justice Azam Nazir Tarar appreciated the participation and passion of women Parliamentarians in both Houses of Parliament.\nHe also resolved to continue exerting efforts for women’s socioeconomic inclusion. He also emphasized the need to implement laws for ensuring fundamental rights for women.",
  "retrievedAt": "2025-08-11T08:37:23.614Z"
}
