{
  "title": "8th Women International film festival concluded",
  "link": "https://www.app.com.pk/national/8th-women-international-film-festival-concluded/",
  "date_published": "2024-03-02T17:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 02 (APP):The 8th edition of the Women International Film Festival (WIFF) concluded on Saturday, the two-day event, which commenced on March 2nd, 2024, witnessed a diverse array of films from across the globe, emphasizing the festival’s commitment to bridging the gender gap in the world of cinema.\nWith a staggering 1,300 submissions, the festival showcased 31 compelling short and feature-length films from countries including the UK, Iran, France, Germany, Ukraine, and more. Notably, five films produced by Pakistani filmmakers, including “Hum Awaaz” and “Made with Love,” were among the featured works, said a press release.\nA distinguished jury panel, featuring filmmakers Mehreen Jabbar, Usman Mukhtar, and Marya Javed, had the challenging task of selecting the winners. Marjorie Lhomme’s “Paris Bruxelles” from France clinched the coveted Best Film award, while Kainat Thebo’s “Made with Love” earned the Best Pakistani Film Award, supported by the British Council and carrying a prize of 100,000 Pakistani Rupees.\nThe festival opened its doors for public screenings at the Pakistan National Council of the Arts (PNCA), with support from various international entities, including the Embassy of Spain in Pakistan, Ambassade De France Au Pakistan, and the Embassy of the Federal Republic of Germany Islamabad. Official media partner Dawn News English and radio partner City Fm 89 played pivotal roles, along with JazzCash as the official digital payment partner.\nThis year marked the relaunch of the Parwaaz Film Lab, a two-day event led by acclaimed Spanish filmmaker Elena Molina and British Pakistani film director Annusheh Rahim. Participants from all corners of Pakistan immersed themselves in this enriching experience.\nFollowing the initial screenings at PNCA, the festival extended its reach with four days of intracity screenings. Fatima Jinnah Women University hosted a campus screening, while Black Box Sounds featured Ukrainian Films. Alliance Française d’Islamabad showcased both French and Pakistani Films, and the closing reception took place at the Residence of Spain.\nThroughout its 8-year journey, WIFF has steadfastly aimed at eliminating the gender gap in the film industry. By providing a platform for storytellers worldwide, the festival has not only widened appreciation for independent cinema but also promoted female filmmakers. The founder and director, Madeeha Raza, reflected on the festival’s growth, expressing satisfaction in providing exposure and appreciation for independent filmmakers.\nThe festival is curated by Women Through Film, a Pakistan-based initiative dedicated to encouraging and facilitating young girls and women in self-expression through filmmaking. Seeking to celebrate the stories of inspiring women, this initiative aspires to empower female filmmakers, creating a fearless and economically independent community capable of addressing pertinent issues through film and interactive media.\nIn summary, the 8th Women International Film Festival stands as a testament to the global impact of female storytellers, providing a stage for diverse voices and fostering the growth of talent within the film community\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:05:25.769Z"
}
