{
  "title": "Autism, an overlooked neuro-developmental disorder among children on rise with scanty cure options",
  "link": "https://www.app.com.pk/national/autism-an-overlooked-neuro-developmental-disorder-among-children-on-rise-with-scanty-cure-options/",
  "date_published": "2024-03-02T08:54:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 02 (APP):Syed Arsalan Hashmi, an engineer by profession from Bannu district of Khyber Pakhtukhwa, had a blissful life on arrival of a cute baby boy, Azan as first child in the family.\nBased in Bannu, the couple was extremely contented over blessings bestowed on them and were fully engrossed in care of their beautiful baby.\n“Life was going smooth and our son was growing normal with expressing his liking for different things, but was unable to start talking,” relates Arsalan.\nHe used to say single words and we were hopeful that soon would start proper talking with passage of time.\nAzan’s inability to start speaking even on his third birthday, made parents deeply concerned and they decided to take the child to doctors for check-ups.\nMedical practitioners diagnosed the baby (Azan) having Autism Spectrum Disorder (ASD), a complex neuro-developmental disorder that affects child’s communication, socialization and cognition.\nDiagnosis of a neurological disease as reason behind weak response of Azan was nothing more than a bomb shell for both Arsalan and his spouse, turning their sentiments of contentment into feeling of deep gloom and worries.\nOur distress exacerbated manifold when we came to know that no pediatrician in Bannu is able to treat artistic child and we have to take Azan to big cities for rehabilitation through `Applied Behavior Analysts’ (ABA), recollects Arsalan while talking with APP.\nThe desperate parents found an Autism center in Karachi and rushed there with the hope of getting him cured.\nArsalan used to take Azan four times a month to Karachi from Bannu for therapies, but after six months of extensive traveling, gave up the practice because of enormous physical exertion for both the father and son along with huge financial burden.\nAfter a little pause, a privately run Talha Autism center in Peshawar grabbed attention of Arsalan and he started visiting provincial metropolis on weekly basis for a few months.\nObserving some improvement in the child, Arsalan and his spouse took a harsh step of leaving their spacious home in Bannu, and rented a house in Peshawar.\n“Parents of autistic children in Pakistan are caught between a rock and deep sea due to very high cost of treatment and mental stress they endure due to lack of proper cure facilities in their hometowns,” Arsalan shared his inner sentiments.\n“Life of parents with autistic child is very painful, filled with the emotions of melancholy, depression, anxiety and patience as well,” comments Mrs. Imran, mother of a 12 years child, Muhammad Yousaf affected by autism and deafness.\nYousaf’s father lives in Dubai for an employment and his mother has migrated to Peshawar from Swabi at her parents’ home for proper treatment of her son at government run Autism Center.\nDedicated efforts and strong devotion by mother brought improvement in severely autistic Yousaf who has an innate inclination towards painting and is engaged in expression of his thought through spreading colors on papers.\n“The hard to earn parents are unable to take their kids to other cities for treatment and leave them on God’s mercy,” observed Bilawal, a goldsmith by profession and father of an autistic child from Akhora Khattak area of Nowshera district.\nBilawal said in his hometown he found a lot of parents getting their kids treated through traditional healing by religious Pirs and taking them to shrines.\nBilawal visited different cities due to lack of autism treatment facility in his hometown and finally got his son Mohammad Momin admitted at an Autism Center in Peshawar.\nI take my son three days a week to Peshawar from Akharo Khattak in a privately hired transport service, shared Bilawal.\n“Lack of cost-effective treatment service for disadvantaged families having children with autism is pushing the patients toward severity of the illness when one resort to aggression, head banging, self biting, yelling and confining in seclusion,” observed Muhammad Bilal, Managing Director Talha Autism Center Peshawar.\nAccording to a study published in September 2023 in International Journal of Surgery Global Health, no reliable data on the prevalence of ASD in Pakistan is available, as individuals with psychiatric disorders resist going to health professionals due to social stigma, leading to a low number of case reports resulting in failure to receive proper care from professionals.\nHowever, the Pakistan Autism Society while quoting some statistics from South Asia, estimated in 2020 that, about 350,000 children are suffering from ASD in Pakistan.\nThere are several factors that have been identified that cause a child more likely to have ASD, including environmental, biologic, and genetic factors, experiencing complications at birth or having certain genetic or chromosomal conditions and inter family marriages.\nSome experts blame screen watching through use of mobile also as cause of increase in autistic children.\nAccording to estimates, there are around 150,000 number of artistic children in Khyber Pakhtunkhwa who are in dire need of treatment from qualified therapists, observed Dr. Maheen Khattak, an experienced therapist enjoying distinction of being the first ever and the only Board Certified Behavior Analyst (BCBA) in KP with additional qualification of Registered Behavior Therapist (RBT) from USA.\n“Realizing increase in number of children with ASD, Khyber Pakhtunkhwa government through Social Welfare Department set up an Autism Center in Peshawar for providing cure on free of cost basis,” informs Rizwan Ahmad, Project Director Center for Excellence for Special Children with Autism in KP.\nThe center has the capacity of providing rehabilitation services to 50 children, but we have admitted around 66 patients.\nChildren admitted at Autism Center are from Peshawar, Charsadda, Mardan and even Swabi districts who visit daily, covered a long distance for treatment and therapies, Rizwan added.\nDozens of patients are in lined and we receive more admission applications each day, but we cannot accommodate all the aspirants until complete rehabilitation of already enrolled children.\n“Acute paucity of treatment of autism in Khyber Pakhtunkhwa through certified therapists could be gauged from the fact that the government run Center for Excellence for Special Children with Autism in Peshawar is the only rehabilitation center that is functioning under the observation of a qualified BCBA (Board Certified Behavior Analyst),” disclosed Ms. Rutaba, Speech Therapist.\nIn the whole Khyber Pakhtunkhwa there is no such rehabilitation center for cure of adolescent with autism while majority of private centers are getting admitted grown up autistic patients and receiving treatment charges, claims, Maryam Jehangir, another psychologists who is also doing online course on  International Behavior Analyst (IBA) from an American institute.\n“Early diagnose and proper treatment could minimize adverse effects of the disease, but due to lack of awareness people realize neurological disorder in their children at later stages,” pinpointed Madam Tahira, a psychologist at Autism Center Peshawar.\n“Majority of private autism centers are established by parents of autistic children, but unfortunately,  the treatment they offer is very expensive and beyond the reach of lower/ middle class. The minimum fees they demand is around 60,000 PKR for one month,” laments Rizwan Ahmad, Project Director Center for Excellence for Special Children with Autism in KP.\nGovernment should announce a subsidy as a token of support for those parents who cannot afford fees at private autism center for rehabilitation of their child, he suggested.\nThe number of children affected by autism is rapidly increasing across the country and this is need of the hour to set up welfare oriented Autism Center at least at divisional level, he stressed.\nMeanwhile a recent invention of a device `EKKO Wave Therapeutic Device’ by a team of biomedical researchers from the National University of Science and Technology (NUST) in Pakistan, provided a ray of hope in treatment of developmental neuro disability.\nEKKO, winner of the 2023 Better World Project Award, is a non-invasive, mobile therapy that takes concepts used for treatment of muscles and applies them to the brain, informs Dr. Muhammad Usman Akram, Incharge of the project.\nTaking to APP, Dr. Usman said around 150 parents are using EKKO device at homes and are sharing good results in rehabilitation of their autistic children.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:05:19.495Z"
}
