{
  "title": "Kashmiris continuously living in state of siege due to Indian military’s huge presence: APHC",
  "link": "https://www.app.com.pk/national/kashmiris-continuously-living-in-state-of-siege-due-to-indian-militarys-huge-presence-aphc/",
  "date_published": "2024-03-02T09:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP):The All Parties Hurriyet Conference (APHC) has deplored that the huge presence of brutal Indian troops has put the Kashmiris’ lives under constant state of siege for the last over seven decades.\nAccording to Kashmir Media Service, the APHC spokesman Advocate Abdul Rashid Minhas, in a statement issued in Srinagar, said that over one million Indian troops remain deployed across length and breadth of the occupied territory who have turned it into a living hell for its residents through their barbaric acts.\nHe said the Kashmiris are witnessing extrajudicial killings, massacres, violent cordon and search operations, nocturnal raids, arrests and torture on daily basis.\nHe said that the Kashmiris have been subjected to worst kind of human rights violations for demanding freedom from Indian illegal occupation.\nBesides, the spokesman said, India has snatched all natural resources and other basic freedoms of the Kashmiri people, who have been demanding their political rights including their birthright, the right to self-determination. Kashmiri people are determined to continue their fight against Indian illegal occupation against all odds\nHe said that the Indian forces’ personnel enjoying unbridled powers under draconian laws are committing war crimes and crimes against humanity in the occupied territory with impunity. “Kashmiri people are determined to continue their fight against Indian illegal occupation against all odds”, he added.\nHe said that India was constantly trying to mislead the world about the ground situation in occupied Jammu and Kashmir. He said that the international community is legally and morally bound to stop unprecedented Indian repression in IIOJK and force New Delhi to respect the sentiments of the Kashmiri people and give them their right to self-determination.\nThe spokesman pointed out that unless the Kashmir dispute was resolved in accordance with the relevant UN resolutions, peace and stability could not be established in the region and Pakistan-India relations could not be improved on sustainable basis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:05:01.407Z"
}
