{
  "title": "PM directs strategy formulation for clean water supply to public, agriculture",
  "link": "https://www.app.com.pk/national/pm-directs-strategy-formulation-for-clean-water-supply-to-public-agriculture/",
  "date_published": "2021-06-17T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 17 (APP): Prime Minister Imran Khan on Thursday directed the authorities concerned to devise a comprehensive strategy on wastewater treatment to ensure supply of clean water to urban population and for agricultural purposes.\nChairing a meeting on the progress on Ravi Urban City and Central Business District projects, the prime minister stressed the need for installation of wastewater treatment plants especially in major cities.\nThe prime minister said in cities like Lahore, the use of modern technology was important to meet the shortage of water for growing population.\nThe meeting was attended by Finance Minister Shaukat Tareen, Special Assistant Dr Shahbaz Gill, Chairman Naya Pakistan Housing Authority Lt Gen (retd) Anwar Ali Haider, CEO Ravi Urban Development Authority Imran Amin, Vice Chairman Lahore Development Authority S.M. Imran Amin and senior officials.\nThe prime minister was informed that the development work at Sapphire Bay would be initiated soon after the finalization of the contract next week.\nThe process regarding approval of industrial zone will be completed by June to be followed by construction of the infrastructure.\nThe educational institutions including Iqra University, University of Management and Technology and ISC will set up their campuses in Ravi City. Also, Iqra University has shown interest in building a hospital besides its campus.\nThe meeting was also briefed on the transfer of three water plants by Water and Sanitation Authority (WASA) plants to Ravi City and the use of modern technology for wastewater treatment.\nThe participants were also updated on the directions issued by Environmental Protection Agency by Judicial Water Commission to expedite the approval process of Ravi Urban City project.\nIt was highlighted that a quota for local populace had been reserved for jobs under the Ravi City project and around 100,000 households would benefit from the opportunity. Also, the locals will get medical treatment on fifty percent concession.\nOn Central Business District project, it was informed that the auction process would start in the first week of July 2021.\nA board has already been established for the Central Business District project which was in consultation with Nespak and Frontier Works Organization (FWO) to finalize a design, with the development work set to begin next week.",
  "retrievedAt": "2025-08-11T20:51:27.392Z"
}
