{
  "title": "Fawad for Pak-German joint ventures in film, drama",
  "link": "https://www.app.com.pk/national/fawad-for-pak-german-joint-ventures-in-film-drama/",
  "date_published": "2021-06-17T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain Thursday stressed the need for joint ventures between Germany and Pakistan in the fields of film and drama productions.\nThe minister, in a meeting with German Ambassador Bernhard Stephan Schlagheck, said they would like the German film makers and drama producers to explore the beauty of Pakistan’s Himalaya range through the lens of their cameras.\nHe proposed the holding of zoom meeting with German film and drama producers associations with a view to strengthen cooperation in the arena of film and joint productions, a news release said.\nFawad said Pakistan’s relations with Germany were characterized by shared democratic values and multifaceted cooperation. Pakistan was among the first Asian countries that established diplomatic ties with Germany, he added.\nThe minister said the proposal of Ministry of Foreign Affairs in regard to a video film highlighting the special ties of Allama Iqbal with Germany and his poetry about Heidelberg would fortify cooperation in the realm of joint productions and documentaries.\nHe apprised the ambassador regarding government’s initiative to establish Media Technology University and said Germany’s cooperation would be welcomed in establishing state of the art modern education institution comprising four schools.\nFawad emphasized the need to collaborate with gaming and animation companies of Germany. The cooperation between Pakistan and Germany in the field would further boost economic ties between the two countries.\nAmbassador Bernhard Stephan Schlagheck appreciated the proposal of joint ventures in the areas of film and drama productions as it would help project beauty of the area, besides promoting tourism.\nHe showed his keen interest to advance cooperation in the area of gaming.\nThe envoy commended the efforts of current democratic dispensation in the process of finalizing the Journalists Protection Bill.\nThe two sides discussed various issues faced by the journalist community and the state of media freedom in Pakistan.\nThe minister said Pakistan had one of the freest media in the region as “we firmly believe in fundamental and democratic right of freedom of expression”.\nHe informed the ambassador that Pakistan had about 43 international channels, 112 local private channels, 258 FM channels and 1569 print publications operating in the country.\nThe presence of such a huge sized mass media, he added, defied the claim of those, who complained of intimidation and curbing of media freedom.\nThe minister rejected the impression that laws had been passed in Pakistan to suppress social media freedom. He said hate speech was a universally recognized phenomena that had to be discouraged, adding that all the states were duty-bound not to allow hate speeches.\nFawad also raised his concern about the rising trend of Islamophobia in the West.\nBoth the dignitaries exchanged views to further reinforce cooperation in the fields of media and information.",
  "retrievedAt": "2025-08-11T20:51:21.550Z"
}
