{
  "title": "IT minister invites Swedish tech companies to invest in Pakistan",
  "link": "https://www.app.com.pk/national/it-minister-invites-swedish-tech-companies-to-invest-in-pakistan/",
  "date_published": "2021-06-17T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): Federal Minister for IT and Telecommunication Syed Amin Ul Haque Thursday invited the Swedish tech companies to invest in Pakistan as the environment for investment in the country is conducive.\nThe minister extended the invitation during a meeting with Swedish delegation led by Ambassador of Sweden in Pakistan Henrik Persson, said a news release.\nDuring the meeting, matters of mutual interests and related to IT and telecommunication, connectivity and digitalization were discussed.\nFederal Secretary Ministry of IT & Telecom Dr. Sohail Rajput, Chairman PTA Maj Gen (r) Amir Azeem Bajwa, Executive Director Frequency Allocation Board (FAB) Brig (r) Muhammad Tahir Ahmed Khan and senior officers of the Ministry of IT were also present on the occasion.\nThe two sides also agreed to increase cooperation in the field of IT and Telecommunication.\nTalking to Ambassador of Sweden, the minister said that Pakistan greatly values its relations with Sweden as the collaboration between the two countries in the field of IT and Telecommunication was vital.\nHe said that IT and telecom sector of Pakistan was rapidly growing and the country’s IT exports are also increasing.\nThe minister said that while considering Sweden is one of the leading technology developers in Big Data and Analytical solutions, IoT solution and Artificial Intelligence, Pakistan wanted to get benefit from Sweden’s experiences in the field of technology.\nHe also aspired that the two countries devise mechanism for offering access to Pakistani freelancers on Swedish freelancing platforms on preferential basis.\nSyed Amin Ul Haque said that Pakistan is committed to end digital divide between rural and urban areas of the country. Strong measures are being taken to provide telecom services through Universal Service Fund (USF) across the country, he added.\nSwedish Ambassador lauded the Ministry of IT for its measures for the progress of IT and Telecom sector of Pakistan. He said that the Swedish technology companies wanted to invest in Pakistan.",
  "retrievedAt": "2025-08-11T20:51:26.894Z"
}
