{
  "title": "QAU, US embassy host 15th int’l American Studies conference",
  "link": "https://www.app.com.pk/national/qau-us-embassy-host-15th-intl-american-studies-conference/",
  "date_published": "2021-06-17T18:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): The Area Studies Centre for Africa, North and South America at Quaid-i-Azam University and the U.S. Embassy in Islamabad co-hosted a two-day virtual conference on “American Studies in Pakistan: Challenges and Way Forward.”\nConference participants discussed ways to promote American Studies in Pakistan and analyzed the importance of such academic activities in promoting people-to-people contacts and strengthening U.S.-Pakistan bilateral relations.\nThe Vice Chancellor of Quaid-i-Azam University, Professor Muhammad Ali, lauded the U.S. Embassy’s efforts to promote rich academic culture through such engagements with universities in Pakistan.\nHe further said, “The conference was a timely initiative by the Area Study Center and the American Embassy in Islamabad, where the relationship between the U.S. and Pakistan are going through transformation and adjusting to the evolving geopolitical realities of the region.”\nU.S. Embassy Chargé d’affaires Lesslie Viguerie added, “I am confident that our bilateral ties will grow, in part, because of events such as the American Studies Conference.\nBy championing the importance of the American Studies discipline, we are promoting understanding between our peoples.  By exchanging ideas and making connections with each other, we are deepening the relationship between our two countries.”\nThe principal guest, Federal Minister for Education Shafqat Mehmood, acknowledged in his opening remarks the efforts of the U.S. government in promoting academic excellence for Pakistanis.\n“This is a very important conference because we have a long bilateral relationship with the United States, and it is important for our students to engage with the U.S. through such efforts,” he said.\nScholars from both Pakistan and the United States attended the conference, which included six sessions addressing various aspects of the discipline of American Studies:  U.S. Socio-Economic Strategies in Pakistan; American Government and Politics: Patterns for Pakistan;\nAmerican Historical Experiences and Lessons for Pakistan; Literature, Culture, and American Studies in Pakistan; U.S. Foreign and Security Policy in South Asia: Analysing Pakistan’s Perspective; and American Studies in Pakistan: Present Status, Challenges, and the Way Forward.\nThe conference concluded with remarks by the Dean of the Faculty of Social Sciences Professor Muhammad Idrees and U.S. Embassy Minister Counselor for Public Affairs Raymond Castillo.",
  "retrievedAt": "2025-08-11T20:51:19.265Z"
}
