{
  "title": "NA Speaker seeks nominations for parliamentary committee to remove legislation related concerns",
  "link": "https://www.app.com.pk/national/na-speaker-seeks-nominations-for-parliamentary-committee-to-remove-legislation-related-concerns/",
  "date_published": "2021-06-17T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): National Assembly Speaker Asad Qaiser on Thursday sought nominations from the opposition parties to constitute a parliamentary committee, as per the agreement reached between the government and the opposition, aimed at looking into possibilities for removal of their concerns on legislative business completed on June 10.\nHe announced in the House that the committee would be consisted of 12 members and the opposition should give six names of their representatives at the earliest.\n“The opposition has objection that legal formalities had not been fulfilled in the passage of bills on June 10, while the government has the stance that all legal and constitutional obligations were complied with in this regard. So the committee will review all the objections,” he observed.\nThe speaker said the bills, after passage from the NA, had been presented in the Senate and now the same were with the standing committees concerned. “So, the parliamentary committee will consider all the legal aspects accordingly,” he added.\nAsad Qaiser said with the committee formation, the opposition would withdraw the no-confidence motion it submitted against Deputy Speaker Qasim Khan Suri as per the agreement reached between the government and opposition teams in a meeting held here Thursday.\nHe also mentioned that the meeting had also decided that there would be no personal attack on any individual, including Leader of the House, Leader of the Opposition, parliamentary leaders and members, in speeches of the lawmakers during the budget session.\nStrict disciplinary action would be taken against those, who would be launching personal attacks, hurting self-respect and dignity of other members, and indulging in the fist fight, he said, adding there would be no permission for any non-parliamentary attitude.",
  "retrievedAt": "2025-08-11T20:51:25.316Z"
}
