{
  "title": "EU Special Envoy praises Pakistan’s role for regional, Afghan peace",
  "link": "https://www.app.com.pk/national/eu-special-envoy-praises-pakistans-role-for-regional-afghan-peace/",
  "date_published": "2021-06-17T10:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): European Union’s Special Envoy for Afghanistan, Tomas Niklasson, has praised Pakistan’s proactive role for regional peace and stability, particularly for Afghanistan.\nTomas Niklasson, in a statement issued by EU Pakistan, said the EU and Pakistan reiterate their strong support for an Afghan-led and Afghan owned peace process, involving\nall stakeholders to collectively work for achieving lasting peace in the region and Afghanistan in particular.\nHe said peace in Afghanistan was linked to socio-economic development of Afghanistan and it would also strengthen regional integration and connectivity.\nHe said, “My meetings reaffirmed the position of both the EU and Pakistan, that only a political settlement through inclusive dialogue, offers hope for durable peace.”\nOn several occasions, he said, the EU and Pakistan have called upon all parties to strive for the elimination of violence as a genuine commitment to peace and reconciliation.\n“The European Union will make every effort to support the peace process, which should protect and strengthen progress on human rights and fundamental freedoms of all Afghans, with special relevance to women and girls, laying the foundation for a peaceful, prosperous and democratic Afghanistan,” he assured.\nHe underlined the EU’s efforts to the Afghan Peace Process and continued engagement\nwith regional partners as he concluded his first official visit to Pakistan today.\nDuring the three-day visit, Special Envoy Niklasson held meetings with both civil and military leadership including Pakistan’s Special Representative for Afghanistan Mohammad Sadiq, MoFA Director General (Iran/Afghanistan/Turkey) Asif H. Memon, Chief of General Staff Lt. General Sahir Shamshad Mirza and Deputy Director General ISI General Tabassum Habib.\nThe envoy also met with several foreign ambassadors to Pakistan, including the European Union Member States, members of think tanks and local and international journalists during his visit here.\nReported By Shabbir Hussain\nAPP, Digital News Service.",
  "retrievedAt": "2025-08-11T20:51:29.038Z"
}
