{
  "title": "Steering Committee for Ehsaas CCTs endorses scale-up of stipends",
  "link": "https://www.app.com.pk/national/steering-committee-for-ehsaas-ccts-endorses-scale-up-of-stipends/",
  "date_published": "2021-06-17T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): Steering Committee for Ehsaas’ education Conditional Cash Transfers (CCTs) in a meeting held under the chairmanship of the Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar endorsed scale-up of stipends for secondary education.\nThe steering committee was briefed on the up scaling of primary education conditional cash transfer (CCT) programme, Waseela-e-Taleem Digital to the secondary level. The programme is all set to be rolled out across all districts of the country in the first quarter of the next financial year.\nIn the meeting, all four provinces, Gilgit Baltistan and Azad Jammu and Kashmir came to the table to endorse the scale-up of Ehsaas stipends for secondary education.\nIt was fully ratified that secondary education CCT, when launched under the umbrella of Ehsaas will reduce disparities in secondary schooling opportunities by raising school attendance, enrollment, and the school progression among out of school children particularly girls.\n“Coming under the umbrella of Ehsaas, the secondary education CCT will help poorest families to overcome financial difficulties to access secondary education.\nThe secondary level CCT programme is being structured in line with Ehsaas Stipends policy which allows higher stipend amount for girls as compared to boys”, remarked Dr. Nishtar.\n“The opportunity costs of schooling continue to rise with age and are much higher after 10 years of age.\nIn rural areas declining trend increases after grade 5 and in urban areas dropout rises after grade 10 but with different reasons”, she said.\n“Part of Waseela e Taleem Digital, the secondary education stipends will encourage parents to send their daughters to secondary schools and support them to achieve higher education.\nThe programme will bring deserving secondary school children into its fold from across all 154 districts of Pakistan”, she added.\nThe steering committee for Ehsaas education CCT comprises of members from Poverty Alleviation and Social Safety Division, Ministry of Education and Professional Training,\nForeign Commonwealth and Development Office, the World Bank, Asian Development Bank and Higher Education Departments from provinces including Azad Jammu and Kashmir and Gilgit Baltistan who were joined by Waseela-e-Taleem Digital operations team.",
  "retrievedAt": "2025-08-11T20:51:27.927Z"
}
