{
  "title": "26th Constitutional Amendment: SC Seeks Record of Past Full Courts",
  "author": null,
  "content": "ISLAMABAD, Oct 08 (APP):The Supreme Court on Wednesday directed the presentation of a list of full courts, constituted in the past, while hearing petitions challenging the 26th Constitutional Amendment.\nThe eight-member larger bench, headed by Justice Aminuddin Khan, comprised Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Ayesha Malik, Justice Hassan Azhar Rizvi, Justice Musarrat Hilali, Justice Naeem Akhtar Afghan, and Justice Shahid Bilal.\nDuring the proceedings, Justice Aminuddin observed that both the court and lawyers relied on the Constitution, which remained in effect unless amended.\nAppearing on behalf of the Lahore High Court Bar Association, senior lawyer Hamid Khan argued that the 26th Amendment was passed in the Senate in undue haste and during late-night hours. He contended that before the amendment, judges held a majority in the Judicial Commission, but after the amendment, administrative representatives gained the majority, which he said undermined the independence of the judiciary.\nHe requested that the case be heard by a full court, noting that the amendment directly affected judicial powers and independence. He further pointed out that besides the current eight-member bench, the remaining eight judges of the Supreme Court were also serving when the Amendment was enacted; therefore, a full court of all sixteen judges\nJustice Jamal Mandokhail remarked: “For now, the question is not whether the amendment is right or wrong — it remains part of the Constitution until struck down by this court.”\nJustice Muhammad Ali Mazhar asked under what authority the Supreme Court could form a full court, noting that a parliamentary committee had been included in the Judicial Commission through the Amendment.\nJustice Ayesha Malik observed that there was no restriction on forming a full court under the 26th Amendment, and the court could exercise that power through a judicial order.\nHamid Khan maintained that the court could exercise this authority under Article 187 of the Constitution and cited several constitutional cases in which full courts had been constituted in the past.\nJustice Mandokhail asked, “If we accept your proposal and make all judges part of the constitutional bench, will you be satisfied then?”\nJustice Aminuddin questioned, “If the existence of the constitutional bench itself is nullified, then who will decide the Supreme Court cases?”\nJustice Naeem Afghan noted that the Practice and Procedure Act did not exist in the past, and the authority to form benches now rests with the constitutional committee instead of the Chief Justice alone.\nThe court clarified that arguments are currently being heard only on the request for constituting a full court, while the main case regarding the constitutional validity of the 26th Amendment will be taken up later.\nJustice Aminuddin remarked that discussions on this preliminary issue alone might continue for a month before the bench to hear the case is finalized.\nAdvocate Hamid Khan will submit the record of previously constituted full courts on Thursday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:58:30.841Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/26th-constitutional-amendment-sc-seeks-record-of-past-full-courts/",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T16:49:00.000Z"
}
