{
  "title": "ISSI signs MoU for collaborative partnership with Riphah International University",
  "author": null,
  "content": "ISLAMABAD, Oct 08 (APP):Further strengthening its national collaborations, the Institute of Strategic Studies Islamabad (ISSI) has signed a Memorandum of Understanding (MoU) with Riphah International University (RIU), Islamabad.\nThe MoU was signed by Ambassador Sohail Mahmood, Director General, ISSI, and Professor Dr Anis Ahmad, Vice Chancellor, Riphah University, in a ceremony held at ISSI, said a press release issued on Wednesday.\nThe ceremony was attended by Prof Dr Rashid Aftab, Director Riphah Institute of Public Policy, and Dr Neelum Nigar, Director Centre for Strategic Perspective (CSP) at ISSI, among others.\nAmbassador Sohail Mahmood, in his remarks on the occasion, lauded the inspiring academic journey of Riphah University under the visionary leadership of Professor Dr Anis Ahmad.\nHe emphasized that sharing the same vision on domestic, regional, and international issues, both Institutions had huge potential to join hands in research and human resource development sectors. In contemporary times, the academic practices and policy formulation processes must complement each other in order to adopt holistic approaches in the light of informed analyses.\nYouth, being the torch-bearers of Pakistan’s future, must be meaningfully engaged in the discourse on the present-day challenges at the domestic and international level, and apprised of how Pakistan is carving out opportunities out of these challenges.\nDG ISSI hoped that, in this endeavor, the ISSI-RIU collaboration would play an instrumental role in engaging the youth of Pakistan. He specifically mentioned areas such as public policy, climate change, water security, the evolving situation in South Asia, the role of ‘Hindutva’ ideology in shaping the regional environment, global Islamophobia, and a range of non-traditional security challenges, to be in focus in this collaboration.\nProfessor Dr Anis Ahmad stressed that the two Institutions can collaborate on several national and international projects in the areas of research, training, dialogue, and publication.\nHe emphasized that to adopt a homogenous approach for Pakistan’s development and policy formulation, it was essential to ‘decolonize’ academic thought and practices as a priority. The country’s academic and policy-practicing circles must adopt strategic, long-term thinking approaches in order to formulate lasting responses to the emerging challenges.\nCommending the MoU signing between ISSI and RIU, Dr Anis Ahmad underlined key areas of potential collaboration in national, regional, and global arenas.\nThe MoU marks ISSI’s commitment to engage leading national institutions as well as the youth under the umbrella of its NextGen program, and form a bridge to students, faculty, and policy practitioners through dialogue, joint research, human resource development, and academic exchanges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:58:53.928Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/issi-signs-mou-for-collaborative-partnership-with-riphah-international-university-2/",
  "dateList": "2025-10-08",
  "date_published": "2025-10-08T15:50:00.000Z"
}
