{
  "title": "Education Minister call for enhancing Pak-Qatar bilateral ties",
  "link": "https://www.app.com.pk/national/education-minister-call-for-enhancing-pak-qatar-bilateral-ties/",
  "date_published": "2024-02-01T17:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP): Caretaker Federal Minister for Education and Professional Training Madad Ali Sindhi Thursday said that Pakistan and Qatar should enhance their bilateral ties especially in exchange of technology, education and research.\nThe minister was speaking during a meeting with the Ambassador-designate of Qatar to Pakistan, Ali Mubarak A.E. Al-Khater and other officials of the Embassy.\nMadad Ali welcomed the Qatar delegation and said that the two countries had cultural, linguistic and people-to-people love for each other.\nHe discussed with the delegation exchange of expertise and knowledge regarding vocational and technical training.\nThe minister said that the two countries could benefit from the experience of each other.\nHe praised the long standing cordial relations between the two countries.\nMadad Ali welcomed exchange of teachers and students to further mutual cooperation. He said that there was significant potential in cooperation between the two countries.\nHe said that teachers training and quality of education had been given the highest priority since he took charge of his office.\nHe said that digitalisation of the education sector could address numerous challenges of today and tomorrow.\nHe highlighted the E-Taleem and Teleschool platforms developed by the Ministry of Education in its bid to develop digital solutions to prevalent problems in the public education sector.\nMadad Ali said that Pakistan had always collaborated with Muslim countries and looks forward to enhancing bilateral and multilateral cooperation with Qatar.\nHe appreciated the developments in the education sector of Qatar and said that through exchange of expertise Pakistan could learn from their experiences.\nMadad Ali acknowledged the booming construction and hospitality sector of Qatar and expressed his desire to enhance collaboration in the fields.\nThe Qatari ambassador said that the people of his country had deep affiliation with Pakistan.\nHe said that university-to-university cooperation and technical institution-to-technical institution collaboration was the way forward.\nThe minister said that the both countries should exchange expertise on the development of digital learning platforms, in order to benefit from the experience of each other.\nMadad Ali praised the current government’s efforts in modernizing the education system of Pakistan.",
  "retrievedAt": "2025-08-11T00:09:27.851Z"
}
