{
  "title": "Interior Minister expresses sanctification over arrangements for elections in Balochistan",
  "link": "https://www.app.com.pk/national/interior-minister-expresses-sanctification-over-arrangements-for-elections-in-balochistan/",
  "date_published": "2024-02-01T10:27:00.000Z",
  "source": "APP",
  "content": "QUETTA, Feb 01 (APP): Caretaker Minister for Interior Dr Gohar Ejaz on Thursday reiterating government resolve said the caretaker government was determined for holding fair, free and peaceful elections in the country.\n” All resources will be provided to the provincial government for holding transparent and peaceful elections,” he said while addressing a consultative meeting held here at Secretariat to review the overall law and order situation and arrangements of the provincial government for upcoming general elections.\nThe interior minister expressed his satisfaction over the preparations and best strategy of the provincial government for holding peaceful and successful elections in Balochistan.\nCaretaker Minister for Home and Tribal Affairs, Mir Zubair Jamali, Chief Secretary Balochistan Shakil Qadir, Additional Chief Secretary Home Balochistan, Zahird Saleem, Commissioner Quetta Hamza Shafkat and officers of the law enforcement agencies attended the meeting.\nAdditional Chief Secretary Home, Zahid Saleem gave a detailed briefing regarding the overall situation of law and order in the province and arrangements for holding the elections in the province.\nThe interior minister said that caretaker government was committed to complete the election process by using all available resources and leaving no stone unturned in that regard.\nFederal government was striving hard to provide the provincial governments with necessary equipments, latest gadgets and other resources to ensure safety of lives of the voters and candidates, he added.\nLauding the efforts made by the Balochistan government for maintaining peace and holding general elections 2024, the minister said provincial government had chalked out a comprehensive strategy for the successful conduct of the election process.\nThe minister said that elements hostile to peace would not be allowed to take the law into their hands.\nDr Gohar, said that there was a dire need for devising a long-term integrated strategy for sustainable peace in the province, adding that formation of a better strategy for maintaining law and order in the province could prevent young minds from falling into the wrong hands.\nThe government was taking all steps to eliminate poverty and provision of better opportunities for dignified employment for prosperity of the province, he added.\nThe interior minister pointed out that he was reviewing the election preparations in all the provinces on the special instructions of the Caretaker Prime Minister Anwarul Haq Kakar.",
  "retrievedAt": "2025-08-11T00:10:46.595Z"
}
