{
  "title": "PM directs accelerated action against drug smugglers, hoarders",
  "link": "https://www.app.com.pk/national/pm-directs-accelerated-action-against-drug-smugglers-hoarders/",
  "date_published": "2024-02-01T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday directed to improve the performance of the Drug Regulatory Authority of Pakistan (DRAP) and accelerate action against drug smugglers and hoarders.\nChairing a meeting of the Federal Cabinet, the prime minister instructed to compile the recommendations for necessary legislation regarding the deregulation of drug prices and its onward presentation before the Parliament by the next elected government.\nAddressing the cabinet meeting, he said the government was taking all possible steps to provide medicines to the common man at reasonable prices.\nHe further said the government was framing such policies which would benefit the common man and also help develop the pharmaceutical industry.\nThe cabinet approved the increase in the prices of 146 essential life-saving medicines, keeping in view the rising prices of their raw material in the global market under the hardship category.\nThe meeting was informed by the Ministry of National Health Services and DRAP that through the online portal of the Authority, citizens could file complaints regarding the non-availability of medicines in the market.\nOn the recommendation of the Ministry of Finance, the cabinet approved the signing of a memorandum of understanding (MoU) between the Competition Commission of Pakistan and the State Administration of Market Regulation (SAMR) China. Under the MOU, exchange of information and technical capacity would increase between the two countries.\nThe cabinet, on the recommendation of the Ministry of Foreign Affairs, allowed renowned Pakistani psychologist Muhammad Saleem Khan Tareen to receive the award of Member of the British Empire from King Charles (III), in honour of his services in the field of psychology.\nIt also allowed Air Chief Marshal Zaheer Ahmed Baber Sidhu to receive the Gold Medal for Aeronautical Merit awarded by Italy,\nin recognition of his services for the increased cooperation between the air forces of the two countries.\nThe cabinet approved the decisions taken in the meeting of the Cabinet Committee on Energy (CCOE) held on January 26, besides endorsing the decisions of the Cabinet Committee on Legislative Cases taken on January 26 and 31, 2024.",
  "retrievedAt": "2025-08-11T00:10:11.685Z"
}
