{
  "title": "OIC ombudsmen pledge to address global injustices; condemn Israeli brutalities in Palestine",
  "link": "https://www.app.com.pk/national/oic-ombudsmen-pledge-to-address-global-injustices-condemn-israeli-brutalities-in-palestine/",
  "date_published": "2024-02-01T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP):The ombudsmen of the Organisation of Islamic Cooperation (OIC) countries have reiterated their commitment to addressing global injustices, with a particular focus on the dire circumstances faced by the people of Palestine.\nThe ombudsmen of the Muslim world met in the board meeting of the OIC Ombudsman Association (OICOA) attended by members from Turkiye, Azerbaijan, Indonesia, Morocco, and Bahrain in person, while the one from Iran participated virtually, creating a diverse and unified front against these grave concerns, said a news release issued here on Thursday.\nSecretary General of OICOA and Federal Tax Ombudsman of Pakistan, Dr. Asif Mahmood Jah stated, “We must elevate our collective voice to echo the cries of the innocent who suffer daily. The brutalities of the Zionist regime cannot go unchallenged,” calling for decisive and impactful advocacy beyond empathy.\nDr. Jah emphasized the need for unified strength and action within the Ombudsman community, saying, “Now, more than ever, our solidarity, effort, and cooperation are vital. We possess the power to drive change.”\nPresident of OICOA and Chief Ombudsman of Turkiye, Seref Malkoc, highlighted the escalating issue of Islamophobia in European countries and lamented the collapse of humanity witnessed in the ongoing Palestinian genocide.\nHe expressed disappointment in the silence of global leaders amidst the despair and devastation.\nMalkoc applauded South Africa’s initiative in bringing Israel’s actions to the International Court of Justice and expressed hope that Palestinians would rise from the ashes.\nThe Board Members unanimously condemned the ongoing atrocities in Palestine and supported the leadership of OICOA’s call for immediate and practical intervention. They pledged support from their respective ombudsman offices for bringing the atrocities of the Zionist Israeli regime to the forefront.\nExecutive Secretary OICOA, Almas Ali Jovindah, described the Board Meeting as a significant turning point for the impactful future of OICOA.\nHe emphasized that the determination to move from passive observation to active intervention was a testament to OICOA’s commitment to upholding human dignity and rights, promising the Palestinian people that their suffering has not gone unnoticed, and their fight for justice is shared by Muslim brothers and sisters worldwide.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:11:06.511Z"
}
