{
  "title": "IHRO urges world to hold India accountable for humiliating basic rights of Kashmiris",
  "link": "https://www.app.com.pk/national/ihro-urges-world-to-hold-india-accountable-for-humiliating-basic-rights-of-kashmiris/",
  "date_published": "2024-02-01T11:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP): International Human Rights Observer (IHRO) Khalid Sulehri Thursday draw world attention towards unchecked crimes against humanity in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and urged the international community to take practical steps to hold India accountable for its widespread human rights violations.\nTalking to PTV news, he explained that we were observing Kashmir Solidarity Day on February 5 to express wholehearted support to the relentless struggle of Kashmiri people for their inalienable right to self-determination under United Nations resolutions.\nThe IHRO said that the fascist government of India was involved in barbarity, cruelty and inhuman acts in the IIOJK,”.\nHe stressed that India must end its gross human rights violations in held valley and reverse its unilateral and illegal actions of 5th August 2019.\n“As we will observe the Kashmir Solidarity Day, the people of Pakistan will salute the sacrifices of our Kashmiri brothers and sisters who have suffered under brutal Indian oppression”, he added.\nHe also appeals to the international community to “break its criminal silence” over the continued human rights violations and systematic state terrorism in occupied Jammu and Kashmir.\nWhile condemning the Modi’ s brunt persecution of minorities particularly Muslims in India, he said it seemed Modi’ s government was working on RSS policy to sabotage the basic rights of minorities and imposed Hindutva in the so-called democratic and secular country.\nHe said Pakistan was continuously highlighting the issue of Kashmir at national and International level to expose Indian oppression in IIOJK.",
  "retrievedAt": "2025-08-11T00:10:36.882Z"
}
