{
  "title": "Pakistan’s new currency banknotes to be introduced in next two years: Saleem Ullah",
  "link": "https://www.app.com.pk/national/pakistans-new-currency-banknotes-to-be-introduced-in-next-two-years-saleem-ullah/",
  "date_published": "2024-02-01T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP): Deputy Governor at State Bank of Pakistan Saleem Ullah Thursday disclosed that new banknotes with improved security features will be introduced in the next two years where SBP has announced an art competition to engage local artists, designers, and art students in shaping the visual identity of the upcoming currency.\nIn an exclusive interview with a private news channel, he said that this visionary initiative comes as part of SBP’s commitment to revamp the existing banknote series and address concerns related to counterfeit currency circulation within the country.\nHe said that it was an “established practice” to introduce new banknotes every 15 to 20 years for security purposes, after 2005 Pakistan will soon introduce easy and technology-based standard currency notes to facilitate the public.\nHe said that local artists, designers, and art students will be eligible to participate in the art competition.\nThe designs could be on the themes of social and cultural identities, diversity, climate change and environment protection, economic development, natural landscapes, architectural heritage and national symbols, he mentioned.\nThe designs could be submitted by March 11, after which a jury of “reputed artists” will recommend six designs for each denomination, he further added.\nThe rollout of new banknotes is expected to be completed “within the next two years,” he highlighted.\nReplying to a question, he said that State Bank is ensuring an adequate supply of good quality banknotes across the country, adding, we have run various awareness drives for the public to recognize the original banknotes.\nHe also termed the introduction of currency notes with new security features as a “positive development”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:11:05.814Z"
}
