{
  "title": "Probationary officers briefed on Radio Pakistan’s functions",
  "link": "https://www.app.com.pk/national/probationary-officers-briefed-on-radio-pakistans-functions/",
  "date_published": "2024-02-01T14:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP): A batch of probationary officers of the 51st Common Training Program were given a detailed briefing about the overall functions of the Radio Pakistan during their visit to the National Broadcasting House here on Thursday.\nAccording to a press release, Director General of Radio Pakistan Saeed Ahmad Sheikh gave a detailed briefing to the visiting officers about the working of different departments of Radio Pakistan, including News and Current Affairs, Programs, and Engineering.\nThe Director General provided a comprehensive historical role played by the National Broadcaster during wars and natural calamities.\nHe highlighted the Radio Pakistan’s contribution to the national development through awareness campaigns on national harmony and peace as well sensitization of the masses on economy.\nSaeed Ahmad Sheikh told the delegation about the achievements made by the national broadcast especially by aligning itself with the latest technology and modern trends in the field of broadcasting.\nThe delegation was informed that Radio Pakistan was utilizing audio, video, and written formats to reach a wider audience, both educated and uneducated.\n“Through its app, the national broadcaster is targeting the audience beyond the country’s borders,” the DG said adding the technological integration had allowed Radio Pakistan to reach a broader and more diverse audience, catering to different interests and age groups.\nDirector News and Current Affairs Aman Ullah Sipra, Director Program Riffat Qayoum, Director Finance Inam ul Haq and Director Engineering Muhammad Aqil Khan who were also present on the occasion, addressed to the queries of the delegation.\nThe visiting officers participated in a program of FM-101 and recognized the pivotal role played by Radio Pakistan over the years in educating, raising awareness and entertaining the people.\nThey were amazed at the innovation and technology adopted by the national broadcaster including the web streaming of channels such as sports, environment, religion, health and kids, while keeping the old traditions intact.\nThe probationary officers visited different sections of Radio Pakistan and took a keen interest in their working.",
  "retrievedAt": "2025-08-11T00:09:56.544Z"
}
