{
  "article_id": "2025-09-24_53d96d0acc8df9c3470eafdc06be0f39",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pharmaceutical-exports-hit-record-457m-gilani/",
    "retrieved_at": "2025-10-11T23:27:56.813Z"
  },
  "metadata": {
    "title": "Pharmaceutical exports hit record $457m: Gilani",
    "author": null,
    "date_published": "2025-09-24T14:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 306,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 24 (APP):Chairman Senate Syed Yousuf Raza Gilani on Wednesday said Pakistan's pharmaceutical exports had reached a record USD 457 million in the last fiscal year, registering 34 percent growth - the highest in over two decades. Delivering the keynote address at the 8th Pakistan Pharma Summit and the 4th Pharma Export Summit & Awards (PESA 2025), he termed the achievement a matter of national pride, noting that Pakistan now meets the vast majority of its pharmaceutical needs through local production. Gilani congratulated the top 50 exporters of pharmaceuticals and allied products, honored at the PESA Awards, calling them the \"torchbearers of Pakistan's growing stature in international markets.\" The event, organized by the Pakistan Pharmaceutical Manufacturers' Association (PPMA), brought together exporters, industry leaders, policymakers, and international experts. Gilani was received by Tauqeer Ul Haq, Chairman PPMA, Dr. Kaiser Waheed, Chairman Organizing Committee, and Co-Chairmen Haroon Qasim and Asad Shuja. Highlighting the sector's transformation, he pointed to the adoption of artificial intelligence, digital health platforms, and advanced manufacturing technologies, as well as policy support through reduced duties on Active Pharmaceutical Ingredients (APIs) and the launch of PharmEx Pakistan. He assured the industry of Parliament's full support, stressing that relevant Senate and National Assembly committees remain committed to enabling better legislation, aligning policies, and encouraging investment in research and development. Welcoming international delegates, Gilani underscored the importance of global partnerships, technology transfer, and adherence to international certifications, including those from the World Health Organization (WHO), to expand Pakistan's footprint in advanced markets. \"The way forward lies in a progressive approach that links innovation, collaboration, and sustainability,\" he said, adding that with resilience and determination, Pakistan's pharmaceutical industry could capture a much larger share of the trillion-dollar global market. He concluded by congratulating PPMA leadership and award recipients, reaffirming the Senate's support for building a stronger, healthier Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}