{
  "article_id": "2025-09-24_ee75a41332e4cc041f479d7563549f56",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/8-15-mln-tonnes-waste-disposed-of-under-suthra-punjab-program/",
    "retrieved_at": "2025-10-11T23:28:02.210Z"
  },
  "metadata": {
    "title": "8.15 mln tonnes waste disposed of under Suthra Punjab Program",
    "author": null,
    "date_published": "2025-09-24T13:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 212,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Sep 24 (APP):Punjab Minister for Local Government Zeeshan Rafique has said that despite being a new experiment, the results of Suthra (Clean) Punjab program are What seemed impossible became possible due to the vision and leadership Presiding over a video link meeting of CEOs of waste management companies at the Civil Secretariat here on Wednesday, he expressed satisfaction over the fact that 8.15 million tonnes of waste had so far been disposed of in Punjab. Secretary Local Government Shakeel Ahmed Mian, Special Secretary Arshad Baig, Additional Secretary Ahmer Kaifi and CEO of Lahore Waste Management Company Babar Sahib Din were also present in the meeting. On the occasion, a detailed review of the ongoing operations under the Clean Punjab program was taken. The provincial minister inquired about the goals Local Government Minister Zeeshan Rafique said that 66,213 waste containers had been installed across the province while 364 temporary collection points had been set up under the flagship project. \"More than 139,000 workers are working under Suthra Punjab and 140 landfill sites have been prepared for safe dumping\", Zeeshan Rafique said that there were 3,186 waste enclosures and 3,284 equipment was being used for better delivery. He said that due to digital monitoring, it was not possible to compromise on transparency anywhere.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}