{
  "article_id": "2025-09-24_79118cf3694790814c8f701828481304",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-standing-committee-reviews-criminal-procedure-amendments-defers-multiple-bills-amid-calls-for-wider-consultation/",
    "retrieved_at": "2025-10-11T23:26:40.747Z"
  },
  "metadata": {
    "title": "NA Standing committee reviews Criminal Procedure Amendments, defers multiple bills amid calls for wider consultation",
    "author": null,
    "date_published": "2025-09-24T21:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 454,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 24 (APP):The 17th meeting of the National Assembly Standing Committee on Interior and Narcotics Control was held on Wednesday, at Parliament House under the chairmanship of Raja Khurram Shahzad Nawaz, MNA. Federal Minister for Law and Justice Azam Nazeer Tarar briefed the Committee on the Code of Criminal Procedure (Amendment) Bill, 2025, emphasizing that although substantial work had been done on the Bill, further refinements were necessary to align the law of evidence with both historical precedents and contemporary needs. He proposed that under the revised framework, an SHO would first conduct an inquiry, which would then be reviewed by a district-level committee under the DPO to determine whether an FIR should be registered. Tarar requested a special session for deeper deliberation. The Committee stressed the importance of consulting key stakeholders, particularly Bar Councils, and agreed to circulate the draft Bill for feedback within 30 days. The Chair said this approach would enhance the credibility and effectiveness of the legislation. Consequently, the Bill was deferred to the Committee's next meeting. Several other bills-including the Islamabad Capital Territory Local Government (Amendment) Bill, 2025, the Corrosive Substances Assault (Prevention and Protection) Bill, 2024, and the Islamabad Capital Territory Dowry Restraint Bill, 2025-were also deferred, citing the absence of key movers or the need for further departmental input. However, the Domestic Violence (Prevention and Protection) Bill, 2025, was considered and recommended for passage by the National Assembly with amendments. The Director General of the Anti-Narcotics Force (ANF) briefed members on the ANF's operations, challenges, and international cooperation efforts. The Committee expressed concern over the misuse of courier services for drug trafficking and recommended stricter regulations for logistics companies, including mandatory identification and tracking systems. Members also voiced serious concern over alleged misconduct by the Banigala Police SHO, who reportedly detained the President and members of the Pakistan Nursing and Midwifery Council without lawful grounds. The Minister of State for Interior and Narcotics Control assured that a report would be submitted. The Committee directed Islamabad Police to investigate transformer thefts and ordered detailed reports on land-grabbing cases involving the Intelligence Bureau Employees Cooperative Housing Society (IBECHS) and the National Assembly Secretariat Employees Cooperative Housing Society (NASECHS). It condemned the prevention of NASECHS officials from entering Jinnah Garden Housing Society despite court orders and instructed that no female members face violence from society officials. The meeting was attended by MNAs Anjum Aqeel Khan, Chaudhry Naseer Ahmed Abbas, Nosheen Iftikhar, Syed Rafiullah, Haji Jamal Shah Kakar, Sardar Nabeel Ahmed Gabol, Abdul Qadir Patel, Khawaja Izhar Ul Hassan, and Sharmila Sahiba Faruqui Hashaam, along with senior officers from the Ministry of Interior and Narcotics Control, Ministry of Law and Justice, FIA, ANF, Islamabad Police, and the Capital Development Authority.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}