{
  "article_id": "2025-09-24_18bd457cdc853f3259845f8b0c22dbc8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/british-hc-visits-okara-to-see-uk-pakistan-partnership-driving-climate-smart-farming/",
    "retrieved_at": "2025-10-11T23:27:57.498Z"
  },
  "metadata": {
    "title": "British HC visits Okara to see UK-Pakistan partnership driving climate-smart farming",
    "author": null,
    "date_published": "2025-09-24T14:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 422,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 24 (APP):British High Commissioner to Pakistan Jane Marriott, on Wednesday visited Okara to inaugurate an Eddy Covariance Flux Tower system, installed through funding from the UK's Foreign, Commonwealth and Development Office (FCDO). The visit was part of the UK Government's support to the Water Resource Accountability in Pakistan (WRAP) programme, implemented by the International Water Management Institute (IWMI). The High Commissioner witnessed, how UK's support is helping Pakistan build a more climate-resilient future through smarter water and land management practices. The newly inaugurated flux tower captures real-time data on water, carbon, methane, and energy exchanges between agricultural land and the atmosphere. This field-based information is already helping the Punjab Irrigation Department improve water allocation and supporting the Ministry of Climate Change and Environmental Coordination in strengthening Pakistan's greenhouse gas reporting for agriculture system, an essential step toward achieving the country's climate commitments. She was also briefed on Soil Moisture Sensors being introduced to farmers in Okara. These simple and low-cost devices guide farmers on when to irrigate their fields, reducing water and electricity use while boosting yields. Farmers in Okara have already reported savings on input costs and improved productivity, showing how simple technology can make a big difference in rural livelihoods. The visit comes at a time when flooding across Pakistan is once again causing damage and hardship for communities. The situation highlights the urgent need for evidence-based research and real-time data that can feed into policies and acts, enabling the country to move from reactive responses to proactive climate planning. Speaking about this urgency, Dr. Mohsin Hafeez, Director, Water, Food and Ecosystem, IWMI and the Project Leader for WRAP, said, \"Pakistan has faced devastating floods in recent years, a reminder that climate change is no longer a distant threat but a present reality. Too often, we respond only after disaster strike. Through the WRAP programme, we are building the tools and systems that shift us from reactive crisis management to proactive, evidence-based planning. From flux towers that strengthen climate reporting to soil sensors that save farmers water and money, these innovations show how science can protect lives and livelihoods in a changing climate.\" Jane Marriott, British High Commissioner to Pakistan, added, \"Pakistan's recent floods are a stark reminder that climate change is a present-day challenge. Too often, action comes only after disaster strikes. Through the WRAP programme, we're helping shift to proactive, evidence-based planning. From flux towers improving climate data to soil sensors saving water and costs for farmers-these innovations show how science can safeguard lives and livelihoods.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}