{
  "article_id": "2025-09-24_a1712e4ee99e6f79fedc3a1a4d160323",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-govt-approves-major-tax-exemptions-for-gb-leghari/",
    "retrieved_at": "2025-10-11T23:27:09.681Z"
  },
  "metadata": {
    "title": "Federal govt approves major tax exemptions for GB: Leghari",
    "author": null,
    "date_published": "2025-09-24T17:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 467,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 24 (APP): In a significant move aimed at economic relief for Gilgit-Baltistan, Federal Minister for Power Awais Ahmed Khan Leghari on Wednesday announced various tax exemptions on goods imported for local consumption, including relief from federal levies such as sales tax, income tax, and excise duty. Speaking to the media, flanked by Chief Minister of Gilgit-Baltistan, Haji Gulbar Khan and representatives of Gilgit-Baltistan's traders' bodies, the minister expressed gratitude to Prime Minister Muhammad Shehbaz Sharif for entrusting him with the chairmanship of the committee formed on August 17, 2025, to review GB's trade and community concerns. He said the committee, in just one and half month, finalized practical and consensus-based recommendations which have now been approved by the Prime Minister. Leghari praised the role of FBR Chairman and his team for their cooperation, adding that the entire political leadership of Gilgit-Baltistan contributed meaningfully towards the process. He underlined that the Prime Minister had given clear directives to prioritize the welfare of GB's people in all aspects of governance. The minister noted that the approved measures would help address hurdles in imports, exports, and transit trade, while creating a better environment for the business community. \"This is a significant addition to Pakistan's economic history, reflecting the vision of inclusive development,\" he remarked. Leghari acknowledged the contributions of senior officials, political leaders, and business representatives including members of the Supreme Council and GB Chamber of Commerce who were present at the press conference. He reiterated the government's resolve to continue working closely with the people of Gilgit-Baltistan for their prosperity and integration in national progress. Chief Minister of Gilgit-Baltistan, Haji Gulbar Khan, extended heartfelt felicitations to the Government of Pakistan, particularly Prime Minister Shahbaz Sharif and Minister for Power Awais Ahmed Khan Leghari, for announcing long-awaited tax exemptions for the region. He commended the federal leadership for fulfilling a longstanding demand of the region's people and business community. The CM underscored the importance of implementing the signed agreement in both letter and spirit to ensure its full benefits are realized across Gilgit-Baltistan. \"This is a significant step towards economic empowerment of Gilgit-Baltistan. We urge the federal authorities to ensure timely execution of the announced measures,\" said CM Gulbar Khan. Meanwhile, President of the Gilgit-Baltistan Chamber of Commerce, Ashfaq Ahmed, called on traders to resume cross-border trade activities at the Sost border starting Thursday. He expressed optimism that the tax relief would rejuvenate commercial momentum and strengthen regional trade ties. Senator Saleem Mandviwala, a member of the committee formed by the prime minister to address the concerns of Gilgit-Baltistan traders, stated that the government was deeply concerned over the suspension of trade between Pakistan and China. He noted that the committee worked tirelessly to devise a viable mechanism for the swift resumption of trade activities in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}