{
  "article_id": "2025-09-24_39a2abe38529b9e9a620be40dff37ea3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cpdi-pic-hold-dialogue-on-access-to-information/",
    "retrieved_at": "2025-10-11T23:27:29.114Z"
  },
  "metadata": {
    "title": "CPDI, PIC hold dialogue on access to information",
    "author": null,
    "date_published": "2025-09-24T18:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 481,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 24 (APP):Centre for Peace and Development Initiatives (CPDI), in collaboration with the Pakistan Information Commission, organized a dialogue on \"Strengthening Access to Information and Media in Pakistan\" to mark the International Day on Universal Access to Information. This event, conducted under the project titled \"Strengthening Media Persons Capacity and Engagement for Human Rights and Fundamental Freedoms jointly implemented by CPDI and Individual Land (IL)\" brought together civil society representatives, media representatives, academia, government officials, and legal experts to discuss key media and information issues, said a press release issued here Wednesday. Key speakers included Executive Director CPDI, Mukhtar Ahmad Ali, Executive Director IRADA Aftab Alam, Bureau Chief Daily Jang, Hafiz Tahir Khalil, Chief Information Commissioner, Shoaib Ahmad Siddiqui, and Information Commissioner, Ijaz Hassan Awan. The dialogue also focused on \"Ensuring Access to Environmental Information in the Digital Age,\" aligning with the International Day on Universal Access to Information 2025 theme. During the dialogue, the speakers acknowledged that while restrictions exist, social media was not inherently a threat. Pakistan ranks among the top 10 countries globally in digital connectivity, underscoring the need for responsible use. However, growing misinformation has increasingly questioned media credibility. Privacy was affirmed as a fundamental right, with concerns that the PECA law acts like a secretive Official Secrets Act, limiting transparency, they said. The speakers highlighted that Azad Jammu Kashmir and Gilgit Baltistan were lacking Right to Information (RTI) laws and Pakistan's existing RTI laws were poorly implemented. Key Information Commissioner positions remain vacant in Punjab, Khyber Pakhtunkhwa, Sindh, Balochistan and at the federal level. Challenges faced by journalists, including delayed salaries, lack of women-friendly policies, and safety concerns were stressed. Women journalists often face dismissal for advocating their rights. The PECA law was critically discussed for exacerbating these issues. Overall, the dialogue called for strengthening Information Commissions, ensuring journalist safety, maximizing available information spaces and launching awareness campaigns on RTI and environmental information access. Access to information, especially environmental data, must be treated as fundamental rights to foster transparency and strengthen democracy in Pakistan, they said. The speakers emphasized the need to strengthen Information Commissions to make them more effective and responsive. They called for robust safety mechanisms to ensure journalists' protection amid ongoing threats. Furthermore, they advocated for media and government bodies to maximize existing information spaces and run public awareness campaigns on the Right to Information (RTI) and environmental information access in the digital era. Special focus was also placed on addressing media sector challenges, especially those related to women's representation and safety. The dialogue organized by CPDI reinforced the vision that access to information including environmental data, should be treated as a fundamental right and be readily available in the public domain to promote transparency, democracy, and human rights in Pakistan. This dialogue marks a pivotal step forward in advancing media freedom, strengthening access to information frameworks and empowering citizens across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}