{
  "article_id": "2025-09-24_55266a6f409437669147277e019a0ac8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-meets-imf-chief-calls-for-considering-economic-impact-of-floods-in-program-review/",
    "retrieved_at": "2025-10-11T23:28:00.223Z"
  },
  "metadata": {
    "title": "PM meets IMF chief; calls for considering economic impact of floods in program review",
    "author": null,
    "date_published": "2025-09-24T09:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 239,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "NEW YORK, Sep 24 (APP): Prime Minister Shehbaz Sharif on Wednesday said that Pakistan was making steady progress towards meeting the various targets and commitments under the IMF program, however, the impact of the recent floods on Pakistan's economy must be factored into the IMF's review. The prime minister, in a meeting with Managing Director of the International Monetary Fund (IMF) Kristalina Georgieva, on the sidelines of the 80th Session of the United Nations General Assembly here, appreciated the IMF's longstanding constructive partnership with Pakistan, which had further strengthened under incumbent chief's leadership. He acknowledged the IMF's timely support under various instruments, including the Stand By Arrangement for USD 3 billion in FY 2024 followed by the Extended Fund Facility (EFF) of USD 7 billion and Resilience and Sustainability Facility (RSF) of USD 1.4 billion. \"Today, with the institution of deep-rooted structural reforms, Pakistan's economy was showing positive signs of stabilization and was now moving towards recovery,\" Prime Minister Shehbaz said and appreciated the IMF's support in this regard that had been instrumental in guiding the government's economic reform efforts. The IMF Managing Director expressed her sympathy to all people affected by the floods and noted the importance of the damage assessment to underpin recovery priorities. The IMF chief commended the prime minister's commitment to pursuing sound macro-economic policies and reiterated the IMF's continued support as Pakistan advances the necessary economic reforms to ensure sustainable long term economic growth.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}