{
  "title": "ECP may seek guidance from judiciary for announcement of single date polls: President",
  "link": "https://www.app.com.pk/national/ecp-may-seek-guidance-from-judiciary-for-announcement-of-single-date-polls-president/",
  "date_published": "2023-09-13T18:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 13 (APP): President Dr Arif Alvi on Wednesday said that the Election Commission of Pakistan in consultation with the provincial governments and political parties under the relevant provisions of the Constitution and in view of certain subjudice matters, might seek guidance from the superior judiciary for announcement of a single date for the general elections to the national and provincial assemblies.\nIn a letter addressed to Chief Election Commissioner Sikandar Sultan Raja and shared by President Secretariat Press Wing with media, the president raised eight legal and constitutional points for consideration.\nHe said that the National Assembly was dissolved by him on the advice of the Prime Minister on 9th August.\nHe cited that the Article 48(5) of the Constitution empowered and mandated the president “to appoint a date not later than ninety days from the date of the dissolution, for the holding of a general election to the Assembly”.\n“Whereas in terms of Article 48(5) the general election to the National Assembly should be held by the eighty-ninth day of the date of dissolution of the National Assembly, i.e. Monday 6″ Day of November 2023,” he added.\nThe president observed that in an endeavour to fulfil the constitutional obligations, the Chief Election Commissioner was invited for a meeting to devise the modalities of implementing the Constitutional intent and mandate who in reply took a contrary view that as per the scheme of the Constitution and framework of electoral laws, it was the domain of the Election Commission, and following publication of last preceding census on 07.08.2023, duly notified delimitation of constituencies was in progress, a mandatory requirement stipulated by Article 51(5) of the Constitution and section 17 of the Elections Act, 2017.\nHe said that the Ministry of Law and Justice was also of the similar view as that of the ECP.\nPresident Alvi said that all the four provincial governments were of the view that announcement of election date was mandate of the Election Commission of Pakistan. “Further, there is a consensus that to strengthen the federation and to promote unity and harmony amongst provinces and to avoid incurring of unnecessary expenses, general elections to the National Assembly and the Provincial Assemblies must be held on same day,” he added.\nIn the foregoing points, the president opined that it was the responsibility of the Election Commission of Pakistan to abide by all the constitutional and legal steps stipulated under Articles 51, 218, 219, 220 and the Elections Act, 2017 for organizing and conducting free and fair elections.",
  "retrievedAt": "2025-08-11T09:37:14.370Z"
}
