{
  "title": "‘Seerat Museum’ to be established to instill ethical education in youth: Aneeq",
  "link": "https://www.app.com.pk/national/seerat-museum-to-be-established-to-instill-ethical-education-in-youth-aneeq/",
  "date_published": "2023-09-13T16:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP): Minister for Religious Affairs and Interfaith Harmony, Aneeq Ahmed, on Wednesday said a ‘Seerat Museum’ would be established to instill ethical education in youth.\nHe, in a meeting with Muslim World League Regional Director Saad bin Masood Al-Harsi, agreed to collaborate on the establishment of the ‘Seerat Museum’ to provide valuable insight into the virtuous life of Prophet Muhammad (Peace Be Upon Him) for the younger generation.\nHighlighting the strong religious ties between Pakistan and Saudi Arabia, Minister Aneeq mentioned plans for an upcoming visit to Saudi Arabia to finalize arrangements for Hajj pilgrims. Additionally, efforts would be made to establish a ‘Quran Museum’ to promote Quranic education within Pakistan, he added.\nHe emphasized the pivotal role of mosques in society stating that ethical topics for Friday sermons were being organized to promote social reforms. He said to facilitate this effort, a consultative meeting would be held soon with all provincial religious affairs and Auqaf ministers.\nMasood Al-Harsi revealed that Muslim World League Secretary-General, Dr. Abdulkarim Al-Issa, was set to visit Pakistan in November. He expressed the organization’s dedication to serving the Pakistani nation, especially the less fortunate individuals.\nIn a separate meeting, Minister Aneeq also discussed religious harmony and exchanged detailed perspectives on interfaith dialogue with representatives from the Pak-American civil society and non-governmental organizations regarding the incident in Jaranwala. He assured that those responsible for the Jaranwala incident would be duly punished.\n“The presence of external influences in incidents of religious discord has been established, and measures are underway to prevent such occurrences in the future,” he said urging scholars, both Muslim and non-Muslim, to write articles promoting interfaith harmony.\nRegarding the initiatives of the ministry, he said educational scholarships were being issued for minority students from primary to master level.\nFor the minority community’s financial assistance, education scholarships, marriage grants, and development schemes; Rs110 million had been allocated. However, the number and amount of scholarships for non-Muslim students were being further increased, he added.\nFurthermore, Minister Aneeq said interfaith conferences were being organized to promote religious harmony in major cities across the country.\nThe delegation expressed their intention to support Pakistan and learn from each other’s experiences during their visit. The delegation included Professor Joseph Knight from the United States, Elias Masih, Aisha Khan, Raj Rathore, Advocate Sarwan Kumar Bheel from Pakistan, Anwar Qureshi, and Aliyah Khan from Germany.",
  "retrievedAt": "2025-08-11T09:37:17.963Z"
}
