{
  "title": "Rain-wind/thunderstorm likely from September 15-20 with occasional gaps",
  "link": "https://www.app.com.pk/national/rain-wind-thunderstorm-likely-from-september-15-20-with-occasional-gaps/",
  "date_published": "2023-09-13T10:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):The Pakistan Meteorological Department (PMD) has forecast a rain spell from September 15-20 which would subside the prevailing hot and humid weather conditions across the country, giving maximum relief to the heat-stricken.\nThe moderate monsoon currents from the Bay of Bengal were likely to penetrate the upper parts of the country from September 15 (evening or night) while a westerly wave was also likely to enter these areas on September 16.\nUnder the influence of these systems, rain/wind-thunderstorm with a few moderate to isolated heavy falls are expected in Kashmir, including Neelum Valley, Muzaffarabad, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur, and Gilgit Baltistan including Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche and Shigar from September 15-20.\nRain/wind-thunderstorm with a few moderate to isolated heavy falls are also expected in Murree, Galliyat, Islamabad, Rawalpindi, Attock, Chakwal, Jhelum, Mandi Bahauddin, Hafizabad, Gujranwala, Gujrat, Sialkot, Narowal, Lahore, Kasur, Sheikhupura, Chitral, Dir, Swat, Shangla, Buner, Mansehra, Kohistan, Abbottabad, Haripur, Kohat, Peshawar, Mardan, Swabi, and Nowshera during the period occasional gaps.\nRain/wind-thunderstorm is also expected in Kurram, Lakki Marwat, Dera Ismail Khan, Bannu, Karak, Waziristan, Mianwali, Sargodha, Khushab, Faisalabad, Toba Tek Singh, Jhang and Bhakkar, Dera Ghazi Khan, Rajanpur, Musa Khel, Barkhan, Zhob, Kalat, Khuzdar, Mirpurkhas, Khairpur, Tharparkar, Umer Kot and Sanghar from September 16 (evening/night) to September 18 with occasional gaps.\nAbout the impacts, the PMD warned that moderate to heavy falls may increase the water flows in local Nullahs/streams of Kashmir, Gilgit-Baltistan, Chitral, Dir, Swat, Kohistan, Shangla, Buner, Mansehra, Abbottabad, Galliyat, Murree, and  Rawalpindi/Islamabad from September17-19.\nModerate to heavy rains may trigger landslides in the vulnerable areas of Murree, Galliyat, Kashmir, Gilgit-Baltistan, Chitral, Dir, Swat, Kohistan, Shangla, Buner, Mansehra, and Abbottabad during the wet spell from September.\nThe prevailing very hot and humid conditions are likely to be subsided during the spell.\nThe farmers are advised to manage their crop activities accordingly, while the tourists and travelers are advised to remain cautious to avoid any untoward situations during the period.\nWind thunderstorms may damage loose structures like electric poles, solar panels, etc. The general public has been advised to stay in safe places during windstorms/lightning/heavy rains.\nAll concerned authorities are advised to remain alert and take necessary precautionary measures during the forecast period.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:37:11.384Z"
}
