{
  "title": "Quality research witnesses substantial increase as current year publications reach 29000",
  "link": "https://www.app.com.pk/national/quality-research-witnesses-substantial-increase-as-current-year-publications-reach-29000-2/",
  "date_published": "2023-09-13T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 13 (APP):Chairman Higher Education Commission (HEC) Dr. Mukhtar Ahmed has said that the number of universities as well as the quality of research has witnessed a substantial increase in the last two decades.\nTalking to APP, he highlighted a substantial transformation in the realm of research with the current year boasting 28,967 publications in Impact Factor Journals.\nHe said that owing to these factors and many other initiatives a number of Pakistani universities are now featured in World and Asian rankings.\nThe chairman of HEC also shed light on the remarkable evolution of universities in the country over the past two decades.\nDr. Mukhtar Ahmed said that HEC’s efforts are underway for improvement in gender parity in higher education institutions, growth in PhD faculty and establishment of Centres of Excellence in emerging disciplines such as Nanoscience and Nanotechnology, Quantum Computing, etc.\nThe Chairman underscored the revamping of research promotion and commercialisation initiatives and briefed the minister about the establishment of the Office of Research, Innovation and Commercialisation (ORIC) and Business Incubation Centre (BIC) in universities across the country as well as the launch of Research for Innovation (RFI) portal for better coordination among all the stakeholders.\nHe also underlined HEC’s quality assurance programmes, accreditation activities as well and national and international scholarship initiatives.\nDr Mukhtar Ahmed also shed light on various other HEC policies, groundbreaking special projects, and a forward-looking roadmap that charts the commission’s course into the future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:37:11.616Z"
}
