{
  "title": "Rawal Raj remarkable document, message for every Pakistani: NA Speaker",
  "link": "https://www.app.com.pk/national/rawal-raj-remarkable-document-message-for-every-pakistani-na-speaker/",
  "date_published": "2023-09-12T19:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP): National Assembly Speaker, Raja Pervaiz Ashraf on Tuesday paid tribute to senior journalist and author of the book Rawal Raj, a detailed account of the history of the ancient city, for writing a remarkable account of its history and termed it a message of harmony and love for every pothohari and Pakistani.\nAddressing the book launching ceremony of ‘Rawal Raj’ the speaker lauded the author for his indelible contribution to unearthing the obscure historical details of Rawalpindi.\nHe said the region of Pothohar had a unique character wherever in the world it was searched, its reference was available.\n“Book writing is an uphill task that demands great effort and Sajjad Azhar compiled a document in a remarkable way,” he added.\nMost of the people, he said had considered Rawalpindi as a garrison city only but Sajjad Azhar corrected the record of Islamabad and historical background of this ancient land, he added.\nPothohari language had a unique style and had the traits of humbleness, equality, mutual respect and love, the Speaker said.\n“This area had a great acceptance for other faiths and people. I would like to thank Sajjad Azhar for acquainting us as a pothohari with our history and language,” he said.\nSenior journalist, Aizaz Syed said Sajjad Azhar was not only a journalist and author but rather a fine poet. “Landi Kotal ki laltaan is a great piece of poetry. His writings have resistance which is fading away from present-day wirtings and pieces of literature. His poetry and this book is beyond time and space. The book is based on the history of Rawalpindi and Islamabad,” he added.\nHe noted that there was a great issue that books were not written in our society and the writers did not get their remuneration. However, the publishers should be taken into account and the National Press Club should also establish collaboration with publishing houses to ensure the right of the author.\nHe also commended the military history of Pindi written by Sajjad Azhar.\nSajjad Azhar, Author of Rawal Raj said he had spent seven years to write these articles that were finally compiled into a book. He had visited the British Archives in the UK and read 200 books to write this book and also visited Microsoft Archives which possessed 50 million books that had references of Rawalpindi.\n“It took another one and a half years to establish references for this book. I had put a milestone to continue the journey of research and study on the novel idea of exploring Rawalpindi’s thousands of years old heritage,” he added.\nThe author underscored that no such book was written earlier that had provided true and genuine accounts of various historical instances of Rawalpindi, he added.\nChairman Rehmat ul Alameen Authority, Khurshid Nadeem said Sajjad Azhar had aptly recorded the history of the region in his book.\nHis writings helped learn the unknown history of the Pothohar region, he added.\nPPP leader Farhatullah Babar was also present on the occasion.\nFormer Senator Pervaiz Rashid of PML-N said the colonial era deprived us of our history and language and without it, an individual becomes a pigmy or dwarf in a society.\n“The history we are taught and imparted to our children has no link to the real history as its all fabricated. I wanted to testify that I had witnessed the historical Pindi which is projected by Sajjad Azhar in this book and whatever is written in his book is truth. This book entails the interfaith harmony of old Pindi before partition,” he added.\nFormer Senator Zafar Ali Shah of PTI said the author was a prolific writer who had a vast knowledge of history.\n“He (Sajjad Azhar) created a historic document of Pindi’s history. He accurately mentioned Hindus, Sikhs and people of other faiths. However, many unknown facts have been revealed in this book,” he said.\nFormer Chairman Pakistan Academy of Letters, and famous Poet of Urdu, Iftikhar Arif said this region was a great land of prehistoric times that hosted world’s ancient civilization of Soan.\nSoan River history was revealed by Sajjad Azhar in his article, whereas the Soan, Korang and Lai nullahs were one river in ancient times, he added.\nHe has discussed the historical periods Veida, Bhuddism etc., and this book was a compiled document of history, Arif said.\n“Sajjad column’s are part of history that will survive,” he added.\nPresident PFUJ Dastoor Haji Nawaz Raza said Sajjad Azhar had great abilities and it’s difficult to judge either he was a journalist or an author.\n“His book is an account of the history, culture and customs of Rawalpindi. I call him an investigative journalist. He very aptly narrated the history of Rawalpindi,” he added.\nPFUJ, President Afzal Butt commended the effort of the author for compiling a great piece of history. He termed the book as a reference for the future researchers and investigators of history.",
  "retrievedAt": "2025-08-11T09:37:13.875Z"
}
