{
  "title": "World communities must help Pakistan suffering from climate change issues: Shazia Marri",
  "link": "https://www.app.com.pk/national/world-communities-must-help-pakistan-suffering-from-climate-change-issuesshazia-marri/",
  "date_published": "2022-10-29T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): Pakistan and the Italian Agency for Development Corporation (AICS) have agreed upon to work together on climate change and other issues of the social sector as well as to mitigate the needs of flood affected people in Pakistan through extending help in rebuilding.\nThis was decided on Saturday in a meeting between Ms. Shazia Marri, Federal Minister for Poverty Alleviation and Social Safety/Chairperson Benazir Income Support Programme (BISP) and Ms. Emanuela Benini, the Director of AICS office Islamabad, here, at BISP headquarters.\nMr. Faisal Karim Kundi, Special Assistant to the Prime Minister (SAMP), Mr. Yusuf Khan, Secretary BISP, Mr. Hammad Khan DG (OM) BISP and other officials of BISP attended the meeting.\nMs. Shazia Marri informed AICS Director about the initiatives of Benazir Income Support Program and stated that BISP aims to provide a comprehensive system of social security to the disadvantaged and marginalized segments of society, particularly women.\nShe discussed the suffering of the flood-affected people and repercussions of climate change and the great loss of human lives and properties that people have gone through in recent catastrophes.\n“The recent floods in Pakistan have affected 33 million people, many lost their homes, jobs, and businesses, a large number of cattle and crops are devastated, tens of thousands people are still homeless,” she said.\nMs. Marri informed the delegate that according to an initial survey around 33 million people have been affected by recent floods and the BISP has credit to disburse over Rs. 66 billion among 2.6 million calamity-hit families of the declared areas of the country.\n“BISP disbursed Rs 7,000 quarterly to its regular beneficiaries, in addition to other programmes,” she added and further informed the Director AICS about the other projects of BISP and her Ministry including Benazir Nishonuma, Benazir Taleemi Wazaif Program, undergraduate scholarship Programme and sehat Programmes.\nThe federal minister urged the world communities to come forward and help people of Pakistan who were suffering climate change damages/issues.\nThe Director AICS Emanuela Benini assured the federal minister for more deliberations to find ways and work together for the social protection of people.\nIn the meeting, both sides pledged to work together in health, education, climate change and other fields of the social sector, enabling poor people to stand on their feet with an aim to eradicate poverty for a better future to the coming generations.",
  "retrievedAt": "2025-08-11T15:48:44.548Z"
}
