{
  "title": "EU organizes ‘Unity Diversity’ festival to showcase European culture, heritage",
  "link": "https://www.app.com.pk/national/eu-organizes-unity-diversity-festival-to-showcase-european-culture-heritage/",
  "date_published": "2022-10-29T10:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP):European Union and its member states here on Saturday organized a festival “Unity Diversity” for the residents of Islamabad and Rawalpindi to experience European culture and heritage, music and food.\nLarge numbers of people, especially families flocked to “EuroVillage” at the Pakistan National Council of Arts (PNCA) to enjoy the festival, said a news release.\nThrough games and quizzes, interactive information displays, and various activities, visitors learned what the EU’s motto “Unity in Diversity” means in practice and how it applies also to Pakistan.\nEuroVillage, which already attracted over 8,000 visitors in the past editions, took place for the first time after a gap of three years due to the Covide-19 pandemic.\nThe Ambassador of the European Union to Pakistan, Dr Riina Kionka in her welcome remarks said, “We cherish the diverse cultures, languages, religions, histories and identities that coexist in Europe. They are part of our wealth, they shape our shared values, connect us and give us a joint sense of purpose. It is this common understanding of shared values and diversity that lies at the heart of our relations with the world – including with Pakistan.”\nShe further added, “This edition of the EuroVillage is special because this year the European Union and Pakistan celebrate 60 years of diplomatic relations. This partnership in development, trade and political engagement, manifests that we are stronger together. Our partnership has evolved over the decades, as have Pakistan, the European Union and the world.”\nAs a symbol of this partnership, an EU-Pakistan friendship truck was displayed for the first time at the event. The truck will be travelling all around the country to reach Pakistani youth in various universities across the country and offer a window into the strong connection between the EU and Pakistan.\nEuroVillage was organized by the diplomatic missions of the European Union and Austria, Belgium, Bulgaria, the Czech Republic, Denmark, France, Germany, Hungary, the Netherlands, Poland, Romania and Sweden. It included information and activity booths for both adults and children with interactive games, selfie corners, food and an opportunity to meet the diplomatic team and learn about areas of partnership. The event also featured live performances by European performers and Pakistani artists including Asim Azhar and Shae Gill.\nThe EU and Pakistan are bound together by a shared history. The partnership has progressed since 1962 in tandem with the European integration process. In 2019, the EU and Pakistan adopted a Strategic Engagement Plan with the common goal of building a strong partnership for peace and development rooted in shared values, principles and commitments. This plan facilitates cooperation on a wide range of issues, including dialogues on counter-terrorism, education, democracy and human rights, migration, climate change, energy, trade and economics, and culture.\nPakistan is a major development partner of the EU, with one of the largest EU programmes in Asia. Together as “Team Europe”, the European Union and its member states have assisted Pakistan during the Covid-19 pandemic. In response to the catastrophic floods in Pakistan, Team Europe, including Norway, committed a total of €123 million, in addition to in-kind assistance, for the immediate relief and early recovery of the flood-affected population.\nThe EU is also a major provider of development cooperation assistance to Pakistan with a focus on green inclusive growth, human capital and governance, including the rule of law and human rights. The EU provides Pakistan about Rs. 20.2 billion annually in grants. This includes efforts to achieve green inclusive growth, increase education and employment skills, promote good governance, human rights, rule of law and ensure sustainable management of natural resources.\nThe European Single Market with over 400 million potential customers continues to be the most important export destination for Pakistani goods thanks to the trade preferences granted through the EU’s Generalised Scheme of Preferences Plus (GSP +). Trade between the EU and Pakistan is thus essential for the economic development of Pakistan.",
  "retrievedAt": "2025-08-11T15:48:46.376Z"
}
