{
  "title": "Marriyum pays tributes to teachers for educating dyslexic children",
  "link": "https://www.app.com.pk/national/marriyum-pays-tributes-to-teachers-for-educating-dyslexic-children/",
  "date_published": "2022-10-29T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Saturday acknowledged the crucial role played by teachers, parents and civil society in ensuring every dyslexic child becomes literate.\nIn a statement, she said that a special month was being celebrated to highlight the difficulty in reading and writing among dyslexia children. She said that dyslexia was not a disability, the difficulty in reading, writing and recognizing letters can be overcome with a little training.\nShe said the creative works of children with reading and writing difficulties were masterpieces of their unique talents.\nFor the first time in the history of Pakistan, a revolutionary legislation “Dyslexia Special Measures Act 2022” has been passed by the Parliament and enacted to remove the difficulty in education of such children, she said.\nThe minister said that under the program, teachers would be given world-class training to improve the academic skills of children by removing the difficulty of reading and writing. Under the law, beating, mental torture or harassment of such children had been banned in all educational institutions, she said adding that teachers and staff with expertise in dyslexia would be deployed in all schools under this law.\nDyslexia therapists would be appointed in every school and trained teachers and educational staff would also be appointed.\nRelevant rules would be made within 120 days of the approval of the law to implement the special measures. Special written materials based on information and training on dyslexia would also be provided to educational institutions.\nPeople suffering from dyslexia include the world’s most famous personalities, Parliamentary Secretary Zeb Jafar herself has also faced the problem of dyslexia.",
  "retrievedAt": "2025-08-11T15:48:49.908Z"
}
