{
  "title": "Negotiations with PTI conclude after party rejects PM’s offer: Siddiqui",
  "author": null,
  "content": "ISLAMABAD, Jan 31 (APP): Parliamentary Leader of the Pakistan Muslim League-Nawaz (PML-N) in the Senate, Senator Irfan ul Haq Siddiqui, confirmed on Friday that the government has ended the negotiation process with Pakistan Tehreek-e-Insaf (PTI) after the party withdrew and rejected the prime minister’s offer for another round of talks.\nSiddiqui, also the spokesman for the government’s negotiation committee involved in talks with the PTI, said that PTI leaders hurried into negotiations and exited just as quickly as they had arrived. Their primary and genuine demand was the immediate release of Imran Khan and other leaders.\nIn an exclusive interview with Urdu News, a leading Saudi Arabian newspaper, Senator Irfan Siddiqui further emphasized that negotiations have ended, with no deadlock or breakdown. Despite the prime minister’s offer, PTI’s responses, as of January 31, are available, and their set deadline has passed. With the dissolution of their committee, the negotiations have now concluded.\nHe mentioned that many of PTI’s demands in the Charter of Demand were aimed at building trust, and we had considered\nseveral of them. We didn’t reject the demand for a Judicial Commission outright. Our lawyers advised that a Judicial Commission couldn’t be formed for cases already in court. However, instead of responding directly, we suggested that they consult their lawyers, share their views, and, if convinced, we could find a common ground together.\nIrfan Siddiqui stated they had worked on several confidence-building measures, but when asked for specifics, he mentioned that the details remain confidential. He added that if the information were made public, it would have been shared by Pakistan Tehreek-e-Insaf (PTI).\nHe explained that the government created a document as a working paper, not a final draft, for confidence-building measures with PTI. This document was open to revision and negotiation, but PTI pulled out of the talks. Siddiqui stressed that the document was not final and could have been adjusted through further discussion.\nHe stated that PTI’s core nature fundamentally rejects negotiations, dialogue, and deal-making, focusing instead on protests, violence, and intimidation, as seen on May 9, November 26 and other occasions. Whenever they engaged in talks, they withdrew with the same aggressive approach. The negotiations were progressing until January 28, but six days earlier, PTI announced that Imran Khan had decided to end the talks.\nSenator Irfan Siddiqui disclosed that in the committee, PTI requested the release of PTI founder, Shah Mahmood Qureshi, Omar Cheema, Ejaz Chaudhry, Yasmeen Rashid, and Mahmood Rashid. While the names were not written, they were verbally mentioned, asking for assistance in their release. They also demanded the release of other prisoners, which was their only request.\nHe emphasized that there is no other way for these individuals to be released. Siddiqui described PTI as a unique phenomenon in Pakistan’s history, highlighting the slogan “Khan or no Pakistan,” which he deemed unfortunate.\nOn the PECA Act, Siddiqui pointed out that party decisions are binding, and members must either comply or leave. However, he shared his opinion during a meeting convened by the law minister and made sure that journalists had the opportunity to speak in the Standing Committee for Interior, based on his suggestion and recommendation.\nSenator Irfan Siddiqui believed that broader consultations should have been held regarding the Prevention of Electronic Crimes Act (PECA).\nHe personally supports the law’s intent, stressing the importance of distinguishing between genuine journalism and fake news.\nSiddiqui reassures that legitimate journalists will not be affected by this law, which is aimed at those misusing modern technology for harmful purposes.\nHe has discussed the issue with the prime minister and suggested that journalists’ concerns be addressed through amendments to the law. He confirmed that efforts are ongoing to resolve these concerns and has pledged to personally contribute to this process beyond his official duties.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:14:57.617Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/negotiations-with-pti-conclude-after-party-rejects-pms-offer-siddiqui/",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T18:29:00.000Z"
}
