{
  "title": "1.4 mln registered & 0.7 mln afghan refugees still in Pak, senate body told",
  "author": null,
  "content": "ISLAMABAD, Jan 31 (APP):The Chief Commissioner for Afghan Refugees apprised the Standing Committee on States and Frontier Regions (SAFRON) of the Senate that approximately 2.9 million Afghan nationals were currently residing in Pakistan, of which 1.4 million were registered while 0.7 million were unregistered.\nThe Chief Commissioner presented the empirical data on Afghan refugees during the SAFRON Committee meeting on Friday, chaired by Senator Jan Muhammad Buledi at the Parliament House.\nThe commissioner gave a comprehensive briefing on the current humanitarian assistance being provided to Afghan refugees in Pakistan, covering areas such as shelter, food, water, sanitation, education, and healthcare.\nThe Committee members were further briefed on the Refugee Affected and Hosting Areas Programme (RAHA).\nThey were informed that development projects under RAHA were halted in 2024 due to a lack of funding.\nSenators Saadia Abbasi and Syed Masroor Ahsan stressed over mobilizing international support in funding the projects for Afghan refugees and proper utilization of funds.\nThe Committee directed for a detailed report on the RAAST project. Additionally, it was briefed that 40 million dollars has been disbursed to the Government of Pakistan for technically supporting NADRA, FIA, Passports, capacity building, and awareness programs for Afghan refugees. Furthermore, 10 million dollars has been allocated to SAFRON for technical assistance.\nIt was also noted that Afghan refugee students are provided with 14 reserved seats in colleges and universities, along with free healthcare services in hospitals.\nThe Committee was briefed on the trends in voluntary repatriation, noting that the period from 2002 to 2024 has seen the highest levels of repatriation until now.\nAdditionally, the Committee was apprised that three organizations—UNHCR, GIZ, and JICA—are collaborating with the Chief Commissioner for Afghan Refugees (CCAR) in the fields of technical and social assistances for Afghan refugees.\nRepresentatives from SAFRON shared the challenges they face, underscoring the decreasing trajectory supporting funds from international organizations, which they view as a significant barrier.\nThey also apprised that the current state policy is focused on smooth repatriation of refugees. The Chairman and other Committee members acknowledged that this process is time-consuming and needs to be implemented with a coordinated approach amongst all stakeholders.\nThe Committee directed that the next meeting would be held in Quetta in order to physically assess the impacts and progress on projects for the welfare of Afghan refugees.\nThe meeting was attended by Senators Saadia Abbasi, Khalida Ateeb, Masroor Ahsan, the Joint Secretary of the Ministry of States and Frontier Regions, the Chief Commissioner for Afghan Refugees, and senior representatives from the relevant departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:15:19.850Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/1-4-mln-registered-0-7-mln-afghan-refugees-still-in-pak-senate-body-told/",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T15:25:00.000Z"
}
