{
  "title": "Extremism, divisive rhetoric threat to social peace; religious scholars, community leaders play role in promoting brotherhood",
  "author": null,
  "content": "ISLAMABAD, Jan 31 (APP): Prime Minister Muhammad Shehbaz Sharif in his message on World Interfaith Harmony Week being observed from February 1st to 7th urged the religious scholars, community leaders and citizens to play role in promoting brotherhood as extremism and divisive rhetoric were threat to social peace and harmony.\nThe prime minister shared these views while joining the international community in observing World Interfaith Harmony Week, a Prime Minister’s Office news release said.\nPrime Minister Shehbaz Sharif said this week served as a powerful reminder of the importance of dialogue, understanding, and cooperation among diverse religious communities.\n“Pakistan, envisioned by our founding father Quaid-e-Azam Muhammad Ali Jinnah as a sanctuary for all faiths, remains steadfast in its constitutional oath to protect every citizen’s right to belief, dignity, and equality. Our faith—rooted in Islam’s timeless teachings of justice, mercy, and respect for all creation—compels us to lead by example,” the prime minister said.\nHe resolved that the government would continue to uphold these values through policies that promote inclusivity and social cohesion.\n“To those who sow hatred, we respond with dialogue. To those who preach fear, we answer with courage. To those who divide, we build bridges,” Prime Minister Shehbaz Sharif said.\nHe added that the government was committed to fostering an environment of acceptance, tolerance, and mutual respect.\nThe groundbreaking Interfaith Harmony Policy and Strategy of Religious Tolerance were enforced, targeting hate speech at its core, safeguarding every temple, church, and shrine, the prime minister said.\nPM Shehbaz Sharif underscored that despite policy interventions implemented, the government recognized that challenges persist.\n“Extremism and divisive rhetoric,  remain threats to our social fabric. At a time when the world faces growing challenges of intolerance and division, it is essential to reaffirm our collective commitment to peace and unity,” he said.\n“May this week inspire us all to embrace the values of tolerance and cooperation, ensuring a peaceful and prosperous future for all,” the prime minister said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:15:19.462Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/extremism-divisive-rhetoric-threat-to-social-peace-religious-scholars-community-leaders-play-role-in-promoting-brotherhood/",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T18:59:00.000Z"
}
