{
  "title": "IFA conducts 24,137 operations, serves notices to 9346 food outlets",
  "link": "https://www.app.com.pk/national/ifa-conducts-24137-operations-serves-notices-to-9346-food-outlets/",
  "date_published": "2024-09-16T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): Director of the Islamabad Food Authority (IFA), Irfan Nawaz Memon, chaired a performance meeting of the authority, during which he was informed that 24,137 operations had been conducted so far, resulting in improvement notices being issued to 9,346 businesses.\nActing Deputy Director Operations (DDO) of Islamabad Food Authority (IFA), Aneeq Anwar, while sharing the performance report of the authority, stated that the authority has imposed fines amounting to Rs. 14.36 million on 804 establishments found violating health standards. The crackdown also led to the sealing of 172 outlets for selling harmful products.\nMeanwhile, licenses have been granted to 107 food points in Islamabad, reflecting the authority’s efforts to formalize the industry. In response to public complaints, 15 legal cases were registered, following action on 477 citizen reports.\nHe said that with an unwavering commitment to quality assurance, the authority’s latest report underscored its relentless pursuit of adherence to food safety standards across the Federal Capital.\nOn the occasion, he appealed to the masses to cooperate with the food department in identifying illegal food production units that were operating in small houses to ensure public safety.\nNotably, the authority imposed a complete ban on the sale of Chinese salt, and gutka, emphasizing its commitment to upholding stringent standards of food safety and hygiene.\nIrfan Nawaz Memon reiterated the authority’s dedication to fostering a healthy environment for the citizens of the federal capital.\nHe emphasized that strict action should be continued against those food outlets that were involved in selling adulterated or unhygienic food items.\nThe safety of citizens was the topmost priority of the IFA and no negligence would be tolerated in this regard, he warned.\nTo raise public awareness, several campaigns on healthy food are ongoing. Director Irfan Memon urged his team to expedite their efforts, especially focusing on the sale of harmful milk. He also emphasized the need to expand licensing efforts across the city.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:09:31.459Z"
}
