{
  "title": "Climate change not merely environmental issue but existential threat undermining human rights: Shamim Shwal",
  "link": "https://www.app.com.pk/national/climate-change-not-merely-environmental-issue-but-existential-threat-undermining-human-rights-shamim-shwal/",
  "date_published": "2024-09-16T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP):Representative of the Indian Muslim Women’s Union (IMWU), Shamim Shwal has called upon world leaders particularly the United Nations Secretary-General Antonio Gutters to prioritize climate action as a fundamental human rights issue.\nTaking part in an interactive dialogue along with Special Repporteurs on climate change in Geneva, Switzerland Ms Shwal while referring to the alarming effects of climate change in Indian Occupied territory of Jammu and Kashmir, said that despite the overwhelming evidence of climate change’s impact there was currently no dedicated mechanism at the Human Rights Council that addresses this crisis holistically, a news release said.\nCiting the Amnesty International report, she said that the humanity was under threat from climate change.\n“Kashmiris are witnessing the alarming effects of climate change firsthand”, the IMWU representative said, adding that daily temperatures were rising, with fluctuations ranging from 0.3 to 1.9 degrees Celsius.\nThe rising temperature, she said, has dire consequences for Kashmiri communities, particularly for those who rely on agriculture and horticulture for their livelihoods.\n“The maximum snowmelt has led to shrinking snow-covered areas, disrupting our agricultural practices and threatening our water resources”, Mrs Shwal added.\nStressing the urgent need to confront the climate crisis, particularly in the context of Indian occupied Kashmir, she said that the Special Rapporteur on climate change has emphasized that a safe climate was a vital element of the right to a healthy environment and  essential for human life and well-being.\nThe climate change, she said, was not merely an environmental issue but an existential threat that undermines the full enjoyment and realization of all human rights.\nShe said that the people of Kashmir were deeply concerned about the transformation of their green fields, forests, and agricultural lands into industrial zones.\n“This shift not only jeopardizes our environment but also creates an atmosphere of fear among the local population living in the foothills of the Himalayas”, she maintained.\nShe also sought the international audiences’ urgent attention towards the growing health related issues, including skin problems and other ailments, which were on the rise in Kashmir as a result of these changes.\nReferring to the reports about Kashmir’s water scarcity, she said that rising temperature and fast melting glaciers were issues of serious concern that merits immediate action.\nThe IMWU representative urged the council to take decisive steps to address these challenges.\nSeeking an end to the heavy military deployment in the Himalayas, she said, “The movement of the army and the deployment of heavy weapons not only contribute to the melting of glaciers but also exacerbate the already precarious situation faced by the local population”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:09:32.154Z"
}
