{
  "title": "Chinese institutes contribute to developing major standards for elder care in Pakistan",
  "link": "https://www.app.com.pk/national/chinese-institutes-contribute-to-developing-major-standards-for-elder-care-in-pakistan/",
  "date_published": "2024-09-16T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): Several Chinese universities, vocational colleges, and enterprises have played a key role in the development of major standards for elder care health and wellness in Pakistan, further strengthening Sino-Pak collaboration in the education and healthcare sectors.\nAccording to recognition certificates issued by the National Vocational & Technical Training Commission (NAVTTC) and the Pakistan Nursing & Midwifery Council (PNMC), faculty members from renowned Chinese institutions, including Jiangsu Vocational Institute of Commerce, Anhui Vocational College of City Management, Xuzhou Open University, Beijing Youth Politics College, Dezhou Vocational and Technical College, Changsha Social Work College, Guangxi Vocational & Technical College, Pingxiang Health Vocational College, ITMC Technology Co Ltd, and UNI Services International Pvt Ltd, contributed to the development of these essential standards.\nThe collaboration also extends to joint efforts in developing curriculum standards, digital resources, and practical training software for elder care, as well as the establishment of a comprehensive teaching resource database. These resources are now being implemented in Pakistani colleges and universities.\nThis cooperative initiative marks an important step in advancing elder care in Pakistan, allowing both countries to explore further cooperation in smart elder care in a more refined, standardized, and professional manner, according to a report from China Economic Net.\nChina and Pakistan have a history of close cooperation in standardization. In 2022, the National Standardization Administration of China (SAC) and the Pakistan Standards & Quality Control Authority (PSQCA) signed a Memorandum of Understanding (MoU) to enhance cooperation on mutual recognition of standards.\nThe agreement will help support participation in international standardization organizations such as the International Organization for Standardization (ISO) and the International Electrotechnical Commission (IEC), while also improving information exchange on standardization between the two countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:09:07.315Z"
}
