{
  "title": "Stronger Parliament essential for safeguarding rights of people: Naveed Qamar",
  "link": "https://www.app.com.pk/national/stronger-parliament-essential-for-safeguarding-rights-of-people-naveed-qamar/",
  "date_published": "2024-09-16T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP):Senior leader of the Pakistan Peoples Party (PPP) Syed Naveed Qamar said on Monday that a stronger Parliament would be essential for safeguarding the rights of the people.\nSpeaking on the floor of the House, he said, “A stronger Parliament would make its representatives stronger and play a key role in safeguarding the rights of the people.”\nNaveed Qamar said that a special committee had been constituted at the request of the PPP Chairman to build consensus. However, he clarified that this committee is not a replacement for the National Assembly’s Committee on Law and Justice.\nThe PPP lawmaker said that no one can comprise on the sanctity dignity of the House, adding that PPP has also reservations about the amendments currently circulating in the media.\nTaking part in the debate, Shahida Begum said that mutual consensus should be established before tabling the constitutional amendments in the National Assembly.\nShe praised Speaker National Assembly Sardar Ayaz Sadiq for constituting a special committee of Parliament at the request of Chairman PPP Bilawal Bhutto Zardari. This committee will allow members from all parties to speak and discuss the matters.\nShahida Begum commended the Charter of Democracy (CoD), signed between Shaheed Benazir Bhutto and Muhammad Nawaz Sharif for its role in strengthening democracy and reforming national institutions through consultations with all political parties.\nDr. Farooq Sattar of the Muttahida Qaumi Movement-Pakistan (MQM-P) said  that if the government intends to present constitutional amendments to Parliament, working papers should be provided to both the coalition partners and the opposition.\nHe stressed that strong provinces are crucial for a strong federation and urged the government to take MQM-P into confidence as a coalition partner.\nChairman Pashtunkhwa Milli Awami Party Mahmood Khan Achakzai suggested that any proposed constitutional amendments should be presented to a special committee of Parliament.\nHe assured the House that his party would support any amendments aimed at strengthening democracy and the supremacy of Parliament.\nMahmood Khan added that all members of Parliament, who have taken an oath to protect the Constitution, desire the supremacy of Parliament and the rule of law in the country.\nHe urged the government and political parties to transfer resources to the provinces to strengthen the federation and serve the larger interest of the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:09:34.894Z"
}
