{
  "title": "ADB President Asakawa lauds Pakistan’s economic reform agenda, reaffirms support",
  "link": "https://www.app.com.pk/national/adb-president-asakawa-lauds-pakistans-economic-reform-agenda-reaffirms-support/",
  "date_published": "2024-09-16T17:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP):Asian Development Bank (ADB) President Masatsugu Asakawa, accompanied by his delegation, met with Prime Minister Muhammad Shehbaz Sharif and commended his government for its comprehensive reforms and reaffirmed ADB’s continued support for Pakistan.\nDuring the discussions, Asakawa praised Pakistan’s long-standing relationship with ADB as one of its founding members.\nHe also reaffirmed ADB’s support for infrastructure development, climate resilience, and institutional reforms in Pakistan.\nWhile appreciating ADB’s long-standing and steadfast support to Pakistan, the prime minister informed the visiting president about a series of reforms introduced by the government. The key reforms include enhancing tax revenues, improving financial sustainability of the energy sector, enhancing climate resilience, reduction in untargeted subsidies and scaling up social protection.\nThe prime minister emphasized that he is personally overseeing the progress of these reforms to ensure their successful implementation and long-term impact, underscoring the Government’s commitment to sustainable economic growth and stability.\nThe prime minister appreciated ADB’s generous support of over US$ 1.5 billion in response to the devastating floods of 2022. He showed Pakistan’s keen desire to work with the development partners in climate resilience projects including agriculture.\nThe prime minister and president of ADB also witnessed the loan signing of the Sindh Emergency Housing Reconstruction Project amounting to US$400 million and Khyber Pakhtunkhwa Rural Roads Development Project worth US$320 million.Both these projects are part of the ADB’s flood commitments.\nFederal Ministers for Planning & Development, Investment & Privatization, Economic Affairs, Finance & Revenue and other senior government officials also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:08:44.633Z"
}
