{
  "title": "Dar highlights ‘recent assurances’ from Kabul on Afghan soil not being used for terrorism - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar has said Pakistan received “recent assurances” from Afghan authorities that the neighbouring country’s soil would not be used for terrorism — a key issue of contention between Islamabad and Kabul.\n\nBoth countries have witnessed an improvement in bilateral relations after taking steps to improve ties, such as the revival of the Joint Coordination Committee (JCC) and upgrading diplomatic ranks. Dar visited Kabul earlier this month, where an agreement was signed for the Pakistan, Uzbek­istan and Afghanistan railway project to boost regional connectivity.\n\nAccording to a Foreign Office (FO) statement issued on Saturday, Dar engaged with the Pakistani-American community at the Pakistan Consulate in New York, where he “shared Pakistan’s expectation that Afghan soil would not be used for terrorism, noting recent assurances received from Afghan authorities in that regard”.\n\nThe foreign minister also highlighted the “country’s outreach to Afghanistan with a view to enhancing regional connectivity through rail and trade corridors to Central Asia”.\n\nDar’s statement follows Interior Minister Mohsin Naqvi’s visit to Kabul last week, when he discussed counterterrorism efforts and mechanisms for regulating cross-border movement with his Afghan counterpart, Sirajuddin Haqqani.\n\nNaqvi had expressed concerns over the infiltration by terrorist organisations causing “chaos and instability” and the need to stop them.\n\nIslamabad accuses Afghan-based terror groups of launching cross-border attacks and planning and executing terrorist attacks here, facilitated by the Afghan Taliban administration’s indifference to Pakistan’s concerns. In response, Pakistan has conducted military strikes against terrorist sanctuaries in Afghanistan and initiated a mass deportation drive targeting Afghan nationals.\n\nIn April, Afghanistan’s acting prime minister, Mullah Hasan Akhund, had assured Pakistan that Afghan territory would not be used for hostile activities against any country.\n\nDuring the interaction in New York, Dar stated that Pakistan was experiencing a significant positive boost in its standing on the world stage, saying it had emerged from a period of diplomatic isolation and is witnessing economic revival.\n\n“We have made considerable progress, especially in political and economic fields, in the past three years, despite heavy odds. We are indeed a resilient nation,” he said. Dar underscored that Pakistan was actively engaging on the international stage, including through recent high-level visits and multilateral diplomacy.\n\nHe invited the diaspora to actively contribute to Pakistan’s development, particularly in investment, trade, education, and digital innovation. He appreciated the contributions of the Pakistani diaspora to both Pakistan and the United States, acknowledging their vital role in strengthening bilateral relations and enhancing Pakistan’s image globally.\n\nThe foreign minister informed the community gathering on Pakistan’s economic recovery, noting that the country had successfully completed the IMF programme, significantly reduced inflation, and restored investor confidence.\n\nSharing that global credit rating agencies had recently acknowledged Pakistan’s improved macroeconomic outlook, he reaffirmed the government’s aspiration for Pakistan to join the ranks of G-20 economies.\n\nHe outlined key initiatives of the government, particularly the Special Investment Facilitation Council (SIFC), designed to streamline investment procedures and unlock opportunities in priority sectors.\n\nDar assured the community that the government was actively working toward the early resumption of PIA flights to New York, including steps toward restoring routes to Europe and the United Kingdom.\n\nHe reaffirmed the government’s commitment to engaging the Pakistani-American diaspora as strategic partners in national development as well as in strengthening mutually beneficial Pakistan–US bilateral cooperation.\n\nSpeaking to the Pakistani community in New York, FM Dar reaffirmed Pakistan’s resolve to defend its sovereignty and regional stability.\n\nHe recalled the country’s firm and resolute response during Operation Bunyanum Marsoos that led to the downing of six Indian aircraft, praising the unity demonstrated by the nation and the diaspora during this critical moment.\n\nHe appreciated the solidarity and support extended by Pakistani-Americans during the recent tensions with India and their constructive role in amplifying the voice of the Kashmiri people.\n\nThe government termed its retaliatory operation against India as ‘Bunyan-un- Marsoos’ after Pakistan and India clashed in May. After India launched a series of strikes under ‘Operation Sindoor’, Pakistan’s military swiftly responded and downed 6 Indian jets before a ceasefire came into effect following US mediation.\n\nThe foreign minister also visited Washington, DC days ago, where he held a “cordial” meeting with US Secretary of State Marco Rubio. “The meeting went very well. We discussed key global and regional issues,” he said, expressing hope that bilateral ties would be further strengthened.\n\nRubio had lauded Pakistan’s role in “global and regional peace” in his first meeting with Dar.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/271613024788d74.jpg",
  "retrievedAt": "2025-08-17T21:26:29.209Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926931/dar-highlights-recent-assurances-from-kabul-on-afghan-soil-not-being-used-for-terrorism",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T12:08:08.000Z"
}
