{
  "title": "US passenger plane evacuated in Denver due to brake fire - World - DAWN.COM",
  "author": null,
  "content": "Passengers on a US domestic flight were forced to evacuate onto a runway due to a brake fire just ahead of the plane taking off in Denver, the airline said.\n\nAmerican Airlines Flight 3023 was departing for Miami on Saturday but “experienced a mechanical issue” while accelerating ahead of takeoff at Denver International Airport, the airline told AFP, adding all 173 passengers and six crew “deplaned safely”.\n\nOne passenger sustained a minor injury and was taken to a hospital for evaluation, American Airlines said.\n\nBlown tires and the deceleration of the plane while braking resulted in an isolated brake fire, which was extinguished by city firefighters, according to the airline.\n\nSocial media videos published by US media outlets showed passengers frantically evacuating an American Airlines plane via an emergency slide as smoke billowed from beneath the aircraft.\n\nA man held a child as they rushed down the slide, stumbling as he hit the ground.\n\nThe Federal Aviation Administration (FAA) said in a statement that the crew onboard the Boeing 737 MAX 8 plane “reported a possible landing gear incident during departure” at around 2:45 pm Saturday.\n\nThe FAA said it was investigating the incident.\n\nIt occurred just a day after a Southwest Airlines flight plunged mid-air to avoid colliding with another aircraft while en route to Las Vegas, injuring two flight attendants.\n\nThe latest scare adds to growing concerns over aviation safety in the United States after a string of recent accidents and near misses.\n\nIn January, a mid-air collision between a commercial aircraft approaching Ronald Reagan Airport near downtown Washington and a military helicopter killed 67 people.\n\nIn May, US President Donald Trump’s administration announced plans to overhaul its “antiquated” air traffic control system, which suffers from a shortage of controllers in FAA-managed towers.\n\nThe government has laid off hundreds of FAA employees as part of its plan to slash the federal workforce.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/27164041a6b5aaa.jpg",
  "retrievedAt": "2025-08-17T21:26:27.919Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926932/us-passenger-plane-evacuated-in-denver-due-to-brake-fire",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T11:44:43.000Z"
}
