{
  "title": "Mother of Quetta ‘honour’ killing victim remanded to prison - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: An anti-terrorism court (ATC) sent the mother of a woman shot in the name of ‘honour’ to prison on judicial remand on Saturday.\n\nPolice produced Gul Jan Bibi before Judge Muhammad Ali Mobeen of the ATC-I after the expiry of her two-day physical remand and the investigation officer informed the court that she was not required for further investigation.\n\nAfter the initial arguments from both sides, the jud­ge sent the woman on judicial remand.\n\nGul Jan Bibi was arrested after her video statement went viral, in which she defended the killing of her daughter, Bano Bibi, and a man in the name of ‘honour’ in Dagari, on the outskirts of Quetta.\n\n“They were killed according to the Baloch traditions and customs and we have not committed any sin by killing them,” Gul Jan Bibi said about the incident that shook the nation after videos of a group of men shooting the victims surfaced online earlier this month.\n\nSo far, around 15 people, including the tribal chief of Satakzai tribe, Sardar Sherbaz Khan Satakzai, have been arrested. However, the prime accused, Jalal Satakzai, who allegedly opened fire and killed his elder sister, and the man, could not be arrested.\n\nProtest\n\nMeanwhile, human rights organisations and civil society staged a protest on Saturday to condemn the killings.\n\nThe protest was jointly organised by the Women Action Forum, National Commission on Human Rights, HRCP and Bol Utho Group.\n\nA large number of human rights activists and members of civil society gathered in front of the Quetta Press Club. They took out a rally led by rights activists Prof Farkhanda Auran­g­zeb, Huma Fouladi, Seema Batool, Hameeda Noor and others.\n\nThe protesters condemned the incident and said honour killings were an intolerable act.\n\nThey demanded that all those involved in this crime be brought to justice.\n\n“Nobody has the right to take law in his hand and kill people in the name of so-called honour,” Ms Aurangzeb said.\n\nThe protesters urged the government to protect women from such atrocities.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/250904509bc4949.jpg?r=090454",
  "retrievedAt": "2025-08-17T21:28:58.256Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926831/mother-of-quetta-honour-killing-victim-remanded-to-prison",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:21:43.000Z"
}
