{
  "title": "Chinese working on Mansehra hydel projects assured of security - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: The deputy commissioner and the district police officer on Saturday reviewed the security arrangements for Chinese engineers and workers engaged in two major hydropower projects being executed on the Kunhar River in the Balakot tehsil.\n\n“We have put in place multilayered security arrangements to ensure the safety of Chinese engineers working on hydropower projects being executed in Kaghan Valley and downstream in Balakot,” district police officer Shafiullah Khan Gandapur told reporters here on Sunday.\n\nDeputy commissioner Mian Adil Behzad and DPO Gandapur visited the 880MW Suki Kinari and 300MW Balakot projects to inspect security measures and held meetings with Chinese officials and army officers stationed at the sites.\n\nThe officials also visited the residential camps of the Chinese engineers and workers, assuring them of their safety.\n\nMansehra DC, DPO visit project sites in Balakot\n\n“You should work with peace of mind as we have deployed additional personnel to ensure your security,” said Mr Gandapur.\n\nSpeaking on the occasion, DC Adil Behzad emphasised that the government was committed to providing foolproof security to Chinese nationals working on development projects not only in Mansehra but throughout the province.\n\nThe DC and DPO also held discussions with army officers deployed at both the project sites regarding existing security protocols and enhancements needed to further safeguard engineers.\n\n: Rescue 1122 personnel equipped with ambulances, lifejackets, and other emergency tools have restricted tourists from approaching riverbanks after the Kunhar and Siren Rivers swelled significantly.\n\n“We have launched a drive to ensure the safety of tourists and have deployed our personnel to guide and keep them away from the riversides, as water levels in both the Kunhar and Siren ivers have risen,” district emergency officer Abrar Ali told reporters.\n\nHe said that rescuers had been stationed at key points where tourists often access the banks of the Kunhar River in Kaghan Valley and the Siren River in Siren Valley.\n\n“Our teams are also patrolling along both rivers throughout the district and have evacuated individuals found sitting dangerously close to the riverbanks, as water levels can rise suddenly even during hot and sunny weather,” Mr Ali added.\n\nLAID TO REST: Former provincial minister Habibur Rehman Tanoli, who had passed on Friday due to cardiac arrest, was laid to rest on Saturday at his ancestral Perhana village here.\n\nPeople from various walks of life, including politicians, lawyers, teachers, and traders, attended his funeral prayers, which were held at Government High School, Perhana.\n\nFederal Minister for Religious Affairs Sardar Mohammad Yusuf, MNA Shahzada Gustasab Khan, and PML-N office-bearers, including Junaid Ali Qasim and Sangeen Sultan Khan, also attended the funeral.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/141133518783612.jpg?r=113533",
  "retrievedAt": "2025-08-17T21:27:40.285Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926778/chinese-working-on-mansehra-hydel-projects-assured-of-security",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:22:34.000Z"
}
