{
  "title": "Two flight attendants hurt after US jet dives to avoid mid-air collision - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Two flight attendants on a Southwest Airlines flight departing Burbank, Cali­fornia, were injured on Friday after pilots took evasive action to dodge another aircraft on takeoff, the airline said.\n\nSouthwest Flight 1496 sharply descended nearly 500 feet, according to flight tracking websites, marking the second time in a week that a US commercial jet was forced to make abrupt flight maneuvers to avoid a potential mid-air collision.\n\nThe incident also appeared to be the fourth involving military aircraft since March.\n\nThe airline and the Federal Aviation Administration said the Southwest pilots took action after receiving cockpit alerts of other aircraft traffic being dangerously close. The Southwest Boeing 737 continued on to Las Vegas, where it landed uneventfully.\n\nFlight-tracking service Flightradar24 identified the other aircraft as a Hawker Hunter fighter jet — British-built aircraft — that crossed in front of the Southwest flight.\n\nThe planes came within 4.86 miles (7.82 km) of each other laterally and 350 feet (107 m) vertically.\n\nTwo flight attendants were treated for injuries, the airline said, without providing detail. No injuries were immediately reported by passengers, according to Southwest. But one passenger told Fox News Digital the sharp descent stirred panic onboard.\n\n“It was terrifying. We really thought we were plummeting to a plane crash,” Caitlin Burdi said in an on-camera interview. After the incident, “the pilot came on (the intercom), and he told us we almost collided with another plane.”\n\nAccording to a statement from Southwest, the incident began when its crew responded to “two onboard traffic alerts” while taking off from the Hollywood Burbank Airport north of Los Angeles, “requiring them to climb and descend to comply with the alerts.”\n\nThree earlier close calls\n\nIn a separate incident one week ago, a SkyWest Airlines jet operating as a Delta Connection flight from Minneapolis reported taking evasive action to avoid a possible collision with a US Air Force bomber during a landing approach over North Dakota on July 18.\n\nThe FAA said it was investigating last Friday’s near-miss incident involving SkyWest Flight 3788, an Embraer ERJ-175 regional jet, which landed safely at Minot, North Dakota. The Air Force confirmed a B-52 jet bomber assigned to Minot Air Force Base had conducted a ceremonial flyover of the North Dakota State Fair last Friday around the time of the SkyWest incident.\n\nThe Air Force said the bomber cockpit crew was in contact with local air traffic control before, during and after the flyover, and that the Minot International Airport control tower “did not advise of the inbound commercial aircraft” as the B-52 was departing the area.\n\nThe FAA has said that air traffic services were provided by the Minot air traffic control tower, which is run by a private company and not FAA employees.\n\nThe National Transportation Safety Board and FAA are investigating a March 28 close call involving a Delta Airbus A319 jet and a group of Air Force jets near Reagan Washington National Airport. The four Air Force T-38 Talons were heading to nearby Arlington National Cemetery for a flyover at the time.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/2412581446b8648.jpg?r=130024",
  "retrievedAt": "2025-08-17T21:28:15.928Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926819/two-flight-attendants-hurt-after-us-jet-dives-to-avoid-mid-air-collision",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:22:02.000Z"
}
