{
  "title": "Dispute erupts over Punjab cotton output data - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: A major controversy has emerged over the methodology used by the Crop Reporting Centre (CRC) Punjab in determining provincial cotton output, with serious allegations of inflated and misleading statistics surfacing.\n\nIt has been revealed that CRC Punjab is allegedly estimating total cotton production using hypothetical calculations — extrapolating yields based on the number of bolls per plant across an acre or, in some districts, from small sample plots as small as eight feet by six feet.\n\nThis has exposed a long-standing discrepancy between the figures reported by CRC Punjab and those of the Pakistan Cotton Ginners Association (PCGA), with the former consistently reporting significantly higher production.\n\nIhsan-ul-Haq, Chairman of the Cotton Ginners Forum, stated that this variance has long complicated decision-making for stakeholders in the cotton industry. He noted that while some attribute the CRC’s inflated figures to unrecorded lint sales by certain ginners, the presence of two conflicting national datasets has damaged Pakistan’s credibility in international cotton forums.\n\n“As of July 15, the PCGA reported Punjab’s cotton production at 145,000 bales, while CRC Punjab claimed 335,000 bales — a staggering difference,” Haq said, adding that such figures appear divorced from ground realities. “It is entirely inaccurate to determine provincial output from a handful of bolls or a couple of micro-plots,” he stressed.\n\nCRC’s figures sharply contradict PCGA data, raising concerns over planning and international credibility\n\nHe urged the CRC to adopt a more grounded data collection approach, similar to that of the PCGA, which gathers cotton and lint sales and stock data on a fortnightly basis from every ginning factory. Haq proposed that CRC staff collect real-time data from ginneries and grain markets to provide more accurate and credible figures.\n\nIn response, CRC Punjab Director-General Dr Abdul Qayyum defended the Centre’s methodology. Speaking to Dawn by phone, he said around 1,600 staff members in cotton-growing areas gather data weekly from approximately 4,000 locations.\n\n“Our teams measure boll size and weight, count bolls per plant, and monitor picking activity in the field,” he explained.\n\nDr Qayyum asserted that the CRC’s calculations are based on standardised field practices with no incentive to inflate or deflate figures. He attributed the divergence from PCGA data to differences in collection points.\n\n“While we report from the picking stage, PCGA collects data at the ginning stage — where under-invoicing by ginners to evade sales tax is a known issue, as acknowledged by the industry itself,” he said.\n\nDespite these explanations, the growing gap between CRC and PCGA data continues to raise concern among cotton stakeholders, who warn that unreliable production figures could undermine effective policymaking and market confidence.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/6869ae3caca02.jpg",
  "retrievedAt": "2025-08-17T21:27:24.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926853/dispute-erupts-over-punjab-cotton-output-data",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T02:22:33.000Z"
}
