{
  "title": "3 new polio cases confirmed in KP, Sindh as nationwide tally climbs to 17 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Institutes of Health (NIH) in Islamabad on Saturday confirmed three new polio cases in the country, taking the total number of cases detected this year to 17.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nThe latest cases include one each from the Lakki Marwat and North Waziristan districts in Khyber Pakhtunkhwa, and one from Sindh’s Umerkot district, a statement by the Pakistan Polio Eradication Programme (PPEP) said.\n\nA 15-month-old girl from Takhtikhel in Lakki Marwat, a six-month-old girl from North Waziristan’s Mir Ali tehsil and a five-year-old boy from Umerkot’s Chajro were the latest polio cases confirmed by the NIH’s Regional Reference Laboratory for Polio Eradication.\n\nWith these new detections, the total number of polio cases in Pakistan in 2025 has risen to 17 — including 10 from KP, five from Sindh, and one each from Punjab and Gilgit-Baltistan.\n\nA special vaccination campaign was held from July 21-27 in the bordering area of KP and Balochistan to coincide with Afghanistan’s sub-national polio campaign.\n\nIn addition, a fractional vaccination campaign began in Chaman on July 21 and will roll out in six districts of Balochistan from July 28.\n\n“Despite substantial progress in polio eradication efforts, the continued detection of polio cases underscores the persistent risk to children, especially in areas where vaccine acceptance remains low.\n\n“It is crucial for communities to understand that poliovirus can resurface wherever immunity gaps exist. Every unvaccinated child is at risk and can also pose a risk to others,” the statement said.\n\nPolio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine (OPV) for every child under five during each campaign, along with the timely completion of all essential immunisations.\n\nEarlier this month, Prime Minister Sheh­baz Sharif reaffirmed Pakis­tan’s commitment to eradicating polio, vowing to intensify efforts with the support of international, provincial and local teams.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:26:48.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926915/3-new-polio-cases-confirmed-in-kp-sindh-as-nationwide-tally-climbs-to-17",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T07:58:50.000Z"
}
