{
  "title": "SMOKERS’ CORNER: THE MYTH OF THE 'ISLAMIST NATIONALIST’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "Various Indian analysts have continued to label Pakistan’s military chief, Gen Asim Munir, as an “Islamist nationalist.”\n\nTwo things are at work here. First, they want to present Gen Munir as a scary Islamist with a nuclear arsenal. This portrayal is largely shaped to trigger the attention of western powers.\n\nSecondly, there is also the possibility that these analysts clearly aren’t aware that there is nothing called ‘Islamist nationalism.’ Either way, theirs is a rather ignorant portrayal.\n\n‘Islamism’ is opposed to the whole concept of nationalism. According to prominent Islamist ideologists such as Hassan al-Banna, Sayyid Qutb and Abul A’la Maududi, nationalism was a European construct and is inherently secular and bound by geography. Islamists argue that Islam’s ‘universalist’ vision is at odds with this equation.\n\nNationalism indeed is a European concept. Therefore, for instance, Maududi’s concept of hakumat-i-ilahi [God’s rule/regime] was not about nationalism or a nation state. It was about an Islamist state ruled by a vanguard of ‘pious men’ who were to expand it. Ironically, though, the idea of the state as we know it today and as applied by the purveyors of Islamism is also a European construct.\n\nPakistan’s ideological evolution, from Muslim nationalism to Islamic nationalism, has often been misunderstood. Now, the state is quietly reforming its ideological identity — one that is distinct from both secularism and Islamism\n\nNevertheless, both mainstr­eam and militant Islamists detest nationalism. But mainstream Islamists often enter politics to get seats in parliaments from where they strive to achieve their goals without having to resort to violence. They treat this as a temporary arrangement, though, which is to be held till Muslim polities and politics are ‘Islamised’ enough to embrace wider Islamist goals.\n\nBut most experiments of this nature failed in various Muslim-majority nation states because, eventually, the nationalist impulse and the inherently secular make-up of the idea of the nation state clashed with the ambitions of the Islamists.\n\nPakistan, a nation state, defines itself as an ‘Islamic Republic’ but one that was founded on ‘Muslim nationalism.’ Muslim nationalism seeks to advance the interests and aspirations of Muslims through nationalistic frameworks. It treats Islam as a ‘guiding force’ — not a political blueprint.\n\nHowever, in the 1970s, the core of Pakistani nationalism began to move from Muslim nationalism towards ‘Islamic nationalism.’ Islamic nationalism retains many aspects of Muslim nationalism but is slightly more open towards co-opting certain theocratic elements of Islamism.\n\nIslamic nationalism’s immediate outcome in Pakistan was ‘Islamic republicanism.’ Islamic republicanism in Pakistan’s context meant a middle ground between a theocratic state and a secular republic. It encourages a democratic form of government, a democratically agreed cons­titution, and a mixture of secular and ‘Islamic’ laws.\n\nIt treats Islam as an identity marker, and constitutionally, guarantees religious freedoms to non-Muslim citizens. It also provides enough room for entirely secular activities — as long as they do not contradict the way the constitution has defined Islam.\n\nThe transition from Muslim nationalism to Islamic nationalism/republicanism has not been a smooth one, though. The latter was almost immediately seized by civilian-political and state actors as a tool to portray their political manoeuvres as ‘divinely-ordained.’ The appetite of the constitution to allow the co-option of more and more Islamist notions of law and morality was expanded.\n\nConsequently, Islamic nation­alism’s evolution was thrown into disarray. Pakistan came close to becoming an outright ‘theodemocracy’, or a blend of the principles of traditional republican democracy and theocratic rule. To some, it did become that.\n\nFrom the late 1980s onwards, the parliamentary route was rejected by most later-day Islamists and more militant and violent means were adopted by them. Mainstream Islamists, though, became desperate to sustain the route to theodemocracy that was becoming extremely bumpy.\n\nThis desperation in them is still present. This means they sense that a change is afoot. And it is. The violence and confusion that the creeping theodemocracy unleashed in society began to threaten the state itself.\n\nGradually, the state (dominated by the powerful military establishment) is trying to reshape Islamic nationalism, and the government is following suit. Understandably, it is going to be a slow but prudent process.\n\nThe idea now is to position Pakistan’s Islamic nationalism/republicanism in opposition to contemporary Hindu nationalism in India, which is viewed as being regressive, violent and racist. What is also afoot is a quiet tweaking in this respect of rhetoric, textbooks and the constitution.\n\nSome simple examples in this regard are constitutional bans on child marriage, the reintroduction in textbooks of a 1947 speech by the country’s founder that was expunged from the curriculum in 1977 for being ‘too secular’, etc.\n\nThis is being done to refigure Islamic nationalism as a tolerant, inclusive and ‘balanced’ idea that is in tune with 21st century requirements, but also one that gives the state an overwhelming monopoly on violence against those perceived to be threatening the state.\n\nGen Munir is not an Islamist nationalist. The term is inherently contradictory, as discussed above. One might say he’s an Islamic nationalist, but one whose nationalism is being informed by the reshaped version of Islamic nationalism, which is flexible, as opposed to what it became in the 1980s.\n\nDuring the country’s recent war with India, in which Pakistan downed multiple Indian fighter jets, the word ‘jihad’ was only sparingly used. The chant of “Allah-o-Akbar” [God is great], though, was common, as it has always been, even among the most liberal Pakistanis. It is entirely rhetorical and doesn’t carry any shadowy agenda. It’s more of a cultural chant than a declaration of any questionable intent, unless one was a violent, anti-state Islamist militant.\n\nThe changing world order and Pakistan’s increasing importance in the region is compelling the state to constantly tweak the country’s Islamic nationalism. It is now well understood that the nationalism that began to mutate into something quite problematic in the 1980s is at odds with how the state has begun to see itself now.\n\nPublished in Dawn, EOS, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6884c4ceee39d.jpg",
  "retrievedAt": "2025-08-17T21:27:07.127Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926727",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:22:48.000Z"
}
