{
  "title": "Five senators formally join PTI; Murad yet to file affidavit - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Party mulls fielding Hammad Azhar in NA-129 by-election\n• Barrister Gohar urges end to political exclusion\n\nISLAMABAD: As many as five Senators have submitted their affidavits to Pakistan Tehreek-i-Insaf (PTI) Chairman Barrister Gohar Ali Khan, indicating their intention to officially join the party.\n\nHowever, a sixth Senator — Murad Saeed — remains “missing.” According to party sources, his intimation regarding joining PTI may be received electronically.\n\nPTI’s Information Secretary, Sheikh Waqas Akram, while speaking to Dawn, said that five Senators who were recently elected as independent candidates from Khyber Pakhtunkhwa have handed over their affidavits to Mr. Gohar.\n\n“The affidavits will be submitted to the Election Commission of Pakis­tan (ECP) on Monday (tomorrow),” he said.\n\nThe Senators who submitted affidavits to join PTI include Azam Swati, Faisal Javed, Noor-ul-Haq Qadri, Mirza Muhammad Afridi, and Robina Naz.\n\nHowever, it is pertinent to mention that PTI stalwart Murad Saeed — who secured the highest number of votes on general seats — has not yet submitted his affidavit to Mr. Gohar.\n\nAccording to party sources, the government is actively attempting to arrest Murad Saeed, who has been in hiding for a considerable period. As a result, his affidavit might be delayed or submitted electronically.\n\nWhen contacted, Azam Swati told Dawn that he and the other candidates had made every effort to obtain official PTI tickets but were denied.\n\n“In my case, my nomination papers were rejected multiple times and were only accepted following a court order, which remarked: ‘If Azam Swati cannot contest the election on a technocrat seat, then who can?’ As we did not have party tickets, we formed a group of six independent candidates and went on to win the election,” he said.\n\nIn response to another question, Mr Swati confirmed that he and the other four Senators had submitted their affidavits to Barrister Gohar on July 23.\n\nHe expressed confidence that the affidavits would be submitted to the ECP, as rules require Senators to formally join a political party within three days of the election.\n\nHammad Azhar to contest by-polls\n\nMeanwhile, PTI plans to nominate the party’s former Punjab president, Hammad Azhar, to contest the by-election from NA-129— the constituency where his late father, Mian Muhammad Azhar, was elected in the February 8, 2024, general elections.\n\nIt is worth mentioning that Hammad Azhar was also elected as an MNA from the same constituency in the 2018 general elections.\n\nLast year, Mian Azhar had contested the election because Hammad Azhar failed to submit his nomination papers.\n\nAt the time, the younger Azhar had been declared an absconder, although he later attended his father’s funeral.\n\n‘Not a good omen’\n\nMeanwhile, PTI Chairman Barrister Gohar Ali Khan has stated that sidelining a major political party is not a good omen for the country, stressing that every stakeholder must play a role in upholding democracy.\n\nHe made these remarks on Friday after visiting Hammad Azhar’s residence to offer condolences on the passing of his father, Mian Azhar, former Punjab governor and PTI MNA.\n\nWhile acknowledging that the dialogue process has not progressed, Mr Gohar said that people need to put aside their unwarranted egos. He lamented that PTI was first accused of rec­eiving foreign funding and later blamed for the country’s current political instability. He made it clear that PTI has never attempted to create chaos or provoke confrontations in politics.\n\nMansoor Malik in Lahore also contributed to this report\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/211939084eff4c6.jpg?r=193912",
  "retrievedAt": "2025-08-17T21:28:56.926Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926829/five-senators-formally-join-pti-murad-yet-to-file-affidavit",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:21:43.000Z"
}
