{
  "title": "Storms unleash a year’s rain on Chinese city in one day - World - DAWN.COM",
  "author": null,
  "content": "BEIJING: Beijing issued on Saturday a warning for geological disasters including landslides and mudslides after intense rainfall the day before, with storms circulating China’s north unleashing for a second time a year’s rain on nearby Baoding.\n\nThe Beijing meteorological agency’s alert for 10 of the city’s 16 districts came as local authorities also warned of flash floods in mountainous areas.\n\nIn neighbouring Hebei, extreme overnight rains in Fuping, a part of the industrial city of Baoding, saw records broken at a local weather station with 145 mm (5.7 inches) per hour of precipitation, state broadcaster CCTV said.\n\nThe Xizhuang station recorded a maximum rainfall of 540 mm over an eight-hour period, superseding Baoding’s average annual rainfall of about 500 mm. Just a day ago, storms dumped similar amounts of precipitation on Yi, another part of Baoding.\n\nBeijing warns of geological disasters in China’s north\n\nThe rain held destructive power, CCTV said, affecting more than 46,000 people and forcing 4,655 of them to evacuate.\n\nNorthern China has witnessed record-breaking precipitation in recent years, exposing densely populated cities including Beijing to flood risks. Some scientists link the higher rainfall in China’s usually arid north to global warming.\n\nChina’s Water Resources Ministry has issued targeted warnings to 11 provinces and regions, including Beijing and Hebei, for floods arising from small and medium-sized rivers and gushing torrents from mountains.\n\nThe alert also sought to ensure that reservoirs and silt dams are safe during floods.\n\nAcross the country, heavy rainfall has caused 13 rivers scattered through seven provinces to swell past their flood warning levels by as much as 1.4 m (4.6 feet), CCTV reported, citing the ministry’s findings on Saturday morning.\n\nAmong them, one tributary of Inner Mongolia’s Dahei River and another of Shaanxi’s Yanhe River recorded their biggest floods since records began.\n\nThe storms are part of the broader pattern of extreme weather across China due to the East Asian monsoon, which has caused disruptions in the world’s second-largest economy.\n\nIn a separate bulletin, CCTV also said two small reservoirs in northeastern Jilin province were operating above the flood limit, as rivers continue to swell.\n\nLocal authorities have begun activating five large reservoirs to help with flood water discharge.\n\nExtreme rainfall and severe flooding are highly monitored by Chinese authorities as they challenge the country’s ageing flood defences, threaten to displace millions, and wreak havoc on a $2.8 trillion agricultural sector.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/29092456a6017db.jpg?r=092529",
  "retrievedAt": "2025-08-17T21:28:26.833Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926821/storms-unleash-a-years-rain-on-chinese-city-in-one-day",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:22:02.000Z"
}
