{
  "title": "GB seeks Rs7bn aid; thousands displaced in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CM Gulbar says region lacks funds to tackle flood damage\n• Seven districts affected; Diamer worst hit by daily flash floods\n• Villagers flee Rajanpur, Bhakkar, Layyah, Muzaffargarh as low-lying districts in Punjab submerged\n\nGILGIT / LAHORE / DERA GHAZI KHAN: Gilgit-Balti­stan Chief Minister Haji Gulbar Khan on Saturday appe­aled to the federal government for Rs7 billion in emergency funds to deal with climate-induced disasters that have caused damages exceeding Rs20bn across the region.\n\nSpeaking at a press conference at the CM House in Gilgit, the chief minister said the GB government lacks the financial capacity to handle the unprecedented disasters.\n\nCM Khan was accompanied by GB Home Minister Shams Lone, GB Assembly member Jamil Ahmed, Special Assi­stant on Infor­mation Eman Shah and Special Assistant on GB Disaster Management Auth­ority Muhammad Ali Quaid.\n\nHe said unprecedented floods had impacted seven districts, with Diamer being the worst affected. “People in GB are facing daily flood events. At least one flood occurs every day,” he said.\n\nHe said that so far, 10 fatalities and four injuries have been reported. Seven deaths were reported from Babusar, two from Thore Valley (Dia­mer) and another from Astore district.\n\nThe chief minister said that 300 homes were destroyed, 200 were partially damaged, 40 water channels in 30 villages were swept away and 15 kilometres of roads, bridges, agricultural land, crops and public and private infrastructure were severely damaged.\n\nHe noted that only Rs1bn was allocated in the GB budget for emergencies and that the local government is also burdened with Rs3bn in liabilities from past disaster rehabilitation efforts.\n\n“I appeal to the prime minister of Pakistan to immediately release at least Rs7bn to restore roads, electricity, water channels and to undertake other essential relief efforts,” the chief minister said and requested the premier to visit the region.\n\nHe recalled that the federal government provided Rs3bn during the 2022 floods, but criticised the previous GB administration for misusing the funds, with the exception of a model village established for flood victims in Ghizer’s Bubor area.\n\n“This year’s disasters are beyond our resources. I urge the federal government to help the people of GB,” he added, while also appealing to non-governmental and international organisations for support. A formal request has been sent to Prime Minister Shehbaz Sharif, he said.\n\nMeanwhile, the Karakoram Highway, which was blocked at Chilas on Saturday, was reopened for traffic on Sunday. However, flash flood events continued to be reported across GB.\n\nIn Fairy Meadows near Nanga Parbat, a flash flood swept away over 200 goats, sheep and surrounding greenery. Rescue 1122 reported multiple flash floods in the Shigar district on Saturday, affecting crops and infrastructure in Qaimabad Tisar, Chatron and Garam Chashma.\n\nResidents said flash floods disrupted road access, mobile networks and electricity. In Kondus village of Ghanche district, a devastating landslide destroyed over 50 homes. Survivors are in dire need of shelter, food, medical care and internet access.\n\nFlood-affected communities in Diamer and elsewhere are facing severe shortages of clean drinking water and essential supplies.\n\nPunjab grapples with flooding\n\nMeanwhile, thousands of residents across several districts in Punjab were displaced on Saturday as widespread flooding inundated low-lying areas. In some regions, such as Rojhan tehsil of Rajanpur, residents resorted to hiring private boats after failing to receive government assistance.\n\nSeveral villagers in Bhakkar, Layyah, Multan and Muzaffargarh also had to leave due to a medium-level flood. All their crops were damaged due to the flood, and their houses were also surrounded by water.\n\nThe hundreds of people living in the catchment areas of the rivers Sindh and Chenab also had to migrate on their own, along with their cattle, struggling to find fodder and shelter. They protested the government’s lack of relief efforts.\n\nIn Layyah, the third flood wave in the Indus River raised water levels to 450,000 cusecs. A protective embankment near the under-construction Taunsa Bridge collapsed, submerging adjacent villages and farmlands. Rescue machinery, including a multimillion-rupee excavator, was at risk of being lost.\n\nDera Ghazi Khan Commissioner Chaudhry Ashfaq told Dawn that the situation was under control and that the excavator would be recovered once the water receded. Relief camps have been set up in Karor tehsil of Layyah at several locations.\n\nMeanwhile, Dera Ghazi Khan Deputy Com­missioner Usman Khalid said water levels were expected to remain stable by evening and noted that seven relief camps had been established in Taunsa. He confirmed that no mass evacuations had occurred yet.\n\nPunjab Senior Minister Marriyum Aurangzeb visited flood-hit areas in Pindi Bhattian and Hafizabad, where dozens of villages were submerged due to heavy rains. She met with residents, announced one-month rations for affected families and inspected medical and livestock camps.\n\nShe said a survey had been conducted to assess flood damage and pledged to provide financial assistance in a transparent manner. Emergency measures have been implemented in affected areas, with residents advised to relocate from dilapidated structures.\n\nEarlier, the Provincial Disaster Management Authority (PDMA) Punjab issued flood warnings for the Chenab and Jhelum rivers and their tributaries, anticipating rising water levels from July 28 to 31.\n\nPunjab’s Relief Com­missioner Nabil Javed directed local officials and departments, including agriculture, irrigation, health, livestock and transport, to remain on high alert and ensure that emergency arrangements, including food, shelter and clean water, were in place.\n\nPDMA Director General Irfan Ali Kathia urged the public to follow safety advisories and cooperate with authorities during emergency evacuations. He assured that the government would provide full support to both people and their livestock.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68857025af8c3.jpg",
  "retrievedAt": "2025-08-17T21:29:31.661Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926838/gb-seeks-rs7bn-aid-thousands-displaced-in-punjab",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:21:30.000Z"
}
