{
  "title": "DEATH, LIFE AND LOVE IN KARACHI - Newspaper - DAWN.COM",
  "author": null,
  "content": "I have often thought about how I would explain my relationship with Pakistan to my son. He has already spent almost half of his young life abroad and is likely, if current indicators continue heading the way they are for the country, to spend just a handful more years here until he departs for good.\n\nTherefore, the country and its myriad issues will never grip him the same way they grip me. He will never live or die on the successes and failures of this nation. It will be an abstract concept for him, a place where he spent some time, an ethnicity he identifies with, a memory bank of images: parents, grandmothers, dogs, school, friends, various chachas and bajis who helped him. At least, that’s what I think.\n\nChildren have a unique way of confounding their parents. Perhaps my father thought I would be the same. I doubt he would have imagined in a million years that I would end up doing the things I have done. But whatever my son chooses to do in his life, it struck me that I had never given him a context for the strange bond that ties me to this place. He will never understand me fully without that context. So, this is for him.\n\nTo say my relationship with Pakistan is a complex one, would be an understatement. I hate it. I love it. I can’t stand being here anymore. I can’t bear to be away. It is where my heart has been broken.  It is where I found love. It is where I have witnessed the power of humanity; it is where I have seen the heart of evil.\n\nWhat keeps us tethered to a country that appears rife with crime, injustice and death? In a personal essay, novelist and cop Omar Shahid Hamid unpacks his turbulent relationship with Pakistan in general, and Karachi in particular. Eos presents an excerpt from the essay ‘A Letter To My Son’ from the book Home #itscomplicated, recently published by Liberty Publishing…\n\nPakistan is a series of snapshots in my head. Standing in my  father’s office in the city courts, banging on his desk like a 10-year-old brat, thinking that my banging, like that of a judge’s gavel, would silence the arguing maulvis [religious clerics] sitting in front, forgetting that Pops was the District Magistrate and not I.\n\nThe searing heat of April, sweating through the cheap material of the Ghani Sons school uniform, standing under the old school bell, covered in rang, saying goodbye to friends on the last day of school as if we were going off to war. Eating Karachi Broast and Mezban’s toxic chicken corn soup at 2 a.m. on a chilly December night, discussing relationships that never were, pining over unrequited love and loss, and imagining that we would never face greater tragedy than this — how wrong we were!\n\nSilly boys pretending to play gangsters, angered over some imagined slight (a friend’s girlfriend had dumped him and moved on to someone else; hardly a casus belli, but at the time, grounds for the high school equivalent of the Russian invasion of Ukraine), driven to fist-fighting ridiculously dressed in silk shirts. Who the f*** goes to a fistfight dressed in a baggy silk shirt? There was no fight, there never was, and the end result was the inevitable ‘compro’ conducted by some older, more menacing individual with shady connections. I have often wondered since, what those ‘compro’ specialists must have thought of us, a bunch of ‘burger boys’ pretending to be tough guys in a city that was already beginning to descend into its long night.\n\nShards of glass, shining like diamonds on the asphalt road on a July morning when the humidity was already making Karachi an outdoor sauna at 8:30 in the morning; and a white 1992 Honda  Civic standing at the corner of the road at an odd angle, shredded with bullet holes like a piece of Swiss cheese. My father’s body, lying inert on the back seat and me peering in, not quite understanding that he was gone forever. The Karachi police chief, a Deputy Inspector General and a commander of a police force of 20,000 men, sitting in our dining room that evening and informing my mother that she should not register a case against the city’s most powerful political party or the head of that party, who sat thousands of miles away in suburban Edgware and controlled the city via satellite phone.\n\nThe DIG’s argument was that he would not be able to guarantee our security, and my mother replying to him by saying she was going to do exactly that, and it was his job to protect us. Throngs of people coming to our house in the days and months that followed, many, including close family members and lifelong friends, admonishing us for having taken such a ‘position’, and distancing themselves. A much smaller number, people I will never forget, standing by us and commending our bravery.\n\nAlmost two years later, a strange man, dressed in a starched white shalwar kameez, plops his glock pistol on to a glass tabletop in my grandfather’s house, twirls his handlebar moustache, and starts explaining to my mother and me how he arrested my father’s killer. Mistaking the shock on our faces for disbelief, he offers to take me to his police station to interrogate the suspect myself. And I, having never come across anyone as unique as this odd policeman called Chaudhry Aslam, slowly shake my head, mortified at the thought of having to go to a police station. To partake in an interrogation. Who does that? A thousand interrogations and hundreds of police stations later, I look back and laugh at the stupidity of my 20- year-old self.\n\nPakistan will also teach me, repeatedly and bitterly, about betrayal. It is another summer’s day in 2005, cool and crisp because I am in Hub, Balochistan, and it is dawn. I am on my way to arrest one of the most notorious criminals of Karachi, and my thoughts turn to nothing more significant than the coolness of the morning. Little do I realise that within 20 minutes, I will be fighting for my life, ambushed and abandoned, my closest friends wounded, watching a friend and colleague bleed to death 10 feet from where I am taking cover. Those 10 feet feel like 10,000 because I am unable to reach him as we draw heavy and ceaseless fire. Wounded by shrapnel myself, I think, this is it.\n\nIt is hard to imagine at that moment, in the winter of 1998-99, but that odd policeman with the handlebar moustache will become one of my closest friends. In a strange way, he will inspire me to become a cop. Not a civil servant, fretting over summaries and memoranda, not a policeman, with the whiff of social order enforced by a Constable Carthorse-like figure implicit in that term, but a cop, with all the gritty and hard edges that implies.\n\nFor those of us born in the last quarter of the 20th century, we have become used to drawing arbitrary lines to divide history. Perhaps the seminal events of the last century were so monumental that all that came after them seemed irrevocably altered. Thus, we have the world before the Great War to end all wars, and the world after; the world before the first brick was dislodged from the Berlin Wall, and everything after; the world before the planes hit the Twin Towers on  September 11th, and the one after; the world before Covid and post-Covid.\n\nOn a winter’s day in December 1998, a chance encounter will become my inflection point. It will divide my life into the world before and the world after. It will lead me down a path that I could never have imagined travelling, and it will take me to people and places that were once so far removed from my life that they would not only be unrecognisable but unfathomable to the me that existed before the crossroads in my personal history.\n\nIt will create a thread that will lead, first of all, to an examination that nobody thinks I will be able to pass. It will take me out of the cocoon of Pakistan in which I had existed for the first two decades of my life, and immerse me in a much more real version of Pakistan.  Ultimately, for good or bad, it will bind me more tightly to this country than ever before.\n\nBut it is a journey that will begin with tragedy. An August day in 2001, and my first day on the job as a trainee police officer. In the sweltering heat is a smell I will never forget. Cartons of orange juice concentrate gone bad and a rotting corpse in an abandoned house, and the faint whiff of bitter almonds, which I will later learn to recognise as a sign of cyanide. At the centre of it is a young man. He’s my contemporary, he is someone with whom I share common friends.  He had been in England at the same time as me, studied law as I had,  and returned home, flying in the face of compelling arguments not to do so, just as I had. It’s a strange sensation, staring at the decomposing body of someone so young, so full of life — so like me — and thinking: there, but for the grace of God, was me.\n\nCenturies of evolution in religion, philosophy and the construct of society have established this belief that it is wrong to desire a man’s death. But I have developed a slightly different philosophy after 17 years of simultaneously being a victim and a law enforcer. I believe that at heart, despite what we say, we are still a tribal people. When people, evil people, hurt us, when they kill our loved ones, when they subvert the law with impunity for decades, when they threaten to extinguish all hope, we hanker for revenge. Thus, when justice finally takes its course, no matter how barbaric it may appear, you cannot deny that it is cleansing, liberating and healing.\n\nIt’s also the first time I find myself on the other side. As I stand outside this young man’s house, I watch his friends and relatives grieve. I see them trying to absorb the shock not only of a life brutally cut short well before its time, but also at the gruesome and fantastic details of the crime. The victim, kidnapped and killed by his next door neighbour, who continued to demand a ransom even after murdering the young man. A murder so bizarre it belongs in the pages of the Old Testament, and certainly not at the turn of the 21st century.\n\nI look at them — many of them friends and acquaintances of mine as well, crying and wringing their hands at the injustice of this country. Just as I had done with many of them when my father was murdered, just four years prior. But I realise that something has changed. I will never wring my hands again. Instead of helplessly cursing the injustice of this world and those that perpetrate it, I will become someone who hunts those perpetrators. I will not always succeed. It wouldn’t be life if I did. But I will never feel powerless again.\n\nLife cannot only be about conflict. It has to be about love as well.  It is a late summer evening in 2003. In a truly sad Bollywood cliché, at my best friend’s wedding, I see a girl wearing a green…saree or a shalwar kameez, or something. All I remember is that it is green and her eyes are hazel and I know that if I don’t meet her, my life will never be complete. In the years to come, she will tell me about her faint disgust at my oily, gelled-back hair — despite the turn of the century, my fashion sense at the time remained firmly rooted in the 1980s — and the fact that I seemed to think that being a cop was actually a good thing. But despite her reservations about me, she will save me. She will keep on saving me every day for the following 20 years, and may just continue to do so for another 20 if I’m lucky.\n\nPakistan will also teach me, repeatedly and bitterly, about betrayal. It is another summer’s day in 2005, cool and crisp because I am in Hub, Balochistan, and it is dawn. I am on my way to arrest one of the most notorious criminals of Karachi, and my thoughts turn to nothing more significant than the coolness of the morning. Little  do I realise that within 20 minutes, I will be fighting for my life,  ambushed and abandoned, my closest friends wounded, watching a  friend and colleague bleed to death 10 feet from where I am taking  cover. Those 10 feet feel like 10,000 because I am unable to reach him as we draw heavy and ceaseless fire. Wounded by shrapnel myself, I think, this is it. By some miracle, I manage to survive for the three hours that it takes reinforcements to make their way to our location.\n\nIn the months to come, as I recuperate, I seethe silently, and vow retribution against whoever set us up, thinking that no betrayal will ever be greater. And then fate says, “Hold my beer.” It’s a year later, and another deadlier and more diabolical betrayal strikes. It’s perpetrated by predatory colleagues taking advantage of my extraordinary naïveté, and it turns me into a fugitive overnight. It teaches me one of life’s most important lessons: just because you believe that you are just and good, it doesn’t mean shit to a world full of sharks. To survive and indeed, to thrive in this country, I will have to sacrifice a portion of my innocence. I will have to become a shark too.\n\nA friend once told me I have survivor’s guilt. Every few years, I get this feeling, and I ask myself why I survive while others around me are struck down. Starting with my father’s murder, to the day in Hub in 2005, when I see Arshad Butt die in front of my eyes, but  I live on, defying all logic; to a few months later when I flee the  country mere hours before my colleagues are arrested in a false case; to the conversation with one of my dearest friends from the police academy — a man who started his career with me on the mean streets of Karachi — just a day before he commits suicide in the District  Police Officer’s bungalow in Nankana Sahib. It is the most normal conversation I have ever had, and I curse myself for my obliviousness to his pain.\n\nAnd then, of course, there is Aslam. The same policeman from that fateful day in 1998, who becomes a colleague, a mentor and a friend over the years. We survive the ordeal of Hub together, both wounded but functional. In 2010, I tell him to sacrifice a black goat, light a candle in a church, give alms in every Sufi shrine from Karachi to Kathmandu — anything we can do to thank the Almighty for the stroke of luck that made us shift our joint offices a week before a Taliban suicide team blew up our old offices, shattering the lives of 20 families. Our office furniture is still in the old premises. As far as close shaves go, it doesn’t get any closer.\n\nIn 2011, Aslam and his family miraculously survive a ruthless attack on his house, an attack that appears even more ruthless in retrospect years later, when I arrest the perpetrators and discover that they were given the address by Aslam’s own bodyguard, the man who took his children to school. Again, it seems to me as if the angel of death has passed close enough to whisper in my ear, but has gone on to strike down someone else. Three months before the attack on his house, I have left for England, taking heed of various intelligence reports that indicate that both Aslam and I are on a Taliban hit-list.  That attack causes Aslam to enter into a death spiral with the terrorists, which will only end one way.\n\nFor the remaining two-and-a-half years of his life, I will remain in London, giving counsel but no longer an active player in the game. I convince myself that I am out for good. But my wife doesn’t believe me. She keeps saying Pakistan still calls to me, still pulls at my heartstrings. Irony of ironies, the day Aslam is martyred, I am actually in Karachi, promoting the release of my first book. As I reach the scene of the crime and turn my eyes to the still-burning remains of his SUV, I cannot believe he is gone, and I have survived yet again.\n\nIn 2016, I will prove my wife correct and return home. Friends in London will ask why I am putting my head in the lion’s mouth again.  Friends in Pakistan will say, why the f*** did you come back? But it doesn’t feel like entering the lion’s den. It just feels…normal. I return to my old office and the orderly greets me as if I had left last Tuesday, instead of five years ago. This place, this city, has a weird familiarity even as its fundamental nature changes. I travel around various cantons like a macabre tourist, recalling the crimes that have occurred on each street corner.\n\nThere’s the Village Restaurant — great chicken tikkas and also, incidentally from where the American journalist, Daniel Pearl, was kidnapped. And here we have the Lyari Expressway, a modern marvel that means you can travel from the affluent southern suburbs to the Super Highway in 30 minutes flat. Oh and Aslam’s vehicle was blown up by suicide bombers just opposite Exit Six. Nice to see that someone’s grown a bougainvillea to cover the dumpster into which my father’s car crashed when his murderers opened fire.\n\nBriefly, I consider becoming a tour guide through the madness of this city. A colleague in London informs me that ex-IRA (Irish Republican Army) gunmen do something similar in Belfast, giving guided tours of the Falls and Shankill roads, and getting tourists discounts in the same pubs where terrorists sipped pints of Guinness and planned unthinkable atrocities. I even come up with a catchy name for the business:  ‘Omar’s Terrorism Tours.’ FML, as my son would say.\n\nAnd then, around the same time, two things happen that change my perspective. In the months after Aslam’s death, for reasons that remain unfathomable to me, my first book, that had started as a random personal attempt at catharsis, is read by more and more people. It acquires commercial and critical acclaim and is soon followed by another. And then another. And another. It transforms me into something I had never imagined becoming: a chronicler of this mad, dystopian, Alice in Wonderland place called Pakistan.\n\nAnd, further stretching the bounds of credulity, my mother and I finally get justice. After an interlude of 17 years, involving so many political machinations that they would have prompted Machiavelli to write a sequel to The Prince, and despite the best efforts of a sociopath who lived in London and controlled Karachi via satellite phone for three decades, my father’s murderer finally hangs for his crimes.\n\nCenturies of evolution in religion, philosophy and the construct of society have established this belief that it is wrong to desire a man’s death. But I have developed a slightly different philosophy after 17 years of simultaneously being a victim and a law enforcer. I believe that at heart, despite what we say, we are still a tribal people. When people, evil people, hurt us, when they kill our loved ones, when they subvert the law with impunity for decades, when they threaten to extinguish all hope, we hanker for revenge. Thus, when justice finally takes its course, no matter how barbaric it may appear, you cannot deny that it is cleansing, liberating and healing.\n\nAfter four-and-a-half decades of living on this planet, I still don’t understand this place I call home. I don’t understand how it has brought moments of such pure joy in my life, and such mind-boggling pain. I cannot comprehend how injustice can permeate throughout a society so flagrantly, and how, at the same time, unbelievable heroism can be an everyday occurrence here. By any objective, logic based metric, this place should either not exist, or be the centre of a conflagration so immense that it would make Dante’s Inferno sound like a Sunday walk in the park. Yet, people survive. Some even thrive.  People fall in love, raise families, play cricket with eccentric friends on the weekends, and just live life like in any other part of the world. \nI certainly have.\n\nExcerpted with permission from the essay ‘A Letter to My Son’ by Omar Shahid Hamid in the book Home #itscomplicated, edited by Saba Karim Khan and published by Liberty Publishing\n\nThe writer is a novelist and a police officer in the Pakistan Police Service. His novels include, The Election, The Prisoner, The Party Worker and The Spinner’s Tale, among others\n\nPublished in Dawn, EOS, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6884c51730b58.jpg",
  "retrievedAt": "2025-08-17T21:27:07.737Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926735/death-life-and-love-in-karachi",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:22:48.000Z"
}
