{
  "title": "Thailand and Cambodia agree to Malaysian mediation, Malaysian minister says - World - DAWN.COM",
  "author": null,
  "content": "Thailand and Cambodia have agreed to Malaysia acting as a mediator in their border conflict, the Malaysian foreign minister said on Sunday, as the combatants each said the other had launched further artillery attacks across contested areas.\n\nCambodian Prime Minister Hun Manet and Thai Acting Prime Minister Phumtham Wechayachai are expected in Malaysia on Monday evening, Foreign Minister Mohamad Hasan told state news agency Bernama.\n\n“They have full confidence in Malaysia and asked me to be a mediator,” Mohamad said, adding he had talked with his Cambodian and Thai counterparts and they agreed no other country should be involved in the issue.\n\nThe talks in Malaysia come after Prime Minister Anwar Ibrahim, chair of the regional Association of Southeast Asian Nations (Asean) forum, had proposed a ceasefire on Friday and US President Donald Trump said on Saturday that the two leaders had agreed to work on a ceasefire.\n\nFour days after the worst fighting in more than a decade broke out between the Southeast Asian neighbours, the death toll stood above 30, including 13 civilians in Thailand and eight in Cambodia. More than 200,000 people have been evacuated from border areas in the two countries, authorities said.\n\nFresh artillery clashes erupted on Sunday morning near two long-contested ancient temples in the frontier region between northern Cambodia and northeast Thailand, which has seen the bulk of the fighting.\n\nCambodian defence ministry spokeswoman Maly Socheata said Thai forces began attacking areas around the temples at 4:50am (6:50am PKT).\n\nThe regular thump of artillery rattled windows in the Cambodian town of Samraong, around 20 kilometres from the frontline, AFP journalists said.\n\nThai Army Deputy Spokesman Ritcha Suksuwanon said Cambodian forces began firing artillery around 4am (6am PKT) as the two sides battled for control of strategic positions.\n\nCambodian Prime Minister Hun Manet on Sunday said his country “agreed with the proposal for an immediate and unconditional ceasefire between the two armed forces”.\n\nHe said his Foreign Minister Prak Sokhonn will talk to US Secretary of State Marco Rubio to coordinate with the Thais, but warned Bangkok against reneging on any agreement.\n\nAfter Trump’s call, Thailand’s acting Prime Minister Phumtham Wechayachai said he had agreed in principle to enter a ceasefire and start talks “as soon as possible”.\n\nWhile both sides have expressed a desire for talks to end the crisis, neither has so far been willing to back down. On Sunday, they again each blamed the other for undermining peace efforts.\n\nThe Thai foreign ministry also accused Cambodian forces of firing shells into civilian homes in Surin province.\n\n“Any cessation of hostilities cannot be reached while Cambodia is severely lacking in good faith and repeatedly violating the basic principles of human rights and humanitarian law,” the foreign ministry said in a statement.\n\nFrom the Cambodian side, defence ministry spokeswoman Maly Socheata issued a statement denying that they fired first.\n\nThe statement accused Thailand of “deliberate and coordinated acts of aggression”.\n\nA long-running border dispute erupted into combat this week with jets, tanks and ground troops battling in the rural border region, marked by a ridge of hills surrounded by wild jungle and agricultural land where locals farm rubber and rice.\n\nThailand says seven of its soldiers and 13 civilians have been killed, while Cambodia has confirmed eight civilian and five military deaths.\n\nThe conflict has forced more than 138,000 people to be evacuated from Thailand’s border regions, and 80,000 have been driven from their homes in Cambodia.\n\nAfter an urgent United Nations Security Council meeting on Friday in New York, Cambodia’s UN Ambassador Chhea Keo said his country wanted “an immediate ceasefire” and a peaceful resolution of the dispute.\n\nUN chief Antonio Guterres urged both sides on Saturday to “immediately agree to a ceasefire” and hold talks to find a lasting solution.\n\nAs well as blaming each other for starting the fight, Cambodia has also accused Thai forces of using cluster munitions, while Thailand has accused Cambodia of targeting civilian infrastructure, including hospitals.\n\nThe fighting marks a dramatic escalation in a long-running dispute between the neighbours over their shared 800-kilometre border, where dozens of kilometres are contested.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/271255178aea3e4.jpg",
  "retrievedAt": "2025-08-17T21:26:51.076Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926916/thailand-and-cambodia-agree-to-malaysian-mediation-malaysian-minister-says",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T08:02:10.000Z"
}
