{
  "title": "Verstappen starts new Red Bull era with Spa sprint win - Sport - DAWN.COM",
  "author": null,
  "content": "SPA FRANCORCHAMPS: Formula One champion Max Verstappen won a “cat and mouse” Belgian Grand Prix sprint on Saturday in Red Bull’s first race under the leadership of Laurent Mekies following Christian Horner’s dismissal.\n\nMcLaren’s championship leader Oscar Piastri finished second, after taking a dominant pole position for the 100km race, with the Australian increasing his advantage over team-mate Lando Norris to nine points.\n\nNorris ended up where he started, in third place on a bright afternoon at the longest and second fastest track on the calendar.\n\nCharles Leclerc was fourth for Ferrari with Haas’s Esteban Ocon fifth and Carlos Sainz sixth for Williams. Haas’s Oliver Bearman and Racing Bulls’ Isack Hadjar completed the scoring positions.\n\n“Well done Max. Very, very impressive defence, very well controlled. You didn’t leave anything on the table there,” Mekies told Verstappen over the team radio after the Dutch driver took the chequered flag.\n\nVerstappen, starting second, used straightline speed to slipstream into the lead at les Combes on lap one and held off Piastri for the remaining 14, with the Australian 0.753 seconds behind at the flag.\n\nThe win was Verstappen’s first, in either a sprint or grand prix, since Imola in May and it was knife-edge all the way.\n\n“I knew of course it was going to be very tough to keep them behind. So it’s just playing like cat and mouse, DRS, battery usage,” he said as the large contingent of Dutch fans celebrated.\n\n“The whole race was within seven tenths, so I couldn’t afford to make big mistakes. I had one tiny lockup in the last corner, but apart from that it was, for us, a great result to keep them behind.\n\n“You have to drive over the limit of what’s possible. Tyre management goes out of the window. I did 15 qualifying laps to keep them behind on a track where tyre management is important.”\n\nPiastri had few real chances — close enough to hope but too far to make a move stick.\n\n“I tried my best to snake my way through the straights and not give too much of a tow but didn’t have enough straight-line speed and then obviously didn’t have enough speed for the next 15 laps either,” he said. “It is only a sprint, the main points are tomorrow, so pretty happy with it but a bit frustrated I couldn’t get past.”\n\nNorris was a further 0.661 adrift after losing third place to Leclerc on lap one and taking it back a few laps later.\n\n“I wasn’t going to get past anyone unless Oscar got past Max. They drove good races,” said the Briton. “I was hoping for a bit of battling but the Red Bull was too quick in the straight for us to catch up.”\n\nThe sprint was a disappointment for Mercedes, with George Russell 12th and Kimi Antonelli 17th.\n\nFerrari’s Lewis Hamilton also had a tough time, last year’s grand prix winner with Mercedes finishing a distant 15th after starting 18th.\n\nNeither of the Alpines were on the grid, with Franco Colapinto starting from the pit lane and Pierre Gasly entering the race two laps late after a water leak had to be fixed.\n\nNORRIS TAKES POLE\n\nNorris, chasing a third win in a row, later pipped Piastri to pole position for Sunday’s Grand Prix.\n\nThe Briton lapped the Spa-Francorchamps circuit in a best time of one minute 40.562 seconds with Piastri a mere 0.085 slower.\n\nLeclerc will start third and Verstappen qualified fourth.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688568c3ce585.jpg",
  "retrievedAt": "2025-08-17T21:28:38.343Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926806/verstappen-starts-new-red-bull-era-with-spa-sprint-win",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:21:55.000Z"
}
