{
  "title": "LHC advocates WhatsApp use to fix delays in criminal prosecutions - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Justice Muhammad Amjad Rafiq of the Lahore High Court has underlined the need for modernising communication methods within the criminal justice system.\n\nIn a judgment, the judge highlighted inefficiencies in the prosecution’s handling of case records and proposed the use of WhatsApp as a tool to streamline the process.\n\nThe judge noted that delays in providing case records to prosecutors often waste valuable judicial time.\n\nThe judge had taken notice of the situation during the hearing of a post-arrest bail petition, when he observed a female deputy prosecutor general attempting to collect the facts haphazardly to respond to the queries of the court.\n\nAsked by the court, the prosecutor said the record of the case had just been tabled before her in the court.\n\nBeing irked with the response and waste of precious time of the court, the judge had summoned the prosecutor general of Punjab.\n\nJustice Rafiq criticised the practice of physically transporting documents that could easily be shared electronically.\n\nTo address this issue, the judge directed the prosecutor general of Punjab to implement guidelines ensuring that police officers share detailed fact sheets and progress reports with prosecutors via WhatsApp or other approved electronic platforms at least one day prior to hearings.\n\nThe judge further instructed the prosecutor general to establish a mechanism for obtaining WhatsApp numbers of police officers responsible for producing records in court. These numbers are to be shared with prosecutors to facilitate real-time communication and ensure timely submission of case details.\n\nThe judge noted that this approach would save judicial time and enhance the effectiveness of prosecution efforts.\n\nJustice Rafiq highlighted the importance of prosecutors exercising their powers independently and in the public interest as mandated by the Punjab Criminal Prosecution Service Act, 2006.\n\nHe also highlighted the need for disciplinary action against any dereliction in adhering to these guidelines.\n\nSUMMONED: An anti-terrorism court has summoned the investigating officers and prosecution witnesses of alleged conspiracy of May 9 riots for cross-examination in two cases including the burning of Shadman police station.\n\nATC-I Judge Manzer Ali Gill conducted the hearing inside Kot Lakhpat Jail.\n\nThe defence concluded cross-examination of four prosecution witnesses in the police station attack case.\n\nSeparately, cross-examination of eight other prosecution witnesses was also conducted in a May 9 case of burning police vehicles near Jinnah House.\n\nThe defence lawyers completed cross-examination of a total of 12 prosecution witnesses.\n\nThe judge adjourned further proceedings of the jail trial till July 28.\n\nDuring the hearing, the attendance of detained accused including PTI Vice Chairman Shah Mehmood Qureshi and Punjab President Dr. Yasmin Rashid was marked.\n\nIn the Shadman police station attack case, 14 accused have been declared proclaimed offenders for not joining the hearing after securing bail.\n\nThe judge also adjourned the hearing of two other cases including the burning of police vehicles at Zaman Park till July 28.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:27:16.569Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926868/lhc-advocates-whatsapp-use-to-fix-delays-in-criminal-prosecutions",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T02:48:04.000Z"
}
