{
  "title": "Libya detains 1,500 undocumented migrant workers - World - DAWN.COM",
  "author": null,
  "content": "TRIPOLI: Libyan authorities detained on Saturday some 1,500 undocumented migrant workers in a raid on a neighbourhood housing them east of the capital Tripoli, a reporter saw.\n\n“Saturday’s inspections uncovered housing units where undocumented foreign workers were living,” Libyan labour minister Ali al-Abed, who was present during the raid, told reporters.\n\n“These workers, of various nationalities, had no residency permits, no official passports, and not even health records.” Libya has been gripped by conflict since the 2011 overthrow and killing of longtime ruler Moamer Qadhafi in a Nato-backed uprising.\n\nThe country remains split between Prime Minister Abdelhamid Dbeibah’s government based in Tripoli and a rival administration based in the east. With Italy some 300 kilometres (186 miles) away, Libya has become a key launchpad for tens of thousands of migrants who risk their lives at sea trying to reach Europe.\n\nThe area targeted in the sweep east of Tripoli housed makeshift encampments surrounded by high walls and a large gate. Hundreds of migrants — mostly Egyptians and sub-Saharan Africans — were said to have lived there. Inside the compound, a journalist saw a small grocery store, a butcher shop and vegetable vendors.\n\nThe labour minister said the site had “unregulated housing that fails to meet basic requirements for decent accommodation, health and workplace safety”.\n\nThe detained migrant workers will be “transferred to centres run by the Anti-Illegal Immigration Authority, and legal proceedings will be initiated against them according to national regulations”, Abed said.\n\nIt remained unclear whether the migrants would be immediately deported.\n\nEarlier this month, a European Union commissioner and ministers from Greece, Italy and Malta were in Libya to discuss irregular migration from the North African country.\n\nMigrants intercepted by Libyan authorities, including in international waters before reaching the Italian coast, are forcibly returned to Libya and held in detention under harsh conditions frequently condemned by the United Nations.\n\nPublished in Dawn, July 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/01100230912141a.png?r=100236",
  "retrievedAt": "2025-08-17T21:28:06.727Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926815/libya-detains-1500-undocumented-migrant-workers",
  "dateList": "2025-07-27",
  "date_published": "2025-07-27T00:22:02.000Z"
}
