{
  "title": "COVID-19: Pakistan extends travel restrictions from Category-C countries till May 4",
  "link": "https://www.app.com.pk/national/covid-19-pakistan-extends-travel-restrictions-from-category-c-countries-till-may-4/",
  "date_published": "2021-04-29T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP): Pakistan Civil Aviation Authority (PCAA) Thursday extended travel restrictions for international passengers arriving from 23 category-C countries till May 4, in line with the government strategy to stem the spread of deadly coronavirus (COVID-19) in the country.\n“International travel to Pakistan from category-C countries is restricted and only allowed as per guidelines of the NCOC (National Command and Operation Centre),” Aviation Division said in a brief press note.\nAccording to a list attached with the press note, Pakistan has placed South Africa, Botswana, Ghana, Kenya, Comoros, Mozambique, Zambia, Tanzania, Rwanda, Brazil, Peru, Colombia, Chile, Eswatini, Zimbabwe, Lesotho, Malawi, Seychelles, Somalia, Suriname, Uruguay, Venezuela and India in the Category-C list.\nAs per the anti-COVID protocols mentioned in previous official notifications for the Category-C countries, only Pakistanis, diplomatic passport holders and their families would be allowed to enter Pakistan under certain standard operating procedures (SOPs) including the 72-hour old PCR test before boarding a flight to Pakistan.\nWhereas, the passengers coming from 20 category-A countries including Australia, Bhutan, China, Fiji, Japan, Kazakhstan, Laos, Mongolia, Mauritania, Morocco, Myanmar, Nepal, New Zealand, Saudi Arabia, Singapore, South Korea, Sri Lanka, Trinidad and Tobago, Tajikistan and Vietnam, do not require COVID-19 PCR test before entry into Pakistan.\n“International travelers from the countries not specified in the category-A, require COVID-19 PCR test before commencement of travel to Pakistan (Max 72 hours old),” the Aviation Division said while explaining the Category-B list.\nIt said that all countries not specified in categories A&C fell in category B.\nOn Thursday, the national tally of total active corona cases reached 89,838 with 5,480 new cases tested positive, while 151 corona patients died during the pasting 24 hours.",
  "retrievedAt": "2025-08-11T20:40:32.797Z"
}
