{
  "title": "Qureshi lauds Germany’s efforts to provide COVID vaccine at earliest",
  "link": "https://www.app.com.pk/national/qureshi-lauds-germanys-efforts-to-provide-covid-vaccine-at-earliest/",
  "date_published": "2021-04-29T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Thursday received German counterpart Heiko Maas here wherein he thanked the German side for its efforts to ensure earliest possible provision of vaccine through the COVAX initiative.\nIn a meeting held during the brief visit of German foreign minister, Foreign Minister Qureshi recalled his own recent visit to Berlin and expressed gratitude for the warm welcome accorded to him and appreciated the fruitful outcome of the visit.\nHe underlined the importance of regular high-level exchanges between Pakistan and Germany and maintaining a steady upward trajectory in the relationship.\nThe two foreign ministers reviewed bilateral cooperation and exchanged views on the impacts of COVID-19 pandemic.\nFM @SMQureshiPTI received German FM @HeikoMaas today, during his brief visit to Islamabad. FM underlined the importance of regular high-level exchanges between - & maintaining steady upward trajectory in the relationship.1/3@GermanyDiplo@PakinGermany_#GermanFMinPakistan pic.twitter.com/shNwnKZbxa\n— Spokesperson  MoFA (@ForeignOfficePk) April 29, 2021\nForeign Minister Qureshi underscored the importance of enhancing mutual cooperation, and collaboration to combat the pandemic in a holistic manner.\nHe apprised his German counterpart on Pakistan’s steadfast support for a peaceful and stable Afghanistan and positive contributions to the Afghan peace process.\nQureshi underscored the importance of responsible withdrawal and steady progress by the Afghan parties towards a negotiated political settlement. He added that all efforts must be made for reduction of violence leading to ceasefire.\nThe Foreign Minister stressed that the Afghan stakeholders must engage constructively to work out an inclusive, broad-based and comprehensive political solution, through an Afghan-owned and Afghan-led process.\nCautioning against the role of ‘spoilers’, the foreign minister also underlined the importance of commitment and perseverance in the efforts for peace.\nQureshi underscored that peace in Afghanistan would yield other significant dividends including enhanced trade and regional connectivity.\nHe also highlighted Pakistan’s shifting focus from geo-politics to geo-economics, within the perspective of economic security paradigm.\nPakistan and Germany enjoy cordial relations based on shared interests. The two foreign ministers have regularly been interacting bilaterally as well as at the international fora.\nThe year 2021 marks the 70th anniversary of establishment of diplomatic relations between Pakistan and Germany. A range of events are envisaged by the two governments to celebrate this milestone in a befitting manner.",
  "retrievedAt": "2025-08-11T20:40:29.646Z"
}
