{
  "title": "PM not to change accountability process for any individual: Governor Ismail",
  "link": "https://www.app.com.pk/national/pm-not-to-change-accountability-process-for-any-individual-governor-ismail/",
  "date_published": "2021-04-29T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP): Sindh Governor Imran Ismail Thursday said Prime Minister Imran Khan, who had a strong commitment towards rule of law and fair play, would never change the process of ‘across the board accountability’ for any individual based on personal relations.\n“We all, who have worked in close association with the PM, know very well that he will not change the across the board accountability process for anyone,” he said while talking to media along with Minister for Information and Broadcasting Chaudhry Fawad Hussain here.\nThe governor said in categorical terms that the PM could never compromise and show flexibility on the matters related to loot and plunder of national wealth and accountability of corrupt elements, come what may.\nImran Ismail said he had a private meeting with the premier yesterday and found him saddened over the allegations levelled against Jehangir Tareen, which were being probed by the departments concerned.\nHe was of the view that Jehangir Tareen had been one of the closest aides of the PM, and both of them enjoyed exemplary affection with each other.\nHe said Jehangir Tareen would face the allegations and inquiries courageously.\nThe governor said the PM had  given a task to Senator Ali Zafar to look into the reservations of some of the Members National Assembly MNAs), who called on him to convey their recommendations over Jehangir Khan Tareen issue. Senator Ali Zafar would compile a report after taking into consideration all aspects and submit it to the party’s top leadership.\nHe said Jehangir Tareen had also reposed confidence in Senator Ali Zafar due to his professional capabilities and repute.\nImran Ismail said he believed that Jehangir Tareen and his companions were well-wishers of the party, adding their reservations were being removed and prayed for Jehangir Tareen’s coming clean out of the allegations.\nHe said the government, under the dynamic leadership of the PM, was focusing on improving and strengthening the national economy.\nHe said the country’s exports and foreign exchange reserves had witnessed a substantial increase due to effective policies of the government despite the economic slowdown caused by the conronavirus pandemic worldwide.\n“Pakistan’s economic condition is improving day-by-day and we don’t want any kind of disturbance in it,” he said, adding Pakistani rupee had gained strength against the dollar and the country’s stock exchange was now considered among the top performers in the world.\nHe said Pakistan wanted good ties with the world community especially neighbouring countries and every Pakistani was duty-bound to highlight the country’s peace-loving image.\nThe governor said it was the right time to have good relations with neighbouring countries and especially when international troops would be withdrawing from Afghanistan.\nHe expressed confidence that coming days would prove the best for Pakistan, its people and economy. But unfortunately, all these positive happenings were not being digested by the opposition parties, he remarked.\nImran Ismail said the opposition parties were afraid of the government’s mega development and public welfare projects as these were going to bury their negative and propaganda politics forever.\nHe said the coronavirus pandemic had badly affected the world economy and all countries were facing inflation issue.\nThe PTI government, he said, was making utmost efforts to protect the people from the effects of economic slowdown and inflation issue, hoping that the new finance team under the supervision of Shaukat Tarin could soon overcome it.\nHe said the government was preparing a comprehensive strategy to provide edibles to the common man at reduced and controlled rates.\nEarlier, the governor held a meeting with Chaudhry Fawad Hussain and congratulated him on assuming the charge as Minister for Information and Broadcasting for the second time.\nHe said Fawad had been reassigned the portfolio due to his capabilities to project the government’s achievements, mega-development and public welfare projects in more efficient manner.\nHe said Fawad had also performed very well in the Ministry of Science and Technology where he encouraged new initiatives and innovative endeavors, but his services were much-needed in the field of media by the Prime Minister.",
  "retrievedAt": "2025-08-11T20:40:37.156Z"
}
