{
  "title": "Hammad Azhar visits PPIB, takes briefing",
  "link": "https://www.app.com.pk/national/hammad-azhar-visits-ppib-takes-briefing/",
  "date_published": "2021-04-29T17:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP): Federal Minister for Energy Hammad Azhar Thursday visited Private Power and Infrastructure Board (PPIB) and took complete briefing about the function of PPIB.\nThis was his first visit to PPIB after assuming charge of the Ministry where he was warmly welcomed by PPIB Managing Director Shah Jahan Mirza alongwith other senior officials, said a press release.\nIn a detailed presentation, Shah Jahan Mirza briefed the minister about PPIB’s functions, achievements and future endeavors.\nThe minister was briefed that PPIB is the pioneer institution of the GoP for successfully inducting private capital in power sector of Pakistan and one of the key players of the power sector.\nPPIB has captured various success stories in successive rounds of power policies announced from time to time. As a result, since its inception PPIB has materialized 40 IPPs of more than 17550 MW in the country worth around US$ 20 billion. These IPPs are based on multiple fuels/technologies.\nIt was briefed that for promoting indigenous resources, for the very first time in the energy history of the country hydro and Thar coal based IPPs are being established.\nIn this regard, PPIB has already been instrumental in achieving historical breakthrough in the energy history of Pakistan whereby the country’s coal reserves at Thar are being developed having coal mining and power generation projects of which 660 MW Engro Power Project has already been completed and supplying electricity to the national grid while another three projects of 1320 MW are under construction.\nSimilarly, for generating eco–friendly and cheap electricity, two large size hydropower IPPs namely 720 MW Karot and 884 MW Suki Kinari are at advance stages of construction work which are likely to be completed during December 2021 and December 2022 respectively.\nwhile Pakistan’s largest private sector hydropower project namely 1124 MW Kohala alongwith 700 MW Azad Pattan are under advance stages of achieving Financial Closing. Recently both these IPPs have successfully executed project agreements which are amongst one of the pre-requisites for achieving Financial Close.\nDevelopment of hydropower projects would bring several indirect benefits which include but not limited to creation of employment opportunities, development of allied infrastructure and industry, boosting agriculture industry through smooth supply of electricity and water, flourishing tourism activities in the area, initiation of community welfare programs under Corporate Social Responsibility (CSR) which include opening of schools, vocational training institutions, hospitals/dispensaries.\nPakistan’s first private sector Matiari-Lahore HDVC Transmission Line project which is also a hallmark project of PPIB is being processed under the framework of CPEC and set to be functional by September 2021.\nIt was briefed that PPIB is processing largest chunk of energy chapter under CPEC out of which four projects of 4620 MW have already been completed while remaining nine projects of more than 7000 MW are at different stages of processing, majority of which are under construction or about to enter construction activities.\nWhile highlighting future plans, MD PPIB stated that PPIB is handling a diversified portfolio of 22 IPPs of more than 12000 out of which fourteen projects of 6175 MW are hydropower projects while six IPPs of 4290 MW are based on Thar coal.\nIt was apprised to the Minister that PPIB is targeting to complete seven projects of more than 5500 MW till the end of next year inspite of COVID-19 situation worldwide, which can hamper the process.\nThese include two hydropower IPPs of more than 1600 MW, four Thar coal based IPPs of 2640 MW and one RLNG based project of 1263 MW.\nPPIB is according equal importance to induct more private capital in transmission line sector for which extensive efforts are being made. As envisioned by the GoP under ease of doing business initiative, work on the merger of AEDB into PPIB is in full swing for processing power projects of all technologies including alternative and renewable energy projects at one door step.\nThe minister expressed his gratitude over thorough briefing extended by MD PPIB and lauded the efforts of PPIB for its past achievements and the current efforts being made for developing the power sector.\nThe minister assured his full support and guidance to PPIB and urged it to work more diligently and keep providing expert facilitation to the investors so that they are able to invest in this sector more confidently.",
  "retrievedAt": "2025-08-11T20:40:31.814Z"
}
