{
  "article_id": "2025-06-29_ee172c69527e2923dba893d82543cfd6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-lauds-security-forces-for-successful-operation-against-fitna-e-hindustan-terrorists-in-duki/",
    "retrieved_at": "2025-08-27T16:36:50.868Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi lauds security forces for successful operation against ‘Fitna-e-Hindustan’ terrorists in Duki",
    "author": null,
    "date_published": "2025-06-29T13:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 287,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 29 (APP):Federal Interior Minister Mohsin Naqvi has commended the security forces for conducting a successful counter-terrorism operation in the Duki district of Balochistan, resulting in the elimination of two militants affiliated with the group referred to as \"Fitna-e-Hindustan.\" In an official statement on Sunday, the minister praised the \"exceptional professionalism and bravery\" demonstrated by the security personnel during the operation. \"Our forces have once again proven their unmatched commitment to the safety and sovereignty of the country by sending two terrorists of Fitna-e-Hindustan to hell,\" he stated. The operation, details of which remain classified for security reasons, is said to have been executed with precision intelligence and swift ground response. It is part of an ongoing crackdown on extremist elements believed to be operating with foreign backing and seeking to destabilize the region. The interior minister saluted the dedication of the troops involved, adding, \"We pay tribute to the courageous young men of our security forces who risk their lives to protect the homeland. Their resolve and sacrifice are the backbone of our national defense.\" He further emphasized the government's determination to root out terrorism, declaring, \"We will not rest until every last terrorist linked to Fitna-e-Hindustan is eliminated. This is a war we must win - and we will, at all costs.\" Reaffirming national unity against terrorism, the interior minister added, \"The entire nation stands shoulder to shoulder with our security forces in this fight. We are united in our mission to cleanse Pakistan of all agents of chaos and destruction.\" The Ministry of Interior has not yet disclosed the identities of the neutralized militants but confirmed that the operation was based on credible intelligence about a planned attack in the region, he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}