{
  "article_id": "2025-06-29_6be8e4ee497d2f6451db78d35a4b215e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bisp-chief-pays-tribute-to-swats-hero-hilal-khan/",
    "retrieved_at": "2025-08-27T16:36:00.525Z"
  },
  "metadata": {
    "title": "BISP chief pays tribute to Swat’s Hero, Hilal Khan",
    "author": null,
    "date_published": "2025-06-29T16:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 318,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 29 (APP):In a heartfelt gesture recognizing extraordinary courage, Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid, visited Swat on Sunday to honour Hilal Khan - the brave young man who risked his life to save drowning tourists during the recent Swat River tragedy. The visit was made on the special instructions of President Asif Ali Zardari and Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto Zardari. Just two days ago, a devastating incident unfolded in Swat when 14 members of a tourist family from Sialkot were swept away by a sudden surge in the river while having breakfast near its banks. Official rescue teams arrived too late, but Hilal Khan, undeterred and selfless, jumped into the river using a makeshift boat to save lives. He succeeded in rescuing survivors and later helped retrieve the bodies of the victims, returning them to their grieving families. \"Hilal Khan is the true face of humanity,\" said Senator Rubina Khalid during her visit. \"He did not wait for recognition or orders - he simply acted. His bravery is not just inspiring, it is a reminder of the spirit that binds us as a nation.\" She said that both President Zardari and Chairman Bilawal Bhutto were deeply moved by Hilal's act of heroism and instructed her to personally meet him, commend his efforts, and assess how the PPP-led Sindh Government could support such local volunteer initiatives in Swat. In recognition of his courage, Senator Rubina Khalid announced that the Sindh Government would provide necessary rescue equipment and training support for local volunteers. As a token of personal appreciation, she also handed over Rs. 100,000 from her own funds to Hilal Khan for the purchase of basic rescue tools. \"This is just a small step,\" she said. \"We must build systems that empower local heroes like Hilal. Their courage saves lives - they deserve not just applause, but real support.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}