{
  "article_id": "2025-06-29_25de0be1705082d9e05c128dccffd372",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-plant-nursery-works-overtime-to-beautify-islamabad-with-diverse-plant-species/",
    "retrieved_at": "2025-08-27T16:37:16.716Z"
  },
  "metadata": {
    "title": "CDA Plant Nursery works overtime to beautify Islamabad with diverse plant species",
    "author": null,
    "date_published": "2025-06-29T07:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 257,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 29 (APP):The Capital Development Authority (CDA) Plant Nursery is striving hard to produce a wide variety of plants and flowers to give the federal capital, Islamabad, a beautiful atmosphere. With a vast collection of tree and fruit plant species, the nursery is working tirelessly to enhance the city's aesthetic appeal. Muhammad Ismail, an official said, the nursery boasts an impressive array of plants, including Kachnar, Amaltas, Arjun, Patagen, Beschufia, Such Chain, Reetha, Jacaranda, Gravillia, Kanak Champa, Gab, Michillia, Sepium, Chir, Deraek, Bakion, Budda Tree, Siltus Tun, Bottle Brush, Shareen, Black Shareen, White Aritia, Alstonia, Shahtoot, Tabebuia, Sterculia, Acer, Brachychiton, Dhak, Shisham, Moringa, Fiddle wood, Gul-e-Nishter, Willow, Popular, Chinar, Cazorena, Magnolia Grandiflora, Pilkan, Rubber Plant, and various fruit plants like Gava, Louqat, Jaman, Khatti, Annar, Anjeer, Apricot, Peach and Batangi. In addition to these, the nursery also features a range of flowering plants, including Cassia, Gulacca, Saru Moor, Pankh Parken, Sonia Erithinia, Crystagali, Termenilea, Sophora, Legistromia, Habiscus, Mirch Samocus, Nagra Jatropha, Chandna Chandni, Home Sokdia, Caryaptus, Rat Ki Rani, and many more. The CDA Nursery is also home to a variety of ornamental plants, such as Yucca, Hemia Hamelia, Patten Suranga, Legestrum, Gardenia, Euphorbia, Gul-e-Chin, Kanair, Lantana, Badliya, Rose creeper, Passiflora, Bouqainvillea, Star Jasmin, Ranqoon Creeper, Wisteri Creeper, Tecoma, Compensation Honey Suckle, Schefflera, Ficus, Juniper, Pittosporum, Euonymus, and Dracaena. The nursery's efforts are aimed at beautifying the city and providing a pleasant environment for its residents. With its vast collection of plant species, the CDA Nursery is playing a vital role in enhancing Islamabad's natural beauty.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}