{
  "title": "Govt. transforms PTV into profit-earning entity: Farrukh",
  "link": "https://www.app.com.pk/national/govt-transforms-ptv-into-profit-earning-entity-farrukh/",
  "date_published": "2021-11-10T18:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Wednesday informed the Senate that the Pakistan Tehreek-i-Insaf (PTI) government has given direction to the Pakistan Television (PTV) to come out from the financial loss and transformed it into a profit-earning entity.\n“When the PTI government came into power in 2018, the PTV’s loss was Rs 451 million. We, during the last three years took corrective measures and made timely interventions to improve performance of the state television. Now, it is in profit of Rs 1.3 billion,” he said while responding to a supplementary question during the question-hour session.\nThe minister said, previous governments of Pakistan Peoples’ Party and Pakistan Muslim League-Nawaz, during 2008-2018, made around 2,000 political appointments in the PTV and put the national institution in financial crisis.\n“From inception of PTV to the year 2018, there were around 2000-2200 employees in the state television. The previous governments of PPP and PML-N in just a period of 10 years, made around 2,000 more appointments in the organization,” he said.\nContrary to it, he said the PTI government, during its last three years, appointed just 61 employees that too on merit and in a transparent manner.\nElaborating on the corrective measures, Farrukh Habib said the government introduced modern technologies in the PTV to improve its efficiency and stopped irregular expenditures.\nThe minister said the PTV had collected Rs 8,109.399 million during the last financial year (2020-21 provisional) on account of television fee charged through electricity bills.\nResponding to another question, Farrukh Habib said the annual book of performance, achievement of Ministry of Information and Broadcasting and its attached departments for the Years 2018-2019 and 2019-2020 had been uploaded on the Ministry’s website.\nHowever, the compilation of annual book for the year (2020-2021) was underway and data was being collected from the departments of the Ministry to upload at the earliest.",
  "retrievedAt": "2025-08-11T21:35:15.059Z"
}
