{
  "title": "Dr. Sania releases informational video on Ehsaas Rashan Riayat Program",
  "link": "https://www.app.com.pk/national/dr-sania-releases-informational-video-on-ehsaas-rashan-riayat-program/",
  "date_published": "2021-11-10T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 10 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar has released an informational video on the Ehsaas Rashan Riayat program for public awareness.\nThe video highlighted the information for Kiryana merchants and low income groups about the procedure of participation in the program, eligibility criteria and benefits.\nLow-income households and Kiryana merchants can register themselves by visiting this registration portal http://ehsaasrashan.pass.gov.pk.\nOnly one application can be made from each household, so each household has to select one member of their household and enter his or her Computerized National Identity Card and mobile phone number as only a registered household member can avail discounted grocery items from the Kiryana shops.\nThe buyers must ensure that their mobile phone and SIM are registered on their CNIC.They will receive a message regarding eligibility from 8171 within four weeks from the time of start of registration process.\nThe Kiryana merchants can also register on this website. The government has announced a special package for them under which they would be given attractive profit.\nIn addition, cars, motorcycles, mobile phones and other valuable prizes will be awarded every three months on the basis of best performance.\nTo participate in this program, the grocery shopkeeper must have a bank account and if the grocery owner does not have a bank account, contact the nearest branch of National Bank of Pakistan immediately.\nOnce both the grocery owners and the household are registered, the eligible family member will be able to take their CNIC card and mobile phone and get a discount on the purchase of specific grocery items.The government has started this program for 20 million families.",
  "retrievedAt": "2025-08-11T21:35:11.236Z"
}
