{
  "title": "Karachi police arrest DHA woman for allegedly murdering her two young children - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Karachi police arrested a 37-year-old woman on Thursday who allegedly slaughtered her two young children in Defence Housing Authority (DHA).\n\n“A lady killed her two children, who were eight and four years old, with a sharp knife due to a marital issue with her husband,” South Deputy Inspector General (DIG) Syed Asad Raza told Dawn.com, adding that police arrested the suspect and seized the murder weapon.\n\nHe added that the children’s bodies were recovered from a house on 10th Street off Khayaban-i-Mujahid with their throats slit.\n\n“The suspect sent pictures to her ex-husband after killing the children,” he said, adding that the father then called the police. However, both children were found murdered when Darakhshan police arrived at the residence.\n\n“The bodies were taken to Jinnah Postgraduate Medical Centre for legal formalities,” DIG Raza said.\n\nPolice surgeon Dr Summaiya Syed told Dawn.com that the children’s throats were slit, which damaged vital structures and vessels in the neck, leading to their death. “Swabs have also been collected to rule out sexual violence,” she added.\n\nA passerby told Dawn.com that a large group of police personnel, media persons and an ambulance were gathered outside the residence earlier today.\n\n“I passed by a house and there were loads of cops, an Edhi ambulance and a DSNG of some channel … on the road that leads to Bahria,” she said.\n\n“On the way back, there was one cameraman and another person still there. I asked them what happened. They said some woman murdered her two small children, had a mental disorder and was getting divorced or something.”\n\nDIG Raza said that the suspect and her husband divorced last year. “The custody of the children was contested in court, which ruled in favour of the father,” he stated. “However, the mother was allowed to meet her children. On Wednesday night, the children stayed at her home in DHA, where she allegedly slaughtered them.”\n\nThe DIG said that the children’s father told police that the suspect was “emotionally disturbed” and that he had been financially supporting her.\n\nDuring the initial probe, he said, it was found that the suspect met her husband in Karachi in 2012 and they subsequently married.\n\n“The suspect enrolled at an institute in Karachi affiliated with a British university, but she did not graduate,” DIG Raza outlined. “She sometimes did minor jobs in the metropolis, but she had no regular employment.”\n\nDIG Raza said that in her initial statement before investigators, the suspect stated she did not want to defend herself as there was “nothing logical or reasonable enough for the murder”.\n\n“She said she woke up between 8:30 and 9am and saw her children having breakfast with her mother,” he explained. “She contacted her ex-husband, but she did not elaborate as to what transpired during their phone calls.\n\n“She claimed that the children were telling her ‘to send them somewhere where they could not face such a situation, which she (the mother) was facing’,” he added\n\nThe DIG said that when asked whether her children were facing an “undesirable attitude” from their father, she did not elaborate.\n\n“The woman admitted that she was taking medicines to treat psychiatric issues,” he said, adding that police suspected that she might be under the influence of drugs.\n\nAs many as 3,364 child abuse cases were reported from all four provinces, the Islamabad Capital Territory, Azad Jammu and Kashmir, and Gilgit-Baltistan in the year 2024, according to a civil society report.\n\nThe report Cruel Numbers 2024 by Sahil was prepared based on data collected from 81 national and regional newspapers across the country.\n\n“The objectives of the report is to present the data on the situation regarding violence against children (up to 18 years) in cases of sexual abuse, abduction/kidnapping, missing children, and child marriages,” it read.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:37:19.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930880/karachi-police-arrest-dha-woman-for-allegedly-murdering-her-two-young-children",
  "dateList": "2025-01-11",
  "date_published": "2025-08-14T16:49:37.000Z"
}
