{
  "title": "TikTok warns of broader consequences if US Supreme Court allows ban - World - DAWN.COM",
  "author": null,
  "content": "The lawyer for TikTok and its Chinese parent company ByteDance offered a warning during Supreme Court arguments over a law that would compel the sale of the short-video app or ban it in the United States: If Congress could do this to TikTok, it could come after other companies, too.\n\nThe law, which was the subject of arguments before the nine justices on Friday, sets a Jan 19 deadline for ByteDance to sell the popular social media platform or face a ban on national security grounds. The companies have sought, at the very least, a delay in implementation of the law, which they say violates the US Constitution’s First Amendment protection against government abridgment of free speech.\n\nNoel Francisco, representing TikTok and ByteDance, argued that Supreme Court endorsement of this law could enable statutes targeting other companies on similar grounds.\n\n“AMC movie theaters used to be owned by a Chinese company. Under this theory, Congress could order AMC movie theaters to censor any movies that Congress doesn’t like or promote any movies that Congress wanted,” Francisco told the justices.\n\nThe justices signaled through their questions during the arguments that they were inclined to uphold the law, although some expressed serious concerns about its First Amendment implications.\n\nTikTok is a platform used by about 170 million people in the United States, roughly half the country’s population. Congress passed the measure last year with overwhelming bipartisan support, as lawmakers cited the risk of the Chinese government exploiting TikTok to spy on Americans and carry out covert influence operations.\n\nJeffrey Fisher, the lawyer representing TikTok content creators who also have challenged the law, noted during the Supreme Court arguments that Congress with this measure was focusing on TikTok and not major Chinese online retailers including Temu.\n\n“Would a Congress (that is) really worried about these very dramatic risks leave out an e-commerce site like Temu that has 70 million Americans using it?” Fisher asked. “It’s very curious why you just single out TikTok alone and not other companies with tens of millions of people having their own data taken, you know, in the process of engaging with those websites and equally, if not more, available to Chinese control.”\n\nDemocratic President Joe Biden signed the measure into law and his administration is defending it in this case. The deadline for divestiture is just one day before Republican Donald Trump, who opposes the ban, takes office as Biden’s successor.\n\nSolicitor General Elizabeth Prelogar, arguing for the Biden administration in defending the law, said it was crucial that it take effect on Jan 19 as scheduled in order to force ByteDance to act on divestiture.\n\n“Foreign adversaries do not willingly give up their control over this mass communications channel in the United States,” Prelogar said.\n\n“When push comes to shove, and these restrictions take effect, I think it will fundamentally change the landscape with respect to what ByteDance is willing to consider. And it might be just the jolt that Congress expected the company would need to actually move forward with the divestiture process,” Prelogar said.\n\nIf the ban takes affect on Jan 19, Apple would no longer be able to offer TikTok for downloads for new users but existing users could still access the app.\n\nThe US government and TikTok agree that app would degrade and eventually become unusable over time because companies would not be able to offer supporting services.\n\nThe Supreme Court also debated whether the possibility of TikTok being used for covert influence campaigns or propaganda purposes by China justified the banning it.\n\n“Look, everybody manipulates content,” Francisco told the court. “There are lots of people who think CNN, Fox News, the Wall Street Journal, the New York Times are manipulating their content. That is core protected speech.”\n\nTrump on Dec 27 urged the court to put a hold on the Jan 19 deadline to give his incoming administration “the opportunity to pursue a political resolution of the questions at issue in the case.”\n\nUnder the law, the US president has the power to extend the Jan 19 deadline for 90 days, but under circumstances that do not appear to apply to the current situation in which ByteDance has made no apparent effort to sell TikTok’s US assets. The law mandates that the president certify that significant progress has been made toward a sale, with binding legal agreements.\n\nRegardless, Trump does not become president until after the deadline — though Francisco said “we might be in a different world” once Trump is back in the White House.\n\nJustice Brett Kavanaugh asked Prelogar whether the president could “say that we’re not going to enforce this law?”\n\n“I think as a general matter, of course the president has enforcement discretion,” Prelogar said.\n\n“Again, that’s one of the reasons why I think it makes perfect sense to issue a preliminary injunction here and simply buy everybody a little breathing space,” Francisco said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:36:37.911Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884517/tiktok-warns-of-broader-consequences-if-us-supreme-court-allows-ban",
  "dateList": "2025-01-11",
  "date_published": "2025-01-11T12:38:27.000Z"
}
