{
  "title": "As LA burns, criticisms and questions about response arise - World - DAWN.COM",
  "author": null,
  "content": "The speed and intensity of the blazes ravaging Los Angeles this week have put its firefighting infrastructure to the test — and given rise to questions and criticism surrounding preparedness.\n\nHydrants ran dry in the Pacific Palisades neighbourhood as it was ravaged by one of the region’s five separate fires, while water shortages additionally hampered efforts elsewhere.\n\n“We need answers to how that happened,” California Governor Gavin Newsom wrote in a letter to the heads of the Los Angeles Department of Water and Power and the Los Angeles County Public Works.\n\nCalling the lack of water and water pressure “deeply troubling,” Newsom directed state officials to prepare an independent report on the causes.\n\nChris Sheach, assistant professor of disaster management at Paul Smith’s College in New York state, told AFP part of the problem is that the city’s fire-fighting infrastructure wasn’t designed for enormous multi-acre conflagrations.\n\n“Their system is built to fight individual house fires,” he said, or for “responding to commercial or residential structure fires.”\n\nThe amount of water used for one building compared to the amount needed to squelch a fire burning across thousands of acres is quite different, he added.\n\nEarly firefighting efforts created four times the normal demand for water over approximately 15 hours, Janisse Quinones, CEO and chief engineer at the city’s water department, told the New York Times.\n\nApart from that, Los Angeles fire chief Kristin Crowley has said her city is hampered by a lack of resources.\n\n“I have, over the past three years, been clear that the fire department needs help. We can no longer sustain where we are,” she told CNN on Friday, explaining the necessity for more staff, resources and funding.\n\nShe said this included the need for 62 new fire stations amid a 55 per cent increase in call volume since 2010.\n\nUS president-elect Donald Trump, who returns to the White House in just over a week, has seized upon the drama to attack Democrats, launching a series of evidence-free broadsides accusing Governor Newsom of a variety of failings.\n\nHe has even tried to blame a lack of water on environmentalists’ efforts to protect the smelt — a small fish that lives hundreds of miles away from the fires.\n\n“The fact that we have such a low number of fatalities despite the massive property losses is a testament to the work of fire chiefs and government officials who have been timely,” Sheach, the professor, said.\n\nThe fires have so far destroyed around 10,000 buildings, California’s fire agency reported, while the Los Angeles County medical examiner’s office has put the death toll at 11.\n\nCalifornia firefighters “are some of the best firefighters in the world.\n\nThey do this so often,“ Sheach said, adding that they were better trained than in most other localities because “it’s their reality.” How can a city like Los Angeles be better prepared in the future? And would it mean hiring more firefighters or increasing water supply?\n\n“Those are decisions that politicians have to work with with their community because what’s right for each community is going to be up to how much they’re willing to pay,” Sheach said.\n\nDecreasing risk means spending more money, he explained, calling the situation a giant “risk-reward decision.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/111823421ba0710.jpg",
  "retrievedAt": "2025-08-26T07:36:36.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884521/as-la-burns-criticisms-and-questions-about-response-arise",
  "dateList": "2025-01-11",
  "date_published": "2025-01-11T13:29:54.000Z"
}
