{
  "title": "Four injured in Chaman blast, Levies post torched in Mastung - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: At least four people were injured in an IED explosion in Chaman, unknown armed men set a Levies post on fire in Mastung, and an assistant commissioner narrowly escaped a bomb attack in Khuzdar on Friday.\n\nAccording to officials, a powerful explosion occurred in the Station Road area of Chaman, a town near the Afghan border, in the afternoon as a Frontier Corps truck was passing through the area. Police said unknown people had planted the improvised explosive device on a motorcycle, which was parked on Station Road to target the FC truck carrying security personnel.\n\nThe FC truck survived the blast, as the explosion occurred after the truck had passed the point where the IED-laden motorcycle was parked. As a result of the blast, four people who were passing through the area at the time were injured.\n\n“We have received four injured at the hospital, one of whom is in serious condition,” said officials at Chaman District Hospital, adding that the seriously injured person would be transferred to Quetta.\n\n“The IED planted on the motorcycle was detonated by remote control,” a senior police officer told Dawn. The banned Tehreek-i-Taliban Pakistan (TTP) claimed responsibility for the attack.\n\nLevies post torched\n\nUnknown armed men set fire to a Levies post in the Dasht area of Mastung district and stole official weapons, officials said on Friday.\n\nAccording to the officials, the armed men blocked the Quetta-Sibi Highway in the Kolpur area between Thursday night and Friday and started checking vehicles passing through the area. They continued to search both vehicles and passengers travelling along the highway.\n\nSources said the armed men stayed on the highway for some time before moving to the Dasht area, where they attacked a Levies check post. After snatching weapons from the Levies personnel, they set the post on fire. At the time of the attack, only three Levies personnel were present at the post.\n\nReports suggested that the armed men entered a nearby cement factory and set its machinery on fire.\n\nAttack on assistant commissioner\n\nIn a separate incident, an attempted bomb attack took place in the Zehri area of Khuzdar district, targeting the vehicle of the assistant commissioner.\n\nAccording to officials, unknown assailants tried to target the Zehri assistant commissioner’s vehicle in the Showki area. He was returning from a visit to the area when an IED was detonated remotely. However, he remained unharmed.\n\nJust two days ago, armed militants launched a brazen attack on the main bazaar in Zehri, violently setting fire to multiple government buildings, including Levies Force station, Nadra and municipal committee offices and a bank, after seizing control of the area.\n\nPublished in Dawn, January 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/110820430b1d2ee.png",
  "retrievedAt": "2025-10-12T00:48:17.762Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884395/four-injured-in-chaman-blast-levies-post-torched-in-mastung",
  "dateList": "2025-01-11",
  "date_published": "2025-01-11T01:52:49.000Z"
}
