{
  "title": "Over 200 licences suspended as lawyers elect new LBA body today - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The stage is all set to elect the new cabinet of Lahore Bar Association (LBA) on Saturday (today) for year 2025-26, with licences of over 200 lawyers suspended over alleged horse-trading.\n\nApart from the candidates of the two traditional rival groups — professional and independent, two independent candidates are also vying for the top slot of the president this year.\n\nInterestingly, all four candidates for the presidency are sitting members of the Punjab Bar Council (PbBC), the provincial regulatory body of lawyers.\n\nMubashir Rehman Chaudhry is in the run as a candidate of the Hamid Khan-led professional group, while Mian Faiz Ali is representing the independent, famously known as Asma Jahangir group. Adeeb Aslam Bhindar and Irfan Hayat Bajwa are vying for the post as independent candidates.\n\nAs many as 14,712 voters would exercise their right to vote in the polling to be held under the supervision of LBA election board chairman Chaudhry Imran Masood.\n\nEarlier, the PbBC declared over 200 lawyers ineligible to cast their votes in the LBA election by suspending their licences on the allegation of buying votes of the members. The suspended lawyers also include women members of the bar.\n\nSix candidates will compete for the two positions of vice president, with three each contesting from the Model Town and Cantonment courts.\n\nSimilarly, for the two secretary positions, six candidates are in the race are Junaid Haider Ansari, Shoaib Ashraf Bhatti, Malik Sharjeel Khokhar, Malik Fahad Nisar Khokhar, Naseer Bhulla and Waqar Khan.\n\nThe joint secretary post will see a contest among three candidates including Samina Basra, Shujaat Ali Khan and Shakil Ishaq Khan. Similarly, three candidates will face off for the position of finance secretary.\n\nFor the position of library secretary, three candidates, including a female contender, Samina Khokhar, are competing.\n\nFor the auditor position, Raheela Hafeez Rana and Prof Attique Ahmed Khan are in the run.\n\nPublished in Dawn, January 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:48:02.384Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884424/over-200-licences-suspended-as-lawyers-elect-new-lba-body-today",
  "dateList": "2025-01-11",
  "date_published": "2025-01-11T01:52:55.000Z"
}
