{
  "title": "President Alvi, Pervaiz Khattak test positive for Covid-19",
  "link": "https://www.app.com.pk/national/president-alvi-tests-positive-for-covid-19/",
  "date_published": "2021-03-29T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): President Dr Arif Alvi and Minister for Defence Pervaiz Khattak have tested positive for Covid-19.\nوَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِاور جب میں بیمار ہوتا ہوں تو وہی شفا دیتا ہے\nمیرا کورونا ٹیسٹ مثبت آیا ہے۔ اللّٰہ کورونا سے متاثر لوگوں پررحم فرمائے۔ میں نے کورونا ویکسین کی پہلی ڈوز لگوائی لیکن اینٹی باڈیز دوسری خوراک کے بعد بننا شروع ہوتی ہیں۔ براۓ مہربانی احتیاط جاری رکھیں۔\n— Dr. Arif Alvi (@ArifAlvi) March 29, 2021\n“I have tested positive for Covid-19. May Allah have mercy on all Covid affectees. Had 1st dose of vaccine but antibodies start developing after 2nd dose that was due in a week. Please continue to be careful,” the President said in a tweet posted on his social media account.\nBegum Samina Alvi, wife of President Alvi, said she had her test done too, was negative and quarantining.\nAbout President Alvi she said that he had mild symptoms but was in good spirit.\n“Alhamdulillah President @ArifAlvi has mild symptoms but is in good spirits,” Begum Samina Alvi said on twitter.\nالحمدللہ۔ صدر @ArifAlvi کو درمیانے درجے کی علامات ہیں لیکن وہ پرعزم ہے۔ میرا بھی کورونا ٹیسٹ ہوا مگر منفی آیا اور قرنطینہ میں ہوں۔ ہم نے ویکسین کی پہلی خوراک لگوائی مگر مدافعت بننے میں وقت لگتا ہے اور میں سب سے ویکسین لگوانے اور احتیاط کرنے کی گزارش کروں گی۔\n— Samina Alvi (@Saminalvi) March 29, 2021\n“I had my test done too & am negative & quarantining. We had our vaccine 1st dose done but it takes time to build immunity & I request everyone to please continue to get vaccinations done & practice SOPs [Standards Operating Procedures],” she added.\nMeanwhile, Governor Sindh Imran Ismail in a tweet on Monday said that Defence Minister Pevaiz Khattak had been diagnosed with Covid-19 positive.\n“Perwaiz Khatak is diagnosed with Covid positive. Get well soon PK,” Imran Ismail said in his tweet.\nPerwaiz Khatak is diagnosed with Covid positive. Get well soon PK\n— Imran Ismail (@ImranIsmailPTI) March 29, 2021\nEarlier, Prime Minister Imran Khan was also tested positive for Covid-19 on March 20.\nHowever, according to Special Assistant to PM on National Health Services Faisal Sultan, the Prime Minister had made steady clinical recovery from Covid and his lab parameters remained stable.\n“PM Imran Khan has made steady clinical recovery from Covid and his lab parameters have remained stable. He has been advised that he may resume work and build up his work routine over the next few days. This is in line with national and int’l guidelines,” said Faisal Sultan in a tweet on Sunday.\nNational guidelineshttps://t.co/SLoUgGZpb8https://t.co/mnEQZ1pJto\nCDC USA guidelineshttps://t.co/R8OcqcGTJb\n— Faisal Sultan (@fslsltn) March 28, 2021",
  "retrievedAt": "2025-08-11T20:33:31.365Z"
}
