{
  "title": "AJK President calls for US administrations’ due role to help end plights of Kashmiris",
  "link": "https://www.app.com.pk/national/ajk-president-calls-for-us-administrations-due-role-to-help-end-plights-of-kashmiris/",
  "date_published": "2021-03-29T13:06:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 29 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Monday called upon the new US administration to play its due role in ending plights of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“The least the US can do is to ask India to cease and reverse illicit transfer of the Indian Hindu population to the IIOJK and stop killing unarmed Kashmiris in the occupied territory,” the AJK President office said in a statement.\nHe asserted that Washington has to revise its brief on Kashmir. It thinks that 900,000 Indian military and para-military troops are fighting “terrorists” in Kashmir. But that is a false premise constructed by India to delude the world.\nThe US, he said, should call for an end to repression and restoration of civil liberties and fundamental freedoms in IIOJK. Being a promoter of the right to self-determination throughout the last century, the US should not stand in the way of Kashmiris’s freedom of choice for their political identity as envisaged and mandated by the relevant UN Security Council resolutions.\nAbout the possible role of the United Nations, the president said the UN’s role on Kashmir is disappointing and the UN Secretary-General knows this fact. But his hands are tied. He can’t do much about the issue because the UN Security Council is not moving at all.\nWhen asked about the prospects of capturing the world attention and the global media on the Kashmir conflict, Sardar Masood Khan said that before the world pays attention to Jammu and Kashmir, the political parties of Pakistan and Azad Kashmir themselves would have to focus on Kashmir because the world wants to see how much attention we ourselves pay to what we demand from them.\n“Before the world refocuses its attention on Kashmir, the people and political parties of Pakistan and Azad Kashmir will have to do so. The world needs to first witness how intense we Kashmiris and Pakistan are. Their attention will be directly proportionate to our passion and endeavours,” he said.\nOn the lukewarm response to the Kashmir issue from the international community, Masood said that we should not dismiss some successes out of hand.\nThese successes include uproar in the international media about India’s aggression in the IIOJK and heightened discussion on the situation in IIOJK in parliaments and civil society organizations.\nThe president said the besieged and unarmed people of IOJK are giving blood for liberty every day. Under an unrelenting reign of terror by Indian occupation forces, they have not capitulated.\nAs free citizens, we should do better than that.\nDescribing Kashmir liberation struggle as native, the president said people of IIOJK have been continuing the struggle on their own negating the Indian propaganda that the freedom movement is foreign-sponsored.",
  "retrievedAt": "2025-08-11T20:33:31.585Z"
}
