{
  "title": "President calls for stronger commitment to address challenge of drug abuse",
  "link": "https://www.app.com.pk/national/president-calls-for-stronger-commitment-to-address-challenge-of-drug-abuse/",
  "date_published": "2022-06-25T19:16:00.000Z",
  "source": "APP",
  "content": "The International Day Against Drug Abuse and Illicit Trafficking is observed annually on June 26 to strengthen action and cooperation in achieving a world free of illicit drugs.\nIn a message on the occasion of the International Day Against Drug Abuse and Illicit Trafficking, he said the day was celebrated across the globe to prevent drug abuse and raise awareness about the alarming threats it poses to society, especially the youth.\nThe World Drug Report 2021, published by the United Nations Office on Drugs and Crime (UNODC), indicated that deaths attributed to drug-related disorders had almost doubled over the past decade. The youth, which makes up nearly 60% of Pakistan’s total population, remained especially vulnerable to drug abuse, he said adding students and parents must be sensitized through workshops and seminars with the help of the media, civil society, and educational institutions.\n“To this end, the Higher Education Commission (HEC) can play an important role and it has been directed to implement a strict policy to counter drug abuse in higher educational institutions.”\nHe said, “Today, we also celebrate the tremendous efforts Pakistan has made in collaboration with international organizations to address drug-related challenges.”\nInternational cooperation had helped limit the proliferation of new psychoactive substances used by younger generations, he added.\nHe commended the Ministry of Narcotics Control for the measures it had taken to combat the trafficking of illicit drugs in our society and mitigate the detrimental impacts of drug abuse. Pakistan had also achieved the status of a poppy-free state which was a reflection of the proactive approach taken by the Ministry of Narcotics Control/Anti-Narcotics Force, he mentioned.\n“Only with cooperation and collective commitment will we achieve our vision of a world free of this menace. We are committed to making Pakistan a model country, in the region and beyond, in this fight against drug abuse and illicit trafficking,” he concluded.",
  "retrievedAt": "2025-08-11T15:09:32.575Z"
}
