{
  "title": "Narcotics Ministry, UNODC holds rally to commemorate World Drug Day",
  "link": "https://www.app.com.pk/national/narcotics-ministry-unodc-holds-rally-to-commemorate-world-drug-day/",
  "date_published": "2022-06-26T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP): The Ministry of Narcotics Control and United Nations Office on Drugs and Crime (UNODC) Pakistan organized a walk and cycling rally to commemorate the World Drug Day here at Gulshan e Fatima Park, Margalla Road on Sunday.\nPeople from all walks of life, international and national counter parts, Civil Society, students, housewives, children and media joined the event.\nThe event was also attended by ministry, UNODC and Anti Narcotics Force officials.\nSpeaking on the occasion, Senior Joint Secretary Ministry of Narcotics Control Sabino Sikandar Jalal said the ministry, its attached department (Anti Narcotics Force) observes the Drug Day in collaboration with United Nation Office on Drugs and Crime every year to raise awareness about the threat of illicit drugs posed for our society.\n“This year the World Drug Day is being observed under the theme of addressing drug challenges in health and human crises.\nThus ‘CareinCrises’ we reiterate our commitment to make the world drug free with emphasis on our country. We want to sensitize masses particularly our youth to keep them away from the menace of drugs.\n“Media has an important role in spreading this awareness. Ministry of Narcotics Control has already developed a mobile app titled “zindagi” so that youth could be sensitized about narcotics hazards as well as treatment and rehabilitation facilities.\nHe said the government of Pakistan in collaboration with UNODC and other international agencies was making committed efforts to tackle this menace of Drugs.\n“I am happy to state that with sustained efforts, Pakistan has maintained status of ‘Poppy Free State’ since 2001. Pakistan is signatory to all global conventions and protocols for control of drug abuse and illicit trafficking and continues to play its due role whenever wherever required.”\nHe said drug problem was a challenge to the health, safety and well-being of people. “Therefore, there is need for continuous reinforcement of joint efforts both at the national and international level for strengthening efforts to counter these challenges.\nI urge all to come forward and join hands with to help realize our common goal of a Drug Free Nation & world for our existing and coming generations,” he said.\nOn the occasion, UNODC Country Representative Jeremy Milsom read the UNODC Executive Director UNODC Executive Director’s Ghada Fathi Waly’s message in which she said this year’s International Day Against Drug Abuse and Illicit Trafficking shines a spotlight on the impact of drug Challenges in health and humanitarian crisis.\n“Conflicts, climate disasters, forced displacement and grinding poverty create fertile ground for drug abuse – with COVID-19 making a bad situation even worse. At the same time, people living through humanitarian emergencies are far less likely to have access to the care and treatment they need and deserve.”\n“Meanwhile, criminals are profiting from people’s misery, with cocaine production at record highs, and a five-fold increase in seizures of methamphetamines and a near-quadrupling of amphetamine seizures over the last decade.\nThe message said on this International Day against Drug Abuse and Illicit Trafficking, we renew our commitment to ending this scourge and supporting those who fall victim to it.”\n“This includes non-discriminatory policy solutions centered around people, health and human rights, underpinned by strengthened international cooperation to curb the illicit drug trade and hold accountable those who profit from human misery.\n“We must also strengthen science-based treatment and support services for drug users, and treat them as\nvictims who need treatment rather than punishment, discrimination and stigma including treatment for those living with infectious diseases like HIV/AIDS and hepatitis.\n“We cannot allow the world’s drug problem to further shadow the lives of the tens of millions of people living\nthrough humanitarian crises. Let us commit to lifting this shadow once and for all, and giving this issue the attention and action it deserves.”",
  "retrievedAt": "2025-08-11T15:09:26.313Z"
}
