{
  "title": "President highlights significance of tapping youth bulge’s potential thru latest education",
  "link": "https://www.app.com.pk/national/president-highlights-significance-of-tapping-youth-bulges-potential-thru-latest-education/",
  "date_published": "2022-06-26T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 26 (APP): President Dr Arif Alvi Sunday stressed upon focusing more on the education and skill sets improvement of the country’s youth bulge, besides creation of more space to the womenfolk in the mainstream of economy.\nDuring a conversation premiered live on YouTube, a popular social media platform, the president said that the world had been moving at a faster pace with regard to latest development in information and technology sector and the research and knowledge.\n“Pakistan must immediately board on that fast moving train of information and knowledge,” he said urging the country’s political leadership and parliamentarians to focus more on education and human resource development.\nThe president opined that an intellectual and smart leadership was must to take a country on the path of progress and development by equipping youth with the latest education and by making investment upon enhancement of the human resources.\nThe president said the country was producing about 27,000 IT graduates whereas in India the numbers of IT graduates stood around 800,000.\nThe president cautioned that if this huge youth and women bulge of the country was not properly utilized, then they would become an elderly bulge.\nThe president said that in the next few years, according to an estimate, the world would require 80 million trained people in the realm of information and technology and artificial intelligence by 2030.\nHe said that IT sector possessed huge opportunities and stressed upon the need to overcome the formal brick and mortar educational system.\nThese issues were like bottlenecks which should be removed, he added.\nThe president said with use of latest technology, Pakistan could become a bread basket of the world in the field of agriculture.\nTo a query, he said that the government policies always determined the economy of a country.\nThe president observed that elections should be held on the basis of issues.\nHe said in today’s world policies were so dynamic that these required constant transformation and in different sectors, like the education and technology, the world was witnessing an exponential growth.\nThe president opined that if a leadership possessed smart thinking, nothing could stop a country from heading on the path of progress and development.\nResponding to another question, he said Pakistan had faced the global Covid 19 pandemic with efficient response.\nHe cited that the pandemic had disrupted the global supply and demand chain, adding but when compared with the global economy, Pakistan had performed better.\nStability could be achieved when there was betterment in policies, he said, and expressed his optimism that Pakistan would be soon out of the economic challenges.\nThe president shared that implementation of policies in Pakistan always took time whereas the changes around the world were taking place at rapid speed.\nAbout Pakistani diaspora, he said that they had great affection for their motherland.\nBut he regretted that after imparting them education and skills and qualities , they had exported such talent to abroad which was ‘wastage of human capital’.\nThe president also emphasized upon creation of awareness over the issues of growing population.\nHe also regretted that the world was subject to vested interests based global order.\nThe president, to a question, replied that they made efforts for the women’s inheritance rights and resolution of the issues of disabled people.",
  "retrievedAt": "2025-08-11T15:09:29.116Z"
}
