{
  "title": "Torture is crime against humanity; IIOJK situation remains grim: President",
  "link": "https://www.app.com.pk/national/torture-is-crime-against-humanity-iiojk-situation-remains-grim-president/",
  "date_published": "2022-06-26T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 26 (APP): President Dr Arif Alvi Sunday said that torture was a crime against humanity and the situation was particularly grim in Indian Illegally Occupied Jammu & Kashmir (IIOJK), where the people were being subjected to brutal torture by the Indian security forces.\nAlthough torture was prohibited under both international and national laws, it still happened all around the world. “I reiterate that torture remains unacceptable and unjustified at all times,” the president said in a message on the occasion of International Day in Support of Victims of Torture.\n“While recognizing the pain of the victims of torture, as well as their families, I urge the international community and concerned organizations to make all possible efforts to prevent torture, rehabilitate victims and provide redress to them,” the president emphasized.\nOn the International Day being observed on June 26, the president highlighted that all people possessed basic human rights, and human dignity was one of the fundamental rights.\n“The Constitution of Pakistan, 1973 holds the dignity of man inviolable and states that no person shall be subjected to torture,” he added.\nOver the years, the president said, Pakistan has shown its commitment towards eliminating the practice of torture. In 2010, the Government of Pakistan ratified the UN Convention Against Torture (UNCAT) in 2010.\nUNCAT prohibited torture in unequivocal terms and urged states to penalize those who committed acts of torture, he said, adding since then, the government had been making progress.\n“We now have a bill criminalizing the acts of torture before the legislature. Once passed, Pakistan would have a law that criminalizes torture and punishes those who inflict it,” the president maintained.",
  "retrievedAt": "2025-08-11T15:09:31.809Z"
}
