{
  "title": "IHC issues written order in missing poet recovery case",
  "link": "https://www.app.com.pk/national/ihc-issues-written-order-in-missing-poet-recovery-case/",
  "date_published": "2024-06-10T17:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):The Islamabad High Court (IHC) on Monday declared poet Farhad Ali Shah as a ‘missing person’ till he reached back to his home.\nJustice Mohsin Akhtar Kayani issued a four page written order regarding disposal of a petition seeking recovery of the missing poet.\nThe order said that Syed Farhad Ali Shah who was missing since May 15, 2024 couldn’t reach home so far and a first information report (FIR) was registered with the Lohebher Police Station Islamabad under section 427 and 365 PPC regarding his missing.\nIt said that the court was told that Farhad Ali was arrested by Police Station Derkot Kashmir and he was also required to Saddar Police Station Muzafarabad in another case of terrorism.\nIt said that in above circumstances the person couldn’t be produced before the bench and the court has reached to a conclusion that he was forcibly disappeared and the concerned institution failed to recover him.\nThe court said that as per the investigation officer Farhad Ali was currently in judicial custody. However, keeping in view all the circumstances, the court declared the arrest of Farhad Ali as illegal.\nIt said that investigation officer of Lohebher Police Station was bound to record the statement of Syed Farhad Ali Shah under section-164 before a judicial magistrate after his return and proceed the investigation in light of the statement.\nThe court ordered the registrar office to club all the cases of missing persons, present it to the chief justice for formation of a larger bench to address this matter of public interest.\nIt also instructed the registrar office to invite the representatives from sensitive institution and law enforcement agencies in next meeting of Criminal Justice Committee so that their recommendations could be discussed and issued could be resolved in a legal way for the protection of citizens’ rights.\nThe court said that the cases pertaining to the national security can be heard in-camera and if it was necessary then larger bench can be formed after taking the briefing from the heads of investigation institutions. The orders can also be issued for non-reporting of these cases on media.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:09:21.653Z"
}
