{
  "title": "Govt implementing measures to control iron smuggling on border areas: Minister",
  "link": "https://www.app.com.pk/national/govt-implementing-measures-to-control-iron-smuggling-on-border-areas-minister/",
  "date_published": "2024-06-10T16:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):Minister of State for Economic Affairs Ali Pervaiz on Monday informed the National Assembly that the government is implementing measures to control iron smuggling at Taftan border area.\nDuring the question hour in the House, the minister said that all out resources would be utilized to protect the production of the country’s local industries including the iron industry.\nThe minister said that monitoring on both sides of the Iran-Pakistan border has been tightened to prevent iron smuggling on bordering areas.\nAli Pervaiz said that the only way to escape the clutches of the International Monetary Fund (IMF) program is through reforms, quoting the examples from countries like Vietnam, Indonesia and India.\nTo another question, he said that appeals involving amounts over Rs 20 million would be decided by appellate tribunals instead of the Commissioner of Income Tax, adding that artificial intelligence and other methods are being used in the selection of audits.\nAli Pervaiz said that minimum wage should be reviewed considering the current inflationary period, adding that he would convey members’ views on revising the minimum wage in the upcoming budget.\nTo another question, he said that Bank Al Habib is a private bank with its own board where employees can address their grievances, adding that there is the institution of the Banking Ombudsman for such matters.\nHe said in terms of Section 183(1) of the Companies Act, 2017, the Board of Directors (BoD) of banks are responsible for the policy making and supervision of the affairs of the bank including human resource related policies.\nThe minister said that State Bank of Pakistan does not interfere in the human resource policies duly approved by the BoD of respective bank.  Ali Pervaiz said this position is also reflected in various judgments passed by the courts wherein it has been held that SBP has no jurisdiction to decide on service matters of the bank employees.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:09:45.449Z"
}
