{
  "title": "Immediate increase in tobacco taxes would protect the rights of child",
  "link": "https://www.app.com.pk/national/immediate-increase-in-tobacco-taxes-would-protect-the-rights-of-child/",
  "date_published": "2024-06-10T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):Health activists have called for an immediate increase in tobacco taxes in Pakistan to protect the rights and health of children and the general public.\nIn a press release issued by the Society for the Protection of the Rights of the Child (SPARC), this call has been made at a time when the nation faces a severe public health crisis.\nMalik Imran Ahmed, Country head Campaign for Tobacco Free Kids (CTFK), shared that recent statistics reveal alarming figures regarding tobacco use in Pakistan. With approximately 31.6 million adults, constituting about 19.9% of the adult population, currently using tobacco, tobacco-related illnesses claim more than 160,000 lives annually, imposing a significant burden on the healthcare system and costing the economy at least 1.4% of its GDP every year.\nImran shared in detail that the recent Federal Excise Duty (FED) reforms on tobacco have demonstrated promising results in terms of revenue generation. Collections from July 2023 to January 2024 have already surpassed PKR 122 billion, with projections for the full year exceeding PKR 200 billion, marking a substantial increase compared to previous fiscal years.\nFurthermore, these reforms are expected to generate an additional PKR 60 billion in General Sales Tax (GST) from cigarettes for the fiscal year 2023-24. The combined impact of FED and GST is estimated to be around PKR 88 billion, indicating a remarkable relative growth of nearly 49% compared to the previous year.\nImran added that in addition to the financial benefits, these reforms play a crucial role in promoting public health by reducing tobacco consumption and potentially recovering 17.8% of the total healthcare costs associated with smoking in Pakistan. However, maintaining the current rate could result in a decrease in health cost recovery, highlighting the urgent need for further action.\nTo achieve similar levels of health cost recovery observed in 2023-24, a 37% increase in the FED rate for the upcoming year is recommended. This tax proposal presents a clear ‘win-win’ scenario, benefiting both the government and the people of Pakistan by enhancing revenue and safeguarding public health.\nDr. Khalil Ahmad Dogar, Program Manager at SPARC, echoed these sentiments, stating, “The devastating impact of tobacco use extends far beyond individual health, affecting families, communities, and the economy at large. We cannot afford to overlook the urgency of implementing effective measures to address this crisis.”\nDr. Khalil said that contrary to misconceptions, research evidence strongly refutes the argument that a tax increase may promote illicit trade, highlighting the manipulative tactics employed by tobacco firms to influence tax policies and evade taxes. Moreover, the implementation of the recently initiated track & trace system is expected to further combat counterfeiting, curb illicit trade, and ensure effective regulation of the tobacco industry.\nAcknowledging the urgency of the situation, Dr. Khalil emphasized that it’s imperative that we take decisive action to curb tobacco use in Pakistan to safeguard the health and well-being of our citizens, particularly our children.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:07:49.641Z"
}
