{
  "title": "No rule’s violation in chairing of Senate session by presiding officer on June 7: Gillani",
  "link": "https://www.app.com.pk/national/no-rules-violation-in-chairing-of-senate-session-by-presiding-officer-on-june-7-gillani/",
  "date_published": "2024-06-10T16:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): Senate Chairman Syed Yusuf Raza Gillani on Monday ruled that there was no procedural irregularity or violation of Rule 14 in chairing the session of the Upper House of Parliament by a presiding officer while the deputy chairman was available on June 7.\nThe chairman also advised the Senate Secretariat, that, in future, “the availability of deputy chairman in the Parliament Building might be ensured first before inviting any member of panel of presiding officers in absence of the chairman”.\n“This ruling flows as consequence of a letter written to me by the Leader of the Opposition stating therein that during sitting of the Senate held on 7th June, 2024, Rule 14 of the Rules of Procedure and Conduct of Business in the Senate, 2012 has been violated,” the ruling said.\nChairman Gillani said that the current session of the Senate was summoned on 7th June, 2024, whereupon in pursuance of Rule 14 of the Rules of Procedure and Conduct of Business in the Senate, 2012, Muhammad Ishaq Dar, Palwasha Muhammad Zai Khan and Manzoor Ahmed were nominated, in order of precedence, to preside over the sitting in absence of the chairman and deputy chairman.\n“During sitting of the Senate held on 7th June, 2024, I was presiding the session but in view of pre-scheduled urgent commitment, I had to leave the House.\n“At that time, Deputy Chairman Senate was not present inside the House so I invited Senator Palwasha Muhammad Zai Khan, the available member of the panel of presiding officers present at that time inside the House, to preside over the sitting.\n“When Senator Palwasha occupied the seat and started the proceedings, in the meanwhile, Deputy Chairman Senate walked inside the House so the members raised objection in the House that member of panel of presiding officer cannot preside the sitting when Deputy Chairman is available in the House,” he said.\nHe said he had checked the record of the proceedings and it transpired that when Senator Palwasha Muhammad Zai Khan had already occupied the Chair at that time the Deputy Chairman walked inside the House for a short span of time under the impression that the chairman was presiding the session but soon after realizing the situation he walked out of the House.",
  "retrievedAt": "2025-08-11T03:09:22.776Z"
}
