{
  "title": "PM attends Namaz-e-Janaza of Shaheed Captain Faraz Ilyas",
  "link": "https://www.app.com.pk/national/pm-attends-namaz-e-janaza-of-shaheed-captain-faraz-ilyas/",
  "date_published": "2024-06-10T06:19:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 10 (APP):Prime Minister Muhammad Shehbaz Sharif on Monday attended Namaz-e-Janaza of Shaheed Captain Faraz Ilyas in Kasur who was martyred in an improvised explosive device (IED) attack in District Lakki Marwat, Khyber Pakhtunkhwa.\nThe funeral prayer was attended by Minister for Information and Broadcasting Attaullah Tarar, IG Police Punjab and a number of senior military officers, civil authorities and residents.\nThe prime minister also met with the parents of shaheed captain and expressed condolences.\nHe announced to transform the native village of martyred officer as model village and renamed it as “Faraz Ilyas Shaheed”.\nHe told the parents that the sacrifice of their son would not go in vain and prayed for the bereaved family to bear the loss with fortitude.\nUnder the Quranic teachings, a shaheed had an elevated place in Jannah, he said, adding that a large number of Jawans of armed forces had laid down their lives for the motherland.\nThe prime minister said that the nation was proud of its brave sons and the coward terrorists could not succeed in shaking their strong resolve.\nSeparately, on X account, the prime minister said that he was deeply saddened by the martyrdom of Pak Army personnel including a captain in a targeted attack in District Lakki Marwat.\n“The sacrifices of our brave soldiers and citizens is a debt on us that we must repay by relentlessly eliminating terrorism from our nation. Heartfelt condolences to the bereaved families,” he further posted.\nThe late captain was laid to rest with complete military honours. The prime minister offered Fateha at his grave and placed a flower wreath.\nHe also prayed for the high ranks of the departed soul.\nShaheed Captain Faraz Ilyas, 26-year-old, belonged to village Rai Kalan, Kasur who laid down his life valiantly while performing his duties in Lakki Marwat.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:08:58.832Z"
}
