{
  "title": "PPP Khyber welcomes Kundi’s appointment as KP Governor",
  "link": "https://www.app.com.pk/national/ppp-khyber-welcomes-kundis-appointment-as-kp-governor/",
  "date_published": "2024-06-10T12:03:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jun 10 (APP):President PPP, district tribal district Khyber, Farhad Khan Afridi Monday welcomed the appointment of Faisal Karim Kundi as Governor Khyber Pakhtunkhwa and asked the provincial government to cooperate with him.\nAddressing a press conference here at Peshawar Press Club (PPC), he said that in the current deteriorating law and order situation and unemployment,  Chief Minister Ali Amin Khan Gandapur should focus on the reconstruction of the province and avoid creating unnecessary fissure .\nHe said that in case of any difficult situation, they would be standing by the governor.\nBesides, Shah Rehman Shinwari, district general secretary and Javed Shah, general secretary PPP Tehsil Bara, district Khyber, other party workers from the tribal district also flanked him on the occasion.\nThe PPP leader demanded of both provincial government and federal government for providing  health, education facilities and development of infrastructure beside generation of employment opportunities for the youth of the former federal administered tribal area (Fata).\nSimilarly, he said that most of houses in their area in district Khyber were demolished during operation against terrorists and the government had announced a compensation of Rs 0.4 million for the owner of each such house in the region. But, so far they had not received any amount in that regard, he pointed out.\nHe also called for the implementation of the Sartaj Aziz’s recommendations in letter and spirit and particularly the fulfillment of the allocation of three persons in the National Finance Commission (NFC) for the development of the merged districts and spending of Rs 100 billion annually to bring them at par with the other parts of the country.\nFarhad Afridi said that they still owned their struggle for the merger of the former Fata with the settled areas of the Khyber Pakhtunkhwa, adding that majority of the tribesmen were annoyed of the Frontier Crimes Regulations (FCR) and Malik System.\nThe PPP leader said that their support for the merger was aimed the development and provision of basic amenities to the people of the region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:08:12.584Z"
}
