{
  "article_id": "2025-06-01_d4a954538078ef7064a9757cee17d0d8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-police-serve-76000-citizens-under-modern-international-standard-policing/",
    "retrieved_at": "2025-08-27T10:41:54.032Z"
  },
  "metadata": {
    "title": "ICT Police serve 76,000 citizens under modern, international-standard policing",
    "author": null,
    "date_published": "2025-06-01T14:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 311,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 01 (APP):In line with international standards, the Islamabad Capital Territory (ICT) Police has provided services to over 76,000 citizens so far this year through its modern police service centers, offering a wide range of facilities including character certificates, general police verification, lost item reports, and the registration of foreign nationals, tenants, and domestic workers. An official told APP on Sunday that the Capital Police under the leadership of Inspector General of Police (IGP) Syed Ali Nasir Rizvi has taken concrete steps to facilitate citizens at every level. Upon assuming office, the IG Rizvi directed all officers to ensure the provision of quality services and ease of access for the general public. The ICT Police has since enhanced its citizen-centric approach, providing services such as character certificates, general police verification, registration of foreign nationals, tenants, and domestic workers, as well as lost item reports and vehicle verification. He said that a total of 76,400 citizens availed themselves of services at various Khidmat Markaz located across the city, including sectors F-6, G-10, H-11, Bani Gala, Sawan Garden and G-14, in addition to several model police stations. Among the services provided this year were the issuance of over 16,000 character certificates, 14,495 general police verification certificates and 6,557 clearance certificates. He said that the centers also processed 3,906 lost item reports, 2,672 tenant and domestic worker registrations, 2,798 vehicle verifications, and conducted background checks for more than 29,000 foreign nationals. In addition to fixed centers, the ICT Police has deployed mobile service vans to ensure these services reach citizens at their doorsteps. IG Rizvi said that the police service centers are staffed with trained personnel committed to providing efficient and professional assistance to both Pakistani citizens and foreign residents. IG Rizvi emphasized that the initiative is part of Islamabad Policeas commitment to deliver modern, transparent, and responsive policing in the federal capital.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}