{
  "article_id": "2025-06-01_88359973d60f203fec029d78bb489dae",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/career-counselling-a-long-ignored-necessity/",
    "retrieved_at": "2025-08-27T10:42:05.160Z"
  },
  "metadata": {
    "title": "Career Counselling: A long ignored necessity",
    "author": null,
    "date_published": "2025-06-01T09:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 666,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 1 (APP):: In a society where medical, technical, or government jobs are seen as the only markers of success, many students end up with degrees they never truly wanted. This stems from a system that does little to help students reflect deeply or make informed choices. The lack of career counselling in schools and colleges robs them of dreams and the long-term satisfaction of following a self-chosen path. Mahnoor Ali, student of Allama Iqbal Medical College, talking to APP shared that she pursued pre-medical due to parental pressure: \"My dream was psychology from an early stage. I don't know what I want anymore because I'm unsure about everything.\" Many others in Pakistan find themselves in similar positions, enrolled in courses misaligned with their interests or strengths. The issue is worsened by the shortage of trained career counsellors, especially in public schools. Miss Farzana Akhtar, an educator at Viqar un Nisa Girls College talking to this scribe said, \"It is difficult for teachers to support each student's development every day.\" As a result, students follow popular trends or parental expectations. No formal counselling programs exist for children in care. Career counselling is not just about picking a job. It helps students discover their strengths, explore interests, and understand how these relate to the job market. It also introduces them to emerging fields like data science, environmental law, and international relations, areas often overlooked. Hamna, studying pharmacy at University of Faisalbad, said her friend always dreamed of D-Pharm. \"I didn't know anything about it. After failing my MDCAT, I applied and got accepted. Sometimes, I feel grateful; other times, overwhelmed. But I never felt I had to please anyone-my parents support me completely.\" Mahnoor also noted, \"I opted for this program on my own and I'm fine with it.\" She emphasized how helpful a college counselling session had been. Javeria, who is pursuing International Relations from Fatima Jinnah Women University, said, \"My father picked this program. He wanted one of us to study IR, so I applied.\" Although selected quickly, she still dreams of being a fighter pilot: \"The Pakistan Air Force has always inspired me.\" Career counsellor Mr. Asad Khan in Islamabad emphasizes early intervention: \"Once students apply for university, choices are often locked in. Counselling should begin by 9th grade.\" Using aptitude tests and discussions, students can understand themselves and define goals. Lack of career counselling also affects mental health. Ms. Sofia Rehman, who provides counselling said, \"Students cry in my office because they dislike their subjects.\" She believes better guidance early on could prevent such distress. Parents also play a key role. Mrs. Shazia Malik, mother of a college student, said they chose engineering for their son, believing it had better job prospects. \"Now he wants filmmaking. Speaking to a counsellor might've helped us understand his passion.\" Many parents and teachers are unaware of changing job market trends. Career counselling bridges this gap by engaging all parties-students, parents, and educators. Some private schools are stepping up. \"We have two qualified counsellors at our high school in Karachi. They hold regular sessions with students and parents,\" says principal Zeeshan Tariq. \"Students are now more motivated and clear-headed.\" Still, most rural and low-income students lack this support. Counselling should be universally available, not limited to a privileged few. Government, education boards, and private institutions must work together to provide accessible and inclusive counselling. Guidance should also continue throughout a student's academic life. \"Many students realize mid-degree that they're in the wrong field but feel trapped due to investment,\" says Dr. Imran Yusuf. Exit counselling and flexible course-change options are crucial at the university level. Career counselling must no longer be viewed as optional. It is essential not only for helping young people find personal direction and confidence but also for preparing a workforce that is skilled, motivated, and aligned with both global trends and local industry demands. By empowering our young population, we strengthen Pakistan's economy and lay the foundation for a progressive, self-reliant nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}