{
  "title": "Civil society applauds NCHR’s role in Implementing 2pc minority quota in KP",
  "link": "https://www.app.com.pk/national/civil-society-applauds-nchrs-role-in-implementing-2pc-minority-quota-in-kp/",
  "date_published": "2024-07-10T11:32:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 10 (APP): The Civil Society Support Group has laded role of the National Commission for Human Rights (NCHR) in promoting minority groups’ equal access to higher education.\nThe NCHR has directed all public sector universities to comply with the reserved 2 percent admission quota for minorities, following the Khyber Pakhtunkhwa government’s approval of the quota in 27 public sector universities in 2021.\nMiss Yumna Aftab, Project Manager at Blue Veins, said that approximately 16 out of 27 public sector universities in Khyber Pakhtunkhwa have complied with the allocated 2 percent admission quota for minorities.\nShe attributed this progress to the proactive support and efforts of the NCHR, emphasizing the Commission’s significant role in this achievement.\nMembers of the Civil Society Organization (CSO) Support Group, established by Blue Veins under the initiative “Faith in Action for Equal Rights and Opportunities,” praised NCHR’s proactive approach towards addressing the issues faced by minority communities.\nThe group also highlighted the need for a centralized database to assess the implementation and effectiveness of the quota system.\nThe formation of the Sub-Committee on Minority Issues by NCHR, aimed at safeguarding the rights of minority groups and addressing their challenges in accessing education, was lauded by civil society members.\nThey emphasized the importance of proactive engagement by duty bearers in addressing social issues and its positive impact on societal development.\nThe members reiterated that improving socio-economic conditions and uplifting diverse faith communities can only be achieved through collaborative efforts and ensuring equal opportunities for all societal groups.\nThe recent directive by NCHR to the Governor Inspection Team to instruct universities to share their compliance reports further strengthens the support for this cause, ensuring the effective utilization of the quota by minority communities.\nThe NCHR’s commitment to expediting the implementation of this quota is seen as a commendable effort, as it not only enhances access to education for minorities but also ensures an inclusive and accessible education system for all.\nThis initiative is recognized as a significant step towards the uplift of minority communities in Khyber Pakhtunkhwa, addressing their long-standing educational challenges and improving their socio-economic conditions.\nCivil society organizations collectively commend the NCHR’s efforts and express hope that continued collaboration will lead to further advancements in ensuring equal educational opportunities for all minority groups in Khyber Pakhtunkhwa.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:49:45.801Z"
}
