{
  "title": "Roll up your sleeves as nation wants results; won’t tolerate laxity in downsizing plan: PM tells ministries",
  "link": "https://www.app.com.pk/national/roll-up-your-sleeves-as-nation-wants-results-wont-tolerate-laxity-in-downsizing-plan-pm-tells-ministries/",
  "date_published": "2024-07-10T10:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP): Prime Minister Shehbaz Sharif on Wednesday, warning against any laxity in the implementation of the government’s downsizing agenda, asked the ministries to work hard for making a difference and meeting the nation’s expectations.\n“I will not allow my time to waste and I am sure you will not allow your time to be wasted. The only thing that will make the difference is action and implementation. Roll up your sleeves as this is a matter of country, its resources and resolution of its issues,” the prime minister said in his remarks while chairing the meeting of the federal cabinet.\nApprising the members of his visits to Tajikistan and Kazakhstan, he referred to his interactions with world leaders particularly Russian President Vladimir Putin, and said he had formed a committee under Planning Minister Ahsan Iqbal for follow-ups.\nSimilarly, he said he had chaired a meeting a couple of days ago to review the progress on the follow-up of “very productive” discussions with Chinese President Xi Jinping and Premier Li Qiang during his China visit and would hold another meeting on July 20.\nThe prime minister said the government had launched solarisation of 28,000 tube-wells in Balochistan to save bleeding of annual Rs 80 billion. He also appreciated the Balochistan chief minister and other relevant ministries and departments for taking the project to the implementation stage.\nHe told the meeting that the finance ministry had been tasked to work out a business plan for solarisation of a million tube-wells in the country which were currently running on imported fuel, putting a burden of $3.5 billion in the from of foreign exchange.\nThe prime minister highlighted that Pakistan had immense solar energy potential which must be exploited to save energy costs and provide low-cost electricity to the farmers.\n“Time is running fast and we are racing against time. You have to accept the challenge and deliver. You will become the nation’s heroes… if you bring about a revolution of development in your ministries. For this, we will have to work day and night,” he remarked.\nComing to the downsizing agenda, the prime minister categorically said that he would not listen against the closure of PWD as the government had also found an alternative solution on the pattern of Punjab. He said the two-week time he had given for PWD’s closure, was already over.\n“I will not tolerate if any ministry used delaying tactics. Please make no mistake about it. It is okay if there is any valid reason for any subsidiary but protecting any entity for the sake of perks and privileges is a thing of the past, not today. It will not happen and it must not happen,” he remarked.\nThe prime minister also highlighted that Pakistan spends $5 billion on freight of exports and imports but Pakistan National Shipping Corporation was running a fleet of just 12 ships while getting Rs5 billion for salaries. This is contrary to around 600 ships being run by Bangladesh and around 1500 ships by India.\n“But no one cares. At least they should have flagged the issues to seek their resolution,” he said and also referred to the evasion of import duties worth Rs1200 billion on Karachi Port.\nHe told the meeting that on Tuesday, the government had announced a Rs 50 billion relief package to support the power consumers of the protected category for three months. “During these three months, I want massive fiscal space through enforcement like plugging financial leakages and addressing tax evasion,”, he added.\nHe said the government had imposed taxes on the real estate sector to generate Rs100 billion in revenue and to do away with a culture of tax evasion.\n“This cannot go for long. We need to bring deep structural reforms and take bitter pills. I pray that this should be the last IMF program but it needs sacrifices,” he commented.\nHe reiterated his call for the ministers to work hard and sought plans from commerce and IT ministers to boost exports.\n“I beg of you in the name of Pakistan. Let us stand up and accept the challenge, move forward in unison and create a difference as the nation wants results,” he added.\nPrime Minister Shehbaz asked the interior minister and interior secretary to ensure coordination with the provinces during the month of Muharram, and extend maximum possible support to provinces as well as Azad Jammu and Kashmir and Gilgit Baltistan.\nEarlier, the cabinet members offered Fateha for the soldiers martyred in Waziristan on Tuesday as well as a DSP of Counter Terrorism Department in Karachi.",
  "retrievedAt": "2025-08-11T03:49:47.411Z"
}
