{
  "title": "River Kabul continues to flow in low flood: FFC",
  "link": "https://www.app.com.pk/national/river-kabul-continues-to-flow-in-low-flood-ffc-2/",
  "date_published": "2024-07-10T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP):The Federal Flood Commission (FFC) has said that river Kabul continues to flow in low flood at Warsak-Nowshera reach while all other major rivers Indus, Jhelum, Chenab, Ravi and Sutlej run normal.\nAccording to daily FFC report on Wednesday, combined live storage of the country’s major reservoirs including Tarbela, Mangla and Chashma stood at 8.137 million feet of water (MAF).\nAccording to Flood Forecasting Division (FFD) Lahore, Westerly Wave’s trough earlier over northern parts of Pakistan lies over Kashmir and adjoining areas which is likely to move away during the next 24 hours. Another fresh trough of Westerly Wave is now over northwestern Afghanistan. The wind pattern over Southwest Asia indicates moderate moisture incursion from the Arabian Sea, with directional convergence over the upper part of Pakistan upto 3000 feet. The moisture influx from the Arabian Sea is expected to strengthen during the next 24 hours.\nFurthermore, monsoon trough is beginning to re-establish with its axis extending from the seasonal low to the Bay of Bengal.\nThe FFD has forecast scattered thunderstorm of moderate intensity over upper catchments of rivers Indus and Jhelum besides isolated light rainfall in the catchments of rivers Chenab, Ravi and Sutlej during the next 24 hours. Scattered thunderstorm of moderate intensity may occur over Islamabad, Punjab, (Rawalpindi, Sargodha and Gujranwala Divisions) and Khyber-Pakhunkhwa province besides isolated thunderstorms of light intensity over Punjab (Lahore, Multan and DG Khan Divisions), Southern & Southeastern Sindh and Balochistan (Zhob & Kalat Divisions) during the same period.\nMonsoon activity is likely to resurge during the next 48 hours and scattered thunderstorm rain of moderate intensity with isolated heavy falls are expected over DG Khan Division (Punjab), northern & northeastern Punjab and Khyber Pakhunkhwa including upper catchments of all major rivers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:50:07.697Z"
}
