{
  "title": "10 private member bills landed in NA",
  "link": "https://www.app.com.pk/national/10-private-member-bills-landed-in-na/",
  "date_published": "2024-07-09T19:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP): As many as 10 private member’s bills landed in the National Assembly here on Tuesday during the seventh meeting of the 14th Assembly session.\nThe Bills included the South City University Bill, 2024, the Child Marriage Restraint Act, 1929 (Amendment Bill 2024), the Pakistan Psychological Council Bill, 2024, the Constitution (Amendment) Bill, 2024, the National Commission for Minorities Bill, 2024, the Constitution (Amendment) Bill, 2024 to amend its Article-51 and 106, the Nippon Institute of Advanced Sciences (NIAS) Bill, 2024, the High Courts (Establishment) (Amendment) Bill, 2024, the Christian Marriage (Amendment) Bill, 2024, the Christian Marriage (Amendment) Bill, 2024 as passed by the Senate for further amendments to the Christian Marriage Act, 1872, the International Institute of Technology, Culture, and Health Sciences Bill, 2024 and moved the amendment Bill to amend the Rules of Procedure and Conduct of Business in the National Assembly, 2007.\nThe Bills were moved by the Members National Assembly Syed Khursheed Ahmed Shah, Sehar Kamran, Riaz Fatyana, Asad Qaiser, Naveed Aamir Jeeva, Zulfiqar Ali Bhatti, Sohail Sultan, Ahmed Raza Maneka and Nafisa Shah.\nSpeaker National Assembly Sardar Ayaz Sadiq referred the Bills to the committees concerned on not opposing from the treasury benches.\nMeanwhile, MNA Nawabzada Mir Jamal Raisani of PPPP tabled the motion to express resolve for unity counter-terrorism and pay homage to the martyrs of the terrorist attack occurred in Kanak area of Mastung that also left his father Nawabzada Siraj Raisani martyred among over a hundred other martyrs. The motion was adopted unanimously by the House.\nThe House was adjourned to meet again on July 10th (Tuesday) at 1400 hours.",
  "retrievedAt": "2025-08-11T03:50:10.939Z"
}
