{
  "title": "PMD indicates chances of rain with isolated heavy-falls at various parts of country:PMD",
  "link": "https://www.app.com.pk/national/pmd-indicates-chances-of-rain-with-isolated-heavy-falls-at-various-parts-of-countrypmd/",
  "date_published": "2024-07-10T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP): Pakistan Meteorological Department (PMD) has indicated chances of rain-wind/thundershowers with isolated heavy-falls in Khyber Pakhtunkhwa, Islamabad, Pothohar region, upper Punjab, northeast Balochistan, Kashmir and Gilgit Baltistan during the next 24 hours.\nHot and humid weather is expected elsewhere in the country.\nAccording to the synoptic situation, monsoon currents from Arabian Sea were penetrating upper/central parts of the country.\nA shallow trough of westerly wave was also present over upper parts of the country.\nDuring the last 24 hours, rain-wind/thundershower with isolated heavy-falls occurred in upper Khyber Pakhtunkhwa, Islamabad, Pothohar region, upper Punjab, Kashmir and lower Sindh, Hot and humid weather prevailed over other parts of the country.\nThe rainfall recorded was in Khyber Pakhtunkhwa: Malam Jabba 60, Kakul 15mm, Dir (upper 12, lower 03), Parachinar 07, Balakot 06, Pattan, Saidu Sharif 05, Peshawar Airport, Mardan 01, Punjab: Islamabad (Saidpur 45, ZP 39, Golra 22, Bokra 04, AP 03), Rawalpindi (Shamsabad 34, Chaklala AP 19, Katcheri 11), Lahore (Tajpura 30, Lakshmi Chowk 29, Qurtaba Chowk 25, Farrukhabad 24, Upper Mall 23, Mughalpura, Chowk Nakhuda, Shahi Qila 20, AP 14, Gulshan-e-Ravi 13, Nishter Town, City 05, WASA Head office, Samanabad 02), Faisalabad 19, Mangla 11, Murree 10, Jhelum, Hafizabad 08, Mandi Bahauddin, Gujrat 07, Chakwal 06, Sialkot (AP), Gujranwala 05 and Attock 04mm.\nThe rainfall recorded was in Sindh: Karachi (Gulshan-E-Hadeed 14mm, Old Area AP 06, Saadi Town 04, Korangi 03, Kemari 02, Surjani Town, Masroor Base, Malir, DHA 01), Thatta 14, Kashmir: Rawalakot 10, Muzaffarabad (City 05, AP 04), Garhidupatta and Kotli 02mm.\nThe highest maximum temperatures recorded were Jacobabad 47C, Sibbi, Nokkundi and Dalbandin 46C.",
  "retrievedAt": "2025-08-11T03:50:58.932Z"
}
