{
  "title": "Terrorist Commander among three killed, four soldiers embraced martyrdom in Peshawar IBO",
  "link": "https://www.app.com.pk/national/terrorist-commander-among-three-killed-four-soldiers-embraced-martyrdom-in-peshawar-ibo/",
  "date_published": "2024-07-10T15:52:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 10 (APP): A terrorist commander among three were killed in a joint intelligence-based operation conducted by the Security Forces and Police in Hassan Khel area of Peshawar District while four brave sons of the soil embraced martyrdom amid gallantly fighting against the terrorists.\nDuring conduct of the operation, after intense exchange of fire, three terrorists including high value target, Terrorist Commander Abdul Raheem were killed whereas weapons and ammunition were also recovered from the killed terrorists, an Inter Services Public Relations (ISPR) news release said.\nTerrorist Commander Abdul Raheem was highly wanted by the Law Enforcement Agencies and the government had fixed head money of Rs 6 million on him, as he remained actively involved in numerous terrorist activities, and was also responsible for Shahadat of Captain Hussain Jehangir Shaheed and Havildar Shafiq Ullah Shaheed on 26 May 2024.\n“Today’s operation has avenged the heinous act and has brought the main perpetrator to justice,” the ISPR said.\nThe martyred soldiers were identified as Sepoy Muhammad Idrees (age: 34 years, resident of Swabi District), Sepoy Badam Gul (age: 34 years, resident of Kohat District) of Pakistan Army and Sub Inspector Tajmir Shah, (age: 38 years, resident of: Peshawar District) and Assistant Sub Inspector Muhammad Akram (age: 34 years, resident of Mansehra District) of CTD KPK, who having fought gallantly, embraced Shahadat.\n“Pakistan’s Security Forces stand shoulder to shoulder with other law enforcement agencies to ensure peace and stability across of Pakistan and such sacrifices of our brave men further strengthen our resolve,” the ISPR said.",
  "retrievedAt": "2025-08-11T03:50:39.282Z"
}
