{
  "title": "NA passes State-Owned Enterprises (Governance and Operations) (Amendment) Bill, 2024",
  "link": "https://www.app.com.pk/national/na-passes-state-owned-enterprises-governance-and-operations-amendment-bill-2024/",
  "date_published": "2024-07-10T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP): After Senate, the National Assembly on Wednesday passed the State-Owned Enterprises (Governance and Operations) (Amendment) Bill, 2024, aimed at strengthening the provisions for the removal of directors under the Act, amid the opposition uproar.\nMinister for Law and Justice Azam Nazeer Tarar on behalf of the Minister for Finance and Revenue piloted the bill in the House to amend the State-Owned Enterprises (Governance and Operations) Act, 2023 [The State-Owned Enterprises (Governance and Operations) (Amendment) Bill, 2024] as passed by the Senate.\nEarlier, Chairman NA Standing Committee on Finance and Revenue Syed Naveed Qamar presented the report of the committee to amend the State-Owned Enterprises (Governance and Operations) Act, 2023 [The State-Owned Enterprises (Governance and Operations) (Amendment) Bill, 2024 in the House.\nThe minister said that the amendment was brought to enhance the efficiency of Board of Directors (BoDs) of all State-Owned Enterprises (SOE) besides ensuring good governance. In the proposed changes, future board directors, including government and independent members, would undergo performance evaluations by the board’s nomination committee.\nRecommendations for removal would be sent to the federal government for approval.\nThe act would empower the government to nominate independent directors through an institutionalised mechanism and provide for the majority of independent directors, security of tenure, removal criteria, enhanced board independence, and appointment of chief executive officers on the recommendations of the boards.\nThe Statement of objects and reasons of the bill says that the SOEs (Governance and Operations) Act was promulgated in February 2023.\nThe Act, inter alia, provides for the matters relating to the constitution of Boards of Directors of SOEs. Presently, there is a need to reconstitute the Boards of SOEs to better align them with the reform initiatives aimed at restructuring and transformation as well as privatisation of certain entities. In order to achieve the above objective, there is a need to strengthen the provisions for the removal of directors under the SOEs Act.\nLeader of the Opposition, Omar Ayub Khan alleged that the amendments to be introduced in the legislation were not shared with the members of the Committee.\n“There should be certain quantitative matrixes and criterion to appoint the board of directors based on evaluation of their performance,” Omar Ayub Khan said.\nLater, the Speaker National Assembly prorogued the session sine die.",
  "retrievedAt": "2025-08-11T03:49:45.788Z"
}
