{
  "title": "PTI govt assisting ECP to hold transparent elections through election reforms: Farrukh Habib",
  "link": "https://www.app.com.pk/national/pti-govt-assisting-ecp-to-hold-transparent-elections-through-election-reforms-farrukh-habib/",
  "date_published": "2021-09-12T13:09:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Sep 12 (APP):State Minister for Information & Broadcasting Farrukh Habib said on Sunday the PTI government was actively assisting Election Commission of Pakistan (ECP) to hold fair, free and impartial elections through elections reforms.\nAddressing a press conference during his visit to fruits & vegetable market (Sabzi Mandi)Sadhar here at Jhang Road, he said that past regimes intentionally ignored the importantaspect of holding fair, free and impartial elections and after each election, allegations ofrigging were levelled by the defeated parties.\nHe said the PTI government intended to introduce Electronic Voting Machine (EVM) withan aim to ensure a credible election results, but opposition parties were opposing it despitethe fact that the clause 103 of the Elections Act 2017 had clearly mentioned that technologycould also be used to ensure fair, free and impartial elections.\nHe said that under article 103, the ECP was empowered to use electronic machines.Similarly, under the clause 94 of the Elections Act 2017, oversees Pakistanis had beengiven right to vote and for this purpose, the ECP was asked to launch a pilot project toinvolve the expats in the main election process.\nFarrukh Habib said that overseas Pakistanis were sending 30 billion dollars remittancesannually but the opposition parties were not willing to give them the right of vote despitetheir major contribution towards the national economy.\nHe said the PTI government wanted to help election commission but it was strange thatthe ECP had raised objections. A group who was in the habit of rigging the polls wasopposing transparency in the election process, he added.\nHe said the ECP also failed to eliminate the bogus votes registered in the previous lists.He said that in a single house, more than 200 votes were registered. Similarly, fake ballotpapers were printed by the ‘Thappa Mafia’ who was opposing the EVM.\nThe State Minister said that the objection by ECP were carried by media before it werereceived by the government.\nHe said the ministry of Science and Technology and the ministry of Information Technologywere working on elections reforms as true democratic system could only be strengthenedby ensuring fair and free elections.\nIn this connection, more than 50 meetings were held in which deliberations were made toeliminate the genuine reservations of opposition parties, but Maryam, Bilawal and Shahbazrejected the EVM without evaluating it scientifically, he added.\nDuring a question-answer session, Farrukh Habib said that Form-45 would be releasedthree minutes after the completion of polling.\nThe state minister said that people of Pakistan had the right to elect government in a mosttransparent manner. “We have used technology to compile the land record and startedelectronic banking”, he said and added that on the same pattern electronic voting machineshad been introduced to end the objections of rigging in future.\nHe said, though ECP was a constitutional autonomous body, but the parliament was a supremebody and it must be given due respect.",
  "retrievedAt": "2025-08-11T21:13:02.346Z"
}
