{
  "article_id": "2025-05-21_cfcf5e3666c17e94edcfd52be34bd7b1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/khuzdar-attack-an-assault-on-pakistan-not-just-balochistan-ppp-leader-raisani-condemns-terrorism-rejects-negotiations/",
    "retrieved_at": "2025-08-27T15:43:21.782Z"
  },
  "metadata": {
    "title": "Khuzdar Attack an assault on Pakistan, not just Balochistan: PPP leader Raisani condemns terrorism, rejects negotiations",
    "author": null,
    "date_published": "2025-05-21T14:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 287,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP):Nawabzada Jamal Khan Raisani, a Pakistan Peoples Party (PPP) leader and Member of the National Assembly from Balochistan, declared on Wednesday that the recent terrorist attack in Khuzdar was not merely an assault on children or Balochistan but a direct attack on Pakistan itself. Speaking in the National Assembly, Raisani asserted that the Pakistan Army is actively combating terrorists in Balochistan, emphasizing that the fight against terrorism is a national struggle requiring collective resolve. \"This war is not the military's battle alone. Terrorism is a threat to the entire nation,\" Raisani stated, urging political unity and public awareness. He condemned the \"cowardly attack\" in Khuzdar, which claimed innocent lives, including children, and lamented, \"My heart weeps tears of blood for the martyred innocents.\" Raisani vehemently opposed calls for dialogue with terrorists, questioning, \"Who should we negotiate with? Those who slaughter our children and deny us the right to education?\" He invoked the assassinations of former Prime Minister Shaheed Mohtarma Benazir Bhutto and his father, Saraj Raisani-both advocates of peace-as tragic examples of failed engagement. \"Even after their martyrdom, some suggest talks with terrorists. This is meaningless,\" he asserted. The PPP leader blamed the 2018 policy of negotiating with militants for exacerbating violence in Khyber Pakhtunkhwa and Balochistan. \"Such appeasement only fuels terrorism,\" he argued, calling for decisive action over mere condemnation. Raisani stressed that the conflict transcends Balochistan, resonating with grieving mothers nationwide who have lost loved ones to terrorism. \"Every mother who has lost her child in this war knows this is Pakistan's fight,\" he said, demanding unwavering resolve against \"cowardly enemies.\" Rejecting any compromise, Raisani concluded: \"There can be no negotiations with terrorists. The nation must stand united to eradicate this menace.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}