{
  "article_id": "2025-05-21_1059b6c29e3c4ebd40068f4c900468b5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pre-budget-dialogue-calls-for-inclusive-fiscal-reforms-to-empower-children-women/",
    "retrieved_at": "2025-08-27T15:43:24.703Z"
  },
  "metadata": {
    "title": "Pre-budget dialogue calls for inclusive fiscal reforms to empower children, women",
    "author": null,
    "date_published": "2025-05-21T13:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 995,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP):Experts at a pre-budget dialogue on Wednesday called for inclusive fiscal reforms in the upcoming budget to empower children and women that get least attention in the fiscal discourse of the country as a residual component. The dialogue on 'Strengthening Fiscal Policies for Inclusive and Sustainable Development: Advancing Child and Gender-Responsive Public Investments' was jointly organized by the Ministry of Planning, Development and Special Initiatives, UNICEF Pakistan and Sustainable Development Policy Institute (SDPI), said a press release. The dialogue, which mainly focused on aligning Pakistan's fiscal strategy with inclusive growth goals, brought together key government officials, economists, development partners, and civil society representatives to deliberate on reorienting fiscal frameworks toward equity, sustainability, and inclusive growth. The speakers said that with a budget deficit of over 6.8% of the GDP and debt levels exceeding 70%, there is an urgent need to safeguard and expand investments in health, education, nutrition, and social protection. Despite tax revenues below 10% of the GDP, they said, development for children and marginalized groups cannot be delayed. Insights from UNICEF's Public Expenditure Reviews (PERs) revealed a persistent gap between policy commitments and actual social sector allocations, notably in provinces like Sindh where education spending has dropped to 1.8% of GDP. Anchored in the government's Uraan Pakistan programme - specifically the equity and empowerment pillar - the speakers called for targeted fiscal shifts toward inclusive and people-centered development. Key priorities include digital literacy, green skills, education access, and civic engagement, especially for women, youths, and underserved communities. The dialogue featured one plenary and three panel sessions with open-floor participation, exploring both the challenges and solutions in aligning public finance with inclusive development goals. In his opening remarks, Dr Abid Qaiyum Suleri, the Executive Director of SDPI, said that Pakistan is navigating two IMF programmes - the Extended Fund Facility (EFF) and the Resilience and Sustainability Facility (RSF) - with contrasting objectives. While the EFF focuses on reducing energy circular debt and raising energy prices, the RSF emphasizes green technology and climate resilience. \"This paradox presents both challenges and opportunities,\" Dr Suleri said and urged the policymakers to integrate climate tagging into development to empower girls and adolescents through climate-aligned and inclusive fiscal planning. Sharmila Rasool, the UNICEF Representative in Pakistan, emphasized the importance of human capital in a rapidly changing global environment. \"Pakistan's Human Capital Index stands at 0.41, which suggests that only 41% of children will reach their full potential,\" she said. Ms Rasool called for bringing about urgent reforms in tax equity and public expenditure. She noted that Pakistan's regressive tax system unfairly burdens the poorest while shielding the elites. She reaffirmed the UNICEF's commitment to supporting Pakistan's efforts to align spending with equity, especially for children and adolescents. Delivering the keynote address on behalf of the Federal Minister for Planning, Dr. Muhammad Ali Talpur, Joint Chief Economist, Ministry of Planning, highlighted that under the Uraan Pakistan, fiscal policy must be a tool for social justice. \"Our fiscal decisions must uplift those most underserved - especially children, women, and low-income families,\" he said, adding that fiscal policy is also social policy, he announced the formation of a high-level technical working group to explore reallocation strategies, identify new fiscal opportunities, and reinforce Pakistan's commitment to inclusive development under the Sustainable Development Goals (SDGs). The first panel discussion titled Social Sector Public Investments in Provinces - Challenges & Opportunities was initiated by Dr Lutf ur Rehman, the Director Research, Planning and Development Department, Government of Balochistan. He presented the province's challenges, including dysfunctional girls' schools and inadequate spending on children's services. He also stressed the need for targeted investments to uplift marginalized populations. Pir Aimal, the Assistant Chief IDS, Planning and Development Department, Government of Khyber Pakhtunkhwa, highlighting the geopolitical challenges in the tribal regions, said that the province prioritizes social sector financing under the 5Es-based Uraan Pakistan programme. A representative from the Sindh Government shared that post-flood reconstruction efforts are being directed toward social protection, education, and healthcare. The upcoming provincial budget aims to balance disaster recovery with long-term social investment. Ayesha Javaid from the Ministry of Finance, chaired the second panel on Understanding the Macroeconomic Context - Tax Justice, Debt Management, and Fiscal Constraints. She mentioned that for the first time, Pakistan's federal budget is gender responsive. She acknowledged the extensive institutional efforts needed to incorporate gender into fiscal planning. Dr Ashfaq Hassan Khan, the Head of the NUST Policy Studies Department, presenting a critical economic analysis, stressed that Pakistan's budget deficit is driven by soaring interest payments and that the current monetary policy, particularly high interest rates, is unsustainable. He advocated for a freeze on new infrastructure projects and called for immediate privatization of loss-making state enterprises to relieve fiscal pressure. Tobias Becker, the World Bank representative, presented empirical findings under the Uraan Pakistan, indicating that the poor contribute disproportionately to the tax system while benefiting less from public spending. He noted excessive subsidies in electricity and tertiary education and urged reorientation toward primary education and equitable subsidy distribution. During the third session on Leveraging Alternative Financing Opportunities to Create Fiscal Space for Public Services, Dr Sajid Amin Javaid, the Deputy Executive Director at SDPI, underscored that gender is often treated as a residual issue in financial policy. He called for a dedicated public finance and social investment framework that incorporates gender, climate, and private sector financing. \"We need a body focused on mobilizing social investments and modernizing our industrial and regulatory systems,\" he suggested. Saima Bashir, the Member of Social Sector, Planning Commission, thanked the participants for their robust engagement and highlighted key macroeconomic indicators showing recovery. \"Real GDP growth stands at 2.38%, and inflation has eased significantly. However, poverty remains high, and 25.6 million children are still out of school,\" she noted. Ms Bashir emphasized that inclusive fiscal reform is not a cost but an investment. A high-level working group will be convened to explore reallocations and alternative financing models targeting children, youths, and women.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}