{
  "article_id": "2025-05-21_1b6d654a885cb108ddb067f4afd17225",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mushaal-mullick-pays-tribute-to-martyrs/",
    "retrieved_at": "2025-08-27T15:44:11.034Z"
  },
  "metadata": {
    "title": "Mushaal Mullick pays tribute to martyrs",
    "author": null,
    "date_published": "2025-05-21T12:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP):Peace and Culture Organization Chairperson Mushaal Hussein Mullick and wife of jailed Kashmiri Hurriyat leader Muhammad Yasin Malik was addressing to the participants at martyrdom anniversary of prominent freedom fighters Mirwaiz Maulvi Muhammad Farooq, Khawaja Abdul Ghani Lone and the martyrs of Hawal. The event was organized by All Parties Hurriyat Conference a memorial service for Mirwaiz Maulvi Muhammad Farooq and Khawaja Abdul Ghani Lone here on Wednesday at Kashmir House. Mushaal Hussain Mulick said that those who saw the dreams of freedom with their own eyes were martyred and today we pay tribute to these mothers, sisters and sons and other family members. She said \"I salute Mirwaiz Maulvi Muhammad Farooq and Khawaja Abdul Ghani Lone who fought through his pen. \"We remembered the sacrifices of great leaders, our comrades are the power of faith, I always remember the little girl Asifa Mashal Malik, the terrorism that took place in Pahalgam was done in front of the world. The RSS government of India killed its own people, including two Kashmiris, anyone who is connected to the Kashmir cause is blessed and the issue of Kashmir is in front of everyone. Trump offered to solve the Kashmir issue, China and Turkey are with us, Hang this nation, but we are not afraid Mushaal urged. The nation has achieved a success, the issue of Kashmir has come before the world and we hope from the Field Marshal to the Pakistani government, our next goal is to release the leadership.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}