{
  "article_id": "2025-05-21_163f566db3422654c1d552ed1baba8e0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speakers-pays-tribute-to-pakistan-china-ties-at-74th-anniversary-of-diplomatic-ties/",
    "retrieved_at": "2025-08-27T15:45:29.197Z"
  },
  "metadata": {
    "title": "NA Speakers pays tribute to Pakistan-China ties at 74th anniversary of diplomatic ties",
    "author": null,
    "date_published": "2025-05-21T16:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 584,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP): Speaker National Assembly (NA), Sardar Ayaz Sadiq on Wednesday, paid tribute to enduring Pakistan-China ties at 74th anniversary of diplomatic ties between both nations. Speaker NA Sardar Ayaz Sadiq has expressed profound sorrow over the tragic terrorist attack earlier in the day in Khuzdar, Balochistan, which claimed the lives of six people, including four innocent children. \"We condemn this heinous and cowardly act in the strongest possible terms. Our prayers and thoughts are with the victims and their families,\" he said, calling for a moment of silence to honour the departed souls.He expressed these views during his address at a diplomatic reception held in Islamabad to commemorate the 74th anniversary of Pakistan-China diplomatic relations. The event was attended by Chinese Ambassador Mr Jiang Zaidong, members of the diplomatic corps, senior officials, and distinguished guests. Speaker NA Sardar Ayaz Sadiq has emphasized that such moments of grief and solidarity only strengthen the resolve and the bonds between both nations. The Speaker expressed profound sorrow over the tragic terrorist attack earlier in the day in Khuzdar, Balochistan, which claimed the lives of six people, including four innocent children. \"We condemn this heinous and cowardly act in the strongest possible terms. Our prayers and thoughts are with the victims and their families,\" he said, calling for a moment of silence to honour the departed souls friendly nations. \"Even in moments of sorrow, we find strength in the enduring friendships that bind us together. Today, we celebrate a relationship that has withstood the tests of time and emerged stronger over 74 remarkable years,\" he stated. He hailed the Pakistan-China partnership as one that is \"higher than the mountains, deeper than the oceans, and sweeter than honey,\" echoing the sentiments once shared by President Xi Jinping during his historic address to the Parliament of Pakistan in 2015. \"Our friendship is a beacon of regional cooperation and global peace,\" the Speaker noted. Highlighting the strategic depth of the bilateral relationship, Sardar Ayaz Sadiq spoke of China's remarkable achievements in economic development, technological innovation, and defense modernization, and acknowledged Pakistan's pride in being a partner in this journey. \"Our two nations have walked hand in hand on the path of mutual progress, solidarity, and unwavering trust,\" he added. He also underscored the importance of defence cooperation, calling it a key pillar of strategic strength. The Speaker praised the induction of advanced Chinese military technologies into Pakistan's defence arsenal, including the JF-17 Thunder and J-10C fighter jets, as well as the PL-15 long-range missile systems. \"These cutting-edge technologies are not only enhancing our deterrence capabilities but are also a testament to the strength and reliability of our partnership,\" he stated. Looking ahead, the Speaker reiterated Pakistan's commitment to further deepening ties through the second phase of the China-Pakistan Economic Corridor (CPEC), which aims to expand cooperation in sectors such as agriculture, information technology, mining, and climate resilience. Sardar Ayaz Sadiq has expressed optimism about the upcoming visit of the Chinese Premier to Pakistan, calling it an opportunity to strengthen people-to-people ties and further institutionalize strategic cooperation. \"Our bond is a living story of brotherhood and trust-a legacy we cherish and a future we are building together,\" he said. Chinese Ambassador Mr Jiang also expressed his sorrow over the tragic loss of lives of innocent children. He said that China stands with Pakistan in the war against terrorism. He said that China and Pakistan would continue to cooperate in all fields of life for development and prosperity of nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}