{
  "article_id": "2025-05-21_ed42ae3340fb282fd02a0135db465378",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pak-china-strategic-cooperative-partnership-ironclad-friendship-to-grow-further-dpm-dar/",
    "retrieved_at": "2025-08-27T15:43:04.611Z"
  },
  "metadata": {
    "title": "Pak-China strategic cooperative partnership, ironclad friendship to grow further: DPM Dar",
    "author": null,
    "date_published": "2025-05-21T14:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP): Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar on Wednesday said that since the establishment of diplomatic ties between Pakistan and China, 'the strategic cooperative partnership and ironclad friendship', between the two countries had been strengthened with the passage of time. Talking to APP during his official visit to China, the deputy prime minister/ foreign minister further apprised that China had been an old strategic partner of Pakistan and the two countries were celebrating the establishment of 74th anniversary of their diplomatic relations on May 21. He said these ties had depths and were fully maintained over the years, adding that these bilateral relations would grow further while his recent visit was a manifestation of the same. The DPM/FM, about his visit, further said that they had held a detailed and productive interaction with the Chinese leadership. They held bilateral discussion with Member of the Political Bureau of the 20th CPC Central Committee and Foreign Minister of China Wang Yi, besides they held meeting with Afghanistan's Acting Foreign Minister Amir Khan Muttaqi. During the trilateral round which was hosted by China, Dar said the three countries held detailed discussions on all topics and it was agreed upon that the sixth round of their trilateral meeting would be held in Kabul.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}