{
  "article_id": "2025-05-21_c848cf7cc5852af67aa362094f964566",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kamal-reaffirms-commitment-to-whos-health-agenda/",
    "retrieved_at": "2025-08-27T15:44:12.399Z"
  },
  "metadata": {
    "title": "Kamal reaffirms commitment to WHO’s health agenda",
    "author": null,
    "date_published": "2025-05-21T11:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 276,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP):Federal Minister for Health Syed Mustafa Kamal has paid tribute to the World Health Organization (WHO) for its pivotal role in promoting global health. \"Pakistan reaffirms its unwavering commitment to the WHO's global health agenda,\" Kamal said during his address to the 78th session of the World Health Assembly in Geneva. He appreciated the efforts of member states and the Intergovernmental Negotiating Body in drafting a pandemic agreement, noting that despite facing major challenges, Pakistan has made measurable progress. He highlighted significant achievements including a reduction in maternal and child mortality rates and improved immunization coverage. Kamal also underscored Pakistan's strong and effective actions against infectious diseases such as tuberculosis, HIV, malaria, dengue, and hepatitis. \"Polio eradication remains our top priority,\" he emphasized, adding that under the leadership of the Prime Minister, Pakistan is determined to become polio-free soon. Addressing regional concerns, Kamal condemned India's aggression, stating that innocent civilians including children have been targeted. \"Pakistan has given a strong response to Indian aggression,\" he stated. He also strongly condemned the targeting hospitals and medical personnel in Palestine. \"Such actions are a grave violation of international laws and an attack on the basic human right to health,\" Kamal asserted. He criticized India's use of water as a weapon, calling it a serious threat to public health in Pakistan. \"The Indus River system is vital - not only for drinking water but also for irrigating 80% of our crops and powering our hospitals and sanitation infrastructure,\" he explained. \"Weaponizing water and targeting health infrastructure violates international law,\" the Health Minister concluded, urging the international community to hold India accountable for endangering millions of lives.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}