{
  "article_id": "2025-05-21_d7b13170343e4c5b316995abc4737457",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/seminar-on-india-pakistan-relations-held-at-iiuis-faculty-of-social-sciences/",
    "retrieved_at": "2025-08-27T15:43:29.786Z"
  },
  "metadata": {
    "title": "Seminar on India-Pakistan relations held at IIUIâs faculty of social sciences",
    "author": null,
    "date_published": "2025-05-21T13:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 242,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP):The Department of History and Pakistan Studies at the International Islamic University Islamabad (IIUI) organized an important academic seminar on Wednesday at the Faculty of Social Sciences. The seminar was titled aFrom Pahalgam to Ceasefire: The Current State and Future of India-Pakistan Relations.a The keynote speaker was Professor Dr. Husnul Amin, Director of the National Institute of Pakistan Studies (NIPS) at Quaid-i-Azam University, Islamabad. In his address, Dr. Husnul Amin emphasized the importance of fostering constructive dialogue on the ongoing tensions, diplomatic developments, and prospects for peace between Pakistan and India. He stated that both countries must learn from past experiences and move forward to ensure lasting peace and stability in the region. He highlighted the pivotal role of academic institutions in nurturing realistic, responsible, and peace-oriented thinking among the youth through such scholarly engagements. According to him, this intellectual approach could pave the way for positive change in South Asia. Dr. Amin also offered an insightful and comprehensive overview of the historical background, current dynamics, and future prospects of India-Pakistan relations. The seminar was well-attended by faculty members, researchers, and students. A vibrant question-and-answer session followed the lecture, providing an engaging platform to explore various dimensions of bilateral relations. The seminar aimed to encourage informed dialogue on regional peace, ongoing diplomatic efforts, and the complex relationship between the two neighboring countries. The Department of History and Pakistan Studies described the event as a successful and intellectually meaningful initiative.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}