{
  "article_id": "2025-05-21_3cda947534ebbc01bae3e4d1a2e7f8f1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pti-lawyer-withdraws-petition-after-sc-found-its-language-objectionable/",
    "retrieved_at": "2025-08-27T15:43:21.782Z"
  },
  "metadata": {
    "title": "PTI Lawyer withdraws petition after SC found its language objectionable",
    "author": null,
    "date_published": "2025-05-21T14:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 300,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 21 (APP):The Supreme Court's constitutional bench on Wednesday adjourned the hearing of the Islamabad High Court (IHC) judges' transfer and seniority case until Friday, May 23. A five-member constitutional bench headed by Justice Muhammad Ali Mazhar heard the case. The other members of the bench included Justice Naeem Akhtar Afghan, Justice Shahid Bilal Hassan, Justice Salahuddin Panhwar, and Justice Shakeel Ahmed. During the proceedings, Advocate Idrees Ashraf, representing the founder of Pakistan Tehreek-e-Insaf (PTI), continued his arguments. At one point, Justice Shahid Bilal Hassan asked the counsel to read paragraph 4 of the petition, questioning, \"What have you written? Has any political leader in the country's history ever filed such a petition?\" Justice Muhammad Ali Mazhar remarked that the content of the petition was embarrassing for the High Court judges. Justice Shahid Bilal Hassan further commented, \"My inclination is to dismiss the petition with a fine.\" Justice Mazhar noted that in the past, judicial transfers had a set duration, but this condition was removed through the 18th Constitutional Amendment. He added that under the current system, judicial appointments fall under the jurisdiction of the Judicial Commission. \"If such words were used about me, I would have felt ashamed too,\" Justice Mazhar said, referring to the content of the petition. Advocate Idrees Ashraf withdrew the petition, stating that senior lawyer Shoaib Shaheen is representing Founder PTI in a separate petition. \"I filed the petition on behalf of Raja Muqsit, and such language was not used in it,\" he clarified. Following Ashraf's arguments, Advocate Faisal Siddiqi, representing the Karachi Bar Association, began presenting his case. Justice Mazhar observed that the two transferred judges were the most junior on the seniority list. The constitutional bench then adjourned further proceedings until Friday, May 23, when Advocate Faisal Siddiqi will resume his arguments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}