{
  "article_id": "2025-05-21_19fad1d4296a8da32b1388a977196275",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-kazakhstan-agree-to-strengthen-ties-through-road-naming-joint-projects/",
    "retrieved_at": "2025-08-27T15:46:13.382Z"
  },
  "metadata": {
    "title": "Pakistan, Kazakhstan agree to strengthen ties through road naming, joint projects",
    "author": null,
    "date_published": "2025-05-20T19:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 20 (APP):Pakistan and Kazakhstan have agreed to name roads in each other's capitals to strengthen bilateral ties, the Capital Development Authority (CDA) announced on Tuesday. During a meeting between CDA Chairman Muhammad Ali Randhawa and Kazakhstan's Ambassador Yerzhan Kistafin, the two sides decided to name a road in Astana after Pakistan's founder, Quaid-e-Azam Muhammad Ali Jinnah. In return, Islamabad will name a road after Kazakhstan's national poet, Abai Qunanbauly. The ceremonies will take place during the Kazakh president's upcoming visit to Pakistan. Ambassador Kistafin praised CDA's efforts in developing Islamabad and expressed Kazakhstan's commitment to boosting economic, tourism, and trade cooperation. \"We appreciate CDA's initiatives in maintaining Islamabad's beauty and progress,\" he said. The discussions also covered key joint projects, including a modern slaughterhouse, a Business Facilitation Center, and a state-of-the-art football stadium in Islamabad. Both sides agreed to appoint focal persons for closer coordination. Chairman Randhawa highlighted Islamabad's development projects, such as electric buses, food streets, and adventure parks, and stressed the importance of stronger business and cultural ties. \"Pakistan values its brotherly relations with Kazakhstan,\" he said. The Kazakh envoy invited Randhawa to Astana for further talks on mutual cooperation. The meeting ended with the exchange of souvenirs. The two nations reaffirmed their commitment to deepening collaboration under their sister-city agreement, originally signed in 2004.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}