{
  "article_id": "2025-09-21_48dc30197f2fe04b7d881bd9a0c530b3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/flood-water-refuses-to-recede-pump-prices-refuse-to-fall-communities-share-to-endure-the-double-crisis/",
    "retrieved_at": "2025-09-21T21:07:44.354Z"
  },
  "metadata": {
    "title": "Flood water refuses to recede, pump prices refuse to fall – communities share to endure the double crisis",
    "author": null,
    "date_published": "2025-09-21T16:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 721,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 21 (APP):As floodwaters continue to stagnate across parts of Pakistan, thousands of families are still struggling to clear their homes and start rebuilding. Experts told that water in low-lying areas could remain for weeks - even months - making life harder for already displaced families. Government departments and local authorities are draining water from roads and city centers. But in many towns and villages, people are doing it themselves, using water pumps to clear homes, basements, and courtyards. These pumps - once affordable - are now rare and costly. In Sialkot, traders told APP pump prices have risen sharply: a 1-inch pump now sells for Rs 22,000, a 3-inch for Rs 27,000, and a 4-inch for Rs 34,000. Demand is highest for 1-inch to 3-inch pumps, as flood-hit families try to clear water from homes and fields. Pipes have also become more expensive, with an increase of Rs 5 to 10 per foot. For families who lost belongings in the floods, even buying basic hoses is a burden. \"We're not trying to profit off people's misery,\" said Imran Qureshi, a pump supplier in Dera Ghazi Khan. \"Our costs are up too - fuel is expensive, parts are delayed, and demand is huge. We're trying to meet needs, but there just aren't enough pumps,\" he told APP. Technical Issues: Mud, Voltage, and Repairs The struggle doesn't end after buying or renting pumps. In many villages, pumps break down due to low generator voltage and sticky flood mud. Without filters, clay-like silt clogs the impeller, forcing families to open and clean the machine often. \"People are running pumps without strainers, and the impellers jam,\" one mechanic told APP. \"You have to keep opening the motor just to scrape it clean.\" Repair costs are also rising. \"Copper wire is almost Rs 200 to 300 more per kilogram,\" said electrician Mehmood. \"When water damages windings, rewinding costs go up.\" Electrician Asghar added: \"Our labor charges are the same, but copper is expensive. People think we're charging more, but it's really the material cost,\" he told APP. Families who can't buy pumps rent them at Rs 800 to Rs 1,200 per hour. Some pay up to Rs 5,000 a day. For daily wage earners, that's unaffordable. \"I paid Rs 5,000 per day just to rent a pump for three days,\" said Shahnaz Bibi, a widow in Muzaffargarh. \"That's more than what my son earns in a week. But we had no choice - the water was inside our home and our children were getting sick,\" she told APP. In border villages near Sialkot like Kundan Hor, power remains cut. Families rely on generators, especially 1 kVA sets. But rising fuel prices make it costly. \"The customers have no money - everything has drowned,\" said Sajid, owner of Sialkot Material Store. \"Still, we sold pumps at reduced rates to NGOs, keeping almost no profit. We understand people's pain,\" NGOs like Al-Khidmat Foundation and the Cantonment Board bought pumps in bulk from Sialkot traders for use in Pasrur, Sambrial, Daska, Bajwat, and other affected areas. Mid-sized pumps are now used where water is receding, helping residents clear courtyards and fields. But in places with four to five feet of water, pumping is impossible. \"If water surrounds you on all sides, where can you drain it?\" asked a relief worker in Multan. Al-Khidmat's Multan coordinator, Ismail Taj, told APP fallen poles and broken lines have left many areas without power. \"Without generators, pumps are useless,\" he said, urging the government to restore electricity fast. Despite the hardships, stories of support keep coming. Families with pumps often share them freely. \"My neighbor gave us his pump for free when he was done,\" said Waseem Ali, a schoolteacher in Swat. \"We used it one night, then passed it on to another street. Without that, we'd still be underwater. According to government and UN figures shared with APP, over 9,000 homes have been damaged or destroyed this year. Recovery is slow due to high costs and unequal access to tools. Residents are calling for urgent government action - subsidized pumps and fuel, faster drainage, and relief for food, livestock, and shelter. As floodwaters linger, so do the hardships. But amid rising costs and failing equipment, the resilience of communities - backed by NGOs and fair-minded traders - keeps hope alive.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}