{
  "article_id": "2025-09-21_6490a0e2e7ad493d99ba33c32c7091c9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/isnet-to-conduct-international-training-courses-this-month/",
    "retrieved_at": "2025-09-21T11:26:54.793Z"
  },
  "metadata": {
    "title": "ISNET to conduct international training courses this month",
    "author": null,
    "date_published": "2025-09-21T13:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 21 (APP):The Inter-Islamic Network on Space Sciences and Technology (ISNET), established under COMSTECH, is set to organize two international training courses this month in collaboration with Pakistan's national space agency, SUPARCO. The initiative aims to strengthen technical expertise in applying space science and technology for sustainable development among member states of the Organization of Islamic Cooperation (OIC). As a founding and host member of ISNET, SUPARCO continues to play a central role in advancing the network's mandate of capacity building, knowledge exchange, and promoting the peaceful use of space science. The first course, Programming for Web GIS Development Using Open-Source Technologies, will be held in Lahore from September 22-26. The program will provide hands-on training in cartography, Web GIS, spatial databases, user interface development, spatial analysis, and report generation. Given the growing importance of Web GIS in disaster management, climate monitoring, agriculture, and urban planning, the training will emphasize practical applications. A special session by an international expert from Azerbaijan on \"GeoServer 2.0 for Space Applications\" will highlight the integration of open data, cloud AI, and machine learning for advanced Earth insights. Delegates from Sudan, Senegal, Iraq, Tunisia, Turkiye, and Libya are participating in the training. The second course, Space-Based Disaster Management - Shifting Focus from Reactive to Proactive Approaches, will take place in Islamabad from September 29 to October 03. The course will provide participants with practical skills in remote sensing applications, rapid damage assessment, and disaster modeling. Training modules include flood hazard assessment using advanced tools such as the HEC-RAS 2D Model, with a focus on managing disasters like floods, earthquakes, landslides, and droughts. Delegates from Sudan, Senegal, Iraq, Tunisia, Turkiye, and Libya will also attend this program. Through these initiatives, ISNET seeks to promote regional cooperation in space sciences and foster innovation for sustainable development. SUPARCO's collaboration reflects Pakistan's commitment to advancing space applications for the benefit of OIC member states.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}