{
  "title": "Govt to bring back Nawaz Sharif through legal course: Senator Faisal",
  "link": "https://www.app.com.pk/national/govt-to-bring-back-nawaz-sharif-through-legal-course-senator-faisal/",
  "date_published": "2020-08-26T06:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Senator Faisal Javed on Wednesday stated in the Senate that government will bring back leader of Pakistan Muslim League (N) Nawaz Sharif to Pakistan through legal course.\nSpeaking in the Senate, he said Nawaz Sharif went out of Pakistan on medical grounds with the permission of court and guarantee of his brother Shehbaz Sharif.\nHe gave details of the facilities of health sector provided by the government of Pakistan Tehreek i Insaf in Khyber Pakhtunkhwa including the Sehat cards for whole population of the province, added that needy patient’s family could now get Rs one million every year for medical treatment.\nHe said Imran Khan had everything in Pakistan, adding Imran got his medical treatment in Pakistan and sold his flat in London and brought back money to the country through official banking channels.\nThe society could only move forward when there was equality among people, he stressed.\nSenator Mushahid Hussain Syed urged for implementing a national policy to promote sports which was a unifier for the country and utilized talents of youth.\nMushahid suggested building up of a national sports museum to highlight the achievements of Pakistan sportsmen who made huge achievements in the fields of cricket, hockey, squash, snooker, kabbadi and other games.\nSenator Jehanzeb Jamaldini drew attention towards the closure of National Bank’s regional branch in Sibi and asked for its opening as people of the area were facing difficulties after the closure.\nChairman Senate Sadiq Sanjrani referred the matter to the relevant standing committee.\nSenator Manzoor Kakar urged the opposition to support the government and law enforcement agencies in the fight against terrorism.\nHe called for government intervention to increase facilities for education of low income sections of society.\nSenator Aurangzeb Orakzai raised the issue of non provision of funds for the rehabilitation of tribesmen affected during operations against militants.\nOn the suggestion of Minister of State for Parliamentary Affairs Ali Muhammad Khan, the chair assured that a parliamentary committee will be formed to resolve issues of people in tribal districts of Khyber Pakhtunkhwa.\nThe committee will play the role of a bridge among the Parliament and the federal and provincial governments.\nSenator Nauman Wazir Khattak stressed on the making of energy efficient electric appliances like fans to save thousands of megawatts of electricity in summer months.\nSenator Raza Rabbani criticised the proposed Anti-Money Laundering bill because of a provision asking businesses to report about their customers otherwise they will be liable for legal action.\nSenator Mushahidullah and Senator Ghous Khan Niazi of PMLN said that unnecessary statements should be avoided on the health of political leadership.\nLater before proroguing the session, Chairman Sanjrani read a ruling\nwith respect to two bills titled “The Islamabad Capital Territory Waqf Properties Bill, 2020” and “The Anti-Money Laundering (Second Amendment) Bill, 2020”, as passed by the National Assembly on August 24 and then placed before the Senate on August 25.\nThe Senate rejected both the bills on Tuesday as the opposition did not agree to their passage.\nThe chairman ruled that the proceedings of the house for these two bills during the Senate sitting were strictly in accordance with the requirements of Rules of Procedure and Conduct of Business in the Senate, 2012.",
  "retrievedAt": "2025-08-11T19:43:06.321Z"
}
