{
  "title": "Pakistan’s global stature elevated for firm stance on peace, progress: FM",
  "link": "https://www.app.com.pk/national/pakistans-global-stature-elevated-for-firm-stance-on-peace-progress-fm/",
  "date_published": "2020-08-26T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Foreign Minister Shah Mahmood Qureshi on Wednesday said Pakistan’s stature in the comity of nations was elevated due to its perseverance in pursuit of the principles of peace, progress, security and stability.\nThe Foreign Minister in a tweet shared a video clip highlighting two-year diplomatic success of the country with focus on strengthening ties with other countries for socioeconomic development and ensuring peace.\nThe video gave glimpses of key diplomatic achievements including effective highlighting of Kashmir issue at international fora with thrice discussed at the United Nations Security Council, debt relief announced by global economic bodies on call of Prime Minister Imran Khan and countering of India’s efforts to isolate Pakistan.\nPakistan’s stature in the comity of nations stands elevated because of our perseverance in the pursuit of the principles of peace, progress, security and stability. https://t.co/el7MF3GCwh#2YearDiplomaticSuccess\n— Shah Mahmood Qureshi (@SMQureshiPTI) August 26, 2020\nA major diplomatic success included visits of world leaders to Pakistan including Turkish President Recep Tayyip Erdogan, Saudi Crown Prince Mohamad bin Salman, UAE Crown Prince Zayed Al Nahyan, Emir of Qatar Sheikh Tamin bin Hamad al-Thani, Afghan President Ashraf Ghani, Duke and Duchess of Cambridge Prince Wiliams and Kate Middleton, Queen Maxima of Netherlands besides UNGA President Maria Fernanda Espinosa and President-elect Volkan Bozkir.\nOther areas included transformation of relations with China into economic partnership with important targets achieved in Phase-II of China Pakistan Economic Corridor (CPEC) & Sino-Pak Free Trade Agreement, establishment of Pak-Saudi Supreme Coordination Council and $10 billion agreement signed with Russia on laying 1,500 km offshore gas pipeline.\nPrime Minister Imran Khan’s key role in negotiating peace deal between the United States and Afghan Taliban and diffusing tensions between Saudi Arabia and Iran, Pakistan’s re-election to governing councils of Asia Pacific Centre for Development of Disaster Information Management & Statistical Institute for Asia and Pacific for 2019-2022 and Strategic Engagement Plan inked with European Union worth Euro 13 million, are other achievements.\nThe long list of Pakistan’s diplomatic achievements also include return of international sports to Pakistan, opening of Kartarpur Corridor to honour longstanding desire of Sikh community, release of 8,608 Pakistani prisoners from foreign jails and reinforcement of regulations on illicit financial flows.\nLaunch of e-visa for citizens of 175 countries, visa on arrival for 50 countries in tourist category and 95 countries in business category and selection of Pakistan as host for World Tourism Forum 2021 also make the country get a positive global recognition.",
  "retrievedAt": "2025-08-11T19:42:56.902Z"
}
