{
  "title": "Total coronavirus active cases in past 24 hours plunge to 8,987, 12 perish: NCOC",
  "link": "https://www.app.com.pk/national/total-coronavirus-active-cases-in-past-24-hours-plunge-to-8987-12-perish-ncoc/",
  "date_published": "2020-08-26T07:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): The number of total active coronavirus cases across the country have plunged to 8,987 where around 482 have been tested COVID-19 positive and 12 people have died due to COVID-19 in the past 24 hours across the country.\nNo coronavirus affected patient was on ventilators in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nNational Command and Operation Centre (NCOC) on Wednesday issued the latest statistics of COVID-19 deaths, positive cases and recovered patients across the country.\nAs many as 12 people have lost their lives due to COVID-19 during last 24 hours. Out of the total deceased 11 died in hospital and one died out of hospital on August 25.\nAlmost 113 ventilators were occupied across the country out of 1920 ventilators allocated for COVID-19 patients.\nDuring the last 24 hours, 482 people were tested coronavirus positive where the total active corona cases in the country were 8,987 on August 25.\nHowever, 24,593 tests were conducted on August across the country including 8,214 in Sindh, 9,908 in Punjab, 2,727 in Khyber Pakhtunkhwa (KP), 2,832 in Islamabad Capital Territory (ICT), 471 in Balochistan, 20 in Gilgit Baltistan (GB), 171 in Azad Jammu and Kashmir (AJK).\nAround 278,939 people had recovered so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out a total of 294,193 cases detected so far including 2265 in AJK, 12664 in Balochistan, 2745 in GB, 15546 in ICT, 35831 in KP, 96466 in Punjab and128676 in Sindh.\nSince the contagion clutched masses across the country around 6267 deaths were recorded. In Sindh 2384 people have died where 10 died in hospital and one died out of hospital on August 25.\nIn Punjab 2193 had died where one died in hospital on August 25, in KP 1248 people died. However, in ICT 175 deaths were recorded, in Balochistan 141, in GB 65 individuals had died whereas the lowest deaths occurred in AJK which were 61.\nAfter tireless strides since the first coronavirus case was reported in the country a total of 2,512,337 tests were conducted so far. Around 735 hospitals were equipped with COVID-19 facilities with 1,097 patients admitted across the country.",
  "retrievedAt": "2025-08-11T19:43:03.738Z"
}
