{
  "title": "Govt not to tolerate drug trafficking: Minister",
  "link": "https://www.app.com.pk/national/govt-not-to-tolerate-drug-trafficking-minister/",
  "date_published": "2020-08-26T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):Minister for Narcotics Control Azam Khan Swati Wednesday said that the government would not tolerate the menace of drug trafficking to avoid its negative consequences upon health and socio-economic development of the country.\nAddressing a ceremony held at ANF headquarters, he highlighted the vision of Prime Minister Imran Khan to address the growing challenge of narcotics trafficking, by adopting a collective, coherent and multilateral approach.\nAmbassador of Japan to Pakistan Kuninori Matsuda were also present at the occasion, said a press release.\nThe minister highly appreciated regular and sustainable capacity-building support by the Government of Japan as Pakistan’s long-term strategic partner through United Nations Office of Drugs and Crime (UNODC).\nAnti Narcotics Force (ANF), UNODC Country Office Pakistan (COPAK) handed over advanced IT equipment, personal protection gear and 20 Narcotics-Sniffer dogs to the ANF, through funding support by the Government of Japan.\nWhile welcoming the delegates, Ali Zulnoorain Sheikh, Deputy Director General ANF thanked the minister and the ambassador for gracing the auspicious occasion.\nHe offered gratitude to Jeremy Milsom, Representative and other senior officials from UNODC (COPAK) for providing regular technical support to the ANF and other members of Pakistan’s Inter Agency Task Force (IATF) on counter narcotics.\nThe IT equipment included hardware for automating Pakistan’s National Precursor Management System (NPMS), as well as networking among the ANF and other IATF members.\nAs many as, 20 Narcotics-Sniffer Canine dogs and 40 bullet proof vests and helmets were also handed over to the ANF by UNODC COPAK, under Japan-funded project ‘Strengthening border security against illicit drug trafficking and other transnational organized crime (2016-2020)’.\nIn his remarks, Jeremy Milsom said “It is indeed a great feeling and privilege to support a highly professional and competent force like the ANF, in its continuing efforts to save the world from drug trafficking and drug abuse – the greatest challenges of our times. UNODC COPAK well-recognizes ANF’s leading counter-narcotics role and that it will always remain UNODC’s main partner in Pakistan”.\nKuninori Matsuda assured that the Government of Japan continues to accord a high-priority to the peace-security-development nexus and therefore, it would continue endeavors to build Pakistan’s counter-narcotics capacity.\nHe also recognized ANF as the leading counter-narcotics law enforcement agency of Pakistan.\nThe ambassador also offered condolences on the recent sacrifices made by ANF personnel in the line of duty, whereby four ANF personnel were martyred during two major encounters with the drug trafficking networks.",
  "retrievedAt": "2025-08-11T19:43:14.195Z"
}
