{
  "title": "China marginalized India in region: Indian strategic expert",
  "link": "https://www.app.com.pk/national/china-marginalized-india-in-region-indian-strategic-expert/",
  "date_published": "2020-08-26T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):An Indian defense analyst opined on Wednesday that India’s military confrontation with China will have serious ramifications for it and one of the obvious consequences is the increased strategic cooperation between Beijing and Islamabad.\nIndian military and strategic expert Pravin Sawhney was speaking at a webinar hosted by the Center for International Strategic Studies (CISS) on the conflict between Indian and Chinese troops on the Line of Actual Control in Ladakh in May and June, according to a press release issued by the think tank.\nThe most serious clash happened in June in which nearly 20 soldiers were killed, which were the first fatalities in a military conflict between the two countries in nearly 45 years.\nSawhney said the event had a cascading effect for India, which is now facing problems in its external relations with all its neighbors.\nHe noted that India had been marginalized by China in its neighborhood owing to “lack of principled engagement with its neighborhood”.\nHe noted that one of the outcomes of the event would be the speeding up of the China-Pakistan Economic Corridor (CPEC), which is the flagship project of the Chinese Belt and Road Initiative.\nHe feared that this could have serious repercussions for India.\nThe Indian expert urged his country’s leadership to engage China in a principled manner to move beyond the incident.\nExecutive Director CISS, Ambassador Ali Sarwar Naqvi said the China-India dispute was rooted in the divergence of the perspectives of the two countries on the border separating them.\nHe observed that the escalation of their long-running dispute to the latest clash could have been influenced by strategic developments like the burgeoning US-India partnership, the Quad, and rivalry in the Indian Ocean Region.\nFormer Defense Secretary Lt Gen (R) Naeem Khalid Lodhi opined that the Modi government’s August 5 move could be the real trigger behind the latest face-off although road development by India in Ladakh and other infrastructure construction projects set things in motion earlier this summer.\nHe expected that China would not back off from its claimed high areas. Strategically, he said, it provided a sort of relief to Pakistan as it will be difficult for India to make ingress into Kargil and Siachen areas in this situation. Pakistan, he further said, will be in a good position to respond to any Indian attack in Azad Kashmir.\nInternational Law Expert Ahmer Bilal Sofi said a crisis was always inevitable because of the unsettled status of the India-China border despite their agreements in 1993, 1996, and 2013.\nHe proposed approaching a forum like the International Court of Justice or Shanghai Cooperation Organization (SCO) for adjudication.\nChina expert Dr Fazal Rahman was of the view that India made a huge miscalculation by thinking that US pressure, and its newfound importance for Washington as a strategic partner, would help its actions go unchallenged by China. But, contrary to Indian assessment, Chinese troops thwarted its move.",
  "retrievedAt": "2025-08-11T19:43:03.139Z"
}
