{
  "title": "Chairman Senate urges unity for economic relief to masses",
  "link": "https://www.app.com.pk/national/chairman-senate-urges-unity-for-economic-relief-to-masses/",
  "date_published": "2024-04-10T10:20:00.000Z",
  "source": "APP",
  "content": "MULTAN, Apr 10 (APP): Chairman Senate, Yusuf Raza Gilani, on Wednesday underscored the importance of all political parties coordination to provide economic relief to the masses, terming it crucial for people effected by inflation.\nGilani made these remarks while speaking to the media alongside his sons, MNA Abdul Qadir Gilani and MPA Ali Haider Gilani, before offering Eid prayers at the Musa Pak shrine on Wednesday.\nHe urged that amidst the joyous occasion, one should not forget the plight of the oppressed Palestinians, expressing hope that their sacrifices would not go vain during such a critical juncture.\nDrawing parallels from his own past, Gilani noted that he had endured imprisonment during his political struggle, much like the political workers currently languishing in jail. However, he expressed confidence that their cases, now pending in court, would be adjudicated fairly.\nAcknowledging the challenges facing the nation, Gilani commended the resilience of the brave forces in dealing with them, a source of satisfaction for everyone.\nThe former Prime Minister pledged to contest the bye-election in NA-148, the constituency he vacated as an MNA upon assuming the role of Senate Chairman. “We will contest today’s bye-election just as we have done in the past,” he asserted.\nReflecting on recent political developments, Gilani disclosed that a delegation from the Pakistan Tehreek-e-Insaf (PTI) approached him to retain the position of opposition and parliamentary leader in the Senate. “We will honour this commitment,” he affirmed.\nGilani acknowledged the weighty responsibility bestowed upon him during this critical time but assured effective delivery within the framework of the constitution. “We will strive to collaborate with our allies to serve the country’s best interests,” he affirmed.\nResponding to a query, he reiterated the Pakistan Peoples Party’s (PPP) commitment to the creation of a separate province in the region, a longstanding part of their manifesto. He added that they would further advance this agenda through consultation with their allies.",
  "retrievedAt": "2025-08-11T01:48:07.810Z"
}
