{
  "title": "OIC to help Afghanistan, raise it’s issue at all foras: Kuwaiti FM",
  "link": "https://www.app.com.pk/national/oic-to-help-afghanistan-raise-its-issue-at-all-foras-kuwaiti-fm/",
  "date_published": "2021-12-18T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): Kuwaiti Foreign Minister Sheikh Dr Ahmed Nasser Al-Mohammed Al-Ahmed Al-Jaber Al-Sabah accompanied by a delegation on Saturday arrived in Pakistan to attend the 17th extraordinary session of the Council of Foreign Ministers of Organization of Islamic Cooperation (OIC), being held in the capital on December 19.\nFederal Minister for Science and Technology Senator Shibli Faraz and Special Assistant to the Prime Minister (SAPM) on Interfaith Harmony and Middle East Affairs Allama Tahir Ashrafi welcomed the Foreign Minister of Kuwait.\nSpeaking on the occasion, the Foreign Minister of Kuwait said that Afghanistan was a brotherly Islamic country which was currently in a difficult situation.\n“The Organization of Islamic Cooperation (OIC) will take steps to help Afghanistan in any case and will raise its voice for the Afghans,” the Kuwait Foreign Minister said.\nHe said that Afghanistan was a neighboring country of Pakistan and its assistance provided to Afghanistan was commendable.\nOn the occasion, Federal Minister for Science and Technology Senator Shibli Faraz said that it was an honor for Pakistan to host extraordinary session of the Council of Foreign Ministers of Organization of Islamic Cooperation (OIC). Pakistan, as a brotherly Islamic country, would continue its cooperation and assistance in the construction and development of Afghanistan.\nSAPM Allama Tahir Ashrafi said that the important meeting of OIC Foreign Ministers expressed unity and solidarity of all Muslim nations.\nHe said that Prime Minister Imran Khan would deliver an important message for peace and development of Afghanistan in his special address tomorrow (December 19).\nKuwait ambassador to Nawaf Abdulaziz Alenezi and senior officials from the Ministry of Foreign Affairs received the guests, as the host country rolled out a red carpet in honour of the dignitaries.",
  "retrievedAt": "2025-08-11T21:43:59.392Z"
}
