{
  "title": "Indian billionaire funding Myanmar military-owned firm sanctioned by US",
  "link": "https://www.app.com.pk/national/indian-billionaire-funding-myanmar-military-owned-firm-sanctioned-by-us/",
  "date_published": "2021-03-31T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): In a shocking revelations, two human rights groups alleged that Indian business magnate Gautam Adani paid around $52 million to Myanmar Economic Corporation – a Myanmar-military owned company, sanctioned by the United States and other western powers for human rights abuses.\nA report by the Australian Centre for International Justice (ACIJ) and Justice For Myanmar (JFM) exposed “shocking” new links between Adani Ports, and the Myanmar military owned company Myanmar Economic Corporation (MEC).\nAccording to the report, the Adani Ports subsidiary paid a minimum of US$30 million in land lease fees to MEC and a further US$22 million in land clearance fees.\nThe report ‘Port of Complicity: Adani Ports in Myanmar’ publishes leaked documents establishing for the first time the amount paid by Adani Ports and Special Economic Zone Limited’s (Adani Ports) Myanmar subsidiary, the Adani Yangon International Terminal Company Limited, which is constructing a container port in Yangon on military owned land.\nThe allegations that billionaire Gautam Adani is conducting business deals with a Myanmar military-linked company, came at a time when Washington and other Western powers are lobbying governments to act against the Myanmar army for the 1 February coup.\nThe report publishes explosive photos of Adani CEO Karan Adani exchanging gifts with the Commander-in-Chief of the Myanmar military, Senior General Min Aung Hlaing, in a tour of Mundra Port in India in July 2019.\nGautam Adani is the founder and the Chairman of the Adani Group which ranks among the top 3 industrial conglomerates in India. Adani Group is constituted of six publicly listed entities with combined market capitalization in excess of $80 billion; with businesses spanning across energy, ports and logistics, mining and resources, gas, defence and aerospace and airports, his official website says.\nPress Release  Dutch pension funds ABP & PFZW hold US$2.3 billion in shares in companies linked to #Myanmar’s military. Justice For Myanmar calls on pension funds to take action now\nPress Release  https://t.co/e25bdzdgrL\nBrief  https://t.co/2IIZzhsKeu#Myanmarcoup pic.twitter.com/ysdiB6EogU\n— Justice For Myanmar (@JusticeMyanmar) March 30, 2021\nAt the time of his visit, the Senior General was barred from visiting the United States because of the military’s atrocities against the Rohingya ethnic minority.\nFurther targeted sanctions, including financial sanctions, against the Senior General were imposed by the USA, Canada, the UK and the EU for his role in the military’s serious human rights abuses, and the recent military coup.\nThe photos contradict Adani Ports’ February 2021 statement that deny engagement with military leadership.\nThe damning revelations exposing Adani Ports’ financial transactions with the MEC have prompted calls for major investors like HSBC, Norges Bank, BlackRock, PGGP and TIAA among others, to immediately sever ties with Adani Ports.\nBuilding on the legal analysis of the UN Human Rights Council’s International Independent Fact-Finding Mission Report in 2019, the report warns that investments in companies who partner with the MEC can help finance the activities of the Myanmar military.\nThese activities include systematic and widespread human rights abuses, some of which amount to atrocity crimes and are the subject of investigations by international tribunals.\n#Australia must impose targeted sanctions against the Myanmar military generals, businesses and significant business associates. Australia failed to implement these longstanding recommendations from the UN in 2018, they must act now. #Sanctions. @dfat @MarisePayne #Myanmar https://t.co/O5Fd83iGm8\n— Australian Centre for International Justice (@theACIJ) March 31, 2021\nThe report also finds that contrary to claims made by Adani Ports, the Yangon port operation is connected to its Australia operation through shared management.\nIn Australia, Adani Ports’ direct ties to the controversial Carmichael coal project were recently exposed. Adani Ports owns the Bowen Rail Company which will operate the coal haulage from Adani’s Carmichael mine to its port on the Great Barrier Reef.\nThe groups warn that investors in Adani Ports are not only supporting Adani’s business dealings with the MEC and the Myanmar military but could also be supporting the funding of critical elements of Adani’s controversial Carmichael coal project.\nThe report says that the pressure was building on Adani Ports investors with major bondholder PIMCO cutting ties with Adani Ports this week over its links to Adani’s controversial Carmichael coal project.\nThe release of the damning new report also comes as the Adani Ports inclusion on the Dow Jones Sustainability Index is being reviewed after campaigners raised concerns over its links with the Myanmar military and the Carmichael coal project.\nYadanar Maung, spokesperson for Justice For Myanmar says, “Adani Ports has continued its business in Myanmar, despite an illegal military coup and the military’s ongoing crimes against humanity. Adani Ports’ business partner in Myanmar, now sanctioned by the US, is committing crimes against humanity as they deliberately kill peaceful protesters, torture detainees and steal public assets.”\nAhsan Haque from the Burmese Rohingya Community in Australia says: “The images of Adani Ports hosting the Senior General Min Aung Hlaing in Mundra, India less than two years after the General led a campaign of ethnic cleansing and genocide against my people shows that Adani Ports is willing to disregard human rights in pursuit of business profits.”\nFormer Member of the UN Fact-Finding Mission on Myanmar, and Member of the Special Advisory Council for Myanmar, Chris Sidoti said:\n“The report establishes the links between the Myanmar military and Adani Ports and Special Economic Zone Limited, which is intimately involved in the Carmichael coal project in Queensland. The question for Australia and Australians is whether we want to be hosting a company that is contributing to the enrichment of the Myanmar military.”\nRawan Arraf, Executive Director at the Australian Centre for International Justice said, “We’ve studied several statements from Adani Ports since May 2019 regarding its deal in Myanmar involving the MEC and we have no confidence it will uphold its obligations to respect human rights and disengage from Myanmar. It has been put on notice publicly by the UN on several occasions. At each turn it has denied or obfuscated its commercial operations in Myanmar.”\nRawan Arraf  said Adani Ports has had plenty of time to consider and review its operations in Myanmar. While other major multinational corporations are moving to suspend their operations in Myanmar, Adani Ports appears to have dug in its heels.\nThe revelations of Adani’s business dealings, first reported by Australian state broadcaster ABC (Australian Broadcasting Corporation) have triggered critical reactions online directed against the Indian billionaire, Russian state-owned news agency Sputnik News reported.\nIt said the Bloomberg Billionaires Index, published last month, estimated that Gautam Adani had added more billions to his wealth than any other person in the world, as he even exceeded American tycoons such as Amazon founder Jeff Bezos and Tesla’s Elon Musk.\nOpposition to Adani’s involvement w/ brutal #Myanmar military growing. Solidarity from anti-coal activists in Australia Demand end to Adani’s environmentally destructive mine & support the struggle for democracy in #Myanmar! https://t.co/u3H7p8W5jT #WhatsHappeningInMaynmar pic.twitter.com/RN0J3fT4Jw\n— Justice For Myanmar (@JusticeMyanmar) March 31, 2021\nAccording to Bloomberg, the net worth of Adani witnessed a rise of $16.2 billion in 2020-2021, and he is estimated to possess a fortune of $50 billion.\nA Financial Times analysis of Adani in November last year traced the businessman’s close links to Indian Prime Minister Narendra Modi since 2003, when Modi was the chief of India’s Gujarat state.\nAdani, who comes from the same state, was described as ‘Modi’s Rockefeller’ by the FT, which claimed that the billionaire was one of the biggest beneficiaries of New Delhi’s ongoing airport and port privatisation drive.\nAPP Digital report by Ishtiaq Ahmed",
  "retrievedAt": "2025-08-11T20:33:58.097Z"
}
