{
  "title": "Pakistan envoy interacts with Diaspora in Belgium, Luxembourg virtually",
  "link": "https://www.app.com.pk/national/pakistan-envoy-interacts-with-diaspora-in-belgium-luxembourg-virtually/",
  "date_published": "2021-03-31T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): Ambassador of Pakistan to the European Union, Belgium and Luxembourg, Zaheer A. Janjua, on Wednesday held the 3rd monthly Khuli Katchery in virtual format with Pakistani Diaspora in Belgium and Luxembourg.\nThe event was organized by the Embassy of Pakistan, Brussels, in line with the vision of Prime Minister Imran Khan, to maintain close engagement with Pakistani Diaspora and to provide seamless services.\nThe virtual interaction was attended by Diaspora members from different walks of life, including academia, professionals, business, social services and media, a press release issued by the Embassy of Pakistan in Brussels said.\nSpeaking on the occasion, Ambassador Janjua informed the participants that the suggestions and inputs received from the community members during the previous two Khuli Katchery sessions have been implemented.\nHe underlined that the Embassy will continue to remain closely engaged with the community to extend best possible services and incorporate their inputs to improve service delivery.\nThe Ambassador appreciated the community members for participating in the webinar on Roshan Digital Account on 6th March 2021, and urged them to take full benefit of the scheme.\nThe Ambassador also thanked the Diaspora for the record increase in flow of remittances and hoped that this trend would continue in future.\nIn order to overcome the challenges posed by the 3rd wave of COVID-19, the Ambassador urged the community members to exercise extreme caution and comply with the instructions of the Belgium and Luxembourg governments.\nHe also encouraged them to avoid all unnecessary travel, and get vaccinated as soon as their turn comes up.\nThe community members appreciated the Embassy’s outreach efforts and provision of efficient consular services.",
  "retrievedAt": "2025-08-11T20:33:57.880Z"
}
