{
  "title": "FM Qureshi underlines huge potential for enhancing Pak-Tajik bilateral trade",
  "link": "https://www.app.com.pk/national/fm-qureshi-underlines-huge-potential-for-enhancing-pak-tajik-bilateral-trade/",
  "date_published": "2021-03-31T13:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Wednesday said immense opportunities existed between Pakistan and Tajikistan to further enhance bilateral trade ties and cooperation in multi-dimensional fields.\nHe called on Tajikistan President Emomali Rahmon at the Presidential Palace in Dushanbe, a press release said.\nThe foreign minister expressed that top leadership of the two brotherly countries were determined to further solidify and expand these bilateral ties.\nHe observed that the timely completion of Central Asia-South Asia (CASA-1000) project would prove as beneficial energy corridor for the entire central and South Asia.\nQureshi stressed upon optimally utilization of the bilateral institutional framework to further promote bilateral trade cooperation between the two countries through the Joint Working Groups (JWG) in relevant fields.\nThe two sides also exchanged views on Afghan peace process, the regional situation and peace.\nForeign minister Qureshi apprised Tajik president of the contributions made by Pakistan towards peace and reconciliation efforts in Afghanistan and the outcome.\nHe reiterated that Pakistan considered peace and stability in Afghanistan as vital for the regional progress and prosperity.\nThe foreign minister also reaffirmed Pakistan’s sincere efforts for the regional peace and peace and reconciliation in Afghanistan.\nTajikistan President Emomali Rahmon expressed his resolve to further enhance the bilateral ties between the two counties and expressed satisfaction over the current level of relations.\nQureshi also extended facilitation to the Tajik president on his re-election to the office of president after October 2020 elections.\nHe said both countries enjoyed historic, religious, traditional and cultural relations and it was a welcoming sign that the top leadership of the two countries were committed to enhance these ties further.\nHe also thanked the president for extending warm hospitality to his delegation during 9th Ministerial Conference of Heart of Asia-Istanbul Process in Dushanbe and appreciated the successful hosting of the moot.\nLater, on his twitter account, the foreign minister posted that he had an excellent meeting with the Tajik president.\n“Indeed, our bilateral ties with Tajikistan are of great importance with the shared vision and goals of Pakistan-Tajikistan leadership lending a strong foundation to build these further.”\n“With a visio\nn to strengthening Economic Diplomacy, I shared Pakistan seaports offer shortest route for Tajikistan connectivity w/ S.E Asia, M. East, Africa & beyond. Reiterated our commitment to complete flagship CASA-1000, harbinger for building energy corridor between South and Central Asia.”\nThe foreign minister also visited Tajikistan ministry of Defence where he was welcomed by Defence Minister Colonel General Sherali Mirzo.\nDuring the meeting, both sides discussed bilateral ties, cooperation in the defence field and other issues of mutual interest.\nBoth sides shared the evolving bilateral defence ties and resolved to strengthen them further.\nThey also agreed to work together through joint efforts to defeat extremism, terrorism, drug trafficking and cross border crime.",
  "retrievedAt": "2025-08-11T20:34:03.912Z"
}
