{
  "title": "PM seeks ‘climate finance’ for Pakistan, other vulnerable states",
  "link": "https://www.app.com.pk/national/pm-seeks-climate-finance-for-pakistan-other-vulnerable-states/",
  "date_published": "2021-03-31T08:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 31 (APP): Prime Minister Imran Khan on Wednesday called upon the major economies to pursue a holistic approach towards climate change and galvanize supportive finance for Pakistan and other vulnerable countries braving the climatic challenge.\n“We expect this to be a moment for the world’s major economies to come forward and galvanize supportive finance for responsible countries like Pakistan, that are doing their best to reduce emissions,” the prime minister wrote in his article published in The Times, a British national daily.\nA holistic approach to tackling climate change is needed including financial commitments. https://t.co/k2thUEgB7E\n— Imran Khan (@ImranKhanPTI) March 31, 2021\nPrime Minister Imran Khan mentioned that the Global Climate Risk index ranked Pakistan as the eighth most vulnerable country to climate impacts with frequency and intensity of climate disasters constantly rising over the decades.\nSince 2000, Pakistan has lost 9,989 lives, suffered economic losses worth $3.8 billion and witnessed 152 extreme weather events – all triggered by climate change, he wrote.\nHe pointed that while Pakistan was not a contributor to this globally changing climate and emitted less than one percent of the global carbon emissions, it was committed to be a part of the global solution by pushing the growing economy on to a “greener, cleaner and low carbon future”.\nThe prime minister said adapting to climate change remained a challenge, compelling to invest in early warning systems, climate proofing of flood prone infrastructures, establishing cross-country disaster management networks and working with local communities.\nHe said Pakistan’s climate change expenditure was already hovering menacingly around 6 percent of the annual federal budget, a figure poised to rise further as impacts begin to bite.\n“Pakistan’s commitment and all these efforts to address global climate now need to be augmented with supportive climate finance and green investments,’ he said.\nHe said adapting to inescapable climate change comes with acute economic costs, adding that “With rising impacts, our adaptation finance needs have been estimated at $7-14 billion every year”.\nIn a situation of human and economic catastrophe of COVID-19, he said, the Glasgow COP26 Summit was critical as it gave a rare opportunity to address these challenges through understanding, collaboration and cooperation.\nHe recalled that in 2015, an analysis indicated that developing countries would need around $400 billion in climate finance support to shift towards low carbon development pathways.\nHe regretted that the drop in clean energy transition ironically coincided with the failure of developed countries to deliver the promised $100 billion/year of climate finance by 2020 – a commitment that remains weak on actual deliverance.\n“Unless there is a debt relief programme for the global South and enhanced global climate finance leveraging clean investments in these regions, the default fossil fuel powered pathways will remain unchanged and the invaluable opportunity of a clean energy transition will wither away,” he said.\nImran Khan stressed that Pakistan was piloting a sovereign debt linked nature bond to bring innovation to this dialogue, but much more needed to be done.\nHe expressed intention to travel to COP26 in Glasgow with hope and optimism showcasing Pakistan’s positive climate actions, however said “without a strong climate finance deal on the table, there may not be any agreement at COP26 – an outcome we can all ill afford”.\nImran Khan mentioned that monsoon season in Pakistan was about both “hope and fear.”\n“Hope because the rains irrigate our farmlands and refresh our cities after the intense summer heat. Fear that the rains will overwhelm us, bursting river banks and unleashing urban flash floods,” he said.\nHe recalled that last summer, Pakistan experienced the heaviest rains in a century, with an unprecedented cloudburst leaving much of the sprawling metropolis of Karachi inundated, rendering thousands homeless and over 100 dead.\nPakistan is used to coping with heavy monsoon rains, he said, however 2020 was unexpectedly intense with the scientists saying that the situation would become increasingly common as the planet warms.\nThe prime minister said his government had set in motion plans to shift by 2030 a sixty percent of energy mix towards clean carbon free energy and thirty percent of transport towards green electric mobility.\n“This clean energy shift is complemented by our ambitious vision for planting 10 billion trees, with $650 million being rolled out to plant the first 3.3 billion by 2023 and, thereby, aiming to restore over 1 million hectares of carbon absorbing forests,” he said.\nHe mentioned that Pakistan was the only country in the world with an expanding mangrove forest that was helping to increase the carbon rich ecosystem by 300 percent in the past few decades and now further increasing it to over half a million acres within the next three years.\n“My Government has put its trust and confidence in “nature-based solutions” – with the associated benefit of creating 85,000 new green jobs in the past year alone,” he said.\nThe prime minister said the Green Stimulus programme included expansion of the country’s protected area coverage to 15 percent land area and 10 percent of marine area by 2023.\nDuring the pandemic, he said, the government announced 15 new National Parks covering over 7300 sq km of land – all acting as wilderness carbon sequestration zones.\nHe said also the investment was being made in protecting farmers through climate smart agriculture to cope with the growing climate unpredictability.\nImran Khan said Pakistan reflects the glory of nature with its lofty mountains and lush valleys, its gushing rivers and its burgeoning mangroves.\n“But as glaciers melt and rains become erratic and unpredictable, my people are suffering. Climate change is already upon us and we are living through the era of forced adaptation,” he said.\nHe vowed that Pakistan would fight for a deal that delivers a climate secure future for its citizens and the world. They deserve no less and they will settle for nothing less, he concluded.",
  "retrievedAt": "2025-08-11T20:34:08.021Z"
}
