{
  "title": "Govt encourages farmers to increase wheat production: Gandapur",
  "link": "https://www.app.com.pk/national/govt-encourages-farmers-to-increase-wheat-production-gandapur/",
  "date_published": "2021-03-31T11:41:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 31 (APP): Federal Minister for Kashmir and Gilgit Baltistan Affairs, Sardar Ali Amin Khan Gandapur has said the government has encouraged farmers and agriculture growers to increase wheat production in southern districts of the province.\nHe expressed these views during a day-long seminar at Arid Zone Research Center at Dera Ismail Khan, which was held under the Prime Minister Agriculture Emergency Programme.\nThe seminar was also addressed by Vice Chancellor, Agriculture University DI Khan, Dr Manzoor Elahi Babar and others agriculture experts.\nThe Federal Minister said agriculture sector was backbone of the economy and the government had launched multi dimensional Prime Minister Agriculture Emergency Programme in the country to strengthen agriculture, livestock and fisheries sectors.\nHe said vast land was available in southern districts of KP including DI Khan that could be utilized by adopting modern agriculture techniques to bolster agriculture’s production.\nThe Minister stressed on the need of creating awareness among farmers and agriculture growers to adopt modern agriculture techniques and machinery to increase per acre production imperative to achieve self-sufficiency in food.\nVice Chancellor, Agriculture University DI Khan, Professor Dr, Masroor Elahi Babar said the role of agriculture scientists were imperative to conduct research on different agriculture varieties and invent new seeds aimed at increasing per acre production.\nHe said the soil of Dera Ismail Khan was fertile for major crops including wheat, sugarcane and dates etc and great responsibilities rest on shoulders of agriculture scientists and farmers to meet the food demands of every growing population through enhanced value addition.\n“The farmers of Dera Ismail Khan are lucky enough to have highly productive agricultural land besides services of quality scientists and all desired information at their doorstep in the form of Agriculture University.”\nDirector General (AZRC) Noman Latif Khan Saddozai, Project Director Dr. Muhammad Yaqoob Awan and Livestock Production Specialist Dr. Aftab Ahmad Awan were also adressed thhe gathering.\nFederal Minister Sardar Ali Amin Khan Gandapur were presented the traditional Saraiki Ajrak by the Vice Chancellor Agriculture University.",
  "retrievedAt": "2025-08-11T20:34:06.106Z"
}
