{
  "title": "SECP issues Circular enabling Startups to raise Capital against Property, Other Assets",
  "link": "https://www.app.com.pk/national/secp-issues-circular-enabling-startups-to-raise-capital-against-property-other-assets/",
  "date_published": "2021-03-31T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 31 (APP): With the foremost aim to support entrepreneurship and improve business climate for small businesses, particularly startups and potential investors, security and Exchange Commission of Pakistan (SECP) issued a circular explicitly allowing private companies to raise capital by receiving immovable property, intangible assets and services from investors.\nSECP also clarified that the private companies can raise funds from investors other than their existing shareholders to finance their working capital requirements, potential products and services linked with technological advancements & their growth, said a press release issued here.\nIt will expand access-to-finance net and the overall outreach for startups by enabling them to attract investment from a wider group of investors and in the form of assets, instead of only in cash. This will also substantially benefit the association of persons or partnerships forming a company to transfer their assets to a company and raise equity.\nThe circular has been issued to bring-in the desired clarity with regard to section 83 of the Companies Act, 2017, allowing all companies, private and public, to issue shares by way of right either for cash or a consideration otherwise than in cash, subject to compliance with section 70 of the Act, and enabling private companies to raise equity from outside their existing members.\nThis step has been taken in light of the needs of the startups and emerging global trends, whereby jurisdictions such as New Zealand and Malaysia that have top DB rankings have already implemented such reforms.\nThe SECP stands committed to creating a business environment that helps foster business growth and expansion, and continues to remove regulatory barriers to make doing business easier in the country.",
  "retrievedAt": "2025-08-11T20:34:00.849Z"
}
