{
  "title": "PTI to win GB elections as opposition accepts defeat: Senator Shibli",
  "link": "https://www.app.com.pk/national/pti-to-win-gb-elections-as-opposition-accepts-defeat-senator-shibli/",
  "date_published": "2020-11-14T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP): Minister for Information and Broadcasting Senator Shibli Faraz Saturday said the candidates of Pakistan Tehreek i Insaf (PTI) would win the election of Gilgit Baltistan assembly as the opposition had accepted its defeat.\nAddressing a press conference here, he thanked the people of Gilgit Baltistan for actively participating in the election campaign in a peaceful manner and for welcoming and responding to the message of the leaders and candidates of Pakistan Tehreek i Insaf.\nThe enthusiastic response showed that people of Gilgit Baltistan had given their decision in favour of PTI, he added.\nHe said the people of northern areas had historic participation in the campaign expressing their desire to practically take part in the development of Gilgit Baltistan.\nThe minister said the political parties which ruled in Gilgit Baltistan in the past did nothing for the prosperity of people.\nPakistan Muslim League (N) forgot that in its tenure it completely ignored the citizens in Gilgit Baltistan, he reminded.\nThe tenure of PMLN government ended recently and people now wanted to know what it will do for the people in the future, he continued.\nHe said the opposition had accepted its defeat in the GB polls as now it was raising hue and cry about rigging as an excuse for its defeat in the polls.\nThe people of Gilgit Baltistan had expressed their love for Prime Minister Imran Khan and the candidates of PTI would win the upcoming elections, he added.\nHe asked the media to fully cover the election campaign for the GB assembly to be held on Sunday.\nPTI was a party which struggled for free and transparent elections in the past and even staged a long sit in for this purpose, he noted.\nHe said PTI led the efforts for legislation for transparent elections and forced PML-N to carry out electoral reforms.\nHe said that a special electoral committee was formed for reforms to ensure transparent election process.\nThe opposition accepted the only election they win otherwise they create drama of rigging, he added.\nSpeaking about opposition parties, he said that these people were not democratic and even their attitude was also not democratic. He said that a political party was asking a specific institution for help to send the elected government to home.\nHe said a political party which claimed itself a democratic party wanted to insult the public mandate unconstitutionally. He said that PML-N was heredity party and the so called claim to be democratic was fake.\nHe said that Prime Minister Imran Khan is the future of Pakistan.\nDiscussing the economic situation of the country, the minister said that the country was on the right path and good news is coming and more good news would appear in near future.\nThe minister said that even during Covid-19 pandemic our economic situation showed significant improvement.\nHe said that petroleum prices were being decreased, adding that industries and currency was showing improvement as well. He said that the inflation also on decline and prices of various commodities would be further decreased.\nThe minister strongly condemned the Indian violations on Line of Control (LoC). He said the government would raise voice at international forums against the violations by the Indian armed forces.\nHe also felicitated the Hindu community on special occasion of Diwali.",
  "retrievedAt": "2025-08-11T20:01:08.582Z"
}
