{
  "title": "Mishal Malik urges international community to play its practical role for IIOJK",
  "link": "https://www.app.com.pk/national/mishal-malik-urges-international-community-to-play-its-practical-role-for-iiojk/",
  "date_published": "2020-08-04T00:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):Mihaal Hussein Malik, a human rights activist and wife of Kashmiri leader Yasin Malik Tuesday urged the international community to take notice of the plight of the people of IlIegally Indian Occupied Jammu and Kashmir (IIOJK), who have been living under complete lockdown since August 5.\nTalking to a private news channel, she recalled the international community to break its criminal silence and take notice of the grave human rights violations in occupied Kashmir.\nMushaal Mullick further slammed the Modi-led Indian fascist government for its action of August 5, last year, when it repealed Kashmir’s special status and divided it into two union territories.\nMushaal said Kashmir valley had become an “open-air jail” due to communication blackout and curfew, adding, it is time for the international community to play a practical role for the people of occupied Kashmir.\nShe said that by observing August 5 as Youm e Istehsal, Kashmiris would once again confirm their total rejection of the Indian rule and reaffirm pledge to continue liberation movement till taking it to its logical conclusion.\nShe expressed the hope that the UN as a responsible institution will come to the rescue of the oppressed people of occupied Kashmir and impress upon India to stop its state terrorism in the occupied territory.\nShe said a year has passed since the Indian atrocities and exploitation in occupied Kashmir and the Kashmiris are passing through difficult times. They are living in a jail like conditions.\nShe said previous two months we have no any contact with Yasin Malik and Indian authorities had completely deprived Kashmiris of their basic rights including religious rights.\nShe said all senior Hurriyat leadership is under detention at homes or in different prisons.\nShe demanded from India for lifting the communication restrictions and allowing unfettered access to medical and other essential supplies.\n“India could not weaken the freedom sentiment of the resistance leaders of IOK through such cheap tactics,” she added.\nWhile saluting the courage of Burhan Wani and his associates, she said, Kashmiri martyrdom would be a milestone in the freedom struggle of Kashmir and it has entered a new era of freedom movement.\nShe also thanked the government and people of Pakistan for their continued political, diplomatic and moral support to the Kashmir cause.",
  "retrievedAt": "2025-08-11T19:36:21.479Z"
}
