{
  "title": "‘Kashmir Siege Day’ to be observed in provincial metropolis; Special session of Punjab Assembly convened",
  "link": "https://www.app.com.pk/national/kashmir-siege-day-to-be-observed-in-provincial-metropolis-special-session-of-punjab-assembly-convened/",
  "date_published": "2020-08-04T13:53:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 05 (APP): Kashmir Siege Day – ‘Yaum-e-Istehsaal e Kashmir’ – will be observed in the provincial metropolis on Wednesday (tomorrow) to protest against the military siege of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) by the Indian government and to raise voice against brutalities being perpetrated against the hapless Kashmiri people.\nThe day would also mark to denounce the heinous Indian designs to change the demography of the state of IIOJK while the Kashmiri leader Mushaal Hussein Mullick has termed the act as demographic apartheid.\nKashmir Siege Day is being observed to arouse conscience of the world to a situation where eight million Muslims have been put under unlawful curfew in violation of all international laws.\nAugust 5 marks the first anniversary of military siege of the IIOJK when the Indian government, on August 5, 2019, passed a controversial law under which the Union Government revoked Articles 370 and 35 (A) and proposed the bifurcation of the state into two union territories Jammu and Kashmir and Ladakh.\nRallies and walks will be taken out in different parts of the provincial metropolis while the main rally will be led by Chief Minister Punjab Sardar Usman Buzdar and Governor Punjab Chaudhry Mohamamd Sarwar which will start from Govenror’s House at 10 a.m. and culminate at the Charing Cross in front of the Punjab Assembly.\nNational Anthem and Kashmiri songs will be played during the rallies to mark ‘Kashmir Siege Day’ while the walk will be preceded by the sirens. One minute silence will be observed during the walks. All walks will be observed under strict SOPs against the coronavirus pandemic.\nDeputy Commissioner Lahore Danish Afzal has said that all arrangements have been made to observed the day with renewed commitment for provide all kind of diplomatic and moral support of the Kashmiri Muslims. He said that all main roads of the city will be closed at 11 a.m. Banners, bearing slogans in support of Kashmiri people, have been displayed along The Mall and other important roads of the city.\nThe workers of various departments including the Lahore Airport will hold special walks to protest against the one year of military siege of the IIOJK and show solidarity with the Kahsmiri people.\nJaamt e Islami (JI) and other parties have also announced rallies in the provincial metropolis to protest against the military siege of Jammu and Kashmir.\nSpeaker Punjab Assmebly Chaudhry Pervaiz Elahi has convened a special session of the Punjab Assembly on August 5 (Wednesday) at 7 p.m. to mark the day and adopt a resolution against the unabated curfew in the IIOJK since August 5, 2019.\nThe Punjab Assembly was to meet on August 7 (Friday) at 2 p.m. but the Speaker, in exercise of the powers vested in him under rule 25(b) of the Rules of Procedures of the Provincial Assembly of the Punjab 1997, called the session early at the assembly chambers.",
  "retrievedAt": "2025-08-11T19:36:01.480Z"
}
