{
  "title": "Pakistan always stood by Kashmiri people for right to self-determination: CM Balochistan",
  "link": "https://www.app.com.pk/national/pakistan-always-stood-by-kashmiri-people-for-right-to-self-determination-cm-balochistan/",
  "date_published": "2020-08-04T14:50:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 04 (APP):Chief Minister Balochistan Jam Kamal Khan Aliyani Tuesday lauding the Kashmiris one year strive against Article 370’s revocation in Indian Illegally Occupied Jammu and Kashmir said Pakistan has always stood by the Kashmiri people for their right to self-determination.\nHe said, in a statement, “United Nations and International Community should play their moral responsibility against military siege in Indian Illegally Occupied Jammu and Kashmir (IIOJK).”\nIn the wake of one year of India’s move of abrogating article 370 in IIOJK, the chief minister said that despite the military siege and sanctions imposed by Indian government for the past 365 days, international media organizations have reported large numbers of protests by millions against the revocation of IIOJK’s special constitutional status,\n“The fascist Indian Prime Minister Narendar Modi and his government had revoked the constitutional status of IIOJK on August 5, 2019 against bilateral agreements, which intensified independence struggle in IIOJK hence the brutal forces targeting innocent Kashmiris regularly.”\nJam Kamal said the dissolution of the Assembly, imprisonment of Kashmiri leaders and their detentions made it clear that IIOJK was a colonial project of India.\n“The brutal Indian Government has been attempting to follow the steps of Israel, the way the Israeli government perishing the status of West Bank and Gaza.”\nHe said India has violated the UN Conventions and its bilateral agreement with Pakistan while IIOJK has been facing a humanitarian crisis.\nJam kamal said, in order to divert attention from human rights violations in IIOJK, India was committing unprovoked violations of ceasefire.",
  "retrievedAt": "2025-08-11T19:35:59.763Z"
}
