{
  "title": "Youm-e-Istehsal to mark a year of military siege of IIOJK",
  "link": "https://www.app.com.pk/national/youm-e-istehsal-to-mark-a-year-of-military-siege-of-iiojk-2/",
  "date_published": "2020-08-04T05:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP):Youm-e-Istehsal will be observed all across Pakistan on August 5 to mark the 365 days of Indian military siege of Indian Illegally Occupied Jammu and Kashmir (IIOJK) .\nThe Pakistan Tehreek-e-Insaf government has planned a range of activities on August 5 to express solidarity with the oppressed Kashmiris and expose India’s brutalities.\nAccording to Minister for Foreign Affairs Shah Mehmood Qureshi,”Pakistan is going to highlight Indian atrocities in Kashmir on this day.”\nOn August 5, 2019, India repealed articles 35A and 370 of its constitution, revoking the special status granted to the Indian Illegally Occupied Jammu and Kashmir.\nPrime Minister Imran Khan, who had committed to play the role of Kashmir’s ambassador, will make a historic address to the Legislative Assembly of Azad Jammu and Kashmir after a solidarity walk also to be joined by AJK president and prime minister in Muzaffarabad.\nBesides solidarity walks across the country to be led by the political leadership regardless of the political divide, a one-minute silence would also be observed at 10 am after blaring of sirens.\nThe government had decided to change the name of Kashmir Highway in Islamabad to Srinagar Highway and installed sign boards on roads to this effect.\nA memorandum would be presented to the United Nations Observer Mission.\nA special postal stamp has been issued by the Ministry of Postal Services to highlight the Indian aggression and human rights abuses by depicting a minor sitting over the body of his slain grandfather killed by the Indian troops in Sopore town in early July.\nThe government will enhance its diplomatic outreach on the day by writing letters to the United Nations Secretary General and world leaders, besides interactions of the prime minister with the international media.\nPublication of special Op-eds in the foreign media, special campaigns through print, electronic and especially social media, and presentation of a memo to the UN representative have also been planned. Pakistani envoys across the world will engage with local media, think tanks and community to apprise them about the Indian aggression and blatant violations of repeated UNSC resolutions.\nKashmiris on both sides of the Line of Control and the world over will observe Youm-e-Istehsal to denounce illegal, immoral and unconstitutional step, which India took on this day last year to strip Indian Illegally Occupied Jammu and Kashmir of its special status.\nAugust 5, 2019 added a new turn and chapter in the Kashmiris struggle as India tried to abolish their identity through demographic apartheid, which was rejected not only by the Muslims but also by the Hindu pundits and Buddhists.\nOn this day, the whole nation will give a message to their Kashmiri brethren that they were not alone rather the people of Pakistan would always support their struggle for freedom.",
  "retrievedAt": "2025-08-11T19:36:11.881Z"
}
