{
  "title": "India pushing the region to brink of war: AJK President",
  "link": "https://www.app.com.pk/national/india-pushing-the-region-to-brink-of-war-ajk-president/",
  "date_published": "2020-08-04T06:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):President of Azad Jammu and Kashmir Sardar Masood Khan on Tuesday said the Indian rulers through their warmongering, ceasefire violations, and threats to attack Azad Kashmir and Pakistan were pushing the region to the brink of war.\nIn a message on completion of one year of India’s illegal action of August 5, 2019, the AJK President said, “this past year, the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK), have suffered most grievously. On August 5th last year, 900,000 Indian occupation forces invaded Kashmir and re-occupied it illegally. Ever since Indian forces had been brutalizing the people and colonizing the territory”.\nThe Indian occupation army, he said, had killed hundreds of young men, incarcerated thousands of boys and children and forcibly disappeared Kashmiris. All pro-freedom leaders were under Illegal detention. Concentration camps had been set up in the IIOJK and India to force political activists to discard their quest for liberty. The occupied territory’s economy had also been ruined, he added.\nHe said late last year, illicitly, India bifurcated the disputed territory into two parts and declared that they would be ruled by Delhi, without the consent of the people of the valley.  In another sinister move this year, India launched massive import and transfer of Hindus from India to settle them in the occupied territory in order to change the demographic composition of the state. This was a flagrant violation of the 4th Geneva Convention and international law, the AJK president stated.\nKhan said the scale at which these atrocities were going on had been rightly called genocide, crimes against humanity and war crimes. Kashmiris were being exterminated; they were being made aliens in their own land, homeless in their own homeland.\nHe went on to say that full-fledged aggression against Kashmiris was driven by the Neo-Fascist Hindutva doctrine and settler colonialism as we see a replication of Nazi policies in the occupied territory.\nReferring to the reaction of the global community over illegal actions of India on August 5 last, the president expressed his deep gratitude to the international media, world parliaments, international civil society and human rights organisations for calling out India’s revolting and despicable crimes against humanity and for speaking up for the oppressed and besieged Kashmiris.\nHowever, the AJK president regretted that with the exception of China, Turkey, Malaysia, Iran and West European countries, the response of the most powerful nations had been disappointing and faltering. They had not fulfilled their obligations to save Kashmiris and stop a drift toward turbulence in the region.\n“We thank the Organisation of Islamic Conference for its strong solidarity with the Kashmiris; and the periodic statements issued by the UN leadership. But this is not enough. We demand action,” Khan said.\n“We salute unarmed but valiant Kashmiris for their resilience in the face of India’s scorched-earth policy and their resolve to resist Indian colonialism and foreign occupation. We are with them until, together, we repulse the Indian invasion and wrestle down the monster of Hindutva which is feeding on Kashmiri lives and rights”, he said.\nThe AJK president appealed to the international community, especially the United Nations, to step forward and help us liberate the people of IIOJK. Otherwise, it would be too late. An entire people will be disenfranchised, dispossessed, displaced and destroyed altogether.\nHe said Kashmiris were determined to win freedom and self-determination as promised to them by the United Nations under any circumstance. “The flame of liberty will not be snuffed out by India imperialism,” Khan expressed his optimism.",
  "retrievedAt": "2025-08-11T19:36:09.848Z"
}
