{
  "title": "India has turned IIOJK into ‘open air prison’ with destroyed economy: PM",
  "link": "https://www.app.com.pk/national/india-has-turned-iiojk-into-open-air-prison-with-destroyed-economy-pm/",
  "date_published": "2020-08-04T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):Prime Minister Imran Khan has said the Indian government’s revocation of the special status of Indian Illegally Occupied Jammu and Kashmir (IIOJK) last year has turned the disputed region into an ‘open air prison’ with its economy destroyed.\n“Within a year, Kashmir has been closed off and its economy destroyed,” Imran Khan said in an exclusive interview with Aljazeera that posted its excerpts on its website on Tuesday.\nThe prime minister said, “Eight-hundred thousand Indian troops have imposed an open air-prison on Kashmiris.”\nHe said Indian Prime Minister Narendra Modi was responsible for undermining his country’s legacy of secularism. “India fell under the control of an extremist ideology [propounded by] the RSS, Khan said, referring to the Rashtriya Swayamsevak Sangh organisation, to which Modi belongs and which critics accuse of fomenting anti-Muslim hatred.\n“What India’s Muslims are facing resembles what happened during the extermination of Jews in Nazi Germany,” he said.\nImran Khan said Pakistan had exhausted all possible routes to peacefully resolve its dispute with India.\nOn mediatory role between Saudi Arabia and Iran, he said Pakistan had played an important role in defusing tensions between the two countries and also “prevented a military escalation from taking place in the volatile region”.\nHe said despite the slow pace of results, Islamabad’s mediation efforts were continuing.\n“Our mediation between Iran and Saudi Arabia has not stopped and we are making progress but slowly,” Imran Khan said.\nAsked about his absence from a the Kuala Lumpur Summit held in Malaysia last year, the prime minister he decided to not attend the meeting in order to preserve unity among the Muslims. “Islamabad viewed both Ankara and Riyadh – which boycotted the event – as reliable partners in several fields.”",
  "retrievedAt": "2025-08-11T19:36:06.695Z"
}
