{
  "title": "Railways plans to convert all level crossings on ML-I into flyovers, underpasses",
  "link": "https://www.app.com.pk/national/railways-plans-to-convert-all-level-crossings-on-ml-i-into-flyovers-underpasses/",
  "date_published": "2020-08-04T01:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP):Pakistan Railways was planning to convert all the level crossings from Karachi to Peshawar, Main Line-I (ML-I) into flyovers and underpasses to control trains accidents and save the precious lives.\nThe level crossing would be converted during the up-gradation of ML-I under China-Pak Economic Corridor (CPEC) project for which the PC-I was with the Executive Committee of the National Economic Council (ECNEC) for approval, an official in the Ministry of Railways told APP.\nHe said that Pakistan Railways has total 510 level crossings from Karachi Cantonment to Rawalpindi Stations which include 398 manned and 112 un-manned.\nAt present as many as 105 overhead, flyover bridges and 35 underpasses of Pakistan Railways were constructed by various departments over the track, the official added.\nHe said the level crossings were allowed by Pakistan Railways on the request of District Administration therefore, the Provincial Government is responsible to construct flyovers and underpasses on level crossings.\nTo a question, he said that Pakistan Railways has provided foot over bridges at Kot Laloo and Padidan Railway Stations, however the manned level crossings also exist at Kot Laloo.\nThe official said that it was also fact that pedestrians often cross railway track by tress-passing instead of using foot over bridge which could be reason for accidents.\nHe said that the rail fencing and other safety measure have been adopted to secure these tress passing’s sites to avoid incidents and ensure safety of human lives.\nFurthermore, he said the case for provision of Flyover Bridge for road traffic at Kot Laloo level crossing was under process with the provincial government.\nThe pedestrian bridge already exists on both railway station Kot Laloo and Padidan to facilitate the movement of passengers, he added.",
  "retrievedAt": "2025-08-11T19:36:21.751Z"
}
