{
  "title": "Plight of Kashmiris, test for human rights’ global champions: Speakers",
  "link": "https://www.app.com.pk/national/plight-of-kashmiris-test-for-human-rights-global-champions-speakers/",
  "date_published": "2020-08-04T07:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP): Speakers at a conference on Tuesday said the plight of Kashmiris was a test for the human rights’ global champions as India continued blatant violations of human rights as well as international laws and the United Nations Security Councils (UNSC) Resolutions.\nThey were of a view that India was attempting to alter Indian Illegally Occupied Jammu and Kashmir (IIOJK) demography, to end any chance of a plebiscite in accordance with the UNSC resolutions in the disputed territory.\nThey said in a webinar “A Year after Annexation: Challenges to Restoring Peace and Autonomy in IIOJK”, organized by Islamabad Policy Research Institute (IPRI) here.\nThey agreed the Hindutva-inspired machination masqueraded as a move for integration was a dangerous ruse to tailor the demographics and fate of the Muslim majority territory fighting for their right to self-determination for over 70 years.\nThey lamented that despite Pakistan’s calls to resolve the bilateral dispute in light of critical UNSC resolutions, India continued to maintain its hostile aversion to any transparent, peaceful and legally binding settlement on the matter.\nLieutenant General (R) Naeeem Khalid Lodhi said diplomacy alone cannot achieve results – political, economic, military and diplomatic actions must be well aligned and properly sequenced to achieve national goals.\nKashmir rights activist, Mushaal Mullick said India’s fascist government has intensified its barbarism and state terrorism with over 1,237 innocent Kashmiris, including 28 women martyred till date, besides rendering 100 women widowed and 227 children orphaned.\nShe urged the international community to take serious notice of India’s move to grant domiciles to non-Kashmiris meant to change the demographic status of the occupied territory as non-Kashmiris flood into the region to diminish the Muslim majority.\nExecutive Director, Research Society of International Law (RSIL) Jamal Aziz said the State of India was an occupying power in IIOJK and through its actions of August 5, 2019, had attempted to unlawfully annex this territory without any recourse to the will of the people of IIOJK. Under International Law, an occupation is a question of fact.\nHe informed that the communication lockdown, restrictions on movement and refusal to grant humanitarian access are in violation of IHL rules and human rights norms that India is obligated to uphold.\nDirector Research IPRI, Brig (R) Raashid Wali Janjua also launched a book “The Paradise under Siege”. A Tale of Unremitting Atrocities in IIOJK based on pictorial primer on Indian atrocities and repression in a paradise held under the worst siege witnessed by mankind.",
  "retrievedAt": "2025-08-11T19:36:06.818Z"
}
