{
  "title": "It’s high time to realize dangers to Pakistan’s existence: Masood",
  "link": "https://www.app.com.pk/national/its-high-time-to-realize-dangers-to-pakistans-existence-masood/",
  "date_published": "2020-08-04T05:57:00.000Z",
  "source": "APP",
  "content": "MIRPUR, Aug 04 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan on Tuesday said India’s fanatic Prime Minister Narendra Modi was hell bent on to eliminate “our national existence, and we have no longer any justification to shut our eyes towards the dangers posed to our security and existence”.\nAddressing a national consultative meeting on Kashmir convened by Jamaat-e-Islami chief Sirajul Haq in the Federal Capital, he maintained that not the governments of Pakistan and Azad Kashmir alone, but the whole Pakistani nation and the Ummah, and the world nations owed the responsibility to respond to the situation created by India’s terrorist and fascist government because the Muslims of India and occupied Kashmir were being punished for their Muslim entity, according to a news release issued here.\nThe AJK president said it was not the time to pass the buck in order to avoid the responsibilities. “The buck must stop at you and you should as individuals keep raising the issue,” he said, adding all should stand like rock wall against the enemy in order to frustrate its designs.\n“This is our moral and religious obligation to rid our brothers and sisters in occupied Kashmir of the Indian repression and barbarity, and there is no room to demonstrate apologetic attitude any more,” he said.\nAppreciating the Jamaat-e-Islami for bringing the country’s political leadership and the Hurriyat leaders on one platform at this crucial juncture, Sardar Masood said it was high time to realize the enemy’s designs and take practical steps accordingly.\n“We must approach our friends on the global level, and seek their practical support, he said adding that the whole nation should rise up to respond to the danger India had posed to our national sovereignty and existence,” he asserted.\nMasood said the change of demography of Indian Illegally Occupied Jammu and Kashmir by India was the biggest danger. “This is not the issue of just settling non-Kashmiri subjects in the territory but to deprive the Kashmiri people of their livelihood, education and to grab their lands, which cannot be ignored in any cost,” he added.\nThe AJK president said the Kashmiri people had been cut off from the world because of one year’s curfew and the military siege for the last one year, and there had been untold stories of the bloodletting of the innocent people in the state. “The ongoing struggle is not the movement for the freedom of Kashmiri people alone but it is also struggling for the completion of Pakistan,” he added.\nHe called upon the Jamaat-e-Islami to contact the world Islamic movements including the OIC, and seek their support for the Kashmiri people facing barbarity of India. India had been hoodwinking the world for the last 73 years about its so-called secularism, which had now been replaced by Hindutva and Hindu supremacy.\nThe AJK president said a campaign for boycott, divestment and sanctions (BDS) against India had started and urged every citizen of the country to contribute to make it a success.\nThe conference was also addressed by former Senate Chairman Nayyar Bukhari, JI chief Sirajul Haq, Liaqat Baloch, Ijazul Haq, political leaders of Pakistan and Azad Kashmir, the leadership of All Parties Hurriyat Conference and the representatives of national media.",
  "retrievedAt": "2025-08-11T19:36:09.954Z"
}
