{
  "title": "Pakistan embassy in Kathmandu organizes talk programme on Jammu and Kashmir dispute",
  "link": "https://www.app.com.pk/national/pakistan-embassy-in-kathmandu-organizes-talk-programme-on-jammu-and-kashmir-dispute/",
  "date_published": "2020-08-04T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):Embassy of Pakistan in Kathmandu, Nepal organized a talk programme on “Jammu and Kashmir Dispute: 5 August 2019 to 5 August 2020”.\nThe programme was attended by around fifteen distinguished writers, media men and analysts, as well as representatives of human rights organizations, said a press release received here from Kathmandu on Tuesday.\nSpeaking at the talk programme, Ambassador Mazhar Javed recollected important developments and international reactions to India’s illegal action of August 5, 2019, and the alarming intensification of the human rights violations in that disputed territory.\nHighlighting the centrality of the right of self-determination of the people of Jammu and Kashmir, and the UNSC resolutions, he recalled the discussions at the UNSC in August 2019 and then in January 2020.\nHe also referred to the statements of the UN Secretary General urging to refrain from any steps that could affect the status of Jammu and Kashmir, and underlining the importance of UN Security Council resolutions.\nAn important issue brought out at the seminar was the grave human rights violations being committed by the Indian forces in the IIOJK.\nAmbassador Javed highlighted the gravity and scale of the atrocities being committed by the Indian forces which had been widely reported and condemned internationally, especially by the UN High Commissioner for Human Rights, OIC, EU, Human Rights Watch and Amnesty International.\nIn the question-answer session that followed, the participants urged for resolution of the dispute in accordance with the wishes of the people of Jammu and Kashmir and UNSC resolutions.\nThey also stressed the urgency to resolve the dispute which had been the biggest challenge to the regional peace and security, now for decades.\nThey said the international community had an important responsibility to ensure the rights of the people of Jammu and Kashmir including their right of self determination.\nManju Ratna Sakya, Secretary General Nepal-Pakistan Friendship and Cultural Association stressed the need to respect the rights of the people in IIOJK, including their right to self-determination, and the centrality of the UN Security Council resolutions.\nA one-minute silence was also observed to pay homage to the martyrs in IIOJK.",
  "retrievedAt": "2025-08-11T19:36:04.535Z"
}
