{
  "title": "All set to observe ‘Youm e Istehsal’ on Aug 5",
  "link": "https://www.app.com.pk/national/all-set-to-observe-youm-e-istehsal-on-aug-5/",
  "date_published": "2020-08-04T06:18:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 04 (APP):In response to the call of the government, all is set to observe the first anniversary of the bleak August 5, 2019 day as ‘Kashmir Military Siege Day’ (Youm e Istehsal) by the people of Jammu & Kashmir dwelling both sides of the Line of Control and rest of the world.\nYoum-e-Istehsal will be observed throughout Azad Jammu & Kashmir, Pakistan and rest of the world by the overseas Pakistanis and Kashmiris to condemn the illegal, immoral, and inhuman action of the 5th August, 2019.\nIn Azad Jammu Kashmir, the day will be marked with the mass anti-India protest rallies and processions at all small and major cities and towns across the liberated territory including the capital city of Muzaffarabad against the above unilateral Indian action stabbing the special status of the disputed IIOJK this day last year at the gun point – denying all international norms and commitments.\nA high level meeting held in AJKs capital Tuesday gave final touches to the arrangements for observance of “Youm-e-Istehsaal” and proposed visit of the Prime Minister of Pakistan Imran Khan to Muzaffarabad the same day to address Azad Jammu Kashmir Legislative Assembly, it was officially stated.\nThe Prime Minister of Pakistan Imran Khan will address the Azad Jammu and Kashmir legislative Assembly and will also lead a protest rally in Muzaffarabad, an official handout issued by AJK Government said.\nAJK President Sardar Masood Khan, AJK Prime Minister Raja Farooq Haider Khan, Federal Ministers and AJK Cabinet Ministers will participate the protest rally to mark scheduled Aug. 5 ‘Kashmir Military Siege Day’ ~ Youm e Istehsal with extreme protest against Indian sinister action of revoking special status of IIOJK this day last year unlawfully and by force.\nIn Muzaffarabad a big protest rally will be taken out from Domail which will terminate at the UN observer mission. The AJK Prime Minister will lead the rally. The AJK Cabinet Ministers, representatives of APHC, leaders of the Political parties and representatives of civil society will also participate in the rally the participants of the rally will present a memorandum to the UN observer mission.",
  "retrievedAt": "2025-08-11T19:36:09.481Z"
}
