{
  "title": "India has failed to curb Kashmiris indigenous movement of independence in 73 years; says Hurriyat leader",
  "link": "https://www.app.com.pk/national/india-has-failed-to-curb-kashmiris-indigenous-movement-of-independence-in-73-years-says-hurriyat-leader/",
  "date_published": "2020-08-04T03:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):India has completely failed to curb the Kashmiris indigenous movement for their right to self-determination and independence during 73 years.\n“India has increased troops more than one million in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) in a bid to press the just voice of Kashmiris but the day is not far when the people of Kashmir will get freedom from the Indian Ghasbana Qabza,” All Parties Hurriyat Conference (APHC) Executive Member and Kashmir Peoples League Vice President Ejaz Rehmani said while talking to the APP.\nHe said due to military siege, the economic activities in the IIOJK were completely dismantled. The Indian government had imposed restrictions on the media to hide its inhumane acts and illegal actions from the world community and human rights watchdogs, he added.\nHe saluted the Kashmiris who were continuing their unwavering efforts boldly despite all such bans. He said August 5, last year was the darkest day in the history of IIOJK, when India usurped the basic rights of Kashmiris and put their entire leadership in jails or confined them to their homes.\nThe APHC leader said Indian fascist government led by prime minister Narendera Modi after failure in suppressing the Kashmiris freedom movement, scrapped the IIOJK’s special constitutional status and dissolved the assembly and moreover, arrested the puppet\nKashmiri leadership.\nRehmani said the sacrifices of Kashmiris would not go waste and the day was not far when India would be dismembered into dozens of independent states, including Assam, Khalistan and many more.\nHe urged the international community to resolve the Kashmir issue in accordance with the wishes of Kashmiris to ensure secure, peaceful and prosperous South Asia.\nHe said neither the IIOJK was the bilateral issue between India and Pakistan, nor it was a struggle between Hindus and Muslims, but it was basically an issue of human rights.\nAccording to the United Nations Security Council (UNSC) resolutions, the IIOJK issue shall be decided as per aspirations of its people, he added.\nAbout Youm-e-Istehsal being observed on August 5, he said there were so many dark chapters in the history of IIOJK but abrogating Article 370 and 35A was the darkest one.\nHe thanked the Pakistani nation for supporting the Kashmir cause since the last 72 years. He said even in India, the people were raising their voices against the Indian government’s brutalities and illegal actions in the IIOJK.\nThe Hurriyat Leader Rehmani said the Kashmir issue had been effectively highlighted at all the international fora including European Union Parliament and British Council. They had condemned the human rights violations and other discriminatory laws introduced by the Indian government in the IIOJK and supported the Kashmiris resolve to self-determination in the light of UNSC resolutions.",
  "retrievedAt": "2025-08-11T19:36:17.663Z"
}
