{
  "title": "APHC reiterates call for Youm e Istehsal on August 5 in IIOJK",
  "link": "https://www.app.com.pk/national/aphc-reiterates-call-for-youm-e-istehsal-on-august-5-in-iiojk/",
  "date_published": "2020-08-04T00:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):The All Parties Hurriyat Conference (APHC) has reiterated its call for Youm e Istehsal on August 5 and appealed for a complete strike on the day to reaffirm the resolve of fighting illegal and illegitimate rule of New Delhi in Indian illegally occupied Jammu and Kashmir (IIOJK).\nAccording to Kashmir Media Service, the Indian government on August 5, 2019, had repealed the Kashmir’s special status and divided into two union territories besides imposing lockdown and military siege in the i8iuterritory.\nThe APHC spokesman in a statement issued in Srinagar said that through its military might and political deception India had turned IIOJK) into a big prison where rights of people were being ruthlessly snatched through a number of colonial laws.\nHe said that IIOJK was one unit and an internationally recognized dispute and people of Jammu, Kashmir and Ladakh would never accept its fragmentation.\nThe bifurcation adopted by New Delhi and subsequent laws fabricated to force demographic changes in all three regions holds no moral, legal and constitutional ground and are totally in confrontation with International law, he added.\nThe spokesman said the people of all three regions are being pushed to the wall with their land, jobs, identity and culture being transgressed.\nIssuance of tens of thousands of domicile certificates in last one year, giving land and job rights to outsiders in random, clearing administration, judiciary and police from local officials and bring all outsiders on top posts, giving free hand to army to occupy land are some laws to be pointed out, he maintained.\nThe complete strike on August 5 would be an eye-opener to New Delhi and world community to show commitment and resolve to resist the occupation and colonial policies of New Delhi.\nTo tell New Delhi and the world that people of Jammu, Kashmir and Ladakh are one and will continue their struggle for justice and restoration of their inalienable right to self determination, he added.\nExplaining the details of the August 5 programmes, the spokesman said that on the day, the people of the territory would observe blackout in the evening and after Maghrib prayers, anthems of freedom will be sung in the mosques.",
  "retrievedAt": "2025-08-11T19:36:21.962Z"
}
