{
  "article_id": "2025-01-18_279d3afe8f07b1d03cfee669fe07d112",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886014/judicial-commission-of-pakistan-approves-appointment-of-five-judges-for-ihc-bhc",
    "retrieved_at": "2025-10-12T00:53:51.598Z"
  },
  "metadata": {
    "title": "Judicial Commission of Pakistan approves appointment of five judges for IHC, BHC - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-18T01:29:23.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 318,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: The Judicial Commission of Pakistan (JCP) in a meeting, presided over by Chief Justice Yahya Afridi, approved the appointment of five additional judges - two in the Islamabad High Court (IHC) and three in the Balochistan High Court (BHC) - for one year, on Friday. According to a statement by the JCP, two meetings of the commission - one for considering nominations for the appointment of additional judges in the IHC and the second for the BHC - were held in the conference room of the Supreme Court. In the first meeting, the JCP by a majority decision approved the appointment of District and Sessions Judge (DSJ) Mohammad Azam Khan and Supreme Court advocate Inaam Ameen Minhas for their appointment as additional judges of the IHC. Later, in a separate meeting, the JCP unanimously approved the names of SC lawyers Mohammad Asif, Muhammad Ayub Khan, and by a majority decision finalised the appointment of SC lawyer Muhammad Najamuddin Mengal as additional judges of BHC. Nominees who failed to get required votes to be considered for future vacancies The commission decided that the nominees who did not secure the required majority vote of the JCP members this time could be renominated for future vacancies. According to a notification issued by the JCP for the meeting to appoint the IHC judges, there were four vacant positions against which 21 candidates were applicants. However, the JCP approved the appointments of two nominees only. Sources privy to the development said that during the meeting, DSJ Khan and SC advocate Minhas secured the required number of votes. They said that during the second round of voting out of the remaining 19, the names of six candidates who secured the highest votes in the first round but could not achieve the required majority were considered. However, they could not secure the required votes in the second round. Published in Dawn, January 18th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}