{
  "article_id": "2025-01-18_6ae0b2028637c70b50c6f5ecd646275f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885946/kp-treasury-denounces-imrans-conviction-in-al-qadir-trust-case",
    "retrieved_at": "2025-10-12T00:54:09.533Z"
  },
  "metadata": {
    "title": "KP treasury denounces Imran’s conviction in Al-Qadir Trust case - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-18T01:31:09.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678ac1e6dc862.jpg",
    "categories": [],
    "word_count": 572,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR: Treasury members in the Khyber Pakhtunkhwa Assembly on Friday condemned the conviction of PTI founder and former prime minister Imran Khan and his wife in the 190 million Al-Qadir Trust case and declared the judiciary \"compromised\". During an assembly session here, Speaker Babar Saleem Swati suspended the order of the day to allow discussion on an accountability court's verdict to award 14 years in prison to the PTI founder and a seven-year jail term to his wife,Bushra Bibi, in the 190m Al-Qadir Trust case. \"Our judiciary is compromised, but our leader [Imran Khan] will never make a deal even if he is imprisoned for 100 years,\" treasury member Akbar Ayub said. He alleged that the Al-Qadir Trust verdict was given by powers-that-be and not the accountability judge. Insists Imran will never make deal for release The lawmaker urged authorities not to test people's patience anymore and release all political prisoners, including the PTI founder. He appealed to the United States, United Kingdom, Canada and international human rights organisations to take note of the situation for corrective measures by the Pakistani government. Mr Ayub also urged powers-that-be to ensure the success of the PTI-government dialogue. Former speaker Mushtaq Ahmad Ghani declared January 17 a black day in the country's history and said the entire nation was shocked by the unfair verdict. He warned of potential revolution over the denial of justice. \"We don't trust the judiciary - we spit on this kind of justice,\" he said. Mr Ghani urged the PTI's central leadership to think about tangible steps to ensure early release of incarcerated Imran Khan. From the opposition benches, PPP lawmaker Ahmad Karim Kundi said the country had a history of bitter judicial verdicts and complained that it was Imran Khan's government that refused to accept the demands of the then opposition. He said that during the PTI's rule, political forces proposed an end to selective accountability but the government rejected the idea due to its alignment with the then military leadership, especially spymaster General Faiz Hameed. Mr Kundi also insisted that the PTI advocated for military courts despite warnings by democratic forces. He said if parties were serious about the elimination of politics of revenge, then they would have to sit down together. Member of the opposition JUI-F Lutfur Rehman said the PTI had the right to challenge the Al-Qadir Trust verdict in the superior courts. He said in principle, his party opposed the sentencing of a political leader. \"We [politicians] have weakened democratic institutions by calling each other thieves,\" he said. Mr Rehman said his party didn't favour politically-motivated convictions and detentions. Law minister Aftab Alam Afridi alleged that the country was ruined by judges and military generals. He demanded their accountability for national development. The minister said that former Supreme Court chief justice Faez Isa, who deprived the PTI of its electoral symbol bat, didn't stay in the country even for a day after his retirement. He said six judges wrote a letter to the Supreme Court, alleging they and their families were pressured for challenging the position of authorities. He said the country was controlled by a \"dangerous mafia\" urging people to rise against it for the future of next generations. Mr Afridi said it was no longer the 80s or 90s when generals managed the country's political affairs. He urged the people to rise for the sake of their future. Published in Dawn, January 18th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}