{
  "article_id": "2025-01-18_a0af0625e5acbcb0c3af1fb789d78a9e",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886081/pakistan-stretches-lead-to-202-as-spinners-dominate-first-multan-test-against-west-indies",
    "retrieved_at": "2025-08-26T07:46:13.873Z"
  },
  "metadata": {
    "title": "Pakistan stretches lead to 202 as spinners dominate first Multan Test against West Indies - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-18T12:21:32.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/181721076e8b082.jpg",
    "categories": [],
    "word_count": 459,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Spin wizards Noman Ali and Sajid Khan guided Pakistan to a strong position against the West Indies after another spin-dominated second day's play in the opening Test in Multan on Saturday. The pair shared nine wickets between them to dismiss the West Indies for a paltry 137 in reply to the home team's 230 all out earlier in the day. By the close, Pakistan stretched the 93-run lead to 202 by scoring 109-3 in their second innings, with Kamran Ghulam and Saud Shakeel batting on nine and two respectively when bad light ended play 25 minutes before time. Left-arm spinner Jomel Warrican (2-17) dismissed Muhammad Hurraira for 29 after an opening stand of 67 and Babar Azam for a second failure, trapped leg-before for five. Skipper Shan Masood looked solid for his 52, hitting two sixes and two fours, before Warrican ran him out after attempting a quick single. Noman grabbed 5-39 for his seventh five-wicket haul in Tests, while Sajid finished with 4-65 to dismiss the West Indies for 137 after lunch in a first innings that lasted just 25.2 overs. Pakistan earlier lost their last six wickets for 43 runs after resuming at 143-4 and were bowled out for 230 in their first innings. The dry and grassless Multan pitch has already produced 20 wickets in five sessions even though two-and-a-half hours were lost on day one, and another 30 minutes on Saturday, because of poor visibility. Noman and Sajid, who shared 39 of the 40 wickets in the last two Tests against England in Pakistan's 2-1 series win last year, were once again unplayable. Sajid opened the bowling and removed Mikyle Louis (one), Keacy Carty (0), Kraigg Brathwaite (11) and Kavem Hodge (four) in his first three overs. Noman then further jolted the tourists with another four wickets to leave them on 66-8. The tail-enders showed more resistance, with number 10 batsman Jomel Warrican unbeaten on 31, with Gudakesh Motie adding 19 and Jayden Seales the last wicket to fall for 22. Seales hit three sixes before holing out off-spinner Abrar Ahmed. Warrican also took 3-69 in Pakistan's innings. Saud Shakeel top-scored for Pakistan with 84 off 157 deliveries, including six boundaries, while keeper Mohammad Rizwan added 71. Shakeel added an invaluable 141 for the fifth wicket with Rizwan, lifting Pakistan from a precarious 46-4 on day one. Kevin Sinclair sparked the Pakistan batting collapse by taking Shakeel's wicket with the first ball after drinks. He then trapped Rizwan leg-before off a missed reverse sweep, the original decision of not out overturned on review. Rizwan's 133-ball stay included nine boundaries. Sajid hit a boundary and a six in a rapid-fire 18 before he was bowled by Warrican on the stroke of lunch to end Pakistan's innings.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}