{
  "article_id": "2025-01-18_93ccc43c69659089465677e4e558b892",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886079/indian-court-finds-man-guilty-in-notorious-kolkata-hospital-rape-case",
    "retrieved_at": "2025-08-26T07:46:13.144Z"
  },
  "metadata": {
    "title": "Indian court finds man guilty in notorious Kolkata hospital rape case - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-18T12:01:32.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/181653272b2a191.jpg",
    "categories": [],
    "word_count": 420,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "A court in India's Kolkata on Saturday found a 33-year-old man guilty of the rape and murder of a doctor, a crime that sparked nationwide protests and hospital strikes last year. The discovery of the victim's bloodied body at a government hospital in the eastern city of Kolkata last August once again highlighted the chronic issue of violence against women in the world's most populous country. It led to demands by doctors at government hospitals for additional security, with thousands of citizens in Kolkata and elsewhere in India joining the doctors' protests in solidarity. The trial of defendant Sanjoy Roy was fast-tracked through India's normally glacial legal system and arguments in the case concluded a little over a week ago. \"The sentence will be delivered on Monday,\" presiding judge Anirban Das said after finding Roy, a civic volunteer in the hospital, guilty of rape and murder. Roy has consistently maintained his innocence and again told the court that he was not guilty. \"I have been framed,\" he said. Roy was brought to court by a prison van and greeted by a crowd of protesters, held at bay by police officers, demanding he be given the death penalty. \"Hang him, hang him,\" they chanted. The sentiment was echoed by the victim's family, none of whom have been identified in keeping with Indian law around the reporting of sexual violence cases. \"The common man will lose faith in the judiciary if he is not handed down the death penalty,\" the victim's mother, seated just a few metres from Roy when the verdict was read out, told AFP. Her father added: \"He brutally snuffed out the life of our daughter. He deserves the same fate.\" The trainee doctor was found raped and murdered in a seminar room of the hospital last year. The crime led to nationwide outrage and prolonged protests by doctors across the state, demanding justice for the victim and stronger security measures in government hospitals. Roy was arrested a day after the victim's body was discovered. India's Supreme Court set up a national task force after the protests that suggested ways to enhance safety measures in government hospitals. The victim's father at one of the protest marches in October told AFP that his family was \"devastated\". \"My daughter's soul will not rest in peace until she gets justice,\" he said. The gruesome nature of the attack drew comparisons with the 2012 gang rape and murder of a young woman on a Delhi bus, which also sparked weeks of nationwide protests.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}