{
  "article_id": "2025-01-18_2edb561fb31c867249ddceb27fc47277",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886027/short-term-inflation-declines-for-third-consecutive-week",
    "retrieved_at": "2025-10-12T00:53:53.282Z"
  },
  "metadata": {
    "title": "Short-term inflation declines for third consecutive week - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-18T01:29:30.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678b02d60df03.gif",
    "categories": [],
    "word_count": 443,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD: Short-term inflation, measured by the Sensitive Price Index (SPI), eased to 1.16 per cent year-on-year in the week ending on Jan 16 owing to a decline in the prices of perishable food items. The SPI-based inflation continued downward for the third week in a row mainly due to a decline in the prices of tomatoes, potatoes and onions. It declined by 0.39pc from the previous week, official data showed on Friday. The short-term inflation rate has also slowed due to the higher base of last year. Prices remained higher, but the rate of growth decreased in the past few weeks. Edible oil manufacturers have already raised their prices in recent weeks. Retail tomato prices remained elevated, but reduced from their peak of Rs300 per kilogram in the previous week. The government had slightly increased petrol and diesel priced in the last two reviews. This will also have an impact on transportation charges as well as prices of vegetables and fruits. In March, the decline in SPI came after a consistent 11-week period of inflation above 40pc, surging from 29pc recorded on Nov 8, 2023. The weekly inflation hit a record 48.35pc year-on-year in early May 2023, but then decelerated as low as 24.4pc in late August 2023 before surging past 40pc during the week ending Nov 16, 2023. The items whose prices saw a decline week-on-week included tomatoes (18.31pc), potatoes (10.42pc), onions (10.01pc), eggs (8.64pc), chicken (2.17pc), LPG (1.21pc), pulse mash (0.81pc), mustard oil (0.67pc) and garlic (0.54pc). The items whose prices increased the most over the previous week included bananas (3.22pc), petrol (1.39pc), vegetable ghee 2.5 kg (1.08pc), cooking oil 5-litre (1.01pc), firewood (1pc), diesel (0.99pc), pulse moong (0.89pc), shirting & vegetable ghee 1kg (0.74pc) each, sugar (0.72pc), cooked daal (0.59pc) and rice basmati broken (0.58pc). However, on an annual basis, the items whose prices increased the most included ladies sandal (75.09pc), potatoes (47.91pc), pulse gram (39.77pc), pulse moong (33.40pc), powdered milk (25.77pc), beef (22.59pc), vegetable ghee 1 kg (16.34pc), gas charges for Q1 (15.52pc), cooked daal (15.43pc), garlic (15.27pc), shirting (14.83pc) and firewood (13.02pc). In contrast, the prices of onions dropped 47.22pc, followed by wheat flour (35.89pc), eggs (31.92pc), chilies powder (20pc), tomatoes (19.83pc), electricity charges for Q1 (18.11pc), pulse masoor (11.10pc), pulse mash (9.20pc), rice basmati broken (8.90pc), diesel (5.47pc) and petrol (1.18pc). The index, comprising 51 items collected from 50 markets in 17 cities, is computed weekly to assess the prices of essential commodities and services at shorter intervals. Data showed that the prices of 21 items increased, 10 decreased and those of 20 items remained stable compared to the previous week. Published in Dawn, January 18th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}