{
  "article_id": "2025-01-18_e0eb7ee5be61ee387333b305ebbe900d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885970/kurram-convoy-toll-rises-as-four-drivers-found-dead",
    "retrieved_at": "2025-08-26T07:46:44.798Z"
  },
  "metadata": {
    "title": "Kurram convoy toll rises as four drivers found dead - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-18T01:29:10.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678acced09fdd.jpg",
    "categories": [],
    "word_count": 737,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "- Five drivers still missing; over 10 of 35 trucks in convoy looted, set ablaze - Ringleader among five militants killed in Khyber - FC soldier martyred in Kalat IED blast KURRAM: Police recovered the bodies of four drivers with their hands tied following an attack on a convoy in the Bagan area of Lower Kurram a day ago. The bodies, found on Friday, were shifted to Alizai Hospital, where three of the deceased were identified as Imran, Hasan Ali and Shahid Ali, residents of the Kurram district. According to the police, the victims' bodies bore visible signs of torture. The attack occurred as a convoy carrying edibles and essentials travelled from Thall town to Parachinar after a peace agreement had been brokered between warring sides. During the ambush, two security officials were martyred and five others injured. Retaliatory action by security forces left six attackers dead and 10 injured. It was earlier reported that one official had been martyred, but another succumbed to his injuries on Friday. Sources said that out of 35 trucks in the convoy, only two made it back to Thall, while more than 10 trucks were looted and set ablaze. Five of the drivers are still missing. Members of the government-sponsored grand jirga, which brokered the peace agreement, condemned the repeated violations. Speaking to the media, jirga representatives Pir Haider, Haji Noorjaf, Laiq Orakzai and Wasi Syed Mian said such attacks were deeply painful despite a peace agreement and demanded action against those violating the agreement. They also condemned the blockade of roads and termed it unfortunate. Majlis Wahdat-i-Muslimeen (MWM) parliamentary leader MNA Engineer Hamid Hussain also criticised the attacks and expressed regret over what he called a mysterious silence of the government. Tori Bangash tribal leader and Anjuman Hussainia Secretary Jalal Hussain Bangash demanded the government secure roads within three days and take strict action against those responsible. He warned of independent action by locals if the government fails to act. Meanwhile, protests in the Bagan area of Lower Kurram, which have been going on for three weeks, continued on Friday, with residents demanding the reconstruction of their town and compensation for losses incurred during an earlier attack. Protesters have vowed not to allow convoys to proceed to Parachinar until their demands are met. Local elder Haji Karim told Dawn that Bagan town, located about 60 kilometres from Parachinar, and its bazaar comprising over 500 shops and houses were destroyed in an attack following the Nov 21 ambush on a Parachinar-bound convoy. He claimed that assurances of compensation were made during a meeting with the general officer commanding the other day, but they remained contingent on the successful passage of the third convoy to Parachinar, which was disrupted in Thursday's attack. In a separate development, camps have been set up to accommodate temporarily displaced persons due to a possible operation against militants in the Bagan, Mandori, Charkhel, Chapri Paraw and Chapri areas of the restive Kurram district, according to a notification issued by the Kurram deputy commissioner office. It said the camps would be set up in Thall and Hangu. Five militants killed in Khyber Five militants, including a ringleader, were killed and one arrested during an exchange of fire with security forces in the Tirah area of Khyber district on Friday, the military's media wing said. The Inter-Services Public Relations (ISPR) said in a statement that the operation, based on intelligence about militant presence in the area, resulted in the elimination of militant leader Abidullah alias Turab. Weapons and ammunition were also recovered from the site. The ISPR said the militants were involved in multiple attacks on security forces and civilians. A sanitisation operation is ongoing to ensure the area is cleared of any remaining threats. FC soldier martyred In Balochistan, a Frontier Corps (FC) soldier was martyred and two others were seriously injured in an improvised explosive device (IED) blast in Kalat district, police officials said on Friday. The attack occurred on Thursday night in the Nechara area when FC personnel were patrolling the region. The IED, planted on the roadside, was detonated remotely. The body of the martyred soldier, identified as Havildar Tasnim, and the injured were shifted to the district hospital in Kalat. Security forces have launched a search operation to apprehend those responsible for the attack. Umer Farooq in Peshawar and Saleem Shahid in Quetta also contributed to this report Published in Dawn, January 18th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}