{
  "title": "NFIC conference calls for timely appointment of information commissioners",
  "link": "https://www.app.com.pk/national/nfic-conference-calls-for-timely-appointment-of-information-commissioners/",
  "date_published": "2024-05-10T13:17:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 10 (APP): The National Forum of Information Commissioners (NFIC) on Friday concluded its two-day conference calling for timely appointments of information commissioners to strengthen information commissions.\nThe event, held in collaboration with the Centre for Peace and Development Initiatives (CPDI) and the Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ), brought together stakeholders, experts, and policymakers across Pakistan, a news release said.\nOn the first day, the commissioners actively engaged with students, civil society organizations (CSOs), media representatives, advocates, and public information officers (PIOs) during a public event.\nPanel discussions addressed critical challenges related to the implementation of Right to Information (RTI) laws, commission orders, citizen expectations, PIO issues, GIZ-supported initiatives such as women’s facilitation and Khuli Kachehri sessions in Punjab and Khyber Pakhtunkhwa, aimed at improving public access to information.\nCPDI Executive Director Mukhtar Ahmad Ali underscored the importance of strong and empowered information commissions to uphold the RTI and ensure public access to information.\nHe said vacancies since 2019 and 2018 had left crucial posts of two information commissioners (ICs) unfilled, disrupting the quorum in KP commissions, including Sindh and Pakistan Information Commission.\n“Additionally, the imminent conclusion of the Chief Information Commissioner’s term in Punjab further accentuates the urgency for appointments,” he added.\n” The lack of quorum poses a serious threat to the functionality of information commissions, prompting a call on government institutions to expedite the appointment process,” he stressed.\nThe need for timely appointment of ICs was endorsed by all the information commissioners present in the meeting.\nThe second day of the conference featured an integration meeting where the commissions shared their progress and common issues faced by them.\nNFIC, established by CPDI in 2019, serves as a platform for collaboration and knowledge-sharing among RTI commissions.\nShoaib Ahmad Siddiqui, CIC of Pakistan Information Commission reported significant progress in establishing the authority of the commission. Due to initial challenges with public bodies’ responsiveness, efforts had been intensified, resulting in a notable reduction in complaint pendency from 3500 to 1500, he said.\nThe commission, he said, was prioritizing swift resolution of cases and enhancing accessibility through website updates in Urdu, along with implementing a more efficient complaint management system.\nFarah Hamid, CIC, KP Information Commission, highlighted significant challenges including lack of staff, vacant commissioner positions, and insufficient budgetary resources for daily and monthly expenses.\n“These obstacles pose substantial hurdles to the effective functioning of the commission,” she stressed.\nIn her update, she noted that upon assuming office, there were 1700 pending complaints, now reduced to 1513. She personally conducted 126 hearings, disposing of 96. Since November 2023, the commission resolved 500 complaints.\n“Currently, they receive an average of 25 complaints weekly,” she said.\nDr Jawaid Shah, CIC, Sindh, revealed the commission’s proactive measures, including issuing periodic letters designating PIOs and promoting proactive disclosure of information to government departments.\nShe said some 300 PIOs were designated across various public bodies in Sindh and weekly 50 complaints were achieved on average.\nMehboob Qadir Shah, CIC, Punjab Information Commission, emphasized substantial progress in raising awareness about RTI and proactive disclosure.\nExpressing gratitude for CPDI’s relentless efforts in protecting citizens’ right to information, he urged the prompt appointment of his successor by the Punjab Government to sustain the commission’s effectiveness in the region.\nIn conclusion, all commissioners committed to guaranteeing the effective implementation of RTI by advocating for maximum disclosure of information and fostering a culture of openness and transparency. They reassured the government departments that sharing information with the public should not evoke fear, emphasizing its importance.",
  "retrievedAt": "2025-08-11T02:25:52.552Z"
}
