{
  "title": "‘Route to Makkah’ project inaugurated for enhanced services for pilgrims at IIA",
  "link": "https://www.app.com.pk/national/route-to-makkah-project-inaugurated-for-enhanced-services-for-pilgrims-at-iia/",
  "date_published": "2024-05-10T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Secretary Religious Affairs, Zulfiqar Haider, alongside Saudi Ambassador Nawaf bin Said Al-Malki, formally inaugurated the ‘Route to Makkah’ project at Islamabad International Airport (IIA) on Friday.\nIn attendance were senior officials from Religious Affairs, Civil Aviation Authority, Anti-Narcotics, Airport Security Force, and members of the media.\nAddressing the media, the Secretary of Religious Affairs said the Saudi immigration and customs procedures for Hajj pilgrims departing from Islamabad would now be efficiently conducted in Islamabad itself. Consequently, these pilgrims would swiftly navigate through the Saudi airport and proceed to their destinations without delay, he added.\nHe further noted that this year, both Islamabad and Karachi airports’ pilgrims would avail themselves of this service. Last year, the count of pilgrims utilizing the ‘Route to Makkah’ stood at 26,000 while this year, concerted efforts had been made to double the number of Pakistani Hajj pilgrims benefiting from this streamlined process, he added.\nZulfiqar Haider expressed admiration for the Saudi government’s commitment to facilitating Pakistani pilgrims. He emphasized that the Pakistani government was utilizing all available resources to ensure the comfort and convenience of the ‘Guests of Allah’.\nSaudi Ambassador Nawaf bin Said Al-Malki hailed the ‘Route to Makkah’ initiative as a significant endeavor, aimed at providing comprehensive facilities to Pakistani pilgrims under one umbrella. He reassured that the Saudi government was fully prepared to offer extensive services to its guests.\nExpressing gratitude towards Prime Minister Muhammad Shehbaz Sharif for his initiatives regarding Route to Makkah, Ambassador Nawaf pledged ongoing efforts to enhance facilities for Pakistani pilgrims at other airports in the coming years.\nIn a concluding gesture, both Zulfiqar and Nawaf personally met with the pilgrims, presenting them with gifts as tokens of appreciation.",
  "retrievedAt": "2025-08-11T02:26:19.040Z"
}
