{
  "title": "Cabinet committee principally approves 24 entities for Privatisation Programme",
  "link": "https://www.app.com.pk/national/cabinet-committee-principally-approves-24-entities-for-privatisation-programme/",
  "date_published": "2024-05-10T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): The Cabinet Committee on Privatisation (CCOP), principally and for the time being, approved 24 State Owned Enterprises for the Privatisation Programme, directing the Privatisation Ministry to deliberate the phasing of each entity in consultation with the respective ministries.\nThe committee, which met here under the chair of Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, was presented with a phased Privatisation Programme (2024-29) by the Ministry of Privatisation, based on the recommendations of PC Board, according to a press release.\nThe meeting was also attended by other committee members including the finance minister, minister for commerce, minister for privatisation, minister for industries and production, governor State Bank of Pakistan, chairman SECP besides federal secretaries of various ministries and division.\nThe CCOP recommended that priority shall be accorded to privatisation of loss-making entities while the federal footprint shall be limited only to the Strategic and Essential SOEs under the federal government’s domain.\nThe CCOP emphasized that even the SOE making profits shall be considered for privatisation. After deliberating on the privatisation policy guidelines, the CCOP considered 84 SOEs in detail in light of SOE Act and Policy.\nFollowing the deliberations, the committee recommended that 40 SOEs, categorized as Strategic or Essential, shall be placed by respective ministries before the Cabinet Committee on State Owned Enterprises (CCoSOE) for their categorization as Strategic or Essential;\nThose SOEs which will not be categorized as Strategic or Essential shall be included in the Privatisation Programme, it added.\nThe CCOP directed Ministry of Privatisation to deliberate the rationale provided by respective ministries for not including 18 SOEs in consultation with them and firmed up proposals regarding each shall be submitted to CCOP in its next meeting.\nThe CCOP directed all ministries/ divisions to take up their cases of Strategic and Essential SOEs with CCOSOE at the earliest so that a comprehensive phased privatisation programme is finalised in the next meeting of CCOP.\nThe CCOP also considered the proposal for transfer of 322,460,900 shares of OGDCL from the Privatisation Commission’s CDC’s account to Ministry of Energy (Petroleum Division).\nThe matter was deferred with the direction to Law and Justice Division to holistically examine the provisions of Sovereign Wealth Fund Act 2023 in the instant case and submit its recommendations before the CCOP in its next meeting.",
  "retrievedAt": "2025-08-11T02:25:55.746Z"
}
