{
  "title": "Ulema, Mashaykh call for political accountability, collaboration for Pakistan’s stability",
  "link": "https://www.app.com.pk/national/ulema-mashaykh-call-for-political-accountability-collaboration-for-pakistans-stability/",
  "date_published": "2024-05-10T17:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): In response to the Pakistan Ulema Council (PUC)’s appeal, ‘Pakistan Stability Day’ was observed nationwide on Friday.\nAddressing congregations during Friday prayers from Karachi to Khyber, religious scholars and leaders reflected on May 9th as a dark chapter in Pakistan’s history, marked by the destruction of crucial defense installations and monuments by nefarious elements.\nThey emphasized that by dishonoring the martyrs, the enemy’s agenda was furthered. The perpetrators of these heinous acts should be brought to justice, and innocent individuals must be acquitted, they added.\nTo steer Pakistan towards stability, they said a cessation of confrontational politics was imperative. They were of the opinion that all political entities should openly acknowledge their errors and embrace dialogue. “This nation belongs to all of us, and it is incumbent upon each of us to resolve its issues and guide it towards stability and progress,” they added.\nThese views were expressed by Pakistan Ulema Council Chairman Hafiz Muhammad Tahir Mehmood Ashrafi, Allama Abdul Haq Mujahid, Maulana Muhammad Rafiq Jami, Maulana Nauman Hashir, Maulana Asad Zakaria Qasmi, Maulana Muhammad Shafi Qasmi, Maulana Asadullah Farooq, Allama Zubair Abid, Maulana Muhammad Ashfaq Pittafi, Maulana Abu Bakr Hameed Sabri, Maulana Tahir Aqeel Awan, Maulana Aziz Akbar Qasmi, Maulana Haq Nawaz Khalid, Maulana Obaidullah Gormani, Allama Tahir-ul-Hasan Maulana Hanif Usmani, Maulana Muhammad Asghar Khosa, Maulana Anwar-ul-Haq Mujahid, Maulana Abdul Malik Asif, Maulana Aslam Siddiqui, Maulana Abdul Hakeem Athar, Maulana Abdullah Haqqani, Maulana Abdul Waheed Farooqui, Maulana Abu Bakr Hamza, Maulana Habib-ur-Rehman Abid, Maulana Amin-ul-Haque Ashrafi, Maulana Izhar-ul-Haq Khalid, Sahibzada Hamza Tahir-ul-Hassan, Maulana Saadullah Ludhianwi, Maulana Anis-ur-Rehman Baloch, Maulana Abdul Rasheed, Mufti Muhammad Umar Farooq, Maulana Abdul Ghaffar Shah Hijazi, Maulana Muhammad Ahmad Makki, Maulana Aziz-ur-Rehman Muawiya, Mufti Imran Muawiya, Maulana Saadullah Shafiq, Maulana Yasir Alvi, Qari Abdul Rauf, Maulana Matloob Mahar, Maulana Zubair Khatana, Maulana Aqeel Zubairi, Qari Aziz-ur-Rehman, Maulana Shabbir Khatana, Maulana Zubair Khatana, Qari Abdul Majid Lahori, Maulana Farooq Khanpuri, Maulana Qasim Sangi, Maulana Ashraf Malik, Maulana Ijaz Malik, Qari Abdul Wahab Muawiya, Maulana Muhammad Bilal Saqib, Qari Ibrahim, Qari Riaz, Maulana Ameer Muawiya, Mahar Abdul Khaliq Murali, Maulana Muneeb-ur-Rehman Haidari, Qari Mohabat Ali Qasmi, Qari Zulqarnain, Maulana Tayyab Qureshi, Qari Mehmood-ul-Hassan, Qari Abdul Majid Malik, and Maulana Waqas Iqbal during Friday sermons.\nThe learned scholars and spiritual leaders emphasized that those responsible for the events of May 9, against whom evidence exists, must undergo swift judicial proceedings. They said prolonged delays in these crucial cases were worrisome for the nation, as they allow malevolent forces to exploit the situation, sow discord among the populace, and destabilize the country.\nThey said the unified forces and citizens would continue to stand together to navigate the nation out of its current challenges towards a path of stability and progress.\nThey emphasized that all political factions should set aside their personal agendas, collaborate for Pakistan’s stability, openly acknowledge their errors, and humbly apologize for them. “Admitting and apologizing for mistakes is a hallmark of great leadership,” they opined.\nIn the wake of enduring crises, Ulema and Mashaykh said Pakistan was once again progressing towards economic stability. In this context, they said all political entities must exhibit responsible conduct and contribute to the nation’s journey towards stability.\nThey said the nation could not afford further discord. With established courts and institutions, they said individuals with grievances should seek recourse through proper channels instead of resorting to street protests that hinder developmental progress. They said such actions were in the best interest of the country and its citizens.",
  "retrievedAt": "2025-08-11T02:26:17.195Z"
}
