{
  "title": "Dy Chairman Senate attends flower exhibition at FG Public School",
  "link": "https://www.app.com.pk/national/dy-chairman-senate-attends-flower-exhibition-at-fg-public-school/",
  "date_published": "2024-05-10T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Deputy Chairman Senate, Syedaal Khan on Friday attended a flower exhibition at FG Public School on Madrasah Road, Quetta.\nThis event was organized by the school’s children in collaboration with school administration, which showcased a variety of beautifully arranged flowers, said a news release received here.\nDuring his visit, the Deputy Chairman praised Lt. Col. Abdul Mustafa, Regional Director FGEI, Principal Nasir Ali Mughal, and the students for their efforts in managing such an impressive display with limited resources.\nHe noted that the quality of the event reflected the professionalism of the school management and the creativity of the students.\nThe Deputy Chairman Senate visited various stalls at the exhibition and commended the children for their work, highlighting that events like these in educational institutions help foster creativity among students and promote environmental awareness in the younger generation.\nHe emphasized that the creativity and talent demonstrated by the children would guide Pakistan towards development and prosperity.\nEncouraging the school administration, he suggested for organizing similar events annually to further develop creativity and resourcefulness, skills that are valuable in both personal and professional life.\nHe stressed the importance of nurturing these talents for a brighter future for the children and the country as a whole, expressing hope for continued success and a positive impact on the community.\nLater, the Deputy Chairman visited the Quetta Electric Supply Company (QESCO) headquarters, where he received an extensive briefing from the Chief Executive Officer, Engineer Shafqat Ali.\nDuring the visit, he met with the President of the QESCO Engineer Officer Association, Engineer Mujibur Rahman Marri, along with other members of the Association, including General Secretary Engineer Kaleemullah Jogezai, Senior Chief Engineers Muhammad Naeem Kakar, Syed Yusuf Shah, Muhammad Hashim Jogezai, Engineer Samiullah, Salam Mengal, Muhammad Nizam Achakzai and Karam Bakhsh Badini.\nThe Deputy Chairman assured them that he would work to resolve the various issues and challenges faced by the engineers, officers and employees at QESCO.",
  "retrievedAt": "2025-08-11T02:25:52.567Z"
}
