{
  "title": "President urges global efforts to address climate change through eco-friendly technology, forestation",
  "link": "https://www.app.com.pk/national/president-urges-global-efforts-to-address-climate-change-through-eco-friendly-technology-forestation/",
  "date_published": "2024-05-10T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): President Asif Ali Zardari on Friday underlined the need for global efforts to address the challenge of climate change by adopting environment-friendly technology, promoting afforestation, and reducing greenhouse gas emissions.\nThe president, talking to the Minister of Ecology and Natural Resources of Azerbaijan/COP 29 President-designate, Mukhtar Babayev, who along with his delegation called on him, highlighted that global warming and climate change were affecting the glacier and causing water scarcity.\nHe said that tackling these challenges required global support to mitigate their adverse impacts.\nAzerbaijan is going to host the 29th Conference of Parties to the United Nations Framework Convention on Climate Change (COP 29) in Baku in November 2024 and the minister, in his capacity as the President-designate of COP 29, is here to invite President Zardari to the conference.\nWelcoming the minister, the president congratulated Azerbaijan on winning the bid to host COP 29 and expressed the hope that COP 29 would result in setting the New Collective Quantified Goal on Finance that would help developing countries fulfil their climate finance needs.\nHe highlighted that Pakistan had planted mangrove forests over hundreds of thousands of hectares that would help protect the environment, besides earning carbon credits for Pakistan.\nPresident Zardari said that Pakistan highly valued its relations with Azerbaijan and wanted to further expand bilateral cooperation in the areas of common interest.\nHe called for promoting more interactions, bilateral exchanges and people-to-people contacts to further cement relations between the two brotherly countries.\nMukhtar Babayev underlined the need for further enhancing bilateral cooperation between Pakistan and Azerbaijan, particularly in the area of tourism and culture.\nHe also delivered the invitation to the president to participate in COP 29 in Baku in November 2024.\nThe president conveyed his best wishes for the successful hosting of COP 29 and expressed the hope that Azerbaijan would play its role to secure the interest of developing countries in meeting their financing needs for climate adaptation.",
  "retrievedAt": "2025-08-11T02:25:55.698Z"
}
