{
  "title": "Tarar for  measures at global level to counter misuse of social media, spread of fake news",
  "link": "https://www.app.com.pk/national/tarar-for-measures-at-global-level-to-counter-misuse-of-social-media-spread-of-fake-news/",
  "date_published": "2024-05-10T07:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Friday that there was a need for measures at the global level to counter the misuse of social media and the spread of fake news.\n“The Government of Pakistan recognizes the importance of freedom of the press and freedom of expression, and it is determined to protect the rights of journalists”, he said while talking to a delegation of Bangladeshi journalists visiting Pakistan who met him here.\nIn the meeting, various important issues were discussed including freedom of expression and economic initiatives of the government.\nThe minister said that the government led by Prime Minister Shehbaz Sharif was fully focused on economic stability.\nAfter the present government came to power, he said economic indicators were becoming positive, international journals were also predicting improvement in Pakistan’s economy.\n“The government is also taking steps to invest in infrastructure projects in Pakistan,” the minister said adding these projects would not only boost the economy but also create employment opportunities.\nThe government, he said had established a special Investment Facilitation Council to attract foreign investment and facilitate investors.\nPrime Minister Muhammad Shehbaz Sharif was determined to provide relief to the people, he maintained.\nTarar said that the tax collection system was being improved in Pakistan, and in this context, tax reforms were being introduced in the Federal Bureau of Revenue.\nHe thanked the Bangladeshi journalists who visited Pakistan and took interest in learning about the government’s economic initiatives.\nThe delegation of Bangladeshi journalists thanked the Government of Pakistan, the Ministry of Information and Broadcasting, and journalism institutions for hosting and providing support to them in Pakistan.\nThe members of the delegation said it was very good to visit Pakistan and expressed the hope that such visits would promote relations between the two countries and people-to-people contacts.\nThe delegation of Bangladeshi journalists included Iqtadar Ahmed, Mukrram Hussain, Riaz Ahmed, Sheikh Sajid, Muhammad Abdul Wadud, Jaboon Ahmed Sarkar, Qamar-ul-Zaman and Moin-ul-Haq.\nExecutive Director General External Publicity Wing Ambrin Jan and other senior officers of the Ministry of Information and Broadcasting were also present on this occasion.",
  "retrievedAt": "2025-08-11T02:26:00.067Z"
}
