{
  "title": "Capital gears up to embrace plastic free environment",
  "link": "https://www.app.com.pk/national/capital-gears-up-to-embrace-plastic-free-environment/",
  "date_published": "2024-05-10T04:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): After repeated failed attempts of previous regimes, the present government has once again geared up a campaign to cleanse the federal capital of plastic waste.\nWith consistent population influx to Islamabad Capital Territory, the city continued getting dirtier in recent years making the government reorganize its efforts for a cleaner capital.\nFrom North to South, no drain, spring, river plain, or watercourse is found pure from plastics as the irresponsible attitude of the masses as well as city managers gradually adulterated the city.\nToday almost every water body is contaminated with single-use plastic bags, wrappers of chips, biscuits, water bottles, cold drinks, and single-use plastic cutlery.\nNow the situation in the capital is also not much different from other cities where littering has become a permanent threat to the environment. The biome is repeatedly ambushed by formidable tourists throwing their waste carelessly into natural habitats endangering wildlife, birdlife, and other species.\nCognizant of the situation, the Ministry of Climate Change and Environmental Coordination through its Pakistan Environmental Protection Agency (Pak-EPA) has re-launched a campaign to ban the one-time use of plastics under its proud slogan of “Say No to Plastics”.\n“The Ministry is spearheading enforcement of Single-Use Plastics (Prohibition) Regulations, 2023 that bars manufacturing, importing, distribution, sale and use of single-use plastic items,” remarked Director General, Environmental Protection Agency (Pak-EPA) Farzana Altaf Shah. “This campaign is particularly focusing on controlling plastic litter and promoting responsible consumer behavior.”\nShe said under the leadership of Prime Minister’s Coordinator on Climate Change, Romina Khursheed Alam, it is one of our prime responsibilities to keep capital clean.\nMeanwhile, Romina Khurshid Alam in her recent meeting with the members of the Collect and Recycle Alliance (CoRe) had also directed to take proactive steps through social media strategies, collection and recycling points, and follow-up meetings for effective implementation of Single-Use Plastics Regulations, 2023.\n“The producers, importers, distributors, suppliers, and beverage manufacturers have a critical role in implementing awareness-raising measures outlined in Section 12 of the law,” the PM’s Coordinator had underlined.\nThese measures include incentivizing responsible consumer behavior, promoting reusable alternatives, and educating consumers about the harmful impacts of plastic littering.\nGlobally plastic production per year has exceeded a whooping magnitude of 459.75 million tons with a cumulative production of 9.5 billion tons in total by 2019. In Pakistan alone, 3.3 million tons of plastic waste is generated annually which is equivalent to the height of two K2 Mountains.\nRealizing the urgency of action to curb plastic pollution, 175 nations forged synergies at the United Nations Environment Assembly in 2022 to develop an obligatory international agreement to end plastic pollution by 2024.\n“Pak-EPA has already tasked the schedule and enforcement teams for implementation of Single-Use Plastic (Prohibition) Regulations, 2023 with the collaboration and support of Islamabad Capital Territory (ICT) administration,” informed Farzana Altaf Shah.\nThe aim of Single-Use Plastics (Prohibition) Regulations 2023 is to fight littering and prevent carcinogenic and problematic plastic items from entering the market to reduce adverse impacts on human health and the environment, Farzana said.\nThe Single-Use Plastics (Prohibition) Regulations, 2023 mark a significant milestone in Pakistan’s commitment to environmental sustainability. By adopting comprehensive measures to tackle plastic pollution, Pakistan reaffirms its dedication to safeguarding the health of its citizens and preserving its natural heritage for future generations.\nRecently, the Pak-EPA enforcement team confiscated over 0.27 tons of plastic bags and disposable cutlery from different markets, hotels, eateries, retailers, and Margalla Hills National Park in the federal capital.\n“The government’s revived campaign on the prohibition of plastics was appreciable, but it should have a three-tier approach of ACA (Awareness, Capacity, and Accountability),” opined the CEO, of Resilient Future International, Aftab Alam Khan.\nHe said, in terms of awareness there are quadrants of components against plastic pollution like ‘refuse, reduce, reuse and recycle.’ “This 4R strategy is very important because we have to stop production of harmful plastic and look for better means to fulfill masses requirement.”\nKhan noted that awareness was crucial for end users, consumers, retailers, and producers. “It is also important to build the capacity of industry and stakeholders associated with the plastic industry. The government should ensure an enabling environment so the industry can produce cheap and good quality reusable products.”\nHe also suggested strict accountability and enforcement of the law for producers and retailers and authorities responsible for the implementation of related laws. “If there is a lack of implementation and accountability, all efforts to purge society of plastics would be futile.”\nThe Single-Use Plastics (Prohibition) Regulations 2023 states that due to a lack of alternatives and the need for transition to a circular economy, single-use plastic beverage containers shall contain at least 50% recycled plastic from 1st July 2028.\nIt further states that it should be based on the ‘polluter pays principle’ and that plastic waste may be collected by producers, importers, and beverage companies, record keeping, and disclosure of data by producers and importers of single-use plastics.\nIn this context, the producers, importers, distributors, suppliers, and beverage companies may be directed to initiate awareness campaigns and for enforcement of these Regulations, fines may be imposed by the Pakistan Environmental Protection Agency for violations.\nAPP/ajb/maz (APP Feature Service)",
  "retrievedAt": "2025-08-11T02:26:04.788Z"
}
