{
  "title": "Rawalpindi man sentenced to death by hanging for raping woman - Pakistan - DAWN.COM",
  "author": null,
  "content": "A sessions court in Rawalpindi sentenced a man to death on Friday for raping a woman.\n\nAdditional Sessions Judge Afshan Ijaz Sufi announced the verdict today, sentencing the convict to be hanged to death under Section 17 of the Anti-Rape (Investigation & Trial) Act, 2021.\n\nThe judge also imposed a fine of Rs200,000 and ordered him to pay Rs500,000 in compensatory damages to the victim. In case of failing to pay, the convict will be sentenced to six months’ additional imprisonment.\n\nThe first information report of the case was lodged at the Saddar Beroni police station on July 20, 2024, under Pakistan Penal Code Section 376iii (punishment for rape of a minor) on the complaint of the victim’s mother.\n\nThe mother said she worked as a housemaid and had left her 21/22-year-old daughter and nine-year-old son at home when the culprit had entered around noon and raped the former. The woman said her children had raised a hue and cry with her son alerting someone who called her up and informed her about the incident.\n\nThe woman had urged the police for the strictest of punishment to be meted out to the culprit.\n\nIn February, a Rawalpindi additional sessions judge had convicted a man of raping his niece, sentenced him to life imprisonment and awarded a Rs500,000 fine.\n\nRape laws in Pakistan have seen significant reforms, particularly with the Anti-Rape Ordinance 2020, which introduced special courts for expedited trials, mandated medico-legal examinations within six hours, and established a national sex offender registry.\n\nHowever, systemic challenges persist, as over 80 per cent of suspected sex offenders are acquitted due to deficient investigations, weak prosecutions, and societal prejudices.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/192007224e9bb08.jpg?r=200811",
  "retrievedAt": "2025-08-23T14:14:58.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911424/rawalpindi-man-sentenced-to-death-by-hanging-for-raping-woman",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T15:07:31.000Z"
}
