{
  "title": "South African players return to IPL with WTC final looming - Sport - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: South African Lungi Ngidi has returned for the Indian Premier League’s final phase, but the seamer and several of his compatriots are expected to exit the rescheduled tournament early to prepare for next month’s World Test Championship final.\n\nThe IPL will resume on Saturday after India and Pakistan agreed to a ceasefire following days of fighting between the nuclear-armed neighbours.\n\nThe South Africa squad for the June 11-15 WTC final against Australia at Lord’s includes eight players who are playing in the lucrative IPL, the final for which has been moved from May 25 to June 3.\n\nSouth Africa coach Shukri Conrad told reporters this week he expected the country’s IPL players to be released from their teams on May 26 and a Cricket South Africa spokesperson confirmed to Reuters on Thursday this was still the case.\n\nSouth Africa play a warm-up match against Zimbabwe from June 3-6 before heading to London.\n\nRoyal Challengers Bengaluru posted a video on social media on Thursday confirming the return of several of their players, including Ngidi.\n\n“Back at base and locked in!,” the franchise said.\n\nSouth Africans Tristan Stubbs and Aiden Markram — both part of the WTC final squad — are set to rejoin Delhi Capitals and Lucknow Super Giants respectively, ESPNcricinfo reported.\n\nBoth IPL franchises did not immediately respond to Reuters calls and messages seeking confirmation.\n\nA Punjab Kings official confirmed South African Marco Jansen was scheduled to rejoin the IPL side.\n\nBengaluru, chasing their maiden IPL title, have been reinforced by the returns of English trio Liam Livingstone, Jacob Bethell and Phil Salt.\n\nAustralian Tim David and West Indian Romario Shepherd have also linked up with Bengaluru, who play Kolkata Knight Riders on Saturday.\n\nJos Buttler will reunite with Gujarat Titans but will skip the playoff, should his team qualify, to be available for England’s six limited-overs matches against West Indies beginning on May 29.\n\nTable toppers Gujarat have picked Kusal Mendis as a replacement for Buttler, who can join the squad only after the last league game.\n\nPunjab Kings named Kyle Jamieson as a replacement for Lockie Ferguson, who has been ruled out of the rest of the tournament due to a hamstring injury.\n\nMeanwhile, Lucknow have roped in New Zealand fast bowler William O’Rourke as an injury replacement for Mayank Yadav, who is out for the rest of the season with a back injury.\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/161151029a8f074.jpg",
  "retrievedAt": "2025-10-12T03:05:39.155Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911250/south-african-players-return-to-ipl-with-wtc-final-looming",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T01:49:02.000Z"
}
