{
  "title": "Polio outbreak declared in Papua New Guinea - World - DAWN.COM",
  "author": null,
  "content": "A polio outbreak has been declared in Papua New Guinea, sparking concern about the disease’s spread in a country with low vaccination rates, health officials said.\n\nPapua New Guinea was certified as polio-free in 2000, but immunisation rates among children are low — less than 50 per cent, according to the World Health Organisation.\n\nThe virus was detected in wastewater and environmental samples in the Pacific nation’s capital, Port Moresby, and second largest city Lae, the WHO said.\n\nIn subsequent testing, two children in Lae were found to have the poliovirus type 2 strain, according to the WHO representative in Papua New Guinea, Sevil Huseynova.\n\nThe confirmation of community transmission in the children “constitutes a polio outbreak”, Huseynova said in briefing notes provided to AFP on Friday.\n\nThe health agency “expresses deep concern over the confirmed outbreak”, she said. Genetic testing showed the polio strain detected in Papua New Guinea was linked to one circulating in Indonesia.\n\n“Polio is a highly infectious disease, and in communities with low polio immunisation rates, the virus quickly spreads from one person to another,” Huseynova said.\n\nPapua New Guinea Health Minister Elias Kapavore said the situation was “serious but manageable”.\n\n“We’ve dealt with this before and know what works,” he told reporters on Thursday. “Vaccination is safe and effective, and we’re acting quickly to keep children protected,” he said.\n\nPoliovirus, most often spread through sewage and contaminated water, is highly infectious and potentially fatal. It can cause deformities and paralysis, and mainly affects children under five years old.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:14:56.371Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911384/polio-outbreak-declared-in-papua-new-guinea",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T08:15:35.000Z"
}
