{
  "title": "India should adhere to ceasefire, Pakistan will respond if hostilities resume: FO - World - DAWN.COM",
  "author": null,
  "content": "Foreign Office Spokesperson Shafqat Ali Khan on Friday urged India to maintain the ceasefire agreed with Pakistan, warning that the country would respond if the neighbour resumed aggression.\n\nThe military confrontation between India and Pakistan came as the former blamed Islamabad for the Pahalgam attack. On the night of May 6-7, New Delhi launched a series of air strikes on Pakistan, resulting in civilian casualties. Both sides then exchanged missiles, which stretched over the week. It took American intervention for both sides to finally drop their guns.\n\nThe nation observed Youm-i-Tashakur across the country today to honour the armed forces and the people for the victory in Operation Bunyanum Marsoos — a part of Marka-i-Haq — against India.\n\nDuring his weekly press conference today, the spokesperson said: “The recent announcement of a Pakistan-India ceasefire is a positive development. We urge India to faithfully adhere to its implementation.”\n\nHe said Pakistan appreciated the role of friendly countries in facilitating the ceasefire and reiterated support for US President Donald Trump’s announcement on engaging with Pakistan and India to seek a resolution to the Kashmir dispute.\n\nThe spokesperson said the ceasefire was achieved by the role of several countries. “India’s portrayal of Pakistan as acting out of despair and frustration of Pakistan is baseless,” he added.\n\nHe informed that the military operations chiefs of both countries had maintained periodic contact since May 10 and both had agreed on a “structured mechanism for phased de-escalation”.\n\nThe spokesperson said that Pakistan had also returned a constable of the Indian Border Security Force on Wednesday as a gesture of “goodwill” in return for a sepoy of the Pakistan Rangers.\n\nHe said that at a time when the internal community was promoting regional peace and stability, “India’s rhetoric reflects a persistent tendency to distort facts, justify aggression and cast unwarranted aspersions on Pakistan’s nuclear assets.”\n\nIn contrast, the spokesperson said that “Pakistan is a responsible state and remains committed to the ceasefire and taking necessary steps towards de-escalation and regional stability.”\n\nHe requested Pakistan’s international partners to ensure India honoured its commitments and refrained from further aggression due to its “belligerent posture”. “Should India resume hostilities, Pakistan will have no choice but to respond,” he warned.\n\nThe spokesperson said Pakistan always believed in dialogue and the restoration of peace and wanted a solution to all issues, including occupied Kashmir, through negotiations.\n\nSeparately, Deputy Prime Minister and Foreign Minister Ishaq Dar met UK Foreign Secretary David Lammy and discussed regional developments, including the ceasefire.\n\nDar appreciated the UK’s constructive role in de-escalation.\n\nThe two also reviewed bilateral ties and reaffirmed their commitment to strengthening relations and enhancing economic and trade cooperation.\n\nMeanwhile, Interior Minister Mohsin Naqvi had a meeting with United States Acting Ambassador to Pakistan Natalie Baker that focused on key issues of mutual interest, bilateral relations, and expanding cooperation between the two countries, the Associated Press of Pakistan reported.\n\nBoth sides exchanged views on the post-ceasefire situation between Pakistan and India with Naqvi expressing gratitude to Trump and the American ambassador for their pivotal role in bringing about the ceasefire.\n\n“The credit for the ceasefire between two nuclear powers goes to President Donald Trump,” he said.\n\nHe emphasised that President Trump had rendered a great service to humanity by helping avert a catastrophic conflict in the region.\n\nThe interior minister also appreciated the US president’s positive remarks regarding Pakistan’s leadership.\n\n“We welcome President Trump’s encouraging thoughts about Pakistan’s leadership,” Naqvi stated.\n\nReaffirming Pakistan’s commitment to strengthening ties with the US, Naqvi said, “We want to further enhance mutual cooperation with the US across various sectors”.\n\nIn response, Baker said the US valued its strong relationship with Pakistan.\n\n“We have excellent ties with Pakistan and look forward to continuing cooperation in multiple fields,” she said.\n\nAdditional reporting by Abdullah Momand.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/16152352f3e4958.jpg",
  "retrievedAt": "2025-08-23T14:14:58.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911413/india-should-adhere-to-ceasefire-pakistan-will-respond-if-hostilities-resume-fo",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T12:08:35.000Z"
}
