{
  "title": "Breakthrough unlikely as Putin declines to meet Zelensky in Turkiye - World - DAWN.COM",
  "author": null,
  "content": "ISTANBUL: Russia’s Vladimir Putin spurned a challenge to meet face-to-face with Volodymyr Zelensky in Turkiye on Thursday, instead sending a second-tier delegation to planned peace talks, while Ukraine’s president said his defence minister would head up Kyiv’s team.\n\nThey will be the first direct talks between the sides since March 2022, but hopes of a major breakthrough were further dented by US President Donald Trump who said there would be no movement without a meeting between himself and Putin.\n\nZelensky said Putin’s decision not to attend but to send what he called a “decorative” line-up showed the Russian leader was not serious about ending the war. Russia accused Ukraine of trying “to put on a show” around the talks. It was not clear when the talks would actually begin.\n\n“We can’t be running around the world looking for Putin,” Zelensky said after meeting Turkish President Tayyip Erdogan in Ankara. “I feel disrespect from Russia. No meeting time, no agenda, no high-level delegation — this is personal disrespect. To Erdogan, to Trump,” Zelensky told reporters.\n\nZelensky said he himself would also not now go to Istanbul and that his team’s mandate was to discuss a ceasefire.\n\nUkraine backs an immediate, unconditional 30-day ceasefire, but Putin has said he first wants to start talks at which the details of such a truce could be discussed. More than three years after its full-scale invasion, Russia has the advantage on the battlefield and says Ukraine could use a pause in the war to call up extra troops and acquire more Western weapons.\n\nBoth Trump and Putin have said for months they are keen to meet each other, but no date has been set. Trump, after piling heavy pressure on Ukraine and clashing with Zelensky in the Oval Office in February, has lately expressed growing impatience that Putin may be “tapping me along”. “Nothing’s going to happen until Putin and I get together,” Trump told reporters aboard Air Force One.\n\nDiplomatic confusion\n\nThe diplomatic disarray was symptomatic of the deep hostility between the warring sides and the unpredictability injected by Trump, whose interventions since returning to the White House in January have often provoked dismay from Ukraine and its European allies.\n\nWhile Zelensky waited in vain for Putin in Ankara, the Russian negotiating team sat in Istanbul with no one to talk to on the Ukrainian side. Some 200 reporters milled around near the Dolmabahce Palace on the Bosphorus that the Russians had specified as the talks venue. The enemies have been wrestling for months over the logistics of ceasefires and peace talks while trying to show Trump they are serious about trying to end what he calls “this stupid war”.\n\nHundreds of thousands have been killed and wounded on both sides in the deadliest conflict in Europe since World War Two. Washington has threatened repeatedly to abandon its mediation efforts unless there is clear progress.\n\nTrump said on Thursday he would go to the talks in Turkey on Friday if it was “appropriate”. “I just hope Russia and Ukraine are able to do something. It has to stop,” he said.\n\nAsked if Putin would join talks at some future point, Kremlin spokesman Dmitry Peskov said: “What kind of participation will be required further, at what level, it is too early to say now.”\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/160942291cac031.jpg",
  "retrievedAt": "2025-08-23T14:15:15.484Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911300/breakthrough-unlikely-as-putin-declines-to-meet-zelensky-in-turkiye",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T01:57:54.000Z"
}
