{
  "title": "No new projects for PHAF despite housing crisis in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Housing Authority Foundation (PHAF), a subsidiary of the Ministry of Housing and Works, has failed to launch any new apartment projects over the past decade, with its officials claiming that the foundation has not received any land in Islamabad since 2016.\n\nIts last project was an apartment complex launched in 2016 in Sector I-12. The residential component of the project is completed, but the commercial component is delayed due to financial constraints. In order to address this issue, a recent meeting of the PHAF board of directors, chaired by the housing minister, approved the “arrangement of short-term loan funding by reallocating resources from other projects to address the shortfall of funds for the I-12/1 project in Islamabad”.\n\nHowever, the PHAF has not received any new land since 2016, and it has been looking towards the federal government and relevant departments for the allocation of land. The PHAF was established in 1989 to provide affordable housing to low-income groups, federal government employees, and other specified segments of society.\n\nPHAF officials told Dawn that in the 1990s, the PHAF was granted land for housing projects, enabling the delivery of over 20 projects across Pakistan, covering 8,058 acres. Among these, eight major projects were completed and delivered in the prominent sectors of Islamabad, such as G-7, G-8, G-10, G-11, and I-16 sectors, and the Kuri Road project.\n\nOfficials claim foundation not allocated new land since 2016\n\n“We are in touch with the CDA and the FGEHA for the allotment of land for new projects. Federal Housing Minister Mian Riaz Hussain Pirzada, the housing secretary and the CEO of PHAF have been making efforts to make the PHAF a vibrant organisation,” said the housing ministry’s public relations officer, Fatima Batool.\n\n“PHAF’s mission to eliminate homelessness by offering subsidised housing is being severely hampered by the lack of institutional patronage. No new land has been allotted in Islamabad and its last project in I-16 has already been completed and apartments have been successfully transferred to the owners last year,” said an official of the foundation. He added that the situation had been exacerbated by the federal government’s “lack of aggressive housing initiatives”, even as a shortage of affordable homes for the government employees has become severe.\n\nThe official claimed that the Ministry of Housing and Works itself was in a state of uncertainty in light of recent decisions that rendered three of its departments defunct, most notably the Pakistan Public Works Department (PWD).\n\nAnother official said, “Despite government rhetoric of supporting the vision of affordable housing, PHAF has not received any land from the Federal Government Employees Housing Authority (FGEHA) and the CDA since 2016.”\n\nBesides I-12, the foundation has two active projects in Quetta and Peshawar, for which land was allocated by the provincial governments in 2008 and 2019, respectively. In addition to land constraints, PHAF officials said that it also suffered from “weak financial support mechanisms”.\n\nBoD meeting\n\nMeanwhile, Federal Housing Minister Mian Riaz Hussain Pirzada chaired the 59th board of directors meeting of the PHA Foundation on Wednesday. A press release said that the agenda included the confirmation of minutes of the 58th BoD meeting and the waiver of delayed payment charges on the additional cost of B-Type Blocks in the I-16/3 project in Islamabad, which was unanimously approved by the board.\n\nOn the matter of launching and constructing a commercial centre at the PHA-F Kuchlak Road project in Quetta, the board directed the initiation of an Expression of Interest (EOI). In addition, it also approved the arrangement of short-term loan funding by reallocating resources from other projects to address the shortfall of funds for the I-12/1 project in Islamabad.\n\nIn addition to this, an update was presented on the ongoing development at PHAF’s housing scheme in Surizai, Peshawar. It was informed that a temporary police station had been completed, enabling the deployment of police to enhance security and assist in land acquisition and encroachment removal.\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:02.214Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911342/no-new-projects-for-phaf-despite-housing-crisis-in-islamabad",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T02:44:17.000Z"
}
