{
  "title": "Lawmakers ask reasons for delay in Gwadar projects - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary panel on Thursday expressed concern over slow pace of development at Gwadar port and low utilisation of funds by various ministries.\n\nA meeting of the Senate Standing Committee on Planning, Development and Special Initiatives, presided over by Senator Quratulain Marri, reviewed key development initiatives, project delays, and progress under the Public Sector Development Programme (PSDP) 2024-25.\n\nThe committee noted that despite Gwadar’s strategic importance — it offers China a reduced maritime route of 2,000 nautical miles compared to the current 10,000 via Xinjiang — it has remained underutilised.\n\nIn 2009, 70 ships docked at Gwadar Port, while only four arrived last year. Officials further pointed out that even though Iran Chabahar’s port was built after Gwadar port, the former was now fully operational, whereas the Pakistani facility remains non-functional.\n\nDuring a discussion on the Gwadar Master Plan, the committee reviewed fund allocations, disbursements, and investment strategies. The chairperson of the committee expressed concern over the delay in execution of the Safe City Project and sought report on a critical discrepancy. The Gwadar Development Authority officials blamed lack of funds for the project delays while the Finance Division said it had received no funding demand from the Balochistan government.\n\nThe committee sought a report and directed that formal demand procedures should be followed.\n\nSenator Marri demanded that basic needs like water supply must be prioritised over tourism in the port city. “A master plan is not just about tourism. It must first ensure the welfare of local residents,” she said. She called for a clear strategy on how proposed investments would yield tangible incentives for development in the region. The meeting was informed that port charges at Pakistani seaports, particularly Gwadar, were higher than at any other port in the region. Senator Marri questioned the justification for these higher charges.\n\nOfficials clarified that the fees were imposed by Customs and the Gwadar Port Authority.\n\nThe meeting later reviewed fund utilisation for the fourth quarter PSDP. Awais Manzoor Sumra, Secretary to the Ministry of Planning, told the committee the planning division had made a total authorisation of around Rs1 trillion, but the major challenge now was its full utilisation by June 30.\n\nWhile reviewing the ministry-wise performance, Senator Marri expressed concern over low expenditures as only seven per cent of funds had been utilised by the Finance Division, four per cent by the Maritime Affairs division, and zero by the Religious Affairs and Interfaith Harmony Division over the last 10 months.\n\nKarachi-Sukkur Motorway\n\nThe Secretary, Ministry of Communications, briefed the committee about the Sukkur-Karachi Motorway project and ongoing negotiations with the government of Azerbaijan. He reported that discussions had also been initiated with the Islamic Development Bank (IsDB), with expectations that the bank will fund Section IV (Naushehro Feroz-Ranipur) and Section V (Ranipur-Sukkur). Board approval was expected by September this year.\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6826996759072.gif",
  "retrievedAt": "2025-10-12T03:05:56.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911289/lawmakers-ask-reasons-for-delay-in-gwadar-projects",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T01:48:54.000Z"
}
