{
  "title": "Senate committee clears IMF-driven grid levy bill - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Senate Standing Committee on Finance and Revenue unanimously cleared the government’s Captive Power Plants Levy Bill 2025 on Thursday.\n\nThis bill aims to provide legal justification for the grid levy imposed on the supply of natural gas or imported liquefied natural gas to industrial captive power plants (CPPs) as of March 7.\n\nThe committee meeting presided over by Senator Anusha Rahman of PMLN “unanimously agreed with the bill as introduced in the Senate, with no recommendations,” said an announcement issued by the Senate Secretariat. The levy was imposed on the insistence of the International Monetary Fund (IMF) to reach a Staff-Level Agreement (SLA) on the second review of the $7 billion Extended Fund Programme (EFF).\n\nSecretary Petroleum Momin Agha briefed the committee on the bill, stating that its purpose was to reduce the burden of capacity utilisation and ultimately lower electricity prices for the general public. He informed the committee that a 5pc levy was immediately imposed after the issuance of the ordinance.\n\nCPPs to pay 5pc tax as of March 7, which will be doubled to 10pc in July\n\nHe said the bill’s main objective was to increase the demand for electricity, utilise excess unused capacity, and avoid pressure on power sector liquidity, eventually encouraging the transition of gas/RLNG-based industry (captive power) to the power grid. The collection of levy will be utilised to lower the tariff for the power consumers, he said.\n\nTo keep the IMF programme intact, the government had to immediately notify the increase in gas rates for industrial captive power plants (CPPs) by about 23pc during the course of talks in the first week of March. The government had completed all the formalities speedily to impose Rs791 per million British thermal unit (mmBtu) grid levy with effect from March 7, and provided its copies to the IMF staff.\n\nThe government will increase the grid levy by 10pc in July, followed by 15pc in February 2026 and another 20pc by August 2026, taking the end-price of gas close to Rs6,000 to make gas supply punitive for the industry to shift to the national electricity grid.\n\nThe government promulgated the Off Grid Levy Ordinance from Jan 30 as required by the IMF but did not formally notify the levy rate. Official sources said the delay resulted in an increased levy rate to account for the lapse. Under the ordinance, the collection from the levy will be used to reduce power tariffs for other consumers.\n\nThis levy is applicable over and above the notified rates of natural gas or RLNG. The relevant authorities are required by the ordinance to “calculate the levy rate by taking into account the difference of power tariff of industrial B3 category notified by Nepra and the self-power generation cost of CPPs at the gas tariff notified by Ogra”.If the amount of levy is not paid within the specified time by the CPP, it would be recoverable under sub-section (2) and in case of persistent default in payment, the agent shall terminate the gas supplies to the defaulted captive power plant.\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:05:34.738Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911287/senate-committee-clears-imf-driven-grid-levy-bill",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T01:48:54.000Z"
}
