{
  "title": "Panel for action against Multan’s Nishtar burn centre staff - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government inquiry committee has recommended major penalties against six officials of Nishter Hospital Multan’s Pak-Italian Burn Centre (PIBC), following a Rs15.7 million medicine theft scandal.\n\nPunjab Chief Minister Maryam Nawaz had constituted an inquiry committee led by Sargodha Division Commissioner Jahanzaib Awan and Special Secretary, SHC&ME Department, south Punjab, as a member to look into theft of medicines worth Rs15.7m from the store of the Nishtar Hospital’s Pak Italian Burn Centre (PIBC) in May 2024.\n\nAfter investigation, the committee under the PEEDA Act 2006 recommended major penalties including dismissal from service, forfeiture of service and recovery of losses from the accused.\n\nThe chief minister approved the action against the officials on the recommendation of the inquiry committee and forfeiture of past three-year service of Dr Syed Ali Mehdi, Additional Director/AMS PIBC Nishter Hospital and recovery of Rs1.923m as his share of the loss on charges of gross negligence in preventing theft, failure to install CCTV cameras, and alleged collusion with thieves. Storekeeper Shoaib Hassan, security guards Muhammad Naeem, Imran Ali, Syed Farhan Ali, Liaqat Shah and helper electrical Amir Ahmad were dismissed from service for direct involvement in the theft and aiding the theft as per CCTV evidence.\n\nSix officials to face major penalties for ‘theft’ of medicines worth Rs15.7m\n\nThe CM also directed recovery of financial loss worth Rs11.5m -- by recovering Rs1.923m from each of the six guilty official.\n\nThe chief minister appointed Punjab Government Servant Housing Foundation Managing Director Moazzam Iqbal Sipra as Hearing Officer to finalise penalties after receiving defence(s) within seven days. Failure to respond will result in ex parte decisions.\n\nThe departmental representative (deputy secretary, SHC&ME) will facilitate access to evidence for the accused.\n\nInterestingly, the health and population department secretary had given Health Service south Punjab Director General Ali Mehdi additional charge of the post of health chief executive officer, Multan, on May 15 afternoon and later again issued a notification to cancel/withdraw the appointment after finding that Ali Mehdi was penalised in Nishter Hospital’s PIBC medicines theft case.\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:03.797Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911327/panel-for-action-against-multans-nishtar-burn-centre-staff",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T02:31:55.000Z"
}
