{
  "title": "RDA launches probe into Rs1.5 billion scam - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: An internal inquiry has been launched into an alleged embezzlement of Rs1.5 billion in the Rawalpindi Development Authority (RDA).\n\nA senior RDA official told Dawn that during checking of the civic agency’s accounts, it was revealed that Rs3 billion securities of the metro bus and others had been missing since 2016. He said there was no record of the funds with the civic body.\n\nHe said RDA Director General Kinza Murtaza called a meeting of the directors and asked them to carry out an audit of all the accounts. After checking the records and getting it verified, only Rs1.5 billion were found in different banks.\n\nHe said before the budget preparation, the accounts were reconciled and found no record of the amount. Upon this, he said, the civic body called three retired officials — a finance director, deputy director and an assistant.\n\nHe said the officials checked the data of different banks and found only Rs1.5 billion available. The official said that for the last about nine years, no record of the amount and interest on it had been kept.\n\nMeanwhile, a six-member committee was formed by the director general for an inquiry into the matter. He said the former finance department officials had been asked to explain why record was not maintained and where the amount was kept.\n\nHe said they were directed to explain why relevant record was not properly handed over/taken over to the incumbents before their retirement.\n\nHe said the former employees had been asked to respond within two days. “Failure to do so will be interpreted as an acknowledgment of the absence of any supporting evidence in their defence, and they will be held accountable for negligence resulting in the loss of public funds,” he said.\n\nWhen contacted, RDA Director General Kinza Murtaza said the Rs1.5 billion was still missing from the banks while “we found Rs1.5 billion in different accounts.” She said an internal inquiry had been started and after this the RDA would contact the National Accountability Bureau, FIA or Anti-Corruption Department.\n\nShe said the scam was unearthed during the checking of records. A private firm would be hired for the audit of the accounts, she said, adding, “We would not allow anyone to embezzle public funds at any cost.” She said the matter had also been brought in the notice of the Punjab government.\n\nPublished in Dawn, May 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:15:01.853Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1911338/rda-launches-probe-into-rs15-billion-scam",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T02:41:22.000Z"
}
