{
  "title": "CII holds awareness session on gender determination of intersex individuals",
  "link": "https://www.app.com.pk/national/cii-holds-awareness-session-on-gender-determination-of-intersex-individuals/",
  "date_published": "2024-12-05T17:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 05 (APP): The Council of Islamic Ideology (CII), in collaboration with the Birth Defect Foundation, on Thursday hosted an awareness session, focusing on gender determination for intersex individuals.\nThe session, chaired by CII Chairman Dr. Raghib Hussain Naeemi, brought together medical experts and religious scholars to address the topic.\nAddressing the gathering, Dr. Raghib emphasized the Islamic viewpoint on gender determination. He reiterated that altering one’s clearly defined gender is impermissible in Islam. However, he said, in cases of gender ambiguity, Islam permits medical intervention to ascertain and assign the appropriate gender.\nDr. Raghib criticized the use of the term ‘transgender’ as misleading, arguing that it conflates those with psychological conditions and those with congenital anomalies. He stressed that individuals with congenital defects should be referred to as ‘intersex’, while Islam does not recognize self-perceived gender identities.\nDr. Raghib further explained that Islam regards gender as a divinely determined characteristic at birth, and self-identification contrary to one’s biological sex is both un-Islamic and a psychological disorder requiring treatment\nDuring the session, Dr. Afzal Sheikh, Chief Surgeon of the Birth Defect Foundation, provided an in-depth briefing on medical perspectives regarding intersex conditions. He explained that biologically, every individual is either male or female. In cases where congenital abnormalities result in ambiguous sexual characteristics, medical evaluation can identify the dominant gender. Furthermore, he said surgical interventions can be performed to assign the predominant gender based on the individual’s physiological traits.\nDr. Ansar Javed, Chairman of the Birth Defect Foundation, alongside Head of the Health Centre, Tahira Javed Chaudhry, elaborated on congenital abnormalities and clarified the distinction between transgender individuals and intersex persons.\nThey noted that transgender individuals are typically born with no physical anomalies but may experience a psychological condition called gender dysphoria, where they identify as the opposite gender. In contrast, they said intersex individuals are born with physical anomalies requiring medical or surgical treatment.\nProminent religious scholars, including Allama Tahir Mehmood Ashrafi, Allama Iftikhar Hussain Naqvi, and Dr. Qibla Ayaz, former Chairman of the CII, also shared their insights. Other participants included Mufti Zameer Ahmad Sajid, Maulana Tanveer Ahmad Alvi, Dr. Inamullah, Dr. Ghulam Dastgir Shaheen, and Mufti Ghulam Majid.\nThe session concluded with a call for establishing dedicated rehabilitation centers in major cities for individuals with gender dysphoria and congenital anomalies. It emphasized that such individuals should neither be ostracized nor subjected to violence. Instead, strict laws should ensure their inclusion in families and access to medical care. Parents were urged to play a supportive role in their treatment.\nThe participants also highlighted the need for nationwide awareness campaigns to educate the public on the medical and Islamic perspectives on gender and intersex conditions. They underscored the importance of distinguishing between biological sex and gender identity and aligning societal practices with Islamic teachings, which prohibit imitating the opposite gender.",
  "retrievedAt": "2025-08-10T12:33:22.144Z"
}
