{
  "title": "PM reaffirms Pakistan’s support for just struggle of Palestinian people",
  "link": "https://www.app.com.pk/national/pm-reaffirms-pakistans-support-for-just-struggle-of-palestinian-people-2/",
  "date_published": "2024-12-05T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 5 (APP): Ambassador of Palestine to Pakistan, Dr. Zuhair Mohammad Hamadallah Zaid Thursday called on Prime Minister Muhammad Shehbaz Sharif at the Prime Minister House and discussed matters relating to mutual interests.\nWhile welcoming the ambassador, the prime minister reaffirmed Pakistan’s unwavering support for the just struggle of the Palestinian people for their right to self-determination, freedom and justice.\nHe reiterated Pakistan’s strongest condemnation of Israel’s genocidal actions against innocent Palestinians, particularly the worsening situation since October 7, 2023 that has resulted in the loss of over 43,000 lives and injured more than 105,000 others.\nThe prime minister expressed his deep disappointment at the absence of global accountability of Israel and reiterated the call for an immediate and unconditional ceasefire in Gaza and unhindered flow of humanitarian assistance to the suffering Palestinian people in the occupied territories.\nThe prime minister assured Ambassador Zaid that the entire Pakistani nation stood united in its solidarity with the brave Palestinian people and would continue to support them in every possible way.\nThe prime minister also stressed upon the need for a just and lasting resolution of the Palestine issue, based on the two-state solution, with the creation of an independent state of Palestine with pre-1967 borders and Al Quds as its capital, in accordance with the UN’s relevant resolutions.\nAmbassador Dr. Zuhair Mohammad Hamadallah Zaid deeply appreciated Pakistan’s steadfast support to the Palestinian people during their present ordeal, as well as Pakistan’s principled position on the Palestinian Question.\nHe thanked the prime minister for his leadership and support for Palestine, as well as for providing much-needed humanitarian assistance and offering scholarships to Palestinian medical students to complete their studies in Pakistan.\nThe prime minister wished the ambassador a productive tenure in Pakistan and assured him of his full support at all times.",
  "retrievedAt": "2025-08-10T12:35:41.449Z"
}
