{
  "title": "Conference participants emphasise need for educational institutions to integrate emerging tech",
  "link": "https://www.app.com.pk/national/conference-participants-emphasise-need-for-educational-institutions-to-integrate-emerging-tech/",
  "date_published": "2024-12-05T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 05 (APP): Participants of a conference Thursday emphasized the need for educational institutions to integrate emerging technologies, including artificial intelligence and e-learning platforms, to enhance teaching methodologies and improve student engagement.\nThe Conference for Quality and Innovation in Higher Education (CQIHE), hosted by the Faculty of Education at the International Islamic University Islamabad (IIUI) in collaboration with the Higher Education Commission of Pakistan and Admas University, concluded with recommendations aimed at advancing higher education practices.\nThe conference brought together approximately 300 participants from over 30 national and international institutions.\nIt featured 29 parallel sessions and 153 presentations selected from 195 submitted abstracts. Speakers at the conference suggested the development of policies to support lifelong learning through flexible educational pathways such as micro-credentialing and online courses, enabling students to continually update their skills.\nThey also recommended that curriculum development align content with learning objectives and adopt pedagogical approaches that foster critical thinking, creativity, and real-world problem-solving.\nExperts underscored the importance of designing training modules that promote inclusive education practices, ensuring diverse learning needs are addressed. They called for targeted efforts to make education accessible and equitable in diverse contexts.\nThe chief guest of the closing ceremony, Prof Dr Nasir Mahmood, Vice Chancellor of Allama Iqbal Open University, discussed challenges in tackling vicious circle of academic redundancy in Pakistani higher education.\nHe commended the conference for addressing critical issues in higher education. In his remarks, he shed light on the importance of relevancy of Pakistan’s educational system to the global trends in education.\nDiscussing the academic redundancy, he urged that lack of innovation or alignment with the contemporary needs must be addressed on priority level. VC AIOU stressed upon inculcation of indigenous values and cultural heritage.\nThe convener of the conference, Dr Fouzia Ajmal, remarked that the event marked the beginning of a new chapter in collective efforts toward transformative change in higher education.\nDr Azhar Mahmood, In-charge Programs, Faculty of Education, stressed the importance of continued collaboration to create a more equitable future in this field. It was also addressed by Prof. Dr. Muhammad Amir, Director Office of the Research Innovation and Commercialization, IIUI.\nThe conference featured five keynote addresses by international experts, including Dr Leele Susana Jamian from Malaysia, Dr. Steve Warner from Trinidad and Tobago, Dr Anzar Khaliq from the United States, Dr Samina Khan from Ethiopia, and Dr Nasir Mahmood from Pakistan.\nThe event concluded with a vote of thanks delivered by Prof Dr Muhammad Amir, Director of ORIC at IIUI, and the distribution of souvenirs to the guests and collaborators.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:26:46.707Z"
}
