{
  "title": "Pakistan eyes local solutions, accountability post-COP 29, says Climate Committee",
  "link": "https://www.app.com.pk/national/pakistan-eyes-local-solutions-accountability-post-cop-29-says-climate-committee/",
  "date_published": "2024-12-05T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 05 (APP):The National Assembly Standing Committee on Climate Change and Environmental Coordination, led by Tahira Aurangzeb, convened on Thursday to review Pakistan’s engagement at COP 29.\nWhile lauding the country’s strong presence, the committee called for a sharper focus on local solutions, equitable representation, and accountability in climate initiatives.\nDuring the session, the Ministry of Climate Change briefed members on Pakistan’s significant contributions at the global summit.\nIt was apprised that Prime Minister Shehbaz Sharif spearheaded the delegation, unveiling the nation’s Climate Finance Strategy and launching Carbon Market Guidelines aimed at enhancing voluntary carbon trading under the Paris Agreement. Pakistan’s pavilion hosted 52 events, featuring 200 speakers and attracting global attention.\nProgress was noted in securing international support, including a $200 million flood insurance MOU under the Global Shield Framework. However, challenges persist, including delays in Loss and Damage Fund contributions and geopolitical hurdles in accessing large-scale climate finance.\nThe committee raised concerns over the funds allocated to Pakistan’s COP 29 participation and their tangible benefits. Ministry officials assured members that unused funds remain intact and highlighted potential gains such as concessional loans and project approvals. Members also stressed the importance of involving elected representatives in climate delegations to address grassroots issues effectively.\nPakistan’s role in advancing the New Collective Quantified Goal (NCQG), focusing on non-debt-inducing climate finance for developing nations, was praised. Priorities such as climate adaptation, technology transfer, and ecosystem restoration were reaffirmed.\nMeanwhile, the committee deferred deliberations on The Pakistan Environmental Protection (Amendment) Bill, 2024, tabled by Ms Nuzhat Sadiq, until the next meeting.\nThe session saw attendance from several MNAs, include Tahira Aurangzeb, Aqeel Malik (virtually), Mir Khan Muhammad Jamali, Musarrat Asif Khawaja, Shaista Khan, Shaista Pervaiz, Shagufta Jumani, Mussarat Rafique Mahesar, Dr. Shazia Sobia Aslam Soomro, Shahzada Muhammad Gushtasap Khan, Ghulam Muhammad, and Awais Haider Jakhar (virtually).   The meeting was also attended by senior officers of the ministry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:37:01.758Z"
}
