{
  "title": "IFJ holds workshop to enhance journalist safety & gender equality in media",
  "link": "https://www.app.com.pk/national/ifj-holds-workshop-to-enhance-journalist-safety-gender-equality-in-media/",
  "date_published": "2024-12-05T18:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 05 (APP):The International Federation of Journalists (IFJ) conducted a two-day training workshop for journalists in Islamabad, focusing on technical skills to address field risks, improve professional standards, and raise awareness about equal rights in the media.\nThe workshop provided training to journalists from both electronic and print media on security and safety principles, professional solidarity, and key aspects of gender equality.\nIFJ, a global organization working in 134 countries and representing over 600,000 journalists, highlighted the challenges faced by journalists, safety guidelines, and the importance of the Women in Media Forum for female journalists during the workshop.\nIn her speech, Rashida Shoaib emphasized that the Women in Media Forum is a crucial part of the IFJ, with 250 members.\nShe mentioned the need to also train bureau chiefs and chief reporters to make journalists aware of the risks of violence.\nMeanwhile, Romisa Shah stressed that safety training for journalists should be included in curricula, and media organizations must take responsibility for ensuring the safety of their employees.\nDuring the workshop, Romisa, the IFJ Regional Coordinator, played a significant role in the various training stages. She presented essential points on promoting journalist safety, professional solidarity, and gender equality.\nRomisa also informed participants about the core objectives of the workshop and emphasized that providing equal opportunities for women in the media industry is an imperative need.\nThe workshop included discussions among participants about issues faced by journalists, such as job security, equal pay for male and female journalists, transport facilities, exemptions for women from night shifts, and the importance of merit-based promotions.\nRomisa Shah spoke about the significance of health insurance for journalists and a conducive environment for unbiased reporting, stressing that effective policy-making is necessary to address these issues.\nJournalists were also trained on field safety principles during the workshop. They were taught to remain cautious in emergencies, respect cultural norms, and make necessary preparations for emergency coverage. Romisa Shah particularly emphasized taking precautionary measures and assessing risks when covering protests and civil unrest.\nDuring concluding ceremony of workshop, Secretary General National Press Club, Nayyer Ali informed the workshop participants about the measures being taken to promote the role female journalists in National Press Club to represent women in journalism.\nShe urged the female colleagues to actively participate in the journalists unions to address their issues.\nNayyer Ali also lauded the IFJ for holding such kind of workshops to create awareness among journalists about gender equity and their rights of expression.\nAt the end of the workshop, participants expressed hope that such training would not only improve journalists’ professional capabilities but also ensure their safety. In her closing speech, Romisa Shah stated that IFJ would continue its efforts to protect journalists’ rights and safety, and is committed to organizing similar training programs in other provinces.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:31:11.883Z"
}
