{
  "title": "Pakistan addresses 26 out of 27 action items of FATF: NA informed",
  "link": "https://www.app.com.pk/national/pakistan-addresses-26-out-of-27-action-items-of-fatf-na-informed/",
  "date_published": "2021-08-02T17:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan on Monday informed National Assembly that Pakistan would soon come out of the Financial Action Task Force (FATF) grey list as it had largely addressed 26 out of 27 action items of FATF.\nReplying to a question during question hour, he said that Pakistan had undertaken enormous work to strengthen its anti-money laundering and combating financing of terrorism regime and addressed the strategic counter-terrorist financing related deficiencies.\nHe said that all the ten action items pertaining to the financial sector and border controls had been addressed.\nThe minister said that action items related to United Nation designated persons had been partially addressed and Pakistan was dealing this matter as per its own laws.\nReplying to another question, he said that Foreign Exchange reserve rose from sixteen to twenty-five billion dollars in last three years.\nHe said that the following steps had been taken by the government to increase foreign exchange reserves; adaptation of a market determined exchange rate regime and a prudent monetary policy stance, efforts to increase export of goods and services, adding that successful launch of international Eurobonds US $ 3.5 billion, during the period April to July, 2021 and introduction of Roshan Digital Accounts and Naya Pakistan Certificate, besides inflows from bilateral and multinational development partners.\nHe said that with the betterment of economy, the taxes would also be reduced by expanding taxation network.\nHe criticized previous government of Pakistan Muslim League (PML-N), adding that PML-N government had left the country’s economic in crisis.\nReplying to another question, he said that minimum support price of wheat had been increased to Rs 1,800 per 40 kg from Rs 1,400 per 40 kg.\nHe said that agriculture credit disbursement increased by 10.3 per cent to\nRs 1191.6 billion in July-May, fiscal year 2021 (Rs 1080.0 billion last year).\nThe minister said that under the Income Tax Ordinance, 2001 tax collected on Telecom Service could be adjusted on filling of return by the taxpayer. He said that even if the income was below taxable limit (BTL), this amount could be refunded to the taxpayers, on filing of return.\nResponding to a question, Minister for National Food Security and Research Syed Fakhar Imam rejected the reports that the government was going to impose a ban on export of rice.\nHe said the government imported wheat to build strategic reserve to avert any shortage.\nResponding to a question, Parliamentary Secretary on Commerce, Industries & production, BOI Aliya Hamza Malik said that the present government had imported raw materials and machinery for boosting industries. She said that the initiative would further boost exports of the country.\nLater, MNA Ramesh Lal pointed out the quorum.\nNA Speaker Asad Qaiser asked for the counting and the required strength was not available after which the proceedings were adjourned till Tuesday at 4 p.m.",
  "retrievedAt": "2025-08-11T21:01:44.224Z"
}
