{
  "title": "Foreign students treasure internship at NUST; depart with memories for a lifetime",
  "link": "https://www.app.com.pk/national/foreign-students-treasure-internship-at-nust-depart-with-memories-for-a-lifetime/",
  "date_published": "2021-08-02T09:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): NUST’s signature Internship Programme for International Students (NIPIS ’21) concluded at the university’s main campus here, drawing upon the aim to promote global diversity, mutual growth through cultural exchange and opportunities for all.\nThe program promises to deliver a sublime internship experience that not only advances the professional skills of participants from around the world but also reinforces their academic competence through its practical applications, and simultaneously gives them insights into the rich cultural heritage and natural beauty of Pakistan.\nAs many as 33 foreign interns – 28 as part of NIPIS, while 5 others from the Association for the International Exchange of Students in Economics and Commerce (AIESEC) – partook in the program that entailed a 360° learning experience.\nHowever, due to the current pandemic and travel restrictions thereof, a total of 14 interns could manage to physically attend the internship on campus, while the rest benefitted from the program through virtual means.\nThe countries these interns represented included Afghanistan, Egypt, Canada, Nigeria, Sri Lanka, Sudan, Turkey, the United Kingdom and the United States of America.\nThe internship comprised academic and recreational activities (including visits to tourist attractions and historical landmarks), arranged by NUST Placement Office in collaboration with AIESEC and all constituent schools.\nNot only did the internship inspire the interns towards pursuing higher education at the university, but it also positively influenced their perception of Pakistan, which they dearly expressed in their remarks.\nBusena from Turkey said, “I saw an online video called NUST – Aik Kahani and since then I was dying to come to NUST. I was very appealed by that video.  Every time I see these buildings as I walk, I feel the same way. I am glad that I am here.”\nRizki Haleemdeen from Sri Lanka remarked, “I really like the people over here at NUST and the standards that the university maintains for a good student environment. They also give the needed priority to international students.”\nDanjuma Ahmed Haruna from Nigeria said, “Firstly when I told my friends that I was going to NUST in Pakistan, they were not very thrilled. However, now when I post photos from here on my social media they get very surprised and they keep on texting me as if it was really the Pakistan they had been hearing about.”\nDuring their stay at NUST, they not only gained exposure to the Pakistani culture, but also to other cultures brought in by interns from different countries. They built strong bonds with each other and made memories that they would cherish their entire lives.\nSpeaking at the closing ceremony, Pro-Rector (RIC) AVM Dr Rizwan Riaz said that the foreign interns are part of NUST family, hoping they would act as ambassadors of Pakistan and NUST to wherever they go.\nHe put an accent on warmly greeting them again at NUST, and encouraged them to pursue postgraduate studies at NUST.\nBeing a premier national university with global standing, NUST has been spearheading higher education and Research and Development (R&D) in the country and is a tenacious proponent of inclusive growth and internationalisation.",
  "retrievedAt": "2025-08-11T21:01:52.683Z"
}
