{
  "title": "Preparations starts to mark Independence Day",
  "link": "https://www.app.com.pk/national/preparations-starts-to-mark-independence-day/",
  "date_published": "2021-08-02T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): With the advent of the month of August, preparations for upcoming Independence Day, falling on August 14, have started in the federal capital with setting up of stalls carrying variety of Jashan-i-Azadi accessories at the main avenues, markets and streets of the city.\nThe stalls carrying national flags, bunting, flag-coloured dresses and other decorative items at various places in the city are attracting youngsters and children who buy flags and buntings to adorn their homes and bicycles besides wearing pin badges and dresses.\nAll the stalls are carrying green coloured face masks associated with the celebrations of Independence Day to prevent the citizens from COVID-19.\nA number of patriotic youngsters especially children have started rushing to these stalls daily for buying flags, bunting, badges and Jashan-i-Azadi (Independence Day) dresses to finalize their preparations while the flag coloured toys are source of attraction for the small children.\nAsim Khan, a government employee living at G-9 sector said, “The stalls carrying green and white coloured Jashan-i-Azadi accessories set up at different corners have not only added a charm to the beauty of the capital but giving a message of patriotism to the citizens”.\n“My children were eagerly waiting for these stalls to buy flags, buntings, shirts and badges”, he said while talking to APP on Monday.\nHumaira Naz, a working woman said, “We should not only make our children buy flags, bunting and other accessories to celebrate this day but tell them about the historical struggle of our national heroes behind the creation of Pakistan and what we can contribute to make our country a better place”.\nShe said, “My children always get dressed in white and green colour and decorate our home with a lot of buntings”.\nUmer Nawaz, a roadside stall holder said, “The occasion of Independence Day gives us an opportunity to earn a handsome amount through selling flag-coloured items. Most of our customers are youth and children who buy these things to decorate their vehicles and homes.”\nThis year too, vendors like me are expecting good sales as youth looks more enthusiastic to prepare for Independence Day celebrations and then posting selfies on social media, he said.\nEvery year on Independence Day, youth and children show more excitement toward celebrating this important occasion and their motivation comes through the variety of stalls displaying unique items to attract them.\n“I bought buntings and flags to decorate my home and car as well as shirt, pin badge, glasses and mask to wear on the Independence Day while my little brother has just bought a toy”, Sajid a nine years old boy said.\n“I have not shown my stuff to my friends so that I can have a unique look on the day which no one can imitate”, he said.",
  "retrievedAt": "2025-08-11T21:01:49.920Z"
}
