{
  "title": "‘Single National Curriculum’s an epoch-making step’: Governor Sarwar",
  "link": "https://www.app.com.pk/national/single-national-curriculums-an-epoch-making-step-governor-sarwar/",
  "date_published": "2021-08-02T17:27:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 02 (APP): Governor Punjab Chaudhry Mohammad Sarwar has said that implementation of Single National Curriculum (SNC) in Punjab is an epoch-making initiative of the Pakistan Tehreek-e-Insaf (PTI) government which will pave the way to social cohesion and national integration.\nDuring a meeting with Minister of State for Parliamentary Affairs Ali Muhammad Khan at the Governor’s House here on Monday, he said the SNC will bring about parity in society as children will have equal opportunity to receive high quality education with the same curriculum, medium of instruction and system of assessment.\nEarlier, Minister of State for Parliamentary Affairs Ali Muhammad Khan called on Governor Punjab Chaudhry Mohammad Sarwar.\nThe Governor Punjab said the political opponents will not succeed in their machinations to reverse the development and stability achieved in recent years, adding that all national institutions are on the same page for prosperity and stability of the country.\nHe said the government, under the leadership of Prime Minister Imran Khan, is pursuing national aspirations and in a first in country’s political history, the PTI government is working to strengthen the institutions instead of running them by the remote control. He said the institutions are independent and strong today.\n“We are pursuing a policy of non-interference in the affairs of the institutions, and it has resulted in speedy resolution of people’s problems”, he said.\nSarwar said there are dozens of different narratives within the opposition alliance and the government is not intimidated by the opposition. He said the PTI-led government did not believe in politics of revenge but it believed in the rule of law, adding that no compromise will be made on it.\nHe said the government, under the leadership of Prime Minister Imran Khan, is fulfilling national aspirations and historic steps are being taken for the people in every field including health education, adding that uniform education system in government and private primary schools in Punjab is a historic step.\nGovernor Punjab Chaudhry Mohammad Sarwar said those who do not follow coronavirus SOPs are not only enemies of their lives but the lives of others, adding that every Pakistani should get the coronavirus jab.\nMinister of State Ali Muhammad Khan, speaking on the occasion, said the opposition has no political agenda and vision, adding that the people back the government and its policies and victory of PTI in Azad Jammu and Kashmir (AJK) elections is a sign of trust that people have reposed in the government policies.\nVis a vis current international scenario, he said Pakistan is playing its positive role for viable peace in the region.",
  "retrievedAt": "2025-08-11T21:01:44.174Z"
}
