{
  "title": "COVID-19 national tally reports highest active cases, positivity ratio since May",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-reports-highest-active-cases-positivity-ratio-since-may/",
  "date_published": "2021-08-02T08:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): The national tally of total active COVID-19 cases was recorded as 73,213 on Monday with 4,858 more people tested positive for the deadly virus and 1,361 people recovered from the disease during the last 24 hours.\nForty (40) corona patients have died during past 24 hours, 38 of whom were under treatment in the hospitals and two of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Punjab. Out of the total 40 deaths occurred, 19 of them died were under treatment on ventilators.\nThere were 3,441 Covid infected patients under treatment in critical condition with 233 of them admitted during past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 8.61 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 33%, Lahore 21%, Peshawar 26% and Skardu 25%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 33%, Karachi 57%, Abbottabad 55% and Peshawar 29%.\nAround 318 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan.\nSome 56,414 tests were conducted across the country on Sunday, including 18,618 in Sindh, 20,049 in Punjab, 10,338 in Khyber Pakhtunkhwa (KP), 3,076 in Islamabad Capital Territory (ICT), 2,083 in Balochistan, 945 in GB, and 1,305 in AJK.\nAround 943,020 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,039,695 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 24,891, Balochistan 30,502, GB 8,212, ICT 88,093, KP 144,848, Punjab 357,735 and Sindh 385,414.\nAbout 23,462 deaths were recorded in country since the eruption of the contagion. Around 6,021 people perished in Sindh, 19 of them died in the hospitals and one out of the hospital on Sunday.\n11,067 people died in Punjab died with eight deaths occurred in past 24 hours. Seven individuals died in the hospitals and one out of the hospital.\nAs many as 4,468 people expired in KP, six of them died in hospitals on Sunday, 803 individuals died in ICT, 328 people died in Balochistan, 147 infected people perished in GB, three of them died in the hospitals in past 24 hours and 628 people in AJK died, three of them succumbed to the deadly virus in the hospitals on Sunday.\nA total of 16,108,532 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 3,889 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:01:53.769Z"
}
