{
  "title": "Govt decides to reimpose anti-COVID restrictions in selected cities",
  "link": "https://www.app.com.pk/national/govt-reimposes-certain-restrictions-in-selected-cities/",
  "date_published": "2021-08-02T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP):The Federal Government on Monday decided to reimpose certain restrictions in selected cities from from August 3 to 31 in the wake of rising number of COVID case in the country.\nPrime Minister Imran Khan today approved the recommendations/decisions of National Command and Operation Center (NCOC) of the previous day for reimposing specific restrictions, including smart lockdown in Islamabad; Rawalpindi, Lahore, Multan, and Faisalabad in Punjab, Peshawar and Abbottabad in Khyber Pakhtunkhwa, Karachi and Hyderabad in Sindh, Muzaffarabad and Mirpur in Azad Jammu and Kashmir, and Gilgit and Skardu in Gilgit Baltistan.\nAfter meeting with the prime minister, Minister for Planning, Development and Special Initiatives Asad Umar, flanked by Special Assistant to Prime Minister on National Health Services Dr Faisal Sultan, told a press conference that the Sindh Government had already imposed smart lockdown in Karachi and Hyderabad till August 8.\nHe said the markets in selected cities would now close at 8pm instead of 10 pm daily and observe two-day off in a week. “The respective provinces will decide about the weekly off days,” he added.\nAsad Umar regretted that the government had allowed indoor dining for the vaccinated people, but its poor compliance was observed by the restaurants. Moreover, it was also not possible for the administration to check each and every restaurant in that regard, so no indoor dining would be allowed from now onward.\nThe government also decided to allow outdoor dining only till 10 pm, while the takeaway service would remain open till midnight (12 am), he added.\nThe minister said 50% staff attendance would be allowed in all the public and private offices while the remaining 50% would work from home.\nAsad Umar said since the very beginning of the outbreak of pandemic, the prime minister had opposed imposing a complete lockdown.\nUnder his directions, the government had devised the policy of smart lockdown, which remained successful during the first three waves of COVID and the same was now being adopted in the fourth wave as well.\nHe said a significant segment of the population comprised daily wagers, who could not afford a complete lockdown. “Therefore in order to ensure their livelihoods and to save their lives, the government had opted for a balanced and targeted lockdown strategy,” he added.\nHe said the number of COVID patients were rising especially in the big cities, with number of hospitalizations also increasing.\nThe minister also called upon the people to get vaccinated as early as possible to keep themselves safe from the Delta variant of the virus.\nHe said as per data the people, who had got first dose of the COVID vaccine were three times safer than those who were not inoculated yet while those having both doses were three times safer than the ones getting the first jab.",
  "retrievedAt": "2025-08-11T21:01:48.427Z"
}
