{
  "title": "Sanjrani for enhanced parliamentary relations with Muslim countries",
  "link": "https://www.app.com.pk/national/sanjrani-for-enhanced-parliamentary-relations-with-muslim-countries/",
  "date_published": "2021-08-02T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 2 (APP): Senate Chairman Sadiq Sanjrani Monday underlined the need for enhanced parliamentary relations with Muslim countries, especially the Arab countries and stepping up inter-parliamentary coordination to understand the issues and find solutions to the problems.\nTalking to Arab’s high echelon delegation, headed by President of the Arab Parliament, Adel Bin Abdul Rahman Al-Asoomi, Sanjrani said the Arab Parliament; being a common platform of the Arab countries, is significant for Pakistan. The overall role of the Arab Parliament is highly praiseworthy, and that Pakistan is willing to join Arab Parliament as an observer, he added.\nHe said training programmes can also be arranged related to legislation for the Arab Parliamentarians.\nBoth the dignitaries exchanged views on issues pertaining to Kashmir and Palestine. The Senate chairman reaffirmed Pakistan’s never-ending support for the legitimate rights of Palestinians.\n“As per international laws, Pakistan stands for a free and an independent Palestinian state. Pakistan stands with the oppressed Palestinians in their just struggle for freedom and will never recognise Israel under any circumstances”, Sanjrani maintained.\n“Innocent Kashmiris are also looking at the Muslim Ummah. The issue of Palestine and Kashmir has created an aura of unrest and anger in the Islamic world and Arab countries. For enduring peace and security in the region, the Kashmir issue needs to be unravelled in accordance with the UN resolutions”, he stressed.\nDuring the meeting, important issues inter alia, including parliamentary diplomacy, bilateral cooperation, institutional linkages, came under discussion.\nPakistan attaches great importance to its bilateral cooperation and relations with Arab countries, he reiterated.\nHailing the role of the Arab League legislative body, Sanjrani maintained that Arab Parliament provides opportunities to enhance cooperation with Arab countries.  Parliamentary coordination will pave the way for future collaboration, he noticed.\nPointing out the economic potential, he said there is ample scope for coordination in trade, human resources and investment. In the age of globalisation, the importance of bilateral and multilateral cooperation has increased further, he added.\n“For the protection of the rights and unity of Muslim Ummah, Pakistan highly regards its relationship with the Arab countries. This visit of a high profile delegation from the Arab Parliament will take relations to new heights”, the Senate chairman underscored.\nThe president of the Arab World expressed his great pleasure in visiting Pakistan and declared Pakistan an important country for the Arab world. “We highly regard cooperation with Pakistan”, said Al-Asoomi.\n“Economic development and social prosperity are a joint commitment of ours, and we will move forward with great zeal and fervour,” the visiting dignitary noted.\nAdel Bin Abdul Rahman observed that the visit would help pave the way for parliamentary cooperation, institutional liaison and multilateral cooperation.\nHe also extended an invitation to Senate Chairman Muhammad Sadiq Sanjrani to attend and address the session of the Arab Parliament.\nThis is the first time that a non-Arab parliamentary leader has been invited to address the Arab Parliament, he pointed out.\nSanjrani said visiting the Arab leagues’ legislative body is an honour and great privilege. Soon, along with the Parliamentary delegation, he will visit the Arab Parliament, he affirmed.\nThe high profile delegation from the Arab Parliament also visited the Senate Museum and signed a memorandum of understanding.\nLater, the president of the Arab Parliament, Adel bin Abdul Rahman Al-Asoomi, recorded his remarks in the visitor’s book.\nThe high-profile delegation is visiting Pakistan at the invitation of the Senate chairman. The delegation will also have meetings with top officials during its five-day stay.",
  "retrievedAt": "2025-08-11T21:01:46.499Z"
}
