{
  "title": "AIOU allocates Rs.125mln for merit scholarships, research grants",
  "link": "https://www.app.com.pk/national/aiou-allocates-rs-125mln-for-merit-scholarships-research-grants/",
  "date_published": "2024-03-18T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Allama Iqbal Open University (AIOU) has allocated a significant amount of 125 million for financial assistance and scholarship programs.\nThese programs are designed to help deserving, needy and bright students, said Vice Chancellor, AIOU, Prof. Dr. Nasir Mahmood\nHe was addressing at the prize distribution ceremony held in honor of the students who won Final Year Project Grants and Merit Scholarships in semester Autumn 2023.\nSpeaking on the occasion he said that last year, a total of 36,640 students benefited from these opportunities,\nAIOU provides free matriculation education to the people of Balochistan, merged districts (Ex FATA), and Gilgit-Baltistan, he added.\nIn addition, VC said the university offers merit scholarships to bright students who secure more than 80% marks in each semester, and their fee is refunded.\nIt is pertinent to mention here that a total of 129 students from various departments have been awarded merit scholarships for achieving more than 80% marks in the autumn 2023 semester.\nAdditionally, 13 students from three departments have been granted final-year project grants. It’s essential to note that as per university policy, students who secure 80% marks must apply within the given time to receive scholarships; otherwise, the university will not be responsible.\nThe successful students were presented with cheques by the Vice Chancellor. Dr. Nasir Mahmood emphasized that hard work is a key factor in achieving success in life.\nThe purpose of the merit scholarships is to encourage talented students to complete their education. This celebration will motivate other students, and there are vast opportunities available for them in the world.\nDr. Nasir also pointed out that Allah has blessed everyone with the same abilities, and the only difference between the successful and unsuccessful is the amount of hard work put in.\nThis event was organized by the Directorate of Students Advisory and Counseling Services. Dean, Faculty of Sciences, Prof. Dr. Hajra Ahmed, Prof. Dr. Irshad Ahmed Arshad, Director, Student Affairs, Syed Ghulam Kazim Ali also addressed the ceremony and congratulated the awardees.",
  "retrievedAt": "2025-08-11T01:23:51.218Z"
}
