{
  "title": "Education Ministry partners with Muslim Hands to improve basic health, education facilities for students",
  "link": "https://www.app.com.pk/national/education-ministry-partners-with-muslim-hands-to-improve-basic-health-education-facilities-for-students/",
  "date_published": "2024-03-18T11:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 18 (APP): The Ministry of Federal Education and Professional Training has partnered with Muslim Hands Pakistan to improve the health and well-being of school children and staff by enhancing access to clean drinking water, sanitation, and basic education facilities.\nIn this connection, the Directorate General of Basic Education Community Schools (BECS) and the Project Planning and Development Unit (PPDU) under the Ministry of Federal Education and Professional Training and Muslim Hands Pakistan, signed a Letter of Understanding (LoU) on Monday.\nDirector General of BECS, Hameed Khan Niazi, and Executive Director of Muslim Hands, Syed Javed Gillani, signed the agreement on behalf of their respective organizations, said a news release issued here.\nAccording to the agreement, both parties will collaborate on initiatives and projects related to the School WASH Programme in Islamabad Capital Territory (ICT). This partnership will commence on March 20, 2024, and will remain in force for the next one year, unless terminated earlier by mutual agreement or due to specific circumstances as outlined herein. The Directorate General of BECS and PPDU will identify and provide a list of 25 schools in the federal capital in need of WASH interventions (out-of-school children). Furthermore, they will facilitate coordination with school administrations for the smooth execution of WASH projects.\nBECS and PPDU will support monitoring and evaluation activities to assess the impact of the interventions, besides assisting in organizing hygiene education sessions by providing access to students and staff.\nMuslim Hands will fund the WASH interventions in the identified 25 schools, including the procurement of materials and hiring of contractors as needed. Additionally, they will design and implement the WASH projects in close coordination with BECS and PPDU and provide technical expertise and training for the maintenance and sustainability of WASH facilities.\nMuslim Hands will also conduct hygiene education sessions for students and staff in collaboration with BECS and PPDU and facilitate the capacity building of school staff and management.\nOn the occasion, Director General of BECS, Hameed Khan Niazi, said that BECS is a unique model of one teacher, one school, and integrated teaching. He said that it costs the government Rs 18,000 per student in the formal education system compared to Rs 4,000 per student in the non-formal system run by BECS, adding that these community schools would emerge as the best model by providing basic facilities. He further said that there are around 12,000 children out of school in ICT, and BECS has the capacity to absorb around 7-8 thousand children. He said that child’s right to education and water and sanitation are human rights that cannot be taken away or compromised.\nHameed Khan Niazi, DG BECS said that the government is committed to ensuring basic necessities for all, especially students and staff in non-formal education institutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:23:46.073Z"
}
