{
  "title": "Pakistan carries out operation against terrorist sanctuaries of TTP",
  "link": "https://www.app.com.pk/national/pakistan-carries-out-operation-against-terrorist-sanctuaries-of-ttp/",
  "date_published": "2024-03-18T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Pakistan Monday carried out intelligence-based anti-terrorist operations in the border regions inside Afghanistan.\nIn a statement, the Foreign Office Spokesperson said the target of today’s operation was the terrorists belonging to Hafiz Gul Bahadur Group, which along with Tehrik-i-Taliban Pakistan (TTP), is responsible for multiple terrorist attacks inside Pakistan, resulting in deaths of hundreds of civilians and law enforcement officials. The latest attack took place on 16 March 2024 at a security post in Mir Ali in North Waziristan and claimed the lives of seven Pakistani soldiers.\nOver the past two years, she said Pakistan has repeatedly conveyed its serious concerns to the Interim Afghan Government over the presence of terror outfits including TTP inside Afghanistan. These terrorists pose a grave threat to Pakistan’s security and have consistently used Afghan territory to launch terror attacks inside Pakistani territory.\nPakistan accords prime importance to the sovereignty and territorial integrity of Afghanistan. It has, therefore, always prioritized dialogue and cooperation to confront the terrorist threat, she added.\nPakistan had repeatedly urged the Afghan authorities to take concrete and effective action to ensure that the Afghan soil is not used as a staging ground for terrorism against Pakistan. Pakistan has also called on them to deny safe havens to TTP and to hand over its leadership to Pakistan.\nThe Spokesperson said Pakistan has great respect for the people of Afghanistan. However, certain elements among those in power in Afghanistan are actively patronising TTP and using them as a proxy against Pakistan.\n“Such an approach against a brotherly country, which stood with the people of Afghanistan through thick and thin, manifests shortsightedness. It ignores the support extended by Pakistan to the people of Afghanistan over the last several decades.”\nShe said, “We urge these elements in power to rethink the policy of siding with Khwarij terrorists shedding the blood of innocent Pakistanis and to make a clear choice to stand with the people of Pakistan.”\n“Terrorist groups like TTP are a collective threat to regional peace and security. We fully realize the challenge Afghan authorities face in combating the threat posed by TTP. Pakistan would therefore continue to work towards finding joint solutions in countering terrorism and to prevent any terrorist organization from sabotaging bilateral relations with Afghanistan,” she added.",
  "retrievedAt": "2025-08-11T01:23:21.273Z"
}
