{
  "title": "PTDC, Pakistan Embassy in Syria organized virtual tourism forum",
  "link": "https://www.app.com.pk/national/ptdc-pakistan-embassy-in-syria-organized-virtual-tourism-forum/",
  "date_published": "2024-03-18T17:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP):The Pakistan Tourism Development Corporation (PTDC) in collaboration with Pakistan Embassy in Syria organized a ‘Virtual Tourism Forum’ between Pakistan and Syria to enhance bilateral tourism and foster B2B linkages between the two countries.\nThe esteemed gathering witnessed the participation of Minister of Tourism Syria Muhammad Radwan Rami, Ambassador of Pakistan to Syria Shahid Akhtar, Ambassador of Syria to Pakistan Dr Ramez, Director of planning of Syrian Ministry of Tourism Ahid al-Zaeem, Managing Director of PTDC Aftab Ur Rehman Rana and representatives of both sides including national tourism organizations, tour operators associations and tourism committees of Chamber of Commerce, said a press release issued here on Monday.\nEngaging discussions underscored the mutual commitment to fortify bilateral ties, with particular emphasis on hosting delegations of tourism professionals from both sides for fostering closer cooperation.\nDuring the event, the Syrian Minister for Tourism expressed keen interest in bolstering bilateral linkages, while the Managing Director of PTDC delivered a compelling presentation showcasing Pakistan’s diverse and captivating tourist destinations.\nThe ambassadors of both sides ensured their full support for the promotion of bilateral tourism between the two countries.\nIn a significant development, it was unanimously agreed to establish a joint working group comprising representatives from Pakistan and Syria, tasked with spearheading initiatives to promote tourism.\nThis collaborative effort marks a pivotal moment in the tourism landscape of both nations, promising exciting opportunities\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:22:57.581Z"
}
