{
  "title": "Commerce Minister engages with sugar mills, ethanol manufacturers to overcome challenges",
  "link": "https://www.app.com.pk/national/commerce-minister-engages-with-sugar-mills-ethanol-manufacturers-to-overcome-challenges/",
  "date_published": "2024-03-18T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP):Federal Minister for Commerce, Jam Kamal Khan here on Monday convened significant meetings with representatives from the Sugar Mills Association and Ethanol Manufacturer Association separately to address pressing concerns affecting their industries.\nThe meetings, held in the Ministry of Commerce, aimed to foster dialogue and find feasible solutions to the challenges faced by these sectors.\nThe associations appreciated the act of calling stakeholders before making any major decisions.\nDuring the discussions, Minister Jam Kamal assured the industrialists of his commitment to advocate for their interests and address their concerns to support the local industry while simultaneously enhancing export volume to increase foreign reserves.\nThe Sugar Mills Association voiced apprehensions regarding the anticipated increase in tariffs for Molasses exports. Members of the association highlighted the importance of encouraging Molasses exports to bolster foreign reserves.\nThey underscored the need for infrastructure improvements to enhance terminal capacity, facilitating greater access to international markets.\nConversely, representatives from the Ethanol Manufacturer Association emphasized the necessity of long-term policy measures to sustain the domestic ethanol industry.\nThey advocated against allowing excessive Molasses exports, citing the adverse impact on local production.\nThe Chairman of the Ethanol Association urged authorities to permit the importation of raw sugar to sustain sugar manufacturing.\nIn response to these concerns, Minister Jam Kamal reassured participants of the government’s commitment to prioritizing their issues. He pledged to expedite efforts to address these challenges, emphasizing the importance of bolstering industrial growth and augmenting foreign reserves.\nThe meetings concluded with a mutual understanding to work collaboratively towards overcoming obstacles and fostering a conducive environment for the sustainable growth of the sugar and ethanol industries.\nMinister Jam Kamal affirmed his continued support for the prosperity and development of these vital sectors, underscoring their significance in driving economic progress and enhancing national resilience.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:23:44.457Z"
}
