{
  "title": "APHC condemns ban on Hurriyat parties in IIOJK, urges UN to intervene for Kashmir resolution",
  "link": "https://www.app.com.pk/national/aphc-condemns-ban-on-hurriyat-parties-in-iiojk-urges-un-to-intervene-for-kashmir-resolution-2/",
  "date_published": "2024-03-18T10:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): The All Parties Hurriyat Conference (APHC) has called upon the United Nations to impress upon India to grant Kashmiris their inalienable right to self-determination recognized in the relevant resolutions of the World Body.\nAPHC spokesperson Advocate Abdul Rashid Minhas in a statement in Srinagar, condemning the ban on Hurriyat parties in occupied Jammu and Kashmir, termed it political terrorism by the BJP-led Indian government against freedom-loving organizations, said a press release.\nHe also denounced the termination of a government teacher Manzoor Ahmed Laway of Kulgam, saying these terminations are being done by invoking the draconian laws against the people of Kashmir. The authoritarian move was part of India’s settler colonialism policy to strangulate Kashmiris economically, he added.\nThe spokesperson said the vicious campaign, aimed at marginalizing the majority community in occupied Kashmir, has gained momentum since the BJP regime abrogated Article 370 and 35A on 5th August 2019 and since then scores of Kashmiris have been dismissed from their jobs while the apartheid regime has opened flood-gates of employment for non-state subjects.\nHe said the deliberate attempt to suspend Kashmiri government employees from their jobs is a dangerous game plan to minimize the role of Kashmiris in the civil administration. Terming it as a deep-rooted conspiracy against the Kashmiris, he said, “Settler-colonialism drive has been initiated under the garb of the newly introduced domicile law to replace the indigenous population with a new society of settlers.”\nThe people of occupied Kashmiri have been fighting for the right to self-determination for the past 76 years in the light of the United Nations resolutions and will continue their struggle till taking it to its logical conclusion at all costs.",
  "retrievedAt": "2025-08-11T01:23:48.855Z"
}
