{
  "article_id": "2025-06-22_10bf661867cd26758738c0abf141764b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pm-conveys-to-president-pezeshkian-pakistans-condemnation-of-us-attacks/",
    "retrieved_at": "2025-08-27T16:20:09.032Z"
  },
  "metadata": {
    "title": "PM conveys to President Pezeshkian Pakistan’s condemnation of US attacks",
    "author": null,
    "date_published": "2025-06-22T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 250,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, June 22 (APP): Prime Minister Muhammad Shehbaz Sharif Sunday held a telephone conversation with President of the Islamic Republic of Iran Masoud Pezeshkian and conveyed Pakistan's condemnation of the US attacks, which followed Israel's unprovoked and unjustified aggression over the past eight days. He reaffirmed Pakistan's unwavering solidarity with the brotherly people and Government of Iran, while expressing heartfelt condolences on the loss of precious lives and prayed for the swift recovery of the injured, PM Office Media Wing said in a press release. The prime minister expressed concerns that the US strikes had targeted facilities that were under the safeguards of the International Atomic Energy Agency (IAEA). These attacks constituted a serious violation of international law and the IAEA Statute, he added. While noting Iran's right to self-defense as enshrined under Article 51 of the UN Charter, the prime minister stressed upon the need to immediately return to dialogue and diplomacy as the only viable path forward. He also called for urgent collective efforts to de-escalate the situation. Prime Minister Shehbaz Sharif reiterated Pakistan's readiness to play a constructive role in this context. President Pezeshkian conveyed his deep appreciation for Pakistan's support to Iran. He thanked the prime minister, the government and people of Pakistan, including the military leadership, for standing in solidarity with the people and Government of Iran. The two leaders emphasized on the need and urgency of forging unity among the Ummah at this critical juncture. The two leaders agreed to remain in close contact.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}