{
  "title": "Education Minister discusses educational cooperation with British High Commissioner",
  "link": "https://www.app.com.pk/national/education-minister-discusses-educational-cooperation-with-british-high-commissioner/",
  "date_published": "2022-04-28T15:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): British High Commissioner Dr Christian Turner and British Council Country Director Amir Ramzan met Federal Minister for Education and Professional Training Rana Tanveer Hussain here at his office Thursday.\nBoth sides discussed in detail the ongoing educational cooperation between two countries, including the flagship higher education programme ‘Pak-UK Education Gateway’, FCDO’s technical assistance for formulation of National Curriculum and collaboration for teachers training.\nThey also discussed the British Council’s support in setting up connecting class rooms, bringing back 5,000 out of school children, establishing linkages of NAVTTC with the industry, TVET sector and apprenticeship programme.\nMinister Rana Tanveer Hussain, while commending the United Kingdom’s support for Pakistan, said Pakistanis felt very comfortable with Britishers and consider the UK as their second home. He reiterated his resolve to further strengthen the educational ties in all areas with the the UK.\nOn formal invitation of the British High Commissioner to Federal Education Minister for Joining the World Education Forum taking place in 2022 in the UK, Rana Tanveer said he would be happy to find the opportunity to showcase the Pakistan education system and its values at the world largest gathering of education and skill ministers.\nHigh Commissioner Turner stated that the UK wanted to work as closely as they could with Pakistan in all areas of education.\nBoth sides reiterated their firm resolve to enhance the educational partnership as stronger and deeper as possible. The meeting was marked with traditional warmth and mutual trust from both sides.",
  "retrievedAt": "2025-08-11T14:46:55.818Z"
}
