{
  "title": "Pakistan fully committed to implement Indus Water Treaty: FO",
  "link": "https://www.app.com.pk/national/pakistan-fully-committed-to-implement-indus-water-treaty-fo/",
  "date_published": "2023-07-06T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP):Pakistan remained fully committed to the implementation of Indus Water Treaty, including its dispute settlement mechanism, said Foreign Office spokesperson here on Thursday.\nWhile responding to media queries concerning the decision by the Court of Arbitration in the Hague on the question of its competence to hear Pakistan-India water disputes, the spokesperson said, “The Government of Pakistan is in receipt of the Award of the Court of Arbitration, addressing its competence and the way forward on the disputes between Pakistan and India concerning the Kishenganga and Ratle Hydroelectric Projects; and, wider questions of the interpretation and application of the Indus Waters Treaty.”\nThe court had upheld its competence and determined that it will now move forward to address the issues in dispute, she added.\nShe said, “The Indus Waters Treaty is a foundational agreement between Pakistan and India on water sharing. Pakistan remains fully committed to the Treaty’s implementation, including its dispute settlement mechanism. We hope that India will also implement the treaty in good faith.”\nPakistan has serious objections to India’s construction of the 330 MW Kishenganga Hydroelectric Project on River Jhelum and plans to construct the 850 MW Ratle Hydroelectric Project on River Chenab in the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nPakistan initiated the legal proceeding on 19 August 2016 with a request for establishment of the ad hoc Court of Arbitration pursuant to Article IX of the Indus Waters Treaty. Pakistan’s decision to initiate proceedings was in response to India’s persistent refusal to address Pakistan’s concerns which were repeatedly raised at the level of the Permanent Indus Commission since 2006 for Kishenganga project and 2012 for the Ratle project. Pakistan had also sought resolution of this issue in Government-to-Government talks held in New Delhi in July 2015.\nThe Indus Waters Treaty provides for two forums for settlement of disputes: the Court of Arbitration that addresses legal, technical and systemic issues, and the Neutral Expert that addresses only technical issues. Pakistan requested establishment of the Court of Arbitration because of systemic questions requiring legal interpretation.\nAfter Pakistan’s initiation of the formal dispute settlement process, India made a belated request for appointment of a Neutral Expert.\nFearing conflicting outcomes from two parallel processes, on 12 December 2016, the World Bank suspended the processes for establishment of the Court of Arbitration and appointment of the Neutral Expert. The Bank invited both countries to negotiate and agree on one forum. However, when Pakistan and India could not agree on a mutually acceptable forum for six years, the World Bank finally lifted the pause in dispute settlement process. It decided to initiate both processes in parallel and appointed the Court of Arbitration and the Neutral Expert in 2022. During this period, India completed the construction of Kishenganga project.\nPakistan is engaged with both processes at the Court of Arbitration and the Neutral Expert. However, India has boycotted the Court of Arbitration. It neither nominated two members of the Court from its side, nor attended the two preliminary hearings held on 27-28 January and 11-13 May 2023 at The Hague, The Netherlands.\nIn December 2022, India conveyed its objections to the World Bank, maintaining that empanelment of the Court of Arbitration was illegal. It challenged the primacy and competence of the Court. The Court, therefore, decided to first consider India’s objections relating to competence of the court to hear the case.\nThe Court of Arbitration, in a unanimous decision, declared today that it was competent to consider and decide on the disputes set forth in Pakistan’s Request for Arbitration.\nThe Court rejected the objections to its competence, made by India through correspondence to the World Bank.\nThe Court announced that, in the next phase, it will address certain questions concerning the overall interpretation and application of the Treaty’s provisions on hydro-electric project design and operation, as well as the legal effect of past decisions of dispute resolution bodies under the Treaty.\nIt observed that the issues before the Court of Arbitration were broader than those before the Neutral Expert.\nThe Court’s decision is binding on the Parties and without appeal.\nBefore start of the CoA proceedings, on 25 January 2023, India sent a notice to Pakistan, asking to notify a date, within 90 days, to start negotiations for review and modification of Indus Water Treaty. It is noteworthy that the duration of 90 days was arbitrarily fixed, without any express mention in the Treaty.\nNotwithstanding the serious implications of Indian moves, there is no provision in the Treaty that allows one side to unilaterally modify or abrogate the Treaty. The Treaty, however, can be replaced by a modified Treaty with mutual consent and ratification by both parties. Consultations are ongoing to chart out a way forward on the matter.",
  "retrievedAt": "2025-08-11T08:51:10.796Z"
}
