{
  "title": "High-time for nation, State institutions to unitedly act for country’s progress: PM",
  "link": "https://www.app.com.pk/national/high-time-for-nation-state-institutions-to-unitedly-act-for-countrys-progress-pm/",
  "date_published": "2023-07-06T07:01:00.000Z",
  "source": "APP",
  "content": "TORGHAR, Khyber Pakhtunkhwa, July 6 (APP): Prime Minister Shehbaz Sharif said on Thursday that it was high time for the nation and state institutions to join hands in making progress for the country.\nThe prime minister emphasized that it was the responsibility of the government, judiciary, armed forces, and the people to work together to ensure the development of the country.\nHe made these remarks while addressing local elders in Torghar after laying the foundation stone for the Torghar Bunir Highway, the Bunir-Karakar Link Tunnel, and the Torghar-Bunir RCC (Reinforced Cement Concrete) bridge.\nThe prime minister highlighted the significance of unity, hard work, and dedication by the nation to create a brighter future for Pakistan.\nHe mentioned that Pakistan recently faced financial challenges but managed to reach a staff-level agreement with the International Monetary Fund to prevent default. He acknowledged the supportive role of army chief General Asim Munir in securing the $3 billion deal with the global lender.\nThe prime minister expressed confidence that Pakistan would soon hold a significant position among nations.\nPM Sharif stated that the Khyber Pakhtunkhwa province was blessed with natural resources. However, he stressed the need to explore avenues of development for the benefit of the people.\nHe acknowledged the sacrifices of the locals’ forefathers, who donated their lands during the formation of Pakistan 70 years ago.\nPM Sharif expressed regret over the neglect of the area by past political leaders, who failed to integrate it into the journey of national development. He emphasized the importance of providing opportunities to the locals to help them prosper in education and professional fields.\nHe expressed concern that, without the bridge, the locals had to travel a distance of 250 kilometers. The construction of the bridge would reduce the distance to just one kilometer.\nHe directed the completion of the bridge within one year instead of the initially planned three years, stating that the three infrastructure projects, worth Rs 18 billion, would greatly benefit the locals.\nPM Sharif announced the establishment of a Danish school in the area, which is an educational facility project previously launched by him in Punjab for underprivileged children.\nHe also announced the establishment of two colleges in the area and stated that work would soon commence to ensure a stable supply of electricity.\nPakistan Muslim League leader retired Captain Muhammad Safdar mentioned that the underdeveloped area of Torghar, formerly known as Kala Dhaka, was in dire need of development and infrastructure.\nHe expressed that Prime Minister Shehbaz Sharif’s visit to Torghar was a positive sign for the people of the area, who are now destined to progress under his vision of development.\nPM’s Adviser Amir Muqam stated that the bridge would connect the Hazara and Malakand divisions, facilitating the locals.\nInformation Minister Marriyum Aurangzeb, Adviser Ahad Cheema, and local government officials were present at the event.",
  "retrievedAt": "2025-08-11T08:51:23.144Z"
}
