{
  "title": "Joint sitting of Parliament condemns desecration of Holy Quran in Sweden",
  "link": "https://www.app.com.pk/national/joint-sitting-of-parliament-condemns-desecration-of-holy-quran-in-sweden/",
  "date_published": "2023-07-06T13:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP): The joint sitting of the Parliament on Thursday strongly condemned the desecration of the Holy Quran in Sweden and called upon the international community to take serious action to prevent such incidents in the future.\nThey were addressing on a motion moved by Federal Minister for Human Rights, Riaz Hussain Pirzada on the situation arising out of the desecration of the Holy Quran in Sweden in the joint sitting of the Parliament, which was chaired by Speaker National Assembly Raja Pervez Ashraf.\nParliamentarians from the government and the opposition sides expressed deep distress over the incident, stating that Muslims worldwide have been profoundly hurt by this disgraceful act.\nThey emphasized that no civilized society should permit the provocation and disrespect of religious sentiments under the guise of freedom of expression. They urged the international community to address this tragic incident and take effective measures to prevent similar occurrences.\nLeader of the Opposition in the National Assembly Raja Riaz Ahmad strongly condemned the incident and said that the entire nation was united on this matter. He said that every forum should be used to raise the voice against this wrong act.\nHe said that although it was an individual act, but the government of the concerned country should take strict action against that person. He said that every Pakistani would participate in peaceful protests on Friday against the incident.\nHe praised the decision to convene an emergency meeting of the Organization of Islamic Cooperation (OIC) in response to the incident.\nOpposition Leader in Senate, Senator Dr Shahzad Waseem said that such act will increase the feeling of abhorrence among various communities of the world and urged to control such incidents. He added that the Muslims living in different parts of the world strongly condemned the incident.\nHe said that similar incidents already occurred in some countries and demanded to stop happening of such incidents. He said that playing with the sentiments of Muslims on the name of freedom of expression is absolutely deplorable.\nSyed Yousaf Raza Gillani said that holding of joint sitting of the Parliament was a good step to give a message to the world that the entire nation was united on this incident. He said that Muslims respect other religions in accordance with Islamic teachings and expect reciprocity from followers of other faiths for global peace. He stressed that promoting interfaith harmony among nations was essential for ensuring international peace.\nHe called upon the international community to take notice and strict action against those responsible. He said that our protests should be held peacefully following the teachings of Islam.\nFederal Minister for Communications Maulana Asad Mehmood strongly condemned the anti-Islam act considering it highly unjustifiable. He called for the perpetrator of this heinous crime to be brought to justice. He said that freedom of expression should not be used as a means to hurt religious sentiments.",
  "retrievedAt": "2025-08-11T08:51:16.007Z"
}
