{
  "title": "Religious scholars condemn burning of Holy Quran, announce ‘Quran Sanctity Day’ on Friday",
  "link": "https://www.app.com.pk/national/religious-scholars-condemn-burning-of-holy-quran-announce-quran-sanctity-day-on-friday/",
  "date_published": "2023-07-06T11:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 06 (APP): Prominent scholars, intellectuals, and leaders representing various schools of thought and religious denominations from across the country on Thursday strongly condemned the recent incident of burning the Holy Quran in Sweden.\nIn a joint statement, they expressed their outrage and announced that on upcoming Friday would be observed as ‘Quran Sanctity Day.’\nThey called for peaceful protests and condemnation of the incident in all mosques, emphasizing the need for swift action against the blasphemous act.\nThe Chairman of Pakistan Ulema Council and Prime Minister’s Special Representative on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mahmood Ashrafi, along with respected figures such as Maulana Ziaullah Shah Bukhari, Maulana Muhammad Khan Laghari, Allama Arif Wahidi, Allama Abdul Haq Mujahid, Maulana Muhammad Rafique Jami, Maulana Asad Zakaria Qasmi, Maulana Nauman Hashir, Maulana Muhammad Shafi Qasmi, Allama Zubair Abid, Maulana Asadullah Farooq, Maulana Muhammad Ashfaq Pitafi, Maulana Tahir Aqeel Awan, Maulana Aziz Akbar Qasmi, Maulana Muhammad Aslam Siddiqui, Maulana Abu Bakr Hamid Sabri, and others jointly issued a statement.\nThey declared that the burning of the Holy Quran in Sweden was an utterly unacceptable act under any circumstances.\nWhile acknowledging the timely response from the organization of Islamic Cooperation following the incident, the religious scholars emphasized the need for concrete actions to address this issue.\nIn this regard, the Pakistan Ulema Council has called for a crucial meeting in Islamabad on July 12, Wednesday, where an extensive action plan would be formulated.\nThe joint statement urged Muslims across the globe to unite against such incidents that hurt the sentiments of the entire Muslim Ummah.\nIt stressed the importance of protecting the sanctity of the Holy Quran and called for measures to ensure respect for all religious beliefs.\nThe scholars and leaders expressed their hope that the Swedish authorities would take immediate and appropriate action against the perpetrators to prevent any recurrence of such incidents in the future.\nThe upcoming meeting in Islamabad is expected to be attended by representatives from various religious organizations, scholars and intellectuals.\nIt aims to establish a comprehensive framework and guidelines for responding to such incidents, protecting the sanctity of religious texts, and promoting interfaith harmony.\nAs the nation prepares to observe ‘Quran Sanctity Day,’ Muslims in Pakistan and around the world stand united in their condemnation of the desecration of the Holy Quran.\nThe incident has sparked a renewed determination among scholars and leaders to safeguard the revered Islamic scripture and ensure that such acts of disrespect are never repeated.",
  "retrievedAt": "2025-08-11T08:51:18.626Z"
}
