{
  "title": "CPEC an inclusive platform for third parties to benefit from investment opportunities: FO",
  "link": "https://www.app.com.pk/national/cpec-an-inclusive-platform-for-third-parties-to-benefit-from-investment-opportunities-fo/",
  "date_published": "2023-07-06T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 6 (APP): Pakistan on Thursday reiterated that being an important node in cross regional connectivity, China Pakistan Economic Corridor (CPEC) was an inclusive and open platform for interested third parties to benefit from investment opportunities in its priority areas like industry, agriculture, IT, science and technology, and oil and gas sectors. The Foreign Office spokesperson Mumtaz Zahra Baloch, in her weekly press briefing, said that both Pakistan and China remained committed to continued expansion and development of CPEC to promote win-win connectivity, development and mutual prosperity.\n“We will continue to push forward all CPEC projects in a safe, smooth, and high-quality manner, promoting cooperation in areas such as economy and trade, investment, industry, agriculture, health, and science and technology,” she remarked.\nShe said Pakistan and China were celebrating the 10th anniversary of CPEC which was an important pillar of the all-weather strategic cooperative partnership with China. The spokesperson recounted that the people of Pakistan had witnessed the remarkable achievements and fruits of high-quality development stimulated by CPEC since its inauguration in 2013.\n“Under the first phase of CPEC, China invested around US$ 25.4 billion in Pakistan, primarily in energy and transport infrastructure sectors. CPEC projects have added: 8000 MWs of energy to the national grid; 510 km of highways; 932 km of road networks; and 820 km of Optical Fiber Line. It has also created about 200,000 jobs in Pakistan,” she highlighted. Coming to the situation in Indian Illegally Occupied Jammu and Kashmir, the spokesperson said the people were prevented from participating in the Eid festivities as the occupation authorities barred the Eid prayers at the historic Jamia Mosque and the Central Eidgah in Srinagar.\nThe head cleric of the Jamia Masjid and prominent Kashmiri leader, Mirwaiz Umar Farooq, remains under arbitrary house arrest since August 2019.\n“For over 200 Fridays, he has not been able to address the Friday congregations from the Jamia Masjid’s pulpit. We urge the Indian authorities to set Mirwaiz Umar Farooq free and bring an end to the restrictions imposed on Kashmiris that prevent them from freely practicing their religion.” She told the media that the seventh martyrdom anniversary of iconic Kashmiri youth leader Burhan Muzaffar Wani would be observed on July 8.\n“While paying homage to him as the voice of the indigenous freedom movement of the Kashmiri people, we once again urge the Government of India to bring an end to extra-judicial killings and desist from indiscriminate use of force against the Kashmiri people,” the spokesperson demanded. Highlighting the diplomatic activities took place during the previous week, the spokesperson Mumtaz Baloch mentioned Prime Minister Mohammad Shehbaz Sharif’s participation in virtual meeting of the SCO Council of Heads of State on July 4.\nIn his remarks, the prime minister reaffirmed Pakistan’s commitment to the ‘Shanghai spirit’ and presented Pakistan’s vision for connectivity and regional cooperation as a vehicle for peace and prosperity. He stressed the need for collective action against terrorism, extremism, and separatism.\nShe also apprised the media of Foreign Minister Bilawal Bhutto Zardari’s visit to Japan on July 1-4 where he held bilateral talks with Foreign Minister Yoshimasa Hayashi and called on Prime Minister Fumio Kishida.\nForeign Secretary Dr. Asad Majeed Khan is currently in Türkiye for an official visit. On Wednesday, he led the Pakistan delegation at the sixth round of the Pakistan-Türkiye Bilateral Political Consultations (BPC) in Ankara, the spokesperson added. During the visit, the two sides extensively discussed the entire range of bilateral cooperation covering political relations, trade, connectivity, defence, education, culture, and people-to-people contacts. Progress made under the Strategic Economic Framework (SEF) was also reviewed. Condemning the brutal Israeli raids and airstrikes in Jenin, resulting in multiple casualties, Mumtaz Baloch said the people of Pakistan were outraged on this deliberate targeting of civilians. Such egregious and repeated attacks on the Palestinian people must end.\nShe said as Pakistan celebrated the sanctity of the Holy Quran day on Friday, the country strongly condemned the despicable acts of public burning of the Holy Quran in Sweden and other countries in Europe.\n“We believe that such willful incitement to discrimination, hatred and violence cannot be justified under the guise of freedom of expression. The recurrence of such Islamophobic incidents calls into serious question the legal framework which permits such hate-driven actions,” she remarked. She said as a leading member of the OIC, Pakistan had called for an urgent debate on this important matter at the UN Human Rights Council.\nSpokesperson Mumtaz Baloch informed the media that Foreign Minister of the Swiss Confederation, Federal Councilor Ignazio Cassis, would arrive in Pakistan for an official visit from July 7-9, at the invitation of Prime Minister Shehbaz Sharif. The delegation comprises three members of the Swiss parliament and senior officials.\nFederal Councilor Cassis will call on the prime minister and meet with Minister for Climate Change, Sherry Rahman. He will visit the National Disaster Management Authority in Islamabad where the two sides will discuss bilateral cooperation in disaster management.",
  "retrievedAt": "2025-08-11T08:51:20.765Z"
}
