{
  "title": "Martyrdom of Burhan Wani sparked Kashmir freedom movement",
  "link": "https://www.app.com.pk/national/martyrdom-of-burhan-wani-sparked-kashmir-freedom-movement/",
  "date_published": "2023-07-06T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP):The martyrdom of Burhan Wani, a prominent Kashmiri activist, sent a blast wave throughout the region and brought the long-standing conflict in Indian Illegally Occupied Jammu and Kashmir to the forefront of international attention.\nWani was a true hero and his martyrdom on July 8, 2016, sparked widespread protests in IIOJK, leading to another wave of violence by Indian occupation forces in the region.\nAccording to an article published by Kashmir Media Service, Wani played a game-changing role in the struggle of IIOJK against India.\nBurhan Wani was born on July 7, 1994, in south Kashmir. Despite belonging to a relatively well-off family, he treaded the path of a civic activist at a young age after witnessing the frequent attacks of Indian army on innocent Kashmiris.\nAt the age of 15, he started to raise his voice against the oppressive Indian forces. Soon he was known as a brave Kashmiri activist, gaining recognition for his mesmerizing personality and passionate speeches. Social media platforms became his means of spreading his message of opposition to Indian occupation and motivating others to join the cause. His ability to connect with IIOJK youth, who recognized him as a symbol of resistance against Indian oppression, made him a prominent figure within the freedom movement. He used social media platforms to spread his message and recruit more individuals to join the cause.\nOn July 8, 2016, a joint operation by the Indian occupation forces, including the army, police, and paramilitary, tracked down and martyred Burhan Wani in Kokernag area of south Kashmir’s Islamabad district.\nThe news of his death spread rapidly, and thousands of people gathered for his funeral, despite strict curfews imposed by the authorities. The funeral procession turned into a massive protest, with mourners shouting slogans against the Indian government and demanding freedom.\nBurhan’s death witnessed a significant escalation of violence in the region with many people killed and injured by Indian forces. As a result of the curfew in the valley, the internet was shut down and many other restrictions were also imposed and the protest continued for many months. Moreover, the violence by Indian forces continued for months, resulting in a sense of insecurity and fear among the masses.\nThe death of Burhan Wani was seen as a significant loss for the IIOJK freedom movement and a cause of concern about the human rights situation in the territory. Burhan Wani was a martyr and a symbol of struggle against Indian occupation. His death was a result of Indian coercion and excessive use of force against IIOJK civilians. Government of Pakistan condemned Burhan Wani’s killing and expressed solidarity with the people of IIOJK.\nHis martyrdom at the hands of Indian army highlighted the broader issue of human rights violations in Kashmir and the need for international attention and intervention.\nPakistan persistently raised the IIOJK matter with prominent UN officials and submitted letters to the UN Secretary General and the President of the United Nations Security Council, expressing deep concerns regarding the violation of human rights in IIOJK following the tragic death of Burhan.\nPakistan’s government consistently raised the Kashmir dispute at the international forums, arguing that the world community should intervene to ensure that the rights of the IIOJK people were protected.\nPakistan called for an end to the use of force against civilians, the withdrawal of Indian occupation forces, and a plebiscite in accordance with the UN resolutions in IIOJK.\nThe death of Wani marked a turning point in the Kashmir freedom movement, with the emergence of a new wave of struggle and widespread youth participation in highlighting the Kashmir issue specifically by using social media. The fallout from his death continued to shape the ongoing struggle for the right to self-determination in IIOJK.\nIn conclusion, the death of Burhan Wani was a significant event that gave impetus to the struggle against the brutal Indian forces. His sacrifice served as a constant reminder of the ongoing battle for freedom and justice in IIOJK, motivating people to continue fight for their rights.\nThe legacy of Wani lived on as he was a symbol of courage, resilience, and the unyielding spirit of the activism of IIOJK.",
  "retrievedAt": "2025-08-11T08:51:12.103Z"
}
