{
  "title": "Pakistani premier extends support to Myanmar following devastating earthquake",
  "author": null,
  "content": "LAHORE, Mar 31 (APP):Prime Minister Muhammad Shehbaz Sharif extended heartfelt condolences to Myanmar’s leadership and people following the devastating earthquake that struck the country on March 28, causing significant loss of life and property.\nIn a telephone conversation with Senior General Min Aung Hlaing, Chairman of the State Administration Council and Prime Minister of Myanmar, Prime Minister Shehbaz Sharif conveyed the deep sympathies of the Pakistani government and its citizens over the tragedy.\nHe assured his Myanmar counterpart that Pakistan stands in solidarity with the affected communities and is ready to assist to alleviate their suffering. The Prime Minister also announced that, on his directives, Pakistan’s National Disaster Management Authority (NDMA) would dispatch approximately 70 tons of relief goods to Myanmar. These supplies, aimed at supporting the earthquake victims, were set to arrive in two sorties within the next 48 hours.\nExpressing confidence in the resilience of Myanmar’s people, Prime Minister Shehbaz Sharif expressed hope that they would soon recover from the disaster. He reiterated Pakistan’s commitment to humanitarian support and disaster relief efforts whenever needed.\nIn response, Prime Minister Min Aung Hlaing expressed gratitude to the Pakistani government and people for their timely assistance and solidarity during this challenging period. He acknowledged the humanitarian aid as a meaningful gesture of friendship and support in Myanmar’s time of need.\nThe devastating earthquake on March 28 has left a profound impact on Myanmar, with rescue and relief operations underway as authorities work to provide aid to those affected.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:09:00.713Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistani-premier-extends-support-to-myanmar-following-devastating-earthquake/",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T12:28:00.000Z"
}
