{
  "title": "NASFF winner wants to win Oscar by producing Indie films",
  "link": "https://www.app.com.pk/national/nasff-winner-wants-to-win-oscar-by-producing-indie-films/",
  "date_published": "2022-05-31T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP):Rohullah Kashfi, the first film producer of erstwhile FATA, who won National Amateur Short Film Festival-21 (NASFF) contest, has expressed his desire to win Oscar (Academy Award) by producing Indie (low budget) films.\nTalking to APP, Kashfi, who graduated from National College of Arts (NCA), said he wanted to make commercial movies for earning money and survival. Hailing from Parachinar, Kurram district of Khyber Pakhtunkhwa, Kashfi’s nearly six minutes long documentary “Taana Bana” won the NASFF-21 award in professional category.\nThe documentary themed “empowerment through SMEs” was meant to showcase such small and medium sized enterprises (SMEs) in Pakistan that involved unique and awe- inspiring skills and techniques but was in danger of dying out.\nHis documentary was primarily based on traditional wicker work in contemporary furniture design.\nHe said it was quite ironic that such awesome skills and splendid ancestral art works were not being transferred to next generation.\nThere were many reasons to this dying art phenomenon, which needed immediate attention of government departments, mandated to safeguard the traditional artworks of Pakistan.\nHe said NASFF has been conceived to tap the talent and creativity of out Pakistani youth, who choose film and Television production as their academic/professional careers.\nNASFF was meant to proffer a chance to such able and enormously talented youth to produce high quality short films projecting the real image of Pakistan. It is a first of its kind national festival, which will focus on creative students to re imagine Pakistan and endeavor to align prevailing negative perceptions with reality.\nMinistry of Information and Broadcasting in collaboration with Inter Services Public Relations (ISPR) had sought online registration for the National Amateur Short Film Festival (NASFF). The winner were being sent New York Film Academy Australia for year-long courses in film making and screenwriting.",
  "retrievedAt": "2025-08-11T14:59:58.914Z"
}
