{
  "title": "Nepal keen to enhance cooperation in tourism, mountain adventure: Envoy",
  "link": "https://www.app.com.pk/national/nepal-keen-to-enhance-cooperation-in-tourism-mountain-adventure-envoy/",
  "date_published": "2022-05-31T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP):Ambassador of Nepal to Pakistan,Tapas Adhikari on Tuesday said that there are vast opportunities between Pakistan and Nepal in various fields of tourism including mountain adventure which should be tapped on priority. Pakistan and Nepal have the highest mountain peaks in the world, including Mount Everest and K2, where mountaineers, who come every year and get international fame by demonstrating their skills in this sport, he said.\nEmbassy of Nepal in Islamabad organized a programme here on Tuesday to commemorate the first ascent to the Mt. Everest by Tenzing Norgay Sherpa and Edmund Hillary on 29 May 1953.  Tapas Adhikari, Ambassador of Nepal to Pakistan, welcomed the guests to the programme and congratulated Abdul Joshi on his recent ascent to the Mt. Everest on May 16, 2022. On the occasion, the Ambassador said that there are vast opportunities between Pakistan and Nepal in this field, which would require further cooperation between the two countries in the future.\nAmbassador said that Pakistan and Nepal are the countries connected to the Himalayan region, where there are many opportunities for tourism and other adventures. He said that 2 million tourists visit Nepal every year, where the government is committed to provide all kinds of facilities to them. Ambassador said that direct air flight was essential for economic, trade and other cooperation between the two countries.\nHe said that both the countries have beautiful views of nature and tourist destinations, so a direct air link is essential for the promotion of tourism in both the countries. He said that transportation and logistics was an essential sector in both the countries for the movement and promotion of international mountaineering adventurers on both sides. In response to a question, he said that many issues of transit trade in Nepal and Pakistan still need to be resolved for the promotion of bilateral trade.\nOn the occasion, Ambassador Adhikari expressed his confidence that his expedition will inspire many young Pakistanis for mountaineering and adventure tourism and increase people-to-people contacts between Nepal and Pakistan. He also highlighted the impacts of climate change on the mountains and urged for collectively addressing the negative consequences.\nDuring the programme, Mountaineer Joshi shared his interesting expedition experience, while scaling the summit. He also drew many parallels between Nepal and Pakistan, particularly in the field of trekking and tourism. The programme was attended by alpinists and media persons from Pakistan and  Embassy officials.",
  "retrievedAt": "2025-08-11T15:00:04.108Z"
}
