{
  "title": "CM Punjab launches phase-II of Honahar Scholarship Program",
  "link": "https://www.app.com.pk/national/cm-punjab-launches-phase-ii-of-honahar-scholarship-program/",
  "date_published": "2024-12-23T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):Chief Minister Punjab Maryam Nawaz Sharif on Monday inaugurated Phase-II of Pakistan’s largest educational initiative, the “Honahar Scholarship Program”, covering expenses of 30,000 students annually and 120,000 students over the next four years, marking a historic step in the country’s educational landscape.\nSpeaking at a ceremony held here at FAST National University of Computer and Engineering Sciences, the Chief Minister stated, “Under this program, talented students can pursue higher education at top Pakistani institutions without financial worries. The Punjab government will cover 100% of the educational expenses for qualified students.”\nThe program benefits students from “65 universities, 12 medical and dental colleges, and 359 colleges in Punjab”, covering 68 disciplines. Students under 22 years of age with a Punjab domicile and a parental income below Rs. 300,000 per month are eligible to apply.\nTo ensure transparency, all applications were processed through an online portal. A multi-tiered scrutiny process involving institutional, provincial, and steering committees—led by Senior Provincial Minister Marriyum Aurangzeb—oversees the program.\nHighlighting the initiative’s scope, Maryam Nawaz noted, “Scholarships have already been awarded to 2,473 students at the University of Punjab. Today, 2,570 students from Rawalpindi Division are being awarded scholarships at this ceremony.” She further shared that “1,886 students from UET Lahore” have benefited, she added, “1660 scholarships” are allocated for students from public sector universities, while 637 scholarships are for federal universities which will be distributed among the students of private sector universities, a first in the country’s history.\nIn line with her vision to empower women, 60% of the scholarships have been reserved for female students. “This is the real change the people of Punjab are witnessing,” she said.\nMaryam Nawaz also announced the establishment of an “AI institution in Nawaz Sharif IT City Lahore”, aiming to provide students with education in cutting-edge fields like Artificial Intelligence and Cybersecurity.\nThe Chief Minister expressed her optimism for the country’s future, stating, “These brilliant students will lead Pakistan to prosperity through their hard work. While our opponents resort to criticism, we are working for the people’s progress.”\nShe revealed plans to award 50,000 scholarships by next year, and provide laptops” to students. “It is my wish to offer e-bikes at no cost to 100,000 deserving students,” she said.\nResponding to opposition allegations about the program’s funding, Maryam Nawaz questioned, “If these resources are from the public treasury, why didn’t the previous government use them for scholarships? These scholarships are the students’ right, and I am merely fulfilling my duty.”\nMaryam Nawaz urged students to respect their parents and appreciate Pakistan as a blessing. “Always honor women, regardless of their political affiliations,” she said, while emphasizing her commitment to 100% merit-based systems.\nReflecting on her personal struggles, she said, “Facing jail and baseless cases has only strengthened my resolve to serve Pakistan. I am proud to see our students receiving guard-of-honor, as they symbolize the bright future of our nation.”\nPakistan’s economy is stabilizing after being on the verge of default, and the government remains focused on empowering the youth and securing the nation’s progress, she concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:59:42.970Z"
}
