{
  "title": "Next meeting of negotiation committee to be held on January 2",
  "link": "https://www.app.com.pk/national/next-meeting-of-negotiation-committee-to-be-held-on-january-2/",
  "date_published": "2024-12-23T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):The government and opposition members of the negotiation committee have mutually agreed to hold the next meeting on January 2, marking a continuation of their efforts to address national challenges through dialogue.\nIn a statement read by Senator Irfan Siddiqui after today’s sitting, said that the committee members described the discussions as a positive development and expressed hope that the parliament, as the supreme forum, would play a pivotal role in resolving national issues.\nThey stressed the importance of continuing the negotiation process in the country’s best interest.\nDuring the meeting, opposition committee members presented a preliminary outline of their demands. It was agreed that these demands would be submitted in written form to enable further progress in negotiations based on the document.\nThe session also included prayers (Fateha) for the martyrs who sacrificed their lives in the fight against terrorism. Both sides reaffirmed their commitment to standing united with the nation in this struggle.\nThe committees expressed their gratitude to National Assembly Speaker Sardar Ayaz Sadiq for his initiative in facilitating the discussions.\nAddressing the committee, Speaker Ayaz Sadiq commended both sides for forming committees to tackle the country’s pressing challenges.\nHe said that the initiative followed a recommendation to the prime minister on the request of Ali Gohar.\n“I am grateful to all of you for promptly forming these committees. The seriousness of this negotiation process is evident from the seniority of the leadership present,” he added.\nHe noted the constructive atmosphere of the meeting and expressed hope that democracy and political stability in the country would flourish. He added that the opposition would bring a charter of demands to the next meeting, emphasizing that dialogue was the only solution to the country’s problems.\nSardar Ayaz Sadiq called for an end to political polarization to foster national improvement. He reiterated that economic prosperity depended on political stability, underscoring the critical role of negotiations in democracy.\nEarlier, Speaking to reporters, Senator Irfan Siddiqui conveyed optimism about the ongoing negotiations, saying, “We approach these talks with an open mind and high expectations. InshaAllah, we anticipate positive outcomes.”\nSenator Allama Raja Nasir Abbas also stressed the importance of prioritizing Pakistan’s national interests during these discussions.\nThe meeting, chaired by Speaker Ayaz Sadiq, was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, PM’s Political Advisor Rana Sanaullah, Senator Irfan Siddiqui, former Speaker Raja Pervaiz Ashraf, Naveed Qamar,  MQM-P Dr. Farooq Sattar and Minister for privatization Aleem Khan.\nOpposition representatives included former National Assembly Speaker Asad Qaiser, Sahibzada Hamid Raza, and Senator Raja Nasir Abbas.\nOther opposition members, such as Leader of the Opposition Omar Ayub, PTI General Secretary Salman Akram Raja, Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur, and senior PTI leader Hamid Khan, were unable to attend the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:59:40.507Z"
}
