{
  "title": "Pakistan’s average PM2.5 ratio surging at alarming pace, demand urgent control measures: Report",
  "link": "https://www.app.com.pk/national/pakistans-average-pm2-5-ratio-surging-at-alarming-pace-demand-urgent-control-measures-report/",
  "date_published": "2024-12-23T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):A recent study conducted by the Sustainable Development Policy Institute (SDPI), Air Pollution’s Deadly Impact on Health in Pakistan: A Deep Dive into PM2.5 Levels in Peshawar and Islamabad, revealed that only through targeted policies, robust data collection and public health initiatives can Pakistan hope to reduce the burden of air pollution and safeguard the health of its citizens.\nA comprehensive study led by Dr. Razia Safdar, Senior Policy Advisor at the Centre for Health Policy and Innovation, has quantified the health impacts of fine particulate matter (PM2.5) on the residents of these cities, said a press release issued here on Monday.\nAir pollution is taking a heavy toll on public health in Pakistan, new research shows alarming health risks in the country’s two major urban centers, Islamabad and Peshawar.\nThe findings from this study, which utilized the WHO’s AirQ+ tool to estimate health endpoints, highlight the stark reality of air pollution’s impact on life expectancy, mortality rates, and the prevalence of non-communicable diseases (NCDs).\n“PM2.5, airborne particles less than 2.5 micrometers in diameter, are the most hazardous form of air pollution due to their ability to penetrate deep into the lungs and bloodstream, causing severe health issues,” the report said.\nIn Pakistan, which ranks among the top five countries with the worst air quality, cities like Peshawar and Islamabad are experiencing significant public health risks. The country’s average Air Quality Index (AQI) in 2023 was 160, with PM2.5 levels 14.7 times higher than the World Health Organization’s (WHO) recommended limits. Dr. Safdar’s report emphasizes the urgency of addressing the critical health impacts associated with prolonged exposure to such high pollution levels.\nAccording to the study, air pollution in Pakistan contributes to approximately 256,000 premature deaths annually and reduces life expectancy by nearly four years. Among the most affected are vulnerable populations, including children, the elderly, pregnant women, and individuals with pre-existing conditions like asthma and ischemic heart disease.\nThe research specifically focused on two of Pakistan’s urban powerhouses Islamabad, the capital, and Peshawar, the provincial capital of Khyber Pakhtunkhwa. The findings showed a link between elevated PM2.5 levels and various health conditions.\nIn Peshawar, the study found that air pollution was responsible for a significant proportion of deaths from ischemic heart disease (IHD), stroke, and lung cancer. Meanwhile,\nIslamabad also displayed worrying trends, with PM2.5 exposure contributing to increased mortality rates from respiratory diseases and cardiovascular conditions.\nDr. Safdar’s study reveals that even short-term exposure to high PM2.5 levels can lead to acute respiratory infections (ARIs) and exacerbate chronic conditions like Chronic Obstructive Pulmonary Disease (COPD) and asthma. Long-term exposure results in increased risks of heart attacks, strokes, and cancer.\nThe report underscores the need for more localized data and better air quality monitoring to assess health risks accurately. The use of the WHO’s AirQ+ tool enabled researchers to project health outcomes, despite the lack of specific city-level health data for mortality and morbidity. This estimation method helps policymakers understand the scope of health risks and prioritize interventions.\nThe study calls for a multi-faceted approach to combating air pollution, with strong recommendations for strengthening air quality monitoring systems, updating health data, and linking air pollution control measures to broader public health strategies. Dr. Safdar also advocates for the implementation of cleaner technologies and stricter emission standards, particularly in the industrial and transportation sectors.\nThe report’s findings serve as a wake-up call for policymakers and citizens of Pakistan. While the country’s recent approval of the National Clean Air Policy (NCAP) in 2023 is a step in the right direction, it is critical that provincial governments, particularly in urban centers like Islamabad and Peshawar adopt city-specific air quality action plans. Only through robust data collection, targeted policies, and public health initiatives can Pakistan hope to reduce the burden of air pollution and safeguard the health of its citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:59:17.401Z"
}
