{
  "title": "ISSI in collaboration with Lightstone Publishers hosted “9th Adab Festival Pakistan”",
  "link": "https://www.app.com.pk/national/issi-in-collaboration-with-lightstone-publishers-hosted-9th-adab-festival-pakistan/",
  "date_published": "2024-12-23T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP):The 9th “Adab Festival Pakistan”, hosted by the Institute of Strategic Studies Islamabad (ISSI) in collaboration with Lightstone Publishers, had an engaging daylong sessions highlighting the role played by literature in building a harmonious society.\nIn his welcome remarks, Director General (DG) ISSI Ambassador Sohail Mahmood emphasized Pakistan’s literary richness and ISSI’s commitment to fostering creativity through literature. He highlighted the Adab Festival’s role in promoting book reading, especially among youth, as a vital balancing factor in the digital age, said a press release issued on Monday.\nAmbassador Sohail Mahmood lauded the festival as a platform to celebrate cultural pluralism, inspire dialogue, and explore creative ideas. He commended the festival’s diverse program, featuring book talks and discussions on topics such as Quaid-e-Azam’s vision, women empowerment, and education, showcasing its potential to inspire new perspectives.\nIn her introductory remarks, Ms. Ameena Saiyid highlighted the transformative power of literature festivals in honoring writers, researchers, and poets, while addressing societal challenges and reinforcing cultural identity. Dr. Najeeba Arif, Chairperson Pakistan Academy of Letters, emphasized literature’s role in fostering humanity, hope, and soft power, stressing its influence in shaping a nation’s cultural and intellectual landscape.\nThe first session of the Adab Festival, titled “Jinnah’s Vision for Pakistan – A Call for Action,” featured insightful remarks by Barrister Yasser Latif Hamdani, author of the book, and was moderated by Professor Dr. Ilhan Niaz. Barrister Hamdani emphasized Jinnah’s role as a key legislator in Pakistan’s formation, contrasting his inclusive vision with Gandhi’s focus on religion in politics. He clarified that Jinnah envisioned a state, promoting harmony among diverse communities while fostering a modern Muslim society grounded in its religious roots. The session highlighted the need to realign contemporary discourse with Jinnah’s ideals, advocating for a more inclusive and harmonious society.\nThe second session of the Adab Festival, titled “Leadership and Legacy,” featured an engaging discussion with Dr. Maleeha Lodhi, Zahid Hussain, and Ms. Arifa Noor, moderated by Dr. Salma Malik.  Zahid Hussain stressed the importance of history for the younger generation, reflecting on Pakistan’s challenges and sharing insights from interviews with figures like Khan Abdul Ghaffar Khan and Rajiv Gandhi. Dr. Maleeha Lodhi highlighted unlearned lessons from history; missed opportunities in land reforms, education etc.; and the role of individuals in shaping history. Ms. Arifa Noor explored the evolution of political leaders and the need for balanced journalism to capture complex realities.\nFollowing an inspiring Sufi performance by Arieb Azhar, the third session of the Adab Festival, titled “Reimagining Education: New Frontiers and Opportunities,” moderated by Mr. Musharraf Zaidi, focused on critical challenges and innovative solutions in the education sector.  Shakeel Durani highlighted illiteracy as a central issue, advocating for community schools and emphasizing that just Rs. 15 billion annually could enroll 26 million out-of-school children.\nHe also called for technology and policy interventions in remote areas. Ehtesham Anwar stressed the need to prioritize education and address overpopulation and systemic issues. Ms. Uzma Yousuf highlighted the role of parents, economic relevance in education, and the importance of teacher training. Hassan Khan advocated for a shift towards Education 5.0, incorporating AI, augmented reality, and project-based learning to equip students with future-ready skills, urging a collective responsibility for systemic transformation.\nThe fourth session of the Adab Festival, titled “Her Story, Her Voice: Celebrating Women’s Empowerment,” moderated by Ms. Maliha Hussain, explored themes of activism, optimism, and collaboration. Dr. Fouzia Saeed, the author of the book, emphasized the need to highlight positive advancements in the country to foster a sense of hope. Ms. Fazila Aliani reflected on her tireless advocacy for Balochistan, calling for political collaboration and collective action to drive progress.\nThe fifth session, titled “Pakistan and the Changing Global Scenario,” moderated by Mr. Omayr Aziz Saiyid, focused on Pakistan’s strategic positioning amid global power shifts. Senator Mushahid Hussain Sayed discussed the “Asian Century,” emphasizing Pakistan’s “tactical” ties with the U.S. and “strategic” partnership with China. He called for political reconciliation and a strong counter-terrorism strategy.\nMs. Nasim Zehra highlighted the importance of Pakistan-China relations, and internal reforms. Ambassador Masood Khan examined the U.S.-China competition, trade ties with the U.S., and the need to recalibrate relations with China.\nThe sixth session of the Adab Festival, titled “Indus Valley, Mysticism, Folk Traditions,” moderated by Tariq Bhatti, explored the region’s rich cultural and spiritual heritage. Ms. Sarwat Mohiuddin emphasized the interconnectedness of culture, humanity, nature, and folk traditions, highlighting the need for a deeper connection with nature for the well-being of humanity. She identified intolerance as a major challenge, stressing the importance of embracing diverse cultures and perspectives to promote peace and harmony.\nThe Adab Festival concluded with a discussion on Dr. Sania Nishtar’s book, Delivering Welfare at Scale: Ehsaas 2047, moderated by Ms. Amna Rizvan Ali. Dr. Sania Nishtar outlined the Ehsaas initiative as a transformative effort to develop Pakistan as a welfare state, addressing key areas such as education, health, poverty alleviation, and food security.\nDr. Nishtar emphasized that Ehsaas reflected the struggles of those facing poverty, hunger, and inflation, particularly highlighting the role of the underprivileged, including 1.2 million exploited street vendors, in Pakistan’s economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:59:41.223Z"
}
