{
  "title": "PMD alerts authorities to remain vigilant of BIPARJOY cyclone impacts",
  "link": "https://www.app.com.pk/national/pmd-alerts-authorities-to-remain-vigilant-of-biparjoy-cyclone-impacts/",
  "date_published": "2023-06-11T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The Extremely Severe Cyclone Storm (ESCS) “BIPARJOY” may probably approach the southeast Sindh coast and cause widespread wind-dust/thunderstorm rain with some very heavy/extremely heavy falls at few districts of Sindh between June 13-17.\nAbout the possible impacts of the cyclone, the Pakistan Meteorological Department (PMD) has revealed on Sunday that “With its probable approach to the southeast Sindh coast, widespread wind-dust/thunderstorm rain with some very heavy/extremely heavy falls accompanied with squally winds of 80-100Km/hour likely in Thatta, Sujawal, Badin, Tharparker and Umerkot districts during June 13-17”.\n“Dust/thunderstorm-rain with few heavy falls and accompanied with squally winds of 60-80 Km/hour is likely in Karachi, Hyderabad, Tando Muhammad Khan, Tando Allayar, Mirpurkhas districts from June 13/14 and June 16”, the PMD said.\nSqually (high intensity) winds may damage loose and vulnerable structures. Storm surge of 3-3.5 meters (8-12 feet) is expected at the land falling point (Keti Bandar and around).The PMD has advised the fishermen not to venture in open sea till the system is over by June 17, as the Arabian Sea conditions may get very rough/high accompanied with high tides along coast.\nThe Very Severe Cyclonic Storm (VSCS) “BIPARJOY” over east central Arabian Sea has been intensified into an Extremely Severe Cyclonic Storm (ESCS), moved northward during last 12 hours and now lies near Latitude 18.1°N and Longitude 67.5°E at a distance of about 760km south of Karachi, 740km south of Thatta and 840km southeast of Ormara.\nMaximum sustained surface winds are 150-160 Km/hour gusts 180 Km/hour around the system center with and sea conditions being phenomenal around the system canter with maximum wave height 35-40 feet.The favorable environmental conditions (sea surface temperature of 30-32°C, low vertical wind shear and upper-level divergence) are supporting the system to maintain its intensity.\nUnder the existing upper-level steering winds, the ESCS “BIPARJOY” is most likely to track further Northward until June 14 morning, then recurve Northeastward and cross between Keti Bandar (Southeast Sindh) and Indian Gujarat coast on June 15 afternoon as a Very Severe Cyclonic Storm (VSCS).\nPMD’s cyclone warning center, Karachi is continuously monitoring the system and will issue update accordingly.The PMD has also urged the concerned authorities to remain vigilant during the period.",
  "retrievedAt": "2025-08-11T08:41:12.973Z"
}
