{
  "title": "NDMA urges public to stay informed, follow warnings to circumvent impacts of BIPARJOY",
  "link": "https://www.app.com.pk/national/ndma-urges-public-to-stay-informed-follow-warnings-to-circumvent-impacts-of-biparjoy/",
  "date_published": "2023-06-11T09:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The National Disaster Management Authority (NDMA) on Sunday urged the general public to stay informed and follow the official updates and warnings issued by relevant authorities to protect themselves and their properties from the possible impacts of Tropical Cycling BIPARJOY.\nIn an advisory issued by the spokesperson for NDMA said according to the latest information gathered through monitoring of International forecasting models, Tropical Cyclone BIPARJOY, which was currently a Very Severe Cyclonic Storm (VSCS) would likely to intensify into an Extreme Severe Cyclonic Storm (ESCS) in next 24 hours.\n“It is located at 840 km south of Karachi and moving north-northeastward with winds of 130-140 km/h and gusts of 150 km/h. PMD reported that it is likely to follow one of three tracks and impact coastal areas of Pakistan,” it said.\nThe potential impacts included heavy rains, thunderstorms and winds in south and southeast Sindh (Karachi, Thatta, Sujawal, Badin, Tharparkar & Mirpurkhas) from evening of 13 June onwards; damage to weak structures due to winds; storm surge and urban flooding along the coast and rough to very rough sea conditions with high-intensity squalls that will prevent fishermen from venturing out into the open sea.\nNDMA, in close coordination with PMD, Provincial Disaster Management Authority (PDMA) Sindh & Balochistan, Pakistan Navy, Pakistan Maritime Security Authority (PMSA), Pakistan Coast Guards (PCG) issuing advisories and guidelines to all concerned stakeholders at national and provincial levels to undertake proactive preparedness and mitigation measures.\nNDMA’s NEOC is continuously monitoring and sharing information with all stakeholders and the public through webpage-based projections of BIPARJOY’s tracks and impacts on coastal areas.",
  "retrievedAt": "2025-08-11T08:41:12.940Z"
}
