{
  "title": "Political parties enjoying level playing field, voters free to elect representatives: PM",
  "link": "https://www.app.com.pk/national/political-parties-enjoying-level-playing-field-voters-free-to-elect-representatives-pm/",
  "date_published": "2024-01-25T18:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar Thursday said all the political parties had a level playing field for taking part in the elections, with millions of voters having the opportunity to elect their representatives freely.\nIn separate interviews with private news channels, he said it was priority of the caretaker government to hold peaceful elections and the Election Commission would be provided every support.\nHe dismissed the notion of a ban on social media or internet during the elections.\nHe said members of the previous National Assembly used their constitutional right to remove the government of Pakistan Tehreek-e-Insaf (PTI) through a vote of no-confidence.\nDuring the PTI government, he said, the nation faced numerous economic problems and had difficult times in relations with other countries.\nHe welcomed the Supreme Court’s decision on the intra-party elections of PTI.\nTalking about the May 9 incidents, he said cases of some of the persons involved in the incidents would be tried in civil courts and some would undergo trial in military courts. Investigations into the May 9 incidents had been completed to a large extent, he said, adding the culprits would be handed down sentences in the coming months.\nHe said Pakistan would need assistance of the International Monetary Fund (IMF) for the next few years.\nPM Kakar said if the Tehreek-e-Taliban Pakistan (TTP) laid down arms unconditionally then talks could be held with them. Otherwise, the State was ready to fight with the terrorist outfit for the next 100 years, he added.\nHe said he was taken aback at the attack carried out by Iran on the Pakistani soil.\n“The attack by Iran on Pakistan was a mistake,” he said, adding Pakistan did not have any border dispute with the neighbour and both sides wanted to reduce tension.\nHe said Pakistan appropriately responded to the attack as it did not have the option to not answer back. The territorial integrity and sovereignty would be protected at all costs, he asserted.\nHe said Pakistan would raise the issue of presence of Balochistan Liberation Army (BLA) in Iran.\nThe prime minister said the government was in contact with Afghan authorities at different levels.\nHe further said Pakistan was a responsible nuclear state, however, it would respond with force if India resorted to any misadventure.\nThe only dispute between Pakistan and India, he said, was on Kashmir. The people of Pakistan were peaceful and wanted constructive developments in the region, he opined.\nPM Kakar said Pakistan had no cause to recognize Israel.\nAs regards Balochistan, he said some organizations in the province were violent and had taken up arms against Pakistan. They were also trying to generate a sympathetic narrative for themselves in the guise of civil society, he noted.\nHe viewed that the issue of missing persons was complicated.\nThe prime minister said that Pakistan was facing a wave of terrorism and the State had the responsibility to protect its unarmed citizens against violent elements.\nHe said he would hold consultation with his associates after the next elections about his future politics.",
  "retrievedAt": "2025-08-10T23:54:35.789Z"
}
