{
  "title": "Indian Republic Day celebration a facade to cover-up democratic failures, minorities’ persecution: Analysts",
  "link": "https://www.app.com.pk/national/indian-republic-day-celebration-a-facade-to-cover-up-democratic-failures-minorities-persecution-analysts/",
  "date_published": "2024-01-25T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): The recent consecration of Ram Temple in Ayodhya, the unabated persecution of minorities and gross human rights violations in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) are among the many factors evidencing the Indian Republic Day as mere a facade.\nObserved on January 6, the Kashmiri leadership and human rights analysts consider the Day as a masquerade to hide India’s democratic failure, as it is marred with unprecedented and incorrigible issues permeated in its society through the rise of fanatical BJP regime.\nThe gross human rights violations, the Kashmir issue, and the persecution of minorities have rendered India as oppressor and hegemonic state, and its celebrations of Republic Day is just a mask to hide its true face.\nDespite tall claims of being the largest democratic republic state, the Indian political parties, especially BJP’s phenomenal rise, has always been centered on its hoisting of the majoritarian Hindutva flag.\nThe false façade created by Gandhi and Nehru got a reality test after the rise of the Hindu Nationalist BJP in 2014 and 2019.\nThe analysts observed that the political fissures and polarization in Indian society were rising with phenomenal speed, as the BJP was trying its best to make it a saffronized state.\nIn sharp contrast to its so-called secular values, the Hindu nationalists argue that Hindu culture defines Indian identity and that minorities need to assimilate by accepting the strictures of this majority culture.\nThe recent Ram Mandir inauguration controversy and its media hype is a prototype of the Indian exclusionist democratic mode.\nThe political experts and analysts while commenting on the inauguration of Ram Temple, built on the debris of the centuries-old Babri Masjid, by Narendra Modi said that minorities were being persecuted psychologically, physically, and economically in India.\nMinorities like Dalits and Christians of Tamil Nadu are facing acute human rights violations under the BJP rule, leading to massive conversion to Buddhism.\nManipur state is a glaring example of India’s failed federalism because there is a lot of violence between different groups of people, and the BJP secretly backs the Hindu group.\nTo condemn the inhumane treatment of minorities and oppression of Kashmiri people, the Kashmiri leadership has announced to observe Indian Republic Day as a Black Day to convey the message to the world that India’s continued denial of right to self-determination to them was contrary to its claims of being a democratic country.",
  "retrievedAt": "2025-08-10T23:55:27.871Z"
}
