{
  "title": "Federal Ombudsman visits KP Ombudsman Secretariat",
  "link": "https://www.app.com.pk/national/federal-ombudsman-visits-kp-ombudsman-secretariat/",
  "date_published": "2024-01-25T13:32:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 25 (APP): Federal Ombudsman Ijaz Ahmad Qureshi paid a visit to Provincial Ombudsman Secretariat and held meeting with Provincial Ombudsman Syed Jamal ud Din Shah here at his staff the other day, said a press release issued here on Thursday.\nThe provincial Ombudsman welcomed the Federal Ombudsman and briefed him regarding the role and activities of the Provincial Ombudsman. He also apprised him in connection with the complaints and redressal method of the complaints at the secretariat level. He said that in the year 2023, the provincial Ombudsman Office has received record number of complaints which were more than the previous years and majority of complainants received relief by resolving their grievances with in specific period as prescribed in the Ombudsman act.\nHe also congratulated the Federal Ombudsman for their election as President of Asian Ombudsman Organisation and hoped that he would continue to focus on the promotion and well being of the Ombudsman office at international level.\nSpeaking on the occasion, Federal Ombudsman Ijaz Ahmad Qureshi appreciated the role of Provincial Ombudsman Secretariat for providing speedy relief to the common man. He eulogized the role and steps taken by Syed Jamal ud Din Shah as Provincial Ombudsman for the opening of regional offices at DI Khan, Malakand and Abbottabad which will enable the people of that areas to lodge their complaints near their region by avoiding their visit to the Provincial Secretariat.\nThe Federal Ombudsman also lauded the competency of Investigation Officers for taking each and every case on merit and decide the matters well in time.\nHe stressed upon the staff to work hard and do not take any pressure while deciding the cases independently. The important issue is how to deal with complainants and provide satisfaction while they visit your office. Always deal with complainants politely.\nHe was also praiseworthy for the media cell role and advised them to play their role towards awareness of the people so that the role of Federal as well as Provincial Ombudsman can be highlighted.\nAt the end, Provincial Ombudsman Syed Jamal Ud Din Shah presented a souvenir to the Federal Ombudsman",
  "retrievedAt": "2025-08-10T23:54:53.162Z"
}
