{
  "title": "PAECO seeks to boost parliamentary cooperation for shared regional peace, progress: Hashmi",
  "link": "https://www.app.com.pk/national/paeco-seeks-to-boost-parliamentary-cooperation-for-shared-regional-peace-progress-hashmi/",
  "date_published": "2024-01-25T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Special Secretary of National Assembly Syed Shamoon Hashmi Thursday said that the Parliamentary Assembly of Economic Cooperation Organization (PAECO) sought to boost parliamentary cooperation for increased economic collaboration, aiming to achieve shared peace, progress and prosperity in the region.\nAddressing the concluding ceremony of the two-day workshop for delegates of PAECO member parliaments titled “Parliamentary Services for Strengthening Development”, he said that since the establishment of the women’s parliamentary caucus, Pakistan’s Parliament had passed more laws related to women and children than it had done previously.\nWhile sharing his lifelong experiences of parliamentary diplomacy with participants of the workshop, Hashmi said Pakistan delved deep into the world of parliamentary forums and friendship groups, highlighting how their active role powerfully enhance regional inclusiveness and outreach.\nThe platforms, he added, “provide legislators members with pertinent information and knowledge through open and thorough discussions, enabling them to adopt a results-oriented approach to issues and subsequently enact relevant laws”.\nHe also deliberated upon the significance of parliamentary friendship groups and parliamentary caucuses to highlight the significance of parliamentary diplomacy.\nThe participants were awarded certificates of appreciation for their valuable participation and contribution in the workshop.\nThe participants were also briefed about the significance, role and functions of Pakistan Institute of Parliamentary Services (PIPS) by its Executive Director Muhammad Anwar.",
  "retrievedAt": "2025-08-10T23:54:36.731Z"
}
