{
  "title": "ECP issues Code of Conduct for security personnel deployed on election duty",
  "link": "https://www.app.com.pk/national/ecp-issues-code-of-conduct-for-security-personnel-deployed-on-election-duty/",
  "date_published": "2024-01-25T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): The Election Commission of Pakistan (ECP) on Thursday issued a Code of Conduct for the personnel of Armed Forces and Civil Armed Forces deployed for election duty, ensuring foolproof security during the general elections-2024.\nThe ECP, in a notification, said the security personnel deputed for the general elections, would carry out their duties in accordance with the role defined in Article 245 of the Constitution of Pakistan.\n“They must adhere to the law and operate within the mandate assigned to assist the Election Commission of Pakistan in conducting the elections,” it added.\nThe ECP said the primary duty of the forces was to provide a secure environment, facilitating easy and safe access for voters to polling stations.\n“The police will act as the first-tier responders, followed by the Civil Armed Forces and Armed Forces as the second and third-tier responders, respectively. These forces will be deployed outside selected, highly sensitive polling stations.\n“Their responsibilities include providing security for printing presses during the printing of ballot papers, overseeing the transportation of ballot papers from printing presses to the offices of District Returning Officers, and ensuring security during the transportation of election materials from Returning Officers’ offices to polling stations and back after polling and counting.\n“The forces will carry out their functions under Article 220 and 245 of the Constitution of Pakistan, Section 4 and 5 of the Anti-Terrorist Act (ATA), 1997 (as amended), and Section 5 read with Section 193 of the Election Act, 2017 (XXXIII of 2017).\n“Every officer and junior commissioned officer of the Armed Forces of Pakistan and Civil Armed Forces will exercise powers delegated to them through Notification No. F.21 (1)12023-Elec-l, dated 25th January 2024, issued by the Election Commission of Pakistan.\n“All personnel are expected to facilitate the provision of a secure environment, enabling District Returning Officers (DROs), Returning Officers (ROs), Presiding Officers (POs), and Polling Staff to accomplish their tasks impartially.\n“Throughout the election process, and particularly during the voting process, personnel must remain impartial and neutral, refraining from favoring or opposing any political party or candidate. When dealing with voters and election staff, they are required to demonstrate politeness, display impeccable behaviour, and act justly in accordance with the law.\n“The personnel are responsible for identifying suspicious voters for frisking/checking by police personnel before entering the premises of the polling station, ensuring that no person brings any weapon/explosive or undesirable item inside. Outside the selected most sensitive polling stations, the focus should exclusively be on ensuring a secure environment.\n“While performing their duties, the personnel must report to the Presiding Officer and their Chain of Command regarding any irregularity/issue/malpractice that could potentially create a law and order/security situation. If the Presiding Officer does not act to prevent reported irregularities, the security staff must immediately inform the concerned Returning Officer.”\nThe Code of Conduct emphasized adherence to all relevant laws, continuous efforts to gain the general public’s trust, ensuring a safe environment, and maintaining law and order during the election process. DROs/ROs can visit polling stations at any time, and accredited observers and media persons are allowed entry.\n“The personnel must not disallow any eligible voter from entering the polling station, except those found in possession of weapons/explosives or causing disturbance, incitement to violence, or actions prejudicial to national safety/interests.\n“They should not assume the duties of polling staff, take custody of any election material, engage in arguments/altercations, or interfere in the functions of Presiding Officer, Assistant Presiding Officer, or Polling Officer.\n“In case of apparent irregularities outside a polling station, personnel should not respond independently but bring the matter to the attention of the Presiding Officer and take necessary directions. If irregularities persist, they must inform their Officer In-Charge immediately to enable necessary legal action. Personnel are not allowed to interfere in the counting process and should perform their duties outside the polling station in a peaceful manner.”",
  "retrievedAt": "2025-08-10T23:54:37.119Z"
}
