{
  "title": "Digitizing electoral process suggested to eliminate controversies",
  "link": "https://www.app.com.pk/national/digitizing-electoral-process-suggested-to-eliminate-controversies/",
  "date_published": "2024-01-25T15:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): The speakers at a seminar on “Electoral Code of Conduct: Ethical Practices of Stakeholders including Media,” Thursday stressed the need the importance of enforcing election laws and digitizing the electoral process to eliminate controversies in elections.\nThey also stressed the importance of implementing the Code of Conduct formulated by the Election Commission of Pakistan (ECP) in collaboration with stakeholders.\nIt was the third seminar organized by the Press Information Department (PID) with the aim to stimulate discussions on elections and contribute to the economic advancement of the country.\nECP Spokesperson Syed Nadeem Haider, in his remarks, said that the Commission, in collaboration with the stakeholders, developed a Code of Conduct for the media, political parties, and candidates.\nHighlighting its key points, he mentioned that the Code “prohibits speaking against national institutions, dissemination of hate material, discussing private individuals’ lives, sets an upper limit of election expenditure at Rs 10 million for the National Assembly and Rs 4 million for provincial assembly seats, restricts wall chalking, and imposes limitations on the size of banners and pamphlets”.\nHe said that the ECP had established multiple monitoring teams, deploying two teams in each district and constituency to oversee the Code’s compliance.\n“Show cause notices will be issued, and fines imposed on those violating the Code,” he added.\nDr Asmat Ullah of the Sustainable Development Policy Institute (SDPI) said that the voters’ turnout was the lowest in Pakistan from among 169 countries. He demanded strict punishment for violators of the Code of Conduct.\nDr Shahid Hussain of the Allama Iqbal Open University (AIOU) mentioned that successive governments had not brought significant changes to the people’s lives. Soaring fuel prices, utility bills, and unemployment had made their lives difficult, leading to frustration among them, he added.\nDr Rooh ul Amin Khan of the International Islamic University (IIU) Islamabad highlighted that rigging allegations stemmed from insufficient infrastructure. He recommended collaboration between the Election Commission and academia to address the issue and combat misinformation often propagated through social media.\nJournalist Iftikhar Sherazi suggested simplifying the implementation of the Code of Conduct.\nJournalist Hafiz Tahir Khalil recommended conducting thorough investigations before reporting on fake news.\nMs Shahida Naveed, President of Meri Pechan Welfare Foundation, Wahab Hassan and anchor person Ms Aniqa Nisar also spoke.",
  "retrievedAt": "2025-08-10T23:54:25.060Z"
}
