{
  "title": "PEC hold 2nd Federal, 4th Engineering Capstone Expo 2024",
  "link": "https://www.app.com.pk/national/pec-hold-2nd-federal-4th-engineering-capstone-expo-2024/",
  "date_published": "2024-01-25T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP):Pakistan Engineering Council (PEC) conducted the 2nd Federal Capstone Expo (FYDP- Final Year Engineering Design Projects Exhibition) and 4th Regional Capstone (A project of PEC Pakistan Development Committee – PPDC) at “Pak-China Friendship Center” was participated by 27 Universities and 252 shortlisted projects were showcased out of which 72 projects were PEC sponsored.\nCapstone Engineering Universities showcased their Engineering students’ projects that pertain to market/industry, in which industries were present along with the Islamabad Chamber of Commerce to participate and select projects as per their business needs. Capstone is the PEC initiative 1st time in Pakistan by the PEC Pakistan Development Committee.\nThis opportunity is granted by PEC free of cost to help our universities gain more market exposure as well as be able to network with world-class manufacturers of different varieties of engineering products. Market-compatible projects being sponsored by PEC. More than 2000-foot fell at the inauguration ceremony whereas visitors over 4000, a news release said.\nChairman Pakistan Engineering Council (PEC), Engr Muhammad Najeeb Haroon inaugurated the ceremony as chief guest along with the guests from the Islamabad Chamber of Commerce (President ICCI, Mr Ahsan Zafar Bakhtawri, SVP ICCI, Faad Waheed, Ambassador from Indonesia, Jiflawan G.P and Ambassador from Kyrgyz republic, UlanbekTotiaev).\nEngr Muhammad Najeeb Haroon highlighted the Engineering community’s critical role, especially in such a situation in which Pakistan is currently trapped.\nIt’s a continuous and consistent struggle that can make a difference and bring the country back on track to the development journey. Old mistakes and practices to end up and have to come up and work upon to make the country self-sufficient is the only bailout for Pakistan and that’s possible only when Engineers play their role with the state and PEC support.\nAhsan Zafar Bakhtawri, SVP ICCI, in his address, appreciated the efforts of PEC PPDC and highlighted that PPDC is named for delivering very valuable to the engineering community and society via multiple projects initiatives.\nHe mentioned that not only PEC but also industries should come forward and sponsor such projects catering to industry and business needs.\nHe emphasised industry localisation to increase exports and decrease Imports. He also asked engineers for renewable energy projects as one of the major challenges Pakistan is facing. He showed great confidence in engineers to play their role.\nIn the Closing ceremony of the Capstone project Engr Mir Masood Rashid (Convenor PEC PPDC and advisor to Chairman PEC) mentioned the key contributors who made this 4th Regional and 2nd Federal Capstone Expo successful.\nHe also briefed on the Capstone Expo theme and highlighted the initiatives of the PEC for the period 2021-24, among which one is the Engineering Capstone Expo.\nPPDC has ten milestone projects successfully launched with propelling consistent deliverables for the Engineers and society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:54:44.514Z"
}
