{
  "title": "PM congratulates KP govt over health insurance facility to entire province",
  "link": "https://www.app.com.pk/national/pm-congratulates-kp-govt-over-health-insurance-facility-to-entire-province/",
  "date_published": "2021-02-01T06:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP): Prime Minister Imran Khan Monday congratulated the government of Khyber Pakhtunkhwa for becoming the first province in Pakistan to extend universal health coverage to all of its citizens.\n“Congratulations to KP govt for making KP first province in (Pakistan) with Universal Health Coverage for all KP-domiciled citizens,” the prime minister said on Twitter.\nPM @ImranKhanPTI has congratulated KP govt on making KP the first province to roll out Universal Health Coverage. Over 40m residents now have free health insurance worth Rs. 1 million per family per year that can be availed in over 400 public & private hospitals#KPSehatCardPlus pic.twitter.com/NCnNGRqlf3\n— Prime Minister's Office, Pakistan (@PakPMO) February 1, 2021\nCongratulations to KP govt for making KP first province in Pak with Universal Health Coverage for all KP-domiciled citizens. 40,000,000 residents covered with free health insurance. Free treatment upto Rs1,000,000 per family per year in over 400 govt/private hospitals across Pak.\n— Imran Khan (@ImranKhanPTI) February 1, 2021\nUnder the initiative, around 40 million residents of the province would avail free health insurance of up to Rs1,000,000 per family per year.\nThe beneficiaries would be able to get free medical facility in over 400 designated private and government hospitals across the province.\nFrom this point onwards, whenever you come across needy KP resident who needs medical care and can not afford, your duty should be giving him/her awareness regarding #KPSehatCardPlus; just tell him/her to take CNIC to any empaneled hospital across Pakistan & avail FREE treatment! pic.twitter.com/ECnC0c1fnN\n— PTI (@PTIofficial) February 1, 2021\nThe extension of universal health coverage to entire KP would complete on Monday as the provincial government was set to launch Sehat Cards in Southern Districts.\nWith tomorrow’s launch of Sehat Card in Southern Districts we ll become first province to have universal coverage of health insurance for 100 % population . It’s a big step towards achieving the dream of welfare state on pattern of Riasat e Madina as envisioned by Imran Khan.\n— Mahmood Khan (@IMMahmoodKhan) January 31, 2021\n“It’s a big step towards achieving the dream of welfare state on pattern of Riasat-e-Madina as envisioned by Imran Khan,” KP Chief Minister Mahmood Khan said on Twitter.\nThe districts include Kohat, Karak, Hangu, Bannu, Lakki Marwat, Tank and Dera Ismail Khan.",
  "retrievedAt": "2025-08-11T20:18:16.258Z"
}
