{
  "title": "Over half million COVID-19 patients recover amid 90 percent revival ratio",
  "link": "https://www.app.com.pk/national/over-half-million-covid-19-patients-recover-amid-90-percent-revival-ratio/",
  "date_published": "2021-02-01T12:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP):The country on Monday surpassed half a million mark of recovered Coronavirus patients with national tally of total active COVID-19 cases recorded 33,493 with 1,615 more people tested positive for the deadly virus and 1,278 people recovered from the disease during the last 24 hours.\nTwenty Six corona patients died during past 24 hours, 24 were under treatment in hospital and two in their respective homes or quarantines died on Sunday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nIt added that out of the total 26 deaths during last 24 hours 15 patients died on ventilators.\nThe maximum ventilators were occupied in four major areas including Multan 41 percent, Islamabad Capital Territory (ICT) 37 percent, Peshawar 28 percent and Lahore 35 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Peshawar 42 percent, Multan 34 percent, Karachi 35 percent and Bahawalpur 27 percent.\nAround 283 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 34,785 tests were conducted across the country during last 24 houre including 11,031 in Sindh, 11,431 in Punjab, 6,077 in Khyber Pakhtunkhwa (KP), 5,059 in Islamabad Capital Territory (ICT), 438 in Balochistan, 400 in GB, and 349 in AJK.\nAround 501,252 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 546,428 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 9,019, Balochistan 18,823, GB 4,909, ICT 41,418, KP 67,214, Punjab 157,796 and Sindh 247,249.\nAbout 11,683 deaths were recorded in country since the eruption of the contagion. Around 3,996 perished in Sindh among four of them died on Sunday. Three of them died in hospital and one out of the hospital.\n4,747 in Punjab had died with 11 deaths in past 24 hours. Ten of them perished in the hospital and one out of the hospital. 1,906 in KP where nine of them died in hospital on Sunday, 475 in ICT, 195 in Balochistan, 102 in GB and 262 in AJK with two of them succumbed to the deadly virus in hospital on Sunday.\nA total of 7,966,981 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 2,541 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:18:15.956Z"
}
