{
  "title": "Stipend for Ehsas’ beneficiaries children increased: Dr Sania Nishtar",
  "link": "https://www.app.com.pk/national/stipend-for-ehsas-beneficiaries-children-increased-dr-sania-nishtar/",
  "date_published": "2021-02-01T17:37:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 01 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar on Monday said network of Ehasas Nashonoma Programme (ENP) were expanded in the country and stipends for beneficiaries increased to prevent stunted growth in poor children.\nBriefing representatives and heads of foreign missions, international monetary institutions and UN organizations about PTI Government flagship Ehsas Nashonoma Programme in its Jamrud centre in Khyber tribal district, Dr Sania Nishtar said it was pro-poor programme that was also extended to merged areas including Khyber tribal district to combat stunted growth in poor children.\nUnder Ehsas Nashonoma Program, she said stipend has been increased to Rs1,500 for boys and Rs2,000 for girl for provision of healthy diet to them for two years. She said free healthy food services are being provided to beneficiaries children under this ambitious programme in the country including in Khyber tribal district.\nShe said the stipend and packets of health diets was being provided to pregnant and lactating mothers after every three months. Under an inclusive digital system, she said data of all beneficiaries and services was properly maintained and assistance was being provided on merit.\n“It was apolitical programme under which poor children irrespective of their parents’ political affiliation, caste and colour is being benefited,” she maintained.\nDr Sania said prevention of stunted growth in poor children was the top most priority of the government and that fund for Ehsas Naushnoma Program was directly being provided by Ministry of Finance, Govt of Pakistan.\nShe clarified that this programme was being run purely through Govt of Pakistan’s budget and no funding was being received from any foreign donor agency. She said today’s visit to Jamrud Khyber was arranged on the request of representatives and heads of foreign missions besides representatives of monetary institutions and UN agencies to personally oversee this key programme on ground.\nShe said 65 percent work on Ehsas Survey has been completed and remaining work would be completed by June this year, adding more poor beneficiaries would also be included in Ehasas Kifalat Program on basis of this inclusive survey.\nDr Sania Nishtar expressed the hope that beneficiaries under Ehsas Kifalat Program would increased from existing four million to seven million on completion of the survey that was major step forward to bring poor segment of the society under social safety net.\nShe said the programme was digitalized and all information was available in a single click besides transparency is its hallmark. She said services in all Ehsas Naushnoma Centres were strengthened besides provision of necessary training to staff for quick service delivery.\nTo a question about provision of a job to a disabled FA passed girl student, she said all recruitment in her ministry was made on merit and any one full fill Govt. recruitment criteria would be provided jobs. She said the said girl has been asked to apply for undergraduate stipend program.\nEarlier, she inaugurated Ehsas Naushonma Center at Jamrud. Dr Sania Nishtar briefed the representatives of foreign missions, monetary institutions and UN organizations about different services being offered to the beneficiaries under Ehsas Naushonoma Program in its Jamrud centre.",
  "retrievedAt": "2025-08-11T20:18:09.602Z"
}
