{
  "title": "NA speaker vows enduring support for resilient Kashmiris under Indian oppression",
  "author": null,
  "content": "ISLAMABAD, Jul 12 (APP): National Assembly Speaker Sardar Ayaz Sadiq reaffirmed Saturday that India’s oppression cannot break the spirit of the Kashmiri people, and Pakistan remains committed to offering steadfast, unequivocal support.\nPaying solemn tribute on Kashmir Martyrs’ Day, commemorated annually to honor the 22 Kashmiris martyred on July 13, 1931 outside Srinagar’s Central Jail, Speaker Sardar Ayaz Sadiq emphasized that their sacrifice in defense of truth, freedom, and self-determination remains an enduring milestone in the collective memory of the Kashmiri liberation movement.\nSpeaker noted that the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) have, for decades, faced a brutal regime of state-sponsored oppression, systemic human rights violations, and relentless militarized coercion, yet remain unflinchingly committed to their just cause.\nHe emphasized that India’s persistent attempts to stifle dissent through violence, demographic manipulation, and communication blackouts will never extinguish the aspirations for emancipation ingrained in the hearts of the Kashmiri people.\nThe right to self-determination is their inalienable entitlement, acknowledged by UN Security Council resolutions.\nSpeaker Sardar Ayaz Sadiq urged the international community, the United Nations, and global human rights institutions to take immediate cognizance of the grave humanitarian crisis unfolding in occupied Kashmir. He stressed the need for tangible and result-oriented interventions to ensure that the Kashmiri populace is granted the freedom and dignity they have long been denied. The global conscience must awaken to the plight of Kashmir and speak out against tyranny in favor of justice and human dignity.\nNA Speaker further stated that the Parliament of Pakistan, through numerous unanimous resolutions, has consistently reaffirmed the nation’s principled and unwavering support for the Kashmiri people’s struggle.\nHe reiterated Pakistan’s enduring moral, political, and diplomatic commitment to the Kashmiri cause until a just and peaceful resolution is achieved in accordance with international law and the aspirations of the Kashmiri people.\nOn this solemn occasion, Deputy Speaker of the National Assembly, Syed Ghulam Mustafa Shah also extended homage to the martyrs of Kashmir and lauded the Kashmiri people’s undaunted perseverance in the face of extreme adversity. He expressed confidence that the sacrifices rendered by the martyrs would not go in vain, and that the day is not far when the people of Kashmir would breathe the air of freedom and justice.\nNA Deputy Speaker called upon the global community to take substantive notice of India’s repressive policies in Kashmir and to uphold the international norms of human rights and self-determination.\nHe reiterated Pakistan’s solemn pledge to continue standing shoulder to shoulder with the people of Kashmir in their rightful quest for liberation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:30:09.818Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-speaker-vows-enduring-support-for-resilient-kashmiris-under-indian-oppression/",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T16:43:00.000Z"
}
