{
  "title": "Week-long anti-polio campaign to begin from May 15",
  "link": "https://www.app.com.pk/national/week-long-anti-polio-campaign-to-begin-from-may-15/",
  "date_published": "2023-05-14T06:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Under the National Immunisation Programme, a week-long anti-polio campaign will kick off on Monday (tomorrow), where children under 5 years of age will be given polio drops in various districts of the four provinces in the country.\nAccording to details, a five-day-long campaign will be held from May 15 to 19 with the aim to immunize more than 2 million children to boost the immunity of children.\nDistrict Health Officer Punjab talking to a private news channel said that almost 12 districts of Punjab have been made part of the campaign including Lahore, Faisalabad, Rawalpindi, Bhakkar, DG Khan, Layyah, Mianwali, Multan, Muzaffargarh, Rajanpur, Rahim Yar Khan and Sheikhupura.\nIn Lahore, Rawalpindi and Faisalabad, the campaign will continue for seven days while in other districts it will last for five days.\nAll-out arrangements have been finalized by the National Immunization campaign against Polio to save children from the crippling disease of polio.\nHe said mobile teams have also been formed which would visit all the areas including the remote, far-flung areas, flood-affected areas and Afghan refugee camps areas in Islamabad and other districts to accomplish the task.\nHe also urged the religious scholars, NGOs and local community to make this campaign successful by involving their all-possible efforts so that the children of the whole district could be immunized against this crippling disease.\nHe said the private schools should also cooperate with the district administration in implementing the polio eradication programme.\nThe government should further accelerate its efforts for tackling polio by strengthening polio surveillance systems and ensuring high vaccination coverage during this time.",
  "retrievedAt": "2025-08-11T08:29:46.448Z"
}
