{
  "title": "Pakistan-Czech Republic trade volume reaches over $300 mln: Czech Envoy",
  "link": "https://www.app.com.pk/national/pakistan-czech-republic-trade-volume-reaches-over-300-mln-czech-envoy/",
  "date_published": "2023-05-14T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Ambassador of the Czech Republic to Pakistan Tomáš Smetánka on Saturday said that the bilateral trade volume between Pakistan and Czechia had reached over $300 million and both countries were focusing on enhancing trade in multiple sectors like the mining industry and agriculture sector.\n“Pakistan’s exports to the Czech Republic are about four times higher than the Czech exports to Pakistan. Pakistani exports in textile, sportswear, foodstuff, and leather products were much higher,” Ambassador told APP during an exclusive interview.\n“However, the embassy in Pakistan is working hard to ensure the bilateral trade exchange is more balanced as Pakistan has surplus exports.”\nHe said it was primarily due to introducing the GSP plus trade mechanism, which allowed Pakistani exports to the European Union.\nHe said, “Few delegations are coming to Pakistan to enhance trade and investments. They are interested in the mining sector, particularly in Balochistan, as the Czech Republic has relatively well-developed mining technologies.”\nIn reply to a question regarding the renewal of GSP plus the status of Pakistan, the Ambassador said that it contributed to our relations with Pakistan in both ways.\n“One supports Pakistani industries and exports to the European Union, while the other improves Pakistan’s legal human and labour rights.”\n“Pakistan fulfilled the conditions of ratifying the 26 agreements that are a condition for GSP plus status. But, there are still some questions about the actual implementation of it.”\n“Therefore, it depends on what the members of the European Parliament will decide in light of the progress and compliance of Pakistan on conditions and international agreements,” he added.\nTalking about educational cooperation, he said, “Presently, the Czech Republic has seven times more Pakistani students than it had ten years ago. These students are studying on different scholarships at leading universities.”\nHe said, “Czech universities have agreements on cooperation with Pakistani universities and urged for institutional partnerships between the Czech Republic and Pakistani universities to seek potential, talented, and skillful students in science and technology and higher education for better outcomes. So this would enhance educational cooperation and people-to-people relationships.”\nHighlighting the role of the Czech Embassy in women’s empowerment, the Ambassador said that in the past, his diplomatic mission supported a few projects that contributed to women’s empowerment in rural areas.\n“One ongoing project also highlights women’s role in our history and our societies with the collaboration of the National College of Arts (NCA) Lahore.”\nAnswering a query about the Czech Republic’s role in combating climate crises in Pakistan, he said, “His country takes climate change very seriously and has contributed to the ‘Green Climate Fund’.”\nHe noted that the Czech companies could help with water management, wastewater management, soil protection, and rehabilitation.\nExplaining the employment opportunities for Pakistani citizens in the Czech Republic, he said, “We are exploring the possibilities to engage skilled, qualified, and scientific personnel from Pakistan.”\nCommenting on visa policy, he said, “The Czech Republic is not within the countries that receive visas on arrival in Pakistan.”\nHe expressed hope that allowing visas on arrival for Czech citizens might enhance our cooperation in tourism and culture.\nHe concluded that the Czech Republic valued its historical links with Pakistan and enjoyed the multifaceted collaboration, adding that the two countries significantly developed their political, economic, and defense cooperation.",
  "retrievedAt": "2025-08-11T08:29:45.486Z"
}
