{
  "title": "Govt. intensifies efforts to implement Urdu as official language",
  "link": "https://www.app.com.pk/national/govt-intensifies-efforts-to-implement-urdu-as-official-language/",
  "date_published": "2023-05-14T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): The Ministry of Planning, Development and Special Initiatives is taking practical measures to implement Urdu as an official language in all government departments under Article 251 of the Constitution.\nAccordingly, it recently approved a revised PC-I of the project worth Rs. 78.186 million titled “Establishment of National Language Processing Laboratory (NLP-Lab)”, expediting its efforts to comply with the Supreme Court’s order passed in 2015 for enforcement of Urdu as an official language.\nThe Ministry of National Heritage and Culture Division is the sponsoring agency, while the National Language Promotion Department (NLPD) will execute the project.\n“The core objective of the project is to elevate Urdu to the status of languages with extensive digital data resources and equip it with modern technology applications,” said Director General NLPD Dr Rashid Hameed, who is associated with the department established in October 1979 to advance and promote the Urdu national language.\nSharing details of the NLP-Lab, Dr Rashid Hameed explained the project includes the development of several applications like Machine Translation (MT), Speech Recognition (SR) and Optical Character Recognition (OCR) that would make language learning more accessible, facilitate cross-border communication and commerce, enable people to access online content, promote cross-cultural understanding, and help preserve language resources.\nHe believed that only languages that adapted to the latest technology would survive in today’s world.\nSince assuming power in April 2022, the incumbent government has taken several steps toward implementing digital transformation in the country.\nPlanning Minister Professor Ahsan Iqbal has been a driving force behind these efforts, with a focus on shifting from manual to digital processes.\nLast month, the minister established a Steering Committee consisting of experts from the information technology and private sectors aimed at facilitating the implementation of digital transformation and increasing the country’s export volume.Programme Manager for Research & Development at the NLPD Syeda Roshana Ali Naqvi while sharing further details of the project explained that the Machine Translation (MT) module used computer algorithms to automatically translate text from English to Urdu.\n“This module will efficiently provide translations of all current official documents from English to Urdu, including policies, press releases, economic surveys, annual reports, long-term plans, newsletters, public notices, tenders, and advertisements,” she said.\nShe emphasized the importance of the lab for the survival, growth, promotion, and development of the national language.The NLPD Programme Manager NLPD also shared details about the Speech Recognition (SR) and Optical Character Recognition (OCR) modules of the project.\nShe explained that the SR module would enable digital devices to recognize and transcribe human speech into Urdu text. “This technology will help digitize Urdu audio resources, such as parliamentary speeches and meeting minutes,” she said, adding that speech recognition technology could increase accessibility and inclusivity for those with hearing and speech impairments.\nThe OCR module, on the other hand, would convert printed text into editable digital text. “This will help digitize previously printed records and save a significant amount of time and effort compared to manual typing.”The OCR module will make the text searchable, making it easier to access and use, she said.\nThe experts believe that this technology could make Urdu text accessible to visually impaired people in the form of audiobooks. With these and other artificial information-based applications, Urdu can become more accessible and usable across different platforms.\nAdvocate Kokab Iqbal, who filed a landmark case before the apex court in 2003, has hailed the decision as a significant moment in the country’s history.\nIn 2015, a three-member bench of the apex court, headed by the then Chief Justice Jawad S Khawaja, ordered the government to implement the decision. “There is a dire need for the promotion of the Urdu language across government offices,” he remarked.",
  "retrievedAt": "2025-08-11T08:29:45.963Z"
}
