{
  "title": "Hina Khar meets foreign ministers, discusses ways to enhance ties",
  "link": "https://www.app.com.pk/national/hina-khar-meets-foreign-ministers-discusses-ways-to-enhance-ties/",
  "date_published": "2023-05-14T16:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Minister of State for Foreign Affairs Hina Rabbani Khar Sunday met foreign ministers of European Union and Indo-Pacific region in Stockholm and discussed ways to enhance their bilateral cooperation with Pakistan.\nThe meetings took place on the sidelines of European Union and Indo-Pacific Ministerial Forum 2023 held in Stockholm.\nThe minister met European Union High Representative for Foreign Affairs and Security Policy Josep Borrell. They discussed further deepening of Pakistan’s multidimensional relations with the EU. The minister said that GSP+ should continue as an important tool for sustainable development.\nShe also held discussions with Minister of State for Foreign Affairs of United Arab Emirates Noura Alkaabi.She appreciated valuable bilateral relations and historic bonds existing between Pakistan and UAE and discussed ways to enhance bilateral engagement and multilateral cooperation in various fields including trade, investment, aviation, higher education and people to people contacts.\nShe also met United States State Department Counselor Derek Chollet and discussed bilateral and regional issues and vowed to continue multifaceted bilateral dialogue including on trade, investment, energy, climate change and health.\nThe minister also held parleys with Vice Minister for Foreign Affairs of Thailand Vijavat Isarabhakdi and they exchanged views on bilateral relations including trade, investment, culture, tourism and Pakistan’s continued cooperation with ASEAN.\nHina also met Swedish Foreign Minister Tobias Billstrom. She highlighted need to enhance bilateral economic cooperation in trade, investment, renewable energy, sustainable development and information technology, especially in small and medium enterprises sectors. She also emphasised the importance of facilitating Pakistani students who wish to study in Swedish universities.\nShe also interacted with British Minister of State for Commonwealth Lord Tariq Ahmed and discussed bilateral and regional issues. They agreed to continue working together to further strengthen Pakistan-UK relations.",
  "retrievedAt": "2025-08-11T08:29:39.605Z"
}
