{
  "title": "Religious, political leaders condemn violent protests, demand action against PTI supporters",
  "link": "https://www.app.com.pk/national/religious-political-leaders-condemn-violent-protests-demand-action-against-pti-supporters/",
  "date_published": "2023-05-14T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Leaders from diverse religious and political parties united on Sunday to express their strong condemnation of the violent nationwide protests carried out by the supporters of the Pakistan Tehreek-e-Insaf (PTI) on May 9.\nDuring a press conference held here at a local hotel, Maulana Fazal ur Rehman Khalil, accompanied by other prominent leaders, denounced the actions of PTI protestors who attacked and caused damage to important state buildings.\nHe expressed his disappointment, stating that such a sight had never been witnessed before, where supporters of a political party protested against the revered Pakistan Army and targeted significant institutions.\nHe emphasized the sentiment that regardless of any political differences, the country and its army were integral to the nation’s heart, and going against these institutions was unacceptable.\nHighlighting the plight of the families of martyrs whose pictures were disrespected by PTI supporters during the protests, he called upon the nation to unite and stand in solidarity with the Pakistan Army.\nHe also expressed concern that neighboring countries, India and Afghanistan, were capitalizing on the situation, relishing the damage caused by PTI supporters to Pakistan.\nMaulana Fazal ur Rehman Khalil called for strict measures to set an example and prevent such incidents in the future.\nDrawing a parallel, he suggested that just as the Pakistan Army had conducted operations in Waziristan, action should be taken against the culprits involved in the incidents at the General Headquarters (GHQ) and Lahore Corps Commander House on the date.\nHe urged that those responsible should be brought before military courts and be duly punished.Maulana Abdul Rasheed, also speaking at the press conference, expressed the pain felt by every Pakistani and Muslim over the events of May 9.\nHe stated that in the 75 years since Pakistan’s inception, such unprecedented damage had never been witnessed.He asserted that true patriots would never cause harm to their country like the PTI supporters had done and vowed to protect the homeland at all costs.\nHe stressed the importance of preserving mosques and madrasas as integral parts of the country, declaring that enemies must not be allowed to destroy them.\nMaulana Dr. Atiq ur Rehman accused PTI leaders of protesting the recent visit of Pakistan Peoples Party (PPP) Chairman and Foreign Minister Bilawal Bhutto Zardari to India. He questioned the right of PTI, which he alleged was funded by India and Israel, to criticize Bilawal.\nHe demanded that PTI should be banned for tarnishing the country’s image on the global stage and hurting the sentiments of the Pakistan Army and the nation.\nIn a collective statement, Maulana Abdul Razzaq Haideri, Atiq ur Rehman, and Saeed ur Rasheed announced their participation in the peaceful protest and sit-in organized by the Pakistan Democratic Movement (PDM) in front of the Supreme Court on Monday.\nThey further called for action to be taken against PTI Chief Imran Khan for his role in the protests and damaging the image of top institutions.\nThe religious and political leaders also emphasized the need for an all-party conference of religious leaders and urged religious parties associated with PTI to dissociate themselves from it.\nThey implored all Ulema (religious scholars) to vehemently condemn the actions of PTI during the upcoming Friday prayers.",
  "retrievedAt": "2025-08-11T08:29:39.553Z"
}
