{
  "title": "President directs FOSPAH to probe into an alleged ICT Police workplace harassment case",
  "link": "https://www.app.com.pk/national/president-directs-fospah-to-probe-into-an-alleged-ict-police-workplace-harassment-case/",
  "date_published": "2023-05-14T07:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): President Dr Arif Alvi has directed the Federal Ombudsman for Protection against Harassment of Women at Workplace (FOSPAH) to conduct an inquiry into the matter of alleged harassment of a female employee by another employee of the Islamabad Capital Territory (ICT) Police and conclude the proceedings within 90 days.\nWhile referring the matter for inquiry, the president said that right to fair trial was the inalienable fundamental right of every citizen as enshrined in the constitution, which envisaged that not only the rights of the complainant but also the rights of the accused were to be protected, President Secretariat Press Wing said in a press release on Sunday.\nThe president observed that right to fair trial entailed that each party could be sure that the process would be transparent and the authority would refrain from abusing its powers.\nSince mistrust had been shown by the accused upon departmental inquiry committee (DIC), therefore, it was appropriate to entrust the inquiry proceedings to FOSPAH to meet the ends of justice, he added.\nThe president gave these directions while deciding upon the representations filed by the woman complainant and the accused against the order of FOSPAH to remit the case to ICT Police through IG Police Islamabad for a denovo inquiry into the matter and setting aside the order of DIC to suspend the accused and allowing him to resume his normal duties.\nAs per details, a woman employee (the complainant) of the ICT Police had filed a harassment complaint before the departmental hierarchy of the ICT Police against a male employee (the accused) alleging workplace harassment.\nThe matter was referred to DIC which recommended that the accused might be placed under suspension and charge sheet along with the statement of allegations be issued for conducting regular inquiry against him.\nThe accused filed a representation with FOSPAH which passed the order for denovo inquiry. Both the parties, then, filed separate representations with the president.\nThe president in his decision observed that the allegations of workplace harassment had yet to be probed into as the Ombudsman had directed the department to conduct regular inquiry, however, the counsel of the accused had expressed apprehension that remitting the matter again to DIC was not fair as there was a likelihood of injustice to the accused as he was a victim of departmental/administrative bias which had fabricated the complaint against him.\nThe President said that since both the complainant and the accused were dissatisfied and the accused had shown mistrust upon the Departmental Inquiry Committee (DIC) of the ICT Police, therefore, the orders of FOSPAH were being set aside in the instant case and it was directed to conduct the inquiry of its own and conclude the matter within the statutory period of 90 days.",
  "retrievedAt": "2025-08-11T08:29:44.718Z"
}
