{
  "title": "Covid decline may be giving rise to other viruses like flu, TB: Report",
  "link": "https://www.app.com.pk/national/covid-decline-may-be-giving-rise-to-other-viruses-like-flu-tb-report/",
  "date_published": "2022-06-10T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): Even as global cases of Covid-19 are on the decline, a number of other viruses such as influenza, respiratory syncytial virus, adenovirus, tuberculosis, and monkeypox are on the rise, and have also exhibited strange behaviours in recent months, according to a media report.\nHealth experts state that reduced exposure due to Covid restrictions may have\nlowered immunity to infectious diseases, making people more vulnerable to new outbreaks, CNBC reported.\nThe report noted that during Covid the diseases caused by these viruses were subdued.\nFlu during winters of 2020 and 2021 in the US was one of the mildest on record both in terms of deaths and hospitalisation. But as Covid abated and restrictions were removed, the virus-led diseases began ticking upward beginning February and extending well into summers.\n“We’ve never seen a flu season in the US extend into June,” Dr. Scott Roberts, associate medical director for infection prevention at Yale New Haven Hospital, was quoted as saying.\n“Covid has clearly had a very big impact on that. Now that people have unmasked, places are opening up, we’re seeing viruses behave in very odd ways that they weren’t before,” he added.\nRespiratory syncytial virus, a cold-like virus common during winter months, exhibited an uptick last summer, with cases surging among children in Europe, the US and Japan.\nAdenovirus 41, usually responsible for gastrointestinal illness, is suspected to be the reason behind acute hepatitis among young children – infecting about 700 children in 34 countries and claiming 10 lives. Further, Washington state in the US has seen the worst flare-up of tuberculosis in 20 years, the report said.\nAnother is the monkeypox outbreak that has over 1,000 confirmed and suspected cases emerging in 29 non-endemic countries.\nAt least two genetically distinct variants of the rare viral infection typically found in Central and West Africa, has been detected in the US, likely stemming from two different spillover infections from animals to humans,\nThe World Health Organisation noted earlier last week that the virus, whose symptoms include fever and skin lesions, may have been going undetected in society for “months or possibly a couple of years”.\nDNA sequencing of the monkeypox virus by researchers at the University of Edinburgh in the UK showed that the virus has been circulating since 2017.\nBesides Covid-induced restrictions and mask-wearing over the past two years, the viruses were also missed as public health surveillance that were largely focused on curbing pandemic, the experts said.",
  "retrievedAt": "2025-08-11T15:03:51.823Z"
}
