{
  "title": "Pakistan reminds int’l community to hold India accountable for human rights violations in IIOJK",
  "link": "https://www.app.com.pk/national/pakistan-reminds-intl-community-to-hold-india-accountable-for-human-rights-violations-in-iiojk/",
  "date_published": "2022-06-10T18:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): Pakistan Friday reminded the international community of its obligations and reiterated its call to hold India accountable for its gross and systematic violations of human rights in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAddressing the weekly press briefing here, he said, Pakistan had rejected and strongly condemned the highly derogatory remarks by two senior officials of India’s ruling BJP party, that were disrespectful towards Holy Prophet Muhammad (Peace Be Upon Him) and had hurt the sentiments of Muslims all over the world.\nThe Indian Charge d’ Affaires was summoned to the Ministry of Foreign Affairs on June 6 and conveyed the government of Pakistan’s categorical rejection and strong condemnation of the totally unacceptable remarks, he told.\nHe said Prime Minister Shehbaz Sharif and Foreign Minister Bilawal Bhutto Zardari also condemned the dangerous and hurtful comments emanating from the irresponsible leaders of India’s ruling party.\nForeign Secretary Sohail Mahmood individually met the Envoys of P-5 countries; and also held a meeting with the OIC ambassadors in Islamabad to apprise them of the matter and register Pakistan’s strong concern at the sharp increase in Islamophobia and targeting of Muslims in India.\nHe said Pakistan had underscored that BJP’s perfunctory and token disciplinary action against those individuals was not sufficient to assuage the pain and anguish they had caused to Muslims worldwide. “Nor would any attempt to whitewash rising Hindutva nationalism in mainstream society by calling the BJP Spokesperson a fringe element be of any avail.”\n“If India has any moral courage or democratic ethos, the BJP top leadership and the Indian government must clearly condemn the actions of the responsible BJP officials and hold them to account through decisive and demonstrable action. That may be a big ask in today’s saffronized India, but this is the least that is being expected of them.”\nTo a question, he said Pakistan’s position on the reform of the UN Security Council was clear, consistent and unambiguous.\n“Together with its other partners in the Uniting for Consensus (UfC) Group, Pakistan is opposed, in principle, to any expansion in the permanent membership of the Security Council. There is no change whatsoever in that policy.”\nHe said Pakistan supported a comprehensive reform of the Security Council that would make the Council more democratic, more representative, more transparent, effective, and more accountable to the wider membership of the United Nations.\n“We support a reformed Council that corresponds to the interests of the large majority of member states and not just a few. Expansion in the permanent category of membership does not conform to these principles of reform.”\n“We believe that expansion in the non-permanent category with periodic elections and rotation is the best way of achieving a more representative and accountable Security Council in line with contemporary democratic ideals,” the Spokesperson added.\nTo another question, he said Pakistan was strongly committed to the respect for human rights which were universal in nature.\n“Over the years, a number of steps have been taken and there is a continued progression and improvement with regard to our international and national obligations also in accordance with our Constitution with regard to the rights of all our citizens,” he added.",
  "retrievedAt": "2025-08-11T15:03:51.817Z"
}
