{
  "title": "Rs 550 million allocate for National Haritage & Culture Division under PSDP",
  "link": "https://www.app.com.pk/national/rs-550-million-allocate-for-national-haritage-culture-division-under-psdp/",
  "date_published": "2022-06-10T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): The government has allocated Rs 550 million for National Heritage & Culture Division under Public Sector Development Programme (PSDP).\nAccording to the details here on Friday, Rs 15.400 had been earmarked for nine new projects for Conservation Preservation of Allama Iqbal’s Residence Situated at 116- Mecleod Road Lahore.\nRs 30.000 million proposed to set aside for Establishment of Reserch & Development (R&D) Centre at Development of Archaeology and Museum to promote soft image.\nIn addition, Rs 14.284 has been allocated for Master Plan for Conservation, Preservation and Development of Shah Allah Dita Caves in ICT.\nAn amount, Rs 25 .000 has been earmarked for PSDP project Master Plan for Conversation, Restoration and Development of Mai Qamro and Muqarab Khan Tomb in ICT .\nRs13.990 has been allocated for the project of PC -II for Conversation, Preservation, Restoration and Development of Pharwala for DOAM, Islamabad.\nAn amount of Rs 50.000 has been allocated for the project of\nConstruction of Pakistan Academy of Letters , Regional Offices , Hyderabad , Gilbert &Turbat.\nAn amount of Rs 50.00 million earmarked for Establishment of National -Centre performing Art/Folk Music & Qawali National Theatre , Islamabad.\nRs 100.00 million Rs has been allocated for Establishment of PNCA Centre for Performing Arts Peshawar,Quetta, Gilgit -Biltistan & Muzaffarabad (AJK).\nRs 150.000 million has been allocated for National Museum and Library Complex Islamabad ( PC-II).\nThe government has allocated a total Rs 101.326 million for ongoing PSDP projects in which an amount of Rs 5.500 million for building Up -Gradtion of National Liberay of Pakistan , Islamabad.\nAround Rs : 37.000 has been allocated for ongoing PSDP schemes.\nRs 37.000 million has been allocated for Establishment of National Language Processing Laboratory ( NLPD), Islamabad.\nRs 7.830 has been allocated for Mapping of Historical and religious Sites in Pakistan, Islamabad.\nAround Rs 15.000 has allocated for the PSDP project of PC -II for design and feasibility study for up-graduation and revamping of National Museum of Pakistan Islamabad.\nRs 25.000 million has been earmarked for Preservation, Restoration Presentation of Rawat Fort , Islamabad ( Reviesd).\nAn amount of Rs 10.996 million allocated for the PSDP protect of Up -Gradtion of Film Projection, Lights and Sound Equipment Installed at PNCA Auditorium Islamabad.",
  "retrievedAt": "2025-08-11T15:04:01.087Z"
}
