{
  "title": "Govt sets up Rs1 bn Binding Film Finance Fund, introduces artists’ medical insurance, tax breaks for film industry: Marriyum",
  "link": "https://www.app.com.pk/national/govt-sets-up-rs1-bn-binding-film-finance-fund-introduces-artists-medical-insurance-tax-breaks-for-film-industry-marriyum/",
  "date_published": "2022-06-10T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): The government has set up a “Binding Film Finance Fund” at a cost of Rs 1 billion per annum and introduced a “medical insurance policy” for artists in addition to major tax exemptions in the Budget 2022-23 to boost Pakistan’s film industry and other associated sectors like tourism.\nFederal Minister Information and Broadcasting Marriyum Aurangzeb, in a statement, said that in addition to this five years tax holiday for film makers, five years income tax on establishment of new cinemas, production houses, film museums and tax rebate on export of film and drama for ten years was also given in the budget.\nAlso, incomes of cinemas and producers have been exempted from income tax for the same duration.\nShe said apart from National Film Institute and Post Film Production Facility, a National Film Studio was being set up at a cost of Rs1 billion. Cinemas, production houses, film museums, post production facilities were being given the status of CSR.\nRebates would also be given to foreign filmmakers on joint film and drama projects locally, she said.\nHowever, she added that for this to take effect, the condition of shooting 70 percent of the film in Pakistan would be applicable to them so that business activities including tourism and culture flourish, while employment, youth skills were also promoted through marketing of different areas.\nMarriyum said the 8 percent withholding tax on distributors and producers was also being abolished under the 2022-23 Budget. There would be a five-year exemption from customs duty on the import of machinery, equipment and supplies for films and dramas.\nWith the Finance Bill 2022, Customs Act 1969, Finance Bill 2018 has been amended to completely exempt importing equipment for new films and dramas from sales tax and entertainment duty.\nMarriyum said these measures would revive the country’s film industry while restoring Pakistan’s disconnected communication with the world. Young people would have the opportunity to work in the film industry and new talent would be encouraged.\nShe said the promotion of film and culture, heritage, drama and fine arts was essential to increase tourism, social diversity, and improve Pakistan’s culture and identity globally. In 2018, the first ‘Film and Culture Policy’ in the history of the country was approved by the Cabinet in PML-N’s era.\nHowever, unfortunately for the last four years it was not implemented and was not able to move forward. The film has now been given industry status by implementing the 2018 Film Culture Policy, she said.\nMarriyum was grateful to Prime Minister Shehbaz Sharif and Finance Minister Miftah Ismail for understanding the importance of film and culture in national progress and development. She also extended gratitude for approving historic incentives and relief measures for Pakistan’s film industry in Budget 2022-23.",
  "retrievedAt": "2025-08-11T15:03:55.807Z"
}
