{
  "title": "All political parties in Senate record protest against blasphemous statement of BJP spokesperson",
  "link": "https://www.app.com.pk/national/all-political-parties-in-senate-record-protest-against-blasphemous-statement-of-bjp-spokesperson/",
  "date_published": "2022-06-10T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): Chairman Senate Muhammad Sadiq Sanjrani along with members of the Senate belonging to all political parties in the Senate recorded protest in front of the Indian High Commission in Islamabad against blasphemous statement of BJP spokesperson Nupur Sharma.\nSadiq Sanjrani said that all Muslims are ready to sacrifice everything for the sake of the Holy Prophet (PBUH), said a press release issued here on Friday.\nHe said that such sacrilegious remarks are not acceptable and should be condemned in strongest possible terms.\nSadiq Sanjrani said Nupur Sharma’s statement has not only hurt the Muslim Ummah but has also exposed the ugly face of Indian government to the world.\nThe blasphemous statement of the spokesperson has been strongly condemned by both the houses and the people of Pakistan expressing their deep grief and anger, he added.\nHe said that millions of Muslims in the Islamic world are ready to sacrifice their lives and property for the sake of the Holy Prophet (PBUH).\nLeader of the Opposition in Senate, Dr. Shahzad Waseem and other senators in their speeches strongly condemned the blasphemous statement.\nSenator Keshoo Bai and Danesh Kumar said that no religion allows such disrespect of any other religion.\nThey said minorities in Pakistan enjoy complete religious freedom and have never been subjected to religious harassment by Muslims.\nIn Pakistan, people of all religions perform their religious rites with complete freedom, they added.\nDeputy Chairman Senate Mirza Muhammad Afridi, Leader of Opposition Dr. Shahzad Waseem, Moulana Abdul Ghafoor Haideri, Azam Swati, Fowzia Arshad, Seemee Ezdi, Abdul Qadir and others were also accompanying Chairman Senate.",
  "retrievedAt": "2025-08-11T15:04:00.279Z"
}
