{
  "title": "Pakistan needs to harness emerging technologies for strengthening national security: experts",
  "link": "https://www.app.com.pk/national/pakistan-needs-to-harness-emerging-technologies-for-strengthening-national-security-experts/",
  "date_published": "2022-06-09T20:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):The experts at a seminar on ‘Disruptive Technologies – Impact on Future Warfare’&nbsp; said Pakistan needed to harness emerging technologies for strengthening national security and sovereignty and remain part of the debate to ensure control of mankind on these scientific advancements.\nThis was the key message of former senior military officers and eminent intellectuals at the seminar on ‘Disruptive Technologies – Impact on Future Warfare’ organised by the Centre for Aerospace & Security Studies (CASS).\nFormer Chairman Joint Chiefs of Staff Committee General (R) Zubair Mehmood Hayat was the Keynote Speaker,while other eminent speakers included Associate Professor, National University of Modern Languages (NUML) Dr Rizwana Karim Abbasi, Acting Dean, Faculty of Aerospace and Strategic Studies (FASS), Air University Dr Adil Sultan, and Former Vice Chancellor, Air University Air Vice Marshal (R) Faaiz Amir.\nThe seminar was chaired by President CASS Air Marshal (R) Farhat Hussain Khan, while Advisor to Chief of the Air Staff on CASS Affairs Air Marshal (R) M Ashfaque Arain moderated the proceedings where an introductory of CASS was also presented before the participants highlighting the key areas of research and study focused by CASS.\nIn his opening remarks Air Marshal (R) Ashfaque Arain Opening Remarks,highlighted that new technologies offered enormous opportunities for civilian as well as defence sectors, but also presented new vulnerabilities and security challenges.\nWhile analysing the role of state actors and non-state actors, he cautioned that the latter had greater prospects of exploiting many of the easily accessible technologies in inventive and disruptive ways.\nThey also provided opportunities to smaller states to offset military asymmetry. He further noted that in the endeavour to stay ahead, rapid technological advancements had resulted in increasingly intense technological competition and rivalry between states.\nLooking at the impact of these changes on Pakistan, he urged that it was important to stay abreast of such technological advancements and how they would affect military doctrines and strategy in the future. This was especially important in case of nuclear-armed adversaries with unresolved disputes, mutual distrust, and shared borders, significantly reducing reaction time, he said.\nIn his Keynote Address, General (R) Zubair Mehmood Hayat outlined how disruptive technologies had now become a new toolkit in the hands of policymakers and in his assessment, their greatest impact would be in the political domain as they would disturb the existing balance of power. He explained that such technologies would not only impact the military but also the economy significantly.\nOn the military side, all three traditional domains would be impacted to the extent that the character of the war was likely to be changed fundamentally, the General said.\nHe warned how Artificial Intelligence, if left unbridled, could threaten the very existence of mankind. General Hayat recommended that as a nation, Pakistan needed to be part of the debate and process to ensure human control over these technologies. ‘Disruptive technology is likely to create technical apartheids.We, therefore, need to harness it as a catalyst of change to strengthen our national security and national sovereignty,’ he concluded.\nDr Rizwana Karim Abbasi underlined that disruptive technologies could erode the foundation of ‘Deterrence Theory’, thereby undermining nuclear strategic stability through its effect on nuclear second-strike capability, including C4ISR and force postures.\nIn her assessment, new technologies could contribute to accidental or inadvertent nuclear escalation by threatening dual use of C2 assets in space and cyber space by squeezing the reaction time of decision makers.\nWhile analysing the defence and security dimensions of specific disruptive technologies, Air Vice Marshal (R) Faaiz Amir highlighted that extensive use of space,using satellites, had become crucial to modern warfare and ‘no nation should expect to win a battle without support from space.’\nHowever, when it comes to the use of drones, he remarked that while they were part of the evolution of air power, their current generation remained vulnerable to electronic warfare and air defence systems and therefore,were unlikely to shift the operational balance towards the offensive side.\nThe speaker cautioned that cyber warfare could emerge as a greater threat to Pakistan, both in peace and war due to the Indian advantage which resides in heraccessto American, Israeli and Russian equipment and technologies.\nDr Adil Sultan was of the view that there was a tendency to oversell new inventions and their potential to change the character of warfare. However, he also pointed out that some disruptive technologies could be employed for non-kinetic warfare and provide additional incentive for states to engage in limited warfare without risking a major escalation.\nIn his vote of thanks and concluding remarks, Air Marshal (R) Farhat Hussain Khan thanked the speakers for their in-depth analysis of emerging technologies, especially their impact on Pakistan’s national security, defence and development.\nHe shared that air power, with the integration of disruptive technologies, had now become an instrument available to political-military leadership, especially for adversarial countries, to achieve their politico-military objectives with speed. President CASS recommended that in order to catch up with the rest of the world in the technological domain, Pakistan needed to strengthen and enhance Public-Private Partnerships in this area as well as build industry-academia linkages.",
  "retrievedAt": "2025-08-11T15:04:08.396Z"
}
