{
  "title": "Pro-poor, people-friendly budget to change economic landscape: Marriyum",
  "link": "https://www.app.com.pk/national/pro-poor-people-friendly-budget-to-change-economic-landscape-marriyum/",
  "date_published": "2022-06-10T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb Friday said, pro-poor and people-friendly budget for the fiscal year 2022-23 would change economic landscape by stabilizing the national economy.\n“This budget will lead the country towards economic stability, help provide relief to the people especially the poor, and promote industry, trade and commerce in the country,” Marriyum said while addressing protesting government employees here.\nGone were the days when the prime minister of country did not pay heed to the problems of government employees, she said, adding Pakistan was going through a difficult situation today due to the incompetence, inefficiency, theft and corruption of Imran’s regime.\nThe minister said Prime Minister Shehbaz Sharif had directed for 15 per cent increase in salaries of the government employees, besides merger of adhoc relief in the basic pay.\nThere would be a big announcement for pensioners in the budget today, she added.\nToday, when the Finance Ministry proposed a 10 per cent increase in the salaries of government employees, the Prime Minister rejected it and approved 15 per cent increase in salaries of government employees during the meeting of Federal Cabinet.\nDue to the incompetence of a gang which ruled the country for four years, the poor people were facing extreme inflation, poverty and unemployment.\nNow, the country was being ruled by the coalition government which not only had representation of all the political parties, but also the vision which would ensure welfare of poor people and the middle class, she maintained.\nThe minister said despite the difficult circumstances, the budget would not only provide relief to the masses, but also boost the industry, trade, commerce, and agriculture sector in the country.\nHistoric announcements would also be made for agriculture, IT, industry, food security and youth in the budget, she added.\nShe vowed that the government would continue to provide relief to the poor people and government employees in the current and future budgets.\nDespite the strict conditions of the IMF, she said the government and the Prime Minister were thinking of the poor and low-income people.\nThe minister said when Imran Khan was given power in 2018, the national economy was stable but he ruined it.\nThe government wanted to save the poor people from inflation and unemployment caused by the bad policies of the PTI regime.\nThe government employees present in the rally chanted slogans in favour of the present government, Prime Minister Shehbaz Sharif and Federal Minister for Information.",
  "retrievedAt": "2025-08-11T15:04:02.537Z"
}
