{
  "title": "Progressive measures afoot to expand tax net for high revenues: Miftah",
  "link": "https://www.app.com.pk/national/progressive-measures-afoot-to-expand-tax-net-for-high-revenues-miftah-2/",
  "date_published": "2022-06-10T16:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):Minister for Finance and Revenue Miftah Ismail on Friday said the coalition government intended to encourage and promote progressive taxation system by bringing the potential persons and wealthy into the tax net rather than burdening the existing tax payers in order to enhance revenue and increase spending on uplifting the social sector.\nPresenting the Federal Budget 2022-23 in the National Assembly, the minister said main component of the taxation policy for next fiscal year was to increase reliance on direct taxes, including income tax and capital value-added tax and taxing the non-productive assets.\nHe said there was lack of suitable investment conditions as the existing taxation system was also not fully supportive for entrepreneurship, rather it discouraged the investment.\nThe system, he said, facilitated investment in the real estate sector, which was not an encouraging sign for economic growth as it created hurdles in major sectors’ development.This trend, he added, increased the prices of real estate manifold, rendering the construction of residential units out of the reach of the middle income people.\nMiftah said the gains made through non-productive investment was one of the major reasons of rising inflation and social unrest, and the government was determined to streamline the real estate to make it an engine of growth.\nHe said the government was committed to create a business friendly environment by simplifying the taxation system and bringing structural reforms.\nThe minister said the government was aware of the hardships being faced by the common man, and that was why it introduced some relief measures particularly for the common man.\nFor the salaried class, it proposed some tax relief measures, including increasing the tax exemption limit from Rs 0.6 million to Rs 1.2 million, he added. This initiative, he said, would help address the economic problems of fixed income group, besides promoting trade opportunities.\nMiftah Ismail said it would also help enhance disposable income as well as revenue collection, which would have a positive impact on economic development and growth.\nHe said the government also proposed tax relief measures for business associations and association of persons, including enhancing tax exemption from Rs 400,000 to Rs 600,000.\nHe said the tax on the income of welfare certificates, including saving certificates and pensioners benefit accounts, was reduced from 10% to 5%.\nThe minister said the government also proposed fixed income and sales tax for small retailers, based on their electricity bills. It would make the registration and reporting system easy for the purpose.\nThe tax amount would range from Rs 3,000 to Rs 10,000 as being the final settlement, and the Federal Board of Revenue would not inquire about it, he added.\nHe said the industrial units and other businesses were allowed to adjust 50% of initial depreciation, which was an additional burden for them. The government proposed initial depreciation by 100% during the first year that would help promote industrialization in the country and help to absorb increasing manpower, he added.\nThe minister said in order bring the wealthy and rich people under the tax net to reduce the tax burden on the under-privileged class, the government also proposed to enhance advanced income tax on motor vehicles of upto 1600 cc. About 2% tax would be charged on electric vehicles, while 100% increase was proposed in the tax rate for non-filers.\nHe said as the banking sector witnessed growth due to increase in the interest rates and the safe mode of investment, the government proposed to enhance tax ratio on banking companies from 39% to 42%.\nThe minister said the government was determined to document the national economy and introduced some measures in that respect, aimed at ensuring full tax compliance culture.Amendments were being introduced in the tax law pertaining to resident person.\nHe said the government also proposed 2% advanced income withholding tax on the money being sent abroad through credit cards, debt and pre-paid cards, however it would be adjustable against the payable tax.\nThe indirect tax collection, he added, had a positive impact on the FBR’s overall revenue collection. The government was also determined to provide relief to common man, he added.\nThe minister Pakistan was facing acute energy shortages, whereas the fuel prices were touching new peaks. The government was taking measures to use renewable energy resources, he added.\nHe said the government proposed to exempt the local and imported solar panels form the sales tax. The consumers using less than 200 units would be provided loan facility by the local banks with repayment in easy installments.\nHe said the government also decided to withdraw sales tax on agriculture inputs and farm machinery. including tractors, maize, canola and sunflower seeds. The rice seeds were exempted from the sales tax.\nIn order to promote health care facilities, he said, the government proposed to provide exemption on all facilities of hospitals, having the capacity of 50 beds, including electricity and other supplies.\nThe minister said the government also proposed some structural changes in alternate dispute resolution mechanism, according to which Rs100 million or above demand could be benefit from ADRC.\nHe said the government also proposed to withdraw custom duty on farm mechanization and logistics in order to provide relief to the farming communities.\nHe said there were about 400 tariff headings and for promoting the industrial growth in country and development of industrial sector, all additional custom and regulatory duties were being rationalized.\nFor the promotion of textile sector in the country, the tariff structure of artificial yarn had also been rationalized, he added.",
  "retrievedAt": "2025-08-11T15:03:54.599Z"
}
