{
  "article_id": "2025-02-27_dc7c02903a3a66bb461bbfe7f6e47e57",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ist-education-ministry-launch-disruptive-education-project-to-empower-youth-with-emerging-tech-skills/",
    "retrieved_at": "2025-08-27T13:12:38.824Z"
  },
  "metadata": {
    "title": "IST, Education Ministry launch ‘Disruptive Education’ Project to empower youth with emerging tech skills",
    "author": null,
    "date_published": "2025-02-27T08:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 208,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 27 (APP):The Institute of Space Technology (IST) in collaboration with LearnOBots has launched the transformative project titled \"Disruptive Education-Creating Foundries of Emerging Tech\" to empower Pakistan's youth with 21st-century skills. The project, funded by the Ministry of Federal Education & Professional Training, aims to revolutionize the education system by equipping students with hands-on training in Artificial Intelligence (AI), Machine Learning, Robotics, STEAM (Science, Technology, Engineering, Arts, and Mathematics), Space Technology, Entrepreneurship, and other emerging technologies. As part of this initiative, 150 Tech Fellows will be recruited and given specialized training by IST and LearnOBots. These fellows will then be placed in federal government schools to educate and inspire over 22,000 students across Pakistan, preparing them to thrive in the global tech landscape. Highlighting the importance of the project, an IST official said, \"This initiative is a significant step towards bridging the technological skills gap and fostering a new generation of innovators who will lead Pakistan's tech industry on the global stage.\" IST has been actively engaged in empowering young minds through workshops, training programs, and summer schools, making it a frontrunner in promoting emerging technologies among students. For this project, IST has also initiated a process of recruiting Tech Fellows with expertise in technology and education.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}