{
  "article_id": "2025-02-27_f4faa2ac65d5b99d7cf031debf1d1350",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sau-and-nets-international-sign-mou-for-academic-and-technological-collaboration/",
    "retrieved_at": "2025-08-27T13:12:13.733Z"
  },
  "metadata": {
    "title": "SAU and NETS International Sign MoU for academic and technological collaboration",
    "author": null,
    "date_published": "2025-02-27T09:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "HYDERABAD, Feb 27 (APP):The Sindh Agriculture University (SAU), Tandojam and NETS International Communication (Private) Limited, Islamabad have signed a one-year memorandum of understanding (MoU) to foster collaboration in education, research and professional development. The agreement aims to enhance academic excellence, facilitate technological advancements and provide students with industry exposure. According to the SAU spokesperson, the MoU was formally signed by Prof. Dr. Altaf Ali Siyal, Vice Chancellor, Sindh Agriculture University and Engr. Muhammad Nadeem, Chief Executive Officer of NETS International. The signing ceremony was attended by Dr. Aijaz Ali Khooharo, Dean, Faculty of Social Sciences, Dr. Mir Sajjad Talpur, Director, Information Technology Centre, Dr. Muhammad Ismail Kumbhar, Director, University Advancement & Financial Assistance, Dr. Aasia Akbar Panhwar and other faculty members. Both institutions will undertake joint initiatives in technology and information technology including specialized training programs, capacity-building initiatives, internship opportunities, joint research projects and knowledge exchange programs. NETS International will facilitate internships for students of the Information Technology Centre at SAU, providing them with industry experience and enhancing their practical skills. Speaking on the occasion, Vice Chancellor Prof. Siyal emphasized that the partnership would play an important role in bridging academia and industry, fostering innovation and equipping students with latest technological expertise. He further stated that joint research projects would contribute to improving academic standards and addressing real-world industry challenges. Engr. Muhammad Nadeem, CEO of NETS International highlighted the importance of technological training and market-oriented education in shaping the future workforce. He reaffirmed NETS International's commitment to offering students access to cutting-edge technology, research opportunities and hands-on learning experiences. He added that this collaboration would not only enhance students' professional competencies but also contribute to the socio-economic development of the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}