{
  "title": "Jail bosses defying court orders on visits to Imran: PTI - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Shibli files contempt plea against prison officials; laments lawyers, relatives, allies barred from meeting ex-PM\n• Denies PTI engagement with establishment\n\nISLAMABAD: Leader of Opposition in the Senate Syed Shibli Faraz on Thursday filed a contempt petition in the Islamabad High Court (IHC) against the Adiala Jail authorities, accusing them of defying court orders that grant visitation rights to PTI founder Imran Khan.\n\nThe petition alleges systemic obstruction by the jail authorities, despite repeated judicial directives and formal undertakings.\n\nThe petition, filed under Article 204 of the constitution and the Contempt of Court Ordinance 2003 by PTI counsel Mohammad Shoaib Shaheen, cited the Secretary of the Interior, the Punjab Home Secretary, and the Superintendent of Adiala Jail as respondents.\n\nIt claims that Imran Khan’s lawyers, fa­­mily members, and political allies have been repeatedly barred from meeting him, even on court-mandated visitation days.\n\nIt recalls that the IHC had previously issued multiple orders — most recently on March 24, 2025 — directing the jail authorities to adhere to a structured visitation schedule. The schedule included allowing six non-lawyer visitors daily while exempting legal consultations from quota limits.\n\nHowever, the petitioner asserts, the officials ignored these directives with PTI leaders like Omar Ayub Khan and Shibli Faraz allegedly detained for hours outside the jail before being turned away.\n\nThe petition referred to earlier contempt cases where the jail superintendent and Punjab officials had apologised and pledged compliance. Despite this, the petition states that “no meetings have been permitted for the last five months, calling the acts wilful disobedience” of court orders.\n\nOn March 25 and 27, senior PTI leaders and lawyers, including Shibli Faraz and Hamid Khan, were denied entry to Adiala Jail. Imran Khan’s sisters were blocked from visiting him on a scheduled family day (March 25). Only one visitor, Azam Khan Swati, was permitted on April 1, despite a submitted list of six names.\n\nThe petition emphasises that contempt charges do not require prior notice to violators, only proof of order violations. It accuses the respondents of “ridiculing the authority of the court” and seeks criminal proceedings against them.\n\n‘Direct attack’\n\nTalking to media persons at the IHC, Senator Faraz criticised the lack of imp­lementation of judicial decisions, calling it a direct attack on the rule of law.\n\nHe lamented that PTI leaders had been appearing before courts for the last three years in what he described as politically motivated cases. He refer­red to a recent decision by a three-member IHC bench, which had permitted PTI members to meet Imran Khan. However, he regretted, they were de­­nied the opportunity, terming it “contempt of court”.\n\n“If judicial decisions are not respected, then this country will become a monarchy,” he warned, adding that failure to implement court rulings raises serious concerns about the state of law and governance in Pakistan. He further questioned, “When even Supreme Court decisions are ignored, how can the people believe that they live in a country governed by a Constitution?”\n\nThe opposition leader dismissed speculation about PTI’s engagement with the establishment, stating he had only read such reports in the media and had no firsthand knowledge of any such discussions.\n\nAbout the state of judiciary, he expres­sed disappointment, saying if a decision by a three-member bench could be disregarded by a prison superintendent, then the judiciary had been rendered ineffective.\n\n“Courts have become powerless. If they are not impartial and do not act in the fear of God…, then this country will revert to a jungle where only the law of the jungle prevails,” he said.\n\nDiscussing the broader political climate, Mr Faraz criticised the “political suffocation” in the country, claiming that business activities had stalled and the courts had been neutralised. He vowed that PTI, as Pakistan’s largest political party, would continue its political activities despite restrictions.\n\nHe also voiced concerns about the situation in Balochistan, alleging that the province was being mishandled. “The people of Balochistan should be involved in decision-making rather than outsiders interfering in their politics,” he suggested.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:59:09.159Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901942/jail-bosses-defying-court-orders-on-visits-to-imran-pti",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:10.000Z"
}
