{
  "title": "Trump purged security team after meeting ‘conspiracist’: NYT - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Donald Trump fired several US national security officials after a far-right conspiracy theorist questioned their loyalty in a White House meeting with the president, media reported on Thursday.\n\nInfluencer Laura Loomer, who is known for claiming that the 9/11 attacks were an inside job, laid out her concerns to Trump on Wednesday, the New York Times said in a report followed up by other outlets.\n\nThe reported purge comes as the National Security Council (NSC) faces scrutiny over a scandal in which a journalist was accidentally added to a chat on the Signal app in which officials discussed air strikes on Yemen.\n\nSix people from the NSC were sacked after the Loomer meeting, including three senior officials on the body which advises the president on top foreign policy matters from Ukraine to Gaza, the New York Times said.\n\nLoomer confirmed the meeting, but said on X that “out of respect for President Trump and the privacy of the Oval Office, I’m going to decline on divulging any details”. The activist later said she had presented “opposition research” to the Republican president.\n\nSpokesman Brian Hughes said the council “doesn’t comment on personnel matters”.\n\nThe 31-year-old Loomer often flew with Trump on his campaign plane during last year’s election.\n\nShe sparked accusations of racism when she said on social media that Donald Trump’s Democratic rival Kamala Harris, whose mother was of Indian descent, would make the White House “smell like curry” if she won.\n\nIn recent days Loomer has repeatedly targeted national security official Alex Wong, who was reportedly not among those sacked, over the “Signalgate” scandal that has rocked the White House. She baselessly suggested that he was responsible for accidentally adding Atlantic magazine journalist Jeffrey Goldberg to the chat, even though National Security Adviser Mike Waltz has taken responsibility for the error.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:21:24.257Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901927/trump-purged-security-team-after-meeting-conspiracist-nyt",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:29.000Z"
}
