{
  "title": "MQM will try to convince PM Shehbaz to further lower power rates: Farooq Sattar - Pakistan - DAWN.COM",
  "author": null,
  "content": "MQM-P leader Dr Farooq Sattar on Friday said that his party will try to convince Prime Minister Shehbaz Sharif to further reduce power rates as there is still space to make this possible.\n\nPM Shehbaz on Thursday had announced a Rs7.41 per unit cut in power rates across the country in a “major” relief package to reduce the burden on citizens facing exorbitant electricity bills.\n\nSpeaking at an event especially organised to announce the tariff cut, the prime minister said an “Eid gift” of Rs7.41 per unit reduction in the national average tariff and Rs7.69 per unit cut in industrial rates was the first humble relief to the consumers braving agonising energy costs.\n\nSpeaking at a press conference in Karachi, Sattar said that they will be successful in convincing the prime minister to reduce electricity prices further by Rs6 per unit.\n\nSattar further said PM Shehbaz had agreed to visit Karachi after Eid and attend an MQM public gathering.\n\n“He [PM Shehbaz] will address the MQM public gathering and we will further strengthen the argument that electricity prices can be further cut down.”\n\nHe added that they have given their arguments in favour of reducing prices, saying that this was indirect taxation and that the citizens should be given the opportunity to increase their incomes and taxed accordingly to work towards a growth-based economy.\n\nSpeaking about the reduction in power rates announced by PM Shehbaz, he said: “MQM played an integral role in this reduction, and it was us who helped the government engage the independent power producers (IPPs) [o renegotiate agreements],”\n\nWhen asked regarding Jamaat-i-Islami chief Hafiz Naeemur Rehman claiming credit for the reduction in power prices, he remarked with an Urdu saying that, “this is akin to someone else claiming credit for a development unrelated to them.”\n\nOn Thursday, the prime minister had said that the International Monetary Fund (IMF) had refused to allow diversion of financial impact of lower international oil prices last month towards reducing electricity rates and he himself des­ired to take up the matter with the IMF managing director as it did not involve any subsidy but simply not passing on reduction in international oil prices.\n\n“It was not easy to convince the IMF. The impasse finally ended and they allowed us to reduce power rate like a favour,” the premier said, adding that the matter required to be handled with self-restraint, as the IMF programme was a trust of the nation that had been breached in the past and needed to be rebuilt.\n\nThe per-unit tariff reduction announced by the prime minister includes a cut of about Rs1.90 on account of lower quarterly tariff adjustments (QTA) for the second quarter (October-December) of FY25, Rs1.71 against Rs10 per litre increase in petroleum levy on petrol and diesel, over Re1 from a Rs791 per unit grid levy on industrial captive power plants, and about Rs3 on account of terminations and revisions in contracts of IPPs and government power plants.\n\nBusiness owners have also welcomed the prime minister’s decision to reduce the power tariff, saying that it will “release financial pressure on consumers struggling with their electricity bills”.\n\nM Abdul Aleem, Secretary General of the Overseas Investors Chamber of Commerce and Industry (OICCI), said “this is a good move despite rigid IMF conditionalities and limited fiscal space available to the government”.\n\nJI chief Hafiz Naeemur Rehman, speaking separately said that the petroleum and power rates needed to be reduced further.\n\n“Although we welcome this reduction, we believe that the prices can be reduced further and this is the start of the process not the end,” he said, adding that although international petroleum prices had reduced, that relief has not been transferred to domestic consumers.\n\nHe also criticised IPP owners for not paying their taxes, saying, “They have earned thousands of billions.”\n\nThe JI chief further maintained that the records show that the IPP owners have been given tax exemptions worth billions.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/041251274c47ea8.jpg",
  "retrievedAt": "2025-08-25T13:58:27.845Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902038/mqm-will-try-to-convince-pm-shehbaz-to-further-lower-power-rates-farooq-sattar",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T08:35:10.000Z"
}
