{
  "title": "Russian official in US for talks on improving ties - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Russia’s top economic negotiator announced on Thursday that he was in Washington for talks on improving ties, the highest-level visit by a Kremlin official to the United States since Russia invaded Ukraine.\n\nKirill Dmitriev, the head of Russia’s sovereign wealth fund, said he was “holding meetings in Washington with representatives of President Donald Trump’s administration”, without elaborating.\n\nUS media reported that Dmitriev arrived on Wednesday and was expected to meet with Trump envoy Steve Witkoff at the White House, though his itinerary has not been made public. The talks come as Trump pushes for warmer ties with Moscow, reaching out to President Vladimir Putin and holding direct talks with Russian officials in the hope of brokering a ceasefire in the three-year Ukraine war.\n\n“The dialogue between Russia and the United States, which is crucial for the entire world, was completely destroyed under the Biden administration,” Dmitriev wrote on Telegram, announcing the visit.\n\n“Restoring dialogue is not an easy process, and it’s gradual. But every meeting, every frank conversation allows us to move forward,” he added. The Kremlin did not give details on Dmitriev’s visit, saying only that he was working within “his mandate”.\n\nDmitriev was recently appointed Putin’s special envoy on economic cooperation with foreign countries. The official praised Trump’s global tariff salvo in an X post later on Thursday, saying the US had set “a precedent for self-reliant growth and sustainable job creation” and that it reflected a shift towards economic sovereignty.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:20:50.871Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901931/russian-official-in-us-for-talks-on-improving-ties",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:29.000Z"
}
