{
  "title": "After tariff shock, Trump may weaponise finance against allies - Business - DAWN.COM",
  "author": null,
  "content": "With the ink still fresh on US President Donald Trump’s latest batch of tariffs, some are already bracing for what may come next in his effort to strong-arm trading partners into doing his bidding.\n\nAs the epicentre of the financial world and the issuer of the global reserve currency, the United States has several levers that Trump can pull to coerce other countries, from credit cards to the very provision of dollars to foreign banks.\n\nWhile deploying these unconventional weapons would come at a large cost for the US itself and may even backfire altogether, observers say such doomsday scenarios should not be discarded.\n\nThis would be particularly true if tariffs do not succeed in reducing the US trade deficit with the rest of the world — an outcome many economists see as plausible given the fact that near-full employment in the US has led to deep labour shortages.\n\n“I could well imagine that Mr. Trump … grows frustrated and he does try to implement wacky ideas, even if the logic for them is not there,” said Barry Eichengreen, professor of economics and political science at the University of California, Berkeley.\n\nThe US administration’s not-so-secret plan is to rebalance trade by weakening the dollar. A way to do that would be to enlist foreign central banks in a coordinated effort to revalue their own currencies.\n\nAccording to a paper by Trump’s pick to chair his Council of Economic Advisers, Stephen Miran, this may happen as part of a Mar-a-Lago accord, a reference to the dollar-capping Plaza Accord of 1985 and Trump’s resort in Florida.\n\nThe November paper suggested the United States would use the threat of tariffs and the lure of US security support to persuade foreign countries to appreciate their currencies against the dollar, among other concessions.\n\nHowever, economists are sceptical that any such deal would gain traction in Europe or China because the economic and political situation is so different now from four decades ago.\n\n“I think that’s a really unlikely scenario,” Maurice Obstfeld, a senior fellow at the Peterson Institute for International Economics, said.\n\nObstfeld argued tariffs had already been imposed, removing their use as a threat, and the US’ commitment to global security had been weakened by its ambiguity on Ukraine.\n\nHe added that central bankers in the Eurozone, Japan and Britain were unlikely to yield to a deal that would see them forced to raise interest rates and risk a recession.\n\nTS Lombard chief economist Freya Beamish argued that engineering a stronger yuan would also go against China’s need to reflate its struggling economy.\n\nEven in Japan, where the government has repeatedly intervened in the currency market over the past few years to prop up the yen, memories of 25 years of deflation that only recently ended may temper any enthusiasm for strong yen appreciation.\n\nIf an accord can’t be reached, Trump’s administration might be tempted to use more aggressive tactics, such as harnessing the dollar’s status as the currency in which the world trades, saves and invests.\n\nThis may take the shape of threatening to turn off the Federal Reserve’s taps for foreign central banks, which allows them to borrow dollars in return for collateral in their own currency, according to Obstfeld and some supervisors and central bankers.\n\nThis is an essential source of funding at times of crisis, when money markets seize up and investors retrench to the safety of the dollar.\n\nTaking it away would upset a multi-trillion market for dollar credit outside of the United States and hit banks in Britain, the euro zone and Japan particularly hard.\n\nOf course, these so-called swap lines are firmly in the Federal Reserve’s hands and Trump has never signalled it wanted to take control of the powerful monetary institution.\n\nBut his recent moves to replace key personnel, including at regulatory agencies, have unnerved observers.\n\n“It is no longer inconceivable that in a bigger negotiation, this could serve as a nuclear threat,” Spyros Andreopoulos, founder of the Thin Ice Macroeconomics consultancy, said, adding that such a move would over time erode the dollar’s status as a reliable global currency.\n\nThe United States has another ace up its sleeve — its payment giants, including credit card companies Visa and Mastercard.\n\nWhile Japan and China have to varying degrees developed their own electronic means of payment, the two US firms process two-thirds of card payments made in 20-nation euro zone.\n\nMobile phone app payments, dominated by US firms such as Apple and Google make up almost one-tenth of retail payments.\n\nThis shift has put Europeans on the back foot in a vast market, worth more than €113 trillion ($124.7tr) in the first six months of last year.\n\nWere Visa and Mastercard to be pressured into pulling the plug on services, as they did in Russia shortly after it invaded Ukraine, Europeans would have to use cash or cumbersome bank transfers to shop instead.\n\n“That the US has turned hostile is a huge setback,” Maria Demertzis, chief economist for Europe at the Conference Board think tank, said.\n\nThe European Central Bank has said this exposed Europe to the risk of “economic pressure and coercion” and a digital euro may be a solution.\n\nHowever, the plans to roll out this digital currency have become bogged down in discussion and may take years to introduce.\n\nEuropean officials are considering how they could respond to Trump’s actions but are wary of triggering a further escalation. They could impose tariffs of their own or resort to more drastic measures, such as limiting US banks’ access to the European Union.\n\nTaking such radical steps could, however, be hard because of the international clout of Wall Street, as well as the risk of a backlash against European lenders doing business in the US.\n\nStill, some international bank executives told Reuters that they were concerned about the threat of blowback from Europe in the coming months.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0421025290ced30.jpg",
  "retrievedAt": "2025-08-25T13:58:24.082Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902088/after-tariff-shock-trump-may-weaponise-finance-against-allies",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T16:11:33.000Z"
}
