{
  "title": "Phander residents marooned for over a week - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: For the past eight days, thousands of people residing in Phander Valley (near Shandur Top) in Ghizer district have been cut off from the rest of Gilgit-Baltistan after a snow avalanche severed the road connecting the remote valley to other parts of the region.\n\nAccording to officials, a snow avalanche occurred near Khalti village, which blocked the link road, leaving almost 20 thousand people stranded.\n\nThe inability of the administration to clear the road also prompted a protest outside the Gilgit Press Club organised by the Ghizer Students Organisation. A large number of people from Phander residing in Gilgit town participated in the protest. They said that residents could not travel even in emergency cases due to the avalanche and that the area lacked medical facilities.\n\nBesides, the local population was also facing disruptions in the power supply and communications. They were also holding banners and placards with slogans, such as ‘light and road are our rights’ and ‘justice for the stranded people’.\n\nProtest in Gilgit after authorities fail to clear avalanche-hit road\n\nAccording to protesters, a large number of people could not travel for Eid because the road was blocked.\n\nThe protesters urged the Gilgit-Baltistan government to take immediate action for the restoration of the road.\n\nFida Khan, a former member of the GB assembly from the affected area, said the route was supposed to be opened in one or two days, but due to the negligence of the relevant authorities, it could not be opened even after one week.\n\nAccording to the local administration, heavy machinery has been deployed in the area to remove the debris, but the avalanche was massive and it would take a few days to clear the area. Officials said six snow avalanches were triggered on the Phander Road, from Ghupis to Phander, and the administration had cleared four of them.\n\nThey further said that avalanches also hit several parts of Gilgit-Baltistan. Snow avalanches have damaged properties and land communications in Astore, Shigar, Nagar, Ghizer, Skardu and Ghanche districts, due to which people were facing difficulties.\n\nA press release issued on Thursday said that GB Chief Minister Haji Gulbar Khan had taken notice of roadblocks due to rain and snowfall and ordered the immediate restoration of inter-district roads affected by recent rains.\n\nThe Department of Communications and Works, as well as the district administration, has been directed to ensure the restoration of road links in remote areas, including Phander Road in Ghizer district.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:21:18.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901941/phander-residents-marooned-for-over-a-week",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:10.000Z"
}
