{
  "title": "Pakistan look to avoid whitewash in third New Zealand ODI - Sport - DAWN.COM",
  "author": null,
  "content": "MOUNT MAUNGANUI: Pakistan will look to avoid a series whitewash at the hands of New Zealand when they take on the hosts in the third and final One-day International at the Bay Oval on Saturday.\n\nThe Mohammad Rizwan-lead side, after losing the preceding five-match T20I series against the BlackCaps, was hoping to stage a strong comeback in the 50-over format, but letting the latter take away the game from them after strong starts cost Pakistan the series.\n\nIn the first ODI in Napier, Pakistan had New Zealand struggling at 50-3 at one point before a blistering century by Mark Chapman saw the Kiwis slam 344-9 — a target the visitors missed by 73 runs.\n\nIn the second game, Mitchell Hay’s lower-order onslaught of 99 off 78 balls made New Zealand forget they were 132-5 by the 17th over before the side bundled out Pakistan for 208 runs with more than nine overs to spare.\n\nHad it not been for Faheem Ashraf’s knock off 73 off 80 balls, Pakistan would have lost by an even bigger margin on a pitch that was assisting seam movement throughout.\n\nPakistan have taken advantage of the conditions in the early stages of their bowling innings but have failed to keep the pressure on until the later stage of them.\n\n“As a team, we are playing in phases,” Faheem told reporters after the match. “Sometimes we play really well, but then we leak runs, and that’s what happened today.”\n\nEven with the bat, Pakistan have been able pose a challenge against New Zealand, but have not been able to play until the end of the innings in either of the first two matches.\n\nFaheem had set up a 10th-wicket partnership with tailender Naseem Shah but rued that the pair couldn’t take the match at the deepest.\n\n“Our aim was to play until the end, and we were talking about going all the way because we were getting boundaries in almost every over,” he said.\n\n“The plan was to play as many overs as we could, as the longer we stayed in, the more chances we had of getting close to the target.\n\n“Even though we got out in the 41st over, we were at around 80 runs. If we had played the full overs, we might have gotten closer.”\n\nPakistan were expected to do well against a third-string New Zealand side given their decent away form, which saw them win series against the likes of Australia and South Africa.\n\nDespite their poor ICC Champions Trophy campaign, Pakistan were confident their pace attack would flourish in New Zealand conditions. That, however, didn’t turn out to be the case.\n\n“It’s everyone’s effort to win, and our goal is always to win,” Faheem noted. “..as a team, if we back each other up, we can play much better. If we focus on the team and not on individual performances, we’ll play better cricket.”\n\nFaheem was hopeful Pakistan will end their forgettable tour with a win in the third ODI.\n\n“Look, as long as you’re playing cricket, it’s never impossible to win,” he said. “You just need to focus on your efforts, and everyone needs to align their thinking.\n\n“If the whole team’s mindset is the same, we will definitely win. This is how it has been before, sometimes you don’t win, but then you keep fighting. I don’t think it’s impossible; as long as we continue playing good cricket, we will win.”\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:58:54.748Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901904/pakistan-look-to-avoid-whitewash-in-third-new-zealand-odi",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:22.000Z"
}
