{
  "title": "Liverpool beat Everton as title looms, City win without Haaland - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Liverpool moved closer to the Premier League title with a 1-0 win in the Merseyside derby against Everton on Wednesday, while Manchester City beat Leicester City 2-0 to bolster their bid to reach the Champions League.\n\nWith just eight games left, Liverpool sit 12 points clear of second-placed Ars­enal, who beat Fulham 2-1 on Tuesday.\n\nArne Slot’s side had lost their previous two games in the League Cup final against Newcastle and the Champions League last 16 against Paris St Germain.\n\nBut they got back on track in their march towards a record-equalling 20th English title, and first since 2020, in Slot’s maiden season in charge.\n\nHaving gone over two months without a goal, Diogo Jota was Liverpool’s hero as he ended his drought in the 57th minute, slotting home from Luis Diaz’s flick.\n\nEverton defender James Tarkowski was fortunate to escape an early red card when he was only booked for an ugly foul on Alexis Mac Allister.\n\nIt was an especially sweet win for Live­rpool after their stormy 2-2 draw at Everton in February, which featured a last-gasp equaliser for David Moyes’ team.\n\nMoyes claimed Jota’s winner was offside but Slot said: “According to the rules it was a goal so no-one can complain. It is a clear goal. We are chasing down the best possible season we can have. As long as the players give everything like today then we are in a very good position.”\n\nAt the Etihad Stadium, City coped just fine without Norway striker Erling Haaland, who will be sidelined for up to seven weeks after suffering an ankle injury in Sunday’s FA Cup quarter-final win at Bournemouth.\n\nPep Guardiola’s men took just two minutes to go in front against second-bottom Leicester, who have lost seven successive league games.\n\nJeremy Doku and Savinho combined to carve open the Leicester defence before Jack Grealish slotted home from close range for his first league goal since December 2023.\n\nCity doubled their advantage in the 29th minute as Egypt forward Omar Marmoush lashed home after Leicester goalkeeper Mads Hermansen made a hash of dealing with Ruben Dias’ pass.\n\nCity are up to fourth place, one point ahead of fifth-placed Newcastle United and two in front of sixth-placed Chelsea, who have a game in hand.\n\n“After the tough game in Bournemouth, to come here after just three days, it helped us to score early. We missed the third goal that’s all. The rest was good,” Guardiola said.\n\nNewcastle beat Brentford 2-1 to maintain the party mood after the prolonged celebrations of their first major trophy for 56 years.\n\nEddie Howe’s side were back in action for the first time since beating Liverpool in the League Cup final.\n\nAlexander Isak met Jacob Murphy’s cross with a typically predatory strike in first-half stoppage time at St James’ Park.\n\nBrentford levelled through Bryan Mbeumo’s 66th-minute penalty after Newcastle ’keeper Nick Pope tripped Yoane Wissa.\n\nBut Sandro Tonali lashed home from Harvey Barnes’ assist in the 74th minute.\n\nAston Villa also remain in the hunt for a Champions League place after winning 3-0 at Brighton & Hove Albion.\n\nMarcus Rashford struck in the 51st minute, accelerating onto Morgan Rogers’ pass for his third goal in his last two games.\n\nMarco Asensio killed off Brighton in the 78th minute and Donyell Malen netted in added time to lift Villa into seventh place, two points behind Newcastle.\n\nSouthampton wasted a chance to avoid becoming the worst team in Premier League history after a 1-1 draw with Crystal Palace at St Mary’s.\n\nIvan Juric’s bottom-of-the-table side took the lead in the 20th minute when Nigerian striker Paul Onuachu converted Mateus Fernandes’ cross with a powerful header from 12 yards.\n\nBut Matheus Franca’s first goal for the club rescued Palace.\n\nSouthampton, 19 points from safety, are still two points away from bettering Derby’s record low Premier League final tally of 11 in 2007-08.\n\nSaints will be relegated at the weekend if they lose at Tottenham Hotspur and Wolverhampton Wanderers beat Ipswich Town.\n\nThird-bottom Ipswich kept alive their slender hopes of beating the drop with a 2-1 win at Bournemouth.\n\nNathan Broadhead’s clinical finish in the 34th minute and Liam Delap’s 60th-minute effort put Ipswich in control.\n\nEvanilson got one back for Bourn­emouth, but Ipswich held on to move within nine points of safety.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67ef2447584e4.gif",
  "retrievedAt": "2025-08-25T13:58:55.777Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901913/liverpool-beat-everton-as-title-looms-city-win-without-haaland",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:22.000Z"
}
