{
  "title": "Major relief in power bills for homes, industry - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Tariff cut by Rs7.41 per unit for domestic consumers, Rs7.69 for industrial units\n• Relief comes from QTA, savings from renegotiated IPP deals, diversion of petroleum, grid levies\n• Premier claims economic stability secured; journey ahead requires ‘surgical operations’ at many levels\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Thursday announced a reduction of about 12 to 17 per cent in electricity rates for various consumer categories through a combination of quarterly adjustments, savings secured from independent and state-owned power producers and diversion of petroleum and grid levies on oil and gas products.\n\nSpeaking at an event especially organised to announce the tariff cut, the prime minister said an “Eid gift” of Rs7.41 per unit reduction in the national average tariff and Rs7.69 per unit cut in industrial rates was the first humble relief to the con­sumers braving agonising energy costs.\n\nHe said the International Monetary Fund (IMF) had refused to allow diversion of financial impact of lower international oil prices last month towards reducing electricity rates and he himself des­ired to take up the matter with the IMF managing director as it did not involve any subsidy but simply not passing on reduction in international oil prices.\n\n“It was not easy to convince the IMF. The impasse finally ended and they allowed us to reduce power rate like a favour,” he said, adding that the matter required to be handled with self-restraint, as the IMF programme was a trust of the nation that had been breached in the past and needed to be rebuilt.\n\nThe per-unit tariff reduction announced by the prime minister includes a cut of about Rs1.90 on account of lower quarterly tariff adjustments (QTA) for the second quarter (October-December) of FY25, Rs1.71 against Rs10 per litre increase in petroleum levy on petrol and diesel, over Re1 from a Rs791 per unit grid levy on industrial captive power plants, and about Rs3 on account of terminations and revisions in contracts of independent power producers (IPPs) and government power plants.\n\nWhile the power regulator Nepra on Thursday notified a Rs1.90 per unit negative QTA in April-June bills, it has completed hearing for some of the IPPs and would review Rs1.71 per unit cut against the petroleum levy increase on Friday. The government is now pushing for the applicability of all these cuts within weeks.\n\nMr Sharif said the power sector task force — seated in the front row — secured about Rs3.699 trillion in savings over an average 15-year lifespan of the IPPs. Now is the time for the dividends of this saving to reach the nation, including industry and trade, residential and commercial consumers.\n\nPower sector savings\n\nThe prime minister appreciated the task force members, including Power Minister Awais Leghari, Lt Gen Zafar Iqbal, Power Secretary Fakhre Alam, and PM’s adviser Muhammad Ali, and expressed gratitude for the role played by Army Chief Gen Asim Munir in not only securing savings from IPPs but also achieving macroeconomic stability.\n\nThis would be followed by further tariff cuts through even more challenging task of overcoming Rs600 billion worth of annual electricity theft, open electricity market operations and privatisation or provincialisation of distribution companies, he said.\n\nThe prime minister announced a Rs7.69 per unit (13pc) reduction in the average electricity rate for industry to Rs40.51 per unit from Rs48.19 per unit at present, saying this used to be Rs58.50 per unit in June last year.\n\nHe said the power tariff for domestic consumers was being reduced by Rs7.41 per unit to Rs37.64 from Rs45.05 per unit at present. This rate was Rs48.70 per unit in June 2024, he said. This, however, app­eared to be an inadvertent mix-up.\n\nA tariff sheet from the power division seen by Dawn suggests that actually, it is the national average electricity tariff, which currently stands at Rs45.05 per unit and would be slashed by Rs7.41 per unit (15pc) to Rs37.64.\n\nThe unit rate for protected consumers in the first 100- to 200-unit category would be sla­shed by Rs6.14 per unit each to Rs8.52 per unit and Rs11.51 per unit, respectively. This will benefit about 17 million consumers.\n\nA reduction of Rs7.24 per unit would be provided to non-protected consumers on 300 units per month to Rs34.03 per unit, down by 17pc. A similar Rs7.24 per unit (13pc) reduction would be applied to time-of-use consumers in the 300 units category to bring down their rate to Rs48.46 from Rs55.70. This will also benefit about 15.3m consumers.\n\nThe average rate for residential consumers (including protected and non-protected) would go down by Rs6.71 per unit to Rs31.63 per unit from Rs38.34 at present. The number of total residential consumers stands at about 35m.\n\nThe lower rates would not apply to about two million consumers in the lifeline residential category currently charged at Rs4.78 per unit for up to 50 units and Rs9.37 per unit for 51-100 units.\n\nThe commercial consumers would be given a Rs8.58 per unit (12pc) relief to Rs62.47 per unit while a cut of Rs7.18 per unit would be allowed to general services, bulk and agriculture consumers that would scale down their rates to Rs49.48 per unit, Rs47.87 per unit and Rs34.58 per unit, respectively.\n\nCircular debt, SOE losses\n\nThe prime minister said that the power sector’s circular debt, currently standing at Rs2.393tr, would be gradually eradicated over the next five years forever, for which arrangements had been made.\n\nHe said the power sector task force had now been assigned to secure more savings through a reduction in theft and other inefficiencies so that another major relief could be extended to the consumers next month and gear up the journey to progress through competitive ind­us­trial production and exports and other economic activities.\n\nPM Shehbaz recalled the tough economic conditions when the previous government violated the IMF agreement, and the len­der was not even ready to talk while the country was on the verge of default. He said he had to intervene many times to facilitate letters of credit for the imp­ort of oil and other essential products.\n\nHe said the year-long journey established the fact that turnaround could be achieved with “honesty and unwavering will”, although the people of Pakistan, including households, businessmen and traders, had to pay a heavy price.\n\nHe said the economic stability had been secured, although the journey ahead was equally challe­nging and required surgical ope­ra­tions at many levels, including stopping over Rs800bn annual ble­eding in the state-owned entities (SOEs) like a “bottomless pit”.\n\nFor this, privatisation and rightsizing would require quick decisions and implementations to lead the country towards organic growth as subsidies could not be provided under the IMF programme.\n\nNepra notification\n\nMeanwhile, Nepra on Thursday notified a Rs1.90 per unit negative QTA for October-December 2024 with a fiscal impact of about Rs56bn.\n\nIt also notified a Rs3.022 per unit negative fuel cost adjustment for consumers of K-Electric for January and about 46 paise per unit negative FCA for other power distribution companies (Discos) for February with effect from April 1, 2025.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67ef2bc38b910.gif",
  "retrievedAt": "2025-08-25T13:59:09.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901947/major-relief-in-power-bills-for-homes-industry",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:26:58.000Z"
}
