{
  "title": "Israel seizes Rafah, forcing hundreds of thousands to flee - World - DAWN.COM",
  "author": null,
  "content": "• Israeli strikes kill 97 Palestinians in 24 hours\n• IDF says it is investigating deaths of 15 aid workers\n\nCAIRO: Hundreds of thousands of fleeing Gazans sought shelter on Thursday in one of the biggest mass displacements of the war, as Israeli forces advanced into the ruins of the city of Rafah, part of a newly announced “security zone” they intend to seize.\n\nA day after declaring their intention to capture large swathes of the crowded enclave, Israeli forces pushed into the city on Gaza’s southern edge which had served as a last refuge for people fleeing other areas for much of the war.\n\nGaza’s health ministry reported at least 97 people killed in Israeli strikes in the past 24 hours, including at least 20 killed in an airstrike around dawn in Shejaia, a suburb of Gaza City in the north.\n\nLater on Thursday, an Israeli air strike killed at least 27 Palestinians, including women and children, inside a school building that served as a shelter for displaced families in Gaza City, local health authorities said.\n\nMedics said three missiles slammed into the Dar Al-Arqam school building in Tuffah neighbourhood in Gaza City, and the Israeli military said it struck a command centre that had been used by Hamas fighters to plan and execute attacks against Israeli civilians and army troops.\n\nRafah “is gone, it is being wiped out,” a father of seven among the hundreds of thousands who had fled from Rafah to neighbouring Khan Younis, told Reuters via a chat app.\n\n“They are knocking down what is left standing of houses and property,” said the man who declined to be identified for fear of repercussions.\n\nThe assault to capture Rafah is a major escalation in the war, which Israel restarted last month after effectively abandoning a ceasefire in place since January.\n\nIn Shejaia in the north, one of the districts where Israel has ordered the population to leave, hundreds of residents streamed out on Thursday, some carrying their belongings as they walked, others on donkey carts and bikes or in vans.\n\n“I want to die. Let them kill us and free us from this life. Were not living, were dead,” said Umm Aaed Bardaa.\n\nIn Khan Yunis, where several people were killed by a strike, Adel Abu Fakher was checking the damage to his tent: “Theres nothing left for us. Were being killed while asleep,” he said.\n\nPermanent depopulation\n\nIsrael has not spelled out its long-term aims for the security zone its troops are now seizing. Prime Minister Benjamin Netanyahu said troops were taking an area he called the “Morag Axis”, a reference to an abandoned former Israeli settlement between Rafah and Khan Yunis.\n\nGazans who had returned to homes in the ruins during the ceasefire have now been ordered to flee communities on the northern and southern edges of the strip.\n\nThey fear Israel’s intention is to depopulate those areas indefinitely, leaving many hundreds of thousands of people permanently homeless while Israel seizes some of Gaza’s last agricultural land and critical water infrastructure.\n\nSince the first phase of the ceasefire expired at the start of March with no agreement to prolong it, Israel has imposed a total blockade on all goods for Gaza’s 2.3 million residents, recreating what international organisations call a humanitarian catastrophe.\n\nRafah residents said most of the local population had followed Israel’s order to leave, as Israeli strikes toppled buildings there. But a strike on the main road between Khan Yunis and Rafah stopped most movement between the two cities.\n\nMeanwhile, Israel’s military said on Thursday it was conducting an investigation into the deaths of 15 Palestinian aid workers found buried in a shallow grave in March near Red Crescent vehicles, an incident that caused global alarm. The military said troops fired on the cars believing they carried fighters.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:59:09.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901945/israel-seizes-rafah-forcing-hundreds-of-thousands-to-flee",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:04.000Z"
}
