{
  "title": "US threats of bombing Iran unacceptable, says Moscow - World - DAWN.COM",
  "author": null,
  "content": "MOSCOW/PARIS: Russia said on Thursday that threats of military strikes against its ally Iran were unacceptable and warned that attacking the Islamic Republic could lead to potentially catastrophic results if nuclear installations were bombed.\n\nUS President Donald Trump threatened Iran on Sunday with bombing and secondary tariffs if Tehran did not come to an agreement with Washington over its nuclear programme, and the United States has moved additional warplanes into the region.\n\nAsked about Iran’s nuclear programme and the dangers in the current situation, Russia’s foreign ministry said that Moscow was committed to finding solutions to Iran’s nuclear programme which respected Tehran’s rights to peaceful nuclear energy.\n\n“The use of military force by Iran’s opponents in the context of the settlement is illegal and unacceptable,” Maria Zakharova, spokeswoman for the ministry, told reporters. “Threats from outside to bomb Iran’s nuclear infrastructure facilities will inevitably lead to an irreversible global catastrophe. These threats are simply unacceptable.”\n\nIsrael says it shares with France ‘common’ goal of Tehran without nuclear weapons\n\nWestern powers accuse Iran of having a clandestine agenda to develop nuclear weapons capability by enriching uranium to a high level of fissile purity, above what they say is justifiable for a civilian atomic energy programme. Tehran says its nuclear programme is wholly for civilian energy purposes.\n\nRussia and Iran signed a “comprehensive strategic partnership agreement” in January, though there is no mutual defence clause. Under the agreement, if one party is attacked, the other will not help the aggressor.\n\nRussia condemns US threats, Deputy Foreign Minister Sergei Ryabkov told the Life magazine. Ryabkov said an attack on Iran could unfurl a broader open conflict in the Middle East. “The consequences of this, especially if there are strikes on the nuclear infrastructure, could be catastrophic for the entire region,” Ryabkov said.\n\n‘Common’ goal\n\nIsrael and France share a “common” goal of preventing Iran from acquiring nuclear weapons, the Israeli foreign minister said in Paris on Thursday.\n\n“The most extremist regime in the world shouldn’t possess the most dangerous weapon in the world,” Israel’s Foreign Minister Gideon Saar told reporters. “This objective to prevent Iran from achieving nuclear weapon is a common objective of France and Israel.”\n\nIsrael is the region’s sole, if undeclared, nuclear-armed state. It has long made preventing any rival from matching this capability its top defence priority. Saar, who met France’s Foreign Minister Jean-Noel Barrot earlier Thursday, stressed that Iran was a threat to the entire region and not just to Israel, adding Israel was in talks with France, Britain and the United States. “We don’t exclude a diplomatic path with Iran,” he added.\n\nSaar said he had invited France’s top diplomat to visit Israel. “I have a continuous dialogue, an ongoing dialogue, with the French foreign minister,” he said. On Wednesday, Barrot warned that a military confrontation with Iran would be “almost inevitable” if talks over Tehran’s nuclear programme failed.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:21:38.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901928/us-threats-of-bombing-iran-unacceptable-says-moscow",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:29.000Z"
}
