{
  "title": "World equities tumble, oil slumps 7pc - Business - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Wall Street led a global markets bloodbath pm Thursday as countries around the world reeled from President Donald Trump’s trade war, while the White House insisted the US economy will emerge victorious.\n\nThe Dow Jones dropped more than three per cent and the S&P 500 plummeted more than 4pc. The Nasdaq toppled more than 5pc.\n\nShock waves also tore through markets in Asia and Europe in the wake of Trump’s Wednesday announcement, while foreign leaders signaled readiness to negotiate but also threatened counter-tariffs.\n\nTrump slapped 10pc import duties on all nations and far higher levies on imports from dozens of specific countries — including top trade partners China and the European Union.\n\nSeparate tariffs of 25pc on all foreign-made cars also went into effect and Canada swiftly responded with a similar levy on US imports.\n\nIn a sign of the real-world impacts expected to become common, Stellantis — the owner of Jeep, Chrysler and Fiat — paused production at some Canadian and Mexican assembly plants.\n\nTrump dismissed the turmoil, insisting to reporters as he left for a weekend at his Florida golf resorts, that stocks will “boom.”\n\nGlobal economic ‘sumo wrestler’\n\nTrump has brushed off warnings about triggering a global economic slowdown and politically damaging price rises at home.\n\nRepublican Senator Mitch McConnell broke ranks with Trump, slamming tariffs as “bad policy.” “Preserving the long-term prosperity of American industry and workers requires working with our allies, not against them,” he said.\n\nBut while Trump is under pressure to avoid a drawn-out trade war, he appears determined to stick with the tariffs until he forces competitors to play by US rules.\n\nBrent oil falls\n\nOil prices fell on Thursday as the decision by the Opec+ group to speed up unwinding of oil output cuts in May compounded already heavy losses following US President Donald Trump’s announcement of sweeping new import tariffs.\n\nBrent futures were down $5.04, or 6.72 per cent, at $69.91 a barrel by 12:50 p.m. EDT (1650 GMT). US West Texas Intermediate crude futures were down $5.13, or 7.15pc, at $66.58. Brent was on course for its worst percentage drop since August 1, 2022, and WTI its worst since July 11, 2022.\n\n“Obviously, there’s a lot of fear and moaning this morning,” said Phil Flynn, senior analyst with Price Futures Group.\n\nPublished in Dawn, April 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67ef259d6e692.gif",
  "retrievedAt": "2025-08-25T13:58:56.829Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901919/world-equities-tumble-oil-slumps-7pc",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T01:27:16.000Z"
}
