{
  "title": "US National Security Agency chief fired - World - DAWN.COM",
  "author": null,
  "content": "The head of secretive US intelligence body the National Security Agency (NSA) was fired on Thursday, US media reported.\n\nThe Washington Post cited US officials who said General Timothy Haugh was fired after little over a year in the job.\n\nThe officials did not give a reason for Haugh’s removal, The Post added.\n\nHaugh was also serving as head of the US Cyber Command, the Pentagon’s cyber warfare body which conducts offensive and defensive cyber operations.\n\nHis NSA deputy Wendy Noble was also fired and reassigned to another job at the Pentagon, The Post said.\n\nThe NSA is the US government’s largest and most secretive signals intelligence agency.\n\nThe Pentagon did not immediately respond to AFP’s request for comment.\n\nHaugh, who was appointed in February 2024, previously held a string of high-profile government cybersecurity roles, including commander of the elite Cyber National Mission Force.\n\nReacting to the news, Democratic Congressman Jim Himes said he was “deeply disturbed” by Haugh’s sacking.\n\n“I have known General Haugh to be an honest and forthright leader who followed the law and put national security force,” he said in a statement posted on X.\n\n“I fear those are precisely the qualities that could lead to his firing in this Administration.”\n\nUS President Donald Trump has led a major shake-up of the armed forces’ leadership since taking office in January.\n\nTrump fired top US military officer General Charles “CQ” Brown in February, offering no explanation for Brown’s dismissal less than two years into his four-year term as chairman of the Joint Chiefs of Staff.\n\nHis administration is presiding over sweeping layoffs of federal workers and moves to dismantle government institutions just months into his second term.\n\nUS Cyber Command’s Deputy Commander William J Hartman and NSA executive director Sheila Thomas have been named acting NSA chief and deputy, The Post reported.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0411270521141a2.png",
  "retrievedAt": "2025-08-25T13:58:28.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902032/us-national-security-agency-chief-fired",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T06:28:59.000Z"
}
