{
  "title": "‘Forced repatriation’ of 16,138 Afghans begins in Karachi: authorities - Pakistan - DAWN.COM",
  "author": null,
  "content": "City administration and law enforcement in Karachi on Friday started the ‘forced repatriation’ of an estimated 16,138 Afghan Citizenship Card (ACC) holders, with over 150 so far detained as part of the government’s policy to deport all undocumented foreign nationals, officials said on Friday.\n\nThe interior ministry, in a statement on March 6, stated, “All illegal foreigners and ACC holders are advised to leave the country voluntarily before 31 March 2025; thereafter, deportation will commence wef 1 April 2025.”\n\nOn February 13, the interior minister instructed the Sindh government to initiate the repatriation of all ACC holders to their country of origin under the Illegal Foreigners Repatriation Plan (IFRP). As part of the plan, voluntary return until March 31 ended and “forced repatriation” from April 1 has begun.\n\nAs per the IRFP prepared by the Sindh Home Department and seen by Dawn.com, a control room has been set up at the department while “holding points” have been set up in Karachi and Jacobabad, with a “transit point” in Sakrund, Shaheed Benazirabad housing a total capacity of 1,500.\n\nThe plan added that the main repatriation centre has been set up at Ameen House in Sultanabad in Karachi’s Keamari area.\n\nSouth Deputy Inspector General (DIG) Syed Asad Raza told Dawn.com on Friday that so far, 162 ACC holders have been brought to the holding facility as some of them were returned or released as being Proof of Registration (POR) holders.\n\n“A total of 196 Afghans from different areas were brought to the camp on April 3,” the DIG said. “Of those, 20 were released as they held POR.\n\n“Similarly, a total of 90 Afghans arrived at the camp on April 4 (Friday), with 10 being released. Thus, a total of 242 Afghans have been brought for repatriation to Afghanistan,” he added.\n\nDIG Raza said that a joint mapping exercise conducted by the police’s Special Branch, in collaboration with other law enforcement agencies, found a total of 16,138 ACC holders in Karachi, with most of them living in the East and West districts.\n\nGiving a breakdown of each district, South police said that there were 11,233 ACC holders in the East district, 2, 792 cardholders in the West district, 910 in Korangi, 396 in Malir, 406 in the Central district, 203 in Keamari, 120 in the South district and 78 in the City district.\n\nMeanwhile, Keamari Senior Superintendent of Police (SSP) Captain (retired) Faizan Ali visited the Ameen House holding camp on Friday, a statement issued by the Keamari Police Media Cell said.\n\nAccording to the statement, SSP Keamari reviewed the process of transferring illegal immigrants and issued instructions to personnel in charge of security and other arrangements.\n\n“Special arrangements have been made for transportation, food and health facilities for the people transferred to the holding camp,” the SSP was quoted as saying. “The transfer of foreign immigrants to their native country with all facilities, security and dignity will be ensured.”\n\nHowever, lawyer and founding member of the Joint Action Committee for Refugees (JAC) Moniza Kakar told Dawn.com that 500-600 Afghans have been detained in “crackdowns” in various localities of the metropolis.\n\n“As in other parts of the country, Afghans complain of ‘harassment and bribery’,” Kakar alleged, claiming that Afghans have been detained in different areas by the police.\n\n“We have already filed petitions in Islamabad, Peshawar, Quetta and Rawalpindi and are waiting for their outcome before we initiate the same process in Sindh as well,” she added, highlighting that following the crackdown, Afghans are not going to work out of fear of being detained.\n\nKakar highlighted that there are a total of 850,000 ACC holders in the country who received their cards in 2017. Of them, 70,000 were reportedly living in Karachi.\n\nMeanwhile, Amnesty International launched the ‘#undothedeadline’ campaign against what it termed the “unlawful deportation of Afghan nationals”, according to a press release.\n\nThe rights group launched the campaign by releasing a report titled ‘“Treat us like human beings”: Afghans in Pakistan at risk of unlawful deportation’.\n\nAccording to the press release, Amnesty “aims to amplify the voices of Afghans at risk of unlawful deportation, advocate for the respect of their human rights and raise awareness about the urgent need to stop their forced deportations from Pakistan”.\n\nThe report highlights the stories of 10 Afghan migrants, refugees and asylum seekers “who cannot afford to go back to Taliban-ruled Afghanistan and not only risk their lives but also stand to lose decades worth of lives built in Pakistan”.\n\n“Afghan nationals including refugees and asylum seekers in Pakistan have been living in a state of fear since the Pakistani authorities announced their phased deportation plans in October 2023,” Babu Ram Pant, deputy regional director for South Asia at Amnesty International, was quoted as saying in the release.\n\n“Many Afghans have been in Pakistan for more than four decades. Their lives stand to be completely upended as a result of the Pakistan government’s insistence on violating their obligations under international human rights law, specifically the principle of non-refoulement,” he added.\n\nPant warned that Afghans seeking refuge in Pakistan after the Taliban takeover of Afghanistan in 2021 are particularly at risk, including Afghan women and girls, journalists, human rights defenders, women protestors, artists, and former Afghan government and security officials.\n\n“Pakistan must reverse its existing policy of forced return to ensure the safety of these individuals,” he was quoted as saying.\n\nExperts from the UN urged Pakistan not to proceed with plans to force Afghans from the cities of Islamabad and Rawalpindi, nor to deport them to Afghanistan, according to a statement from the organisation’s human rights body (UNHCR).\n\nThe experts called on the government to “continue its important role as a neighbouring country with a long history of hosting Afghans fleeing their country”, the statement read.\n\n“Millions of Afghans in Pakistan are at risk of being pushed back to Afghanistan without regard for their genuine protection concerns — including gender-based violence and the systemic dismantling of the rights of women and girls — in violation of international human rights law and refugee law, and disregarding UNHCR’s non-return advisory,” the experts were quoted as saying.\n\n“We urge Pakistan to immediately stop mass internal relocations, deportations, arrests, evictions, intimidation and other pressures on Afghans to cross the border into Afghanistan, and to uphold the absolute and non-derogable principle of non-refoulement,” they said, expressing particular concern about the gendered and intersectional impact.\n\nAccording to the statement, UN experts repeatedly spoke out against the IFRP and documented a “worrying increase” in arrests of Afghans ahead of the 31 March deadline.\n\n“Many desperate Afghans have contacted the experts, fearing persecution by the Taliban in Afghanistan if they are forced to return,” the experts were quoted as saying.\n\n“The most vulnerable are Afghan women, girls, LGBTI persons, ethnic and religious minorities, former government officials and security personnel, human rights defenders, and media workers,” the experts said.\n\n“Children, especially unaccompanied, are at heightened risk of trafficking, child marriage and abuse, while persons with disabilities and older persons are also particularly vulnerable. They should all be individually assessed.”\n\nThe experts also expressed concern about the return of Afghans from other countries — potentially contravening international human rights and refugee law — and acknowledged security risks such as terrorist attacks in Afghanistan and Pakistan.\n\nAdditionally, the experts noted that many Afghans left for Pakistan having been given reasonable expectations of being resettled in a third country, having their dreams of a secure future shattered by the sudden halt of resettlement programmes.\n\nThey “stressed that funding cuts would reduce the ability of the de facto authorities in Afghanistan, together with humanitarian agencies, to support a large influx of people from neighbouring countries,” the statement read.\n\n“Abrupt and drastic funding cuts by donors are already having a severe impact on much-needed humanitarian assistance to Afghans,” the experts said. “Given the deteriorating human rights situation in Afghanistan, durable solutions are needed for Afghans outside the country, with strong support from the broader international community.”\n\nThe Interior Ministry says the IFRP was implemented on November 1, 2023. “In continuation to the government’s decision to repatriate all illegal foreigners, national leadership has now decided to also repatriate ACC holders,” the March 6 statement stated.\n\nUnder the IFRP, over 700,000 undocumented Afghans have already left Pakistan since the process was launched in November 2023.\n\nActing Afghan Foreign Minister Amir Khan Muttaqi, in a meeting with Pakistan’s Special Representative for Afghanistan Mohammad Sadiq in Kabul on March 22, had asked Pakistan to give more time to the ACC holders as repatriation of so many people could create difficulties for his government.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/041920328459d70.jpg",
  "retrievedAt": "2025-08-25T13:58:21.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902083/forced-repatriation-of-16138-afghans-begins-in-karachi-authorities",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T14:34:39.000Z"
}
