{
  "title": "Pakistani troops fired in self-defence at border with Afghanistan: FO",
  "link": "https://www.app.com.pk/national/pakistani-troops-fired-in-self-defence-at-border-with-afghanistan-fo/",
  "date_published": "2020-07-31T03:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP):Pakistan on Friday said the firing incident at its border with Afghanistan at Chaman, that resulted in casualties, was an act of self-defence to protect local population.  “It is reiterated that Pakistan force did not open fire first and responded in self-defence only,” a Foreign Office statement said. The foreign office said, “Pakistani troops responded to protect our local population and acted only in self-defence.” It said at the Friendship Gate Chaman on Thursday, the Afghan forces opened unprovoked fire on innocent civilians gathered towards Pakistan’s side of the international border.\nPakistan troops deployed on the posts were also simultaneously engaged by Afghan posts, it said.  “To de-escalate the situation, the Pakistan side immediately activated both military and diplomatic channels and it was after hectic efforts that the firing was stopped from Afghan side,” it said. The foreign office said, “It must be noted that the borders with Afghanistan were opened for pedestrian movement and trade upon the request of the Afghan authorities.” “Pakistan is undertaking concerted efforts to ensure regulated movement of trade between the two countries, which are being challenged by elements opposed to such regulation,” it said.\nIt mentioned that due to Eid ul Azha, pedestrians’ move was also allowed. People gathered for this purpose were deliberately targeted by Afghan forces for incomprehensible reasons.\n“This unfortunate incident resulted in numerous casualties and deliberate/serious damage to State infrastructure on the Pakistan side,” it said.  The statement mentioned that there were, reportedly, unfortunate losses on the Afghan side as well.  “All this could have been avoided if fire had not been initiated from the Afghan side,” it said.  Pakistan reiterated its sincere readiness to further enhance fraternal relations with Afghanistan in the interest of peace and stability in the region.  “We hope our constructive efforts will be reciprocated,” it said.",
  "retrievedAt": "2025-08-11T19:34:42.358Z"
}
