{
  "title": "Excise dept sets new record, over Rs1.5 bln tax collected in July",
  "link": "https://www.app.com.pk/business/excise-dept-sets-new-record-over-rs1-5-bln-tax-collected-in-july/",
  "date_published": "2020-07-30T23:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP):The Excise and Taxation department has achieved another milestone in revenue collection and set a new record after collecting over Rs1.5 billion tax during the month of July and deposited the amount to the national exchequer.\n“It was a biggest achievement of the department as the target was achieved at what times when people were feared to step out of his home due to COVID-19,” said Director Excise Bilal Azam while talking to APP on Friday.\nThe department had introduced new methods of tax collection that eventually boost the revenue collection, as it was a top priority of the present government to promote tax culture among the masses,he added.\nThe director said, vehicle owner were submitting their token fee on National Database and Registration Authority’s (Nadra) e-sahulat centres across the country without visiting excise office that helped increase in tax recovery.\nSimilarly Excise had also started vehicle registration and transfer at door step in collaboration with NADRA for the convenience of the public that also lead to surge in revenue collection, he said.\nGiving comparison of the last five year collection figures, Azam said that on July 2016, the collection of Excise Taxes was Rs153,102,927, on July 2017, the statistics were Rs295,508,874, in the same month of 2018, the figures of revenue collection were 355,532,610, in July 2019, the Excise Taxes was recorded as Rs833,379,986 and during the first month of the current fiscal year despite COVID-19, the Excise collection was Rs1,143, 506,561, with the addition of FBR taxes collected of Rs407,359,966 by the Excise Department, making the total figure of Rs1,550,866,527 which was a record collection of taxes collected ever by excise office .\nThe authorities had also witnessed a surge in vehicle registration and transfer during the same period with 3,615 new registration and14,757 transferred cases respectively.\n“Chief Commissioner Islamabad, Aamer Ali Ahmad had also appreciated the performance of the department in a meeting specially call for the acknowledgement of the working of the staff and to appreciate them,” the Director said.\nAnswering a query, he said the department was also taken measures to make the whole payment system online, so the motorist could pay all fees including vehicle token fee, registration and transfer fee through integrating credit cards, bank accounts and other payment methods, which ultimately further increase the revenue collection.\nMeanwhile, the Excise teams also seized 4 stolen vehicles and handed over to Rawalpindi police the other day, to return to the real owners.\nThe vehicles were brought at the office for the purpose of registration and it was found stolen after going through physical examination, Azam told APP.\n“A campaign is underway against ‘cut and weld’, non-customs paid and stolen vehicles and physical checking for ownership of registered vehicles also being ensured to avoid tempering”, the director remarked.\nIt may be mention here that the department had recovered 14 vehicles few months back after found their chassis number tempered which were wanted at various police stations of twin cities of Rawalpindi and Islamabad.",
  "retrievedAt": "2025-08-11T19:34:51.013Z"
}
