{
  "title": "Murad demands Sindh govt to unveil report of assets of special assistants",
  "link": "https://www.app.com.pk/national/murad-demands-sindh-govt-to-unveil-report-of-assets-of-special-assistants/",
  "date_published": "2020-07-30T23:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP):Federal Minister for Communications and Postal Services, Murad Saeed has demanded leaders of Pakistan Peoples Party to unveil report of assets of special assistants working for Sindh government. In an interview with a private television channel programme, he said the Pakistan Tehreek e Insaf (PTI), leadership had set precedent and public report regarding assets of special assistants and advisor to prime minister.\nHe said that Pakistan Peoples Party and Pakistan Muslim League-Nawaz, never bothered to formulate a commission on sugar crisis during their era of running affairs of state. Appreciating PTI leadership, he said Prime Minister Imran Khan had made unprecedented work and disclosed the report about sugar mafia before nation.\nHe said that PTI government came into power after heavy mandate of people of Pakistan. He added that elimination of corruption and identifying the corrupt elements, was the manifesto of PTI party. Commenting on Opposition ‘hue and cry’ over non-issues, he said that Imran Khan would never grant national reconciliation ordinance (NRO) to leaders of previous regime found involved in corruption and plundering national money.\nHe said that process of accountability under the dynamic vision of Imran Khan would continue in the country in a transparent and fair manner.\nAbout issues of financial action task force (FATF), he said Pakistan went into grey list because of weak policies of PPP and PML-N.  The minister said that process of amending laws for NAB and FATF, would continue without impasse for streamlining the system.\nIn reply to a question about high power tariff issue, he said the PPP and PML-N, had made an expensive agreements with Independent Power Producers (IPPs) and other power generating companies, that was the reason, the people had to face billing issue.\nHe advised the Opposition parties to work for national interest and avoid playing gimmicks with government for taking NRO or any undue advantage over FATF, from the ruling party.",
  "retrievedAt": "2025-08-11T19:34:54.452Z"
}
