{
  "title": "Pakistan’s renewable energy potential immense to offset expensive fossil fuel imports: Danish Ambassador",
  "link": "https://www.app.com.pk/national/pakistans-renewable-energy-potential-immense-to-offset-expensive-fossil-fuel-imports-danish-ambassador/",
  "date_published": "2023-09-19T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Ambassador of Denmark, Jacob Lencolf on Tuesday said Pakistan’s renewable energy potential amid the growing climate crisis was immense and could help the country offset its expensive fossil fuel imports and limit its carbon emissions alongside sustainable resource management.\nThe Sustainable Development Policy Institute (SDPI) organised a high-level policy dialogue on COP-28 and Beyond: Strengthening Climate Action through Public-Private Partnerships that convened the Ambassadors of the United Arab Emirates and Denmark alongside key civil society, government and private sector officials.\nAmbassador Lincolf commended the SDPI for holding important seminars on pertinent agendas and getting the right people on board for dialogue. The population of Denmark was 5.5 million and that of Pakistan was 240 million, an enormous challenge to be met.\nHe said, “The resources in Pakistan are immense like the wind corridors of Sindh and Balochistan, the sun for solar and hydropower potential is abundant to embrace ambitious renewable energy solutions. It can go green if it dares to.”\nHe said the Danish government was willing to roll out its technology on a larger scale, adding, “Pakistan will have to be more open for it to embrace foreign investments at the larger scale. Denmark is all behind Pakistan for its stance on loss and damage at COP-28 and ready to commit finances for that.”\nAmbassador of UAE, Hamad Obaid Alzaabi said COP-28 was one of the main subjects of UAE agenda and the SDPI dialogue was very apt. “I would commend Pakistan’s commitment to address climate change and actively seek solutions to address the crisis,” he added.\nThe Emirates’ envoy stated that the UAE was actually aware of its responsibility and that it was not just another conference but a moment in the global fight against climate change; an opportunity to reset the course and accelerate global efforts to prepare global stock take and solution-oriented decisions, he added.\n“We firmly believe that taking this global challenge requires government, public private and international cooperation. Our goal is to create a platform where government and businesses can come together to share ideas and share innovative best practices,” he said.\nChairperson, Board of Governors, SDPI, Shafqat Kakahel in his opening remarks said UAE was not for the first time hosting such bigger environmental moots like the COP as it earlier hosted the UNEP special session in 2005 and has also been holding industrial climate-friendly exhibitions which played a tremendous role in highlighting sustainable energy technology solutions.\nHe said the COP-28 would be one of the most important sessions with main agenda items including for Pakistan, the operationalisation of the loss and damage fund which was decided at COP-27, global stocktake intergovernmentally negotiated acknowledgment of the successes and the gaps in it, global early warning systems, to ensure the world countries have sufficient warning before a climate disaster to strike, climate finance not only global climate fund of\n$100 billion but also other financial facilities as well.\nExecutive Director SDPI, Dr Abid Qaiyum Suleri while setting the scene said climate change is manifesting in different shapes and forms amid a poly crisis irrespective of borders and regions. The regions of Hawai, Honolulu and London faced a temperature rise, Beijing got unprecedented rains, typhoon and droughts in different countries apart from natural disasters in Pakistan indicating the scale and impact of the climate crisis.\nHe said, “Climate change is challenging us and all we need to devise multidimensional strategies to rethink our course of fighting climate change. No single sector, company and government can alone take the responsibility to address climate change we all need to join heads. However, the private sector is important for meaningful climate action and the government and private sector together can do wonders,” he added.\nDr Suleri said that Masdar City in UAE was the only carbon-zero, completely green city, established with the support of government, non-development, development, private sector, and academia.\nHe said the second example was Denmark, the country leading in the carbon market and trading initiatives that practically demonstrated government and private sector working for carbon trading that’s why the SDPI convened both the ambassadors for the dialogue.\n“The dialogue has been convened to learn how renewable energy transformation and technology can be adopted to replace carbon-intensive solutions with renewable,” the SDPI Executive Director said.\nSenior Additional Secretary, the Ministry of Climate Change and Environmental Coordination (MoCC&EC), Syed Mujtaba Hussain said without the support of all stakeholders the government could not do everything on its own. The National Adaptation Plan was approved by the previous cabinet that was a very comprehensive document stating what to do to adapt to climate change. It identified cross-sectoral relationships in different sectors of development like energy, water, infrastructure, disaster management and others, he added.",
  "retrievedAt": "2025-08-11T09:42:19.109Z"
}
