{
  "title": "PM says he will fully present Pakistan’s stance on Kashmir issue in UNGA",
  "link": "https://www.app.com.pk/national/pm-says-he-will-fully-present-pakistans-stance-on-kashmir-issue-in-unga/",
  "date_published": "2023-09-18T19:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar has said that he would fully present Pakistan’s position on the Kashmir issue in the United Nations General Assembly.\nHe said the United Nations had already pledged to decide the fate of the disputed region of Kashmir through a plebiscite.\nIn his interview to a private news channel here on Monday recorded before his departure from Islamabad to the US to attend the 78th UNGA in New York, the prime minister said there were various separatist movements in India, including Khalistan, and Pakistan was also a claimant on the issue of Junagadh.\nReplying to a question, PM Kakar said he was fully aware of the people’s difficulties who were extremely worried over the rising prices of petrol and other essential items. He said in Pakistan, the petroleum prices were determined on the basis of international prices. Unfortunately, he said, the prices in the international market were very high these days.\nWith respect to the taxation system in the country, the prime minister said people were facing problems due to a bad tax system that desperately needed to be improved. He said the rupee had stabilized in recent days due to better administrative measures.\nWhen asked about the holding of general elections in the country, the prime minister said there was no question of not holding the elections as the Election Commission was making full preparations in this regard and was taking steps according to the constitution.\n“It is our responsibility to support the Election Commission on the issue of funds and security.”\nThe prime minister said that under the constitutional procedure, the current caretaker government was formed as a result of joint consultation by the prime minister and the leader of the opposition. He said when the new government would be established, the power would be handed over to it immediately.\nHe said at present he had no case pending in the National Accountability Bureau (NAB). He said an inquiry against him in the NAB had been closed as it failed to find any of his properties.\nHe said he did not have any dealings with any of the Non-Government Organizations (NGO). He said he also had served as spokesperson of Balochistan without salary.\nHe pointed out that the salaries of the members of parliament, ministers and the prime minister were very low and needed to be equal to the judges of the Supreme Court so that Members of Parliament could fully participate in parliamentary proceedings.\nPM Kakar said the government was fully focused on the welfare of the public and it was determined to use all out resources to resolve the problems of the people.\nFurthermore, the prime minister said under Special Investment Facilitation Council, the government was providing incentives to the foreign investors to boost foreign direct investment in the country.\nHe said the government had launched a crackdown against the smugglers due to which the price of sugar and the dollar had come down. He said the Dollar rate against the Pakistan Rupee would further decrease in the coming days.",
  "retrievedAt": "2025-08-11T09:42:38.887Z"
}
