{
  "title": "Shah commends Austrian Climber for raising US$ 170,000 in funds for Pakistani porter children",
  "link": "https://www.app.com.pk/national/shah-commends-austrian-climber-for-raising-us-170000-in-funds-for-pakistani-porter-children/",
  "date_published": "2023-09-19T16:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Minister of State on Tourism Wasi Shah on Tuesday commended the efforts of Austrian Climber Wilhelm Steindl for raising US$ 170,000 in funds for the children of Pakistani porter Muhammad Hassan who lost his life during the K2 expedition.\nWasi Shah, along with Ambassador of Azerbaijan, Khazar Farhadov, Ambassador’s Spouse Tarana Farhadova and Dr. Hannes MACHOR, Minister Plenipotentiary/DHM officiating as the Chargé d’Affaires and Managing Director PTDC Aftab ur Rehman Rana in a ceremony held to recognize the efforts of Steindl for the family of the late porter Muhammad Hassan, said a press release.\nHassan tragically lost his life during an expedition on K2. After his death, one of the mountaineers Wilhelm Steindl ended his summit midway and returned to his home country where he started a campaign with the name “Give me Fund for them” to financially help Hassan’s family and collected US$170,000 to support them.\nShah expressed his admiration for Steindl’s selfless commitment and said, “What truly amazed and inspired me was Steindl’s selfless dedication to Hassan and his family, despite not being Pakistani. He took concrete steps to establish a Give Me Fund for them. At a time when many are consumed by self-interest, individuals like Steindl have reaffirmed my faith in humanity.”\nHowever, despite these efforts, my heart remains heavy as my organization couldn’t do everything that should have been done for Muhammad Hassan and his family, he said.\nHe said there was no formal arrangement for porters however after he assumed charge of the Ministry of Tourism, PTDC made significant progress in establishing a mountain training center in collaboration with Gilgit-Baltistan University, with Mr. Steindl ‘s full support.\nShah said, previously, there was no provision for insurance of porters in case of accidents, leaving families like Muhammad Hassan’s without any financial support however after extensive meetings with stakeholders in Islamabad and Skardu, the government agreed on a minimum insurance coverage of Rs 3 million for porters, but he is still working towards increasing it to Rs 5 million.\nHe appreciated Steindl, on behalf of every Pakistani, and said “Your actions exemplify the best of what humans can achieve when they come together for a common cause”.\nIn response, Steindl shared his commitment to continue supporting the family of the late porter Muhammad Hassan and announced his plans to establish a school for porters in the near future. He expressed his gratitude to the minister for the warm welcome extended to him in Pakistan.",
  "retrievedAt": "2025-08-11T09:42:13.068Z"
}
