{
  "title": "Govt takes steps to increase immunization program’s efficiency",
  "link": "https://www.app.com.pk/national/govt-takes-steps-to-increase-immunization-programs-efficiency/",
  "date_published": "2023-09-19T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): The Ministry of National Health Services has decided to take immediate steps to increase the efficiency of the national immunization program.\nThe decision to take three major steps in this regard was taken on the direction of Caretaker Minister for Health, Dr. Nadeem Jan. It was decided to incorporate the Human Papillomavirus (HPV) vaccine into the immunization program to prevent cervical cancer.\nAn integrated strategy has been developed to make the HPV vaccine part of the immunization program. In the first phase, 400 health centers in high-risk areas are being shifted to solar energy, Dr. Nadeem Jan said. Later, other centers will also shift to solar energy.\nHe said that the National Electronic Immunization Registry is being launched, which will help in improving the performance of the program. Under the National Electronic Registry, each child’s immunization data will be recorded in the system. He said that parents will receive an alert about their child’s vaccination date.\nHe added that parents can also find out which vaccine their child should get. Under this system, the institution can also monitor the attendance and performance of its vaccinator. Dr. Nadeem Jan said that practical steps are being taken to ensure 100% coverage of the immunization program.\nHe said that the immunization program is rapidly moving towards universal health coverage. The minister said that all necessary steps are being taken to ensure universal health coverage. The aim of the initiative is that no child or girl should be deprived of vaccination across the country, Nadeem Jan added.\nThe minister held three meetings with the head of the Federal Directorate of Immunization (FDI) as soon as he assumed the portfolio of the ministry. Dr. Nadeem Jan said, “Important tasks were given for the improvement of the immunization program. I will continue to monitor the targets given to FDI.”\nThe Ministry of Health is taking effective measures to ensure joint coverage with the provincial governments, he added. Special attention is being given to protect children from 12 diseases across the country, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:42:44.532Z"
}
