{
  "title": "ECC approves projected salary of first 6 months of PSM",
  "link": "https://www.app.com.pk/national/ecc-approves-projected-salary-of-first-6-months-of-psm/",
  "date_published": "2023-09-19T17:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): The Economic Coordination Committee (ECC) authorized Finance Division to approve the payment of projected net salary for the first six months of the Financial Year 2023-24 to be disbursed according to the salary demand of Pakistan Steel Mill (PSM) for every month from already approved budgetary allocation of Rs. 10 billion.\nThe Caretaker Federal Minister for Finance, Revenue, & Economic Affairs Dr. Shamshad Akhtar chaired the meeting of the ECC, said a press release issued here.\nThe ECC considered a summary of Ministry of Industries & Production regarding “Approval for Disbursement of Salary of Pakistan Steel Mill (PSM) Employees for the Financial Year 2023-24”.\nMinistry of Planning, Development, and Special Initiatives gave a briefing about the trends of Major economic Indicators and trends in the Prices of important food items.\nThe ECC directed Ministry of National Food Security and Research to prepare and submit regular reports on the availability of stocks, consumption, and pricing of all staple items specially wheat and sugar to the ECC in order to enable it to monitor the availability and pricing of these important commodities.\nThe ECC also directed the Ministry of Planning, Development, & Special Initiatives to ensure control of undue profiteering and to maintain the gap between wholesale & retail prices of essential food items and consumer products through respective Chief Secretaries.\nA summary of Ministry of Energy was also considered regarding “Transition of London Inter Bank Offer Rate (LIBOR) to Secured over Night Financing Rate (SOFR)”. The ECC, after discussion, directed the Ministry of Energy to prepare a detailed analysis of the financial implications of this decision and bring it in the next ECC meeting for discussion and approval.\nSami Saeed, Minister for Planning, Development and special Initiatives, Gohar Ijaz, Minister for Commerce, Industries, and production, Shahid Ashraf Tarar, Minister for Communication, Maritime, and Railways, Muhammad Ali, Minister for Power and Petroleum, Umar Saif, Minister of IT and Telecommunication, Advisor to PM on Finance Dr. Waqar Masood, Governor SBP, Chairman SECP, Federal Secretaries and other senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T09:42:13.067Z"
}
