{
  "title": "Film & Drama Finance Fund to help revive local film industry: Secretary Information",
  "link": "https://www.app.com.pk/national/film-drama-finance-fund-to-help-revive-local-film-industry-secretary-information/",
  "date_published": "2023-09-19T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Secretary Information and Broadcasting Zahoor Ahmed on Tuesday reiterated that the Film and Drama Finance Fund as envisaged in the Film and Broadcasting Policy 2018, was aimed at the revival of Pakistani cinema and will reap favorable results for the filmmakers who can now access the multiple financial sources, grants and loans.\nHe expressed these views while chairing the inaugural meeting of the Fund Management Committee of the Film and Drama Finance Fund at Directorate of Electronic Media and Publications.\nAt the start of the meeting, the Secretary Information and Broadcasting welcomed the participants.\nFilm and Drama Finance Fund was established on August 5, 2023 after the Rules for the Fund were notified. A seed money of Rs. 1 billion was initially allocated as Technical Supplementary Grant to establish the Fund. A Fund Management Committee, comprising ex-officio members and members of film Fraternity, was later notified by the Ministry to manage the Fund.\nThe participants of the meeting appreciated the Ministry’s efforts for the inclusion of the Fund in the Thirteenth Schedule of the Income Tax Ordinance, 2001 that will enable the contributors to the fund, tax exemptions in similar manner as those granted to companies in the ambit of Corporate Social Responsibility (CSR).\nDirector General Directorate of Electronic Media and Publications , Ms. Samina Farzin, in her welcome address, thanked the Information Secretary and apprised the participants regarding the working of the Film and Drama Finance Fund and the functions of the Fund Management Committee.\nThe meeting was attended by ex-officio members of the Fund Management Committee from Ministry of Finance , FPCCI as well as eminent members of the film fraternity including Chairman PFPA, Zulfiqar Ahmed Mana, Nadeem Mandviwalla, Shezad Rafique, Syed Noor , Satish Anand, Aijaz Gul, Bilal Lashari, Wasay Chaudhary and Kamran Jawaid Sarmad Khoosat, Badar Ikram and Irfan Malik among others.",
  "retrievedAt": "2025-08-11T09:42:22.091Z"
}
