{
  "title": "NBP donates Rs. 80 mln to support households under COVID-19 pandemic",
  "link": "https://www.app.com.pk/national/nbp-donates-rs-80-mln-to-support-households-under-covid-19-pandemic/",
  "date_published": "2020-05-21T01:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP):National Bank of Pakistan has topped up its earlier contributions towards combating coronavirus pandemic by donating another Rs. 80 Million to support over 26,000 financially vulnerable households.\nThe initiative is a part of its on-going Corporate Social Responsibility (CSR) plan to respond to the COVID-19 pandemic.\nThis donation will support over 26,000 households belonging to the disadvantaged segment of society who have been most affected due to the lockdown across the country, said a press release here on Thursday.\nThis gesture endorses the fact that NBP as always stood by the nation to promote the well-being of deprived and marginalized segments of the society in Pakistan.\nTo combat the unprecedented situation in the country,NBP has adopted a multi-pronged approach of giving back to deserving members of society as part of its social responsibility.\nIn the first phase of its efforts, NBP collaborated with Karachi Relief Trust (KRT), a disaster management volunteer group, because of its impeccable track record.\nNBP’s donation of Rs. 20 million to KRT helped provide rations to over 6,500 households comprising of deserving daily wage earners and their families.\nIn the second phase of its CSR COVID19 response plan, NBP, in a unique initiative donated Rs. 60 million to five Non-Bank MicroFinance Companies (NBMFCs) for onward donation to their customers across Pakistan whose incomes have been poorly affected by lockdowns.\nThese households have been operating their micro and small businesses financed by small loans from the NBMFCs and due to the current situation their incomes have been significantly reduced. 20,000 deserving households across the country will benefit from NBP’s donation through NBMFCs.\nNBP’s strategic partnership with NBMFCs is part of a larger initiative under COVID 19 pandemic to play a leadership role and provide a holistic response including financial support to the Microfinance sector which serves over 7 million households across Pakistan.\nThe Bank has been supportive of Microfinance sector in the past and will now enhance its focus as part of its Inclusive Development strategy with the aim of improving financial inclusion in Pakistan.",
  "retrievedAt": "2025-08-11T19:14:41.072Z"
}
