{
  "title": "SCO Sec Genl highlights China’s global governance vision to strengthen multilateral cooperation",
  "author": null,
  "content": "ISLAMABAD, October 15 (APP): The Secretary General of the Shanghai Cooperation Organization (SCO), Nurlan Yermekbayev on Wednesday underscored China’s pivotal role in advancing global governance and multilateral diplomacy within the SCO framework during a webinar titled “Post-Tianjin SCO Summit: Achievements and Prospects for Multipolar Regional Cooperation.”\nIt was organised by Centre for SCO Studies – Institute of Peace and Diplomatic Studies (IPDS) and Pakistan SCO Friendship Forum.\nAddressing the participants, Secretary General Yermekbayev described the Tianjin Summit as a defining moment in shaping the SCO’s next decade of cooperation.\nHe said 66 proposals were presented by member states, including the decision to establish the SCO Development Bank,  a step aimed at supporting sustainable growth, clean energy, and scientific innovation across the region.\nHe emphasized that China’s Global Governance Initiative (GGI), rooted in inclusivity and respect for sovereignty, is helping shape a fairer international order and expanding the SCO’s capacity as a platform for dialogue and collective action.\nHe further noted that the SCO’s vision aligns with China’s broader approach to building a community with a shared future, adding that such initiatives have positioned the organization as a leading regional model for cooperation and mutual trust.  In her welcome remarks, Dr.\nFarhat Asif, IPDS President, welcomed the distinguished guests and participants.\nShe highlighted the Institute’s ongoing efforts to promote informed policy dialogue, research, and training in public and regional diplomacy. She also introduced the Centre for SCO Studies as Pakistan’s first dedicated platform for advancing research, academic engagement, and public diplomacy within the SCO framework.\nFrom China, Yu Xueyong, Deputy Secretary-General of the Good-Neighborliness, Friendship and Cooperation Commission of the SCO, elaborated on Beijing’s efforts to strengthen the SCO through practical cooperation, especially during China’s Chairmanship throughout the year until the Tianjin SCO Summit. He has highlighted that during the chairmanship, China has organized over 200 events, signed 99 cooperation documents, and launched 36 joint projects, thereby deepening solidarity and people-to-people ties among member states.\nDr. Andrey K. Krivorotov, Research Fellow, Institute of China and Contemporary Asia, Russian Academy of Science, noted that the Tianjin Summit reaffirmed shared support for multipolarity and closer coordination between Moscow and Beijing on global governance issues.\nDr. Anton Sergeevich Dudaranak, Head of Division, International Policy Department, Belarusian Institute of Strategic Research from Belarus,  said that the SCO and BRICS frameworks are becoming engines of South-South cooperation and regional resilience.\nDr. Lidiya Parkhomchik, Chief Researcher of the Institute of World Economics and Politics (IWEP) of Kazakhstan, highlighted the growing importance of environmental and transport connectivity under China’s Belt and Road Initiative.\nAt the same time, Dr. Sarwat Rauf, Head of the Department of International Affairs NUML University from Pakistan called for institutional strengthening and regulatory alignment within the SCO system.\nFrom Tajikistan, Dr. Doronshoeva Nekbakht, Head of the US and Canadian Department of the Institute for the Study of Problems of  Asian and European Countries, National Academy of Sciences of Tajikistan, described the SCO as a “symbol of multipolar transition,” citing new regional centres for information and food security as evidence of deepening cooperation.\nDr. Alimardonov Otabek Kudratovich from the SCO Centre of Public Diplomacy in  Uzbekistan highlighted the significance of public diplomacy and people-to-people engagement at the SCO, especially in the growing multipolar world, which is key to advancing the SCO’s mission of shared development and understanding.\nThe webinar was attended by a large number of scholars and researchers, diplomats, and media representatives from across the region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:03:59.273Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sco-sec-genl-highlights-chinas-global-governance-vision-to-strengthen-multilateral-cooperation/",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T21:25:00.000Z"
}
