{
  "title": "NHA to expedite efforts on air ambulance: Aleem Khan",
  "author": null,
  "content": "ISLAMABAD, Oct 15 (APP): Federal Minister for Communications Abdul Aleem Khan has directed the National Highway Authority (NHA) to expedite efforts for the early launching of an Air Ambulance Service on Motorways and Highways to ensure the immediate transfer of accident victims to the hospitals.\nHe emphasized that in the first phase, the heli-service should commence with two helicopters while helipads should also be constructed in the hospitals to facilitate emergency landings as helicopters require minimal space for operation.\nHe made these remarks while chairing a high-level meeting at NHA Headquarters, attended by the Federal Secretary for Communications, the Chairman of NHA and other senior officers, said a press release issued on Wednesday.\nAbdul Aleem Khan stated that effective measures are being implemented to address road accidents on Motorways.\nHe stressed that speed control, vehicle fitness and driver training must be ensured and that prompt medical assistance to accident victims can help save precious lives. He called upon officers to remain committed to protecting citizens’ lives and to pursue the Air Ambulance initiative with a sense of national responsibility, in collaboration with relevant institutions.\nAbdul Aleem Khan further highlighted that NHA’s revenue has doubled over the past year as a result of improved policies and that these funds will be allocated for citizen safety initiatives. He added that the growth in NHA’s financial resources is encouraging and that the Government aims to make the Authority financially self-sufficient in the near future.\nThe minister underscored that every additional rupee generated will be spent purposefully, particularly on public-oriented projects. Abdul Aleem Khan reaffirmed that NHA’s priority is to make the nation’s Highways safer, more efficient and more comfortable for travelers with comprehensive planning and sustained implementation, already underway.\nDuring the meeting, senior officials also briefed the Federal Minister for Communications, Abdul Aleem Khan, on various ongoing and proposed NHA projects, and a number of key policy decisions were finalized.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:05:35.212Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nha-to-expedite-efforts-on-air-ambulance-aleem-khan/",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T16:30:00.000Z"
}
