{
  "title": "Misbah Khar urges youth to promote peace, tolerance, compassion",
  "author": null,
  "content": "ISLAMABAD, Oct 15 (APP):Advisor to the Chairman Senate, Misbah Khar, on Wednesday urged the youth to embrace peace, tolerance, and compassion as guiding principles for building a better and more inclusive world.\nShe was addressing a ceremony held to honour high-achieving students of Westminster School in Bahria Town, Islamabad, where she congratulated the award recipients for their outstanding performance and extended appreciation to their parents and teachers for their dedication and support.\nKhar said the institution’s motto — “Every Student Matters, Every Moment Counts” — truly reflected the spirit of commitment and care that defines quality education and personal growth.\nEmphasising the importance of global unity, she said, “When we see the Earth from space, we don’t see borders or barriers; we see unity — one planet, one human race. Yet, despite all our progress, our greatest challenge remains learning to live together and celebrate our differences without letting them divide us.”\nThe Advisor underscored that peace and tolerance begin at the individual level — in classrooms, homes, and communities — through everyday actions rooted in empathy and understanding. “Peace starts with listening before judging, understanding before reacting, and choosing kindness, especially when it’s not easy,” she added.\nCiting global and national youth icons such as Greta Thunberg and Arfa Karim, she said leadership is not confined to positions of authority but lies in taking responsibility and initiative. “True leadership is about taking responsibility — for your thoughts, your actions, and the difference you can make, no matter how small it may seem,” she said.\nShe observed that the world today faces pressing challenges — from climate change to inequality — but expressed confidence that the younger generation holds the creativity, innovation, and resolve to bring transformative change.\nKhar encouraged students to align their vision with the Sustainable Development Goals (SDGs) and to lead with integrity and compassion.\nQuoting Nelson Mandela, she reaffirmed, “Education is the most powerful weapon you can use to change the world.”\nConcluding her address, Misbah Khar called upon students to believe in themselves, their country, and their power to shape a positive future. “The story of Pakistan — and of our world — is still being written. You are the authors of its next chapter,” she said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:04:22.056Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/misbah-khar-urges-youth-to-promote-peace-tolerance-compassion/",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T21:11:00.000Z"
}
