{
  "title": "President Zardari strongly condemns cross-border attacks from Afghan territory",
  "author": null,
  "content": "ISLAMABAD, Oct 15 (APP): President Asif Ali Zardari, Wednesday, strongly condemned the unprovoked cross-border attacks launched from the Afghan territory on Pakistani border posts in the Spin Boldak area of Balochistan and the Kurram sector of Khyber Pakhtunkhwa.\nThe president termed the attacks a blatant violation of Pakistan’s sovereignty and territorial integrity, and an unacceptable act of aggression.\nHe commended the professionalism and valour of Pakistan’s armed forces for effectively repulsing the assaults and defending the country’s borders, President Secretariat Press Wing said in a press release.\n“President Zardari observed that the Afghan Taliban regime remains in constant violation of the Doha Accord by providing safe sanctuaries to terrorist groups that continue to attack regional countries, thereby destabilising the entire region including Pakistan.”\nHe further noted that the regime had failed to establish a broad-based and representative government in Afghanistan and continued to monopolise power to the exclusion of other political and ethnic groups.\nThe president called upon the authorities in Kabul to ensure that Afghan soil was not used for acts of terrorism or hostility against Pakistan.\nHe emphasised that such provocations undermined regional peace and the long-standing bonds of brotherhood between the peoples of Pakistan and Afghanistan.\nThe president reaffirmed that Pakistan desired peaceful, cooperative relations with all its neighbours, but any act of aggression would be met with a firm and resolute response.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-17T00:06:01.611Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-zardari-strongly-condemns-cross-border-attacks-from-afghan-territory/",
  "dateList": "2025-10-15",
  "date_published": "2025-10-15T13:44:00.000Z"
}
