{
  "title": "Cabinet approves Inter Government Commercial Transaction Act-2022",
  "link": "https://www.app.com.pk/national/cabinet-approves-inter-government-commercial-transaction-act-2022/",
  "date_published": "2022-07-27T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 27 (APP): The federal cabinet on Wednesday approving the Inter Government Commercial Transaction Act-2022 – sent by the Ministry of Law and Justice – recommended for presenting it before the relevant Parliamentary Committee.\nThe meeting of federal cabinet chaired by Prime Minister Muhammad Shehbaz Sharif was told that the proposed law will help boost the confidence of foreign investors and increase foreign investment in the country.\nThe law will also be helpful in the Government-to-Government (G2G) development agreements.\nThe cabinet was told that it was for the first time that a government in Pakistan had taken a step for the protection of G2G agreements and took measures to ensure transparency in that respect.\nThe federal cabinet reviewed the losses caused torrential rains in Sindh and Balochistan provinces.\nThe Prime Minister appreciated the efforts of Chief Mnister Sindh and personally visiting the affected areas to review the relief activities during the rains in Sindh particularly in Karachi and Hyderabad.\nThe cabinet approved the posting of Muhammad Tahir Rai, an officer of the Police Service of Pakistan and former Director General (DG) Federal Investigating Agency (FIA), as National Coordinator on Counterterrorism.\nThe cabinet also approved the posting of Mohsin Butt, a grade 22 officer of the Police Service of Pakistan, as DG FIA.\nThe meeting, on the recommendation of the Ministry of National Health Services and Regulations, approved to enhance the Maximum Retail Prices (MRPs) of the 15 types of imported Cardiac Stents in proportion with the exchange rate.\nThe federal cabinet endorsed decisions of the Economic Coordination Committee of the Cabinet (ECC) taken in its meeting held on July 25, 2022.\nFollowing is the detail of ECC decisions endorsed by the cabinet.\nApproval of the supplementary grant for the Ministry of Information and Broadcasting for fiscal year 2022-23 for holding 75th Independence Day ceremonies. The cabinet appreciated the efforts and role of the Ministry regarding Independence Day celebrations in a befitting manner and highlighting the government’s policies in a best way.\nApproval of the Compensation Package, on the recommendation of the Ministry of Interior, for the victims of terrorist attack at Confucius Institute, University of Karachi.\nApproval of providing electricity to export sector at 9 cent per unity from August 1, 2022.\nApproval of providing RLNG to export sector at 9$ per unit from August 1, 2022.\nRegarding the Exit Control List, the federal cabinet approved 40 cases including for Placement, Removal and One-Time Placement.\nThe federal cabinet also considered the matter of withdrawal of curative review petitions filed against the Supreme Court Judge Justice Qazi Faiz Isa.\nThe meeting agreed that action was taken against Justice Qazi Faiz Isa unnecessarily through unfair use of authority.\nFurthermore, the cabinet agreed that the record in that respect should be made public and after its scrutiny these review petitions would be withdrawn.\nThe cabinet in that respect approved the constitution of an inquiry committee comprising the representatives of all allied political parties including Minister for Kashmir Affairs Qamar Zaman Kaira, Minister for National Food Security Tariq Bashir Cheema and Minister for Education Rana Tanvir.\nThe committee after assessment of the review petitions filed against Justice Qazi Faiz Isa will present a report to the cabinet.",
  "retrievedAt": "2025-08-11T15:18:01.658Z"
}
