{
  "title": "Academia, industry need to work as “Team Pakistan” to uplift IT sector: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/academia-industry-need-to-work-as-team-pakistan-to-uplift-it-sector-ahsan-iqbal/",
  "date_published": "2022-07-27T08:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): Minister for Planning, Development and Special Initiatives, Ahsan Iqbal Wednesday called upon the IT experts from academia, industry and government organizations to jointly work for a holistic development of Pakistan’s IT sector.\nThe minister was addressing a roundtable on ‘Building Human Capital for Digital Revolution’ organized by the Higher Education Commission (HEC), Pakistan in collaboration with the Ministry of Planning, Development and Special Initiatives, Industry, and academic diasporas.\nThe brainstorming session was primarily aimed to garner views of IT experts from academia and industry to align the IT and Computer Science curricula with industry needs and come up with a pathway for growth of the country’s IT sector.\nThe main thrust of this roundtable was to build human capital for digital revolution in Pakistan by bridging the gap between industry needs and curriculum taught, which ultimately enhance employability of IT graduates, along with help boost IT exports and reduce critical software and systems import bill.\nIt was attended by a large number of IT professionals, including faculty members and Project Directors of National Centers of Excellence, as well as heads and representatives of local and international IT companies.\nThe speakers made suggestions on how to ensure industry-readiness of the university graduates, build IT and CS faculty capacity to abreast with latest developments and knowledge, strengthen academia-industry linkages, make HEC and National Computing Education and Accreditation Council’s regulations more effective, and promote applied research.\nForum also suggested to inculcate the applied aspect of IT and CS degree through industry exposure early in graduation and FYP (final year project) must be industry problem-solving oriented.\nSpeaking on the occasion, Ahsan Iqbal directed for constituting a joint academia-industry working group to define a future of action, assign responsibilities, and set time frames for various tasks and projects of IT sector all-inclusive development.\n“We need to ensure that our digital workforce should be a problem solver,” he urged.  He also emphasized that the Pakistani youth need to be motivated to identify the problems of respective field and put in run of the mill to solve by fully exploiting the IT potential.\nHe underpinned the universities need to not only impart education but also inculcate skills to enable the youth to learn latest techniques, be well-groomed, and have best entrepreneurial and communication skills, which would enable them readily employable.&nbsp; Highlighting the importance of making progress on the IT frontiers for the country’s prosperity, he said that there is a need for uninterrupted execution of plans and policies.\nHe stated that no country can make progress unless it witnesses political stability and continuity of policies.  He stressed the need for frequently organizing such sessions and bringing together the academia, industry and IT professionals to keep abreast of the latest trends and developments in the sector and prepare the country’s youth for a digital revolution.&nbsp; Acting Chairperson/Executive Director HEC Dr. Shaista Sohail affirmed that HEC is cognizant of the ever-changing needs of IT and Computing Sciences education.\nShe stressed the need for keeping a watchful eye on the ever-changing market dynamics and improving the entire ecosystem around IT/CS sector.  She held out assurance to the roundtable participants that HEC will always standby and support the IT experts from academia and industry in their efforts to align the curricula of Computing Sciences and related fields with their and the domestic and global market requirements.\nShe enlightened the forum on the mandate of HEC about development of curricula and highlighted the role of National Computing Education&nbsp; Accreditation Council (NAEAC) and National Curriculum Revision Committees (NCRCs).\nShe said HEC is committed to facilitating all the stakeholders to bring about the change required to keep pace with the world in the IT/ CS sector.&nbsp; &nbsp;&nbsp; CEOs, heads, and representative of major IT enterprises expressed their views on the gaps, challenges, and opportunities in the IT/CS sector in Pakistan.\nThe participants were informed that the Computing Sciences curricula is in line with the Association for Computing Machinery (ACM) standards and HEC with Ministry of IT has started negotiation on NCEAC Act to enable Pakistan to sign Seoul Accord on Computing Education.\nThey were apprised that the Pakistani Higher Education Institutions produce 50,000 IT graduates every year.\nThe participants stressed the need for making the Final Year Projects (FYPs) of Computing Sciences students productive by linking them with the real-world industry problem instead of picking up theoretical and hypothetical ideas.\nThey gave a proposal for developing a web portal or setting up a platform for enlistment of IT industry to help allocate students FYPs within their setups or under direct supervision, so employable graduates can be made available to industry and government. Additional Secretary Ministry of IT Ayesha Humaira, CEO Pakistan Software Export Board Mr. Usman Nasir, CEO Ignite Mr. Asim S Hussain, CEO Naya Tel Mr. Wahaj us Siraj,\nSecretary General P@SHA Hira Zainab, CEO Epic Games Fahim Mehta, Chancellor CASE Dr. Shoab Ahmed, Rector Virtual University Dr. Arshad Saleem Bhatti, Chief Commercial Officer Pakistan Special Economic Zones Authority Javed Iqbal, Director (Ecosystem Development) Huawei Pakistan Mr. Li Wenbo and other notable figures from the academia and IT industry expressed their views on the occasion.",
  "retrievedAt": "2025-08-11T15:18:08.654Z"
}
