{
  "title": "Monsoon rains: 105 died, 61 injured in Balochistan: Spokesperson",
  "link": "https://www.app.com.pk/national/monsoon-rains-105-died-61-injured-in-balochistan-spokesperson/",
  "date_published": "2022-07-27T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): At least 105 people died, 61 injured whereas over 1000 have been displaced due to torrential rains and flash floods in Balochistan, spokesperson Farah Azeem Shah said on Wednesday.\nAddressing a press conference here, she said due to recent floods in the province over 5000 livestock and houses were completely damaged, whereas partially loss occurred to over 7000 houses.\nOut of total 220 disconnected roads, around 185 have been restored while work on restoration of 34 was in progress.\nLikewise, the rains also damaged 44 bridges out of which 38 were restored. Different types of machinery including loaders, tractors, excavators was also deployed in the field to carry out relief operation in smooth way.\nThere was no loss occurred to major dams, however 1020 small dams were damaged on which rehabilitation work underway, she maintained.\nSharing details of relief measures taken by the Balochistan government, she said the provincial government continued relief operation in the rain-affected districts by utilising all available resources.\nFarah Shah praised the initiative of the provincial government and the Chief Minister Balochistan Abdul Quddus Bizenjo for issuing compensation money to the families of the people who died due to heavy monsoon rains and floods.\n“The Chief Minister Balochistan Mir Abdul Quddus Bizenjo released Rs. 92.4 million for the families of rain victims and deceased persons,” she said”.\nShe noted that Kech, Turbat Lasbela and Jhal Magsi were the most affected areas. Roads were disconnected, however, after provision of helicopter by the Pakistan Army and the provincial government the relief operations were being carried out on war footing.\nThe Provincial Disaster Management Authority (PDMA), district administration and other departments were pursuing the relief and rescue operations in the rain-affected areas to protect the life and property of the people in the current emergency situation, she added.\nThe Balochistan spokesperson categorically stated that the provincial government would not compromise on relief and rehabilitation of the catastrophe-stricken people.\n“The government is trying its best to provide all possible relief to the rain-hit people by shifting them to safer places,” she said, adding the civil administration was making all out efforts to provide tents, ration and medical facilities to the affectees.\nThe National Highways Authority was also directed for immediate restoration and repair of the structures affected by the rains, she maintained.",
  "retrievedAt": "2025-08-11T15:18:04.355Z"
}
