{
  "title": "Monkeypox outbreak can be stopped: WHO",
  "link": "https://www.app.com.pk/national/monkeypox-outbreak-can-be-stopped-who/",
  "date_published": "2022-07-26T21:04:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Jul 26 (APP):The rapidly spreading Monkeypox outbreak can be stopped, the World Health Organization (WHO) said Tuesday, “with the right strategies in the right groups”.\nBut “time is going by and we all need to pull together to make that happen”, warned Dr Rosamund Lewis, WHO Technical Lead on Monkeypox, who was speaking at the regular press briefing in Geneva.\nOn Saturday, WHO Director-General Tedros Adhanom Ghebreyesus declared the spread of the virus to be a public health emergency of international concern (PHEIC), the organization’s highest level of alert. “Through this, we hope to enhance coordination, cooperation of countries and all stakeholders, as well as global solidarity,” Dr Lewis said.\nWHO assessed the risk posed to public health by Monkeypox in the European region as high, but at the?global level as moderate.\nWith “other regions not at the moment as severely affected”, declaring a PHEIC was necessary “to ensure the outbreak was stopped as soon as possible”.\nThis year, there have been more than 16,000 confirmed cases of monkeypox in more than 75 countries. Dr Lewis said the real number was probably higher.\nShe pointed out that in the Democratic Republic of the Congo, several thousand cases were suspected, but testing facilities were limited. “The global dashboard did not include suspected cases,” she said.\nSome 81 children under the age of 17 were reported as having been infected globally, she added, with the majority of cases being among young men, with the median age being 37.\nFirst identified in monkeys, the virus is transmitted chiefly through close contact with an infected person.\nUntil this year, the virus which causes Monkeypox had rarely spread outside Africa where it was endemic. But reports of a handful of cases in Britain in early May signalled that the outbreak had moved into Europe.\nDr. Lewis pointed out that stigma and discrimination must be avoided, as that would harm the response to the disease.\nMonkeypox could cause a range of signs and symptoms, including painful sores.  Some people developed serious symptoms that need care in a health facility. Those at higher risk for severe disease or complications include pregnant women, children, and immunocompromised persons.\nDr Lewis said WHO was working with member states and the European Union on releasing vaccines, and with partners to determine a global coordination mechanism. She emphasized that mass vaccination was not required, but WHO had recommended post-exposure vaccination.\nVaccine sharing should be done according to public health needs, country by country and location by location. Not all regions had the same epidemiology, she explained.\nDr. Lewis stressed that countries with manufacturing capacity for smallpox and Monkeypox diagnostics, vaccines or therapeutics should increase production.\nCountries and manufacturers should work with WHO to ensure they are made available based on public health needs, solidarity and at a reasonable cost to countries where they were most needed.\nDr. Lewis explained that some 16.4 million vaccines were currently available in bulk but needed to be finished. The countries currently producing vaccines are Denmark, Japan, and the United States.\nShe reminded that the current recommendation for persons with Monkeypox was to isolate and not travel until they recovered; contact cases should be checking their temperature and monitoring possible other symptoms for the period of 9 to 21 days.\n“When someone is vaccinated it takes several weeks for the immune response to be generated by the body”, she said.\nAccording to Dr. Lewis, the name “Monkeypox” is already present in the International Classification of Diseases, and a process had to be followed in order to potentially change its name.",
  "retrievedAt": "2025-08-11T15:18:13.168Z"
}
