{
  "title": "It’s high time for judicial reforms, legislation to safeguard democracy & constitution: Bilawal",
  "link": "https://www.app.com.pk/national/its-high-time-high-for-judicial-reforms-legislation-to-safeguard-democracy-constitution-bilawal/",
  "date_published": "2022-07-27T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 27 (APP): Minister for Foreign Affairs and Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto Zardari on Wednesday said it was high time for effective legislation to safeguard democracy and the constitution, instead of mere chanting slogans.\nLIVE #APPNews : Foreign Minister Bilawal Bhutto Zardari expressing his views in @NAofPakistan #Islamabad @BBhuttoZardari @MediaCellPPP https://t.co/vjMS5XkDs5\nHe expressed these views in the National Assembly while making a demand for constituting a joint parliamentary committee on the judicial reforms through effective legislation.\n“Pakistan’s journey to democracy will remain incomplete without bringing judicial reforms . . . The PPP is ready for it [judicial reforms] as it is an unfinished agenda of the Charter of Democracy (CoD), signed by Shaheed Mohtarma Benazir Bhutto and PML-N (Pakistan Muslim League-Nawaz) Quaid Nawaz Sharif,” he said.\nBilawal said there were certain issues related to the formation of court benches, taking suo moto notices and appointments of judges in superior courts, which needed to be addressed.\nThe foreign minister said the government and the leadership of Pakistan Democratic Movement (PDM) had been requesting the Supreme Court to set up a full court bench for hearing the Punjab chief minister’s election case, and it was not meant to pressurize any institution.\nHe said the full-court bench was imperative when “a constitutional institution was going to decide about the other one and we would have accepted its decision whatever it was”.\nHe said when the previous National Assembly’s speaker and deputy speaker violated the constitution, the PPP had made the same demand as it was the “question of the constitution and democracy’s future”.\n“Our demand for the full-court was neither met at that time, nor now,” he added.\nThe full-court demand was “legitimate” and “in accordance with the constitution”, he claimed, adding the apex court was responsible for the interpretation of the constitution.\nRecounting the sacrifices and services rendered by the PPP leadership for strengthening democracy and ensuring supremacy of the constitution, Bilawal Bhutto said his grandfather along with all the democratic parties had architected the 1973 Constitution after 30 years of independence.\nHe also recalled struggle of her mother Shaheed Benazir Bhutto for the democracy who even lost her life in the process.\nTo amend the constitution, he said, a two-third majority was required in the parliament, where a member reached after getting votes from millions of people. Hence, the support of millions of people was needed to even change a coma in the constitution.\n“We are proud of ourselves that we have restored the 1973 Constitution in its original form by removing black clauses and laws incorporated by a dictator, through the 18th Constitutional Amendment,” he added.\nBilawal said the previous PPP government (2008-13) strengthened the democracy by transferring the power from the President of Pakistan given under Article 58-2(b) to the parliament.\nHe said both the Pakistan Muslim League-Nawaz (PML-N) and the PPP signed the Charter of Democracy for making the institutions independent and ensuring the freedom of expression, but unfortunately efforts were made to impose a “controlled democracy” in the country.\nHe said the parliament and the mandate of people were attacked when the PPP government was striving to curb terrorism, stabilize economy and strengthen democracy during its five-year tenure (2008-13).\nHowever, the PPP government, he added, did not confront with any institution in retaliation and completed its five-year constitutional term peacefully. With that, the country for the first time witnessed smooth transition of power from one civilian government to another.\n“It is the responsibility of all of us to protect the role of parliament . . . The journey to strengthen democracy in Pakistan should not be stopped,” he maintained.\nThe minister said it was not possible for Prime Minister Shehbaz Sharif to resolve, in just three months, all the mess created by the Imran-led government on different fronts, including socio-economic and diplomatic, in the last four years.\n“We don’t need to be apologetic, rather truth should be told to the nation,” he said, adding Imran Khan took record loans and wreaked havoc with the society and economy in just four years.",
  "retrievedAt": "2025-08-11T15:18:01.240Z"
}
