{
  "title": "Govt strengthening state media to represent national narrative: Ch Fawad",
  "link": "https://www.app.com.pk/national/govt-strengthening-state-media-to-represent-national-narrative-ch-fawad-2/",
  "date_published": "2021-06-28T12:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain on Monday informed the National Assembly that several innovative steps were being taken to improve performance of the state media organizations to represent the national narrative at international level.\nUnlike past practice of state media just projecting the ruling party, the incumbent government of Pakistan Tehreek-e-Insaf (PTI) had ensured to use state media as spokesperson of the country, the minister said while winding up debate on demands for grants related to Ministry of Information and Broadcasting Division.\n“Today’s world was a world of public opinion, now wars were fought through rhetoric, the more the narrative was accepted, the more victory would be determined. With the use of advanced technology and strengthening the state media with more allocations, we can effectively fight media war against enemies of Pakistan,” the minister said.\nHe thanked the Ministry of Finance for allocating enough funds to enable state media meet with the international standard. He said a plan of refinements was being introduced in the Ministry of Information and Broadcasting and its departments to face contemporary challenges.\nHe said digitalization of official media including Associated Press of Pakistan (APP), Pakistan Broadcasting Corporation and Pakistan Television (PTV) would be initiated by August this year. He added that the functioning of APP would be on modern lines like any international news agency such as AFP or Reuters.\nHe said that PTV was being made a complete HD channel with having technology and programming of modern era.\nThe minister said Pakistan had offered numerous sacrifices in the war against terrorism but past governments failed to articulate its narrative in an effective way through use of media globally, adding, they did not work vociferously to create public opinion.\nFawad said media was an important tool in the states around the globe to help molding public opinion in their favor. The media could play an important role in promoting the narrative of the states, he added.\nThe minister said wars in the world were now fought through the victory of one’s narrative. Ironically, no heed was paid to that aspect in past, he added.\nHe said recently an info-lab was captured through which it was observed that 845 fake websites were running against Pakistan while disseminating wrong news on sensitive subjects like Balochistan, Kashmir etc. He informed that more than 300,000 tweets were shared from India’s city Ahmadabad.\nHe said all this was happened due to weak media policies of the past governments as they did nothing for image building of Pakistan as well as regarding the media tactics of enemies against Pakistan.\nRather focusing on state media promotion, he said the former governments remained busy in political appointments in the state media organizations burdening the national exchequer.\nHe also raised question on the performance of External Publicity Wing saying that negligence of past governments and less allocations was the main reason behind its low performance.\nHe said there was no threat to journalists and using this issue was actually part of international propaganda to defame Pakistan. He requested the leadership of Pakistan Peoples Party to pass the Journalists Protection Act pending in the standing committee on Human Rights.\nHe made it clear that journalists’ lives were under threats in the tenure of Pakistan Peoples Party as 32 journalists lost their lives in 39 attacks in their tenure while in Pakistan Muslim League’s (N) tenure 14 journalists were killed in 18 attacks.\nHowever, in last three years of PTI government, only eight attempts were made on journalists and all culprits were arrested after thorough investigation.\nHe questioned why Sindh government failed to disclose the names of killers involved in journalist Aziz Memon murder.\nHe asked the PML-N’s spokesperson Maryam Aurangzeb to apologize on running a campaign related with the Pakistan Media Development Authority (PMDA) Ordinance without confirming the authenticity of concerned news as no such ordinance ever existed.\nHe said fake news mainly generate from three to four different places from India then this fake news after getting boost from Afghanistan reaches Pakistan to meet further targets for petty gains.\nHe questioned why UK media had given high coverage to a protest in front of Pakistan embassy and the interview of an organizer was also given coverage by top London media.\nHe categorically said all 250 local and 43 foreign channels were working with full freedom in the country.\n“However there should be unanimity on both sides about all such concerning issues so that we can jointly face the “nexus of evil” against our motherland.”",
  "retrievedAt": "2025-08-11T20:54:07.345Z"
}
