{
  "title": "Govt to extend more facilities to legal fraternity: Governor",
  "link": "https://www.app.com.pk/national/govt-to-extend-more-facilities-to-legal-fraternity-governor/",
  "date_published": "2021-06-28T14:52:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 28 (APP): Sindh Governor Imran Ismail on Monday said that the incumbent government would continue to extend full cooperation and facilitates to the legal fraternity in pursuit of their professional responsibilities.\nHe stated this while meeting a 55-member delegation of lawyers, which called on him here at Governor House.\nOn the occasion, Opposition Leader in Sindh Assembly, Haleem Adil Shaikh, was also present.\nThe delegation was comprised of Wahab Baloch, Anwar Kamal, Riaz Afandi, Mumtaz Gopang, Ali Palh, Bhagwandas Bheel, Ahsan Razi, Ajmal Solangi, Nasrullah Jalbani, Ashraf Samoon, Nadeem Mangi, Khaleek Ahmed, Syed Ahmed Rashid and Abid Akram.\nThey discussed various matters related to legal fraternity and the lawyers apprised the Governor about the problems of their community.\nThe lawyers delegation expressed its concern relating to rule of law in Sindh. They cited corrupt, inappropriate and biased behaviour of Sindh Police as one of the key issues.\n‘General human rights violations and cases of violence against women and children are rampant in the Sindh Province’, the delegation apprised the governor.\nThe Governor Sindh said legal fraternity had always played an active and pivotal role in defending democracy and democratic institutions in the country and that the incumbent government would continue to extend full cooperation and facilities to them in the pursuit of their professional responsibilities.\nImran Ismail stressed that implementation of law should be equal for all, adding, lawyers could play a significant role in this regard.\n“The present government will ensure that the law is implemented in its true spirit and there should be no leverage for anyone”, he maintained.\nThe governor also asked the lawyers to their suggestions for electoral reforms. “The use of modern technology will be essential for free, fair and transparent elections in the country”, he added.\nGovernor Imran Ismail appreciated the healthy discussion and input of the delegation over CPEC component of Sindh.\nHe said the incumbent government was well aware of the lawyers’ problems and issues and asked the delegation to prepare practical recommendations in this regard.",
  "retrievedAt": "2025-08-11T20:54:03.491Z"
}
