{
  "title": "No room for corruption in society: President",
  "link": "https://www.app.com.pk/national/no-room-for-corruption-in-society-president/",
  "date_published": "2021-06-28T17:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 28 (APP): President Dr Arif Alvi Monday said that corrupt leadership always ruined a society and stressed upon collective efforts to root out this evil from society.\nAddressing Employers Federation of Pakistan (EFP) Exporters Recognition Awards 2020 ceremony here at the Aiwan e Sadr, the president reiterated government’s zero tolerance policy towards corrupt practices, and said it was the dishonest leadership that had always robbed a society of its resources and ruined it.\nThe president observed that corrupt practices, besides negatively impacting different fibers of a society, also created uncertainty in the business sector.\nPresident Dr Alvi said that corruption was an anathema to the prime minister and Pakistan Tehreek-e- Insaf’s government.\nAbout government’s business friendly policies, he said, ease of doing business and certain other initiatives had boosted exporters’ confidence.\nThe president termed ‘Look Africa’ policy as a good initiative and underlined to expand exports to these countries, besides further enhancing of diplomatic ties with the African countries.\nThe president also stressed upon the need to encourage women entrepreneurs in the exports sector, highlighting the wider scope for the womenfolk to play their role in country’s progress.\nThe president said that Central Asian Republics, including Tajikistan and Uzbekistan were eager to expand business avenues with Pakistan through regional connectivity.\nHe also termed peace and stability in Afghanistan as vital for regional economic cooperation and connectivity.\nAppreciating prime minister’s austerity drive, the president said, the government drastically reduced its expenditures by slashing unnecessary spending.\n“It is practically proved by the prime minister on his visits abroad, he added.\nThe president further said the government’s smart lockdown policy during Covid 19 pandemic proved very successful when compared with the decisions taken by the Indian government.\nThe industries were kept open during the period as the government had compassion for the plight of poor people, he added.\nThe president also expressed his satisfaction that the nation showed unity during the pandemic which was ‘a paradigm shift’.\nThe president said government had supported the feeble segments of society with Ehsaas programme during the pandemic by extending about Rs 200 billion to them.\nExpressing his confidence in the intellectual capabilities of the nation, the president said “I have firm confidence that Pakistan will move on the road to tremendous progress.’\nThe president also lauded efforts of the exporters and Advisor to Prime Minister on Commerce Abdul Razak Dawood for taking measures to increase country’s exports.\nOn the occasion, PM’s advisor Abdul Razak Dawood said that due to government’s policies, Faisalabad city was now bustling with trade and business activities and even there was shortage of labour.\nHe said the government provided level playing field to all exporters with different business friendly policies including tariff rationalization and waiver of duties on various raw material which helped in reducing the cost of doing business.\nDawood appreciating the role played by the exporters’ community in strengthening of economy, stressed upon them to diversify their products and items with exploring new regions.\nPresident EFP Ismail Suttur and vice president EFP also addressed the ceremony. The President Dr Arif Alvi also gave away awards to the top exporting companies.",
  "retrievedAt": "2025-08-11T20:53:59.943Z"
}
