{
  "title": "NA approves 2 demands for grants worth Rs 49,7 96,506,000 for National Health Services",
  "link": "https://www.app.com.pk/national/na-approves-2-demands-for-grants-worth-rs-497-96506000-for-national-health-services/",
  "date_published": "2021-06-28T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): The National Assembly on Monday approved two demands for grants worth Rs 49,7 96,506,000 relating to ministry of National Health Services, Regulations and Coordination Division for the next fiscal year, rejecting all 175 “Cut Motions” moved by the opposition parties to reduce developmental expenditure for various projects and schemes.\nParliamentary Secretary Zain Qureshi moved the demands for grants one by one in the House.\nThe House approved demands after the debate, with voice vote, that included Rs 28,074,000,000 and Rs 21,722,506,00 to meet expenditure of Ministry of National Health Services, Regulations and Coordination Division during the year ending on June 30, 2022.\nOpening debate on Cut Motions, Dr Nisar Cheema of Pakistan Muslim League (PML-N) the government has abolished Pakistan Medical and Dental Council which was symbol of identity and set up Pakistan Medical Commission.\nHe alleged that non-professional people and owners of private medical colleges were inducted in Pakistan Medical Commission.\nHe demanded that PMDC should be revived and only professional people should be inducted in it.\nMehreen Razzaq Bhutto of PPPP said the ministry had not service and coordination. She said numbers of irregularities were detected in various departments.\nShe urged for concrete strategy for COVID-19.\nShe alleged that people were not getting their 2nd vaccination dose due to shortage of vaccine.\nMaulana Abdul Akbar Chitrali of Muttahida Majlas e Amal Pakistan (MMAP) said that all past governments including PPPP and PML-N did nothing for health and education sectors.\nHe said “There is no state of the art hospital even available in the federal capital. The Pakistan Institute of Medical Sciences and Poly Clinic also lacked facilities, he added.\nMehnaz Akbar Aziz of PML-N alleged that there had been no pro-poor health policy in the country.\nShe said Coronavirus vaccine was not available in the country which was approved by World Health Organization. She claimed that Drug Regulatory Authority was not yet functional which needed immediate attention.\nDr Mahesh Kumar of PPPP said that there was shortage of COVID-19 vaccine as it was not acquire on time.\nHe sought details of vaccine provided free of cost by countries and purchased from other countries.\nSalahuddin Ayubi of MMAP pointed out that no free treatment of cancer and other fatal diseases were available in the public hospitals.\nDr Darshan of PML-N appreciated the doctors and paramedic staffs for rendering supreme sacrifices during COVID-19 pandemic.\nDr Shazia Sobia of PPPP claimed that the government did not give any health policy during COVID-19 pandemic.\nWinding up debate on the Cut Motions, Parliamentary Secretary for National Health Services Dr Nousheen Hamid said the Pakistan Tehreek-e-Insaf (PTI) led government was paying full attention to the health sector adding that health reforms was top agenda of the government.\nShe said health Insaf Cards were given to all people in Khyber-Pakhtunkwa, Gilgit-Baltistan and Azad Kashmir. Being a flagship programme of the government, health card was also being provided to the people of Islamabad and Punjab, she added.\nThe Sindh province did not provide health card to the people so far, she said.\nRegarding COVID-19 pandemic, she said the whole world including the World Health Organization acknowledged Pakistan’s policy to contain the pandemic.\nShe said Bill Gates had also appreciated Pakistan’s efforts for containing the pandemic and steps taken for strengthening the economy.\nShe said the federal government provided vaccine to Sindh government and the provincial government did not purchase a single doze so far.\nShe said the government had already purchased vaccine worth Rs 192 billion so far. An amount of $ 1.1 billion was allocated in the budget for purchase of the vaccine, she added.\nThe Parliamentary Secretary said the government had prepared a project for stunting growth and mother child care with coordination of the province. She said number of lady health workers would also be increased.\nNousheen Hamid said 200-bed each hospitals were being set up in Tarlai and Tarnol while 5 acres land was also acquired for setting up Poly Clinic Hospital-2 in G-11.\nShe said the government has also acquired land for setting up first nursing university in the country to cope with shortage of nurses. The university would start functioning in July 2021, she added.\nRegarding production of vaccine, she said Pakistan had started local production of COVID-19 vaccine and manufactured 0.9 million doses this month while 3 million doses would be manufactured in next month.",
  "retrievedAt": "2025-08-11T20:54:05.161Z"
}
