{
  "title": "Pakistan’s all indicators are positive, says President Arif Alvi",
  "link": "https://www.app.com.pk/national/pakistans-all-indicators-are-positive-says-president-arif-alvi/",
  "date_published": "2021-02-13T18:15:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 13 (APP):President Dr. Arif Alvi on Saturday said that Pakistan was at tipping point, progressing and all indicators were positive.\nHe stated this while addressing to a ceremony on ‘Screening of Docudrama -2021 Paani Ke Pankh’, which is about Mohmand Dam and it was dubbed by its producer Tooba Baig as ‘(From) War to Water’, at Sindh Governor House here.\nPresident Arif Alvi said that water should be used in accordance with the needs in the country and the construction of dams was need of the hour.\nHe said that the docudrama presented two facets one was that how the country fought war on terrorism and restored peace and second was importance of water.\nHe said that Pakistan sacrificed about 70 to 80 thousand lives in war against terrorism.\nHe further said that Pakistan was a successful and experienced country in the world in defeating terrorism.\nThe President lauded the sacrifices of Pakistan Army and also paid tribute to the force.\nHe said, ‘We learnt that we do not have to go into polarization as India has polarized.’\nHe said that if India created unrest in its own land then it would also had repercussions on Pakistan.\nHe further said that if any bad situation surfaced in Afghanistan then its repercussions would also had on our country.\nPresident Alvi said that the federal government had planned to provide water to Karachiites and he hoped that K-VI project would help reduce the difficulties of the citizens in term of water.\nHe said that the lining of canals was ongoing. He also stressed the need for introducing pricing in the field of agriculture to use water with care.\nPakistan was progressing at this time, he said adding, ‘Now, We have relations with the United States of America and other countries on the basis of trade instead of aid.’\nHe said that in the situation of Covid-19, the Prime Minister had said that he did not want to have complete lockdown because he cared about the meals of the poor and later the world endorsed the same idea.\nSindh Governor Imran Ismail and Federal Minister for Water Resources Faisal Vawda also spoke on the occasion.\nLater, President Arif Alvi was given a souvenir by the WAPDA Chairman lieutenant General (Retd) Muzamil Hussain.",
  "retrievedAt": "2025-08-11T20:21:14.866Z"
}
