{
  "title": "Italian diplomatic mission visits Banbhore",
  "link": "https://www.app.com.pk/national/italian-diplomatic-mission-visits-banbhore/",
  "date_published": "2021-02-13T13:23:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 13 (APP):The Ambassador of Italy in Pakistan HE Andreas Ferrarese accompanied by the Consul of Italy in Karachi HE Danilo Giurdanella and other Attaches visited the site of ancient capital of Sindh i.e. Banbhore on Saturday.\nSindh Minister for Culture, Tourism and Antiquities Syed Sardar Ali Shah, Secretary Ghulam Akbar Laghari and Director General Antiquities Manzoor Ahmed Kanasiro welcomed the Italian delegation, said the statement released here.\nThe Ambassador and the Consul General were on their first visit to Banbhore, and they were apprised about the historical significance of the site. They visited the excavation area, old mosque area, and the museum of Banbhore.\nThe Minister Syed Sardar Ali Shah briefed them about the history of Banbhore and said that Banbhore was the ancient capital of Sindh, so there are thousands of stories lying under this site which are waiting to be unearthed.\nSyed Sardar Ali Shah said that the archaeological mission of Italy under the supervision of Professor Valeria has worked tremendous on the site of Banbhore, and that of Makran as well. But due to the CoviD-19, they couldn’t visit Sindh the previous year.\n“The Department is committed to get the research work published as soon as they come and resume the research work”, he further elaborated.\nHe said that Ranikot fort should also be researched as it’s still a virgin site, and nobody knows about its confirmed origin yet.\nHe said that the fort is built by the stone, and the Italians are expert in this regard. We want to establish a Radio-Carbon laboratory in Jamshoro or Karachi with Italy, wherein the infrastructure would be provided by the Government of Sindh, whereas the scientific assistance would be sought from Italy.\nHe said that the cultural samples from the sites could only be decoded with the help of Radio-carbon scientific laboratories\nThe visiting delegation and the Minister Culture agreed that the cultural exchanges between Italy and Sindh would be initiated once the Covid episode is over.\nThe Minister said that after the 18th amendment in the Constitution of Pakistan, the archaeology and tourism is the provincial subject.\nThe Secretary Ghulam Akbar Laghari briefed the Italian diplomatic delegation about the significance of Banbhore for its history, culture and folklore of Sindh.\nThe Ambassador and the Consul General took keen interest in knowing the historical and cultural aspects of Banbhore, and asked many questions from the Secretary Culture Ghulam Akbar Laghari.\nThe Ambassador of Italy HE Andreas Ferrarese informed the Minister that there are a lot of cooperative work being done between Pakistan and Italy in different sectors including archology, energy, trade and commerce.\nHe said that he was grateful for the hospitality as he has experienced in Sindh, and felt wonderful after knowing the civilizational history of Sindh that is quite similar than that of Rome.\nThe director general Antiquities Manzoor Ahmed Kanasiro and Director Heritage Abdul Fatah Shaikh briefed the diplomatic delegation about the archaeological work done at site, and showed them the artefacts showcased in the Museum.\nThe Minister Syed Sardar Shah presented the delegation with cultural gifts of Sindh, the Ajrak and the trilingual Ganj of Shah Abdul Lateef Bhittai as republished by the department.",
  "retrievedAt": "2025-08-11T20:21:19.727Z"
}
