{
  "title": "First lady inaugurates exhibition of goods prepared by intellectually challenged youth",
  "link": "https://www.app.com.pk/national/first-lady-inaugurates-goods-exhibition-prepared-by-intellectually-challenged-youth/",
  "date_published": "2021-02-13T11:37:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 13 (APP):First lady  Samina Alvi here on Saturday inaugurated an exhibition of goods prepared by intellectually  challenged local youth.\nThe day long event themed “Hunarmand” was organized at Markaz e Umeed, the alma mater of these special entrepreneurs with the motive to mark beginning of their economic independence at a time when world in general was exposed to Covid 19 induced global challenges.\nMs. Alvi expressing her interest in efforts being made for empowerment of the special individuals emphasized on the introducing the concept of inclusiveness and inquired about the strategy being adopted to enhance capacities as well as level of acceptance for such persons.\n“Objective of the exercise is to groom intellectually challenged as low investment entrepreneurs and help them gain financial self reliance,” said Anusha Ali, Rehabilitation Manager of the rehabilitation cum training and education center.\nThe first lady was informed that the center was celebrating its 50th anniversary this\nyear which was established to meet the education cum rehabilitation needs of special children mainly belonging to low income segments of society free of charge through the support of local philanthropists.\nThe school presently being run in two shifts, was said to had dedicated its morning shift for children with compromised capacities encompassing intellectually challenged as well as those with any sort of impairments.\nHence, she said, the center was providing package of special education and training, in accordance to their respective needs.\nThe first lady was informed that a pragmatic approach has been adopted for\nsocio-economic rehabilitation of the youth, who were attending the school since their childhood under which collaboration has been developed with different institutions.\nThis approach enabled the young graduates to be groomed as skilled souls ultimately paving their way towards empowerment.\nMs. Alvi was informed that a number of furniture pieces, placed in the center, were made by its very own graduates trained in carpentry while some of its students had also participated in different international events including special olympics and clinched medals for the country.\nEarlier, Zulfiqar, representing special group three, recited Surah e Fateha and his group fellow Yusra Fatima presented welcome address. Whereas students from special grade five performed on a national song and were appreciated for their effort.",
  "retrievedAt": "2025-08-11T20:21:20.412Z"
}
