{
  "title": "Sarwar visits Chahan Dam to review ongoing construction work progress",
  "link": "https://www.app.com.pk/national/sarwar-visits-chahan-dam-to-review-ongoing-construction-work-progress/",
  "date_published": "2021-02-13T14:46:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Feb 13 (APP):Federal Minister for Aviation Ghulam Sarwar Khan Saturday visited Chahan Dam site to review progress on the ongoing construction work.\nHe was briefed by authorities about the ongoing construction work on the site and Ring road project.\nTalk to the media persons, the minister said the dam would be completed at cost of Rs 6 billion to provide clean drinking water to the Union Councils of Dhamyal, Garja, Dhaman Syedan, Lakhan, Chak Jalaluddin and Kalial and others, adding that provision of basic amenities of life to the masses was the topmost priority of the incumbent government.\nSarwar expressed satisfaction over the pace of work and also directed the concerned agencies to complete the work on time.\nRawalpindi Ring Road is a mega development project which will be completed at the cost of Rs 65 million will not only resolve lingering problems but also help to improve socio-economic conditions of the local people.\nThe minister said the Ring Road would directly connect the three cities including Rawalpindi, Islamabad and Attock. The residents of Chakwal and Jhelum will also benefit from it.\nThe proposed length of the Rawalpindi Ring Road project is 64 km, and will start from N-5 near Radio Pakistan in Rawat. The road will be connected to M-1 and M-2 and would cross N-5 to connect with Islamabad and end at Sangjani.\nThe road will have six lanes and eight interchanges, and a wholesale fruit and vegetable market at its starting point near Rawat. In addition, the proposed project includes the construction of a health city, dry ports, bus and truck terminals and theme parks along the Ring Road, he said.\nThe government was committed to build the reservoirs keeping in view the country’s future water needs, Sarwar added.\nHe said the previous governments of Pakistan Peoples’ Party and Pakistan Muslim League-Nawaz made the water issue so complicated but did not given required attention to the matter.\nReplying o a question, he claimed the Pakistan Democratic Movement (PDM) would not resign from assemblies and they were only giving and announcing dates in that regard.\nHe asked the opposition parties to sit with the government on national and international issues such as Covid-19, threats from India, Kashmir issue, electoral reforms and economic problems excluding amendment in the NAB law and corruption cases.",
  "retrievedAt": "2025-08-11T20:21:17.154Z"
}
