{
  "title": "Sindh CM takes notice of gun attack on anchorperson Imtiaz Mir in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Chief Minister Murad Ali Shah on Monday took notice of an attack last night on Metro 1 News anchorperson Imtiaz Mir in Karachi’s Malir area that injured him.\n\nAccording to a statement issued by the Saudabad police station late last night, Mir was shot and injured by unknown gunmen in Malir district’s Kala Board area. “It seems to be targeted,” said the statement, adding that further investigation was under way.\n\nCM Shah took notice of the “murderous attack on senior journalist Imtiaz Mir”, said a statement issued by the CM’s spokesperson, Abdur Rasheed Channa.\n\nExpressing deep regret over the incident, the chief minister sought a report on the incident from Sindh Inspector General Ghulam Nabi Memon.\n\nSaudabad Station House Officer (SHO) Atiqur Rehman told Dawn.com, “The journalist is admitted at the intensive care unit of [a] private hospital.”\n\nHe added that Mir sustained two bullet wounds, including one on the mouth. “He was travelling in a car, which his brother was driving, when armed pillion riders targeted him at Malir’s Kala Board,” SHO Rehman said.\n\nSindh Home Minister Ziaul Hassan Lanjar, in a statement earlier today, condemned the attack and ordered the immediate arrest of the perpetrators. He also sought a report from the East district’s deputy IG.\n\n“Protection of journalists and media workers should be ensured at all costs,” Lanjar was quoted as saying.\n\n“Protection of the lives and property of citizens is the top priority of the government. The suspects should be brought to justice,” he asserted.\n\nThe police were also directed to reveal the motives behind the attack, the statement added.\n\nAccording to a report published earlier this month by the Commonwealth Human Rights Initiative (CHRI), 87 journalists were killed in Pakistan between 2006 and 2023, with only two of those cases “resolved”.\n\nIn May, police in Shikarpur claimed to have killed Sheroo Mahar — a notorious dacoit nominated as the prime suspect in the murder case of senior journalist Jan Mohammad Mahar in August last year — in a drone attack in the kutcha area of the district. The journalist, who worked for Sindhi language KTN news network, was shot dead by unknown assailants who had opened fire on his car after he left his office in Sukkur in late evening hours on August 14, 2024.\n\nIn April, the Pakistan Federal Union of Journalists (PFUJ) expressed concern over threats issued to journalists by supporters of a religious party.\n\nThe same month, Khairpur police claimed to have arrested five suspects allegedly involved in the murder of journalist Allah Dino Shar aka A.D. Shar, who worked for an Urdu news channel. Shar was murdered in Aliabad within the jurisdiction of Thari Mirwah police station, sparking protests by his community at press clubs across Khairpur district.\n\nIn November last year, Nadeem Ahmed, a senior reporter at 92 News TV channel, was shot at and wounded in an armed attack in Karachi’s Karsaz area.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/22155346e471f39.webp",
  "retrievedAt": "2025-10-12T00:08:18.222Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943869/sindh-cm-takes-notice-of-gun-attack-on-anchorperson-imtiaz-mir-in-karachi",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T11:36:35.000Z"
}
