{
  "title": "Efforts to keep TLP contained keep Lahore on edge - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Containers placed at key points to prevent march on Islamabad\n• Over a dozen cops injured in clashes; outfit claims casualties due to violence\n• Minister says TLP using ‘Gaza March’ as pretext to spread unrest\n\nLAHORE: The city remai­ned on edge throughout Thur­sday after late-night clashes between the police and the Tehreek-i-Labbaik Pakistan (TLP) left several people injured, including around a dozen policemen.\n\nThe standoff came following a call by the religious outfit to march on the federal capital, where it planned to stage a protest outside the US embassy in solidarity with Palestinians.\n\nIn a bid to prevent the group from following through on its plans, authorities cracked do­wn, cordoning off the Mult­an Road headquarters of the TLP with shipping containers and sealing the city’s entry/exit points.\n\nMeanwhile, in Islamabad, the administration also placed containers at entry points to keep protesters at bay. More than 100 TLP supporters were also rounded up in the capital.\n\nAfter clashes with Lahore police a night ago, the TLP had called on its supporters to converge on the provincial capital for a ‘final call’ on Friday (today).\n\nThis worried police, who feared the protest might turn violent and took extraordinary security measures across the province to maintain law and order. As a result, citizens, particularly those living in the densely populated areas from Chauburji to Yateem Khanna Chowk, faced inconvenience.\n\nDespite the added security measures, the situation remained tense, especially on Multan Road. The artery remained closed to all kinds of traffic as charged TLP supporters took positions in improvised shelters erected on the road, ready to pounce on police. On Thursday afternoon, the TLP supporters and the police faced off again, resulting in a skirmish. The religious outfit, however, ransacked some businesses and damaged vehicles.\n\nThere were contradictory reports about casualties, as TLP claimed at least two of its workers were killed. However, police sources acknowledged only one death, saying the body had been handed over to the TLP for burial.\n\nThe outfit also claimed that 50 of its workers sustained injuries, but police sources put the number at only seven. Over a dozen policemen were also injured in the violence since Wednesday night.\n\nA senior police officer told Dawn on anonymity that the Nawan Kot police station was lodging FIR under anti-terrorism and other offences against hundreds of TLP activists and supporters. He said TLP chief Saad Rizvi would also be nominated besides many central leaders of the party.\n\n‘Unrest and anarchy’\n\nSeparately, Minister of State for Interior Talal Chaudhry on Thursday accused the TLP of attempting to spread unrest and anarchy in the country under the pretext of a so-called ‘Gaza March’.\n\nSpeaking to reporters outside Parliament House, Mr Chaudhry said the government had always facilitated peaceful protests under legal procedures and standard operating protocols, but the TLP neither sought permission nor assured compliance with any law. “Was the TLP planning a protest or plotting violence? I will show you the difference,” he remarked.\n\nThe minister said that several individuals arrested in Punjab and Islamabad were found carrying batons, chemicals, glass marbles, tear gas shells and guns, and face masks, which, he said, indicated violent intent rather than peaceful demonstration.\n\n“Does this look like a peaceful protest or an attempt to incite violence?” the state minister questioned, adding that those detained were confirmed to be the TLP office-bearers.\n\nHe called the TLP a “mercenary-like group” that operates under the garb of religion and said the organisation was deliberately trying to divert national attention from security issues.\n\n“It was shameful that you were spreading blatant lies and giving false statements on social media regarding the deaths of your workers. Does our faith allow such things?” the minister added.\n\nKalbe Ali in Islamabad contributed to this report\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e86576223f7.jpg",
  "retrievedAt": "2025-10-12T04:16:57.581Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947779/efforts-to-keep-tlp-contained-keep-lahore-on-edge",
  "dateList": "2025-09-22",
  "date_published": "2025-10-10T01:44:56.000Z"
}
