{
  "title": "Asia Cup: Five key takeaways from Pakistan’s rematch against India - Sport - DAWN.COM",
  "author": null,
  "content": "Most of us Pakistan fans may not admit it, but we hope. We hope against hope when our team takes on India. Before the first ball is bowled, we tend to somehow forgo a few harsh realities and the reality that underlines all of them; India are way better.\n\n“Farq hai yaar (there’s a difference),” as my colleague put it right after Tilak Varma clattered Shaheen Afridi past deep square-leg for a four to wrap things up. “It’s a gulf in fact, a huge gulf of quality,” he concluded.\n\nHis short analysis summed up Sunday’s Super Four fixture, which India comfortably won by six wickets with seven balls to spare. Pakistan genuinely came back stronger, impressing with the bat early on, but the “gulf” glared the brightest when Indian openers Abhishek Sharma and Shubman Gill were at the crease.\n\nWith their opening partnership of 105 off 59, Gill and Abhishek — the two friends from the Indian Punjab — set the match aside for India, neutralising Faheem Ashraf and Haris Rauf’s decent show with the ball that came later on.\n\nThe openers’ ability to play the field made Pakistan’s bowlers look ordinary in the first half of India’s chase as they once again put on display their wide range of shots.\n\nWhen Pakistan bowled even slightly short, Abhishek and Gill jumped back into their respective creases and bashed away through the leg-side and square through the off-side.\n\nWhen the Pakistan bowlers pushed it fuller, the duo would use their powerful wrists to clear the boundary.\n\nIt wasn’t all about power for Gill and Abhishek; they had enough presence of mind to find gaps with pure timing and placement. Applying that kind of world-class skill, they combined to hit 14 fours and five sixes — all of the maximums hit by Abhishek.\n\nWhile the pitch didn’t offer much to the fast bowlers with the new ball, it had enough for the spinners in it, and taking nothing away from Gill and Abhishek, Pakistan spinners Saim Ayub and Abrar Ahmed were poor.\n\nThey were clueless against the Indian openers, failing to find the right lines and lengths on a consistent basis, bowling too short or too full and lacking in pace variation good enough to pose any threat to the batters.\n\nAbrar. who came into the match with an economy rate of less than four in the Asia Cup, gave away 10.50 an over on Sunday – a total of 42 runs in his four overs. Saim — more of a part-timer — on the other hand, had the opportunity to add to his better show with the bat earlier, but leaked a mammoth 35 in these three overs.\n\nBy the time Abrar and Saim were pulled out of the attack, India had completed more than half of the job.\n\nDespite getting more than a decent start as Pakistan cruised at 91-1 — thanks to Sahibzada Farhan’s fifty and impressive contributions by Fakhar Zaman and Saim — Pakistan struggled massively to continue the momentum from early on. Why though?\n\nA middle-order incapable of attacking stroke play. The national side before this match had gone with Hasan Nawaz as their only middle-order pinch hitter — yes, his form, like all his colleagues, wasn’t the best — but replacing him with Hussain Talat, a totally different breed of a batter — was a highly questionable move from the Pakistan team management.\n\nThe left-hander returned a paltry 10 off 11, and the decision to send Mohammad Nawaz and himself over the likes of Mohammad Haris and Faheem — who have much more of the ability to go big — was criminal by Pakistan captain Salman Ali Agha in a period when Indian medium-pacer Shivam Dube flourished.\n\nNawaz, who seemed completely at sea in front of the Indian spinners, was stuck in his crease, absolutely failing to use his feet, and added 21 off 19.\n\nSalman, meanwhile, avoiding strike in the last over, proving critics right over his place in the Pakistan T20 side, scored 17 off 13.\n\nPakistan’s start was refreshing. The side’s openers came into the match with a bad-boy attitude, a kind of naughtiness in their demeanour and smartness to back it up with.\n\nSahibzada and Fakhar were getting under the skins of Indian stalwarts Jasprit Bumrah and Hardik Pandya — at times exchanging words with them on the pitch.\n\nAfter being dropped by Abhishek at third-man off Pandya, Sahibzada responded with bravery, seeing off Bumrah’s pinpoint Yorkers with equal amounts of precision and forcing the bowler to miss out on the right lengths as the right-hander from Peshawar posted a 38-ball 50.\n\nHis hits were clean and oozed with confidence as Fakhar also manipulated the Indian bowlers’ minds on the other end. Had it not been for a clearly wrong decision that went against his way, the seasoned southpaw may have made it slightly more difficult for India to continue their dominance over Pakistan.\n\nSaim, who had started the Asia Cup with three ducks, meanwhile, improved from his past performances to hit 21 off 17 — that straight hit for six off Kuldeep Yadav — underlining his potential. But the left-hander’s contribution came only after he was dropped by Kuldeep when he had only single figures against his name.\n\nApart from the openers, only Haris Rauf and Faheem Ashraf came up with a fight. Haris, in fact, was continually in the face of the Indian batters despite his team being on the back foot in the context of the match. He backed his aggression up with fiery pace bowling as well, destroying the stumps of Sanju Samson and getting the Indian skipper out for his two wickets and gave away a mere 26 runs in his four overs.\n\nFaheem, meanwhile, gave away 31, but still caused problems for the Indian batters — although that came about too late for Pakistan — especially producing a peach of a delivery to clean up Gill through the gate.\n\nMore of that, and at the right time, is required if Pakistan are to make it to the finals. And against Sri Lanka on Tuesday, Salman and co have to prove that they are at least capable of beating decent sides in the world if not the best like that of India.\n\nHeader image:",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/220154372c69548.webp",
  "retrievedAt": "2025-10-12T00:09:01.297Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943715/asia-cup-five-key-takeaways-from-pakistans-rematch-against-india",
  "dateList": "2025-09-22",
  "date_published": "2025-09-21T20:53:14.000Z"
}
