{
  "title": "Khokhar to file appeal as SC registrar returns plea seeking fixation of cases against 26th Amendment - Pakistan - DAWN.COM",
  "author": null,
  "content": "Tehreek-i-Tahafuz-i-Ayeen-i-Pakistan (TTAP) leader Mustafa Nawaz Khokhar on Monday announced he would challenge the Supreme Court (SC) registrar’s decision to return his petition, which sought the court’s intervention to fix the hearing of pending petitions contesting the 26th Constitutional Amendment before a full bench.\n\n“This amounts to undermining and closing the doors of justice. Will file an appeal,” Khokhar said on X.\n\nThe 26th Constitutional Amendment takes away the SC’s suo motu powers, sets the chief justice of Pakistan’s (CJP) term at three years and empowers a special par­liamentary committee to nominate the next CJP from among the three most senior SC judges.\n\nInvoking the inherent jurisdiction of the apex court for the enforcement of fundamental rights under Article 184(3) of the Constitution, Khokhar had pled the apex court on September 4 for the immediate fixation of the pending challenges to the 26th Amendment before the full court, in compliance with the Oct 31, 2024, decision of the judges’ committee under the 2023 Practice and Procedure Act — which called for fixing challenges to the 26th Amendment before a full court.\n\nHowever, the registrar returned the petition in a September 19 notice to Syed Rifaqat Hussain Shah, the advocate-on-record for the petitioner, saying that Khokhar had “not pointed out as to what questions of public importance in the instant case are involved with reference to enforcement of any of the fundamental rights guaranteed under the Constitution, so as to directly invoke jurisdiction of the Supreme Court under Article 184(3) of the Constitution”.\n\nThe notice further said Khokhar was invoking the SC’s extraordinary jurisdiction under Article 184(3) for the “redressal of an individual grievance, which is not permissible” in terms of a prior judgment reported as 1998 SCMR 793, “Zulfiqar Mehdi. Vs. PIA, etc”.\n\n“Ingredients for invoking extraordinary jurisdiction of this court under Article 184(3) of the Constitution have not been satisfied.\n\n“Notice issued to the respondents is not properly drawn as it is not mentioned therein that for what purpose this constitution petition is being filed before this court,” the notice said, adding that multiple prayers were made in one constitutional petition.\n\nLast month, CJP Yahya Afridi had ignored the decision made last year by a committee, constituted under the Practice and Procedure Act 2023, to bring challenges to the 26th Amendment of the Constitution before the full SC.\n\nSince October 2024, multiple petitions have been filed with the SC challenging the amendment, contending that it “abrogates, repeals, alters and destroys the basic features of the Constitution” and “violates” fundamental rights.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:08:18.267Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943918/khokhar-to-file-appeal-as-sc-registrar-returns-plea-seeking-fixation-of-cases-against-26th-amendment",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T14:55:29.000Z"
}
