{
  "title": "The question of Palestinian Statehood - World - DAWN.COM",
  "author": null,
  "content": "As of August 2025, Palestine has been recognised as a state by 147 of the United Nations’ 193 member states. Despite nearly three-quarters of the world’s nations accepting it as one of them, Palestine’s status remains contested. Whilst it has the status of a permanent observer state at the UN, which allows for participation but does not grant voting rights, its actual status seems to be in between — it is neither a state nor entirely not a state. Its status is all the more perplexing given that the issue of how an entity becomes a state in international law is itself highly uncertain.\n\nBecoming a State\n\nStates are formally equal sovereigns in international law and all have the same legal personality. In the international system, they are juridically equal, with inequalities of power between them not affecting this inherent equality. The concept of independence and equality of a sovereign state is one of the axiomatic principles of international law. States remain the most fundamental actors in the global legal order as they are able to actually make international law.\n\nThe question of what is or is not a state was addressed in Article 1 of the Montevideo Convention (1933) which offers the factual criteria necessary for statehood: permanent population, defined territory, effective government and the capacity to enter into legal relations.\n\nHowever, these criteria are themselves debated, and often entities become states without fulfilling all of them. For instance, the International Court of Justice has accepted that a precise delimitation of a state’s borders is not necessary. Arguably, the presence of disputed territory does not prohibit an entity from becoming a state. Moreover, even when a state did not emerge onto the international plane with an effective government (such as in the case of the Democratic Republic of the Congo), this was overlooked in determining it to be a state.\n\nThese criteria have also not been treated as exhaustive. In the Island of Palmas case, it was held that a state had to be independent from another’s control. Furthermore, in the Åland Islands case (1920), it was held that Finland was not a state until a stable political organisation was created and its public authorities could assert themselves throughout the territory without the assistance of foreign troops.\n\nSome commentators have also posited that states should be democratic to be granted statehood, however, in the Western Sahara Advisory Opinion, the International Court of Justice held that there was no rule of international law requiring that the structure of a state follow any particular pattern.\n\nThis is particularly since doing so would discount many states. It has also been argued that the prohibition of racial discrimination is a further criterion for statehood. However, there is no customary international law rule denying statehood to an entity for violating this. For instance, South Africa did not cease to become a state because it was practicing apartheid. These additional factors may however, play a role in other states’ decision to recognise an entity as a state.\n\nRecognition of States\n\nRecognition is the formal acknowledgment of the status of an independent State by other existing states. The role that recognition plays in defining statehood remains controversial and there are two approaches which determine its significance; the declaratory and the constitutive.\n\nUnder the declaratory approach to recognition, a state exists as a subject of international law at the moment at which it possesses the marks of a state as defined under the Montevideo Convention.\n\nAccording to the constitutive approach, the legal existence of a state is dependent upon its recognition by others. Professor Oppenheim asserted that a state becomes an international person through recognition only and exclusively.\n\nHowever, the problem with this theory is the absence of either the duty to recognise or the existence of an agency which is competent enough to adjudicate on this. It means the question of status is entirely dependent upon the individual position of the recognising state.\n\nAnd so a state exists in regard to some states which have recognised it and not in relation to others. In that, what if States X and Y recognise A as a state but State Z does not? Is A a state for the former but not for Z? It is difficult to make sense of this approach, as statehood cannot be relative.\n\nMoreover, much denial of recognition can be politically motivated, but even states that do not recognise another sometimes do ascribe responsibility under international law as they would to a state. For instance, the states that do not recognise Israel still believe it to be bound by the Geneva Conventions as if it were a state.\n\nThe Role of Non-Recognition\n\nWhile recognition may not make a state, non-recognition may prevent one from coming into being. The Security Council and the International Court of Justice have enforced an obligation of non-recognition on states, especially when fundamental principles of international law or peremptory norms are violated.\n\nFor instance, Turkey recognised the Turkish Republic of Northern Cyprus as a state after it used force to impose that entity in the territory. The Security Council placed an obligation of non-recognition of this entity as a state on the international community. The TRNC is still only recognised by Turkey and no other state.\n\nThe Security Council also imposed an obligation of non-recognition on Rhodesia as, if its claim to statehood was accepted, the right of self-determination of the majority of Rhodesians would be violated, given the racist minority regime on which the purported state was found.\n\nSimilarly, in the Wall Advisory Opinion (2004) and the Advisory Opinion on Israel’s policies and practices in Occupied Palestinian Territory (2024), the ICJ imposed obligations on states not to recognise the unlawful situation created as a result of Israel’s illegal actions.\n\nNon-recognition is, practically, the only means by which statehood has been withheld. It operates as a sanction in denying state status to entities which became states through violations of international law.\n\nThe obligation of non-recognition could also be applied to the case of Russia invading Ukraine shortly after signing a treaty recognising the statehood of the Donetsk and Luhansk republics. Russia then claimed that its military operation was in the collective self-defence of these newly recognised states.\n\nThe recognition of statehood here was shrewdly done in order to enable the commission of an internationally wrongful act and therefore should not be recognised by other states. Only two other states, Syria and North Korea, which are allies of Russia, recognise these entities as states.\n\nA Palestinian State\n\nIn 2007, Professor James Crawford in his seminal work, The Creation of States in International Law, stated that “the State of Palestine has not yet become a fact as distinct from an aspiration”. It is unclear whether that is any different today in 2025 than it was in 2007.\n\nOn September 12, 2025, 142 states voted in favour of a two-state solution to the Israeli-Palestinian conflict and it is likely more states are looking to recognise Palestine by the end of this month. If independence from another state’s control is indeed a criteria for statehood, then all of Palestine is currently occupied by Israel, and therefore its statehood is compromised as a result until it can relinquish itself of that control.\n\nHowever, recognition itself in this case may be a way for Palestine to oust Israeli control. It is an indication of the extent to which the international community believes that Palestine’s claim to statehood is valid, and Israel’s denial of it is not.\n\nIronically, if the law relating to non-recognition was followed in 1948, there would be a duty on the international community not to recognise the Israeli state, as it came into being by violating fundamental principles of international law, including the ethnic cleansing of the Palestinian people through the Nakba.\n\nHowever, as Alonso Gurmendi, Lecturer in International Relations at King’s College London states, ‘as international lawyers, we can argue endlessly about the validity of collective (even UN) recognition or whether Palestine really possesses the elements of the Montevideo Convention, but at the end of the day, the international law of state creation is as indeterminate as any law – its rules are always sustained by their exceptions. The real hurdle is that our world order is organised on the basis of racial hierarchies and that communities like Palestine have historically been unequally integrated into a burdened membership.’\n\nThis article by Ayesha Malik was produced with the support of the International Committee of the Red Cross (ICRC) as part of the Legally Speaking podcast series. The views expressed are the author’s own.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/22183450cce2667.webp",
  "retrievedAt": "2025-10-12T00:08:21.293Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942889/the-question-of-palestinian-statehood",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T13:35:17.000Z"
}
