{
  "title": "Pakistan’s floods leave lasting scars on its children - Pakistan - DAWN.COM",
  "author": null,
  "content": "Azan “has seen everything. He knows his parents are gone. He just doesn’t yet understand how to live without them.”\n\nShams ur Rehman is talking about his nine-year-old nephew Muhammad Azan, who has been staying with him and his family in Buner, a district in north-western Pakistan’s Khyber Pakhtunkhwa province. Azan’s parents, as well as his three brothers, were killed when flash floods tore through the valley in the middle of August.\n\nAlso in Buner, 17-year-old Qadir Ahmed has to carry another burden. On 15 August, his family house collapsed in the floods. “The water carried away my mother… now, I must look after my [four] younger brothers and sisters.”\n\nNot long ago, Ahmed passed his matriculation exams and aspired to go to college. Now, suddenly, he has to step in as the head of the family. “My education has stopped,” he says. “It is very difficult to take care of my siblings after losing our home and our mother.”\n\nPakistan has been experiencing unprecedented floods and landslides. The country’s National Disaster Management Authority (NDMA) reports that since late June, more than 1,000 people have been killed, with nearly 1,100 left injured due to monsoon-related disasters. Around half of all deaths have been in Khyber Pakhtunkhwa, where nearly 4,700 homes have been destroyed or damaged.\n\nThe floods have not spared other parts of the country. In Punjab, several major rivers faced large swells due to historic levels of rain in mid-August. Water discharges from across the Indian border have also contributed to villages and farmlands becoming submerged. More than two million people have been evacuated and outbreaks of skin- and water-borne diseases are expected. In the northern administrative territory of Gilgit-Baltistan, entire valleys have been cut off due to landslides, and more than 3,000 displaced people are staying in temporary camps. In Sindh, southern Pakistan, at least 150,000 people had been evacuated to safer areas as of 12 September.\n\nAhmed and Azan’s experiences are just two examples of how the floods in Pakistan are devastating the lives of children and causing trauma with long-lasting impacts.\n\nIn Khalti village in Gilgit-Baltistan, Waseem Akram, a teacher, saw his private school shut down in mid-August when floods washed away houses and caused landslides that blocked roads. “Children are not going to school. They don’t have books, uniforms or shelter. Their behaviour has changed; they show anger, fear or silence,” he says, adding: “Many may drop out entirely.”\n\nMuhammad Sohail, media coordinator for Rescue 1122, a government emergency service for disaster rescue, says that at present, Pakistan’s disaster response is focused only on physical rescue. “But mental health is just as important.”\n\nHe notes that systematic trauma care is practically unavailable. “Some officers are trained in Psychological First Aid, but there is no long-term counselling for children… This gap leaves scars that last for years.”\n\nFariha Sheikh is a social worker volunteering with the collection and distribution of food, period kits and other supplies in flood-hit villages on the outskirts of Sialkot and Narowal districts in Punjab, eastern Pakistan. She observes that children have been one of the most vulnerable groups. “Families are displaced, many of them living under open skies or in temporary shelters… kids from the villages have lost everything,” she says.\n\nSome officers are trained in Psychological First Aid, but there is no long-term counselling for children… this gap leaves scars that last for years\n\n“You can see the fear and uncertainty in their eyes… their normal life has just been snatched away,” she adds, noting that many are experiencing panic attacks.\n\nThrough her volunteer work, Sheikh has encountered children who have lost their parents. “It’s heartbreaking. Some kids don’t even fully realise what has happened, but they know their parents are not there anymore,” she says.\n\nAdded to these devastating upheavals are the physical dangers and changes they face. “Children are falling sick because of dirty water [from the floods] and a lack of food, and schools are either destroyed or being used as shelters,” Sheikh notes.\n\nThe trauma faced by children experiencing floods are exacerbated by the dangers they face from poverty, displacement and school closures. In Punjab alone, over 700,000 children have been affected by disruption to their education, with more than 2,900 schools forced to shut down due to the floods as of mid-September, according to The Nation.\n\nUnicef warned in the aftermath of Pakistan’s 2022 floods that the longer schools remained closed, the higher the risk of impacted children dropping out, which then increases the likelihood of them being forced into child labour and marriage.\n\nAmid the tragedy is the question of Pakistan’s lack of preparedness for such extreme weather. According to Yasir Darya, founder of environmental consultancy Darya Lab and the Karachi-based Climate Action Center, institutional failures have caused disasters to become even deadlier.\n\nHe highlights how early warning mechanisms planned after the 2022 flood did not come to fruition, and blames poor governance.\n\n“Communities remain cut off and unprotected,” he says. “It is a societal crisis as much as a climate one.”\n\nThese failures mean greater devastation from extreme weather and climate events, which will continue to severely impact children’s mental health.\n\nWe don’t just need rations; we need proper houses, schools, hospitals, libraries and recreational spaces so children can feel normal again\n\nEarlier this year, researchers coined the term “Environmentally driven Adverse Childhood Experiences (E-ACEs)” to refer to severe stressors children may face when exposed to prolonged, recurring or intense extreme weather and climate events. These can cause toxic stress similar to that seen in children experiencing abuse or neglect.\n\nThe researchers caution that repeated experiences with floods, displacement and family separation may impair their brain development and increase their vulnerability to long-term health risks. They also refer to climate-related adverse childhood experiences as a humanitarian crisis of the 21st century that particularly impact children of low- and middle-income countries such as Pakistan, where more people are being displaced.\n\nDespite the clear need to protect children from climate change impacts, they remain largely absent from climate policies.\n\nAnalysis published this year by the Early Childhood Development Action Network (ECDAN) found that of the 10 countries expected to have the largest populations by 2100, only six, including Pakistan, mention children or youth in their national climate policies. And even these largely fail to address the specific needs of young children. In the case of Pakistan, references to children in its policies only focused on child mortality rates without addressing broader early childhood development needs, including the sustained provision of nutrition, education and healthcare during climate shocks.\n\nIn northern Pakistan, families such as those of Azan and Qadir see few signs of such planning. Displaced communities receive food and tents lasting just days, while education is disrupted for months, they told Dialogue Earth.\n\nAkram, the teacher, stresses that aid should not be limited to emergency tents and food, but focused on rebuilding, as young flood survivors need stability in their lives. “We don’t just need rations; we need proper houses, schools, hospitals, libraries and recreational spaces so children can feel normal again,” he says. “Otherwise, these children will lose their futures.”\n\nSheikh, the social worker, echoes these concerns, saying: “[Children] need food, clean water, medicines, but also safe spaces and care. Their mental and emotional state matters as much as their physical survival. For a child, losing home and safety is too much to carry.”\n\nAs the water begins to recede in parts of Pakistan, families returning to their homes look to the significant task of rebuilding. For many impacted children, the trauma they have experienced is evident. Azan now clings tightly to his uncle during storms.\n\nUnless there is rapid investment in adaptation and trauma care, as well as the inclusion of children in national climate adaptation policies, Pakistan is at risk of raising a generation characterised not by its potential, but by its losses.\n\nHeader Image: A child looks onto houses damaged by floods in Swat, Khyber Pakhtunkhwa, in mid-August 2025 (Image: Kamran Khan / Alamy)\n\nThis article was originally published by Dialogue Earth and has been republished with permission.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2214305994da0f3.webp",
  "retrievedAt": "2025-10-12T00:08:18.989Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943888/pakistans-floods-leave-lasting-scars-on-its-children",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T10:34:12.000Z"
}
