{
  "title": "Massive taxes and the NFC conundrum - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan has a fiscal problem, and the problem cannot be fixed by increasing tax rates. We have reached the point of the cycle where increasing tax rates is counter-intuitive, catalyses an informal economy, and discourages the formation of capital and economic activity within the formal realm.\n\nPakistan has one of the highest corporate tax rates in the world while also having one of the highest effective tax rates for individuals, ie those individuals who are unlucky enough to get the same deducted at source given the lopsided and distorted tax brackets.\n\nTo understand how there has been an exodus of private businesses from the formal financial sector, the ratio of government deposits to private business deposits has been consistently increasing and is currently at 75 per cent in 2025, relative to 44pc in 2010. This effectively means that the relative size of government compared to private sector businesses (as measured by deposits) has been consistently increasing as private sector businesses increasingly prefer to work informally rather than as part of the formal financial system.\n\nIncreasing tax rates further will only discourage any further economic activity while accelerating activity outside the formal economic realm. The investment-to-GDP ratio in Pakistan has been lower than its economic peers at 13pc, while the average for South Asia and for low-middle-income economies is at 32pc, and 29pc respectively. This effectively means that we need to invest more in the formal economy to trigger growth, rather than incentivising deployment of capital in parcels of land that may often be underwater.\n\nOperating in the formal economy has a fairly high cost of business, after accounting for corporate tax, super tax, multiple layers of dividend taxation, and other incidentals. The tax code effectively discourages any new investment or formation of capital, thereby leading to years of low to no growth. The International Monetary Fund (IMF), being the bureaucrat of last resort, does not leave any stone unturned in stonewalling an already sluggish economy.\n\nAt the federal level, we run a contractionary fiscal policy with high taxes that discourage private capital formation, while at the provincial level, we run an expansionary fiscal policy with no regard for any deficits\n\nSimilarly, a sales tax in the high teens is an effective deterrent against any value addition on top of primary production. Why bother making tomato ketchup at scale and with efficiency and get stuck with a regressive taxation regime when you can just produce tomatoes? At an individual level, salaried taxpayers have seen their after-tax incomes reduce by more than 50pc in real terms over the last five years as a function of both inflation and distortionary tax brackets.\n\nThe economy has reached a tipping point where raising any more tax rates is counterintuitive and would actually contribute to a further stalling of economic activity, which would further flatten out tax collection in real, inflation-adjusted terms. A fiscal stimulus that incentivises economic growth in the real economy through domestic investment is required. Lacking this, the slow-growth train will chug along ever so slowly.\n\nBut why do we need such great taxes? Because our expenditures continue to grow, and so do our deficits. The National Finance Commission (NFC) Award calls for the transfer of federal revenue to provinces, who then operate their provincial economies with a perpetually expansive fiscal policy. The federal government continues to fund these transfers by taking on more debt, resulting in higher interest payments, inadvertently leading to more debt to pay for those interest payments. Despite recurring deficits at the federal level, the provinces continue to run expansionary fiscal policies, resulting in distortionary economic signals.\n\nAt the federal level, we run a contractionary fiscal policy with high taxes, thereby discouraging private capital formation, while at the provincial level, we run an expansionary fiscal policy, with no regard for any deficits. Such lack of incentive alignment leads to debt cyclicality, resulting in an ever-increasing quantum of debt to fund both recurring expenditures and annual provincial allocations.\n\nExpenditures are sticky and recurring and not easily reversible. We have essentially reached a fiscal cliff, where more expenditure inadvertently leads to more debt, crowding out further space for private capital — no wonder why we do not have any domestic investments or why there is no foreign investment.\n\nThe NFC conundrum needs to be viewed with the lens of greater private sector capital formation, catalysing investments, and economic growth — rather than an annual accounting exercise in isolation.\n\nA higher allocation to provinces may lead to more expenditure by the provincial government, but that cannot lead to greater private sector investment, or an increase in the number of jobs, or even disposable income. The award needs to be approached with a very clear target of gradually reducing fiscal deficit through a milestone-based process and increasing private sector capital formation and investments.\n\nThe writer is an assistant professor of practice at IBA, member of the Thar Coal Energy Board, and CEO of NCGCL\n\nPublished in Dawn, The Business and Finance Weekly, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d00ae3c5183.jpg",
  "retrievedAt": "2025-10-12T04:17:31.738Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943694/massive-taxes-and-the-nfc-conundrum",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:05:08.000Z"
}
