{
  "title": "President Zardari, PM Shehbaz highlight Pakistan’s dedication to global harmony on Day of Peace - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: President Asif Ali Zardari and Prime Minister Shehbaz Sharif underscored Pakistan’s dedication to global harmony and fairness on the International Day of Peace.\n\nIn a message on the occasion of International Day of Peace which was observed across the world on Sept 21, Sunday, the leadership emphasised the urgent need for international collaboration to resolve the humanitarian crises in India-held Jammu and Kashmir and the occupied Palestinian territories.\n\nPresident Zardari reiterated Pakistan’s readiness to contribute to a sustainable world order. He noted the nation’s recognised contributions to regional stability.\n\nAlso, PM Shehbaz who was in the UK on Sunday, said that lasting tranquility remained unattainable while the right to self-determination was denied to the people of Kashmir and Palestine. He called upon the global community to uphold UN resolutions and support their struggle for rights.\n\nStrict adherence to international treaties, UNSC resolutions key to sustainable peace, says Gillani\n\nAlso, National Assembly Speaker Sardar Ayaz Sadiq emphasised the importance of global unity, tolerance, and dialogue for establishing lasting peace, stressing that conflict resolution should be achieved through peaceful means. He said this year’s theme, “Act Now for a Peaceful World”, was both timely and relevant.\n\nCollective responsibility\n\nEarlier, acting president Syed Yousaf Raza Gillani in a statement on the occasion said peace was not merely the absence of war, but a state founded on justice, equality, respect for human rights, and social harmony.\n\nMr Gillani said that sustainable peace can only be achieved through dialogue, tolerance, justice, and cooperation, as force and coercion can never bring true harmony or tranquility. He said peace was an indispensable prerequisite for the survival, progress, and well-being of humanity. He urged world leaders to give priority to negotiations, mutual respect, and diplomacy over conflicts and hostilities.\n\n“Peace is a collective responsibility that must be embraced at every level,” he said. He urged the global community to unite and take effective measures for the peaceful resolution of conflicts and the protection of human rights.\n\nMr Gillani recalled that Paki­stan has always upheld and advanced the message of the UNon peace and justice.\n\nLiving in balance with nature\n\nFederal Minister for Maritime Affairs Junaid Anwar Chaudhry, in his message on the occasion, said real peace must include protecting oceans and the marine species that inhabit them.\n\nHe said that peace was about living in balance with nature. “If our oceans are not healthy, both marine animals and coastal communities suffer,” he warned.\n\nThe minister highlighted threats facing endangered turtles, overfished sharks, fragile coral reefs around Churna Island, and mangrove forests along shoreline.\n\nHe said that turtles are at risk from poaching, pollution and habitat destruction, while sharks need protection to preserve balance in ocean ecosystems.\n\nWith additional input from agencies\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:17:28.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943779/president-zardari-pm-shehbaz-highlight-pakistans-dedication-to-global-harmony-on-day-of-peace",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:04:48.000Z"
}
