{
  "title": "Finance: Hope persists amidst worries - Newspaper - DAWN.COM",
  "author": null,
  "content": "The newly signed defence pact between Saudi Arabia and Pakistan comes at a critical time for Islamabad, which is grappling with a foreign exchange crisis, insufficient forex reserves and mounting external debt. The agreement could deliver both immediate relief and longer-term stability.\n\nA key outcome is the expected acceleration of Saudi Arabia’s previously pledged $5 billion investment package, much of which had been delayed. With the pact in place, inflows are likely to be fast-tracked, providing Pakistan with vital foreign currency. Funds are earmarked for energy, infrastructure and mining — sectors that could reduce import dependence and generate export earnings.\n\nThe agreement also reinforces Saudi Arabia’s role as a financial backstop. In past crises, Riyadh provided Pakistan with $3bn in central bank deposits and $1.2bn in deferred oil payments, helping avert default. The upgraded alignment makes it more likely that such support will continue — and potentially expand — offering crucial breathing space for Pakistan’s external sector.\n\nEnergy imports remain Pakistan’s largest burden. The pact has revived potential momentum for Saudi investment in Pakistan’s refinery sector, which could reduce dependence on costly petroleum imports and ease pressure on reserves. The partnership may also create openings for Pakistani defence exports. With strengths in personal equipment, small arms and unmanned aerial vehicles, Pakistan’s defence industry could find a receptive market in Saudi Arabia, generating new foreign exchange.\n\nBetween falling debt-to-GDP ratios and narrower fiscal deficits, the Saudi Arabia defence pact signals improvement if only political courage prevails\n\nLabour exports are another gain. Saudi Arabia already hosts around three million Pakistani workers who remit more than $9bn annually. An expanded partnership may open specialised security roles, further boosting remittances.\n\nBeyond near-term relief, the pact signals a deeper economic alignment that could draw additional Gulf investment. Saudi Arabia’s commitment may encourage other Gulf Cooperation Council countries to invest in Pakistan’s agriculture and mineral sectors. For Riyadh, Pakistan also plays into its food security strategy, potentially paving the way for corporate farming projects that ensure stable food imports while enhancing Pakistan’s export base.\n\nAt a geopolitical level, the pact provides Pakistan with a strategic economic anchor amid the US-China rivalry. Strengthening ties with Saudi Arabia helps diversify partnerships while securing reliable backing in the Middle East.\n\nStill, such benefits are not automatic. Pakistan must reform its investment climate. Past delays in Saudi-backed projects underline the importance of execution. Over-reliance is another risk: Islamabad needs to further deepen its relationship with China, the United Arab Emirates (UAE) and Qatar — while broadening ties with the US — to avoid new vulnerabilities.\n\nDespite these challenges, the Saudi-Pakistan defence pact represents one of the most significant opportunities in years to address chronic external imbalances. If paired with reforms, it could deliver forex relief, expand exports and strengthen long-term resilience.\n\nYet Pakistan’s economic hole keeps getting deeper. By June 2025, total public debt had soared to Rs88.126 trillion (about $312bn), according to media reports based on a State Bank report. This represents an increase of Rs9.44tr ($33.5bn) in just one year, or nearly $2.8bn a month; a heavy burden on households.\n\nMuch of the increase came from domestic borrowing. That may appear less risky than external loans, but when the government borrows heavily from local banks, it crowds out the private sector. Businesses find credit costlier, investment slows, and job creation suffers.\n\nOn the external front, debt now stands at Rs23.417tr ($83bn), where every depreciation inflates obligations in rupee terms, even without new borrowing.\n\nPerhaps the starkest indicator of the debt trap lies in the budget. Out of total expenditure, nearly 47 per cent — Rs8.2tr — goes to interest payments. That leaves just a little more than half the budget for everything else combined: education, healthcare, infrastructure, defence and development.\n\nThis fiscal year alone, Pakistan needs around $26bn for external debt servicing, according to information shared by the SBP in July — far above Pakistan’s current forex reserves of less than $20bn. The government is trapped in a cycle of borrowing new money to repay old loans. Rollovers and deferred payments from “friendly” countries such as China, Saudi Arabia and the UAE buy time but erode sovereignty, often coming with strings attached.\n\nTaxation exposes another contradiction. Every year the government grants massive exemptions, the dollar equivalent of which often equals the amount needed for external debt servicing. In effect, the state forgoes vital revenue while ordinary citizens shoulder rising indirect taxes, inflation and weaker services.\n\nDebt dependency has become a foreign policy constraint. Reliance on the IMF means accepting tariff hikes, new taxes and subsidy cuts. Gulf bailouts often demand alignment with their regional agendas. Each bailout narrows Pakistan’s room for independent policy.\n\nOfficials counter this grim picture by pointing to falling debt-to-GDP ratios — down from 74pc in FY22 to 70pc in FY25 — and to Rs2.6tr in early repayments that lowered refinancing risks. They also highlight a narrowed fiscal deficit and a “historic” primary surplus of 2.4pc of GDP. But these claims cannot mask the core reality: debt pressures remain relentless, deepening the challenges for politico-economic sovereignty.\n\nThe way forward demands political courage. Tax reform must come first — broadening the base and ending exemptions for powerful lobbies. Loss-making state-owned enterprises must be restructured or privatised. And smarter debt management is critical: rolling over loans may buy time, but restructuring with longer terms is essential to break the cycle.\n\nPublished in Dawn, The Business and Finance Weekly, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:08:20.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943691/finance-hope-persists-amidst-worries",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:05:09.000Z"
}
