{
  "title": "Footprints: Piecing life together post-flood - Newspaper - DAWN.COM",
  "author": null,
  "content": "Travelling across the Bambawali-Ravi-Bedian (BRB) Canal — one of the region’s worst-hit after the Ravi flooded Narowal district late last month — one can see signs of normalcy slowly returning.\n\nIn villages along the border with India, people are back in their fields, repairing link roads and watercourses. Tube wells once again irrigate rice fields, while youngsters fish in the river and in the ponds left behind by the flood. Speaking to them reveals a quiet resilience and determination to rebuild.\n\nThe river has now receded to its banks after a week of flooding, but the damage remains stark. Many residents watch as weakened homes crack or collapse.\n\nGrain stocks are dampened even when spared direct contact with floodwater. Farm machinery is rusting, and stagnant water lingers in low-lying fields — breeding mosquitoes and pests across the uneven landscape. Irrigation channels lie collapsed or choked with mud.\n\nFarmers thankful for rain that saved their crops from being buried under silt & mud brought by overflowing rivers\n\nThousands of acres of water-sensitive crops such as vegetables, fodder and sesame lie flattened, leaving farmers counting losses. Rice and sorghum fields largely survived, but hundreds — if not thousands — of acres in low-lying areas were destroyed.\n\n“Nature has its own ways of helping in the most testing times,” says 52-year-old Iqbal, a resident of village Kajla. He explains that after the floods, 72 hours of torrential rain spared farmers from total destruction. In fields that were not low-lying, the rain washed away thick layers of mud that would otherwise have smothered the plants.\n\nThe flood had already re-energised the root zone with fresh silt deposits. “That’s why you can still see some green fields,” Iqbal says. “Without the rain, this picture would have been completely different.”\n\nAlongside their courage to survive and faith in divine help, flood survivors also lament official neglect during and after the disaster. “This attitude multiplies the risks to our lives and makes survival harder,” they say.\n\nTheir sentiments broadly reflect three realities: the sheer scale of the tragedy, a fearful community struggling to rebuild, and poorly planned waterworks that have added to their misery.\n\nThe shifting river: a rising threat\n\nThe post-flood reality is visible in every corner of Narang Mandi.\n\nIrrigation channels are silted up and clogged with mud. Each village has collapsed houses on its outskirts and cracked walls along its streets, where residents appeal to every visitor, often mistaking them for officials assessing compensation.\n\nPoverty, deepened by the floods, is evident everywhere.\n\nRoads linking the villages have either been washed away or deliberately breached by villagers to drain water, leaving them impassable for traffic. Commuting is now limited to trudging on foot or riding motorbikes along submerged paths.\n\nLife is edging back to normal, but the progress is painfully slow, as villagers have only themselves to rely on.\n\n“Villagers will repair their homes and streets in the coming days or weeks,” says 52-year-old Ashfaq Baryar of Baryar village on the Ravi’s bank. “What we cannot handle are the larger issues — the river drifting closer to our villages, consuming fertile land and depriving millions of their livelihoods,” he laments.\n\nAccording to him, embankments are not reinforced, and each season water erodes the dykes, leaving them weaker until floods wash them away. He adds that the very nature of flooding has also changed.\n\nIn the past, floodwaters used to rise slowly, inch by inch — or at worst, foot by foot in emergencies. This time, it was a five-foot wall of water that swept across the area within two hours and stayed for over a week, leaving farmers little chance to flee or respond, Ashfaq says.\n\n“It was an entirely new pattern, unheard of even in the stories of our ancestors. The very nature of the threat has changed, and even those of us who have lived here for generations do not know how to face it.”\n\nInfrastructural flaws\n\nFarhan Shaukat of Kot Bhailan explains the area’s vulnerability. Three water systems converge here, turning it into a vast pond. The Ravi, after zigzagging along the border, re-enters Pakistani territory and floods the land. The Marala-Ravi (MR) Link, carrying 22,000 cusecs, also ends here.\n\nFinally, the elevated banks of the BRB Canal trap water between the Pakistan-India border and Lahore, submerging more than 50 villages along the 40-km stretch until the Ravi reaches Shahdara. These structures combine to create — and sustain — millions of cubic feet of stagnant water, which only drains once the Ravi begins to recede. This pattern has persisted for decades.\n\n“The last two kilometres of the MR Canal have no banks,” says 60-year-old Riyasat Ali Kahloon of Khundey village. When the Ravi swells, it blocks the canal’s flow, which then reverses to flood villages between its endpoint and the river. “We have raised this issue with politicians and policymakers for years. They only made promises to build the embankment but never acted. In recent years we’ve been told the project was approved and procedures completed, yet no work has begun,” he says.\n\nHe warns that flaws in the man-made system must be fixed before it is too late. “The cost of the proposed embankment would be a fraction of what we lost in just one week of flooding.”\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d07a38840af.jpg",
  "retrievedAt": "2025-10-12T04:17:32.352Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943786",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:04:35.000Z"
}
