{
  "title": "Moment of truth - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT was a moment of truth for Arab and Muslim governments. Israel’s attack on Qatar targeting Hamas leaders in Doha shook the entire Middle East and beyond.\n\nThis was the sixth country in the region to face Israeli military aggression. In September alone, Israel carried out strikes against Lebanon, Palestine, Yemen, Syria and Tunisia. But the air strike on Qatar was the first against a Gulf state that is also a non-Nato ally of the United States. This, after nearly two years of the genocidal war Israel has been waging on Gaza, where it has killed over 65,000 Palestinians.\n\nExpectations ran high that the emergency Arab/Islamic summit convened in the wake of the strike on Doha would come up with a forceful response to deter Israel from the murderous mayhem it is inflicting across the region. The extraordinary joint session of the Arab League and OIC was attended by leaders and representatives of almost 60 states representing the world’s two billion Muslims.\n\nThe summit’s tone was both sombre and tough. It took a unified stance in declaring solidarity with Qatar, denouncing the Israeli attack and condemning Israel’s “crimes of genocide, ethnic cleansing, starvation and siege” in Gaza. This sent a strong message to both Israel and the US.\n\nBut the summit failed to take any concrete measures widely expected of it. The lengthy joint communiqué urged “states to take all possible legal and effective measures to prevent Israel from continuing its actions against the Palestinian people”. And it identified some of these — “imposing sanctions on it [Israel], suspending the supply, transfer, or transit of weapons, ammunition, and military materials, reviewing diplomatic and economic relations with it, and initiating legal proceedings” against Israel.\n\nBut it left it to individual countries to take such measures. No collective actions were agreed by the summit, not even asking countries that still maintain diplomatic ties with Israel to suspend them, or to close their airspace to Israeli flights. Even the most minimal political or economic measures were not forthcoming. For all their wealth, control of over a quarter of global energy supplies and geostrategic importance, Arab states demurred from using these as diplomatic leverage.\n\nSome leaders proposed practical actions but none of them were adopted. For example, Turkiye’s President Recep Tayyip Erdogan suggested mounting economic pressure, recalling this had worked in the past.\n\nPrime Minister Shehbaz Sharif put forward the idea of creating an Arab/ Islamic task force to monitor and deter Israeli expansionism. The Malaysian prime minister proposed “severe, punitive actions”, without, however, identifying these. Others, including Iran’s President Masoud Pezeshkian, called for countries to sever ties with Israel.\n\nThe Pak-Saudi defence pact is another sign of shifting geopolitical dynamics and alignments.\n\nAs some Arab analysts pointed out, perhaps the most actionable summit outcome was the Gulf Cooperation Council’s plan to “activate a joint defence mechanism”.\n\nGCC members have a joint defence agreement under which an attack on one member is deemed an attack on all. They plan many steps to bolster collective security. Whether this produces an operational collective defence system is yet to be seen. Its significance, however, has been overshadowed by the Pakistani-Saudi defence deal announced days after the summit.\n\nThe repercussions of the Israeli attack on Qatar are unmistakable. It has eliminated even the slimmest chance of a ceasefire in Gaza that can end the war. That Israel targeted the very people — members of the Hamas negotiating team — who had gathered to discuss a fresh US proposal for a ceasefire underlined Tel Aviv’s lack of interest in peace talks.\n\nAs Qatar’s ruler Sheikh Tamim Al Thani said at the summit, the attack on mediators proved Israel had “no genuine interest in peace” and was seeking to “thwart negotiations”. Although the Israeli strike failed to assassinate top Hamas leaders, Prime Minister Benjamin Netanyahu refused to rule out further strikes wherever Hamas leaders are found.\n\nUS Secretary of State Marco Rubio said, en route to Doha after visiting Tel Aviv, that Washington wanted Qatar to continue playing a mediatory role but time was running out for a truce. Ironical, considering the US did nothing to stop Israel from striking Doha or condemning the strike. It has also been the only obstruction at the UN Security Council for a Gaza ceasefire, using the veto to scotch ceasefire resolutions. Its latest veto last week was the sixth since the war began, even as all other Council members voted for peace.\n\nIn fact, US credibility has taken a big hit by its stance on the Israeli strike on Doha. If its closest ally can attack another state who hosts the largest American military base in the region and who Trump claims a special relationship with, it doesn’t inspire confidence in the US role as a security provider in the region. States dependent on the American defence umbrella are already questioning the value or reliability of the security partnership when the US is unable or unwilling to restrain Israel.\n\nThe lesson for Qatar is also clear. Ingratiating itself with Trump — by pledges of trillions of dollars in investment and gifting him a Boeing — has not bought it security. Flattery is no security guarantor.\n\nThe landmark strategic mutual defence pact between Pakistan and Saudi Arabia has to be seen against this backdrop. It comes at an inflection point in the Middle East. Negotiations for the security agreement took place months before the Israeli strike on Qatar.\n\nBut the timing of its announcement suggests the attack on the Gulf country and Israel’s unchecked aggression in the region accelerated its signing, with Riyadh seeking to diversify its security partnerships and Pakistan expanding its options. Under the historic deal both countries would consider an attack on one as “an aggression against both”.\n\nWhile assessment of the deal’s far-reaching impact will be the subject of a separate column, it is sufficient to note here that this agreement is a reflection and consequence of the eroding trust of Gulf states in an unpredictable US whose blind support for Israel has heightened the security threat they face.\n\nHence the Saudis are pursuing a hedging strategy and turning to Pakistan for “joint deterrence against any aggression”. This is another indication of changing geostrategic dynamics and shifting alignments that are fundamentally reshaping the regional and global landscape today.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d0add4bdd6a.jpg",
  "retrievedAt": "2025-10-12T04:17:28.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943806",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:01:34.000Z"
}
