{
  "title": "Karachi man sentenced to six years in prison for creating fake Facebook accounts to blackmail woman - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate has sentenced a man to a total of six years in prison for creating fake Facebook accounts in his friend’s name and misusing them to share her inappropriate photographs in an attempt to blackmail her after she turned down his proposal for engagement.\n\nJudicial Magistrate (East) Yusra Ashfaq found Abdullah Saleem guilty of offences under Sections 20 (dignity of natural person), 21 (modesty of natural person and minor) and 24 (cyberstalking) of the Prevention of Electronic Crimes Act (Peca) 2016, and awarded him two years’ imprisonment on each count.\n\n“It is clear that the prosecution has successfully proven the charge against the accused. The prosecution has demonstrated that the accused tarnished the dignity of the complainant and her family, violated the complaint’s modesty, display videos without her consent, and displayed them publicly,” the court observed.\n\nExplaining the motive of the accused, the court noted that the evidence reflected his frustration and resentment over the refusal of a formal engagement with the complainant due to his anger issues.\n\nMagistrate finds him guilty of offences of cyberstalking, etc under Peca\n\nThe court further observed that the accused had threatened the complainant and started harassing her by creating fake social media accounts and misusing them to transmit her photographs with the intent to take revenge and damage her honour and reputation.\n\nAccording to state prosecutor Sheraz Rajpar, the complainant stated in her testimony that she had had a friendship with the accused, which eventually ended due to his inappropriate behaviour. Later, the accused resorted to creating fake Facebook accounts in the complainant’s name and sharing her personal photos to blackmail her and her family.\n\nThe complainant deposed that the “accused admitted to being behind those accounts and threatened her that she would never be able to marry anyone else, even going so far as to say he would force her to commit suicide”, the prosecutor added.\n\nDuring the trial, prosecutor Sheraz argued that the complainant’s testimony was corroborated by the verification report, screenshots, IP logs, WhatsApp records and the detailed forensic report, adding that at the inquiry stage the accused had handed over his phone to the investigators and, after forensic examination, it was revealed that the “fake accounts and transmissions were linked to the accused’s number and IP address”.\n\nOn the other hand, the accused denied the allegations and claimed that he had been falsely implicated in the case by the complainant. However, the court rejected the defence plea and noted that the defence side had failed to produce substantial evidence in support of its claims.\n\nA case was registered at the Federal Investigation Agency’s Cyber Crime Cell for offences under Sections 20, 21 and 24 of the Peca.\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:17:36.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943725/karachi-man-sentenced-to-six-years-in-prison-for-creating-fake-facebook-accounts-to-blackmail-woman",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:05:38.000Z"
}
