{
  "title": "Arsenal late show denies City, Villa still winless - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Gabriel Marti­nelli’s 93rd minute equaliser saved Arsenal’s Premier League title bid from a damaging defeat to Manchester City, while Aston Villa remain winless after a limp 1-1 draw at 10-man Sunderland.\n\nThe Gunners were heading to a second defeat in five Premier League games due to Erling Haaland’s early strike on the counter-attack for City.\n\nMartinelli came off the bench to score for the second time in a week to salvage a 1-1 draw, but both sides lost more ground to Premier League leaders Liverpool.\n\nArsenal went second, five points behind the champions, while City are eight points off the top in ninth.\n\nMikel Arteta’s men had not conceded from open play in their first five Premier Lea­gue and Champions League games this season, but were opened up on nine minutes by the scintillating form of arguably the world’s best striker.\n\nHaaland started the move deep inside his own half with a lay-off to Tijjani Reijnders and then sprinted upfield to receive the Dutch international’s pass before coolly slotting beyond David Raya.\n\nThe Norwegian already has 13 goals for club and cou­n­try in just eight games this season.\n\nAt the other end, City are reaping immediate dividends from the signing of giant Italian goalkeeper Gianluigi Donnarumma.\n\nNoni Madueke’s powerful near post strike was repelled by Donnarumma in what was Arsenal’s best attempt in a flat first-half performance.\n\nMikel Arteta threw on the creative talents of Bukayo Saka and Eberechi Eze at the start of the second period.\n\nEze tested Donnarumma once more but the Gunners struggled to break down City’s massed ranks of defence, with Guardiola even sacrificing Haaland and Phil Foden in the second half to bolster his back line.\n\nHowever, that gamble backfired when Martinelli galloped onto Eze’s ball over the top and looped a fantastic finish over Donnarumma.\n\nEarlier, Villa’s rise over recent years under the tutelage of Unai Emery has gro­u­nd to a halt as they remain in the bottom three with just three points from their opening five games.\n\nEmery’s men could barely have asked for a better opportunity to end their wait for victory after Sunderland def­e­n­der Reinildo Mandava was shown a red card on 33 minutes for kicking out at Matty Cash.\n\nVilla had failed to score in their previous four league games but did finally break that drought when Cash tried his luck from long range and Sunderland goalkeeper Robin Roefs was deceived by the power and swerve on the full-back’s strike.\n\nThe lead lasted just eight minutes, though, as Wilson Isidor pounced on Granit Xhaka’s header forwards for his third goal in as many games at the Stadium of Light in the Premier League.\n\n“It should have been easier to take advantage [against 10 men] but we were not playing with our identity, with the ideas we have been building in the last three years,” said Emery.\n\nSunderland have made a great start to their quest to end the run of promoted sides being relegated straight back to the Championship.\n\nThe Black Cats sit seventh after losing only one of their opening five fixtures.\n\nElsewhere, Newcastle Uni­ted eked out another draw as they were held 0-0 against Bournemouth.\n\nNewcastle are struggling for goals in the absence of the departed Alexander Isak. Eddie Howe’s men have drawn all three of their away games this season.\n\nIn Saturday’s late match, Ful­h­am secured their second win this season with a 3-1 victory against west London neighbours Brentford at Craven Cottage.\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d07234ad3e1.jpg",
  "retrievedAt": "2025-10-12T00:08:47.210Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943765/arsenal-late-show-denies-city-villa-still-winless",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:05:21.000Z"
}
