{
  "title": "Bangladesh and India’s new strategic dilemma - World - DAWN.COM",
  "author": null,
  "content": "A new phase of distancing between Bangladesh and India has been brought on by recent changes in bilateral trade along their shared border. Although India has traditionally viewed Bangladesh as a significant ally in South Asia, its current steps appear more severe, even punitive. Its displeasure with Dhaka’s political shift has been demonstrated by Delhi’s employing a range of strategies, including sudden trade restrictions, public demonstrations, and heightened strategic posturing.\n\nIndia appears to be unhappy about the collapse of the Awami League government and the emergence of an interim government led by Dr Muhammad Yunus, despite it being a domestic issue. Delhi now faces a less predictable opponent after years of supporting the previous government. Border pressure, a diplomatic freeze, and trade retaliation seem to be more reactive than proactive.\n\nSince May 7, India’s border force is said to have pushed more than 1,600 individuals into Bangladesh, including Indian citizens and the displaced Rohingya. Such actions are against international norms. During a vulnerable time of political transition, these unannounced arrivals have placed strain on Bangladesh’s internal security and the local government. This has also led to public discontent and instability. When pressure is put on Bangladesh’s security forces to react, there is a greater chance that the situation may escalate. The tactic fits into what some argue is a broader pattern in India’s regional playbook that disseminates political concepts through strategic pressure.\n\nThe issue is exacerbated by India’s aggressive efforts to upgrade its infrastructure. Over the past decade, India has effectively encircled Bangladesh with an extensive network of rivers, trains, and roads, connecting the northeast to the mainland. India possesses significant logistical capabilities, thanks to projects such as the Kaladan Multi-Modal Transit via Myanmar and transportation corridors through Bangladesh.\n\nNew Delhi is unhappy after Dhaka’s recent diplomatic engagements with Pakistan\n\nDr Yunus’s statement that “Bangladesh is their sole path to the sea” was viewed as a strategic issue in Delhi due to the “landlocked” nature of the northeastern Indian provinces. In response, India has resumed military preparations around key locations and reactivated the airbase in Kailashahar, Tripura. Delhi is even more uneasy about Bangladesh’s decision to revive Lalmonirhat airport, given its proximity to the Siliguri Corridor.\n\nCritical supply networks for Bangladeshi exports, which primarily include processed foods, apparel, and home goods, have been impacted by India’s sudden restrictions. Order delays and stopped shipments are affecting small and medium-sized enterprises, particularly those that supply to northeastern India.\n\nThis move, which is sometimes interpreted as a response to Bangladesh’s ban on importing Indian yarn, highlights the significant trade imbalance. In FY2023-24, Bangladesh exported less than $1.6 billion worth of goods to India, but imported approximately $9 billion worth of goods from there. Indian traders are also facing shortages and higher prices in West Bengal and the northeast. Electricity is another weakness. Approximately 2,500MW, or 17 percent of Bangladesh’s total electricity supply, is sourced from imports from India. Any disruption in this may cause serious problems for the urban and industrial sectors in Bangladesh.\n\nWhen evaluating India’s current position, it is essential to consider broader geopolitical developments. Delhi is now on the defensive due to the Modi government’s return with a smaller mandate and growing international criticism, particularly from the US, on issues of religious freedom and democratic backsliding.\n\nNot to be overlooked are Dhaka’s recent diplomatic engagements with Pakistan and China. Proposals for a humanitarian channel/corridor to Myanmar’s Rakhine state and preliminary talks on infrastructure cooperation between the three countries have heightened Indian concerns. Delhi is concerned about a shift in the strategic centre of the Bay of Bengal as it may diminish India’s long-standing influence over the region.\n\nEmployed initially as a catchphrase supporting democratic rebirth, the term “New Bangladesh” has come to be seen by Indian observers as a rejection of India’s long-standing role in Bangladesh. The diplomatic situation has become more complex as a result of this shift in narrative.\n\nBack-channel communication has deteriorated, and high-level visits have slowed. In response to Dhaka’s repeated requests for cooperation based on respect for each other’s sovereignty, India has, at best, been reticent.\n\nBangladesh and India have a complex and multifaceted connection. Bangladesh provides India with essential access to its northeast, and India remains Bangladesh’s most significant regional business partner. However, the relationship is unbalanced. Bangladesh’s heavy reliance on Indian energy, trade, and transportation puts it at risk. Given their proximity and shared history, Dhaka should treat Delhi strategically.\n\nCan Bangladesh and India put aside temporary solutions and create a cooperative, long-term partnership? This important topic has been brought to light by the current tensions.\n\nDialogue must be the first step in resolving the problem. Bangladesh should initiate high-level talks with partners in both public and private sectors. For managing border and trade challenges, a collaborative fra­mework is essential. Count­ermeasures or retaliation would not work.\n\nDhaka must also increase its diplomatic, energy, and commercial alternatives. One way to reduce an excessive dependence on any one source country is to participate in the forums of ASEAN partners, such as SAFTA and BIMSTEC.\n\nAt the same time, accepting the new political realities in Dhaka without seeing them as threats is the best course of action for India. There are other ties between the two countries besides trade and treaties. Historical events, waterways, and cultural relations are all comparable. However, both sides now need to be mature enough to sustain this relationship. The current circumstance is a test of vision, strategy, and diplomacy. The choices made in Dhaka and Delhi will have an impact not only on their bilateral relationship but also on the larger South Asian regional order.\n\nInstead of writing provocatively, let us write the next chapter cooperatively and practically.\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d076238d559.jpg",
  "retrievedAt": "2025-10-12T00:08:46.738Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943776/bangladesh-and-indias-new-strategic-dilemma",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:05:31.000Z"
}
