{
  "title": "Cox smashes comeback fifty as England clinch T20 series in Ireland - Sport - DAWN.COM",
  "author": null,
  "content": "DUBLIN: Jordan Cox marked his return to international cricket in spectacular fashion by blasting a quickfire fifty despite a knee problem to guide England to a six-wicket victory over Ireland and seal a 2-0 series triumph at a sold-out Malahide on Sunday.\n\nThe 24-year-old, who had not played for England for over a year and was not even named in the original squad, smashed 55 off 35 deliveries at number four to help his side chase down a modest target of 155 with 17 balls to spare.\n\nCox was injured while taking the catch when he seemed to jar his knee in the turf at deep midwicket, forcing him to go off the field for treatment, but that did not stop him from coming out to bat when England needed him at 33-2.\n\nHis sudden recall to the England setup came after his heroics in The Hundred, where he finished as both the tournament’s top scorer and player-of-the-series.\n\nEngland had won the first match by chasing down 197 while the second match was rained out. As they wrapped up the series 2-0, it gave 21-year-old Jacob Bethell a first trophy as the country’s youngest captain in any format.\n\n“I couldn’t have dreamed it any better. The rained out game was unfortunate but to come out 2-0 winners in my first series as captain is a great feeling,” Bethell told TNT Sports. “We were nice and aggressive throughout the whole week.”\n\nIreland had built a platform through Ross Adair (33) and Harry Tector (28) at the top of the order but they crumbled against England’s spin twins Adil Rashid (3-29) and Liam Dawson (2-9).\n\nJamie Overton also picked up two wickets in one over to leave the hosts reeling at 58-4 but Gareth Delany played a cameo in the middle order to finish unbeaten on 48 off 29 balls.\n\nEngland’s chase stuttered when Jos Buttler fell for a duck but Phil Salt (29) and Cox stitched together a 57-run partnership before Tom Banton (37 not out) helped the tourists get over the line.\n\n“Credit to Ireland, they bowled well defending 150-odd,” said Rashid, who was named the player-of-the-ma­tch. “You’ve got to adapt to the ground, wherever you go. I thought as a group we did that really well.”\n\nScoreboard\n\nIRELAND:\n\nP. Stirling c Buttler b Dawson 7\n\nR. Adair c Cox b Ahmed 33\n\nH. Tector c Rashid b Dawson 28\n\nL. Tucker c Wood b Overton 1\n\nC. Campher c Banton b Overton 2\n\nB. Calitz c Bethell b Rashid 22\n\nG. Delany not out 48\n\nB. McCarthy lbw Rashid 0\n\nM. Humphreys c Cox b Rashid 7\n\nEXTRAS (LB-3, W-3) 6\n\nTOTAL (for eight wkts, 20 overs) 154\n\nFALL OF WICKETS: 1-30 (Stirling), 2-52 (Adair), 3-56 (Tucker), 4-58 (Campher), 5-90 (Tector), 6-102 (Calitz), 7-102 (McCarthy), 8-141 (Humphreys)\n\nDID NOT BAT: C. Young, B. White\n\nBOWLING: Baker 4-0-52-0 (1w), Wood 3-0-20-0, Dawson 2-0-9-2, Overton 4-0-17-2 (1w), Ahmed 3-0-24-1 (1w), Rashid 4-0-29-3\n\nENGLAND:\n\nP. Salt c Tucker b Campher 29\n\nJ. Buttler c Campher b McCarthy 0\n\nJ. Bethell c Delany b Young 15\n\nJ. Cox b White 55\n\nT. Banton not out 37\n\nR. Ahmed not out 9\n\nEXTRAS (B-4, LB-1, NB-1, W-4) 10\n\nTOTAL (for four wkts, 17.1 overs) 155\n\nFALL OF WICKETS: 1-10 (Buttler), 2-33 (Bethell), 3-90 (Salt), 4-139 (Cox)\n\nDID NOT BAT: J. Overton, L. Dawson, A. Rashid, L. Wood, S. Baker\n\nBOWLING: Humphreys 4-0-25-0 (1w), McCarthy 3-0-22-1 (1w), Young 2.1-0-21-1 (1w), Campher 2-0-24-1 (1w), White 4-0-40-1 (1nb), Delany 2-0-18-0\n\nRESULT: England won by six wickets.\n\nPublished in Dawn, September 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d0724a9688c.jpg",
  "retrievedAt": "2025-10-12T00:08:47.295Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943767/cox-smashes-comeback-fifty-as-england-clinch-t20-series-in-ireland",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T02:05:20.000Z"
}
