{
  "title": "Pakistan can’t be considered rivals anymore, claims India cricket captain Suryakumar - Sport - DAWN.COM",
  "author": null,
  "content": "India men’s captain Suryakumar Yadav claimed matches against Pakistan can no longer be considered a real rivalry after his side extended their recent dominance over the Green Shirts with a six-wicket victory in their Asia Cup Super Four clash on Sunday.\n\nIndia’s second win over Pakistan at the T20 tournament padded their head-to-head record in the format to 11-3 against the Green Team, with one match tied.\n\nPakistan still has a lead in the overall record against India across all three formats with 88 wins against India’s 79 victories.\n\nPlayed against the backdrop of lingering tensions between the two nations in the wake of their military conflict in May, there were no handshakes between the players once again.\n\n“According to me, if two teams play 15-20 matches and if it is 7-7 or 8-7, then that is called a rivalry,” Suryakumar told reporters.\n\n“But 13-0, 10-1. I don’t know what the stats are. But this is not a rivalry anymore.”\n\nDefending champions India dropped four catches during the match, and Suryakumar said they would address the issue ahead of their next Super Four fixture against Bangladesh on Wednesday in Dubai.\n\nThe Green Shirts will play their next match against Sri Lanka on Tuesday.\n\n“The fielding coach has sent an email to the boys, who had butter fingers, to appear before him at his office,” the middle-order batter added.\n\n“But this happens, it is a part of the game. I am okay with it because it happened in the first game itself, and we have more crucial games to go.”\n\nThe top two teams of the Super Four stage will move into the final on September 28.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/22122032e255352.webp",
  "retrievedAt": "2025-10-12T00:08:20.901Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1943868/pakistan-cant-be-considered-rivals-anymore-claims-india-cricket-captain-suryakumar",
  "dateList": "2025-09-22",
  "date_published": "2025-09-22T07:31:55.000Z"
}
