{
  "title": "Indian apex court miserably failed in upholding the merit and demands of justice: AJK PM Anwar ul Haq.",
  "link": "https://www.app.com.pk/national/indian-apex-court-miserably-failed-in-upholding-the-merit-and-demands-of-justice-ajk-pm-anwar-ul-haq/",
  "date_published": "2023-12-11T17:03:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): , Dec 11 (APP):Azad Jammu Kashmir Prime Minister Chaudhry Anwar ul Haq, while condemning the Indian Supreme Court’s verdict upholding the presidential order regarding the revocation of Kashmir’s special status, has stated that the Indian apex court has miserably failed in upholding the merit and demands of justice.\nIn a special statement issued here on Monday, the AJK prime minister termed the court verdict as tantamount to murdering justice and robbing Kashmiris of their constitutional and human rights. Terming the abrogation of 370 and 35A by the Indian government as illegal and unconstitutional, the PM said Kashmiris had no hope from the Supreme Court of India.\n“I was pretty sure that the Supreme Court of India will go the extra mile to defend the Indian government’s decision”, he said, adding that Kashmiris had no faith in the Indian state apparatus, not even in its pliant judiciary.”All Indian institutions including the judiciary have been equally responsible for the current mess and worsening political and human rights situation in the occupied Kashmir”, he said.\nHe, however, maintained that the Kashmiris’ ongoing struggle for right to self determination would continue despite the Indian government’s policies of deceit and deception.\n“The Indian judiciary has a history of being biased towards Kashmiris. It has never given any relief to the Kashmiri people”, he said, adding that the Supreme Court through its recent verdict has proved it beyond any doubt that it was acting on the whims and fancies of the Indian establishment.\nTerming Kashmir as an internationally recognized disputed territory, the PM made it clear that the Indian supreme court’s decision cannot change the disputed status of the state.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:58:23.309Z"
}
