{
  "title": "Mushaal criticizes Indian SC for behaving like a ‘kangaroo court’",
  "link": "https://www.app.com.pk/national/mushaal-criticizes-indian-sc-for-behaving-like-a-kangaroo-court/",
  "date_published": "2023-12-11T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP): Special Assistant to Prime Minister for Human Rights and Women Empowerment, Mushaal Hussein Mullick Monday strongly criticized the Indian Supreme Court, for shamelessly behaving like a ‘kangaroo court’ and endorsing Modi’s unlawful decision on August 5, 2019.\n“India should avoid pushing peaceful Kashmiri youth to resort to alternative forms of resistance”, she said while addressing an event commemorating International Human Rights Day organized by Islamabad Chamber of Commerce and Industry (ICCI).\nZafar Bakhtawari, Secretary-General of UBC and former President of ICCI, along with Habib Malik Orakzai, President of the International Human Rights Commission and Vice President of Red Crescent Pakistan were also present at the event. Naveed Malik, President of the Islamabad Bar Association, and Asma Malik, a prominent social activist also attended the event, said a news release.\nMushaal appreciated the support of the Business Community of Pakistan for the people of Jammu and Kashmir and acknowledged their consistent presence at the forefront.\nShe commended the Islamabad Chamber of Commerce and Industry for organizing the event aimed at raising awareness about human rights.\nShe highlighted that India has established a grim record of the most severe human rights violations in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nMushaal lamented the lack of visual evidence of these violations, attributing it to India’s stringent information and communication blockade.\nTo shed light on the harsh realities faced by the people of IIOJK, she recounted leading a delegation of the All-Party Parliamentary Group (APPG) to meet refugees from IIOJK in Azad Jammu and Kashmir (AJK), providing a platform for the victims to share firsthand accounts of the brutality inflicted by India on the people of IIOJK.\nShe said that under the guise of revoking Article 370 and 35A, India is actively transforming the Muslim-majority region of Jammu and Kashmir into a Hindu-majority colony.\nShe pointed out that through the persecution of Muslims in Jammu and Kashmir and across India, Modi, along with his associates from the Rashtriya Swayamsevak Sangh (RSS), harbours ambitions of establishing Akhand Bharat. Emphasizing the need for global vigilance, especially during Indian elections, she cautioned against potential false flag operations by India.\nMushaal affirmed that the struggle for the people of Jammu and Kashmir persists.\nShe highlighted the resilience of Kashmiris, who are courageously facing off against a force of one million Indian troops, underscoring their steadfast commitment to achieving freedom from India.\nShe said that the indomitable spirit of the brave Kashmiris cannot be shaken by brutal, coercive, or unlawful tactics and decisions.\nAccording to Mushaal, their determination remains unyielding, and they will inevitably break free from the shackles of Indian oppression and subjugation, regardless of the challenges they face.\nIn a separate video message, Mushaal expressed concern about the implementation of “Jungle Law” in India.\nShe pointed out that the Indian Supreme Court had violated its own constitution by endorsing the unilateral acts of August 5, 2019. Mushaal drew attention to the disturbing competition between Modi and Netanyahu to lead the world in the number of killings of innocents.\nMoreover, Mushaal highlighted the global reach of the RSS (Rashtriya Swayamsevak Sangh) and the Indian terrorist network urging the international community to take notice.\nShe also called for collective action to prevent the continued persecution of Muslims in Jammu and Kashmir, and Palestine.\nShe appealed to the world to play an active role in halting the relentless violence perpetrated by India and Israel against Muslim populations.",
  "retrievedAt": "2025-08-11T10:58:10.223Z"
}
