{
  "title": "HEC announces Pak-Sri Lanka university faculty exchange programme",
  "link": "https://www.app.com.pk/national/hec-announces-pak-sri-lanka-university-faculty-exchange-programme/",
  "date_published": "2023-12-11T07:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 11 (APP):The Higher Education Commission (HEC) has announced Pak-SriLanka University Faculty Exchange Programme under Pak-Sri Lanka Higher Education Cooperation Programme.\nAccording to the official sources, HEC, in that regard, has invited applications from Pakistani and Sri Lankan faculty members to establish professional linkages between universities of the two countries.\nThe sources said that the programme supports annual faculty exchange visits for a duration of upto 2 weeks to participate in teaching, international curricula, research seminars, conferences, and collaborations through academic & research activities with impact.\nTo increase people-to-people contact, the faculty members will have various opportunities to learn about cultural, regional and historical values of bilateral interests while gathering international repute and respect for their respective universities, they added.\nSharing the funding details, they said that the funding for Boarding & Lodging will be paid by the Host University, while Air Travel – Economy Class Return Airfare and daily allowance will be given by Higher Education Commission.\nMeanwhile, as per Eligibility Criteria the candidates must be a Pakistani/Sri Lankan national. He/she should be Full-time faculty member of renowned public/private university/degree awarding institute of Pakistan/Sri Lanka.\nHowever, the candidates must also have invitation letter from the host university/degree awarding institute.\nIt was stated by HEC that the candidates will have to take NOC from the parent university/degree awarding institute. However, selection of discipline/subject will be based on national needs of both countries and relevance to the contemporary area of research.\nThe applicants are expected to have prior research record and relevant experience. To apply online, the interested applicants should visit www.hec.gov.pk/site/UFE for the Project terms and details, and to apply through prescribed Application Form.\nFollowing documents should also be attached along with the application form in PDF format and sent at info.paksl@hec.gov.pk.\nThe invitation letter from the host university/degree awarding institute and NOC from the parent university should be attached. The submission of the academic documents, Proposal/Planned activities of visit must be attached with the applications.  HEC announced the Deadline for the program as December 30,2023.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:58:02.571Z"
}
