{
  "title": "Connection between bench, bar to last forever; says CJP",
  "link": "https://www.app.com.pk/national/connection-between-bench-bar-to-last-forever-says-cjp/",
  "date_published": "2020-07-10T02:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP):Chief Justice of Pakistan (CJP) Gulzar Ahmed Friday inaugurated the Supreme Court Bar (SCB) complex.\nAddressing the participants, he said the SCB had provided five star-like facility to lawyers in the hostels. The apex court was always ready to help the bar, he said and added bench and bar were part of each other and the connection between the bench and bar would last forever.\nHe said the court required the help of lawyers in the administration of justice. He said the court was ready to provide any kind of facility for the complex.\nJustice Umar Ata Bandial addressing the occasion said the coronavirus had given a chance to think about new ideas. The video link was a great facility for the lawyers and litigants, he added.\nHe said SCB complex had excellent facilities. “We want lawyers to sit in this complex and give their arguments via video link,” he added.\nJustice Mushir Alam said the court was well-aware of the problems of bars and lawyers. There must be a dialogue between bench and bar once or twice a year, he added.\nHe said coronavirus had definitely changed the lives of all of us. He said our justice system was not at par with international level. According to the report of the World Justice Project, Pakistan was ranked 120th out of 128 countries, he added.\nHe said according to the World Bank report, Pakistan was ranked 156th out of 190 countries in the ease of doing business.\n“I have been involved in automation system for the last twenty years and he first tried automation in the Sindh High Court,” he said.\nHe said the lawyers considered automation as their enemy and began protesting.\nHe said he was the Chief Justice of Sindh High Court (SHC) and lawyers protested against him over automation. We were forced to end the automation system at the district level, he added.\nHe said the automation system was being installed at the Federal Judicial Academy. Now fake cases could not come in the SHC because litigants had to appear in person, he added.\nHe said income generated through automation system could be used to solve bar problems. He asked the Supreme Court Bar Association to frame laws for automation. Gilgit-Baltistan and Azad Kashmir had also been included for the automation, he added.\nHe said Islamabad High Court had also done a lot of work for e-courts.\n“We are currently facing a severe shortage of funds as we need big data bank and national data bank,” he added.\nHe said the time was not far away when litigants would be able to file cases from mobile.\nSenior Advocate Ali Zaffar said the coronavirus had changed our lives and how our judicial system could be escaped from the COVID-19.\nHe said the courts were doing 50% less work than their capacity. Coronavirus was an opportunity for the judiciary as courts could dispose of pending cases faster by using the latest technology, he added.\nHe said there was a need to set up an e-court system in the current situation. “We need to create a new generation digital judicial portal for the long term,” he said.\nHe said he had talked to the prime minister for the formation of judicial portal and he (prime minister) had given a positive response for its establishment.\nHe said the mobile service would have to be provided to the petitioners and used for recording of statement of the accused.\nSenior Advocate Hamid Khan said the 21st century had its own requirements and the judicial system would have to move towards online.\nHe said initially shopping and banking were online but now the courts would also be online.\nSCBA President Syed Qalb-i-Hassan said lawyers would be able to sit in the bar room and give arguments in SC Karachi, Peshawar, Quetta registries as rooms had been allocated in the bars for the video link.",
  "retrievedAt": "2025-08-11T19:28:29.208Z"
}
