{
  "title": "Pakistan’s pandemic policy of balancing life & livelihood endorsed worldwide: SAPM Bajwa",
  "link": "https://www.app.com.pk/national/pakistans-pandemic-policy-of-balancing-life-livelihood-endorsed-worldwide-sapm-bajwa/",
  "date_published": "2020-07-10T06:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP):CPEC Authority Chairman and Special Assistant to the Prime Minister on Information Gen (retd) Asim Saleem Bajwa Friday said Pakistan’s consistent policy of balancing life and livelihood during the coronavirus pandemic was being endorsed by the global community.\n“While the world seeks to enviously emulate Pakistan, our response stands vindicated. Our nation proves resilient as they adapt to beat back the menace,” Bajwa said, in a tweet, in response to a report by Oxfam, an international confederation of 20 non-governmental organizations working in over 90 countries against injustices causing poverty.\nWith most of the world engaged in containing the COVID-19 pandemic, the international humanitarian group has belled the alarm that hunger could even kill far more people than the coronavirus itself, joining Prime Minister Imran Khan’s call for balance between lives and livelihood.\nOxfam warned that by the end of year, 12,000 people per day could die from hunger linked to COVID-19, potentially more than those who would die from the disease itself. This is more than the peak global coronavirus death rate of 10,000 per day in April.\nThe latest Oxfam report “The Hunger Virus” is yet another endorsement of the approach adopted by Prime Minister Imran Khan since the outbreak of the coronavirus in Pakistan in March by strongly opposing blanket lockdown in the country.\nThe incumbent government initiated the smart lockdown strategy to ensure a balance between the lives and the livelihood by allowing the people earn their bread in a country where millions of people lived below the poverty line.\nWhile urging the governments for urgent action to end the hunger crisis, the charity organization said the pandemic was the final straw for millions of people already struggling with the impacts of conflict, climate change, inequality and a broken food system that had impoverished millions of food producers and workers.\nThe US-based Bloomberg news agency had also termed the smart lockdown approach the only hope of returning to a more normal life the world waits a vaccine.\nPrime Minister Imran Khan’s balanced approach has also got validation by the world famous scientists, organizations as well as international media.",
  "retrievedAt": "2025-08-11T19:28:24.069Z"
}
