{
  "title": "PM thanks leaders for messages of felicitations",
  "link": "https://www.app.com.pk/national/pm-thanks-leaders-for-messages-of-felicitations/",
  "date_published": "2024-03-09T16:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 09 (APP): Prime Minister Shehbaz Sharif Saturday thanked Presidents and leaders of different countries for sending him messages of felicitations on his assumption of the office of Prime Minister.\nIn a series of posts on X, he responded to the leaders. He thanked Vladimir Putin, President of the Russian Federation, for his message of felicitations on his election as Prime Minister. “I look forward to forging stronger ties between Pakistan and Russia in the days ahead.”\nHe said he was delighted to receive congratulatory letter and telephone call from his dear brother Emomali Rahmon, President of Tajikistan. “ I thank him for always being a sincere friend of Pakistan and look forward to building stronger ties between Pakistan and Tajikistan together.”\nHe thanked Ilham Aliyev, President of Azerbaijan for his warm message of felicitations on his election as Prime Minister of Pakistan. “I also thank H.E. Ali Asadov, Prime Minister of Azerbaijan for his letter of felicitations. Our two nations enjoy a unique bond of friendship that will grow from strength to strength.”\nHe said he was grateful to Shavkat Mirziyoyev, President of Uzbekistan, for his thoughtful letter to congratulate him on assuming office of Prime Minister for the second time. “I hope to work closely with him to strengthen relations of Pakistan and Uzbekistan across all spheres.”\nHe also thanked Kassym-Jomart Tokayev, President of Kazakhstan, for his message of prayers and good wishes on his election as Prime Minister. “Pakistan values its relations with your great country and I look forward to working with you to strengthen our bonds of friendship. I also look forward to our close cooperation in SCO and ECO.”\nHe expressed delight over receiving warm letters of felicitations from Serdar Berdimuhamedov, President of Turkmenistan and Gurbanguly Berdimuhamedov, National Leader of the Turkmen People & Chairman of Halk Maslakhaty. “I look forward to working with Turkmenistan to build stronger bilateral ties and enhance regional cooperation.”\nHe also thanked Sadyr Zhaparov, President of Kyrgyz Republic for the congratulatory letter on his assumption of the office.\n“Hope to enhance our bilateral cooperation and work closely in multilateral settings, particularly ECO & SCO.”He said he was grateful to Mahmoud Abbas, President of Palestine for his kind letter of greetings on his election as Prime Minister.\n“I assure him of Pakistan’s unwavering commitment and support for the just struggle of the Palestinian people. May the holy month of Ramadan bring peace and an end to violence and suffering in Gaza.”",
  "retrievedAt": "2025-08-11T01:13:10.978Z"
}
