{
  "title": "Asif Ali Zardari elected 14th President of Pakistan",
  "link": "https://www.app.com.pk/national/asif-ali-zardari-elected-14th-president-of-pakistan/",
  "date_published": "2024-03-09T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 09 (APP): Asif Ali Zardari, the President of the Pakistan People’s Party Parliamentarians (PPPP), has been elected as the 14th President of Pakistan by securing 411 votes, according to the results announced by the Election Commission of Pakistan (ECP).\nZardari, who previously served as president from 2008 to 2013, is now poised to succeed the outgoing President Dr. Arif Alvi.\nHe secured victory in the presidential race, surpassing his rival candidate, Mahmood Khan Achakzai, the chief of the Pakhtunkhwa Milli Awami Party and nominee of the Sunni Ittehad Council (SIC), who secured 181 votes.\nAccording to the ECP, the presidential polls held simultaneously at the Parliament House and the four provincial assemblies today saw participation from a total of 1,044 voters.\nAmong the votes cast, nine were deemed invalid.Total valid votes cast were 1,035.\nFollowing the application of the provisions outlined in paragraph 18 of the Second Schedule of the Constitution to the total valid votes, Zardari garnered 411 votes  and Achakzai count amounted to 181 votes.\nThe Election Commission of Pakistan (ECP) stated that the official tally of results on Form-VII will be compiled and sent to the federal government on Sunday, once the original records from the Presiding Officers are received, enabling the federal government to issue the formal notification.\nAccording to ECP, total seats in electoral college were 1,185. Out of which 92 seats were vacant. Remaining 1,093 were required to cast their votes.\nBased on the breakdown of votes, out of the votes cast in both the National Assembly and Senate, Zardari from PPPP secured 255 votes,\nwhile Achakzai from PkMAP attained 119 votes. Additionally, one votes were deemed invalid.\nAs many as 47 members of Balochistan Assembly, exercised their voting rights. Provisional results indicate that PPPP’s Zardari\nreceived all 47 votes, while no legislators supported Achakzai.\nIn the Sindh Assembly, Zardari from PPPP obtained 151 votes, while Achakzai secured nine; one vote was deemed invalid.\nIn the Khyber Pakhtunkhwa Assembly, Zardari secured 17 out of the total 109 votes, while Achakzai obtained 91 votes. One vote was rejected.\nIn the Punjab Assembly, Zardari garnered 246 votes, while Achakzai received 100 votes. Additionally, six votes were rejected. Total votes cast were 352.",
  "retrievedAt": "2025-08-11T01:13:13.413Z"
}
