{
  "title": "NDMA to launch mobile application to provide early warning of potential disasters",
  "link": "https://www.app.com.pk/national/ndma-to-launch-mobile-application-to-provide-early-warning-of-potential-disasters/",
  "date_published": "2024-03-09T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP): The National Disaster Management Authority (NDMA) is soon launching a mobile application to provide early warning of potential disasters and safety measures to the public.\nIn wake of the rain forecast, the NDMA has issued instructions to the concerned departments in view of possible rain and snowfall in the coming week.\nRain and snowfall is expected in Khyber Pakhtunkhwa, Gilgit Baltistan, Murree and Galliyat during the period.\nThe contact roads are also likely to be blocked due to landslides and heavy snowfall.\nThe NDMA has directed the concerned officials to take weather awareness measures to ensure the safety of tourists and travelers.\nThe authority has instructed all PDMAs and other concerned administrative bodies to be alert to deal with any kind of emergency.\nThe local administration should take timely measures to ensure timely availability of emergency personnel and machinery in mountainous and snowy areas.\nThe NDMA has also given instructions to ensure timely evacuation of people from potentially at-risk populations.\nThe concerned departments should continue continuous monitoring of water flow in rivers and canals.\nAll concerned departments should strengthen the communication and support framework.\nThe NDMA has also directed the officials to ensure the availability of messages in local languages ??for public awareness and timely provision of emergency personnel and machinery in areas affected by landslide risk.\nThe farmers are advised to carry out agricultural activities keeping in mind the weather.\nWhile the tourists should plan their trip keeping in mind the weather conditions of the hilly areas.\nThe tourists are also advised to keep the important numbers of the administration in the area with them where they intend to travel.",
  "retrievedAt": "2025-08-11T01:13:10.997Z"
}
