{
  "title": "PUC escalates efforts to foster interfaith dialogue, harmony on global scale",
  "link": "https://www.app.com.pk/national/puc-escalates-efforts-to-foster-interfaith-dialogue-harmony-on-global-scale/",
  "date_published": "2024-03-16T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Pakistan Ulema Council (PUC) Chairman, Hafiz Muhammad Tahir Mehmood Ashrafi on Saturday said the council is set to escalate its efforts on a global scale to foster interfaith dialogue and harmony.\nAddressing international media in connection with the ‘International Day to Combat Islamophobia’, he emphasized that Islamophobia poses a grave threat to Muslims worldwide.\nAshrafi urged world powers to accelerate initiatives to eradicate Islamophobia, labeling it as a toxic barrier hindering interfaith harmony.\nHe called upon the United Nations, the Organization of Islamic Cooperation, and other international bodies to champion initiatives aimed at eradicating all forms of discrimination while nurturing a culture of love, tolerance, and coexistence.\nHe stressed that Islam embodies peace, love, and tolerance, emphasizing the teachings of Allah Almighty and the Prophet Muhammad (peace be upon him).\nAshrafi lamented the incitement of non-Muslims against Islam, attributing it to misinformation and hatred propagated against Islamic teachings.\nRecognizing Islamophobia as a crime, Ashrafi highlighted the designation of March 15 as the ‘International Day to Combat Islamophobia’ by the United Nations, a milestone achieved through collaborative efforts involving Pakistan, Saudi Arabia, the Organization of Islamic Cooperation, and other entities.\nAshrafi emphasized the urgency of addressing global anti-Muslim sentiment, branding discrimination as a significant threat to world peace.\nHe underscored the need to clarify the distinction between Jihad and terrorism through dialogue, particularly in the aftermath of the 9/11 attacks, which fueled widespread misconceptions about Islam and Muslims in the Western world.\nThe PUC, Ashrafi said, pledged to intensify its global endeavors for interfaith dialogue and harmony, culminating in an upcoming international conference, themed ‘Paigham-e-Pakistan’ in Islamabad after the holy month of Ramazan.\nHe informed that the conference would be comprised all faith leaders as the invitations will be tendered to Imam of Khana-e-Kaba, Grand Imam of Palestine, Sheikh Al-Azhar, Pop Francis, Bishop of Canterbury and many more.",
  "retrievedAt": "2025-08-11T01:20:46.354Z"
}
