{
  "title": "Australian envoy extends felicitation on Pakistan Day; cites opportunities for mutual benefits",
  "link": "https://www.app.com.pk/national/australian-envoy-extends-felicitation-on-pakistan-day-cites-opportunities-for-mutual-benefits/",
  "date_published": "2022-03-23T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP): Australia’s Chargé d’Affaires in Pakistan, Bryce Hutchesson Wednesday congratulated the people and government of Pakistan on Pakistan Day, saying there were many opportunities available for the mutual benefit of two countries.\n“I congratulate the people and Government of the Islamic Republic of Pakistan in celebrating the 82nd anniversary of the passing of the Pakistan Resolution,” he said in a message.\nHe said Australia had been a steadfast friend to Pakistan since independence. Both the countries have much in common, with a common heritage no better illustrated than our shared love of cricket.\n“The goodwill surrounding the current tour of Pakistan by the Australian cricket team has been heart-warming and shows yet again the hospitality for which Pakistanis are renowned,” he remarked.\nHutchesson said Australia had long supported Pakistan’s efforts to build prosperity and inclusive development, including through water management, rural productivity and gender equality.\nHe said Australia stood with Pakistan in the face of COVID-19, strengthening disease detection capabilities and providing humanitarian assistance.  And we have worked together on transnational security challenges, he added.\n“All this provides a solid foundation for strengthening our bilateral ties, underpinned by a vibrant Pakistani-origin community in Australia now approaching 90,000 people,” he said.\nThe Chargé d’Affaires said with easing of travel restrictions, Australia looked forward to welcoming many Pakistanis to its shores in 2022 and beyond, including Pakistani students returning to their world-class educational institutions.\nHe believed that the growing trade and commercial ties would support post-pandemic economic recovery in both the countries.\n“There are many opportunities for mutual benefit, particularly in education and agriculture. Australia’s excellence in innovation, science and technology provides fertile opportunities for business-to-business collaboration,” he added.",
  "retrievedAt": "2025-08-11T14:35:36.913Z"
}
