{
  "title": "Pakistan Navy celebrates 23rd March with traditional zeal & fervour",
  "link": "https://www.app.com.pk/national/pakistan-navy-celebrates-23rd-march-with-traditional-zeal-fervour/",
  "date_published": "2022-03-23T18:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP):Pakistan Navy on Wednesday celebrated Pakistan Day with traditional zeal and zest. This day being the symbolic reminiscent of great efforts of Muslims of sub-continent recalls their determination and fortitude that changed the course of the history, said a Pakistan Navy media release.\nPakistan Day resonates the demand of a separate homeland to safeguard sanctity of rights of Muslims in the sub-continent. Every year this day marks the determination and eminence of a resilient Muslim nation that fight all odds with unity and commitment.\nThe day dawned with Gun Salutes while prayers were offered for solidarity of the beloved homeland. Flag hoisting ceremonies and illuminations were organized on board Pakistan Navy Ships and Establishments as per ceremonial norms.Pakistan Day Parade was held at Shakarparian parade ground Islamabad. Smartly clad and agile contingent of Pakistan Navy was part of the Joint Services Parade. Pakistan Navy contingent included Lady Officers, Special Services Group (Navy) and PN Band.\nIn addition, Pakistan Navy aircraft P3C Orion, Z-9 EC and Seaking helicopters impressively flew past during the parade. Pakistan Navy Sea Eagle Team comprising Special Services Group (Navy) paratroopers were part of Tri Services Sky Diving Team. The team exhibited various free fall jumping techniques, which included complicated Maneuvers and landing at targets with precise accuracy.\nDuring other activities of the day, a boat rally of local fishermen, debate competitions and Pakistan Zindabad rally by students of Bahria Colleges was held at Ormara and Gwadar in which local populace actively participated.\nPresident of Pakistan, Dr Arif Alvi approved awards for officers and men of Pakistan Navy which included three Hilal-i-Imtiaz (Military), seven Sitara-i-Imtiaz (Military), five Tamgha-i-Imtiaz (Military) and one Tamgha-I-Basalat. In addition 40 Letter of commendations were conferred by Chief of the Naval Staff for outstanding performance by officers and men of Pakistan Navy.\nCelebrations were also held at HQ NAVCENT Bahrain. Pakistan led Command Task Force -150 (CTF-150) celebrated Pakistan Day with traditional fervour. Officers & men and senior naval representatives from partner nations attended the ceremony.",
  "retrievedAt": "2025-08-11T14:35:33.290Z"
}
