{
  "title": "PM vows to spread network of sports grounds for youth across Pakistan",
  "link": "https://www.app.com.pk/national/pm-vows-to-spread-network-of-sports-grounds-for-youth-across-pakistan/",
  "date_published": "2021-12-06T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP): Prime Minister Imran Khan on Monday highlighting the importance of sports for healthy life and giving the youth a mental strength to fight the challenges in life, expressed his government’s resolve to spread a network of sports ground across the country.\n“When you learn to compete in ground, you also learn to win and also learn to face defeat…When there comes a difficult time in the life of a person, he or she faces that challenge with courage,” Imran Khan told a huge gathering youth here at Jinnah Stadium on the occasion of the launching of country’s historic Kamyab Jawan Sports Drive.\nSports Drive was part of the new four projects worth Rs. 4 billion initiated by the present government in coordination with Kamayab Jawan Programme and the Higher Education Commission to keep the country’s youth engaged in sports and extracurricular activities.\nThe Prime Minister, who earlier launched the Sports Drive and lit-up the torch, said that since the country’s 70% of population was under the age of 30 years, the present government has so far developed 300 and 260 sports grounds in Khyber Pakhtunkhwa and Punjab, respectively.\nHe said that with New Zealand, a country of just 5 million population, had more sports grounds than Pakistan – a country of 220 million people, the present government was striving to develop sports grounds in every village, town, Tehsil and Districts across the country.\nThe Prime Minister said as a new sports policy has also been announced, the government was taking all reforms measures to strengthen the sports bodies and organizations and eliminate mafias from sports.\nBesides the promotion of sports activities, Imran Khan said that the government was also focusing on education and had disbursed Rs. 47 billion in scholarships to 6.3 million youth, the highest number of scholarships in country’s history.\nThe Prime Minister mentioned his 21 years of experience in sports and said his message for the youth was that they should never feel discouraged after defeat in a game, as it provided them an opportunity to review their shortcomings and prepare themselves for the next competition with a renewed vigor and spirit.\nHe said that the government was striving to take Pakistan forward in international sports through various measures including talent-hunt, development of grounds, reforms in sports bodies and elimination of mafias.\nThe Prime Minister congratulated his Special Assistant on Youth Affairs Usman Dar for organizing such a big event of Kamyab Jawan Sports Drive and hoped that such talent-hunt drives will help further promote sports culture in the country and among youth.\nMinister for Inter-Provincial Coordination and Sports Dr. Fehmida Mirza in her remarks on the occasion described the Kamayab Jawan Programme as one of the present government’s best programmes and initiatives.\nShe said under the new sports policy made in line with the vision of Prime Minister Imran Khan, the government during its five year tenure will develop sports grounds at every Tehsil and Districts of the country.\nDr. Femida Mirza also thanked the Prime Minister for allocating billions of rupees for the people of Sindh under the government’s Ehsas Programme.\nSpecial Assistant to PM on Youth Affairs Usman Dar while speaking on the occasion highlighted the details and objectives of the Kamyab Jawan Sports Drive.\nBesides the participation of a total of 6000 youth including 3300 boys and 2700 girls in the age group of 15 to 25 years in the sports competition, he said, a large number of youth from the across the country had gathered at Jinnah Stadium to witness the Sports Drive.\nUsman Dar highlighted the importance the present government gives to youth and mentioned the allocation of Rs. 100 billion for the provision of soft loans to unemployed youth under the Kamayab Jawan Programme.",
  "retrievedAt": "2025-08-11T21:41:42.833Z"
}
