{
  "title": "Former England players pay tribute to Bird at legendary umpire’s funeral - Sport - DAWN.COM",
  "author": null,
  "content": "Legendary cricket umpire Dickie Bird was hailed as one of the sport’s greatest characters as former England players Geoff Boycott and Michael Vaughan led the tributes at his funeral on Sunday.\n\nBird died at the age of 92 in September, and his life was celebrated in a service at St Mary’s Church in his hometown of Barnsley.\n\nFormer England captain Vaughan joined ex-England batsmen Boycott and Martyn Moxon were among the mourners.\n\nBoycott, 84, shared speaking duties with Yorkshire chair Colin Graves as the pair took turns to pay their respects to Bird.\n\nBoycott, who knew Bird from the age of 15, described the umpire as “comic and lovable” and “daft as a brush”.\n\n“He became the most famous and well-known umpire in the world, but most importantly, he was the best umpire in the world,” Boycott said.\n\n“Harold Dennis Bird was a one-off and very, very special. Rest in peace, my friend.”\n\nBird’s coffin, which entered the church to the music of Edward Elgar and left to the strains of My Way by Frank Sinatra, was topped by his trademark white flat cap and decked out in a floral cricketing tribute of a bat and ball.\n\nFlags representing the sport’s Test-playing nations were among on the coffin.\n\n“Dickie was one of the family. He will be missed greatly but never forgotten,” Graves said.\n\n“A national and a Yorkshire treasure. What you saw is what you got.”\n\nBird, who retired from playing at 32, went on to stand as an umpire in a then record 66 Test matches, as well as 69 ODIs and three World Cup finals.\n\nHe was renowned for his ability to build positive relationships with players.\n\nBird’s distinctive mannerisms and eccentric charm saw him become a celebrity in his own right and his autobiography sold in excess of one million copies.\n\n“He was such a great character. He was married to cricket and his home was Headingley,” Vaughan said.\n\n“We’ll give him a great send-off. He brought so much joy to so many people around the world. Not just in Yorkshire but all round the globe, they’ll be raising a toast.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:21:46.146Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949965/former-england-players-pay-tribute-to-bird-at-legendary-umpires-funeral",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T17:24:52.000Z"
}
