{
  "title": "Brother of National Party’s leader killed in Balochistan’s Panjgur - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Party (NP) central leader and MPA Rehmat Saleh Baloch’s brother, Waleed Saleh Baloch, was killed in Balochistan’s Panjgur area on Sunday, according to statements by the party and the province’s chief minister.\n\nBalochistan Chief Minister Sarfraz Bugti condemned the incident in a statement and ordered the immediate arrest of the suspects.\n\n“All resources will be used to provide justice to the affected family,” the CM said, according to a statement issued by his office.\n\nAccording to the statement, the CM had sought a report from police regarding the incident.\n\nDawn.com has reached out to the police for further details.\n\nMeanwhile, the NP also strongly condemned the incident in a statement, adding that the party would observe three days of mourning. It added that at the time of the incident, Waleed was celebrating his wedding.\n\nIt said that the incident was not only “the murder of an ordinary citizen but also the murder of a person belonging to a dignified and political family who has always believed in peace, non-violence, patience and tolerance and political values ​​and traditions”.\n\n“The government has completely failed to protect the lives and property of citizens, and such incidents clearly indicate this failure,” the statement added, further calling the murder “a deep shock for the […] people and political classes of entire Balochistan”.\n\n“Such violent incidents are conspiracies of anti-peace elements who are enemies of peace, development and political stability in Balochistan,” the NP said.\n\nPPP leader Haji Ali Madad Jattak and adviser to the CM Dr Rubaba Khan Buledi also condemned the killing, calling it a “tragic and alarming incident” that threatened the peace of the entire province.\n\nToday’s incident comes around two months after another brother of Rehmat Saleh Baloch was injured in an attack at the Quetta-Karachi National Highway near Mastung. He was travelling along with the Panjgur deputy commissioner, who was killed in the attack.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/19223807c29c8db.webp",
  "retrievedAt": "2025-10-20T18:21:46.277Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949967/brother-of-national-partys-leader-killed-in-balochistans-panjgur",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T18:25:24.000Z"
}
