{
  "title": "Another Doha pact - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE is little optimism or even enthusiasm surrounding the post-ceasefire talks between Afghanistan and Pakistan taking place in Doha. Yet, it would be unwise to dismiss them outright. If one assesses the potential pragmatically, these discussions could evolve into a ‘Doha pact’ of their own, echoing the 2021 agreement between the Taliban and the US that altered the regional geopolitical landscape.\n\nFacilitated by Qatar and Saudi Arabia, the Taliban have agreed to sit down with their Pakistani counterparts in Doha to discuss bilateral relations and the possible extension of the ceasefire, which was initially agreed upon for just 48 hours after recent border clashes between the two countries.\n\nShould the two sides reach an understanding akin to the earlier Doha accord, where the Taliban provide verifiable guarantees that the TTP and other Afghan-based militants will not operate against Pakistan, it could prove transformative. Such an agreement would not only redefine the troubled bilateral relationship but could also reshape the regional landscape. The prospects for transnational connectivity, trade and mega infrastructure projects linking Central and South Asia would expand dramatically, offering tangible improvements to the lives of millions across the region.\n\nHowever, the Taliban leadership does not have such a vision, and the major problem with the Taliban leadership lies in its deeply conventional mindset in both political and religious thinking. This rigidity stems mainly from their madressah education, whether in Pakistan or Afghanistan. Most of their leaders, whether graduates or dropouts, share the same worldview, cutting across all factions and shades of leadership, from the so-called ‘moderates’ like Abbas Stanikzai to the Haqqanis and hardliners such as Mullah Abdul Hakim Haqqani.\n\nThe Taliban perceive the world as something that must learn to accommodate them.\n\nThey perceive the world as something that must learn to accommodate them or strive to understand them, while they see no reason to change themselves. They consider themselves victorious, having defeated great powers, and believe the world should now deal with them on their terms. Consequently, they show little willingness to reconsider their orthodox, religiously driven policies of moral policing or their severe restrictions on women and other vulnerable segments of society, despite appeals from respected religious scholars across the Islamic world.\n\nTheir mindset is incompatible with evolving global norms, and even with the political realities of authoritarian yet relatively modern Muslim societies. Why, then, should others be expected to give them time or understand their so-called compulsions, which they often cite when discussing terrorism-related issues with Pakistan and neighbouring countries? Why should Pakistan and others continue to listen to them and at what cost? Must Pakistan continue to bleed at the hands of the TTP and other militant groups while the Taliban offer themselves as mediators between the state and terrorists?\n\nIn contrast, when militant groups rooted in Al Qaeda and Daesh captured parts of Syria, their behaviour, both internally and in their engagement with the world, was notably different. One understands that Afghanistan is not Syria. Syria, despite its devastation, is attempting to rebuild through a fragile but ongoing national consensus and is showing a willingness to align, at least partially, with regional and global norms. The Taliban, by comparison, have failed to foster any such consensus at home.\n\nUnlike in Syria, where elements of the leadership remain visible, reachable, and at times open to dialogue with world powers, including the US and Russia, the Taliban’s supreme leader, Mullah Hibatullah Akhundzada, remains hidden. The reasons for his seclusion are unclear. Officially, it is attributed to ‘security concerns’, but these explanations no longer hold much weight. What is he afraid of? Lack of confidence, fear of dissent, or simply an inability to step out of a wartime mindset? No one truly knows who is making decisions on his behalf. The Taliban’s internal communications are riddled with contradictions, and myths continue to swirl around their leadership.\n\nOne recent example illustrates this opacity and confusion. Reports emerged that Mullah Hibatullah had ordered an internet shutdown across Afghanistan, citing concerns that WhatsApp and other social media apps were spreading obscenity, vulgarity, and music. Yet, just a few days later, he reportedly asked an aide why he was no longer receiving WhatsApp messages. When informed that the services had been suspended on his own orders, he reluctantly directed that internet access be restored.\n\nSuch incidents, while almost absurd on the surface, reveal a deeper problem within the Taliban’s governance structure — a leadership trapped between ideological rigidity and the demands of a connected, modern world.\n\nThe Taliban leadership is neither innovative nor forward-looking in shaping better relations with its neighbours, particularly Pakistan and China, despite the long-term advantages such engagement could bring. Instead, they continue to rely on the old Afghan template of suspicion and defiance towards Pakistan, a posture that frustrates Islamabad even more than the persistent terrorist threat the country faces daily.\n\nIndia, fully aware of these sensitivities, has been quick to exploit the Taliban’s posture to its advantage, skilfully playing on Pakistan’s insecurities. For the Taliban, this dynamic serves as a convenient balancing act, using the Indian card to counter Pakistan’s pressure on issues of terrorism and border security-related affairs.\n\nIn Doha, the Taliban are unlikely to change. Neither Qatar nor Saudi Arabia possess the leverage to compel them to abandon their closest militant ally, the TTP. China, too, has failed to persuade them on this issue, and it remains unclear what strategy the Gulf mediators can employ to convince the Taliban to address Pakistan’s concerns about cross-border terrorism seriously. The likelihood is that the Taliban will continue to deny responsibility, insisting that the TTP problem is an ‘internal matter’ for Pakistan and offering, at best, vague proposals for dialogue.\n\nTo avoid embarrassing their hosts, the ceasefire between Afghanistan and Pakistan may be extended for a few weeks. But the real solution does not lie in diplomatic gestures or temporary truces. It lies in the Taliban’s willingness to completely sever ties with all forms of terrorism, something they had promised to the US in the original Doha Agreement, and a commitment they may now be compelled to make once again, this time to Pakistan.\n\nThe writer is a security analyst.\n\nPublished in Dawn, October 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f45b7463190.jpg",
  "retrievedAt": "2025-10-20T18:21:58.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949856/another-doha-pact",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T03:32:22.000Z"
}
