{
  "title": "PSX stays green amid volatility, geopolitical tensions - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) experienced a week of significant volatility, as the KSE-100 index showed modest gains of 0.44 per cent. Despite fluctuations driven by profit-taking and geopolitical tensions, particularly with Afghanistan, the market rebounded by the closing session.\\n\\nAccording to Topline Securities, the muted gain was largely due to profit-taking by institutional investors and concerns over regional tensions with Afghanistan. The average daily traded volume stood at 1.8bn shares, while the average traded value was Rs55.6bn.\\n\\nArif Habib Ltd (AHL) reported that the KSE-100 index saw a rollercoaster ride throughout the week. Initially pressured by profit-taking, the market regained momentum towards the end as geopolitical and domestic political tensions eased. The positive sentiment was also supported by Pakistan’s progress in securing a Staff-Level Agreement (SLA) with the International Monetary Fund (IMF) regarding the second review of the $7bn Extended Fund Facility (EFF) and the first review of the $1.3bn Resilience and Sustainability Facility (RSF). The agreement, which still requires approval from the IMF Executive Board, is expected to unlock $1bn under the EFF and $200m under the RSF. By the end of the week, the KSE-100 Index had risen 708 points, closing at 163,806.\\n\\nIn addition to the IMF agreement, the week also saw mixed macroeconomic data. The Pakistan Bureau of Statistics (PBS) reported a trade deficit of $3.4bn for September, bringing the cumulative deficit for the first quarter of FY26 to $9.4bn, a 33.8pc year-on-year (YoY) increase. However, the government successfully raised Rs506.7bn in the Pakistan Investment Bond (PIB) auction, surpassing its target of Rs450bn. Meanwhile, in the treasury bills auction, Rs775.9bn was raised, exceeding the target of Rs750bn.\\n\\nIndex ends week with modest gains thanks to IMF deal boost\\n\\nSector-wise, Pakistan’s refinery upliftment (excluding fuel oil) grew by 21.6pc YoY in September, with high-speed diesel (HSD) contributing to a 32.1pc YoY increase. This trend was driven by stronger domestic demand and better control over Iranian oil inflows. Oil production also saw a slight increase of 1.3pc week-on-week, reaching 65,301 barrels per day (bopd), boosted by output from the Sharf, Pasakhi, and Makori East fields.\\n\\nThe country’s foreign exchange reserves held by the State Bank of Pakistan (SBP) increased by $20.7m to $14.44bn. On the currency front, the Pakistani rupee remained steady, closing at 281.10 against the dollar, showing little change from the previous week.\\n\\nLooking ahead, AHL expects select stocks to remain in focus as the results season progresses. Investor sentiment may further improve with any positive developments regarding IMF approval. The KSE-100 is currently trading at a Price-to-Earnings (P/E) ratio of 8.5x, slightly below its 15-year average of 8.59x. It also offers a dividend yield of around 5.5pc, which is close to the historical average of 6.11pc.\\n\\nOn the global front, investor sentiment was slightly dampened by the geopolitical tensions between Pakistan and Afghanistan, but the market ended the week on a positive note. The KSE-100 gained 708 points, marking its second-highest single-day gain of 7,033 points on Tuesday. A significant increase in market participation was observed, with average daily traded volume rising to 2.2bn shares, up from 1.6bn shares the previous week.\\n\\nMacroeconomic figures showed mixed results. Petroleum imports in September stood at $1.2bn, down 11pc YoY, while textile exports for the month totalled $1.6bn, down 2pc YoY. The inflows through the Roshan Digital Account (RDA) increased by 17pc YoY to $196m, and Large-Scale Manufacturing (LSM) output rose by 0.5pc YoY in August.\\n\\nIn sector performance, vanaspati & allied industries, commercial banks, and power generation & distribution were among the top performers, with gains ranging from 1.8pc to 3.4pc. On the downside, sectors such as leasing companies, textile weaving, and leather & tanneries saw declines of up to 3pc.\\n\\nInvestor sentiment in the KSE-100 is expected to remain positive, buoyed by Pakistan’s successful staff-level agreement with the IMF, along with an outlook for improved foreign investment flows. The KSE-100’s current valuation of 7.3x, combined with an attractive dividend yield of 6.7pc, positions it as an appealing option for investors, according to AKD Securities Ltd.\\n\\nPublished in Dawn, October 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/190928266b7e647.webp",
  "retrievedAt": "2025-10-20T18:42:04.213Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949857/psx-stays-green-amid-volatility-geopolitical-tensions",
  "dateList": "2025-10-19",
  "date_published": null
}
