{
  "title": "Consumers face tomato shock amid govt’s inaction - Business - DAWN.COM",
  "author": null,
  "content": "• Price surges to Rs560 per kg\n• Pulses stay costly despite global drop\n• Poultry prices fall amid overproduction\n\nKARACHI: The price of tomatoes has surged, with rates reaching as high as Rs560 per kilogram in retail markets.\n\nWholesalers, however, claim that retailers are charging more than double the wholesale price, which currently stands between Rs250-300 per kg. The inflated prices have left many consumers buying smaller quantities, often just 250 grams, to meet their immediate needs.\n\nHaji Shahjehan, President of the Falahi Anjuman Wholesale Vegetable Market Super Highway, attributed the high prices to a shortage of tomatoes in the wholesale market. He cited the declining Balochistan crop, which is nearing its end, and the thin arrival of tomatoes from Iran as key factors. The situation has been further exacerbated by the tense border conditions between Pakistan and Afghanistan, making tomato shipments from Afghanistan unlikely. New supplies from Sindh are expected to arrive next month.\n\nShahjehan added that the absence of price lists in markets allows retailers to set prices at their discretion, leading to substantial markups. Prices of other vegetables, including peas, ridge gourd, and ginger, have also risen, with some items seeing a price increase of Rs50-100 per kg.\n\nPoultry prices decline\n\nWhile vegetable prices are spiralling, consumers have seen some relief in poultry prices. The national average price of live poultry has dropped to Rs300-390 per kg, down from Rs440-540 per kg in Septem­ber. Similarly, the price of boneless chicken has fallen from Rs1,000-1,100 per kg to Rs650-800 per kg.\n\nKamal Akhtar Siddiqui, Sindh Poultry Wholesalers Association General Secretary explained that the drop in prices was due to overproduction at poultry farms. With shipments of live birds and eggs to Afghanistan suspended because of border closures, farmers have been forced to release overgrown birds into the market at lower prices. In some areas, live chickens are being sold for as low as Rs400 per kg, while chicken leg pieces are priced around Rs350 per kg. However, eggs have remained expensive, with prices between Rs310-360 per dozen, driven by high demand following the reopening of schools.\n\nPulses stay costly\n\nIn the pulses sector, wholesale prices have largely remained stable despite a decline in international prices. Masoor, mung, mash, and gram pulses continue to sell at Rs250-300, Rs320-500, Rs380-530, and Rs250-380 per kg, respectively, since September. Rauf Ibrahim, President of the Karachi Wholesalers Grocers Association, noted that global prices for several pulses, including black gram, arhar, and masoor, had fallen sharply. However, these reductions have not been passed on to consumers at the retail level. Ibrahim emphasised the government’s responsibility to ensure that lower wholesale prices reach the public.\n\nThe international price of pulses has seen a noticeable drop, with black gram falling from $650 to $460 per tonne, arhar from $1,000 to $500 per tonne, and masoor from $660 to $460 per tonne. The price of Kabuli Channa has also fallen from $750-800 to $650 per tonne. Ibrahim anticipates that additional shipments of pulses from countries such as Burma, Australia, and Tanzania could further reduce prices next month.\n\nSugar concerns\n\nSugar prices in Pakistan have remained steady, with rates ranging from Rs177-200 per kg despite concerns raised by the Pakistan Sugar Mills Association (PSMA). On October 14, 2025, the PSMA discussed the ongoing issue with the Federal Board of Revenue (FBR) over the suspension of sugar sales through the S-Track Portal. PSMA officials warned that continued disruption to the portal could lead to a sugar shortage, which would drive prices up.\n\nThe association claims that the FBR’s actions are aimed at facilitating the sale of imported sugar while hindering the sale of domestic sugar. PSMA representatives argue that this could destabilise the market and increase prices, leaving the industry unable to shoulder the blame for rising costs.\n\nVolatility impact on consumers\n\nThe Karachi food market continues to experience significant price volatility, which has left many consumers struggling to adjust to the shifting cost of everyday items. Retailers have faced criticism for overcharging, with no clear pricing guidelines in place to regulate the market. Wholesale prices, though, have seen a general downward trend in some sectors.\n\nPublished in Dawn, October 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:21:59.509Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949863/consumers-face-tomato-shock-amid-govts-inaction",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T03:40:00.000Z"
}
