{
  "title": "UN aid chief sees ‘massive job’ ahead on tour of Gaza - World - DAWN.COM",
  "author": null,
  "content": "• Says Palestinians want dignity, calls northern Gaza a ‘wasteland’\n• Relief stalled as Israel insists Rafah crossing to stay shut until Hamas returns remains of all prisoners\n• Nine members of a family killed when Israeli forces fired at bus\n\nJERUSALEM: The United Nations aid chief on Saturday took stock of the monumental task of restoring dignity and hygiene for Palestinians struggling to survive amid Gaza’s devastation, as he witnessed residents digging latrines among the ruins, while Israel and Hamas exchanged more bodies.\n\nA convoy of white UN jeeps carried relief coordinator Tom Fletcher and his team through the twisted rubble of shattered homes to see a wastewater treatment plant in Sheikh Radwan, north of Gaza City.\n\n“I drove through here seven to eight months ago when most of these buildings were still standing and, to see the devastation — this is a vast part of the city, just a wasteland — and it’s absolutely devastating to see,” he told AFP.\n\nThe densely populated cities of the Gaza Strip, home to more than two million Palestinians, have largely been reduced to ruins by two years of bombardment and intense fighting between Hamas and the Israeli army.\n\nDigging latrines\n\nSurveying the damaged pumping equ­i­pment and a grim lake of sewage at the Sheikh Radwan wastewater plant, Fle­t­cher said the task ahead for the UN and aid agencies was a “massive, massive job”.\n\nThe British diplomat said he had met residents returning to destroyed homes trying to dig latrines in the ruins.\n\n“They’re telling me most of all they want dignity,” he said.\n\n“We’ve got to get the power back on so we can start to get the sanitation system back in place. Fletcher outlined an ambitious relief plan. “We have a massive 60-day plan now to surge in food, get a million meals out there a day, start to rebuild the health sector, bring in tents for the winter, get hundreds of thousands of kids back into school.”\n\nBodies exchange and Rafah crossing\n\nMeanwhile, Hamas has returned the final 20 surviving prisoners it was holding and has begun to hand over the remains of another 28 who died.\n\nOn Saturday, in line with the terms of the ceasefire deal, Israel returned the bodies of 15 more Palestinians to Gaza, the health ministry in the Hamas-run territory said.\n\nAs aid trickles in, the situation surrounding the Rafah border crossing remains disputed.\n\nOn Saturday, the office of Israeli Prime Minister Benjamin Netanyahu said the crossing would remain closed until Hamas hands over the bodies of all deceased prisoners still held in Gaza.\n\nThis contradicted an earlier announcement by the Palestinian Embassy in Cairo that the crossing would reopen on Monday. Israeli authorities, who had multiple times over the past few days delayed the border’s opening, said that when the crossing does reopen, it will permit only the movement of people, not aid.\n\nThe Gaza health ministry said that some of the bodies returned on Saturday bore signs of “abuse, beatings, handcuffing and blindfolding”.\n\nNine family members killed\n\nGaza’s civil defence agency said Israeli forces killed nine members of a single Palestinian family when they shelled a bus on Friday, after the military confirmed it had targeted a vehicle that crossed the so-called “yellow line”.\n\n“Our teams recovered the bodies of nine martyrs, including four children and two women, after Israeli occupation forces directly targeted the vehicle they were travelling in,” Mahmud Bassal, a spokesperson for the Gaza Civil Defence agency, said in a statement to AFP on Saturday.\n\nBassal said Israeli forces fired “two tank shells at the vehicle,” and noted that the bodies of two children remained missing, as their “remains were scattered due to the intensity of the bombardment”.\n\nHe said recovering the rem­­­­­ains has been particularly challenging because of the “difficult field and environmental conditions” in the area.\n\nPublished in Dawn, October 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f414df9ee75.jpg",
  "retrievedAt": "2025-10-20T18:22:25.305Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949817/un-aid-chief-sees-massive-job-ahead-on-tour-of-gaza",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T02:24:02.000Z"
}
