{
  "title": "Karachi, Hyderabad face dengue outbreak as cases spike alarmingly - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Health dept data suggests all is well on dengue front in Sindh with just 819 confirmed cases\n• Figures obtained from four Karachi hospital show 2,972 positive cases reported from Sept 1 to Oct 16\n• One public sector Hyderabad lab confirms 9,075 dengue cases between Sept 1 and Oct 14\n• Govt says 215,270 malaria cases also reported this year in province\n\nKARACHI / HYDERABAD: While the provincial health department puts the total number of dengue cases in Sindh this year at 819, figures obtained by three major Karachi hospitals and one public sector laboratory and its branches in Hyderabad suggest an outbreak-like situation, with the actual number exceeding 12,000 in a short span of just six weeks.\n\nThe government had confirmed one dengue-related death in July, but independent figures suggest four dengue patients in Hyderabad —a young girl and two men and an elderly woman — and two in Karachi had lost their lives after testing positive to the mosquito-borne disease.\n\nAs the government remained tight-lipped over the large data discrepancy, a senior Pakistan Medical Association (PMA) official cast doubts over the credibility of officials figures, saying their stats did not represent the ground reality.\n\nGrim situation in Karachi, Hyderabad\n\nAccording to official figures released by the health services director general, the total number of dengue confirmed cases in Karachi division and Hyderabad district this year was 579 and 119, respectively.\n\nHowever, figures collected from three hospitals in Karachi — Indus Hospital (IH), Liaquat National Hospital (LNH) and the Sindh Infectious Diseases Hospital and Research Centre (SIDHRC) — showed that a total of 2,972 cases of dengue have been reported from Sept 1 to Oct 16. The fourth hospital — the Jinnah Postgraduate Medical Centre — alone recorded 1,062 dengue cases from July to date.\n\nThe situation is no different at the Aga Khan University Hospital (AKUH) as sources confirmed a high number of dengue cases, comparatively larger than the last year’s, and a few deaths.\n\nHyderabad is facing an alarming situation as the figures obtained from the Diagnostic and Research Laboratory (DRL) of the Liaquat University of Medical and Health Sciences (LUMHS) Jamshoro and its branches showed 9,075 dengue confirmed cases from Sept 1 to Oct 14.\n\nQuestion mark over credibility of govt data\n\nPMA-Sindh President Dr Bashir Ahmed Khaskheli described the situation far more serious than what’s depicted by official data and said that official figures did not represent the ground reality.\n\n“There is no official mechanism in place to get feedback from private clinics operating in every nook and corner of a locality as well as private hospitals, quacks and even hakeems. Many people constrained by their financial resources don’t even opt for laboratory tests,” he told Dawn.\n\nDr Faisal Mahmood, professor of infectious diseases and associate chief medical officer at the AKUH, also confirmed the surge in dengue cases, emphasising that the end of October was classically the season when most dengue cases were seen.\n\nTalking to Dawn, he said: “It is important to note that dengue rates do vary from year to year, and this cyclic pattern of dengue peaks is something we have seen over the last decade or so. There are several reasons for this including weather patterns and changes in the strains. What is driving this year is hard to say, though I would think the [rains] floods have played a part.”\n\nDr Mahmood avoided making an observation on the disease severity, pointing out that the city was in the middle of the (dengue) season.\n\nProf Dr Imran Shaikh, a seasoned physician and dean faulty of medicine in LUMHS, said: “We had cases in June and July but nobody traced them. Burden of positive case has increased immensely since September. It is yet to show a declining trend.”\n\nAlarming rise in malaria cases\n\nAccording to the health department’s data, 215,270 cases of malaria have been reported this year across the province and the number of cases reported in Karachi from January 1 to Oct 15 stands at 3,072.\n\nThe official data shows the worst malaria-affected cities are: Jamshoro 22,293, Larkana 19,835, followed by Jacobabad 17,170, Badin 19,478, Mirpurkhas 12,699, Shaheed Benazirabad 12,467, Thatta 10,995, Tando Muhammad Khan 10,579, Khairpur 9,967, Sanghar 7,409, Hyderabad 7,054, Tando Allah Yar 6,702, Matiari 6,064, Shikarpur 6,875, Tharparkar 4,297, Kashmore 4,292, Qambar Shahdadkot 3,866, Sukkur 4,187, Naushehro Feroze 3,563, Ghotki 2,867 and Umerkot 2,327.\n\nHowever, information gathered from different private and public sector hospitals contradicted the official data.\n\nFigures collected from Indus Hospital, SIDHRC, LNH, and JPMC showed that over 1,800 cases of malaria had been reported in the city from Sept 1 to Oct 16.\n\nAccording to Dr Faisal Mahmood of the AKUH, malaria has seen at least a month early onset this year.\n\nIneffective fumigation\n\nHealth experts have attributed the surge in dengue cases to lack of fumigation and timely drainage of water accumulated after the heavy spells of monsoon rains.\n\n“If rainwater remains accumulated, it has the potential to become a breeding ground for vectors,” said Dr Mirza Ali Azhar of the PMA. “Entire rainwater doesn’t go into drains, and in many areas, water stands in the shape of ponds, only to serve as a home for mosquitoes,” he said.\n\nDr Khaskheli, the incumbent PMA-Sindh president, regretted that the high number of cases due to mosquito-borne illnesses could be easily prevented through effective vector control measures.\n\n“It’s all has to do with poor sewerage and drainage system. One could see pools of standing rainwater or sewage and heaps of garbage everywhere, providing breeding grounds of all kinds of germs and insects,” he said and pointed that there were few government fumigation campaigns to effectively address the menace of vector-borne diseases.\n\nAnti-dengue campaign intensified: minister\n\nThere was no response from the health department when its spokesperson was contacted to explain the large discrepancy in data, suggesting that actual numbers of dengue and malaria cases would be much higher.\n\nHowever, Sindh Health Minister Dr Azra Pechuho urged the general public to take ownership of their localities and ensure that there no pools of stagnant water.\n\n“The government is taking comprehensive measures to curb the spread of the disease. Anti-dengue campaigns have been intensified across all divisions, including Karachi, where fumigation and spraying operations are being carried out on a daily basis. Hospitals have been instructed to provide special medical attention and immediate treatment to dengue patients,” she said in a statement.\n\nShe added that health department teams were closely monitoring suspected and confirmed cases across all districts and were working jointly with the district administrations to take immediate preventive and remedial actions.\n\nPublished in Dawn, October 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/19094906c43a0c9.webp",
  "retrievedAt": "2025-10-20T18:22:11.961Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949810/karachi-hyderabad-face-dengue-outbreak-as-cases-spike-alarmingly",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T03:13:25.000Z"
}
