{
  "title": "Huge turnout as body of revered Kenya politician Odinga heads home - World - DAWN.COM",
  "author": null,
  "content": "KISUMU: Tens of thousands gathered in western Kenya on Saturday to see the body of a beloved politician, Raila Odinga, for the biggest day of mourning ceremonies that had already claimed at least five lives this week.\n\nThere were cries of “Baba” (father) and “We are orphans” from the teeming crowd packing the streets of Kisumu, the heartland of Odinga’s support, as his coffin arrived at the city stadium by helicopter.\n\nOdinga, 80, died from a suspected heart attack in India on Wednesday, triggering a huge outpouring of grief across the country, but particularly in western Kenya where his Luo tribe is dominant.\n\nMourners barged through security barriers and clambered up the sides of the stadium and nearby structures to catch a glimpse of the coffin, journalists saw. “Without Baba, we are dead. We don’t have anywhere to go,” said Don Pelido, 20, a supporter pressed up against one barrier.\n\nA medical source said 74 people had been treated at the stadium, mostly due to fainting and dehydration. But there was not the same chaos seen at earlier ceremonies in Nairobi, with authorities cancelling a planned procession in Kisumu to avoid the risk of stampedes.\n\n“People just decided to behave well… The fact that the body was airlifted prevented big problems from happening on the road,” said the medical source. That compared with the incidents in Nairobi, where security forces opened fire to disperse a surging crowd in a stadium on Thursday when Odinga was lying in state, killing at least three.\n\nAnd on Friday, at the state funeral in another stadium, led by President William Ruto, a stampede of mourners killed at least two people and left dozens injured.\n\n‘Bad dream’\n\nArguably the most important political figure of his generation in Kenya, Odinga served as prime minister from 2008 to 2013 yet never succeeded in winning the presidency despite five attempts.\n\nBut he outlasted many rivals and is credited as a major player in returning Kenya to multi-party democracy in the 1990s — having spent eight years in prison without trial — and overseeing the widely praised constitution of 2010. Odinga’s body was repatriated from India on Thursday.\n\nAfter lying in state in Kisumu, the body was transferred to Bondo in nearby Siaya county, the family’s ancestral seat, for a private burial on Sunday. Odinga’s death leaves a leadership vacuum in the opposition, with critics accusing him of failing to prepare a successor.\n\n“We have not accepted that he is really gone. It is still a bad dream,” said shop owner Maureen Owesi, 39, in Kisumu. Odinga’s pragmatic deals with rivals — including current president Ruto last year — cost him support among young voters who have staged mass protests in the last two years over poor governance and the economy.\n\nIt is unclear whether Odinga’s movement and the alliance with Ruto will survive his death, leaving Kenya on an uncertain path ahead of potentially volatile elections in 2027.\n\nPublished in Dawn, October 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f417083efe7.jpg",
  "retrievedAt": "2025-10-20T18:22:12.787Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949823/huge-turnout-as-body-of-revered-kenya-politician-odinga-heads-home",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T03:13:18.000Z"
}
