{
  "title": "Over 43.3 million children vaccinated against polio in first 5 days of campaign: NEOC - Pakistan - DAWN.COM",
  "author": null,
  "content": "Over 43.3 million children of up to five years of age have been vaccinated against polio in the first five days of an anti-polio campaign across the country, the National Emergency Operations Centre (NEOC) said on Saturday, according to state-run Radio Pakistan.\n\nPolio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine for every child under five during each campaign, along with the timely completion of all essential immunisations. Pakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic.\n\nYesterday’s data reported that more than 22.9m children have received the oral polio vaccine in Punjab, while approximately 10.2m children were immunised in Sindh.\n\n“In Khyber Pakhtunkhwa, more than 6.1m children have been vaccinated … in Balochistan, over 2.5m; in Islamabad, around 443,000; in Gilgit-Baltistan, nearly 294,000 and in Azad Jammu and Kashmir, over 733,000 children have received the vaccine,” Radio Pakistan added.\n\nOf those that received the vaccine in Punjab over the first six days of the campaign, over 2.2m were in Lahore, the Associated Press of Pakistan (APP) said on Sunday.\n\nThe ongoing week-long anti-polio campaign in Lahore was launched under the vision of Punjab’s Chief Minister Maryam Nawaz Sharif for a Zero Polio Punjab.\n\nAccording to Radio Pakistan, the ongoing national campaign aims to vaccinate over 45m children and is set to run uninterrupted until today. Meanwhile, in South KP, the campaign is scheduled to begin tomorrow (Monday).\n\nThe NEOC urged parents to ensure that every child under five years of age receives the polio vaccine, the outlet added.\n\nA review meeting to assess the progress of the Punjab campaign was held under the chairmanship of Lahore’s Deputy Commissioner Syed Musa Raza at his office on Sunday, according to APP.\n\nThe meeting was attended by the additional deputy commissioner (general), Chief Executive Officer (Health) Dr Asif Arbab, assistant commissioners, officials from the health department, and observers from the World Health Organisation (WHO).\n\nDuring the meeting, Arbab said that more than 2.212m children had been vaccinated across the provincial capital so far, while an additional 73,900 children who had missed out were covered during the first catch-up day. The district administration and health teams remained fully active in the field to achieve the set targets, he added.\n\nArbab further informed the meeting that the campaign achieved over 99 per cent of its target with more than 1.559m households successfully covered, marking the coverage rate as over 95pc. The WHO representatives expressed satisfaction over the overall performance of the district teams and appreciated the dedication and commitment of field staff working tirelessly to eradicate the crippling disease.\n\nDeputy Commissioner Syed Musa Raza emphasised that the anti-polio campaign must be made a complete success in every respect. He directed all Assistant Commissioners to minimise the number of missed-out children and instructed the Deputy District Health Officers (DDHOs) to ensure strict field monitoring.\n\nHe also said that 100pc coverage must be ensured in schools, adding that any operational issues were to be reported immediately to the district administration for prompt action.\n\n“All children under five years of age must be vaccinated; achieving the targets is mandatory,” the DC stressed, warning that officers failing to meet their targets would be held accountable.\n\n“Making Lahore polio-free is a shared responsibility. We must perform our national duty for the sake of our children’s future,” he added.\n\nDespite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress. Over 200,000 polio workers and supervisors are participating in the current drive across Punjab.\n\nData from September showed that the number of children remaining unvaccinated due to parental refusals had come down in their recent immunisation drive compared to the previous campaign.\n\nHowever, the global polio monitoring board issued a warning that efforts to eradicate the disease were failing as a new polio case confirmed in Sindh’s Hyderabad the same month brought the nationwide tally to 27 this year, according to the National Institutes of Health.\n\nIn August, two new poliovirus cases were reported, involving a six-year-old girl from KP’s Kohistan district and a 21-month-old girl from Sindh’s Badin.\n\nEarlier that month, poliovirus was found in 36pc of samples across 87 nationwide districts tested in July.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/19140132cba4f56.webp",
  "retrievedAt": "2025-10-20T18:21:46.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949918/over-433-million-children-vaccinated-against-polio-in-first-5-days-of-campaign-neoc",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T09:01:47.000Z"
}
