{
  "title": "‘First step in right direction’: Political figures, other nations welcome Pakistan-Afghanistan ceasefire pact - Pakistan - DAWN.COM",
  "author": null,
  "content": "Political figures and other nations on Sunday welcomed the signing of a ceasefire agreement between Pakistan and Afghanistan after talks in the Qatari capital, Doha, stressing the need for stability and peace in the region.\\n\\nAmid heightened tensions along the Pakistan-Afghanistan border, a high-level Pakistani delegation led by Defence Minister Khawaja Asif travelled to Doha yesterday for talks with Afghan Taliban officials. The negotiations were aimed at ending cross-border hostilities and addressing Pakistan’s security concerns. The two sides agreed to an immediate ceasefire following the negotiations, pledging to respect each other’s sovereignty.\\n\\nThe delegations will meet again in Istanbul on October 25 for further discussions.\\n\\nDeputy Prime Minister and Foreign Minister Ishaq Dar welcomed the agreement, terming it “the first step in the right direction”.\\n\\n“We look forward to the establishment of a concrete and verifiable monitoring mechanism in the next meeting to be hosted by Turkiye to address the menace of terrorism emanating from Afghan soil towards Pakistan. It is important to put all efforts in place to prevent any further loss of lives,” he said in a post on X.\\n\\nQatar — which mediated the negotiations along with Turkiye — also expressed the hope that “this important step will contribute to ending tensions on the border between the two brotherly countries and form a solid foundation for sustainable peace in the region”.\\n\\nTurkiye, too, welcomed the ceasefire agreement in a statement issued by its foreign ministry today.\\n\\n“We welcome that Afghanistan and Pakistan agreed to a ceasefire under the mediation of Turkiye and Qatar and decided to establish mechanisms to strengthen peace and stability between the two countries during the talks held in Doha,” the statement said.\\n\\nIt added, “Turkiye will continue to support the efforts for achieving lasting peace and stability between the two brotherly countries and in the region.”\\n\\nOman also welcomed the deal between Pakistan and “friendly” Afghanistan in a statement posted on X.\\n\\n“The Sultanate of Oman also affirms its appreciation and commendation for the role of the sisterly State of Qatar and the friendly Republic of Turkiye in reaching this agreement, expressing hope for its sustainability to achieve lasting and comprehensive peace between the two countries,” the statement said.\\n\\nMeanwhile, in Pakistan National Assembly Speaker Sardar Ayaz Sadiq was also among those who publicly welcomed the ceasefire agreement between Islamabad and Kabul, terming the move a “significant step”.\\n\\n“The ceasefire agreement between the two countries is a significant step toward regional stability,” Sadiq said on X. “Pakistan has always believed in peaceful coexistence, negotiations, and respect for neighbouring countries.”\\n\\nHe added that peace and stability were the “collective need” of the people of both countries and commended Pakistan’s efforts towards achieving this in the region.\\n\\n“Peace in Afghanistan is intertwined with peace in Pakistan,” he said.\\n\\nThe NA speaker added that the ceasefire, made possible by the “consensus of political and military leadership”, was a welcome development. He also welcomed the announcement of the second phase of negotiations to be held in Istanbul on October 25, calling the negotiation process “the only guarantee for establishing lasting peace in the region”.\\n\\nSadiq said that improved relations between Pakistan and Afghanistan were in the interest of the entire region and emphasised the need to strengthen further the process of confidence-building and cooperation between the two countries. “Joint efforts to end terrorism and promote peace are the need of the hour,” he emphasised.\\n\\nHe expressed confidence that the ceasefire would transform into a “long-term peace agreement” and recommended that both countries should promote people-to-people contact and economic cooperation.\\n\\nFormer US ambassador to Afghanistan Zalmay Khalilzad called the deal “good news from Doha”.\\n\\n“Thanks to mediation by Qatar and Turkiye, Afghanistan and Pakistan reach an agreement,” he wrote in a post on X.\\n\\nPML-N leader Khawaja Saad Rafique called the move “a commendable step” and prayed for the success of the ceasefire.\\n\\n“May Allah make this agreement long lasting, and may its details be finalised in the second meeting to be held in Istanbul on October 25,” he wrote on X.\\n\\n“The welfare, progress, security, and stability of both nations are tied to each other’s regional sovereignty, freedom, and economic stability. We should know that Afghanistan is not India, and Afghanistan should know that Pakistan is neither a land of war nor America, Britain, or Russia. The religion of Islam, traditions, blood ties, and geography will not allow us to be separated from one another.”\\n\\nFormer human rights minister Shireen Mazari also appreciated the ceasefire deal but pointed out that the ceasefire agreement did not mention anything about the Tehreek-i-Taliban Pakistan (TTP).\\n\\n“While an agreement to ceasefire is welcome, but [the] core issue of Afghan Taliban support for TTP & their safe havens is not even mentioned,” she wrote on X.\\n\\n“At least part of the ceasefire [should] have been a stated move to ending TTP support. Just referring to [established] ‘mechanisms’ in future is too vague.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1917052595b9e1f.webp",
  "retrievedAt": "2025-10-20T18:42:38.163Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949921/first-step-in-right-direction-political-figures-other-nations-welcome-pakistan-afghanistan-ceasefire-pact",
  "dateList": "2025-10-19",
  "date_published": null
}
