{
  "title": "Manchester United stretch Liverpool losing streak to four games - Sport - DAWN.COM",
  "author": null,
  "content": "Liverpool slumped to a fourth consecutive defeat for the first time in 11 years as Manchester United won 2-1 on Sunday to end their near decade-long wait for victory at Anfield.\n\nHarry Maguire’s 84th-minute header secured back-to-back Premier League wins for the first time in Ruben Amorim’s tenure as United boss.\n\nTwelve minutes from time, Cody Gakpo had cancelled out Bryan Mbeumo’s opener after just 61 seconds.\n\nDefeat leaves Liverpool four points adrift of Arsenal at the top of the table and Arne Slot still searching for answers in how to get the right blend after splashing out nearly £450 million ($604 million) on new players in the transfer market.\n\nUnited close to within two points of their historic rivals and up to ninth in the table to ease the pressure on Amorim after his biggest win in nearly a year in charge.\n\nLiverpool had only lost one of the previous 14 Premier League meetings between the sides and United had not tasted victory at Anfield since the early days of Jurgen Klopp’s reign in January 2016.\n\nHowever, the Reds are in a state of flux after transforming the squad that stormed to the title last season and the tragic loss of Diogo Jota, who died in a car accident in July.\n\nAfter three consecutive defeats for the first time in Slot’s reign, Liverpool could barely have imagined a worse start.\n\nMbeumo sped past Virgil van Dijk with ease before firing past Giorgi Mamardashvili from Amad Diallo’s pass after barely a minute.\n\nThe home side and support were furious that play was not stopped in the build-up after Alexis MacAllister went down with a head injury, inflicted by his own captain Van Dijk.\n\nSlot left £100 million signing Florian Wirtz on the bench for the second consecutive game as he looked in vain to find the right balance between defence and attack.\n\nGakpo should have levelled for the defending champions when he hit the post from Mohamed Salah’s through ball in Liverpool’s one flowing move of the first half.\n\nHowever, it was United who should have been further in front by half-time.\n\nBruno Fernandes spurned a glorious chance to double the Red Devils’ lead when he hit the outside of the post when unmarked from the edge of the area.\n\nAt the other end, Senne Lammens was rarely troubled in the first 45 minutes, but produced a big save when called upon to deny Alexander Isak his first Premier League goal since joining Liverpool for a British transfer record £125 million.\n\nA Gakpo deflected cross then came back off the post and the Dutchman rattled the woodwork for a third time early in the second half.\n\nSlot turned to his near £200 million in forward options off the bench as Wirtz and Hugo Ekitike were introduced on the hour mark to join Salah, Gakpo and Isak in a five-man attack.\n\nSalah has scored more goals than any other player in this fixture, but his lack of form showed in a wild finish to slice wide with just Lammens to beat at the back post.\n\nLiverpool’s wealth of attacking talent finally broke the door down when Federico Chiesa, who had replaced Isak moments earlier, drilled in a low cross that Gakpo converted from point blank range.\n\nYet, their defensive frailties meant parity only lasted six minutes as Maguire was left unmarked to head in Fernandes’s looping cross.\n\nGakpo should still have rescued a point when he headed wide with the goal gaping from Jeremie Frimpong’s inviting delivery.\n\nBut Liverpool fell to their first league defeat at Anfield in over a year in another blow to their hopes of usurping United with a record 21st English top-flight title.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:21:46.427Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949968/manchester-united-stretch-liverpool-losing-streak-to-four-games",
  "dateList": "2025-10-19",
  "date_published": "2025-10-19T17:53:34.000Z"
}
