{
  "title": "PM calls for further strenuous efforts to continue economic stability",
  "link": "https://www.app.com.pk/global/pm-calls-for-further-strenuous-efforts-to-continue-economic-stability/",
  "date_published": "2024-09-28T17:50:00.000Z",
  "source": "APP",
  "content": "LONDON, Sep 28 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday said that the collective efforts by all the stakeholders in the government had put Pakistan on the path of economic stability and progress and called for further strenuous efforts and sacrifices to achieve the economic objectives.\nDuring a media interaction, the prime minister elaborated that during their previous tenure of sixteen months in the government, they faced the financial challenges but with collective efforts, they saved Pakistan from running into default.\nEarlier, the prime minister arrived from New York where he had addressed the plenary meeting of the UN General Debate at the 79th session of the United Nations General Assembly (UNGA).\nIn a veiled reference to previous government of Pakistan Tahreek-e-Insaf (PTI), he said the former party’s policies led the country to default, but ‘with grace of Allah Almighty and with their collective efforts, Pakistan is now moving towards stability and progress. The international institutions also acknowledged it’.\nThe prime minister also expressed his satisfaction over the approval of $7 billion International Monetary Fund (IMF) extended fund facility.\nComparing last year’s 32 percent spiraling inflation rate, he said now the price hike stood at 9.6 percent, adding the State Bank of Pakistan (SBP) had also reduced the interest rate while the rates of daily commodities were showing stability.\nPrime Minister Sharif said the inflation rate had nosedived but still “Everything is not a hunky-dory. We have to sweat hard and broaden the tax net without burdening those already paying it.”\nHe said the common people had always sacrificed for the country. Now, it was time for the elite to sacrifice for the country and play their part in the country’s progress.\nThe prime minister thanked the brotherly countries particularly the Kingdom of Saudi Arabia, the United Arab Emirates and time-tested friend China for their support in securing the IMF programme and said that without their support, it would not have been possible.\n“I particularly thank them for their support to steer Pakistan out of economic straits” he said and commended the efforts of ministers of finance, foreign affairs, secretary finance, officials and ambassadors who made efforts in this regard.\nThe prime minister lauded the chief of army staff for his efforts in achieving the IMF programme and said that the COAS had visited the brotherly countries which provided critical economic relief to Pakistan.\nTerming it a ‘team Pakistan’s work’, he expressed the hope that the IMF’s programme would be the last one as the 240 million people and the government’s efforts would accomplish it successfully.\nHe stressed that they would have to reduce their expenditures and strive to provide amenities to the public at their doorsteps. “Time has arrived to work hard and uphold merit which should be their hallmarks.”\nThe prime minister also reiterated his call for a ‘charter of economy’.\nAbout his participation in the UNGA annual session, he highlighted that he had held useful meetings with different leaders of various countries including the UK, Bangladesh, Türkiye, Kuwait and others which would help to further foster their bilateral and brotherly ties.\n“I have made a humble effort to convey voice of the people of Pakistan to the world over Palestine and Gaza where more than 40,000 people including children had been martyred,” he said, adding that gruesome Israeli attacks continued on Beirut which was strongly condemned by Pakistan.\nThe prime minister said that in his speech, he had reiterated the call for immediate ceasefire and stressed upon the international community to wake up and work for an immediate independent Palestinian state with pre-1967 borders, besides stressed for its representation in the UN.\nHe said that he also apprised the session of the grave situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) where the Kashmiri people had been fighting for their legitimate rights and shedding bloodshed. They had been facing brute aggression and violence by the Indian illegal occupation forces.\nModi’s government with its unilateral and illegal steps had deprived IIOJK of its special status which was violation of the respective UN resolutions and other global human rights calls. Terror and aggression in IIOJK should end and the Kashmiri people should be given the right to hold plebiscite to independence, he added.\nThe prime minister, without naming PTI, also termed the 9th May riots targeting Jinnah’s House, GHQ and showing disrespect for the martyrs’ graves as ‘an unpardonable act’.\nHe also expressed his optimism that Pakistan would soon become an ‘Asian Tiger’ as pronounced by his leader and former prime minister Muhammad Nawaz Sharif whose efforts had put Pakistan on path of rapid progress and economic stability.\nHe regretted that Nawaz Sharif’s governments were removed through conspiracies.",
  "retrievedAt": "2025-08-10T21:24:44.932Z"
}
