{
  "title": "PPP Human Rights body urges use of RTI for transparency, accountability & democracy",
  "link": "https://www.app.com.pk/national/ppp-human-rights-body-urges-use-of-rti-for-transparency-accountability-democracy/",
  "date_published": "2024-09-28T14:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): The ‘World Right to Information Day’ here on Saturday is an occasion to reflect on the critical importance of the Right to Information (RTI) and the progress made and the issues faced in the implementation of the landmark legislation namely “Right to Information Act-2017” was passed by the parliament over seven years ago.\nIn a statement today ex-senator Farhatullah Babar president Human Rights Cell of the PPPP said that democracy is not merely holding of periodic elections and political parties taking turns. It is a governance structure that rests on the pillars of rule of law, transparency, right to information and accountability.\nThe 18th Amendment introduced for the first time Article 19-A which states, “Every citizen shall have the right to access to information in all matters of public importance subject to regulation….”. Under it the RTI Act 2017 was enacted by the Parliament and Pakistan Information Commission also set up to address complaints against non compliance with the law.\nHe said that although great strides have been taken there are serious challenges in the implementation of the law. The Tosha Khan case exposing uncomfortable truths was the result of information disclosed under the RTI. Initially the Supreme Court declined to disclose information under it but later it graciously recognized a citizens’ right to information and willingly provided the information asked from it.\nHe said that under the law the parliament also is required to provide information but it has been reluctant. Some years ago the senate secretariat refused to disclose information about the appointments in it and even an aborted attempt was made to exempt it from the RTI legislation.\nFarhatullah Babar deplored that defene establishment has refused to comply with the law and even refused to comply with unambiguous orders by the independent Pakistan Information commission (PIC).\nIn one case, he said, the PIC even ordered that the information asked must be placed on its web site but in vain. The impunity with which it continues to defy the RTI law and the orders of the PIC is unsettling and does not shine any bright light on all those involved.\nThe President HR Cell of the PPP urged all media persons to make extensive use of the RTI law in the interest not only of democracy but also their professionalism.\nThere are more than 220 public and private universities in the country with more than 2 million students and tens of thousands of academics. If only 1% of them asked just one question under RTI once in two months the total number of disclosures made will exceed one hundred thousand a year. And if only 1% of the disclosures made revealed irregularities and corruption it will immeasurably serve the cause of transparency, accountability and democracy, he said.\n“Let today every citizen pledge to use the RTI tool to tear apart the shroud of secrecy and promote transparency, accountability and democracy without fear”.",
  "retrievedAt": "2025-08-10T21:24:48.230Z"
}
