{
  "title": "PM’s message in UNGA address to respond to any Indian aggression reflects national spirit: Kh Asif",
  "link": "https://www.app.com.pk/national/pms-message-in-unga-address-to-respond-to-any-indian-aggression-reflects-national-spirit-kh-asif/",
  "date_published": "2024-09-28T15:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Defence Minister Khawaja Muhammad Asif in meeting with members of the Pakistani community in the US said the Prime Minister has reflected the national spirit by giving a message to respond to any aggression by India in his address at the UN General Assembly (UNGA) meeting.\nHe was addressing the meeting organized by the Consulate General of Pakistan in New York, US where members of the Pakistani community paid tribute to Prime Minister Shehbaz Sharif for his speech at the United Nations General Assembly, a news release said\nKhawaja Asif said the Prime Minister presented the case of Kashmir and Palestine in front of the whole world in a magnificent manner.\n“It is a pleasure for me to meet the Pakistani community in America. This event is not just a gathering but a manifestation of the greatness and harmony of the Pakistani nation. Overseas Pakistanis are our precious asset and our crown’s jewel,” the Minister said.\nHe added that he was overwhelmed to see the diaspora’s love for Pakistan whereas they have settled a new society on the soil of America with their hard work and dedication and have brought laurels to the country.\n“Overseas Pakistanis have always played a vital role in the development and prosperity of Pakistan. Overseas Pakistanis have proved by their role that the Pakistani nation is capable of facing every difficulty. This success of all of you is a sign of a bright future for Pakistan. The overseas Pakistanis have a significant role in the country’s economic development. The welfare of the Pakistani community is the top priority of the Government of Pakistan,” the Defence Minister said.\n“The Prime Minister has assured all embassies abroad to solve the problems of Overseas Pakistanis on priority basis,” he said.",
  "retrievedAt": "2025-08-10T21:24:48.324Z"
}
