{
  "title": "Irrefutable evidences presented in 190m pounds mega corruption scam: Tarar",
  "author": null,
  "content": "ISLAMABAD, Jan 16 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar said on Thursday that £ 190 million pounds scam was an unprecedented mega corruption scandal in the history of Pakistan and irrefutable evidences were presented in the trial court.\nAddressing a press conference here, he said that evidence in the scam were so clear that even independent observers were not giving clean chit to anyone accused.\nThe minister said National Crime Agency (NCA) in Britain declared Shehbaz Sharif innocent after holding investigations in five countries. The same agency had confiscated 190 million pounds of a tycoon and handed over that amount to the government of Pakistan, he said and added that the question arose as to why did the National Crime Agency give that money to the government of Pakistan?\nHe said that money was given to the government of Pakistan because it was the money of the people of Pakistan.\nIf the money was not confiscated, why did the NCA hand over that amount to Pakistan, he posed a question.\nAbout Imran Khan, he said the founder of PTI was the only leader in the history of Pakistan who confessed that he has no source of income.\nThe minister challenged entire PTI leadership to tell the source of income of Imran Khan and if he had no source of income, how did a house worth Rs 250 million in Zaman Park Lahore become a reality.\nAttaullah Tarar remarked that a person was given a benefit of Rs 80 to 90 billion when a sealed envelope was approved by the cabinet during the PTI regime.\nAfter the approval of agenda in the sealed envelope of the cabinet, the founding chairman of PTI earned billions of rupees by settling the fine of a business tycoon, he added. He said that tale of mega corruption scam started from there and Imran Khan, Bushra Bibi, Farha Gogi and cronies minted tens of millions of rupees.\n“In the biggest mega corruption scandal in the history of Pakistan, the hands of founding chairman PTI, Bushra Bibi and Farah Gogi are stained with corruption”, the minister said. The minister said he expected that justice would be done in this mega scam and those involved would be brought to justice.\nSince February last year, when the present government came to power many international institutions have certified about economic turnaround in the country. He said Pakistan’s rating at Finch and Moody’s has improved and after four years Pakistan International Airlines flights to Europe restored.\nThe World Economic Forum has given positive indications regarding Pakistan’s economy and the risk of default has completely disappeared. Moreover many other feel good news have come during the past 11 months including fall in interest rate and decrease in inflation from 38 per cent to 3.9 per cent.\nLashing out at Shahzad Akbar, Farha Gogi and Shahbaz Gill he said those who talked about Pananma and Iqama had run away when times changed. He asked them to come back and face the cases as it was easy to upload V-logs from abroad. He said some political actors had poisoned the politics of the country and then escaped abroad and now they were maligning national institutions.\nReplying to media persons questions he said there could not be any compromise on mega corruption scams like 190 million pounds as negotiations could not be linked with relief in such cases.\nThe minister said that the negotiation process was going well, and they wanted progress in this process but no deal will be done.\nHe said there were reports that the founding chairman of PTI was asking his cronies to get him out of jail but he had to face trial in many cases.\nThe minister said that 190 million pound case was in trial court and irrefutable evidence has already been provided.\nHe said that economic stability of the country was linked to political stability but there could not be any deal of mega corruption scams.\nHe strongly dispelled the impression after negotiations corruption worth billions of rupees would be pushed under the carpet as Pakistan’s interests were foremost for the government.\nThose accused in corruption cases will have to face the trial and nobody would get any concession in the name of negotiations, he added.\nTo a question, he said the role of the military leadership on the economic front was commendable through the initiatives of Special Investment Facilitation Council.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:43:25.178Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/irrefutable-evidences-presented-in-190m-pounds-mega-corruption-scam-tarar/",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T11:41:00.000Z"
}
