{
  "title": "PM constitutes committee to effectively respond on PTI’s CoD: Sanaullah",
  "author": null,
  "content": "ISLAMABAD, Jan 16 (APP): Special Assistant to the Prime Minister on Political Affairs, Rana Sanaullah Khan on Thursday said that Prime Minister Muhammad Shehbaz Sharif had constituted a committee comprising with all allies to effectively respond to Pakistan Tekreek-e-Insaf (PTI)’s Charter of Demands (CoD).\nAddressing a news conference flanked by Spokesperson for the government’s negotiation committee and Parliamentary leader of Pakistan Muslim League-Nawaz (PML-N) in Senate, the special assistant said that PTI had given Charter of Demands to the government and also released CoD on media before giving to us to propagate the issue.\nHe expressed the opinion that the government’s committee would definitely reply to the PTI’s CoD, saying that the PML-N government believed in negotiation process to resolve the matter with opposition in larger national interest. Initiating the dialogue was a democratic and Constitutional practice in the Parliamentary system, he added.\nHe said that today, the government and opposition committee held a meeting and expressed the hope that they would carry out their meetings in the upcoming days as well.\nRana Sanaullah said the government would present a concrete response which considered as final one, adding that PTI first two demands were not included in it. “The opposition has withdrawn from its previous basic demand of alleged election riggings,” he added.\nHe said PTI had presented second demand that all the cases against their workers and supporters were political in nature but they were failed in giving the name of any worker or the FIR number. He asked that why PTI had not furnished the list of its workers’ arrests, missing and deceased.\nThe Supreme Court had already acted on the issue of the arrest of May 9 and this was a closed case now, he said and adding that the government commission did not have the mandate to play any role in such cases which have been heard and decided in the court.\nThe SAPM said that all these cases against PTI’s workers were anti-terrorism and they were involved in attacking and mocking on national institutions including armed forces, adding that they defamed the country’s name internationally through their nefarious acts.\nHe said that PTI was habitual on leveling allegations and bogus propaganda by using social media to mislead their young supporters, adding that it had already done propaganda about their workers arrest and death but later failed to provide details.\nHe said that this political party was doing the politics on baseless issues for politicking to alive in politics rather than highlighting the genuine matter of the common man.\nRana Sanaullah emphasized that if as many people were missing as claimed by PTI than why not their families raising voice for them, adding that opposition had one point-agenda to tell lies, criticize the institutions and play politics on non-issues.\nHe said that PTI was trying to make propaganda through circulated Charter of Demand on media and reiterated that the government’s committee was ready to respond to their demands amicably.\nSanaullah said that PTI’s demands to constitute a judicial commission, he categorically stated that judicial commission could not be formed according to 2017 Act.\nReplying to a question, he said that verdict in the 190 million pounds Al-Qadir Trust corruption case against Pakistan Tehreek-e-Insaf (PTI) founder and his wife Bushra Bibi had been delayed for the third time, adding that the verdict of the case will be announced on Jan 17.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:42:31.766Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-constitutes-committee-to-effectively-respond-on-ptis-cod-sanaullah/",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T15:09:00.000Z"
}
