{
  "title": "Awais Leghari invites France’s Green Fund Support for EV transition in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jan 16 (APP):Federal Minister for Power, Awais Ahmad Khan Leghari, has proposed utilizing France’s Green Fund to support the transition of small vehicles to electric technology in Pakistan.\nThe proposal was given by the Federal Minister for Power in a call on by French Ambassador to Pakistan, Nicolas Galey here Thursday, said a press release.\nDuring the meeting, the Federal Minister highlighted that Pakistan has recently introduced its Electric Vehicle (EV) Policy, which will translate into annual fuel savings of billions of dollars and contribute to environmental protection. Additionally, it will cut transportation  costs easing burden for the public.\nThe Ambassador appreciated Pakistan’s effective negotiations and the amicable review of agreements with Independent Power Producers (IPPs) in the power sector.\nThe Minister reiterated that negotiation with 28 IPPs will result in total national saving of Rs.1.4 trillion.\nHe shared that the Government of Pakistan is set to introduce a Wheeling Policy for electricity transmission and distribution soon, ensuring efficient distribution of surplus power.\nFurthermore, plans are being made for the auction of additional electricity. These initiatives will allow Government of Pakistan to exit from the Power business in Pakistan promoting a competitive environment, he said.\nHe added that Government of Pakistan has hired Independent boards across most of the distribution companies. These neutral boards are improving recovery rates and significantly reducing the line losses. The government is also prioritizing the promotion of solar energy, he added.\nAwais Ahmad Khan Leghari emphasized that all reforms are being implemented with the utmost transparency, creating substantial investment opportunities in the power sector. He also noted Pakistan’s remarkable progress in renewable energy and green energy projects.\nThe Ambassador said that France will consider  providing every possible technical and financial assistance for Pakistan’s EV initiatives and other energy reforms.\nHe said that the reform initiatives taken by Pakistan are encouraging  and they will give positive results.\nBoth sides agreed to further strengthen and stabilize the power sector while fostering sustainable and environmentally friendly initiatives in the Power sector of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:43:21.552Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/awais-leghari-invites-frances-green-fund-support-for-ev-transition-in-pakistan/",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T13:07:00.000Z"
}
