{
  "title": "Attaullah Tarar lauds Turkiye’s role in preserving Radio Pakistan’s heritage",
  "author": null,
  "content": "ISLAMABAD, Jan 16 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture, Attaullah Tarar, on Thursday praised Turkiye’s significant contribution to preserving and presenting Radio Pakistan’s rich history in a remarkable way.\nIn his address at the inauguration of the newly-constructed “Pakistan-Turkiye Friendship Museum” at the Radio Pakistan Headquarters, Tarar described the establishment of the museum as an important milestone. He emphasized that the museum plays a crucial role in safeguarding a vital part of Pakistan’s historical heritage, in which Radio Pakistan has been a key player. “Nations that fail to honor and take pride in their past achievements can never make progress,” he said.\nTarar noted that the friendship between Pakistan and Turkiye dates back long before Pakistan’s creation. He recalled how the Muslims of the subcontinent expressed solidarity with their Turkish brothers and sisters during the Khilafat Movement, donating jewelry and valuable possessions to support the Turkish people. “The hearts of the people of Turkiye and Pakistan beat in unison. The people of Pakistan consider Turkiye their second home,” he stated. He further highlighted that the long-standing relations between the two countries must be passed down to future generations.\nThe Minister pointed out that there is still immense potential for expanding cooperation between Pakistan and Turkiye in various other fields.\nOne of the key objectives behind the museum’s establishment, Tarar explained, is to educate future generations about the significance of Pakistan-Turkey relations. He also acknowledged the ongoing support of the Turkish Cooperation and Coordination Agency (TIKA), which has been involved in several initiatives in Pakistan, with the museum being one of its prominent contributions.\nTarar highlighted the critical role of Radio Pakistan in national development, noting its substantial contributions to promoting education, art, culture, and economic awareness. He also praised Radio Pakistan for its role in providing effective communication during natural disasters and for boosting the morale of the nation, especially with its patriotic songs during times of war.\nExpressing his confidence in the museum’s potential, Tarar said, “I believe the Pakistan-Turkiye Friendship Radio Museum will serve as a lasting symbol of the strong ties between our nations and bring our people even closer together.”\nHe also commended the resilience of the Pakistani people, who come together during natural calamities, always ready to assist one another in times of need. Tarar emphasized the importance of further promoting and supporting Radio Pakistan, especially in its efforts to expand its digital presence, and called for steps to ensure the organization’s continued growth and success.\nAmbassador of Turkiye to Pakistan, Dr. Irfan Neziroglu, praised the deep-rooted and brotherly relations between Pakistan and Turkiye. He expressed Turkiye’s pride in contributing to the preservation of Radio Pakistan’s historical archives and noted that TIKA has successfully completed over 700 projects in Pakistan over the past 14 years.\nThe event was also attended by Secretary Information and Broadcasting Ambreen Jan, Director General of Radio Pakistan Saeed Ahmed Shaikh, and senior officials from the Ministry of Information and Broadcasting and Radio Pakistan.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:44:11.378Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/attaullah-tarar-lauds-turkiyes-role-in-preserving-radio-pakistans-heritage/",
  "dateList": "2025-01-16",
  "date_published": "2025-01-16T08:26:00.000Z"
}
