{
  "title": "Independence Day celebrated at Pakistan embassy in Belgium",
  "link": "https://www.app.com.pk/national/independence-day-celebrated-at-pakistan-embassy-in-belgium/",
  "date_published": "2023-08-14T15:47:00.000Z",
  "source": "APP",
  "content": "BRUSSELS, Aug 14 (APP): The Independence Day of Pakistan was observed with patriotic zeal and spirit in a graceful ceremony at the embassy of Pakistan here on Monday.\nThe national flag of the country was hoisted by Pakistan’s Ambassador to the European Union, Belgium and Luxembourg, Amna Baloch at the Chancery building.\nThe messages of the President and Prime Minister on the occasion of Independence Day were read out during the ceremony. The Pakistani leadership in their separate messages paid glowing tributes to the sacrifices of Pakistan’s founding fathers. They reaffirmed their commitment to make tireless efforts to realize the vision of the founding fathers.\nIn her message on the occasion, Ambassador Baloch stressed the importance of the vision of Quaid-e-Azam, Mohammad Ali Jinnah and poet-philosopher, Allama Muhammad Iqbal, who envisaged Pakistan to be a peaceful and prosperous country.\nThe embassy also hosted a delightful Mango Festival on Pakistan’s 76th Independence Day. Ambassador Baloch inaugurated the Mango Festival. The festival showcased the nation’s prized export – the succulent and flavorful mangoes. The attendees were treated to a sensory journey through the vibrant world of Pakistani mangoes, savoring a diverse array of varieties known for their exquisite taste and aroma.\nThe Mango Festival not only celebrated the nation’s independence but also highlighted the agricultural prowess and cultural significance of this beloved fruit.\nA variety of interesting activities were also organized by the embassy, including a photographic exhibition about the cultural heritage, history and tourism potential of Pakistan and a poster/painting competition with the theme of Independence Day of Pakistan. The ambassador awarded certificates to the participants of the poster/painting competition.\nA wide segment of the Pakistani community living in Belgium and Luxembourg including women and children participated in the celebrations.\nThe participants were treated with a traditional Pakistani brunch after the event.",
  "retrievedAt": "2025-08-11T09:10:01.093Z"
}
