{
  "title": "AIOU marks Pakistan’s 76th Independence Day with grand celebrations",
  "link": "https://www.app.com.pk/national/aiou-marks-pakistans-76th-independence-day-with-grand-celebrations/",
  "date_published": "2023-08-14T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): The Allama Iqbal Open University (AIOU) on Monday resonated with patriotic fervor as it commemorated the 76th anniversary of Independence Day.\nThe campus came alive with spirited festivities, reflecting the nation’s unity and pride.\nThe celebrations kicked off with a display of honor and respect as the university’s security guards extended a ceremonial guard of honour to AIOU’s Vice Chancellor, Prof. Dr. Nasir Mahmood. With pride and solemnity, Prof. Dr. Nasir Mahmood hoisted the national flag, symbolizing the enduring spirit of Pakistan.\nAmidst the air of unity, a collective prayer was offered, invoking blessings for the prosperity and progress of Pakistan. Decked in vibrant shades of green and white, exuberant children expressed their profound love for the nation through heartwarming performances of national songs, eloquent speeches, and a captivating tableau aptly titled “Pakistan Zindabad” (Long Live Pakistan).\nDistinguished guests graced the occasion, underscoring the international significance of the day. Among those in attendance were Aleksandr Mikhailov, Anastasiia Tenikhina, and Rasim Akhatov from Russia. The Turkish delegation was represented by Dr. Halil Tokar, Director of Yunus Emre Institute, Balqees, Consul of the Turkiye Embassy, and Education Attaché, Mehmet Toyran. In a harmonious blend of cultures, Turkish artists infused the air with melodies of love and unity through their musical renditions.\nAddressing the gathering, AIOU VC Prof. Dr. Nasir Mahmood, emphasized the pivotal role of the youth in shaping the nation’s destiny. He underscored the importance of education and skill development for a prosperous future.\nProf. Dr. Nasir Mahmood also highlighted the significance of paying homage to the nation’s forefathers, particularly Quaid-e-Azam Muhammad Ali Jinnah and Dr. Allama Muhammad Iqbal, whose visionary leadership paved the way for Pakistan’s creation.\nAs the sun began to set on this memorable day, Dean, Faculty of Social Sciences and Humanities, Prof. Dr. Abdul Aziz Sahir, and esteemed personalities including Dr. Samina Aman, Dr. Zahid Majeed, Dr. Halil Tokar, Aleksandr Mikhailov, and Anastasiia Tenikhina took the stage to share their insights and extend their warm wishes to the AIOU community.\nThe event served as a poignant reminder that Pakistan’s progress and prosperity lie in the hands of its vibrant youth. The echoes of unity, gratitude, and determination reverberated throughout the celebration, igniting a renewed sense of patriotism and responsibility among all who were present.",
  "retrievedAt": "2025-08-11T09:10:03.276Z"
}
