{
  "title": "Pakistan High Commission, London celebrates 76th Independence Day",
  "link": "https://www.app.com.pk/national/pakistan-high-commission-london-celebrates-77th-independence-day/",
  "date_published": "2023-08-14T14:55:00.000Z",
  "source": "APP",
  "content": "LONDON, Aug 14 (APP): The Pakistan High Commission in London marked Pakistan’s 76th Independence Day with a dignified flag hoisting ceremony on Monday.\nThe High Commissioner Dr. Mohammad Faisal raised the national flag. The ceremony was attended by the diaspora community and British friends of Pakistan, showcasing unity and friendship, transcending boundaries.\nIn his address, the High Commissioner extended heartfelt felicitations to Pakistanis on this auspicious occasion, paying homage to Quaid-i-Azam Muhammad Ali Jinnah and Pakistan Movement heroes, who created an independent homeland for Muslims of the sub-continent.\nHighlighting Pakistan’s journey, the High Commissioner praised its resilience against all challenges. He highlighted Pakistan’s abundant human and natural resources, with a youthful demographic dividend constituting 60 percent of the population, a driving force for economic growth. Dr. Faisal noted the ongoing economic reforms, fostering a business and investment-friendly environment.\nRegarding Pakistan-UK relations, the High Commissioner highlighted the historic warmth of bilateral ties, a legacy that bound the two nations. He applauded the burgeoning trade and economic ties, and cooperation in addressing climate challenges, as manifestations of this enduring relationship.\nThe High Commissioner conveyed heartfelt appreciation to the Pakistani diaspora, recognizing their role as the architects of strengthened ties between Pakistan and the UK, fostering cooperation and understanding.\nDr. Faisal paid tribute to the unwavering spirit of the Kashmiri populace living under Indian occupation. Pakistan’s steadfast moral, diplomatic, and political support for the legitimate self-determination struggle was reaffirmed. The Indian atrocities in IIOJK were highlighted and the international community was urged to put an end their human rights violations.\nParallel celebrations took place at Pakistan Consulates in Birmingham, Manchester, Bradford, and Glasgow, unifying the Pakistani community from across the UK.",
  "retrievedAt": "2025-08-11T09:09:57.711Z"
}
