{
  "title": "Independence Day celebrated in Ankara",
  "link": "https://www.app.com.pk/national/independence-day-celebrated-in-ankara/",
  "date_published": "2023-08-14T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): The 76th Independence Day anniversary of Pakistan was celebrated with traditional zeal and enthusiasm, bringing together the vibrant diaspora at Pakistan embassy residence in Ankara on Monday.\nAmbassador of Pakistan to Turkiye Dr Yousaf Junaid hoisted the national flag to the tune of national anthem in the presence of the dignitaries from all spheres of life. The event was well attended by Pakistani community residing in Ankara.\nMessages of the President and Prime Minister of Pakistan were read out on the occasion. Pakistani leadership in their messages paid tribute to the sacrifices of ancestors and vowed to transform Pakistan in accordance with the vision of Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal. Pakistani leadership also expressed solidarity with the people of Indian Illegally Occupied Jammu & Kashmir and reassured Pakistan’s political, moral and diplomatic support for their legitimate right to self-determination.\nFelicitating the nation particularly Pakistani community in Turkiye on Independence Day, Ambassador Dr. Yousaf Junaid stated that August 14 is a day to honour great sacrifices made by our forefathers, reaffirm our resolve to work wholeheartedly for inclusive and sustainable development of the country, in line with the vision of father of the nation Quaid-e-Azam. Being a thriving nation of over 240 million people, Pakistanis have shown their brilliance in every walk of life from winning nobel prizes, to triumphing summits, to developing indigenous technologies, to state-of-the-art defence production, to running world’s largest ambulance service, to producing high quality export goods – Pakistanis have excelled in every field, he added.\nWhile appreciating the contribution made by Pakistani diaspora in Turkiye’s development , ambassador Junaid stated that brotherly Turkiye’s progress is Pakistan’s progress and vice versa.\nReiterating Pakistan’s political, diplomatic and moral support for the legitimate right to self-determination of Kashmiris , ambassador Junaid urged the international community to take note of ongoing gross human rights violations in IIOJK and play its due role in resolution of Kashmir Dispute.\nThe Ambassador thanked the Turkish nation and leadership for sending congratulatory messages and sharing the joy of Pakistan’s Independence Day by lighting the Bridges over Bosphorus in the colours of Pakistani flag.",
  "retrievedAt": "2025-08-11T09:10:04.740Z"
}
