{
  "title": "President stresses need to look forward for Pakistan’s prosperity",
  "link": "https://www.app.com.pk/national/blaming-past-not-an-issue-its-building-future-president/",
  "date_published": "2023-08-14T10:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP):President Dr Arif Alvi on Monday stressed the need to look forward for Pakistan’s prosperity and uplift by ignoring the fallacies of the past.\n“Blaming the past is not an issue of Pakistan, it is building the future,” he said while addressing on the occasion of a photo exhibition here at Pakistan National Council of Arts (PNCA).\nIn the exhibition, well known artist Ali Azmat thematically presented Quid-i-Azam Muhammad Ali Jinnah’s portraits in acrylic and charcoal medium.\nThe event was organized by “ForArtSake”-a non-government organization, in collaboration with Pakistan National Council of Arts (PNCA).\nThe president said Quid-i-Azam was an inspiring personality who always believed in hard work, unity, faith and discipline.\nHe said Muslim history was also rich in arts and architecture and at a time Baghdad was the center of artistic activities.\n“I am a big admirer of the art and architecture as the artists beautifully depict the whole of the society,” he added.\nHe said the new generation should also be shown the portraits of big personalities such as Quid-i-Azam to strengthen their belief in Quid’s saying “Unity, Faith and Discipline”.\nThe president said the countries were formed for people, not for state, therefore they must be given the opportunity to enjoy their basic rights in the society.\nCurator of the even Amna Pataudi said Ali Azmat alluded to the glaring reality that Pakistan faced today-that of straying tragically away from reality that Pakistan faces today-that of straying away from Quid’s envisioned state of Pakistan.\nShe added that through their work, artists brought colour and beauty in the lives of people.\nArtist Ali Azmat said turning Pakistan’s struggle for independence into a reality was such a remarkable feat and colossal contribution that even contemporary political opponents recognized and admired his political acumen.\n“What inspired and move me the most about his (Quid-i-Azam) life is his steadfast belief that hard work and sincerity of purpose will defy any worldly power and lead to success.\nHe said “our generation inherited the love for our leader, and I believe it is our responsibility to pass on this love with the same intensity and passion to the upcoming generations, because living nations never forget their benefactors”.\nHe said the affection displayed in these painting not only expressed his love for the leader, but also served as a humble effort to keep this love alive in the hearts of future generations.",
  "retrievedAt": "2025-08-11T09:10:07.672Z"
}
