{
  "title": "Shireen Mazari submits report in IHC about jail reforms",
  "link": "https://www.app.com.pk/national/shireen-mazari-submits-report-in-ihc-about-jail-reforms/",
  "date_published": "2020-01-18T02:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):Federal Minister for Human Rights Shireen Mazari Saturday submitted a report before the court of the commission formed by Islamabad High Court given the task for recommendations about jail reforms.\nThe hearing of a petition filed by a prisoner Khadim Hussain against less health facilities at jails was resumed by the Chief Justice IHC Athar Minallah.\nThe court had earlier formed a commission headed by Shireen Mazari for making a complete report about the facilities and recommendations for reforms in jails.\nShireen Mazari appeared before the court and submitted the commission’s report.\nShe hailed that the decisions of Athar Minallah regarding human rights were remarkable.\nThe CJ also remarked that Shireen Mazari was performing well for controlling human violations.\nMinallah addressing Shireen said you were not summoned for the day against which she stated that she wanted to submit commission’s report herself.\nThe CJ remarked that prisoners not sent to jail for torture adding they sent to jail for other purposes.\nEvery religion teaches about treating human in a good way, CJ asserted.\nHe remarked that prisoners were in too much dilapidated conditions in jail as number of prisoners has extremely increased in jails added that government should have to take affective measures to bring reforms in jails.\nThe CJ said that it was the responsibility of the government to release sick convicted or provide medical facilities up to standards.\nShireen Mazari informed the court that a large number of under trial prisoners are imprisoned in jails and their problems needed to be resolved.\nShe said the government was planning to create separate cells in jails for transgender people.\nShe stated the MoHR was initiating awareness campaign about child abuse against which the CJ inquired either they had worked for child abuse in jails.\nMazari responded yes and stated that complete briefing has been put in the report already submitted before the court.",
  "retrievedAt": "2025-08-11T18:38:43.731Z"
}
