{
  "title": "Speaker NA Asad Qaiser welcoming China’s decision of backing Pakistan over Kashmir",
  "link": "https://www.app.com.pk/national/speaker-na-asad-qaiser-welcoming-chinas-decision-of-backing-pakistan-over-kashmir/",
  "date_published": "2020-01-18T02:14:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 18 (APP):The Speaker of the National Assembly Asad Qaiser Saturday welcoming the decision of China by backing the Pakistan’s request not to change the status of Jammu and Kashmir and asked India to response to the members of the United Nations Security Council.\nIt is pertaining to mention here that recently, China-backed Pakistan’s request for the United Nations Security Council to discuss India’s decision to revoke the special status of Jammu and Kashmir, asking for the body to meet behind closed doors Beijing charters its grave reservation over India’s Kashmir policy and is justifiably opposed to New Delhi’s move on Kashmir, especially its decision to carve the Ladakh region out of Jammu and Kashmir State and administer it federally.\nThe Chinese government spokesperson called the move “unacceptable” and said that it would help Pakistan in defending “its legitimate rights and interests” in the Kashmir region.\nSpeaking at the media men during the inauguration ceremony of the free medical camp in Marguz, Swabi, Speaker National Assembly Asad Qaiser said that China has always supported Pakistan and extended it support for Kashmir issue. He thanked China and underlines the commitment that Pakistan-China friendship is an unbreakable.\nHe said that India has planned to set up Nazi-style detention centers in occupied Kashmir.\nSpeaker of the National Assembly Asad Qaiser said that the task force has been handed over the flour price reduction task and this year 300,000 tons of wheat would also be imported. He said that a total of Rs. 96 million fines were imposed during the proceedings against 376 flour mills, licenses of 15 flour mills and wheat quota of 180 flour mills were suspended.\nHe said that legal action would be taken against the unauthorized and self-aggrandizing of any commodities, and measures are being taken for the welfare of the people.\nHe said that the present government is taking all steps to restore the backwardness and welfare of the people.\nFurther steps would be taken to provide medical facilities to the deserving people and with the grace of Almighty Allah we would be succeeded in servicing the people by removing their backwardness, he concluded.",
  "retrievedAt": "2025-08-11T18:38:43.721Z"
}
