{
  "title": "Govt to remove genuine reservations of allies: Dr Firdous",
  "link": "https://www.app.com.pk/national/govt-to-remove-genuine-reservations-of-allies-dr-firdous/",
  "date_published": "2020-01-18T06:15:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 18 (APP):Special Assistant to the Prime Minister (SAPM) on Information and Broadcasting, Dr Firdous Ashiq Awan said on Saturday that the government would remove all genuine reservations of its allies by adhering to the policy of consensus, consultation and reconciliation.\nAddressing ‘Meet the Press Programme’ here at Lahore Press Club, she said the elected PTI government was advancing further while taking along all the provincial governments, however, some political dwarfs and defeated elements were dreaming of toppling the government and mid-term election but they would face sheer disappointment as the PTI government would complete its constitutional term of five years.\nDr Firdous Ashiq Awan said PTI was implementing its reform agenda by making effective legislation to abolish the obsolete system in the country.\nShe warned those (public servants) obstructing the government’s way, saying that there would be zero tolerance on performance and public service delivery.\nSince political stability and economic stability were very much interlinked, the present government was ensuring both, citing that jeopardized economy left by the previous governments had now come out of ventilator and attained stability following the tough but timely and vital decisions by the PTI government, she elaborated.\nShe said through economic stability, the government was providing maximum relief to masses. A crackdown had also been launched against flour millers, hoarders, profiteers and elements creating artificial price-hike to stabilize the prices of daily use items, she added.\nThe government had taken various decisions to maintain its writ and such elements would be dealt with iron hand, and scope of Kisan Markets would be expanded to bring down the flour prices, she vowed.\nDr Firdous called upon the media to play its role in pointing out those creating artificial price-hike, hoarders and cartels etc. People were being given subsidy on edibles including Ghee, flour, sugar and pulses at utility stores under Rs 6 billion relief package announced by the prime minister.\nFelicitating the newly-elected LPC office-bearers, she said, “I came here to give respect to your vote,” asserting that Lahore Press Club was not only mother of all press clubs but also a trendsetter.\nShe also conveyed best wishes of Prime Minister Imran Khan to the new LPC body and mentioned that LPC had played an active role in convincing philanthropists during the construction of Shaukat Khanmam Hospital, adding the prime minister also wanted the LPC to once again play its effective role in pulling Pakistan out of prevailing challenges and provision of maximum relief to the public.\nThe journalists also suffered a lot in the wake of grave economic challenges left by the previous government, however today Pakistan’s economy was stable and in the right direction and its positive impact would soon be felt in various fields including journalism, she said.\nNow time has come to implement the strategy agreed upon with the media, while Prime Minister Imran Khan has also released the grants for press clubs and the government would patronage small press clubs. Under Right to Information Act, she mentioned that information centres would be established in press clubs to facilitate the journalists.\nTo a question, she said first time in media’s history, there was no litigation against 8th wage board award announced by PTI government.\nThe SAPM assured that the government would act as a bridge in the Media Consultative Commission to settle down the mutual issues of media workers/journalists and media owners.\nShe also assured to settle down the discrepancy between media community and the City Traffic Police Officer (CTO) Lahore.\nTo another question about Federal Minister Chaudhry Fawad Hussain, she said it was his personal observations as there was democracy in the country, asserting that unlike other political parties, PTI government always give space to cabinet members to even object/point out any lacuna in its performance.\nShe explained out of total nine divisions of Punjab, Dera Ghazi Khan Division falls on number seven with regard to funds release, which means six divisions above D.G.Khan were given more funds than this division.\nDr Firdous Ashiq Awan recalled that the past rulers had used to divert south Punjab’s funds to establish ‘Paris’ in Lahore, which always inundated during heavy rains, but the PTI government evolved a just system of funds distribution and now the funds allocated for south Punjab were also spent on south Punjab thus removing sense of deprivation of the people of those areas.",
  "retrievedAt": "2025-08-11T18:38:53.820Z"
}
