{
  "title": "Islamabad Police deploys 3,300 officers for foolproof Ramazan security",
  "author": null,
  "content": "ISLAMABAD, Mar 01 (APP):Islamabad Capital Police has devised a comprehensive security plan for Ramazan, deploying over 3,300 officers across the district to ensure public safety, Deputy Inspector General of Police (DIG) Islamabad Muhammad Jawad Tariq announced.\nA public relations officer told APP on Saturday that an important meeting, chaired by DIG Islamabad Muhammad Jawad Tariq, was attended by Senior Superintendent of Police (SSP) Operations, zonal SPs, SDPOs, and SHOs to finalize security measures.\nEmphasizing the importance of public safety, DIG Tariq directed officers to sacrifice their comfort and remain vigilant in protecting mosques, markets, shopping centers, and other key locations.\nHe stressed the need for heightened security in response to the current situation, instructing personnel to closely monitor suspicious individuals.\nHe further directed that entry into mosques and imambargahs be restricted to a single gate, with thorough screening via metal detectors. Parking areas must be kept away from religious sites, while private guards and designated personnel from mosque and imambargah administrations will assist in security duties.\nTo support officers on duty, DIG Tariq instructed officials to ensure the provision of suhoor and iftar. He also ordered strict action against professional beggars and their facilitators.\nDuring prayer times, SDPOs and station house officers will personally oversee security arrangements. Officers must remain alert, particularly during prayers, Taraweeh, and iftar, performing their duties with dedication and patriotism. Security at mosques, imambargahs, and areas designated for women’s Taraweeh prayers will be further strengthened.\nAdditionally, DIG Tariq called for meetings with mosque administrations and peace committee members to enhance coordination. He also urged collaboration with local authorities to secure Ramazan bazaars effectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:15:39.108Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-police-deploys-3300-officers-for-foolproof-ramazan-security/",
  "dateList": "2025-03-01",
  "date_published": "2025-03-01T07:33:00.000Z"
}
