{
  "title": "Plantation necessary to avert temperature rise: Zartaj",
  "link": "https://www.app.com.pk/national/plantation-necessary-to-avert-temperature-rise-zartaj/",
  "date_published": "2020-02-26T02:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):Minister of State for Climate Change Zartaj Gul Wednesday said tree plantation was necessary to avert temperature increase as many people had died in Karachi due to heat wave.\nThe minister stated this while inaugurating spring Tree Plantation at Islamabad Model College for Girls, I-8/4.\nShe said planting tree was the vision of Prime Minister Imran Khan, which aimed at making the country a disaster resilient through restoration of its natural reserves.\nShe said other than Karachi, deserts of Thar and Cholistan and areas of South Punjab were also under serious impact of climate change that was causing large scale migration from those areas.\n“The cities around the country are already over populated and cannot cater extra number of masses over a long period of time. There is urgent need to take preventive and climate change adaptive measures to control serious environmental degradation in the region,” she added.\nZartaj was of the view that planting a tree was perpetual charity that should be made by every citizen of the country.\n“There is much criticism on our 10 Billion Tree Tsunami Project that how such large number of trees would be planted across the country.\nBut the point is that at least, we have taken the initiative where the previous governments remained idle on the issue. If every Pakistani plants a tree every year then 10 billion trees target can be achieved,” she noted.\nPrincipal IMCG I-8/4, Prof Dr Firdous Zahra apprised the students and faculty members at the plantation drive regarding the benefits of tree plantation.\nShe said a single tree produces oxygen that could help make two human beings survive. She added that trees were necessary to control harmful carbon dioxide gas emissions and noise pollution.\nOn the occasion, a student, Laibah Ubaid Ullah delivered a speech on the importance of tree plantation.",
  "retrievedAt": "2025-08-11T18:51:50.072Z"
}
