{
  "title": "No financial loss in fiscal year 2018-19 due to pension increase : EOBI",
  "link": "https://www.app.com.pk/national/no-financial-loss-in-fiscal-year-2018-19-due-to-pension-increase-eobi/",
  "date_published": "2020-02-25T21:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):The Employees Old-Age Benefit Institutions (EOBI) Wednesday pointed out that it had not sustained any financial loss during financial year 2018-19 due to previous increase in pension amount from Rs 5, 250 to Rs6, 500.\nClarifying a news item published in a national daily, saying ‘EOBI to further record\nloss of Rs 18 billion annually’, the EOBI, in a statement, said the department’s annual budget stood at Rs 50.96 billion during the fiscal year 2018-19.\nGiving breakup, it said the EOBI had collected Rs20.75 billion from the registered employers and received grant of Rs2.49 billion from the federal government, besides generating income of Rs 27.41 billion from its annual investments.\nThe annual budget in the last fiscal year also included other income amounting to\nRs310 million. Out of total annual budget, the EOBI disbursed around Rs31.74 billion among its pensioners during the last fiscal year while Rs1.7 billion were spent in\nterms of administrative management expenses.\nThe EOBI pointed out that it had kept a surplus budget of Rs 17.44 billion during\nthe last fiscal year and did not sustain any loss.\nMoreover, the institution, during the current fiscal year (2019-2020) was expecting around Rs 35.8 billion and Rs 23 billion on account of its investment income and total contribution collection, respectively.\nThe EOBI said that the expected revenue collection for the financial year 2019-20\ncould easily cater the total pay-outs of Rs 43.9 billion inclusive of administrative and development expenditure.\nAfter thoroughly examining all the factors affecting viability of the scheme, the\nEOBI’s Board of Trustees had approved the increase in pension from Rs 6,500 to\nRs 8,500 which would be forwarded to the federal cabinet for approval, it added.\nThe EOBI also clarified that the proposed increase in EOBI pension would take\neffect from January 2020, rather than September 2018 as wrongly communicated\nin the news item.",
  "retrievedAt": "2025-08-11T18:51:58.265Z"
}
