{
  "title": "PN seminar on Hindutva ideology highlights massive HR violations in IoJK",
  "link": "https://www.app.com.pk/national/pn-seminar-on-hindutva-ideology-highlights-massive-hr-violations-in-iojk/",
  "date_published": "2020-02-25T23:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 26 (APP):Pakistan Navy Wednesday organized a seminar on “Hindutva Ideology and Effect on the Region” at Pakistan Navy War College, Lahore under the auspices of Maritime Centre of Excellence (MCE).\nDuring the session, eminent speakers enlightened the audience on various aspects of Hindutva Ideology and ongoing gross human right violations in Indian occupied Jammu Kashmir (IoJK) , a Pakistan Navy press release said.\nThe seminar bounded together an array of participants from public and private sector including a large number of scholars, faculty and students from prominent universities of Lahore.\nThe implementation of Hindutva ideology by the Bharatiya Janata Party (BJP)’s fascist government; following the Rashtriya Sawayamsevak Sangh (RSS) Greater Plan which was the emerging face of India was also revealed during the seminar.\nBesides, the presenters also underlined the possible ramifications for South Asian Region due to unfettered violence in IoJK.\nThe seminar was the foremost event held under the banner of MCE and amply highlighted Indian atrocities in the Occupied Kashmir. It also underscored the valiant and legitimate struggle of Kashmiris to achieve the inalienable right of self-determination.\nPakistan Navy established MCE last year at PN War College, Lahore with an objective to expand understanding and providing impetus to ocean related matters tied to national security. MCE acts as the national hub of maritime thinking simultaneously undertaking academic and applied research on both, Maritime Security and Blue Economy.\nPakistan Navy contemplates major breakthrough in the field of maritime studies in Pakistan by providing intense focus to understanding of maritime affairs in Pakistan.",
  "retrievedAt": "2025-08-11T18:51:53.855Z"
}
