{
  "title": "Back of terrorist organisations will be broken if they did not receive any fund from India: Fawad",
  "link": "https://www.app.com.pk/national/back-of-terrorist-organisations-will-be-broken-if-they-did-not-receive-any-fund-from-india-fawad/",
  "date_published": "2021-08-20T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain Friday said the back of Tehrik-e-Taliban Pakistan (TTP) and other terrorist organizations like Balochistan Liberation Army (BLA) would be broken if they did not receive any funds from India.\nTalking to Turkish news channel TRT, he said Pakistan wanted that the government in Afghanistan should be inclusive having representation of all groups.\n“We believe that the people of Afghanistan have the right to make decisions inside Afghanistan but the regional countries can play their role in enabling stability in the war-torn country.”\nHe said Pakistan was in touch with all the regional countries including China, Turkey, United States of America and United Kingdom.\nCountries of the region could play their role for peace and stability in Afghanistan, he said adding Prime Minister Imran Khan had called leaders of all the world powers and trying to come up with the strategy that decision making was not done in isolation, it should be collective and take the situation inside Afghanistan towards stability.\nPakistan tried to create a positive environment and persuaded the Taliban and the United States to negotiate, the minister said.\nHe said Pakistan also tried that Taliban and Kabul government should also hold talks but unfortunately due to negative attitude of Ashraf Ghani the opportunity was wasted.\nTo a question, he said Pakistan did not control the Taliban and it did not have decision making powers with the Taliban. However he said Pakistan was in touch with all groups in Afghanistan and yesterday it hosted a delegation of Afghan Parliament here. “We are in touch with all Afghan factions and want installation of all inclusive dispensation in Kabul having representation of all the factions.”\nAnswering another question, the minister said the statement by the spokesman of the Afghan Taliban that the territory of Afghanistan would not be allowed to be used against any other country was extremely welcome.\nHe said Pakistan’s basic condition was that the territory of Afghanistan should not be allowed to be used against any other country and Afghanistan would not be allowed to become a hub of international terrorist organizations at all costs.",
  "retrievedAt": "2025-08-11T21:06:39.018Z"
}
