{
  "title": "Pakistan to continue to play positive role for peaceful, stable Afghanistan: Ambassador Mansoor",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-to-play-positive-role-for-peaceful-stable-afghanistan-ambassador-mansoor/",
  "date_published": "2021-08-19T19:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Pakistan’s Ambassador in Kabul Mansoor Ahmad Khan Thursday reiterating his country’s commitment towards a peaceful and stable Afghanistan said it would continue to play a constructive and positive role in that respect.\nAmbassador Khan, in a television interview stressed for the establishment of an inclusive government in Afghanistan with all major ethnic and political groups on board for peace and political sustainability in the country.\nTo a question about any role of Pakistan in the formation of government in Afghanistan, which had been taken over by the Taliban over the last weekend, he categorically stated that it was upto the Afghan groups alone to form a government through consultation and consensus.\nAbout his today’s meeting in Kabul with former Afghan President Hamid Karzai and Chairman High Council for Reconciliation in Afghanistan Abdullah Abdullah, Ambassador Khan said that during the meeting they discussed the current situation in Afghanistan and the future political prospects.\nTo another question he said that the Embassy of Pakistan in Kabul was fully functional and facilitating the people of both Pakistan and Afghanistan in the current situation.\nAmbassador Khan said that Pakistan Embassy in Kabul besides its hectic efforts in the repatriation of Pakistani citizens though and land routes was also issuing transit visas to citizens of other countries including those of media persons for their safe evacuation.\nMeanwhile, a CNN report has also appreciated the role of Pakistan in facilitating the people of Afghanistan as well as those belonging to international media and other organizations in the situation developed after the Taliban seized Kabul on August 15.\nCNN’s Sophia Saifi in her report from Islamabad said that Pakistan subsequently opened its two border crossings with Afghanistan first Chaman in Balochistan and then Torkhum in Khyber Pakhtunkhwa to facilitate the inflow of people from Afghanistan having legal visa or entry documents.\nShe also mentioned the positive role of the Ministry of Information and Broadcasting in facilitating the journists from international media organisations for getting out of Afghanistan via  Pakistan through transit visa.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:06:34.273Z"
}
