{
  "title": "PAF pays tribute to Rashid Minhas Shaheed on his 50th martyrdom anniversary",
  "link": "https://www.app.com.pk/national/paf-pays-tribute-to-rashid-minhas-shaheed-on-his-50th-martyrdom-anniversary/",
  "date_published": "2021-08-20T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP):To pay homage to Pakistan’s valiant son and the youngest recipient of Nishan-e-Haider, Pilot Officer Rashid Minhas Shaheed, the Directorate General Public Relations of Pakistan Air Force (PAF) has released a short documentary on his 50th martyrdom anniversary.\nPilot Officer Rashid Minhas Shaheed was born on February 17, 1951. Having a dream of defending the aerial frontiers of the motherland, he got commission on March 14, 1971 in the 51st GD (P) course, said a PAF media release.\nHe was later posted to No 2 Squadron stationed at Maripur (Masroor) for an Operational Conversion Course, where he was destined for sublime heights by Almighty Allah.\nOn August 20, 1971 an unforgettable saga of bravery was crafted with his ultimate sacrifice.\nOn this fateful day, Rashid Minhas vanquished the iniquitous intentions of his instructor pilot Flight Lieutenant Mati-ur-Rahman, who tried to hijack his training jet T-33 towards India.\nRashid battled to take back the controls of the aircraft and finally preferred to crash the plane before it could cross the border.\nThe brave son of soil accepted to sacrifice his life but didn’t allow the country’s dignity to be tarnished.\nIn recognition of Rashid Minhas’s supreme sacrifice and indelible courage, the Government of Pakistan awarded him with the highest gallantry award Nishan-e Haider.\n“He will always be remembered as an icon of bravery and sacrifice and will remain a beacon for our future generations,” it said.\nEarlier, Director General Inter Services Public Relations (DG ISPR) Major General Babar Iftikhar in a tweet eulogised the chivalrous son of the soil Rashid Minhas Shaheed for his sacrifice.\n“On 5Oth Martyrdom anniversary, we remember with reverence, bravery and supreme sacrifice of National Hero Pilot Officer Rashid Minhas Shaheed, Nishan-e -Haider,” he added.\nIn line of duty, Pilot Officer Rashid Minhas lived up to great traditions of Pakistan Air Force defending the motherland, Major General Babar Iftikhar wrote in his tweet",
  "retrievedAt": "2025-08-11T21:06:31.344Z"
}
