{
  "title": "PM inaugurates expansion of Ehsaas truck kitchens to three more cities",
  "link": "https://www.app.com.pk/national/pm-inaugurates-expansion-of-ehsaas-truck-kitchens-to-three-more-cities/",
  "date_published": "2021-08-20T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP): Prime Minister Imran Khan Friday while inaugurating the expansion of ‘Ehsaas Koi Bhooka Na Soye’ initiative to Gujranwala, Lahore and Multan directed the authorities concerned not to compromise on quality of food served to the needy people.\nThe prime minister inaugurated four food trucks that will serve free cooked meal to daily-wage earners across the cities. With addition of four trucks under the expansion plan, the total number of such vehicles will be increased to 16.\nThe Ehsaas has been running 12 trucks in 5 cities including Rawalpindi, Islamabad, Lahore, Faisalabad and Peshawar and the program is being expanded to seven cities including Gujranwala, Lahore and Multan.\nEach truck feeds 1000-1500 people daily on specified service points, twice a day and seven days a week.\nSpecial Assistant to PM on Social Welfare Senator Dr. Sania Nishtar and Managing Director Pakistan Bait-ul-Mal Malik Zaheer Abbas Khokhar briefed the prime minister on the expansion plan of the free food service. SAPM Dr Shahbaz Gill and Senator Faisal Javed were also present there.\nDuring the briefing, the prime mister questioned as whether there was any mechanism for quality audit. In response, Sania Nishtar told that they had received some complaints from Peshawar regarding the quality of food which were addressed later.\nTo this, the prime minister repeatedly directed for no compromise on quality of food, both at trucks as well as Panagahs, because the poor who felt contented only for getting free food, would never complain about its quality.\nWhile also reiterating his government’s commitment to serve the poor without hurting his dignity, the prime minister said such initiatives were the reflection of State of Madina which had taken the responsibility of their poor people.\nThe prime minister was told that by October, the “Ehsaas Koi Bhooka Na Soye” operations would be expanded to all four provinces, Azad Jammu and Kashmir and Gilgit Baltistan with the overall fleet of 40 food trucks in 29 cities that would feed 40,000 people every day and 1.46 million people annually.\nTo-date, 831,625 meals have been served across Lahore, Faisalabad, Rawalpindi, Peshawar and Islamabad.\nOn March 10, 2021, the initiative was officially launched by the prime minister to serve free meals to deserving populations in Rawalpindi and Islamabad.\nUnder the Ehsaas umbrella, this programme runs through a public private partnership whereby Pakistan Baitul Mal was responsible for the operations of the food trucks and Saylani Welfare International Trust was responsible for provision of meals.",
  "retrievedAt": "2025-08-11T21:06:29.091Z"
}
