{
  "title": "Farrukh sets record straight by comparing govt’s 3rd year in power with PML-N’s last one",
  "link": "https://www.app.com.pk/national/farrukh-sets-record-straight-by-comparing-govts-3rd-year-in-power-with-pml-ns-last-one/",
  "date_published": "2021-08-20T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Friday rejected false claims made by Pakistan Muslim League-Nawaz (PML-N) leader Ahsan Iqbal in a presser about the present government’s three years performance.\nIn a live media talk broadcasted by the Pakistan Television (PTV) , he set the record straight by comparing the PTI government’s third year in office with the last one of PML-N’s five-year term which ended in 2018.\nDescribing the PML-N leader’s presser as ‘full of lies’, he said it was only aimed at saving the skin of their leadership which had been facing corruption cases in the country and still at large to avoid trail in the courts.Such tactics would not hamper the process of accountability launched by Prime Minister Imran Khan to retrieve the national wealth from the looters and corrupt people, he added.\nHe said the vision 2025 of PML-N mentioned by Ahsan Iqbal in his new conference was only meant to raise assets for ‘motu gang’ and expedite money laundering through corrupt practices.\nThe minister said there were three instances in the past when the country came to brink of economic default. Such economic recessions occurred from 1998 to 1999, 2008 to 2009 and 2017 to 2018.\nDuring those tumultuous times, both the major opposition parties PML-N and Pakistan People’s Party (PPP) were ruling the country, he said while asking them to refrain from lecturing the present government on economy.\nRecalling Ahsan Iqbal’s interview with a television channel in which he stated that the Pakistan Tehreek-e-Insaf government should have gone to the IMF, Farrukh said the PML-N was aware of deteriorating economic condition in the country when it completed its tenure.\nHe said on completion of its five year term in 2018, the PML-N left the country with foreign exchange reserves of only 15 days. It left the country with $9 billion reserves and the historic current account deficit of $19 billion, he added.\nThe minister said the PML-N took record foreign loans in its tenure and flooded the market with borrowed $7 billion, just to maintain rupee value artificially.\nComparing the present government’s economic performance with PML-N’s, he said today the situation was totally different.\nFrom 2020 onward, he said the country, despite facing worst impact of pandemic, was performing extraordinarily on economic front. Four per cent economic growth was recorded at the end of last fiscal year, he added.\nThe minister said despite the COVID-19’s fallouts, exports were recorded at the highest level with $25.4 billion of goods and if services sector’s added, it would cross $31 billion mark. Textiles and IT exports were also showing phenomenal growth, he added.\nRemittances, which remained at upto $20 billion during the PML-N tenure, now reached to $29 billion, he noted and remarked that the foreign remittances surged remarkably due to the confidence posed by the overseas Pakistanis in Prime Minister Imran Khan’s leadership.\nHe said the current account deficit which left by PML-N at $19 billion was now at its lowest level. It also remained surplus for sometime during the present government’s tenure, he added.\nHe said non-debt revenue , which was less than $50 billion in 2018,had crossed $60 billion.\nRejecting the notion of record tax collection in the PML-N tenure, he said its volume was increased by collecting huge amount in sales taxes.\nHe described the PML-N’s claim of collecting Rs 4,000 billion taxes during last year of its tenure as ‘wrong’ and said their government generated only Rs 3,740 billion in that regard. It was achieved with the help of an amnesty scheme for non-filers, withholding of tax refund payments and advance taxation.\nOn closing of last financial year, the minister said the government collected taxes of Rs 4,730 billion out of which record refund payments were made to the filers. The government had set a target of Rs 5,800 billion for this year’s tax collection, he added.\nHe said the Large Scale Manufacturing posted 14 per cent growth, while a huge amount of funds had been spent to reform the agriculture sector. Record increase in output of major crops was being witnessed due to an agriculture package of Rs 1,100.\nFarrukh said the PML-N leaders did criminal negligence by installing 45 per cent of those power projects that had to be run on imported fuels. By 2023, Rs 1,500 billion would have to be paid in capacity payments.\nHe said the present government was taking steps to build major water reservoirs in the country to enhance storage capacity and reliance on hydel power.\nFarrukh said work on several water projects including Diamer Bhasha Dam, Dasu hydropower, Mohmand Dam, Sindh Barrage, Huripur power project, Kachhi Canal, K-IV water supply, Kurram Tangi and Nai Gaj dams was in full swing.\nThe minister said completion of those ten projects would not only ensure water reserves of 12.89 million acre feet, but also increase generation of inexpensive hydropower in the country by 9,043 mega watt (MW).It would also create more than 35,000 job opportunities in the country, he added.\nPrime Minister Imran Khan had emerged as a global leader by taking practical steps on climate change, he said, adding such efforts of him were also being recognized by the International Organizations.\nCommercial and residential projects with an investment of Rs1,000 billion had been approved, he said, adding applications for low-cost houses worth Rs145 billion were approved, while loans amounting to Rs45 billion had also been approved. He said it would not only generate economic activity of Rs4,100 billion in 120 allied industries, but also help create a total of 700,000 jobs in the country.\nFarrukh said so far, 20,000 low-cost housing units had been completed, while the Naya Pakistan Housing Development Authority shortlisted multiple housing projects for construction of 70,000 units.\nHe said the Health Insaf Card had been provided to the entire population of Khyber Pakhtunkhwa, whereas people of Punjab would get the facility this year.\n“Pakistan is on track of becoming a Medina like welfare state under the leadership of Prime Minister Imran Khan,” he concluded.",
  "retrievedAt": "2025-08-11T21:06:37.708Z"
}
