{
  "title": "Pakistan reiterates support for oppressed Kashmiris",
  "link": "https://www.app.com.pk/national/pakistan-reiterates-support-for-oppressed-kashmiris/",
  "date_published": "2022-02-05T19:18:00.000Z",
  "source": "APP",
  "content": "ANKARA, Feb 6 (APP): Embassy of Pakistan organized an event here on Saturday to commemorate Kashmir Solidarity Day, wherein the participants paid tribute to the sacrifices of the Kashmiri brethren in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThey reiterated unflinching support for their just struggle for the legitimate right of self-determination.Messages of the President, Prime Minister of Pakistan and Foreign Minister were read. Pakistani leadership reiterated political, moral and diplomatic support to the people of Kashmir until the resolution of the dispute in accordance with UNSC resolutions and aspiration of the Kashmiris. In their messages, the leaders called on the international community to take practical steps to hold India accountable for gross human rights violations in Kashmir and fulfil the promise made by the United Nations to the Kashmiri people.Pakistan’s ambassador to Turkey Muhammad Syrus Sajjad Qazi in his remarks stated that commemoration of 5th February as Kashmir Solidarity Day was a stark reminder of the broken promises and unfulfilled commitments made to the Kashmiri people by India for holding a plebiscite, when it had taken the matter first time to the UN in January 1948. Ambassador Qazi underscored, that since then, all kinds of political, diplomatic, military, economic, parliamentary, constitutional and demographic jugglery and coercion had been employed to deny this fundamental right to the Kashmiris in IIOJK.\nThe ambassador stated that in any contest between force and love for freedom, perseverance and love for freedom would always win. Struggle for freedom was a baton that one generation passed on to the next. One day Kashmir will see the dawn of freedom, InshaAllah.Ambassador Syrus Qazi expressed gratitude to the Turkish leadership and people for principled stance on Kashmir and continuous support on Jammu & Kashmir. The event was attended by members of Turkish civil society, Pakistani community and officers of the Pakistan embassy.",
  "retrievedAt": "2025-08-11T14:15:59.781Z"
}
