{
  "title": "India doesn’t leave any opportunity to destabilize Pakistan: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/india-doesnt-leave-any-opportunity-to-destabilize-pakistan/",
  "date_published": "2022-02-06T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 06 (APP):Interior Minister Sheikh Rasheed Ahmad on Sunday said that India did not leave any opportunity to destabilize Pakistan as the entire Indian media seemed to be restless during the Prime Minister Imran Khan’s visit to China.\nAddressing a press conference here, he said that over 70 to 80 thousands Pakistani people and personnel of our armed forces rendered matchless sacrifices in war against terrorism. Paying rich tribute to the sacrifices to the personnel of security forces, he said 20 terrorists were killed in 72 hours while nine solider embraced martyrdom in the terrorist attacks.\nRegarding talks with banned Tehreek-e-Taliban Pakistan (TTP) outfit, the minister said doors for talks could not be closed. However, he said those should not be spared who took weapons against State and our armed forces.\nOur valiant forces were responding to the terrorists in befitting manners, he added.Rasheed said Pakistan has deep, cordial and brethren relations with Saudi Arabia and Saudi Interior Minister would arrive in Pakistan tomorrow on a day-long visit. The government was making all out efforts to bring Pakistani prisoners languishing in jails abroad, he added.\nHe said interior ministers of Qatar, Kuwait, Bahrain etc were also being invited to visit Pakistan. Meanwhile, Pakistani held in minor offenses could be released. Pakistani prisoners have already been brought from Turkey owing to the efforts of PM Imran Khan, he added.\nRegarding the opposition long march, the minister said that they were not interested in march rather they wanted to remain alive in news. Earlier, the opposition has planned to tender their resignation and now wanted to start a long march, he said.\nHe said the current opposition was not in a position to bring no confidence against the government and the PM.\nSheikh Rasheed said Maulana Fazlur Rehman was totally ignored in recent meeting of main opposition parties Pakistan Peoples Party and Pakistan Muslim League Nawaz (PML-N).\nRegretting over opposition’s attitude, he said it was fortunate that they were talking about chaos in the country even on Kashmir Solidarity day (February 5).",
  "retrievedAt": "2025-08-11T14:15:53.357Z"
}
