{
  "title": "Pakistan’s 4.8% population has hearing problems: Sania Nishtar",
  "link": "https://www.app.com.pk/national/pakistans-4-8-population-has-hearing-problems-sania-nishtar/",
  "date_published": "2023-02-06T17:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 06 (APP): About 4.8 percent of the country’s population either has hearing problems or faces complications while listening due to health issues and other associated risks, Senator Dr Sania Nishtar of Pakistan Tehreek-e-Insaf said on Monday.\nShe tabled a motion in the Senate to discuss the issue of “Integrated People-Centred Ear and Hearing Care” in line with the World Report on Hearing 2021 by the World Health Organization and the steps taken by the Federal Government to address this health priority.\nSpeaking in the House, Sania Nishtar said the World Report on Hearing 2021 gave startling figures stating 1.3 billion people were facing hearing problems and 134 million were severely impacted or hearing impaired. “In Pakistan, the statistics are ambiguous related to the specially-abled people.\nA Rapid Assistive Technology survey by the Ministry of National Health Sciences Regulations and Coordination reveals that 4.8% of the country’s total population possesses a hearing disability. It also includes the elderly wearing hearing aids.”.\nShe underlined that the problem was the country lacked any national plan, strategy, committee, or task force and special protocols for paramedics on hearing disabilities.\nHowever, the country on the contrary in the case of diseases related to a vision had a proper task force that worked out proper eye care teams for ophthalmologists, she added.\nSania Nishtar regretted that there was no concerted effort at the national level for addressing hearing care and disability.\nShe recommended the House to send the motion to the Senate Committee on Heath to form a national taskforce with a mandate to formulate a three-year national plan with solid recommendations.\nMinister of State for Law Shahadat Awan apprised the House that in 2017, the World Health Assembly Report underscored that 20% of the global population was facing hearing problems.\n“If business as usual continued then 2.5 billion population to get hearing issues and 700 million people will need treatment for hearing issues,” he added.\nSenator Prof Dr Mehr Taj Roghani while moving the motion to discuss the status of implementation of the National Immunization Policy 2022 said the then SAPM on Health Dr Faisal Sultan and his team did a great effort to conceive the historic document.\n“It is a comprehensive and progressive document and it’s implementation must be ensured.”\nShe added that recently 23 cases of polio were reported in Pakistan and only two in the war-hit Afghanistan which was regrettable for the country for performing poorly despite efforts.\nResponding to her motion, the Minister of State for Law Shahadat Awan said the government was cognizant of the fact and all suggestions by her or the Upper House would be welcomed to achieve the goal of a polio-free Pakistan.\nEarlier, Senator Mohsin Aziz moved the motion on steps taken by the government to ban or restrict the use of small plastic bottles (500 ml or below) that caused an environmental hazard, pollution, and drain blockages.\nHe said the federal minister for climate change wanted to take up the motion herself but could not appear in the House due to her bad health. The minister had told him that the motion was sent to different departments for their comments.\nLater, Senator Nisar Ahmed Khuhro in his maiden address to the House after taking oath as senator severely criticsed late former president General Pervez Musharraf for abrogating the Constitution and derailing democracy.",
  "retrievedAt": "2025-08-11T05:56:14.605Z"
}
