{
  "title": "AIOU holds seminar on Kashmir Solidarity Day",
  "link": "https://www.app.com.pk/national/aiou-holds-seminar-on-kashmir-solidarity-day/",
  "date_published": "2023-02-06T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 06 (APP): A seminar was organized here yesterday at Allama Iqbal Open University (AIOU) in connection with the Kashmir Solidarity Day.\nSpeakers expressed their concern over the serious violations of human rights by Indian forces in the Indian occupied Jammu and Kashmir.\nThey stressed upon highlighting the human rights violations to the whole world through diplomacy. The speakers said that stable economy will also play a key role to strengthen the cause of Kashmiri people and to achieve self-determination according to the resolutions of the United Nations.\nThe seminar was organized by the Directorate of Student Advisory and Counseling Services, AIOU. Dean, Faculty of Arabic and Islamic Studies, Prof. Dr. Shah Mohiuddin Hashmi represented the Vice-Chancellor, Prof. Dr. Nasir Mehmood, and presided over the seminar. Registrar AIOU, Raja Umer Younis, principal officers and faculty members also attended the seminar.\nSpeakers included Secretary Law, Azad Jammu and Kashmir, Irshad Ahmad Qureshi, and Secretary, Jammu and Kashmir Liberation Cell, Aijaz Hussain Lone.\nThe speakers shared in detail the Indian atrocities in the Indian occupied Jammu and Kashmir. They said that India has taken away all the rights and freedom of the people of occupied Jammu and Kashmir, the rights of children are also being violated.\nThey added that so far millions of children have become orphans and women have become widows. After the revocation of article 370, the special status of Jammu and Kashmir has been removed, the plight of Kashmiris has worsened, and all the political leaders of Kashmir are under arrest.\nDr. Shah Mohiuddin Hashmi said that freedom is a natural desire of human beings that cannot be changed by force. He said that India adopted various tactics of violence and oppression in Kashmir but could not end the struggle of Kashmiris as their movement is getting strength day by day. He said that Kashmiris will be successful in their struggle, and they will achieve the right to self-determination one day.",
  "retrievedAt": "2025-08-11T05:56:24.575Z"
}
