{
  "title": "Elections to be held on time: Minister Amin-ul-Haque",
  "link": "https://www.app.com.pk/national/elections-to-be-held-on-time-minister-amin-ul-haque/",
  "date_published": "2023-02-06T14:15:00.000Z",
  "source": "APP",
  "content": "HYDERABAD, Feb 06 (APP): Federal Minister for Information Technology and Telecommunication Syed Amin-ul-Haque on Monday said the general elections in the country would not be held before October, as the digital census was in progress and the election could not be held before its completion.\nHe said this while addressing the Digital School inauguration ceremony organized here in Latifabad by the Telecom Foundation School, an institute of the Ministry of Information Technology and Telecommunication.\nSyed Amin-ul-Haque said as per the manifesto of Muttahida Qaumi Movement Pakistan, Government College University was providing higher education to the people of Hyderabad and another federal university which would soon be established in the second largest city of Sindh.\nHe said the digital school was the first of its kind in Hyderabad after Orangi Town’s school in Karachi and its network would be extended to other districts of the province.\nThe minister said enhancing connectivity was a top priority of the Ministry of IT & Telecom so that the majority of the population could be digitally connected.\nThe ministry of I&T has launched 70 projects in the last three years in which 65 billion rupees have been spent on connectivity,\nAmin-ul-Haque said that under the leadership of Prime Minister Shehbaz Sharif, the government had increased IT export to US 2 billion dollars.\n“The National Incubation Center has been established in Hyderabad at a cost of one billion rupees, where modern education facilities are being provided to the youth irrespective of their color, caste and creed,” the minister said and added that in the next phase a digital school will be established in Thatta or Badin.\nTalking about the digital school, the Federal IT Minister said that a digital school for girls up to primary and secondary has been established in Orangi Town last month with the support of the Sindh Education Foundation, while in Hyderabad the digital school is being launched at the primary level where girls and boys will receive education together.\nSyed Aminul Haque asked the officers concerned that a digital school in Hyderabad must be converted into a secondary school within the next 4 years.\nHe said that under the Ministry of IT and Telecom, 14 projects worth Rs.100 billion had been started across the country in the last 4 years, while Rs. 14.43 billion were being spent in 20 districts, from which more than 14.2 million people would be benefited.\nHe said that the foundation stone of the state of the art IT Park was laid in Karachi which will be completed at the cost of Rs.42 billion by the Ministry of Information Technology.\nThe CEO Telecom Foundation Zuama Mohiuddin, Azam Khan, MNA Sabir Qaimkhani, Commissioner Bilal Ahmed Memon, SEF’s representative and others also spoke on the occasion.\nEarlier, Federal Minister Syed Amin-ul- Haque inaugurated the Digital School established by Telecom Foundation in Latifabad unit 9.\nThis Digital school is the first of its kind in Hyderabad and second in Sindh after Karachi.\nMPA Rashid Khilji, MQM Zonal head Zafar Siddiqui and other office bearers and a large number of party workers were also present on them occasion.\nMeanwhile, laptops were distributed among the students of different schools and also shields and gifts were presented to the distinguished guests.",
  "retrievedAt": "2025-08-11T05:56:17.658Z"
}
