{
  "title": "Resolving Gwadar issues provincial govt’s responsibility: Shahadat Awan",
  "link": "https://www.app.com.pk/national/resolving-gwadar-issues-provincial-govts-responsibility-shahadat-awan/",
  "date_published": "2023-02-06T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 06 (APP): Minister of State for Law and Justice Shahadat Awan on Monday said the responsibility of resolving the Gwadar issues was primarily the provincial government’s responsibility after the 18th Amendment of the constitution.\nThe minister made these remarks while winding up the discussion on the motion presented by Senator Kamran Murtaza and Mushtaq Ahmed on the recent situation of protests in Gwadar City on alleged illegal trawling in the sea; high number of security checkpoints operating in and around the city; and also trade on Pak-Iran Border purportedly affecting the residents of Gwadar.\nAwan said the local issues, other than security or law and order, were related to the provincial government.\nWhile narrating the context of the situation in Gwadar due to protests, he added that the demands of small fishermen in Gwadar was just.\n“On November 21, 2021 the former prime minister created a special committee to contain trawling. However, on December 26, 2022 the Balochistan government requested the Ministry of Interior to control the law and order situation that was aggravated after the death of a police constable,” the Minister of State said.\nHe noted that the federal government was well aware of the situation and, therefore, a special committee comprising of the minister for Maritime Affairs to resolve the issues of Gwadar fishermen.\n“The house must demand the report of this committee to review the measures being taken so far,” he urged.\nSenator Anwaar-ul-Haq Kakar, while adding to the discussion on the motion said, the senators and movers of the motion had indicated some behaviors leading to rebellion or insurgency, they would have to classify those manners as causing anti-state sentiments.\nHe queried, “Who was responsible to provide water and electricity to the people of Gwadar? Is it Prime Minister Shehbaz Sharif or Imran Khan or the chief minister? After the 18th Amendment, it is the responsibility of the chief minister.”\nThe senator argued that it was not a matter of anti-state attitude but rather an issue of civil rights, where allegedly the poor governance of the provincial government was a major issue contributing to it.\nHe alleged that the elected representative of Gwadar in the provincial assembly, despite his influence, was contributing more to the problems rather playing his constructive role to resolve the crisis.\nEarlier, Senator Mushtaq Ahmed while presenting the motion apprised the house that Gwadar’s ‘Haq Do Tehreek’ (Give Rights Movement) was a just protest in resistance to the mishandling of the stakeholders, persecution of women, children, elderly, and others for demanding their fundamental rights.\n“The Constitutions Articles 16, 17 and 19 allow the countrymen freedom of assembly, association and expression respectively. The locals of Gwadar are being deprived of all these. The Haq Do Tehreek leader Moulana Hidayatur Rehman held three sit-ins to draw the attention of the provincial government,” he added.\nSenator Ahmed said the tehreek earlier presented 42-point demands to the chief minister pertaining to education, health, border trade, missing persons, water availability and others that were all legal.\n“Chief Minister Balochistan Abdul Qudus Bizenjo had agreed to the demands of the Tehreek but was not implemented afterwards,” he claimed.\nSenator Tahir Bizejo on point of order urged the House to take serious note of the situation in Gwadar.\nSenator Molana Abdul Ghafoor Haideri said the people of Gwadar for centuries were relying on fisheries and their concerns should be addressed.",
  "retrievedAt": "2025-08-11T05:56:14.839Z"
}
