{
  "title": "Islamabad to upgrade public libraries to promote reading culture",
  "author": null,
  "content": "ISLAMABAD, Jan 24 (APP): In a bid to revive and promote a culture of reading, the Capital Development Authority (CDA) has announced plans to upgrade public libraries across Islamabad.\nThe decision was made during a meeting chaired by CDA Chairman and Chief Commissioner Islamabad, Muhammad Ali Randhawa, on Friday.\nSenior officials from the CDA, district administration, and the Director General Libraries ICT were also in attendance.\nThe meeting discussed comprehensive proposals to improve the city’s public libraries and foster a learning-oriented environment for citizens.\nChairman Randhawa emphasized the importance of creating detailed plans for the upgradation of all libraries in the federal capital, including the CDA library, and proposed the establishment of e-libraries in collaboration with the Punjab Information Technology Board (PITB).\nTo make libraries more accessible and appealing, the Chairman suggested innovative ideas such as integrating cafes and coffee shops into library spaces. “The revenue generated from these facilities will be reinvested into the maintenance and development of the libraries,” he stated.\nFurther plans include the introduction of international language courses and the installation of books at metro bus stations and other prominent public locations, aiming to make reading materials more accessible.\nChairman Randhawa also directed the rapid completion of all ongoing renovation projects and stressed that Islamabad’s libraries should be developed into state-of-the-art learning hubs.\n“This initiative will ensure vibrant and accessible spaces for residents to enhance their knowledge and learning,” said Randhawa.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:58:55.237Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-to-upgrade-public-libraries-to-promote-reading-culture/",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T15:29:00.000Z"
}
