{
  "title": "President confers Sitara-i-Imtiaz award on Asif Bashir",
  "author": null,
  "content": "ISLAMABAD, Jan 24 (APP):President Asif Ali Zardari on Friday conferred the Sitara-i-Imtiaz award on Asif Bashir in recognition of his outstanding services in the field of public services.\nThe award was conferred at a special investiture ceremony held at the Aiwan-e-Sadr and attended by parliamentarians.\nAs per the citation read out at the ceremony, Asif Bashir, who is currently posted as Computer Operator at Deputy Commissioner  Office in Peshawar, was selected by the federal ministry of religious affairs as a Moavin-i- Hajj (Hajj Assistant) for the previous year’s Hajj operation.\nDuring the Hajj operation, the temperature soared to 51.8 degree due to which several pilgrims had to face extreme difficulties. During such situation, the Hajj Moavineen perform extraordinary and appreciable services which often remain unacknowledged.\nThe Moavineen basically are responsible for providing facilities to the Pakistani Hujjaj (pilgrims), however they also provide possible facilities to the pilgrims belonging to other countries as well.\nAsif Bashir during Hajj days was serving as a Moavin in Mina where tents of the pilgrims belonging to different countries including India were present.\nOn 9th Zil Hajj, several Pakistani, Indian and British elderly Hujjaj got fainted due to extreme hot weather. Tragically, 1300 people also lost their lives on that day.\nIn the midst of the crisis, Asif Bashir and his five-member team rushed to the scene, providing first aid to the affected pilgrims, many of whom were Indian citizens. Despite the dire circumstances, Asif Bashir physically carried 26 pilgrims, including 17 Indians, on his shoulders to the hospital. Thanks to his swift actions, the lives of these individuals were saved.\nHe helped the Hujjaj without knowing that some relatives of the Indian Council General Jeddah were also included among those rescued by him.\nIn recognition of his heroic efforts, Indian minister for minorities affairs also wrote a letter of appreciation acknowledging the exceptional hospitality and responsibility shown by the Pakistani team.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:59:42.764Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-confers-nishan-i-imtiaz-award-on-asif-bashir/",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T12:47:00.000Z"
}
