{
  "title": "Awais Leghari for transparent installation of smart meters at distribution level transformers by WB",
  "author": null,
  "content": "ISLAMABAD, Jan 24 (APP): Federal Minister for Power Sardar Awais Ahmed Khan Leghari has urged the World Bank for provision of funds and investment for installation of Smart Meters at Distribution Level Transformers in order to bring transparency and cater for unjust load-management due to losses at micro level.\nHe was talking to the visiting World Bank Vice President for South Asian Region, Martin Raiser who met him here along with a delegation on Friday, said a press release. Federal Minister for Petroleum Division Dr. Musaddiq Malik also participated in the meeting.\nExplaining the importance of Smart Meters at Distribution level Transformers, the Federal Minister said that right now smart meters are being installed at domestic and grid level and it has helped in many ways. However without installing smart meters at Transformers level the desired efficiency and just load management for a particular area cannot be ensured as right now the entire feeder has to face equal load management providing no solace to efficient consumers. He said that these smart meters can also be helpful in managing peak load demand.\nAwais Leghari also invited the World Bank to invest in Public Private Partnership mode in the smart metering in LESCO and MEPCO as service provide. He informed that these Distribution Companies are next in the privatization list.\nHe informed the delegation that due to Bijli Sahulat Package there is 7% increase in Power Consumption in the industrial Sector in December 2024 as compared to last year for the same period indicating an appetite and appreciation by the consumers for any future of auction of surplus electricity in the country.\nThe minister also present whole stock of initiatives undertaken by the Power Division in the sector leading toward efficiency, financial discipline, autonomy in decision making and reduction in power tariff for domestic and industrial consumers. He informed that Power Sector will soon enter into muti-buyer and multi-seller market and the CPPA will no longer remain a single buyers as it has already been stopped to make any further agreement in this regard. The principle of competitiveness and affordability will govern the Power Sector generation and distribution, he added. In this regard Wheeling Charges are almost being finalized.\nHe also appraised the delegation about the recent initiatives for providing one point electricity connections with distribution and billing collection rights to industrial estates and special economic zones eliminating the monopoly and intervention of Distribution Companies’ employees at all stages.\nThe meeting expressed satisfaction over the current World Bank’s portfolio of the Power Sector with agreement to further expedite utilization of funds at the Distribution Companies level. The meeting also agreed to further increase level of interaction at technical levels to provide Power Sector with data necessary for better policy making and its implementation. The meeting agreed that longer duration electricity packages will give private sector enough time to plan their businesses accordingly.\nThe World Bank’s Vice President for South Asian Region while appreciating various reform initiatives undertaken by the Power Division, stressed upon the need for timely utilization of funds earmarked for various projects by the Bank. He also supported the Installation of Smart Meter at Distribution Level Transformers and informed the meeting that World Bank Team can work its details with the stakeholders.\nMartian Raiser expressed the commitment of the World Bank to continue working with Power Division and provide assistance in various sub-sector for achieving efficacy and discipline.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:59:21.700Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/awais-leghari-for-transparent-installation-of-smart-meters-at-distribution-level-transformers-by-wb/",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T12:13:00.000Z"
}
