{
  "title": "Universities unite at NUST to celebrate Int’l Day of Education 2025",
  "author": null,
  "content": "ISLAMABAD, Jan 24 (APP):Pakistan’s public and private sector universities here on Friday organized and event at the National University of Science and Technology (NUST) to mark the International Day of Education 2025.\nThe event also marked the culmination of NUST’s ConnectEd training, titled “Online Education Excellence Program (Batch 3),” which drew participants nationwide.\nMore than a celebration, the gathering was a testament to the unifying power of education in addressing contemporary challenges.\nAmong the notable institutions represented were the recently upgraded Institute of Southern Punjab to the status of university, the National Skills University Islamabad, Shifa Tameer-e-Millat University Islamabad, and NUST’s own College of Aeronautical Engineering and College of Electrical and Mechanical Engineering.\nThis year’s International Day of Education theme, “Artificial Intelligence and Education: Preserving Human Agency in a World of Automation,” resonated deeply with the attendees learning from the NUST ConnecEd training.\nParticipants of the Online Education Excellence Program pledged to uphold the principles of human agency, ensuring that individuals retain their autonomy, creativity, and critical thinking while integrating AI as a supportive tool rather than a dominating force.\nBy emphasizing the capacity for independent action and decision-making, NUST’s ConnectEd program highlights the importance of education tailored to individual needs and aspirations. As Prof. Dr. Muhammad Mukhtar, a program participant, observed, “The training modules reflect a commitment to human agency and the right to education by personal will. Well-structured online programs align seamlessly with the Higher Education Commission’s Online Distance Education Policy.”\nWith the growing influence of AI, the program also addressed pressing issues such as safeguarding educational content and combating AI-driven challenges like deepfakes and psychological manipulation. Wing Commander Dr. Taimur of NUST’s College of Aeronautical Engineering described this course as vital in countering these threats. “This training equips us to tackle the ethical dilemmas and vulnerabilities introduced by AI,” he remarked, extending gratitude to the training team for their forward-thinking approach.\nThe event concluded with a note of optimism and unity. Dr. Awais Kamboh, Dean of the National Center for Learning at NUST, commended the participants for their dedication and congratulated them on receiving their certificates.\n“Your commitment to educational excellence on this International Day of Education 2025 reflects our collective responsibility to shape a future where technology empowers, rather than overpowers, human potential,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:59:43.085Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/universities-unite-at-nust-to-celebrate-intl-day-of-education-2025/",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T12:38:00.000Z"
}
