{
  "title": "581 feeders restored in flood-hit areas: Power Division",
  "author": null,
  "content": "ISLAMABAD, Sep 23 (APP):The Ministry of Energy (Power Division) on Tuesday reported significant progress in restoring electricity across flood-affected areas of the country, with the majority of damaged grids and feeders now back online.\nAccording to the Division’s latest report covering the situation up to September 23, a total of 51 grids and 588 feeders were impacted nationwide, out of which 373 feeders have been fully restored while 208 have been partially re-energized.\nIn Faisalabad Electric Supply Company (FESCO) jurisdiction, 28 grid stations and 81 feeders were impacted.\nOf these, 63 feeders have been fully restored and 18 partially energized, with power supply for 5,066 consumers expected to be completely restored by September 24.\nLahore Electric Supply Company (LESCO) faced disruption to 67 feeders, of which 66 are now fully restored and one is partially functional. Power has already been completely restored in the districts of Lahore, Nankana Sahib, Okara and Sheikhupura, while electricity for the remaining 441 consumers is expected to be restored by September 24.\nIn Multan Electric Power Company (MEPCO) areas, 81 feeders affected. 33 feeders have been fully restored, while 141 are operational on a partial basis. Full restoration efforts will commence as soon as floodwaters recede in the region.\nThe Gujranwala Electric Power Company (GEPCO) reported damage to 11 grid stations and 103 feeders. Out of these, 102 feeders have been fully restored, while 1 have been partially restored. Power supply for 22 affected consumers will be completely restored once the floodwaters recedes.\nThe Peshawar Electric Supply Company (PESCO) made rapid headway, restoring 88 affected feeders fully and another 3 partially. Restoration work has been successfully completed in key districts, including Swat, Swabi, and Dera Ismail Khan.\nIn Tribal Electric Supply Company (TESCO) areas, particularly in North Waziristan and Khyber, 18 feeders were affected. Restoration has been completed on all affected feeders.\nMeanwhile, in Hazara Electric Supply Company’s Mansehra region, all three affected feeders have been fully restored. The Sukkur Electric Power Company (SEPCO) has temporarily restored 44 affected feeders in its jurisdiction, with permanent restoration expected in the coming days.\nThe Power Division is working tirelessly to ensure full restoration as soon as possible to bring relief to all affected areas.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:25:47.517Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/581-feeders-restored-in-flood-hit-areas-power-division/",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T11:25:00.000Z"
}
