{
  "title": "Pakistan calls for urgent action at meeting of OIC Committee of Six on Palestine",
  "author": null,
  "content": "ISLAMABAD, Sep 23 (APP): Pakistan on Tuesday reaffirmed unwavering commitment to the Palestinian cause, describing it as central to the Organization of Islamic Cooperation (OIC)’s objectives.\nAddressing the meeting of the OIC Committee of Six on Palestine, Deputy Prime Minister and Foreign Minister Ishaq Dar stressed that the world continues to witness the harrowing tragedy unfolding in the Occupied Palestinian Territory, particularly Gaza, where civilian infrastructure has been deliberately targeted and the suffering of the population has reached catastrophic levels.\nHe recalled that the International Court of Justice has described the situation as a case of “plausible genocide” and stressed that Israel’s ongoing military campaign continues in blatant defiance of international law, international humanitarian law, and binding orders of the ICJ, according to a press release issued by the Foreign Office Spokesperson.\nHe condemned the collective punishment of a besieged civilian population through indiscriminate bombardment, starvation, forced displacement, and denial of humanitarian aid, and further warned that settler violence and military aggression are escalating in the West Bank, including East Jerusalem.\nThe deputy prime minister and foreign minister underscored that this is a defining moment for the Middle East and the Muslim world and urged the OIC to press for a permanent ceasefire, unrestricted humanitarian access, an end to illegal settlements and annexation, restitution of seized lands and properties, accountability for war crimes, and the deployment of an international protection mechanism.\nHe called for renewed support to UNRWA, reconstruction of Gaza under the Arab-OIC plan, compliance with ICJ rulings, and the realization of the Palestinian people’s inalienable right to self-determination through the establishment of an independent and sovereign State of Palestine, based on pre-1967 borders, with Al-Quds Al-Sharif as its capital.\nThe OIC Committee of Six on Palestine is tasked with mobilizing political, diplomatic and legal support for the Palestinian cause.\nThe Committee includes Pakistan, Senegal, Guinea, Malaysia, the State of Palestine and the OIC General Secretariat. It was established in 1982 during the 13th session of the Islamic Conference of Foreign Ministers.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:25:32.932Z",
  "source": "APP",
  "link": "https://www.app.com.pk/global/pakistan-calls-for-urgent-action-at-meeting-of-oic-committee-of-six-on-palestine/",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T22:13:00.000Z"
}
