{
  "title": "Pak-Bahrain reaffirm commitment to strengthening bilateral parliamentary cooperation",
  "author": null,
  "content": "ISLAMABAD, Sep 23 (APP):National Assembly Speaker Sardar Ayaz Sadiq and King Hamad bin Isa Al Khalifa of Bahrain, during their meeting at Al-Safriya Palace on Tuesday, underscored the spirit of cordiality and brotherhood that reflects the enduring friendship and historical ties between Pakistan and Bahrain.\nDuring the meeting, Speaker Sardar Ayaz Sadiq conveyed warm greetings and messages of goodwill on behalf of the President of Pakistan, Asif Ali Zardari, and the Prime Minister of Pakistan Mian  Muhammad Shehbaz Sharif.\nThe leadership of Pakistan expressed their wishes for the continued prosperity and development of Bahrain. King Hamad graciously acknowledged these sentiments, extended his best wishes for the leadership of Pakistan, and prayed for the progress and well-being of the Pakistani people.\nThe two leaders held an extensive exchange of views on important regional and international issues of mutual concern.\nThey emphasized the importance of peace, stability, and cooperation in the region, with Speaker Ayaz Sadiq reiterating Pakistan’s principled stance on the peaceful resolution of the long-standing disputes of Palestine and Kashmir.\nHe strongly condemned the ongoing atrocities in Kashmir and Palestine and reaffirmed that sustainable peace in the region can only be achieved through just and lasting settlements of these disputes.\nKing Hamad congratulated Pakistan on the  Pakistan-Saudi Strategic Mutual Defense Agreement, terming it a milestone achievement that strengthens collective security in the region. He lauded Pakistan as a key Muslim country and a prominent military power in the Islamic world, playing a vital role in safeguarding the collective interests of the Ummah.\nIn response, Speaker Ayaz Sadiq reaffirmed Pakistan’s unwavering commitment to defending and promoting the shared values and aspirations of the Muslim world.\nBoth leaders also discussed the long-standing bilateral ties between Pakistan and Bahrain, underscoring the need to further expand cooperation in parliamentary, economic, and cultural domains. They highlighted the importance of enhancing parliamentary exchanges, sharing legislative experiences, and fostering institutional linkages between the two parliaments.\nSpeaker Sardar Ayaz Sadiq especially praised the Bahrain Parliament for establishing a dedicated section on Sustainable Development Goals (SDGs) on its official webpage, describing it as a commendable step towards promoting inclusive and sustainable progress.\nHe assured Pakistan’s readiness to extend full cooperation to Bahrain in achieving its sustainable development objectives.\nKing Hamad also expressed deep sorrow over the loss of lives and widespread destruction caused by recent floods in Pakistan.\nHe conveyed Bahrain’s solidarity with the people of Pakistan in their time of trial and assured every possible support for relief and rehabilitation efforts.\nSpeaker Sardar Ayaz Sadiq, in turn, expressed his profound gratitude for Bahrain’s compassion and support, terming it as a reflection of the brotherly relations that bind the two nations together.\nThe parliamentary delegation comprises members of the National Assembly, Zulfiqar Bhind, Ms. Musarrat Rafique Mahesar, Malik Shakir Bashir Awan, Sardar Shamsher Ali Khan Mazari, Abdul Aleem Khan, Muhammad Usman Badini, Hassan Sabir, Khursheed Ahmed Junejo, and Pullain Baloch.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:25:25.163Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-bahrain-reaffirm-commitment-to-strengthening-bilateral-parliamentary-cooperation/",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T14:08:00.000Z"
}
