{
  "title": "NA Speaker extends heartfelt felicitations to Saudi Arabia on 95th National Day",
  "author": null,
  "content": "ISLAMABAD, Sep 23 (APP):National Assembly Speaker Sardar Ayaz Sadiq has extended warm felicitations to the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister Mohammed bin Salman, Speaker of the Shura Council Dr. Abdullah Al-Sheikh, and the brotherly people of Saudi Arabia on the auspicious occasion of the Kingdom’s 95th National Day.\nThe Speaker stated that Pakistan and Saudi Arabia enjoy historic and time-tested fraternal relations , which are deeply rooted in shared religious, moral, and social values. He lauded the exemplary role of the Saudi leadership as Custodians of the Two Holy Mosques, serving the Muslim Ummah with devotion and commitment.\nSpeaker Sardar Ayaz Sadiq underscored the Kingdom’s pivotal contributions towards the preservation of the rich cultural and moral heritage of the Muslim world. He reiterated that Pakistan and Saudi Arabia stand united in their pursuit of peace, unity, and progress for the entire Ummah.\nReferring to the recent signing of the Pakistan–Saudi Strategic Mutual Defence Agreement, the Speaker termed it a “historic milestone” in bilateral relations. He extended congratulations to King Salman, Crown Prince Mohammed bin Salman, and Speaker Dr. Abdullah Al-Sheikh on the successful conclusion of the agreement.\nThe Speaker also paid tribute to the leadership of President Asif Ali Zardari, Prime Minister Shehbaz Sharif, Deputy Prime Minister Ishaq Dar, and Field Marshal Syed Asim Munir for their vision and commitment in advancing Pakistan–Saudi ties. He observed that the defence pact reflects mutual trust, shared resolve, and the spirit of enduring brotherhood between the two nations.\n“This agreement will open a new chapter of regional security, stability, and collective prosperity,” the speaker remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:24:34.693Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-speaker-extends-heartfelt-felicitations-to-saudi-arabia-on-95th-national-day/",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T17:48:00.000Z"
}
