{
  "title": "Strong Pak-China relationship to safeguard regional peace: Chinese ambassador",
  "author": null,
  "content": "ISLAMABAD, Sep 23 (APP): Ambassador of People’s Republic of China, Jiang Zaidong has said that the China will continue to work with Pakistan to further deepen the iron-clad friendship and all-dimensional cooperation between the two countries.\nAddressing the reception celebrating the 76th anniversary of the founding of the People’s Republic of China, the ambassador said that the China will uphold high-level mutual trust and firm support, take the lead in building of the China-Pakistan community with a shared future.\nHe said that a strong China-Pakistan relationship is not only conducive to safeguarding the common interests of the two countries, but also to safeguarding peace and development in the region and even the world.\nHe said as President Xi Jinping noted, China and Pakistan share a resilient bond, a brotherly bond, and also a bond built on trust and common values—an ironclad friendship that was forged through historical twists and turns and has grown ever stronger over time.\nHe added high-level exchanges between our two countries have been frequent. President Asif Ali Zardari has just made another successful trip to China, following his state visit in February, and Prime Minister Shehbaz Sharif travelled to China at the end of August to attend two major events, during which the two countries have released the action plan to foster an even closer China-Pakistan community with a shared future in the new era.\nHe said that China will implement the important consensuses reached by President Xi Jinping and Pakistani leaders, and steadily advance the 63 measures in seven major fields outlined in the action plan.\n“We will fully leverage the comprehensive effects of the upgraded version 2.0 of the China-Pakistan Economic Corridor (CPEC), focus on the three key areas including industries, agriculture and mining, upgrade the China-Pakistan Free Trade Agreement, and promote more high-quality products from Pakistan to be exported to China.”\nHe said,” We will follow the people-centered approach, prioritize people’s livelihood, jointly enhance the well-being of the people of both countries. We will implement more small and beautiful livelihood projects, strengthen cooperation in healthcare, education, and climate change response, and expand youth and people-to-people exchanges between the two countries.”\nHe said, ” We are ready to work with Pakistan to accelerate the building of an even closer China-Pakistan community with a shared future in the new era.”\nHe said over the past 76 years, the Communist Party of China (CPC) has united and led the people of all ethnic groups across the country on a magnificent journey from “lagging behind the times” to “catching up with the times” and further to “leading the times”.\nHe said that particularly since the 18th National Congress of the CPC in 2012, President Xi Jinping has steered the course with a great historical initiative, profound people-centered compassion, and a strong sense of mission and responsibility.\nHe has led the Party, the military, and the people of all ethnic groups across the country in writing a new chapter of the two great miracles with rapid economic development and long-term social stability, propelling the great rejuvenation of the Chinese nation into an irreversible historical process.\nDuring the 14th Five-Year Plan period (2021-2025), China’s total economic output has consecutively exceeded the thresholds of 110 trillion RMB, 120 trillion RMB , and 130 trillion RMB, and is expected to cross the threshold of 140 trillion RMB this year, maintaining a annual economic growth rate of around 5.5%, he added.\n“While achieving sustained and rapid economic growth, we have adhered to a people-centered approach and enhanced people’s well-being.”\nHe said that after winning a complete victory in the battle against poverty, China set a five-year transitional period to consolidate and expand the achievements and integrate this effort with the advancement of comprehensive rural revitalization.\nHe said that the basic medical insurance coverage rate for the population lifted out of poverty has remained stable at over 99%.\nDuring the 14th Five-Year Plan period, the industries that leverage local strengths in poverty-alleviated rural areas have continued to grow, with a total output value exceeding 1.7 trillion RMB.\nHe added the scale of employment of the population lifted out of poverty has remained stable at over 30 million for four consecutive years.\nHe said that China’s great achievements and its unremitting efforts in poverty alleviation fully embody the practice of the people-centered philosophy of development, and have also explored feasible paths and made great contributions to the global cause of poverty alleviation.\nHe said that China has contributed around 30% to global economic growth for many years.\nIn 2024, China’s outward foreign direct investment (OFDI) increased by 8.4% year-on-year, ranking among the top three globally for 13 consecutive years.\nHe said that China has remained the world’s largest manufacturing country for 15 consecutive years, with the output of more than 220 key industrial products leading the world.\nThe annual production and sales of China’s new energy vehicles have exceeded 10 million units, topping the global list for 10 consecutive years. China has remained the world’s largest industrial robot market for 12 consecutive years, and China-developed AI DeepSeek has gained global popularity.\nHe said that CPC has played a historical role in liberation and rise of China on the globe as the major global power. “Thanks to the great leadership of President Xi Jinping, China has become a major global economic power, and the friendship of China-Pakistan has developed at a great speed.”\nHe said that from August 31st to September 1st, the Shanghai Cooperation Organization (SCO) Tianjin Summit was successfully held.This summit featured distinct characteristics and remarkable highlights.\nDuring the summit, President Xi Jinping put forward the Global Governance Initiative (GGI). Following the GDI, the Global Security Initiative (GSI), and the Global Civilization Initiative (GCI), the GGI is another important public good provided by China to the international community.\nAs President Xi Jinping pointed out in his important speech at the commemoration, the Chinese People’s War of Resistance Against Japanese Aggression was an important part of the World Anti-Fascist War.\n“We will remain committed to the path of peaceful development, and join hands with all peoples around the world in building a community with a shared future for humanity.”\nHe said that the great rejuvenation of the Chinese nation is irresistible. The noble cause of peace and development of humanity will prevail.\nHe expressed warmest congratulations on the 76th anniversary of the founding of the People’s Republic of China and prayed that may China and Pakistan enjoy prosperity and that two peoples live in peace and happiness.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:25:31.095Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/strong-pak-china-relationship-to-safeguard-regional-peace-chinese-ambassador/",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T00:11:00.000Z"
}
