{
  "title": "French envoy announces €500,000 aid for KP flood victims",
  "author": null,
  "content": "ISLAMABAD, Sep 23 (APP): France Ambassador to Pakistan, Nicolas Galey on Tuesday announced financial support of €500,000 to assist flood-affected communities in Khyber Pakhtunkhwa, stressing the need for global cooperation in tackling climate change.\nSpeaking to reporters at his residence, Ambassador Galey said the aid will strengthen recovery efforts and also highlighted that the assistance reflects France’s solidarity with Pakistan at a time of heightened climate challenges.\nHe said France remains committed to working with Pakistan on humanitarian support and long-term solutions to climate-related disasters.\nThe Ambassador said, “In the tragic circumstances many parts of Pakistan have been going through during the last weeks, we are pleased and proud to support Acted with a grant of 500,000 euros,”.\nHe said, the French contribution will fund a seven-month initiative titled Community-Led Recovery for Flood-Affected Populations in Buner and Swat. The project, implemented by Acted, a French international NGO, in coordination with the provincial government of Khyber Pakhtunkhwa, aims to reach 3,000 households – nearly 21,000 people.\nHe said the programme will focus on restoring livelihoods, repairing damaged infrastructure, providing safe water and sanitation, ensuring access to education, and offering psychosocial support to vulnerable groups. Families who lost their homes will also receive shelter assistance.\nActed, which has been working in Pakistan since 1993, he said the project is designed to respond to immediate needs while strengthening community resilience against future disasters.\nUnder the plan, Acted will create short-term jobs through gender-sensitive livelihood schemes. Communities will be engaged in rehabilitation activities, including debris removal, irrigation channel clearance, and other recovery work. These activities are expected to provide income while rebuilding critical infrastructure, he added.\nThe Ambassador said to reduce the risks faced by vulnerable households, Acted will distribute weather-resistant kits, water containers, and hygiene supplies. Families with elderly members or persons with disabilities will receive additional support to mitigate exposure to health and safety risks.\nHe said ensuring safe drinking water and sanitation is a key part of the programme. Acted will rehabilitate water supply systems, pumping stations, and latrines, while also promoting hygiene practices through awareness sessions. Hygiene and dignity kits will be distributed, and fumigation drives will be carried out to reduce health hazards.\nHe said local WASH (Water, Sanitation and Hygiene) committees will be established in coordination with the Khyber Pakhtunkhwa Public Health Engineering Department to promote community ownership and sustainability.\nTo safeguard children’s learning, Acted will set up temporary education centres, train teachers for emergency situations, and distribute school supplies. Psychosocial support services will be extended to children, women, and other vulnerable groups who have faced trauma due to the floods, he added.\nAccording to Acted, these measures will not only restore education access but also help communities recover with dignity and stability.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:24:13.060Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/french-envoy-announces-e500000-aid-for-kp-flood-victims/",
  "dateList": "2025-09-23",
  "date_published": "2025-09-23T18:30:00.000Z"
}
