{
  "title": "U.S. announces additional $10 mln to its $56.1 mln flood relief assistance for Pakistan",
  "link": "https://www.app.com.pk/national/u-s-announces-additional-10-mln-to-its-56-1-mln-flood-relief-assistance-for-pakistan/",
  "date_published": "2022-09-27T06:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): U.S. Secretary of State Antony Blinken has reaffirmed the U.S. commitment to the people of Pakistan, announcing the additional $10 million as food security assistance to the already announced $56.5 million in flood relief and humanitarian assistance.\nU.S. Spokesperson Ned Price said this is a statement issued following the meeting between U.S. Secretary of State Antony J. Blinken and Foreign Minister Bilawal Bhutto Zardari in Washington D.C.\nThe spokesperson said “Secretary expressed sorrow over the devastation and loss of life throughout Pakistan caused by catastrophic flooding”.\nPakistan’s Foreign Office said FM Bilawal apprised Secretary Blinken about the devastation caused by the cataclysmic floods with more than 33 million people displaced and a huge loss of lives and livelihoods. He highlighted the relief efforts of the Government and people of Pakistan and thanked the U.S. government for its assistance.\nThe foreign minister said no country could deal with a crisis of this proportion on its own. He emphasized that Pakistan being one of the lowest emitters was ironically one of the most severely impacted by climate change. The foreign minister said that Pakistan was seeking climate Justice and looked towards its partners to assist us in recovering from this climate induced calamity.\nFM Bilawal said that Pakistan was committed to building back better, greener and climate resilient infrastructure in areas such as irrigation, communication, energy, agri-technology, and health. Immediate action is required to help developing countries effectively face the climate crisis.\nThe Foreign Minister underscored the historic and growing importance of Pakistan-US relationship in promoting peace, security, and economic prosperity in the region. He reaffirmed Pakistan’s commitment to deepening and broadening its ties with the U.S. particularly in the areas of trade and investment and underlined that both countries were celebrating 75th anniversary of the establishment of diplomatic relations in a befitting manner and were charting a promising and mutually-beneficial roadmap for their future generations.\nSecretary Blinken expressed sincere condolences and solidarity with Pakistan over the loss of precious lives and monumental economic losses. He reaffirmed the U.S. commitment to continue cooperating with Pakistan in meeting the challenges of rehabilitation and reconstruction.\nSecretary Blinken also maintained that, given Pakistan’s enormous potential, US private sector would like to invest in Pakistan including in energy sector.\nThe foreign minister expressed the need to assist Afghanistan in averting the humanitarian crisis and underlined that Pakistan would continue to work with the international community to achieve peace, development, and stability in Afghanistan. Secretary Blinken also thanked Pakistan for its support during the Afghan evacuation process, the Foreign Office said.\nOn the sidelines of a ceremony to celebrate 75th Anniversary of the establishment of diplomatic ties between Pakistan and the U.S., at the State Department, Secretary Blinken announced additional $10 million for the flood victims. The Foreign Minister thanked him for the gesture.",
  "retrievedAt": "2025-08-11T15:38:37.725Z"
}
