{
  "title": "Developing countries must be provided sufficient means to face climate change impacts: Bilawal",
  "link": "https://www.app.com.pk/national/developing-countries-must-be-provided-sufficient-means-to-face-climate-change-impacts-bilawal/",
  "date_published": "2022-09-27T18:26:00.000Z",
  "source": "APP",
  "content": "WASHINGTON DC, Sep 27 (APP): Foreign Minister Bilawal Bhutto Zardari on Tuesday highlighting the devastation caused by floods in Pakistan said the developing countries must be provided with sufficient means to adequately face the impact of climate change.\nThe foreign minister, during his talk at Wilson Center here, said the global problems could only be addressed through global solutions.\n“Pakistan is facing an apocalyptic crisis in the shape of devastating floods”, he said and highlighted that catastrophic floods in Pakistan were proof that global warming was an existential threat facing the world today.\nHe told the gathering that Pakistan contributed less than 1% to the global greenhouse gas emissions “yet we are one of the most vulnerable countries to climate change.\n“Pakistan is seeking climate justice. We are a resilient nation and will rebuild better, greener using climate resilient infrastructure with the cooperation of our friends in the international community,” he remarked.\nBilawal Bhutto said that the devastating floods made Pakistan an apt case to become a model for such collective efforts.\nHe said the government’s priority was to focus on ensuring economic and food security and seeking mutually beneficial trade and investment ties around the globe.\nHe said Pakistan valued its long-standing relations with the United States. Both sides were focused on strengthening a broad based relationship on the principles of equality, mutual respect and mutual benefit that was not viewed through the prism of any other country or relationship.\nThe foreign minister said that strengthening business, trade and investment ties and expanding cooperation in climate change, energy , agriculture, IT/tech and education was a top priority.\nHe stressed that peace and stability in Pakistan’s neighborhood was an essential pre-requisite for economic prosperity and social sector development not just for Pakistan but also the wider region.\nIn this context, he underscored Pakistan’s desire to work closely with the international community to pursue peace and stability in Afghanistan.\nHe invited the attention of the audience to the rising wave of Hindutva-inspired anti-Muslim extremism in India which should be a matter of deep concern for the entire international community including the US.\nHe also shared the concerns of the government and the people of Pakistan on the deteriorating human rights situation in IIOJK including attempts by the BJP government to change the demographic structure of the occupied territory.\nForeign Minister Bilawal said that Pakistan wanted to resolve all outstanding issues with India through dialogue but onus was on India to create a conducive environment by reversing its illegal actions of August 5 2019 in IIOJK and stopping its oppression of Kashmiri people.",
  "retrievedAt": "2025-08-11T15:38:23.139Z"
}
