{
  "title": "NA speaker emphasis to explore Pak-Kazakh economic potential",
  "link": "https://www.app.com.pk/national/na-speaker-emphasis-to-explore-pak-kazakh-economic-potential/",
  "date_published": "2022-09-27T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 27 (APP): The National Assembly Speaker Raja Pervez Ashraf on Tuesday emphasized the need to explore immense economic potential between Pakistan and Kazakhstan.\nThe Speaker shared the remarks in a meeting with Ambassador of Kazakhstan to Pakistan Yerzhan Kistafin who called on him here.\nThe matters related to enhancing trade, relaxing visa policy, expanding parliamentary cooperation and support for National Assembly (NA) call for global funds through Inter-Parliamentary Union (IPU) to combat climate catastrophe were discussed in the meeting.\nSpeaker while welcoming Ambassador remarked that Pakistan attaches great significance to its ties with Kazakhstan, a key Central Asian country which share mutual vision of regional cooperation.\nHe said that parliamentary diplomacy could play a vibrant role in expanding mutual cooperation, adding he said parliamentarians on both sides can promote existing bilateral ties through a mutual contact.\nHe mentioned that Pak-Kazakh Friendship Group in NA is actively working to expand relations between parliaments of both the countries.\nHe added that business communities of both countries should promote trade and investment by exploring investment opportunities to further improve trade relations.\nSpeaker highlighted that Pakistan was witnessing unprecedented climate challenges and to combat this colossal challenge NA has moved an emergency item for 145th IPU Assembly in Rwanda from Oct. 11-15, 2022.\nHe added that letter & resolution on the same had been sent to Chairman with a request to support Pakistan’s stance in forthcoming conference. He also shared letter and resolution with Ambassador.\nAmbassador while appreciating Speaker for warm reception expressed solidarity for flood affectees and shared condolence letter on the same from Chair of the Mazhilis.\nHe appreciated friendly ties between two nations and assured of future collaboration in diverse sectors.",
  "retrievedAt": "2025-08-11T15:38:34.895Z"
}
