{
  "title": "India’s intransigence biggest hurdle in peaceful Kashmir settlement: AJK President",
  "link": "https://www.app.com.pk/national/indias-intransigence-biggest-hurdle-in-peaceful-kashmir-settlement-ajk-president/",
  "date_published": "2022-04-21T11:44:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Apr 21 (APP): Azad Jammu and Kashmir President Barrister Sultan Mahmood Chaudhary Thursday said India’s traditional intransigence was the stumbling block in the way of resolving the long-drawn Kashmir conflict that had now assumed dangerous proportions.\nHe was talking to a US delegation led by Congresswoman Ilhan Abdullah Omar, which called on him here. Timothy Mynett, Nicholas Lampson and Tahir Javed were also present in the meeting.\nThe US Congresswoman, who is a strong proponent of human rights, said she had voiced her serious concern over the human rights violations in the Indian Illegally Occupied Jammu Kashmir and would take up the issue with the US Congress as well as the Biden administration.\n“We are deeply worried about the India’s 5th August, 2019 action,” she said.\nThe AJK President thanked the US delegates for their visit. He also hailed Ilhan Abdullah Omar for taking a strong stance on human rights violations being committed by the Indian forces in the Indian occupied territory.\n“The manner in which you have condemned the human rights violations in the occupied Kashmir by India is a source of strength to us,” he said.\nReferring to the unresolved Kashmir dispute, Barrister Chaudhary told the visiting delegation that Indian stubbornness was one of the major hurdles in its peaceful resolution.\n“Owing to India’s intransigence no progress whatsoever has been made on the issue since 1947,” he said. Instead of resolving the dispute peacefully, he added, India had deployed over 900,000 troops in the disputed territory. The Indian troops deployed in length and breadth of Kashmir have been involved in systematic genocide of Kashmiris.”\nIn order to change the region’s demography, he said, “India has issued fake domiciles to 4.2 million non-state Hindus to change the proportion of population in occupied Kashmir.”\nHe said under the given circumstances there was a dire need that the international community, especially the United States, must come forward and help resolve the dispute between the two nuclear powers.\nLater talking to the media, Ilhan Omar said that her visit to the Azad Jammu Kashmir had improved her understanding of the Kashmir issue, and she would raise the issue at every forum.",
  "retrievedAt": "2025-08-11T14:44:17.614Z"
}
