{
  "title": "Pakistan calls for UN-brokered peace in Yemen",
  "link": "https://www.app.com.pk/national/pakistan-calls-for-un-brokered-peace-in-yemen-2/",
  "date_published": "2020-09-15T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Pakistan on Tuesday strongly condemned the recent missile and drone strikes by Houthis on Saudi Arabia, calling all parties to conflict in Yemen to engage in meaningful dialogue in line with resolutions of the United Nations.\n“Pakistan has consistently urged all parties to the conflict in Yemen to engage in a meaningful and peaceful dialogue to end the hostilities, in line with the UN Security Council Resolution 2216,” the Foreign Office said in a statement.\nThe Foreign Office terming the missile attack on Saudi Arabia a violation of the Kingdom’s sovereignty and territorial integrity, said Pakistan expressed full solidarity with Saudi Arabia and supported the Kingdom’s right to defend itself against aggression.\nThe statement commended Saudi Arabia’s successful defensive actions that prevented loss of many innocent civilian lives.\n“In this regard, we appreciate the positive step taken by the Coalition to Restore Legitimacy in Yemen, when it unilaterally declared ceasefire earlier this year. It is, however, regrettable that this step was not reciprocated positively,” it added.\nThe Foreign Office said Pakistan expressed deep concern at the recent escalation of conflict in Yemen, as the city of Marib was threatened by the Houthi militias.\n“We believe that if military conflict engulfs Marib, it will result in a serious humanitarian catastrophe.\nThis will further compound the existing precarious humanitarian situation in the country that has already seen countless deaths and injuries, and millions displaced,” it said.\nPakistan urged all parties to the conflict in Yemen, in particular the Houthis, to cease military actions, engage in a serious dialogue to end the conflict on the basis of the relevant UN Security Council resolutions, and respond positively to the proposals made by Martin Griffith, the United Nation’s Special Envoy to Yemen.\n“Pakistan believes that war serves no purpose, and all issues can be resolved through peaceful dialogue. Adopting this path early will save thousands of innocent lives, as well as the future of the Yemeni people,” it said.",
  "retrievedAt": "2025-08-11T19:48:18.958Z"
}
