{
  "title": "Roshan Digital Account to integrate overseas Pakistanis with banking system: Ambassador Janjua",
  "link": "https://www.app.com.pk/national/roshan-digital-account-to-integrate-overseas-pakistanis-with-banking-system-ambassador-janjua/",
  "date_published": "2020-09-15T04:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP):Ambassador of Pakistan to Belgium, Luxembourg and the European Union Zaheer A. Janjua Tuesday said that Roshan Digital Account would fully integrate Pakistani diaspora with Pakistan’s banking and payment system.\nIn his special video message to the Pakistani community based in Belgium and Luxembourg regarding Roshan Digital Account, Ambassador Janjua said that it was a major initiative of the Government of Pakistan to provide banking facilities for millions of non-resident Pakistanis (NRPs) seeking to undertake banking, payments and investment activities in Pakistan.\nHe emphasized that the overseas Pakistanis were the most valuable asset of the country, and providing all possible facilities to them and their families was the top priority of the government.\nAccording to a press release, the ambassador urged the Pakistani community based in Belgium and Luxembourg to continue playing positive and constructive role in the development of Pakistan.\nHe said the Roshan Account initiative was introduced by the State Bank of Pakistan (SBP), in collaboration with the commercial banks operating in Pakistan. Opening of this account is entirely digital through an online process without any need to visit bank branch, embassy or consulate or Pakistani mission abroad.\nThe ambassador further said that certain basic documents were required to open a Roshan Digital account, once provided the account would be opened within 48 hours.\nThe subscribers have an option to open the account in foreign currencies, Pak Rupee or both, he added.\nWhile elaborating the services available through this account, he said that the account would be providing digital access to all conventional account services, including funds transfer, bill and fee payments and e-commerce.\nThe Account would also enable the overseas Pakistanis to invest in Naya Pakistan Certificates (NPCs) being issued by the Government of Pakistan, at highly attractive risk-free returns on investment.\nThe ambassador highlighted that the Accounts would also enable investment in Pakistan’s stock market, besides opening up investment opportunities in real estate, both commercial and residential.",
  "retrievedAt": "2025-08-11T19:48:24.706Z"
}
