{
  "title": "Relief operations continue in all flood, rain hit areas: Babar Awan",
  "link": "https://www.app.com.pk/national/relief-operations-continue-in-all-flood-rain-hit-areas-babar-awan/",
  "date_published": "2020-09-15T04:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP):Advisor to the Prime Minister on Parliamentary Affairs Dr Babar Awan on Tuesday informed the National Assembly that relief and rehabilitation operation was continuing in all flood and rain hit areas of Sindh and others parts of the country.\nResponding to a calling attention notice regarding the situation in various districts of Sindh and other parts of the country caused by torrential rains, he said the president, the prime minister and the Sindh governor had visited the flood hit areas in Sindh and other provinces, including Balochistan.\nThe calling attention notice was moved by Shazia Marri, Nawab Muhammad Yusuf Talpur and Mahesh Kumar Malani.\nDr Babar said the National Disaster Management Authority (NDMA) had carried out rescue and relief operations round the clock. The whole country was of equally important for the government.\nHe said 20 districts were declared calamity hit, whereas 2.5 million people lost their houses due to the torrential rains and floods. Some 43,473 tents were given by the Sindh government and 29,000 tents by the NDMA, besides 10,000 tarpaulins were also distributed in the affected areas. About 1,147 food packs were given by the Sindh government while 420 ton food was disbursed by the NDMA among the flood affectees.\nHe said in the current monsoon season, there was 35 percent more rainfall than normal, which affected Karachi badly.\nHe said the rescue and relief operation was carried out with the support of armed forces, including the Pakistan Navy.\nDeputy Speaker Qasim Khan Suri referred the issue to the Committee on Cabinet Division, saying that the NDMA chairman and officials of all other relevant departments would be invited to discuss the matter.",
  "retrievedAt": "2025-08-11T19:48:15.863Z"
}
