{
  "title": "Report launched to identify legislative gaps for ending violence against women",
  "link": "https://www.app.com.pk/national/report-launched-to-identify-legislative-gaps-for-ending-violence-against-women/",
  "date_published": "2020-09-15T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Women Development Department (WDD) Punjab, the Punjab Commission on the Status of Women (PCSW) and UN Women Pakistan on Tuesday launched a seminal report on ‘Gap Analysis of Legislation related to Ending Violence against Women (EVAW) in Punjab’.\nThe report was aimed at reviewing the existing provincial legal framework in the light of national and international obligations of Pakistan and provide a detailed analysis of the normative, implementation, monitoring and information gaps and propose forward looking recommendations, said a press release issued here.\nThe report has been designed and commissioned by UN Women Pakistan in partnership with WDD with the financial support of UK Aid.\nLaunched today the Gap Analysis of Legislation related to #EVAW in #Punjab Report aims to review existing provincial legal framework in light of national & intl obligations & provide a detailed analysis of normative & implementation gaps & propose forward looking recommendations. pic.twitter.com/5rwQ3bQlZN\n— UN Women Pakistan (@unwomen_pak) September 15, 2020\nThe virtual launch was chaired by the Provincial Minister for Women Development, Ashifa Riaz Fatyana, Secretary WDD, Ambreen Raza, government officials, representatives of civil society organizations, media, academia, and legal community.\nMinister Ashifa Riaz Fatyana said, “While we have many laws, the implementation of laws is critical to support women and girls in the province. The Motorway rape incident could have been avoided if there had been effective implementation of women protection laws and speedy dispensation of justice in such cases.\nI believe that the Police should be engaged through advocacy efforts as their sensitization and capacity building is a key to addressing such issues. All of us must continue to strive to introduce new and continue existing better initiatives for women in the province.”\nAmbreen Raza, Secretary WDD, said, “Gap Analysis Report will create a better understanding of the legislative framework to support the enactment and effective implementation of inclusive legislation in Punjab.”\nShe informed that seven normative, and eleven implementation laws in Punjab, and twelve normative, and seven implementation laws at the federal level that were applicable in Punjab had been reviewed and analyzed under this process. She termed the launch as a landmark achievement, saying that it would lead to further advocacy efforts for legislative amendments.\nJacqui Ketunuti, Deputy Country Representative UN Women Pakistan said, “An important aspect of our work in Pakistan and globally is to focus on the alignment of national laws and policies with international commitments, particularly the Convention on the Elimination of all Forms of Discrimination against Women (CEDAW), Beijing Platform of Action and the Sustainable Development Goals (SDGs). UN Women is committed to continue this work with government and other partners for developing and implementing long-term legislative initiatives for gender equality and women’s empowerment so that we can create an environment where girls and women can be free from all forms of violence.”",
  "retrievedAt": "2025-08-11T19:48:21.974Z"
}
