{
  "title": "EU ensuring basic healthcare services for women, newborns during COVID-19: Envoy",
  "link": "https://www.app.com.pk/national/eu-ensuring-basic-healthcare-services-for-women-newborns-during-covid-19-envoy/",
  "date_published": "2020-09-15T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): European Union (EU) Ambassador to Pakistan Androulla Kaminara Tuesday said the health of mothers and their newborns were at particular risk during the COVID-19 pandemic, especially in the areas of Sindh (Karachi East and Larkana) and Balochistan (Jafarabad).\nKeeping this in view the EU was ensuring that the mothers and the newborns continued to receive basic health services, including immunizations and nutrition treatments, in a safe environment, she said while talking to APP..\nThe EU, the envoy said, had mobilized five million Euro for UNICEF (United Nations Children’s Fund) to ensure availability of basic health care services for women and children in Sindh and Balochistan in response to the COVID-19 pandemic.\nThe support would be provided through the EU’s Civil Protection and Humanitarian Aid (ECHO) department and would reach over 1.25 million individuals in three districts in Sindh (Karachi East, Larkand) and Balochistan (Jafarabad), she added.\nAmbassador Kaminara said the EU was working to strengthen Pakistan’s primary healthcare system and improve resilience to emergencies and disasters.\nThe EU’s support would allow continuation of life-saving basic services and infection prevention and control measures, including increased access to water and sanitation, to mitigate the adverse impact of COVID-19.\nIn addition, she said, the frontline health workers would receive personal protective equipment to continue carrying out their duties. There would also be greater efforts for community mobilization & awareness, and to increase access to safe severe acute malnutrition treatment for young children in Sindh and Balochistan during the pandemic, she added.\nAndroulla Kaminara said the healthcare providers and frontline workers would also be trained to set up telemedicine services to increase coverage and access. They would also receive the critical psychosocial support they required during the challenging time.\nUNICEF Representative in Pakistan Ms Aida Girma eulogizing the EU and ECHO’s generous contribution to the humanitarian cause to combat the COVID-19 pandemic, said, “We are grateful to EU and ECHO for their supports in this difficult time.”\nShe said, “It will not only provide an impetus to our efforts but will also help Pakistan to counter the socio-economic impact of the pandemic, with a specific focus on the most vulnerable women and children.”\nUNICEF, she said, was working closely with the Government of Pakistan, leading the Risk Communication and Community Engagement, besides assisting the country in continuation of essential services, including immunization, education, nutrition, water, sanitation and hygiene, and procurement of PPE for the frontline health workers",
  "retrievedAt": "2025-08-11T19:48:20.245Z"
}
