{
  "title": "National Assembly passes federal budget 2020-21 having no new tax",
  "link": "https://www.app.com.pk/national/national-assembly-passes-federal-budget-2020-21-having-no-new-tax/",
  "date_published": "2020-06-28T23:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP):The National Assembly on Monday passed the tax free federal budget 2020-21 with majority vote having a total outlay of more than Rs 7,294.9 billion.\nMinister for Industries and Production Hammad Azhar moved the Finance Bill, 2020 to give effect to the financial proposals of the Federal Government for the year beginning on the first day of July, 2020 and to amend certain laws.\nThe House passed the Finance Bill, 2020 after voting along with amendments. The Prime Minister Imran Khan also attended the sitting and witnessed the process of passage of the bill.\nThe budget 2020-21 has total outlay of Rs 7,294.9 billion while the provincial share in federal taxes is estimated at Rs 2,873.7 billion during 2020-21.\nUnder the head of Health Affairs and Services, a total allocation of Rs 25,494 million has been made in the budget estimates 2020-21, which is higher by 130.55% from the budget estimates 2019-20. The allocation for Hospital Services forms the major component with amounting to Rs 22,774 million, which is 89.33% under this classification.\nThe estimated net revenue receipts for FY 2020-21 would be Rs 3,699.5 billion indicating an increase of 6.7% over the budget estimates of 2019-20.\nThe overall expenditure during 2020-21 has been estimated at Rs 7,294.9 billion, out of which the current expenditure is Rs 6,345 billion. The development expenditure outside PSDP has been estimated at Rs 70.0 billion in the budget 2020-21.\nThe size of Public Sector Development Programme (PSDP) for 2020-21 is Rs 1,324 billion. Out of this, Rs 676 billion has been allocated to provinces while Federal PSDP has been estimated at Rs 650 billion.\nIn the Federal PSDP, Rs 418.7 billion are allocated for Federal Ministries/Divisions, Rs 100.4 billion for Corporations, Rs 3 billion for Earthquake Reconstruction and Rehabilitation Authority (ERRA), and 7 billion for COVID response and other Natural Calamities Program.\nUnder the head of General Public Service, the major portion goes to executive and legislative organs, financial, fiscal and external affairs which stood at Rs 3,663,740 million.\nThe main heads of expenses are Superannuation Allowances & Pensions, Servicing of Foreign Debt, Foreign Loans Repayment Servicing of Domestic Debt and Others. Transfer payments constitute another important item.\nUnder the head of Public Order and Safety Affairs, an amount of Rs 169,927 million has been provided in the budget 2020-21 as compared to Rs 152,919 million in the budget estimates 2019-20 and Rs 153,269 million in revised estimates of the outgoing fiscal year 2019-20.\nThe allocation for Police (Rs 158,621 million) forms the major component, with a share of 93.35%, in the total allocation under this head.\nThe allocation under the head of Economic Affairs in the budget 2020-21 has been projected at Rs 71,751 million, as compared with Rs 84,167 million in the budget estimates 2019-20 and Rs 106,411 million in revised estimates 2019-20.\nMajor share of this head goes to Construction and Transport is 21.79% of total allocation for Economic Affairs.\nUnder the head of Environment Protection, an amount of Rs 431 million has been estimated in budget 2020-21 for Waste Water Management, which is lower by 8.3% than budget estimates 2019-20.\nUnder the head of Housing and Community Amenities, an amount of Rs 31,000 million has been provided in the budget 2020-21 for Housing Development as compared to Rs 31,000 million in the Budget 2020-21 as to Revised 2019-20 i.e Rs 252 million in revised estimates 2019-20.\nEducation Affairs and Services have been provided with Rs 83,363 million in the budget estimates 2020-21. The bulk of expenditure at Rs 70,741 million has been allocated for Tertiary Education Affairs and Services in budget 2020-21, which is 84.86% of the total allocation under this head.\nUnder the head of Social Protection, an amount of Rs 230,907 million has been allocated in the budget 2020-21, which is higher by 21.15 % as compared to the budget estimates 2019-20. The bulk of expenditure at Rs 208,258 million has been allocated for Social Protection (not elsewhere class) in budget 2020-21, which is 90.19% of the total allocation under this head.\nThe sales tax ratio has been reduced from existing 14 percent to 12 percent on point of sale to provide relief to common people and shopkeepers in wake of COVID-19.\nFederal Excise Duty on imported cigarettes and tobacco has been increased from 65 percent to 100 percent, while e-cigarettes and other substitutes of tobacco have also been included in this list.\nTo discourage consumption of caffeine based energy drinks, FED has been increased from 13 percent to 25 percent.\nGDP growth target has been set at 2.1 percent while current account deficit will be confined to 4.4 percent. The target has been set to bring down inflation rate from 9.1 percent to 6.5 percent and to enhance the foreign direct investment by 25 Sufficient resources have been earmarked for the CPEC-related projects including its western route. For this purpose, 118 billion rupees have been allocated.\nSimilarly, 24 billion rupees have been earmarked for ML-1 and other projects of Pakistan Railways and additional funds of thirty-seven billion rupees for other projects of communication sector.\nAn amount of Rs. 20 billion rupees have been allocated to improve the capacity of health institutions and production of health equipment with the aim to provide better health services and check diseases in the country.\nAn amount of Rs. 30 billion rupees have been allocated to bring innovation in higher education sector with the aim to improve research and development in subjects such as artificial intelligence, automation and space technology.\nBudgetary allocations for Higher Education Commission have been enhanced from existing 59 billion rupees to 64 billion rupees.\nBudget for Ehsaas Programme has been increased to 208 billion rupees from the existing 187 billion rupees. A sum of Rs. 30 billion has been provided for Naya Pakistan Housing Authority to provide low cost housing to the people.\nAn amount of 55 billion rupees have been allocated for Azad Kashmir and 32 billion rupees for Gilgit-Baltistan. A sum of 56 billion rupees has been allocated for merged districts of Khyber Pakhtunkhwa.\nSindh has been provided a special grant of nine billion rupees and Balochistan ten billion rupees, which is in addition to their share in NFC.\nA sum of 40 billion rupees has been specified for Pakistan Railways. Due to the economic crisis triggered by the coronavirus, civil servants’ pay and pension remained unchanged from the last year in the Budget 2020-21.",
  "retrievedAt": "2025-08-11T19:25:16.102Z"
}
