{
  "title": "AJK Presidents urges Turkey to play role of mediator in resolving Kashmir dispute",
  "link": "https://www.app.com.pk/national/ajk-presidents-urges-turkey-to-play-role-of-mediator-in-resolving-kashmir-dispute/",
  "date_published": "2020-06-29T00:09:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jun 29 (APP):Azad Jammu Kashmir President Sardar Masood Khan said on Monday that the people of Pakistan and Kashmir had reposed their full trust in the Turkish leadership who had recognized the Kashmir matter as not a bilateral one but as an issue between Pakistan, India and the people of Jammu and Kashmir.\n“We urge Turkey to play the role of a mediator in helping resolve this long-standing dispute”, the AJK president made these remarks while addressing the opening session of the two-day international conference on “Kashmir: Regional and International Dimensions” organized by Faculty of Letters, Istanbul University, AJK president’s office told media Monday evening.\nThe event was attended by Federal Minister for Information and Broadcasting Senator Shibli Faraz, Pakistan’s Ambassador to Turkey H.E Syrus Sajjad Qazi, Rector Istanbul University Prof. Dr. Mehmut AK, Member of Turkish Parliament and Chairman Turkey-Pakistan Parliamentary Friendship Group Mr. Ali Sahin, Lord Nazir Ahmed and Dr. Ghulam Nabi Fai.\nThe AJK president expressed his deepest gratitude to Turkish President Recep Tayyip Erdogan who in his address to the Pakistani Parliament, in 2017 and 2020, expressed strong solidarity with the people of Indian Occupied Jammu and Kashmir and advocated a diplomatic solution for ascertaining the Kashmiris’ right to self-determination.\nThe AJK president said people of Kashmir were indebted to President Erdogan for raising the Kashmir issue during last year’s United Nations General Assembly in which once again he reiterated a diplomatic resolution to the dispute and during which he sharply criticized India for the steps taken on 5th August that year.\nPeople of Turkey and Kashmir, maintained the Masood Khan, had a strong bond because after the devastating 2005 earthquake, Turkey helped rebuild three major AJK cities. “A deep Turkish imprint has been left on the hearts and minds of the Kashmir people”, he said.\nThe president was deeply moved by the comments of Mr. Ali Sahin who expressed his solidarity with the Kashmiri people by saying “Children of Srinagar are children of Ankara. Women of Kashmir Valley are the women of Anatolia. Tears of the Kashmiri mothers are the tears of Turkish mothers”.\nThe AJK president said the people of Jammu and Kashmir had been striving for their liberty and freedom for the past 200 years; first, during the despotic rule of the Maharaja of Kashmir and now after 1947, against India’s rule in the occupied territory. Since 1947, 500,000 Kashmiris had been killed, thousands of women had been raped, young men and women of all ages had been blinded, people were illegally detained in concentration camps, he said.\n“Since 1989, 100,000 have been killed and the killing continues as we speak today”, said President Masood.\nMasood Khan said last year on August 5 India invaded the reoccupied Kashmir and was now trying to turn it into a colony.\nHe added that India had divided the occupied territory into two parts – Jammu and Kashmir and Ladakh – and declared them Union territories, that too without the consent of its people. Furthermore, India had also issued fake maps showing Gilgit-Baltistan (GB) and AJK as part of the Indian Union, he lamented.\nOn 2nd April this year, he said, India under its colonial policy had introduced New Domicile Rules whereby the people had been disenfranchised and denied their right to permanent residence, to owning property, access to reserved education and employment quota.\n“In a matter of days, 25,000 non state Indians have been granted domiciles of Kashmir. The opening of these flood gates, such importation and immigration of Hindus from all over India and settling them in Kashmir to change the demographic composition of the occupied territory is akin to the model adopted in West Bank, Palestine”, he said.\nThe AJK president said India was now also threatening Pakistan with war through the use of nuclear weapons with threats of military action against AJK and GB. “There is also a rise of Islamophobia in India which also has a direct and indirect impact on Muslims majority IOJK”, he said.\nCommenting on the recent clash between India and China in Galwan Valley, the AJK president said this standoff had made the situation in IOJK more turbulent. China had objected to steps taken by India on August 5 and especially of making Ladakh a union territory, he said. “Because of the situation in Ladakh, Kashmir has been further internationalized”, he maintained.\nChina, said Masood, being a permanent member of the United Nations Security Council had helped Pakistan by facilitating the convening of three informal debates in the Council on Kashmir. There was also an indirect and implicit military alignment between Pakistan and China due to the threats of attack received to both these nations from India, he said.\n“Due to the egregious steps taken by India there is a serious risk of war which could escalate to a nuclear level. If there is such a war it would affect not only the countries in the region but, in one way or the other, the whole world.\nThere will be disease, death and destruction which could affect 2.5 billion people all over the world. There would be an economic recession and this war would be more dangerous than Covid-19”, he said.\nPresident Masood said another power-game had started in the Asia-Pacific region and on the line of actual control where attempts had been made to encircle China. In this situation, he said, the United States would give rhetorical help to India but it would not help it militarily against China despite the statements given by the United States Secretary of State Mike Pompeo.\n“China and India would eventually have to resort to diplomacy to defuse tensions”, he said.\nConcluding his remarks, the AJK president welcomed the UN Secretary General’s remarks on Kashmir and two reports on Kashmir published by the UN Office of the Human Rights Commission but said that these measures were not enough and more concrete steps have to be taken against India.\nHe said OIC member nations should initiate a Boycott, Divestment and Sanction movement against India. “Immediately, import of non-Halal meat and non-Halal products can be banned”, he said. He added that university to university relations between institutions in Turkey with those in Pakistan and AJK should be enhanced to help develop an academic discourse on conflict resolution.\nThe AJK president urged the Turkish leadership to explore prospects of humanitarian diplomacy in IOJK in the same manner they had successfully done in Somalia and the Philippines.\nHe said Pakistan would be ready to help but Turkey should not take India’s no as an answer and help the Kashmiris who are passing through the darkest hour of their history.\nMasood Khan thanked the Turkish people, media, political parties, academics and civil society for their continuing support to the Kashmir issue. He said that he had attended numerous conferences on Kashmir hosted by Turkish organizers like the seminal conference on “Kashmir Turmoil, Emerging Threats to Peace and the Role of International Community” co-organized by the Strategic Thinking Institute and Lahore Center for Peace Research.",
  "retrievedAt": "2025-08-11T19:25:13.052Z"
}
