{
  "title": "PTI members standing with ideology of Imran Khan: Qureshi",
  "link": "https://www.app.com.pk/national/pti-members-standing-with-ideology-of-imran-khan-qureshi/",
  "date_published": "2020-06-29T03:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP):Minister for Foreign Affairs Shah Mahmood Qureshi on Monday said that all the members of Pakistan Tehreek-e-Insaf expressed confidence on the policies of Prime Minister Imran Khan and stand with his ideology.\nSpeaking in the National Assembly, he said, “All the members of Pakistan Tehreek-e-Insaf and its allies are present in the Parliament. All the members of the PTI are standing with the ideology of Imran Khan.”\nHe said that Prime Minister Imran Khan will not resign as he was enjoying the confidence of the house. “People of the country have given mandate to Imran Khan and he will not resign on the demand of anyone,” he added.\nQureshi also disagreed with the demand of the opposition that Imran Khan should not take notice on any issue and said, “Imran Khan will take notice as he has come to take notice”.\nHe also informed the National Assembly that no COVID-19 positive members of the Parliament were invited to attend the proceedings of the house for the passage of the finance bill.\nResponding to a point raised by Pakistan Muslim League Nawaz Khawaja Asif that there were reports that COVID-19 members were invited in the parliament for the passage of finance bill, he said “I assure that no COVID-19 positive members had been invited in the Parliament, nor we are irresponsible that we invite such members.\nEvery year finance bill is presented in the house and we are following rules. We are thankful for the cooperation of opposition. We appreciate the Speaker and other members who chaired proceedings of the house.”\nHe said that the members of the opposition and the government have held discussions on the budget for more than the allotted time in the current situation.\nHe said that members from both sides of the divide were also allowed to hold discussion during cut motions. He said that the whole process was undertaken in good environment.\nPML-N MNA Khawaja Asif expressed grief and sorrow over the deaths in the terrorist attack on Pakistan Stock Exchange (PSX). He said that Pakistan Muslim League Nawaz through effective operation had eliminated terrorism from the country including Karachi.\nHe said that due to sacrifices of Pakistan armed forces, police and citizens of the country terrorism was eliminated from the country. “The whole nation was united against the terrorism and terrorists,” he added.",
  "retrievedAt": "2025-08-11T19:25:07.321Z"
}
