{
  "title": "National economy on growth trajectory due to prudent policies: Aliya",
  "link": "https://www.app.com.pk/national/national-economy-on-growth-trajectory-due-to-prudent-policies-aliya/",
  "date_published": "2022-01-12T13:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP): PTI Member National Assembly (MNA) Aliya Hamza Wednesday said the national economy was on the growth trajectory due to prudent economic policies introduced by the government.\nParticipating in the National Assembly debate on Finance (Supplementary) Bill-2021, she said the country’s economy made a significant progress that was evident from the fact that the listed business gained 59 percent profit despite economic slowdown caused by the coronavirus pandemic.\nShe said the country’s Gross Domestic Product (GDP) growth rate stood at 3.98 percent in the last fiscal year, and the Pakistan Tehreek-i-Insaf (PTI) government was confident of achieving the 5 percent GDP growth rate this year.\nContrary to it, Aliya said the growth rate of India, United Kingdom, United States of America and Iran remained in minus ranging from -3.7 percent to -10 percent.\nShe said Pakistan Stock Market posted record profit of Rs 250 billion and debt-to-GDP ratio was coming down gradually; and its all credit went to the visionary leadership of Prime Minister Imran Khan who saved the country from economic collapse.\nShe said all economic indicators including exports, revenue collection, remittances, industrial growth, and agriculture growth were moving in the right direction.\nThe MNA said today the overall foreign exchange reserves of the country stood at over $ 24.2 billion out of which $ 17.85 billion were held by the State Bank of Pakistan (SBP), while during last months of Pakistan Muslim League-Nawaz government, the Central Bank’s reserves were $7 billion.\nShe said output of the petroleum products witnessed an increase of 7.33 percent in the first four months of the current fiscal year, which was also another proof of the economic growth taking place in the country.\nIn the first 8-9 months of the year 2021, she said the Pakistan Tehreek-i-Insaf (PTI) government provided funds amounting to Rs 38 billion under the ‘Mera Ghar Scheme’ that gave a boom to the housing sector, with which almost 120 industries were attached.\nShe said the supplementary finance bill was meant to document the national economy and amend certain laws relating to taxes and duties.\nAliya said the government launched the Roshan Digital Account to facilitate overseas Pakistan, who were sending billions of dollars remittances using this channel.\nShe said during the last three years of the PTI government, around 160,000 new companies had been registered that showed investors’ confidence in the government policies, adding the real estate sector witnessed the growth of 494 percent, Information Technology 194 percent and Tourism 136 percent.\nTaking part in the debate, Chairman of Balochistan National Party (BNP) Akhtar Mengal said ending tax exemption on the items used by the common man was not justified as the downtrodden segments of the society were already facing financial hardships.\nHe said it would trigger a new wave of inflation and unemployment, and definitely the general public would suffer.\nHe regretted the loss of precious lives in the Murree snowfall tragedy and underlined the need for taking appropriate measures to avoid such incidents in future.\nHighlighting the plight of people of Balochistan and lack of essential facilities there, he drew the government’s due attention towards mitigating sufferings of the people of Balochistan.\nHe was of the view that resources of Balochistan province should be utilized for the welfare of its people on priority.\nKhawaja Asif of the PML-N said that his party was committed to safeguard constitution and work for the supremacy of the parliament.\nEndorsing the stance of Akhtar Mangal, he said, the resources of Balochistan must be utilized for the people of the province. “People of erstwhile FATA should be given their due rights at par with other parts of the country,” he added.\nHe was of the view that withdrawal of taxes in the finance supplementary bill 2021 would put more burdens on the common people.\nMuttahida Qaumi Movement Pakistan (MQMP) MNA Salahuddin said that his party supported the Pakistan Tehree-e-Insaf in difficult times.\nHe said that MQMP had supported the government in the passage of federal budget and senate elections, but it did not take his party into confidence on important issues confronting the country.\nAbdul Qadir Patel of Pakistan Peoples Party criticized the government for presenting the supplementary bill and said it would bring negative impact on the life of common people.He also recounted his government achievements in Sindh province and said the PPP always worked for the welfare of the people.\nPTI MNA Kanwal Shauzab said “We took measures to improve the economy,”. “When they (PML-N) left the government in 2018, the country was on the verge of bankruptcy, and it was her party that took corrective measures to save the economy from downfall.”\nShe rejected the opposition’s stance that the new taxes in the money bill would have inflationary pressures for the masses, saying: “These taxes are adjustable and the majority of them will not impact the masses. It will mainly help in documentation of the national economy.”\nShe said that PML-N and PPP had destroyed all the institutions of the +country, and declared the PML-N an enemy of the farmers saying during the tenure of PML-N government the financial health of the farmers was in bade shape.\nMuhammad Jamal Ud Din of Muttahida Majlis-e-Amal Pakistan asked the government to fulfill the promises made during the election 2018 campaign.\nSyed Khursheed Ahmed Shah of PPP asked the Pakistan Tehreek-e-Insaf government to take due care the common people and help ease their financial hardships.\nHe also invited the leadership of the MQMP to work for the welfare of people living in Sindh province. He said the PPP government was providing best health facilities to its people.\nPML-N’s Ahsan Iqbal Chaudhary criticized the government’s economic measures and reminded that it while passing the federal budget 2021-22 had assured that there would be no mini budget, but it presented the Finance Supplementary Bill 2021.\nHe said that the government had missed all the economic targets.Later, Nasiba Channa of PPP pointed out that lack of quorum that led to adjournment of the House proceeding till Thursday 4pm.",
  "retrievedAt": "2025-08-11T14:05:32.741Z"
}
