{
  "title": "President upholds a decision, advises NBP to pay Rs500,000 to bank fraud victim",
  "link": "https://www.app.com.pk/national/president-upholds-a-decision-advises-nbp-to-pay-rs500000-to-bank-fraud-victim/",
  "date_published": "2022-01-12T09:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD Jan 12 (APP): President Dr Arif Alvi while upholding a decision of the Banking Mohtasib advised the National Bank of Pakistan (NBP) to pay PKR 500,000 to a citizen who had been the victim of bank fraud at the hands of a former branch manager.\nThe president ordered that the bank must return the lost money to the victim and expressed dismay that the bank refused to own up to its responsibilities when a fraud had been committed by the employees of the bank against its customers.\nMuhammad Abdul Rasheed (the complainant), a resident of Faisalabad, had opened a bank account with the Hassan Road Branch, Jaranwala, and had handed over cash of Rs 500,000 to the then manager, Akhtar Hussain, who gave the complainant a duly signed and stamped deposit slip.\nLater, upon visiting the branch to get his cheque book, the complainant came to know that an internal fraud had been committed by the then branch manager and he was one of the many victims of bank fraud and his money had not been deposited in his account by the manager.\nA total of 56 affected accountholders submitted their claims to the bank amounting to Rs 98.018 million for refunding of their defrauded amounts.\nAbdul Rasheed also approached the bank to receive his claim but was not provided any relief.\nSubsequently, he sought the assistance of the Banking Mohtasib to retrieve his lost amount who ordered that the bank pay the complainant his lost money. The NBP then filed representation with the President against the decision of the Mohtasib.\nPresident Dr Arif Alvi rejected the representation of the bank on the grounds that the deposit slip carrying the manager’s signature and stamp constituted a valid receipt and bound the bank to honour it.\nHe upheld Mohtasib’s observation that although the bank manager had been dismissed by the bank and FIA was investigating the matter, the proceedings of the Mohtasib were of civil nature and were independent of any criminal prosecution by the FIA.\nHe further noted that the complainant was dealing with the authorized agent of the bank who was not only in active service of the bank as the branch manager but had received the cash during banking hours within the premises of the bank against a valid deposit slip.\nWhile terming the act of the ex-manager an act of maladministration and malpractice, the president further observed that the perusal of the relevant sections of the Federal Ombudsmen Institutional Reforms Act, 2013 showed that in matters falling within the jurisdiction of the banking mohtasib, the jurisdiction of other courts or authorities was excluded.\nHe wrote that the bank was given ample opportunity to refute the claim of the complainant and it failed to discharge the burden and statutory liability cast upon it under the law.\nSince no justification has been made to upset the original order of the Mohtasib, therefore, the representation of the bank was devoid of any merit and deserved to be rejected, he ordered.",
  "retrievedAt": "2025-08-11T14:05:42.518Z"
}
