{
  "article_id": "2025-03-17_2e9a1dacb8e1fadde616a67ab95e1aad",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-boost-exports-to-60-bln-in-5-years-jam-kamal/",
    "retrieved_at": "2025-08-27T13:46:17.042Z"
  },
  "metadata": {
    "title": "Pakistan to boost exports to $60 Bln in 5 years: Jam Kamal",
    "author": null,
    "date_published": "2025-03-17T15:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 627,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 17 (APP):The National Assembly was informed on Monday that a comprehensive plan has been devised to increase Pakistan's exports to $60 billion within the next five years. The Minister for Commerce, Jam Kamal Khan, highlighted that the Ministry of Commerce, along with other government departments, is working to enhance exports and reduce the trade deficit. A significant achievement in this regard is the restoration of rice exports to Bangladesh, with plans to increase the volume from 60,000 tons to 200,000 tons. During the National Assembly's question hour, in response to a query from Sahar Kamran, Minister Jam Kamal Khan acknowledged the existing trade deficit and emphasized efforts to boost exports to address this gap. He pointed out key challenges, including limited value addition, lack of technology, restricted market access, and underutilization of trade agreements such as GSP Plus and access to U.S. markets. He noted that while Pakistan has struggled to achieve surplus exports in recent years, steps are being taken to bridge the gap between imports and exports. The Minister stated that the Ministry of Commerce, in collaboration with the Ministry of Industries and Production, has been working to reduce business costs and promote manufacturing, trade diplomacy, and value addition. He added that tariff reforms and policy adjustments are being implemented to support exporters. Responding to a question from Syed Rafiullah, the Minister reiterated that increasing exports and reducing the trade deficit is a collective effort involving multiple government agencies. The Ministry of Energy is working on lowering production costs, the Ministry of Power is addressing power allocation and pricing structures, while the Ministries of National Food Security, Science and Technology, and Ports and Shipping are focusing on their respective domains to facilitate trade. The Federal Board of Revenue (FBR) has been tasked with addressing tax-related barriers to exports. He emphasized that reducing inflation and policy rates would further support export growth. The Minister also highlighted positive trends in textile, food, leather, and surgical exports. Additionally, Pakistan is reviewing trade agreements and removing tariff barriers to strengthen its international trade position. Addressing a supplementary question from Dr. Shazia Sobia, the Minister noted that efforts are underway to expand meat exports to Indonesia, Malaysia, and the European Union. He reaffirmed Pakistan's status as a major rice exporter, competing with India in global markets. Despite Indian rice prices being 20% lower, Pakistan has maintained its market presence, and the resumption of rice exports to Bangladesh is a major success. The Minister also discussed efforts to boost horticulture exports, facilitate linkages between Pakistani growers and foreign markets, and enhance domestic agricultural productivity. He mentioned that in 2024, an international agricultural expo was held in Pakistan, attracting 15 companies from South Korea to engage with local farmers and traders. Regarding Pakistan-Iran gas pipeline concerns raised by Tahira Aurangzeb, the Minister clarified that while Iran has built part of the pipeline, construction on the Pakistani side has yet to commence due to international sanctions. He also noted that 65% of Pakistan's exports are directed toward Europe and the U.S., and all trade policies are devised considering geopolitical realities. On a question about U.S. trade restrictions, the Minister assured that Pakistan faces no trade bans from the U.S. Answering a query from Anjum Aqeel, he discussed Pakistan's growing meat production and domestic consumption, emphasizing the need to promote cattle farming to exceed $1 billion in meat exports. Negotiations are ongoing with companies in Central Asia and the Middle East, and Pakistan is working towards meeting Malaysia's stringent halal certification standards. The Minister also addressed concerns about the fishing industry, stating that Pakistan's vast coastline and marine resources have been underutilized. A strategic plan has been developed to boost seafood exports, which will be presented to the Prime Minister for approval.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}