{
  "article_id": "2025-03-17_627fafacc62d0e6005e43f0f9c29ca4d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nab-again-informs-public-several-references-filed-against-bahria-town-owner/",
    "retrieved_at": "2025-08-27T13:46:49.064Z"
  },
  "metadata": {
    "title": "NAB again informs public several references filed against Bahria Town owner",
    "author": null,
    "date_published": "2025-03-17T10:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 368,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 17 (APP): The National Accountability Bureau (NAB), in its mandate as a national accountability institution, fulfilling its responsibilities, once again informs the public that several cases of fraud and deception against Malik Riaz Ahmed, owner of Bahria Town, and others are currently under investigation. Furthermore, NAB has filed several references against these accused persons in the Accountability Courts of Islamabad and Karachi, and these courts have summoned all the accused, said a press release issued here on Monday. In these cases, there are allegations and irrefutable evidence against Malik Riaz Ahmed and his associates for illegally occupying not only government but also private land in the name of Bahria Town in Karachi, Takht Pari Rawalpindi, and New Murree, establishing housing societies without permission, and defrauding people of billions of rupees. In recent actions related to this, numerous commercial and residential properties of Bahria Town in Karachi, Lahore, Takht Pari, New Murree/Golf City, and Islamabad have been sealed, including multi-story commercial buildings. Additionally, hundreds of bank accounts and vehicles of Bahria Town have been frozen, and further actions in this regard are being carried out rapidly. NAB will continue its legal actions against Bahria Town Pakistan without any delay or pressure to fully protect the rights of the citizens of Pakistan. Malik Riaz Ahmed, who is currently residing in Dubai as a court absconder in the NCA case, has recently launched a new project of construction of luxury apartments there. NAB has prima facie evidence that certain individuals from Pakistan are criminally aiding Malik Riaz Ahmed in this process by transferring their money to Dubai for investment in this project. Since NAB has also strong evidence of money laundering against Malik Riaz Ahmed and his associates, these funds have been sent to foreign countries through illegal means.Any funds transferred from Pakistan for this project will be considered money laundering, and legal action will be taken against the involved elements without discrimination. The NAB again advised public to avoid any attractive inducements from Bahria Town to protect their hard-earned savings. NAB, in collaboration with other government agencies, has initiated vigorous efforts to bring back the fugitive accused to Pakistan so that such individuals can be brought to justice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}