{
  "title": "Entire power system fully restored in wee hours: Khurram",
  "link": "https://www.app.com.pk/national/entire-power-system-fully-restored-in-wee-hours-khurram/",
  "date_published": "2023-01-24T06:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): Minister for Power Division Engineer Khurram Dastgir on Tuesday said that the entire power system was fully restored at 5.14 am across the country.\nAddressing a press conference here, the minister said despite restoring the system, there would be a shortage of electricity for the next two days as the nuclear power plants required 48-72 hours to start supplying electricity to the system. Similarly, the coal power plants required around 48 hours for synchronization, he said.\nHe said yesterday one unit of each Sahiwal and Engro Coal Power plant has also started work. There would be a shortage of electricity for the next 48 hours and limited power load-shedding would be carried out, he added.\nHowever, he made it clear that industrial consumers would be exempted from the power load-shedding as per the policy of the incumbent government.\nKhurram Dastgir said yesterday there was a “delay in synchronization between Tarbela and Mangla power plants but with the support of the Power Division, WAPDA and Water Resource Ministry, they fixed the technical problem after which power systems across the country were restored.\nHe said the entire transmission system remained safe and no incident of any damage was reported during yesterday’s country-wide power breakdown.\nWhile dispelling the rumors about the shortage of fuel, he categorically said that there was no fuel shortage in the country. Sufficient fuel was available in the country and it was used to restore the power system, he added.The minister said, “We are considerate of the electricity bills people have to pay and try not to unnecessarily use power plants that require a lot of energy.”\nHe said, in January, there was the lowest power demand in the country and on Monday night it stood at 8615 MW.\nDespite the extensive breakdown, there were some areas in the federal capital and Peshawar where the electricity remained available all the time, he said, adding that similarly, there was no disruption in power in the flood-hit areas of Sindh and Balochistan.\nKhurram Dastgir said the Prime Minister has set up three-member under the headship of the minister of state for Petroleum Division Dr. Musadik Malik to probe the incident.\nHe said the government suspected foreign intervention such as hacking of systems. “But its chances are very less. There have been incidents previously and we have to rule out this thing,” he added.\nTo a question, he said no investment was made in the transmission and generation system during the last four years by the PTI government. The PTI government did not work for the up-gradation of the transmission system as per the increasing demand, he added.\nA few months ago, some parts of the country witnessed limited power breakdown due to the installation of 20 years old conductors in sensitive power plants during the PTI government tenure.\nHe said HVDC Matiari-Lahore Transmission Line which was completed under China Pakistan Economic Corridor (CPEC) has only some protective mechanisms. They were working to bring innovation to ensure safety mechanisms in the transmission system, he added.\nReplying to another question, he said that the power supply has also been restored to Quetta Electric Supply Company and only routine load-shedding was being carried out. Nuclear power plants at Karachi and Chashma have not yet started work and it would take 48-72 hours, he added.\nThe minister said the incumbent coalition government laid the foundation for many grid stations and transmission systems worth Rs 80 billion in the last few months.\nThe PM would lay a foundation of a mega grid station in Mansehra in the next few weeks which would ensure smooth transmission of electricity generated through Diamer Basha and other such mega projects. He said these new grid stations were part of the expansion plan but unfortunately the past government did nothing in this regard.\nThe minister said the country’s infrastructure including road network, ports, power generation and transmission was indebted to Pakistan Muslim League (PML-N) led by former prime minister Muhammad Nawaz Sharif. The foundation of nuclear power plants K-2 and K-3 in Karachi and HVDC Matiari-Lahore Transmission Line was laid by Nawaz Sharif, he added.\nTo a query, the minister said NTDC has the latest water cannon to clean conductors installed at various transmission lines.",
  "retrievedAt": "2025-08-11T05:48:45.670Z"
}
