{
  "title": "President urges expatriates to highlight Pakistan’s viewpoint on important issues",
  "link": "https://www.app.com.pk/national/president-urges-expatriates-to-highlight-pakistans-viewpoint-on-important-issues/",
  "date_published": "2023-01-24T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): President Dr Arif Alvi on Tuesday called upon the Pakistani Diaspora around the world to make efforts personally and collectively to project Pakistan’s viewpoint on important issues and promote the country’s cherished cultural and social values.\nThey should also highlight sacrifices rendered by Pakistan in defeating global terrorism in region and hosting more than 40 million Afghan Refugees for 40 years, and atrocities, intimidation and victimization carried out by the Indian Occupation Forces in India’s Illegally Occupied Jammu and Kashmir (IIOJK).\nThe President expressed these views during a meeting with a delegation of Helping Hearts, Caring Souls and the American Pakistani Public Affairs Committee (APPAC) here at the Aiwan-e-Sadr.\nHe said that advocacy organizations of the Pakistani Diaspora should use electronic means and IT-based interventions to communicate with politicians, opinion makers and the media of their host countries with full confidence and pride for creating acceptability of country’s viewpoint on national, regional and international issues and to build positive opinion about Pakistan and its people.\nThe President said that Pakistan had many strengths. “It has resilient, vibrant, hardworking human resources, it believes in resolving all matters, challenges and issues through democratic means of negotiations, consultations and deliberations. It has its own problems and issues like any other country of the world, therefore, there is no need to be apologetic while projecting Pakistan’s point of view around the world”, he added.\nHe said that Pakistan showed exemplary hospitality to 40 million Afghan refugees for more than 40 years mostly out of its own resources.  On the contrary, western countries spent billions of dollars to prevent immigrants from entering their countries, and observe visible discrimination for accepting the refugees from Ukraine whereas refugees from other countries are heartlessly allowed to drown in the sea.\nThe President said that those countries who try to teach them the lesson of morality needed to review their own conduct whereby propagating false and fake information and narrative, they destroyed many countries and societies around the world, made millions of people shelter less, killed many innocent citizens as collateral damage, reduced many flourishing societies to poverty and created millions of refugees.\nHe said that Pakistan had spent a lot of resources to educate the Pakistani Diaspora and suffered the consequences of brain drain due to their migration to other countries, which deprived the country of intellect, knowledge and expertise, which was direly needed for progress and development of country.\nThe President called upon the Pakistani Diaspora to pay back to the country by transferring their intellect, knowledge and expertise physically or through the online and hybrid ways of communication to improve upon the business processes, bringing innovations, new ideas and technologies for accelerated progress and development of the country.\nHe also advised the Pakistani Diaspora to transfer their savings and remittances through proper banking channels to their relatives, for donations to charitable organizations and making donations to the political parties of their choice.",
  "retrievedAt": "2025-08-11T05:48:52.554Z"
}
