{
  "title": "Cabinet directs strategy to prevent recurrence of power outages; approves nationwide energy conservation drive",
  "link": "https://www.app.com.pk/national/cabinet-directs-strategy-to-prevent-recurrence-of-power-outages-approves-energy-nationwide-conservation-drive/",
  "date_published": "2023-01-24T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP):The federal cabinet on Tuesday ordered the authorities concerned for formulation of a comprehensive strategy to prevent the recurrence of prolonged power outages in the future and to do away with the factors causing it.\nThe cabinet, in a meeting chaired by Prime Minister Shehbaz Sharif, also approved a nationwide public awareness drive on conservation of power, water, gas and other resources to make the people develop such habits.\nThe meeting also called for inclusion of the subject of best international practices on energy conservation in the educational curriculum.\nIt was told that energy conservation efforts at public, private, domestic and commercial level would help reduce the import bill of the petroleum products which had increased remarkably during last seven years.\nBesides, the behavioral changes would also save billions of rupeess of foreign exchange and reduce the electricity bills of individuals by 30 to 40 percent.\nThe prime minister, expressing annoyance over the widespread power breakdown on Monday, said the inconvenience caused to the people was unacceptable and would not tolerate such happenings in the future.\nHe called for fixing the responsibility of the power outage which had caused difficulties for the masses as well as the business community. He also instructed to identify the factors behind the power breakdown and take necessary measures to prevent its recurrence.\nThe cabinet meeting was told that committee formed by the prime minister in the power outage had started functioning which would furnish a comprehensive report after deliberating over all the factors.\nThe energy minister told the meeting that, as per initial report, the power supply tripped at 0734 hours on Monday, due to technical fault, voltage fluctuation and frequency disruption.\nIt was told that as per prime minister’s directives, all-out resources were used and power supply was restored in all main cities by 2200 hours.\nMoreover, all major 1112 grid stations were also restored by 0500 hours on Tuesday morning to ensure power supply to the consumers.\nOn the prime minister’s directives, the gas-powered power plants have also been made operational to overcome the energy shortfall caused by the breakdown. However, the operations of nuclear and coal power plants would take another couple of days, though the power generation from rest of the power plants was in progress.\nFederal Minister for Information and Broadcasting Marriyum Aurangzeb gave a detailed briefing to the cabinet on National Awareness and Communication Strategy for Energy Conservation under which a long-term awareness drive would be launched.\nShe told the meeting that, prior to the drive, the information ministry carried out the first comprehensive survey to seek public opinion on the energy conservation. Considering the public behaviour, the ministry prepared an awareness drive which would focus on developing people’s habits, lifestyle and bahaviour for energy conservation.\nThe ministry would also seek the support from print, electronic and social media as well as the public opinion makers and experts for the awareness drive which would be run in collaboration with the public and private institutions.\nThe awareness drive is aimed at guiding the citizens on energy conservation which would not only benefit them in person but also help reduce the economic burden from the country.\nThe meeting was told that due to import of the petroleum products, the country’s import bill swelled from 18% in 2017 to 29% in 2022.\nThe federal cabinet appreciated and approved the information ministry’s awareness drive and instructed for its early launch, also asking other ministries to extend their support.\nThe prime minister directed for taking the caretaker governments of Punjab and Khyber Pakhtunkhwa into confidence on the energy conservation plans to ensure their effective implementation.\nA comprehensive report of the inter-ministerial committee on Toshakhana was presented to the cabinet, besides a draft of the new Toshakhana policy. The cabinet members put forward their suggestions on committee’s recommendations as well as the draft policy.\nThe prime minister asked the inter-ministerial committee to re-submit its report in the next cabinet meeting after incorporating the members’ suggestions.\nThe cabinet meeting also endorsed the Economic Coordination Committee’s decisions taken in its meetings of January 3 and 11, 2023, as well as Cabinet Committee for Disposal of Legislative Cases’s decisions taken on January 6, 2023.",
  "retrievedAt": "2025-08-11T05:48:24.354Z"
}
