{
  "title": "With a dead PDM, what’s next?",
  "link": "https://www.app.com.pk/national/with-a-dead-pdm-whats-next/",
  "date_published": "2021-03-23T16:45:00.000Z",
  "source": "APP",
  "content": "The eleven-party alliance – PDM that repeatedly boasted ousting of the PTI government for the past six months seems to have met its imminent fate as the gulf between key allies – PPP and PML-N widens, rendering the grouping ineffective.\nThe Pakistan Democratic Movement,  comprising six parties with no seats in the parliament, was set up in September, with a common objective of removing Prime Minister Imran Khan from power.\nHowever, the mutual hatred for Imran Khan and his stance of not yielding to their blackmailing on corruption was not strong enough to keep them away from pursuing their own divergent goals, particularly in the presence of a strong mistrust of each other.\nSerious differences between the key allies  – Pakistan Peoples Party and the Pakistan Muslim League – Nawaz widened during the recent elections for the Senate, where their mutual mistrust and “back-stabbing” led to the success of rival PTI candidates for the seats of Chairman and Deputy Chairman.\nTalking to the press after meeting the leader of Jamat-e-Islami Siraj-ul-Haq at Mansoora, Chairman Pakistan Peoples Party Bilawal Bhutto Zardari on Monday rubbished assertions levelled against him by Maryam Nawaz Sharif that he was being prepared as an alternative and as the next “selected”.\n“If someone is levelling an allegation against me that we are ready to be selected, then [understand] we do not have such a system of being selected in our veins … [however] there is another political family from Lahore, whose past shows this to be true for them.”\nA day after the faux pas at a PDM meeting in Islamabad where the announcement for postponement of the long march was made, Maryam Nawaz Sharif, in a tweet taunted the PPP Chairman Bilawal Bhutto.\nRead Also: PDM postpones long march\nMaryam’s frustration over the refusal of the Pakistan Peoples Party to tender resignations from the assemblies and the snub by Asif Ali Zardari to the absconding PML-N leader Nawaz Sharif to return to the country to personally lead his party seems to have been the final stroke for the fragile grouping to fall apart.\n“The one who should be really worried is the Selected bcoz [becuase] he is being seen as a ‘spent force’ & his substitute is being fostered.”\nNo rough day at all particularly when you know what’s happening & why. Tbh,the one who should be really worried is the Selected bcoz he is being seen as a ‘spent force’ & his substitute is being fostered. Btw, I am not liking the tweet but responding directly  @CherieDamour_ https://t.co/P4adReJD9Q\n— Maryam Nawaz Sharif (@MaryamNSharif) March 17, 2021\nBilawal said his party has always spoken about democracy, the law and the constitution. To another question, Bilawal said PDM’s long march should not have been delayed as his party was making preparations for it and even had got the rooms booked.\n“But who gave the idea of linking the resignations to the long march ten days before the Islamabad march?” he questioned. He also stood his grounds that the PPP would field its own candidate for the leader of the opposition, having the largest number of seats in the upper house, in a clear snub to Maryam.\nBut apart from the PPP – PML-N differences, serious rifts have also widened within the PML-N over the way Maryam Nawaz is handling the affairs and sidelining senior party leaders. Despite efforts to hush up differences within the party; especially with the PML-N President Shahbaz Sharif and Hamza Sharif continue to surface – the recent being the leaked video conference of the House of Sharifs, who wanted to use other PDM parties for their political gains.\n⁦@ARYNEWSOFFICIAL⁩ یہ دیکھیں حمزہ اور مریم لڑ رہے pic.twitter.com/lnGY21LGmc\n— Maryam Nawaz Sharif (@MaryamNSharif) March 21, 2021\nPML-N insiders admit a wide gulf between the approach of Shahbaz Sharif and Maryam Nawaz Sharif in moving ahead. The differences reflected in the dismal PDM show at Lahore, where reportedly the faction supporting Shahbaz Sharif stayed away from Maryam’s rally, shattering her dream of ousting the PTI government, within days.\nThe PMN-N, which publicly blames the “establishment” for every imaginable ill, however, has been in touch with it to get some concessions and to wiggle out, from the ongoing cases of corruption. The ISPR earlier said former Governor Sindh Zubair had twice contacted the Chief of Army Staff.\nBoth the meetings were held at Mr Zubair’s request and “In those meetings, he [Mr Zubair] talked about Mr Nawaz Sharif and Ms Maryam Nawaz,” director-general of Inter-Services Public Relations (ISPR) Major General Babar Iftikhar told a TV talk show in Sept 2020.\nDespite back-channel meetings, the rhetoric against the army and other state institutions by the father-daughter duo has offended many a leader of the party, forcing them to either distance themselves, or take a back seat. Also, the recent anti-state assertions by Javed Latif on the pretext of alleged threats to the life of Mariam Nawaz provided the Indian media necessary material to build on its narrative.\nMaulana Fazal ur Rehman, one of the few allies still with the PML-N, and Maryam Nawaz made an abortive attempt to twist the statement of the Chief of Army Staff General Qamar Javed Bajwa on “putting own house in order” at the Islamabad Strategic Dialogue and tried to equate it with the Dawn Leaks.\nLIVE #APPNews : Chief of Army Staff General Qamar Javed Bajwa addressing Islamabad Security Dialogue. #IslamabadDialogue @OfficialDGISPR https://t.co/BBYlShLNLl\n— APP  (@appcsocialmedia) March 18, 2021\nHowever, the later investigations revealed that it was in fact a deliberate attempt to target and isolate the military leadership. Whereas now Prime Minister Imran Khan and the Chief of Army Staff spoke openly about the challenges and the way ahead.\nThe stance by the leadership shows no compromise on Kashmir, rather any progress with India has been linked with a comprehensive solution to the lingering Kashmir dispute.\nSecurity experts believe that Pakistan has thrown the ball into India’s court and with the changing geo-strategic environment in the region and prospects for peace in Afghanistan and South Asia, there was a window of opportunity for economic development and peace in the region.\nWith the tightening of noose against the corrupt, a desperate PML-N leadership seems to break all hell loose to avoid letting the law of the land take its course.\nڈرتے ہیں NAB والے ایک نہتی لڑکی سے! اسی نہتی لڑکی سے جس پر NAB نے قاتلانہ حملہ کیا۔ اور جو سلوک NAB نے دورانِ حراست مریم سے رکھا، اس کی تفصیل اور حساب ابھی باقی ہے۔ سب آئے گا قوم کے سامنے، ناموں سمیت۔ انشاءاللّہ! pic.twitter.com/WzKRkpXO8c\n— Maryam Nawaz Sharif (@MaryamNSharif) March 22, 2021\nIn a tweet, she said the National Accountability Bureau seemed to be terrified of an “unarmed girl”. The same unarmed girl during her last appearance before the NAB had the support of her workers carrying bags full of stones to pelt at the building, in a bid to coerce the investigators.\nHowever, this time around Maulana Fazalur Rehman has extended the support of his specially trained para-military type of workers as Maryam lacks the street power of the PML-N, as she is summoned to respond to the queries of her investigators on March 26.\nFazl says \"hundreds of thousands\" of PDM workers and leaders will accompany Maryam during her appearance before NAB on March 26 https://t.co/kts0P9XTAn\n— Dawn.com (@dawn_com) March 21, 2021\nKeeping in view Maulana’s power of using young students of seminaries and the intention of creating a law and order situation, the NAB has requested the district administration to declare its premises a “red zone” and sought additional security for protection.\nPrime Minister Imran Khan is on record to urge the NAB and the Courts to speed up the process of accountability and to take the corrupt to the task.\n-Report Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:32:10.996Z"
}
