{
  "title": "Flag hoisting ceremony held at Pakistan Embassy in Brussels to commemorate national day",
  "link": "https://www.app.com.pk/national/flag-hoisting-ceremony-held-at-pakistan-embassy-in-brussels-to-commemorate-national-day/",
  "date_published": "2021-03-23T15:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP): A Flag hoisting ceremony was held at the Embassy of Pakistan, Brussels to commemorate the National Day of Pakistan on Tuesday.\nAmbassador of Pakistan to the European Union, Belgium and Luxembourg Zaheer A. Janjua hoisted the national flag at the Chancery building. The messages of President Dr. Arif Alvi and Prime Minister Imran Khan were read out on the occasion.\nThe President and Prime Minister of Pakistan in their respective messages congratulated the nation and paid tributes to the dynamic and visionary leadership of Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal.\nThey reaffirmed their commitment to make tireless efforts to realize the vision of the founding fathers to make Pakistan a social welfare state on the model of Riyasat-e-Madina. The leaders also expressed solidarity with the people of Indian Illegally Occupied Jammu & Kashmir (IIOJ&K) and reiterated their resolve to extend all possible political, diplomatic and moral support to the Kashmiri brethren in their just struggle for the UN guaranteed right to self-determination.\nIn his message, Ambassador Janjua paid homage to the historic struggle of the Muslims of the Sub-Continent for an independent homeland, where they could live their lives with complete religious, cultural and social freedoms.\nHe stressed the importance of the vision of Poet-Philosopher, Allama Muhammad Iqbal and ideals of Quaid-e-Azam, Mohammad Ali Jinnah, who envisaged Pakistan to be a progressive, moderate and democratic country.\nAppreciating the important role of overseas Pakistanis in the development of Pakistan, Ambassador Janjua highlighted the steps taken by the government to address their issues.\nHe encouraged the Pakistani diaspora in Belgium and Luxembourg to continue to play their role in the development and prosperity of Pakistan. He emphasized that “on this important day, we should not forget our Kashmiri brothers and sisters who continue to brave the illegal Indian occupation.”\nHe said that Pakistan stands firmly with its Kashmiri brethren in their just struggle against illegal occupation by India. In line with the host government’s COVID-19 Pandemic related guidelines, the ceremony was restricted and attended by the Embassy officials.",
  "retrievedAt": "2025-08-11T20:32:10.980Z"
}
