{
  "title": "Sindh Governor, CM visit Mazar-e-Quaid",
  "link": "https://www.app.com.pk/national/sindh-governor-cm-visit-mazar-e-quaid/",
  "date_published": "2021-03-23T14:55:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 23 (APP):Sindh Governor Imran Ismael and Chief Minister Murad Ali Shah on Tuesday visited the Mazar-e-Quaid to pay homage to the Father of the Nation Quaid-e-Azam Muhammad Ali Jinnah on Pakistan Day.\nThey laid wreaths on the Mazar, offered Fateha, and prayed for the prosperity, development and integrity of the country. The were accompanied by provincial cabinet members, officials and notables.\nThe governor also noted down his impressions in the visitors’ book.\nTalking to the media on the occasion, the governor said the Quaide-e-Azam was a great leader, who had vision of a separate country for the Muslims and “we should follow his vision to make Pakistan prosperous”.\nHe said Pakistan was a country where the people of different faiths were living freely and following their religions, besides enjoying equal rights and having due representation in the Parliament.\nOn the contrary, he added, the minorities were being discriminated and suppressed in some countries. He cited the example of India, where the Muslims, Sikhs and other vulnerable communities were suffering, which validated that the Two-Nation Theory.\nThe governor said under the leadership of Prime Minister Imran Khan, they were working hard to resolve the all issues being faced by the people.\nHe said Prime Minister Imran Khan was of the opinion that it was the job of provincial governments to run the public sector hospitals, and efforts were made to reach an agreement with the Sindh government in that regard. However, as per the clear directives of Supreme Court (SC), the Federal Government had to take over the hospitals.\nA board comprising capable persons was formed to run the hospitals where the competitive people were included in the board to run the hospitals and members for the province would also be included, he added.\nImran Ismael said the Federal Government had adopted the rotation policy for officials of federal cadre posted in all the province and not for Sindh only. Some officers had been working in the province for the last 15 years and suggestions from the Sindh Government, if any, could be reviewed by the Centre, he added.\nHe said their doors were open for talks with the provincial government. There might be some difference on political issues but dialogue was the only way to settle the matter in the larger national interests, he added.\nReplying to a question, the governor said he held meetings with the provincial government officials as they had no serious differences which might hinder delivering better services to the people.\nThe Sindh chief minister also paid rich tribute to the Father of Nation and said the Pakistan Resolution could unite all against the enemies of country.\nPursuing the vision of great Quaid “we should work to make our country strong and also create opportunities for the people so that they can live peacefully,” he added.\nHe said the nation should also not forget the Kashmiris and other Muslims, who were suffering in India.\nTo a question, he said he held regular meetings with the governor to discuss different issues. After rainfall in the province, they worked together and then a coordination committee was formed for the purpose. Another committee was also formed under him, which included representatives from the Federal Government, he added.\nHe said after consultation with the experts, the provincial government had sent its reply to the Federal Government on the issue of hospitals. He stressed the need of mutual consultation between the federal and provincial governments on issues. I As regards the teachers protest, Murad Ali Shah said the court had asked the government to conduct tests and interviews and not for their regularization.\nThe CM said the local boy elections could not be held with fresh delimitations.",
  "retrievedAt": "2025-08-11T20:32:12.981Z"
}
