{
  "title": "KP CM congratulates nation on Pakistan Day",
  "link": "https://www.app.com.pk/national/kp-cm-congratulates-nation-on-pakistan-day/",
  "date_published": "2021-03-23T06:42:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 23 (APP): Khyber Pakhtunkhwa Chief Minister Mahmood Khan has congratulated the whole nation in general and the people of Khyber Pakhtunkhwa in particular on Pakistan Day.\nIn a special message, he has said that the historic day of March 23 remind us that when 81 years ago, the Muslims of South Asia decided the establishment of a separate independent Islamic state that was accomplished after a period of seven years.\nThe chief minister said that Pakistan is the outcome of a long struggle and great sacrifices of the people of Sub-Continent wherein today we are free to live in accordance to our religious and cultural values.\nThe day, he added reminds us of the great sacrifices rendered by the founders of the nation in the struggle for the establishment of Pakistan. Today we salute those sacrifices and struggles of our founding fathers and pledge that we will follow their ideology to make Pakistan a great country.\nChief Minister Khyber Pakhtunkhwa said that today the whole nation is observing Pakistan Day (March 23) with the same zeal and spirit and pledge to continue individual and collective struggle for making Pakistan a great Islamic welfare state that was dreamed by the Father of the Nation, Quaid-e-Azam Mohammad Ali Jinnah and Allama Mohammad Iqbal.\nChief Minister said that the present government under the leadership of Prime Minister Imran Khan is making all-out efforts to turn Pakistan into a real Islamic welfare state as per visions of our founding fathers wherein justice, rule of law, merit would be supreme and all would be equal before law.\nToday, Let’s revive our pledge that we all would continue our individual and collective efforts for making a great country that was dreamed by the founders of Pakistan, he concluded.",
  "retrievedAt": "2025-08-11T20:32:18.576Z"
}
