{
  "title": "President confers civil awards on prominent personalities",
  "link": "https://www.app.com.pk/national/president-confers-civil-awards-on-prominent-personalities/",
  "date_published": "2021-03-23T17:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP):President Dr Arif Alvi on Tuesday conferred Pakistan civil awards on prominent personalities including foreign nationals in recognition of their services in different fields of life including medicines, education, social services, fine arts and for showing gallantry in the war against terrorism and during the coronavirus pandemic.\nDuring the investiture ceremony held here at the President House in connection with Pakistan Day, the President bestowed Nishan-i-Imtiaz on Sadeqain Naqvi (Arts, Painting, Sculpture), Prof. Shakir Ali (Arts, Painting), Zahoor ul Haq (Arts, Painting/Sculpture), Abida Parveen Arts (Singing), Dr. Jameel Jalibi (Literature) and Ahmad Faraz (Literature).\nHe also conferred awards on following personalities:\nHilal-i-Imtiaz was given to Prof. Dr. Anwar ul Hassan Gillani (Science Pharmaceutical) while Dr Asif Mahmood Jah and Syed Javed Anwar received the same award for their services to Pakistan.\nSitara-i-Shujaat was given to the following citizens for their gallantry:\nJawad Qamar, Safia Shaheed, Malik Hayatullah, Malik Sardar Khan Shaheed, Mumtaz Khan Shaheed, Hayatullah Khan Dawar Shaheed, Malik Muhammad Niaz Khan Shaheed, Sepoy Akhtar Khan Shaheed, Muhammad Naveed Sadiq, Mahar Muhammad Yasir Manzoor Shaheed, Shafqat Ullah Malik, Dr. Mustafa Kamal Pasha Shaheed, Prof. Hafiz Maqsood Ahmad Shaheed, Dr. Bashir Ahmed Shaheed, Dr. Khalid Masood Qaisrani Shaheed, Dr. Muhammad Asif Shaheed, Dr. Shafqatullah Shaheed, Dr. Younas Channa Shaheed, Dr. Wilayat Ali Gopang Shaheed, Prof. Dr. Muhammad Javed Shaheed, Munir Khan Shaheed, Dr. Usama Riaz, Malik Ashdar Shaheed and Dr. Muhammad Akhlaq Shaheed.\nThe President conferred Sitara-i-Imtiaz on Prof. Dr. Farhan Saif (Education), Bushra Ansari (Arts), Muhammad Imran Qureshi (Arts), Sultana Siddiqui (Television Production), Syed Farooq Qaiser (Arts, Puppeteer/Writer, Rana Irfan Shakeel Ramay, Col. Farooq Shahbaz (Public Service), and Pir Syed Lakht-e- Hasnain (Philanthropy).\nThe President also conferred President’s Pride of Performance Award on Ruth Wenny Lekardal (Services), Prof Dr Khalid Masood Gondal (Education), Naimat Sarhadi (Film), Muhammad Ali Shyhaki (Music), Saima Shah (Resham) (Film), Humayun Saeed (Film), Ali Zafar (Singing), Hina Nasrullah (Sufi Singing), Sarmad Sehbai (Literature), Indu Mariam Mitha (Dancing), Farhan Mehboob (Sports squash), Moulana Tariq Jameel (Religious Scholar), Abdul Majeed Qureshi (Philanthropy) and Muhammad Faheem (Arts, Wood Lacquer).\nSitara-i-Quaid-e-Azam was given to Prof. Dr Tariq Shafi for services to Pakistan while Sitara-i-Khidmat was awarded to Richard Geary Horwitz (USA) and Tamgha-i-Pakistan to Jane Teller (Denmark) for services to Pakistan.\nThe President awarded Tamgha-i-Shujaat to Fida Hussain (Gilgit-Baltistan), Ali Aftab Tarar (Punjab), Syed Shahzad Hassan (Punjab), Haroon Rashid Khan Khyber Pakhtunkhwa (KPK), Fakhar ud Din (Punjab), Mian Khan (Punjab), Muhammad Faheem Raza Khan (Sindh), Malik Wasid Khan (KPK), Molvi Gul Dad Khan (KPK), Malik Aslam Noor Khan (KPK), Muhammad Rafi Shaheed (KPK),\nDaud Khan (Shaheed) (KPK), Alam Zeb Shaheed (KPK),\nAllah Rakha (Azad Jammu & Kashmir), Shakeela Naz Shaheed (KPK), Ghuncha Sartaj Shaheed (KPK), Aetzaz Ahmed Goraya (Balochistan), Sajid Khan Mohmand (KPK), Shahid Ali Shaheed, Muhammad Iftikhar Shaheed, Khuda Yar Shaheed and Hassan Ali Shaheed for showing gallantry.\nTamgha-i-Imtiaz was awarded to Muhammad Tahir Javed, Zeba Shehnaz, Hameedullah Shah Hashmi, Faisal Edhi, Syed Aamir Mehmood, Capt (R) Muhammad Ilyas,\nFarid Ahmed Khan and Omar Saeed.\nBegum Samina Arif Alvi, federal ministers and people from all walks of life attended the ceremony.",
  "retrievedAt": "2025-08-11T20:32:11.018Z"
}
