{
  "title": "Country’s development linked with women’s full, responsible role: President",
  "link": "https://www.app.com.pk/national/countrys-development-linked-with-womens-full-responsible-role-president/",
  "date_published": "2021-03-23T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP): President Dr Arif Alvi emphasized the society and government to ensure a healthy and secure atmosphere for women to make them play their full and responsible role for achieving a developed and successful Pakistan.\n“The creation of a Naya Pakistan, a changing Pakistan, a progressive Pakistan and a successful Pakistan can only be achieved when women will play her full role in the society with responsibility,” the president said addressing the Hum Women Leaders Award 2021 hosted by Hum Network aired on Tuesday.\nFirst Lady Samina Alvi, federal ministers Dr Fehmida Mirza and Shafqat Mahmood, diplomats and prominent personalities from showbiz, media and other industries attended the event.\nThe event marked the conferment of awards to women in recognition of their contribution in human rights, girls’ education, armed forces, police services, environmental protection as well as fine arts.\nAmong those who won the awards included first female Surgeon General of Pakistan Army Lt. General Nigar Johar, Nobel Laureate Malala Yousufzai, prominent Sufi singer Abida Perveen, animal rights activist Ayesha Chundrigarh, Pashtun woman activist Tabassum Adnan, human rights activists Hina Jilani, historian Ayesha Jalal, makeup artist Musarrat Misbah, Jordan’s Princess Sarvath Al Hassan, DSP Shahzadi Gulfam, and Ecuador’s politician and women rights activist Maria Fernanda Espinosa Garces.\nHowever, the only man honored with the award was Malik Rafique Awan to recognise his remarkable contribution of upbringing his five daughters to make all qualify the CSS exams. Two of her daughters presented the award to their father as renowned actress Bushra Ansari also joined them.\nThe president said that besides providing them education and health facilities, the society as well as the government should ensure their protection to the extent that “they should not be irritated, hurt and harassed.”\nHe said that the efforts for women rights were decades old and recalled and appreciated the active role of Fatima Jinnah and Begum Ra’ana Liaqat Ali Khan. He also spoke high of the contribution by President Hum Network Sultana Siddiqui, who became an inspiration for many others.\nThe president said Islam had granted rights to the women including the inheritance rights at a time when there was no concept of women rights in the society.\nHe said the prevailing situation manifested that the country moved backward instead of making advancement on women rights despite it being a Muslim country.\nThe president strongly advocated for women’s better health by addressing the issues of malnutrition and stunted growth and girls’ education by doing away with the discouraging customs.\nMoreover, he also called for women’s financial empowerment and urged them to take full advantage of government’s initiative of special scheme to extend up to Rs 5 million loan to them on even below 2 percent markup.\nThe president also emphasized the protection of jobs for women particularly after their maternity leave as their education had involved huge expenditures by the parents as well as the government.\nHe particularly urged media to play its full role for creation of a safe and healthy environment for the women besides ensuring the character building of the children.\nEarlier, the president presented an award to Lt. General Nigar Johar.\nFirst Lady Samina Alvi presented the award to Sufi Singer Abida Perveen and reiterated her resolve to continue striving for bringing about a change in Pakistan vis-à-vis women rights.\nIn her address, President Hum Network Sultana Siddiqui thanked the president for allowing to hold the event at Presidency which showed the whole federation was backing the efforts for protection of women rights.\nShe urged media to highlight the contribution and hard work by the women and said the annual award was meant to make them strive to do even bigger things.\nThe event also featured the musical performances of Quratul Ain Baloch, Umair Jaswal and Strings.",
  "retrievedAt": "2025-08-11T20:32:09.698Z"
}
