{
  "title": "Cambridge confirms partial leak of 3 A-Level papers for June 2025 exams - Pakistan - DAWN.COM",
  "author": null,
  "content": "Cambridge International Education (CIE) on Thursday confirmed that question papers of three AS and A Level examinations were partially leaked across Pakistan.\n\nCIE, part of Cambridge University Press and Assessment, offers internationally recognised exams to over 10,000 schools in 160-plus countries. In Pakistan, O Levels (grades 9–10) cover a broad subject range, while A and AS Levels (grades 11–12) are more specialised and advanced, providing pathways to higher education in Pakistan and abroad. CIE exams are typically held twice a year, in June and November, with results released in August and January, respectively.\n\n“We have written to our schools in Pakistan to tell them that, against our regulations, some content from three question papers was available before the timetabled exam dates in Pakistan,” the CIE said in a statement.\n\nThe examinations that were affected include:\n\nHowever, it said, “In all three cases, we found no evidence that the whole paper had been shared before the exam.”\n\nCIE said it will issue a syllabus grade for all subjects on August 12, 2025, as usual, saying that the “grade will be based on the question paper content completed.”\n\n“We have decided to take action for each of these syllabi/components to maintain the integrity and fairness of the assessment for all candidates, and so that we can award an overall syllabus grade on our published results days.\n\n“Therefore, we have disregarded some questions from each paper — we will award you full marks for these questions,” it added.\n\nThe examiner said candidates will not be disadvantaged by these actions and will be awarded a “fair and reliable” final grade.\n\n“Our actions make sure that candidates who accessed question paper content before their exam do not have any advantage and will not achieve higher marks by cheating,” it added.\n\nCIE said it is protecting the integrity of the assessment and making sure that it remains a trusted qualification by schools and universities worldwide.\n\nCambridge said cases of malpractice are taken “extremely seriously”, adding that multiple investigations are ongoing. It vowed to take decisive action against anyone proven to have been involved in malpractice.\n\nIt said the centres will likely be deregistered, and this information will be shared with other awarding organisations. “For candidates, it is likely to mean disqualification and barring from entering our exams,” it added.\n\nCIE reassured that before every exam series, it carries out extensive and detailed planning to review exam security arrangements.\n\n“The security of our exams is of the utmost importance. As usual, we will review and plan security arrangements before the next exam series,” it added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:35.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918186/cambridge-confirms-partial-leak-of-3-a-level-papers-for-june-2025-exams",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T13:59:18.000Z"
}
