{
  "title": "Next in line? - Newspaper - DAWN.COM",
  "author": null,
  "content": "A RELIABLE enemy is as difficult to find today as a loyal friend. In modern geopolitics, the first is a sine qua non, the second a fickle firefly.\n\nIn its 250-year-old history, the US army has faced a range of foes. The list is long and open-ended — from Germany, the (former) USSR, Vietnam, Cambodia, Laos, Cuba, Iraq, Afghanistan and now China. The US is addicted to war: it gets high on hostility.\n\nHere, India and Pakistan are in the last quartile of their ‘Hundred Years War’. Had they been a married couple, in 2022 they would have celebrated their diamond anniversary. But theirs is not a union of choice. It has been a reluctant pairing, fomented by suspicion and sustained by state-sponsored hate.\n\nThere are still many Pakistanis and Indians who recall with genuine nostalgia a pre-Modi India, when borders were lines not barriers, when interest in each other was not simply security-related, and when hope sprang, if not eternal, at least periodical. They both wonder why the Indian media (normally balanced) has become irrationally bellicose, why it still advocates war-war to jaw-jaw, when peace is clearly a cheaper option.\n\nThe world is too dangerously close to World War III.\n\nOr does India prefer to imitate its ally Israel and to periodically ‘mow the grass’, using covert terrorist attacks within Pakistan as a scythe?\n\nIsrael, like the US, has tested a number of foes. The latest is Iran. During the past week, they have been locked in open war. This is not accidental.\n\nIn 2023, Yonah J. Bob and Ilan Evyatar in their book Target Tehran predicted as much, with a specific date: “If the Israel-Iran chess game is played out further, things could become ominous. If Iran knows that Israel also knows that it might break out a nuclear weapon before October 2025 […] Israel might decide to strike before the Iranians have had more time to prepare — in other words, before 2025.”\n\nThe book was written while Joe Biden (a Democrat) was still president. Like his predecessor Barack Obama, Biden acted as a brake on Israel. Donald Trump, however, is unashamedly Israel’s engine.\n\nWill the Israel-Iran war continue? The two authors think it likely. Their view is that “the conflict between Israel and Iran seems in its essence sadly unchanged, and perhaps unchangeable. Barring the collapse of the theocratic regime, Iran will continue to do two things: one, strive to become a nuclear weapon state, and two, for reasons of religious ideology and national grandeur, seek the destruction of Israel”.\n\nThe proliferation of nuclear weapons by smaller countries had been foreseen by Henry Kissinger 70 years ago. In 1957, he predicted in his book Nuclear Weapons and Foreign Policy: “Within another 15 years the diffusion of nuclear technology will make inevitable the possession of nuclear weapons by many now secondary states.” Today, India, Pakistan, North Korea and Israel have also gone nuclear.\n\nIsrael has never disguised its policy to prevent any ‘radical’ Muslim country from going nuclear. It noshes from a ‘table d’hôte’ menu. The appetiser was Iraq. In 1981, Israel destroyed an unfinished nuclear reactor near Baghdad. The main course is Iran. Does Iran in fact have nuclear weapons? Or are they like Iraq’s unproven WMDs? And for dessert, Israel has selected Pakistan.\n\nA distance of 3,300 kilometres separates Islamabad from Tel Aviv. Islamabad and Beijing are closer than the notional 3,800km. As the spat following Pahalgam has proved, China and Pakistan are more than distant iron brothers. They are adjacent allies, with umbilical interests.\n\nThe French politician Clemenceau went further: “War is too serious a matter to be left to generals”. In a modern context, he would have added that nuclear warfare is too serious a matter to be left to democratic despots.\n\nIsrael is trying to draw its sponsor the US into the war ag­­ainst Iran. Trump is tempted. He should heed Kissinger’s advice: “In the Nuc­l­ear Age, abandoning an ally risked eventual disaster, but resorting to nu­­clear war at the side of an ally guaranteed immediate catastrophe.”\n\nFor the first time since 1945, the world is too dangerously close to World War III.\n\nTo understand the present situation, one needs to go back a century, to the 1914-18 war. World War I resulted in an estimated 16 million deaths, including 9m military personnel and 7m civilians. The paucity of intelligent leadership elicited from the German Gen Erich Ludendorff the back-handed compliment that the British soldiers were “lions, led by donkeys”.\n\nThe French politician Clemenceau went further: “War is too serious a matter to be left to generals”. In a modern context, he would have added that nuclear warfare is too serious a matter to be left to democratic despots.\n\nIt is not insignificant that immediately prior to attacking Iran, on Friday the 13th, Israel’s Prime Minister Benjamin Netanyahu called Indian PM Modi. One wonders whether Netanyahu suggested that Modi should take to gardening again, and use his scythe to mow our grass.\n\nThe writer is an author.\n\nwww.fsaijazuddin.pk\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68537bd933706.jpg",
  "retrievedAt": "2025-08-20T04:18:49.751Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918054",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T02:55:30.000Z"
}
