{
  "title": "Iran, Israel trade fresh air attacks as Trump weighs US involvement - World - DAWN.COM",
  "author": null,
  "content": "Iran and Israel traded further air attacks on Thursday as US President Donald Trump kept the world guessing about whether the United States would join Israel’s bombardment of Iranian nuclear facilities.\n\nA week of Israeli air and missile strikes against its major rival has wiped out the top echelon of Iran’s military command, damaged its nuclear capabilities and killed hundreds of people, while Iranian retaliatory strikes have killed two dozen civilians in Israel.\n\nIsrael claimed the strikes were part of a broader operation codenamed ‘Rising Lion’ to deter Tehran’s nuclear ambitions, which the latter has consistently denied, saying its uranium enrichment programme is for civilian purposes. The worst-ever conflict between the rivals has raised fears that it will draw in world powers and rock regional stability already undermined by the spillover effects of the ongoing Israeli onslaught in Gaza.\n\nSpeaking to reporters outside the White House on Wednesday, Trump declined to say if he had made any decision on whether to join Israel’s air campaign. “I may do it. I may not do it. I mean, nobody knows what I’m going to do,” he said.\n\nTrump in later remarks said Iranian officials wanted to come to Washington for a meeting and that “we may do that.” But he added, “It’s a little late” for such talks.\n\nIranian Supreme Leader Ayatollah Ali Khamenei rebuked Trump’s earlier call for Iran to surrender in a recorded speech played on television, his first appearance since Friday.\n\nThe Americans “should know that any US military intervention will undoubtedly be accompanied by irreparable damage”, he said. “The Iranian nation will not surrender.”\n\nIran denies it is seeking nuclear weapons and says its program is for peaceful purposes only. The International Atomic Energy Agency (IAEA) said last week Tehran was in breach of its non-proliferation obligations for the first time in 20 years.\n\nHowever, a US intelligence assessment found that Iran was not actively pursuing a nuclear weapon programme and was “years away from producing one”, a report from CNN released on Tuesday said.\n\nIsrael, which is not a party to the Non-Proliferation Treaty (NPT), is the only country in the Middle East believed to have nuclear weapons. Israel does not deny or confirm that.\n\nThe foreign ministers of Germany, France and Britain plan to hold nuclear talks with their Iranian counterpart on Friday in Geneva to urge Iran to return to the negotiating table, a German diplomatic source told Reuters.\n\nBut while diplomatic efforts continue, some residents of Tehran, a city of 10 million people, on Wednesday jammed highways out of the city as they sought sanctuary from intensified Israeli airstrikes.\n\nArezou, a 31-year-old Tehran resident, told Reuters by phone that she had made it out of the city to the nearby resort town of Lavasan.\n\n“My friend’s house in Tehran was attacked and her brother was injured. They are civilians,” she said. “Why are we paying the price for the regime’s decision to pursue a nuclear programme?”\n\nThe Wall Street Journal said Trump had told senior aides he approved attack plans on Iran but was holding off on giving the final order to see if Tehran would abandon its nuclear program.\n\nSenior US officials are preparing for the possibility of a strike on Iran in the coming days, Bloomberg News reported on Wednesday, citing people familiar with the matter.\n\nWashington-based group Human Rights Activists put the total death toll in Iran at 585 people, with 1,326 other wounded, the Washington Post reported. The group added that it had identified 239 of those killed in Israeli strikes as civilians and 126 as security personnel.\n\nIn its last update on Monday, Iran’s health ministry had said 224 Iranians had been killed and over 1,000 injured, most of them civilians.\n\nSo far, 24 people have been killed in Israel, more than 800 have been wounded and over 3,800 have been evacuated from their homes, CNN quoted a statement by Prime Minister Benjamin Netanyahu’s office as saying.\n\nEarly on Thursday, air defences were activated in Tehran, intercepting drones on the outskirts of the capital, the semi-official SNN news agency reported. Iranian news agencies also reported it had arrested 18 “enemy agents” who were building drones for Israeli attacks in the northeastern city of Mashhad.\n\nIsrael’s military said sirens sounded in northern Israel and in the Jordan Valley on Thursday and that it had intercepted two drones launched from Iran.\n\nThe Iranian missile salvoes mark the first time in decades of shadow war and proxy conflict that a significant number of projectiles fired from Iran have penetrated defences, killing Israelis in their homes.\n\nIsraeli Prime Minister Benjamin Netanyahu, in a video released by his office on Wednesday, said Israel was “progressing step by step” towards eliminating threats posed by Iran’s nuclear sites and ballistic missile arsenal.\n\n“We are hitting the nuclear sites, the missiles, the headquarters, the symbols of the regime,” Netanyahu said.\n\nIsrael, which is not a party to the international Non-Proliferation Treaty, is the only country in the Middle East believed to have nuclear weapons. Israel does not deny or confirm that.\n\nNetanyahu also thanked Trump, “a great friend of the state of Israel,” for standing by its side in the conflict, saying the two were in continuous contact.\n\nTrump has veered from proposing a swift diplomatic end to the war to suggesting the US might join it.\n\nIn social media posts on Tuesday, he mused about killing Khamenei.\n\nRussian President Vladimir Putin, asked what his reaction would be if Israel did kill Iran’s Supreme Leader with the assistance of the United States, said on Thursday: “I do not even want to discuss this possibility. I do not want to.”\n\nPutin said all sides should look for ways to end hostilities in a way that ensured both Iran’s right to peaceful nuclear power and Israel’s right to the unconditional security of the Jewish state.\n\nA source familiar with internal discussions said Trump and his team were considering options that included joining Israel in strikes against Iranian nuclear installations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/19074323a773cd1.jpg",
  "retrievedAt": "2025-08-20T04:19:02.601Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918048/iran-israel-trade-fresh-air-attacks-as-trump-weighs-us-involvement",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T02:49:01.000Z"
}
