{
  "title": "Bangladesh tighten grip on first SL Test - Sport - DAWN.COM",
  "author": null,
  "content": "GALLE: Bangladesh continued their dominance over Sri Lanka on the second day of the first Test on Wednesday, finishing at a commanding 484 for nine — despite a few late breakthroughs by the hosts.\n\nThe Tigers resumed on 292 for three overnight and turned the screws on a batting-friendly wicket, with Mushfiqur Rahim and Najmul Hossain Shanto extending their record-breaking partnership.\n\nThe 264-run partnership finally en­d­ed when Shanto fell for 148, decei­ved in the air as he attempted to drive one.\n\nNajmul’s fluent innings was peppered with 15 boundaries and a six.\n\nMushfiqur kept going with wicket-keeper Liton Das before finally falling for 163, a marathon knock that span­ned nearly nine hours and 350 balls.\n\nLiton piled on further misery for Sri Lanka with a brisk 90 off 123 deliveries, cashing in on tired bowlers and some loose fielding.\n\nHe was particularly severe on the spinners, using his feet to good effect to lift the ball cleanly over the in-field.\n\nBut he also survived some anxious moments.\n\nPathum Nissanka grassed a sitter at short mid-wicket when he had just 14 to his name.\n\nMoments earlier, he had survived a run-out stemming from a mix-up.\n\nHe eventually perished attempting a reverse sweep off debutant Tharindu Ratnayake, gloving it to Kusal Mendis behind the stumps.\n\nBangladesh batting coach Mohammad Salahuddin said it was a “very good effort by the batsmen”.\n\n“We were very impressed with the way Mushfiqur Rahim went about things. He had not scored a big one in a while but we knew it was just a matter of time before he scored a big one,” Salahuddin said.\n\n“They [batsmen] showed character and we have almost scored 500 runs now. I hope our bowlers will be able to create opportunities bowling to attacking fields as we have got the runs on the board now. It will be an interesting day three.”\n\nSri Lanka’s Milan Rathnayake said it was one of the “flattest wickets we have seen in Galle”.\n\n“It was a tough wicket to bowl on but I thought we did a decent job,” Rathnayake said.\n\n“When they were building the pressure and taking the attack on to us, it was important to stay calm and show character. I thought after tea we came back stronger to claim five wickets.”\n\nWith rain interrupting play shortly after lunch, only 61 overs could be bowled on day two.\n\nA persistent drizzle forced an early tea and fading light ended proceedings prematurely. Play will resume fifteen minutes early on Thursday to compensate for the lost time.\n\nScoreboard\n\nBANGLADESH (1st innings, overnight 292-3):\n\nShadman Islam c de Silva b T. Ratnayake 14\n\nAnamul Haque c Kusal Mendis b Fernando 0\n\nMominul Haque c de Silva b T. Ratnayake 29\n\nNajmul Hossain c Mathews b Fernando 148\n\nMushfiqur Rahim lbw Fernando 163\n\nLitton Das c Kusal Mendis b T. Ratnayake 90\n\nJaker Ali b M. Rathnayake 8\n\nNayeem Hasan c Kusal Mendis b M. Rathnayake 11\n\nTaijul Islam b M. Rathnayake 6\n\nHasan Mahmud Not Out 0\n\nNahid Rana Not Out 0\n\nEXTRAS (B-4, LB-5, NB-2, W-4) 15\n\nTOTAL (for nine wickets, 151 overs) 484\n\nFALL OF WICKETS: 1-5 (Anamul), 2-39 (Shadman), 3-45 (Mominul), 4-309 (Najmul), 5-458 (Mushfiqur), 6-458 (Litton), 7-474 (Jaker), 8-483 (Taijul), 9-484 (Nayem)\n\nBOWLING:strong text Fernando 28-5-80-3 (1w), M. Rathnayake 22.4-6-38-3, T. Ratnayake 49.2-3-196-3 (3w, 1nb), Jayasuriya 48-2-154-0 (1nb), de Silva 3-0-7-0\n\nSRI LANKA: P. Nissanka, L. Udara, D. Chandimal, A. Mathews, KD. Mendis, D. de Silva, K. Mendis, M. Rathnayake, T. Rathnayake, P. Jayasuriya, A. Fernando\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68532a7f5d74b.jpg",
  "retrievedAt": "2025-08-20T04:18:45.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917972/bangladesh-tighten-grip-on-first-sl-test",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T04:56:29.000Z"
}
