{
  "title": "55 more killed by Israeli strikes in Gaza - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: Gaza’s civil defence agency said 55 people were killed by Israeli fire and air strikes in the Palestinian territory on Wednesday, including 11 who were seeking aid.\n\nThe conflict has ravaged the Gaza Strip and resulted in severe shortages of food, fuel and clean water.\n\nCivil defence spokesman Mah­mud Bassal told AFP that 11 people were killed and more than 100 wounded “after the occupation forces opened fire and launched several shells… at thousands of citizens” who had gathered to queue for food in central Gaza.\n\nThe civil defence agency said an­­other 19 people were killed in three Israeli strikes, which it said targe­ted houses and a tent for displaced people. Three more people were killed in an Israeli air strike on a neighbourhood northeast of Gaza City on Wednesday, Bassal said.\n\nIsrael military raids refugee camps in occupied West Bank\n\nIn early March, Israel imposed a total blockade on Gaza, amid a deadlock in truce negotiations, only partially easing restrictions in late May. Since then, chaotic scenes and a string of deadly sho­otings have occurred near areas where Pales­tinians have gathered in hopes of receiving aid.\n\nIsraeli restrictions on media in the Gaza Strip and difficulties in accessing some areas mean AFP is unable to independently verify the tolls and details provided by the civil defence agency.\n\nThe civil defence agency reported that at least 53 people were killed on Tuesday, as they gathered near an aid centre in the southern city of Khan Yunis hoping to receive flour.\n\nAfter Israel eased its blockade, the US- and Israel-backed Gaza Humanitarian Foundation (GHF) began distributing aid in late May, but its operations have been marred by chaotic scenes and dozens of deaths.\n\n‘Outrageous’\n\nUN agencies and major aid groups have refused to cooperate with the foundation over concerns it was designed to cater to Israeli military objectives.\n\nThe head of a UN inquiry said on Wednesday that the use of GHF to distribute food in the Pal­estinian territory is “outrageous”.\n\n“In every war, the siege and starvation surely leads to death,” said Navi Pillay, who chairs the UN’s Inde­pe­ndent Interna­tional Commis­sion of Inquiry on Israel and the Palestinian territories.\n\n“But this initiative of what’s called a foundation, a private fou­ndation, to supply food, is what I see as outrageous, because it involves the US itself, the government, and it turns out, as we watch daily, that people who go to those centres are being killed as they seek food.”\n\nRaid on refugee camps\n\nIsraeli troops raided two Palestinian refugee camps in the occupied West Bank’s north overnight.\n\nThe military said that at “around 4am Israeli forces entered Balata camp”, near the northern city of Nablus, for “a routine counter-terrorism operation”. It added that the troops had been deployed to the nearby Askar camp prior to the operation in Balata camp.\n\nImad Zaki, head of the popular services committee of Balata camp, also told AFP that the military began its raid at 0100 GMT on Wednesday.\n\n“They closed all entrances to the camp, seized several homes after ev­­icting their residents, and orde­red the homeowners not to return for 72 hours. These homes were tur­ned into military outposts and int­er­ro­gation centres,” Zaki said.\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68533d4b9cb3c.jpg",
  "retrievedAt": "2025-10-12T03:39:58.892Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918018/55-more-killed-by-israeli-strikes-in-gaza",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T03:19:38.000Z"
}
