{
  "title": "NAB calls Swati over ‘Rs30bn corruption’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: National Accountability Bureau has issued a call-up notice to former senator and PTI leader Azam Khan Swati, asking him to appear before its team on June 23 as part of a probe into the alleged misappropriation of more than Rs30 billion funds from the Upper Kohistan district accounts office.\n\nNAB deputy director (coordination) Mohammad Kamran put Mr Swati on notice under Section 19 of the National Accountability Ordinance, saying prima facie, the former lawmaker possesses important records of the case, so he could be helpful for just decision of inquiry.\n\nHe added that Mr Swati should appear before the “combined investigation team” along with records of the payment allegedly made by a firm, Kohistan Associates and Builders, through his bank account in 2024.\n\n“It has been made clear that in case of non-compliance with directions contained in this notice, the authority may adopt coercive measures against you [PTI leader] as provided under the provisions of NAO, 1999,” he noted.\n\nThe NAB has so far frozen multiple properties of corruption suspects during the ongoing probe, with the accountability court confirming several such orders.\n\nThe NAB Khyber Pakhtunkhwa has claimed that it had started the inquiry into the Kohistan corruption case after receiving credible information.\n\nIt added that the preliminary probe revealed that officials of the communication and works department, Upper Kohistan, in connivance with officials of district accounts office of Upper Kohistan and a branch of National Bank of Pakistan there had misappropriated more than Rs30 billion from different projects through bogus withdrawal of funds from the national treasury in the name of several contractors, who didn’t carry out any civil work.\n\nThe bureau claimed that the district accounts office of Upper Kohistan, without carrying any verification of the alleged work done by the said contractors, passed the cheques amounting to billions of rupees, which were deposited by those contractors in their bank accounts.\n\nIt added that those amounts were credited and the crime proceeds were layered in different bank accounts and shared by suspects in agreed upon proportions, causing loss to the exchequer.\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:41.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917983/nab-calls-swati-over-rs30bn-corruption",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T04:57:05.000Z"
}
