{
  "title": "Budget hurdle cleared as PML-N, PPP settle issues - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Govt agrees to reduce GST on solar panels from 18pc to 10pc\n• Collection of tax on digital services handed over to provinces\n• PIDCL to oversee federal projects in all provinces\n• Funds for Sindh varsities to be maintained\n\nISLAMABAD: In a significant development, the ruling PML-N has finally agreed to four major demands of its key ally PPP, thus paving the way for the federal budget’s smooth passage in the National Assembly.\n\nTaking the floor during the budget debate in the lower house of parliament on Wednesday, Deputy Prime Minister and Foreign Minister Ishaq Dar revealed that after extensive consultations with PPP leaders, including Bilawal Bhutto-Zardari and Sindh Chief Minister Murad Ali Shah, as well as Prime Minister Shehbaz Sharif, the government had accepted the PPP’s key demands, including reduction in the proposed General Sales Tax (GST) on solar panels.\n\nThe assurance came in the wake of constant criticism from the members, mostly from the PPP, on a number of budgetary proposals during the ongoing budget debate.\n\nAmid desk-thumping by the treasury members, Mr Dar announced that the digital sales tax on services would remain within the jurisdiction of the provinces, while the proposed 18pc GST on solar panels had been reviewed and revised down to 10pc.\n\nMr Dar stated that after detailed discussions with coalition partners and relevant stakeholders, including the people in the Ministry of Finance and the Federal Board of Revenue (FBR), a consensus was reached on Tuesday night to resolve several contentious budgetary issues.\n\nHe termed the concerns raised by the PPP regarding digital taxation as “valid,” and said the issue would be clearly addressed by finance minister in his winding up speech in the assembly.\n\nMr Dar said despite the fact that 54pc of components used in solarisation were already taxed, there was a widespread concern among stakeholders over the government’s proposal to impose 18pc GST on remaining 46pc of the components.\n\n“However, we have now proposed reducing the solar GST from 18pc to 10pc,” he declared.\n\nMr Dar said when a relief was announced in any sector, they had to look for other ways to generate the revenue to fill the gap. He said initially the government had decided to announce six per cent increase in the salaries of the government employees, but after a discussion in the federal cabinet, they finally announced 10pc raise. He said now they were under discussion with the IMF as to how to compensate this additional expenditure.\n\nReferring to another PPP’s demand, the deputy PM said that it had been decided to maintain funding for Sindh universities in the PSDP through the HEC at Rs4.7bn. In the budget, the government had reduced the amount to Rs2.6bn.\n\nHe said the prime minister had also acknowledged valid concerns raised by the PPP regarding handing over of now-defunct PWD projects to three provinces and the projects in Sindh to the newly established Pakistan Infrastructure Develo­pment Company Limited (PIDCL). He said the prime minister had agreed that there must be a uniform policy for all the provinces. He said the PIDCL would now oversee federal development projects in all the provinces.\n\nHowever, Mr Dar did not mention the issue of less allocation for the ongoing projects in Sindh, including the Sukkur-Hyderabad Motorway.\n\nMany PPP members in their budget speeches had categorically announced that it would be challenging for them to vote for the budget in its present form.\n\nBesides opposing imposition of 18pc GST on solar panels, the PPP members had been agitating over the “step-motherly treatment” with Sindh province by making meager allocations for the ongoing projects in the province. The PPP members had been mainly protesting over “failure” of the federal government in handing over the projects which were being carried out by now-defunct PWD to the Sindh government as well as the Centre’s decision to directly collect tax on digital services.\n\nTaking the floor, PPP’s veteran parliamentarian Syed Naveed Qamar said the government had by and large addressed their issues.\n\n“We are thankful to the prime minister and the deputy prime minister. Our issues have been mitigated to some extent,” said Mr Qamar.\n\nHe welcomed the reduction of GST on solar equipment from 18pc to 10pc, but said the party would like to see further reduction in it up to five per cent.\n\n“Matters are settled now,” declared Mr Qamar.\n\nEarlier, taking part in the budget debate, PPP’s Ijaz Jakhrani had already disclosed in the assembly that the issues between his party and the PML-N had been resolved and his party would now have no hesitation in supporting the budget.\n\n“Why should we not vote when the government has listened to us,” he said.\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:50.815Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918042/budget-hurdle-cleared-as-pml-n-ppp-settle-issues",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T03:27:36.000Z"
}
