{
  "title": "Govt draws five potential buyers for PIA - Pakistan - DAWN.COM",
  "author": null,
  "content": "In its efforts to sell its struggling flag carrier Pakistan International Airlines (PIA), the government has received expressions of interest from five parties, including business groups and a military-owned firm, the Privatisation Ministry said on Thursday.\n\nThe bids were submitted ahead of a June 19 deadline to acquire up to 100 per cent of PIA, which has accumulated over $2.5 billion in losses in roughly a decade. Still, following major restructuring, it posted its first operating profit in 21 years in the 2024-25 fiscal year.\n\nThe sale is seen as a test of Pakistan’s ability to shed loss-making state firms and meet conditions of a $7bn International Monetary Fund bailout. It would be the first major privatisation in nearly two decades.\n\nEight parties submitted their expression of interest, but only five of them provided documents of qualification, the ministry said in a statement.\n\nAmong the five groups is a consortium of major industrial firms: Lucky Cement Ltd, Hub Power Holdings Ltd, Kohat Cement Co Ltd and Metro Ventures.\n\nAnother is led by investment firm Arif Habib Corp Ltd and includes fertiliser producer Fatima Fertiliser Co Ltd, private education operator The City School, and real estate firm Lake City Holdings.\n\nFauji Fertiliser Company Ltd, a military-owned conglomerate, Pakistani airline Air Blue Ltd and a consortium including Bahria Foundation, domestic carrier Serene Air and US-based Equitas Capital LLC also submitted documents.\n\n“The government will review the documents and give qualified parties access to data for due diligence,” the statement read.\n\nOnce a leading global airline, PIA resumed European flights in January after a four-year EU ban linked to safety concerns, and is seeking UK clearances, seen as key to its turnaround. Industry insiders say the winning bidder is expected to partner with a foreign airline to run operations.\n\nA previous attempt to sell the airline failed as a $36 million bid from real estate firm Blue World City fell short of the $305m floor price, with concerns over debt, staffing, and limited control.\n\nThis time, the government is offering full divestment, has scrapped the sales tax on leased aircraft, and is providing limited protection from legal and tax claims. Around 80pc of the airline’s debt has been transferred to the state.\n\n“We’re targeting Rs86bn in privatisation proceeds this year,” Privatisation Minister Muhammad Ali told Reuters. “For PIA, in the last round of bidding, 15pc of the proceeds were going to the government, with the rest staying within the company.”\n\nHe said bidders would be pre-qualified in early July, with due diligence lasting two to two-and-a-half months, with final bidding and negotiations expected in the fourth quarter of 2025.\n\nOfficials hope the sale will revive the stalled privatisation drive. Other planned deals include the Roosevelt Hotel and several power firms by mid-2026.\n\n“From the Roosevelt Hotel, we’re expecting over $100m as [the] first payment during this year,” said Ali.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/2012140172a9ed6.jpg",
  "retrievedAt": "2025-08-20T04:18:35.619Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918208/govt-draws-five-potential-buyers-for-pia",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T17:21:13.000Z"
}
