{
  "title": "Kashmir named among world’s ‘most critical escalation points’ - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Global Peace Index 2025 has put the disputed region of Kashmir at the forefront of the critical escalation hotspots in the world, where tensions between India and Pakistan remain ‘perilously high’.\n\nThe index released by the Institute for Economics and Peace (IEP) with headquarters in Sydney, says the situation in Kashmir exemplifies the fragility of ceasefire agreements in volatile geographic settings and underscores the dangers posed by non-state actors capable of triggering international crises.\n\nThe index, a snapshot of the global state of peace, ranked Pakistan at 144, showing ‘low state of peace’ while India ranked 115 position with ‘medium state of peace’.\n\nUkraine and Russia have been placed at the bottom of the rankings of 163 countries.\n\nGlobal Peace Index ranks Pakistan at 144, India at 115; says South Asia tensions remain perilously high\n\nAbout conflict history and escalation hotspots in India, the index report says the conflict is highly likely in the Kashmir region over the next year. Applying the escalation-risk indicators to the Kashmir dispute finds it has the potential for rapid deterioration. A four-day conflict ensued from 7-10 May 2025 and was the deadliest escalation betwe­­en the countries in several years.\n\nA renewed confrontation over Kashmir would involve the two nuclear-armed rivals. Although a deliberate nuclear strike remains highly unlikely, any conventional campaign confined to the disputed territory could still inflict heavy battlefield losses and easily spill beyond the Kashmir region.\n\nThe conflict over Kashmir has the potential to substantially escalate or even become a full-blown war. Past triggers like terror attacks and corresponding Indian strikes on Pakistan have been controlled and external actors have placed significant pressure to de-escalate.\n\nThere is also a substantial risk of conflicts or increased violence inside India and Pakistan, with the potential for anti-Muslim violence in India or rebel groups like Balochistan separatists or the Tehreek-i-Taliban Pakistan taking advantage of any conflict between the countries.\n\nThe Global Peace Index 2025 has pinpointed a set of critical escalation hotspots and regions where conflict risks are accelerating and could evolve into major wars.\n\nAccording to the index, South Asia, the second least peaceful region globally, experienced the largest regional decline in peacefulness. This deterioration was driven primarily by repressive measures in Bangladesh under the Hasina government, and the heightened civil unrest and escalating internal and cross-border tensions in Pakistan.\n\nThis year’s results found that the average level of global peacefulness deteriorated by 0.36 per cent. This is the thirteenth deterioration in peacefulness in the last 17 years, with 74 countries improving and 87 deteriorating in peacefulness. Iceland remains the most peaceful country in the world, a position it has held since 2008.\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:52.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918019/kashmir-named-among-worlds-most-critical-escalation-points",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T03:05:39.000Z"
}
