{
  "title": "Higher living costs compel people to borrow: survey - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The prolonged combination of low economic growth and high inflation over the past few years in Pakistan appears to have taken a serious financial toll on large sections of the population, leading to increasing borrowing needs, according to the latest survey.\n\n“In the last five years, increased living costs are the leading reason for borrowing in 2024, reported by 12pc of Pakistani adults”, said Karandaaz Pakistan — a government partner in digitisation and tax reforms — in its once-a-decade Financial Inclusion Survey (K-FIS).\n\nBesides the living costs coming as financial shock and increasing borrowing needs, the survey completed with the financial support of the Gates Foundation and UK’s Foreign, Commonwealth and Development Office (FCDO) noted that 7pc adult Pakistanis were found to have been forced to borrow due to healthcare expenses and 6pc others for the loss of employment.\n\nOther notable reasons include marriage expenses 3pc, and climate change-related needs like crop failure or agricultural loss 3pc, and property damage 2pc, while education expenses 1.5pc and earthquake-related losses 0.1pc were the least common reasons for borrowing.\n\n“The need for loans due to rising living costs is widespread, affecting 12pc of Pakistani adults overall. The highest demand is among self-employed individuals (15pc), followed by blue-collar workers (14pc), housewives (14pc), and individuals who are not working due to a disability (12pc), indicating financial strain across diverse groups”, the survey findings said adding the urban residents (8pc) and white-collar workers (7pc) reported lower demand, while students (2pc) had the least need.\n\nThe need for loans due to unexpected medical expenses is reported by 7pc of Pakistani adults, with the highest demand among the unemployed with disabilities (16pc), followed by blue-collar workers (10pc) and unemployed individuals (10pc), indicating financial vulnerability in these groups. Rural residents (8pc) report a higher need than urban residents (6pc), while white-collar workers (3pc) and students (1pc) have the lowest loan demand for medical expenses.\n\nThe overall need for loans due to loss of employment or income remains low at 6pc across most demographics. Blue-collar workers (10pc) report the highest need in this financial shock as well, followed by the self-employed (7pc), unemployed (6pc) and housewives (6pc), indicating higher financial vulnerability in these groups. White-collar workers (4pc), retired individuals (2pc), and students (1pc) have the lowest loan demand due to income loss. Rural and urban residents report equal needs (6pc).\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:40:02.761Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918067/higher-living-costs-compel-people-to-borrow-survey",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T03:05:33.000Z"
}
