{
  "title": "Karachi reports second Congo fever-related death this year - Pakistan - DAWN.COM",
  "author": null,
  "content": "Another patient died of Congo fever on Thursday in Karachi, as the number of fatalities from the disease reached two this year in Sindh, a statement from the district health officer in Malir said.\n\nCrimean Congo Hemorrhagic Fever (CCHF), commonly known as Congo Virus, causes severe viral hemorrhagic fever outbreaks with a case fatality rate of 10-40 per cent, according to the World Health Organisation. There is no vaccine available for the disease.\n\nPer experts, the CCHF virus is primarily transmitted to people either by tick bites or through contact with infected animal blood or tissues during and immediately after slaughter. In April, the National Institutes of Health (NIH) issued an advisory urging the prevention of Congo fever ahead of Eidul Azha.\n\nA 25-year-old man, Zubair, a fisherman from Ibrahim Hyderi, passed away on Thursday morning, a day after the disease was confirmed, said a report by DHO Malir Dr Imdad Ali Chandio.\n\nThe victim butchered animals continuously for two days on June 7-8 during Eid. On June 13, he developed high fever with headache and myalgia and went to a hospital in Ibrahim Hyderi but was discharged the same day. After his condition worsened, he went to the Creek General Hospital but was not admitted due to the unavailability of beds.\n\nOn June 16, he went to the emergency ward of the Jinnah Postgraduate Medical Centre (JPMC), where he was diagnosed as a ‘suspected’ case of CCHF and was admitted. The patient’s health deteriorated the next day and he was referred to medical ICU.\n\nDue to the unavailability of bed, he was referred to the Sindh Infectious Disease Hospital & Research Centre (SIDH) where he was placed on ventilator support. The patient passed away on Thursday morning.\n\nThe report said the victim visited the cattle market on Eid and butchered animals for two days as an occasional butcher without safety precautions. The lab result confirmed the prevalence of CCHF on June 18.\n\nDHO Malir said a team was sent to the area and a detailed medical history was taken from his brother and other family members. He said the family members were safe with no symptoms of Congo fever, while other people he was in contact with are being identified.\n\nAmid the rising cases of Congo fever, the provincial health authorities have set up a daily alert system against 35 diseases in the district.\n\nThe Provincial Disease Surveillance and Response Unit (PD SRU) at Directorate General Health Services Sindh said the system is collecting daily case based data from districts across the province to identify unusual increase in cases and timely interventions. It advised the health officers in Malir district to investigate an alert and submit a report within a day.\n\nSindh reported its first death of the year from Congo fever a day earlier, saying a 42-year-old man passed away in Karachi, as per a statement from the provincial health ministry’s media coordinator.\n\nThe deceased, a resident of District Malir, was admitted to the Indus Hospital in Korangi, where he tested positive for CCHF on June 16, said media coordinator for the Sindh health ministry, Meeran Yousuf. The patient passed away the next day. A team of health experts visited his residence but found the door locked.\n\nMeanwhile, the disease killed three people in Khyber Pakhtunkhwa, the province’s Health Adviser Ehtesham Ali confirmed in a statement, raising concerns over public health safety during the Eid holidays.\n\nAli said two of the fatalities occurred last night (Wednesday) at the Hayatabad Medical Complex (HMC), where the patient succumbed to the virus.\n\nKP health department spokesperson Attaullah Khan said three cases of suspected CCHF were brought to the HMC. Naik Shad of South Waziristan was brought dead to the hospital on Tuesday, while Aizaz, 28, and Shafiullah, 70, both residents of Karak, passed away last night.\n\nExpressing sorrow over the loss of lives, the health adviser attributed the deaths to negligence and lack of precaution during Eid celebrations. “These lives could have been saved with timely care and awareness,” he said, urging the public to remain vigilant and strictly follow preventive measures.\n\nHe added that the Integrated Disease Surveillance and Response System (IDSRS), operating under the Public Health department, is actively responding to the outbreak and monitoring the situation closely.\n\nThe district health officers of affected areas have been notified, and contact tracing and sanitisation activities have commenced at the homes of the deceased victims to prevent further transmission, he added. The health department appealed to cooperate with authorities and prioritise hygiene and safety during the ongoing high-risk period.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/19160418afe8b85.jpg",
  "retrievedAt": "2025-08-20T04:18:38.354Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918149/karachi-reports-second-congo-fever-related-death-this-year",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T10:43:08.000Z"
}
