{
  "title": "Balochistan budget 2025-26: Surplus increased to Rs51.5 billion: Nosherwani - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: After revisiting its annual budget for the financial year 2025–26, the Balochistan government identified additional funds by implementing austerity measures across various departments, thereby increasing its surplus budget to Rs51.5 billion, as presented in the Balochistan Assembly the other day.\n\nProvincial Finance Minister Mir Shoaib Nosherwani disclosed this while speaking at a post-budget press conference along with Senior Minister for Planning and Development Mir Zahoor Buledi on Wednesday.\n\nAdditional Chief Secretary Planning and Development Hafiz Basit, Finance Secretary Imran Zarkoon and Spokesman for Balo­chistan Government Shahid Rind were also present on the occasion.\n\nThe finance minister had announced in his budget speech Rs36 billion surplus amount of the government’s development and non-development expenditures. However, he while replying to a question said that the surplus amount is now Rs51.5bn after reviewing the budget allocations.\n\nMinister says PSDP enhanced, while non-development expenditures reduced\n\nTo a question about allocation for law and order, he said that Rs81bn has been earmarked for improving law and order, adding the government is taking all measures for maintaining law and order in the province and providing maximum facilities to the security forces.\n\nHe said that the total layout of the Balochistan budget for the next financial year is Rs1028bn, which include historic surplus of Rs51.5bn with a focus on development and welfare projects.\n\nMr Nosherwani said that the revenues would include 801 billion federal transfers, Rs101bn provincial receipts, Rs37.8bn foreign fund projects assistance (FPA), Rs24bn sui gas lease extension bonus, state trading and Rs26bn cash carry forward.\n\nHe said the government has minimised the non-development expenditures and enhanced the PSDP for fiscal year 2025-26.\n\nThe finance minister said that the provincial government had successfully utilised the entire development budget for the current fiscal year. “Around Rs80 billion will be directly transferred to districts and union councils, benefiting local communities and strengthening local bodies,” he said and added that government believes in strengthening local bodies, which are the basic institution for the democracy.\n\nReplying to a question about MPA fund, he said it was reduced and only those schemes were included in the PSDP which are of collective nature and suggested by the MPAs for their constituencies.\n\nHe further said that in the budget Rs23bn has been earmarked for strengthening district coordination committees (DCC) while Rs500m allocated as special funds under Balochistan Climate Change Fund.\n\nThe government has allocated Rs249.5bn for development of total 6,183 schemes, out of which 3,633 are ongoing and 2,550 are new initiatives.\n\nThe finance minister further said that the volume of current operating expenditure has dro­pped from Rs43bn to Rs33bn due to the austerity measures adopted by the provincial government.\n\nTo another question, Mr Nosherwani said that it was decided to increase the provincial income and a revenue target of Rs124bn has been set in next fiscal year. He said education, health, climate change, law and order were among the top priorities of the provincial government while 4,188 contract-based and 1,958 regular jobs will be created to provide employment to the youth of the province.\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:47.715Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918033/balochistan-budget-2025-26-surplus-increased-to-rs515-billion-nosherwani",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T04:55:48.000Z"
}
