{
  "title": "Chinese student gets life for ‘campaign of rape’: London court - World - DAWN.COM",
  "author": null,
  "content": "A Chinese post-graduate student convicted of drugging and raping 10 women in the UK and China and suspected of having attacked more was on Thursday jailed for life by a London court.\n\nAnd London police say they have evidence to suggest he could have targeted more than 50 other women.\n\nSerial rapist Zhenhao Zou, 28 — described in court as “calculated and predatory” — targeted young Chinese women who he invited to his London flat for drinks or to study before drugging and attacking them.\n\nZou filmed nine of the rapes with hidden or handheld cameras but only two of the 10 victims have ever been identified.\n\nSentencing him at Inner London Crown Court, Judge Rosina Cottage said there was “no doubt that you planned and executed a campaign of rape” that had caused “devastating and long term effects”.\n\nTo the world, he appeared “well to do, ambitious and charming”, but this was a mask hiding a “sexual predator”, she added.\n\nHe treated his victims “callously” as “sex toys” for his own gratification and “desire to assert power over women”, which meant he would be a “risk for an indefinite period”.\n\nZou, wearing a dark suit and glasses, listened impassively in the dock to the sentence via a translator. He will spend a minimum of 22 years in jail, after accounting for time already spent in custody.\n\nThe former engineering student at University College London was found guilty by a jury in March of 28 offences including 11 counts of rape — with two of the counts relating to one woman — three counts of voyeurism and one of false imprisonment.\n\nHe was found guilty of raping three women in London and seven in China between 2019 and 2023.\n\nHe was also convicted of three counts of possessing butanediol — an industrial solvent — with intent to commit a sexual offence and 10 counts of possession of an extreme pornographic image.\n\nVictims told the sentencing hearing in impact statements of the psychological damage they suffered, including nightmares, self-harm and a sense of despair and isolation.\n\nOne recalled “wandering like a trapped animal trying to find an exit” after she was attacked.\n\n“What happened that night is etched on my soul”, she said, adding that Zou’s family was “very powerful in China” and she feared he would “seek revenge”.\n\nAfter the sentence, Saira Pike of the Crown Prosecution Service said: “Zou is a serial rapist and a danger to women.” Pike added that analysis of footage and web chats showed the former student’s “meticulous planning and the horrifying execution of his crimes”.\n\nSince he was convicted, and following an international appeal by UK police, over 20 women have come forward to say they might have been sexually assaulted by Zou. London’s Met police have said they have evidence to suggest he could have targeted more than 50 other women and urged possible victims to come forward.\n\n“Given how prolific Zou seems to have been, there is every potential he could be one of the most prolific offenders that we’ve ever seen,” the Met’s Commander Kevin Southworth said.\n\nSouthworth said 24 potential victims had already contacted officers from “different parts of the globe”.\n\n“The primary places where we believe offending may have occurred at this time appears to be… here in London, and over in China.”\n\nBut given how “active and prolific” Zou appeared to have been, there was “every prospect that he could have offended anywhere in the world”, he added.\n\nThe Met said earlier officers were compiling a file of new evidence to be submitted to prosecutors after Zou’s sentencing.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:35.613Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918201/chinese-student-gets-life-for-campaign-of-rape-london-court",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T15:12:50.000Z"
}
