{
  "title": "Govt ordered to timely provide funds for rehabilitation of demolition drive victims in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court (SHC) on Wednesday directed the provincial government to provide adequate and timely funds for the rehabilitation of families rendered homeless by a demolition drive carried out along three major drains in the metropolis.\n\nThe counsel for the project contractor informed the bench that the work was slowing down due to shortage of funds while the provincial law officer denied the claim.\n\nA petition was filed last month by various individuals seeking implementation of the apex court’s orders about rehabilitation of petitioners and others displaced persons after their homes were demolished around Gujjar, Mehmoodabad and Orangi Town nullahs.\n\nThe petitioners submitted that in August 2023, the Supreme Court had directed the Sindh government to promptly facilitate the rehabilitation process and also monitor the same.\n\nWhen a two-judge constitutional bench headed by Justice Mohammad Karim Khan Agha took up the matter for hearing on Wednesday, the officials informed it that the rehabilitation process was ongoing and the same was confirmed by the advocate general Sindh and the counsel for the project contractor.\n\nThe project contractor submitted that an amount of Rs479 million has been received through the Malir Development Authority while Rs495m has been paid to affected families.\n\nThe bench noted that the parties were at loggerhead on the same issue as the total value of the project was Rs3.6 billion with a target completion date of March 2027.\n\n“While Respondent No.6 [project contactor] claims a shortage of funds is slowing down the work, the Advocate General of Sindh as well as counsel for respondent No.4 [MDA] has refuted this claim. The AG Sindh / counsel for respondent No.4 stated that the Government of Sindh is committed to making timely payments to Malir Development Authority (MDA) / Respondent No.4 and onward to prevent delays and ensure the project’s completion on schedule. Thus, the contractor must be paid adequately and timely by the Government of Sindh so that the project is completed on time,” it added.\n\nWhile disposing of the petition, the bench also noted that such commitment aimed to comply with the Supreme Court’s orders and provide adequate accommodation to those affected and as such this order did not set any precedent. However, such arrangement is subject to the final outcome of the Supreme Court proceedings in this regard, it added.\n\nThe demolition drive was carried out on the orders of the Supreme Court along three major nullahs of the city in order to expand the drains around four years ago.\n\nIn 2021, the apex court had also ordered the provincial and local authorities for compensation and rehabilitation of the affected and displaced families.\n\nThereafter, the provincial authorities informed the apex court that in January last year, the Sindh cabinet had approved the rehabilitation of over 6,900 displaced families, including provision of 80 sq-yd plot for each family in Taiser Town, Malir and construction cost as estimated by the consultant capped at Rs1m.\n\nPleas against placement of names on PNIL\n\nThe Federal Investigation Agency (FIA) on Wednesday informed the SHC that the name of Awab Alvi, son of former President Arif Alvi, has been removed from Provisional National Immigration List (PNIL).\n\nCiting ministry of interior and FIA as respondents, the petitioner had approached the SHC against placing his name on PNIL.\n\nThe counsel for petitioner Ali Tahir argued that on March 24, the petitioner was offloaded from a flight as he was set to travel to Istanbul because the FIA had put his name on PNIL.\n\nThe FIA in its reply said that the name of the petitioner has not been found active in any category of stoplist/watchlist i.e. PNIL.\n\nThereafter, a two-judge bench headed by Justice Zafar Ahmed Rajput disposed of the petition.\n\nThe FIA also filed a similar report in response to another similar petition filed by another PTI leader, Aftab Jahangir, submitting that his name was also placed on PNIL.\n\nPublished in Dawn, June 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:18:45.137Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917952/govt-ordered-to-timely-provide-funds-for-rehabilitation-of-demolition-drive-victims-in-karachi",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T04:56:39.000Z"
}
