{
  "title": "Strong immune system can defeat COVID-19 : Health experts",
  "link": "https://www.app.com.pk/national/strong-immune-system-can-defeat-covid-19-health-experts/",
  "date_published": "2020-04-13T00:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):Health experts Monday advised the people to boost their immune system by changing their lifestyle and eating habits, as a strong body’s defense mechanism could combat coronavirus.\nTalking to PTV news channel, Dr Nausheen Abbas, a Nutritionist said there was considerable evidence that eating habits influenced the immune system, which was responsible for fighting infections and diseases.\nEating fruit and vegetables every day gives the body the best chance of beating any infection at an early stage, without making a person become severely ill, she added.\nShe said regular exercise also played an important role in helping your body fight infections, so try to include some walking sessions for a few kilometers.\nPeople should also have enough sleep and they may also practice meditation to beat the stress, which weakened the immune system, the specialist said.\nDr Nausheen Abbas said although the government had taken steps to restrict the citizens’ movement, closed borders, and businesses, yet everyone should take individual precautionary actions like social distancing and washing hands regularly.\nFor some people, touching, scratching or rubbing the eyes, nose and mouth is an involuntary reflex action. That had to be stopped while hand washing was of utmost importance, she mentioned.\nSocial distancing and washing hands had become the front line in the fight against COVID-19, she added.\nShe said it was best that everyone be mindful of nature: “It is a common sense that we will be healthier if our air, water and land is clean.\nAnother Political Researcher, Kanwal Hassan said, China’s efficient use of modern technology paved the way for fighting coronavirus. The use of thermal equipped drones to conduct thermal imaging and disinfecting robots helped the doctors to diagnose and treat patients effectively.\nThe China’s remarkable fight against coronavirus had been hailed by the World Health Organization and its bold approach to contain the rapid spread of this new respiratory pathogen had changed the course of a rapidly escalating and deadly epidemic.\nThe Chinese people also cooperated with their government and they were still adopting special care and promoting social distancing besides wearing masks, she said.\nShe urged that at this difficult time, the people of Pakistan should also stand firmly with the government’s efforts.\nCOVID-19 was a common challenge for humanity and all the countries should unite and cooperate to overcome it together, she said.\n“Eating the right food and getting proper nutrition are the keys to a healthy immune system,” she added.\n“Vitamins E and C, probiotics, beta-glucans , catechins (a natural antioxidant found in fava beans) and soluble fibre all helped in building up immune cells, said.",
  "retrievedAt": "2025-08-11T19:05:43.029Z"
}
