{
  "title": "Ensuring relief for labourers, daily-wagers top priority : PM",
  "link": "https://www.app.com.pk/national/ensuring-relief-for-labourers-daily-wagers-top-priority-pm/",
  "date_published": "2020-04-13T05:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):Prime Minister Imran Khan on Monday said the foremost priority of the government amid coronavirus situation was to provide relief to weaker segment of society particularly labourers, daily-wagers and people with humble background.\nThe prime minister expressed these views while chairing a review meeting on the implementation of financial package announced by the government.\nThe meeting was attended by federal ministers including Syed Fakhar Imam, Hammad Azhar, Omar Ayub, Asad Umer, Finance Adviser Dr Abdul Hafeez Sheikh, Commerce Adviser Abdul Razak Dawood, Adviser on Institutional Reforms Dr Ishrat Hussain, Special Assistant on Social Welfare Dr Sania Nishtar, Chairman National Disaster Management Authority Lt Gen Muhammad Afzal, the Managing Director Utility Stores Corporation and other senior officials.\nThe Finance Secretary gave an in-depth briefing on the so far progress on financial assistance worth Rs 1.2 trillion announced for different sectors.\nThe Managing Director Utility Stores briefed about the position of available stock of items and arrangements in view of the month of Ramzan.\nThe meeting was apprised that Rs 25 billion were immediately provided to NDMA for necessary arrangements against coronavirus including diagnosis and treatment of affected patients.\nFifty billion rupees were allocated for medical equipment and facility of doctors and paramedic staff.\nFor tax relief on food and health, Rs 15 billion have been allocated, of which Rs 10 billion have been spent so far.\nFor relief of daily-wagers, an amount of Rs 200 billion has been allocated. For other weaker segments and shelter homes, Rs 150 billion have been disbursed already, of which Rs 6 billion are reserved for expansion of network of shelter homes.\nFor relief to consumers of petrol and diesel, Rs 70 billion have been allocated.\nThe public will benefit from Utility Stores, for which Rs 50 billion have been disbursed for sale of items on cheaper rates.\nOn relief in electricity and gas consumer bills, the government will provide a relief of Rs 100 billion. Exporters will also get a relief of Rs 100 billion.",
  "retrievedAt": "2025-08-11T19:05:36.565Z"
}
