{
  "title": "PM launches Tele School Television Channel, says channel to benefit children of far-flung areas",
  "link": "https://www.app.com.pk/national/pm-launches-tele-school-television-channel-says-channel-to-benefit-children-of-far-flung-areas/",
  "date_published": "2020-04-13T10:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):Prime Minister Imran Khan on Monday launched Tele School Television Channel and said the government would utilize all its resources to improve the channel.\nHe maintained the channel would also benefit children living in far-flung areas.\nSpeaking at the launching ceremony here, the prime minister said the aim of the initiative was to provide education to children at their doorsteps during the lockdown situation.\nTerming it a great concept particularly in remote areas of the country where there was no infrastructure for primary education, he said the initiative should be continued after the end of coronavirus disease.\nThe prime minister congratulated the ministry of Federal Education and Professional Training and Pakistan Television for collaborating in launching of the channel and said it was a revolution in the present situation as the whole world was heading toward distance education.\nThe prime minister said that there were complaints of below standard education in government schools in remote areas of the country and also referred to a number of such complaints in his home constituency Mianwali.\nHe said the tele school television channel was a productive opportunity for the parents and said the step would also help out the large number of children who had been dropped out of schools.\nHe said Pakistan was lagged behind in tele education and tele medicines and said through this system and mobile phones adult education would also be promoted.\nMinister for Federal Education and Professional Training Shafqat Mahmood said around 20 million children in Pakistan were out of schools and during the last 70 years Pakistan’s literacy was just 60 percent, in which those people had also been included literate who could just write their name.\nHe said in the present critical situation this was a great opportunity as it would help the people in getting education through their mobile phones. He said by developing such kind of Applications it would have great impact on the urban and rural gap in education sector.\nThe channel, which is an initiative of the Ministry of Federal Education and Professional Training, will be available on satellite, terrestrial and cable. The educational channel will broadcast programmes from 8 am to 5 pm every day and will deliver content from grades 1 to 12.\nThe morning session with English, Maths, Urdu and General Science lessons is dedicated for junior students and the next session with all subjects for seniors. The Education Ministry also developed a course schedule for the channel.",
  "retrievedAt": "2025-08-11T19:05:32.223Z"
}
