{
  "title": "Coronavirus: Online portal launched to welcome expats charitable donations",
  "link": "https://www.app.com.pk/national/covid-19-overseas-ministry-launches-website-to-welcome-pakistani-expats-charitable-donations/",
  "date_published": "2020-04-13T03:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):The Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD) has launched an online platform (website) which enables the Pakistani expats to donate upto USD 10,000 for the Prime Minister’s Corona Relief Fund, set up recently to fight coroanvirus in the country.\nThe online portal will also help the overseas Pakistanis to provide a few months ration to the several families, who got affected due to the partial lock-downs enforced in the country to stem the spread of coronavirus.\n“Now, the Pakistani expatriates can take responsibility of the most vulnerable families whose lives are devastated by the partial lockdowns,” Special Assistant to the Prime Minister on Overseas Pakistanis Sayed Zulfikar Abbas Bukhari said while launching the website here at his office on Monday.\nHe said the website would work as a conduit for the donations of overseas Pakistanis towards the Prime Minister’s COVID Relief Fund. It would also help the expats to directly take responsibility of a family’s ration for a certain period of time, he added.\nThe special assistant said the overseas Pakistanis could donate upto USD 10,000 on the website -covid.ophrd.gov.pk- to support the government’s relief effort against the coronavirus.\n“We have designed different types of buckets on the website through which an expat can support multiple families who cannot make their ends meet in such trying times,” he said while urging the overseas Pakistani to donate generously towards the national cause.\nZulfikar Bukhari said his ministry would launch a ration distribution drive to deliver cooked meal and food at the doorsteps of most affected people. “It is the vision of Prime Minister Imran Khan to take care of poor and needy so we, being his cabinet members, will lead from the front for such a humanitarian cause.”\nHe said the government had also taken a landmark initiative of Ehsaas Emergency Cash under which daily wagers and destitute were being reached out across the country to offer them Rs 12,000 financial support in such harsh times.\n“Donation to the PM Corona Relief Fund from overseas is now just a click away,” said a senior officer at the OP&HRD ministry while sharing more details about the website.\nHe said the overseas Pakistani could easily donate through various channels like Paypal. In fact, it was a platform to encourage the donations of overseas Pakistanis and facilitate them in supporting the downtrodden segments of Pakistan, he added.\nThe officer said an awareness campaign on the social media was also underway to sensitize the affluent Pakistani Diaspora about the portal. Short Video Messages of the celebrities and political leaders had also had been released on the official social media pages of the ministry for the purpose, he added.",
  "retrievedAt": "2025-08-11T19:05:41.526Z"
}
