{
  "title": "Govt taken steps on war footing to keep nation save from coronavirus: Zartaj Gul",
  "link": "https://www.app.com.pk/national/govt-taken-steps-on-war-footing-to-keep-nation-save-from-coronavirus-zartaj-gul/",
  "date_published": "2020-04-13T00:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):Minister of State for Climate Change Zartaj Gul Monday said that the government under the leadership of Prime Minister Imran Khan has taken steps on war footing to keep the people of Pakistan safe from coronavirus.\nThe government was making serious efforts to cope with the challenge of COVID-19 as well as to retrieve the economy of the country, she said while speaking to a private news channel.\nShe said Prime Minister Imran Khan has a clear motive to facilitate the poor segment of the country by all means.\nThe government was monitoring the situation very closely and taking all possible measures to retrieve the economy that is affected after the outbreak of COVID-19 and lockdown in the country.\nThe main focus of the government was to maintain supply and demand of commodities so that the consumer could not suffer, she added.\nZartaj said the nation has confidence on the leadership of PM Imran Khan, adding, the Prime Minister has also announced a package for construction industry that will create job opportunities for the people.\nMany other industries are also linked with construction industry, she added.\nThe government advising the people to stay at home in the current situation, she said, adding, the entire world including Pakistan is fighting against COVID-19.\nUnder Ehsaas program, the cash disbursement to the deserving families has been started and people registered with BISP are getting relief as well, she said.\n“I am confident that Pakistan will be able to get rid of this pandemic very soon and once the COVID-19 issue is over, Pakistan will become a more vigilant country”, she added.\nPrime Minister is very anxious and worried about the condition of poor segment of society including daily wagers and labors in current situation. Due to this reason, the government has never supported the complete lock-down in the country, she mentioned.\nThe Prime Minister has also announced to start the construction industry as many other industries will also start operation. Construction sector was declared as an industry by the current government recently.\nThe federal government in collaboration with the provinces is determined to get rid of this pandemic disease and providing relief to the people as well, she said.",
  "retrievedAt": "2025-08-11T19:05:44.298Z"
}
