{
  "title": "Pakistan to have capability to locally produce PPE kits, N95 masks: Mirza",
  "link": "https://www.app.com.pk/national/pakistan-to-have-capability-to-locally-produce-ppe-kits-n95-masks-mirza/",
  "date_published": "2020-04-13T06:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):Special Assistant to the Prime Minister on National Health Services Dr. Zafar Mirza on Monday said the government would soon start local production of Personal Protective Equipment (PPE) kits and N95 masks to effectively combat coronavirus (COVID-19).\nIn a televised daily briefing on COVID-19, Dr. Mirza said with achieving the capability of producing these important items at local level, the country would be able to manage its demand and supply in wake of prevailing high risk corona situation.\nHe said there was a plan to locally produce over 100,000 N95 masks on daily basis. He, however said the N95 mask was relevant to only frontline health teams including doctors and paramedical staff and it should not be used by citizens.\nHe advised people to avoid unnecessary use of N95 mask and strictly follow the social distancing and other precautionary measures against coronavirus.\nHe said the citizens should continue implementing protective measures as per health officials’ directions to prevent from carrying coronavirus, adding the government was making all out efforts to send protective equipment guidelines to all doctors, paramedical health workers and all others who were connected with coronavirus patients.\nHe directed the doctors and para medical staff to implement guidelines on use of masks and personal protection equipment (PPE) kits to ensure safety from COVID-19. He said a list of all such hospitals had been prepared where the heal staff was directly involved with the Corona patients.\nHe added that N95 masks and PPE kits had been provided to all such hospitals for protection of health staff and they were also being informed about the proper use of these equipment.\nHe said the government had been working on a strategy to stop local transmission of coronavirus as 52 percent patients got virus from local sources.\nMirza said in early days, the country had only four laboratories to diagnose coronavirus, however the government had increased this capacity to 27 laboratories now, which would be further increased up to 34, he added.\nHe said now a days daily 3,000 testes were being conducted to diagnose corona while the government had fixed the target of 20,000 to 25,000 daily tests from next month. He added that it was a sign of relief that the country had enough quantity of testing kits.\nHe said 5,374 confirmed cases had been reported with an increase of 336 new cases during the last 24 hours.",
  "retrievedAt": "2025-08-11T19:05:32.245Z"
}
