{
  "title": "Coalition parties for larger bench to avoid discrimination: Sherry",
  "link": "https://www.app.com.pk/national/coalition-parties-for-larger-bench-to-avoid-discrimination-sherry/",
  "date_published": "2022-07-25T13:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Monday said the coalition parties in their plea requested the apex court’s larger bench to circumvent discrimination during the proceedings of the Pakistan Muslim League (PML-Q) leader Chaudhary Parvez Elahi’s petition challenging the deputy speaker’s ruling.\nLIVE #APPNews : Minister for Climate Change @sherryrehman talks to media outside Supreme Court #Islamabad  https://t.co/BEDvljyJ4R\n— APP  (@appcsocialmedia) July 25, 2022\nAddressing media outside the Supreme Court, the minister said there were contradictory standards of the authorities on the issue of letter of PML-Q President Chaudhary Shujat Hussain presented at the Punjab Assembly.\n“There is no doubt about it that the party leader is the parliamentary leader of any political party at the floor of the house. He is the one who nominates his party’s parliamentary leader in the Assembly,” Sherry Rehman said.\nShe said it was clear that the leadership of the coalition government was hoping that the apex court’s larger bench would be allowed to hear the case for ensuring fairness.\nThe minister said that Article 63-A had been discussed which was silent on the issue that the political party leader’s directives would be given preference over the decree of a parliamentary leader who was being nominated by the political leader of that party.\n“The previous decisions were given on this precedent that if there was dispute between a party’s leadership then how could it form a government in the parliament,” she said.\nShe maintained that the Pakistan Peoples Party (PPP) filed its petition through Farooq H. Naik, however neither Naik nor the counsel for the Jamiat Ulema-e-Islam (JUI-F) were allowed to argue in the apex court.\n“The court is requested to hear all the political parties, as Farooq Naik was not heard despite his request,” she maintained.\nThe minister said the Pakistan Tehreek-e-Insaf (PTI) was creating chaos in the country as there was uncertainty all over, “The economic crisis will subside once the political turmoil is over.”\nShe said PTI was questioning about the performance of the coalition government adding, “They have left Rs50,000 billion debts with unfavourable terms and conditions violated by the PTI regime repeatedly during its tenure. Over 23 International Monetary Fund (IMF) programmes were managed by the country and none of the previous regimes backed out from IMF deals.”\nResponding to a question, she said the parliamentary leader used to implement the directions on legislation guided by the party president and also direct voting in the elections of the house.",
  "retrievedAt": "2025-08-11T15:17:32.097Z"
}
