{
  "title": "All institutions should work under constitution: Wali",
  "link": "https://www.app.com.pk/national/all-institutions-should-work-under-constitution-wali/",
  "date_published": "2022-07-25T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP): Awami National Party (ANP) leader Aimal Wali Khan on Monday said all institutions of the state should work under the constitution of Pakistan or otherwise the country could head towards chaos.\nAddressing a joint press conference flanked by the members of the Federal Cabinet, Khan said the political leadership gave constitution to this country and it united the nation. “There is no precedent to the mockery being made of the constitution since its inception,” he said.\nAimal Wali Khan was of the view that there was no point of ‘all parties’ sitting together to save the country when decisions of the nation’s fate were being made elsewhere.\n“If a party president has no power then there is no use of his position and parliamentary leader must be given his powers,” he queried, adding, “the parliamentary leader is answerable to the party president”.\nWali Khan said, “the time has come to save the country and its economy,” and added that if constitutional violations were left unpunished then the country could lead towards anarchy.\nANP leader said, “I want to request through this platform that if anything happens to this government then its leadership should be allowed to decide its future course to cope with the situation. We will have to hold the Pakistan Tehreek-e-Insaf Chairman accountable if we want to save this country.”\nIndependent MNA from Balochistan, Mohammad Aslam Bhootani while responding to the news regarding the recent decision that barred all political parties’ leaders from entering the Apex Court’s premises, he said, “We should all go there and confirm the veracity of the verdict”.\nPakistan Muslim League-Quaid (PML-Q)’s leader Tariq Bashir Cheema also endorsed all the coalition parties’ decision for a full court bench of the Supreme Court to hear the case regarding Hamza Shehbaz’s election as Punjab chief minister.\n“I hope the Supreme Court will accept the decision of a full court bench as there is no harm in it and it’s a simple public demand,” he said.",
  "retrievedAt": "2025-08-11T15:17:28.869Z"
}
