{
  "article_id": "2025-07-10_bd0f7e18127842a40c4bbe543bdeb2a1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-maintains-arrest-warrants-of-gandapur-initiates-process-to-declare-aamir-kayani-as-absconder/",
    "retrieved_at": "2025-08-27T09:26:02.107Z"
  },
  "metadata": {
    "title": "ATC maintains arrest warrants of Gandapur, initiates process to declare Aamir Kayani as absconder",
    "author": null,
    "date_published": "2025-07-10T16:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 461,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 10 (APP): An Anti-Terrorism Court (ATC) on Thursday maintained the arrest warrants of Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur and also ordered to initiate the process to declare former minister Amir Mahmood Kayani as proclaimed offender. The court of Judge Tahir Abbas Sapra heard the case. It maintained the arrest warrants of Gandapur for his continuous non-appearance despite being summoned in the Faizabad protest case on the disqualification of the founder of PTI. During the hearing, Ilyas Siddiqui, Raja Zahoor, and others appeared in the court on behalf of the accused. The court marked the attendance of present accused including Faisal Javed Khan, Wasiq Qayyum and others. Chief Minister KPK Ali Amin Gandapur did not appear in the court and his lawyer Raja Zahoor informed the court about the decision of the Peshawar High Court, on which Judge Tahir Abbas Sapra said that the status of Ali Amin Ganda's warrant and proclaimed offender will remain the same. The Islamabad Police should implement the decision of the Peshawar High Court. During the hearing, a petition for acquittal was filed by Faisal Javed Khan, on which Judge Tahir Abbas Sapra told the lawyer to give arguments on Faisal Javed's acquittal plea, I will take notice now and call the prosecutor as well. Defence Lawyer said that the arguments to be given on this are the same as the plea. It was said that Faisal Javed has no role in the case, the CDR record regarding Faisal Javed was not presented. Judge Tahir Abbas Sapra said that I will decide on it after hearing the arguments of the prosecutor. The court started the process of declaring Aamir Mahmood Kayani as a proclaimed offender due to his continuous non-appearance and inquired about the situation regarding the evidence in this case. On which Ilyas Siddiqui Advocate said that first the process of declaring as a proclaimed offender is completed and only then will the proceedings proceed. The Judge said that you are not Aamir Kayani's lawyer, it is a separate process. Ilyas Siddiqui Advocate said that I am not speaking on behalf of Aamir Kayani but regarding my accused. The court inquired that you should tell me what is the next date to be fixed for the case. On this occasion, Faisal Javed Khan requested the court to give a long date stating that we have to come from far away. The Judge said that I will give a date of September, you give an assurance, your lawyer will allow the evidence to be recorded on next date. Advocate Ilyas Siddiqui said, \"I cannot give any assurance in this regard. The court adjourned the hearing of the case until July 21. A case has been registered against PTI workers in Police Station I-9.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}