{
  "article_id": "2025-07-10_396ec9e004486818a0c6af8f4a047b57",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/both-motorcycle-riders-must-wear-helmets-itp-launches-awareness-campaign/",
    "retrieved_at": "2025-08-27T09:26:24.953Z"
  },
  "metadata": {
    "title": "Both motorcycle riders must wear helmets: ITP launches awareness campaign",
    "author": null,
    "date_published": "2025-07-10T14:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 246,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 10 (APP):Islamabad Traffic Police (ITP) has made it mandatory for both the rider and pillion passenger, regardless of gender, to wear helmets while riding motorcycles in the federal capital. An official told APP on Thursday that the initiative has been launched under the special direction of Inspector General of Police (IGP) Islamabad Syed Ali Nasir Rizvi, with Chief Traffic Officer (CTO) Captain (R) Syed Zeeshan Haider leading its implementation. CTO Zeeshan said that a two-week comprehensive awareness campaign has been launched prior to the enforcement drive. \"The campaign includes public seminars, social media outreach, radio broadcasts, and distribution of educational materials to inform citizens about the life-saving benefits of helmet use,\" he stated. He warned that after the awareness phase, strict legal action will be taken against violators. \"If either the rider or the pillion passenger is found without a helmet, traffic police will impose fines under relevant traffic laws. In case the passenger fails to comply, the rider will be held responsible,\" he explained. Emphasizing the importance of helmets, the CTO noted that their use can reduce the risk of head injuries by up to 50 percent during accidents. \"Our goal is not punishment, but protection. Ensuring the safety of commuters remains our top priority.\" He further added that this step is part of ITP's broader vision for a modern, well-integrated traffic management system that ensures public safety in Islamabad. The CTO urged citizens to extend full cooperation in making the initiative successful.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}