{
  "article_id": "2025-07-10_8345b5f71cfe52cf01910e56c911dd77",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/comstech-iilm-joint-workshop-healthcare-leadership-global-models-for-transforming-systems-culture/",
    "retrieved_at": "2025-08-27T09:26:49.441Z"
  },
  "metadata": {
    "title": "COMSTECH–IiLM Joint Workshop “Healthcare Leadership: Global Models for Transforming Systems & Culture”",
    "author": null,
    "date_published": "2025-07-10T12:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 249,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 10 (APP): In a significant initiative to enhance healthcare leadership and system transformation in the Islamic world, OIC-COMSTECH in collaboration with the Institute of Innovation Leadership in Medicine (IiLM) will organize a high-impact workshop titled \"Healthcare Leadership: Global Models for Transforming Systems and Culture\" on July 17.The event will take place at the COMSTECH Secretariat in Islamabad, with both physical and virtual participation.The workshop will be facilitated by Dr. Zakiuddin Ahmed, a distinguished healthcare leader and founder of IiLM. Dr. Ahmed also serves as the Secretary of the Health Research Advisory Board (HealthRAB).His expertise in strategic healthcare leadership and innovation will guide participants through critical insights and models to drive effective leadership practices in healthcare systems.The program will formally commence with welcome remarks from Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General, OIC-COMSTECH, a Mustafa (PBUH) Prize Laureate and a leading figure in science diplomacy and research collaboration in the Islamic world. Throughout the four-hour workshop, participants will explore a wide range of leadership topics including:situational analysis and need for leadership in healthcare, leadership styles and models, strategic planning and global leadership frameworks and best practices.The session will conclude with a vote of thanks and distribution of certificates, aiming to equip attendees with actionable knowledge and frameworks to implement within their institutions and health systems.This workshop is organized under the Science, Technology and Innovation Cooperation (STIC) initiative of OIC-COMSTECH, in partnership with IiLM, and is open to healthcare professionals, policymakers, researchers, and leadership practitioners across OIC member states.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}