{
  "article_id": "2025-07-10_cce065d0c81101be53fcecb96c8bd908",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-urgent-restructuring-of-national-tariff-commissions-powers-responsibilities/",
    "retrieved_at": "2025-08-27T09:26:52.181Z"
  },
  "metadata": {
    "title": "PM directs urgent restructuring of National Tariff Commission’s powers, responsibilities",
    "author": null,
    "date_published": "2025-07-10T08:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 10 (APP): Prime Minister Shehbaz Sharif on Thursday directed the relevant authorities to carry out an urgent restructuring of National Tariff Commission's legal, administrative, and other institutional powers and responsibilities to enhance its effectiveness. The prime minister, chairing a review meeting on the performance of the National Tariff Commission, instructed for third-party review of the NTC's recent performance and remodeling the organisation on modern lines to meet the requirements of the new tariff regime effectively. He said that the NTC should be cognizant of all ground realities related to domestic business, imports, exports, and markets. The automated and efficient research capabilities of the NTC can play a key role in resolving issues faced by domestic businesses, he added. Prime Minister Shehbaz said that the government was committed to addressing the NTC's training and resource deficiencies and aligning its operations with modern requirements. He directed the immediate activation of the NTC's Appellate Tribunal and also sought a briefing on the implementation of the given directives by next month. The meeting was attended by federal ministers Dr. Musadik Malik, Muhammad Aurangzeb, Ahad Khan Cheema, and Ali Pervez Malik, and relevant senior government officials. Ishtiaq Ahmed, APP's Foreign Editor, leads coverage of the Prime Minister, President and Foreign Office, bringing over 20 years of journalism experience from local and international publications - Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}