{
  "article_id": "2025-07-10_3cbc7405c6f57bc9fb9a766fc1c9f337",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-army-vows-decisive-action-against-indian-proxies/",
    "retrieved_at": "2025-08-27T09:26:04.992Z"
  },
  "metadata": {
    "title": "Pakistan Army vows decisive action against Indian proxies",
    "author": null,
    "date_published": "2025-07-10T14:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 394,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI , Jul 10 (APP): Field Marshal Syed Asim Munir chaired the 271st Corps Commanders' Conference (CCC) at General Headquarters (GHQ) where the Forum pledged decisive action against Indian-backed proxies, reviewed regional security and lauded Pakistan Navy and Air Force for enhancing tri-services synergy. Forum offered Fateha for the martyrs of recent terrorist attacks by Indian sponsored proxies. Taking stock of recent successes against terrorist proxies, Forum resolved that blood of our Shuhada will not go waste and the safety and security of people of Pakistan remain top most priority for the Armed Forces of Pakistan. Forum strongly asserted that it is imperative to take decisive and holistic actions at all levels against the Indian backed and sponsored proxies. Following its manifest defeat in direct aggression against Pakistan, post Pahalgam incident, India is now doubling down to further its nefarious agenda through its proxies of Fitna Al Khawarij and Fitna Al Hindustan. The COAS shared details of Pakistan's proactive and successful diplomatic manoeuvre, including recent visits to Iran, Turkiye, Azerbaijan, Kingdom of Saudi Arabia and UAE, where the COAS accompanied the Prime Minister. Forum was also briefed on the historic and unique visit of the COAS to US, where meetings with top-tier leadership, afforded an opportunity to share, first hand, Pakistan's objective perspective on bilateral, regional and extra-regional developments. The Forum conducted a holistic review of the prevailing internal and external security dynamics, with particular emphasis on the recent developments in Middle East and Iran and growing propensity for 'use of force' as a preferred policy tool, which warrants persistent development of self-reliant capabilities as well as national unity and resolve. Taking note of Indian Army's baseless insinuations to offset its comprehensive defeat, COAS stated, \"Invoking third parties in what is unmistakably a bilateral military confrontation reflects a disingenuous attempt at bloc politics aimed at falsely projecting India's self-assigned role as a net security provider to accrue benefits in a region that is visibly growing disillusioned with Indian hegemonic ambitions and Hindutva driven extremism\". The Forum was briefed on Pakistan's Army's ongoing drive with quick adaptation towards evolving threat spectrum and changing character of war. The COAS also appreciated the leadership of Pakistan Navy and Pakistan Air Force for further strengthening tri-services synergy. In his concluding remarks, the Army Chief expressed full confidence in the operational readiness of Pakistan Army against complete threat spectrum.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}