{
  "article_id": "2025-07-10_5e9e3ae5c8dbc39c4586b63f19c671d4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-launches-non-formal-education-report-2023-24-minister-siddiqui-stresses-data-driven-education-policy/",
    "retrieved_at": "2025-08-27T09:27:09.953Z"
  },
  "metadata": {
    "title": "AIOU launches Non-Formal Education Report 2023-24; Minister Siddiqui stresses data-driven education policy",
    "author": null,
    "date_published": "2025-07-10T09:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 337,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 10 (APP):The launching ceremony of Pakistan's Non-Formal Education Report 2023-24 was held on Thursday at Allama Iqbal Open University (AIOU), with Federal Minister for Education and Professional Training, Dr. Khalid Maqbool Siddiqui, attending as the chief guest. During the ceremony, Dr. Siddiqui formally unveiled the annual report, terming it a vital instrument for policy formulation and database development in the field of non-formal education. Federal Secretary for Education, Nadeem Mehbub, also participated in the event. The Minister appreciated the collaborative efforts of the JICA-supported AQAL Project and the Pakistan Institute for Education (PIE), which contributed to the development of this report. Highlighting the significance of data, Dr. Siddiqui noted, \"Access, quality, and governance in non-formal education can only be improved through robust and reliable data systems.\" He emphasized that the EMIS (Education Management Information System) cell dedicated to non-formal education is functioning effectively and is instrumental in tracking progress. The Minister announced that the Federal Non-Formal Education Policy 2025 is currently under preparation with the ambitious goal of achieving \"Zero Out-of-School Children.\" Work is also ongoing on the National Action Plan for Non-Formal Education 2025, he added. Dr. Siddiqui revealed that a comprehensive management framework and standardized assessment system for teachers will soon be introduced. Furthermore, out-of-school children are being brought back into the education system through accelerated learning programs. He reiterated that the Ministry is prioritizing data-driven policymaking, which aligns with modern educational needs. \"This report reflects strong coordination among federal and provincial institutions,\" he stated, and praised the contributions of PIE and JICA as \"commendable.\" Calling upon all stakeholders, Dr. Siddiqui urged them to make full use of the data provided in the report to enhance educational planning and outreach. \"Education is the foundation of any progressive society,\" the Minister emphasized. \"No nation can move forward without investing in education.\" Special attention is being given to female education, he said, noting that \"educated women are being empowered economically, and their participation is essential for national development, as they represent half of the population.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}