{
  "title": "Nine booked in Sargodha for threatening flood survey teams - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: The Laksian police have booked nine people on Sunday for allegedly stopping an agriculture department survey team at gunpoint during flood assessment in Kot Momin tehsil.\n\nAs per the complaint filed by Asad Abbas, the survey team leader of the agriculture department, nine armed men led by Ali Abbas threatened the team of dire consequence during a survey in Talib Wala area in Kot Momin tehsil of Sargodha. He claimed that the men stopped them from performing their official duties and forced them to leave the area.\n\nThe police registered a case against one identified and eight unknown suspects.\n\nDPO Sohaib Ashraf took notice of the incident and directed the Kot Momin SDPO to arrest the suspects.\n\nMeanwhile, Sargodha Commissioner Jahanzeb Awan, along with Deputy Commissioner retired Capt Muhammad Waseem, visited Kot Momin tehsil to review the ongoing and completed flood damage assessment surveys in Khan Muhammad, Sial Mor and Rahanwala areas.\n\nOn this occasion, the survey teams were briefed about the survey methodology and data collection. The commissioner directed to ensure transparency and accuracy in all stages of the survey.\n\nHe said that the survey process should be completed soon so that the affected families could get compensated. He said that after this, two additional re-verification teams would thoroughly check the records to ensure that there were no mistakes or omissions.\n\nThe commissioner stressed that the district administration, PDMA and the revenue department should maintain close contact with each other so that the relief money reaches the real victims directly.\n\nACCIDENT: A man died after being hit by a high-speed train on Sunday near Bhalwal.\n\nThe body of the deceased, identified as Ali Raza, was handed over to his heirs after necessary formalities.\n\nAs per details, Ali Raza, a father of two, lost his life after being hit by a high-speed train near Bhalwal on the Sargodha-Lalamusa railway track. The Railway Police were investigating the incident.\n\nMeanwhile, two people were killed and another two were seriously injured when a car fell into a canal due to high speed.\n\nAccording to details, Naveed Ahmed (38) and Muhammad Khan (45) of Kale Da Kot died when their car fell into a canal near Ghulapur Bangla of Kot Momin in Sargodha. Two others, Bilal and Omar Hayat, were seriously injured in the accident and were shifted to the THQ Hospital.\n\nANTI-SMOG CAMPAIGN: Additional deputy commissioner general (ADCG) Rana Muhammad Abu Bakar has directed all departments to intensify activities to eliminate smog.\n\nIn a meeting of the district anti-smog committee, he said that awareness should be provided to farmers to prevent stubble burning. Action should be taken against violators under a zero tolerance policy, he added.\n\nHe said that the traffic police should take strict action against smoke emitting vehicles, while the regional transport authority should ensure transparency in issuance of fitness certificates.\n\nAlong with this, the district agriculture, environment and local government departments should jointly run an awareness campaign so that the public could be informed about the harm caused by smog and how to prevent it.\n\nMr Abu Bakar said that as per the instructions of the Punjab government, no negligence would be tolerated during the anti-smog campaign. All officers should be present in the field and ensure compliance, so that citizens could be provided with a clean and healthy environment.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:44:05.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946918/nine-booked-in-sargodha-for-threatening-flood-survey-teams",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T02:30:53.000Z"
}
