{
  "title": "Kech Cultural Festival sees record book sales - Pakistan - DAWN.COM",
  "author": null,
  "content": "GWADAR: The Kech Cultural Festival in Turbat set a new record for book sales this week, with titles worth Rs6.2 million sold over three days, according to the district administration.\n\nOverall sales at food and other stalls generated another Rs2.6m, bri­n­ging the combined total to Rs8.8m.\n\nOrganised by the Kech district administration, the festival drew more than 22,000 visitors on its final day, including families, students and the general public. Officials said this year’s book sales comfortably surpassed last year’s tally of Rs3.2m.\n\nStudents from local colleges and universities accounted for a large share of purchases, showing keen interest in books on current affairs, biographies, governance, democracy and related subjects. Administrators said the establishment of three universities in Kech has noticeably expanded the community of readers.\n\nThree-day festival draws 22,000 visitors on final day\n\nNotable attendees at the closing ceremony included National Party chief Dr Abdul Malik Baloch, Senator Jan Muhammad Buledi, Lala Rasheed Dashti, Mir Hammal Baloch, Ashraf Hussain, Additional Deputy Commissioner Kech Tabish Ali, Assistant Commissioner Turbat Muhammad Jan Baloch, SSP Zohaib Mohsin, Prof Dr Ghafoor Shad, Ismail Khaliq, Khalil Tigrani and Waja Bijjar Baloch.\n\nDeputy Commissioner Kech Bashir Ahmed Barrech, whose office organised the event, hailed the festival as “historic and successful in every respect”.\n\n“The enthusiasm and love shown by the people of Kech over these three days are unforgettable. This success is the result of public participation,” he said.\n\nMr Barrech said the administration formed an active outreach team to lift spirits after a period of frustration in the area, visiting universities, colleges, schools and offices to encourage residents to take part.\n\nHe thanked Dr Abdul Malik Baloch for his personal efforts and acknowledged the support of Turbat University, Turbat Press Club and other local institutions.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e30f83b9893.jpg",
  "retrievedAt": "2025-10-12T13:11:08.913Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946890/kech-cultural-festival-sees-record-book-sales",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:15.000Z"
}
