{
  "title": "Sidra Amin reprimanded for code of conduct breach during India clash - Sport - DAWN.COM",
  "author": null,
  "content": "Top batter Sidra Amin was reprimanded for breaching Level 1 of the ICC Code of Conduct during their ICC Women’s Cricket World Cup 2025 match against India in Colombo.\n\nIndia won Sunday’s match against Pakistan by 88 runs, with Sidra Amin scoring 81 runs during the encounter. She also become the first Pakistani batter to hit a six against India in a women’s ODI match.\n\nThe right-handed batter was found guilty of breaching Article 2.2 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to “abuse of cricket equipment or clothing, ground equipment or fixtures and fittings during an international match.”\n\nThe incident occurred during the 40th over of Pakistan’s chase, when Sidra forcefully hit her bat onto the pitch after being dismissed.\n\nIn addition to the reprimand, one demerit point has been added to Sidra’s disciplinary record. This is her first offence in a 24-month period, ICC reports.\n\n“Level 1 breaches carry a minimum penalty of an official reprimand, a maximum penalty of 50 per cent of a player’s match fee, and one or two demerit points,” ICC reported.\n\nOn-field umpires Lauren Agenbag and Nimali Perera, third umpire Kerrin Klaaste and fourth umpire Kim Cotton had levelled the charges.\n\nSidra admitted the offence and accepted the sanction proposed by Shandré Fritz of the Emirates ICC International Panel of Match Referees, negating the need for a formal hearing.\n\nPakistan play their next match on Wednesday, October 8 against Australia.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/06192458f5ce325.webp",
  "retrievedAt": "2025-10-12T13:10:28.490Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947020/sidra-amin-reprimanded-for-code-of-conduct-breach-during-india-clash",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T14:27:28.000Z"
}
