{
  "title": "More hot air - Newspaper - DAWN.COM",
  "author": null,
  "content": "FREQUENT threats and wild assertions made by Indian officials directed at Pakistan only ensure that the doors of dialogue will remain closed for the foreseeable future, and a climate of toxicity will continue to dominate South Asia.\n\nAfter the Pahalgam episode, the BJP-led government has gone into overdrive to demonise Pakistan, aided by hawkish elements in the Indian media. Perhaps its performance on the battlefield — or lack thereof — during the May skirmishes and the global community’s unwillingness to buy New Delhi’s anti-Pakistan narrative have, along with Islamabad’s diplomatic successes, been a major reason for India’s frustration.\n\nHence its rulers are intent on sabre-rattling to cover up their inadequacies. Two senior Indian military officials made deplorable remarks recently, which only further vitiate the atmosphere. The Indian army chief, while speaking to his troops, said his country would not show ‘restraint’ and that “the opportunity will come soon”, while threatening this country. India’s air chief said that his forces had shot down several Pakistani jets during Operation Sindoor, when there is no evidence to back his delusional claim.\n\nIt is clear that India’s military men get their cue from their politicians and bureaucrats. For example, there were several terse exchanges between Pakistani and Indian officials at last month’s UN General Assembly. Prime Minister Shehbaz Sharif, while defending Pakistan’s military actions during the May clashes, held out the offer of “comprehensive dialogue” with India.\n\nNew Delhi’s foreign minister used the same platform, without naming Pakistan, to criticise “a neighbour” as the “epicentre of global terrorism”. Meanwhile, in remarks that were definitely not cricket, the Indian prime minister, following his country’s Asia Cup victory, termed the result “Operation Sindoor on the games field”.\n\nSome commentators believe that the continued hostility towards Pakistan serves domestic political interests in India by shoring up the rabid Hindutva political base, as well as grabbing votes in close elections, such as the Bihar state polls due next month.\n\nWhatever the Indian ruling party’s motivations, its ill-advised rhetoric is making chances for peace in the subcontinent more and more remote. At one time, hawkish lobbies in Pakistan resisted peace with India. Today, the Indian state itself, backed by an array of far-right Hindu groups and pliant supporters in the media, wants to isolate Pakistan.\n\nOnce India realises that its efforts to demonise this country will fail, and that the only sustainable path for South Asia’s people is peaceful coexistence, it is welcome to call Pakistan. All outstanding issues can and should be addressed in a frank dialogue.\n\nUntil then, Pakistan must remain on alert, and remind belligerent voices in India that it will defend itself, just as it did during New Delhi’s unprovoked aggression earlier this year.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:10:42.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946910",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T02:02:16.000Z"
}
