{
  "title": "Djokovic ‘hangs by rope’ before battling into Shanghai last 16 - Sport - DAWN.COM",
  "author": null,
  "content": "SHANGHAI: Novak Djokovic said he had been “hanging by a rope” before battling through to the Shanghai Masters last 16 with a 4-6, 7-5, 6-3 win over qualifier Yannick Hanfmann on Sunday.\n\nThe 38-year-old Serb is looking to win a record-extending fifth title in Shanghai but was given a mighty scare by the 150th-ranked German.\n\nDjokovic fired two aces to start, delighting the crowd, but soon ran into trouble as Hanfmann found his range.\n\nThe German broke in the third game and held serve after that to clinch the first set.\n\n“I was just outplayed by a better player for a set and a half — I was hanging by a rope to stay in the match,” Djokovic said.\n\nNeither player was able to take control of a gruelling second set, until a series of unforced errors from Hanfmann in the 12th game gave Djokovic the opening he needed.\n\nSweating in 28 C humidity at 9:00pm, the 24-time Grand Slam champion then broke in the fourth game of the third set as his 33-year-old opponent’s precision dropped.\n\nCheered on by a stadium full of adoring fans, Djokovic held his resolve to take the third set after Hanfmann hit the ball out.\n\n“I had to dig in really, really deep to come out from this match as a winner, and I think the energy and support of the crowd really got me out,” Djokovic said.\n\nTaylor Fritz of the US was not so lucky, becoming the highest-ranked player to be dumped out so far after he fell to 37th-ranked Giovanni Mpetshi Perricard 6-4, 7-5.\n\nOn a hot afternoon, the world number four seemed lethargic and struggled to get into his stride, unnerved after Mpetshi Perricard nearly broke twice in the fifth game.\n\nThat preempted a streak of brilliance that saw the neon orange-clad Frenchman fire three aces to hold the sixth, then break in the seventh.\n\nA closely fought second set came to a head in the 11th game when a double fault by Fritz handed Mpetshi Perricard the advantage, which he swiftly converted with a backhand.\n\nFinishing the match off with two aces, the big-serving 22-year-old said he could be proud of himself.\n\n“It was tough to be honest, tough conditions, very humid,” he said. “The game at 5-5 [in the second set], it was terrible. I thought I was dying on the court,” he chuckled.\n\nMpetshi Perricard will next face 11th-ranked Dane Holger Rune, who beat France’s Ugo Humbert, 6-4, 6-4.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/06080040e1bf5f7.webp",
  "retrievedAt": "2025-10-12T13:10:56.572Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946874/djokovic-hangs-by-rope-before-battling-into-shanghai-last-16",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:28.000Z"
}
