{
  "title": "Greta Thunberg calls out governments for ‘continuing to fuel’ Israeli genocide in Gaza - World - DAWN.COM",
  "author": null,
  "content": "Swedish activist Greta Thunberg, who was arrested by Israel when they intercepted the Global Sumud Flotilla, called out world governments for continuing to enable Tel Aviv’s genocide in the Gaza Strip after she arrived in Greece on Monday.\n\nThe 45-vessel flotilla, with activists and politicians on board, left Spain last month to break Israel’s blockade of Gaza, where the United Nations has warned of famine.\n\nThe flotilla was intercepted by the Israeli navy, with commandos boarding the boats and arresting participants. Former Pakistani senator Mushtaq Ahmad Khan was also on board and is currently in Israeli custody.\n\nIn her first public comments since her release by Israeli authorities, Greta emphasised that the real story is not the interception of the flotilla, but the genocide being carried out in the Gaza Strip.\n\n“The Global Sumud Flotilla was the biggest-ever attempt to break Israel’s illegal and inhumane siege by sea,” the Swedish activist said. “It is a story of global, international solidarity, of people stepping up when our governments fail to do so and people are saying ‘my leaders … who are supposed to represent me continue to fuel a genocide … they do not represent me’.“\n\nShe added that the mission even existing was “a shame”, condemning Israel’s “illegal and inhumane” siege of the enclave, as well as blocking routes for humanitarian aid.\n\n“Under international law, states have a legal obligation to act to prevent … to stop a genocide, including ending complicity, applying real pressure and ending arms transfers,” Thunberg said.\n\n“We are not even seeing the bare minimum from our governments,” she lamented. “Our international systems are betraying Palestinians. They are not even able to stop the worst war crimes from happening.“\n\nThunberg said she could “talk for a very, very long time” about her imprisonment and abuse at the hands of Israeli jailers, but insisted that it was not the story.\n\nShe said the story was “Israel … continuing to worsen and escalate their genocide and mass destruction with genocidal intent; attempting to erase an entire population in front of our very eyes”.\n\nThe Israeli onslaught in Gaza began in October 2023 following an attack by Hamas in Israel. Since then, more than 67,000 Palestinians have been killed, thousands injured and millions displaced.\n\nLast month, UN investigators said that Israel was committing genocide in Gaza in a bid to “destroy the Palestinians”, accusing Israel’s prime minister and other top officials of incitement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0622311894a12ae.webp",
  "retrievedAt": "2025-10-12T13:10:27.269Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947042/greta-thunberg-calls-out-governments-for-continuing-to-fuel-israeli-genocide-in-gaza",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T17:58:19.000Z"
}
