{
  "title": "Haaland fires Manchester City to win at Brentford, Everton end Crystal Palace’s unbeaten run - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Erling Haaland carried Manchester City to within three points of Premier League leaders Arsenal with the only goal at Brentford, while Crystal Palace’s 19-game unbeaten run was ended by a 2-1 defeat to Everton on Sunday.\n\nThe Norwegian maintained his sensational early season form to score his 18th goal for club and country in just 11 appearances this season.\n\nHaaland showed his strength to bully his way through the Brentford defence from Josko Gvardiol’s long ball and fire home on nine minutes.\n\nVictory came at a cost for Pep Guardiola’s men as Rodri was forced off in his latest injury setback since returning from an anterior cruciate ligament tear that saw him miss most of last season.\n\nThe 2024 Ballon d’Or winner was in tears when he had to be replaced with an apparent hamstring problem midway through the first half.\n\nDespite a less than sparkling performance, City held out to haul themselves up to fifth and right back into the title race.\n\nPalace missed the chance to go second after suffering a European hangover at the Hill Dickinson Stadium.\n\nThe Eagles were dominant in the first 45 minutes but were left to rue not adding to Daniel Munoz’s finish from Ismaila Sarr’s pass.\n\nHowever, their UEFA Conference League exertions in winning away to Dynamo Kyiv on Thursday took their toll in the second half.\n\nIliman Ndiaye equalised from the penalty spot after Maxence Lacroix clumsily upended Beto as Everton fought back to avoid a first defeat at their new home.\n\nJack Grealish then got fortunate for his first Everton goal as Munoz’s attempted clearance rebounded off the Manchester City loanee into the roof of the net.\n\nAnge Postecoglou’s wait for a first win as Nottingham Forest manager goes on after a 2-0 defeat at Newcastle.\n\nNewcastle had only won one of their opening six Premier League games. But Bruno Guimaraes led the Magpies to victory with a brilliant strike from outside the box to break the deadlock on 58 minutes.\n\nGuimaraes then won a penalty after robbing former team-mate Elliot Anderson inside the Forest box.\n\nNick Woltemade smashed the resulting spot-kick into the top corner for his fourth Newcastle goal since joining from Stuttgart last month.\n\nForest slip to 17th, the same league position that saw Postecoglou sacked by Tottenham at the end of last season despite winning the Europa League.\n\nAfter a slow start to the season, Aston Villa beat Burnley 2-1 to secure a fourth win in the last 11 days. Donyell Malen was the Villa match-winner with his first goals since April.\n\nThe Dutch forward opened the scoring after racing onto Boubacar Kamara’s brilliant through ball to slot into the far corner. Morgan Rogers was the creator for the second that Malen controlled before drilling confidently into the far corner.\n\nLesley Ugochukwu pulled a goal back but Burnley remain in the relegation zone. Wolves are still rooted to the foot of the table after conceding a late equaliser to draw 1-1 at home to Brighton.\n\nLate on Saturday, A stoppage time winner from teenager Estevao Willian earned Chelsea a 2-1 victory over Liverpool, condemning the champions to a third defeat in a row in all competitions.\n\nThe 18-year-old Brazilian poked home from a Marc Cucurella cross in the fifth minute of time added on, in a fast and furious game at Stamford Bridge.\n\nThe result left Arne Slot’s team in second place in the table on 15 points, one behind Arsenal. Chelsea rise to sixth on 11.\n\nWillian’s goal sent Chelsea coach Enzo Maresca into a frenzy and he raced along the touchline to celebrate wildly, earning a second yellow card and a dismissal from referee Anthony Taylor.\n\nHe is unlikely to worry about the cards after his team put in a spirited display against Liverpool, who had looked to have secured a point through a second-half equaliser from Cody Gakpo.\n\nThe Dutch forward scored in the 63rd minute with the visitors upping the pressure, pushing home a flick from Alexander Isak.\n\nChelsea midfielder Moises Caicedo had put the home side ahead in the 12th minute with a thunderous shot from outside the area.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/06073819c4b58c5.webp",
  "retrievedAt": "2025-10-16T20:44:10.281Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946879/haaland-fires-manchester-city-to-win-at-brentford-everton-end-crystal-palaces-unbeaten-run",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:28.000Z"
}
