{
  "title": "Thousands march on Karachi’s Sharea Faisal to show solidarity with Gazans - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Thousands of people, including women and children, marched on Sharea Faisal on Sunday to protest against the genocide in Gaza by Israeli forces, demanding united action from the Islamic world to support the oppressed Muslims.\n\nThey also warned the government to refrain from endorsing any proposal, including the Abraham Accords, which they said was against the will of the Palestinian people.\n\nDozens of caravans from different parts of the city converged near the Nursery bus stop on Sharea Faisal, where they formed a mammoth rally addressed by leaders of the Jamaat-i-Islami (JI).\n\nRiding motorbikes, cars, buses and other modes of transport, the participants carried Palestinian flags and placards bearing images of Hamas leaders.\n\nJI chief warns Islamabad against joining Abraham Accords\n\nThe march was organised by the party as a show of solidarity with Gaza, particularly in the backdrop of Israeli aggression against the Freedom Flotilla.\n\nIn his address, JI chief Hafiz Naeemur Rehman made it clear to Islamabad that any paradigm shift in Pakistan’s policy on Palestine, set by none other than Quaid-i-Azam Mohammad Ali Jinnah, would not be tolerated at any cost.\n\n“Even decades ago, the All India Muslim League used to protest against Israel,” he said. “On March 23, 1940, two resolutions were passed by the Muslim League — one was the Pakistan Resolution and the other was for Palestine. There is only one state, and that is Palestine, and there is only one leadership in Gaza, and that is Hamas,” he said while urging the government to recognise Hamas and support it as the legitimate representative of the people of Gaza.\n\n“Don’t dare to accept Israel or join the Abraham Accords,” he warned.\n\nHe said that the United States was directly responsible for the genocide and ethnic cleansing in Gaza and therefore had no right to deliver lectures on humanity.\n\nThe JI leader claimed that Israel had failed militarily in Gaza as it could not secure the release of its soldiers from Hamas and was, in fact, engaging with the group in one way or another to secure their freedom.\n\n“Hamas is a resistance movement that represents the people of Gaza. However, the ruling class here is not even willing to mention Hamas by name because they fear any movement that originates from the people. The ruling elite dislikes any movement that opposes the US and Israel,” the JI chief added.\n\nHe also stressed the need for another UN, saying the current one had become a total failure and an “agent” of the US and Israel, having never resolved the issues faced by Muslims.\n\nHe was of the view that the massacre in Palestine happened not because of Hamas, but because of the cowardly Muslim rulers.\n\n“We want to tell the rulers and opposition parties of Pakistan to abandon hypocrisy and double standards. The people of Gaza and Hamas must be accepted, and Hamas offices must be opened in Pakistan,” he said.\n\nHe also called on Pakistan Tehreek-i-Insaf Chairman Imran Khan, currently in Adiala Jail, to express solidarity with Hamas and condemn Israel and the US.\n\n“From Karachi’s Keamari to the mountains of Chitral, the public is united in one voice: we will not accept slavery to America,” he said.\n\n“Greta Thunberg was tortured and forced to kiss the Israeli flag — this is the real face of the Zionist state,” he added.\n\nOther leaders, including Dr Osama Razi, Monem Zafar and Advocate Saifuddin, also addressed the rally.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e2fe588c6b1.jpg",
  "retrievedAt": "2025-10-12T13:10:56.374Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946836/thousands-march-on-karachis-sharea-faisal-to-show-solidarity-with-gazans",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:40.000Z"
}
