{
  "title": "A new helm at Reko Diq - Newspaper - DAWN.COM",
  "author": null,
  "content": "Sudden leadership changes at Barrick Mining Corporation, as Chairman John Thornton announced the departure of CEO Mark Bristow last week and the appointment of Chief Operating Officer Mark Hill as interim chief executive, have sparked concerns in key circles. There are growing fears that the shake-up could stall momentum and delay the project’s financial closure, expected this month.\n\nThe Barrick Mining Corporation is the developer of Pakistan’s largest gold and copper project at Reko, holding a commanding 50 per cent stake and management control in the Reko Diq Mining Company (RDMC).\n\n“Losing Mr Bristow just as the project was finally gathering pace is unfortunate. RDMC had been aiming for financial close before year-end, and after extensive groundwork, things were beginning to take shape. In Pakistan, Mark Bristow had become the face of Barrick as he had been deeply involved since the project’s inception and seen as both passionate and personally committed,” a local mining executive commented privately.\n\n“The project’s estimated cost has already nearly doubled from just over $4 billion to over $7bn, effectively shutting out local firms hoping for a stake. Even a 10pc share now runs into hundreds of millions of dollars, far beyond what Pakistan’s private mining companies, even in consortium, can raise. Any delay could increase the cost further,” noted another local mining executive who has long lobbied for private sector participation in the lucrative mega project.\n\nThere are growing fears that the change in leadership could stall momentum and delay the project’s financial closure, expected this month\n\nHe argued that private sector participation, with its skin in the key project, could have ensured greater technical and financial transparency, something public sector functionaries lack the capacity or incentive to deliver. “From my perspective, the current assessed cost already appears inflated,” he added.\n\n“At the project’s inception, I argued that involving local companies would have brought greater transparency and ensured faster progress. By contrast, the state-owned enterprises, the Oil and Gas Development Company, Pakistan Petroleum, and Government Holdings Pakistan, lack experience in mineral mining and risk faltering,” he remarked.\n\nResponding to a query on concerns in Pakistan over the abrupt leadership change, RDMC stated: “The change in Barrick’s leadership does not affect the Reko Diq project. Reko Diq is a company-wide effort, with the strong backing of the Barrick Board, which has approved all major decisions to date. Interim CEO Mark Hill, in his capacity as Latam/AP COO, has been instrumental in driving the project forward and setting its strategy, ensuring continuity and momentum.\n\n“Our partnership with the government of Pakistan and the provincial government of Balochistan remains strong, and we remain committed to advancing the Reko Diq project successfully.”\n\n“The change in Barrick’s leadership does not affect the Reko Diq project,” says the RDMC\n\nJust a week before this development, Pakistan approved a $390 million railway project linking the remote Chagi mines in Balochistan with Karachi ports to ease the transport of heavy machinery and future output. If plans stay on track, the RDMC aims to begin commercial production by 2028.\n\nOn the funding of the $390m rail project, a senior member of the federal government’s economic team, also part of the Economic Coordination Committee of the cabinet (ECC), stressed that the money would not come from the budget. “I don’t know the exact source, but I am certain the government, already stretched by flood costs, has neither allocated for it nor has the capacity to divert funds from elsewhere,” the official revealed in confidence.\n\nAnother source in Islamabad, privy to Reko Diq affairs, revealed that RDMC will extend a loan to the government to kick-start the railway project without delay, given its critical importance to overall progress.\n\nCommenting on the leadership change and its possible fallout, he said: “Mark Hill may be competent, but Pakistan is hardly an easy destination for investors, especially foreign ones. The country has its own peculiar challenges. Therefore, we hope a permanent CEO is appointed soon, as navigating these complexities may prove difficult under an interim arrangement.\n\n“Even for Mark Bristow, it was never smooth sailing. He faced setbacks — his push to bring in Saudi investors, for instance, showed early promise but ultimately fell through,” he said.\n\nA senior source in Balochistan, who has closely tracked the project for years, praised the company’s strategy of building goodwill by investing in social infrastructure and addressing basic needs such as clean drinking water, while prioritising local hiring and procurement.\n\n“Instead of relying on Karachi or Lahore, the company engaged Balochistan-based firms, even for essentials like bottled mineral water. It also set up schools and sent multiple batches of local workers abroad for training,” he remarked.\n\nThis positive perception was reinforced by a shared RDMC fact sheet, which reported: “$5.3m invested in education, health, skills training and clean water access since 2022.”\n\nFederal Petroleum Minister, Balochistan’s DG for mineral and mining, and other relevant official were approached for comment, but no response was received before the filing of the report.\n\nPublished in Dawn, The Business and Finance Weekly, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:44:03.840Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946811",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:22.000Z"
}
