{
  "title": "Trump hails Putin’s offer on nuclear arms capping - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: United States President Donald Trump on Sunday said Russian President Vladimir Putin’s offer to voluntarily maintain limits on deployed strategic nuclear weapons “sounds like a good idea.”\n\nPutin last month offered to voluntarily maintain limits capping the size of the world’s two biggest nuclear arsenals set out in the 2010 New START accord, which expires in February, if the US does the same.\n\n“Sounds like a good idea to me,” Trump told reporters as he departed the White House, when asked about Putin’s offer.\n\nRussia’s United Nations Ambassador Vassily Nebenzia last week had said Moscow was still waiting for Trump to respond to Putin’s offer to voluntarily maintain the limits on deployed strategic nuclear weapons once a key arms control treaty expires.\n\nAny agreement on continuing to limit nuclear arms would stand in contrast to rising tensions between the United States and Russia\n\nAny agreement on continuing to limit nuclear arms would stand in contrast to rising tensions between the United States and Russia since Trump and Putin met in Alaska in mid-August given reported incursions of Russian drones into Nato airspace.\n\nSpeaking in a video clip released on Sunday, Putin warned that a decision by the United States to supply long-range Tomahawk missiles to Ukraine for strikes deep into Russia would destroy Moscow’s relationship with Washington.\n\nUS Vice President JD Vance said last month that Washington was considering a Ukrainian request to obtain missiles that could strike deep into Russia, including Moscow, though it is unclear if a final decision has been made.\n\nTrump, who has expressed disappointment in Putin for not moving to end the war in Ukraine, was not asked directly on Sunday about the prospect of supplying Tomahawks to Ukraine.\n\n“This will lead to the destruction of our relations, or at least the positive trends that have emerged in these relations,” Putin said in a video clip released on Sunday by Russian state television reporter Pavel Zarubin. One US official and three other sources said that the Trump administration’s desire to send long-range Tomahawk missiles to Ukraine may not be viable because current inventories are committed to the US Navy and other uses.\n\nTrump is touring a US Navy aircraft carrier, the George H.W. Bush, off the coast of Virginia on Sunday, and will give a speech on a second carrier, the Harry S. Truman, later.\n\nTomahawk cruise missiles have a range of 2,500 kilometres. If Ukraine got the missiles, the Kremlin and all of European Russia would be within target.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:44:09.445Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946880/trump-hails-putins-offer-on-nuclear-arms-capping",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:34.000Z"
}
