{
  "title": "Agriculture: Fighting for old wheat customs - Business - DAWN.COM",
  "author": null,
  "content": "After complying with the federal government’s policy of not procuring wheat crops at the notified minimum support price for a year, federal and provincial governments seemed to be having second thoughts. Sindh has formally proposed to the Ministry of National Food Security & Research (MNFSR) to adopt a minimum support price for the wheat crop for the upcoming 2025-26 season, rather than leaving everything to market forces.\n\nSindh Food Secretary Mohammad Bachal Rahupoto, in his Oct 2 letter to the Federal Secretary of National Food Security & Research, endorsed a minimum support price for wheat, as it plays a crucial role in boosting farmers’ morale and ensuring optimal wheat production. A similar proposal was discussed in a meeting between Sindh Chief Minister Murad Ali Shah and Federal Food Security Minister Rana Tanveer Hussain.\n\n“The minimum support price for the upcoming season should not be less than the previous season’s rate to maintain consistency and confidence among growers,” contended Mr Rahupoto, noting that the rate last season was Rs4,000 per 40kg.\n\nRegarding wheat imports, he argued that present stocks were adequate for five to six months; therefore, Sindh doesn’t foresee any import requirements during the present season. He stated that any such import decisions should be made after a thorough assessment of domestic market conditions, as well as local demand.\n\nSindh pushes for the re-implementation of minimum support prices, citing crop instability and dropping food sector growth\n\nHe suggested that the federal government should support farmers with small landholdings to promote equitable growth and farm sustainability. “We recognise our responsibility to intervene in the market when necessary, particularly to address price volatility. Such interventions are vital for protecting food security and shielding vulnerable consumers from abrupt price increases. The federal government began consulting with provinces under the prime minister’s directive to determine how this policy shift should be implemented.\n\nAccording to a Sindh official, the federal government, using the provinces’ input, would approach the International Monetary Fund (IMF) to get its nod to gradually exit from the procurement regime or involve the private sector pragmatically, given that the provinces’ sudden withdrawal from procurement has caused a vacuum, leaving farmers at the mercy of market players.\n\nThere was no backup plan in place to protect the interests of farmers and consumers. While farmers sold wheat for a lower price of Rs2,200 per 40kg in 2025, considering their production costs, consumers are now buying expensive flour for Rs95 per kg.\n\nFollowing the IMF-sponsored decision to deregulate the wheat market, farmers felt cornered as they didn’t get a reasonable price for grain when compared with their per-acre input cost. The ban on wheat is an added stressor. “If you want to deregulate, why is there a ban on wheat’s movement?” argued Khalid Mehmood Khokhar of the Punjab-based Pakistan Kissan Ittehad.\n\nDuring the procurement days, when farmers got an average of Rs3,900 in 2023, farm sector growth was recorded at 6.25pc, in contrast to last season’s negative growth of 0.56pc\n\n“When farmers got an average of Rs3,900 in 2023 amidst government procurement, farm sector growth was recorded at 6.25pc, but when procurement was stopped, a negative growth of 0.56pc was seen in the last season. That is inclusive of the livestock’s share,” he argued. Remember, he said, Pakistani farmers don’t get subsidies and inexpensive inputs available to their Indian counterparts.\n\nSindh Abadgar Board (SAB) president Mahmood Nawaz Shah laments, “On the one hand, the government did not procure wheat nor set a minimum price, and on the other, it did not allow wheat exports and rather imported wheat right at the time of harvesting in 2024.” He stated that this led to the market’s strangulation and resulted in hundreds of billions of rupees in losses for wheat farmers in 2024 and 2025.\n\nGrain procurement targets in Sindh usually hover around 1.3 million to 1.4m tonnes but are often missed. Roughly, a production of 3.5m–3.8m tonnes was achieved in the past years. In FY25, farmers claimed they sold their produce for Rs2,000-2,200 per 40kg in the open market, which is now being sold for Rs3,500-Rs3,600.\n\nThe Sindh Agriculture Department’s final estimate for the crop in FY25 was assessed at 3.1m acres (1.25m hectares) in area and 3.5m tonnes in production, which was 9.5 per cent less in area and 23pc less in production compared to the FY24 figures.\n\nAfter procurement was halted as a policy decision, the existence of the Sindh Food Department was also brought into question. “The government has remained indecisive about whether to disband the food department and merge it with another ministry,” said a Sindh food ministry official.\n\nThe Sindh food department hasn’t yet put its own house in order, if it plans to re-enter this arena with tainted officials holding positions of authority. The department handles a single crop: wheat. It procures and stores grains in its own godowns and in flour mills.\n\nThe entire wheat procurement exercise in Sindh has, historically, been marred by corruption, with targeted support prices reaching only a fraction of small farmers — who hold one to 16 acres of land — out of total procurement.\n\nAs all bigwigs in and outside government enjoyed support prices, small growers kept running between offices to meet procedural requirements — passbooks, challans, and land revenue documents — to be able to get bardana (gunny bags) so that they could bring their grain to food godowns. Food officials, mainly in the Sukkur division, have faced National Accountability Bureau (NAB) references and imprisonment for embezzling public funds.\n\nThe Sindh food department’s own capacity is limited to holding 750,000 tonnes. Despite tall claims, the capacity has not been enhanced in the past several decades.\n\nCurrently, the Sindh government owes Rs176 billion to the State Bank of Pakistan (SBP), inclusive of markup. These are attributable to past procurements done with SBP loans. Such dues are settled when the food department starts releasing its grain from its reserves to chakki owners and flour millers by the end of the year. However, over the last year, the provincial cabinet reshuffle has witnessed regular changes to the food portfolio, but no notable policy changes have been announced.\n\nPublished in Dawn, The Business and Finance Weekly, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:11:08.157Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946806/agriculture-fighting-for-old-wheat-customs",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:23.000Z"
}
