{
  "title": "Stipend to girl students not paid for three years in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government has virtually discontinued a programme of awarding stipend to girl students enrolled in government schools as it has failed to pay the amount to them during the last three years, according to sources.\n\nThe stipend programme for girls was introduced by the provincial government formed after 2008 general elections and led by Awami National Party primarily to retain enrolled girls, increase their attendance and decrease dropout ratio.\n\nSources in elementary and secondary education department told this scribe that the department required Rs3.8 billion annually to give stipends to 600,000 the entitled girl students in the province. However, they said that official documents demanding release of funds had been shuttling between finance and education departments for the last three years.\n\nThey said that under the girls’ stipend programme, Rs200 was given to each girl from 6th grade to 10th grade but the present government of Pakistan Tehreek-i-Insaf in the province stopped the payment since 2022-23 without any obvious reason.\n\nThe scheme is meant to increase attendance and decrease dropout ratio of students\n\nInterestingly, the incumbent provincial government increased the stipend to Rs500 per student but it failed to release the funds required for payment of stipend, sources said.\n\nThey said that only those students were entitled to the stipend whose attendance stood at 80 per cent. They said that headmistresses of schools used to pay the stipend after six months to students.\n\nWith the start of the stipend programme, sources said, enrolment had increased in government schools while absenteeism had decreased up to a large extent. They said that the impact of the programme was good in rural and far-off areas where poverty ratio was very high. Apparently, it was not a big amount being paid to girls after six months but it mattered a lot for students of schools, they added.\n\nThey said that at the start of each financial year since 2022-23, education department prepared all required documents and forwarded the same to finance department for release of funds, but in vain.\n\nA headmistress of a government high school told Dawn that the girls used to be very happy on the day they received the stipend. She said that students often purchased uniform and stationery for themselves with the money they received from schools.\n\nShe said that parents were also happy and eager about the stipend as they used to rush to the school whenever their daughters were not given the amount due to their less attendance recorded as the payment of stipend required 80 per cent attendance.\n\nThe headmistress said that heads of middle and high schools regularly submitted documents pertaining to the release of stipend with education department but received no response from government.\n\n“Students and their parents regularly ask for payment of stipend but we have no reply to their queries,” she said.\n\nA senior official of education department, when contacted, said that education department was not delaying payment of stipend to students rather provincial finance department was not releasing the required funds.\n\nHe said that the finance department was of the view that the funds required for the stipend was in billions, however, the cash became very less when it reached to the hands of students. He said that finance department was not releasing the funds with the opinion that such a meagre stipend for girls had no impact on their retention and increasing their enrolment.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:10:55.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946846/stipend-to-girl-students-not-paid-for-three-years-in-kp",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:53.000Z"
}
