{
  "title": "Power users paying dearly for regulatory failures - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Nepra allowed Rs215m burden caused by coal supplier’s default to be passed to consumers\n• Supplier continued delivery to other industries, made ‘dubious’ force majeure claims to escape accountability\n\nISLAMABAD: Electricity consumers in Pakistan are having to shoulder a financial burden of nearly Rs215 million, mainly due to regulatory weaknesses, it has emerged.\n\nWhile the capacity trap, currency devaluation and exch­ange-rate volatility are touted as the main factors behind expensive electricity, similar attention is not paid to issues of weak contract enforcement and inadequate regulatory oversight, which are actually forcing consumers to foot the bill for contractual default by private companies.\n\nIn the latest episode that has come to light, a Punjab-based coal power plant faced a significant contractual default by its long-term supplier.\n\nSubsequent decisions by regulators such as the National Electric Power Regulatory Authority (Nepra) and the Central Power Purchasing Agency (Guarantee) Limited (CPPA-G) allowed the resulting financial burden to be passed directly on to consumers in the form of higher tariffs.\n\nThis is just one example of persistent weaknesses in the coal procurement process, which previously made headlines earlier this year, sparking inquiries and leading to partial improvements. However, the issue is far from resolved and continues to add to the public’s financial strain.\n\nDawn reached out to Nepra with a set of questions on Sept 22. Over the following weeks, the regulator repeatedly promised a written response, but failed to provide one until going to press.\n\nDefault on coal supply\n\nThe issue at hand stems from the breach of a long-term coal supply agreement between the power plant and its coal supplier in December last year. The contract, awarded through a competitive process, secured a substantial discount of $2.51 per tonne on API-4 specification coal.\n\nThis was seen as an improvement over a previously-challenged contract, which only offered a discount of $0.50 per tonne.\n\nHowever, the supplier defa­ulted on its obligation to del­iver coal against issued purchase orders, citing an alleged ‘force majeure’ as the basis for its non-performance, referencing factors such as congestion at the Richards Bay Coal Terminal in South Africa and, notably, the India-Pakistan conflagration in May.\n\nThe claim regarding terminal congestion is noteworthy, as industry experts routinely consider this risk as a foreseeable trade challenge in the international coal market.\n\nHowever, the use of the India-Pakistan flare-up as an excuse does not hold up, as documentation indicates that other suppliers successfully fulfilled their contractual obligations during the same timeframe.\n\nAdditionally, other industries in Pakistan continued to import coal without interruption, raising questions over the enormity of the supplier’s ‘force majeure’ claims.\n\nInterestingly, while it defaulted on the long-term contract with the power plant, the company continued to supply coal to other industries, suggesting the decision was linked to the high discount offered rather than the self-proclaimed ‘force majeure’.\n\nCost increases\n\nAs a direct consequence of the default, the power plant in question was forced to procure replacement coal from the next-ranked supplier, at a significantly higher price. This resulted in an additional cost of $1.86 per tonne being incurred.\n\nWhen applied to the total defaulted quantity of nearly 372,000 tonnes across eight vessels, this nonperformance by the original supplier generated a verifiable loss of $691,931, equivalent to around Rs197m.\n\nThe regulatory response by Nepra solidified the public’s exposure to this financial loss. In its Fuel Cost Adjustment decision of June 26, 2025, the authority green-lit passing the full impact of the Rs197m cost directly into consumer tariff, instead of protecting consumers’ interests by holding the defaulting party accountable, as explicitly outlined in the Coal Supply Agreement.\n\nThe contract stipulates that the defaulting party must bear the incremental cost of replacement coal and forfeit its performance guarantee to cover such losses. According to records, the supplier’s performance guarantee was not forfeited, and the recovery of the $691,931 loss was not enforced by either CPPA-G or Nepra.\n\nDespite its ongoing default, the same company was allowed to continue supplying under the long-term tender and participate in, and win, a spot tender for the same plant again on June 11, 2025.\n\nThis spot tender secured a discount of only $1.58 per tonne, which was 93 cents per tonne lower than the discount on the defaulted long-term contract. The price disparity created an additional loss of $55,800, about Rs16m, on a single 60,000-tonne supply, placing yet more burden on consumers.\n\nThe CPPA-G’s issuance of NOC to the defaulting supplier, both for the spot tender and its continued long-term supplies, illustrates the absence of an effective systemic penalty framework.\n\nFollowing an earlier episode, a Nepra fact-finding committee had identified “anomalies” in the coal procurement process. The committee’s subsequent report underscored the structural weaknesses inherent in the system, which led to single-bidder scenarios and limited competition.\n\nThe report had also acknowledged the absence of requisite regulatory guidelines for long-term coal procurement and recommended the urgent creation of an independent coal regulator to protect consumers from unjustified costs. But even after the passage of eight months, those recommendations remain unenforced.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:10:43.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946902/power-users-paying-dearly-for-regulatory-failures",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:02.000Z"
}
