{
  "title": "Lesco’s power transmission system collapses in windstorm - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The residents of many areas of Lahore as well as the districts in jurisdictions of the Lahore Electric Power Supply Company (Lesco) suffered a lot due to prolonged power disruptions after a thunderstorm choked the entire power transmission system, resulting in suspension of electricity for hours even after the rain had stopped on Sunday morning.\n\nThe thunderstorm was so powerful that the restoration of power supply in several localities couldn’t be restored even till 8pm (18 hours) on Sunday due to uprooting of a number of tall trees that fell on high tension power transmission lines, wires and transformers by the storm that started in the midnight, Dawn has learnt.\n\n“The Saturday’s wee hours were terrifying and we spent not only the whole night without electricity but also the some hours on Sunday without,” said a consumer in Johar town. He also talked about Gulberg industrial area and adjoining residential areas where the power supply remained suspended for many hours.\n\nAccording to the consumers, the power disruption was not limited to Lahore as the thunderstorm also occurred in the districts of Okara, Kasur, Sheikhupura and Nankana Sahib where it damaged the company’s infrastructure.\n\n18 hours long electricity disruptions reported in Lahore, adjoining districts\n\nAccording to various documents made available to Dawn, the Lesco’s most circles (1st, 2nd and 3rd and 5th in Lahore and 4, 6, 7 and 8 in Kasur, Okara, Sheikhupura and Nankana Sahib) were severely hit by the cyclone as the entire field officials/officers remained on their toes during the whole night and parts of the day.\n\n“The storm was very heavy and powerful,” said a consumer in Okara. He added that the people living in Okara also suffered a lot, as a number of transformers, cables, wires, conductors etc were damaged.\n\n“To avert such a situation in the future, there is no option for Lesco but to immediately shift the overhead electricity distribution to an underground system,” said a consumer in the provincial metropolis.\n\n“The thunderstorm caused massive losses to our system as a large number of trees fell on the hanging wires of low tension (LT) and high tension cables of 11kV and 132kV power distribution system,” Lesco Chief Executive Officer Ramzan Butt said while talking to Dawn on Sunday.\n\n“The windstorm was very powerful and it damaged our system badly. For the whole night, our teams kept working in the field to restore electricity,” he added.\n\nTalking to this reporter, a spokesperson for the company claimed that the field formations remained active in the field till restoration of power supply in many areas.\n\n“Though the thunderstorm hit our system badly, our teams did a lot of work in the wee as well as during the whole day on Sunday,” he claimed.\n\n“We worked a lot last night as the situation was very serious following a huge number of trees and wires felling, uprooting of poles along with the power transmission lines etc,” said a Lesco worker in Johar Town.\n\nWhen contacted, a spokesperson for the company said a number of transformers, poles, 132kV transmission lines, 11kV distribution lines, low and high tension wires, conductors of various kind etc were damaged badly by the thunderstorm. “Till this time — 9pm, we have succeeded in restoring power to most parts of Lahore city district and the districts of Kasur, Okara, Sheikhupura and Nankana Sahib,” the spokesperson maintained.\n\nOn the other hand, the Lahore Waste Management Company (LWMC) on Sunday launched a mega operation to clean the city by collecting and disposing of solid waste.\n\nAccording to a LWMC spokesman, the company initiated a comprehensive clean-up operation across the city, following a heavy rain and windstorm. The sanitation teams remained active in clearing roads, streets and neighborhoods to restore normalcy. He said the manual sweeping was followed by mechanical sweeping and washing operations throughout the city. The main roads, including Canal Road, Jail Road and Mall Road, were cleared of the fallen trees and branches and leaves to ensure the smooth traffic flow.\n\nSanitation staff also remained deployed at key locations such as Wahdat Road, Ferozepur Road, Gulberg and Liberty Chowk while continuous cleaning efforts were carried out around the Davis Road, Assembly Chowk, GPO Chowk and the Data Darbar area.\n\nThe spokesperson said that even on holiday, the LWMC officials/officers remained active to ensure effective sanitation management across Lahore.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e32e6489c8a.jpg",
  "retrievedAt": "2025-10-16T20:44:09.965Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946931/lescos-power-transmission-system-collapses-in-windstorm",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T02:47:59.000Z"
}
