{
  "title": "GB judge, cleric targeted in separate attacks - Newspaper - DAWN.COM",
  "author": null,
  "content": "GILGIT: A judge of the Gilgit-Baltistan Chief Court survived a brazen gun attack in Gilgit on Sunday morning, police said.\n\nThe incident came the same day as a separate attack on a religious leader left at least five people injured.\n\nAccording to police, Judge Malik Inayatur Rehman and his security staff came under fire from unidentified assailants near Khari City Hospital.\n\nThe judge’s vehicle was hit by at least 12 bullets, but all occupants survived the ambush.\n\nLaw enforcement agencies reached the site soon afterwards and cordoned off the area for investigation.\n\nGilgit-Baltistan Chief Minister Haji Gulbar Khan took notice of the attack and directed the home secretary, inspector general of police, and other law enforcement authorities to tighten security across the city.\n\nHe instructed them that those involved in the attack be dealt with “iron hands” and brought to justice. The chief minister also urged citizens to remain peaceful and united to foil the designs of elements seeking to disturb the region’s peace.\n\nGB Governor Syed Mehdi Shah also condem­ned the attack and called for a transparent investigation. Assembly Speaker Nazir Ahmed Advocate, Deputy Speaker Sadia Danish, Opposition Lea­der Kazim Mesum, lawyers’ representatives, and civil society members also denounced the incident.\n\nReligious leader attacked\n\nEarlier in the day, a religious leader from the proscribed Ahl-e-Sunnat Wal Jamaat (ASWJ) was also targeted near the Central Police Office (CPO).\n\nMaulana Qazi Nisar Ahmed, who is the emir of the group’s GB and Kohistan chapter was travelling along with police guards and a driver when the convoy came under fire.\n\nAccording to a GB government statement, Maul­ana Nisar, his driver, and three police personnel assigned to his security sustained injuries.\n\nPolice officials said the guards retaliated immediately, injuring some of the attackers, who managed to escape with the help of accomplices.\n\nCCTV footage showed the assailants fleeing in a Suzuki vehicle they allegedly snatched at gunpoint after their own vehicles became inoperative.\n\nThe injured were shifted to a hospital for medical treatment, where their condition was reported to be stable.\n\nPolice launched an investigation and took into custody two vehicles used in the attack along with other evidence.\n\nSenior Superintendent of Police (SSP) Gilgit Ishaq Hussain said the district police had been placed on high alert following recent security concerns. He added that comprehensive operations were underway to apprehend those involved in the attack.\n\nProtests erupt\n\nFollowing the incidents, protests erupted across the region. Demonstrators blocked main roads, including the Karakoram Highway (KKH), Gilgit–Shandur Road, and Baltistan Road, demanding the immediate arrest of the culprits. Shops and markets in Gilgit remained closed in protest.\n\nProtest demonstrations were reported from Gilgit, Diamer, Nagar, Skardu, Astore, Ghizer, Ghanche, and Shigar, where people from all walks of life participated. Religious leaders from all sects condemned the attacks, describing them as a conspiracy to sabotage peace in the region.\n\nFederal Minister for Kashmir Affairs, Gilgit-Baltistan and SAFRON, Engineer Amir Muqam, also condemned the assassination attempt on Maulana Qazi Nisar Ahmed and ordered a high-level investigation.\n\nIn a statement issued during his official visit abroad, Mr Muqam said he had contacted the GB chief minister, chief secretary, and inspector general of police, seeking a detailed report. He said Maulana Qazi Nisar Ahmed was a respected religious scholar and that the attack was not only on an individual but “an assault on the peace and stability of the entire region.”\n\nThe minister directed authorities to use all available resources to ensure the swift arrest of the attackers. “Those involved in this heinous crime will not escape justice,” he said.\n\nChief Minister Gulbar Khan reiterated that no conspiracy against the peace of Gilgit-Baltistan would be allowed to succeed. He ordered the IG and law enforcement agencies to conduct a transparent investigation and immediately arrest the culprits.\n\nGovernor Syed Mehdi Shah, Speaker Nazir Ahm­ed Advocate, Deputy Spe­a­ker Sadia Danish, Oppo­sition Leader Kazim Mes­um, cabinet ministers, reli­g­ious leaders from var­ious sects, and civil society activists all condem­ned the incidents and dem­anded a fair and tran­s­parent investigation.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:43:50.905Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946903/gb-judge-cleric-targeted-in-separate-attacks",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:02.000Z"
}
