{
  "title": "Pak-EPA to launch crackdown on smoke-emitting vehicles in Islamabad from Nov 17 - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Environmental Protection Agency on Sunday announced a crackdown on smoke-emitting vehicles in the federal capital starting November 17 in an effort to combat rising air pollution and smog ahead of the winter season.\n\nThe campaign, to be carried out jointly with the Islamabad police, Islamabad Traffic Police (ITP) and the Islamabad Transport Authority (ITA) under the supervision of the Ministry of Climate Change and Environmental Coordination, will include snap checking and on-the-spot testing of vehicles across the city. Vehicles found violating emission standards will face fines or impoundment.\n\nAnnouncing the initiative, Mohammad Saleem Shaikh, spokesperson for the climate change ministry, said smog season posed serious health and environmental threats every year.\n\n“Protecting ourselves, our families and our environment from the harmful effects of air pollution and smog is a collective responsibility,” he stressed.\n\nJoint operation with Islamabad police aims to curb smog and vehicular pollution in capital\n\nSmog in urban centres like Islamabad is primarily caused by vehicular emissions, industrial pollutants, and the burning of solid waste and crop residues. The resulting poor air quality has severe health impacts, especially for children, the elderly and people with respiratory conditions. It also harms crops, reduces visibility and contributes to overall environmental degradation.\n\nMr Shaikh urged residents to take preventive measures ahead of the crackdown.\n\n“We appeal to all vehicle owners in Islamabad and nearby areas to get their vehicles tested for smoke emissions before November 17 and obtain a clearance sticker,” he said. “No government initiative can succeed without the cooperation of citizens.”\n\nVehicle owners could contact the Pak-EPA office at 051-9250713 during working hours for details about testing points. Static testing centres and mobile inspection units have already been set up at key locations including D-Chowk near the old Parade Ground, F-9 Park and entry and exit routes such as the Islamabad Expressway.\n\nMobile teams will also conduct surprise checks in commercial and high-traffic zones.\n\n“Vehicles emitting excessive smoke will be fined or impounded,” the spokesperson warned, adding public awareness campaigns were being run through multiple media platforms to encourage voluntary compliance.\n\nHe explained that the emission testing process measured pollutants such as carbon monoxide and other harmful gases. Vehicles passing the test will be issued official clearance stickers, making it easier for authorities to identify compliant vehicles.\n\nThe spokesperson emphasised that reducing vehicular emissions was central to the government’s broader strategy to improve air quality and public health.\n\n“Vehicular emissions are one of the leading causes of air pollution in our cities. We are taking all possible steps to curb this menace and safeguard our citizens, particularly children and the elderly,” he said.\n\nHe further urged citizens to adopt eco-friendly practices, such as using public transport, avoiding unnecessary vehicle use, maintaining vehicles regularly and refraining from burning waste or leaves in open spaces.\n\nThe upcoming crackdown marked an important step in Islamabad’s ongoing efforts to ensure cleaner air and a healthier environment for its residents, he said.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:10:56.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946867/pak-epa-to-launch-crackdown-on-smoke-emitting-vehicles-in-islamabad-from-nov-17",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:47.000Z"
}
