{
  "title": "GB Police arrest 8 facilitators of attack on religious leader, say culprits to be caught soon - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Gilgit-Baltistan Police on Monday said they had arrested eight facilitators of an attack the previous day on a religious leader from the proscribed Ahl-e-Sunnat Wal Jamaat (ASWJ) near the Central Police Office (CPO).\n\nMaulana Qazi Nisar Ahmed, who is the emir of the group’s GB and Kohistan chapter, was travelling along with police guards and a driver when the convoy came under fire. Police officials said the guards retaliated immediately, injuring some of the attackers, who managed to escape with the help of accomplices. The same day, a judge of the Gilgit-Baltistan Chief Court had also survived a brazen gun attack.\n\nFollowing the incidents, protests erupted across the region. Demonstrators blocked main roads, including the Karakoram Highway, Gilgit–Shandur Road, and Baltistan Road, demanding the immediate arrest of the culprits. Shops and markets in Gilgit remained closed in protest.\n\nAddressing a press conference to provide further updates, Inspector General of Police (IG) Gilgit-Baltistan Afzal Mahmood Butt said: “Eight actual culprits have been identified. Eight facilitators of theirs … have been arrested and in police custody,” he said. The police chief added that four vehicles used in the attack were also seized.\n\nHe was holding a press conference alongside GB Home Secretary Captain (r) Syed Ali Asghar and Gilgit Deputy IG Raja Mirza Hassan.\n\nThe GB police chief elaborated that eight suspects of the assassination attempt on the ASWJ leader and two suspects of the attack on the judge were identified, while four vehicles used in the former incident were also seized.\n\nIG Butt said the suspects involved in the attack would be arrested in a day or two and produced in court soon.\n\nHe further added that a case was also registered after the two suspects who opened fire on Justice Malik Inayatur Rehman’s vehicle were identified.\n\nThe police chief said that fingerprints and blood samples were obtained from the scene of the incident, which helped in identifying the suspects.\n\nThe region’s top cop said that the police and investigation agencies are jointly investigating and based on initial evidence, they have identified the accused.\n\nReligious leaders from all sects had condemned the attacks, describing them as a conspiracy to sabotage peace in the region.\n\nFederal Minister for Kashmir Affairs, Gilgit-Baltistan and SAFRON, Engineer Amir Muqam had also condemned the assassination attempt and ordered a high-level investigation.\n\nThe minister directed authorities to use all available resources to ensure the swift arrest of the attackers. “Those involved in this heinous crime will not escape justice,” he said.\n\nGB Chief Minister Gulbar Khan had reiterated that no conspiracy against the peace of the region would be allowed to succeed. He had ordered the IG and law enforcement agencies to conduct a transparent investigation and immediately arrest the culprits.\n\nGovernor Syed Mehdi Shah, Speaker Nazir Ahm­ed Advocate, Deputy Spe­a­ker Sadia Danish, Oppo­sition Leader Kazim Mes­um, cabinet ministers, reli­g­ious leaders from var­ious sects, and civil society activists had all condem­ned the incidents and dem­anded a fair and tran­s­parent investigation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/062132395f5fc10.webp",
  "retrievedAt": "2025-10-12T13:10:29.161Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947039/gb-police-arrest-8-facilitators-of-attack-on-religious-leader-say-culprits-to-be-caught-soon",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T17:47:42.000Z"
}
