{
  "title": "Govt has withdrawn Aimal Wali’s security, claims ANP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The federal and provincial governments withdrew police and Federal Constabulary security protection to Awami National Party central president Senator Aimal Wali Khan and his family, following his critical speech in the upper house of parliament.\n\nThe withdrawal of security came despite assurances by Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur in a personal telephone call to Aimal Wali with the latter thanking the chief minister.\n\nHowever, it transpired later that police personnel were reportedly withdrawn which, the provincial government’s spokesperson Barrister Mohammad Ali Saif refuted.\n\nMeanwhile, the chief minister’s focal person on digital media Yar Muhammad Khan Niazi, in a post on social media platform ‘X’ said the provincial government deployed four police personnel for Mr Khan’s security while eight personnel were deployed at his residence in Charsadda district.\n\nCM’s focal person says four policemen deployed for ANP leader’s security while eight personnel posted at his residence in Charsadda\n\nHowever, ANP’s central spokesperson said it was an offer which was not accepted as yet.\n\nHe appreciated the provincial government’s gesture. “We thank the KP government but, also, we can provide security to our provincial president,” he said.\n\nSimilarly, Walibagh, the residence of Aimal Wali, said that federal government had also withdrawn Federal Constabulary from the abode of ANP chief and his father Asfandyar Wali Khan.\n\nOn Saturday, federal government withdrew Federal Constabulary personnel deployed for Aimal Wali’s security following his speech wherein he criticised Army Chief Field Marshal Asim Munir for allegedly presenting samples of rare earth metals to US President Donald Trump in Washington.\n\nAimal Wali, in a tweet on his X account [former twitter] said that federal government/interior ministry took back all the security personnel allotted to him, his father and family. He said that if anything happened to him or his family, the responsibility would rest with the government.\n\n“I’ll keep on speaking for the public and am ready for anything coming my way. Yes, I will be moving more securely with private personal and Salaars [referring to ANP workers],” the ANP president tweeted.\n\nSoon after the federal government’s decision, Ali Amin Khan Gandapur called Aimal Wali and assured him that the provincial government would make security arrangements for him and his family and directed KP police chief in that regard.\n\nOn Sunday, however, KP police personnel assigned for security of the ANP president were also called back. None among the police officials took the responsibility while KP police’s security division, established for providing security to VVIPs, bureaucrats and politicians, could not be reached for an official version despite repeated attempts.\n\n“It was early in the morning when provincial government also withdrew Aimal Wali’s security and called back police personnel,” ANP central spokesperson Ehsanullah told Dawn. He said that party workers took over security of the ANP president and his father.\n\nA statement later issued from Bacha Khan Markaz, the central office of ANP, here said that KP police chief completely disregarded directives of chief minister. He said that Mr Gandapur appeared completely powerless against the group comprising ‘Khaki patrons’ of the hybrid regime entrenched in central government and their political lackeys.\n\nIt said that Mr Gandapur personally assured Senator Aimal Wali Khan that his security detail would be maintained and not reduced.\n\nHowever, despite assurance, all relevant police personnel were ordered to report back to line duties this [Sunday] morning, he said. The ANP central spokesperson asked Mr Gandapur to clarify his position.\n\nHe said that the hybrid regime refused to abide by the Constitution concerning provincial autonomy and federation. He said that ANP would devise a comprehensive plan regarding security of its leadership to effectively counter such violations and ensure protection of party leadership.\n\nAlso, the ANP leadership termed withdrawal of security of the party chief an attack on 18th Amendment.\n\nFormer chief minister and central leader of ANP Ameer Haider Khan Hoti termed the decision of withdrawing security of Aimal Wali a political revenge and questioned if any political leader’s security would be determined by centre’s likes or dislikes. He also questioned that if asking questions in the parliament was a crime.\n\n“Withdrawing [ANP president’s] security for raising Constitutional questions in parliament is an attempt to suppress opposition,” he said.\n\nMr Hoti said in a statement that federal government’s interference in provincial matters was a threat to democracy.\n\nHe said that provincial police chief refused to follow Mr Gandapur’s orders.\n\nOn the other hand, KP government spokesperson Barrister Mohammad Ali Saif refuted the ANP leadership’s claim, saying provincial government did not withdraw Aimal Wali’s security.\n\n“If the chief minister has ordered, security will be provided. How it is possible that the chief minister issues orders and security is not provided,” he questioned while talking to Dawn.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:10:55.753Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946854/govt-has-withdrawn-aimal-walis-security-claims-anp",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:53.000Z"
}
