{
  "title": "How many foreign trips has PM Shehbaz been on since the Pakistan-India military engagement? - Pakistan - DAWN.COM",
  "author": null,
  "content": "Following the brief military conflict with India in May, Prime Minister Shehbaz Sharif conducted a flurry of visits to other countries and international fora as part of a diplomatic push.\n\nThe May conflict, the worst between the old foes in decades, was sparked by an attack on Hindu tourists in occupied Kashmir, which New Delhi, without evidence, said was backed by Pakistan. Pakistan denied involvement, with the foreign ministry having questioned the credibility of India’s account of the events, saying it was “replete with fabrications”.\n\nBoth sides used fighter jets, missiles, artillery and drones during the four-day conflict, before agreeing to a ceasefire.\n\nPM Shehbaz is currently in Malaysia on an official visit. After tallying up press releases from the Foreign Office about the prime minister’s foreign visits, it emerges that he conducted 10 foreign visits from May to October — a period of five months.\n\nIn his first foreign trip after the war, the PM toured the friendly nations of Turkiye, Iran, Azerbaijan and Tajikistan. According to the FO, he held “wide-ranging discussions” with the four nations while acknowledging their support during the conflict.\n\nBeginning his tour in Turkiye, PM Shehbaz met Turkish President Recep Tayyip Erdogan and thanked him for his support during the war. Both sides held a delegation-level meeting in which Foreign Minister Ishaq Dar, Chief of Army Staff (COAS) Field Marshal Syed Asim Munir and Minister of Information and Broadcasting Attaullah Tarar took part.\n\nThe next day, PM Shehbaz flew to Tehran and met Iranian President Masoud Pezeshkian, expressing gratitude for his support of Pakistan. At a joint press conference, the PM said, “We are ready to talk, for the sake of peace on water issues with our neighbour (India).”\n\nFor the third leg of his tour, the PM travelled to Azerbaijan to meet President Ilham Aliyev and express gratitude for his “steadfast support”. The pair also discussed the “full spectrum of bilateral relations and expressed satisfaction over the upward trajectory of political, economic, defence, and cultural cooperation”, according to Radio Pakistan. Additionally, the PM took part in a trilateral summit with Turkiye and Azerbaijan.\n\nTo cap off the tour, PM Shebaz landed in Tajikistan, where he met President Emomali Rahmon and addressed the International Conference on Glaciers’ Preservation. At the conference on May 30, he warned that Pakistan would not allow India to cross the red line by holding the Indus Waters Treaty in abeyance and endangering millions of lives for narrow political gains.\n\nThe PM travelled to Saudi Arabia for a two-day visit, where he expressed gratitude to the kingdom for supporting Pakistan and also performed Umrah, offering prayers for the country’s success. This was the first of two visits to the kingdom that PM Shehbaz would embark upon since the war concluded.\n\nThe delegation arrived in Saudi Arabia at the invitation of Crown Prince Muhammad bin Salman for a visit from June 5 to 6. The visit focused on strengthening bilateral cooperation in key areas between the nations.\n\nThe meeting reaffirmed the deep-rooted, strategic, and fraternal ties between Pakistan and Saudi Arabia.\n\nThe week after his trip to Saudi Arabia, the prime minister headed to the United Arab Emirates (UAE), where he discussed regional peace and stability and explored ways to deepen bilateral ties during an official day-long visit.\n\nThanking the Emirati leadership for their support during the war, Shehbaz and UAE President Sheikh Mohamed Bin Zayed Al-Nahyan discussed bilateral, regional and global issues of mutual interest and reaffirmed commitment to further enhance cooperation in key areas.\n\nIn a second trip to Azerbaijan, the PM travelled to Khankendi to attend the 17th Economic Cooperation Organisation (ECO) Summit, where he urged stronger regional cooperation in the face of increasing geopolitical tensions, including the Iran-Israel conflict and Indian hostility towards Pakistan.\n\nThe prime minister also voiced concerns over the situation in Gaza and the ongoing Israeli onslaught, which has killed at least 67,000 Palestinians since October 2023.\n\nOver a month after his last trip, PM Shehbaz headed to China for a state visit, where he was also due to participate in the Shanghai Cooperation Organisation’s (SCO) Council of Heads of State summit in Tianjin.\n\nAlongside raising the issue of the Indus Waters Treaty, the PM also met with Russian President Vladimir Putin to bolster bilateral ties and vowed to strengthen Islamabad’s “iron-clad and all-weather strategic cooperative partnership” with Beijing.\n\nPM Shehbaz reached Qatar on September 11 for a one-day visit, where he met Qatari Emir Sheikh Hamad bin Khalifa al-Thani to express solidarity and regional unity after Israel launched an airstrike on the Qatari capital Doha.\n\nDuring the meeting, which took place two days after the attack, the PM urged unity in the Muslim world to confront Israeli provocations following Tel Aviv’s airstrikes.\n\nPM Shehbaz travelled to Saudi Arabia once again, where he and Crown Prince Muhammad Bin Salman inked the “Strategic Mutual Defence Agreement”, a pact which pledged to treat aggression against one nation as aggression against both.\n\n“This agreement, which reflects the shared commitment of both nations to enhance their security and to achieve security and peace in the region and the world, aims to develop aspects of defence cooperation between the two countries and strengthen joint deterrence against any aggression,” a statement from the PM’s office read.\n\nThe prime minister also attended the 80th session of the UN General Assembly in New York, where he was one of eight Muslim nations to work on a Gaza peace proposal with US President Donald Trump.\n\nHe highlighted the need for “proactive” rather than “provocative” leadership for South Asia in his address to the UN.\n\nDuring his time in the US, PM Shehbaz took a detour to Washington, DC, with Field Marshal Munir, where they met Trump in what was the PM’s first visit to the White House.\n\nPM Shehbaz thanked Trump for “his public endorsement of Pakistan’s role in counterterrorism and stressed the need to further enhance cooperation in security and intelligence,” as the two discussed matters of regional security.\n\nThe PM is currently in Kuala Lumpur on an official visit at the invitation of his Malayian counterpart Ibrahim, where he had a “most productive exchange of views with my dear brother Prime Minister Anwar Ibrahim in Putrajaya today”, according to a post on his X account.\n\n“We held wide-ranging discussions on ways to further strengthen our historic partnership — focusing on trade and investment, climate, defence, education, and tourism.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/062027596d5153c.webp",
  "retrievedAt": "2025-10-12T13:10:29.778Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947030/how-many-foreign-trips-has-pm-shehbaz-been-on-since-the-pakistan-india-military-engagement",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T16:17:27.000Z"
}
