{
  "title": "Faisal Kundi says anti-graft institutions silent over ‘corruption’ in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "LOWER DIR: The governor, Faisal Karim Kundi, has accused the federal accountability institutions of keeping “criminal silence” over rampant corruption in the province, saying such agencies should “set their telescopes” towards the ongoing irregularities.\n\nHe expressed these views while talking to media on Sunday after offering condolences over the death of PPP leader Alamzeb advocate’s mother in Timergara.\n\nPPP leaders and former federal ministers Najmuddin Khan and Malik Azmat Khan, former provincial minister Mahmood Zeb Khan, district president Ahmad Zeb, general secretary Naeemullah, Jehan Bahadur advocate and other party workers were also present on the occasion.\n\nFaisal Karim Kundi said that even the provincial ministers, who recently resigned, were publicly speaking about corruption within the government, alleging that postings and transfers also involved money. “Despite this, the accountability and investigation bodies have maintained a criminal silence,” he remarked.\n\nUrges CM to give policy statement on operation, terrorism\n\nHe further said that the National Accountability Bureau’s practice of plea bargain with the corrupt was “totally against the spirit of justice in the State of Madina.”\n\nCommenting on the recent verbal spat between minister Talal Chaudhry and ANP central president Aimal Wali Khan, and the chief minister’s criticism over the withdrawal of Aimal Wali’s security, the governor said that as the chief executive of the province, the CM should provide security to Mr Aimal Khan.\n\n“The PML-N and ANP have been allies in the past, therefore, both Talal and Aimal Wali should refrain from issuing statements against each other,” he advised.\n\nResponding to a question regarding possible political change in the province, Mr Kundi said, “As long as the chief minister continues to work on his old pay, his government is safe.” He added, “No other party needs to oppose the PTI government, as PTI itself is enough for the purpose.”\n\nAbout the recent reports of militants’ presence in some areas of the province, the governor said intelligence-based operations were being carried out there, as the law and order situation had deteriorated.\n\nHe urged the chief minister to issue a clear policy statement on the ongoing operations and terrorism on the floor of KP Assembly.\n\nLater, the Governor also visited the hujras of Mohammad Saleem advocate of Shehzadi, Haroon advocate of Rani, and Waris Pacha of Siyar Dara, where he offered condolences and fateha over the recent deaths of PPP workers and their family members.\n\nEarlier, PPP leaders Mahmood Zeb Khan, Alamzeb advocate, and Jehan Bahadur advocate thanked the governor for visiting the area, saying he always shared the joys and sorrows of party workers and was a true people’s governor.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:44:30.590Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946842/faisal-kundi-says-anti-graft-institutions-silent-over-corruption-in-kp",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:54.000Z"
}
