{
  "title": "Sindh cabinet approves waiver of death certificate fee - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Sindh cabinet on Monday approved the waiver of the death certificate registration fee for the general public across the province at the municipal, union council and town committee levels.\n\nThe decision was taken in a provincial cabinet presided over by Sindh Chief Minister Syed Murad Ali Shah at the CM House.\n\nA press release issued today said that under the new arrangement, the Sindh government will bear the cost of the National Database & Registration Authority service charges, ensuring that citizens can obtain death certificates free of cost.\n\n“This step aims to facilitate citizens, promote digital registration of vital events under the Sindh Local Government Act, 2013, and strengthen the province’s CRVS (Civil Registration and Vital Statistics) system,” the press release said.\n\nIt added that the decision followed the cabinet’s approval of free birth registration in September 2024 in line with the Sindh government’s commitment to the United Nations and international partners for improving CRVS coverage.\n\nIn other important measures, the cabinet also approved important amendments to the Sindh Letters of Administration and Succession Certificates Act and Rules, 2021, to streamline the issuance of inheritance documents, remove procedural gaps, especially for minor and mentally disabled heirs, and make the process more transparent and efficient.\n\n“Major changes include deletion of the clause treating the presence of a minor as a legal controversy. Applications may be filed by heirs or their power of attorney with the required documents. Certificates for minor or mentally disabled heirs will take effect only after a guardianship certificate is issued under the Guardian and Wards Act, 1890. False declarations will be punishable under Section 198 of the Pakistan Penal Code,” the press release said.\n\nCM Shah said the above reforms would make the system more “accessible, transparent, and people-friendly”, protecting the rights of all legal heirs.\n\nSurrender policy for riverine bandits: The provincial cabinet also approved the Surrender Policy for Dacoits in the Katcha Areas of Sukkur and Larkana Divisions, aimed at consolidating peace, upholding the writ of the state and promoting socio-economic development in the riverine belt.\n\nThe cabinet members and meeting participants were informed that many dacoits had expressed willingness to surrender voluntarily following successful security operations and extensive negotiations with local communities.\n\nThe press release said the policy established a “transparent and humane mechanism for surrender under the due process of law”.\n\nIt explained that the main features of the policy included mandatory disarmament, protection of families, rehabilitation and livelihood support, and access to education, healthcare, and vocational training. It added that the government would also revive schools, health, veterinary and development projects in the riverine areas to sustain peace and stability.\n\nCM Shah directed the Sindh Home Department to ensure transparent implementation of the policy through Monitoring and Implementation Committees, and to carry out public awareness campaigns promoting surrender as a “path to peace and reintegration”.\n\nWheat Release Policy 2025–26: The cabinet further approved the release of 1.265 million metric tonnes of wheat to flour mills and chakkies at Rs9,500 per 100 kilogramme bags to stabilise wheat flour prices and ensure financial discipline.\n\nThe press release added that phased releases would begin this month with an emphasis on transparency and market stability, adding that the policy was designed to achieve two objectives: to stabilise the prices of wheat flour and provide relief to the public, and to ensure financial discipline by using wheat sale proceeds to repay bank loans and reduce liabilities.\n\n“The chief minister emphasised the need for transparent implementation to ensure benefits reach the public and prevent market manipulation,” the press release said.\n\nBan on operation of tyre burning plants: Among other decisions, the Sindh Cabinet also approved the complete ban on the operation of tyre pyrolysis plants across the province to curb severe air pollution and protect public health with firms involved in the business asked to close their operations within a month.\n\nThe decision, taken on the recommendation of the Sindh Environmental Protection Agency, followed reports linking pyrolysis activities to the release of toxic pollutants and hazardous emissions contributing to Karachi’s deteriorating air quality, the press release said.\n\nIt added that the cabinet also approved the Sindh Environmental Protection Agency (Prevention of Use of Sub-Standard Fuel/Tyres) Rules, 2025 under the Sindh Environmental Protection Act, 2014, providing a regulatory framework to prohibit the production, sale, and use of substandard fuels, including Tyre Pyrolysis Oil.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/062235013093452.webp",
  "retrievedAt": "2025-10-12T13:10:27.201Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947043/sindh-cabinet-approves-waiver-of-death-certificate-fee",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T18:21:11.000Z"
}
