{
  "title": "Fixing the governance web - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S governance structure is often at the centre of national debate.\n\nFrom questions of provincial autonomy to disaster management, and now, calls to redraw the country’s internal boundaries, each of these discussions is rooted in legitimate concerns: unequal development, sluggish service delivery, and political imbalance. Yet too often, the solutions proposed are reactive, fragmented, or short-sighted.\n\nInstead of piecemeal fixes like carving out new provinces, separating disaster functions, or rolling back devolution we need a deeper conversation about what kind of governance model Pakistan really needs. Because behind every institutional failure lies a more fundamental problem: a state that struggles to function effectively at both the centre and the grassroots.\n\nThe 18th Amendment in 2010, was hailed as a democratic milestone. The amendment was designed to empower provinces, dismantle centralised authority, and bring governance closer to the people. More than a decade later, however, it’s time to ask a difficult question: has the devolution of power come at the cost of effective policymaking? In reality it has led to uneven policy implementation across provinces, created jurisdictional ambiguity and exposed the institutional fragility of our system.\n\nThe provinces, suddenly saddled with vast responsibilities, were neither administratively equipped nor financially ready. The federal government, stripped of much of its role in social sectors, lacked the tools to coordinate national-level strategies. The result: fragmented policy, duplicated efforts, and weak implementation.\n\nIn times of crisis, we need clarity and a unified command not bureaucratic overlap.\n\nBut perhaps nowhere is this governance fragmentation more dangerous than in disaster management, particularly in the era of climate change. Pakistan faces one of the world’s highest risks from climate-induced disasters ranging from floods, heatwaves and glacial melts. And yet our disaster architecture remains stuck in reactive mode. Disaster management is not a linear process.\n\nIt spans risk assessment, early warning, preparedness, response, recovery, and mitigation. Creating two separate institutions, one for risk reduction (National Disaster Risk Management Authority) and another for disaster response (NDMA) breaks this continuum. When a flood hits, will one authority manage the data and mapping while another handles evacuation and relief?\n\nIn times of crisis, we need clarity and a unified command not bureaucratic overlap and institutional finger-pointing. Global best practices point in a different direction. Countries like Indonesia, Japan, and the Philippines — each facing frequent natural disasters have chosen integrated disaster management authorities, where risk reduction and response are handled under one roof. The UN’s Sendai Framework for Disaster Risk Reduction also emphasises the importance of mainstreaming risk into all phases of disaster management, not siloing it in a separate entity.\n\nThe third idea currently gaining traction in political circles is creating new provinces.\n\nPakistan has long wrestled with questions of federalism, representation, and administrative efficiency. One of the most persistent debates in this regard is whether the country’s large provinces, particularly Punjab, should be divided into smaller administrative units. On the surface, the argument makes sense: smaller provinces would presumably bring government closer to the people, reduce bureaucratic inertia, and help address long-standing grievances of regional neglect. But dig deeper, and it becomes clear that the issue is far more complex.\n\nBeyond governance concerns, there’s the federal imbalance created by Punjab’s numerical dominance. With over 50 per cent of the country’s population, Punjab holds the largest number of seats in the National Assembly. This has long been a source of resentment among smaller provinces, who perceive Punjab’s dominance as a threat to equitable federalism.\n\nHowever, proponents of smaller provinces often ignore the massive financial, political, and logistical costs involved. Each new province would require its own governor house, provincial assembly, cabinet, civil service, judiciary, police, and infrastructure. In a country already facing a serious fiscal crunch, this will add to the burden.\n\nWorse still, the process of redrawing provincial boundaries is almost always politically charged. Demands for new provinces often follow ethnic, linguistic, or sectarian lines. Such identity-driven divisions risk deepening societal fractures, rather than healing them.\n\nThere’s also the constitutional hurdle. Under Article 239(4) of the Constitution, a new province can only be created with a two-thirds majority in the concerned provincial assembly. That effectively gives existing provincial power centres veto power over any proposed division. In other words, no new province is likely to be formed without the consent of the very political elites who stand to lose the most.\n\nRather than focusing solely on carving up provinces, perhaps the real solution lies in strengthening local governance. Pakistan’s districts and divisions can be empowered with administrative and financial autonomy, allowing for more responsive governance without the constitutional and political drama of redrawing provincial boundaries. Effective local government systems can serve the same purpose as smaller provinces. And unlike new provinces, empowering local governments doesn’t require constitutional amendments or new assemblies. It just requires political will.\n\nSimilarly, there’s a need for fairer resource distribution between and within provinces. Mechanisms like the National Finance Commission award must be revisited to ensure equitable development, particularly in neglected regions of larger provinces.\n\nPakistan’s real challenge is not geography, it’s governance. Creating new provinces without a serious plan for local empowerment, fiscal management, and political consensus could do more harm than good. Instead of redrawing maps, we should focus on redesigning the system that serves all citizens. Governance in Pakistan needs a reset, not in form, but in function. We need a system that delivers.\n\nThe writer is chief executive of the Civil Society Coalition for Climate Change.\n\naisha@csccc.org.pk\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e32857bd208.jpg",
  "retrievedAt": "2025-10-12T13:10:42.769Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946913/fixing-the-governance-web",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T02:25:42.000Z"
}
