{
  "title": "Standoff intensifies as milk sellers threaten to hike rate to Rs300 a litre - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Govt links fixation of new price with quality of milk\n• Dairy farmers warn of unilateral hike from Oct 11 if notification not issued\n\nKARACHI: The standoff between milk sellers and the Karachi city administration has intensified, with dairy farmers and wholesalers threatening to raise the price of milk to Rs300 per litre from October 11, while the administration has insisted on evaluating milk quality before setting a new price.\n\nThe milk retailers’ and wholesalers’ associations warned that if the administration did not immediately issue a notification regarding new prices, the price of milk would be fixed at Rs300 per litre from Oct 11.\n\nAt a recent meeting with representatives of dairy farmers, wholesalers, retailers, consumers and relevant officials, Karachi Commissioner Syed Hassan Naqvi decided that the new price of milk would be determined after checking its quality. He formed a committee comprising representatives of relevant departments and consumers to check the quality of milk being sold across the city.\n\nA notification issued over the weekend stated that Sindh Food Authority Deputy Director Basit Abbasi, Pakistan Standards and Quality Control Authority (PSQCA) Director Dr Tahira Zaheer, Consumer Protection Council President Shakeel Baig, journalist Ghayasuddin and a representative of the All Karachi Milk Retailers Association will be the members of the committee.\n\nThe committee has been tasked with collecting 50 milk samples from across the city at the levels of farmers, retailers and wholesalers. All samples will be tested by the PSQCA, and a report will be compiled and submitted within seven days of collection.\n\nThe commissioner told Dawn that he made it clear that the sale of unhealthy milk would not be tolerated as it was essential to ensure that citizens received quality milk.\n\nHe said the Bureau of Supply had presented a report on the production cost and proposed a new farm-gate price of Rs235 per litre.\n\nOfficials said that it was decided that a testing laboratory would be established at Lea Market and that milk would only be sold after ensuring its quality.\n\nSpeaking to Dawn, Dairy and Cattle Farmers Association Chairman Shakir Umar Gujjar said that an important meeting had been held at the commissioner’s office last wek to determine milk prices.\n\nHe said the meeting conducted a cost-of-production exercise, which came to Rs271 per litre (farm price).\n\nMr Gujjar said that the administration had suggested issuing a notification in line with the cost of production. However, due to unavoidable reasons, the commissioner did not immediately issue the notification and the meeting ended without result.\n\nHe warned that if milk prices were not increased by Oct 11, dairy farmers would be forced to set a new rate at their own level, hinting that the per litre retail milk price would reach Rs300.\n\n“Due to the recent rains, the prices of commodities have increased immensely and dairy farmers are facing severe financial difficulties,” he added.\n\nPublished in Dawn, October 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e2fe4b145a9.jpg",
  "retrievedAt": "2025-10-16T20:43:48.123Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946831/standoff-intensifies-as-milk-sellers-threaten-to-hike-rate-to-rs300-a-litre",
  "dateList": "2025-10-06",
  "date_published": "2025-10-06T00:58:40.000Z"
}
