{
  "title": "Pakistan launches PKR 90 million project to protect sea turtles in shrimp trawling",
  "author": null,
  "content": "ISLAMABAD, Oct 09 (APP):Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry has announced the launch of a PKR 90 million initiative aimed at protecting sea turtles during shrimp trawling operations, as part of broader efforts to sustain marine biodiversity and ensure the long-term health of ocean resources.\nThe minister in a statement on Thursday said the project includes the distribution and installation of standardized Turtle Excluder Devices (TEDs) at no cost to fishermen, alongside capacity-building workshops, hands-on training for trawler crews, and data collection to monitor the devices’ impact on shrimp catch efficiency and net performance.\nA Turtle Excluder Device is a specialized mechanism fitted into shrimp trawl nets that allows sea turtles and other large marine animals to escape while retaining shrimp. The minister emphasized that the introduction of TEDs would help significantly reduce the accidental capture of endangered sea turtles, mitigate concerns from fishermen over shrimp loss and net damage, and pave the way for Pakistan to regain U.S. certification, which is essential for resuming shrimp exports to the American market.\nHe said the project aligns with Pakistan’s international commitments on marine sustainability and biodiversity conservation, ensuring compliance with global seafood traceability and sustainability standards. “This initiative will showcase Pakistan’s commitment to responsible marine resource management, enhancing its reputation in global seafood trade,” Chaudhry added.\nThe minister explained that shrimp trawling often results in the capture of large quantities of non-target marine species. When sea turtles become trapped in nets, they are unable to surface for air and can drown. He urged the Karachi Fisheries Harbour Authority, Sindh Fisheries Department, and Marine Fisheries Department to ensure immediate and full TED compliance, both at sea and at dockside.\n“One hundred percent TED compliance and credible enforcement will be ensured. Continued non-compliance risks further deterioration of Pakistan’s seafood exports under international traceability regimes,” he warned.\nHighlighting the economic significance, Chaudhry noted that Pakistan’s current shrimp exports stand at around $100 million annually. Full TED compliance and US recertification could potentially triple export volumes and open access to premium markets such as the European Union and Canada. The US shrimp market alone is valued at over $6 billion annually, he added.\nThe project is being supported by the Trade Development Authority of Pakistan (TDAP), Pakistan Fisheries Exporters Association (PAKFEA), Sindh Trawler Owners Fisheries Association (STOFA), Karachi Fish Harbour Authority (KFHA), Sindh Marine Fisheries Department (SFD), and Fishermen’s Cooperative Society (FCS).\nJunaid Chaudhry said Pakistan currently sells shrimp at a comparatively low rate of about $2 per kilogram. With TED compliance and improved international certification, the price could rise to $6 per kilogram, unlocking new opportunities in lucrative markets including the US, EU, and Gulf Cooperation Council (GCC) countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:02:59.528Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-launches-pkr-90-million-project-to-protect-sea-turtles-in-shrimp-trawling/",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T13:50:00.000Z"
}
