{
  "title": "Senator Sherry Rehman urges shift to renewables for Pakistan’s energy sovereignty",
  "author": null,
  "content": "ISLAMABAD, Oct 09 (APP):Senator Sherry Rehman has called for a decisive shift towards renewable energy to ensure Pakistan’s energy sovereignty, security, and affordability.\nSpeaking as the chief guest at the Parliamentary Forum on Energy and Economy, themed “Implications of IGCEP 2025: Politics of Energy Generation in Pakistan”, she stressed that electricity is a fundamental human right and must be accessible, sustainable, and affordable for all.\n“Energy represents wealth for a country — it is the foundation of energy democracy, security, and sovereignty,” Senator Rehman said. “Every industry, household, school and farm depends on low-cost, sustainable energy to power growth and development.”\nHighlighting global trends, she noted that renewable energy overtook coal as the leading source of electricity worldwide in the first half of 2025, with solar and wind growth meeting all of the increase in global demand. Pakistan, she said, is making notable progress: “In 2024, 47% of Pakistan’s electricity came from low-carbon sources, and the Ministry of Energy estimates this figure at 55% — well above the global average of 41%.” Pakistan now ranks as the sixth largest solar market globally, according to the World Economic Forum.\nSenator Rehman reaffirmed Pakistan’s climate commitments under its Nationally Determined Contributions (NDCs): achieving 60% of power generation from renewables by 2030, net-zero emissions by 2050, a 30% transition to electric vehicles by 2030, and a ban on imported coal. She praised the Sindh government’s early solar initiatives, including the Sindh Solar Energy Project (SSEP), which aims to provide affordable solar power to 500,000 low-consumption households, prioritising beneficiaries of the Benazir Income Support Programme.\nHowever, she criticised government’s current energy planning as outdated, arguing that the Integrated Generation Capacity Expansion Plan (IGCEP) 2025 lacked proper provincial consultation and excluded significant renewable projects.\n“This intervention requires parliamentary consensus and provincial consultation — not just box-ticking exercises,” she said. She also pointed to weaknesses in regulatory frameworks, citing NEPRA’s failure to create a predictable environment for investors and concerns over the ongoing debate on privatising distribution companies.\nDespite a nominal energy surplus, Senator Rehman warned that unannounced power outages and high tariffs still leave millions without reliable access to affordable electricity. “No Pakistani should be left outside the electricity tent,” she declared, urging policymakers to incentivise renewables and ensure reforms are communicated in a clear and understandable way. “We don’t need miracles, we just need systems that work.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:01:00.361Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senator-sherry-rehman-urges-shift-to-renewables-for-pakistans-energy-sovereignty/",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T18:25:00.000Z"
}
