{
  "title": "NLPD hosts Int’l Conference to recognize services of author, poet Shan-ul-Haq Haqqee",
  "author": null,
  "content": "ISLAMABAD, Oct 09 (APP):National Language Promotion Department (NLPD), under the National Heritage and Culture Division, Thursday organized a one-day International Conference in recognition of the academic, literary, and lexicographical services of Shan-ul-Haq Haqqee, a distinguished linguist, lexicographer, poet, and writer of Urdu, on the occasion of his 20th death anniversary.\nThe conference began with the national anthem followed by the recitation of the Holy Qur’an by Hafiz Inam-ul-Haq, and a naat in praise of the Holy Prophet (PBUH) presented by Sabghatullah Qadri.\nProf. Dr. Muhammad Saleem Mazhar, Director General of NLPD, welcomed the guests and said that Shan-ul-Haq Haqqee dedicated his life to the promotion of Pakistan’s identity, Muslim culture, and the Urdu language.\n“There is hardly a single field related to Urdu—whether lexicography, research, translation, or literature—in which Haqqee did not make a significant contribution,” he remarked.\n“We have invited renowned scholars and emerging writers of Urdu to pay tribute to his lasting legacy,” he shared.\nNLPD Executive Director Dr. Rashid Hameed, in his opening remarks, said that Shayan Haqqee, son of Shan-ul-Haq Haqqee, had specially arrived from the United Kingdom for the occasion and had donated his father’s books, awards, and medals to the department — for which he expressed deep gratitude.\nMahboob Zafar moderated the event and presented a detailed introduction of Haqqee’s works and literary journey, noting that he was a multilingual scholar of great depth.\nThe conference was presided over by renowned poet, researcher, and intellectual Iftikhar Arif, while Shayan Haqqee was the Guest of Honour. Distinguished scholars Dr. Rauf Parekh and Dr. Ghulam Ali were the keynote speakers, who described Shan-ul-Haq Haqqee’s academic and literary contributions as a valuable treasure of the Urdu language.\nShayan Haqqee, son of the late scholar, expressed heartfelt sentiments, recalling that his father’s intense devotion to work left little time for the family.\n“Fortunately, my mother was educated and supportive,” he said, sharing anecdotes from his father’s final days and moments from their family life.\nIftikhar Arif, in his presidential remarks, said that Haqqee worked for the Urdu language until his last breath.\n“He introduced the term ‘Nashriyat Rabta’ (Broadcast Communication) in Urdu and was known for his elegance and refined personality. Today’s successful conference is a tribute to his mission of elevating Urdu both locally and globally,” he said.\n“His dictionary was an exceptional solo effort — one must only study his books to understand the depth of his scholarship.”\nDr. Ghulam Ali remarked that Haqqee was a versatile figure of both prose and poetry. “His translations display remarkable balance, while his lexicographical work highlights a unique aspect of his scholarly personality,” he observed.\nSpeakers included Dr. Tariq Hashmi, Dr. Arshad Mahmood Nashad, Dr. Fahmida Tabassum, Dr. Humaira Ashfaq, Dr. Sher Ali, Dr. Ibrar Khattak, Dr. Zeenat Afshan, Dr. Amjad Kalu, Dr. Bibi Amina, Dr. Tariq bin Azad, Dr. Tanveer Ahmed Abbas Khichi, Salman Basit, and Ishtiaq Hussain (online).\nDr. Tariq Hashmi stated that Haqqee’s poetry surpassed even his research in depth and passion, as poetry is created with the heart’s blood.\nDr. Fahmida Tabassum observed that Haqqee was not only a linguist but also a remarkable ghazal poet, who particularly loved this poetic form.\nDr. Arshad Mahmood Nashad said that Haqqee was a broad-minded critic who valued inclusivity and diversity in literature, bringing linguistic richness to every literary genre.\nIn his concluding remarks, Prof. Dr. Muhammad Saleem Mazhar, Director General of NLPD, said that Shan-ul-Haq Haqqee’s scholarly legacy in lexicography, research, and literature represents a luminous chapter in the history of Urdu.\n“His work serves as a guiding light for future generations. The NLPD will continue to highlight and promote his intellectual achievements,” he affirmed.\nResearchers and linguists from various universities and literary institutions also presented detailed papers analyzing Haqqee’s lexicography, translation work, literary research, and creative style.\nAt the end, participants paid rich tributes to Haqqee’s literary and research contributions, saying that his intellectual pursuits and creative accomplishments gave Urdu a distinguished identity at the international level.\nThe event was attended by teachers, scholars, writers, poets, students, and language enthusiasts from across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:01:29.173Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nlpd-hosts-intl-conference-to-recognize-services-of-author-poet-shan-ul-haq-haqqee/",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T16:55:00.000Z"
}
