{
  "title": "President reaffirms mental health as national priority on World Mental Health Day",
  "author": null,
  "content": "ISLAMABAD, Oct 9 (APP):President Asif Ali Zardari has reaffirmed his commitment to making mental health a national priority, urging all segments of society to join hands in eliminating stigma and promoting compassion for those facing psychological challenges.\nIn his message on the occasion of World Mental Health Day, the president called on citizens to become “ambassadors for kindness and understanding,” emphasizing that speaking up against stigma and supporting those in need is essential for building a healthier and more inclusive Pakistan.\n“If you are struggling, know that seeking help is an act of strength, not weakness,” the president said, stressing the importance of open dialogue within families, schools, workplaces, and communities to foster resilience and\nOn the occasion of the day, the president extended his solidarity to all those in Pakistan and around the globe who live with mental health challenges. “This year’s theme reminds us that mental health is not an isolated concern, it is fundamental to our personal well-being, our families’ stability, our communities’ cohesion, and the progress of our nation. Good mental health is the foundation upon which human dignity, productivity, and hope are built,” he added.\nHe emphasized that Pakistan faces immense pressures like economic, rapid urbanization, natural disasters, displacement, poverty, and the lingering effects of conflict and trauma. These factors leave invisible scars on the minds and hearts of our people. Studies show that around 24 million Pakistanis require some form of mental healthcare. Depression and anxiety affect nearly one in five adults, while severe conditions such as schizophrenia and bipolar disorder impact 1–2% of the population. Yet, our country has only about 500 trained psychiatrists to serve a population of over 240 million.\nRecognizing this challenge, the president said the Government of Pakistan, through the Ministry of National Health Services, has taken a series of steps to integrate mental health into the broader public health system. Mental health services are being introduced at primary healthcare facilities, while tele-mental health platforms are extending access to those in remote and underserved areas. Community health workers are being trained to identify symptoms early and provide support, while awareness campaigns are tackling stigma and misinformation.\n“We are also striving to strengthen the policy and legislative framework around mental health, so that it receives its rightful place in national health planning. Increased allocations for mental health in the national budget, the expansion of school-based counseling programs, and partnerships with universities and NGOs are all part of this growing effort. These steps are vital milestones toward building a healthier Pakistan,” he added.\nHowever, he said the state alone cannot win this battle. Families must support open dialogue and compassion. Schools must foster resilience and provide safe spaces for children to share their struggles. Workplaces must adopt policies that protect employees’ mental health and well-being. Religious, cultural, and community leaders have a vital role to play in breaking down stigma and encouraging early help-seeking. Together, society can ensure that no Pakistani feels ashamed or isolated for facing a mental health challenge.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:00:10.845Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-reaffirms-mental-health-as-national-priority-on-world-mental-health-day/",
  "dateList": "2025-10-09",
  "date_published": "2025-10-09T22:59:00.000Z"
}
