{
  "title": "IIOJK faces indian oppression on daily basis during Ramazan: AJK President",
  "link": "https://www.app.com.pk/national/iiojk-faces-indian-oppression-on-daily-basis-during-ramazan-ajk-president/",
  "date_published": "2023-04-21T19:09:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Apr 21 (APP): Azad Jammu and Kashmir (AJK) President Barrister Sultan Mahmood Chaudhry on Friday said that while celebrating Eid-ul-Fitr with great fervour in the liberated territory, we must not forget our defenseless brethren on the other side of the Line of Control (LOC) who were facing the worst Indian repression, and should especially pray for their freedom.\nHe said this in a message on the eve of Eid ul Fitr falling on Saturday (April 22) in the country including AJK.\nHe maintained, “Our real Eid will be on the day when our brethren will be celebrating the occasion in a free environment after freedom from the Indian clutches.”\nWhile extending Eid greetings to the Muslims of Pakistan and across the world on behalf of the people of both AJK and occupied Jammu & Kashmir (IIOJK) Sultan Mahmood regretted that our brethren on the other side of the LOC were celebrating this Muslim festival under the Indian guns.\nThe AJK President said, “We have observed fasts, and offered worship and prayers in a free environment during Ramazan, but our brethren in IIOJK faced new tricks of Indian repression on a daily basis even in this holy month which is painful.”\nHe condemned India and its occupation forces for holding the drama of a temporary ceasefire during the month of Ramazan.\nBarrister Sultan Mahmood assured on the occasion that the people of the held territory were not alone in their just struggle.\n“We fully share your pain, miseries, and wounds, and our sympathies are with you,” he underlined.\nThe AJK president expressed confidence that IIOJK would see the dawn of the day of freedom shortly, and its people would get their fundamental right to self-determination and would celebrate Eid in an environment free of repression of the Indian occupational forces.",
  "retrievedAt": "2025-08-11T08:21:45.922Z"
}
