{
  "title": "PM felicitates nation, Muslim Ummah on Eidul Fitr",
  "link": "https://www.app.com.pk/national/pm-felicitates-nation-muslim-ummah-on-eidul-fitr/",
  "date_published": "2023-04-21T19:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 21 (APP): Prime Minister Shehbaz Sharif felicitated the people of Pakistan and the Muslim Ummah on the auspicious occasion of Eidul Fitr.In a message on the occasion of Eidul Fitr, he prayed that the blessed moment may bring for every Muslim immense happiness and joy in life.He said the fasting month of Ramazan ul Mubarak and worship of Allah evoked feelings of patience, contentment, and empathy and Eidul Fitr was also an occasion to practically demonstrate these qualities.He advised people to take care of the needy, poor, destitute, and orphans around them.These were difficult times and the sacrifice and love of the well-to-do and rich were needed more than in ordinary circumstances, he said adding, “Those who are facing difficulties due to adverse circumstances should be made part of the celebrations of Eid.”Shehbaz Sharif said it was persistent effort of the coalition government to put on the people the minimum burden of the difficult economic conditions. “We are striving to the maximum to provide relief to the people. I believe that Allah Almighty will bring us out of these trying circumstances and the comforts of life will return.”The prime minister emphasized that everybody would have to contribute to take Pakistan to its destination and to restore its lost status and to achieve that purpose constructive thinking, focus, and constant hard work were needed“As the sweetness of Eid follows the fasting month, God willing, our effort and hard work will bring economic prosperity in the life of the nation and the country.”He appealed to his countrymen to not forget the flood affectees on the occasion of Eid and include them in their happiness.“On this occasion, we salute the martyrs of the nation who embraced martyrdom while courageously fighting against terrorism and offer our heartfelt condolences to their families. May Allah elevate the ranks of these martyrs and give patience to their loved ones. Ameen,” he added.While expressing solidarity with our Palestinian and Kashmiri brothers and sisters he said, “We pray that Allah Almighty may bless them with freedom. Ameen.”He also expressed solidarity with the earthquake affectees of Turkiye and Syria and sympathized with the bereaved families, prayed for the peace of departed souls, and patience for the heirs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:21:48.275Z"
}
