{
  "title": "One killed, six injured in firing at Imran Khan’s long march",
  "link": "https://www.app.com.pk/national/imran-khan-party-members-injured-in-firing-incident/",
  "date_published": "2022-11-03T12:37:00.000Z",
  "source": "APP",
  "content": "LAHORE/WAZIRABAD, Nov 03 (APP): Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan and several party members were injured while a PTI activist was killed in firing incident at Imran Khan’s container during his “Azadi March” in Wazirabad, on Thursday.\nTalking to the media here, Advisor to Chief Minister Punjab on Home and Information Omer Sarfraz Cheema said that an accused opened fire at PTI Chief Imran Khan’s container near Allah Wala Chowk, Wazirabad when the march was on its way to Islamabad, injuring Imran Khan and six PTI members including Senator Faisal Javed, Umar Dar, Ahmad Chatha and others, besides killing one, Moazam.\nHe said that after the incident, PTI Chief Imran Khan was shifted to a hospital, where he was undergoing medical treatment, adding that Imran Khan’s health was stable but a medical board led by senior doctors was examining the injuries.\nTo a question, he said that foolproof security arrangements including layer system were in place to provide security to the PTI’s long march, adding that investigation pertaining to this incident was in progress. One suspect involved in the firing incident has been arrested, he added.Further investigation is yet underway.\nPrime Minister Shehbaz Sharif on Thursday strongly condemned the firing at Imran Khan in Gujranwala and assured support to Punjab government on investigation and security.\n“I condemn the incident of firing on PTI Chairman Imran Khan in the strongest words,” he said in a series of tweets.\nHe prayed for the recovery and health of PTI chairman and other injured people.\nPresident Dr Arif Alvi also strongly condemned the “heinous assassination attempt” on Pakistan Tehreek-e-Insaf Chairman Imran Khan, calling it “alarming and disgraceful.”\n“The blatant day-time attack on Mr Imran Khan, ex-Prime Minister and Chairman of one of the largest political parties of Pakistan, is highly alarming, worrying and condemnable act,” the president said in a statement issued by the President House.\n“Heinous assassination attempt on the brave Imran Khan. I thank Allah that he is safe but injured with few bullets in his leg and hopefully non-critical,” the president tweeted.\nAlso terming the attack “shocking, deceitful and cowardly”, the president expressed the concern that such flagrant incidents would further aggravate the existing political polarization and would harm the country.\nThe Inter-Services Public Relations (ISPR) on Thursday condemned the firing incident during Pakistan Tehreek-e-Insaf’s (PTI) long march.\n“Firing incident during Long March near Gujranwala is highly condemnable,” the ISPR said.\n“Sincere prayers for precious life lost and speedy recovery and well-being of Chairman PTI Imran Khan and all those injured in this unfortunate incident,” it said.",
  "retrievedAt": "2025-08-11T15:50:28.663Z"
}
