{
  "title": "Pakistan ready to showcase its rich tourism potential at WTM",
  "link": "https://www.app.com.pk/national/pakistan-ready-to-showcase-its-rich-tourism-potential-at-wtm/",
  "date_published": "2022-11-03T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP):Managing Director Pakistan Tourism Development Corporation Aftab ur Rehman Rana here on Thursday said that Pakistan is in the final stages of preparation to showcase its rich tourism potential at World Travel Market (WTM) which is scheduled to be held from 7th – 9th November 2022 at Excel London.\n“PTDC after the interval of almost 14 years is going to set up an impressive Pakistan Pavilion in WTM London in collaboration with provincial tourism departments and private sector companies,” he said in a statement.\nHe said the Promotion of Pakistan as a top tourist destination is the prime focus of the government of Pakistan.Pakistan, the MD said, is blessed with breathtaking natural beauty, rich culture and heritage, and great diversity of landscape offering an unmatched tourism potential.\n“Government of Pakistan aims to enhance the influx of foreign tourists to explore the rich touristic potential of this country and contribute to the socio-economic development of its people through tourism” he added.\nHe said World Travel Market (WTM) London is one of the largest international tourism exhibitions which will provide a unique platform for Pakistan to interact with global tourism organizations, top tourism experts and professionals, exhibitors, and visitors from a variety of sectors including tourism, hospitality, aviation, transport, travel technology, resort management companies and various other sub-sectors of the tourism industry.\nHe said that it is an event of global significance where more than 180 countries come together and showcase their tourism potential under one roof.\nPakistan Tourism Development Corporation (PTDC) has put together a high-level delegation of 39 members led by Awn Chaudhry, Advisor to the Prime Minister on Tourism and Sports and Chairman of PTDC.\nThe delegation also include Tourism Minister Balochistan Abdul Khaliq, Tourism Minister Gilgit Baltistan Raja Nasir Ali, Minister for Tourism, Law and Parliamentary Affairs, Government of Azad Jammu and Kashmir Faheem Akhtar, CEOs and MDs of eight private tour operation and hotel management companies and senior officials from PTDC, AJK, GB, Balochistan, Khyber Pakhtunkhwa, and Punjab tourism departments.",
  "retrievedAt": "2025-08-11T15:50:28.704Z"
}
