{
  "title": "CJP visits LJCP for official launching of documentary ‘Adlia Ka Safar-75 Saal’",
  "link": "https://www.app.com.pk/national/cjp-visits-ljcp-for-official-launching-of-documentary-adlia-ka-safar-75-saal/",
  "date_published": "2022-11-03T15:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP): Chief Justice of Pakistan (CJP) Umar Ata Bandial on Thursday visited the Secretariat of the Law and Justice Commission of Pakistan (LJCP) to chair the official launching ceremony of the documentary titled “Adlia Ka Safar-75 Saal.”\nThe documentary was made for the 9th International Judicial Conference held in September 2022. The Chief Justice was accompanied by his colleagues including Justice Amin-ud-Din Khan, Justice Muhammad Ali Mazhar, and Justice Ayesha A. Malik who supervised the activities of the conference as Members of the Organizing Committee.\nOn this occasion, the Chief Justice of Pakistan appreciated the efforts of the Secretariat of LJCP and the Pakistan Television (PTV) team for coming up with such a wonderful documentary that covers the judicial history of 75 years since the independence of Pakistan.\nThe Chief Justice also expressed his hope that the PTV would continue to support the LJCP Secretariat in other similar efforts to create awareness amongst the general public about the constitution, law and access to justice.\nThe Chief Justice of Pakistan also applauded the LJCP team for organizing a successful conference and hoped that the Secretariat would continue to organize such events with equal spirit, dedication and commitment.\nHe also emphasized upon the need for research to promote balancing the rights of the citizen and the rights of society.\nHe also emphasized the need to activate the Alternate Dispute Resolution mechanisms at all levels of the judiciary for the dispensation of justice for the people of Pakistan.\nThe Secretary of LJCP expressed gratitude to the Chief Justice of Pakistan and the members of the Organizing Committee for gracing the occasion and providing the opportunity to formally launch the documentary. She said that the documentary was a joint effort of the PTV team and the LJCP team.\nThe documentary formally launched on Thursday gives a brief account of the establishment of the judiciary in Pakistan, its infrastructural development and its expansion. The documentary also reflects upon the future track and the endeavours in modernizing the judicial system in Pakistan for the efficient administration of justice with the aid of technology.",
  "retrievedAt": "2025-08-11T15:50:23.761Z"
}
