{
  "title": "ICT seeks PTI’s undertaking during long march, sit-in",
  "link": "https://www.app.com.pk/national/ict-seeks-undertaking-from-pti-during-long-march-sit-in/",
  "date_published": "2022-11-03T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP): The Islamabad Capital Territory (ICT) has asked the Pakistan Tehreek-e- Insaaf (PTI) to submit an undertaking in case of any violation during the long march in federal capital.\nAs per official documents, the ICT has asked for a signed undertaking from the PTI Chairman Imran Khan Niazi following scheduled PTI’s long march.\nThe ICT administration also asked Pakistan Tehreek Insaaf (PTI) to submit 39 points undertaking signed by its chairman Imran Khan Niazi that they would be liable for any of the violation during the long march/sit-in in Islamabad.\nAccording to undertaking, the permission would be valid for one day (24 hours) from November 4 to 5. It will be the responsibility of organizer (PTI) to ensure dispersal before 12pm on November 5.\nThe undertaking said that Section 144 is imposed on gathering of persons in Islamabad including Red Zone and the permission granted would be in exception (one time only) near T-Chowk/Rawat on main G.T. Road and is currently vacant.\nIt further said that every type of gathering apart from this place would be illegal and action will be taken in case of violation.However, in case of any unfortunate incident the permission would be withdrawn.\nThe gathering should not disturb or disrupt the fundamental rights of citizens of Islamabad and no roads must be blocked including G.T. road.\nSince it is also the responsibility to maintain the balance between the rights of participants (coming for peaceful protest) and the local citizens of Islamabad, only the directed route would be followed.\nThe ICT Administration has also asked to provide the list of people allowed on stage and has disallowed for any littering or banned substance near the venue. Walk-through gates to be installed at Entry Points should also be done in consultation with ICT Police.\nAs per the details, access to public or private property should not be obstructed, whereas clear way for fire brigades, ambulances, and other emergency vehicles should be ensured.\nThe ICT has also restricted for bringing in any infants or children under 18 years at the venue of sit-in. Participants should not enter any restricted area or obstruct any access during sit-in.\nIt said that Chairman PTI would be responsible for any human injury or health issue caused inside the venue. The ICT Police and Law Enforcement Agencies should not be obstructed to check any vehicle or person, as for the safety of general public.\nThe ICT has also asked the PTI Chairman to chalk out a parking plan in consultation with the Senior Superintendent of Police (Traffic) as to ensure no blockage on any roads.\nIf any damage is caused to Public or Private Property, then the organizer (PTI) will be responsible for it. CCTV cameras should also be installed at the venue and the ICT Administration must be taken in loop, they said.",
  "retrievedAt": "2025-08-11T15:50:31.062Z"
}
