{
  "title": "Khawaja Asif condemns firing incident on PTI’s container, says must not resort to violence",
  "link": "https://www.app.com.pk/national/khawaja-asif-condemns-firing-incident-on-ptis-container-says-must-not-resort-to-violence/",
  "date_published": "2022-11-03T15:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP): Defense Minister Khawaja Muhammad Asif on Thursday while condemning the firing incident on PTI Chief Imran Khan’s container near Wazirabad said the politicians must believe in dialogue and should refrain from resorting violence for political point scoring.\nAddressing the National Assembly he said, politics is a name of dialogue through which issues are resolved but it turns out to be violent if hate speech against political opponents are made.\nZulfikar Ali Bhutto’s judicial murder gave birth to violent political culture and later after 90’s the political environment of brotherhood gradually declined, said Khawaja Asif adding that the firing incident on Imran Khan is evidence that the political workers do not hesitate in killing their opponents for their political ideology.\nWhen the political leaders promote violence or make hate speeches against their political opponents, their followers naturally become violent, he said.\nThe minister said the political trend of using state operates for personal vendetta or political point scoring must be discouraged otherwise the bullet will rule in future.\nHe said the whole nation is condemning the firing incident on Imran Khan’s container but at the same time all political parties and leaders should promote the culture of dialogue at every level.\nHe said the whole house must condemn the attack on Imran Khan because he has been the Prime Minster of country and member national assembly as well.\nAddressing on the floor of the House, Member National Assembly (MNA) and Chairman Public Accounts Committee Noor Alam Khan condemning the incident inquired from the federal and Punjab government about the compromised security of Imran Khan. He said the country is going through a tough time but its enemy is busy creating anarchy therefore all politicians must sit together across the table for amicable solutions to their problems. He also condemned the arrest of former deputy speaker of Punjab Assembly Sardar dost Muhammad mazari and said that such incidents promote political intolerance.\nMNA Ghous Bux Mehar demanded an investigation of the firing incident. MNA Ghulam Mustafa Shah suggested to constitute a commission to inquire from the Punjab government about the security provided to the PTI chief Imran Khan.\nSardar Akhtar Mengal condemned the incident said that if the doors for dialogue are closed abusing language is used against political opponents then the decisions are made with bullet not through ballet. He said democratic parties have only option which is a dialogue.",
  "retrievedAt": "2025-08-11T15:50:23.766Z"
}
