{
  "title": "PTI govt to take steps resolving media workers’ problems : Shibli Faraz",
  "link": "https://www.app.com.pk/national/pti-govt-to-take-steps-resolving-media-workers-problems-shibli-faraz/",
  "date_published": "2020-05-03T03:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):Federal Minister for Information and Broadcasting Senator Shibli Faraz on Sunday said the Pakistan Tehreek-i-Insaf (PTI) government would take all possible steps for resolving the financial problems being faced by media persons.\nAddressing the participants of a media workers’ sit-in in front of the Parliament House, he said he would strongly advocate the cause of media industry at all relevant forums and play an proactive role in finding a durable solution to their genuine problems.\nHe said journalism was a noble and very important profession keeping in view its role in the political and social culture. An independent and vibrant media, and functioning democracy were inter-dependent .\nThe media’s role in the ongoing fight against coronavirus, he said, was appreciable. Like doctors and paramedical staff, the media persons were front line soldiers in that war.\nShibli Faraz said Prime Minister Imran Khan after coming into government took practical measures for the welfare of vulnerable segments of the society facing financial constraints.\nThe media workers, he said, had also been facing financial hardships for quite sometime. He assured the participants of the sit-in that he would meet their representatives in a couple of days and their problems would be addressed on priority.\nHe expressed the hope that there would be a good news for them before Eidul Fitr that major chunk of their outstanding salaries was paid.\nHe said he had come to the sit-in to express solidarity with them and to get information about the problems being faced by media workers. The media persons remained in the forefront of PTI’s struggle against the status quo and its government would never let them down.\nHe said he himself belonged to a literary family. As his father was related to the pen profession, he considered himself part of that tribe, so he could not think of going against the interests of that profession.\nHe said the government appreciated the constructive criticism by the media as the watchdog, which was helpful in improving governance. He expressed the hope that the media would also highlight the constructive and positive steps taken by the government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:34.657Z"
}
