{
  "title": "4 new COVID-19 positive cases traced in AJK",
  "link": "https://www.app.com.pk/national/4-new-covid-19-positive-cases-traced-in-ajk/",
  "date_published": "2020-05-03T00:52:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 03 (APP):With the appearance of four more cases of novel coronavirus in Azad Jammu Kashmir during last 24 hours, the number of confirmed coronavirus positive cases surged to 71 in the State on Sunday, AJK Health department said.\nAt the same time, the samples of new 142 suspects were tested in the labs.\nIn a statement on the updated situation of pandemic in AJK, issued on Sunday, the State Health Authorities confirmed registration of 4 new cases in AJK including 03 in Kotli district and one in Bhimbher district.\nAccording to the report issued by AJK Health Department Sunday evening a total of 2227 suspected cases were sent for test, of whom the result of 2156 had been received with 71 positive cases.\nOut of the total of 71 coronavirus positive cases, 44 have been fully recovered and discharged from the different health facilities across the state by Sunday.\nOut of existing 27 active cases, 07 are receiving treatment in Isolation hospital in Muzaffarbad, 07 in DHQ Hospital Palandri, 02 in THQ Hospital Dadayal, 07 in isolation hospital Muzaffarabad, 2 in THQ Hospital Dudayal, 2 in DHQ Hospital Bagh 01 in Bhimbher DHQ Hospital and 08 in DHQ Hospital Kotli. Three positive patients belonged to Sargodha, Pakistan were also under treatment in DHQ hospital Kotli.\n2085 persons were tested negative for COVID-19 while results of 71 cases are awaited which are scheduled to reach in a day or two next.\nThose 44 patients discharged after complete recovery include 12 from CMH Rawalakot, 15 from DHQ hospital Bhimbher, one from Kotli DHQ hospital, 12 from New Mirpur city teaching hospital, one from THQ Hospitla Dadayal and 03 from DHQ hospital Palandri.\nThe government has established 61 quarantine centers in all ten districts of the state while officials of the health departments deputed at entry points of the state were busy round the clock in screening the visitors.\nPCR testing is being done at Virology Lab Abbas Institute of Medical Sciences, CMH Rawalakot and Divisional Headquarter Hospital Mirpur.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:34.601Z"
}
