{
  "title": "NCC meeting will decide future of lockdown this week: Asad Umar",
  "link": "https://www.app.com.pk/national/ncc-meeting-will-decide-future-of-lockdown-this-week-asad-umar/",
  "date_published": "2020-05-03T03:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):Minister for Planning, Development and Reforms, Asad Umar on Sunday said the National Coordination Committee on Coronavirus would decide about the future course of lockdown after analysis and observations to be presented by National Command and Operation Centre (NCOC).\nThe meeting would be held this week with Prime Minister Imran Khan in chair, to decide the post May, 9 scenario in the country.\nAddressing a televised press briefing here, Asad Umar said the NCOC would share all its analysis about coronavirus in the meeting of NCC.\n“We do not follow the West blindly and the future decisions would also be taken according to our own ground realities,” he remarked.\nHe said keeping in view the growing number of deaths in the country, the people should adopt strict protective measures against COVID-19.\nHe said for last six days, on average, 24 people were dying of the disease daily but still the disease had not proven to be as chronic as in Europe and the US.\nComparing death rate of various countries in 46 days after 100 deaths, the minister said in Spain 414 people out of one million populations died while in Italy the number was 405, 256 in France, 248 in UK and 116 in US while in Pakistan only two coronavirus patients died out of one million populations.\nOn average, he said as compared to Pakistan, the US had 58 percent more deaths, UK had 124 percent more deaths while Spain had 207 more deaths.\nAsad Umar who also chairs NCOC, said there could be certain reasons behind low death rate in this region, adding that no one could claim to completely eradicate this disease.\nHe said every country was trying to flatten the curve to control the disease at a certain level.\nAbout the question why the government was not opening up everything if it thought that the disease was not so dangerous, the minister said “We are not opening up everything because we do not want to put burden on health system”.\nFollowing deteriorating conditions of economy during current situation, Asad Umar feared that around 18 million people could lose their jobs in the country due to ongoing lockdown imposed to prevent the spread of coronavirus disease.\nAccording to calculations of Pakistan Institute of Development Economics (PIDE), around 20 million 70 million population of the country could fall below the poverty line in the current perspective,” Asad Umar said in a televised press briefing here.\nThe minister said the government was facing huge economic loss due to the lockdown as only in April, it faced a loss of Rs 119 billion.\n“We have to run the course of the government, health, education and other systems and also to provide relief to the poor with the help of this tax money,” he added.\nHe expressed fear that due to lockdown, over one million small businesses could be washed forever.\nReferring to a survey conducted by GALLUP Pakistan, he said every single person, out of four said that they had to reduce quantity of food in their daily routine.\nWith respect to the current situation of health system, the minister informed that at present there were 5000 Intensive Care Units (ICU) available in the country out of which 1500 had been fixed for the corona patients while only 132 patients were admitted in the ICUS.\nSimilarly, he said the country had 1400 ventilator and by June this year, the number would rise to 2000.\nHe informed that at present, only 35 coronavirus patients were on ventilators.\nThe minister said the government was also increasing capacity of health sector adding that today’s health system of the country was far better as in pre-COVID days.\nHe said that the country had a capacity of 20000 testes per day, however, number of tests were low due to some technical reasons.\nHe said Europe has thousands of deaths and mostly have above 20,000 deaths but they were also relaxing lockdown to run their economies.\n“The target is to prevent healthcare system from getting choked besides reducing hunger, poverty, unemployment due to COVID-19”, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:31.984Z"
}
