{
  "title": "Govt -Timesaco agree for promotion of e-commerce retail in Pakistan",
  "link": "https://www.app.com.pk/national/govt-timesaco-agree-for-promotion-of-e-commerce-retail-in-pakistan/",
  "date_published": "2020-05-03T01:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):The federal government and Chinese digital company Timesaco have agreed to work on shared common e-commerce platform for introducing the online retail business in current challenging situation of COVID-19 pandemic.\n“We are negotiating with the ministry of commerce and soon both side would sign a Memorandum of Understanding (MoU) to promote online retail business in current lock-down situation in all major cities of the country, Chief Executive Officer (CEO) Chinese online Services company Timesaco, Donald Li told APP here on Sunday.\nHe said recently, Timesaco had launched an e-commerce platform ‘Dazaran’ for introducing the online retail business to facilitate people in current situation of COVID-19 pandemic.\n“We have decided to launch e-commerce Dazaran App in advance to support all merchants in Pakistan to open online stores through support in two hour instant delivery system in the same city to maintain retail business and reform the retail methods in Pakistan,” he added.\nDonald said Dazaran was a provider and operator of e-Commerce ecosystem platform in Pakistan.\nHe said under the umbrella of mother company Timesaco, “We are providing five different services to the customers in 10 major cities of the country including twin cities of Rawalpindi and Islamabad.”\nDonald Li said his company was committed for employment opportunities to the people in this critical situation of pandemic disease, when whole of the world was suffering from this curse, he added.\nThe CEO informed that the launch plan was three months ahead of schedule but because of people’s difficulties Dazaran started its operation to encourage business merchants to run their business online.\nReplying to a question, he said during COVID-19, merchants started facing business difficulties and people started facing the demand pressure of basic living goods.\nHe said that most merchants in Pakistan still use traditional retail model and in the face of pandemic, most of them were helpless and could not support their families.\nHe said the disruption of business operation had also brought great inconvenience to people’s living and mobility. Through this platform, merchants could easily and intelligently operate physical stores and online stores.\n“It is a provider and operator of same-city Instant logistics ecosystem platform,” The CEO said, adding through this platform, the same city distribution would be easy and the purpose of these two platforms had accelerated the restructure of the Commerce Ecosystem of the same city in Pakistan, that is, to realize the localized operation of the digital economy, and improve the efficiency of business operations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:35.576Z"
}
