{
  "title": "AJK President hopes arrival of digital revolution after COVID-19",
  "link": "https://www.app.com.pk/national/ajk-president-hopes-arrival-of-digital-revolution-after-covid-19/",
  "date_published": "2020-05-03T02:08:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 03 (APP):Azad Jammu and Kashmir President Sardar Masood Khan on Sunday said that a digital revolution in the healthcare system, economic planning, education, business and governance would be expected in Pakistan and Azad Jammu Kashmir after the coronavirus as the pandemic has highlighted the importance of data-based government steps.\nHe expressed these views while addressing a videoconference on “on Digital AJK under Sustainable Developing Goals during and after the Coronavirus pandemic.” here on Sunday. The videoconference was organized by “Digital Pakistan.”, AJK Presidential secretariat said in a news release.\nThe AJK president said that the Sustainable Development Goals have assumed primacy in the aftermath of COVID-19, especially those related to health, poverty, hunger, livelihoods, water and sanitation and energy.\n“Digital technology played a key role in tracing coronavirus patients and their testing, and we also had been able to establish three digitized testing centres in Azad Kashmir,” he added.\n“Our first priority in AJK was to diagnose and trace potential coronavirus patients. For testing and contact tracing, digital technology was crucial. Three testing centres that we established in AJK, were enabled digitally”, Masood Khan said.\nHe said that the latest digital data about coronavirus update is shared via the Internet and on WhatsApp. The Government in Muzaffarabad, he said, is digitally connected with the divisions and district offices and with the Rapid Response Teams in the field.\nThe Government and the philanthropists together made sure that nobody goes hungry during Covid 19. Again digital database helped us identify the needy and the indigent, he said. The AJK president said that five public sector universities in the liberated state are at present busy in preparations to impart online education to students, and efforts are being made to extend internet service to all areas with the help of service providers.\n“Experiments are also being made to provide modern healthcare facilities to the people in far-flung areas with the help of telemedicine technology,” he said adding that the AJK universities have also started providing education to students in new technologies such as artificial intelligence, internet of things, robotic blockchain, and cloud computing.\nSardar Masood Khan said that at present, the revival of economy and resumption of business and employment which has been badly affected by a coronavirus, are the biggest challenge for us, while another target of sustainable development is the peace and justice.\nReferring to the situation in Indian occupied Jammu and Kashmir, the AJK president said under the dark pall of the coronavirus, the Indian forces in the Occupied Jammu and Kashmir are killing young men, abducting and illegally detaining people, falsely charging journalists, and manhandling doctors and paramedics. A nine-month-old siege and lockdown are in place. Now a plan has been unveiled to grab Kashmiris’ land and jobs and settle non-natives in Kashmir. India is doing so to prevent popular opposition to its illicit rule.",
  "retrievedAt": "2025-08-11T19:10:35.187Z"
}
