{
  "title": "Opposition livid as AGP appears to back ‘judicial interference’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Awan refers to SC ruling on no-trust motion against Imran Khan as ‘complex matter’ requiring adjudication\n• PTI’s counsel rejects AGP’s view, says parliament is sovereign and not subordinate to courts\n• Senators alarmed by rising cases of gender-based violence in 2024; conviction rates below 1pc\n\nISLAMABAD: Attorney General for Pakistan (AGP) Mansoor Usman Awan on Monday called for keeping the doors open for judicial intervention in parliamentary proceedings.\n\nMaking a rare appearance before the Senate, some three weeks after being summoned for an explanation on the alleged interference of the judiciary in internal parliamentary processes, the AGP referred to Article 69 of the Constitution, under which the validity of any proceedings in parliament cannot be called in question on the ground of any irregularity of procedure.\n\nHowever, he insisted that the bar was not absolute. “There is a lot of sanctity attached to it, but it is not absolute,” he remarked.\n\nHe also referred to April 4, 2022, judgement of the Supreme Court, which declared unconstitutional the ruling of the then-deputy speaker on the no-confidence motion against the then-prime minister Imran Khan.\n\nHe said the PPP had filed the petition, and he himself and Barrister Ali Zafar appeared before the court as counsel.\n\n“Now in those circumstances it becomes very important to leave that door open, because sometimes matters could bring everything not just to a standstill but also produce consequences which may not have any resolution within the House. In this particular case, when the ruling came out, the assembly was dissolved. Where would the members have gone? Obviously, they had to go to the court, and the court did interfere,” Mr Awan said.\n\nThe Attorney General while talking about stay orders against proceedings of parliamentary committees, said a solution could be worked out. He further said that certain amendments in rules of procedure and conduct of business might be required.\n\nThe Attorney General’s remarks followed his meeting with former Senate deputy chairman Saleem Mandviwala who had raised the issue of judicial interference in the House last month. Mr Mandviwala told the House that he briefed the AGP on how the high courts were interfering in the proceedings of the House, issuing stay orders against proceedings of standing committees even before a decision has been taken.\n\n‘No room for granting a stay’\n\nPTI parliamentary leader Barrister Syed Ali Zafar also noted that standing committees were extensions of the parliament and that under the Constitution there was no room for granting a stay against their proceedings.\n\nHe noted that there should not be an institutional clash and that a solution should be found.\n\nMr Zafar, however, said that the Attorney General had wrongly interpreted the Constitution. He said courts can intervene where something is not being done in accordance with clear constitutional provisions. He added that the internal proceedings of the House and the committees cannot be touched. “We are sovereign and not subordinate to the courts,” he remarked.\n\nLaw Minister Azam Nazeer Tarar fully endorsed the remarks by the PTI leader. He noted that the principles of the trichotomy of powers must be followed by all. He added that how the country is to be run is ultimately for parliament to decide.\n\nGender-based violence\n\nSenators from both sides of the aisle also expressed alarm over increasing violence against women and low conviction rate. They were speaking on a motion seeking the House to discuss the alarming increase in cases of Gender Based Violence (GBV) in the country and failure of administrative and judicial machinery to administer justice to women.\n\nPPP Vice-President Sherry Rehman, who moved the motion, cited the latest report by the Sustainable Social Development Organisation. She said that in 2024 alone, a staggering 32,617 cases were reported across Pakistan. These included 5,339 incidents of rape, 24,439 cases of kidnapping and abduction, 2,238 cases of domestic violence, and 547 so-called honour killings.\n\nShe pointed out that despite the shocking scale of violence, justice remains elusive: the conviction rate for honour killings is less than 0.5 per cent, rape less than 0.5pc, kidnapping/abduction 0.1pc, and domestic violence 1.3pc (SSDO, 2024).\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:55:33.800Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931752/opposition-livid-as-agp-appears-to-back-judicial-interference",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T00:14:00.000Z"
}
