{
  "title": "Cotton output falls 17pc amid Punjab slump - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: Cotton arrivals in Pakistan dropped 17 per cent year-on-year to 887,400 bales as of Aug 15, primarily due to a sharp decline in Punjab’s output, raising concerns over the country’s domestic production outlook.\n\nAccording to data rel­ea­sed by the Pakistan Cot­ton Ginners Association (PCGA) on Monday, Pun­jab — once showing a 3pc increase in arrivals by July 31 — witnessed a re­­v­ersal by mid-August, with arrivals now 6pc lower than the same period last year. In contrast, Sindh, which was lagging 47pc behind last year’s figures at end-July, has narrowed its shortfall to 24pc.\n\nIndustry attribute the slump to recent rains, which have da­­­­maged quality, re­­ducing demand from textile mills and forcing many ginning factories to halt op­­erations. Ihsanul Haq, Chair­­­­man of the Cot­ton Gin­­ners Forum, remains hopeful that with improved conditions, ginning activity in Punjab will resume soon.\n\nCurrently, 113 ginning units are active in Punjab, compared to 131 in Sindh. Between Aug 1 and 15, Punjab’s ginning factories received just 68,000 bales, a sharp drop from 156,000 bales in the previous fortnight. Sindh, meanwhile, saw a surge from 140,000 bales to 226,000 bales during the same period.\n\nAs of Aug 15, Punjab’s total cotton arrivals stood at 370,000 bales, while Sindh led with 518,000 bales. Of the total 887,400 bales received nationwide, textile mills have purchased 806,000, with 81,000 bales still unsold.\n\nA glaring discrepancy exists between PCGA data and the Punjab Crop Reporting Service, which claims cotton production in Punjab reached 809,000 bales by Aug 14 — 118pc higher than PCGA’s recorded arrivals.\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:51:38.239Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931785/cotton-output-falls-17pc-amid-punjab-slump",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T00:14:17.000Z"
}
