{
  "title": "Rainwater from India floods Ravi, inundates Narowal villages - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL/ SARGODHA/LAHORE: A flood of 61,000 cusecs in the Ravi River has disconnected a dozen villages from the rest of the district Narowal and submerged hundreds of acres of agricultural land.\n\nDue to torrential rains in India and Kashmir, the water level in the Ravi is rising, especially in the Shikargarh tehsil where the river enters Pakistan from India. At the site of the border village of Kot Nina, there was a flood of 51,400 cusecs in the river on Monday. The flood later moved towards Jassar and Narowal.\n\nRainwater drain Bayan, Basantar and Nullah Auj also fell into the Ravi, increasing the flood level further. A flood of 61,000 cusecs was passing through the Jassar point in the Ravi when this report was filed. The floodwater overflowed the river banks wherever it found the space, inundating about a dozen villages, including Malik Bagh, Sultanpur, Raniwal, Tatarpur, Mandi Khel, Satwal, Mashriwal, Bhajana Kot, Nangali, Panwan Mardwal, Walipur, Hakimpur, Kotla and Kotha. No casualties or financial loss were reported in Narowal.\n\nFlood was rapidly moving towards Lahore when this report was filed.\n\nNarowal Deputy Commissioner Syed Hassan Raza told Dawn that the Ravi was flowing as usual and it had a capacity of 150,000 cusecs water. He claimed that the people were still safe from the flood and added that all the departments concerned, including the Rescue 1122, were on high alert to deal with any situation.\n\nPDMA issues alert, directs admin to take emergency measures, evacuate people; heavy rain triggers flooding in Soon Valley\n\nThe Provincial Disaster Management Authority (PDMA) also issued a low to medium level flood alert in the Ravi River for the next 24 hours, saying that 55,000 to 60,000 cusecs water was continuously entering the Ravi River at Jassar. The water flow in the Ravi River at Shahdara was 28,000 cusecs on Monday. It is likely to increase further, the authority said.\n\nIt issued instructions to the administration of the districts adjacent to the Ravi River to take emergency measures for the immediate evacuation of the citizens.\n\nThe PDMA directed district authorities to maintain vigilance in their areas while monitoring smaller streams like Palkhu Nullah in Sialkot for potential flash flood. “The overall situation is being managed, but proactive measures are essential to mitigate risks in vulnerable zones,” it said.\n\nOn Monday, the PDMA issued a medium level flood alert at different points in the Indus and Ravi rivers.\n\nIn Soon Valley, in the area of Khushab, heavy rain triggered flooding in water channels and canals, leading to the collapse of a road as well as a bridge.\n\nThe villages of Khoora, Sodhi Jaywali, Kaliyal and Kathwai were badly affected by the heavy rain. Khushab-Nowshera road route was cut off due to the bridge collapse near Kathua while a road collapsed in Khoora. The administration has instructed the drivers to take alternative routes. The wall of a government school was also partially damaged.\n\nKhushab Deputy Commissioner Farvah Amir visited the rain-affected areas and reviewed the relief activities. She said there was no cloudburst in tehsil Naushera of Soon Valley and all the people of the area were safe.\n\nThe DC remained in the field, visited the rain-affected areas and monitored the relief activities in the villages of Khoora and Sodhi Jaywali.\n\nShe ordered the institutions concerned and PDMA to remain active but said that the situation was completely under control while relief operations were going on in the affected areas.\n\nCommenting on the situation, former chairman District Council Khushab Ehsanullah Tiwana said the heavy rains were a result of climate change. He mentioned similar conditions in September 2020 when two mountain streams of Salt Range suddenly burst, causing flood that led to widespread destruction. He said about 65pc of the population of Khushab district was affected by the mountain drains of the Salt Range, including urban centres like Khushab, Jauharabad, Hadali, Mithatwana and Quaidabad.\n\nAfter the 2020 floods, Mr Tiwana said, funds were allocated in the Annual Development Programme 2021-22 to resolve the problem forever. Under this plan, the irrigation department hired a consultant firm which surveyed all the mountain drains of the Salt Range and prepared a comprehensive report in 2023, which sought channelising all mountain streams, creating new alarm systems and upgrading the old drain system. He strongly urged the authorities to immediately begin implementing this report.\n\nAccording to a PDMA flood report, the Indus River is currently experiencing medium-level flooding at three key locations including Kalabagh, Chashma Barrage, and Taunsa Barrage. At Kalabagh, the inflow is 471,192 cusecs with an outflow of 464,391 cusecs, and the water level is falling. Chashma Barrage reports an inflow of 490,674 cusecs and an outflow of 474,674 cusecs, with water levels rising. Similarly, Taunsa Barrage has an inflow of 477,899 cusecs and an outflow of 477,399 cusecs, also showing a rising trend. These locations are under close watch as they remain within the medium flood threshold range of 375,000 to 500,000 cusecs.\n\nOther major rivers like the Jhelum, Chenab, and Sutlej are operating within normal ranges. The Jhelum River at Mangla Dam has a high inflow of 260,000 cusecs but remains in the normal category. Rasul Barrage on the Jhelum shows minimal activity with only 4,585 cusecs inflow. The Chenab River and its associated barrages, including Marala, Khanki, Qadirabad, and others are all functioning normally with discharges well below flood thresholds.\n\nThe Sutlej River’s Sulaimahli site is having a low flood with 72,365 cusecs while at Islam, it is normal with 33,113 cusecs.\n\nSmaller streams and hill torrents, such as those in Rajanpur and DG Khan, are mostly normal. However, Palkhu Nullah at Cantt Bridge has crossed the medium flood threshold with a discharge of 1,185 cusecs, indicating localized flooding risks. Other nullahs like Sori Shumali and Sanghar have minimal flows of 2,450 and 3,675 cusecs, respectively, and remain normal.\n\nThe data highlights the Indus River as the primary concern, particularly at Chashma and Taunsa, where rising water levels could worsen flooding if inflows continue to increase.\n\nPDMA Director General Irfan Ali Kathia said that citizens should be informed about the possible situation through announcements from mosques.\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a3f900776da.jpg",
  "retrievedAt": "2025-08-20T04:55:03.705Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931847/rainwater-from-india-floods-ravi-inundates-narowal-villages",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T04:09:06.000Z"
}
