{
  "title": "Several more lives lost as rains continue to afflict KP - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Many go missing as torrential downpour triggers landslides, flash floods; 17 dead in Swabi, two in Nowshera\n• NDMA chief says monsoon season to remain ‘precarious’ in August; more spells expected, but respite will come in late September\n• Federal cabinet will donate salaries to aid flood victims, says PM Shehbaz\n\nSWABI: At least 17 people were killed on Monday in a heavy downpour that submerged houses, swept away people, and caused landslides in several parts of the Swabi district, besides claiming two lives in Nowshera district as well.\n\nSwabi Deputy Commissioner Nasrullah Khan said 12 houses had been submerged in Dalori village due to a ‘cloudburst’ while landslides also occurred in the hilly terrain of the district. He said that the downpour and landslides wreaked havoc in the Gadoon Amazai mountainous belt, adding that flash floods inundated several houses and swept away many people in the area.\n\nThe DC could not confirm the death toll due to information constraints, giving rise to conflicting figures.\n\nProvincial Irrigation Minister Aqibullah Khan, who visited flood-hit Dalori, said over 20 people had been killed in the downpour and at least 33 people were still missing. However, the Provincial Disaster Management Authority said 13 people, including two in Nowshera, were killed and 20 were injured in the torrential rain. Meanwhile, Rescue 1122 spokesperson Bilal Faizi said 11 deaths were confirmed in Swabi, while, as per locals, 17 to 18 people were missing.\n\nIt seems the death toll is likely to balloon, as a large number of people remained missing by the time this report went to press. Since Friday, the rainfall has claimed at least 341 lives across Khyber Pakhtunkhwa, as per the official figure.\n\nAmjad Gul, a local, said that many houses had collapsed due to the ‘cloudburst’. Nine bodies have been pulled out, while the rest were still under the rubble, he said. “It is not an easy task to pull people out of the rubble in Dalori. There is a dire need for an excavator. It seems that many people have been buried under the rubble,” he said.\n\nThe Met Department did not confirm if it was a cloudburst in Swabi, nor did it issue any statement about how much it rained in the district.\n\nIn another Sar Koi Payan, four people were killed after a house collapsed, burying nine members of a family. It was learned that the family had recently returned from Karachi and they were sitting in their newly built house, which suddenly collapsed in the rain. Local people pulled out the bodies from the debris and dispatched them to the Topi tehsil headquarters hospital.\n\nTwo Afghan refugees also lost their lives in a roof-collapse incident, while, in a separate incident, two people drowned in the floodwater of Karnal Sher Khan Kali nullah.\n\nDue to the downpour, the rainwater entered houses in the district, forcing people to take refuge on the roofs and move to safer locations, while the inundation and landslides completely paralysed the routine life in the region.\n\nSeveral vehicles were buried under debris due to ‘mountain sliding’ in Bada village in the worst-hit Gadoon Amazai belt. The electricity system completely collapsed, crops were destroyed, and roads could no longer be used by people.\n\n‘Precarious’ August\n\nSeparately, National Disa­­ster Management Auth­o­rity (NDMA) Chairman Lt Gen Inam Haider on Monday warned that monsoon conditions would remain precarious until the end of August, with normalisation expected by late September, state-run APP reported.\n\nSpeaking at a joint press briefing with Information Minister Attaullah Tarar and Climate Change Minister Dr Musadik Malik, the NDMA chief stated that the ongoing monsoon spell was expected to subside by Friday. However, he warned that the country remained at risk of further torrential downpours, with two to three additional spells likely in the coming weeks. Last spells will be ended by September 10, he said, adding that the overall situation was expected to normalise by the end of September.\n\nThe NDMA chief revealed that the ongoing monsoon season had caused 670 deaths and over 1,000 injuries, with 80 to 90 individuals still missing. Search operations were underway, and if the missing are not found, they will be added to the official death toll, he added.\n\nPM pledges support\n\nOn the other hand, Prime Minister Shehbaz Sharif pledged support to flood-hit areas, saying the federal cabinet would donate its one-month salary to aid the relief efforts. Presiding over a meeting to review ongoing relief efforts by the federal government in the flood-affected areas, he directed the federal institutions to intensify efforts to assist victims in various districts of KP.\n\n“In this hour of calamity, there is no federal or provincial government; we must ensure the assistance and rehabilitation of affected people,” the PM said. He stressed that the federal government would also provide financial assistance to the victims under the Prime Minister’s relief package.\n\nIt was informed that the federal government, provincial governments, Pakistan Army, and other institutions had established 456 relief camps and conducted 400 rescue operations so far.\n\nAccording to the preliminary estimates, damages to public and private property exceeded around Rs126 million. The NDMA presented a report on the provision of rations, tents, medicines, medical teams, and other essentials, with the prime minister directing an increase in the quantity of relief items.\n\n“Efforts are being made at the national level to deal with the current situation and on the instructions of the prime minister, the NDMA is in touch with the provincial governments, Informa­tion Minister Attaullah Tarar said.\n\nAccording to Mr Tarar, several meetings were held at the National Command and Control Centre before the monsoon, in which representatives of all provincial governments participated.“Data has been regularly provided by the NDMA to the relevant authorities through the early warning system,” he claimed.\n\nUnicef support\n\nUnicef announced on Monday that it has already dispatched essential medicines to affected areas in Khyber Pakhtunkhwa and Gilgit-Baltistan and stands ready to scale up support to the government’s coordinated response as needed to ensure the safety and well-being of children and families.\n\nUnicef Representative in Pakistan, Pernille Ironside, in a statement, said that “Unicef is deeply saddened by the tragic loss of life and devastation caused by the recent flash floods in Khyber Pakhtun­khwa. We extend our heartfelt condolences to the families who have lost loved ones and to all communities affected by this disaster”.\n\nSyed Irfan Raza and Amin Ahmed in Islamabad and Manzoor Ali in Peshawar contributed to this report\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a3b0745f22a.jpg",
  "retrievedAt": "2025-10-12T03:51:28.472Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931756/several-more-lives-lost-as-rains-continue-to-afflict-kp",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T00:14:00.000Z"
}
