{
  "title": "AJK high court strikes down quota system - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Declares application of quotas in govt services and professional colleges ‘unconstitutional, discriminatory, and against Islamic injunctions’\n• Orders recruitment and admissions on open merit, abolishes all past notifications extending quotas since 1972\n\nMUZAFFARABAD: In a landmark verdict that could reshape recruitment and admissions policy in Azad Jammu and Kashmir (AJK), the region’s High Court on Monday struck down the decades-old quota system in government services and professional colleges, declaring it unconstitutional and discriminatory.\n\nJustice Sardar Muhammad Ejaz, sitting as vacation judge, authored the judgement on a batch of six writ petitions instituted between 2016 and 2025, which were consolidated due to their common questions of law.\n\nThe earliest petition was filed in January 2016 by senior lawyers, including Amjad Ali Khan and others, seeking annulment of the 25 per cent quota in civil services reserved for refugees from Indian-occupied Kashmir settled in Pakistan, 6pc of which was later apportioned for post-1989 refugees.\n\nThe most recent petition was instituted in January 2025 by Raja Arbab Zaheer, challenging recruitment for section officers. Others petitions filed in 2022 and 2024 were also against quota-based appointments and admissions in medical and higher education institutions.\n\nIn a detailed 65-page judgement, the court declared that all notifications and rules enforcing quotas in government services and professional institutions were “repugnant to the\n\nAJK Interim Constitution, 1974, violative of fundamental rights, and against the injunctions of Islam.“\n\nJustice Ejaz observed that the fundamental rights enshrined in Article 4 — particularly the rights to equality, freedom of profession, and safeguard against discrimination in services — guaranteed that all State Subjects must be trea­ted equally and allowed to compete on merit.\n\n“Any job, post or educational seat created from the public exchequer is a trust which must go to the most deserving candidate,” the verdict read.\n\nThe judge noted that under the Constitution, no State Subject eligible for appointment could be discriminated against on the basis of “race, residence, caste, sex, or place of birth.”\n\nHe further cited Quranic injunctions emphasising competence and trustworthiness as the criteria for public positions, observing that the quota system “runs counter not only to constitutional rights but also to the commandment of Allah Almighty.”\n\nThe court acknowledged that successive governments had periodically extended the quota system through notifications — beginning in 1972 and continued in 1980, 1987, 1996, 2001, 2005, 2009, 2013, 2016, 2018 and 2021 — but ruled that such extensions were contrary to constitutional provisions.\n\nIt stressed that while para-6 of the 2013 notification suggested a transition to open merit after a grace period, the government had failed to implement it.\n\nRejecting objections that some petitioners lacked locus standi, the bench held that lawyers, students, and citizens could approach the court to protect fundamental rights of State Subjects.\n\nWhile setting aside the quota system, the judgement allowed only one exception: the government could lawfully fix a quota for disabled persons, as envisaged under law, but in all other cases “appointments and admissions must be made strictly on open merit.”\n\nJustice Ejaz underlined that the purpose of creating posts was not to distribute jobs but to enhance departmental efficiency.\n\n“If more competent persons are inducted through open competition, public institutions will perform better, and society at large will benefit,” he remarked.\n\nConcluding, the court accepted the leading petition filed in 2024 by Raja Shafiqullah Khan and others, struck down all notifications and provisions regarding the determination and enforcement of quota ‘with immediate effect,’ and directed authorities to ensure that recruitment in government services and admissions in AJK’s educational institutions — including seats reserved in different institutions across Pakistan — are henceforth made purely on merit.\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:51:05.997Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931809/ajk-high-court-strikes-down-quota-system",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T00:14:11.000Z"
}
