{
  "title": "China’s Foreign Minister Wang to visit Pakistan on Aug 21 for strategic dialogue: FO - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chinese Foreign Minister Wang Yi is set to visit the country this week for the sixth Pakistan-China Strategic Dialogue, the Foreign Office (FO) said on Tuesday.\n\nPakistan and China share a longstanding strategic partnership with ties ranging across different sectors — including trade, energy, defence and infrastructure. The fifth round of Strategic Dialogue in May 2024 was co-chaired by Foreign Minister Ishaq Dar and his Chinese counterpart Wang in Beijing.\n\nAccording to the FO’s statement today, “On the invitation of Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar … Mr Wang Yi is visiting Islamabad for co-chairing the sixth Pakistan-China Foreign Ministers’ Strategic Dialogue on August 21, 2025.”\n\n“The visit is part of the regular high-level exchanges between Pakistan and China to further deepen their ‘All-Weather Strategic Cooperative Partnership’, reaffirm support on the issues of respective core interests, enhance economic and trade cooperation, and reaffirm their joint commitment to regional peace, development and stability,” the statement added.\n\nThe development comes during Wang’s ongoing visit to India. During talks with Indian Foreign Minister Subrahmanyam Jaishankar on Monday, Wang said that China and India should “view each other as partners and opportunities, rather than adversaries or threats”.\n\nHe pointed to the resumption of “dialogue at all levels” and “maintenance of peace and tranquillity in border areas” as evidence that bilateral ties were on a “positive trend of returning to the main path of cooperation”.\n\nLast month, Dar met with Wang on the sidelines of the Shanghai Cooperation Organisation event, where the pair discussed and reaffirmed mutual support in core sectors, including agriculture, mining, industry and security.\n\n“China is ready to work with Pakistan to implement the important consensus reached by the leaders of the two countries, and push forward the building of a China-Pakistan community with a shared future,” Wang had said.\n\nIn February, President Asif Ali Zardari held a bilateral meeting with Chinese Premier Li Qiang in Beijing, with the two sides vowing to strengthen the Pakistan-China strategic cooperative partnership.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/19133055845bae6.jpg",
  "retrievedAt": "2025-08-20T04:55:00.560Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931871/chinas-foreign-minister-wang-to-visit-pakistan-on-aug-21-for-strategic-dialogue-fo",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T08:50:29.000Z"
}
