{
  "title": "Six Pindi districts put on alert after heavy rain forecast - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Provincial Disaster Management Authority (PDMA) on Monday asked the administrations of six districts of Rawalpindi division to remain ready to deal with heavy rains as predicted by the Pakistan Meteorology Department (PMD) in the next three days.\n\nPDMA Director General Irfan Ali Khatia directed to ensure the presence of rescue teams and equipment at sensitive places. He said PDMA had provided more rescue and relief equipment to Rawalpindi Division as a reserve. All officers and staff should be present in the field; there is no room for negligence, he said.\n\nContinuous monitoring of private dams should be ensured in the region. According to the instructions of the Punjab government, the safety of life and property of citizens is the top priority.\n\n“Citizens are requested to cooperate with the administration in any emergency situation. Rains are predicted for the next three days, the public should follow the precautionary measures issued by the administration. A landslide occurred on the expressway in Murree on Monday, the public should avoid unnecessary travel,” he said while addressing a meeting held at the commissioner office Rawalpindi.\n\nPDMA chief visits Rawalpindi to review arrangements, schools in Murree closed for two days, Rawal Dam spillways opened again\n\nThe meeting was attended by Commissioner Aamer Khattak, Deputy Commissioner Rawalpindi Dr Hasan Waqar Cheema and officials of other relevant departments. The meeting reviewed the measures taken regarding possible rains, including along Leh Nullah and rivers.\n\nThe PDMA chief said the government was assessing the damages, and relief activities were underway in affected areas. Rescue equipment has been provided to all relevant agencies. Encroachments are being eliminated.\n\n“This time the monsoon rains are longer, the administration is on alert. Pakistan has been affected by climate change, there is more rain than usual,” he said.\n\nThe officials informed the meeting that in Rawalpindi division, the administration was ensuring the evacuation of people from dangerous areas under preemptive measures.\n\n“The district administration and rescue agencies are monitoring the situation at all times,” they said.\n\nLater, the PDMA chief visited Leh Nullah at Gawalmandi bridge and reviewed the arrangements, including its cleaning.\n\nThe deputy commissioner informed him that cleaning of Leh Nullah was in progress. “We are keeping an eye on the drains adjacent to Leh Nullah, Wasa teams are deployed with heavy machinery in low-lying areas.”\n\nWasa Managing Director Saleem Ashraf said special teams had been formed for drainage. Staff leaves are cancelled, and machinery has been kept on alert with the civic body ready to deal with emergency situation.\n\nMeanwhile, more than 88mm of rain was recorded in Murree triggering landslides at various places, including Lower Topa, Chitta Mor and Shawala. However, traffic was not disrupted. Trees fell at many places due to heavy rain and wind. Immediate relief operations were carried out by the district administration.\n\nSchools in Murree Closed\n\nOn the other hand, the Murree Education Department issued a notification to close schools for two days. According to the notification, schools have been closed in view of the weather conditions.\n\nDeputy Commissioner Murree Agha Zaheer Abbas Shirazi issued instructions to the relevant departments to remain on alert.\n\nRawal Dam spillway opened\n\nThe water level in Rawal Dam reached 1751 feet at 12:10pm after the rain and the spillways were opened at 1:30pm after taking all necessary precautions, said Small Dam Organisation Subdivisional Officer Arslan Abbas.\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:55:18.216Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931744/six-pindi-districts-put-on-alert-after-heavy-rain-forecast",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T00:14:46.000Z"
}
