{
  "title": "Markram, Maharaj lead South Africa to crushing win against Australia in ODI series-opener - Sport - DAWN.COM",
  "author": null,
  "content": "South Africa’s Aiden Markram hit 82 before left-arm spinner Keshav Maharaj tore through Australia’s new-look batting order as the Proteas claimed the One-Day International series opener by 98 runs in Cairns on Tuesday.\n\nSent in to bat, Markram — opening for the first time in ODIs since 2021 — crunched nine boundaries in his 81-ball knock to power South Africa to a formidable 296-8.\n\nSkipper Temba Bavuma (65) and Matthew Breetzke (57) also helped set the tone for the three-match ODI series.\n\nIn reply, openers Mitchell Marsh and Travis Head flattened South Africa’s pacemen as Australia raced to 60-0 after seven overs.\n\nBut the match flipped after the introduction of spin, with Maharaj conjuring rampant turn, and he picked up four wickets in his first 15 balls.\n\nHe finished with career-best figures of 5-33 from 10 overs as Australia were dismissed for 198 in the 41st over.\n\nIt was a strong bounce back from South Africa after their 2-1 defeat in the Twenty20 series between the teams.\n\n“I just tried to utilise the conditions and was fortunate to get the rewards,” Maharaj said.\n\nMarsh played a lone hand with 88 off 96 balls in a disappointing batting effort from Australia, transitioning after the recent retirements of veterans Steve Smith and Glenn Maxwell from ODI cricket.\n\n“He’s (Maharaj) an outstanding bowler and there was certainly a little bit more spin than we expected,” said Marsh, who is captaining Australia in this series in place of Pat Cummins.\n\nSouth Africa had been rocked by the news that quick Kagiso Rabada would miss the series with an ankle injury.\n\nAn unruffled Markram appeared to be cruising to his fourth ODI century before he was caught behind off left-arm quick Ben Dwarshuis in the 24th over.\n\nA sluggish Bavuma was overtaken by Breetzke, playing his third ODI.\n\nBut South Africa lost three wickets for just seven runs with the fall of Breetzke, Tristan Stubbs (duck) and Dewald Brevis (six), before Bavuma kicked on.\n\nAfter a breakout T20 series, ODI debutant Brevis hit a first-ball six — but then holed out to Head, who finished with 4-57.\n\nHead’s excellent match continued with the bat until he was stumped for 27, providing debutant offspinner Prenelan Subrayen with his first ODI wicket.\n\nMaking his return since being axed from Australia’s Test team, Marnus Labuschagne (one) fell on his sixth delivery after unsuccessfully reviewing an lbw decision off Maharaj.\n\nCameron Green (three) and Josh Inglis (five) were clean bowled by a pumped-up Maharaj, who also had Alex Carey lbw for a golden duck.\n\nMaharaj was unable to complete the hat-trick, but claimed his maiden five-wicket haul in ODI cricket when he knocked over Aaron Hardie (four).\n\nThe second game will be played in the northern Queensland city of Mackay on Friday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/191739307f16a11.jpg",
  "retrievedAt": "2025-08-20T04:55:00.666Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931892/markram-maharaj-lead-south-africa-to-crushing-win-against-australia-in-odi-series-opener",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T12:50:35.000Z"
}
