{
  "title": "Indian police exhume human remains in mass-burial investigation - World - DAWN.COM",
  "author": null,
  "content": "Indian police have exhumed human remains in a temple town in Karnataka, officials said, as part of an investigation into allegations that hundreds of murder and rape victims were secretly buried there from around the mid-1990s.\n\nThe probe centres on Dharmasthala, home to an 800-year-old temple dedicated to the Hindu god Shiva in the state of Karnataka and is drawing headlines in media nationwide.\n\nA former cleaner at the temple told police last month that he had been forced by superiors to dispose of hundreds of bodies over two decades, many of them women and girls showing signs of sexual assault.\n\nHis allegations were made in a police complaint dated July 4 and seen by Reuters.\n\nThe man, whose identity authorities have withheld for safety reasons, fled Dharmasthala in 2014 but said he was compelled to speak out now because of lingering guilt.\n\n“If the skeletons now exhumed receive respectful funeral rites, those tormented souls will find peace and my sense of guilt could also decrease,” he wrote in the complaint.\n\nThe police did not immediately respond to a request for comment. A spokesperson for the temple said it welcomed a thorough investigation and hoped police would “bring out true facts to light”.\n\nIn the complaint, the former cleaner accused temple officials of forcing him to dispose of the bodies and told police he would name the officials if they protected him and his family. Karnataka’s interior minister told the state assembly on Monday that the protection was now in place.\n\nThe former cleaner said he had secretly exhumed a skeleton from one of the burial sites to prove his claims.\n\nA special investigation team formed by the Karnataka government has so far recovered human remains from two of 16 suspected burial sites, according to two senior police officials familiar with the probe. They declined to be identified because of the sensitivity of the matter.\n\nKarnatakas interior minister, Gangadharaiah Parameshwara, said the police have collected bone fragments, soil samples, and other material for testing from two sites thanks to the information from the former cleaner.\n\n“The analysis is ongoing. Only once that is complete can we say the investigation has truly begun,” Parameshwara said.\n\n“My request is to not make this a religious matter.” Sachin Deshpande, a lawyer for the complainant, told Reuters “they have found human remains where our client pointed and we are sure that the truth will come out”.\n\nHe declined to make his client available for an interview.\n\nThe revelations have revived interest in older unsolved cases, including Padmalatha, a college student whose family alleged she was raped and murdered in Dharmasthala in 1986. Padmalatha, like many in India, went by one name.\n\nHer sister, Indravathi, said the family buried Padmalathas body rather than cremating it according to Hindu custom, hoping that would help with any investigations later.\n\n“We hope that we will get justice one day for her abduction, rape and murder,” said Indravathi, who uses only one name.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:55:00.380Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931872/indian-police-exhume-human-remains-in-mass-burial-investigation",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T08:12:29.000Z"
}
