{
  "title": "Alcaraz wins Cincinnati Open after ailing Sinner retires in final; Swiatek downs Paolini to claim first title - Sport - DAWN.COM",
  "author": null,
  "content": "Carlos Alcaraz won the Cincinnati Open after top seed Jannik Sinner retired as he was feeling unwell on Monday, raising concerns about the Italian’s fitness just days before he is due to begin the defence of his US Open title.\n\nThe Spanish second seed snapped the world number one’s 26-match winning streak on hardcourts when his ailing rival signalled he could no longer continue while trailing 5-0 in the first set of the final.\n\n“This is not the way that I want to win trophies, I just have to say sorry, I can understand how you must feel now,” Alcaraz told Sinner during the presentation ceremony after capturing his third Masters 1000 crown of the season following his success in Monte Carlo and Rome.\n\n“As I said many times, you are a true champion and I am sure from these situations, you are going to come back even stronger, as you always do. That’s what true champions do.”\n\nSinner had been bidding to become the first man since Roger Federer in 2015 to win back-to-back Cincinnati titles but he looked uncomfortable early on in the sweltering conditions.\n\nHe called it quits after 23 minutes of play.\n\n“I’m super, super sorry to disappoint you,” Sinner told the crowd. “Yesterday I didn’t feel great. I thought that I would improve during the night, but it came up worse.\n\n“I tried to come out, tried to make it at least a small match, but I couldn’t handle more, so I’m very sorry.”\n\nIt was also unclear whether the Italian would be fit enough to partner Katerina Siniakova in the revamped mixed doubles event at Flushing Meadows which is due to take place on Tuesday and Wednesday.\n\nSingles action at the hardcourt major begins on Sunday.\n\nMonday’s clash had been expected to be a dress-rehearsal ahead of a potential final showdown between the world’s two best players in New York, with the duo having faced off in the title match at the last two majors.\n\nAlcaraz came from two sets down and saved three championship points to triumph at Roland Garros, while Sinner emerged victorious at Wimbledon.\n\nMonday’s result extended Alcaraz’s head-to-head record over Sinner to 95, including a 62 edge on hardcourts.\n\nLater in the evening, Iga Swiatek captured her first Cincinnati Open title by beating Jasmine Paolini 7-5 6-4, with the Pole third seed sending a powerful message ahead of the US Open.\n\nThe six-times Grand Slam winner did not drop a set on her way to the title and was clinical in the final, converting all six of her break points to clinch her 11th WTA 1000 crown and first since last year’s Italian Open.\n\nShe is now the second all-time winner in the WTA 1000 format history, trailing only Serena Williams (23).\n\n“I want to thank my team. I dont know why I won tournaments that were like the last ones in terms of where I thought I would be playing well,” Swiatek said.\n\n“Thank you for forcing me to become a better player and learning how to play on these faster surfaces. I’m shocked and super happy.”\n\nPaolini made the brighter start, surging to a 3-0 lead and pushing Swiatek to the brink of a double break. Yet the Pole responded with a five-game run and, after squandering her first chance to serve out the opening set, closed it on her second attempt.\n\nSwiatek carried her momentum into the second set, saving two break points at 4-3 before holding firm to move within one game of the title. She sealed victory at the first opportunity with a big serve, extending her perfect record against the Italian to 60.\n\nThe win ensures Wimbledon champion Swiatek will climb back to world number two, securing the second seed for the final major of the year at Flushing Meadows, where singles action begins on Sunday.\n\nSwiatek is also set to team up with Norway’s Casper Ruud in the new US Open mixed doubles event.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:55:03.178Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931846/alcaraz-wins-cincinnati-open-after-ailing-sinner-retires-in-final-swiatek-downs-paolini-to-claim-first-title",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T04:26:27.000Z"
}
