{
  "title": "US envoy says it’s now Israel’s turn to ‘comply’ as Lebanon moves to disarm Hezbollah - World - DAWN.COM",
  "author": null,
  "content": "BEIRUT: US envoy Tom Barrack on Monday called on Israel to honour commitments under a ceasefire that ended its war with Hezbollah, after the Lebanese government launched a process to disarm the group.\n\nUnder the November truce, which ended more than a year of hostilities including two months of all-out war between Israel and Hezbollah, the Iran-backed group was to withdraw its fighters from near the Israeli border and weapons were to come under the control of the Lebanese state.\n\nIsrael was to withdraw its troops from the country but has kept them at five border points it deems strategic and has continued to strike Lebanon, threatening to do so until Hezbollah has been disarmed.\n\n“There’s always a step-by-step approach but I think the Lebanese government has done their part. They’ve taken the first step. Now what we need is Israel to comply,” Barrack said following a meeting in Beirut with Lebanese President Joseph Aoun.\n\n“We’re all moving in the right direction,” he said after meeting parliament speaker Nabih Berri. Berri, a Hezbollah ally, said Israel’s commitment to the ceasefire and its troop withdrawal was “the gateway to stability in Lebanon”, a statement said.\n\n‘Progress’\n\nAsked by reporters whether he expected to see Israel fully withdraw from Lebanese territory and stop its violations, Barrack said that “that’s exactly the next step” needed. “We need participation on the part of Israel, and we need an economic plan for prosperity, restoration and renovation,” the US diplomat added, with Lebanon weighed down by an economic crisis.\n\nBarrack said Washington was “in the process of now discussing with Israel what their position is”, adding that “in the next few weeks you’re going to see progress on all sides.” “It means a better life for the people... and at least the beginning of a roadway to a different kind of dialogue” in the region, he said.\n\nThe visit comes after Lebanon’s cabinet tasked the army with developing a plan to disarm Hezbollah by year end — an unprecedented step since civil war factions gave up their weapons decades ago.\n\nThe cabinet has also tackled a US proposal that includes a timetable for Hezbollah’s disarmament, with Washington pressing Lebanon to take action.\n\nThe cabinet endorsed the introduction of the US text, which lists 11 objectives including to “ensure the sustainability” of the ceasefire, and to phase out “the armed presence of all non-state actors, including Hezbollah” across all Lebanese territory.\n\nIt also provides for demarcating Lebanon’s land borders with Israel and neighbouring Syria, and a process involving the international community to support reconstruction.\n\n‘Lebanese process’\n\nAoun told Barrack that what was needed was for “other parties to adhere to the contents” of the joint declaration, “more support for the Lebanese army”, and expedited steps towards reconstruction, the presidency said.\n\nPrime Minister Nawaf Salam said Washington needed to “fulfil its responsibility in pressuring Israel halt hostilities”, withdraw troops and release Lebanese prisoners it holds.\n\nPublished in Dawn, August 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1914501372d1d65.jpg",
  "retrievedAt": "2025-08-20T04:55:18.920Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931792/us-envoy-says-its-now-israels-turn-to-comply-as-lebanon-moves-to-disarm-hezbollah",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T00:14:31.000Z"
}
