{
  "title": "At least 7 dead as heavy rain lashes Karachi; commuters brave hours-long traffic jams - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least seven people were killed in rain-related incidents as heavy downpours lashed Karachi on Tuesday, leaving commuters stranded for hours in massive traffic jams as rainwater accumulated rapidly on the main thoroughfares of the megacity.\n\nVisuals shared widely on social media showed main roads and arteries of the city submerged during rush hour, with traffic gridlocked as a result. Those who had managed to reach work earlier in the day reported reaching home after several long hours navigating the city’s flooded roads.\n\nRescue-1122 spokesperson Hassaanul Haseeb Khan told Dawn.com that four walls of a house collapsed during heavy rains in Gulistan-i-Jauhar’s Block-12, with five family members buried underneath.\n\nHe said the department’s Urban Search and Rescue Team arrived at the spot and retrieved the five from the debris, but three of them had died on the spot. A fourth succumbed to wounds during treatment, while the fifth person was being treated. He said all victims belonged to the same family.\n\nHaseeb said an eight-year old child was also killed when a wall of a house collapsed in Orangi Town near Khalil Market during the downpour. He said a Rescue 1122 team rushed to the spot and recovered the body, which was taken to Abbasi Shaheed Hospital.\n\nThe spokesperson also shared that a man had died from electrocution in North Karachi, adding that the body was taken to Abbasi Shaheed Hospital for legal formalities.\n\nIn another incident, Haseeb said a man was burnt to death while two others suffered critical burn wounds when a fire erupted at a petrol pump in Malir. He told Dawn.com that the fire, suspected to be caused by a short circuit, occurred around 3:48pm.\n\nHe said three people suffered critical burn wounds and were moved to a hospital, but one of them succumbed to his injuries while the other two were in critical condition.\n\nHaseeb said both petrol pump staff and Malir Senior Superintendent of Police Abdul Khaliq Pirzada told the rescue team that a short circuit triggered the fire.\n\nSindh Chief Secretary Asif Haider Shah directed the district administration, the Sindh Provincial Disaster Management Authority (PDMA), the health department, and Rescue 1122 to remain on high alert amid the situation.\n\nHe ordered the immediate drainage of rainwater and instructed the relevant administrations to remain in contact with the Pakistan Meteorological Department (PMD) and the PDMA.\n\n“All deputy commissioners should be present in the field with their staff,” the chief secretary said.\n\nIn another development, the Pakistan Telecommunication Company Ltd (PTCL) said it was currently facing data connectivity challenges on PTCL and Ufone services.\n\n“Our teams are diligently working to restore the services as quickly as possible,” the statement said.\n\nInternet tracking monitor Netblocks also said its metrics showed major disruption to internet connectivity across Pakistan, with high impact to backbone operator PTCL.\n\n“Overall national connectivity is down to 20 per cent of ordinary levels,” it said. The loss of internet connectivity added to the confusion in Karachi, as people struggled to get information about the latest developments on the urban flooding situation and check on loved ones.\n\nIn an update posted at 9pm, K-Electric spokesperson Imran Rana said the company’s power distribution system was stable despite the city facing urban flooding.\n\n“At this time, power supply continues to more than 1,285 out of 2,100 feeders in Karachi. Restoration work is facing severe difficulties due to accumulated rainwater in various areas.\n\n“Restoration work is ongoing in affected areas as soon as accumulated rainwater recedes and safety clearance is received from on-ground teams,” the spokesperson said.\n\nHe also provided the names of areas where power was currently being restored and where work had already been completed.\n\nMeanwhile, a notification from the Sindh government’s school department ordered all private and public educational institutions under its purview to remain closed tomorrow (Wednesday) due to the rain emergency.\n\nSeparately, the Pakistan Meteorological Department, in a weather advisory, forecast intermittent rains to continue throughout the day.\n\nThe minimum temperature is expected to remain at 28 degrees Celsius, while the humidity will be 85 per cent.\n\nA weather forecast from the PMD earlier in the day had predicted “torrential rains” in Sindh and parts of Balochistan in the next couple of days.\n\n“Strong monsoon currents from the Arabian Sea and the Bay of Bengal are continuously penetrating the country, especially the southern parts,” the PMD said.\n\nIt added that under the influence of the above, widespread rain-wind/thundershower (with scattered heavy falls, at times very heavy) were expected in Mithi, Tharparkar, Umerkot, Mirpurkhas, Hyderabad, Shaheed Benazirabad, Karachi, Thatta, Badin, Sajawal, Tando Allayar, Tando Muhammad Khan, Sanghar, Jamshoro, and at scattered places in Sukkur, Larkana, Khairpur and Jacobabad from August 19-22 with occasional gaps.\n\nThe PMD said rain-wind/thundershower (with scattered heavyfalls) were expected in Balochistan’s Barkhan, Musakhel, Loralai, Sibbi, Zhob, Qilla Saifullah, Khuzdar, Lasbella, Awaran, Kech, Gwadar and Panjgur from Aug 19-22 with occasional gaps.\n\nIt added that subdued rain-wind/thundershower were expected at isolated places in Islamabad, Kashmir, Gilgit-Baltistan, Rawalpindi, Attock, Murree/Galliyat, Chakwal, Jhelum, Gujrat, Gujranwala, Sialkot, Lahore, Dera Ghazi Khan, Multan, Rajanpur, Dir, Chitral, Swat, Kohistan, Shangla, Battagram, Mansehra, Abbottabad, Haripur, Buner, Malakand, Bajaur, Mohmand, Peshawar, Charsadda, Nowshera, Mardan and Swabi from Aug 19-22.\n\nThe PMD warned that torrential rains may cause urban floods in Karachi, Thatta, Badin, Sajawal, Tharparkar, Umerkot, Mirpurkhas, Hyderabad, Shaheed Benazirabad, Tando Allayar, Tando Muhammad Khan, Sanghar and Jamshoro from Aug 19-22.\n\nIt also cautioned that torrential rains may generate flash floods in north/southeastern parts of Balochistan from Aug 19-22.\n\nIt advised all authorities to remain alert and take necessary measures to avoid any untoward situation.\n\nA day prior, Sindh Chief Minister Syed Murad Ali Shah chaired an emergency meeting to oversee preparations for the monsoon rains.\n\nA press release from his office said CM Shah put all the local bodies, administration and traffic police on high alert, and directed them to strengthen coordination between the relevant departments and organisations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/19200214dbc0f2a.jpg",
  "retrievedAt": "2025-08-20T04:55:02.952Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931859/at-least-7-dead-as-heavy-rain-lashes-karachi-commuters-brave-hours-long-traffic-jams",
  "dateList": "2025-08-19",
  "date_published": "2025-08-19T05:09:46.000Z"
}
