{
  "title": "US, India share desire to maintain regional stability and peace - World - DAWN.COM",
  "author": null,
  "content": "As political tensions in South Asia have simmered down, the US and India reaffirmed their “shared desire to maintain regional stability and peace,” according to a statement by the US State Department.\n\nThe developments follow a recent military confrontation between India and Pakistan over New Delhi’s allegations against Islamabad, without evidence, about a deadly attack in occupied Kashmir’s Pahalgam.\n\nOn the night of May 6-7, New Delhi launched a series of air strikes in Pakistan, resulting in civilian casualties. Islamabad responded by downing five Indian jets. After intercepting drones sent by India and tit-for-tat strikes on each other’s airbases, it took American intervention on May 10 for both sides to finally drop their guns as a ceasefire was reached.\n\nAt the height of the conflict, US President Donald Trump warned Pakistan and India of “not doing any trade” if they did not stop fighting.\n\nA date prior, Deputy Secretary Christopher Landau met with Indian Foreign Secretary Vikram Misri in Washington, the US State Department said. It noted that Landau “reaffirmed the close partnership between the US and India, a key component of US foreign policy for the 21st century.\n\n“He underscored the importance of fair and reciprocal market access to fostering economic growth and prosperity in both countries,” the statement said.\n\nIt added that Landau also emphasised the importance of enhanced cooperation on migration and counternarcotics.\n\n“The Deputy Secretary and the Foreign Secretary also reaffirmed their shared desire to maintain regional stability and peace.”\n\nIn a post on X early on Thursday, Landau spoke of his meeting with Misri, saying the US-India relationship is at a “historic zenith and represents a key partnership in the 21st Century.\n\n“We discussed the importance of expanding fair and reciprocal trade, combatting illegal immigration, and expanding counternarcotics cooperation,” he said.\n\nEarlier this month, Trump said that India had offered a trade deal that proposed “no tariffs” for American goods while expressing his dissatisfaction with Apple’s plans to invest in India.\n\nNew Delhi is seeking to clinch a trade deal with the US within the 90-day pause announced by Trump on April 9 on tariff hikes for major trading partners.\n\nThe US is India’s largest trading partner, with bilateral trade totalling some $129 billion in 2024. The trade balance is currently in favour of India, which runs a $45.7bn surplus with the US.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/291606040bc400f.png",
  "retrievedAt": "2025-08-23T14:32:52.638Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914082/us-india-share-desire-to-maintain-regional-stability-and-peace",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T11:26:28.000Z"
}
