{
  "title": "Fictitious assets - Newspaper - DAWN.COM",
  "author": null,
  "content": "SOME sort of a crypto bug seems to have gripped the government and perhaps some of it is warranted.\n\nFrom the details reported in the international media we learn that at least some of the efforts of the Pakistani government in the crypto domain are geared towards procuring influence in Washington DC, with those close to the Trump administration coming to Pakistan for crypto-related discussions.\n\nTo that extent we can look at what is happening and say “it is what it is” and leave it at that. But the moment the government begins to take crypto seriously as a business proposition it becomes dangerous. And it is important to keep this distinction in mind, between crypto as an influence peddling tool versus a serious business proposition, because the resources the government will put at risk if it ventures into the world of crypto are public resources.\n\nIn the past few weeks, since the Crypto Council was announced by the government, we have seen suggestions appear in print on how Pakistan can expand its participation in the wider world of cryptocurrencies. One suggestion was to place a portion of Pakistan’s foreign exchange reserves in crypto, and the individual making this suggestion deployed a classic tactic used by small-time stock brokers or real estate agents selling junk to gullible clients. He pointed to the rise in the value of Bitcoin over the past decade, and asked the reader to imagine if Pakistan had placed a certain amount of its reserves in this asset, how much that value would have multiplied by today.\n\nWhat was not mentioned in the article was the sheer volatility of currency over that same time period. Sovereign reserves are never gambled with in volatile assets. They are, as a rule, always invested in fixed-income instruments. It’s the same principle when managing pension funds or other institutional savings. The principles are low-volatility, low-risk, fixed return.\n\nThe resources the government will put at risk if it ventures into the world of crypto are public resources.\n\nAnother argument encouraged the state to go into crypto mining by offering the right “incentives”. The right incentives apparently include providing them with electricity at around five to six cents per unit. For comparison consider that you and I pay somewhere around 20 cents per unit for our electricity, with industry somewhere around 14 cents. The most obvious question to ask when considering this proposition is this: if Pakistan has electricity to give at five cents per unit, why should crypto miners be the first to get it?\n\nA puzzling press release from the finance ministry a few days ago added to the confusion. It announced that the government has “allocated” 2000MW for crypto mining. It was puzzling because there was no mention of price (the single most important thing to mention in such an announcement), but more importantly, there is literally no such thing as electricity allocations in Pakistan. There are no quotas of who gets how much electricity. So what exactly is being announced in this press release?\n\nThe third suggestion that has been floated is to create on-shore crypto exchanges in Pakistan, much like we already have a commodities exchange. This is probably the most benign of the suggestions since all it does is make crypto trading a regulated activity without putting any state resources into play.\n\nIt is critical to keep in mind that crypto is a fictitious asset. It is not the first, nor the last of these. Fictitious assets are those that exist only in the mind of the holder. If enough people buy into the fiction they can become liquid, meaning you can trade them for real goods and services. Money, for example, is a fictitious asset as is gold. But both are highly liquid. I can pay my bills with money, buy my groceries, because almost everyone in my society buys into the fiction that money (or gold) represent.\n\nNot so with crypto. This is purely a speculative asset, created for speculative purposes, given prominence by speculator interests, and currently in the process of being pumped by a massive speculative scheme being launched by the White House itself. This endows it with a great deal of speculative value. But none of it is real.\n\nIn the past we have seen fictitious assets grow to unmanageable proportions and pose risks to the entire global financial system. Collateralised Debt Obligations (CDOs) were fictitious assets when left unregulated, because those creating them were able to bundle junk mortgages by illiquid borrowers into their offering and sell them as a AAA-rated financial product. This scam became so large in the late 2000s that it lay at the root of the greatest financial collapse since the Great Depression.\n\nCDOs are still around, but as a regulated product they now pose little risk of growing into a threat to the financial order. But speculator capital has its own ingenuity. Think of plot files being sold by unscrupulous property developers, in housing projects they haven’t even begun acquiring land for yet. That is a fictitious asset, and trading in it brings enormous risks that should not be taken by retail investors or those entrusted to manage the wealth of others, such as sovereigns or pension fund managers.\n\nFictitious assets have always been around in the modern world. The South Sea Bubble in the early 18th century was created by massive investments in the stock of a company that had no prospects of actually being able to do the business it was supposed to do (sell slaves to the Spanish colonies of South America).\n\nThey are around in our time too and crypto is just one of their manifestations. It’s fine for those who wish to trade in these sorts of fictitious assets with their own money. But the state should beware the wiles with which the salesmen of this snake oil try to lure you into their racket.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6837c8ce64cc4.jpg",
  "retrievedAt": "2025-08-23T14:32:55.770Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914010",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T02:44:04.000Z"
}
