{
  "title": "Migrant boat capsize kills seven in Spain - World - DAWN.COM",
  "author": null,
  "content": "MADRID: Four women and three girls drowned on Wednesday after migrants disembarking their overcrowded boat in Spain’s Canary Islands accidentally capsized the vessel, emergency services said, the latest tragedy on the perilous route.\n\nEmergency services in the Atlantic archipelago initially confirmed on X “the death of two women after the capsizing of a vessel” in La Restinga port on the island of El Hierro.\n\nThey later reported the deaths of two other women, two girls aged five and another aged 16, which meant the accident “has resulted in seven people dead”. The mayor of El Pinar municipality north of La Restinga, Juan Miguel Padron, told local television around 150 people were on the boat.\n\nJust as they reached “the promised land”, some “were trapped in the boat, and others died while being saved”, he added. A three-year-old boy and a five-year-old girl almost drowned and were transported by helicopter to a hospital in Tenerife, the largest of the Canary Islands, the emergency services added on X.\n\nTwo three-month-old babies, a pregnant woman and three minors were in hospital on El Hierro, they said. Spanish public broadcaster RTVE aired footage of rescuers throwing lifebuoys to people clinging onto an overturned boat and treading water off El Hierro. Spain’s maritime rescue service said in a statement that a rescue ship had found the boat that morning and accompanied it to La Restinga.\n\n“During the disembarkation, some of the people travelling on the boat crowded on one of the sides, which caused it to tilt and capsize,” the service said.\n\n“The transfer of people is the most delicate moment of the operation and, with the vessels being overloaded and with precarious security conditions, the difficulty increases notably.” Alpidio Armas, head of El Hierro’s local government, questioned how the migrants could be saved on the high seas but die in the apparent safety of a port. “We are doing something wrong,” he told reporters.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/291216271350eb3.jpg",
  "retrievedAt": "2025-10-12T03:20:57.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913978/migrant-boat-capsize-kills-seven-in-spain",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T00:05:40.000Z"
}
