{
  "title": "62 Baloc­histan Levies officials suspended over bribery charges - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Sixty-two Lev­ies personnel, including senior officers, constables and drivers, have been suspended across Balochistan on charges of accepting bribes at checkpoints, officials said.\n\nBaloc­histan Levies Director General Abdul Ghaffar Magsi ordered the suspensions following persistent complaints about personnel soliciting bribes at check posts on highways and roads. The complaints were typically reported by truck drivers, passengers and other travelers.\n\nAn official notification confirmed, “DG levies taken serious notice of the bribe issue and immediately suspended 62 levies officers and constable involved in taking bribe at the Check posts.”\n\nMr Magsi said the action was part of a “zero tolerance policy” against corruption. “The action was taken adopting zero tolerance policy against the levies officials of 18 districts of Balochistan and strict action would be taken against these levies personnel against whom allegations were proved,” Mr Magsi said.\n\nThe suspended personnel include risaldars, naib risaldars, daffadars, havaldars, sepoys and drivers from Qila Abdullah, Pishin, Chaman, Kachhi, Khuz­dar, Musakhel, Bar­khan, Sherani, Loralai, Zhob, Sibi, Washuk, Cha­g­hi, Jhal Magsi, Mastung, Surab, Panjgur and Noshki.\n\nThe DG Levies emphasised that stringent measures would be enforced against anyone found gui­lty of corruption or negligence. “There is no room for corrupt people in the levies force,” he said. Dr Mir Wais Khan, the director admin, has been appointed as the inquiry officer. He is tasked with investigating the suspended personnel and is expected to submit a report within 15 days.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:20:41.099Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913985/62-balochistan-levies-officials-suspended-over-bribery-charges",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T00:05:22.000Z"
}
