{
  "title": "Clerics warn president against signing child marriage bill - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A day after the Council of Islamic Ideology (CII) declared the bill banning child marriages un-Islamic, many clerics from different schools of thought have appealed to President Asif Ali Zardari not to sign the bill into law.\n\nThe Islamabad Capital Territory Child Marriage Restraint Bill, 2025, which seeks to protect the rights of children and eventually eradicate marriages of children under the age of 18, reached the presidency on May 27 after sailing through both houses of parliament.\n\nHowever, the move attracted strong opposition from religious segments of society, with the CII ruling that classifying marriage under the age of 18 as rape did not conform with Islamic law.\n\nCII member Maulana Jalaludin, who belongs to JUI-F, said Presi­dent Zardari should prevent anarchy in society and not sign the bill.\n\nControversy deepens as Sharmila cites Shariat court’s ruling; Sherry urges CII to reconsider its opinion\n\nIncidentally, members bel­ong­ing to different sects opposed the bill.\n\nResponding to a query, the CII member said the assembly could not be above Quran and Sunnah. “This bill is not only against the norms of Sharia but also contrary to the values of our society and our traditions,” Maulana Jalaluddin reasoned, terming the move a western conspiracy to destroy ‘family system’.\n\nThe ‘bad intentions’ were evident as the bill was not forwarded to the CII, but approved by parliament ‘in secrecy’, he said.\n\nHowever, PPP MNA Sharmila Faruqi, who tabled the bill in the National Assembly, said the matter of marriage of girls below 18 years of age, should not be given a religious colour and instead be considered in the context of human rights.\n\n“We are not against marriages. We say marrying girls as young as 13 or 14 years is unfair when girls under 18 years of age do not have right to vote, cannot obtain national identity cards and driving licence,” she added.\n\nIn this regard, the PPP lawmaker referred to a decision by Federal Shariat Court of 2022 that allowed the state to set the marriage age.\n\nIn its 242nd meeting, the CII also rejected the recommendation of the Ministry of Religious Affairs and Interfaith Harmony regarding mandatory thalassemia testing prior to marriage. The CII was of the opinion that testing should not be made compulsory.\n\nCII urged to review matter\n\nSenator Sherry Rehman told Dawn the CII should reconsider their views in the wake of the Shariat Court stance and the practice in many Muslim countries, which adhere to the age of 18 years for maturity.\n\nThe issue sparked a controversy after a fiery speech by JUI-F chief Maulana Fazlur Rehman in the National Assembly stating that the bill should be stopped right there, while it was being approved by Senate.\n\nHe asked parliament to forward the bill to the CII, as per suggestion of JUI-F lawmaker Kamran Murtaza, warning that failing to do so would undermine the nation’s unity and solidarity.\n\nMost senators, including from PTI, voted that the bill be moved in the upper house by Ms Rehman for approval instead of being forwarded to the CII.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:33:23.641Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913987/clerics-warn-president-against-signing-child-marriage-bill",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T00:05:22.000Z"
}
