{
  "title": "International Labour Organisation lowers job creation forecast for current year - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The International Labour Organisation has revised its global employment forecast for 2025, projecting the creation of 53 million jobs instead of the previously estimated 60 million.\n\nThis translates into a reduction in global employment growth from 1.7 per cent to 1.5pc this year. The drop — which is the equivalent of around seven million fewer additional jobs — reflects a downgraded global economic outlook, as GDP growth is expected at 2.8pc, down from a previous projection of 3.2pc.\n\nThe ILO’s latest employment estimates, issued in its new ‘World Employment and Social Outlook’ Update released on Wednesday, are based on economic growth projections from the recently released International Monetary Fund’s (IMF) April 2025 World Economic Outlook.\n\nIn addition, the ILO estimates that close to 84 million jobs across 71 countries are directly or indirectly tied to US consumer demand. These jobs — and the incomes they support — are now increasingly at risk of disruption due to elevated trade tensions. The Asia-Pacific region is where most of these jobs — 56 million — are concentrated. Canada and Mexico, however, have the highest share of jobs — 17.1pc — that are exposed.\n\nThe report also highlights troubling trends in income distribution. The labour income share — which is the proportion of GDP going to workers — fell globally from 53pc in 2014 to 52.4pc in 2024.\n\nThe report points to a shift in employment towards high-skilled jobs. Women are leading this trend. Between 2013 and 2023, the share of women employed in high-skilled occupations rose from 21.2 to 23.2pc — while the proportion of men in high-skilled occupations was around 18pc in 2023. Yet occupational segregation persists, with women underrepresented in sectors such as construction and over represented in clerical and caregiving roles.\n\nWhile educational attainment continues to rise worldwide, the labour market remains characterised by significant educational mismatches. As of 2022, only 47.7pc of workers held qualifications that appropriately matched their job requirements. The share of under-educated workers declined from 37.9 to 33.4pc over the past decade, but the share of over-educated workers increased from 15.5 to 18.9pc. The rapid development and adoption of generative artificial intelligence (AI) technologies is likely to reshape the world of work in the years ahead, albeit to a yet unknown degree.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:20:34.203Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914017/international-labour-organisation-lowers-job-creation-forecast-for-current-year",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T03:19:33.000Z"
}
