{
  "title": "Israeli strikes destroy last plane at airport run by Houthis - World - DAWN.COM",
  "author": null,
  "content": "SANAA: Israeli air strikes blew up the last remaining plane at Yemen’s Houthi-held international airport, Israel and a Yemeni official said on Wednesday, weeks after an earlier attack inflicted major damage.\n\nAn air raid involving multiple strikes hit the Yemenia Airways plane and the runway at Sanaa airport, the Houthis’ Al-Masirah TV channel posted on X, decrying Israeli aggression.\n\nThick black smoke was seen billowing from a stricken plane on the tarmac, in a video posted on X by Sanaa airport director Khaled al-Shaief who said it was Yemenia’s last operational aircraft.\n\nThe airport had only resumed limited commercial services on May 17, according to Houthi authorities, after it was closed by a heavy Israeli attack that destroyed six planes 11 days earlier.\n\nThe Houthis, claiming solidarity with the Palestinians, have been firing on Israel and Red Sea shipping throughout the Gaza conflict, prompting reprisal strikes from Israel as well as the United States and Britain.\n\nIsrael’s Defence Minis­ter Israel Katz said fighter jets targeted Houthi “terror targets” at the airport, a day after the group fired two projectiles at Israel. “Air Force jets have just struck terror targets of the Houthi terrorist organisation at the airport in Sanaa and destroyed the last aircraft remaining,” he said in a statement.\n\nAn Israeli military statement said aircraft there “were used by the Houthi organisation for the transfer of militants who advanced attacks against the state of Israel”.\n\nAccording to a statement from Yemenia, the plane was about to be boarded by pilgrims bound for the annual Haj pilgrimage in Saudi Arabia.\n\n‘Fragile situation’\n\nThe Houthis began their attacks on shipping in the Red Sea and Gulf of Aden in Nov 2023, weeks after the start of the Israel-Hamas conflict, prompting British and US military strikes beginning in January 2024.\n\nEarlier this month, the United States agreed a ceasefire with the Huthis, ending weeks of intense American strikes on rebel-held areas.\n\nHowever, the Houthis have continued to fire frequent projectiles at Israel, including strikes targeting Ben Gurion airport in Tel Aviv. Earlier this month, Israel threatened to target the Houthi leadership.\n\nUnited Nations special envoy Hans Grundberg warned in a statement that clashes between the Houthis and Israel are “exacerbating an already very fragile situation for Yemen and the region”. The Houthis had earlier paused their attacks during a two-month ceasefire in Gaza that collapsed in March.\n\nThe Houthis have been at war with a Saudi-led coalition since 2015 in a conflict that has caused hundreds of thousands of deaths and triggered a major humanitarian crisis in Yemen, although fighting has decreased significantly since a UN-negotiated six-month truce in 2022.\n\nThat year the airport, closed for six years during the war, reopened to commercial flights and has offered services to and from Amman in Jordan.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:21:11.621Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913973/israeli-strikes-destroy-last-plane-at-airport-run-by-houthis",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T00:05:40.000Z"
}
