{
  "title": "Trade deficit with Middle East swells to $11.7bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s trade gap with the Middle East widened by 9.89 per cent to $11.731 billion during the first 10 months (July-April) of FY25 compared to $10.675bn in the corresponding period last year due to higher petroleum imports.\n\nThe swelling trade deficit is a cause for concern for policymakers, primarily due to the rising influx of petroleum products from the region. In contrast, exports are experiencing only minimal growth to a limited number of countries in the area, according to data compiled by the State Bank of Pakistan.\n\nPetroleum consumption has increased in the current fiscal year due to a 14.9pc rise in crude oil imports in 10MFY25 compared to the same period last year.\n\nIn FY24, the imbalance with the Middle East narrowed by 20.47pc to $13.014bn from $16.365bn in the preceding year, mainly due to lower petroleum imports amid falling consumption owing to rising local prices.\n\nExports to the Middle East rose 4pc to $2.624bn in July-April from $2.523bn over the same period last year. In FY24, exports to the region grew 35.23pc to $3.155bn compared to $2.33bn in the preceding year.\n\nAt the same time, Pakistan’s imports from the Middle East grew 8.76pc to $14.355bn in 10MFY25 from $13.198bn over the same period last year. In FY24, imports declined 13.53pc to $16.16bn compared to $18.69bn in the preceding year.\n\nPakistan has recently signed a free trade agreement with the Gulf Cooperation Council (GCC) states to minimise its trade imbalance with the region.\n\nThe demand for Pakistani products surged in the United Arab Emirates (UAE), Saudi Arabia and Qatar during the period under review.\n\nExports to Saudi Arabia rose 4.49pc to $605.39m in July-April from $579.36m over the same period last year. In FY24, exports to Saudi Arabia surged 40.98pc to $710.335m from $503.851m in FY23. Imports from the kingdom declined by 16.26pc to $3.176bn, compared to $3.793bn in the same period last year.\n\nIn FY24, imports from Saudi Arabia declined by 0.01pc to $4.49bn against $4.50bn in the preceding year.\n\nExports to UAE increased 8.67pc to $1.779bn in July-April from $1.637bn over the last year. In FY24, exports to the UAE surged 41.15pc to $2.082bn from $1.475bn in FY23, primarily due to a significant rise in exports to Dubai.\n\nPakistan’s top export products to the UAE include rice, bovine carcasses, men’s and boys’ cotton ensembles, as well as guavas and mangoes. In July-April, imports from the UAE also witnessed an increase of 30.81pc to $6.614bn from $5.056bn.\n\nExports to Bahrain declined by 28.66pc to $41.93m in 10MFY25 from $58.78m in the corresponding period last year. The imports increased 18.37pc to $179.41m in 10MFY25 from $151.56m.\n\nPakistan’s exports to Qatar saw a negative growth of 27.87pc to $100.51m in 10MFY25 against $139.35m in the corresponding months last year. The import from Qatar stood at $2.933bn during the 10 months of the current fiscal year, from $2.72bn over the last year, indicating an increase of 7.83pc. The country’s exports to Kuwait fell 10.84pc to $97.59m in 10MFY25 against $109.46m last year. However, imports dipped 1.69pc to $1.453bn from $1.478bn.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:33:08.022Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914015/trade-deficit-with-middle-east-swells-to-117bn",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T03:18:24.000Z"
}
