{
  "title": "Punjab bureaucracy draws flak over delayed local govt bill - Pakistan - DAWN.COM",
  "author": null,
  "content": "• ECP summons chief, local govt secretaries in Islamabad today\n• Proposed bill faces criticism from both treasury, opposition benches\n\nLAHORE: The Punjab civil bureaucracy is facing mounting criticism for its repeated failure to come up with a local government law acceptable to both the treasury and the Election Commission of Pakistan (ECP), let alone the opposition.\n\nSince the expiry of the last local government term in December 2021, the bureaucracy has prepared the Punjab Local Government Act (PLGA) at least four times. However, none of the drafts have passed legislative scrutiny or gained political consensus.\n\nIrritated over the continuous delay in finalising the PLGA, the Election Commission has summoned the Punjab chief secretary and the administrative secretary of the Local Government and Community Development Department (LG&CD) in person on Thursday (today).\n\nThe PLGA, prepared by the civil bureaucracy, had drawn strong criticism from the treasury benches as they said it would “bury local governments”. The opposition has gone further, denouncing the bill as a throwback to the authoritarian policies of military rulers Ziaul Haq and Pervez Musharraf.\n\nTreasury lawmaker Syed Zulfiqar Ali Shah warned that the proposed bill would disempower elected representatives by centralising authority in the hands of deputy commissioners. Another treasury member, Ahmad Iqbal, said the new bill would dismantle local governance.\n\nIn a notice addressed to the chief secretary and the LG&CD secretary over delay in conducting local government elections in Punjab, the ECP stated that the term of the local government in Punjab had expired on Dec 31, 2021. Since then, the ECP said it had undertaken several initiatives to facilitate the timely conduct of local government elections in the province, including convening meetings, issuing correspondence and sending reminders.\n\nThe Election Commission said it was on record that the Punjab local government laws had undergone amendments on four separate occasions and the commission had accordingly conducted the delimitation process several times.\n\nMost recently, the ongoing delimitation process for union councils was suspended on the request of the Punjab government to allow for the finalisation of the Punjab Local Government Bill, 2025. It said the commission accepted this request and granted a four-week extension, with a clear directive that “no further extensions would be entertained”.\n\nSubsequently, the ECP in its notice stated that the draft of the PLGA was shared with the commission on Dec 26 last year. The commission reviewed the draft and communicated its feedback to the Punjab government on Jan 23 this year.\n\n“A full bench hearing of the commission was held on Feb 26, during which instructions were issued to the Punjab chief secretary to finalise the legislative process. However, no substantial progress has been reported by the Punjab government [to date] regarding the enactment of the requisite legislation or the conduct of local government elections,” it said.\n\nConsequently, the ECP has summoned the chief secretary, as well as LG&CD secretary, to appear in person before the commission on Thur­sday at its Islamabad secretariat.\n\n‘Colonial mindset’\n\nOpposition Leader in Punjab Assembly Malik Ahmad Khan Bhachar told Dawn that the civil bureaucracy had proposed non-party elections in the Punjab local government bill, reflecting dictators Ziaul Haq and Gen Musharraf’s colonial mindset.\n\nIt proposed all powers rested with the respective deputy commissioners instead of elected representatives. “The government wants all those elected be brought into the ruling party fold through incentives or pressure,” he alleged.\n\nHe said the bill proposed that the union councils’ elections would be held on a non-party basis, and the elected members would choose chairpersons of the union and district councils from among themselves instead of the chairperson’s direct election.\n\nHe claimed the design was motivated by fears that the Pakistan Tehreek-i-Insaf (PTI) might sweep the polls if held on a party basis. He added that the opposition would suggest amendments and oppose the existing proposed bill tooth and nail.\n\nIn the proposed bill, Mr Bhachar said, the government was trying to wind up the Panchayat system, which was highly important in most parts of the province.\n\nThe opposition leader said the incumbent Punjab dispensation, which he said was “no less than a martial law government”, should have advertised the proposed law and sought public opinion before finalising and presenting it before the Punjab Assembly.\n\n“It will be a sheer wastage of people’s time and money if the Punjab government tries to pass the bill and holds local government elections on a non-party basis, granting powers to deputy commissioners instead of elected representatives,” he added.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:33:36.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914002/punjab-bureaucracy-draws-flak-over-delayed-local-govt-bill",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T00:05:10.000Z"
}
