{
  "title": "Tollinton Market upgraded to modern facility by Lahore Development Authority - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Tollinton Market upgradation and rehabilitation project has been completed, giving a new and beautiful look to Lahore’s formerly dirtiest spot for meat/foodstuff, birds, pets, and general item businesses situated near Jail and Ferozepur roads.\n\nThe Lahore Development Authority (LDA) has also converted some existing shops into model ones in a bid to attract other shopkeepers to replicate the same design and model.\n\n“It is good to see the Tollinton Market’s front elevation (facade) having a beautiful look and a clean environment. I hope the authorities will ensure the maintenance of the market, including the provision of a good solid waste management system,” eminent historian and Lahore Conservation Society President Ajaz Anwar told Dawn on Wednesday.\n\nThe old Tollinton Market was constructed in 1864 as an exhibition hall, a venue to house the Punjab Exhibition showcasing the crafts, art, and agricultural products of British India. The old market building is located on The Mall near the Lahore Museum. Later, the market was relocated to a spot near Jail Road after a new building was constructed by the LDA in 1992. The new building comprises 300 shops, with major businesses including poultry wholesale and retail shops, a wide range of bird sales and purchases, frozen items, and bird diets.\n\nHowever, over time, several problems related to cleanliness, the environment, lack of building maintenance, hanging electric wires, absence of management, and disinterest from various stakeholders surfaced. Due to the market’s deteriorating condition, the chief minister assigned the task of upgrading and rehabilitating the market to the LDA.\n\nA survey of the market found issues such as unhygienic surroundings, poor facade condition, inadequate cleaning schedule, improper waste disposal, poor ventilation, inadequate sewerage, lack of sanitation facilities, cross-contamination, unsafe and unprofessional slaughtering, inadequate enforcement and parking, shop subdivision, and poor maintenance.\n\nTo address these, it was decided to uplift the market facade with uniform signage and color coding for shops, implement a proper waste disposal system with separate bins for organic and inorganic waste along with garbage chutes, install adequate handwashing points, toilets, and cleaning facilities, and construct roads with service lanes and loading/unloading bays.\n\nPlans also included educating vendors and workers on hygiene and sanitation practices, establishing regular cleaning schedules, implementing integrated pest management techniques, sealing entry points, using traps, separating raw meat and eggs to prevent cross-contamination, bundling/removing hanging wires, and forming a management committee.\n\n“We have completed the project with Rs190 million, which includes the cost incurred on improving the entire electricity supply system carried out by the Lahore Electric Supply Company after we transferred the funds to their account,” Project Director Mirza Inam told Dawn.\n\nHe said development work includes upgrading the market facade, lighting and ventilation systems, replacing internal fibre glass shades, constructing floors, and more. He noted that the slaughtering of chickens has now been stopped at non-designated areas.\n\nLDA Director General Tahir Farooq said efforts are underway to make the project sustainable with proper maintenance, cleanliness, solid waste management, and other best practices.\n\n“We are also in touch with the Punjab Food Authority to ensure the safe and hygienic handling of foodstuff,” he said, adding that an effective management committee would soon be constituted to oversee the operational affairs of Tollinton Market.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6837dda4d452b.jpg",
  "retrievedAt": "2025-08-23T14:32:55.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914044/tollinton-market-upgraded-to-modern-facility-by-lahore-development-authority",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T04:07:07.000Z"
}
