{
  "title": "4 killed, 10 injured as rain-related incidents rock KP: rescue officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four people were killed and 10 were injured in rain-related incidents across different districts of Khyber Pakhtunkhwa on Thursday, officials said.\n\nThe casualties were reported after a series of lightning strikes and structure collapses occurred amid extremely heavy rain.\n\nThe spokesperson for Rescue 1122 Khyber Pakhtunkhwa Bilal Ahmad Faizi told Dawn.com, that the casualties were reported in the Mohmand and Mardan districts of the province.\n\n“Two people were killed while one was injured in a lightning strike in Mohmand,” he said. “As soon as the incident was reported, the Rescue 1122 control room took immediate action and dispatched a medical response team to the scene.”\n\nHe added that the team took timely action and provided first aid to the injured at the scene and later moved him to Tehsil Headquarters Hospital Nawagai.\n\n“The bodies of the two deceased were transported to District Headquarters Hospital Ghalnai after medico-legal formalities,” he added.\n\n“Rescue 1122 medical, fire and disaster teams are performing relief operations,” Faizi said. “Roads are closed in several areas due to falling trees. Rescue 1122 disaster teams and local people are working to clear the roads.”\n\nProviding details of the casualties, Rescue 1122, in a statement, said that in Takht-i-Bahi, a mother and daughter were reported to have died after a ceiling collapsed while a girl was injured, adding that in Katlang Qasmi, a 60-year-old woman was seriously injured, while two children sustained critical wounds in a similar incident at Akhun Baba.\n\nFifteen-year-old Abdul Salam was seriously injured in a wall collapse on Bakhshali Cham Dheri Road. In Manga, three people were critically hurt in another wall collapse. A 38-year-old woman was injured when a gate collapsed near Jabal Madrasa, and a 40-year-old woman sustained serious injuries in a wall collapse in Rustam Peshkando.\n\n“Rescue 1122 said its medical teams provided first aid to all the injured and transported them to nearby hospitals,” the statement said.\n\nThe World Meteorological Organisation forecast that most of South Asia would experience above-normal rainfall and above-average temperatures during this year’s southwest monsoon season from June to September.\n\nEarlier this week, at least three people lost their lives and multiple others were injured as strong winds and thunderstorms lashed several parts of Khyber Pakhtunkhwa and Punjab on Tuesday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/29225008abdaef8.jpg",
  "retrievedAt": "2025-08-23T14:32:50.928Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914119/4-killed-10-injured-as-rain-related-incidents-rock-kp-rescue-officials",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T17:47:41.000Z"
}
