{
  "title": "Finance secretary says ban on cryptocurrency still in place, stresses need for regulation - Pakistan - DAWN.COM",
  "author": null,
  "content": "Finance Secretary Imdadullah Bosal on Thursday said that the ban on cryptocurrency was still in place across Pakistan, stressing the need for its regulation.\n\nThe State Bank of Pakistan (SBP) does not recognise crypto assets, which are digital currencies in which transactions are verified and recorded by a decentralised system. The SBP issued a formal notice in 2022 advising the general public to be cautious of and refrain from trading cryptocurrencies.\n\nDuring today’s meeting of the National Assembly Standing Committee on Finance, PPP MNA Sharmila Farooqi introduced a bill on digital currency regulations, prompting different remarks from committee members.\n\n“There are no regulations for cryptocurrency,” Farooqui said, adding that since Pakistan was moving towards digital currency, cryptocurrency should be decentralised.\n\nShe highlighted Pakistan’s exit from the ‘grey list’ of the Financial Action Task Force (FATF) — a global money laundering and terrorism financing watchdog — and said, “How will Pakistan protect cryptocurrency from money laundering?”\n\nIn 2018, Pakistan was placed on the so-called ’grey list’ for allegedly failing to take adequate measures to curb terror financing and money laundering. The country was removed from the list in 2022.\n\nWhile highlighting the SBP’s ban on crypto investment, Bosal said, “Preliminary work is underway in the Crypto Council but there is a need for proper regulations for cryptocurrency.”\n\nThe Pakistan Crypto Council (PCC) was officially launched in March this year to “regulate and integrate blockchain technology and digital assets” into the country’s financial landscape.\n\nAccording to SBP official Sohail Jawad, there was a legal framework required for cryptocurrency. “The National Working Group on Digital Currency has been established, while suggestions have been given to the Crypto Council,” he said.\n\n“Only El Salvador has legalised cryptocurrency in the world, and now they are reversing this decision,” he added.\n\nMeanwhile, committee member Osama Ahmed said, “There is no ban on holding cryptocurrency in Pakistan.”\n\nHe said that cryptocurrency was being used to order vehicles from Japan, adding, “Has the State Bank taken any action on this?” He asked, “Is the government supervising the mining of cryptocurrency?”\n\nMNA Mirza Ikhtiar Baig noted the youth were investing in cryptocurrency.\n\n“The value of cryptocurrency is increasing due to government measures, so the government should clearly state whether cryptocurrency is legal or not,” he stressed.\n\nThe finance secretary said that while the Crypto Council was established through the executive approval of the prime minister, it had not yet received legal approval.\n\n“The Council must address the concerns raised in the meeting today,” he said.\n\nEarlier today, PCC Chief Executive Officer Bilal Bin Saqib unveiled the country’s first government-led Strategic Bitcoin Reserve.\n\nIn his keynote speech, Saqib announced the establishment of a national bitcoin wallet, “holding digital assets already in state custody — not for sale or speculation, but as a sovereign reserve signalling long-term belief in decentralised finance”.\n\nHe also revealed that the government had allocated 2,000 megawatts of surplus electricity in the first phase for bitcoin mining and AI data centres, opening doors to sovereign miners, tech firms, and clean energy partners around the world.\n\nSpeaking on this development, Baig said that the government had set the electricity rate for crypto mining at seven to eight cents while Pakistan’s industries were demanding nine cents per unit.\n\n“Why doesn’t the government provide electricity to industries at nine cents?” he remarked, saying, “Our exports can increase if industries are provided with electricity at this rate. The government should provide electricity to residential consumers at this rate.”\n\nFarooqui added, “How was the decision to allocate 2,000 megawatts of electricity [for crypto mining] made?”\n\nShe also asked whether the government conducted a detailed review of this decision, saying, “Pakistan itself is suffering from load shedding.”\n\nCryptocurrencies are gaining momentum globally as the number of use cases is increasing and many countries are now making them legal. However, it has had a mixed reception by regulators globally.\n\nIn some countries, like El Salvador, it has legal tender status, while in others, including Pakistan, India and China, it is not accepted as payment for goods and services, nor can one own it legally, though it is not officially banned either.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/291733498ff0763.jpg",
  "retrievedAt": "2025-08-23T14:32:52.781Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914084/finance-secretary-says-ban-on-cryptocurrency-still-in-place-stresses-need-for-regulation",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T14:14:23.000Z"
}
