{
  "title": "Going cashless - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE global experience shows that a cashless economy, where digital payments are the norm, may offer numerous economic benefits: increased convenience for consumers and businesses, greater transparency in financial transactions, enhanced security against fraud and theft, improved economic documentation, wider financial inclusion, lower tax evasion, etc.\n\nNo wonder the world is moving fast towards a cash-free, contactless economy due to its advantages. The migration to a cash-free economy has picked up pace worldwide since the Covid pandemic. Seen in this context, the finance minister’s push for a cashless economy must be supported.\n\nA media report quotes him as saying that “moving towards a cashless economy is not simply a policy aspiration but a practical necessity for long-term fiscal resilience, competitiveness and inclusive growth”.\n\nOn Tuesday, he hinted at introducing measures in the next budget to implement compulsory use of digital payments in order to maximise cashless economy and increase documented transactions. The idea is to encourage digitisation of the economy to “shift tax burden away from salaried individuals and compliant businesses to untaxed and under-taxed sectors”.\n\nThe authorities plan to push the financial digitisation agenda by incentivising digital transactions and punishing cash transactions through additional tax measures besides blocking cash payments in certain yet-to-be identified critical sectors. A host of measures are believed to have been finalised for inclusion in the budget to “accelerate transition to a digital and less cash-dependent economy”.\n\nWith the digital-first system, Raast, for real-time payments between individuals, businesses and government entities already in place, the authorities rightly believe that digital payment infrastructure is widely available and accessible across various sectors of the economy: retail, services, public sector, etc for migration from cash to cashless economy. We have seen a dramatic increase in electronic transactions in the last few years, with more and more people turning to digital transactions.\n\nNot only that, even small vendors are adopting alternative forms of payment: instant payments, digital wallets and QR payments, especially in the urban areas. Given the increasing popularity of contactless digital payments, many of us may assume that we are becoming a cashless society. Far from it.\n\nBesides cultural issues and the fear that the government is monitoring digital payment data impeding early adoption of digital-only transactions, the poor broadband and mobile connectivity across many areas remains a major challenge in expanding electronic transactions. For many, cybersecurity issues are a worry — not without justification though.\n\nOn top of that the vast majority of the population, especially women and residents of the rural areas, remain unbanked and unable to access the facility. This means the government would have to work in different areas to create an ecosystem for digital transactions before we can actually hope to become a cashless economy.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:21:13.687Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914007",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T02:32:10.000Z"
}
