{
  "title": "4 ‘terrorists’ killed in AJK encounter - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Four alleged terrorists were killed after a fierce exchange of fire with police in Azad Jammu and Kashmir (AJK) on Wednesday, during which two policemen were martyred and at least five others sustained injuries, police sources said.\n\nThe encounter occurred in Hussain Kot village, located on the outskirts of Rawalakot in Poonch district, following intelligence reports that a group of militants, allegedly led by a man named Zarnosh Na­sim, was hiding in the area.\n\nThe operation was set in motion following the April 10 arrest of a suspect, Muiz, a resident of Chak Dhamni near Rawalakot. Muiz, who was found in possession of arms and ammunition, disclosed during interrogation that he was an associate of Zarnosh, a resident of Bagh district, and had delivered weapons to him just a day earlier.\n\nBased on his information, a joint police team from Poonch and Bagh districts launched a raid in the Petaratta Morh area of Bagh on April 11. However, the suspects reportedly opened fire during the operation, resulting in the death of a passerby and injuries to two constables.\n\nOn Wednesday, acting on fresh intelligence, police launched another operation in the forested area near Hussain Kot. Upon arrival, the raiding party came under heavy fire and grenade attacks from the suspects.\n\nTwo constables were martyred while at least five others were reported injured in the exchange of fire. In retaliatory fire, police gunned down four militants, including Zarnosh.\n\nThere were unconfirmed reports suggesting that the militants may have detonated suicide jackets.\n\nPublished in Dawn, May 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:20:38.582Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913995/4-terrorists-killed-in-ajk-encounter",
  "dateList": "2025-05-29",
  "date_published": "2025-05-29T00:05:16.000Z"
}
