{
  "title": "NDMA to dispatch humanitarian aid for earthquake affectees in Myanmar",
  "author": null,
  "content": "ISLAMABAD, Apr 01 (APP):The National Disaster Management Authority (NDMA) has planned and coordinated to dispatch 70 tons of emergency humanitarian relief to Myanmar through two chartered flights in response to the recent catastrophic earthquake.\nUnder the directives of the prime minister of Pakistan, the first air cargo flight (B-757) carrying 35 tons of relief supplies will depart from Islamabad International Airport bound for Yangon, Myanmar, as part of this initiative.\nUpon arrival, the aid will be handed over to Myanmar’s Ministry of Social Welfare and Resettlement by the Pak Ambassador and Defense Attaché in Myanmar.\nThe aid consignment consisted of essential supplies which included approximately 565 tents, 210 tarpaulins, 2,000 blankets, 1 ton of ready-to-eat food, 0.5 tons of medicines and 10 water purification modules.\nThe dispatch ceremony took place at Islamabad International Airport which was attended by Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhary representing the prime minister of Pakistan.Officers from NDMA, Ministry of Foreign Affairs and Ambassador Myanmar were also present at the occasion.\nOn behalf of prime minister of Pakistan, the Honourable Federal Minister extended heartfelt condolences to Myanmar’s leadership and those affected by the catastrophic earthquake. He also reaffirmed Pakistan’s unwavering solidarity with the people of Myanmar during this challenging time.\nHe highlighted that under the patronage of Government of Pakistan, NDMA has effectively coordinated an emergency humanitarian relief operation for Myanmar, reflecting Pakistan’s  commitment to providing prompt assistance to disaster-affected nations.\nMyanmar’s Ambassador extended the deepest gratitude to the Government of Pakistan and people of Pakistan for generous humanitarian assistance in this time of need. He appreciated the timely and compassionate response from Pakistan for earthquake affectees in Myanmar.\nThe second consignment of 35 tons will be dispatched in coordination with relevant authorities. NDMA remains dedicated to delivering prompt and effective humanitarian assistance to those in urgent need.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:09:59.655Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ndma-to-dispatch-humanitarian-aid-for-earthquake-affectees-in-myanmar/",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T10:43:00.000Z"
}
