{
  "title": "PPP supports coalition govt for larger interest of country: Gilani",
  "author": null,
  "content": "MULTAN, Apr 01 (APP):Senate Chairman Syed Yusuf Raza Gilani said on Tuesday the PPP was supporting the coalition government in the larger interest of the country and its people.\nHe was addressing a ceremony organized by Liaqat Bosan, a noted politician from the politically active Bosan family, in the honor of his son MPA Ali Haider Gilani after he was conferred upon the Hilal-e-Imtiaz award.\nHe stated the PPP always advocated for rights of the people and development across the country without any discrimination.\nHe said the party did not have any ministerial or advisory positions but wanted the process of development to benefit all.\nRecalling his recent visit to Malaysia, Gilani said, he participated in a conference attended by over 45 countries where he was selected as the Speaker of the conference. He described this as a proud moment not just for himself but for the country as well.\nRecounting his contributions for South Punjab uplift, the Senate Chairman stated that he had secured approval for the construction of a cadet college worth Rs. 400 million in the region.\nHe also mentioned another project for establishment of a special economic zone in the region as part of the China-Pakistan Economic Corridor (CPEC). This zone, which would include major infrastructure projects such as roads, railways and energy developments, was expected to be a game-changer for Multan, Shujabad, and Jalalpur, he added.\nPraising his son, Ali Haider Gilani, who was elected as an MPA, Syed Yusuf Raza Gilani highlighted his resilience during his abduction, saying, he remained steadfast and faced the ordeal bravely.\nHe also spoke about his deep connection with NA-148, a constituency from where he was elected on several occasions since 1988.\nBefore him, his uncle Hamid Raza Gilani, was elected from the same constituency in 1985. Now, his son, Ali Qasim Gilani, held the seat after he vacated it in 2024 to become a Senate member.\nGilani said, this constituency had always been close to his heart.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:09:34.339Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ppp-supports-coalition-govt-for-larger-interest-of-country-gilani/",
  "dateList": "2025-04-01",
  "date_published": "2025-04-01T16:54:00.000Z"
}
