{
  "title": "Indian forces torturing Kashmiris protesting for inadequate COVID-19 arrangements",
  "link": "https://www.app.com.pk/national/indian-forces-torturing-kashmiris-protesting-for-inadequate-covid-19-arrangements/",
  "date_published": "2020-05-16T05:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Kashmiri people held a protest demonstration and chanted slogans in Budgam district against the brutalities of Indian forces who were torturing the protesting people over inadequate COVID-19 arrangements.\nThe relatives of the people put in quarantine in Indian Occupied Jammu and Kashmir (IOJ&K) said the administration was delaying conducting of COVID-19 tests and not declaring the tests results.\nAccording to reports, Indian police beat up and injured a girl in the premises of a quarantine centre in Nagam Chadoora, Budgam district of the IOJ&K. Later, she was shifted to a hospital for treatment.\nA series of videos of this incident had gone viral on social media in which a cop could be seen chasing and hurling abuses on a local Kashmiri.\nPakistan had repeatedly called on India to lift the communication blockade imposed in the occupied valley and ensure supplies of essential commodities in the valley to contain the spread of COVID-19 and mitigate the suffering of the Kashmiris.\nA top United States diplomat Saturday said Washington had seen unfortunate reports of COVID-19 related ‘rhetoric and harassment’ against the Muslim community in India.\n“In India, we have seen reports of unfortunate COVID-19-related rhetoric and harassment, particularly against the Muslim community. This has been exacerbated by fake news reports, misinformation being shared via social media. There have also been instances of Muslims being attacked for allegedly spreading the coronavirus,” Ambassador-at-Large for International Religious Freedom Sam Brownback said while briefing reporters during a conference call on the impact of COVID-19 on religious minorities throughout the world.\nDifferent areas and districts in Indian occupied Jammu and Kashmir region had been declared as red zones amid huge spike in coronavirus infections.\nAmid COVID-19 outbreak, long-running curbs on the internet had prevented those living in the occupied valley from accessing information about the deadly virus as education and awareness drives about the symptoms of the disease were impossible to run in the occupied territory.\nMeanwhile, hundreds of Kashmiris including students and labourers stranded in India and other countries due to coronavirus lockdown.",
  "retrievedAt": "2025-08-11T19:13:28.194Z"
}
