{
  "title": "Govt urged to raise locust issue in NCC, NCOC for better coordination",
  "link": "https://www.app.com.pk/national/govt-urged-to-raise-locust-issue-in-ncc-ncoc-for-better-coordination/",
  "date_published": "2020-05-16T08:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Federation of Pakistan Chamber of Commerce and Industry (FPCCI)’s Businessmen Panel on Saturday called upon the government to raise the issue of locust threat across the country in the meetings of National Coordination Committee and National Command and Operation Center (NCOC) for better coordination to get rid of this huge threat to the agriculture sector.\nIn a statement, it said the provincial governments through National Food Security Division could develop a National Action Plan for surveillance and control of desert Locust in Pakistan, with a mandate to safeguard national food security through efficient coordination with key stakeholders.\nThe Panel, Secretary General (Federal), Ahmad Jawad said that these locusts are eating away everything in cultivated lands as the agriculture experts were aware of how badly locusts damaged wheat, cotton, maize and other crops last year in all provinces and this year its threat was even more dangerous.\nAccording the United Nations’ Food and Agriculture Organization (FAO) estimates losses to agriculture from locusts this year could be as high as Rs 353 billion ($2.2 billion) for winter crops like wheat and potatoes and about Rs 464 billion for summer crops.\nHe said the weather in Punjab was favourable for locusts particularly in its southern region.\nHe said COVID-19 threat further complicated the situation of the locust outbreak in the entire region and there was a possibility of a flare up.\nHe said a few days ago, a huge locust swarm attacked the crops and damaged them badly in western areas of the districts Muzaffargarh and Bhakkart.\nHe said locusts were coming from Shorkot and Ahmadpur Sial tehsils of Jhang district and most probably they would proceed to Sahiwal district.\nSimilarly, he also said according to reports a severe and damaging locust attack in upcoming weeks in 15 districts of the province.\n“Experts say insect populations have found new homes across Pakistan and are now laying eggs in nearly 40% of its territory, including Sindh but mainly in the southwest province of Balochistan”.",
  "retrievedAt": "2025-08-11T19:13:27.709Z"
}
