{
  "title": "COVID-19: Pakistan conducts 14,878 tests in last 24 hours",
  "link": "https://www.app.com.pk/national/covid-19-pakistan-conducts-14878-tests-in-last-24-hours/",
  "date_published": "2020-05-16T08:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Pakistan has conducted 14,878 tests in the past 24 hours which is the highest number of tests made to diagnose COVID-19 patients since the first positive corona affected was reported in the country.\nHeading the National Command and Operation Centre (NCOC) meeting on Saturday, Minister for Planning Development Reforms and Special Initiatives Asad Umar expressed satisfaction over the burgeoning testing capacity as the country had witnessed 30 times increase with a rise from two laboratories in mid-March to 70 laboratories till date.\nThe provincial chief secretaries including that of Gilgit Baltistan and Azad Jammu and Kashmir, gave input on the implementation of health protocols and standard operating procedures (SOPs) post May 9, decisions and Eid prayer congregation along with the implementation of SOPs devised for industries and markets.\nAsad Umar said the implementation of SOPs and social distancing was only possible through public education and awareness .\nThe forum was of the view that markets associations/ traders organisations must ensure compliance of SOPs issued by health ministry. In case of non compliance, the particular market as a whole be closed for failing to ensure collective responsibility.\nAsad Umar said, “The testing capacity of the country has favourably increased and over 14,000 tests have been carried in the country which is encouraging and should be increased further.”\nHe noted that Pakistan had been quick in enhancing its capacity and capability in every policy including health management system, emergency health care equipment, raising structure like NCC/NCOC, channelising resources and tapping efficient human resource and most importantly formulating SOPs and their implementation.\n“Where there is a will there is a way . The people of Pakistan cannot be left on the mercy of pandemic. We have and will move every single resource available to mitigate the challenges of common people. We will take all steps necessary for public safety and well-being of the people of Pakistan and there is no other option other than all out effort possible a government can do. There is no shortage of equipment in the country rather it is necessary to focus on managing trained human resource for handling the pandemic.”\nThe epidemiologist and other health experts briefed the forum on future virus behaviour for May and June and risk and crisis management plans and matching response of healthcare system’s capacity number of ICU beds, ventilators and personal protective equipments.\nMinister for Industries Punjab Mian Aslam Iqbal informed the forum that around 336 warning notices were issued to different markets and industries on the violation of SOPs whereas on repeated violation it would be sealed as per the decided mechanism.\nMinister for Interior Brig (R) Ejaz Ahmed Shah suggested that the district administration should engage with the traders’ associations and local stakeholders for the implementation of SOPs.\nThe forum mentioned that the Ehsaas Emergency Cash Relief was going to recommence on Monday where the SOPs devised for public safety should be ensured to contain the pandemic.\nIt may be mentioned here that around Rs104 billion were distributed among eight million beneficiaries through Ehsaas Emergency Cash Relief whereas Rs50 billion assistance package was prepared to aid 3.5 million small and medium enterprises (SMEs). Moreover, Rs 50 billion worth agricultural relief package for farmers was also launched and consequently Rs50 billion were allocated for the health sector.",
  "retrievedAt": "2025-08-11T19:13:26.841Z"
}
