{
  "title": "USAID empowers female engineers in energy sector through innovative training program",
  "link": "https://www.app.com.pk/national/usaid-empowers-female-engineers-in-energy-sector-through-innovative-training-program/",
  "date_published": "2024-02-23T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):In a significant milestone for gender equity in Pakistan’s energy sector, USAID celebrated the successful completion of the Power System and Distribution Network Planning (PSDNP) Training Program for women engineers.\nThe program, designed for engineers from Pakistan’s power distribution and transmission companies, is a collaborative effort between USAID and the Lahore University of Management Sciences (LUMS), said a news release issued here on Friday.\nSpeaking at the occasion, Mission Director Kate Somvongsiri said, “By equipping these women engineers with specialized training, we not only open new career avenues for talented individuals but also enhance team engagement, motivation, and decision-making within companies.”\nExpressing satisfaction with the program’s outcomes, Chairman BOD IESCO/Chairman BOD MEPCO said, “Through the PSDNP Training Program, Pakistani female engineers have gained practical expertise in utilizing two power system planning software applications, ArcGIS and Synergi, provided by USAID.\nThe impact of this initiative extends beyond individual empowerment, as the trained cohort is now equipped to effectively address Pakistan’s future demands in power distribution networks, thereby benefiting the entire energy sector.”\nUSAID is dedicated to promoting gender inclusivity within the energy industry, addressing the under-representation of women in various roles, including power distribution planning, engineering, management, and leadership.\nThe training of 31 female engineers aims to break gender barriers in the engineering sector, fostering a more diverse and talented workforce that positively impacts company innovation and performance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:53:44.524Z"
}
