{
  "title": "Ashrafi stresses religious diversity as key to Pakistan’s harmony",
  "link": "https://www.app.com.pk/national/ashrafi-stresses-religious-diversity-as-key-to-pakistans-harmony/",
  "date_published": "2024-02-23T16:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP):Prime Minister’s Special Representative on Religious Affairs and Pakistani Diaspora in Middle East and Muslim Countries, Hafiz Muhammad Tahir Mehmood Ashrafi, on Friday emphasized the country’s diversity of faiths in a significant development regarding religious harmony in Pakistan.\nAshrafi who is also the Chairman of Pakistan Ulema Council reiterated that Pakistan, as enshrined in its Constitution and law, upholds the rights of individuals from all religious backgrounds.\nIn the aftermath of the recent verdict by the Supreme Court of Pakistan regarding a religious matter, he emphasized the significance of the review petition filed by the Punjab government in addressing apprehensions within the framework of the Constitution and law.\nAdditionally, the court has provided clarity on the issue of the finality of Prophethood, a fundamental aspect of faith for the majority population of Pakistan, he added.\nAshrafi highlighted that the review petition represents a vital step in the legal process, aimed at addressing any concerns that may have arisen following the court’s decision.\nHe stressed that the matter at hand is fundamentally constitutional, underlining the importance of upholding the rule of law and preventing any attempts to disrupt harmony or incite anarchy within the country.\n“It is the responsibility of the state to safeguard the legal rights and properties of minority communities in the country,” Ashrafi declared, reaffirming Pakistan’s commitment to protecting the rights of all its citizens, regardless of their religious affiliations.\nHe further reiterated that no individual or group would be permitted to sow seeds of discord or disharmony, as the government remains steadfast in its commitment to maintaining social cohesion and order. He urged all stakeholders to respect the legal process and work towards peaceful resolution and unity.\nAshrafi said the review petition, scheduled to be heard in the coming days, symbolizes the country’s dedication to addressing apprehensions through established legal channels, reaffirming Pakistan’s commitment to justice, equality, and religious harmony. As the nation navigates this complex terrain, he underscored the importance of adherence to the rule of law and the protection of minority rights in fostering a cohesive and inclusive society.\nIn a show of support for the actions taken by both the Supreme Court and the Punjab government, Ashrafi said religious scholars and leaders associated with the Pakistan Ulema Council have commended these efforts. They acknowledged the importance of a collaborative approach in addressing sensitive religious issues in a manner that respects the rights and beliefs of all citizens, he added.\nAshrafi said Pakistan continues to navigate the complex landscape of religious diversity, as these developments underscore the government’s ongoing commitment to fostering an environment of tolerance, respect, and understanding among its people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:53:14.598Z"
}
