{
  "title": "All possible facilities to be ensured for Hujjaj intending hajj 2024: minister",
  "link": "https://www.app.com.pk/national/all-possible-facilities-to-be-ensured-for-hujjaj-intending-hajj-2024-minister/",
  "date_published": "2024-02-23T07:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): Caretaker Minister for Religious Affairs and Interfaith Harmony Aneeq Ahmed Friday said that all possible facilities will be provided to Pakistani pilgrims during this year’s hajj where special training programs were also being conducted at the district level through camps managed by the religious affairs ministry.\nIn an exclusive interview with PTV news channel, he said that under the supervision of the Pakistan Hajj mission special catering companies were being arranged to feed pilgrims under a government scheme and will ensure quality and safety standards at every step.\nMinister said that this year Pakistan Hajj mission is offering simplified transportation services to Pakistani pilgrims with standard buses ensuring round-the-clock, adding that, the transport department will fully dedicate themselves to the sacred duty.\nA comprehensive transportation guidelines had also been issued at each building, he added.\nThe caretaker government had introduced several new services for the pilgrims to help them perform the rituals with comfort and ease, he mentioned.\nMonitoring Cell has been put in place to closely monitor and address any potential issues of the private Pilgrims, he said, adding, furthermore, various other specialized units, such as a Wheelchair Desk have been established to cater to the specific needs of different groups of pilgrims.\nReplying to a question, he said in a bid to improve the Hajj pilgrimage experience for travelers in 2024, the federal government has also unveiled a comprehensive update to the Hajj package, adding that, first time in history government has introduced a shorter 20 to 25-day Hajj program in which we will provide pilgrims with a more concise and efficient experience.\nThis change is expected to make the pilgrimage more accessible to a broader range of people, he added.\nEvery pilgrim will also receive a specially designed bag featuring the Pakistani flag, a QR code for easy identification, and relevant information, he mentioned.\nIn a move toward greater administrative efficiency, the government had launched a dedicated mobile app for online registration of Hajj applications, he said, adding, this app is streamlining the administrative aspects of the pilgrimage, making it easier for pilgrims to apply and manage their journey.\nTo another question, Aneeq said that every pilgrim will be given a mobile SIM of a Saudi company for free which will have 180 minutes for international calls.\nHe further said that the Caretaker government reduced the price of the official Hajj package by Rs0.1 million, adding, this year hajj is more affordable as compared to last year.\nHe also appealed to all pilgrims that all representatives of Pakistan should express maximum restraint and good behaviour as there would be Muslims from every nook and cranny of the world.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:53:33.479Z"
}
