{
  "title": "Tea valuing $391.408 mln imported in 07 months",
  "link": "https://www.app.com.pk/national/tea-valuing-391-408-mln-imported-in-07-months/",
  "date_published": "2024-02-23T09:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 23 (APP): Tea imports into the country during the first 07 months of the current financial year grew by 7.58 per cent as compared to the imports of the corresponding period of last year.\nDuring the period from July-January, 2023-24 over 161.823 metric tons of tea valued at $391.408 million were imported as compared to the imports of 145,700 metric tons costing $368.820 million of the same period of last year, according to the data of the Pakistan Bureau of Statistics.\nOn month on monthly basis, tea imports into the country grew by 22.13 per cent as 22,072 metric tons of tea valued at $54.985 million were imported during January 2024 as compared to the imports of 17,622 metric tons worth $45.022 million in the corresponding month of last year.\nHowever, the imports of edible oil including soybean and palm into the country during the period under review went down by 49.85 per cent and 34.14 per cent respectively, it added.\nOver 91,950 metric tons of soyabean oil valued at $99.990 million were imported as compared to the imports of 136,870 metric tons costing $199.386 million in the same period of last year, whereas 1.735 million tons of palm oil worth $1.611 billion were imported as compared the imports of 1.927 metric tons valued at $2.446 billion of the same period of the last year, it added.\nMeanwhile, the sugar imports into the country also decreased by 42.75 per cent as about 2,260 metric tons of sugar valued at $2.10 million were imported as compared to the imports of 4,332 metric tons worth $3.67 million in the same period of last year.\nIt is worth mentioning here that during the period under review, food group exports from the country grew by 57.66 per cent as different food commodities valued at $4.267 billion were exported as compared to the exports of $2.706 million in the same period of last year.\nOn the other hand food group imports into the country during the first 07 months of the current financial year decreased by 21.09 per cent as food imports came down from $5.983 billion in the first 08 months of the last financial year to $4.721 billion during the same period of the current financial year.",
  "retrievedAt": "2025-08-11T00:53:27.901Z"
}
