{
  "title": "Mushaal pays tribute to Yasin Malik for completing 5-year in unlawful detention",
  "link": "https://www.app.com.pk/national/mushaal-pays-tribute-to-yasin-malik-for-completing-5-year-in-unlawful-detention/",
  "date_published": "2024-02-22T20:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 22 (APP): Special Assistant to the Prime Minister (SAPM) for Human Rights and Women Empowerment Mushaal Hussein Mullick paid tribute to the most powerful voice of the Kashmir freedom struggle Mohammad Yasin Malik on the completion of five years of his unlawful incarceration in Indian jails, who was a main source of inspiration for Kashmiri people battling to break shackles of Indian slavery.\nMushaal Mallcik, wife of Yasin Malik, in a statement on Thursday, said that the revolutionary Yasin Malik was detained by brutal Indian forces from his residence in 2019 this day and sent to Jammu Jail under the Public Safety Act.\nShe said that later in May, he was transferred to the notorious Delhi Tihar Jail, as the fascist Indian government implicated him in fake, frivolous and fabricated cases of terrorism to silence the most powerful voice of Kashmir’s freedom struggle.\nMushaal went on to say that the special court in Delhi sentenced Yasin Malik to life imprisonment in the same fake cases and now the supremacist Narendra Modi’s government was hell-bent sentence him to death as a part of its policy of political vengeance and political victimization.\nThe SAPM pointed out that despite the constant deterioration of his health and serious threats to his life, he was denied basic medical facilities, as he was kept in solitary confinement, adding that even his lawyer was not allowed to meet him.\nShe stated that all the state coercive measures were being implied against him to break him; however, despite all these state terrorism and fascist and inhuman acts, he did not budge an inch from his principled stance.\nMushaal urged that the UN bodies and human rights organisations should raise voice for this prisoner of conscious, who was illegally incarcerated for his sole crime of seeking a birthright for his people of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nShe saluted all Kashmiri prisoners including Yasin Malik for their determination and sacrifices, who were the real and true heroes of the nation.\nMeanwhile, SAPM for Human Rights and Women Empowerment said that the Kunan-Poshpora tragic incident would remain a big blot on the face of the so-called largest democracy in the world.\nIn her message on the occasion of the anniversary of the incident in village Kunan-Poshpora of Kupwari district, in which a young girl was killed by Indian forces on February 23, 1991, during a search in the area, wherein dozens of women, including an 86-year-old woman were publicly humiliated.\nMushaal recalled that the Kashmiri women were subjected to on the dreadful night of February 23, 1991, finds no place in human history while despite the passage of 33 years, justice continues to elude the victims.\nShe lamented that the terrorist Indian state had been using rape as a weapon of war against the Kashmiris, adding that the tragic incident was a well-planned conspiracy hatched by the Indian authorities to keep the Kashmiri women at bay from the just struggle of freedom movement.\nMushaal stated that Kunan-Poshpora’s horrific incident was a deep and indelible stain on India’s face and an open challenge to the global conscience.\nShe demanded an international investigation into the tragic incident to bring the culprits to justice.",
  "retrievedAt": "2025-08-11T00:53:39.807Z"
}
