{
  "title": "EP Wing terms HRW report on PMDA fabricated, misleading",
  "link": "https://www.app.com.pk/national/ep-wing-terms-hrw-report-on-pmda-fabricated-misleading/",
  "date_published": "2021-08-25T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Pakistan on Wednesday termed Human Rights Watch’s report regarding Pakistan Media Development Authority (PDMA) as fabricated and misleading.\n“Unfortunately, Human Rights Watch did not bother to find out the real facts from the relevant government office,” a statement issued by External Publicity Wing, Ministry of Information and Broadcasting said.\nPakistan, the statement said, currently has more than a dozen obsolete laws in place to regulate the media that did not meet modern requirements, the statement said.\n“We need to introduce a comprehensive policy to deal with challenges such as fake news, misinformation, hate speech and copyright in the public interest on the pattern of developed countries of the world”, the EP Wing said.\nThe proposed Pakistan Media Development Authority was under consideration to address the diverse media challenges of the 21st century and to make Pakistan a major global hub for multimedia information and content services.\nConsultation process with stakeholders for setting up of proposed Pakistan Media Development Authority was going on and consultative meetings were held with civil society including media owners, editors, working journalists, anchor persons, press clubs.\nMinister for Information and Broadcasting Chaudhry Fawad Hussain also gave a detailed briefing to the joint meeting of the standing committees on Information and Broadcasting of the Senate and the National Assembly and the Federal Cabinet regarding the PDMA.\nThese measures negated the fact that the proposed bill of Pakistan Media Development Authority has been kept secret.\nHuman Rights Watch did not take into account the real facts in its report on the Pakistan Media Development Authority and if HRW did not apologize for false and fabricated information, the Government of Pakistan has the right to take legal action.",
  "retrievedAt": "2025-08-11T21:07:43.830Z"
}
