{
  "title": "Ethiopia believes in equitable utilization of transboundary water: Envoy",
  "link": "https://www.app.com.pk/national/ethiopia-believes-in-equitable-utilization-of-transboundary-water-envoy/",
  "date_published": "2023-04-06T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 06 (APP): Ambassador Extraordinary and Plenipotentiary of the Federal Democratic Republic of Ethiopia to Pakistan Jemal Beker Abdula on Wednesday said his country fully believed and advocated the international rule of equitable and reasonable utilization of the transboundary water.\nThe ambassador made these remarks while briefing Foreign Secretary of the Ministry of Foreign Affairs of Pakistan, Dr. Asad Majeed Khan in a meeting about Grand Ethiopian Renaissance Dam being built on the Nile River with 6,500 megawatt hydropower generation capacity of clean and sustainable energy.\nJemal Baker said the Government of Ethiopia has been pursuing all the international standards to build the largest dam of Africa which would essentially play a critical role in regional integration through energy grid that gives priority for neighboring and riparian countries.\n“We have always called for equitable and reasonable utilization of transboundary water to sort out differences with the lower riparian countries.”\nThe envoy also discussed salient contours of bilateral relations with the foreign secretary outlining priority areas wherein both countries could diversify their cooperation to deepen the longstanding and historic ties in diverse fields of science, technology, tourism, economy and others. Both the dignitaries agreed to foster bilateral, regional and multilateral cooperation between the two countries through increased political engagement at all fora.\nBriefing the foreign secretary on current political and economic situation in Ethiopia, the ambassador said normalcy had been returned to northern parts of his country due to successful implementation of the peace agreement signed in Pretoria last year between the Government of Ethiopia and Tigray People Liberation Front (TPLF).\nHe said the issue in northern part of Ethiopia was resolved through Africa-owned and Africa-led solution and now we are at the reconstruction, rebuilding and reconciliation phases.\nThe ambassador gave a detailed briefing to Dr. Asad Majeed about the trade delegation of Pakistani businessmen flown to the Federal Democratic Republic of Ethiopia last month for bringing the two big nations more close.\nForeign Secretary appreciated the Government of Ethiopia on successful implementation of the peace agreement and assured the envoy of the role which Pakistan could play in post-conflict reconstruction of northern Ethiopia.\nWith regards to the Grand Ethiopian Renaissance Dam, Dr Asad said that dialogue was not only an effective but also a peaceful way to resolve conflicts. The foreign secretary also lauded efforts of the Embassy of the Federal Democratic Republic of Ethiopia in Pakistan for successfully mobilizing a trade delegation of 100 businessmen to Addis Ababa.\nThe ambassador, during the meeting, also briefed Dr. Asad about the high-level official delegation of the Government of Ethiopia visiting Pakistan in the next month to further strengthen the already flourishing bilateral ties between the two countries.",
  "retrievedAt": "2025-08-11T08:13:45.295Z"
}
