{
  "title": "ECP issues code of conduct for Punjab, NA by-polls",
  "link": "https://www.app.com.pk/national/ecp-issues-code-of-conduct-for-punjab-na-by-polls/",
  "date_published": "2023-04-06T17:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 06 (APP): The Election Commission of Pakistan (ECP) on Thursday has issued a code of conduct for political parties and candidates contesting Punjab Assembly and subsequent by-elections in different National Assembly constituencies.\nAccording to the details, all candidates shall open an exclusive account with any branch of a scheduled bank for election-related expenses.\nNo candidate or party will be able to campaign at the public’s expense. Candidates will not be able to use posters larger than 18×23 inches and portraits larger than 2×3 feet.\nMoreover, the pamphlet size has been fixed at 9×6 inches, and the banner size at 3×9 feet. It is also mandatory to print the name and address of the printer of pamphlets and banners.\nThe code has also made it mandatory for candidates to avoid the use of verses and hadiths on banners and posters.Wall chalking, panaflex, and billboards will be completely banned, and photos of government officials cannot be used in the election campaign.\nThere will also be a ban on hoisting party flags at public places and government buildings, and meetings and processions can only be organised at the designated places of the local administration.\nThe candidates will be bound to fix the route of the rally with the local administration, and there will be a prohibition on burning effigies and flags of opposition leaders and parties. There will be a ban on divisive and hate speech as well.\nThe candidates and polling agents are bound to cooperate with the election staff, and the polling agent must have the authority letter and original identity card with them.\nAccording to the code, the candidates and political parties could not provide transport facilities to voters, and election camps in urban areas will be 400 meters away from the polling station. In rural areas, electoral camps can be set up at a limit of 100 metres.\nNo one except the candidate and the polling agent will be allowed to enter the polling station. It is mandatory for the polling agent to be a voter of the constituency and they will not be able to influence voters. After the ballot box is sealed, the polling agents can also put their seal on the box. Moreover, the objection fee for the voter will be Rs100.\nThe code warrants that there will be no action against the ideology of Pakistan and nothing should be said about the country’s independence and integrity. Similarly, nothing should be said against other institutions, including the judiciary and armed forces. Violators will be prosecuted under the Election Act 2017.\nThe code calls for cooperation with law enforcement agencies and seeks clarification on the accounts of election expenses. All transactions will be under the GST registered form.",
  "retrievedAt": "2025-08-11T08:13:34.225Z"
}
