{
  "title": "Govt to accept decision of full bench of SC: PM",
  "link": "https://www.app.com.pk/national/govt-to-accept-decision-of-full-bench-of-sc-pm/",
  "date_published": "2023-04-06T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP): Prime Minister Shehbaz Sharif Thursday said the government would accept the decision of the full bench of the Supreme Court in the case for elections in Punjab and Khyber Pakhtunkhwa.\nSpeaking at the foundation stone laying ceremony of the Islamabad Lawyers Complex here, he said however, those judges who recused themselves should not be made part of that bench.\nHe recalled that Justice Munir was the creator of the principle of necessity which took Pakistan in a certain direction.He said, “We respect Supreme Court and justices and their decisions should apply to everyone.”\nTalking about proceedings of the Supreme Court in the case for elections, he mentioned that a nine-member bench was formed which was later shortened to three members as some judges recused.\nIn the same case, political parties were not made part of the proceedings despite requests, he noted.\nShehbaz Sharif said if the demand for a full bench of the Supreme Court was accepted in the case for elections in Punjab and Khyber Pakhtunkhwa then everybody would have accepted the decision.\nHe said the decision of Supreme Court Justice Qazi Faez Esa was invalidated through a circular in a case then a six-member larger bench was formed for the same case. Article 63A of the constitution was rewritten and the appeal filed by the government in the Supreme Court was still not heard, he continued.\nHe said no political party could evade elections as it would bury its politics.\nHe said a court verdict was given that a prime minister was nothing without his federal cabinet but this principle was not applied to others.\nHe said all the stakeholders should look at their conduct and decide whether they wanted to protect the future of coming generations or they wanted to indulge in fights for their personal interests and take Pakistan in a direction from which nobody could come back.\n“We have to protect the future of Pakistan which is faced with many challenges. We should take decisions with a cool head and stay united for the interest of Pakistan.”\nWhile expressing happiness at the construction of Lawyers Complex, he said the project would be built at a cost of Rs 1.8 billion.\nEarlier, the project was only on paper and nothing was done on it, he told. He directed that a sports complex comprising swimming pools should also be made part of the lawyers complex.\nHe said lawyers were a prominent section of society and they played an important role for the rule of law, restoration of judiciary, and justice since the creation of Pakistan.\nLawyers bore baton charge and physical violence as they held demonstrations and rallies for the restoration of the judiciary, he added.\nEarlier, Minister for Interior Rana Sanaullah and Minister for Law and Justice Azam Nazeer Tarar also spoke and highlighted measures taken for the welfare of lawyers.",
  "retrievedAt": "2025-08-11T08:13:34.223Z"
}
