{
  "title": "Don’t stigmatized stranded Pakistanis for spread of COVID-19: Moeed Yusuf",
  "link": "https://www.app.com.pk/national/dont-stigmatized-stranded-pakistanis-for-spread-of-covid-19-moeed-yusuf/",
  "date_published": "2020-06-17T03:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP):Special Assistant to the Prime Minister (SAPM) on National Security Division and Strategic Policy Dr Moeed Yusuf Wednesday said that stranded Pakistanis were not the cause of COVID-19 transmission in the country.\nIn a joint press conference with Prime Minister’s Special Assistant on Overseas Pakistanis Sayed Zulfikar Abbas Bukhari at the National Command and Control Centre (NCOC), Moeed Yusuf said that only three percent Pakistanis brought virus to country whereas rest of ninety seven percent was locally transmitted.\nThe government should be thankful to the stranded Pakistanis for showing patience and cooperation, but unfortunately they were blamed for bringing the virus in the country, said Moeed Yusuf adding that they are Pakistanis and it is their right to come back to home.\n“At the moment 98,700 Pakistanis are registered with embassies in 70 countries who want to come back home”, said Moeed adding that almost one hundred thousand students studying abroad are also in the line, he said.\n“Every single passenger came to Pakistan from abroad was tested and if some one tested positive for coronavirus, was quarantined”, said Moeed.\nThe government has prepared a comprehensive policy regarding stranded Pakistanis in consultation with NCOC and all provinces, he said.\nHe further said that the National Coordination Committee decided that after June 2 every passenger would be tested and they would be quarantined at their homes, however upon the written requests from provinces policy was slightly changed.\nAccording to new policy, only symptomatic passengers will be tested and if found positive, they will be quarantined at the facilities provided by the government, however it would be mandatory for every passengers to quarantine themselves for fourteen days at home, said Mooed Yusuf.\n“All passengers will have to give assurance in written at the airport that they will quarantine themselves for fourteen days at home”, said Moeed, adding that the provinces through track and trace system will keep an eye and those violate the oath will be penalized in accordance with law”, said Moeed Yusuf.\n“At present six airports were operating, but the government has decided to make two more airports functional including Quetta and Sialkot to expand the repatriation flight operation”, he said.\n“Government is bringing nearly 2000 stranded Pakistanis per day due to the new policy approximately 40,000 to 45,000 expat Pakistanis will come home every week”, said Moeed adding that the government will be able to bring back all stranded Pakistanis home in one month.\nHe clarified that the flight operation was only for repatriation of stranded Pakistanis however the government has not yet decided to resume pre-corona flight operation, adding that the new policy will be implemented from June 20 onwards and all airlines will operate accordingly.",
  "retrievedAt": "2025-08-11T19:21:18.788Z"
}
