{
  "title": "Govt to start bulk repatriation of stranded Pakistanis after June 20",
  "link": "https://www.app.com.pk/national/25-pc-of-airspace-to-be-reopened-after-june-20-zulfikar-bukhari/",
  "date_published": "2020-06-17T06:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP):The government will ensure bulk repatriation of the stranded Pakistanis by reopening 25 per cent of total airspace after June 20.\nIt is aimed at bringing around 40,000 to 45,000 stuck Pakistani workers and students back from multiple countries every week.\n“A formula is being prepared under which 25 per cent of total airspace will be opened after June 20 and out of this 25 per cent, 70 per cent (flights) will be dedicated for the GCC (Gulf Cooperation Council) countries such as Saudi Arabia, UAE United Arab Emirates, Qatar, Kuwait and Malaysia where our labour is stuck,” Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari told the media in a joint press conference here with SAPM National Security and Strategic Policy Dr Moeed Yusuf.\nHe said the initiative was being taken on instruction of Prime Minister Imran Khan who had ordered the immediate repatriation of stranded Pakistani workers, especially from the GCC countries.\n“The PM’s decision for your early repatriation brings a major responsibility on your as well as our shoulders. If you do not complete your 14-day self-quarantine at your homes after the return, the situation, which is evolving with each passing day, may lead us to close the airspace again which would eventually hamper the return of your colleagues, brothers and sisters, who are also stuck abroad,” he said while appealing to the returnees to strictly adhere to the SOPs.\nZulfikar Bukhari said so far 80,000 stranded Pakistanis had been brought to the country shores, out of which 40,000 were the workers, who had been laid off by the companies in their host country. “Repatriation of such a large number of Pakistanis in such short span of time is a big achievement and the credit goes to the prime minister, NCOC and NCC (National Coordination Committee).”\nHe said around 600 bodies of Pakistanis had been brought to the country so far, whereas remains of 100 Pakistanis were in process of repatriation from Saudi Arabia.\nThe SAPM feared that the number of laid workers would gradually increase, but at this point of time, he said: “the number is controllable.” The number might grow in days to come due to the evolving situation across the globe, he added.\n“The existing number of laid off workers has not hit the economy badly as despite the coronavirus pandemic, the country has received $20.6 billion remittances in this May as compared to $20.1 billion in the last year’s May.”\nIn the prevailing situation, he said, the Ministry of Overseas Pakistani and Human Resource Development along with other stakeholders would make all-out efforts to keep the remittances inflow up.\nThe special assistant said his ministry in collaboration with other government departments had been working on an integration programme for returning emigrants so that they could register themselves on the Overseas Employment Corporation’s portal and share their professional details which would eventually help maintain their data.\n“We are also planning to include them under Ehsaas and Prime Minister’s Kamyab Jawan Programmes,” he added.\nHe said the Pakistan Tehreek-e-Insaf led government had sent around one million Pakistanis abroad for various job assignments in its tenure due to goodwill of Prime Minister Imran Khan and cordial relations of Pakistan with the GCC countries.\\932\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:09.217Z"
}
