{
  "title": "Maritime Minister welcomed budget’ zero-duty status for seafood industry, steps to enhance aquaculture productivity",
  "link": "https://www.app.com.pk/national/maritime-minister-welcomed-budget-zero-duty-status-for-seafood-industry-steps-to-enhance-aquaculture-productivity/",
  "date_published": "2024-06-13T07:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP):Minister for Maritime Affairs Qaiser Ahmed Sheikh Thursday welcomed the government’s several tax relief measures in the federal budget for the fiscal year 2024-25 such as zero-rated status for the seafood industry which will promote and protect this industry to enhance its export.\nTalking to a PTV news channel, he said it was a welcome change from the past with the government looking at the fisheries sector and seafood exports, particularly as a major area of growth.\nAll seafood processing machinery would be exempted from any import duties so that value-addition plants would be imported, he said adding that “We will make our products according to world-class standards”.\nHe said that the seafood sector will generate further job opportunities besides feeding nutritional food to the masses, adding, that this sector can earn valuable foreign exchange, however, it needs proper financing, facilitation, and support of a strategic plan and policy.\nPakistan exported about $500 million worth of seafood during the fiscal year 2022-23, which was recorded high and will further increase in the coming months due to massive incentives to this industry.\nReplying to a question, he said management measures implemented in the fiscal year budget will help to control the inflation, adding, that government was taking adequate measures to address it.\nThe government has set a red line for the Economic team that there must be no more financial burden on the poor and salaried persons in the fiscal year budget which is admirable, he mentioned.\nHe expressed satisfaction with the allocation for the health, education, IT sectors, adding,that the main target of the budget was mitigating people’s problems, transforming the agriculture sector, promoting information technology (IT), education Children, boosting exports, promoting industrial growth, and bolstering businesses.\nIn this difficult time the 25% increase in government employees’ salary was also a remarkable step, he highlighted.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:14:53.708Z"
}
