{
  "title": "Federal budget 2024-25 lays strong foundation for GDP growth, economic stabilization: Experts",
  "link": "https://www.app.com.pk/national/federal-budget-2024-25-lays-strong-foundation-for-gdp-growth-economic-stabilization-experts/",
  "date_published": "2024-06-13T11:30:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jun 13 (APP):Confronted with the monster challenges of ailing economy and rising inflation since 2018, Pakistan’s poor gross domestic products (GDP) and balance of payment issues viz a viz weak taxation has negatively impacted on lives of people.\nThese economic challenges have not only widened the gap between revenue and expenditure receipts but also adversely affected the country’s fiscal and monetary policies, resulting in an increase in the interest rate by the commercial banks.\nNow one can hope that the goal-oriented and pro-poor federal budget 2024-25 announced by the coalition government on Wednesday would not only address these key challenges but help increase Pakistan’s GDP growth and bringing the much needed stability to the national economy, which was under stress due to heavy foreign loan burden.\nWith a total budget outlay of Rs18.887 trillion for financial year 2024-25 wherein maximum relief has been provided to all segment of the society, the government has set an ambitious Rs13 trillion tax collection target aiming to achieve 3.6 percent GDP growth and enhance revenue after total expenditures outlay was estimated as Rs18.9 trillion meaning by 30 percent more than the total outlay of previous year.\nProfessor Dr. Ziakat Malik, former Chairman, Economics Department, University of Swabi termed the federal budget was inclusive, forward looking and goal-oriented wherein maximum relief and assistance was provided to traders, businessmen, labourers, farmers, salaried class, pensioners and other segments.\nAppreciating the government’s three-pronged strategy to reform the pension scheme in line with international best practices, he observed that one of the factor of the country’s sick economy was pension liability that would be reduced considerably in next three decades upon implementation of proposal of launching a contributory pension scheme for new employees for which the government would deposit its share every month.\nHe said that CP fund practice was enforced in all developed countries under which 50 percent share was contributed each by the employees and Govt departments.\nWelcoming an increase of 25 percent in salaries and pensions of grades 1 to 16 and a 20 percent enhancement for grade 17 to 22 government officers in the federal budget, he said that it would provide relief to the price hike-stricken employees.\nWhile terming agriculture as the backbone of Pakistan economy, he said the strong 6.25 percent expansion in the agriculture sector as indicated by the Economic Survey of Pakistan 2023-24, which is the highest in 19 years, has shown substantial growth of this sector courtesy to pro- farmer policies of the present elected government.\nLauding the Rs5 billion farmers’ package, he said that it would increase cotton, wheat, sugarcane and rice production and help achieve autarky in food services in the aftermath of the population bulge growing at about 2 percent rate that brought every sector under stress including food, hospitals, roads and schools.\nDr Malik said these positive measures would help drive the country’s GDP by an expected 2.38 percent in financial year 2024-25 which means recovering from a contraction of 0.21 percent in the previous financial year.\nThe per capita income has increased to $1.680 from $1.551 while inflation slashed to 26 percent against 28 percent last year,’ he said and praised the Govt’s courageous step in signing the nine-month stand-by agreement with the IMF that brought the country to a better place today.\nHe claimed that the Pakistani rupee has significantly depreciated by 40 rupees within a year in the wake of delays in the International Monetary Fund (IMF) program, adding the IMF standby arrangement has since set the stage for economic recovery, as evidenced by the downward trend in inflation and rising investor confidence across various sectors.\nHe said direct foreign investment has started coming back to the country and signing of scores of MoUs at China during the visit of the Prime Minister Muhammad Shehbaz Sharif was testimony of it.\nThe economics guru said that these positive business measures have caused significant reduction in the current account deficit from an estimated $6 billion to around $200 million, which was a positive sign for Pakistan’s economy which has started moving towards economic stabilization after 2018.\nYousaf Sarwar, former President Sarhad Chamber of Commerce and Industry (SCCI) also welcomed the federal budget and declared it business friendly.\n“We need to curb electricity theft as it caused an estimated Rs500 billion loss to the government kitty besides making negative effects on industrial production,” he said, adding KP was relatively located in disadvantage location due to its distance from sea port of Karachi and urged for providing relief to traders and businessmen in federal taxes and excise duties.\nHe said time has come to think seriously about privatization of electricity distribution companies and complete overhauling the electricity distribution system in order to save this huge amount.\nHe said allocation of Rs253 billion for the development projects of energy sector including Rs65 billion for installation of the electricity transmission system and Rs5 billion for the improvement in of distribution of electricity besides Rs11 billion for improvement of the system of NDTC would help address problems of power pilferage and bolster industrialization in the country including KP.\nThe increased budgetary allocations for the Benazir Income Support Programme (BISP) up to Rs. 593 billion, registering a 29 percent increase as compared to the last year, would help bring poverty down in Pakistan.\n“No country can achieve economic glory unless its exports increases and people pay taxes regularly,” he said, adding it was a good omen that the country’s exports has increased by 9.3 percent from July to March to $23 billion compared to $21.1 billion in the same period last year and welcomed imposition of taxes on elites in the federal budget 2024-25.\nFormer ambassador Manzoorul Haq welcomed the increase in salaries and pension of the government employees in the budget and termed it a positive step to provide relief to millions of employees of the public sector in the wake of high prices of daily used commodities and inflation.\nHe also appreciated huge allocations in the budget for the development of merged tribal districts to bring it on road to progress and development.\nFormer Secretary Zahoor Khan, former Information Officer, Misal Khan, ex PST teacher, Riazul Haq, Pir Mouhammad Khan, construction contractor Irshad Ullah and others welcomed the federal budget and termed it historic, progressive and goal-oriented in all respects.\nThe announcement of a health insurance scheme for journalists and media workers under which 5,000 journalists and media workers would be given health insurance in first phase, while 10,000 more would get the facility under its second phase were also welcomed by the journalists bodies and press clubs office bearers.\nArshad Aziz Malik, President Peshawar Press Club said that it was a positive step of the Federal Government and urged for its speedy implementation.\nProfessor Dr Muhammad Ibrahim Khan, former director Education Department KP told APP that over 22 million children are still out of schools in the country including one million in merged areas of KP and bringing them under the education net was a big challenge.\nHe commended the Govt decision to include 10 million more children in the education scholarship programme, adding this would also help bring these out of schools children under education net in KP.\nFormer Member National Assembly, Shahgee Gul Afridi said that tribal people were pleased after erstwhile Fata and PATA was exempted from income taxes for one year. The experts appreciated the announcement of increase of sales tax on mobile phones, imposition of levy holding tax on copper, coal, paper, and plastic scrap products and ending tax exemption on the import of luxury vehicles besides increasing taxes and duties on an imported vehicle worth $50,000.\nThey said that cigarettes have negative effects on the health of youth and the federal government deserves appreciation for increasing taxes on cigarettes and sealing factories of fake cigarettes to protect youth from its adverse effects.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:16:24.082Z"
}
