{
  "title": "Budget 2024-25 aims fiscal consolidation, next IMF negotiations focusing social safety net, structural reforms",
  "link": "https://www.app.com.pk/national/budget-2024-25-aims-fiscal-consolidation-next-imf-negotiations-focusing-social-safety-net-structural-reforms/",
  "date_published": "2024-06-13T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP):The experts on Thursday termed the Federal Budget 2024-25 tabled in the Parliament as aiming at fiscal consolidation, enhanced social safety net, structural reforms and next International Monetary Fund (IMF) negotiations to capture the next bailout for supporting the struggling economy.\nThe Sustainable Development Policy Institute (SDPI) organised the Post Budget Seminar here to provide its analysis on the budget.\nIn his opening remarks, Dr Vaqar Ahmed, Joint Executive Director SDPI informed that the Institute has its first response past late evening that underscored three main messages that the Budget aims at fiscal consolidation and keep IMF negotiations on track, the authorities the government of Pakistan has guaranteed that impact of increased inflation on low income groups would be mitigated through increased social safety net, infrastructure development jobs and the government’s structural reforms.\nHe added that in taxation, tax preference would be given to export sector and subsidies withdrawn from imports, whereas the government is embracing unified tax regime treating all incomes equally for taxation including exports, imports and retail incomes.\nDr Abid Qaiyum Suleri, Executive Director, SDPI in his message said the formulation of budget has always been an uphill task for the country, whereas conventionally the annual income was projected on an increasing and expenditure on a descending trajectory.\nDr Suleri pointed that the positive thing in the Budget was that all the numbers portrayed were realistic alongwith the provincial surplus showed accurately. “Govt is making efforts to show its commitment for economic reforms to make the negotiations with IMF in July for propitious outcomes. However, the positive impacts could be witnessed in improved social protection sector increasing incomes,” he added.\nHe mentioned that the Finance Minister repeatedly announced that he would pursue the state-owned enterprises (SOE)’s privatization which was a prudent approach. “The government had resisted taxes on medicines and pensions, gave exemptions to the input on solar panels assembling and pension reforms have been introduced. However, the personal income tax slabs could have been worked out but were not improved in the budget,” Dr Suleri said.\nHe noted that the retailers and agriculture sector were to be brought in the tax net but no progress was witnessed in this regard and insufficient tax reforms were made in the real estate sector.\n“The Budget’s success is conditioned with the implementation of the recommendations and reforms presented in the budget. The federal government would have to cut its expenses to make both ends meet after disbursing NFC Award share to the provinces,” he said.\nDr Khalid Waleed, Research Fellow, SDPI said the budget presented in the Parliament was depicting sustainable development vision of the government intended to introduce a market driven economy than a government driven economy.\nHe mentioned that the government had allocated an overall Rs 253 billion for the Energy sector with Rs 85 billion for two hydroelectricity dam projects alongwith an additional funding of Rs 5 billion for transmission infrastructure improvement. Moreover, the proposed budget depicted a total subsidies increased by 28% for power division, making the overall share of energy subsidies to 88% alongwith subsidies for merged districts of Khyber Pakhtunkhwa (KP).\nHe informed that significant allocations for climate change division were made alongwith strategy to tag public sector expenditures to gender-based interventions. Dr Khalid added that some Rs 45 billion for pre and post disasters resilience efforts were earmarked whereas the structural reforms were focused but more could be done for transmission and power supply infrastructure.\nHe commended that the federal government was favouring the local solar panel manufacturing and not retreating from its renewable energy goals.\nDr Fareeha Armughan, Research Fellow, SDPI said the allocations for social sector are logical that are based on income, equality, poverty and digitization. She said it was an unprecedented budget with Rs 593 billion allocated for the Benazir Income Support Programme (BISP) with a 27% increase from the past budget.\nShe added that the enhanced fiscal space for social protection initiatives would further strengthen the country’s case at the IMF negotiations as the Fund had reiterated to focus improved focus on social protection sector.\nShe added that the government was also beefing up efforts to increase BISP beneficiaries from existing 9.3 million to 10 million whereas 500,000 more beneficiaries would be added to its project for malnourished children.\nDr Sajid Amin, Deputy Executive Director, SDPI said the government was to set the budget as per the IMF targets and conditions whereas the driving idea was to meet revenue targets of Rs12.97 trillion. However, the government was missing 26% average inflation that prevailed this year, he added.\nDr Sajid underscored that the highly paid emerged as net gainers whereas the low incomed were to enter new tax slabs, adding, “the government has tried to keep the IMF’s trust and its political capital intact through this decision.”\nHe termed the budget as a stabilisation budget that offered no more to the common masses. “If IMF programme gets delayed then the current account deficit will increase rapidly as the IMF programme-focussed budget had a limited short-term vision,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:15:42.211Z"
}
