{
  "title": "PML-N Leader Kohistani highlights civil protest as cornerstone of democracy",
  "link": "https://www.app.com.pk/national/pml-n-leader-kohistani-highlights-civil-protest-as-cornerstone-of-democracy/",
  "date_published": "2024-06-12T19:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 12 (APP):A prominent leader of the Pakistan Muslim League-Nawaz (PML-N), Member of the National Assembly Kheal Das Kohistani on Wednesday highlighted the significance of civil protest as a cornerstone of democracy.\nHe emphasized that during democratic periods, protest and the expression of opinions are essential civil rights. Kohistani urged all parliamentarians to actively participate in the budget session discussions, describing the budget process as crucial for the nation’s development and economic crisis resolution.\nSpeaking to journalists in the Parliament lobby following the presentation of budget for the fiscal year 2024-25, he stressed the importance of considering the opposition’s viewpoints. “The opposition, too, has been elected by the people and their positive suggestions should be taken into account,” he said. He praised the government’s dialogue with the opposition, calling it a commendable effort vital for economic and political stability.\nKohistani expressed optimism about the forthcoming budget, describing it as a step in the right direction. “A strong budget lays the groundwork for economic growth and improves the quality of life for the public,” he stated.\nHe urged the government to invest in various sectors and advance administrative reforms.\nHighlighting the necessity of cooperation between the government and the opposition, Kohistani questioned, “If a member can be elected unopposed in Senate elections, why can’t the opposition join hands for the public welfare?” He noted that the opposition has representation in standing committees and should play a constructive role in legislation. “Legislation is a crucial process necessary for societal betterment and the advancement of justice,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:15:12.471Z"
}
