{
  "title": "Legislators urge govt to provide maximum relief to masses",
  "link": "https://www.app.com.pk/national/legislators-urge-govt-to-provide-maximum-relief-to-masses/",
  "date_published": "2024-06-13T10:21:00.000Z",
  "source": "APP",
  "content": "Senator Dost Muhammad Khan said no relief was given to the people in the budget. He criticized the government for imposing tax on the people of merged tribal districts.\nBesides release of already promised funds of Rs 75 billion, he demanded that more development funds should be allocated for the merged districts, along with provision of job opportunities in order to remove the sense of deprivation of the tribal people.\nSenator Khalil Tahir lauded the government for presenting a people-friendly budget in critical economic conditions. The government had announced sizeable increase in the salaries and pensions of government employees, which was appreciable, he added.\nHe called for imposing tax emergency, besides expanding the tax network by bringing landlords in the tax net.\nSenator Aon Abbas, while taking part in the debate, said more funds should be allocated for education, health and food security in the budget. The state enterprises organizations should be made vibrant rather than privatizing them, he added.\nHe said a very meager amount of Rs 15 billion was allocated for the agriculture sector which was not sufficient.\nSenator Zamir Hussain Ghumro claimed that the last Pakistan Tehreek-e-Insaf government had made record borrowing during its three and a half years tenure.\nHe urged the government to provide funds to the universities in Sindh.\nSenator Danesh Kumar regretted that only two development schemes were given to Balochistan in the budget. He alleged that sufficient amount was not allocated for dualization of Quetta to Karachi highway as over 6,000 passengers had lost their lives so far in accidents on the road.\nHe claimed that no officials were present to note recommendations of the senators.\nSenator Dr Afnanullah said thatSouth Punjab was not being ignored in the provincial budget. Hefty amount was specified in the provincial budget for the construction of South Expressway for South Punjab.\nHe said agriculture was a devolved subject and the provinces would allocate budget for it.\nSenator Abdul Wasay of the Jamiat Ulema-e-Islam-Fazl, while taking part in the debate, said that no measures were announced in the budget for controlling inflation and creating employment opportunities in the country. In 2022, floods had wreaked havoc in many areas of Balochistan but its victims had not yet received any compensation so far, he added.\nSyed Masroor Ahsan of the Pakistan Peoples Party said his party would not derail democracy in the country. He called upon all the political parties to resolve issues through dialogue. The increase in sale tax would further overburden the people, he added.\nHaji Abdul Shakoor Khan said that the merged tribal districts FATA should be given their promised development funds to address the longstanding issues.\nDeputy Chairman Syeedal Khan directed the ministers and officials concerned to ensure their presence during the budget debate.\nLater the House was adjourned to meet again on Friday at 10:30 a.m.",
  "retrievedAt": "2025-08-11T03:14:28.998Z"
}
