{
  "title": "WAPDA awards Rs. 10.6b contract for civil, electro-mechanical works of Dargai Hydel Power Station",
  "link": "https://www.app.com.pk/national/wapda-awards-rs-10-6b-contract-for-civil-electro-mechanical-works-of-dargai-hydel-power-station/",
  "date_published": "2024-06-13T11:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): The Water and Power Development Authority (WAPDA) awarded the contract for civil and electro-mechanical works for rehabilitation of Dargai Hydel Power Station worth Rs. 10.6 billion to a Joint Venture (JV), comprising two Chinese and a Pakistani firm.\nGeneral Manager (Hydel Development) WAPDA Ihsan Ullah and authorized representative of the JV Nabeel Tahir signed the contract on behalf of their respective organizations, said a press release issued here on Thursday.\nChairman WAPDA Engr Lt Gen Sajjad Ghani (Retd), Member (Power) WAPDA Jamil Akhtar, WAPDA officers, representatives of AFD, the consultants and the contractors were also present in the contract signing ceremony.\nWAPDA is carrying out rehabilitation and capacity enhancement of Dargai Hydel Power Station with Financial Support of AFD, France.\nAccording to the contract, Dargai Hydel Power Station will be rehabilitated in 3 years. On completion of the rehabilitation project, Dargai Hydel Power Station will generate 22 MW of green and clean hydel electricity. It will provide 130 million units of low cost hydel electricity to the National Grid annually.\nDargai Hydel Power Station, located in Malakand, was constructed in 1952. After serving 72 years, it requires rehabilitation to continue its operation.\nWAPDA is implementing a two-pronged strategy for optimal utilization of hydropower resources in Pakistan. Under the strategy, WAPDA is not only constructing new hydropower projects but also rehabilitating and upgrading its old hydel power stations to maximize the ratio of environment friendly and low-cost hydel electricity in the National Grid. Rehabilitation of Dargai Hydel Power Station is part of the said strategy.",
  "retrievedAt": "2025-08-11T03:16:06.015Z"
}
