{
  "title": "Balochistan PAC decries federal funding shortfall - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Public Accounts Committee (PAC) of the Balochistan Assembly has disclosed that the federal government shorted the province by over 11 billion rupees from its share of the national divisible pool during the 2022 financial year, calling it a constitutional and 7th NFC award violation.\n\nThe PAC, in a meeting on Wednesday presided over by Chairman Asghar Ali Tareen, expressed “serious concern” over the failure to pay Balochistan’s full share and termed it a “gross violation of the constitution”.\n\nThe committee formally asked the provincial government to take up the matter of the short payment with the federal government in Islamabad “and do not compromise on it”.\n\nDuring the meeting, which reviewed financial matters of the provincial Industries and Commerce Department, the PAC strongly objected to the absence of the finance secretary.\n\nCalls it a constitutional violation; demands finance secy’s presence\n\nThe committee called his absence on such a critical issue “unacceptable” and summoned him to appear today to explain when a financial reconciliation would be completed. It also directed the Auditor General’s office to verify the recovery of the outstanding amount.\n\nIn a separate finding, the committee noted a discrepancy of 6.99bn rupees between district accounts offices and the National Bank, calling it a “serious irregularity” that undermines financial discipline.\n\nWhile reviewing the Industries Department’s accounts, the PAC was told the department had a grant of 2.53bn rupees for the 2021-22 fiscal year. Of that amount, 196 million rupees remained unused but were not surrendered.\n\nAuditors also found that 62.5m rupees in ground rent had not been recovered from allottees, despite repeated reminders, and that 5.1m rupees were paid to contractors through inflated rates and for unauthorised works.\n\nMr Tareen expressed anger over the excess payments, terming them “against the rules” and ordering their immediate recovery.\n\nHe directed all departments to convene Departmental Accounts Committee meetings on time to resolve such irregularities, warning that the PAC would otherwise be “compelled to take strict decisions”.\n\n‘Fiscal autonomy’\n\nChief Minister Mir Sarfraz Bugti Balochistan asserted on Wednesday that the province must significantly boost its own financial resources to achieve “genuine fiscal autonomy” and spur development.\n\nPresiding over a meeting of the Balochistan Revenue Authority (BRA) Advisory Council, Mr Bugti said that reducing dependence on the federal government, preventing tax evasion and increasing provincial revenues are key priorities.\n\n“Balochistan’s development could only be achieved by reducing dependence on the federation and enhancing its own sources of income to establish true financial self-reliance,” Mr Bugti stated.\n\nDuring the meeting, the council decided to expand the scope of the tax on services, bringing more sectors into the tax net.\n\nMr Bugti added that provincial taxes, including sales tax on services, contract services, franchise fees, telecommunications, insurance, and construction, would be made more transparent and simplified.\n\nPublished in Dawn, September 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:44:36.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942800/balochistan-pac-decries-federal-funding-shortfall",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T01:45:59.000Z"
}
