{
  "title": "Riyadh-Islamabad defence becomes a shared concern - Newspaper - DAWN.COM",
  "author": null,
  "content": "• ‘Historic’ mutual defence accord proclaims aggression against one will be considered attack on both partners\n• New pact comes on heels of shift towards collective security in Middle East; formalises commitments that had existed in practice\n• PM inaugurates ‘Pakistan TV Digital’ to carry country’s perspective to international audiences\n\nISLAMABAD: Pakis­tan and Saudi Arabia have entered into a landmark mutual defence agreement, under which any aggression against one state will be considered an attack on both.\n\nThe ‘Strategic Mutual Defence Agreement’ was signed by Prime Minister Shehbaz Sharif and Saudi Crown Prince Mohammad Bin Salman at the Al-Yamamah Palace in Riyadh on Wednesday.\n\nAccording to the text of the joint statement, issued simultaneously by Islamabad and Riyadh at the end of PM Shehbaz’s day-long state visit, the pact “reflects the shared commitment of both nations to enhance their security and to achieving security and peace in the region and the world”.\n\n“[It] aims to develop aspects of defence cooperation between the two countries and strengthen joint deterrence against any aggression,” the statement said, without going into details.\n\nImportantly, the text underscored that “any aggression against either country shall be considered an aggression against both”.\n\nThe timing of the accord, coming on the heels of an Arab summit that signalled a shift towards collective security — in the wake of Israel’s attack on Qatar — hints that it is rooted in current world affairs and reflects the defence concerns of both countries.\n\nOfficial Saudi media outlets also carried reports of the signing ceremony, but they offered no further details about the accord or its provisions.\n\nA high-level delegation, including Deputy Prime Minister and Foreign Minister Ishaq Dar, Defence Minister Khawaja Asif, Finance Minister Mohammad Aurangzeb, Information Minister Attaullah Tarar, Climate Change Minister Musadik Malik, PM’s Special Assistant Tariq Fatemi and Chief of Army Staff Field Marshal Asim Munir, accompanied PM Shehbaz.\n\nSaudi F-15 fighter jets escorted the PM’s plane after it entered the Kingdom’s airspace, and a special ceremony was held at the royal palace ahead of Pakistani delegation’s talks with the crown prince.\n\nUpgrade in defence ties\n\nThe agreement marks the most significant upgrade in Pakistan-Saudi defence ties in decades. Cooperation between the two states dates back to 1967 and deepened after the 1979 Grand Mosque seizure, when Pakistani special forces helped Saudi troops reclaim Masjid al-Haram.\n\nIn 1982, the two sides institutionalised security ties through a Bilateral Security Cooperation Agreement that enabled Pakistani training, advisory support and deployments on Saudi soil. At times, as many as 20,000 Pakistani troops were stationed in the kingdom, and Saudi Arabia became a key purchaser of Pakistani-made arms.\n\nIn recent years, the partnership has gained urgency amid regional instability. In Feb, a meeting of the Joint Military Cooperation Committee in Riyadh pledged to expand training and exchanges.\n\nThe new pact formalises commitments that had long existed in practice, creating what some analysts saw as a de facto joint defensive umbrella though finer details of the agreement were not made public.\n\nFor Pakistan, the agreement offers both strategic and economic benefits. It secures vital Saudi investment and funding at a time of fiscal strain, while reinforcing Islamabad’s standing as a pan-Islamic security provider.\n\nFor Saudi Arabia, it strengthens defences against threats from Iran, Houthi militias and regional turbulence caused by Israel’s genocidal actions in Gaza and aggression against other countries in the neighbourhood. The Israeli attack targeting Hamas delegation in Doha heightened the urgency for this agreement that had been under discussion for some time.\n\nPakistan’s earlier defence alignments, such as Cold War-era agreements with the United States and those under Seato and Cento, have long since eroded.\n\nToday, Islamabad’s partnerships with China, Turkey and other Gulf states remain important but lack binding mutual defence clauses.\n\nAgainst this backdrop, Wednesday’s signing represents Pakistan’s most consequential formal defence commitment in decades, tying its security role inextricably to the evolving strategic architecture of the Gulf.\n\nTo celebrate the solemnisation of the defence accord with Saudi Arabia, the Capital Development Authority decked out prominent buildings in Islamabad with green lighting.\n\nBuildings such as the Supreme Court, Islamabad High Court, Parliament House, Cabinet Secretariat, Prime Minister’s House, and the Diplomatic Enclave along Constitution Avenue, as well as prominent hotels and commercial centres were emblazoned with emerald hues.\n\nDigital channel launched\n\nEarlier on Wednesday, PM Shehbaz also inaugurated ‘Pakistan TV Digital’, an English news channel aimed at delivering Pakistani voice to the world and offering the country’s perspective on national and international developments, besides countering anti-Pakistan narratives and propaganda.\n\nDuring the visit to the offices of Pakistan TV Digital, housed on the premises of state-run Pakistan Television (PTV), the prime minister unveiled a plaque to launch the news channel, which aims to enable Pakistan to communicate with the world, and deliver its perspective.\n\nHe said that the primary objective of launching this digital news channel was to provide authentic coverage, while effectively countering misinformation and propaganda about Pakistan.\n\nPM Shehbaz also recorded his first interview for broadcast on Pakistan TV Digital, which is reportedly a subsidiary of PTV.\n\nPublished in Dawn, September 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1810403958b0126.webp",
  "retrievedAt": "2025-10-12T04:14:04.072Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942814",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T01:44:58.000Z"
}
