{
  "title": "IHC proceedings disrupted as lawyers observe partial strike - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Proceedings at the Islamabad High Court (IHC) were disrupted on Wednesday as lawyers observed a partial strike on the call of the Islamabad Bar Council to protest against the decision to bar Justice Tariq Mahmood Jahangiri from performing judicial duties.\n\nSecretary High Court Bar Association Manzoor Jaja issued a statement urging lawyers not to appear in courts. He said the step was taken as a mark of protest against what he described the “unjust stopping” of a sitting judge from judicial work.\n\nThe strike had a visible impact on the IHC’s functioning. Chief Justice Sardar Mohammad Sarfraz Dogar’s cause list was canceled, while Justice Saman Raffat Imtiaz did not reach the court.\n\nThe division bench comprising Justice Babar Sattar and Justice Sardar Ejaz Ishaq Khan also could not commence proceedings. Both the judges were present in the IHC; however, they did not convene the court giving a virtual nod to the strike’s call.\n\nInterestingly, Justice Sattar issued show-cause notices to IHC registrar and deputy registrar over their leniency and failure to cope up with the strike call issued by Pakistan Bar Council against the police’s alleged brutality.\n\nJustice Sattar then questioned the authority of the lawyers’ bodies to “prevent fellow lawyers and litigants from accessing justice”.\n\nMeanwhile, Justice Arbab Mohammad Tahir and Justice Khadim Soomro were already on three-day leave, further affecting the day’s cause lists.\n\nDespite the strike call, some lawyers continued to appear in urgent matters. Secretary Manzoor Jaja himself was present at the high court premises during the protest.\n\nAn official of the IHC, on the other hand, claimed that the available benches entertained all the petitions in accordance with their normal routine.\n\nHe said preventing a judge from discharging judicial work was not a strange action as the five IHC judges, including Justice Jahangiri in a petition filed before the Supreme Court in February this year, sought a similar direction against Justice Dogar, Justice Khadim Hussain Soomro and Justice Mohammad Asif.\n\nMeanwhile, former advocate general Islamabad Barrister Jahangir Khan Jadoon filed a petition in the IHC seeking the release of audio and video recordings of Chief Justice Mohammad Sarfraz Dogar’s courtroom proceedings.\n\nThe application, moved by Barrister Jadoon before the IHC registrar, related to the hearing held in Court No. 1 on September 16. The petitioner contended that during the proceedings, the chief justice had assured lawyers that no order was being passed against Justice Jahangiri.\n\nHowever, following the hearing, it was revealed that the judge had been barred from performing judicial functions.\n\nThe plea requested that the complete recording of the 1pm hearing be provided to remove ambiguity. A USB was also submitted along with the application for this purpose.\n\nSpeaking to reporters, Barrister Jadoon said the court had indicated during the hearing that objections to the application would be addressed and the matter referred to the Supreme Judicial Council (SJC). “But later, an order surfaced stating that Justice Tariq Mahmood Jahangiri has been stopped from working,” he said, terming the move a constitutional violation.\n\nHe argued that the chief justice did not have the authority to suspend a sitting judge from duty, and expressed fears that court footage could go missing, as had allegedly happened in the past. He said he intended to file a reference in the SJC against the IHC chief justice over the matter.\n\nThe petition has added further tension to the ongoing judicial crisis, with the suspension of Justice Jahangiri already drawing sharp criticism from the bar and raising questions over the constitutional limits of the chief justice’s powers.\n\nPublished in Dawn, September 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:14:42.721Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942766/ihc-proceedings-disrupted-as-lawyers-observe-partial-strike",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T01:46:39.000Z"
}
