{
  "title": "Reko Diq: Govt earmarks $390m for rail tracks from Balochistan mines - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal government agreed to provide $390 million to the Reko Diq mining project to build rail tracks from mines in Balochistan, according to the Finance Division on Thursday.\n\nThe decision was taken during a meeting of the Economic Coordination Committee (ECC) in Islamabad, chaired by Finance Minister Muhammad Aurangzeb, according to a press release from the Finance Division.\n\nThe press release stated that the railways ministry submitted a summary on rail development and bridge financing agreements with the Reko Diq Mining Company, to provide $390m for laying a 1,350-kilometre railway track to transport large volumes of export material from mines in Balochistan.\n\n“The ECC approved the proposal and directed the Ministry of Railways to share both agreement documents with the Finance Division for appraisal,” the press release read.\n\n“It further instructed the Ministry of Railways and the Ministry of Finance to submit an update to the ECC by March next year on the execution and implementation of the project.”\n\nAdditionally, the ECC reviewed a summary from the petroleum ministry regarding approvals for agreements and financial commitments to fund the Reko Diq project, the press release read.\n\nThe ECC approved the proposed final terms of the agreements, with instructions that any material deviations in the final execution forms, determined by the project’s legal and financial consultants and certified by the mining company, would be brought back to the committee for approval.\n\nAccording to the press release, Aurangzeb said, “The ECC’s approvals signify the government’s firm commitment to moving ahead with this landmark project, which has the potential to transform the economic landscape of Balochistan and generate far-reaching benefits for the people of Pakistan.\n\n“The Reko Diq project will not only unlock one of the world’s largest undeveloped copper-gold deposits but also catalyse job creation, infrastructure development, and long-term socio-economic uplift across the region.”\n\nIn March this year, a formal feasibility study confirmed more than $60 billion worth of copper and gold reserves at the Reko Diq copper mine at prevailing prices, prompting state-owned Oil and Gas Development Com­pany, Pakistan Petroleum Ltd and Government Holdings (Pvt) Ltd to increase funding commitments to the mining company to $1.9bn.\n\nIn August, Reuters reported that the Asian Development Bank would provide a $410m financing package to help develop Pakistan’s Reko Diq copper mine, which Barrick Gold, a global gold mining company, would operate.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/18201755f9371bc.webp",
  "retrievedAt": "2025-09-19T14:43:42.630Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942981/reko-diq-govt-earmarks-390m-for-rail-tracks-from-balochistan-mines",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T15:24:52.000Z"
}
