{
  "title": "4 ‘India-sponsored’ terrorists killed in Balochistan’s Khuzdar during IBO: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four terrorists “belonging to Indian proxy” were killed during an intelligence-based operation (IBO) in Balochistan’s Khuzdar district, the military’s media wing said on Thursday.\n\n“On September 17 2025, security forces conducted an intelligence-based operation in the Khuzdar district of Balochistan, on reported presence of terrorists belonging to Indian proxy, Fitna al Hindustan,” the Inter-Services Public Relations (ISPR) said.\n\nThe state has designated Balochistan-based groups as Fitna-al-Hindustan to highlight India’s alleged role in terrorism and destabilisation across Pakistan.\n\nThe ISPR statement said that during the operation, “own forces effectively engaged the terrorists’ location”, adding that “after an intense fire exchange, four Indian sponsored terrorists were sent to hell”.\n\nWeapons, ammunition and explosives were recovered from slain terrorists, the ISPR said.\n\nThe terrorists were “actively involved in numerous terrorist activities in the area”, it added.\n\n“Sanitisation operation is being conducted to eliminate any other terrorists found in the area,” the statement read.\n\n“Security forces of Pakistan are determined to wipe out the menace of Indian sponsored terrorism from the country, and reaffirm the nation’s unwavering resolve to bring the perpetrators of terrorism to justice,” it added.\n\nA day ago, the ISPR had issued another statement, saying that the armed forces had eliminated five “Indian sponsored terrorists” during an IBO in Khuzdar earlier this week.\n\nYesterday, two police stations and a Levies station had also come under attack in Balochistan’s Sherani district. In those attacks, a policeman was martyred and two Levies personnel were injured.\n\nOn September 12, the ISPR said troops had also killed four “Indian sponsored terrorists” during an IBO in Balochistan’s Mastung.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:43:43.724Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942892/4-india-sponsored-terrorists-killed-in-balochistans-khuzdar-during-ibo-ispr",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T08:56:24.000Z"
}
