{
  "title": "Situationer: Taliban seek quid pro quo from US - Newspaper - DAWN.COM",
  "author": null,
  "content": "A US delegation that recently visited Kabul told Afghan Taliban leaders that releasing American prisoners could pave the way for “some progress” in relations, which also includes the possibility of American investment in the country’s mineral resources.\n\nBut unlike past instances, where the Taliban regime had swiftly complied with such requests from Washington, this time around they seem to be seeking a quid pro quo.\n\nSources privy to discussions between Adam Boehler, the US president’s special envoy for hostage affairs, and senior Afghan Taliban officials told Dawn that although the US delegation was there to secure a prisoner release, the visit could be viewed as a diplomatic boost for Afghanistan’s rulers, who are desperately trying to seek international recognition.\n\nSo far, only Russia has accorded official recognition to the Taliban regime.\n\nMr Boehler’s visit, his second trip to Afghanistan in seven months, is also being viewed by many as signaling the Trump administration’s shift towards some level of engagement with the so-called Islamic Emirate.\n\nUnlike previous occasions, Kabul is now looking to secure concessions before complying with the Trump administration’s wishes\n\nAn Afghan official described the visit as “a new beginning” for relations between the United States and the Taliban regime.\n\nBoehler’s previous trip, in March, yielded the release of US citizen George Glezmann, who was detained in 2022 while visiting Kabul as a tourist.\n\nThis time around, the delegates met with Deputy Prime Minister Mullah Abdul Ghani Baradar and Foreign Minister Amir Khan Muttaqi. However, these meetings did not yield the immediate release of the prisoner whose freedom they came to secure.\n\nSources privy to the meetings said that Mr Boehler had termed the issue of prisoners as being “very important to President Trump”.\n\nHe even hinted that if this obstacle in relations could be resolved, the two countries could “move forward”, sources quoted the envoy as saying.\n\nThis seems to be a reference to potential US investment in the minerals sector. The Taliban government has invited investors to look at opportunities for the exploration of mineral resources in parts of the country, mostly in the north.\n\nAfter seizing Kabul in Aug 2021, the Taliban government signed several billions of dollars on mining contracts with local and foreign companies from China, Iran, Uzbekistan, Turkey and Britain.\n\nThese contracts cover the extraction and processing of gold, copper, iron, lead and zinc in Takhar, Ghor, Herat, Panjshir and Logar, Badakhshan, Takhar, Samangan, Sar-e-Pul, Kandahar, Oruzgan, Nangarhar and Kunar, according to officials.\n\nBut the Taliban side also wants something else; the release of Mohammad Rahim, the lone Afghan still imprisoned at the infamous US detention centre in Guantanamo Bay.\n\nAlthough the US had agreed, in principle, to release Rahim in March, it has not yet come to pass.\n\nThis time, however, the envoy apparently assured the Afghan Taliban that he would be freed and transferred to Qatar. Washington wants some curbs on Rahim even after his release, and discussions on this issue are still ongoing, an official privy to the matter told Dawn.\n\nDiscussions between the two sides also included the issue provision of consular services for Afghan citizens residing in the US.\n\nThe issue is synonymous with concerns over limited diplomatic representation for Afghanistan in the US, following the Taliban’s return to power.\n\nOn this, Kabul maintains that it should be allowed to staff its consulate in the US to provide facilities to thousands of Afghans living in the United States. In addition,\n\nThere are indications that the Trump administration may allow the Taliban to have an envoy in New York, as was the case during the first Taliban regime in the 1990s. At the time, Abdul Hakim Mujahid served as the Taliban representative (or point of contact) for the UN.\n\nKhalilzad the interlocutor\n\nAccompanying Mr Boehler on both his trips to Kabul was Zalmay Khalilzad, a former US special representative to Afghanistan, who was appointed to that post by none other than President Donald Trump, during his first stint in the White House.\n\nHowever, Khalilzad’s allegiances are a matter of some debate; although he does not hold any official position in the US administration, he seems to be facilitating all American engagement with Kabul (and Kandahar, for that matter).\n\nDr Ubaidullah Burhani, an academic specialising in Middle Eastern and Afghan affairs, believes that Khalilzad’s latest visit was conducted “in an official capacity”, as he was representing the US alongside Mr Boehler.\n\nWhile addressing highly sensitive security and humanitarian issues, he also acted as a coordinator to maintain communication channels, particularly in light of Qatar’s ongoing and influential role as a regional mediator.\n\nIn this sense, Khalilzad functions as a dual channel — conveying Washington’s official position on the one hand, while simultaneously broadening engagement opportunities through his experience and regional connections, Dr Burhani said.\n\nIt may be recalled that Khalilzad was one of the main interlocutors between Kabul and Washington when both sides sat across the table from each other to negotiate the ‘Agreement for Bringing Peace to Afghanistan’ — commonly known as the Doha accord — in Feb 2020.\n\nAccording to some accounts, Khalilzad represents Qatari interests, and was brought on by Doha to facilitate talks between the US and the Afghan Taliban regime.\n\nIndeed, the recent visit of the US delegation was also managed from Doha, which provided a special plane for delegates for travel to and from Afghanistan.\n\nIn addition, Khalilzad was also in Doha during the recent Arab summit, convened in the aftermath of Israel’s strike against Hamas leaders living in Qatar. Officials in Kabul say they are happy to deal with Khalilzad, as he seems to understand both sides quite well.\n\nPublished in Dawn, September 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/180936381f7ec4e.webp",
  "retrievedAt": "2025-09-19T14:44:04.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942811",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T01:44:58.000Z"
}
