{
  "title": "Palestinians flee Gaza in face of deadly offensive - World - DAWN.COM",
  "author": null,
  "content": "• Israel strikes more than 150 targets, kills 62 across the enclave\n• New route opened for Palestinians fleeing the embattled city\n• EU proposes curbing Israel trade ties, sanctioning far-right ministers\n\nGAZA CITY: Huge numbers of Palestinians were fleeing Gaza City by any means on Wednesday as the Israeli military pressed its ground offensive, killing dozens in strikes.\n\nThe Israeli army said it had struck more than 150 targets in Gaza City since launching a major ground offensive on the Gaza Strip’s main urban hub early on Tuesday.\n\nAFP images showed a steady stream of Gazans heading south on foot, by car and on donkey carts, with their few belongings piled high as Israel bombarded the city.\n\nIsrael had announced the day before that the US-backed campaign in the Gaza Strip’s largest city had begun, pledging to destroy Hamas in the area.\n\nThe offensive has sparked outrage among the international community, with the Palestinian territory already devastated by nearly two years of war and the Gaza City region gripped by a UN-declared famine.\n\nGaza’s civil defence agency said Israeli fire had killed at least 62 people across the territory on Wednesday.\n\nThe Israeli military said it was opening a temporary new route on Wednesday to allow people to flee, after unleashing a massive bombardment before dawn on Tuesday and pushing its troops deeper into Gaza City.\n\nIt came as a United Nations probe accused Israel of committing genocide in the Palestinian territory, saying Prime Minister Benjamin Netanyahu and other senior officials had incited the crime.\n\nOn Wednesday, the Israeli military said it was opening “a temporary transportation route via Salah al-Din Street”, as AFP images showed fresh bombardments.\n\nIts Arabic-language spokesman, Colonel Avichay Adraee, said the corridor would remain open for just 48 hours from midday (0900 GMT).\n\n‘Death is cheaper’\n\nThe United Nations estimated at the end of August that about one million people were living in Gaza City and its surroundings.\n\nThe Israeli military said Wednesday that more than 350,000 had so far fled south.\n\nBut many Gazans say nowhere is safe and have vowed to stay in their homes.\n\n“I won’t leave Gaza. There’s shelling here and there,” said Umm Ahmed Yunes, who is living in her partially destroyed home.\n\n“Where would I find $1,000 or $2,000 for transport costs? Where would I buy a tent? There are no tents and prices are insane,” said the 44-year-old. “Death is cheaper and more merciful.”\n\nMother of four Fatima Lubbad left Gaza City with 10 relatives but said the ordeal was unbearable. “I wish we would all die together,” said the 36-year-old.\n\n“Last night we slept in the street by the sea in Deir el-Balah — there was nowhere to put a tent… I cried all night as I looked at my children sleeping on the ground.”\n\nIn Gaza City’s Shati camp, an Israeli air strike killed four people, including a woman and her child, according to the civil defence agency.\n\n“Enough, we want to be free. We want to live, we don’t want to die, who told you we want to die? Tell Netanyahu: we don’t want to die!” said Mohammed al-Danf, an eyewitness.\n\nEU sanctions\n\nThe European Union on Wednesday proposed curbing trade ties with Israel and sanctioning ministers in its strongest action yet over the war in Gaza, though reluctance from key member states risks blocking adoption.\n\nThe bloc’s executive, however, said it would take immediate action by freezing some 20 million euros ($23.7m) in support for Israel.\n\n“The horrific events taking place in Gaza on a daily basis must stop,” EU chief Ursula von der Leyen said.\n\n“There needs to be an immediate ceasefire, unrestrained access for all humanitarian aid, and the release of all prisoners.” Under its new proposals, Brussels is pressing to suspend the parts of a cooperation deal that allow for reduced tariffs on goods coming from Israel.\n\nThe EU also called for asset freezes and visa bans on far-right Israeli government ministers Itamar Ben Gvir and Bezalel Smotrich over their “extremist” rhetoric.\n\nThose measures — initially floated by von der Leyen in a speech last week — represent the firmest attempt by the EU chief to pressure Israel.\n\n“Today marks a critical turning point in holding Israel accountable,” said Irish foreign minister Simon Harris.\n\nPublished in Dawn, September 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/18074748c8f1fa3.webp",
  "retrievedAt": "2025-10-12T04:14:37.829Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942809/palestinians-flee-gaza-in-face-of-deadly-offensive",
  "dateList": "2025-09-18",
  "date_published": "2025-09-18T01:45:51.000Z"
}
