{
  "title": "Govt terminates contracts with 6 Power Plants, reduces electricity cost 4 rupees per unit: Senate body told",
  "author": null,
  "content": "ISLAMABAD, Feb 24 (APP):The Senate Standing Committee on Power, led by Senator Mohsin Aziz, convened on Monday to discuss the SAPM Muhammad Ali’s report on Independent Power Producers (IPPs).\nSpecial Assistant to the Prime Minister (SAPM) on Power, Muhammad Ali, briefed that the government has terminated contracts with 6 Power Plants and more importantly, implemented rupee base tariff for Bagasse Power Plants and plants operationalized between 1994 and 2002, said a press release.\nThe government has fixed the return of 17 pc for Power Plants against the unprecedented return of 35 pc in the last decades. SAPM Muhammad Ali stated that the government has recovered 35 billion from the Power Plants which has been payed by Federal Government in lieu of fuel. Additionally, the government has initiated negotiations on 45 renewable plants to reduce the profit margin on the said plants at sustainable rates.\nMuhammad Ali further highlighted that the government intends to make an entity named as ISMO for comparative markets in order to make power sector sustainable for the future.\nWhile discussing the circular debt of Power Sector, SAPM underscored that the government is negotiating to relinquish the interest on the circular debt and formulate a structure for the payment of stock circular debt in the coming five to seven years.\nFederal Minister for Power Awais Ahmad Khan Leghari stated that the government has reduced electricity cost around 04 rupees per unit for domestic consumers and 11.5 to 12 rupees for industrial sectors. It is hoped that the cost of electricity will further lower down in the coming as the negotiations with other IPPs will conclude.\nSenator Shibli Faraz reiterated that there has been rumors of arm twisting with the Power producers while negotiating the terms and Conditions. SAPM Muhammad Ali refuted the allegation stating that fault lines of power producers were highlighted during the negotiations.\nFurthermore, Senator Haji Hidayatullah Khan highlighted the matter of vacant vacancies in Peshawar Electric Supply Company. Federal Minister for Power Awais Ahmad Khan Leghari stated that around 86,000 vacancies are vacant in all DISCOs and the government intends to fill the 36,000 vacancies in the coming months.\nSenator Hidayatullah Khan also inquired about the expected tax on solar energy. Awais Ahmad Leghari refuted the rumors stating that the government does not intends to impose tax on solar in the near future.\nDuring the meeting, the Committee discussed the implementation status of the recommendations contained in the Report of the Special Committee of the Senate on Circular Debt, authored by Senator Syed Shibli Faraz in 2018, when he served as the Convener of the Committee. Officials of Power Division apprised that the  major portion of recommendations  have been implemented and the government is working on the recommendation of ‘Simplication of Tax’.\nMoreover, the Committee was briefed on the restructuring of NTDC. Chairman NTDC informed that the government plans to overhaul the structure of NTDC, keeping its functions in mind. However, he emphasized that the real problem lies within the organization itself, and there is an urgent need to change the building code in order to reduce the significant gap between winter and summer consumption.\nIn attendance Senators Mir Dostain Khan Domki, Syed Shibli Faraz, Haji Hidayatullah Khan, Federal Minister for Power Awais Ahmad Khan Leghari, Special Adviser to Prime Minister on Power Muhammad Ali, Secretary for Power Division Muhammad Fakhre Alam Irfan,Chairman NTDC Faiz Ahmad Chaudhry along with other senior officials of relevant Departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:03:50.835Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-terminates-contracts-with-6-power-plants-reduces-electricity-cost-4-rupees-per-unit-senate-body-told/",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T17:06:00.000Z"
}
