{
  "title": "CAPS Ambassadors’ Forum proposes enhancing P2P and B2B linkages among Pakistan, Australia and South Korea",
  "author": null,
  "content": "ISLAMABAD, Feb 24 (APP):The Consortium for Asia-Pacific Studies (CAPS) on Monday hosted its flagship event, the “CAPS Ambassadors’ Forum,” here at the National Library of Pakistan, bringing together diplomats, industry leaders, and academic experts.\nThe forum focused on identifying challenges and exploring innovative ways to enhance people-to-people (P2P) and business-to-business (B2B) cooperation between Pakistan and Asia-Pacific nations, said a press release.\nModerated by Dr. Gulshan Rafiq, Chief Organizer of CAPS, the discussions centered on expanding Pakistan’s engagement with the Asia-Pacific, particularly in education, tourism, and economic partnerships. Dr. Khurram Iqbal, President of CAPS, emphasized the CAPS’s role in promoting understanding in “low politics” areas.\nThe forum’s discussion on Australia-Pakistan relations, led by Ambassador (R) Naela Chohan, highlighted the long-standing ties between the two nations, dating back to the late 19th century.\nAmbassador Chohan advocated for reviving a stalled Memorandum of Understanding (MOU) on student exchanges between Pakistani universities and Australia’s Group of Eight universities, building on existing academic links.\nMichael Barnes, CEO of IAE Global, underscored the importance of Transnational Educational Opportunity (TNE) in opening up opportunities.\nBarnes, who first visited Pakistan 25 years ago, commended Pakistan’s educational progress, calling its students “world-class.” He also discussed the increasing interest of Australian universities in offshore campuses, presenting a significant opportunity for Pakistan.\nAmbassador (R) Masood Khalid provided context for South Korea-Pakistan relations, noting that the Asia-Pacific economy is significantly larger than that of the US, Europe, and Africa.\nHe emphasized the need to address the trade imbalance, which favors South Korea, and suggested that Pakistan could learn from South Korea’s export-driven economic model and its “One Village, One Product” program.\nKhalid also highlighted the strong people-to-people ties, citing South Korea’s support following Pakistan’s 2005 earthquake.\nDr. Bilal Zubair (CISS) added a cultural dimension to the conversation, suggesting exchanges in sports, music, and e-games, noting the popularity of Korean Taekwondo and Nusrat Fateh Ali Khan’s music in South Korea.\nKim Janghoon, a South Korean student at Bahria University, shared insights from his experience in Pakistan, highlighting challenges such as high import taxes on cosmetics and the lack of awareness about Pakistan in South Korea, which affects Pakistani students’ chances of securing scholarships.\nHe emphasized Pakistan’s potential, particularly its youth, and expressed a desire to bridge the cultural gap by helping Koreans better understand Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:03:29.105Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/caps-ambassadors-forum-proposes-enhancing-p2p-and-b2b-linkages-among-pakistan-australia-and-south-korea/",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T18:38:00.000Z"
}
