{
  "title": "Rubina Khalid urges unified action to strengthen Pakistan’s social protection system",
  "author": null,
  "content": "ISLAMABAD, Feb 24 (APP):Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid on Monday urged development partners, policymakers, and stakeholders to collaborate in fortifying Pakistan’s social protection framework.\nShe made this call during the Second National Social Protection Conference, which commenced in Karachi, said a news release.\nThe three-day conference, running from February 24th to 26th, is organized by GIZ Pakistan on behalf of the European Union and the German Federal Ministry for Economic Cooperation and Development (BMZ).\nThe event aims to enhance cooperation, promote digital innovation, and ensure financial sustainability in Pakistan’s social protection system.\nSpeaking at the conference’s opening session, Senator Rubina Khalid emphasized BISP’s role as the largest social safety net in Asia.\nShe recalled the vision of Shaheed Mohtarma Benazir Bhutto, who once said, “No nation can truly progress if its most vulnerable communities are left behind.” This vision laid the foundation for BISP’s establishment in 2008, ensuring social protection as a fundamental right rather than a privilege.\nHighlighting BISP’s achievements, Senator Khalid noted that the Benazir Kafaalat program has been a lifeline for 9.8 million families, providing them with quarterly financial support.\nShe also pointed out that the Benazir Taleemi Wazaif initiative has enrolled over 10.7 million children 50% of whom are girls by linking financial assistance to school attendance. Additionally, the Benazir Nashonuma program addresses maternal and child health, offering nutritional support to pregnant and lactating mothers across the country.\nSenator Khalid further underscored the significance of the National Socio-Economic Registry (NSER), describing it as the backbone of Pakistan’s social protection database.\nThe NSER, a pioneering dynamic registry, facilitates over 95 social sector programs at both federal and provincial levels, ensuring targeted assistance for the most vulnerable populations.\nThe BISP chairperson also announced the launch of new skill development initiatives aimed at economic empowerment for beneficiaries.\nShe stressed the need for enhanced federal-provincial coordination to establish an integrated social protection ecosystem. “The challenges of poverty, climate change, and economic instability demand stronger social protection mechanisms based on global best practices,” she stated.\nExpressing gratitude, Senator Khalid acknowledged the support of the European Union, the German government, The World Bank, the Asian Development Bank (ADB), and various development partners.\nShe also appreciated the Government of Sindh for hosting the conference and thanked Johanna Knoess, Project Head of Adaptive Social Protection at GIZ Pakistan, for organizing the event.\nKeynote speakers at the conference included German Consul General Mr. Ruediger Lotz, Country Director for GIZ Pakistan Ms. Maria-Jose Poddey, and Ms. Johanna Knoess, reflecting the strong international commitment to strengthening Pakistan’s social protection landscape.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:05:06.812Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rubina-khalid-urges-unified-action-to-strengthen-pakistans-social-protection-system/",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T11:38:00.000Z"
}
