{
  "title": "Senate body reviewed schemes of Maritime Affairs",
  "link": "https://www.app.com.pk/national/senate-body-reviewed-schemes-of-maritime-affairs/",
  "date_published": "2020-08-31T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Senate Standing Committee on Maritime Affairs on Monday reviewed in detail about on-going and new schemes of Maritime Affairs Division included in PSDP 2020-21.\nThe committee which met here parliament house, also reviewed non-payment of dues to land owners from whom land has been acquired for Eastbay Expressway, Gwadar.\nWhile being briefed about on-going and new schemes of the Maritime Affairs Division, the Committee was informed that 5 projects are on-going, whereas 11 new projects have been included in the PSDP 2020-21.\nThe Committee was informed that certain procurement projects were being delayed due to quarterly funding by the Ministry of Finance. The Committee asserted that lump sum payments must be made to the Ministry for purchase of machinery and equipment such as acquisition of Marine Services Vessels for Gwadar Port.\nThe Committee showed serious concern over slow pace of work on different projects especially Pak-China Technical and Vocational Institute at Gwadar.\nThe Committee directed the Ministry to expedite the work on the Institute, because it is a vital project for development of Gwadar. The Chairperson said that committee would like to inspect the premises of the Institute to gauge pace of work at appropriate time.\nWhile taking up the issue of non-payment of dues to land owners from whom land had been acquired for the construction of Eastbay Expressway in Gwadar, the Committee observed that matter has been pending since 2007 and directed the ministry to resolve it at the earliest.\nThe meeting was chaired by Senator Nuzhat Sadiq and attended by Senator Kauda Babar, Senator Muhammad Akram, Senator Aurangzeb Khan, Senator Mustafa Nawaz Khokar, Senator Sitara Ayaz and senior officers from the Ministry of Maritime Affairs, Karachi Port Trust and Gwadar Port Authority",
  "retrievedAt": "2025-08-11T19:44:41.617Z"
}
