{
  "title": "ANF seizes drugs $8300mln during last month: Azam Swati",
  "link": "https://www.app.com.pk/national/anf-seizes-drugs-8300mln-during-last-month-azam-swati/",
  "date_published": "2020-08-31T09:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Federal Minister for Narcotics Control Muhammad Azam Khan Swati on Monday said that Anti Narcotics Force (ANF) seized drugs worth 8300 million dollars during the last month.\naccording to a press release, he disclosed in a meeting that held to review the drug situation in educational institutes of the federal capital.\nIt was a huge achievement of the force as it was fighting against the drug smugglers with limited resources and personnel, he added.\nHe said drug dealers targeted our educational institutions and about 99.9 per cent drugs were coming from Afghanistan through smuggling.\n“Prime Minister Imran Khan tasked me to purge the country from the menace of narcotics drugs and save our children which are the future of Pakistan,” said Swati.\nDirector General ANF and Inspector General of Islamabad Police briefed the participants about the narcotics drugs situation in educational institutions of Islamabad.\nThey appealed the heads of educational institutions and civil society organizations to coordinate and cooperate with Ministry of Narcotics Control and law enforcing agencies to exterminate the menace of drugs of education institutions.\nMinistry of Narcotics Control will make a coordination committee for coordination with law enforcing agencies and educational institutions.\nThe participants recommended that all educational institutions should be declared smoke free zone and Closed-circuit television (CCTV) cameras be installed over there for monitoring.\nAll institution must hire therapist for counseling of students and Healthcare Standard Operating Procedure (SOP) should be developed in educational institutions besides arranging awareness programs for students and teachers.\nThe Federal Minster urged all the participants to work hard for eradicating the menace of drugs from educational institutions and society to save our future of the people.\nAmong others the meeting was attended by Secretary, Ministry of Narcotics Control, Director General (Federal Directorate of Education), Representative of HEC and Private School Associations, Chairman Sunny Trust, Chairperson of KKAWF and civil society organizations.",
  "retrievedAt": "2025-08-11T19:44:52.862Z"
}
