{
  "title": "Distance learning top priority of education ministry due to COVID-19: Shafqat",
  "link": "https://www.app.com.pk/national/distance-learning-top-priority-of-education-ministry-due-to-covid-19-shafqat/",
  "date_published": "2020-08-31T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Minister for Federal Education and Professional Training, Shafqat Mehmood Monday said distance learning program in present circumstances due to COVID-19 is top priority of his ministry.\nTalking to the newly appointed World Bank’s Country Director to Pakistan, Najy Benhassine during a meeting held at his office in Islamabad, he said they were enhancing abilities of developing online contents through increasing the use of technology in education.\nFederal Secretary, Farah Hamid Khan and Additional Secretary Mohaiyyuddin Ahmed Wani were also present in the meeting.\nHe said concrete steps were also being taken to develop a mechanism to connect teachers and students. The access and quality of internet for students and educational institutions was being ensured because no one can predict termination of COVID-19 pandemic, Shafqat mentioned.\nExpressing his views on learning poverty, the Minister stated that child should\nnot be taught in the language which he could not understand. It was one of the main reasons behind high percentage of illiteracy in Pakistan, adding, single national curriculum would largely address this issue.\nMinistry of Federal Education and World Bank were working very closely in many areas and World Bank also had provided US five million under Education Emergency Program which was very helpful for starting a dedicated TV Channel “Tele school” by Ministry of Federal Education and Professional Training.\nEducation Minister congratulated the World Bank Country Director and conveyed his best wishes for his new assignment in Pakistan, reiterating that the cooperation and collaboration between both sides would be further enhanced.\nHighlighting his priorities in Pakistan, The World Bank Country Director Najy Benhassine stated that he has chosen his first meeting with Minister of Education which reflected importance of education for him.\nThe meeting was marked by traditional warmth, mutual understanding and trust.",
  "retrievedAt": "2025-08-11T19:44:41.586Z"
}
