{
  "title": "COVID-19 Response; EU pays WHO € 2.5 mln to support Pakistan",
  "link": "https://www.app.com.pk/national/covid-19-response-eu-pays-who-e-2-5-mln-to-support-pakistan-2/",
  "date_published": "2020-08-31T10:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): The European Union has mobilized €2.5 Million for the World Health Organization (WHO) to support the Government of Pakistan in its response to the COVID-19 outbreak.\nThis support, which will continue for one year, will be provided through the EU’s Civil Protection and Humanitarian Aid (ECHO) department.\nThe EU is working to strengthen Pakistan’s healthcare system by providing an immediate emergency response to COVID-19 across the country, reaching 1.42 million individuals by working with provincial health authorities in Sindh, Khyber Pakhtunkhwa and Balochistan.\nThe aim is to reduce avoidable deaths and infections, as well as to mitigate the effects of the disease at both the individual and community level in Pakistan’s most affected regions; Sindh (Sukkur, Larkana Districts), Khyber Pakhtunkhwa (Peshawar, Swat, Abbottabad Districts) and Balochistan (Kech, Khuzdar districts).\nThe support will focus on coordination, risk communication, community mobilization and sensitization; disease surveillance and laboratory diagnostics; infection prevention and case management.\nAmbassador of the European Union to Pakistan, Androulla Kaminara here on Monday said, “The EU continues to work closely with its partners to support Pakistan’s healthcare system during this difficult time. Despite the decline of COVID-19 infections and deaths in the country, the threat of a second wave still remains.\nIt is critical to continue following SOPs and build capacity overall, especially in regions where it is most needed”, said a press release.\nWHO Representative and Head of Mission in Pakistan, Dr Palitha Mahipala shared, “World Health Organization Country Office in Pakistan highly appreciates the valuable support extended by the European Commission which helps to strengthen the response to contain the COVID-19 epidemic in Pakistan and to support the Government in strengthening disease surveillance system, infection prevention and control, and community sensitization through effective risk communication strategies”.\nThis contribution to the WHO is part of the European Union’s dedicated €150 million package for the short- and medium-term response to the COVID-19 crisis in Pakistan. This support is being extended through our development work, humanitarian aid and working with civil society organizations.\nThese funds will help strengthen the preparedness of Pakistan’s people for the social and economic impact of the pandemic, with a specific focus on the most vulnerable.",
  "retrievedAt": "2025-08-11T19:44:50.833Z"
}
