{
  "title": "Webinar highlights UN’s role",
  "link": "https://www.app.com.pk/national/webinar-highlights-uns-role/",
  "date_published": "2020-08-31T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):The Institute of Strategic Studies Islamabad (ISSI) on Monday organized a webinar titled “Pakistan and the United Nations at 75: Past Present and Future” in which the participants highlighted the United Nations’ role in the diverse growing challenges.\nIn a special message on the occasion, UN country representative Julien Harneis said Pakistan is an important contributor to the UN, especially to its peacekeeping activities.\nHe said with the recent assumption of the leadership of the Economic and Social Council, Pakistan can also make a significant difference. According to a press release, Director General ISSI, former ambassador Aizaz Ahmad Chaudhry said the world was going through a difficult phase with ultranationalist leaders undermining multilateralism and globalism.\nFormer ambassador and Pakistan’s former representative to the United Nations Dr. Maleeha Lodhi, while talking about UN and challenges to multilateralism, said the UN was marking a milestone at an unprecedented time, with countries turning inward and the divisions becoming sharper between an increasingly interconnected world. Speaking about the evolving nature of UN peacekeeping, Dr. Tughral Yamin said that Pakistan’s role in UN peacekeeping operations had helped in improving the country’s soft image. Former senator and ex-federal minister Nisar Memon said Pakistan had made progress in achieving the Sustainable Development Goals.\nFormer senator and ex-federal minister Javed Jabbar said that generations born in the last five or six decades were very lucky as they have witnessed the significant transformations that the world had undergone.\nHe said that the UN Human Rights charter was very significant as it transcended all divisions and accommodated all the diversity.\nIn his concluding remarks, former ambassador Khalid Mahmood, Chairman Board of Governors, ISSI said that the United Nations had played a central role in forging a normative framework and people around the globe expected the UN to protect them and be there in their time of need.",
  "retrievedAt": "2025-08-11T19:44:53.051Z"
}
