{
  "title": "Rebuilding from COVID-19 requires green, resilient, inclusive actions: ADB president",
  "link": "https://www.app.com.pk/national/rebuilding-from-covid-19-requires-green-resilient-inclusive-actions-adb-president/",
  "date_published": "2020-08-31T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Asian Development Bank (ADB) President Masatsugu Asakawa said the Sustainable Development Goals (SDGs) and related targets in the Paris agreement on climate change provide strong frameworks for the recovery from the coronavirus pandemic in Asia and the Pacific.\nThe ADB president said while speaking at a high-level event hosted by UN-ESCAP on Monday focusing on Financing for Development in the Era of COVID-19 and Beyond in Asia and the Pacific.\n“We need to rebuild our economy and society with green, resilient and inclusive measures,” Asakawa said. “Investing in infrastructure that satisfies ‘G20 quality infrastructure principles’ should be an important part of post-pandemic recovery packages. We also need to address worsened income inequality due to the pandemic and ensure affordable, accessible, and high-quality education and health services”, he said.\nHe said that tackling these issues requires mobilization of even larger financial resources than anticipated before the pandemic and to further strengthen developing Asia’s incentives to make SDG-compatible investments. He highlighted four areas to help achieve this.\nImproving tax policy and administration by broadening the tax base and closing loopholes created by the digital economy and by making the tax system more progressive to address income inequality; Introducing a carbon tax to drive economies toward an environmentally sustainable path; Strengthening financial markets to enable countries to tap their domestic savings for their long-term investments; and Promoting thematic bonds such as gender, green and blue bonds to mobilize private financial resources to achieve key targets under the SDGs.\n“As highlighted by SDG-17, to design and implement these measures we must further promote international and regional cooperation as well as public-private partnerships,” he said.\nTo support its developing members in the pandemic, ADB established in April a comprehensive $20 billion package of support. The package includes a new financing modality called the COVID-19 Pandemic Response Option (CPRO) through which it is providing quick-disbursing budget support to help governments finance their crisis-related social protection programmes, with a focus on meeting the needs of the poor and most vulnerable.\nOther speakers at today’s online event were ESCAP Executive Secretary Salsiah Alishahbana; UN Deputy Secretary General Amina Mohamed; Advieor to the Prime Minister on Finance and Revenue Abdul Hafeez Sheikh, Fiji Attorney General and Minster for Economy, Civil Service and Communications Aiyaz Sayyed-Khaiyum and Maldives Finance Minister Ibrahim Ameer.",
  "retrievedAt": "2025-08-11T19:44:43.646Z"
}
