{
  "article_id": "2025-01-12_83e07beb44488f4aff68fde64ba28141",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884646/global-job-market-poised-for-major-technological-shift-by-2030-world-economic-forum",
    "retrieved_at": "2025-10-12T00:48:45.970Z"
  },
  "metadata": {
    "title": "Global job market poised for major technological shift by 2030: World Economic Forum - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-12T02:04:14.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/67831b5df1fb5.gif",
    "categories": [],
    "word_count": 804,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD: Technological change, geo-economic fragmentation, economic uncertainty, demographic shifts and the green transition - individually and in combination - are among the major drivers expected to shape and transform the global labour market by 2030, cautions a new report from the World Economic Forum (WEF). The 'Future of Jobs Report 2025' released this week, brings together the perspective of over 1,000 leading global employers - collectively representing more than 14 million workers across 22 industry clusters and 55 economies from around the world - to examine how these macro-trends impact jobs and skills, and the workforce transformation strategies employers plan to embark on in response, across the 2025 to 2030 timeframe. Broadening digital access is expected to be the most transformative trend - both across technology-related trends and overall - with 60 per cent of employers expecting it to transform their business by 2030. Advancements in technologies, particularly artificial intelligence (AI) and information processing (86 per cent); robotics and automation (58pc); and energy generation, storage and distribution (41pc), are also expected to be transformative, the report says. These trends are expected to have a divergent effect on jobs, driving the fastest-growing and fastest-declining roles and fuelling demand for technology-related skills, including AI and big data, networks and cybersecurity and technological literacy, which are anticipated to be the top three fastest-growing skills. Increasing cost of living ranks as the second-most transformative trend overall - and the top trend related to economic conditions - with half of employers expecting it to transform their business by 2030, despite an anticipated reduction in global inflation. To a lesser extent, the general economic slowdown remains at the top of the mind and is expected to transform 42pc of businesses. Factors driving job creation Inflation is predicted to have a mixed outlook for net job creation to 2030, while slower growth is expected to displace 1.6 million jobs globally. These two impacts on job creation are expected to increase the demand for creative thinking, resilience, flexibility, and agility skills. Climate change mitigation is the third-most transformative trend overall - and the top trend related to the green transition - while climate change adaptation ranks sixth with 47 per cent and 41 per cent of employers, respectively, expecting these trends to transform their business in the next five years. This is driving demand for roles such as renewable energy engineers, environmental engineers and electric and autonomous vehicle specialists, all among the 15 fastest-growing jobs. Climate trends are also expected to drive an increased focus on environmental stewardship, which has entered the Future of Jobs Report's list of the top 10 fastest-growing skills for the first time. The report says two demographic shifts are increasingly seen to be transforming global economies and labour markets: ageing and declining working-age populations, predominantly in higher-income economies, and expanding working-age populations, predominantly in lower-income economies. Ageing populations drive growth in healthcare jobs such as nursing professionals, while growing working-age populations fuel growth in education-related professions, such as higher education teachers. Geo-economic fragmentation and geopolitical tensions are expected to drive business model transformation in one-third (34 per cent) of surveyed organizations in the next five years. Over one-fifth (23 per cent) of global employers identify increased restrictions on trade and investment, as well as subsidies and industrial policies (21 per cent), as factors shaping their operations. Employers who expect geo-economic trends to transform their business are also more likely to offshore - and even more likely to re-shore - operations. These trends drive demand for security-related job roles and increase demand for network and cybersecurity skills. There is also an increasing demand for other human-centred skills such as resilience, flexibility, agility, leadership, and social influence. Extrapolating from the predictions shared by Future of Jobs Survey respondents, on current trends over the 2025 to 2030 period job creation and destruction due to structural labour-market transformation will amount to 22pc of today's total jobs. This is expected to entail the creation of new jobs equivalent to 14 per cent of today's total employment, amounting to 170m jobs. However, this growth is expected to be offset by the displacement of the equivalent of 8pc (or 92m) of current jobs, resulting in net growth of 7pc of total employment, or 78 million jobs. Technology-related roles are the fastest growing jobs in percentage terms, including big data specialists, fintech engineers, AI and machine learning specialists and software and application developers. Green and energy transition roles, including autonomous and electric vehicle specialists, environmental engineers, and renewable energy engineers, are among the fastest-growing roles. Clerical and Secretarial Workers - including cashiers and ticket clerks, and administrative assistants and executive secretaries - are expected to see the largest decline in absolute numbers. Similarly, businesses expect the fastest-declining roles to include postal service clerks, bank tellers and data entry clerks. Published in Dawn, January 12th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}