{
  "article_id": "2025-01-12_74ef50b1e102c96877f0d0c9e3329968",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884563/harking-back-there-is-more-to-ichhra-than-mere-halwa-puri",
    "retrieved_at": "2025-10-12T01:11:42.742Z"
  },
  "metadata": {
    "title": "Harking back: There is more to Ichhra than mere halwa puri - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-12T02:04:44.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 1232,
    "reading_time_minutes": 7
  },
  "content": {
    "article_body": "Once while having halwa puri inside Lohari Gate in the famous Haji shop, out of sheer curiosity I asked just which was the best halwa puri shop in Lahore. Prompt came the answer: \"Go to Ichhra Bazaar even though that is strictly not in Lahore\". The answer got me thinking, for I had heard from a friend that the halwa puri of Ichhra, and this made me try it a few weeks later, and it was amazing. But as I had in an earlier piece written about the history of Ichhra, it also got me exploring the main Srinagar Street and found the houses ancient. In 1947, the majority population of Ichhra were Hindus and Sikhs, with Muslims being less than 32 per cent as official statistics tell us. It reminded me of a letter - a 'hundi' - that lies in the Lahore Museum sent by an indigo trader from Surat which says, 'Lahore near Ichhra'. So, the feeling that Lahore and Ichhra were two different towns comes to the fore. The present population of Ichhra still strongly consider themselves as not part of Lahore, even though - officially - Lahore has engulfed them and moved miles ahead in every direction. The origins of the two names need to be understood, and once mention is made of them then the creation of these two towns need to be clearly described. Both 'Ichhra' and 'Lahore' formed a few thousand years ago, both on mounds, to prevent the monsoon floods destroying them. Both took their names based on the beliefs that prevailed then. These beliefs respected deities that are still respected in the Hindu faith. Just as in Islam there is a central all-encompassing Allah, with a devil - Shaitan - as opposing His will yet subservient to Allah, in the Hindu faith there is an 'Om' with the deities Shiva and Vishnu with a third Brahma flowing from them. From them flow other 'Mahadevs' with attributes that suit individual preferences. Complex as it sounds, commenting on beliefs has its own problems. According to the book Hindu Rites and Rituals by KV Singh, the names 'Lahore' and 'Ichhra' are opposite attributes of two different traditions. It is no surprise that in this age of reason, if that can be said to be true these days, even the matter of age of these two towns are disputed. We all know that Ichhra has a famous temple called Bhairoo ka Asthan and then there was the temp(le of 'Chandrat', which are now the names of 'mohallahs' (precincts) there. Trust our priestly lot to try to rename them, just as they have mixed up the names in the old walled city of Lahore. The deity 'Ichhra' is an avatar of Shiva, and Bhairoo represents one aspect of the avatar, a major contributor to the 'trimurti'. In the Bhagavata-Purana the word 'Icha-Ra' in Sanskrit means 'not the edge of evil'. Surely, this can be misinterpreted. Amazingly in Jewish scriptures it means 'the edge where goodness starts'. I looked up a Sanskrit dictionary and found that there was an Aryan Hun deity by the name of 'Ra', hence it could also mean the 'dwelling of Ra'. But then words can be misleading. In the days before 1947 when Hindus were in a majority, they always - allegedly - considered themselves superior to the followers of 'Loh', the deity son of Rama, an 'avatar' of Vishnu. This 'avatar' is a a major character in the 'Mahabharata' epic. So it was good against the evil of Shiva and his avatars. But trust the priestly Brahmans of the walled city who claimed superiority in terms of caste. The excellent book by Trilochan Sastry titled The Essentials of Hinduism terms this clash of castes as a 'never-ending curse' of sorts. But then priests in every faith tend to set up their own sects, and the collapse of Buddhism is a good example. Now on to a bit of history. Archaeological samples from the Lahore Fort clearly show habitations carbon-dated at 4,200 years ago people living on the mound there. Similar samples from Mohallah Maullian are timed at 3,500 years plus. From the small mound where Ichhra exists no such samples have been taken. But then Lahore has many more mounds than the three of Ichhra. The extent of monsoon flooding determined the use of these mounds, both of Lahore and Ichhra. But then why this dispute over which town is older? Lahore's Lohari Gate, which is the oldest of the city, faces Ichhra. This has been used as an excuse to think that Ichhra was Lahore. 'Lahori Darwaza' is the gateway of the 'lohars', the ironmongers. Inside this gateway existed till very recently a lot of iron furnaces which supplied iron and special metals for military and other uses, just as did the metal of the famous Zamzama cannon come from. But then one just cannot dispute that Ichhra is an ancient Hindu village, a time when Muslims or Sikhs did not exist. A British Gazetteer of Lahore claims that two of the oldest Hindu temples in Western India exist in Ichhra, they are Bheeru da Asthan and Chand Raat temple. According to Maulana Noor Ahmad Chishti's famous book Tehkekat-e-Chisthi, there once lived a man called Godar during the tenure of Shah Jahan, who handled the accounts for Prince Dara Shikoh. On an allegation that he was stealing from Mughal accounts, he was sentenced to death. The story goes that as Godar was waiting to go to the gallows, a man appeared before him. This man asked him to close his eyes. When he opened his eyes, he found himself at the exact location where today the tall, cone-shaped temple stands. He asked the man who was he? The man replied: \"Bheeru\". When Godar winked again, the man was gone. The Sanskrit word for Bheeru means bogeyman. Bheeru is an incarnation of the Lord Shiv-Rudar the Hindu deity of destruction. Godar in his search settled in Shahalami area of Lahore, where he started living near the Pari Mahal. After adjusting in the new city, he one day gathered a few Hindus and took them to the spot. There he narrated to them the story of Bheeru, after which the spot became known as Bheeru da Asthan. Another story needs narration. In the days of Ranjit Singh, the mother of his concubine Moran once fell sick. She was diagnosed as having djinns in 'her'. Moran was informed that one of the descendants of Godar practiced magic, and he would be able to rid the body of the intruders. According to tradition, she summoned him, and he was able to cure her mother. As a reward for his services, Moran ordered all the villages that were granted to her to bring in a cart of bricks each for the construction of a proper temple at the Asthan of Bheeru. During the riots following the Babri mosque incident in Ayodhya, like other temples in Lahore, people tried to bring this temple down too, but since it was made of strong material, it survived. Maybe Bheeru was still at work ... why did the clothes of the leader of the rioters catch fire? Nothing like a myth. But today there is no doubt that Ichhra provides an excellent market for jewellery and clothes and lest we forget, excellent Halwa puris. Published in Dawn, January 12th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}