{
  "article_id": "2025-01-12_1734b5f249174cd72bf5294b55fb68f6",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884605/crypto-trader-picks-out-two-alleged-abductors-before-magistrate-in-karachi",
    "retrieved_at": "2025-08-26T07:37:59.679Z"
  },
  "metadata": {
    "title": "Crypto trader picks out two alleged abductors before magistrate in Karachi - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-12T02:04:36.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI: A crypto trader, who was kidnapped and released after paying around $340,000 worth of digital coins, rightly picked out two men as those who had abducted him during an identification parade conducted by a judicial magistrate on Saturday. Investigating officer Makhdoom Moinuddin brought the two suspects - Mohammed Rizwan Shah and Tariq Hasan Shah - said to be private persons, before Judicial Magistrate (West) Hasnain Gul, who conducted the identification parade after completing legal formalities. The suspects were lined up along with dummies and the complainant rightly picked them out. He assigned Rizwan's role and said that he had threatened him with dire consequences. The victim also picked out Tariq Shah and told the magistrate that he had interrogated him during captivity. A couple of days ago, two constables of the Counter Terrorism Department (CTD) among eight suspects were booked and arrested for their alleged involvement in the kidnapping of the trader and releasing him after he transferred the ransom into their digital wallets. Earlier, an anti-terrorism court (ATC) had remanded the eight suspects in police custody as the IO informed the court that their absconding accomplices -Hamad, Zaman, Muzamil, Ali Raza, Rasheed Lodhi, and others - had yet to be arrested. A case was registered at the Manghopir police station against eight suspects under Sections 365-A (kidnapping or abducting for extorting property, valuable security) and 34 (common intention) of the Pakistan Penal Code read with Section 7 of the Anti-Terrorism Act of 1997. Published in Dawn, January 12th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}