{
  "article_id": "2025-01-12_0948e374854cac796f8c756ecf90322b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884701/firefighters-race-to-beat-la-blazes-as-winds-grow-and-death-toll-hits-16",
    "retrieved_at": "2025-08-26T07:37:56.887Z"
  },
  "metadata": {
    "title": "Firefighters race to beat LA blazes as winds grow and death toll hits 16 - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-12T07:17:29.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/12121024719340f.jpg",
    "categories": [],
    "word_count": 761,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Firefighters fought on into the night on Saturday in a bid to get on top of massive wildfires around Los Angeles as winds ramped up, pushing the blazes towards previously untouched neighborhoods. At least 16 people were now confirmed dead from fires that have ripped through the city, leaving communities in ruins and testing the mettle of thousands of firefighters - and millions of California residents. Despite heroic efforts, including precision sorties from aerial crews, the Palisades Fire continued to grow on Saturday, pushing east towards the priceless collections of the Getty Center art museum and north to the densely populated San Fernando Valley. \"We're a nervous wreck,\" Sarah Cohen told the Los Angeles Times of the threat to her Tarzana home. \"Every time they drop water, it gets better. But then it gets worse again.\" Footage from the Mandeville Canyon area showed one home consumed, with a wall of flame licking up a hillside to menace others. A brief lull in the wind was rapidly giving way to gusts that forecasters warned would feed the blazes for days to come. \"Critical fire-weather conditions will unfortunately ramp up again today for southern California and last through at least early next week,\" the National Weather Service said. \"This may lead to the spread of ongoing fires as well as the development of new ones.\" The Palisades fire was 11 per cent contained on Saturday but had grown to 23,600 acres, while the Eaton Fire was at 14,000 acres and 15pc contained. Official figures show more than 12,000 structures burned, but Cal Fire's Todd Hopkins said not all were homes, and the number would also include outbuildings, recreational vehicles and sheds. The sudden rush of people needing somewhere new to live in the months ahead looked set to make life hard for already-squeezed renters in the city. \"I'm back on the market with tens of thousands of people,\" said a man who gave his name as Brian, whose rent-controlled apartment has burned. \"That doesn't bode well.\" With reports of looting and a nighttime curfew in place, police and National Guard have mounted checkpoints to prevent people getting into the disaster zones. But that has left residents frustrated as they queue for up to 10 hours to try to get back in and see what, if anything, is left of their homes. One woman, who gave her name as Janelle, told broadcaster KTLA she knew her house was gone, but she needed \"closure.\" \"I see the photos, I see the videos, and I just want to see it with my own eyes,\" she said, her voice breaking. The long queues left some people fuming about poor management, the latest gripe from a population already angry over hydrants that ran dry in the initial firefight. City officials put on a united front on Saturday after reports of a behind-the-scenes row and suggestions that Mayor Karen Bass had sacked her fire chief. \"As you see here, the chief and I are lockstep in our number one mission, and that mission is to get us past this emergency,\" Bass told reporters. An at-times tense joint press conference came after Chief Kristin Crowley complained her fire department was short of cash. Among those known to have died in the tragedy was former Australian child star Rory Sykes, who appeared in British TV show \"Kiddy Kapers\" in the 1990s. \"It is with great sadness that I have to announce the death of my beautiful son [Rory Sykes] to the Malibu fires yesterday. I'm totally heart broken,\" his mother Shelley Sykes wrote on social media. Teams with cadaver dogs were combing through the rubble, with several people known to be missing and fears that the death toll will grow. A huge investigation was underway to determine what caused the blazes, involving the FBI and the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), along with local authorities, Los Angeles County Sheriff Robert Luna said. \"We are not going to leave any rock unturned,\" he said. \"If this is a criminal act - I'm not saying it's going to be - if it is, we need to hold whoever did this, or groups responsible,\" Luna added, appealing for anyone who had information to come forward. While the ignition of a wildfire can be deliberate, they are often natural, and a vital part of an environment's life cycle. But urban sprawl puts people more frequently in harm's way, and the changing climate - supercharged by humanity's unchecked use of fossil fuels - is exacerbating the conditions that give rise to destructive blazes.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}