{
  "article_id": "2025-01-12_0f92ccfb2df33b46800c1a633b9fe0a8",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884670/two-sides-of-the-social-media-coin",
    "retrieved_at": "2025-08-26T07:37:57.224Z"
  },
  "metadata": {
    "title": "Two sides of the social media coin - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-12T02:05:17.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678322651868d.jpg",
    "categories": [],
    "word_count": 1032,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "WITH social media platforms running amok without much regulation or oversight, the hybrid Pakistani government and those considered established democracies in Europe, such as the United Kingdom and Germany, seem to be sailing in the same boat. When Elon Musk bought Twitter for some $44 billion, nearly all market and media analysts thought he'd paid way more than the platform was worth. Many believed the world's wealthiest man, a narcissist, had been led to a disaster by his ego. They also believed that Twitter, that he renamed X, would prove to be his Waterloo. Financed largely through banks, it is too early to say whether it does indeed turn out to be a financial fiasco in the long run, because its revenue streams would never be able to justify the price he paid for it. For now, however, the platform has bestowed him the sort of reach, even power, he could not have dreamt of despite his staggering wealth. After having donated a $100 million to the Trump campaign, being by the president-elect's side during the run-up to the elections, and now named to a senior government role, Elon Musk's wealth and political power have grown. Where the Pakistan hybrid set-up's near-total control of traditional media platforms, from TV/radio to newspapers, has meant compliance and the dissemination of a view favourable to it, it has had to turn off the tap completely in terms of social media because of its inability to influence/control the dominant narrative there. Musk raised a red herring often used by the far right in the UK to support Islamophobic, racist Tommy Robinson. The hybrid set-up not just has most traditional media groups on their knees, it also has a monopoly over coercive tools, with armed state institutions/organisations at its beck and call. In the opposite corner, the PTI (mainly its leader Imran Khan) continues to hold sway over public opinion and consolidates its considerable support base in the country via its unrivalled ascendancy over social media and the latter's narrative-building tools. The Pakistani state, or more accurately, its hybrid government, has appeared helpless in countering the PTI narrative, which continues to find resonance among large chunks of the country (to those who will ask how I reached the 'large chunks' conclusion, I would point to the last election, where the party emerged with most seats, despite unfavourable headwinds of all sorts). It has lacked knowledge of social media, sophistication and expertise in evolving a policy where it is not always the case of using a sledgehammer - authoritarian means - to block out views not favourable to it or in line with its desires. It could do well to look elsewhere. Two recent issues that Elon Musk raised on X with his over 200m followers are a prime example of how to stay ahead on social media despite your mistakes. Elon Musk took on the core of the hard right of the dominant pro-Trump Republican Party, which is vehemently anti-immigration, by supporting (fast-track) 'H-1B' visas for specialists/experts so 'they could contribute to the US economy'. While Musk made sense in this case, the backlash was severe. One can be sure Trump transition team members may have had a quiet word with him. Musk's response, which could well have owed itself to his media team, raised a controversial issue away from the States and successfully drew attention away from what many hardcore Republicans saw as an outrageous stance. Musk raised a red herring often used by the far right in the UK to support Islamophobic, racist Tommy Robinson, currently imprisoned on contempt of court charges. Musk implied that many British-Pakistani Asian gangs involved in grooming underage (child) girls for sex were not prosecuted because of considerations for their ethnicity and because Pakistani-origin Britons were a voting bloc for Labour. He also implied that this happened under the current Prime Minister, Sir Keir Starmer's, watch when the latter was director of public prosecutions for five years from 2008 to 2013. Historically, some prosecutions did not happen when Starmer was DPP because the police and local prosecutors believed there was insufficient evidence and 'unreliable witnesses'. However, these decisions not to prosecute were overturned by Nazir Afzal, himself of Pakistani origin, chief prosecutor for Northwest of England, appointed by Starmer in 2011. Afzal has a sterling record of prosecuting these gangs and of earning record convictions and sentencing. A national inquiry report (called the Jay Report) in 2014, after a 2012 The Times investigation into the child sex grooming scandal in Rotherham in northwest England, and later a (parliamentary) Commons Home Affairs Committee, did not point the finger at Starmer. In fact, the Home Affairs Committee lauded his efforts to address the issue in these words: Mr Starmer has striven to improve the treatment of victims of sexual assault within the criminal justice system throughout his term as Director of Public Prosecution (DPP). In 2014, he was knighted for his \"services to law and criminal justice.\" None of this was acknowledged by Musk who, bizarrely, asked the king to dissolve parliament and order fresh elections. Under which law and why, one may have asked Musk, given the opportunity. But his purpose was served. By creating this huge controversy, his vocal support for H-1B visas and the Republican backlash was quickly brushed under the carpet. Not content with taking sides in UK politics, where the opportunistic Conservatives, who did nothing to implement the Jay Report's 22 recommendations for all their years in office, jumped on the bandwagon and raised it in the Commons, Musk expanded his political role elsewhere in Europe. Openly siding with the German anti-immigrant, anti-Muslim and Eurosceptic far-right AFD party and its leader, Musk has forced some European leaders to call for examining social media regulations so an individual can't manipulate public opinions and undermine the democratic order. But I seriously doubt such legislation will ever be passed. In the end, it will have to be social media managers with their expertise in new, even evolving, platforms who can help keep the narrative onside. Or the democratic architecture as we know it is doomed. The writer is a former editor of Dawn. abbas.nasir@hotmail.com Published in Dawn, January 12th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}