{
  "article_id": "2025-01-12_416bf32e881cdbf6457d9ca36f4a05d3",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884578/kp-govt-pours-rs100bn-into-free-healthcare-since-2016",
    "retrieved_at": "2025-08-26T07:37:57.350Z"
  },
  "metadata": {
    "title": "KP govt pours Rs100bn into free healthcare since 2016 - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-12T02:05:06.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 614,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "PESHAWAR: The Khyber Pakhtunkhwa health department has spent around Rs100 billion on the provision of free healthcare under the Sehat Card Plus programme to 3.89 million patients since its launch in 2016. Beneficiaries of the health insurance scheme included 2.09 million (53.07pc) women, 1.79 million (46.03pc) men and 17 transgender persons, according to an official report. According to it, private hospitals earned Rs54.32 billion and public hospitals Rs44.66 billion from the SCP, with the former receiving 2.05 million patients and the latter 4.12 million. Under the programme, 0.26 million (6.6pc of the total) patients aged 1-10 years, 0.36 million (9.3pc) aged 10-20 years, 0.64 million (16.4pc) from 20 to 30, 0.68 million (17.4pc) aged 30-40 years, 0.53 million (13.5pc) aged 40-50, 0.54 million (13.9pc) aged 50-60 years, 0.5 million (12.9pc) aged 60-70 years, 0.31 million (8pc) aged 70-80, 73,930 (1.9pc) aged 80-90 years and 9,609 (0.2pc) aged 90 and above. 53pc of Sehat Card beneficiaries are women, says health dept report The report said the cost of treatment for women was recorded at Rs50.06 billion (51pc of the total), slightly more than men's Rs48.92 billion (49pc). The report said the Lady Reading Hospital Peshawar treated 186,657 patients (4.8pc of the total) and earned Rs6.71 billion (6.8pc), while the Peshawar Institute of Cardiology offered treatment to 55,629 patients (1.4pc) and generated Rs6.023 billion (6.1pc). The Hayatabad Medical Complex received 0.12 million patients (3pc of the total) and earned Rs5.19 billion (5.2pc), Institute of Radiotherapy and Nuclear Medicine 81,607 patients (2.1pc) and Rs3.36 billion revenue (3.4pc), Ayub Teaching Hospital Abbottabad 171,680 patients (3.4pc) and Rs3.3 billion income (3.3pc), and Khyber Teaching Hospital 111,088 patients (2.9pc) and Rs2.49 billion revenue (2.5pc). The report also revealed that Rs22.65 billion was spent on 192,089 cardiology patients, Rs11.77 billion on 557,551 general patients, Rs11.03 on gynaecology patients, Rs7.06 billion on medical cases, Rs6.57 billion on oncology patients, Rs4.94 billion on orthopedic cases and Rs4.85 billion on 49,567 neurosurgery patients. Most patients (410,471) were treated in Peshawar's public and private hospitals. They made up 10.55pc of the total patients treated under the SCP programme since its launch by the PTI government in 2016, according to the report. All districts, except a few without well-equipped hospitals, received more than 0.1 million patients. The report revealed that private hospitals, which had attracted bulk of the amount from the health insurance programme since 2023, recorded a decline last year as the government restricted them from carrying out most common procedures to benefit public hospitals. It added that patients continued to visit government hospitals for appendectomy, cholecystectomy, caesarean delivery, tonsillectomy, cataract, angiography and septoplasty and SMR after restrictions by government on private hospitals. The restriction was meant to check misuse of the programme by private hospitals, which were found to be performing unnecessary procedures to increase earnings. The government encouraged its hospitals to implement a revenue-sharing formula and thus, encouraging staff members to take a greater interest in SCP patients. Now, the Lady Reading Hospital, the largest public sector health centre in the province, is admitting all SCP patients to generate better revenue, while the district level hospitals are upgrading their services to attract more visitors and generate income to benefit employees and patients. The patients receive free services, while hospital doctors, nurses and paramedics get share in the income from SCP cases. The report said of the total 0.8767 million patients from last year, the private hospitals received 0.24964 million (28pc) and the private hospitals 0.627 million (72pc). The private hospitals received 99pc patients in 2016, 76pc in 2017, 65pc in 2018, 72pc in 2019, 81pc in 2020, 68pc in 2021, 60pc in 2022 and 52pc in 2023. Published in Dawn, January 12th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}