{
  "article_id": "2025-01-05_0ee88010b598b770fee01126c41eb77b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kashmiris-observing-self-determination-day-with-renewed-resolve/",
    "retrieved_at": "2025-08-27T11:23:38.388Z"
  },
  "metadata": {
    "title": "Kashmiris observing Self-determination Day with renewed resolve",
    "author": null,
    "date_published": "2025-01-05T07:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 208,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 5 (APP):Kashmiris on both sides of the Line of Control (LoC) and across the globe are observing January 5 as the Right to Self-Determination Day, pledging to continue their struggle for freedom through a plebiscite as guaranteed by the United Nations. According to Kashmir Media Service on Sunday, the observance commemorates the United Nations Security Council resolution passed on this day in 1949, affirming the Kashmiris' right to decide their future through a UN-sponsored plebiscite. Events including rallies, seminars, and conferences are being held worldwide to remind the UN of its responsibility to implement its resolutions and alleviate the suffering of Kashmiris enduring Indian oppression for decades. The All Parties Hurriyat Conference (APHC) has urged the global community, particularly the United Nations, to fulfill its promise to allow the Kashmiri people to exercise their inalienable right to self-determination. The statement highlights the worsening situation in Indian illegally occupied Jammu and Kashmir (IIOJ&K), where the BJP-led Indian regime has intensified state terrorism since August 5, 2019. Arbitrary arrests, economic hardships, and denial of basic rights have plunged the region into despair. The APHC appealed to the international community to halt the ongoing genocide of Kashmiris and press India to resolve the dispute in accordance with UN resolutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}