{
  "title": "West to equip Ukraine with 30,000 drones - World - DAWN.COM",
  "author": null,
  "content": "LONDON: An international coalition to procure unmanned aerial vehicles (UAVs) for Ukraine, co-led by the UK and Latvia, will send 30,000 newly-ordered drones to Kyiv, Britain’s Ministry of Defence said on Thursday.\n\nThe “drone capability coalition” — formed in early 2024 to deliver devices to Ukraine — has placed an order worth 45 million ($55m) for the UAVs, the ministry noted. It did not detail when the drones would be dispatched to Kyiv.\n\nFunding for the 30,000 new UAVs via the coalition comes from the UK, Denmark, the Netherlands, Latvia and Sweden.\n\nBritish Defence Secretary John Healey announced the order as he visited Germany’s Ramstein Air Base for a meeting of Ukraine’s allies, where he also held talks with outgoing US counterpart Lloyd Austin. “The fierce courage of the Ukrainian people continues to inspire the world,” Healey said in remarks released by his ministry.\n\nRussia battles blaze from drone strike for second day\n\nUS Defense Secretary Lloyd Austin — who launched the Ramstein format shortly after the war started — also announced new military aid worth $500 million for Kyiv.\n\n“This meeting of more than 50 nations sends a clear message to (Russian President Vladimir) Putin about the international community’s unwavering support for Ukraine.” London said the new drones would be “state-of-the-art, first-person view” UAVs that would “help Ukraine fight against Russian aggression”.\n\nIt added they will allow Ukraine’s armed forces “to manoeuvre past Russian air defences to target enemy positions and armoured vehicles”.\n\nOn the other side, Russian firefighters battled for a second day to put out a blaze caused by a Ukrainian drone strike on an oil depot. Kyiv hit the depot in the city of Engels, some 500 kilometres from the two countries’ border, in Russia’s southern Saratov region on Wednesday.\n\nMoscow has said that two fire firefighters died trying to extinguish the blaze. Hours after the drone strike, Russia bombed the Ukrainian city of Zaporizhzhia, killing at least 13 people and wounding more than 100.\n\n“Emergency services are continuing to put out the consequences of the drone attack,” Saratov governor Roman Busargin said on Telegram. “Specialists say that it will take some time to complete the burnout process,” he added. Busargin said there was “no threat” to residential buildings.\n\nTrump’s return opens ‘new chapter’\n\nUkrainian President Volodymyr Zelensky on Thursday said Donald Trump’s return to the White House would open “a new chapter” and reiterated a call for Western allies to send troops to help “force Russia to peace”.\n\nZelensky spoke at a meeting of about 50 allies at the US air base Ramstein in Germany, the last such gathering before Trump takes office on Jan 20, casting doubt on future American support for Kyiv.\n\n“It’s clear that a new chapter starts for Europe and the entire world — just 11 days from now, a time when we have to cooperate even more, rely on one another even more, and achieve even greater results together,” said Zelensky. “I see this as a time of opportunities,” he added.\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:35:16.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884236/west-to-equip-ukraine-with-30000-drones",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T02:30:11.000Z"
}
