{
  "title": "PSX loses 1,510 points as panic-selling continues - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Bears further tightened their grip on the Pakistan Stock Exchange (PSX) as equity prices fell like ninepins for the fourth successive session on Thursday, dragging the KSE-100 index below the 113,000 level as nervous investors continued offloading their holdings amid growing political and economic tensions.\n\nAhsan Mehanti of Arif Habib Corporation said selling pressure was witnessed across the board amid concerns over the outcome of government-PTI talks and the bar on non-filer PSX investors under new tax amendments.\n\nHe attributed the downturn to political uncertainty, concerns over cautious monetary policy easing and uncertainty over the outcome of slippages on IMF tax collection targets.\n\nTopline Securities Ltd said the KSE-100 index closed at 112,638, down by 1,510 points or 1.32 per cent day-on-day. The market experienced notable volatility, reaching a peak of 114,330 and a low of 112,595, reflecting uncertainty in the cement and gas sectors affecting sentiment.\n\nThe drop in the index was mainly driven by Engro Holding, Mari Petroleum, Meezan Bank, Lucky Cement, and Engro Fertiliser, which took away 615 points.\n\nAli Najib, Head of Sales at Insight Securities, said investors’ sentiment was crumbling like a cookie as they aggressively trimmed their trading positions, which compelled the benchmark index to fall through two barriers in a single session. “It looks like the market reins is completely in the hands of bears,” he remarked.\n\nRising uncertainties on the political landscape, the absence of any positive trigger and continuous foreign selling can be attributed to the market’s bearish spell.\n\n“Investors are keeping a vigilant eye on the statements coming from the newly elected US administration regarding the arrested Pakistan’s opposition leader. Any development favouring him could likely have a potential to destabilise the prevailing ruling equation and their policies,” Mr Najib noted.\n\nThe market volume tumbled 36.80pc to 695.14 million shares while the trading value slipped 25.17pc to Rs24.29bn shares day-on-day.\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67808456cfd8e.gif",
  "retrievedAt": "2025-10-12T00:47:17.854Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884235/psx-loses-1510-points-as-panic-selling-continues",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T02:22:32.000Z"
}
