{
  "title": "Judicial Commission of Pakistan to appoint judges to SHC on 23rd - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Judicial Commission of Pakistan (JCP) will consider 46 nominations for appointment as additional judges to the Sindh High Court (SHC) at its meeting slated for Jan 23.\n\nA letter issued by the commission’s secretariat asked the JCP members to furnish the curriculum vitae of nominees with necessary documents through their email IDs along with the letter.\n\nAny member whose nominations have not been included or wrongly excluded may inform the secretariat within two days of the receipt of the letter.\n\nThe JCP had on Dec 24, sought nominations for an aggregate of 38 vacancies in different high courts, of which 12 recommendations were for the SHC, four for the Islamabad High Court, 10 for the Lahore High Court, nine for the Peshawar High Court and three for the Balochistan High Court.\n\nThe nominations were sought by the JCP soon after approving rules for the appointment of judges to the superior judiciary.\n\nThe list contains the names of both senior advocates as well as district and sessions judges (DSJs) like Ali Haider Ada, Nisar Ahmed Bhanbhro, Riazat Ali Sahar, Miran Muhammad Shah, Raja Jawad Ali Sahar, Suresh Kumar, DSJ; Khalid Hussain Shahani, DSJ; Obaid-ur-Rahman Khan, Rafiq Ahmed Kalwar, Umai­mah Anwar Khan, Muhammad Osman Ali Hadi, Muhammad Umer Lakhani, Mansoor Ali Ghanghro, Muhammad Zees­han Abdullah, Muhammad Jaffer Raza, Zulfiqar Ali Solangi, Haq Nawaz Talpur, Abdul Hamid Bhurgri, Dr Syed Fiazul Hassan Shah, Mohsin Kadir Shahwani, Qazi Muhammad Bashir, Sandeep Melani, Muhammad Hasan (Akber), Sayed Yasir Ahmed Shah, Mushtaque Ahmed Lagharl, DSJ; lmdad Ali Unar, Chaudhry Atif Rafaq, Muhammad Jamshaid Malik, lrfan Mir Halepota, Tasneem Sultana, DSJ; Jan Ali Junejo, Wali Muhammad Khosa, Fayyaz Ahmed Samor, Altaf Hussain, Ghulam Mohiudin, Rashid Mustafa, Isharat Zahid Alavi, Syed Tarique Ahmed Shah, Saqhir Ahmed Abbasi, Wazir Hussain Khosa, Parkash Kumar, Muhammad Zeeshan Adhi, Munawar Sultana, Rehan Aziz Malik, Ameer Ali Mahessar and Shazia Hanjra.\n\nOn Dec 21, the JCP had approved with certain amendments the proposed JCP (Appointment of Judges) Rules 2024.\n\nChief Justice of Pakistan Yahya Afridi, who is chairman of the JCP, had presided over two consecutive sessions of the commission, which following which, the rules were approved.\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:47:31.317Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884217/judicial-commission-of-pakistan-to-appoint-judges-to-shc-on-23rd",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T02:16:46.000Z"
}
