{
  "title": "Khuzdar rampage - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE two most lethal terrorist threats that confront Pakistan are religiously inspired militants, led by the banned TTP, and separatist elements in Balochistan, particularly the proscribed BLA. On Wednesday, the latter showed that it is capable of unleashing major havoc, with the state unable to mount a matching response. In a brazen attack, BLA militants rampaged through the Zehri area of Khuzdar district, pillaging at will.\n\nAccording to reports, a band of at least 80 militants descended from the nearby mountains and proceeded to destroy government buildings, along with looting a private bank. They also managed to take local Levies personnel hostage. The Kalat commissioner says the episode lasted for nearly eight hours.\n\nThankfully, no loss of life was reported. The episode bears a resemblance to the coordinated assault last August, also carried out by the BLA, in which the terrorist group attacked security personnel as well as civilians, resulting in over 70 fatalities.\n\nThe first thing that strikes one about the Khuzdar attack is the delayed response of the security forces. Those responsible must explain how terrorists were able to commandeer the area for eight hours. The episode unfortunately shows that the state is unprepared to tackle such situations. When a major mass-casualty attack was launched last year, the relevant quarters should have prepared accordingly to prevent a similar situation. Clearly, this was not done.\n\nIndependent experts are of the view that the BLA has become the single biggest security threat in Balochistan. Its attacks have displayed increasing sophistication, indicating its fighters are receiving proper training. It has also launched terrorist assaults as far afield as Karachi. Therefore, the security establishment, the centre and the Balochistan government must take relevant countermeasures to safeguard the lives and properties of the province’s people.\n\nCounterterrorism strategies should be adapted to match the nature of the threat. It is not enough to say that separatist forces are receiving external help. Such links should be exposed with proof, while the required action must be taken domestically to prevent terrorists from establishing safe havens on Balochistan’s soil. Kinetic measures should be accompanied by socioeconomic steps to address the province’s backwardness, while the democratic process must be allowed to proceed unhindered. As per World Bank figures, the poverty rate in Khuzdar is over 71pc. It is such misery and neglect that militants exploit.\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:47:46.966Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884214",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T02:07:56.000Z"
}
