{
  "title": "Bike patrol to prevent theft of fences along country’s motorways - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Taking action against increasing incidents of cutting and up­­rooting of steel fences alongside motorways, Fe­­d­eral Minister for Com­m­u­ni­ca­tions Abdul Aleem Khan on Thursday dir­ec­ted the authorities conce­rned to start a pilot mot­o­rbike service aimed at en­­hancing security and su­­­­r­veillance on motorways.\n\nPresiding over a meeting, the minister said in the first phase, the motorway police have been instructed to use existing resources to kick-start the service, with plans for expansion in the future.\n\nHe directed the motorway police to use 30 to 35 motorbikes for patrolling in the initial phase to improve response times and boost security measures in different sectors.\n\nMr Khan stressed the need for importance of collaborative efforts, urging the National Highway Authority, Motorway Police, Frontier Works Organisation, and district police to work jointly to ensure the success of the initiative.\n\n“Motorway police must take maximum responsibility for ensuring the safety of citizens while a robust mechanism should be developed to make Mo­­­torway travel as secu­­re as possible,” he said.\n\nWhen contacted, a senior official of the NHA told Dawn that the minister took action regarding security of motorways after increasing complaints about crimes and car theft incidents were reported due to cutting and uprooting of the fence on the motorways.\n\nHe said the minister was apprised that the incidents of cutting of motorway fences increased during smog season in Punjab and others parts of the country.\n\nThe official said that a separate project has also been launched to repair the fences across the country. “The project was launched a couple of weeks ago and almost 70 per cent work has been completed,” he claimed.\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:11:24.584Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884220/bike-patrol-to-prevent-theft-of-fences-along-countrys-motorways",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T02:16:46.000Z"
}
