{
  "title": "The talented Mr Musk - World - DAWN.COM",
  "author": null,
  "content": "ELON Musk’s journey from a precocious kid to the world’s richest man makes for an interesting biopic. From Space X to Tesla, from PayPal to the social media platform X, he seems to have done it all, and more.\n\nMusk is now all set to become the head of the new Department of Government Efficiency, or DOGE, with sweeping powers to reduce the size of the US state to the tune of almost $2 trillion, from a federal budget of roughly $7tr. Musk will also play a giant role in guiding future policy, especially on artificial intelligence and cryptocurrency, as one of his key allies has now been named ‘AI and crypto czar’.\n\nThis new Trump-Musk alliance is a coming together of political and economic power.\n\nMusk’s most recent incarnation as ‘first buddy’, or the US president’s close political and business adviser, is ostensibly due to the role he played in Trump’s electoral success by putting his own money on the line. Musk’s outsized influence in the incoming administration has prompted some to refer to him pejoratively as ‘President Musk’.\n\nGiven Musk’s formidable role in the incoming administration, let’s examine some important questions. Why has Musk got the state between his crosshairs? Is Musk trying to fashion the US according to his worldview? Does Musk’s rise bode well for US democracy? Will Musk be successful in implementing his agenda?\n\nThis new Trump-Musk alliance is a coming together of political and economic power.\n\nIn Exterminate All the Brutes, Sven Lindqvist, the late Swedish author, skillfully detailed the evolution of various ideas regarding European racial superiority. No other nation incorporated the ideas of European racial superiority like South Africa, where apartheid, a system of institutionalised racial segregation, ensured the white minority’s social, economic and political chokehold.\n\nPost-apartheid, however, the state quickly transformed into a symbol of oppression for the white minority. The white minority’s distrust of the state became so deep that they dismantled an active nuclear weapons programme before transferring power to the Africans.\n\nMusk and some of the other prominent voices in Trump’s ‘Make America Great Again’, or MAGA, movement — white tech-entrepreneurs like Peter Thiel, PayPal’s co-founder — spent formative years in apartheid South Africa. Perhaps this is one reason why tech-entrepreneurs like Musk show ‘libertarian’ tendencies that reflect unhinged antipathy towards the state and bureaucracy.\n\nGiven Musk’s penchant for technology, his views should more appropriately be described as ‘techno-libertarian’ or ‘extropian’. Extropians believe that order can spontaneously emerge in political systems, meaning that, left to themselves, all political systems will inevitably achieve equilibrium, rendering the state and bureaucracy superfluous.\n\nTechno-libertarians repose a Panglossian confidence in the power of technology and AI for solving all intractable problems facing humanity, provided that tech entrepreneurs can be freed from the “mountain of smothering [state] regulations”. This explains Musk’s steely determination to colonise Mars in case our planet becomes uninhabitable due to climate change or nuclear war.\n\nIn other words, techno-libertarians see modern states as constraints and argue that limitless economic growth can only be brought about within unregulated or competitive markets through technology and AI.\n\nIn reality, any techno-libertarian plan that promises economic growth by reducing the size of the state in favour of competitive markets is ultimately only a worldview. Often, such plans are an extension of Darwinian thinking like ‘natural selection’, whereby nature favours competition by ensuring the ‘survival of the fittest’. It should thus not come as a surprise that one of the main targets of the new DOGE under Musk are social welfare programmes like Medicaid, Social Security, and Medicare; people need to either sink or swim.\n\nMusk not only contributed massively to the Trump campaign — $277 million — but also tirelessly used his social platform X to enhance Trump’s electoral fortunes. Musk’s resulting influence within the new administration, or an apparent quid pro quoarrangement, does not bode well for US democracy and its system of checks and balances, especially as techno-libertarians plan to cut the state and its regulating ability down to size.\n\nIn the future, as the state and bureaucracy are forced to wither away, private corporations may go to any lengths to influence the political process. We may see private corporations become official sponsors behind different political parties, just like they sponsor different sports teams, so that their corporate offerings like ‘Robocop’ or ‘Judge Dredd’ are selected to dispense justice.\n\nThe notorious US prison-industrial complex, or private prisons that generate an annual profit of $4bn, is already eyeing new future opportunities in the coming crackdown against illegal immigrants.\n\nStill, Musk’s techno-libertarian mission is going be a tall order for two main reasons. First, Musk is going to have to walk a fine line as where Musk is seeking a small state, the Trump administration is getting ready to further enlarge the state’s ambit through tariffs and subsidies for the upcoming trade war against the rest of the world.\n\nThe second reason has to do with Musk’s apparent pro-China tilt. China is Tesla’s biggest market outside the US, while Musk also enjoys access to top Chinese leaders. In April this year, Musk had a one-on-one meeting with Premier Li Qiang. As the rivalry between US and China gets more intense, as evidenced by Trump populating his administration with known China hawks, the odds of Musk’s success do not appear very high.\n\nIn sum, as the talented Mr Musk goes to Washington, techno-libertarians are celebrating his new alliance with Donald Trump. But real dangers churn underneath the seemingly placid waters. If Musk is actually able to reduce the state’s size, private corporations will gain more political influence. This is not good news for US democracy.\n\nStill, Musk may not be able to get very far, as he might be singled out due to his Chinese connections, especially as the US becomes more and more obsessed with containing China.\n\nThe writer completed his doctorate in economics on a Fulbright scholarship.\n\naqdas.afzal@gmail.com\n\nX*: @AqdasAfzal*\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6780806724a1b.jpg",
  "retrievedAt": "2025-08-26T07:35:32.935Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884212/the-talented-mr-musk",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T02:06:40.000Z"
}
