{
  "title": "New underpass to link Murree Road with Srinagar Highway - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: City managers on Thursday decided to construct an underpass on Murree Road to give motorists coming from Murree side direct access to Srinagar Highway.\n\nCurrently, the civic agency is constructing two underpasses on Srinagar Highway as part of the Serena Interchange project. One of the underpasses would be useless as traffic coming from Murree side could not have direct access to enter Srinagar Highway.\n\nResidents of Murree and other adjoining areas have been demanding the CDA construct another underpass on Murree Road for smooth entry to Srinagar Highway.\n\nCurrently, motorists have to go to Dhokri roundabout to take a turn to enter Srinagar Highway, and often face traffic mess at the junction.\n\nHowever, CDA Chairman Mohammad Ali Randhawa recently directed the consultant to come up with a solution to the issue. The consultant has proposed construction of an underpass on Murree Road.\n\nMeanwhile, the CDA chairman on Thursday visited the Murree Road-Srinagar Highway junction to review the proposed solution to the issue.\n\n“During the visit, a proposal to construct an underpass at the Srinagar Highway junction was discussed, keeping in view the pressing traffic issue,” says a press release issued by the CDA.\n\nThe CDA chief directed that the proposed underpass at the junction of the two busy roads should be integrated with the Serena Chowk Interchange project for enhanced connectivity.\n\nDuring a briefing, the CDA chief was informed that the soil testing for the construction of the underpass had already commenced. Additionally, work on the feasibility, design, and planning of the project is underway.\n\nMr Randhawa emphasised that the completion of the underpass will offer a long-term solution to Islamabad’s traffic challenges.\n\nHe instructed the relevant teams to present the design of the underpass at the earliest.\n\nFurthermore, he stated that once the underpass is operational, all traffic from Murree to Srinagar Highway will be signal-free.\n\nCDA officials Dawn spoke to said it was yet to be decided if the civic agency would go for a new tender or the underpass would be constructed as part of the ongoing Serena project.\n\n“The underpass project is in design phase, later estimate will be finalised before going for tendering process,” said an official.\n\nWork on the Serena Interchange project continues round-the-clock. The foundation stone of the project worth Rs4.2 billion was laid by Prime Minister Shehbaz Sharif on November 5.\n\nThe project was supposed to be completed in 60 days — on January 5. However, CDA could not complete it in the stipulated timeframe.\n\nUnder the project, three underpasses are being constructed - two on Srinagar Highway and one on Khyaban-i-Suhrawardi. The underpass on Suhrawardi road has been completed and is likely to be opened for traffic on Friday (today). However, sources said work on the two underpasses on Srinagar Highway may take a few more weeks for completion.\n\nPublished in Dawn, January 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:47:46.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884137/new-underpass-to-link-murree-road-with-srinagar-highway",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T01:40:07.000Z"
}
