{
  "title": "May 9 riots: Justice Afghan says military trials ‘similar’ to those in civilian courts - Pakistan - DAWN.COM",
  "author": null,
  "content": "Justice Naeem Akhter Afghan on Friday remarked that trials in a military court were “similar” to those in a civilian court, as a Supreme Court constitutional bench heard a case on military trials of civilians over the May 9, 2023, riots.\n\nThe case pertains to the military trials — and recent sentencing — of civilians for their role in attacks on army installations during the riots that followed ex-premier Imran Khan’s arrest on May 9, 2023.\n\nJustice Afghan’s remarks came as the bench resumed hearing intra-court appeals (ICAs) challenging the Oct 23, 2023 ruling by a five-judge bench that had unanimously declared that trying the accused civilians in military courts violated the Constitution.\n\nThe seven-judge constitutional bench is headed by Justice Aminuddin Khan and also includes Justices Afghan, Jamal Khan Mandokhail, Muhammad Ali Mazhar, Hassan Azhar Rizvi, Musarrat Hilali, and Shahid Bilal Hassan.\n\nIn recent hearings, SC judges have questioned why the accused were “specifically” tried in military courts instead of anti-terrorism courts, with Justice Mandokhail observing that “the executive cannot play the role of judiciary”.\n\nDuring today’s hearing, Advocate Khawaja Haris appeared as the defence ministry’s lawyer and continued his arguments in the case. Additional Attorney General (AAG) Aamir Rehman was present as the state counsel.\n\nJustice Afghan remarked, “There is also the facility to hire a lawyer of one’s choice in a court martial case. The trials in a military court are also similar to ordinary (civilian) courts.”\n\nHowever, Justice Mandokhail wondered whether an “officer presiding over a military court is perfect enough to determine such harsh sentences”.\n\nJustice Hilali also questioned trials in military courts, noting that cases over the May 9 riots were registered under the Anti-Terrorism Act (ATA), rather than the Army Act.\n\nThe hearing was adjourned till January 13 (Monday), when the defence ministry counsel would continue his arguments.\n\nOn December 13, the SC’s constitutional bench conditionally allowed military courts to pronounce reserved verdicts of 85 civilians who were in custody for their alleged involvement in the May 9 riots in 2023.\n\nOn Dec 21, military courts sentenced 25 civilians to prison terms ranging from two to 10 years for their involvement in the attacks. Days later, another 60 civilians were handed jail terms of a similar period over the matter.\n\nOn January 2, the mercy petitions of 19 accused were accepted on humanitarian grounds, while 48 other pleas have been processed to Courts of Appeal.\n\nThe sentencing of civilians by military courts was not only condemned by the PTI, but the United States, the United Kingdom and the European Union also raised concerns, saying the move contradicted international laws.\n\nAt the outset of the hearing, Justice Mandokhail asked the defence counsel to satisfy the court about the trial process in military courts.\n\nJustice Hilali remarked, “An officer who hears the trial in the court does not pronounce the verdict themselves. The officer conducting the trial sends the case to another senior officer who announces the verdict.\n\n“How does an officer who did not hear the case pronounce the decision?” she asked.\n\nStating that despite being in a judicial career for 34 years, he did not consider himself “complete”, Justice Mandokhail questioned: “Does an army officer have enough experience and expertise that a death sentence is handed over?”\n\nHaris, the defence ministry lawyer, replied he would detail the military trial process in the second phase of his arguments.\n\nJustice Mandokhail then noted that there was a difference between the Pakistan Army Act 1952 and “other laws”. “According to the Constitution, all these protect fundamental rights. A reasonable explanation has been given in the law.”\n\nAt this point, Justice Afghan recalled presiding over “many court martial cases” at the Balochistan High Court, prior to his ascension to the SC. Justice Rizvi remarked that there were defence counsels in Field General Court Martial, not judges.\n\nHere, Justice Afghan asked Haris to detail the fundamental rights guaranteed under Article 10-A (right to fair trial) of the Constitution.\n\n“How are the trials being conducted in military courts? What are the stages in it? Tell everything. Everyone is thinking that trials in military courts are not like in civilian courts. Give an example of any trial held in a military court,” he said.\n\nHaris then replied that the Army Act was a “special law”, adding that the “process for [collecting] the evidence and the trial was different” under special laws.\n\nAt this point, Justice Afghan remarked: “There is also the facility to hire a lawyer of one’s choice in a court martial case. The trials in a military court are also similar to ordinary (civilian) courts.”\n\nJustice Rizvi then stated that during his career, he had appeared as the defence counsel in military courts. “Along with a lawyer, an officer is also appointed as a ‘friend’ of the suspect.”\n\nJustice Mandokhail reiterated his question about the expertise of an officer sitting in a military court, asking if they were “perfect enough to determine such harsh sentences”.\n\nHere, Justice Hilali referred to an example given by Haris of military trials being conducted in the United States, asking: “If there was such a trial held in another country, who would be the judge?”\n\nTo this, Justice Mazhar responded, “Officers are the ones who preside over a court martial across the world.” Haris also asserted that the officers were “experienced”.\n\nAt one point, Justice Hilali remarked, “After turning off the airport’s lights, an army chief’s airplane was asked to leave the country. All passengers were put in danger in this incident.”\n\nTo this, the defence ministry counsel replied, “How can a person who was not in the airplane hijack it?” Justice Hilali reiterated that the passengers were put at risk despite there being “a bit of fuel” left in the plane’s engine.\n\nHaris then said he would not speak of “political matters” but it was acknowledged by the SC that there was “ample” fuel available in the engine.\n\n“A martial law was imposed in the country because of this single incident. Even after the martial law, that trial was not conducted in a military court,” Justice Hilali observed.\n\nIn response, Haris contended that hijacking a flight was not mentioned as a crime in the Army Act, which is why the trial for the case was not held in a military court.\n\nJustice Aminuddin then stated that the difference on the particular matter had been clarified now. However, Justice Hilali said, “This leads to another question. If a war or military plane is hijacked, then in which court will the trial be held?”\n\nJustice Mandokhail also remarked, “You (the coalition government) have the majority. You can also insert [charges of] hijacking and [Pakistan Penal Code’s] section 302 (murder) in the Army Act. Who can stop you?”\n\nHere, Justice Hilali observed, “All sections in the FIRs (first information reports) over May 9 were of the Anti-Terrorism Act. I do not know how military trials were then held over these sections.”\n\nDuring the hearing, AAG Rehman told the court that only those suspects were handed over into military custody for whom there was evidence of their presence at the site of the incident. According to him, there were more than 5,000 suspects in total.\n\nThe hearing was then adjourned till January 13 (Monday).",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:35:01.989Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884305/may-9-riots-justice-afghan-says-military-trials-similar-to-those-in-civilian-courts",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T09:04:53.000Z"
}
