{
  "title": "KP Service Tribunal strikes down removal of DG information - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa Service Tribunal has rejected the replacement of the director general (information and public relations) by the provincial government as against the law and rules.\n\nA bench comprising tribunal chairman Barrister Ikhtiar Khan and member (judicial) Rashida Bano accepted an appeal filed by officer Mohammad Imran and set aside a notification issued on Nov 24, 2024, through which he was directed to relinquish the charge of the director general and report to the information and public relations department.\n\nAnother officer, Salim Khan, as the director general, replaced the appellant.\n\nThe tribunal declared that after reviewing the case details and considering the Supreme Court judgements, it was of the opinion that the posting, transfer and tenure of a civil servant must not be handled arbitrarily.\n\nRules department provided no valid justification for the move\n\n“The Khyber Pakhtunkhwa Civil Servants Act of 1973, along with the Provincial Government’s Transfer/Posting Policy, stipulates that the standard tenure of two years should have been followed by the respondent department in managing the appellant’s posting except in exigency of service,” it observed.\n\nThe tribunal declared that the respondents, including the provincial government, didn’t provide any valid justification to support their decision to assign the appellant’s services to the information and public relations directorate and to replace him with a junior officer.\n\nAdvocate Mohammad Furqan Yousafzai appeared for the appellant and said that his client was serving as director information in BPS-19 and was promoted as the DG (information) through a notification on April 9, 2024.\n\nHe said that the post of the DG (information) was in the information cadre in BPS-20 as per Serial No 1 of the Service Rules.\n\n“Through the impugned notification of Nov 22, 2024, the appellant was directed to report to the information department and the respondent No 4 [Saleem Khan] was posted in his place,” he said.\n\nMr Yousafzai argued that just after serving against the DG’s post for seven months, the appellant was transferred, which was a violation of Clause IV of the provincial government’s posting and transfer policy according to which the normal tenure of posting was two years.\n\nHe referred to an apex court judgement and a 1993 government notification, arguing that posting of a junior officer on posts of higher scale was a violation of the rules.\n\nThe lawyer contended that in that case, respondent Saleem Khan was junior to the appellant and was appointed a BPS-20 position.\n\nHe contended that under the KP Civil Servant Act, 1973, and KP Civil Servants (Appointment, Promotion and Transfer) Rules, 1989, there was no concept of posting as an officer on special duty, while appellant had been waiting for posting since Nov 22.\n\nAn additional advocate general and a lawyer for Salim Khan argued that under Section 10 of the Act, a civil servant had no vested right to a particular posting, and the competent authority could transfer any civil servant to serve at a given place as mentioned in posting and transfer order, which the civil servant was bound to comply.\n\nThey argued that there were certain allegations against the appellant and after approval of a summary by the chief minister, the impugned transfer order was issued by the competent authority in the best public interest.\n\nThe tribunal observed that when confronted, the AAG couldn’t provide any cogent reason for placing the services of the appellant at the disposal of the information and public relations department.\n\nIt added that the AAG was further asked to elaborate the appointment of a BPS-19 officer to the BPS-20 post, but he simply responded that it was done in the “best public interest” by the competent authority.\n\nThe tribunal declared that in the department, there was only one BPS-20 post against which the appellant was promoted being eligible, but without any sufficient cause and exigency of service, he was ordered to report to the directorate as an OSD in violation of a 2013 Supreme Court judgement.\n\nIt added that according to the judgement, officers should not be made OSD without compelling reasons and if for any reason an officer was made an OSD, his appointment should be for as short a period as possible.\n\nThe tribunal announced that in the instant case, no such compelling reason was given and by now more than six months had elapsed, but he was still an OSD.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:23:40.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910265/kp-service-tribunal-strikes-down-removal-of-dg-information",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T03:27:10.000Z"
}
