{
  "title": "CRICKET: DETHRONING OF THE SULTANS - Newspaper - DAWN.COM",
  "author": null,
  "content": "Mohammad Rizwan is arguably the most media-savvy active cricketer in Pakistan right now. He knows the art of virality. The zappy Rizwan has a punchy remark for all situations, but that night he was compelled to repeat the very words he had uttered after it became all but certain that Pakistan would not go beyond the group-stage of a home Champions Trophy under his captaincy.\n\n“I do not like to be dependent on the results of the other teams,” the Multan Sultans captain said after Quetta Gladiators condemned his team to the largest defeat in terms of balls remaining in the history of the Pakistan Super League (PSL). They needed to win all the remaining matches and had to hope for other results to go in their favour after Sultans had lost six out of seven matches and had a negative net run rate of 2.355.\n\nTwo days later, Karachi Kings thrashed Multan Sultans by 87 runs. The result effectively eliminated Rizwan’s side — that still had two more matches to play — from the playoffs race with still as many as 10 group matches remaining.\n\nSultans lifted the PSL trophy in 2021 and since have played every final, establishing themselves as a dominant force in the six-team competition. But, the 10th edition of the PSL — in which they have also faced the biggest defeat in terms of runs remaining and have been skittled under 100 for the first time — has tarnished that legacy.\n\nMultan Sultans had played in the finals of the last four seasons of the Pakistan Super League, building a reputation as one of the most consistent sides in league. This season, they became the first team to get knocked out. What went wrong?\n\nEos looks at how it all came crashing down for the Multan Sultans.\n\nAn ‘unfavourable’ schedule\n\nCompetitive advantage plays a significant role in top-flight cricket and, while the PSL is yet to experience the authentic flavour of home and away matches, Multan Sultans have been the lucky side to be afforded proper home advantage.\n\nThe Multan Cricket Stadium — or the ‘Sultans Fort’, as the team refers to it — staged 13 PSL matches before this season. Those games, spread across three seasons (three in 2020 and five each in 2023 and 2024) and played in tandem, provided Sultans a home base, shielding them from travel fatigue and the need to acclimatise to the ever-changing conditions which, frankly, are the most challenging factors that the teams have to brave in such tournaments.\n\nBefore this season, Sultans had a near-perfect record in Multan, as they had won 11 of those 13 games — hence, the ‘Sultans Fort’. This year, however, the Pakistan Cricket Board (PCB) divided the five Multan games into two legs, of two and three matches, with the away games before and after the first leg.\n\nIt irked Multan Sultans and their owner Ali Khan Tareen lamented the schedule in various podcasts before and during the PSL season, as playing all home games on a bounce had contributed significantly to their success in the previous seasons.\n\nAfter starting their last two PSL campaigns with five consecutive matches at home, Sultans played three away games before their first home fixture and arrived at the Multan Cricket Stadium with three losses.\n\nThe respite in the shape of the victory over Lahore Qalandars in the first home game was short-lived as Islamabad United thrashed them in their second home game. Multan Sultans never recovered from that defeat.\n\nGetting the draft wrong\n\nThere are certain cheat codes to developing a squad in franchise cricket and one of them is to have the team’s core based on the local players. This not only guarantees availability of the players throughout the tournament but also brings in the much-desired players who have the experience of the local grounds and conditions.\n\nSultans, however, released Khushdil Shah and Abbas Afridi ahead of the player draft.\n\nWith his middle-order batting firepower and handy contributions with the ball, Khushdil had been one of the core players for the Sultans since 2020. Despite batting for a limited number of balls, the left-handed later order power-hitter’s 658 runs at a strike rate of 142.42 were the sixth most for the franchise since its inception in 2018 and his 23 scalps at 20.83 are the seventh most.\n\nAbbas’ ability to deliver crucial middle and death overs in Sultans colours earned him a spot in the national side. His 37 wickets at 19.46 are the most wickets for a bowler to have played for Multan Sultans after Imran Tahir and Usama Mir.\n\nThe two were placed in the Diamond category after the category renewals in December 2024. The Sultans could have offered the players brand ambassadorship or mentorship to lower their categories, a move that the franchises practise widely to retain their best talent and make sure that the players’ cheques reflect their actual worth.\n\nSultans, instead, gave brand ambassadorship and mentorship to Iftikhar Ahmed, who has fallen out of national selectors’ favour in the twilight of his career, and David Willey, who retired from international cricket after the 2023 World Cup, to slot them in the Diamond Category along with Usman Khan.\n\nCuriously, young left-arm wrist spinner Faisal Akram, one of Sultans’ seven retentions, did not play a single match during the entire time they were mathematically in the playoffs race.\n\nAnd, it does not stop here. They used the ever-crucial ‘right to match’ card on Tayyab Tahir, to snatch him from Lahore Qalandars, only to keep him on the bench. By the completion of the Sultans’ eighth game, Tayyab had warmed the bench in seven matches and did not face a ball in the one match he played.\n\nTrailing in every aspect\n\nMultan Sultans’ squad boasted an assistant coach, dedicated fast and spin bowling coaches, a power-hitting coach, a fielding coach and his assistant, a performance coach (whatever that is), and as many as three analysts under Abdul Rehman, the head coach.\n\nThe team, however, failed in every possible metric. Statistician Kamran Muzaffer provided some brilliant insights for this piece. By the completion of match 22, Sultans had the worst economy of any side in the history of the tournament, as no team had ever leaked runs at 10.61 in an edition. On average, their pacers leaked 10.97 runs an over and their spinners 9.93 in the PSL 10.\n\nThey had the worst net team run rate (calculated by subtracting the batting and bowling run rate) of negative 1.92. Peshawar Zalmi (-0.09) was the only other team with a negative net run rate.\n\nThey also faced way more dot balls than they bowled, as the net dot ball percentage was just a shade under negative four. And they conceded way more boundaries than they hit, reflected by a negative boundary percentage of 6.89. Sultans’ were the worst net dot ball and boundary percentages.\n\nBowling Michael Bracewell in the powerplay backfired heavily as the off-spinner gave away 12.56 runs an over and his two wickets cost Sultans 56.50 runs in the first six overs. The decision was a curious one anyway, as the New Zealander has given almost 10 runs an over and taken just two wickets at a woeful 60.50 in the 12.4 powerplay overs since the start of 2024.\n\nFollowing their eighth game, Rizwan admitted to the host broadcaster that his side had just not been good enough to go beyond the group stage. The ‘Sultan Supremacy’ — built over four years of consistent performances — had been shattered. Rizwan knew it.\n\nThe writer is a former PCB media manager.\nHe can be reached at ahsannagi@gmail.com\n\nPublished in Dawn, EOS, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681fce98dea7a.jpg",
  "retrievedAt": "2025-08-23T08:23:38.082Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910151/cricket-dethroning-of-the-sultans",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:31:19.000Z"
}
