{
  "title": "Italy, Canada and Jamaica sparkle in mixed 4x100m relay’s global debut - Sport - DAWN.COM",
  "author": null,
  "content": "GUANGZHOU: Italy, Canada and Jamaica reached the mixed 4x100 metres relay final in the event’s global debut while heavyweights the United States experienced mixed fortunes on a dramatic opening day at the World Athletics Relays on Saturday.\n\nVictory in 41.15 seconds in the first heat amid challenging conditions in the southern Chinese city of Guangzhou following a spell of rain earned the Italians a place in the medal round to be held on Sunday.\n\nThey will be joined by France, who finished second in 41.28 seconds, while pre-race favourites the US saw their hopes of advancing fade when Jada Mowatt and Kendal Williams botched their baton exchange during the second changeover.\n\nJamaica’s mixed sprint quartet clocked 41.04 seconds to edge out Britain by a hundredth of a second in the next heat and they could deploy three-time Olympic champion Shelly-Ann Fraser-Pryce and former world champion Yohan Blake in the final.\n\nCanada crossed the line in a scorching 40.90 seconds to second-placed Australia’s 41.15 seconds in the third heat to send out a warning to their rivals.\n\nThe Americans made up for their error by easing into the mixed 4x400m final, thereby also sealing their spot in the event at the world championships tin Tokyo in September.\n\nThe world record-holders will be joined in the Guangzhou final by Belgium, Australia, Ireland, Britain and South Africa as well as the two fastest non-automatic qualifiers Kenya and Poland.\n\nSpain went quickest in the women’s 4x100m relay ahead of Jamaica and Belgium, clocking 42.18 seconds, while South Africa dominated the men’s event with Akani Simbine anchoring his team to a joint world leading time of 37.84 seconds.\n\nJapan, who were assured of a place in the worlds as hosts, matched South Africa’s effort in their heat to finish in front of Olympic champions Canada.\n\nThe US women’s team shrugged off the increasingly damp conditions to top the timings in the 4x400m race while the men’s quartet were third in their heat and will have to wait until Sunday to book their spot in the worlds.\n\nSouth Africa’s men were quickest again in that event with a world leading time of exactly three minutes.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68200e2f7aee5.jpg",
  "retrievedAt": "2025-10-12T03:00:22.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910227/italy-canada-and-jamaica-sparkle-in-mixed-4x100m-relays-global-debut",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:39:28.000Z"
}
