{
  "title": "Gurdwara panel leader slams strike near Nankana Sahib - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Punjab Minister for Minority Affairs and Chairman of Pakistan Sikh Gurdwara Prabandhak Committee Sardar Ramesh Singh Arora has strongly condemned the Indian drone attack near the revered Sikh holy site of Nankana Sahib, calling it a blatant violation of international laws, religious freedom, and human rights.\n\nSpeaking at a press conference along with Lahore Press Club (LPC) President Arshad Ansari and prominent Sikh personalities including Sardar Bishan Singh, Satwant Kaur, Sardar Jaskaran Singh, and Kalyan Singh Kalyan, here at LPC on Saturday, the minister decried recent missile attacks on mosques and drone strikes on minority worship places, declaring these actions as part of a wider Indian conspiracy to malign Pakistan’s image and ignite religious tensions in the region.\n\nSardar Arora said that Pakistan could never even imagine of targeting Sikh religious sites, and emphasised that the country’s bond with the Sikh community is founded on sincerity, reverence, and mutual respect.\n\nHe categorically rejected India’s claims regarding fabricated attacks in Pahalgam, Amritsar, or near the Golden Temple, terming them baseless and pre-planned narratives aimed at misleading the global community and stirring interfaith discord.\n\nHe warned that India is attempting to instigate hatred between Muslim and Sikh communities and it is waging psychological warfare against Pakistan. Pakistan’s Sikh community is an integral part of the national fabric, he said.\n\n“We will not allow any foreign element to jeopardise the spirit of brotherhood and interfaith harmony we have nurtured over the decades,” he said.\n\nHe urged the United Nations and international human rights organisations to take immediate notice of India’s aggressive behaviour and repeated violations against religious minorities.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:24:06.379Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910181/gurdwara-panel-leader-slams-strike-near-nankana-sahib",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:33.000Z"
}
