{
  "title": "Pakistan dictates the pause - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Any enduring resolution demands good faith, addressing root causes including Kashmir\n• Ex-NSA says Pakistan has re-established deterrence, stability and balance in region\n\nIn the latest round of hostilities between India and Pakistan, a US-brokered ceasefire has sought to pause what risked spiralling into a catastrophic conflict between the two nuclear-armed neighbours.\n\nBut make no mistake: this was no negotiated compromise between equals in the conflict. Pakistan agreed to the ceasefire after securing a calculated victory by firmly denying a much stronger India the military edge and diplomatic narrative it sought to dominate.\n\nThe crisis began in the wake of the April 22 attack in Pahalgam, which India swiftly blamed on Pakistan-based militants without providing evidence. Islamabad’s call for a neutral investigation was brushed aside. Instead, New Delhi escalated — launching missile and drone strikes into Pakistani territory beginning May 7. The most intense exchanges came on the night of May 9-10, one of the tensest nights in decades, when Indian forces targeted Pakistani military installations, only to face swift and strategic retaliation from Pakistan.\n\nPakistan’s military response during the entire crisis was measured and decisive. Retaliating to India’s Operation Sindoor, Pakistan’s forces on May 7 took down five Indian jets, including advanced Rafales, using Chinese-supplied J-10Cs and PL-15E missiles — an undeniable blow to India’s air superiority pretensions. And then on May 10, in a rare and calculated action, Pakistan neutralised Indian S-400 missile systems using hypersonic missiles fired from JF-17 aircraft. These kills — Rafales and S-400 system — sent a message not only across the border but across the globe.\n\n“This week’s India-Pakistan conflict has marked a turning point, with modern conventional weaponry reshaping the battlefield and expanding the scope for the conventional use of force,” Muhammad Faisal, South Asia research analyst at the University of Technology Sydney, said.\n\nIndia’s ambitions to dominate the escalation ladder — long a cornerstone of its regional strategy — collapsed under the weight of these setbacks. The Rafale and S-400, icons of India’s defence modernisation, became symbols of its miscalculation. For the first time in years, Pakistan demonstrated not just parity but deterrent credibility that undermined India’s claims of military primacy.\n\nFormer national security adviser Gen Nasser Janjua said, “Pakistan has successfully re-established the deterrence, stability and balance in the region. Pakistan has also successfully buried the concept of limited war under a nuclear environment.”\n\nDiplomatically, too, the tide turned. As the spectre of escalation loomed, the United States intervened — not out of favour to one side, but out of alarm. With India’s air force facing serious attrition and risk of deeper military degradation, Washington acted to cap the conflict.\n\nSecretary of State Mark Rubio’s diplomacy made the leadership of both warring countries, including Army Chief Gen Asim Munir, negotiate. Crucially, the resulting agreement was not just about ceasing hostilities; it included Pakistan’s long-standing demand: that future talks take place at a neutral venue. This was not a face-saving gesture, it was rather a strategic vindication.\n\nSimultaneously, the G7’s restrained statement of May 10, notably avoiding any blame on Pakistan and instead urging dialogue and de-escalation, marked a diplomatic win for Islamabad. India’s narrative — that it was the aggrieved party reacting to terrorism—failed to gain traction. Instead, New Delhi found itself incr­easingly portrayed as the aggressor, its unilateral actions and refusal of an independent probe into Pahalgam casting doubt on its intentions.\n\n“India overassessed and miscalculated its newfound relevance while eyeing to become a counterweight to China and being part of the Indo-Pacific strategy. The whole conflict till May 10 exposed India’s exaggerated and inflamed strategic relevance,” Gen Janjua maintained.\n\nPakistan, for its part, played the moment with clarity and restraint. By upholding Article 51 of the UN Charter, it positioned its response as legitimate self-defence. It neither overreached nor sought escalation for escalation’s sake. This is what separates a state seeking resolution from one seeking hegemony.\n\nAnd yet, challenges remain. The ceasefire, while welcome, is tenuous. Hours after it took effect at 16:30 hrs on Saturday, there were reports of breaches from various locations.\n\nTrust is scarce and for good reason. India’s post-ceasefire messaging has been muddled and, at times, deliberately dismissive. Indian officials privately propagated the impression that the agreement was merely an “understanding” devoid of commitments or international mediation.\n\nEven more concerning, Indian officials suggested to their domestic audiences that hostile measures — such as the April 23 decision to suspend the Indus Waters Treaty remain in force. This selective reinterpretation of the deal aims to pro­ject strength at home, but it raises serious doubts about New Delhi’s sincerity.\n\n“India must cease its threats, stop externalising its internal security issues, and engage in meaningful dialogue with Pakistan. A backchannel between the two NSAs should be established to lay the groundwork for talks. As a first step, India must reverse its suspension of the Indus Waters Treaty to address a key Pakistani concern,” former foreign minister Jalil Abbas Jilani said.\n\nPakistan cannot be expected to buy into an illusion of peace while India reserves the right to provoke again. Any enduring resolution demands good faith and that means addressing root causes, above all the Kashmir dispute. India’s consistent refusal to engage meaningfully on Kashmir and its habit of painting all Kashmiri dissent as terrorism perpetuate the cycle of violence and instability.\n\n“Pakistan hopes that India will stop its march to the follies and learn from the outcome of conflict and will come to terms for a peaceful coexistence by resolving all its disputes with Pakistan including Kashmir and Indus Waters Treaty, which was unilaterally and illegally suspended despite the World Bank being a guarantor,” Gen Janjua said and added that Delhi should stop misperceiving that it is above international law.\n\n“Despite ceasefire and commitment to talks, Pakistan needs to remain ready for another round of military confrontation,” Mr Faisal warned.\n\nThe international community, particularly those who helped defuse the crisis, must now hold India to account. Ceasefires cannot function if they merely reset the clock until the next provocation.\n\nDialogue must be real, not rhetorical. And India must show that it values peace more than posturing.In the final accounting, Pakistan has walked away from this round not as a state that bent to pressure, but one that stood firm, exposed its adversary’s miscalculations, and steered the crisis toward de-escalation on its own terms. It restored deterrence, secured diplomatic recognition, and reframed the regional narrative.\n\nPublished in Dawn, May 11th, 2025\n\nHeader image: Demonstrators wave Pakistan’s national flags as they participate in an anti-India protest in Islamabad on May 10, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/11083329b78a27d.jpg",
  "retrievedAt": "2025-08-23T08:24:14.064Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910189/pakistan-dictates-the-pause",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:19.000Z"
}
