{
  "title": "US-China talks to defuse trade row continue in Geneva - World - DAWN.COM",
  "author": null,
  "content": "Talks between US and Chinese officials continued into their second day in Geneva on Sunday, as both sides discussed how to de-escalate the trade war that threatens to inflict major damage on the world economy.\n\nChinese Vice Premier He Lifeng met with US Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer in their first face-to-face meetings since the world’s two largest economies imposed tariffs well above 100 per cent on each other’s goods.\n\nTalks were still underway after 3-1/2 hours on Sunday on the outskirts of Geneva, following eight hours of discussions on Saturday.\n\nBessent declined to comment to reporters at his hotel before setting off for the talks on Sunday.\n\nBut White House economic adviser Kevin Hassett said the Chinese were “very, very eager” to engage in discussions and rebalance trade relations with the United States.\n\nHassett also told Fox News that more foreign trade deals could be coming with other countries as soon as this week.\n\nOvernight, US President Donald Trump gave a positive reading of the talks, saying the two sides had negotiated “a total reset … in a friendly, but constructive, manner.”\n\n“A very good meeting today with China, in Switzerland. Many things discussed, much agreed to,” Trump posted on his Truth Social platform.\n\nTrump added: “We want to see, for the good of both China and the U.S., an opening up of China to American business. GREAT PROGRESS MADE!!!”\n\nHe did not elaborate on the progress.\n\nSpeaking on ‘Sunday Morning Futures’ on Fox News with Maria Bartiromo, Hassett said Beijing is eager to re-set trade relations with the United States. “It looks like the Chinese are very, very eager to play ball and to re-normalize things,” Hassett said.\n\nHassett also said more trade deal announcements could be imminent following last week’s announcement of an agreement with the United Kingdom, adding that Commerce Secretary Howard Lutnick had briefed Hassett on two dozen pending deals in development with US Trade Representative Jamieson Greer.\n\n“They all look a little bit like the UK deal but each one is bespoke,” Hassett said.\n\nThe negotiating teams met at the gated villa of Switzerland’s UN ambassador, overlooking Lake Geneva in the leafy suburb of Cologny. Black Mercedes vans with sirens shuttled to and from the venue which was bathed in bright sunshine.\n\nNeutral Switzerland was chosen as the venue following approaches by Swiss politicians on recent visits to China and the United States.\n\nWashington is seeking to reduce its $295 billion goods trade deficit with Beijing and persuade China to renounce what the United States says is a mercantilist economic model and contribute more to global consumption, a shift that would require politically sensitive domestic reforms.\n\nBeijing has pushed back against what it sees as external interference. It wants Washington to lower tariffs, clarify what it wants China to buy more of, and treat it as an equal on the world stage.\n\nChina’s official Xinhua News Agency said in a commentary on Saturday that the United States’ “reckless abuse of tariffs” had destabilised the global economic order, but added that the negotiations represented “a positive and necessary step to resolve disagreements and avert further escalation”.\n\nWith distrust running high, both sides have been keen not to appear weak, and economic analysts had low expectations of a breakthrough.\n\nTrump said on Friday that an 80pc tariff on Chinese goods “seems right”, suggesting for the first time a specific alternative to the 145pc levies he has imposed on Chinese imports.\n\nChina could be looking for the same 90-day waiver on tariffs that Washington has given other countries as negotiations take place, while any kind of tariff reduction and follow-up talks would be seen as positive by investors.\n\nChina’s He is also provisionally scheduled to meet the director-general of the World Trade Organisation, Ngozi Okonjo-Iweala, later on Sunday.\n\nSince taking office in January, Trump has increased tariffs on Chinese imports to 145pc, citing unfair trade practices and accusing Beijing of failing to curb the export of chemicals used to produce fentanyl, a lethal synthetic opioid.\n\nChina retaliated with 125pc retaliatory tariffs, and said it would not bow to “imperialists” and bullies.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/112105284a0f3ad.jpg",
  "retrievedAt": "2025-08-23T08:23:35.519Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910347/us-china-talks-to-defuse-trade-row-continue-in-geneva",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T16:05:41.000Z"
}
