{
  "title": "Development remains a priority: Ahsan Iqbal - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Planning Minister Ahsan Iqbal on Saturday vowed that the government would not let anything derail Pakistan’s development and economic growth agenda.\n\nChairing a crucial meeting to prioritise projects for the upcoming Public Sector Development Programme (PSDP) for 2025-26, the minister said the government had redoubled efforts to achieve economic transformation.\n\nAn official announcement said the meeting focused on prioritising essential development projects aligned with the Uraan Pakistan, 5Es and national economic transformation framework amidst economic constraints.\n\nThe minister emphasised the unwavering resolve of the government, saying, “Despite the challenges we face, our commitment to the country’s growth is absolute. We will not compromise on the betterment of our people and progress of our nation.”\n\nMr Iqbal further emphasised that the current and upcoming PSDPs are wholly aligned with the Uraan Pakistan initiative and prioritises enhancement of productivity as defined in the framework based on the 5Es: Exports, Equity & Empowerment, E-Pakistan, Environment & Climate, and Energy & Infrastructure.\n\nHe stated that in prioritising critical development projects for the upcoming fiscal year, “we are keenly focused on ensuring the continuity of essential initiatives and projects of strategic national importance, especially those near completion and with allocated block funding. It is being ensured that approved projects for the coming year are assigned adequately funded”.\n\nThe projects will be aligned with the vision of Uraan Pakistan and build vital infrastructure for enhanced productivity, invest in future of the country, provide essential operational support, develop human capital, and strengthen Pakistan’s soft power.\n\n“We are diligently working to optimise resource allocation to ensure the continued progress of critical projects in alignment with the Uraan Pakistan vision and the federal government’s development priorities. This strategic approach will enable us to navigate the evolving fiscal landscape while maintaining our focus on enhancing productivity and achieving our national development goals,” the minister said.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:00:40.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910173/development-remains-a-priority-ahsan-iqbal",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:41.000Z"
}
