{
  "title": "Govt urged to seek US intervention over Indus treaty - World - DAWN.COM",
  "author": null,
  "content": "LAHORE: After Pakistan and India agreed to a ceasefire facilitated by the US, water experts have urged the federal government to take up with Washington the unilateral suspension of the Ind­us Waters Treaty by India following the Pahalgam attack.\n\n“They (our government) must take up this issue with the US authorities immediately to ensure withdrawal of the illegal unilateral decision of holding the treaty in abeyance by India on April 24,” advised Jawaid Latif, a former member (water) of the Water and Power Development Authority.\n\n“I think it is the right time to raise this issue with immediate effect,” he told Dawn.\n\nAccording to him, India may withdraw its decision covertly in confidential meetings with Pakistan during mediation by the US, as it would avoid announcing this publicly for face-saving.\n\nThe 1960 treaty regulates the sharing of water from the rivers. Under the treaty, India has the right to use water from the eastern rivers Ravi, Beas and Sutlej, with some discharges to Pakistan downstream. Pakistan, under the treaty, has the right to use the western rivers: Indus, Jhelum and Chenab.\n\nWhen contacted, Syed Jamat Ali Shah, former Pakistan’s commissioner on Indus Waters, termed the intervention by the countries, including the US, not limited to just the ceasefire. “I think the ceasefire is the first step. And I am sure when they (Pakistan and India), under US mediation, sit together, the former will have to raise this issue,” he maintained.\n\nMr Shah said the government should ask the US to play its role in resolving other issues between Pakistan and India, including Kashmir.\n\nAnswering a question, the former commissioner said that if the aforementioned issues move towards resolution, Pakistan must seek a guarantee from the US so that India does not flout this in future.\n\nMeanwhile, Reuters news agency quoted Indian government sources, saying that despite the countries reaching a ceasefire agreement on Saturday after days of deadly fighting, the water-sharing treaty remains suspended.\n\n‘No flow disruption’\n\nAll rivers are flowing in their normal course, as there is no flow disruption, according to a senior official in the Punjab government. “There is no problem; all rivers, including the western ones Chenab, Jhelum and Indus, are flowing normally,” the official said while talking to Dawn on Saturday.\n\nTalking about Chenab River, where inflows reduced to 3,100 cusecs on May 5 after India halted the river flow to fill up its dams and later released the water the next day, he said the inflows at Marala headworks were also normal.\n\nAbout water data-sharing, he said such data is generally shared with Pakistan by India in the monsoon or flooding season. “They (India) are not sharing data with us these days, as they generally do this in the flood season or any other unusual situation under the Indus Waters Treaty. But since the Chenab river flows are normal these days, we are not worried at all,” he explained. He hoped India would share the data in the upcoming monsoon season.\n\nSeparately, a daily water report sha­red by the Water and Power Deve­lop­ment Authority said that Chenab River inflows and outflows at Marala were recorded on Saturday as 29,700 cusecs and 10,300 cusecs, respectively.\n\nThe inflows and outflows at Indus at Tarbela were recorded as 136,300 cusecs and 70,000 cusecs, respectively. In Jhelum, 52,400 cusecs of inflows and 32,000 cusecs of outflows were gauged at Mangla.\n\nThe River Kabul at Nowshera had inflows of 46,000 cusecs and outflows of 46,000 cusecs.\n\n“The inflows and outflows of River Indus at Tarbela, Jinnah and Chashma, River Kabul at Nowshera and River Jhelum at Mangla have been reflected as mean flows of 24 hours, whereas the other flows have been gauged at 6am,” the report said.\n\nWhile discussing the country’s reservoirs, the report said the current level in Tarbela Dam was 1456.40 feet with a live storage of 1.289 MAF.\n\nThe minimum operating level of the dam is 1402 feet, whereas the maximum conservation level is 1,550 feet.\n\nThe water level in Mangla Dam was recorded at 1141.20 feet with live storage of 1.377 MAF. The minimum operating level of the dam is 1050 feet, whereas the maximum conservation capacity of the dam is 1242 feet. Chashma Lake had a water level of 646.40 feet and a live storage of 0.189 MAF.\n\nThe minimum operating level of the lake is 638.15 feet, whereas the maximum conservation capacity is 649 feet.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/110834246122ca9.jpg",
  "retrievedAt": "2025-08-23T08:24:13.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910188/govt-urged-to-seek-us-intervention-over-indus-treaty",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:19.000Z"
}
