{
  "title": "Kashmiris brave another night of shelling across LoC - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: In yet another night of devastation along the Line of Control (LoC), Indian troops resorted to intense artillery shelling past midnight on Saturday and continued firing in intervals until noon, leaving 13 more civilians martyred— including a three-year-old girl — and over 55 others wounded across Azad Jammu and Kashmir (AJK).\n\nAccording to the State Disaster Management Authority (SDMA), the latest casualties raised the death toll to 30 since Indian missile strikes targeted two cities in AJK, followed by heavy and indiscriminate shelling in several border areas.\n\nOfficials said the shelling intensified after Fajr prayers, targeting civilian population with heavy guns, causing massive damage.\n\nIn Poonch district, three people were killed in Chaffar village of Abbaspur tehsil. The victims were identified as Areesha, 26, her three-year-old daughter Hadia, and Rehman Jan, 60.\n\nThree-year-old girl among 13 martyred in Azad Jammu and Kashmir\n\nIn Kotli, Robila Javed, 35, was martyred in Bandli village of Khuiratta tehsil. Also, Kaneez Begum, 50, was martyred in Thalla Laat neighbourhood, while Muhammad Fazil, 70, was martyred in Seri Tangar village of Nakyal tehsil.\n\nFour men and two women suffered injuries in the district.\n\nIn Neelum valley, Ali Ahmed Butt, 20, lost his life in Bugna village. Three men and two women were injured in the valley.\n\nAlthough no fatalities were reported in Jhelum valley, three men and a child were injured in different areas. In Haveli district, four people, including a child, suffered injuries.\n\nThe heaviest toll, however, was reported from Barnala tehsil in Bhimber, where six people identified as Muhammad Junaid, 18; Allah Log, 65; Ms Shahmeen, 50; Nabeel, 15; Moon Shah, 18; and his 13-year-old sibling Aitraz Shah were martyred and 16 others, including five women and a child, were injured.\n\nIndian troops were still fiercely firing artillery in Barnala, Moyel, Kot Jaimal, Watala, Nandpur, and Thub after the ceasefire, confirmed a police official.\n\nAn administration official independently confirmed the ongoing shelling, also requesting anonymity.\n\nIn Neelum valley, scepticism ran high over the ceasefire announcement, with many residents citing “the Indian side’s treacherous track record”.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681fd0850ab6c.gif",
  "retrievedAt": "2025-08-23T08:24:07.130Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910167/kashmiris-brave-another-night-of-shelling-across-loc",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:26.000Z"
}
