{
  "title": "Lakki police arrest scores of suspects, seize weapons - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: The police arrested scores of suspects and seized weapons and explosives from them during a search and strike operation conducted in the rural areas of Lakki Marwat district on Saturday.\n\nA police official said the operation was launched after a midnight attack on the house of two policemen in the Langerkhel Pacca area.\n\nThe official said the law enforcers raided the hideouts of miscreants in the Langerkhel Pacca, Sherikhel, Ghazikhel, Tabi Murad, Asgharkhel, Chuharkhel and Sarga Kherukhel areas and arrested over two dozen suspects.\n\n“The cops seized an AK-47 assault rifle, a hand grenade, ammunition and narcotics from the arrested men and shifted them to the police station,” he maintained.\n\nAction taken after houses of two personnel attacked\n\nIt is pertinent to mention here that terrorists attacked the houses of policemen on Friday night, leaving a teenage son of a cop injured in one of the attacks.\n\nA police official confirmed that a group of terrorists surrounded the house of constables Abdul Rehman and his brother, Damsaz Khan and opened fire.\n\nHe said the attack triggered a gun battle as the village’s peace committee members assisted the policemen to fight the assailants.\n\nThe official said a befitting reply by the policemen and armed villagers forced the attackers to flee.\n\nHe said Mohammad Fayyaz, 18, son of constable Damsaz, was injured in the attack and taken to a nearby hospital.\n\nIn a separate attack, terrorists torched the house of a former sub-inspector of police department, Ghulam Mohammad, in the Dabak Mandrakhel area near Lakki city at midnight.\n\nGANG BUSTED: The district administration busted a gang involved in solving papers of written screening test for teachers’ recruitment in Bannu district on Saturday.\n\nOn a tip-off, a team led by assistant commissioner Allah Nawaz Khan raided a place in the limits of Miryan police station and caught 10 people engaged in illegal activity of solving screening test papers, an official said.\n\n“During the raid, question papers, answer sheets, a laptop, computers and a printer were seized,” he added.\n\nThe official said that Etea authorities were also informed about the illegal activity so they could initiate action at their own level.\n\nIn a similar development, Lakki additional deputy commissioner Habibullah Wazir took notice of irregularities in the higher secondary school certificate examinations and recommended replacement of supervisory staff of an examination centre up at a school in Serai Naurang with honest and experienced invigilators.\n\nDuring a visit to the examination centre, Mr Wazir observed that the supervisory staff was not performing their professional duties seriously as there was a complete lack of discipline at the exam hall.\n\n“The students were found cheating without any check,” he said.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:00:23.158Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910259/lakki-police-arrest-scores-of-suspects-seize-weapons",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T03:22:24.000Z"
}
