{
  "title": "Space for peace diplomacy - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN and India have long struggled to resolve their disputes, with the Kashmir issue continuing to cast a long shadow over both nations.\n\nDespite failing to address the core issues, both sides have historically managed their differences by maintaining certain norms to limit escalation and achieving milestones that have kept the conflict within bounds.\n\nHowever, this time the tensions ran very high, resulting in conflict that broke through those long-maintained boundaries. This escalation came at a time when the international community showed little interest in mediating between the two.\n\nThe US, which was once a key mediator, appeared initially disengaged, and US Vice President J.D. Vance had even remarked that a potential war between India and Pakistan would be “none of our business”. Apparently, this was a smokescreen, and the US was engaged with the leadership behind the scenes. Ultimately, its efforts for a ceasefire appeared productive.\n\nSaudi Arabia had appeared to take a more proactive stance. While it appeared uncertain whether Riyadh could play the same role as the US and, to some extent, Russia once did, Saudi Arabia has been increasingly active in international diplomacy in recent years, seeking to position itself as a global mediator and a stabilising force in regional and international conflicts. Besides its mediation role in Africa, Saudi Arabia has also intervened in the Russia-Ukraine conflict, while maintaining balanced relations with both Russia and the West during the war.\n\nApart from Saudi Arabia, the UAE is also interested in gaining a foothold in regional and global politics. The UAE played a key role in brokering a ceasefire between India and Pakistan in 2021, which halted cross-border skirmishes that had been ongoing since 2019.\n\nNonetheless, the nature of the long-simmering India-Pakistan tensions over Kashmir is such that an entirely new approach is needed. Saudi Arabia has become more assertive on the global stage, recently intervening in the Russia-Ukraine conflict and mending ties with Iran. Its relationship with India has strengthened significantly since Prime Minister Narendra Modi came to power, while its approach towards South Asian Muslim nations, especially Pakistan, has evolved. Still, it remains uncertain whether Saudi Arabia possesses diplomatic leverage over India.\n\nThe nature of the long-simmering India-Pakistan tensions is such that a new approach is needed.\n\nThe question of mediation always resurfaces whenever tensions between India and Pakistan flare up. While both countries officially commit to resolving disputes bilaterally, they often wait for international intervention to calm tensions. Nevertheless, there have been instances demonstrating their ability to engage in direct negotiations. One such example is the Non-Attack Agreement, signed on Dec 31, 1988, and entered into force on Jan 27, 1991. Under this agreement, both nations exchange coordinates of their nuclear facilities every January, regardless of ongoing tensions or diplomatic relations.\n\nThe 1972 Simla Agreement, signed with US mediation and once considered a no-war pact, also stipulated that both countries would resolve differences through peaceful bilateral negotiations.\n\nIt converted the ceasefire line of Dec 17, 1971, into the Line of Control and included a commitment neither side would attempt to alter unilaterally. When India recently hinted at withdrawing from the Indus Waters Treaty, Pakistan responded by questioning the validity of the Simla Agreement, arguing that its violation would mean the LoC could no longer be respected.\n\nThere was also the Karachi Agreement of 1949 (which was abandoned by both nations) to bring about a ceasefire in Kashmir, while another notable example of mediation is the Tashkent Declaration, signed on Jan 10, 1966, following the India-Pakistani war of 1965. Brokered by the Soviet Union and the US, the declaration led to a ceasefire and an agreement to restore diplomatic ties, exchange prisoners of war and improve bilateral relations. The 2003 ceasefire agreement also marked a significant milestone in de-escalation efforts.\n\nExtensive literature exists on these agreements, negotiations, and conflicts — both from within the region and by international academics, diplomats, and officials working in South Asia. A consistent theme in much of this analysis is that leadership matters. Peace requires leaders willing to challenge entrenched interests that thrive on conflict and interests embedded within state institutions and who are influential in shaping public opinion.\n\nUnfortunately, such leadership is lacking today. In particular, the BJP-led government in India appears increasingly hostile in its domestic and regional politics. It shows little interest in mutual negotiations or conflict resolution, preferring to impose its own solutions on neighbouring countries. Its decision to revoke Kashmir’s special status on Aug 5, 2019, and now its move to suspend the Indus Waters Treaty go against accepted international legal norms and the bilateral agreements the two countries have upheld.\n\nBoth states are undermining their capacity to negotiate peace. Unfortunately, peace lobbies within civil society are also weak, limiting the creation of a conducive environment for dialogue. When two parties manage their affairs bilaterally, third-party mediation can often restore the status quo, but rarely results in substantial development or behavioural change. Pakistan and India do have a framework for dialogue, which includes Kashmir and terrorism — the two major concerns of both states — but achieving meaningful progress requires courage and long-term commitment.\n\nWhen conflict escalates and brings nations to the brink of war, third-party mediation is often considered a blessing, as it at least halts the momentum of conflict and allows emotions to settle.\n\nDiplomacy for peace requires broader global engagement. In the recent conflict, while China’s influence was understandable given its close alliance with Pakistan, India likely viewed its efforts with suspicion. Russia faced its own constraints due to its historical relationship with India. Actors such as the OIC, the UN, the EU, Asean and the SCO have limited potential to play a decisive role in any future conflict between India and Pakistan.\n\nWith a ceasefire declared, both nations have a chance to reflect on the consequences of continued conflict and consider the possibility of a new beginning.\n\nThe writer is a security analyst.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681fdebc0e64f.jpg",
  "retrievedAt": "2025-10-12T03:00:17.390Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910208",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:30:29.000Z"
}
