{
  "title": "People in Lahore celebrate Pakistan Army’s victory over India - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: People burst into celebrations after the armed forces early on Saturday responded to Indian war hysteria in a befitting manner and brought India to its knees. They celebrated the victory of the army after the ceasefire was announced in the wake of the US intervention.\n\nEarlier in the day, Lahore also faced the first missile attack on Saturday that struck the Sundar Industrial Estate and, according to law enforcement agencies, sank into the ground. No loss of life or injury was reported. People, however, were skeptical over Pakistan’s delayed response to India’s ‘Operation Sindoor’ and aggressively asked for a befitting response. All the skepticism, however, evaporated when the army announced the launch of Bunyan-um-Marsoos and launched a powerful and well-coordinated military operation, targeting Indian military infrastructure.\n\nAs the Pakistan Army came out, saying it had avenged the blood of the innocent kids martyred in missile and drone attacks, the people shared the pictures of army artillery trucks and chanted slogans “Pakistan Zindabad. Pakistan Army Paindabad”. They took to the roads, organised rallies showing a national unity across the party lines and lauded the army for its calculated and meaningful response that even brought the mighty US to intervene and agree on a ceasefire between the neighbouring nuclear nations.\n\nThe ruling PML-N held a rally on The Mall to celebrate the success of the operation Bunyan-um-Marsoos against India. Paying tributes to the army’s befitting reply to the Indian airstrikes, the Lahorites burnt Indian and Israeli flags as well as an effigy of Indian premier Narendra Modi.\n\nRallies held in support of army and operation Bunyan-um-Marsoos; home dept asks law enforcement, civil defence to stay alert\n\nSince India has been cut to size and licking its wounds, the rally participants asserted that Pakistan should not get relaxed but to win another war at the diplomatic front and ensure restoration of the Indus Waters Treaty as well as the legal status of India-held Kashmir.\n\nAs the nation showed unity in celebrating the victory and congratulating the Pakistan Army, a rally participant said, “The nation was divided and Indian Premier Modi’s false pride and arrogance helped it to unite across party lines”.\n\nAfter the ceasefire, tributes and congratulation messages for the Pakistan Army’s bravery and war-ready spirit also poured in from all segments of the society and political leaders as well as PML-N president Mian Nawaz Sharif, Prime Minister Shehbaz Sharif, Chief Minister Maryam Nawaz and other political leaders across party lines. People were seen presenting flowers and garlanded army men wherever they came across them in the province.\n\nThe social media sites X, Instagram and Facebook were flooded with memes and shattered India’s propaganda, sensationalism and even serious statements and communications aimed at pressurizing Pakistanis.\n\nAs the airports opened for resuming flight operations and the expected resumption of academic and examination activities at all academic levels, students have also urged the ICAP to withdraw its notification of postponing next week’s examinations and proceed with the already notified schedule.\n\nEarlier, Chief Minister Maryam Nawaz approved the release of Rs2bn for emergency security arrangements in all districts and training of volunteers to enable them to deal with any emergency.\n\nAfter the home department released the funds and the finance department made them available online, the respective district administrations were specifically instructed to ensure the availability of essential goods, including rations, medicines and fuel.\n\nThough the ceasefire has been declared after the US intervention, the home department has asked all law enforcement agencies, civil defence and rescue services to stay on high alert. A home department spokesman urged the citizens not to post any videos or pictures on social media about the location of defence installations and the movement of law enforcement agencies. The citizens have also been instructed to avoid unnecessary travel, stay at home and follow the safety measures issued by the civil defence.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1111450658a6b14.jpg",
  "retrievedAt": "2025-10-12T03:00:40.086Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910253/people-in-lahore-celebrate-pakistan-armys-victory-over-india",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T03:07:21.000Z"
}
