{
  "title": "Pakistan ‘rattles’ India with firm response as patience runs out - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Launches retaliation attack at military targets after three days of restraint\n• Brahmos, S-400 missile sites hit\n• Indian missiles fired at Shorkot, Rawalpindi, Chakwal shot down: ISPR\n• Six martyred in Gujrat amid shelling on LoC\n\nISLAMABAD: After demonstrating restraint in the face of blatant Indian aggression since Wednesday, Pak­istan launched strikes early Satur­day morning targeting military installations in India and India-held Kashmir.\n\nThe strikes were launched under operation Bunyan-um-Marsoos at 5:16am.\n\n“Bunyan-um-Marsoos” translates as a concrete structure or firm foundation.\n\nThe missiles, launched by aircraft and ground-based systems, targeted multiple strategic and military sites of India, security sources and state media reported.\n\nAccording to the military’s media wing and Radio Pakistan, the targeted locations included S-400 missile system in Adampur; military intelligence’s training ce­n­tre in Rajouri and brigade hea­d­quarters in Uri; Adampur, Udha­mpur, Pathan­kot, Suratgarh, Sirsa, Bathinda and Halwara airfields; Akhnoor aviation base; artillery gun positions in Dehrangyari; Brahmos missile battery site in Nagrota; Brahmos storage site in Beas; and India’s Rabtanwali Post, Jazeera Post Complex, Kafir Mehri, Shahpar 3, and Ghadar Top across the Line of Control (LoC).\n\nISPR said PAF’s JF-17 Thunder hypersonic missiles destroyed the S-400 missile system in Adampur.\n\nThe strikes came hours after India fired missiles at three air bases in Rawlpindi, Chakwal and Shorkot, as well as the Rahim Yar Khan airport.\n\nAll assets of the Pakistan Air Force (PAF) remained safe in the attack, the military spokesman said.\n\nPakistan has targeted key Indian military installations in a “befitting response” as part of its retaliatory operation, the federal government said in a statement.\n\n“These actions are being carried out in response to India’s initial attack, which was an assault on our homeland, people and sovereignty,” the statement said, referring to Indian missile strikes at three PAF airbases.\n\nThe retaliatory attacks targeted “more than 26” locations and damaged “equipment and personnel” at at least five airbases, according to Colonel Sophia Qureshi of India’s Army Signal Corps.\n\nThe damage was sustained at air force bases in Udhampur, Pathankot, Adampur, Bhuj and Bathinda, Col Qureshi said, according to Times of India.\n\nIndia’s attack India launched missiles and drones in its late-night attack, which were shot down by ground defence systems in Punjab and Sindh.\n\nThe strikes targeted Nur Khan air base, Rawalpindi; Murid air base, Chakwal; and Shorkot air base, Inter Service Public Relations (ISPR) DG Lt Gen Ahmed Sharif Chaudhry said at a press conference.\n\nTwo missiles fired by India at the Shorkot airbase were shot down by the air defence system, officials said.\n\nThe debris of destroyed missiles fell near a government primary school in Pirmahal village.\n\nNo casualties were reported, while Zahoor Ahmad, 70, received minor injuries after being hit by falling debris.\n\nA drone fired by India fell in open fields in the Ahmad Nigar village on on Chiniot-Sargodha Road.\n\nA large number of locals gathered at the site to view the wreckage of the fallen drone.\n\nDebris of three downed Indian drones also fell in fields in Islam Nagar village, Chak Noor Muh­ammad 11/SP and Bheela near village 13/SP during the past 36 hours.\n\nIt was collected by the police officers who took it away for further analysis.\n\nDrones were also intercepted in Sargodha.\n\nOne of the drones fell in the area of Kirana Hills and another in open fields in Chak 48 SB village.\n\nNo casualties were reported in any of these localities.\n\nAt least four drones were also shot down in different areas of Jacobabad, Sindh, on Saturday, according to Deputy Commissioner Sameer Hussain Laghari.\n\nThe debris of scattered drones fell near the Jacobabad Institute of Medical Science and the Shah Abdul Latif Numaish (Exhibition) Ground.\n\nLocals reported sounds of explosions as smoke filled the sky, as drones were intercepted by the ground defence systems.\n\nAccording to DC Leghari, at least eight people were injured after being hit by fragments of destroyed drones. One man, who was critically injured, had been transferred to Larkana for treatment.\n\nHe added the debris had been taken into custody by the authorities.\n\nShelling at border\n\nAt least six people were martyred and five injured as India fired shells in Tanda and Karianwala areas of Gujrat.\n\nThe deceased included three members of a family, including a man and his two sons.\n\nThey were killed after mortar shells hit their house in Jalalpur Sobtian village of Karianwala early on Saturday morning.\n\nThe victims were identified as Nisar Ahmed, 45; Habeebur Rehman, 18; and Naeem, 12.\n\nMr Ahmed’s third son, Muneeb, 17, was injured and undergoing treatment at the Aziz Bhatti Shaheed Teaching Hospital.\n\nCivil defence officials collected the pieces of shells from the house.\n\nThe shelling also killed two people in Tanda, while two others were injured in that incident.\n\nThe deceased included Zia and Hajira, whereas Umar Mustafa and Sidra Bibi were injured.\n\nAnother teenager, Muhammad Nabeel, lost his life in the Barnala village along the border area.\n\nGujrat Deputy Commissioner Safdar Virk and District Police Officer Dr Mustanser Atta Bajwa reached the attack site in Jalalpur Sobtian and inspected the scene.\n\nWith input from Agencies\n\nMalik Irfan from Rahim Yar Khan, Tariq Saeed from Toba Tek Singh, Aurangzeb from Chiniot, Shafiq Butt from Sahiwal, Waseem Ashraf Butt from Gujrat, Sajjad Niazi from Sar­godha and Waseem Shamsi from Suk­kur also contributed to this report\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/1108253244d2057.jpg",
  "retrievedAt": "2025-08-23T08:24:12.822Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910186/pakistan-rattles-india-with-firm-response-as-patience-runs-out",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:19.000Z"
}
