{
  "title": "Trilateral dialogue: Afghan Taliban govt seeks constructive engagement with Pakistan, China - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Afghan government under the Taliban has called for “mutual respect and constructive engagement” with Pakistan and China, according to a statement issued by its interior ministry.\n\nThe statement was issued after special envoys of Pakistan and China, Mohammad Sadiq and Yue Xiaoyong, met Afghan Interior Minister Sirajuddin Haqqani in Kabul. The trilateral forum was established in 2017, with earlier meetings held in Beijing and the Afghan capital.\n\n“Minister of Interior Khalifa Sirajuddin Haqqani emphasised the importance of strengthening regional ties, stating that, from the Islamic Emirate’s perspective, the advancement of economic and political relations, as well as regional understanding, can be achieved through mutual respect and constructive engagement,” the Afghan interior ministry said.\n\nIt added that the special envoys of China and Pakistan reaffirmed their commitment to strengthening good neighbourly relations and fostering cooperation with Afghanistan based on mutual engagement. They also agreed that the sixth round of the trilateral dialogue between the foreign ministers would be held in Kabul, continuing the established mechanism.\n\nSeparately, in a post on X, Ambassador Sadiq said: “The meeting aimed to follow up on the fifth trilateral dialogue between the foreign ministers of the three countries, held in Islamabad; prepare for the upcoming sixth ministerial round; and strengthen three-way political and economic cooperation.”\n\n“The delegations emphasised their commitment to good neighbourly relations, regional stability, mutual respect, and constructive engagement as foundations for stronger ties,” he added.\n\nSeparately, the Afghan Foreign Ministry said that Foreign Minister Amir Khan Muttaqi held a meeting in Kabul with the Pakistani and Chinese special envoys and their accompanying delegations.\n\nIn a statement, the ministry said the meeting “focused on following up on the agenda of the fifthth round of the Afghanistan-China-Pakistan Trilateral Foreign Ministers’ Dialogue”.\n\nThe fifthth round, which was held in Islamabad in May 2023, had “stressed on the need of not allowing any individual, group or party, including the Tehreek-e-Taliban Pakistan (TTP), the Eastern Turkistan Islamic Movement (ETIM) etc., to use their territories to harm and threaten regional security and interests, or conduct terrorist actions and activities”.\n\nKabul’s trilateral meeting on May 10 decided that the sixth round of the Trilateral Foreign Ministers’ Dialogue would be convened in Kabul, with preparatory measures also to be undertaken for the forthcoming meeting of the Foreign Ministers of Afghanistan’s neighboring countries.\n\nHowever, no date was announced for the trilateral meeting. “Underscoring the importance of political and economic relations with both countries, FM Muttaqi expressed hope for continued progress in these areas,” the statement added.\n\nIn a post on X, Ambassador Sadiq said the meeting provided the occasion for convergence of views on economic and security cooperation as well as regional stability.\n\nEarlier, the Chinese and Pakistani envoys also met Afghan Commerce Minister Nooruddin Azizi. According to the ministry, the meeting aimed at strengthening and developing trade relations, attracting investment, and launching joint projects between Afghanistan, Pakistan, and China.\n\nThe meeting discussed key issues including the establishment of joint industrial parks in Afghanistan, the establishment of special economic zones, the launch of joint export processing centres, the holding of trilateral trade fairs, the establishment of small and medium-sized enterprise support centers in Afghanistan, and the facilitation of banking relations between the three countries were discussed and exchanged.\n\nAzizi expressed gratitude for the presence of high-ranking representatives of Pakistan and China and emphasised the importance of joint and mutual cooperation, the statement said.\n\n“The policy of the Islamic Emirate is economy-oriented, and we organise and implement programs to attract foreign investment based on this policy, taking into account common interests,” it quoted Azizi as telling the special envoys.\n\nThe Afghan minister officially invited his Pakistani and Chinese counterparts to visit Afghanistan to deepen discussions and expand cooperation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/111616030b0171a.jpg",
  "retrievedAt": "2025-08-23T08:23:36.509Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910314/trilateral-dialogue-afghan-taliban-govt-seeks-constructive-engagement-with-pakistan-china",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T13:21:11.000Z"
}
