{
  "title": "Trump faces Mideast tensions on return to his ‘happy place’ - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US President Donald Trump heads for Saudi Arabia, Qatar and the United Arab Emirates on Monday, eyeing big business deals even as accords on the Middle East’s hotspots will be harder to seal.\n\nWhile the Gaza conflict and Iran’s nuclear programme will loom large over Trump’s first major foreign trip of his second term, the White House said he looked forward to a “historic return” to the region.\n\nEight years ago Trump also chose Riyadh for his first overseas trip as president — when he memorably posed over a glowing orb with the leaders of Egypt and Saudi Arabia.\n\n“It’s hard for me to escape the idea that President Trump is going to the Gulf because this is his happy place,” said Jon Alterman, director of the Middle East programme at the Center for Strategic and International Studies.\n\nThe Gaza conflict and Iran’s nuclear programme loom large over his first major foreign trip\n\n‘‘They’ll flatter him and not criticise him, and they’ll treat his family members as past and future business partners.“\n\n‘Historic return’\n\nRiyadh, Doha and Abu Dhabi are expected to pull out all the stops for Trump, who’s making his first major overseas trip after briefly attending the funeral of Pope Francis in Rome.\n\n“The president looks forward to embarking on his historic return to the Middle East” to promote a vision where “extremism is defeated in place of commerce and cultural exchanges,” spokeswoman Karoline Leavitt said Friday.\n\nBut he will not be able to avoid the long list of regional crises, including the war on Gaza, the Huthis in Yemen and Syria’s post-Assad turmoil.\n\nThe Gulf states have played a key diplomatic role under Trump 2.0. Qatar has been a major broker between Hamas and Israel while Saudi Arabia has facilitated talks on the war in Ukraine.\n\n“Trump is coming to the Gulf first because this region has become a geopolitical and financial center of gravity,” Anna Jacobs, non-resident fellow at the Arab Gulf States Institute in Washington, told AFP.\n\nBut one place that is not on the itinerary is Israel, the United States’ closest ally in the region.\n\nThat has sparked speculation about tensions between Trump and Israeli Prime Minister Benjamin Netanyahu. Israel has set Trump’s trip as the deadline for a ceasefire deal with Hamas before launching its plan for the “conquest” of Gaza and the displacement of most Palestinians there.\n\n‘Monetising MAGA’\n\nIran will meanwhile also be high on the agenda. Washington and Tehran will hold the latest round of indirect talks on Iran’s nuclear program in Oman on Sunday.\n\nIran has also reacted furiously after Trump said he was deciding whether to announce during the trip that he would change how the United States refers to the Gulf, from the Persian Gulf to the Gulf of Arabia.\n\nOne thing that the White House says won’t be on the agenda is Trump’s own businesses.\n\nPublished in Dawn, May 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:00:23.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910195/trump-faces-mideast-tensions-on-return-to-his-happy-place",
  "dateList": "2025-05-11",
  "date_published": "2025-05-11T02:29:52.000Z"
}
