{
  "title": "Post on Imran’s X account details FIA team’s visit - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Former prime minister Imran Khan was quizzed in prison by Federal Investigation Agency (FIA) officials about his “anti-state” tweets, critical remarks on foreign policy and other topics, according to a post on his official X account.\n\nAlthough Mr Khan does not have access to his X account in prison, the detailed statement disclosed the five key areas of questioning and his responses.\n\nThe PTI founder has repeatedly been quizzed about his social media postings, and he has previously refused to answer any questions without his lawyers present.\n\nEx-PM quizzed about social media activity; alleges ‘psychological torture’ through solitary confinement and denial of basic prison facilities\n\nThis is also the first time that such an account of a questioning by law enforcement personnel was posted to his official X account.\n\nNotably, two versions of this statement were posted on X with a nearly 14-hour gap — the Urdu version appeared first on Tuesday, followed by the English translation the next day.\n\nThe first question, the post claimed, was about the content of his X (formerly Twitter) account.\n\n“The very first question they put to me was why my Twitter account carries what they call ‘anti-state’ content.\n\n“I responded by reminding them that I am a former prime minister and I represent eighty percent population of Pakistani. I will speak on every issue that is in the interests of my people. I have every right to raise my voice for them,” the post said.\n\nHe claimed the FIA then questioned his focus on Afghanistan and foreign policy. In response, the ex-PM blamed the current army chief, claiming that by threatening the new Afghan government, he had destabilised the situation.\n\n“Afghan refugees with three generations of roots here were expelled by force, while drone strikes shattered relations between the two nations and destroyed the hard-won peace.”\n\nAccording to the statement, the FIA team asked why he compared army chief to General Yahya Khan, the military ruler during the 1971 war that led to the secession of East Pakistan. Khan said his comparison was based on the Hamood-ur-Rehman Commission Report.\n\nFinally, Mr Khan claimed he was asked about being subjected to psychological torture. He described his prison conditions as solitary confinement where his cell door remains shut, contact with others is denied, and basic facilities are withheld.\n\n“Electricity is cut, newspapers are withheld, and visits are suspended for days at a stretch, Both Bushra Begum and I are held in solitary confinement. And what greater form of psychological torture can there be?”\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:05:46.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945993/post-on-imrans-x-account-details-fia-teams-visit",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:39.000Z"
}
