{
  "title": "Govt raises Rs976bn via T-bills, bonds - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The government raised Rs976 billion through auctions of Treasury bills (T-bills) and Pakistan Investment Bonds (PIBs) on Wednesday, tho­ugh cut-off yields remai­ned largely unchanged.\n\nIn the T-bills auction, the government set a target of Rs750bn but accep­ted bids worth Rs641bn through competitive bidding. An additional Rs89bn was raised through non-competitive bids, bringing the total borrowing via T-bills to Rs730bn — still below the maturity amo­unt of Rs846bn, reflecting efforts to reduce short-term debt reliance.\n\nInvestor interest remained focused on shorter tenors. Bids for the one-month tenor were the highest at Rs793.2bn, out of which Rs310bn was accepted. For other maturities, the government raised Rs43.5bn for three months, Rs66.7bn for six months, and Rs220.8bn for 12 months.\n\nIn the PIB auction, the government raised Rs246bn in 10-year bonds, indicating a continuation of its debt management strategy aimed at lengthening the maturity profile.\n\nDespite declining inflation and a lower interest rate environment, banks remain hesitant to extend credit to the private sector. With limited avenues for lending, they continue to prefer risk-free government securities. Meanwhile, private sector borrowers are reportedly cautious due to economic uncertainty and high production costs.\n\nInflation in September stood at 5.6pc, while the policy rate is currently 11pc. However, industry analysts say the environment remains unfavourable for new investments, as many existing businesses are operating below capacity.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:05:41.614Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946039/govt-raises-rs976bn-via-t-bills-bonds",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T03:35:35.000Z"
}
