{
  "title": "BHC suspends cabinet decision to grant judicial powers to executive officers - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan High Court has suspended the implementation of a decision of the provincial cabinet regarding the granting of first class magistrate powers to all deputy commissioners, additional deputy commissioners, and assistant commissioners across the province on Wednesday.\n\nA two-member bench comprising Chief Justice of the BHC Jus­­tice Rozi Khan Barrech and Jus­tice Sardar Ahmed Halimi issued this order during the hearing of a constitutional petition filed by Iftikhar Ahmed Langove against the Balochistan government.\n\nThe petitioner argued that the provincial cabinet on Sept 24 had approved a decision assigning judicial powers to executive officers, which is a clear violation of the Constitution and the law. The petitioner cited a previous ruling by the BHC (PLD 2012 Balochistan 57: Muhammad Kamran Khan Mulkhail vs. Balochistan government), which established that assigning judicial powers to executive officials is unlawful from the outset.\n\nIt was stated that under Section 14 of the Code of Criminal Procedure, 1898, the provincial cabinet holds no authority to confer first class magistrate powers.\n\nFinding the objections to be legally substantial, the court issued notices to the provincial government and other respondents. The Advocate General of Balochistan was also directed to be notified.\n\nMeanwhile, the court suspended the implementation of the Sept 24 decision of the cabinet until further hearings.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:05:46.371Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945996/bhc-suspends-cabinet-decision-to-grant-judicial-powers-to-executive-officers",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:39.000Z"
}
