{
  "title": "New safety standards for vehicles enforced - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Industries and Production has enforced quality and safety standards for both imported and locally manufactured vehicles for the first time, amid concerns from auto industry stakeholders.\n\nThe Engineering Development Board (EDB), through official notifications, has made it mandatory for all new and used imported vehicles to conform to dozens of WP-29 standards. These cover road safety, passenger protection, emission limits, and environmental compliance. WP-29 is a framework set by the World Forum for Harmonisation of Vehicle Regulations under the United Nations.\n\nThe decision was ratified by the federal cabinet on the recommendation of the Economic Coordination Committee (ECC).\n\nImporters will now be required to meet a wide range of United Nations Economic Commission for Europe (UNECE) regulations covering braking systems, airbags, safety belts, lighting, emission levels, crash protection (frontal, side, and pole impacts), child restraints, head restraints, tyre safety, and systems specific to electric and hydrogen vehicles.\n\nRegulations require all vehicles to comply with UN-set WP-29 safety, emission standards by June 2026\n\nOnly companies incorporated under the Companies Act 2017 — with adequate capital and after-sales service networks — will be allowed to import used vehicles. Each imported unit must have pre-shipment inspection certification from approved agencies such as JAAI (Japan) or KTL (Korea).\n\nThese certificates must confirm that the vehicle is roadworthy, with intact airbags, untampered odometers, and no structural damage. Upon arrival, vehicles will also undergo post-shipment inspection at designated centres in Pakistan.\n\nLocally assembled and manufactured vehicles must also comply with the same WP-29 standards, including regulations for braking, steering, glazing, tyres, structural integrity, noise, and emissions. This will apply to both internal combustion and electric vehicles.\n\nAutomakers have until June 30, 2026 to comply. Failure to do so will empower the EDB to revoke manufacturing certificates and import authorisations.\n\nHowever, stakeholders have expressed reservations over the new framework. Amir Allawala, a senior member of the Pakistan Association of Automotive Parts & Accessories Manufacturers (PAAPAM), questioned the EDB’s capacity to implement and regulate such standards.\n\n“All local assemblers already follow international standards aligned with Japanese, Korean, or Chinese practices,” he said.\n\n“If the government fails to establish certified testing labs domestically, the cost of testing parts abroad will drive up production costs and result in foreign exchange outflows.”\n\nHe also voiced doubts over the credibility of any local labs the government may set up.\n\nThe move has also triggered a jurisdictional conflict. The EDB has been authorised to regulate automotive safety and quality, sidelining the Pakistan Standards and Quality Control Authority (PSQCA) — the country’s legally mandated standards body under the Ministry of Science and Technology.\n\nThe PSQCA, established through an Act of Parliament, is internationally recognised as Pakistan’s sole standards organisation and represents the country in the International Organisation for Standardisation (ISO).\n\nPakistan pays annual membership fees for participation. Under the WTO’s Technical Barriers to Trade (TBT) Agreement, overlapping mandates for standards-setting are discouraged.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68ddf3c7edbda.jpg",
  "retrievedAt": "2025-10-12T13:05:40.019Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946041/new-safety-standards-for-vehicles-enforced",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T03:37:42.000Z"
}
