{
  "title": "Over 300 injured, 400 arrested after Morocco protests - Newspaper - DAWN.COM",
  "author": null,
  "content": "RABAT: Nearly 300 people were injured and over 400 arrested in Morocco on Tuesday during protests for the fourth consecutive day demanding reforms in the public health and education sectors.\n\nUnauthorised demonstrations were held at the call of the GenZ 212 group, a recently formed collective whose organisers remain unknown.\n\nThe protests turned violent in some cities including Oujda and Inzegane.\n\nInterior ministry spok­esman Rachid El Khalfi said the clashes involved protesters using knives, Molotov cocktails and stones.\n\nA total of 263 policemen were injured to varying degrees, along with 23 protesters, including one hospitalised in Oujda.\n\nEl Khalfi said 409 people were detained following the unrest, during which more than 140 police vehicles and 20 private cars were set ablaze.\n\n“Protesters also sto­rmed government offices, bank branches and shops, looting and vandalising them,” especially in Inz­egane and Oujda, he added.\n\nTelevision footage showed tense confrontations lasting several hours along a main avenue in Inzegane.\n\nVideos circulating in Moroccan media showed hooded people throwing stones at police and setting fire to bins and areas around a shopping centre.\n\nProsecutors said an initial group of 37 people, including three in detention, would face trial.\n\nGenZ 212, which expressed “regret” over Tuesday’s violence, des­cribes itself as a “discussion space” focused on issues affecting all citizens, such as health, education and fighting corruption.\n\nSocial inequality rem­ains a major issue in Morocco, with sharp regional disparities and a significant gap between the public and private sectors.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/02095808ed6929f.webp",
  "retrievedAt": "2025-10-12T13:05:39.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945988/",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:52.000Z"
}
