{
  "title": "Marsh leads Australia to six-wicket win over NZ in T20I opener - Sport - DAWN.COM",
  "author": null,
  "content": "MOUNT MAUNGANUI: Mitchell Marsh scored a quickfire half-century as Australia crushed New Zealand by six wickets in the series-opening T20I despite a maiden century from home batter Tim Robinson in Mount Maunganui on Wednesday.\n\nMarsh blasted five sixes and nine fours in his 43-ball 85 as the visitors reeled in New Zealand’s 181 for six with 21 balls to spare at a blustery Bay Oval.\n\n“It’s a nice entry, obviously really important in a three-match series to start off with a win,” said Marsh. “Tonight was a lot of fun … We do have a lot of power in our batting line-up (and) hopefully it can continue.”\n\nIn the earliest start to an international summer in New Zealand, the hosts were missing regular captain Mitchell Santner, Kane Williamson, Rachin Ravindra and a slew of injured bowlers.\n\nKyle Jamieson returned from paternity leave, though, joining Matt Henry, Zakary Foulkes and Jacob Duffy in a pace quartet that was taken apart by Marsh and fellow opener Travis Head (31), and bled 68 runs in the powerplay.\n\nHenry removed Head and grabbed a second wicket when Marsh smashed straight to Robinson at deep cover.\n\nBut the game was well over by then, with number three Matt Short having added 29, and Tim David and Alex Carey combining in a 24-run partnership.\n\nRecalled all-rounder Marcus Stoinis faced one delivery, pulling Foulkes to the boundary fence for the winning runs.\n\nAustralia were also below strength, with Pat Cummins injured and all-rounder Cameron Green skipping the series to prepare for the Ashes at home.\n\nIt hardly mattered as quicks Josh Hazlewood and Ben Dwarshuis blew away the New Zealand top order with three wickets in the first two overs.\n\nRobinson, who replaced Ravindra in the New Zealand squad after the batter suffered a facial laceration at training, gave home fans cheer with an unbeaten 106 off 66 balls.\n\nBut Hazlewood and legspinner Adam Zampa otherwise put a chokehold on the batting, ensuring a modest total against Australia’s heavy hitters.\n\n“In the powerplays in both innings we got a little bit behind the game,” said New Zealand stand-in skipper Michael Bracewell. “We did well in the batting unit to be able to put a competitive total on the board. “(But) when Mitch and Travis came out the way they did, they took the game away from us – and we were fighting for a bit of momentum after that.”\n\nScoreboard\n\nNEW ZEALAND:\n\nT. Seifert c Marsh b Hazlewood 4\n\nD. Conway b Dwarshuis 1\n\nT. Robinson not out 106\n\nM. Chapman c Carey b Dwarshuis 0\n\nD. Mitchell c David b Short 34\n\nB. Jacobs run out 20\n\nM. Bracewell run out 7\n\nZ. Foulkes not out 0\n\nEXTRAS (B-1, LB-1, W-7) 9\n\nTOTAL (for six wickets, 20 overs) 181\n\nDID NOT BAT: K. Jamieson, M. Henry, J. Duffy\n\nFALL OF WICKETS: 1-4 (Seifert), 2-6 (Conway), 3-6 (Chapman), 4-98 (Mitchell), 5-162 (Jacobs), 6-171 (Bracewell)\n\nBOWLING: Hazlewood 4-0-23-1, Dwarshuis 4-0-40-2, Stoinis 2-0-27-0 (2w), Bartlett 3-0-30-0 (1w), Zampa 4-0-27-0 (1w), Short 3-0-32-1 (2w)\n\nAUSTRALIA:\n\nM. Marsh c Robinson b Henry 85\n\nT. Head c Chapman b Henry 31\n\nM. Short lbw b Jamieson 29\n\nT. David not out 21\n\nA. Carey c Chapman b Foulkes 7\n\nM. Stoinis not out 4\n\nEXTRAS (B-1, W-7) 8\n\nTOTAL (for four wickets, 16.3 overs) 185\n\nDID NOT BAT: M. Owen, B. Dwarshuis, X. Bartlett, A. Zampa, J. Hazlewood\n\nFALL OF WICKETS: 1-67 (Head), 2-135 (Short), 3-157 (Marsh), 4-181 (Carey)\n\nBOWLING: Henry 4-0-43-2, Duffy 3-0-31-0 (1w), Foulkes 2.3-0-35-1 (1w), Jamieson 4-0-46-1, Bracewell 3-0-29-0 (3w)\n\nRESULT: Australia won by six wickets.\n\nPLAYER-OF-THE-MATCH: Mitchell Marsh\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/021104437382dd5.webp",
  "retrievedAt": "2025-10-12T13:05:45.569Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945968/marsh-leads-australia-to-six-wicket-win-over-nz-in-t20i-opener",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T02:04:44.000Z"
}
