{
  "title": "A bailout too far - Newspaper - DAWN.COM",
  "author": null,
  "content": "A BAILOUT of some sort appears to have been in the works for Pakistan since at least 2022 (possibly earlier), interrupted along the way by developments in the Middle East. It was in January of 2023 when we had the first clue. Following a meeting between Pakistan’s army chief and the Saudi Arabian Crown Prince Mohammad bin Salman, the Saudi Press Agency released a statement announcing that both sides “explored means of developing bilateral relations, especially in the military field. They also discussed several issues of mutual concern”.\n\nAll statements around that visit pointed towards some sort of defence tie-up that was under discussion between Pakistan and Saudi Arabia. In a tweet, the Saudi defence minister said “[w]e emphasised the strategic partnership between our brotherly countries, reviewed the bilateral military and defence relations, and discussed ways of strengthening our cooperation” and the army’s own press wing, ISPR said in a statement before the meeting that both sides will discuss “matters of mutual interest, military-to-military cooperation and bilateral relations focusing on security-related subjects”.\n\nFrom here on, there were at least three ministerial-level contacts between Pakistan and Saudi Arabia, until September 2023, the month in which then caretaker prime minister Anwar Kakar said on record that the kingdom was willing to invest up to $25 billion in various areas of Pakistan’s economy. At the same time, the army chief held a series of meetings with Pakistan’s business community. While no on-the-record remarks were made at these, those in attendance told the media that the $25bn figure was repeated and had gone further still.\n\nAccording to a report in this newspaper at that time, the remarks claimed that Pakistan stood to access anywhere from $75bn to $100bn between the kingdom, Qatar and the UAE once the matters under discussion reached fruition. The figures were much discussed at the time, but not taken very seriously.\n\nThe largest priority for Pakistan was the search for resources with which to fire up the next growth spurt.\n\nSince then, the army chief has made four more official visits to the kingdom, each followed by a statement laying the emphasis on security-related cooperation. The last of these came this September with the signing of the defence pact, and followed most recently by the announcement of the so-called Gaza peace plan by President Donald Trump.\n\nThe pace and frequency of these contacts was an indication that something was in the process. Whatever it was, it now appears to be moving towards closure. The official statements make no mention of any kind of assistance package for Pakistan. The only indication we have about that is the remarks attributed to the army chief as well as the then interim prime minister in September 2023.\n\nBut it stands to reason that whatever “security-related cooperation” Pakistan has been discussing with Saudi Arabia would have some sort of benefit for Pakistan too. And over the course of this dialogue Pakistan has been implementing a gruelling IMF-mandated adjustment, starting in July 2022 with accession to the Stand-by Arrangement, and renewed again in September 2024 with the start of the Extended Fund Facility. During these years Pakistan also fought a massive battle against a raging inflationary fire that destroyed people’s purchasing power. In the years since inflation was finally doused, unemployment has risen as have the numbers of those living below the poverty line, while growth has remained moribund. If Pakistan sticks to the targets benchmarked in the Fund programme, it will fester in low growth till at least 2029. This is not a sustainable situation for any government.\n\nHence, the largest priority for Pakistan during these years was the search for resources with which to fire up the next growth spurt. Following the conflict with India in May 2025, another priority was added: the search for resources with which to pay for the next generation of arms acquisition.\n\nThe defence pact and peace plan appear to cast some light on the developments these years. Details are still scant but a few things are easy to see. First, the whole enterprise is off to a bad start, as the foreign minister had to clarify immediately that the text of the agreement released by the White House is not the same as the text that Pakistan had agreed to. There are wide gaps between the joint statement issued by the signatory countries and the text released by the White House. Second, the plan contains too many moving parts and subjective elements that give the Israeli leadership too much discretionary authority under which to shift the goalposts for complia­nce (something they are notorious for doing). Third, the plan contains no credible roadmap tow­ards an eventually Palestinian state, which can be the only viable endpoint to anchor a just and lasting peace. Fourth, both the American president and the Israeli prime minister used very troubling language when announcing the plan. They both said in the absence of Hamas agreement and full compliance, Israel would be free to “finish the job”, words that point towards the extermination of the remaining population of Gaza.\n\nPast bailouts for Pakistan brought conditions that pitted the authorities here against long-standing positions taken over the years. Following 9/11, for instance, Pakistan had to turn against the jihadi-military nexus it had nurtured throughout the 1990s. The Musharraf regime struggled with this condition and was widely accused of playing a double game towards the end of his rule, where he was perceived to be fighting the Taliban with one hand while supporting them with the other.\n\nThe new set of commitments that Pakistan is being sucked into now, seem to be more complex, more intractable, and possibly putting it on a path to reverse long-standing positions it has taken regarding Palestine. Failure risks reigniting the genocide, while success faces the prospect of running into Israeli intransigence. In short, the path to this bailout is probably more fraught than any in the past.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68dde55226d0b.jpg",
  "retrievedAt": "2025-10-12T13:05:41.699Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946026/a-bailout-too-far",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T02:37:53.000Z"
}
