{
  "title": "Project to link Margalla Avenue with Peshawar motorway on the anvil - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Another mega project to link Margalla Avenue with the Peshawar Motorway (M-1) is on the cards, as the federal government is planning to direct either the Capital Development Authority (CDA) or the National Highway Authority (NHA) to complete it.\n\nThe Margalla Avenue, which starts at E-11 and ends at GT Road in Sangjani, will be linked with the M-1 through the proposed project.\n\nOut of the total 5.2 kilometres of road, 2.7 km falls within Islamabad’s limits while 2.5 km falls under the jurisdiction of Rawalpindi.\n\nThe Islamabad portion is to be executed by CDA, while the NHA is supposed to complete the Rawalpindi portion.\n\nGovt mulls giving entire scheme to CDA for execution in one go\n\nHowever, sources said the federal government is now planning to direct the NHA to surrender this project in favour of the CDA so the civic agency can complete it in one go.\n\nThe matter has recently been discussed at the federal level, and the prime minister is expected to make a decision soon.\n\nThe proposed road will start near GT Road (the current ending point of Margalla Avenue) and culminate near AWT Housing Society. It will be a controlled-access road.\n\nAccording to CDA’s approved PC-I worth Rs3.5 billion, it will construct a 2.7 km three-lane dual carriageway with two-lane service roads, a cloverleaf interchange, a flyover, one underpass, eight culverts and three subways.\n\nMeanwhile, NHA’s PC-I worth Rs 4.2 billion envisages a three-lane dual carriageway without service roads, with one flyover, one bridge, seven cattle creeps/underpasses and 10 box culverts.\n\nOfficials from the engineering wing said that if the government decides that the entire project be executed by CDA, then NHA will have to transfer Rs4.2 billion to CDA for the construction work.\n\nNHA and Rawalpindi authorities will also have to complete land acquisition on their side. Meanwhile, district administration and CDA will carry out land acquisition for the Islamabad portion.\n\n“Collectively, the project of both portions amounts to Rs7.7 billion in addition to the land acquisition cost,” said an official. He added that the project would be launched soon, whether by a single agency or separately, but work would begin in either case.\n\nAccording to a CDA working paper, the maximum benefit from Margalla Avenue cannot be achieved until it is linked to the M-1.\n\nThe project comprises a six-lane road facility and aims to provide an alternative route for commuters travelling to Islamabad from GT Road (N-5) and vice versa.\n\nIn 2021, then prime minister Imran Khan directed the CDA to develop the portion falling within Islamabad, while the Rawalpindi Development Authority (RDA) was asked to construct the Rawalpindi section.\n\nHowever, the subsequent PDM government tasked the NHA with the Rawalpindi portion.\n\nIt is worth noting that Margalla Avenue from E-11 is the principal road, with a right of way of 600 feet. However, CDA constructed the road on around 400 feet of the area from D-12 to GT Road and has yet to decide about the acquisition of the remaining area and built-up structures falling in the alignment. Fencing work on this portion is also pending.\n\nWhen contacted, CDA’s Member Engineering, Syed Nafasat Raza, said the civic agency has completed its homework for starting the project.\n\n“Our PC-I is already approved and we want to start this project soon. As far as the Rawalpindi portion is concerned, if the federal government directs us, we will execute it in one go,” he said, adding that once completed, the project will be hugely beneficial for the public.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:05:44.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945958/project-to-link-margalla-avenue-with-peshawar-motorway-on-the-anvil",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T02:04:55.000Z"
}
