{
  "title": "Karachi civil society protests detention of Pakistani activists onboard Gaza flotilla, demands release - Pakistan - DAWN.COM",
  "author": null,
  "content": "Civil society and advocacy groups gathered on Thursday outside the Karachi Press Club to protest against the detention of activists aboard the Gaza Sumud Flotilla (GSF), calling on the government to demand the release of the Pakistani delegation, led by former Jamaat-i-Islami (JI) senator Mushtaq Ahmad Khan.\n\nOn Wednesday, the GSF, carrying aid to Gaza in its attempt to break Israel’s blockade, was intercepted by Israeli military forces. On board the GSF were over 400 activists from 40 countries, among them a five-member delegation from Pakistan.\n\nThursday’s demonstration, organised by the Pakistan Palestine Forum (PFF) in collaboration with the Palestine Action Coalition (PAC) and the non-profit organisation Human Rights Council of Pakistan, aimed to mobilise the public against the state’s inaction.\n\nPeople of all ages gathered, chanting slogans for a free Palestine. The demonstrators demanded the immediate release of the detained Pakistanis and called on the government to take concrete action against Israel.\n\n“It is the responsibility of the government to ensure the safe return of the Pakistani delegation on board the GSF,” said Jamshed Hussain of the Human Rights Council of Pakistan while addressing the crowd.\n\nHussain recalled that his group, along with PPF, had initially urged the government to facilitate the flotilla, anticipating Israel’s attack; however, “our concerns were ignored,” he said.\n\n“The five Pakistanis on board are our national heroes,” Hussain said, lamenting that “while governments of Italy and France sent fleets to ensure the safe passage of the flotilla, Pakistan — despite being a muslim country — failed to follow suit”.\n\nAnosha Kausar of the PFF echoed similar concerns, telling Dawn.com that “It was particularly distressing for Pakistanis to embark on such missions since there was very little likelihood of governmental support.” Yet, she remained hopeful that “momentum for the movement is building up”.\n\nSpeaking to Dawn.com, Hussain called on the people to “stand united in their demand for the Pakistanis on the GSF to be released and brought back home safely,” vowing to continue the protest “lest they suffer any harm.”\n\nHussain warned that “by ignoring the plight of the Palestinian people, we are setting a dangerous precedent”.\n\n“We must decide which side of history we will choose to stand on,” he said, expressing disappointment at Pakistan’s endorsement of Trump’s Gaza peace plan.\n\nOn Monday, Pakistan hailed Trump’s 20-point plan, with Prime Minister Shehbaz Sharif welcoming it, drawing ire from the political sphere.\n\nAmong the many participants was Noureen, a housewife and a caterer, who felt the government’s inaction had forced “ordinary citizens like her to come out on the streets”.\n\nHowever, speaking to Dawn.com, Naureen remarked, “As a mother, I can not turn away from the suffering of the Palestinian children, just as I can not see my own children harmed.” While another demonstrator, Ehtaram, who had come to attend with his wife and two children, thought that “we must pressurise our government to take stern action against Israel, the way Colombia did”.\n\nEarlier today, Colombian President Gustavo Petro ordered the expulsion of the entire Israeli diplomatic delegation from Colombia, a move triggered by the detention of two Colombian nationals aboard the Gaza aid flotilla.\n\nThe 45-vessel flotilla, with activists and politicians including Greta Thunberg on board, departed in late August to break Israel’s blockade of Gaza.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/022038316e9287b.webp",
  "retrievedAt": "2025-10-12T13:05:37.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946146/karachi-civil-society-protests-detention-of-pakistani-activists-onboard-gaza-flotilla-demands-release",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T16:34:45.000Z"
}
