{
  "title": "Punjab to dole out ‘ATM cards’ to aid flood survivors - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Over 200 villages along Sutlej await govt help to return to their homes\n• Farmers’ body demands $10bn in compensation from ‘world’s rich’\n\nLAHORE: In a move reminiscent of the prepaid debit cards issued in the wake of the 2010 floods, the Punjab government has decided to issue ‘ATM cards’ to flood survivors across the province after due verification.\n\nDubbed ‘Maryam Nawaz Sharif Flood Relief ATM Cards’, these will be issued after verification from the Punjab Info­rmation Technology Board (PITB), Pun­jab Land and Revenue Authority (PLRA), and the National Database and Regis­tration Authority (Nadra), said Provincial Disaster Management Autho­rity (PDMA) Director General Irfan Ali Kathia.\n\nThe cards will be issued to flood victims to compensate for their losses due to the devastating floods, he added.\n\nThe decision to launch a new mechanism for distributing flood aid comes amid a war of words between the PML-N and the PPP — both allies in the Centre and ruling Punjab and Sindh, respectively — over the relief measures.\n\nThese new debit cards will be issued after a survey, currently underway in the flood-affected areas. CM Maryam has assured that the government would not only reach out to every flood-affected individual, but would also compensate them.\n\nAfter the survey, the amount will be allocated in light of the losses and be transferred to the ATM card.\n\nAccording to a PDMA report, 1,314 survey teams are actively engaged in flood-affected areas across 27 districts of the province. So far, survey teams have collected data from 41,735 flood victims. Details of crop losses from 28,632 farmers have also been compiled, covering 49,510 acres of the affected land.\n\nMoreover, data has been collected on 12,500 damaged houses, 603 farmers lost their livestock, and a total of 2459 cattle perished.\n\n200 villages under water\n\nMeanwhile, more than 200 villages in Multan, Lodhran, and Bahawalpur districts remain submerged due to breaches in the embankment along the Sutlej River, while the government has pledged to plug all fissures within a week.\n\nFor the past 20 days, these areas have been submerged. However, stagnant water in these villages has decimated homes, destroyed crops, and left thousands of residents homeless.\n\nAfzal Baloch of Kotla Chakar said water was not moving. “Our homes are destroyed; our crops are gone. We have been patient for 20 days, but now we need this water to be drained so we can even begin to think about rebuilding our lives.”\n\nIrrigation officials confirmed that a major breach in the Noraja Bhutta embankment, from where water from the River Sutlej was entering the area, was plugged, which had stopped fresh inflows.\n\nProvincial Minister for Irrigation Kazim Ali Pirzada stated that teams were engaged in closing the breaches at the Noraja Bhutta bund in Jalalpur Pirwala. So far, four out of seven breaches in the flood bund have been successfully closed, he said, adding that the breaches would be plugged within one week.\n\nOverhaul of agri policies\n\nSeparately, the Pakistan Kissan Rabita Committee (PKRC) has called for immediate international financial assistance, a moratorium on foreign debt repayments, and a complete overhaul of domestic agricultural and fiscal policies.\n\nSpeaking at a press conference here on Wednesday, PKRC General Secretary Farooq Tariq said the committee discussed the climate change problem and the ensuing floods and demanded that rich countries must immediately provide at least $10 billion to Pakistan as a direct aid grant as compensation for the damage they caused to the climate.\n\nThe statement said that the flood-affected farmers, particularly in Sindh and Punjab, must be provided with immediate targeted cash support, including grants for seeds, fertiliser, and small machinery. Furthermore, their debts should be cancelled, and interest on agricultural loans for affected districts should be waived to enable them to replant and restore production.\n\nHe said the committee demanded the abolition of corporate farming and called for land redistribution. Specifically, the land of public-sector agricultural farms should be given to the tenants who have been cultivating it for over 100 years.\n\nAmjad Mahmood in Lahore also contributed to this report\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68ddadd026a33.jpg",
  "retrievedAt": "2025-10-12T13:05:46.184Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945976/punjab-to-dole-out-atm-cards-to-aid-flood-survivors",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:30.000Z"
}
