{
  "title": "21 terrorists killed, 4 held in Balochistan - Newspaper - DAWN.COM",
  "author": null,
  "content": "QUETTA: At least 21 suspected terrorists were killed in a series of operations carried out by security forces and the counterterrorism department (CTD) of police in Quetta, Sherani, and Kech districts, officials said.\n\nAlso, four terrorists disguised in women’s clothing were arrested in Khuzdar on Wednesday, according to the military’s media wing.\n\nAccording to CTD officials, an operation was conducted in the Aghbarg area on the outskirts of Quetta after a tip-off about the presence of terrorists.\n\nA CTD team cordoned off the locality, prompting armed militants to open fire. Security personnel retaliated, and an intense exchange of fire ensued for over an hour, during which automatic weapons were used.\n\n“As a result of the gun battle, 10 terrorists were killed on the spot,” a CTD spokesman said, adding that two personnel sustained injuries and were shifted to hospital. Large quantities of arms, ammunition, explosives, and other equipment were seized from the site. The slain terrorists, however, remain unidentified. Further investigation is underway.\n\nIn a separate operation in Sherani district, eight terrorists were killed when security forces struck a suspected camp of the outlawed Fitna al Khwarij in the rugged Mughal Kot area. Officials confirmed that a cache of sophisticated weapons, ammunition, and equipment was recovered.\n\nMeanwhile, the Inter-Services Public Relations (ISPR) said that 13 terrorists belonging to Fitna al Khwarij and Fitna al Hindustan — the state’s terms for the banned Tehreek-i-Taliban Pakistan and Baloch separatist outfits, respectively - were killed in Quetta and Kech on Sept 30 and Oct 1.\n\nDuring the Quetta operation, security forces engaged a militant hideout, resulting in the deaths of 10 “Indian-sponsored Khwarij.” Another IBO in Kech district neutralised three terrorists affiliated with Fitna al Hindustan. Weapons, ammunition, and explosives were recovered from both sites.\n\nFour held\n\nAdditionally, ISPR reported that four terrorists were apprehended in Khuzdar district during an intelligence-based operation (IBO).\n\nThe suspects, allegedly linked to the Indian proxy group Fitna al Hindustan, were captured while attempting to flee disguised in women’s attire. Weapons and ammunition were also seized.\n\nAccording to the ISPR, the arrested terrorists had been involved in multiple attacks in the region. It reiterated that security forces remain committed to eradicating terrorism and reaffirmed the nation’s determination to bring all perpetrators and their facilitators to justice.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:05:43.295Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946000/21-terrorists-killed-4-held-in-balochistan",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:21.000Z"
}
