{
  "title": "Despite misgivings, Muslim bloc ‘may still support’ Trump’s Gaza plan - World - DAWN.COM",
  "author": null,
  "content": "• Plan announced by White House differs from terms agreed between Trump and heads of Muslim countries\n• Distrust remains over proposed International Stabilisation Force\n• Hamas seeks changes to ‘disarmament’ clause\n\nDESPITE their misgivings with the ‘pro-Israel’ draft of US President Donald Trump’s plan to bring peace to war-ravaged Gaza, countries from the eight-member Muslim bloc may yet push for it to be accepted.\n\nOfficials from Qatar and Pakis­tan have already implied — albeit diplomatically — that the plan announced by the White House was quite different from the one they signed up to in New York.\n\nBut some countries — especially those in Gaza’s immediate neighbourhood — also believe they have secured key concessions, such as Trump’s refusal to recognise Israeli annexation of the West Bank and a US commitment that Palestinians will be allowed to remain in Gaza.\n\nIsrael has also agreed, under the plan, not to permanently occupy the Gaza Strip.\n\n“Gaza’s reconstruction represents a major economic opportunity for Egypt, ranging from debris removal to infrastructure development and urban projects. Such operations would channel billions of dollars into Egypt, directly and indirectly, boosting its economy in the long run,” Middle East Eye quoted a senior Egyptian political source as saying.\n\nThis would also end the looming threat of hundreds of thousands of Palestinians from Gaza being expelled into the Sinai Peninsula.\n\n“Accepting Trump’s plan to halt the war in Gaza would completely end the displacement scheme, which had become a source of deep tension between Cairo and Tel Aviv,” Middle East Eye reported.\n\nThe most surprising changes concerned the number of Palestinians set to be released as part of the deal, and the phased approach to the Israeli withdrawal from the Palestinian enclave.\n\nWhere previously hundreds of Palestinian prisoners would have been released alongside 1,700 men, women and children detained from Gaza, now just 250 inmates would be freed with the detainees.\n\nOriginal drafts mandated 600 aid trucks entering Gaza per day, while the new version’s vague language afforded no such commitment.\n\nThere were also changes to what had been agreed on governance: Gaza would be run by a ‘Board of Peace’, to be led by Trump and former British PM Tony Blair, cutting out international ­con­sult­ation.\n\nTroop deployment\n\nMeanwhile, the so-called Inter­national Stabilisation Force (ISF), which was slated to train Palestinian police to take over security duties, suddenly had expanded powers, which suggested increased Israeli control.\n\nNot only was the Israeli troop withdrawal staggered without clear deadlines, the addition of a “security zone” around the perimeter appeared to signal the prospect of a permanent presence within Gaza.\n\nThe ISF was one of the main issues discussed in the 45-minute meeting between Trump and leaders of Muslim nations in New York last week.\n\nAccording to Middle East Eye, Trump had asked all countries present — Pakistan, Jordan, UAE, Indonesia, Turkiye, Saudi Arabia, Qatar and Egypt — to contribute troops to the force.\n\nIn the wake of Trump’s announcement, all eight countries issued a joint statement welcoming the Gaza plan and expressing their readiness to help finalise it.\n\nBut despite those positive words, behind closed doors serious concerns still exist in these countries about the prospect of deploying their soldiers on the ground in Gaza.\n\n“Who will lead this force? Who will decide when to intervene? What will be the rules of engagement?” another senior regional official asked. “These questions all need to be discussed.”\n\nThe official suggested that further negotiations involving Arab and Muslim countries, the US, Israel and Palestinian representatives would be necessary before such a force could be viable.\n\nThe source added that Turkey, Jordan and Egypt sought to have UN Security Council approval for the force to legalise the move in the eyes of the international community, but the US and Israel dropped it from the draft plan.\n\n“The Israelis don’t want UN involvement in any matter related to Palestine,” Middle East Eye quoted a source as ­saying.\n\nA Turkish source familiar with Ankara’s position said Turkey is considering deploying troops in Gaza, depending on variables such as the structure and leadership of the force.\n\nHowever, those familiar with Israeli thinking say Netanyahu would oppose any Turkish participation in such a mission, which is exactly why Hamas may insist on Turkish involvement.\n\nPressure on Hamas\n\nDespite dissatisfaction with several elements, officials from Turkey, Qatar and Egypt convened quickly in Doha on Tuesday to encourage Hamas to give a positive response to Trump’s proposal.\n\nTurkish Foreign Minister Hakan Fidan told the media over the weekend that while the US was tasked with persuading Israel to accept the plan, Turkey and other regional players would focus on convincing the Palestinians.\n\n“Hamas leaders were briefed on its terms immediately after the official announcement, with an emphasis that this was the last opportunity to end the war and ease the suffering of the Palestinian people,” Middle East Eye quoted a source as saying.\n\nHowever, Hamas officials still want amendments to clauses in President Trump’s peace plan including on disarmament, a Palestinian source close to the group’s leadership told AFP on Wednesday.\n\nIn their discussions in Doha, the group said it needed “two or three days at most” to respond.\n\nHamas wants to amend some of the clauses such as the one on disarmament and the expulsion of Hamas and faction cadres, the source said.\n\nIts leaders also want “international guarantees for a full Israeli withdrawal from the Gaza Strip” and guarantees that no assassinations attempts will be made inside or outside the territory.\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/02074649d96f285.webp",
  "retrievedAt": "2025-10-16T20:40:01.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945999/despite-misgivings-muslim-bloc-may-still-support-trumps-gaza-plan",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:21.000Z"
}
