{
  "title": "PPP calls on Maryam to ‘rethink her attitude’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Meeting to end acrimony decides to take up the matter with Punjab CM, her father Nawaz\n• Kaira calls BISP ‘transparent aid method’, asks CM not to peddle ‘narrow nationalism’\n• Azma hits back, says PPP cannot ‘steady itself’ by targeting PML-N\n\nLAHORE: As PPP and PML-N bigwigs met in Islamabad to find a way out of the row sparked by Punjab Chief Minister Maryam Nawaz’s recent outburst against the coalition partner, the former has asked the Punjab CM to “rethink her tone” while speaking about water rights and Sindh’s ruling party.\n\nDuring the meeting between Deputy Prime Minister Ishaq Dar, Law Minister Azam Nazir, Senator Rana Sanaullah and PPP’s Navid Qamar and Ijaz Jakhrani at the NA speaker’s office, it was agreed that the matter would be taken up with PML-N President Nawaz Sharif and CM Maryam Nawaz.\n\nThe war of words, which began over flood compensation, expanded to water rights on the Indus River, as the Punjab’s chief minister told the PPP leadership to keep its advice to itself. In response, the PPP lawmakers stayed away from the National Assembly and Senate sittings to protest the diatribe.\n\nAddressing a press conference, PPP leader Qamar Zaman Kaira urged the CM not to fan ‘narrow nationalism’.\n\n“Differences should be kept within limits. You (Maryam Nawaz) are a woman and our sister, and our leader (Benazir Bhutto) too was a woman. Reconsider your tone. What do you want to achieve by playing narrow nationalism… Do you want the rest to leave Punjab, and their rights to be ended?”\n\nFlanked by Usman Malik, Chaudhry Aslam Gill, and Faisal Mir, Mr Kaira said the country could not be run by a “single leader or institution”. “This country does not belong to any one person; it belongs to all of us. You (Maryam Nawaz) are not just a CM, you are also the daughter of Nawaz Sharif and the niece of Prime Minister Shehbaz Sharif. If you say that you will not allow anyone to speak, this approach is not appropriate in any way. Reconsider this attitude,” he said.\n\nHe further said the floods had caused immense damage, and the entire nation spoke with one voice on this. “Where something is wrong, we will point it out and we will protest. But when we give opinions or criticism, you start threatening. The question concerns flood management, but the response is to target the Sindh government,” he said.\n\nThe PPP leader said BISP was even endorsed by the IMF. “It…provides immediate relief, and this was done before as well. If you don’t want to use BISP, fine; but in terms of transparency, BISP stands first, which is why the IMF itself directed that Rs200bn be added to it in this year’s budget. Our objections concern the relief mechanism,” he added.\n\nIn response to the CM’s remarks about the canal project, he said there already existed a formula for water distribution, and the matter must be decided in the Council of Common Interests by the federal and provincial governments together. “The PPP has been unfairly blamed regarding canals.”\n\nPPP South Punjab President Makhdoom Ahmad Mahmood said if the Punjab government was criticised, it was because of its failed policies that left the Seraiki belt submerged after floods. “Even in the past, there have been worse floods, yet never before were the people abandoned in such a helpless state,” he said, calling out the government for its ‘choreographed’ response.\n\nAzma’s presser\n\nOn the other hand, Punjab Information Minister Azma Bokhari said the PPP leaders were competing to hold press conferences against the Punjab government while claiming they were not politicising the plight of flood victims.\n\nAzma Bokhari further said that the PML-N took pride in “its popularity and public service”, and the PPP should focus on building its own support instead of such rhetoric. “Such statements make no difference, and PPP cannot stand on its own feet this way,” she added.\n\nShe said this was not merely political differences but a deliberate attempt to target Punjab collectively. “Personal attacks will naturally invite a response. “You may use BISP in Sindh; we have no objection,” she said.\n\nWith input from Imran Gabol\n\nPublished in Dawn, October 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68ddb3b8dfc22.jpg",
  "retrievedAt": "2025-10-16T20:39:59.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946001/ppp-calls-on-maryam-to-rethink-her-attitude",
  "dateList": "2025-10-02",
  "date_published": "2025-10-02T01:58:21.000Z"
}
