{
  "title": "AJK PM calls for early implementation of UN resolutions to resolve Kashmir issue",
  "link": "https://www.app.com.pk/national/ajk-pm-calls-for-early-implementation-of-un-resolutions-to-resolve-kashmir-issue/",
  "date_published": "2021-01-31T09:44:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jan 31 (APP):Azad Jammu & Kashmir (AJK) Prime Minister Raja Muhammad Farooq Haider Khan on Sunday appealed to the United Nations to take practical steps for implementation of the UN Security Council’s resolutions for settlement of Kashmir issue without further delay for emergence of durable and ever lasting peace in the region.\nIn a statement, he also urged upon the international community to fulfill its obligations to help secure the Kashmiri people’s right to self determination in accordance with the United Nations relevant resolutions.\nHe said Kashmiri people were under military siege for the last 545 days but they were determined to continue their struggle till the objective of Kashmir liberation was achieved.\nHe said Kashmiri had been facing Indian repressions for the last over seven decades and demanding to implement the United Nations agreed resolutions on Jammu and Kashmir but their fundamental right had been denied by India.\nHe said India had intensified the reign of terror in the occupied Kashmir which had no example in freedom history.\nThe prime minister said that India had failed to suppress the indigenous freedom movement with the use of brute force and had given an open license to Indian forces for the mass genocide of innocent Kashmiri people to crush the freedom movement.\nHe said apart from killings of Kashmiri the Indian government was also engaged to change the demography of the state and settling the non state actors , RSS extremists and retired soldiers in occupied Kashmir to turn the Muslims majority areas in to minority.\nRaja Farooq Haider drew the attention of the international human rights organization towards flagrant human rights violations by the Indian forces in occupied Kashmir and urged them to take notice of Indian atrocities and mass killings of Kashmiri at the hands of brute Indian forces.",
  "retrievedAt": "2025-08-11T20:18:03.341Z"
}
