{
  "title": "ICT moves towards digital land records, DC pays surprise visit to revenue center",
  "author": null,
  "content": "ISLAMABAD, Jul 03 (APP):To modernize land management and improve service delivery, the Islamabad Capital Territory (ICT) administration has started putting land ownership records online.\nOut of a total of 112 land areas, or mouzas, the digital system is already active in 24. These include facilities for issuing property ownership documents, sales deeds, and other related records through an online portal.\nIn this regard, Deputy Commissioner Islamabad, Irfan Nawaz Memon, paid an unannounced visit to the Revenue Center in Chatta Bakhtawar to inspect the digital system and check how it was serving residents.\nDuring his visit, the DC reviewed how citizens were using the new system and met several people to hear their feedback. He said residents can now easily register their property transactions in the mouzas that have been brought online.\n“The work of putting land records online for the entire city is in progress,” said DC Memon, adding that the administration aims to digitize records of 25 more mouzas within the next two months. This will take the number of digitized mouzas to nearly half of the city’s total.\nHe emphasized that the goal is to make all land data available digitally, so that people no longer have to visit offices repeatedly or rely on middlemen for routine work. By accessing records online, citizens will be able to verify ownership, carry out transfers, and resolve land-related issues faster.\nDuring the visit, DC Memon also instructed officials to prioritize cases that have been delayed and ensure they are resolved as soon as possible. He stressed that those coming to the revenue centers must be treated with respect and that services should be delivered efficiently and transparently.\nHe made it clear that any negligence regarding public complaints will not be tolerated. Officials have been directed to take complaints seriously and ensure citizens don’t face unnecessary hurdles when using the revenue center.\n“The district administration is focused on providing timely services to citizens through the new digital system,” said DC Memon. “We want to eliminate unnecessary delays and bring transparency to land-related procedures.”\nThe move towards digitization is part of a broader reform agenda by the ICT administration. Officials believe that putting records online will help reduce corruption, improve accuracy, and make public service delivery more efficient.\nSo far, the 24 mouzas where the system is live are already seeing benefits. Residents can apply for property verification, obtain ownership documents, and complete transactions without needing to rely on traditional paperwork. These services are accessible at the revenue centers and will eventually be integrated into Islamabad’s e-governance platforms.\nDuring the visit, the Deputy Commissioner interacted with several citizens to get feedback on their experience with the new system. Many expressed satisfaction with the online record availability and appreciated the efforts to make services more accessible.\nOfficials at the center were instructed to streamline operations and ensure no case is left pending unnecessarily. They were also told to improve communication with citizens and guide them clearly about the online services.\nDC Memon reiterated that the administration is committed to public service and that citizens should not hesitate to raise their concerns. A proper complaint redressal mechanism is in place to deal with issues swiftly.\nThe Islamabad administration aims to bring all 112 mouzas under the digital system in phases. The current pace of work suggests that a significant portion will be completed within the current year, making land management in the capital more transparent and citizen-friendly.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:12:11.901Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-moves-towards-digital-land-records-dc-pays-surprise-visit-to-revenue-center/",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T15:23:00.000Z"
}
