{
  "title": "SC seeks stakeholders’ details and nomination of focal person for Fast Track Digital System Delivery",
  "author": null,
  "content": "ISLAMABAD, Jul 03 (APP): In a major step towards judicial reforms and digital transformation, the Supreme Court of Pakistan, under the vision of the Chief Justice, has successfully implemented an E-Filing System across all its registries at Islamabad, Lahore, Peshawar, Karachi, and Quetta.\nThe system enables electronic submission of case files alongside traditional paper-based submission. Digital copies of Petitions, Memos, Judgments, and Orders are uploaded to the Court’s Case Management System (CMS), from where they are automatically transmitted to relevant parties and respondents via auto-generated emails.\nThese documents can also be accessed online through the Supreme Court’s Case Search Page. This move reduces paper correspondence and thus significantly reduces time and cost.\nTo ensure seamless delivery of digital documents and broader adoption of this transformative system, the Supreme Court has asked Supreme Court Bar Association (SCBA) and Pakistan Bar Council (PBC) to provide the email addresses and mobile numbers of all Advocates-on-Record (AORs) and Advocates Supreme Court (ASCs) for their registration with the CMS.\nMoreover, the Attorney General for Pakistan, the Secretary Cabinet Division, all Advocates General, Prosecutors General, and Chief Secretaries of Provinces have also been asked to nominate focal persons authorized to coordinate on e-filing matters, along with their official email addresses and mobile numbers. This will enable government departments, line ministries, and state institutions to respond to litigation where they are impleaded as a necessary party.\nAll relevant details are to be sent to the Supreme Court at ecourt@scp.gov.pk.\nFor technical assistance, stakeholders may contact:\nThis initiative underscores the Supreme Court’s commitment to a citizen-centric, technology-driven justice system, reducing delays, increasing efficiency, and improving access to justice for legal practitioners, government institutions, and litigants alike. This initiative shall reduce the transactional cost of litigants.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:12:06.382Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-seeks-stakeholders-details-and-nomination-of-focal-person-for-fast-track-digital-system-delivery/",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T18:21:00.000Z"
}
