{
  "title": "Housing minister hands over plot possession letters in Sky Gardens project",
  "author": null,
  "content": "ISLAMABAD, Jul 03 (APP):In a significant milestone for the Federal Government Employees Housing Authority (FGEHA), Federal Minister for Housing and Works, Mian Riaz Hussain Pirzada, formally handed over possession letters to the allottees of the Sky Gardens Housing Project in a ceremony held on Thursday at the project site.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/07/1.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nSky Gardens is a flagship joint venture between the Federal Government Employees Housing Authority and Commoners Sky Garden located in a scenic hilly region along the New Murree Expressway the project spans over 11,000 kanals with 7,200 kanals transferred to FGEHA for development in 2019.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/07/2.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nThe project primarily caters to federal government employees registered under the 2009 membership drive.\nDespite encountering multiple delays over the years including inquiries by National Accountability Bureau (NAB) and scrutiny by the Supreme Court, the project has now resumed momentum following clearance from relevant institutions.\nIn this project construction agreement delayed for two years due to proceedings in NAB.  The project comprises ten residential blocks where the development work is actively underway, and as part of the first phase, 80 allottees have received possession of fully developed plots spanning 250 kanals in the priority area of Block A, which is free of all encumbrances and equipped with all essential amenities.\nAddressing the media, Minister Mian Riaz Hussain Pirzada expressed deep sense of fulfilment that after a long and difficult wait, allottees are finally witnessing progress. “It is a matter of great contentment for me to see a long-standing promise materialize.\nHe expressed deep empathy for those who had invested their hard-earned money and braved years of uncertainty, noting that they are finally beginning to see their long-awaited dreams come to fruition.\nThis marks the first drop of progress, and I’m confident that other stalled projects will soon gather momentum as well, the minister affirmed.\nThe minister underscored that since taking oath as the Federal Minister for Housing and Works, he has maintained unwavering commitment to the timely execution of housing initiatives and the elimination of corruption across the Ministry’s affiliated departments.\nHe strongly condemned the delays and inefficiencies of the past and reiterated his zero-tolerance policy toward mismanagement and malpractice.\nHe clarified that he has been elected to the Provincial and National Assemblies six times, reflecting enduring public trust and consistent electoral support.\n“I have unwavering faith in the power of the ballot and a strong belief in serving the people with integrity and dedication,” the minister stated.\nDuring the ceremony, Secretary Housing and Works and Director General FGEHA also addressed the participants.\nDG FGEHA briefed the audience on the projects’ progress and expressed optimism that three additional blocks will be ready for possession by December 2025.\nBoth officials reiterated the Ministry’s resolve to steer the department out of past challenges and restore public trust through transparent and efficient service delivery.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:12:54.965Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/housing-minister-hands-over-plot-possession-letters-in-sky-gardens-project/",
  "dateList": "2025-07-03",
  "date_published": "2025-07-03T12:46:00.000Z"
}
