{
  "title": "PML-N launched uplift projects only on paper: Fawad",
  "link": "https://www.app.com.pk/national/pml-n-launched-uplift-projects-only-on-paper-fawad/",
  "date_published": "2021-12-11T14:30:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 11 (APP):Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain&nbsp; on Saturday said that the federal government has spent Rs 35 billion on the Green Line project which would provide modern travelling facility to the people of Karachi.&nbsp;  Taking to media here on the occasion of 14th International Urdu Conference, he said Pakistan Mulsim League – Nawaz (PML-N) launched the projects only on paper. He said&nbsp; the Karachi people were well aware of the performance of both the PML-N and the Pakistan Peoples Party.\nHe said the incumbent government had started work on Jalalpur canal project in Jhelum District which was envisioned in 1898.&nbsp;  He said development work could not be done through lip service as was the habit of the past rulers, practical steps were needed to be taken and Pakistan Tehreek -e- Insaf has done that.&nbsp;  The minister said young generation should be involved in the positive activities to keep them away from extremism.\nHe said Sports Festival in Islamabad and Urdu Conference in Karachi by Arts Council were positive steps in this direction.&nbsp;  The minister said Urdu was one of the few major languages spoken world over, adding, literature and poetry&nbsp;in Urdu had&nbsp; no competition.\nFawad said there were young poets and writers among university students who needed exposure.\nThe minister said the government was also strengthening local  film industry. He said a technology university was  being set up to support modern filmmaking. Besides, Fawad said expensive films were being made on the lives of Tipu Sultan and Zaheeruddin Babar.\nChaudhry Fawad Hussain opined that this work should have been done 20 years ago but unfortunately in the past no one paid attention.He said on the one hand people complaint about unemployment but on the other hand availability of skilled manpower was also an issue.  The minister said Pakistani media industry was facing shortage of technical people and there was need of global collaboration for skilled workforce.",
  "retrievedAt": "2025-08-11T21:42:31.942Z"
}
