{
  "title": "NAB recovery surges to Rs 456.3 billion in second quarter of 2025",
  "link": "https://www.app.com.pk/national/nab-recovery-surges-to-rs-456-3-billion-in-second-quarter-of-2025/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 09 (APP): The recovery by the National Accountability Bureau (NAB) surged to Rs 456.3 billion during the second quarter of 2025, reflecting a significant increase of Rs 365.29 billion compared to Rs 91.01 billion recovered in the first quarter of the same year.\n\nAccording to a NAB spokesperson, out of the total recoveries amounting to Rs 547.31 billion during the first two quarters of 2025, movable and immovable properties worth Rs 532.33 billion have been disbursed or handed over to various ministries and departments of the federal and provincial governments, as well as financial institutions.\n\nIn addition, 12,611 affectees of different “cheating public at large” cases have also been compensated.\n\nIn just the past two years, NAB has recovered an unprecedented Rs. 5,854.73 billion (Rs. 5.854 trillion)—a figure that is over 700% higher than the Rs. 839.08 billion recovered since the Bureau’s inception.\n\nThis extraordinary milestone reflects the unwavering dedication and tireless efforts of NAB officers across the country, who have successfully reclaimed billions from corrupt and unscrupulous elements.\n\nAccording to the NAB spokesperson, key recoveries in the second quarter of 2025 include the retrieval of 51 Kanal of prime state land worth Rs. 29 billion in Sector E-11, Islamabad, by NAB Rawalpindi. The recovered land has been formally handed over to the Capital Development Authority (CDA).\n\nIn a major case involving cheating the public at large (B4U), NAB secured Rs. 3 billion, which will be disbursed among 17,214 affectees. An additional tranche of Rs. 4 billion is expected to be recovered during the current quarter.\n\nIn another major case involving Banker’s City, NAB has secured the transfer of 640 Kanal and 11 Marla of high-value land. The proceeds from this recovery will be distributed among the affected individuals.\n\nSeparately, NAB Sukkur successfully recovered land worth Rs. 25.079 billion belonging to the National Highway Authority (NHA), marking a significant achievement in reclaiming public assets.\n\nThe Bureau has also recovered 127 Kanal & 15 Marla of land valued at Rs. 895.160 million, belonging to the Education and Literacy Department, Government of Sindh.\n\nFrom an impressive recovery portfolio, Rs. 384.270 billion worth of forest land was recovered in the quarter ending June 2025, contributing to a total forest land recovery value of Rs. 1,487.77 billion.\n\nNAB Lahore disbursed a tranche of Rs. 3.2 billion, recovered in the Eden case, to 11,880 affectees of the Society.\n\nIn Pak Arab case, eight properties valued at Rs. 3.9 billion were surrendered by the accused and are in the process of transfer to NAB. Proceeds from these assets will be disbursed to 2,500 affectees of the case.\n\nA plea bargain amounting to Rs. 2.181 billion is underway with owners of Elite Town Housing Society, with recovered funds intended for disbursement among 1,789 affectees.\n\nThe National Accountability Bureau (NAB) has reaffirmed its commitment to recovering ill-gotten wealth and unlawfully held state assets. In coordination with Revenue Departments across all provinces, NAB is actively pursuing the retrieval of encroached properties.\n\nPreliminary estimates suggest that state land worth approximately Rs. 5 trillion remains under illegal occupation and is targeted for recovery.\n\nNAB has reiterated its resolve to safeguard public resources and ensure justice for affected citizens. Emphasizing its sustained focus on transparency and accountability, the Bureau has called on all stakeholders to support its mission to uphold the rule of law and deliver tangible benefits to the public.\n\nAccording to the NAB spokesperson, the Bureau remains firmly committed to protecting public interest and recovering national wealth, with ongoing efforts focused on reclaiming state assets and funds owed to the national exchequer.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T10:54:27.503Z"
}
