{
  "title": "Bari Imam Urs continues in Islamabad with tight security, administrative oversight",
  "link": "https://www.app.com.pk/national/bari-imam-urs-continues-in-islamabad-with-tight-security-administrative-oversight/",
  "date_published": "2025-08-10T15:50:39+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 09 (APP): The ongoing Urs of Hazrat Shah Abdul Latif Kazmi, popularly known as Hazrat Bari Imam, is drawing thousands of visitors from different parts of the country.\n\nThe Islamabad district administration has stationed the Assistant Commissioner (AC) Secretariat at the shrine site around the clock to monitor proceedings.\n\nMeanwhile, AC Nilore and AC City are also overseeing arrangements in their respective domains to ensure all activities run according to plan.\n\nAccording to the administration’s spokesperson, special parking areas have been designated for devotees to facilitate orderly access to the shrine. The preparation and distribution of langar (free food) are being closely monitored from start to finish.\n\nSecurity protocols remain strict, with visitors allowed entry to the shrine only after thorough checks. Police have been deployed in additional numbers both inside and outside the shrine premises to maintain order and manage the crowd.\n\nThe spokesperson added that cleanliness measures are being carried out continuously within the shrine complex and surrounding areas. Teams are working to keep the premises clear of waste throughout the Urs.\n\nIn this regard, Deputy Commissioner (DC) Islamabad and the Additional Deputy Commissioner (ADC) General have made several visits to the shrine at different times to review arrangements. The ADC East has specifically inspected the langar preparations being managed by the Auqaf Department.\n\nSimilarly, the Islamabad Food Authority has also deployed its inspection teams on-site to ensure food quality and hygiene standards are maintained for the large number of devotees being served daily.\n\nThe DC Islamabad has directed all departments involved to maintain strict monitoring and coordination until the Urs concludes. These measures aim to ensure that visitors can participate in the annual religious gathering in an organized and safe environment.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T10:52:04.615Z"
}
