{
  "title": "Ijaz Shah for creating awareness against drug abuse",
  "link": "https://www.app.com.pk/national/ijaz-shah-for-creating-awareness-against-drug-abuse/",
  "date_published": "2021-02-24T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP): Minister for Narcotics Control Brig (R) Ijaz Ahmad Shah on Wednesday highlighted importance of creating awareness among masses against drug abuse and purging the society of this menace.\nTalking to media after participating in a walk organized by Anti-Narcotics Force (ANF), he said the drug abuse was faced by the whole country and needed joint efforts to completely eliminate it from our society.\nThe participants of the walk, started from D Chowk and culminated at Parliament House, were carrying placards and pamphlets inscribed with slogans against the drug addiction and its affects on the whole family to create awareness among people especially youth to keep the away from this social evil.\nThe minister said it posed a serious threat to youth of the country.\n“Each one of us needs to play his role in elimination of this menace from our country” he added.\nThe Minister regretted that students of college and universities were falling victim to this menace. “We will do our best to save youth from evil of drug abuse and secure their future” Ijaz Ahmad Shah said.\nThe participants of the walk were holding banners with the slogans, “no to drugs and yes to life”, with the aim of disseminating the message that drugs are a serious threat to human life.\nThe Ministry of Narcotics and Anti Narcotics Force (ANF) is working on drug elimination by a three tier policy including reduction of drug demand, supply and international cooperation to combat the drug abuse and smuggling.\nAlong with the minister, Director General ANF Major General Arif Malik, senior officials of Ministry of Narcotics Control and Anti Narcotics Force also participated in the walk.\nParticipants included students from different schools, colleges and universities, representatives from Pakistan Boys Scouts Association, Pakistan Girls Guide Association, Civil Society, representatives of United Nations organizations working in Pakistan and Non-governmental organizations.",
  "retrievedAt": "2025-08-11T20:24:12.433Z"
}
