{
  "title": "Forces of status quo want continuation of sale, purchase of votes, Imran Khan wants transparency: Shibli",
  "link": "https://www.app.com.pk/national/forces-of-status-quo-want-continuation-of-sale-purchase-of-votes-imran-khan-wants-transparency-shibli/",
  "date_published": "2021-02-24T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP): Minister for Information and Broadcasting Senator Shibli Faraz on Wednesday said opposition parties were representing the status quo for the continuation of sale and purchase of votes and horse trading in politics.\nTalking to media persons, he said that on the contrary, Prime Minister Imran Khan fully believed in strengthening of democracy and fair elections and intended transparency in the Senate elections.\nHe said Imran Khan was striving for eradication of the practice of sale\nand purchase of votes and stood like a rock against the undemocratic practice.\nHe said that democracy would be strengthened if those candidates were elected who believed in party manifesto and philosophy of a party and not those who believed in power of money who would not only recover their own investment but also mint more money.\nAdditionally, he said that real representatives of the people could not come to the parliament through the use of money.\nShibli Faraz said that the government also intended to introduce an electronic voting system in the general elections to ensure transparency, as in the past elections were marred by the allegations of rigging and malpractices.\nThe minister said that Prime Minister Imran Khan and his allied parties stood on the right side and history would highlight the representatives of ‘dark forces’ who wanted to open the door for horse trading in the elections He said that as a Muslim and political worker, he believed that truth would eventually prevail and deceit and fraud would have to face retreat and defeat.\nHe said that the PTI government was ready to accept PML-N demands for re-polling in 20 polling stations in NA-75. He recalled that after the 2013 elections, when the PTI demanded opening of four constituencies, they refused to accept the demand. Finally the polling record of 4 constituencies was opened after long legal struggle by the PTI and the verdict vindicated the PTI stance.",
  "retrievedAt": "2025-08-11T20:24:19.929Z"
}
