{
  "title": "Right of way policy to help create Digital Pakistan: Amin ul Haque",
  "link": "https://www.app.com.pk/national/right-of-way-policy-to-help-create-digital-pakistan-amin-ul-haque/",
  "date_published": "2021-02-24T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP):Minister for IT & Telecommunication Syed Amin-ul-Haque Wednesday said that Pakistan’s First Right of Way Policy was a milestone towards creating “Digital Pakistan” that aims to promote the modern telecommunication services and resolve issues regarding establishment of telecommunication systems.\n“Pakistan offers an open and deregulated market with a licensing regime that is supportive for establishing businesses in the Country focusing on Ease of doing business” the minister expressed these views while addressing launching Ceremony of RoW Policy.\nThe ceremony was attended by Chairperson Senate Committee for IT & Telecom, Rubina Khalid, Chairman NA Standing Committee for IT & Telecom, Secretary IT Ali Khan Jadoon, Secretary IT, Shoaib Ahmed Siddiqui, Chairman PTA Major General (R) Amir Azeem Bajwa, DG, SCO, and Officials from IT & Telecom Ministry, CEOs of Telecom Operators,dignitaries from different sectors and stakeholders.\nHe said, that the government strived to improve its citizens’ quality of life and economic well-being by ensuring availability of accessible, affordable, reliable, universal and high quality ICT services.\nSyed Amin-ul Haque said that due to the investor’s friendly policies of the government, there was a significant presence of multinational companies operating in Technology and Telecom sector of the country.\nThe minister said, “the telecom sector has made significant contributions for economic growth of the country and has contributed over Rs 278.5 billion, to the national exchequer during the last year, which is indeed commendable. Today we have 176 million mobile and smartphones connections with more than 83% tele-density.”\nHe said that the need for high proliferation of mobile broadband services in the country and its impact on overall GDP and productivity was highlighted during the current COVID-19 pandemic.\nHe said that with 93 million subscribers of broadband services, the growth of Digital Financial Services and other e/m services were being led by the telecom sector.\n“Pakistan has a highly robust public private partnership mechanism whereby digital divide is being bridged through the telecom sector’s contribution of 1.5 % of annual gross revenue in the Universal Service Fund and 0.5% being contributed towards the Research and Development Fund leading towards Incubations and start-ups eco systems”, said the minister.\nAmin ul Haque said that the government was heavily investing in the enhancement of digital infrastructure in underserved areas nationwide, which had led to equitable sharing of opportunities and resources, paving the way for accelerated economic growth.\nMoiTT through USF has already started dozens of projects estimating about Rs 14 billion for the proliferation of digital infrastructure and Services in unserved and underserved areas of the country in last 8 months, he added.\nHe said that while access to Telecommunication Services was a perquisite to digitalization, however, Right of Way had remained a major impediment towards the deployment of infrastructure since the introduction Pakistan Telecom Re-Organization Act 1996. .\nThe minister said that, his ministry was working for additional spectrum availability for 3G and 4G network expansion, better quality and coverage of services, rationalizing taxation of ICT sector, increasing 4G smartphone penetration in the country and launch of 5G services in the country.\nAmin ul Haque informed the audience the ministry had also uploaded the drafts of National Broadband Policy 2021 and Cyber Security Policy 2021 for stakeholders’ consultation.",
  "retrievedAt": "2025-08-11T20:24:23.091Z"
}
