{
  "title": "Govt striving to install ITS at all motorways, highways: Murad",
  "link": "https://www.app.com.pk/national/govt-striving-to-install-its-at-all-motorways-highways-murad/",
  "date_published": "2021-02-24T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 24 (APP): Federal Minister for Communications and Postal Services Murad Saeed on Wednesday said the government was striving to install Intelligence Transport System (ITS) at all the motorways and highways to ensure the motorists safety through use of modern technologies.\nAddressing the handing over ceremony of ambulances, the minister said the ITS had already been installed at Multan-Sukkur motorway, which was meant to record 16 types of road violations through digital means.\nMurad said the system would be made functional along all the motorways and highways within next six to seven months.\nUnder the initiative, he said trackers were being installed in trucks to better inform the drivers about the road violations, which would eventually help save their lives.\nThe minister said the National Highways and Motorway Police (NHMP) would use drone technology to protect and facilitate the motorists at its all major avenues.\nHe said response time for the ‘motorway helpline’ had been reduced to one minute which was around seven minutes, earlier.\nMurad said efforts were afoot to ensure acceptability of the driving licenses, issued by the NHMP, in the foreign countries.\nHe said the NHMP was working with different countries’ road authorities to set up license authority on modern lines, which will eventually enhance acceptability abroad.\nThe authority’s offices would also be established across the country to train drivers, in addition to license issuance, he added.\nHe said the NHMP along with provincial authorities was taking initiatives to make the countries’ roads safer by ensuring implementation of traffic rules.\nThe minister regretted that the country did not have any road policy till 2019, adding it was the Pakistsan Tehreek-e-Insaf (PTI) government which took that initiative after strenuous efforts.\nHe said the policy was being entered implementation phase under the supervision of the Federal Secretary Communication.\nSuch initiatives would bring significant reduction in accidents’ rates, he added.\nMassive awareness campaigns were being launched in collaboration with media to sensitize the masses about traffic rules, which would not only help them to save their own lives, but also others.\nHe said the development work had been initiated at MM road which was in dilapidated condition for the last several years.\nMurad said the government would soon inaugurate Hyderabad Sukkur motorway, Quetta bypass and other major roads to facilitate the citizens.\nHe said the government had already constructed Swat Motorway phase I that had boosted tourism activities in the area. Its second phase would start soon, he added.\nThe minister said work on Sialkot-Kharian- Rawalpindi motorway would be initiated by April.",
  "retrievedAt": "2025-08-11T20:24:19.907Z"
}
