{
  "title": "Pak-Yemen agri-academia ties should be strengthened: Ambassador",
  "link": "https://www.app.com.pk/national/pak-yemen-agri-academia-ties-should-be-strengthened-ambassador/",
  "date_published": "2021-02-24T13:42:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Feb 24 (APP): Pakistan and Yemen are enjoying deep-rooted relations based on brotherhood and now joint efforts are needed to meet challenges of food security.\nThis was said Ambassador of Yemen to Pakistan Muhammed Motahar Alashabi while addressing a meeting of deans, directors and principal officers of the University of Agriculture Faisalabad (UAF) on Wednesday.\nHe lauded the research made at the UAF and said that this achievement could be replicated in other countries, including Yemen, for which a memorandum of understanding would be inked.\nHe said the majority of Yemeni people were associated with the agriculture sector, therefore, strengthened agricultural ties will help learn from each other and combat different challenges.\nEarlier, UAF Vice Chancellor Prof Dr Asif Tanveer said that there was a lot of scope for cooperation between the two countries in the fields of agricultural education and research to increase per acre yield.\nDirector Research UAF Prof Dr Zaheer Ahmad Zaheer briefed about achievements and said the UAF was ranked among the top 100 best universities in the world in the subject of agriculture and forestry in international rankings.\nPrincipal Officer Estate Management UAF Prof Dr Javed Akhtar, Dean Faculty of Agriculture Prof Dr Javed Akhtar, Dean Faculty of Food and Home Sciences Prof Dr Masood Sadiq Butt, Dean Faculty of Agricultural Engineering and Technology Prof Dr Muhammad Irshad, Dean Faculty of Animal Affairs Prof Dr Muhammad Aslam, Principal Officer Public Relations Prof Dr Muhammad Jalal Arif also spoke.\nLater, the UAF shield was also presented to Yemeni Envoy who also visited\nLocust Research Cell UAF besides planting a sapling in the university lawn.",
  "retrievedAt": "2025-08-11T20:24:12.423Z"
}
