{
  "article_id": "2025-06-24_7ae21d00898c6b5176fb0d0b6d31dc4d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/itp-delivers-doorstep-services-to-citizens-mobile-vans-womens-helpline-roadside-assistance/",
    "retrieved_at": "2025-08-27T16:25:26.779Z"
  },
  "metadata": {
    "title": "ITP delivers doorstep services to citizens: mobile vans, women’s helpline, & roadside assistance",
    "author": null,
    "date_published": "2025-06-24T12:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 377,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 24 (APP): The Islamabad Traffic Police (ITP) is delivering international-standard services directly to citizens through its public facilitation initiatives, including the Facilitation on Wheels mobile van service, Mechanic on Wheels roadside assistance, the Taxi Verification App, and a dedicated Women's Helpline. An official told APP on Tuesday that the Facilitation on Wheels initiative is enabling citizens to access essential transport and licensing services without visiting traffic offices. Mobile vans are deployed across Islamabad to provide on-the-spot services such as issuing and renewing learner permits, regular driving licenses, duplicate licenses, and foreign license conversions. So far this year, over 713 citizens have benefited from the service, including 370 learner permits, 66 renewals, 71 test sheets, 196 license renewals, and 10 duplicate or conversion cases. He said the mobile units are currently stationed at various locations, including G-9 Markaz, I-8 Markaz, I-10 (King Driving School), Bahria Town Phase-2, Thanda Pani, E-11, DC Office G-11/4, F-10 Markaz, Khanna Pul, CDA Office, G-8 (ICCI), DHA Phase-1, Naval Complex E-8, and Bari Imam House. He added that the schedule for the mobile vans changes weekly, covering different sectors and communities across Islamabad to ensure broader outreach. To assist motorists in case of vehicle breakdowns, ITP provides the Mechanic on Wheels service, available 24/7 via helpline 1915. The Taxi Verification App allows passengers to verify vehicle and driver details before boarding. Samia, a government employee who regularly commutes using ride-hailing apps, told APP that the app has made her feel safer. \"As a woman, I always had a sense of unease while using taxis,\" she said. \"But now, the ability to verify drivers in advance has given me peace of mind.\" Director General Safe City Shakir Hussain Dawar praised the app development team and directed further improvements. Additionally, the 1815 Women's Helpline offers 24/7 assistance from female police officers, further improving accessibility and safety for women across Islamabad. Samreen Khan, who works in a private office, told APP that the helpline has strengthened women's confidence in reaching out for help. \"This service has truly increased our trust in the system and made us feel more secure,\" she said. Through these community-oriented services, Islamabad Police is setting a new benchmark in public facilitation-helping citizens when and where they need it the most.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}