{
  "article_id": "2025-06-24_613f166849211884864240bdf496b150",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-lauds-nabs-performance-pledges-full-support-in-fight-against-corruption/",
    "retrieved_at": "2025-08-27T16:24:57.297Z"
  },
  "metadata": {
    "title": "PM Shehbaz lauds NAB’s performance, pledges full support in fight against corruption",
    "author": null,
    "date_published": "2025-06-24T15:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 24 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday met with Chairman of the National Accountability Bureau (NAB), Lt. Gen. (R) Nazir Ahmad Butt, who presented the NAB Performance Report for the years 2023-2024 during a meeting held here at the Prime Minister's Office. The comprehensive report included detailed information on the recoveries and overall performance of NAB's headquarters and regional offices over the past two years, a PM Office news release said. Prime Minister Shehbaz Sharif commended NAB's role in the national fight against corruption, reaffirming that eliminating corruption and misuse of authority remains one of the government's top priorities. \"The vision of a corruption-free Pakistan will be realized, and NAB will be provided with all necessary resources and facilities to achieve this goal,\" the prime minister stated. The PM also directed NAB to expedite the disposal of pending cases and emphasized the need for effective measures to assist victims of financial fraud and ensure swift recovery of their lost funds. Briefing the Prime Minister, the Chairman NAB highlighted the bureau's recent achievements, noting that over the past two years, NAB had recovered billions of rupees in embezzled public funds and retrieved hundreds of acres of illegally occupied state land valued at billions. According to the report, NAB concluded 700 inquiries, completed 218 investigations, and filed 21 new references during the 2023-2024 period. Federal Minister for Law and Justice, Azam Nazeer Tarar, was also present during the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}