{
  "article_id": "2025-06-24_ff016e2320115a94136e80899dede3e2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-lauds-bilawal-delegation-for-exposing-indian-propaganda/",
    "retrieved_at": "2025-08-27T16:24:15.610Z"
  },
  "metadata": {
    "title": "PM lauds Bilawal, delegation for exposing Indian propaganda",
    "author": null,
    "date_published": "2025-06-24T16:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 392,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, June 24 (APP): Prime Minister Muhammad Shehbaz Sharif Tuesday commended Chairman of Pakistan Peoples Party (PPP) Bilawal Bhutto Zardari and other members of a high-level delegation for exposing the recent Indian propaganda globally and for the success of their diplomatic visits to the US, the UK and Europe. Chairman PPP Bilawal Bhutto Zardari met the prime minister and briefed him on the meetings held by the Pakistani diplomatic delegation during its visit to the United States and Europe. The prime minister hosted a dinner in honour of the members of the high-level delegation, PM Office Media Wing said in a press release. The dinner was also attended by Finance Minister Muhammad Aurangzeb, Law Minister Azam Nazeer Tarar, Minister for Economic Affairs Ahad Khan Cheema, Minister for Overseas Pakistanis Chaudhry Salik Hussain, Minister for Information and Broadcasting Attaullah Tarar, Prime Minister's Adviser Rana Sanaullah, and Special Assistants Talha Burki and Tariq Fatemi. The prime minister extended his congratulations to the delegation for effectively and powerfully representing Pakistan's perspective at the international stage, adding \"You fought Pakistan's case with the national spirit and returned successfully.\" Led by Bilawal Bhutto Zardari, the delegation comprised Sherry Rehman, Dr. Musadik Malik, Hina Rabbani Khar, Senator Bushra Anjum Butt, Senator Faisal Sabzwari, Engineer Khurram Dastagir, Jalil Abbas Jilani, and Tehmina Janjua. They represented Pakistan's stance with the national zeal during their visit to the United States, United Kingdom and Europe and it was being acknowledged not only in Pakistan but also around the world, the prime minister observed. He opined that Bilawal Bhutto Zardari presented Pakistan's viewpoint in an extremely effective manner. The delegation presented events ranging from Pahalgam to the Indus Waters Treaty in the right context and in an admirable manner, he added. \"By the grace of Almighty Allah, with the prayers of the nation and due to the military professionalism of our brave armed forces, India had to pay a heavy price for its unjustified war hysteria,\" the press release, quoted the prime minister as saying. In the 2025-26 fiscal budget, he further said, efforts had been made to provide relief to all segments of society, including salaried individuals and thanked all the allied parties, including the PPP, for their cooperation in the budget preparation process. He expressed the hope that with their guidance, cooperation and suggestions, they would overcome internal and external challenges.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}