{
  "article_id": "2025-06-24_12ed4e83cfc4654fc255c49afe94e86a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-export-skilled-workers-to-saudi-arabia/",
    "retrieved_at": "2025-08-27T16:24:09.057Z"
  },
  "metadata": {
    "title": "Pakistan export skilled workers to Saudi Arabia",
    "author": null,
    "date_published": "2025-06-24T07:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 24 (APP):Overseas Employment Corporation (OEC), an attached department of the Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD), would export the skilled workers to the Kingdom of Saudi Arabia. An official source told APP here on Tuesday, he said that the demand for Pakistani skilled and unskilled workers is increasing day by day due to the productive and constructive policies of the incumbent regime. He said that already millions of workers are working in the different fields of the Gulf Cooperation Council and sending huge remittances to their homeland. He said that Overseas Pakistanis are the backbone of the country and play a role in boosting the national economy. He described the qualifications and experience of skilled workers, including an expert (Shikrasystem) system engineer with a Bachelor of Science degree in Electronics/Electrical Engineering or Radar Technology. Specialized training and certification in each area of expertise with Radars or/C2, and must be qualified and specialized in the GM200 Radar and CONTROL View SHIKRA equipment. Hardware, software, operations, and maintenance. (Training certificate to be provided from France post-hiring phase) The candidate should speak English (French & Arabic are an advantage) with excellent communication and interpersonal relationship management skills. Besides, an expert (RAPID Ranger) System Engineer, an expert (Shikra system) maintenance technician, Network engineer architect, systems installation manager, cisco unified communications engineer, He said that the salary and other terms & conditions will be decided at the time of the Interview. Interested applicants can apply via OEC's website https://oec.gov.pk/. Help-Desk Team: for technical support, contact the OEC-Helpdesk team at UAN: 0311-0011-632 or Email: The applicant will submit/attach the deposited Bank challan amounting to Rs. 1000/- generated at the time of online application submission before the last date June 26, 2025.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}