{
  "title": "WHO Representative calls on Health Minister",
  "author": null,
  "content": "ISLAMABAD, Mar 12 (APP): The Representative of the World Health Organization (WHO) in Pakistan, Dr. Luo Dapeng, along with his delegation, met with Federal Minister for Health Syed Mustafa Kamal to discuss ongoing collaboration and key health priorities.\nDuring the discussion, the WHO Representative briefed the minister on various health initiatives being implemented in partnership with the organization.\nMustafa Kamal acknowledged WHO’s longstanding support in strengthening Pakistan’s healthcare system and appreciated its continued assistance during challenging times.\nDr. Luo Dapeng congratulated the minister on assuming office and extended his best wishes for his tenure.\nThe meeting focused on mutual areas of interest, including ongoing WHO-supported projects across Pakistan.\n“The WHO has played a vital role in Pakistan’s health sector for decades, and we deeply value its contributions,” said Minister Mustafa Kamal. “WHO has stood by Pakistan in every difficult moment, and we remain committed to enhancing this collaboration for the well-being of our people.”\nDr. Luo Dapeng expressed confidence in the minister’s leadership, stating, “Your vision and leadership will bring significant improvements to Pakistan’s healthcare system.”\nThe minister assured the WHO delegation that his office and the Ministry of Health are fully committed to making healthcare services more accessible and efficient for the public.\nAt the conclusion of the meeting, Minister Mustafa Kamal thanked the WHO delegation for their visit and reaffirmed Pakistan’s dedication to working closely with the global health body to achieve shared health goals.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:36:31.342Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/who-representative-calls-on-health-minister/",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T15:01:00.000Z"
}
