{
  "title": "ICT admin conducts 3786 inspections, arrests 605 sellers, seals 11 shops",
  "author": null,
  "content": "ISLAMABAD, Mar 12 (APP):The Islamabad district administration has intensified its efforts to enforce price controls during Ramazan, with officials conducting 3,786 inspections and imposing fines totalling Rs 377,000 in the first 10 days of the holy month.\nThe spokesman of Islamabad Capital Territory (ICT) confirmed that 605 sellers were arrested for overcharging, while 11 shops were sealed for hoarding or violating government-mandated price lists.\nIn this regard, Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon has ordered magistrates to expedite penalties and ensure immediate action against violators.\nIt is pertinent to mention here that eight Assistant Commissioners (ACs) and 26 Magistrates are always present in six Ramazan bazaars and 17 fair price shops across the city, offering relief to residents during this sacred time, to control price hike.\nThe district administration teams reported a surge in inspections to monitor prices of essential goods during Ramazan. A total of 26 price control magistrates were deployed across markets, leading to 3,786 enforcement actions. These included issuing fines, confiscating goods, and shutting down non-compliant businesses.\nMeanwhile, eleven shops were sealed for hoarding items or failing to display official price lists. Magistrates also arrested 605 retailers for selling products above government-set rates. The crackdown comes amid heightened demand for staples like flour, sugar, and cooking oil during the fasting month.\nViolators faced penalties for overcharging, stockpiling, or refusing to adhere to official pricing guidelines. DC Irfan Memon emphasized that magistrates must issue fines on the spot to deter violations.\n“No leniency will be shown to those exploiting citizens,” Memon stated. He directed magistrates to conduct daily inspections and prioritize complaints about overpricing.\nMeanwhile, residents have welcomed the measures but urge stricter monitoring in crowded markets. “Prices of vegetables and fruits fluctuate daily. Authorities need to act faster,” said a shopper in Sector G-9. Meanwhile, some vendors argue that supply chain issues and inflation force them to raise prices.\nThe district administration has set up a helpline for citizens to report violations. Officials confirmed that over 1,200 complaints were received in the first week, with most resolved within 24 hours.\nDC Irfan Memon instructed magistrates to accelerate raids and ensure real-time penalties. “Delayed action encourages violations. Magistrates must penalize offenders immediately,” he said during a review meeting. The administration plans to increase nighttime inspections to catch hoarders and illegal sellers.\nMemon warned that negligent officials would face disciplinary action. “This is a public welfare campaign. No laziness will be tolerated,” he added.\nWith 20 days remaining in Ramadan, the district administration aims to expand inspections to rural areas and wholesale markets. Teams will focus on verifying stock levels at warehouses and tracking supply routes to prevent artificial shortages.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:35:49.131Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-admin-conducts-3786-inspections-arrests-605-sellers-seals-11-shops/",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T07:12:00.000Z"
}
