{
  "title": "Pakistan, Egypt agree to work for cooperation in multiple areas, int’l bodies",
  "link": "https://www.app.com.pk/national/pakistan-egypt-agree-to-work-for-cooperation-in-multiple-areas-multilateral-organizations/",
  "date_published": "2021-03-25T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 25 (APP): Pakistan and Egypt agreed to work together on a number of proposals in the areas of education, culture, housing, transportation, communication and remote sensing, besides cooperation between Gwadar and Suez Ports authorities.\nThe bilateral ties were discussed in the 9th round of Pakistan-Egypt Annual Bilateral Consultations (ABC) held at the Egyptian Ministry of Foreign Affairs in Cairo on Wednesday (March 24).\nSpecial Secretary (Middle East), Ministry of Foreign Affairs of Pakistan Dr. Khalid Hussain Memon and Assistant Foreign Minister for Asian Affairs of Egyptian Foreign Ministry Ambassador Tarek El-Wassimy led their respective delegations, a Foreign Office press release said.\nThe two sides also agreed to continue close cooperation in the multilateral organizations, in particular the United Nations and the OIC.\nThe 9th round of Annual Bilateral Consultations between Pakistan  and Egypt  was held in the Egyptian Foreign Ministry @MfaEgypt in Cairo, today @ForeignOfficePk @SMQureshiPTI pic.twitter.com/ozl45kC5dZ\n— Pakistan Embassy Egypt (@PakinEgypt) March 24, 2021\nThe delegations also exchanged views on regional and international developments.\nThe special secretary apprised his counterpart about the human rights situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) and underscored the importance of peaceful resolution of the Jammu & Kashmir dispute in accordance with relevant UN Security Council resolutions.\nEarlier in the day, the Special Secretary (Middle East) met with Vice Foreign Minister Ambassador Hamdi Sanad Loza and handed over a letter from Foreign Minister Makhdoom Shah Mahmood Qureshi, addressed to his Egyptian counterpart Sameh Shoukry.\nAnnual Bilateral Consultations (ABC) is a mechanism for political consultations between the two Foreign Ministries under which the two sides meet in Islamabad and Cairo periodically.\nThe previous round took place in Islamabad in December 2018. The two sides agreed to work together closely in preparing for the Joint Ministerial Commission (JMC), to be held in Islamabad in 2021. The JMC is co-chaired by the Ministers of Foreign Affairs of the two countries.",
  "retrievedAt": "2025-08-11T20:32:42.442Z"
}
