{
  "title": "Pakistan Day joint services parade held under strict Covid SOPs",
  "link": "https://www.app.com.pk/national/pakistan-day-joint-services-parade-held-under-strict-covid-sops/",
  "date_published": "2021-03-25T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 25 (APP):The joint services parade to celebrate 81 years of national resolve for a separate homeland with the vision of one nation one destination was held here at the Shakarparian Parade Ground under strict Covid-19 standard operating procedures (SOPs).\nThe smartly turned out contingents of the joint services including civil paramilitary forces, Pakistan Scouts, military bands among others marched with traditional zeal and fervour.\nThe paratroopers of the armed forces of Bahrain, Turkey, Palestine, Iraq, Sri Lanka and Turkish military band Mehtar added more to the glory of the Pakistan Day Parade.\nThe Turkish Military Band played the musical tune of national song Dil Dil Pakistan and bagged acclaim from the participants.\nMinister for Defence Pervez Khattak, Chairman Joint Chiefs of Staff Committee General Nadeem Raza, Chief of Army Staff General Qamar Javed Bajwa, Chief of the Air Staff Air Chief Marshal Zaheer Ahmed Baber Sidhu, Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi were in participation at the Parade where Commander of the National Guard of the Kingdom of Bahrain General Sheikh Mohamed Bin lsa Al-Khalifa, Chief of Defence Staff (CDS) and Commander of Sri Lankan Army General L H S C Silva , UK’s Commander Strategic Command General Sir Patrick Nicholas Yardley Monrad Sanders were also present as guests at the Parade. Foreign diplomats, civilians and journalists attended the ceremony in large number.\nPresident of Pakistan Dr Arif Alvi was the Chief Guest at the occasion. The parade ceremony was formally opened with the recitation of the Holy Quran where the parade commander requested the President to observe the parade formations.\nThe Parade was held under strict Covid-19 SOPs as mask wearing and use of hand sanitisers was made mandatory and adequate arrangements were made at the venue to ensure compliance along with social distancing.\nFollowing the soldiers, contingents of armoured and mechanised infantry held a march-past. The Al-Khalid Main Battle Tank (MBT), Al Zarrar tanks, a variety of Armoured Personnel Carriers (APC) as well as howitzer guns were paraded in front of the civil-military leadership. Radar systems, Unmanned Aerial Vehicle (UAV), cruise missiles and other modern weaponry equipped with latest military technology were also rolled out.\nAt the tail end of the parade, a Pakistan Rangers band played national songs on bagpipes while riding camels in unison.\nFurthermore, the parade showcased local cultures of the four provinces. Cultural delegates and floats from Sindh, Punjab, Balochistan, Khyber Pakhtunkhwa, Gilgit Baltistan and Azad Jammu and Kashmir were featured during the ceremony.\nHowever, two separate special floats highlighting efforts of the National Command and Operation Center (NCOC) and Science and Technology were presented showcasing achievements made by scientists during the pandemic.\nSeveral formations of a variety of combat helicopters belonging to the armed forces demonstrated their capabilities before PAF fighter jets mesmerised the audience with their mid-air maneuvers.\nThe final segment of the programme was a display of paratroopers parachuting off of C-130 aircraft and landing on their specified targets.\nFor the first time in the Armed Forces Parade, the national flag was given a 21 guns’ salute.\nThe Ladies contingent consisted of the tri services, Police, Rangers, ANF and ASF women officers and the main part of the parade was the Pride of Pakistan Enclosure, which included individuals who excelled in their respective fields.\nPakistan’s identity was beautifully reflected on various floats where the Dhol (Drum) Party represented all regions with different melodies while women drummers were the important part of the Drum Party.",
  "retrievedAt": "2025-08-11T20:32:45.865Z"
}
