{
  "title": "CM Balochistan chairs cabinet meeting, extends teachers contract",
  "link": "https://www.app.com.pk/national/cm-balochistan-chairs-cabinet-meeting-extends-teachers-contract/",
  "date_published": "2021-03-25T18:45:00.000Z",
  "source": "APP",
  "content": "QUETTA, Mar 25 (APP): Balochistan Chief Minister Jam Kamal Khan on Thursday chaired a meeting of provincial cabinet where the contracts of 1493 teachers appointed under the Global Partnership for Balochistan Education Project were extended for one year.\nIt was decided to set up a committee to work out a strategy to make them permanent and the committee will present recommendations to the Chief Minister.\nThe Cabinet also approved to provide health insurance up to Rs. 1 million to more than 1.8 million families of the province in which the people of the province can get treatment facilities in official and private hospitals.\nThe Cabinet also gave approval for setting up of Childhood Cancer Unit in Quetta between Health Department and Indus Hospital.\nThe Cabinet formed a Cabinet Sub-Committee headed by the Provincial Minister for Education to further consider act relating to Balochistan Universities Act 2021.\nThe Provincial Minister for Finance, representatives of political parties in the coalition government, Advocate General Balochistan and Law Secretary were decided to present the committee with the proposed amendments and recommendations to the next Cabinet meeting within 15 days.\nThe Chief Minister directed the concerned officials to take steps for setting up a complaint center for redressal of public grievances so that public related problems and other important issues could be sorted.\nAddressing the meeting, the Chief Minister said that the cabinet has taken several important decisions during the two-day meeting.\nHe said for the first time in the history of the province, the cabinet approved health insurance under which the number of Balochistan National Identity Card (NIC) holders is one million to avail treatment facilities in any hospital of the country.\nHe said that the initiative of the government was aimed at ensuring the best provision of health and medical facilities keeping in view the public welfare.\nThe meeting was also attended by provincial ministers, provincial advisors and secretaries of relevant departments.",
  "retrievedAt": "2025-08-11T20:32:37.719Z"
}
