{
  "title": "CM presides cabinet meeting",
  "link": "https://www.app.com.pk/national/cm-presides-cabinet-meeting/",
  "date_published": "2021-03-25T18:00:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 25 (APP): Punjab Chief Minister Sardar Usman Buzdar on Thursday presided over 42nd meeting of Provincial Cabinet at CM Office which gave approval of wheat procurement policy 2020-21 as the Punjab government would purchase wheat at Rs 1800 per 40 kg from cultivators.\nTarget of wheat procurement has been fixed from 3.5 million metric tons to 5.0 million metric tons in the meeting while the Punjab government can also procure more wheat, if needed. Wheat will be procured from first come first served basis.\nAddressing the meeting, Sardar Usman Buzdar said that growers’ interest would be safeguarded and he would himself monitor the wheat procurement campaign.\nThe CM also directed the Cabinet Standing Committee for Finance and Development to review the matter of increase in salaries of provincial government employees in accordance with decision of the federal government and said that the committee should submit its final recommendation on this issue soon.\nThe Cabinet also approved Punjab Sugar Supply Chain Management Order 2021 under which sale and purchase of sugar system would be regulated. The godowns of sugar mills and dealers would be registered and only registered dealers would be allowed to sell or purchase sugar.\nThe cabinet committee also gave approval of The Prevention of Speculation in Essential Commodities Ordinance 2021 under which tariff of essential items would be controlled.\nThe cabinet committee also decided to import 2 lac metric tons of sugar to sustain its prices in the province.\nMoreover, installation of 4 new cement plants in Mianwali, DG Khan and Khushab was also approved in the meeting as billions of rupees were expected to be invested in cement plant projects which will result in creating thousands of jobs.\nThe meeting also approved waiver of Abiana (water rate), agriculture tax and other arrears for cultivators facing drought in tehsil Noorpur Thal of Khushab district and 75 mauzas have been declared calamity-hit areas. The cabinet in its meeting approved financial package of Rs.440 million for the people suffered from monsoon flood during 2020.\nThe cabinet was informed that 106 mauzas of 12 districts suffered from monsoon and families of 122 people died and others injured during monsoon were compensated on the directions of CM Sardar Usman Buzdar.\nMoreover, financial package would be announced as compensation for construction of their houses. The Cabinet also directed to constitute a special committee to grant charter status to Ghazi Institute of Engineering and Science, DG Khan.\nAnother committee was constituted to devise new policy for granting fitness certificates of transport vehicles and dispose of all matters with Swedish company. The committee would submit its recommendations within 7 days.\nThe recommendation of resource mobilization committee for FY 2019-20 were approved and under these recommendations, decision was made to increase route permit fee.\nThe cabinet decided to approve and amend Punjab Civil and Administration Act 2017. The cabinet decided to adjourn an agenda of advance increment to elementary and primary teachers. The Cabinet approved Punjab Sales Tax Special Procedure (carriage of petroleum oil through oil tankers/transportation) rules 2020.\nThe cabinet committee also decided to adjourn the issue of special allowance for officers posted in projects, programmes, policy units, polio cells, companies, authorities, foundations, funds and commissions.\nThe cabinet constituted a committee with regard to wheat export in 2016 in pursuance of order of Supreme Court of Pakistan. The committee would examine carefully of all issues and decide after consulting of export documents.\nThe approval was accorded in the meeting for transforming the land of Special Education department to Specialized Healthcare and Medical department for establishment of state-of-the-art rehabilitation center/ hospital for special persons.\nThe hospitals will be established for special persons on 26.10 kanals of land situated in Township Lahore.\nThe cabinet decided to review terms and conditions for chairman Ravi Urban Development Authority.\nThe new chairman of the authority would be authorized to use official vehicle and POL except salary. The cabinet approved the resignation tendered by Rashid Aziz, chairman Ravi Urban Development Authority.\nThe appointment of chairman BoD central business district development authority and its official members was approved in the meeting of Cabinet. Irfan Elahi, ex-bureaucrat would be chairman of the authority while SMBR, Chairman P&D, Secretary Finance and Secretary Housing would be its members.\nThe meeting also approved amendment in Lahore Ring Road Authority Act 2011 under which the scope of authority would be extended to across the province.\nAnnual report of Punjab Commission on the Status of Women for 2018 was presented for approval.\nThe cabinet endorsed the decisions made during 41st meeting of the committee. The decisions on legal matters of 48th, 49th, 50th, and 51st as well as 52nd meeting of cabinet standing committee for finance and development were also endorsed.\nThe meeting was attended by provincial ministers, advisors, special assistants, chief secretary and secretaries of concerned departments.",
  "retrievedAt": "2025-08-11T20:32:39.274Z"
}
