{
  "title": "Govt taking measures to provide relief to masses, curb price hike: CM Buzdar",
  "link": "https://www.app.com.pk/national/govt-taking-measures-to-provide-relief-to-masses-curb-price-hike-cm-buzdar/",
  "date_published": "2021-03-25T18:18:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 25 (APP): Punjab Chief Minister Sardar Usman Buzdar on Thursday said the PTI government had taken a number of measures for providing relief to the people of the province in true sense.\nPrice-hike was a major issue which affected life of common man, he said and added this sector remained unregulated which caused unchecked increase in prices of commodities.\nThese views were expressed by the CM while addressing a press conference along with Advisor to Prime Minister Barrister Shehzad Akbar at CM Office, here. Chief Secretary, Principal Secretary to CM and Secretary Information were also present on this occasion.\nUsman Buzdar said The Punjab Sugar Supply Chain Management Order 2021 and The Prevention Of Speculation In Essential Commodities Ordinance 2021 were important steps related to price hike. The Punjab Cabinet had decided to regulate the whole system of production of sugar, its supply and sale & purchase.\nHe said that under Punjab Sugar Supply Chain Management Order 2021, sugar mills and godown of dealers would be registered and only registered dealers could sale and purchase sugar.\nSupply and Chain Management Order would help cope with sugar mafia besides ensuring the supply of sugar to the people at affordable rates, he said and added that no factory, dealers, whole sale dealer could now store more than 2.5 metric tons sugar. An NOC from concerned Deputy Commissioner would be required in case of storing more than the fix limit. Unregistered dealers and whole sale dealers could not sale or purchase the sugar, he added.\nHe said no sugar mill could now sale its sugar to unregistered dealer as cane commissioner and deputy commissioner had been empowered under this order to take legal action in case of any irregularity.\nUnder this order sugar mills and whole sale dealers would be bound to show their record to the cane commissioner, said the chief minister and added that Punjab Cabinet, today, also gave principal approval of The Prevention of Speculation in Essential Commodities Ordinance 2021.\nUnder this law, he said, availability of essential commodities including sugar, wheat, edible oil, rice and pulses to the people at affordable rates would be ensured besides curbing the hoarding. This law would also prevent the price-hiking of edibles through speculation and strict action would be taken against the responsible, he added.\nHe said that holy month of Ramazan was approaching and the government wanted to save people from hoarders and profiteers. These elements would be dealt in a same way, the government was dealing with ‘qabza mafia’.\nUsman Buzdar said that provincial ministers had been assigned duties with regard to cleanliness arrangements as contract with Lahore Waste Management Company was ended and the same had been extended. Along with it, the government was heading towards a new system, he added.\nTo another query, the CM said the Punjab government had given relief package of 7 billion rupees for the holy month of Ramazan. Essential items would be available to the people on the rates of 2018 during the month. Whereas 313 sahulat bazaars would be set up for providing relief to the people on permanent basis, he added.\nBarrister Shahzad Akbar said the Punjab government, under the leadership of Usman Buzdar, had taken revolutionary measures to curb the sugar mafia besides ensuring the smooth supply of daily use items to the people at reasonable rates for which they deserved congratulation.\nImplementation of ordinance related to essential items would yield positive results, he said and added that mafia was quite a small word for sugar mafia as these people were involved in money laundering and nameless accounts.\nHe said 10 FIRs had been registered against this gang and federal as well as Punjab government were on same page in order to regulate the affairs related to the sugar industry.\nHe said the track & trace system would also be implemented in this regard. He said that trade of billions of rupees were made through whatsapp and price were fixed at will but due to initiatives taken by the present government, this whole system would be regulated and unnatural growth in sugar price could be checked.\nHe said that attacking the institutions was the hallmark of the Sharif family as these people were involved in attack on the Supreme Court.\nHe said that NAB did not summon Maryam Nawaz to deliver lecture for which she came with a gang at previous hearing.\nHe said that she had been summoned to give answers with regard to money laundering.\nShahzad Akbar said that name of Salman Shahbaz was on the top in money laundering and Hamza Shahbaz was also director in sugar mill and his name was included in the case as well. Transactions of billions of rupees were made in this case and the government had proofs, he mentioned.\nMany mills owners were involved in unnecessary increase in sugar prices, he added.",
  "retrievedAt": "2025-08-11T20:32:38.289Z"
}
