{
  "title": "Pakistan Navy participates in Pakistan Day Parade with zest & zeal",
  "link": "https://www.app.com.pk/national/pakistan-navy-participates-in-pakistan-day-parade-with-zest-zeal/",
  "date_published": "2021-03-25T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 25 (APP):A smart clad and agile contingent of Pakistan Navy led by Commander Muhammad Shahid lqbal PN participated in the Pakistan Day Joint Services Parade held here at Shakarparian Parade Ground with zest and zeal.\nThe contingent included lady officers, Special Services Group (Navy) and PN Band, a PN news release said.\nThe hallmark of Pakistan Navy contingent included participation of first Pakistani Sikh naval officer Lieutenant Pawan Singh leading the PN squad. The lady officers squad was led by Lieutenant Commander Sana Firdos.\nIn addition, formations of Pakistan Navy Aviation assets including Long Range Maritime Patrol Aircraft P3C Orion led by Capt Saleem Nasir PN, ATRs led by Capt Syed Talat Hussain PN, seaking helicopters led by Capt Sher Wali Khan PN and Z-9EC helicopters led by Cdr Talha Mateen PN participated in impressive fly past at the parade venue. PN UAV was also displayed during the parade. Pakistan Navy Sea Eagle team, led by Commander Muhammad Abrar Younis PN, Special Services Group (Navy) was part of Tri Services Sky Diving Team. The Sea Eagle Team exhibited various free-fall jump techniques including Sky maneuvers and landing at targets with precise accuracy.\nMeanwhile, President Dr Arif Alvi at a ceremony at Aiwan-eSadr on Wednesday, conferred upon Hilal-i-Imtiaz (Military) to six rear admirals of Pakistan Navy namely Rear Admiral Ather Saleem, Rear Admiral Adnan Khaliq, Rear Admiral Ahmad Fauzan, Rear Admiral Javaid Iqbal, Rear Admiral Mirza Foad Amin Baig and Rear Admiral Mian Zakirullah Jan.\nIn addition, two officers Cdr Syed Kamran Saeed Gillani and Lt Cdr Hammad Hassan Maken and and a sailor Muhammad Abbas Khan SFT-I (Shaheed) were conferred Sitara-i-Basalat.\nThe president also approved medals and awards to Pakistan Navy officers, master chief petty officers, chief petty officers / sailors and Navy civilians, which included two Tamgha-i-Basalat, three Hilal-i-Imtiaz (Military), 14 Sitara-i-Imtiaz (Military), 13 Tamgha-i-Imtiaz (Military), four Imtiazi Sanad, 16 Tamgha-i-Khidmat (Military)-I, 26 Tamgha-i-Khidmat(Military)-II, 37 Tamgha-i-Khidmat (Military)-III. Letters of Commendation from Chief of Naval Staff have also been approved upon 53 officers, master chief petty officers, chief petty officers, sailors and Navy civilians.",
  "retrievedAt": "2025-08-11T20:32:43.080Z"
}
