{
  "title": "Pakistan seizes $12 bln worth of drugs in one year: Talal Chaudhry",
  "author": null,
  "content": "ISLAMABAD, Jun 25 (APP): Minister of State for Interior Talal Chaudhry said on Wednesday that Pakistan’s Anti-Narcotics Force (ANF) had seized drugs worth $12 billion in the past year.\nWhile responding to opposition’s cut motions during a National Assembly session, he said the international community now recognizes the ANF’s efforts. “Pakistan is a transit country, and one of our neighbors produces 40% of the world’s drugs. Despite this, the ANF has shown great alertness and success,” he said.\nHe added that Pakistan had also hosted regional conferences with Central Asian countries. These meetings helped share expertise, build capacity, and provide important equipment to partner nations.\nTalking about human smuggling, he said Pakistan had made major improvements through new technology and reforms. “It is now impossible to get a fake passport in Pakistan. Our passports follow global standards, and our immigration system is fully digital and linked with international systems,” he said.\nHe said modern equipment had been installed at airports and borders, and FIA officers had received special training to stop illegal migration.\nHe admitted that human smuggling had happened in the past, but said the government had taken strong steps to control it. “We have arrested 285 well-known human smugglers and removed over 100 FIA officials involved in illegal activities,” he added.\nHe said the government was fully committed to a zero-tolerance policy, following the Prime Minister’s orders. “Anyone deported or caught trying to leave the country illegally will face a five-year travel ban and will not be allowed to get a passport,” he said.\nTalal Chaudhry also praised the Islamabad Police for their handling of violent protests and their overall performance. He said crime in the capital had dropped by 19% over the past year. “If someone enters Islamabad with sticks and tries to attack, the police will respond. But action is only taken against attackers, not ordinary people,” he added.\nHe said the police had solved all high-profile cases during the year and were improving with the help of new welfare programs, including the National Police Hospital. He thanked Planning Minister Ahsan Iqbal for supporting these efforts.\nThe minister also discussed development projects in Islamabad. He said Interior Minister Mohsin Naqvi had promised the Prime Minister that Islamabad would be developed into a modern city. “This includes underpasses, overhead bridges built quickly and at low cost, as well as new hotels, resorts, and upgraded infrastructure,” he said.\nHe called the city’s development a mix of speed and quality, backed by Prime Minister Shehbaz Sharif and Interior Minister Mohsin Naqvi.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:25:55.346Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-seizes-12-bln-worth-of-drugs-in-one-year-talal-chaudhry/",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T18:58:00.000Z"
}
