{
  "title": "NA approves Rs 3.55tr grants for Finance Division to meet FY26 expenditures",
  "author": null,
  "content": "ISLAMABAD, Jun 25 (APP):The National Assembly on Wednesday approved 14 demands for grants amounting to Rs 3.55 trillion for the Finance Division to meet various expenditures for the fiscal year ending June 30, 2026.\nThe demands were presented by Federal Minister for Finance and Revenue Senator Muhammad Aurangzeb during the budget session of the lower house.\nThe approved demands covered allocations for pensions, subsidies, development expenditures, and other financial commitments of the federal government.\nAmong the major allocations, Rs1.83 trillion was approved under “Grants, Subsidies and Miscellaneous Expenditure”, while Rs1.04 trillion was sanctioned for “Superannuation Allowances and Pensions”.\nThe house also granted Rs251.13 billion for “Other Development Expenditure” and Rs183.75 billion for “Development Loans and Advances by the Federal Government”.\nIn addition, Rs115.08 billion was approved for “Federal Miscellaneous Investments and Other Loans and Advances”, and Rs83.09 billion for the Federal Board of Revenue.\nOther approved allocations included Rs13.81 billion for the Controller General of Accounts, Rs8.69 billion for Other Expenditures of the Finance Division, Rs4.82 billion for the Finance Division,  Rs101.51 million for the Revenue Division and Rs851.58 million for Development Expenditure of the Finance Division.\nLikewise, the allocations also included Rs7.15 billion for Development Expenditure of the Revenue Division, Rs1.48 billion for Capital Outlay on Federal Investments, Rs2.1 billion for External Development Loans and Advances by the Federal Government, The approved grants form a key part of the federal budget for the upcoming fiscal year, aimed at maintaining financial commitments and facilitating developmental objectives.\nFederal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, while winding debate said that independent data validated by global rating agencies and reputable surveys shows a significant rise in consumer confidence, reaching its highest level since 2022.\nHe highlighted that Pakistan’s macroeconomic stability was improving, with inflation declining, policy rates reduced, foreign exchange reserves increasing, and the national currency showing signs of stability.\nHe emphasized that the recent boost in public confidence is not based on government statistics but on independent assessments.\nAurangzeb stated that the country’s tax-to-GDP ratio was projected to increase to 10.4 percent by the end of the current fiscal year, compared to 8.8 percent last year. He acknowledged that throughout the year, speculation about looming debt crises and repeated calls for “mini-budgets” were widespread, but said these forecasts have proven exaggerated, as recent indicators show a more resilient and adaptive economic environment.\nHe further added that federal expenditure this year was expected to increase by less than 2 percent, a stark contrast to the 10 to 13 percent growth seen in past years. Key reasons for this include the decline in debt servicing costs due and lower policy rates.\nCommenting on the government’s cost-cutting measures, he remarked, “Gone are the days when the prime minister used to come and go from the office in a helicopter. Expenditures have to be reduced from the top.”\nThe minister said that major reforms are currently underway at the Federal Board of Revenue (FBR) aimed at improving transparency and reducing human intervention in the tax collection process.\nSpeaking on tax policy in the former FATA region, he clarified that the matter is not related to any particular province. He explained that income tax in the area remains exempted, while sales tax is being implemented gradually and progressively.\n“This is an ongoing process and all relevant stakeholders have been engaged. There should be no misconception that decisions were made without consultation,” he stated.\nSenator Aurangzeb also spoke about the alignment of development priorities under the Public Sector Development Programme (PSDP).\nHe said, the federal PSDP stands at Rs1 trillion, the combined Annual Development Plans (ADPs) across all provinces amount to more than Rs4 trillion, underscoring the importance of coordinated development planning at all levels of government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:27:44.645Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-approves-rs-3-55tr-grants-for-finance-division-to-meet-fy26-expenditures/",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T09:21:00.000Z"
}
