{
  "title": "NA approves over Rs. 34.046 bln for National Food Security, Research Division",
  "author": null,
  "content": "ISLAMABAD, Jun 25 (APP): The National Assembly on Wednesday approved three demands for grants amounting to Rs. 34.046 billion for the National Food Security and Research Division to meet expenditures for the financial year ending June 30, 2026.\nThe demands were presented by Minister for Finance and Revenue Muhammad Aurangzeb during the budget session. All 98 cut motions moved by the opposition lawmakers were rejected.\nThe approved allocations included Rs. 23.068 billion for the National Food Security and Research Division, Rs. 6.724 billion for Pakistan Agricultural Research Council and Rs. 4.253 billion for the National Food Security and Research Division.\nWinding the debate on cut motions, Federal Minister for National Food Security and Research Rana Tanveer Hussain emphasized that under Prime Minister Shehbaz Sharif’s leadership, agriculture has been placed at the top of the government’s priority list.\nHe said that the Prime Minister is personally chairing daily meetings on agriculture and issuing clear directives for the sector’s uplift.\nThe minister said that agriculture is the backbone of Pakistan’s economy, with nearly 65 percent of the population directly or indirectly dependent on it. To boost productivity and output, the government has adopted a comprehensive strategy, forming multiple working groups and task forces to address sector-specific challenges.\nRana Tanveer highlighted that the current government has ensured uninterrupted fertilizer supply, a stark contrast to the past when farmers faced shortages and rising prices.\n“There is no shortage this year and prices have remained stable even lower than the fixed rate in some cases,” he said. “Pakistan is now in a fertilizer surplus position, and we are even considering exports.”\nRegarding cotton, Rana Tanveer acknowledged that the sector had seen decline in recent years under previous governments. However, due to focused attention by the current administration, the government has now set a target of producing 10 million bales, effectively doubling previous output.\nTo support local cotton growers, he added that Prime Minister Shehbaz Sharif had intervened to level the playing field. As a result, an 18% duty was imposed on imported cotton, ensuring fair pricing for local farmers and encouraging domestic production.\nOn the issue of solar-powered tube wells in Balochistan, the minister shared that the federal government has allocated Rs. 50 billion for the initiative, aiming to promote sustainable agriculture and conserve water.\nRana Tanveer said that institutional reforms in the agriculture sector are well underway, and relevant departments are actively contributing toward the government’s vision of a modern, productive, and farmer-friendly agricultural economy.\nHe said that Pakistan’s agricultural exports had doubled to $8 billion from $4 billion last year, reflecting the government’s commitment to revitalizing the sector under the leadership of Prime Minister.\nThe minister said the Punjab government had distributed 10,000 tractors among farmers to support mechanization and ease cultivation processes.\nRana Tanveer said the government had also sent farmers to China for three- and six-month training courses in modern agricultural practices. “These international trainings will further improve local production and introduce advanced farming techniques in Pakistan,” he said.\nHe reaffirmed that the government was determined to uplift the agriculture sector, which remains the backbone of the national economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:26:48.293Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-approves-over-rs-34-046-bln-for-national-food-security-research-division/",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T15:49:00.000Z"
}
