{
  "title": "NA approves over Rs1.74 bln in Grants for human rights division",
  "author": null,
  "content": "ISLAMABAD, Jun 25 (APP): The National Assembly on Wednesday approved five separate demands for grants, totaling over Rs 1.74 billion, for the Human Rights Division and its affiliated bodies to cover expenditures for the upcoming financial year ending June 30, 2026.\nFinance Minister Senator Muhammad Aurangzeb presented the demand for grants. The demands for grants included Rs. 1,273,159,000 for Human Rights Division,  Rs. 235,816,000 National Commission for Human Rights, Rs. 92,789,000 for National commission on the Rights of Child, Rs 118,750,000 National Commission on the Status of Women and Rs. 23,000,000 development expenditure of Human Rights Division.\nWinding up the debate on cut motions, Federal Minister for Human Rights Azam Nazeer Tarar expressed disappointment over the lack of recognition for recent landmark legislation aimed at strengthening human rights in Pakistan.\nThe minister urged lawmakers to move beyond constant criticism and engage in constructive debate within constitutional boundaries.\n“I would have appreciated if the House had acknowledged recent legislative achievements such as the Child Marriage Restraint Act, new laws governing Christian marriages, and the establishment of Anti-Rape Investigation Rooms,” he said. “These are significant reforms that merit attention — not silence.”\nTarar reminded the opposition to respect parliamentary norms. “Instead of focusing on national priorities like the budget, they are busy recording petty grievances and sending them to Adiala Jail,” he noted.\nCalling the federal budget a “serious national matter,” the minister urged a more mature approach. “Let’s not forget the sacrifices of our leaders — Shaheed Zulfikar Ali Bhutto laid down his life for truth. Nawaz Sharif and Maryam Nawaz have also endured persecution,” he said.\nTarar said that the sanctity of ‘chadar and chardiwari’ — a cultural reference to the inviolability of personal privacy — must be upheld for all citizens, not just selectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:27:17.548Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-approves-over-rs1-74-bln-in-grants-for-human-rights-division/",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T14:07:00.000Z"
}
