{
  "title": "NA Secretariat, Allied Bank sign MoU for employee-friendly easy-term loan scheme",
  "author": null,
  "content": "ISLAMABAD, Jun 25 (APP): In a landmark move aimed at promoting employee welfare, the National Assembly Secretariat has signed a Memorandum of Understanding (MoU) with Allied Bank to launch an easy-term loan scheme for its employees.\nThe signing ceremony took place on Wednesday at the Parliament House.\nUnder this initiative, envisioned by Speaker of the National Assembly Sardar Ayaz Sadiq, the employees of both the National Assembly and Senate Secretariats will now have access to easy-term loans through the Allied Bank branch located within the Parliament House premises.\nThe scheme will offer financial assistance for the construction, purchase, or renovation of houses, as well as for the purchase of vehicles.\nIt is designed specifically to support low-income employees in achieving their aspirations of homeownership and improved living standards.\nSpeaking on the occasion, Ayaz Sadiq emphasized that the program reflects his commitment to the well-being of Secretariat staff. “This initiative will provide much-needed financial relief and empower our employees to fulfill long-held personal goals,” he said.\nThe scheme is available to employees who maintain accounts with the Allied Bank branch at Parliament House.\nThe Speaker also commended the dedicated efforts of the Secretary General of the National Assembly, the Additional Secretary, the Advisor on Legislation and other key officials who played a vital role in facilitating this initiative.\nHe extended his gratitude to Allied Bank for their collaboration and support in turning this vision into a reality.\nThe MoU signing ceremony was attended by senior officers and staff members of the National Assembly Secretariat, along with representatives from Allied Bank.\nThe employees welcomed the initiative warmly and expressed their appreciation to the Speaker for launching a staff-friendly scheme aimed at their long-term welfare.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:27:16.028Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-secretariat-allied-bank-sign-mou-for-employee-friendly-easy-term-loan-scheme/",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T14:00:00.000Z"
}
