{
  "title": "Seminar on ‘Women Land Rights’ held at GCU Faisalabad",
  "author": null,
  "content": "FAISALABAD, Jun 25 (APP):A national seminar entitled “Proceedings and Practices on Women’s Land Rights Cases in the Revenue Department, Punjab,” was conducted at Government College University Faisalabad, as part of the Higher Education Commission’s (HEC) funded project, “Women’s Land Rights in Pakistan: Laws, Policy and Practices.”\nThe seminar was organized yesterday by Dr. Mazhar Abbas, the Principal Investigator of the research project and a lecturer in History at Government College University Faisalabad.\nDuring the seminar, Mr. Ashfaq Rasool, the Assistant Commissioner of Chiniot, emphasized the procedures and practices within the revenue department of Punjab concerning women’s land rights, particularly in the context of inheritance.\nMr. Rasool highlighted the issue of inheritance, noting that it is supposed to be transferred upon the death of the property owner—be it a father, mother, or husband.\nHe pointed out that societal pressures often prevent women from claiming their rightful inheritance, leading many to surrender their shares to male siblings. Those who do assert their rights frequently face denial due to unethical practices by family members and collusion with corrupt revenue officials.\nHe shared a case from Gujranwala where two women were deprived of their inheritance due to their brothers’ collusion with corrupt revenue officials. Their father had intended for them to inherit the property, but the brothers forged documents claiming that the property had been transferred to them through the sale and purchase process.\nMr. Rasool, on the application of the women, intervened, exposing the deceit and ensuring the rightful transfer of property to the women.\nDr. Mazhar Abbas raised concerns about the cultural context in Pakistan, where land symbolizes power, resulting in men’s resistance to granting property shares to women.\nHe argued that denying women’s rights to land hinders their development and autonomy, undermining the goal of gender equality.\nHe called for a change in mindset among men to recognize the importance of granting women their rightful shares. Dr. Abbas concluded that there is an urgent and critical need to reform the revenue department to safeguard women’s rights to inheritance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:28:05.134Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/seminar-on-women-land-rights-held-at-gcu-faisalabad/",
  "dateList": "2025-06-25",
  "date_published": "2025-06-25T08:12:00.000Z"
}
