{
  "article_id": "2025-06-06_9aca1302e008f75cd24a51376ed5effc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-felicitates-nation-islamic-world-on-eid-ul-azha/",
    "retrieved_at": "2025-08-27T10:51:17.831Z"
  },
  "metadata": {
    "title": "PM felicitates nation, Islamic world on Eid-ul-Azha",
    "author": null,
    "date_published": "2025-06-06T17:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 620,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 06 (APP): Prime Minister Muhammad Shehbaz Sharif felicitated the Pakistani nation and Islamic world on the occasion of Eid-ul-Azha and urged everyone to keep in their thoughts the people suffering oppression in Palestine and Kashmir. In a message on the occasion of Eid-ul-Azha 1446 Hijri, he said, \"I felicitate from the core of my heart the whole Pakistani nation and the Islamic world on the blessed occasion of Eid-ul-Azha and the magnificent Islamic ritual of Hajj.\" \"These blessed days remind of the exemplary faithfulness, sacrifice and selflessness of Hazrat Ibrahim (AS) and Hazrat Ismail (AS),\" he added. He said Allah Almighty liked the devotion, sacrifice and selflessness of these two great personalities so much that he gave status of worship to their acts. The prime minister prayed Allah Almighty to accept the prayers and sacrifices of the whole Pakistani nation and the Muslim Ummah. \"These blessed occasions should come in our lives again and again. Amen,\" he remarked. He said, \"The message of Eid-ul-Azha is not only limited to the sacrifice of the animal but it also gave a lesson of sacrifice of self, our wishes and interests for the sake of higher objectives.\" \"This spirit of sacrifice inculcates the qualities of patience, courage, sacrifice and altruism in the humans, which can be a foundation for the progress of a nation,\" he observed. He said, \"Today our beloved country Pakistan is on the path of progress and at this moment we have to embrace the spirit of solidarity and sacrifice.\" The prime minister said the blessed occasion of Eid-ul-Azha reminded everyone that the path of sacrifice led to success. \"Like it happened during the recent Indian attack, when the whole nation stood united and solid against the enemy sending a clear message that the Pakistani nation will not hesitate to offer any sacrifice for its defence and dignity,\" he said adding, \"Similarly we have to persistently show unity and resolve to surmount the internal difficulties.\" He said, \"We have to realize our economic and social responsibilities and have to pool all our resources to make our country strong, prosperous and self-sufficient.\" \"This Eid not only teaches us the importance of sacrifice of our life and property but also educates that a nation achieves the destination of greatness when it works not only for individual progress but also for collective welfare and progress,\" he continued. The prime minister said, \"Today we should also especially remember our brothers and sisters of Palestine who are victim of merciless and inhuman cruelty and starvation. Similarly, we also reiterate our unwavering solidarity with the brave people of Indian Illegally Occupied Jammu and Kashmir, who are continuing their just and valiant struggle for decades, for their right to self-determination.\" \"We will always be their voice and will support their momentous struggle,\" he stressed. Shehbaz Sharif said, \"Today we have to pledge to our coming generations the kind of Pakistan where there is an atmosphere of love, brotherhood and unity. We have to move forward with the resolve to make Pakistan appear at the world level as a strong and successful country.\" He said, \"The dream of progress and prosperity of Pakistan will become a reality when we will give priority to our national interest over our personal interest.\" He said, \"The message of Eid-ul-Azha inspires us so to rise above our personal wishes and interests and think only about our country's welfare and well being and act to achieve the lofty goals. Certainly this spirit and unity will change the destiny of Pakistan.\" \"I pray to Allah Almighty to bless us with the real happiness of Eid-ul-Azha and give us strength to act according to the real spirit of sacrifice and selflessness,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}