{
  "article_id": "2025-06-06_5ff347439dfb539db5df32092dbbac71",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mci-shuts-down-over-100-illegal-cattle-sale-points-1675-sacrificial-animals-relocated/",
    "retrieved_at": "2025-08-27T10:52:07.664Z"
  },
  "metadata": {
    "title": "MCI shuts down over 100 illegal cattle sale points, 1,675 sacrificial animals relocated",
    "author": null,
    "date_published": "2025-06-06T11:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 205,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 06 (APP): Islamabad Metropolitan Corporation (MCI) has shut down over 100 illegal cattle sale points and seized 1,675 animals, relocating them to official markets. The MCI along with Capital Development Authority (CDA) launched joint operations against illegal cattle markets across the federal capital ahead of Eid-ul-Azha. The operations targeted high-traffic areas including Pakistan Town, Gagri, VIP Ghauri, Sanam Chowk, Kuri Road, Park Road, Islamabad Expressway, IJP Road, Saidpur, Murree Road, and Sector E-11. The crackdown follows directives from CDA Chairman, Chief Commissioner, and DG Civil Defence Muhammad Ali Randhawa to ensure public safety, cleanliness, and smooth traffic flow. Dr. Anum Fatima, Deputy DG Enforcement and DMA Director, told APP on Friday that, \"Special monitoring teams, backed by magistrates and assistant commissioners, are working round the clock to prevent unauthorized sales.\" She emphasized that citizens should only use designated markets at Bhinder Stop Japan Road, Zia Mosque, Sultana Foundation, Sangjani GT Road, and Sector I-12. She warned that violators face strict legal action, including fines and animal confiscation. Fatima confirmed all basic facilities like veterinary services, water, sanitation, and security are available at official markets. This campaign forms part of broader government efforts to maintain public order and cleanliness during Eid celebrations across Islamabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}