{
  "title": "Qureshi speaks with Senator Lindsey Graham; agree to enhance agri cooperation",
  "link": "https://www.app.com.pk/national/fm-qureshi-speaks-with-us-senator-lindsey-agree-to-enhance-agri-cooperation/",
  "date_published": "2021-05-21T20:06:00.000Z",
  "source": "APP",
  "content": "NEW YORK, May 21 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Friday spoke with senior Republican Senator Lindsey Graham wherein they agreed to further enhance bilateral cooperation in agricultural sector, especially to enhance Pakistan’s agricultural productivity.\nThe meeting was held on the sidelines of Foreign Minister Qureshi’s UN-related engagements in New York in which both the leaders discussed bilateral relations and the regional situation.\nThe foreign minister appreciated Senator Graham’s efforts for strengthening the Pakistan-U.S. partnership. He said that Pakistan wanted to forge closer economic and trade linkages with the US.\nConstructive call w/ @LindseyGrahamSC. Appreciate his support for a stronger   strategic partnership & his commitment to improvement of our agriculture productivity. Also spoke of forging greater trade ties &  support for peace process in  for regional peace & stability.\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 21, 2021\nHe said that Pakistan would continue to support efforts for achieving an inclusive political settlement in Afghanistan that would lead to a comprehensive ceasefire, and an orderly and responsible withdrawal of foreign forces.\nHe stressed that peace in Afghanistan was ultimately the shared responsibility of all Afghan parties as well as key international stakeholders.\nSenator Graham appreciated Pakistan’s support for deepening the peace process in Afghanistan, while underscoring the importance of economic engagement between the United States and Pakistan that would also contribute to regional peace and stability.\nThe foreign minister invited Senator Graham to visit Pakistan, which he accepted.",
  "retrievedAt": "2025-08-11T20:45:14.903Z"
}
