{
  "title": "Qureshi lauds Pak-American community for building stronger ties",
  "link": "https://www.app.com.pk/national/qureshi-lauds-pak-american-community-for-building-stronger-ties/",
  "date_published": "2021-05-22T15:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Saturday lauded Pakistani American community for their contributions in building stronger Pakistan-US ties.\nHe was addressing a gathering of Pakistani American community members at the Consulate General of Pakistan, New York.\nLauding the important role of diaspora, the foreign minister said that Prime Minister Imran Khan considered the Overseas Pakistanis as great assets who continued to support the country by way of supporting Pakistan’s interests in the international arena complemented by sending ever rising remittances.\nGreat to meet with members of the Pakistani American community. Our diaspora are our greatest ambassadors who play an imp role in building stronger   ties. Good to hear appreciation of our NY Consulate who went out of their way during #COVID19 to service community needs.\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 22, 2021\nThe foreign minister said that Pakistan was among the strongest voices in the international community to call for an end to Israel’s aggression against innocent Palestinians in Gaza.\nHe stressed that the entire Pakistani nation stood in solidarity with their Palestinian brethren at this critical time.\nHe said Pakistan was open to dialogue with its regional neighbours in order to come up with peaceful solutions to all outstanding issues.\nHe assured them that under the leadership of prime minister, special emphasis was being laid on ensuring efficient service delivery to the Overseas Pakistanis.\nHe also talked about how the government was actively legislating on public service delivery reforms for resident as well as overseas Pakistani including steps being taken to allow overseas Pakistanis to cast their valuable votes.\nHe further said that the government was vigorously pursuing steps to ensure national food and water security.\nThe foreign minister also lauded the efforts of the Consulate General of Pakistan, New York for continuing to offer its services to the Pakistani community within its consular jurisdiction, despite the challenges of the Covid-19 pandemic.",
  "retrievedAt": "2025-08-11T20:45:12.737Z"
}
