{
  "title": "Saudi official identifies key volunteering areas to serve Hajj and Umrah pilgrims",
  "link": "https://www.app.com.pk/national/saudi-official-identifies-key-volunteering-areas-to-serve-hajj-and-umrah-pilgrims/",
  "date_published": "2022-12-02T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP):Saudi Arabia’s Deputy Minister of Hajj and Umrah Dr. Abdulfattah bin Sulaiman Mashat has identified four main areas for volunteering to serve Hajj and Umrah pilgrims. These areas are reception and farewell, translation and guidance, field activities and health.\nDr. Mashat revealed the volunteering tracks during his participation in a session titled “The Impact of Social Responsibility” within the activities of Misk Tour, being held at the King Salman International Conference Center in Madinah. The event is sponsored by Prince Faisal bin Salman, Emir of the Madinah Region.\nThe target of one million volunteers by 2030, as per the goals of Saudi Vision 2030, is doable and can be achieved before 2030, Dr. Mashat confirmed.\nHe added that this can be achieved through the governance of charitable work, creating various volunteer programs and activities, providing discretionary incentives to encourage volunteering, and highlighting the role of volunteers, Saudi Gazette reported.\nDr. Mashat pointed out the difference between volunteering and social responsibility regarding sustainability, governance, and commitment. He called on young people who are wishing to engage in volunteering to choose sectors that align with their specializations and tastes to reduce the wastage of resources.\nHe touched on the “Be Helpful” voluntary program, one of the initiatives of the Ministry of Hajj and Umrah, and its role in providing services to pilgrims.\nAdditionally, the ministry’s role in supporting stranded pilgrims during the Covid-19 pandemic and the closure of airports, shops and public places to evacuate more than 400,000 pilgrims, in partnership with non-profit organizations to provide services such as housing, awareness, logistics and support services, without registering any cases of coronavirus infection.\nDr. Mashat referred to the social responsibility programs that the Ministry was carrying out to facilitate the journey of pilgrims with special needs.\nHe highlighted the patterns of the quality of social responsibility work by enhancing the use of experience, knowledge, and capabilities in providing social responsibility work to influence the individual and society, through professional participation, consultancy, and community leadership.\nHe also explained the role of government institutions in transferring the culture of social responsibility, and rooting the principle of responsible community, and establishing governance within the government institutions to measure impact.",
  "retrievedAt": "2025-08-11T15:56:49.079Z"
}
