{
  "title": "Japan provides $4.196 million to assist flood-affected families in Pakistan",
  "link": "https://www.app.com.pk/national/japan-provides-4-196-million-to-assist-flood-affected-families-in-pakistan/",
  "date_published": "2022-12-02T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP):The Government of Japan has provided $4.196 million to the United Nations Children’s Fund (UNICEF) for its humanitarian services in the flood-affected areas and to improve water, sanitation, and hygiene (WASH) infrastructure in Khyber Pakhtunkhwa (KP) and Baluchistan provinces.\nIn this regard, a ceremony was held here on Friday to acknowledge the government and the people of Japan for their generous support for the children in Pakistan, said a statement issued by the Embassy of Japan.\nAt the ceremony, Mitsuhiro Wada, Ambassador Extraordinary and Plenipotentiary of Japan to Pakistan, said, “Japan, in partnership with UNICEF, has successfully supported Afghan refugees and their host communities in KP and Balochistan provinces in WASH and nutrition, ensuring the most vulnerable have access to safe water, hygiene facilities, and nutrition supplements.\nAs an immediate response to the widespread flooding, Japan stands ready to provide emergency support to the affected by providing clean water and hygiene items.”\nFunds provided by Japan to UNICEF for its humanitarian services in the flood-affected areas are being used to provide safe drinking water, adequate sanitation, raising awareness about personal and communal hygiene, provision of hygiene kits, and scanning the nutritional status of children and women in camps and communities, he added.\nSpeaking on occasion, Chairman NDMA, Lt. Gen. Inam Haider Malik said, “Government of Pakistan stands committed to maximizing support to its flood-affected people with the continued involvement of the international community.”\n“Japan has always been a leader in such an assistance role for Pakistan, and it is gratefully acknowledged at people-to-People tiers. UNICEF Pakistan is also at the forefront of such initiatives and has enabled swift delivery of key relief aid articles to people in distress.”\n“National Disaster Management Authority, the National Coordinating authority for all emergencies mitigation and Control, engages all stakeholders and donor agencies to help invest in capacity building and developing sound robust national preparedness regime. We endorse the high value of UNICEF donations and acknowledge the Government of Japan for helping minimize the impact of the damage in flood-affected areas of Pakistan,” he added.\nUsing Japanese funds and coordinating with the National and Provincial Disaster Management Authorities and other relevant departments, UNICEF is working to ensure that host and refugee communities in the two provinces have access to improved wash services.\nThese services include the provision of improved water quality and supply, regular cleaning of drains, improved solid waste management, and emergency WASH services in health centers and schools. This has significantly reduced the incidence of diseases caused by unsafe water and poor hygiene.\n“We are extremely grateful for the generous funding from the Government of Japan to children and families at this critical juncture,” said Abdullah Fadil, UNICEF Representative in Pakistan.\n“It is the most vulnerable children and families who bear the brunt of the devastating floods and need support to survive. Without action, more children will lose their lives in the weeks to come.\nHe added that ensuring the availability of safe drinking water, sanitation, hygiene and medical and nutrition services is critical to avert further deaths.”",
  "retrievedAt": "2025-08-11T15:56:55.828Z"
}
