{
  "title": "Equal opportunities for PWDs to help them excel: NA Speaker",
  "link": "https://www.app.com.pk/national/equal-opportunities-for-pwds-to-help-them-excel-na-speaker/",
  "date_published": "2022-12-02T17:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 02 (APP): National Assembly Speaker Raja Pervez Ashraf and Deputy Speaker Zahid Akram Durrani on Friday said that provision of equal opportunities to persons with disabilities (PWDs) can make them useful citizens of society.\nIn a message on the occasion of the “International Day of Persons with Disabilities” (PWDs), they said, “special people have enormous abilities and can play an important role in the development of the country”.\n“Differently disabled people have a lot of potential and energy to contribute to the progress of the country. The need is to provide PWDs to play their role in the development of the country,” they both added.\nSpeaker said that PWDs were performing prominently in every sphere of life.\nHe said that Saima Saleem was performing her duties as a United Nations delegate in Geneva, who fought the case of Kashmir on behalf of Pakistan in the UN General Assembly session last year.\nThe speaker said that the parliament was paying special attention to the welfare of PWDs and resolving their problems.\nNew legislation had already been enacted to bring long-term reforms for the well-being of PWDs, he added.\n“Parliament House building has been made accessible exclusively to Persons with disabilities (PWDs). The initiative will contribute significantly to alleviate the difficulties being faced by PWDs, which will boost their confidence and encourage them to excel in all walks of life.\nThe accessibility of the National Assembly’s official website for PWDs has been ensured to help them to get information related to the National Assembly, besides, the full version of the Braille Constitution of Pakistan has already been unveiled,” he informed.\nHe stressed the need to ensure strict implementation of the quota in government jobs for physically challenged persons.\nSpeaker stressed over protecting the rights of PWDs, besides treating them with love, and compassion and taking care of their needs.\nNational Assembly Deputy Speaker Zahid Akram Durrani said that the PWDs were rendering their services in every field of life and playing a great role in the construction and development of the country.\nHe emphasized on providing equal employment opportunities to specially qualified persons.",
  "retrievedAt": "2025-08-11T15:56:46.398Z"
}
