{
  "title": "Pakistan hopes Afghanistan to respect promises of action against TTP, other terrorist outfits",
  "link": "https://www.app.com.pk/national/pakistan-hopes-afghanistan-to-respect-promises-of-action-against-ttp-other-terrorist-outfits/",
  "date_published": "2022-12-02T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP): The Foreign Office spokesperson on Friday said that Afghanistan would hopefully respect the promises made during the visit of Minister of State Hina Rabbani Khar to Kabul, that their territory would not be used for terrorism against Pakistan or any other country.\n“TTP is a threat to Pakistan, there is no denying that fact… We have received assurances of sustained counter-terrorism action against TTP and other terrorist organizations and we hope that the promises that have been made will be respected,” spokesperson Mumtaz Zahra Baloch said in her weekly press briefing.\nShe said Pakistan was seriously concerned about the terrorist activities that take place in Pakistan.\n“We have suffered enormously because of the activities of terrorist groups including TTP, which has continued to target Pakistani citizens and security forces.”\nShe said during MoS’ visit, all bilateral and international issues of mutual concern were discussed during various meetings.\nTo a question that the US has not yet listed the Majeed Brigade as Specially Designated Terrorist Organization, the spokesperson explained, “These are technical issues, which are under discussion in New York. We are in contact with our partners in New York, including the members of the UN Security Council to find a solution to this issue.”\nShe said during her visit to Kabul, Hina Rabbani Khar discussed a range of bilateral issues including cooperation in education, health, agriculture, trade and investment, regional connectivity, people-to-people contacts and socioeconomic projects.\nShe said the visit was meant to convey the importance that Pakistan accorded to its longstanding fraternal ties with Afghanistan. “This was the first high-level political visit from Pakistan in the last several months and a tangible manifestation of our intention to continue our engagement with Afghanistan and to discuss all issues of concern to Pakistan.”\nApprising the media of the diplomatic engagements last week, she started with Prime Minister Mohammad Shehbaz Sharif’s two-day visit to Türkiye to participate in the launching ceremony of PNS Khaibar at the Istanbul Shipyard. The prime minister held wide-ranging consultations with President Erdogan in both one-on-one and delegation-level formats.\nThe two leaders agreed to further deepen bilateral ties, increase trade and economic engagement, and strengthen strategic dialogue and defence cooperation. They also discussed energy and connectivity projects.\nThe spokesperson mentioned Acting Foreign Secretary Jauhar Saleem’s two-day visit to Luxembourg and Brussels, and the 8th Round of Pakistan-European Union Political Dialogue in Brussels wherein two sides agreed to intensify engagement and dialogue to promote political and trade ties, GSP plus, migration issues, education and climate change.\nAbout the recent statement by former Chief Minister of Gujarat, Shankersinh Vaghela and Amit Shah, the spokesperson said India’s Home Minister had confirmed BJP leadership’s direct involvement in anti-Muslim violence during the horrific Gujarat riots of 2002 that led to the massacre of over two thousand Muslims.\n“It is an internationally acknowledged fact that Mr. Modi who was then the Chief Minister of Gujarat was directly responsible for fomenting anti-Muslim riots and the massacre of Muslims in Gujarat. In 2002, this massacre was perpetrated for BJP’s political gains and twenty years later, once again BJP is fomenting communal hatred for political gains including in the upcoming elections in Gujarat.”\nShe told the media that December 6, this year marked 30 years of the demolition of the Babri Mosque by BJP-RSS zealots which served as a reminder that space has become restricted for minorities in India.\nThe spokesperson said Pakistan was seriously concerned over the decision this week by Indian National Investigation Agency’s Delhi court to award life imprisonment to five innocent Kashmiri youth in a fabricated case.\n“These young Kashmiris were denied justice because of their Kashmiri background. This case, like countless others, is reflective of India’s continued campaign to suppress the voice of Kashmiris and to deny them their rights.”\nShe said in IIOJK, the Modi regime was continuing to pursue the Hindutva agenda of RSS and disempowering Kashmiris by turning them into a minority in their own land.\n“In its latest move, it has added over 700,000 new voters in the electoral rolls. Majority of these so-called new voters are non-Kashmiris and retired personnel of Indian forces. The move is aimed at advancing electoral prospects of the Bharatiya Janata Party in IIOJK and clear violations of the 4thGeneva Conventions that assigns special responsibilities to the occupying power.”",
  "retrievedAt": "2025-08-11T15:56:48.229Z"
}
