{
  "title": "Railways receive 46 coaches to modernize train operations",
  "link": "https://www.app.com.pk/national/railways-receive-46-coaches-to-modernize-train-operations/",
  "date_published": "2022-12-02T07:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP):Pakistan Railways has received the first batch of around 46 of the total 230 high-speed modern coaches from China which would not only help to modernize the railway operations rather generate enhanced revenue for the department.\n“The new coaches will have the capacity to run at a speed of 160 kilometres per hour whereas the current maximum speed limit of trains is about 120 kilometres per hour.\nThese coaches will significantly improve train service,” an official in the Ministry of Railways told APP on Friday.\nThe official said that the modern coaches would offer an improved train travel experience in the country to 220 million people, many of whom rely on trains for long journeys.\n“The new coaches comprising economy, AC standard and AC parlour classes for passengers and luggage and brake vans reached via ship at the Karachi Port,” he added.\nHe said that Pakistan Railways would carry out a test run of the new coaches on the Main Line-I (ML-I) starting from Karachi to Peshawar via Rohri, Sukkar, Bahawalpur, Khanewal, Lahore and Rawalpindi before beginning the commercial travel.\nAfter receiving 46 completely built units (CBUs) manufactured in China, Pakistan Railways would soon begin manufacturing 184 similar coaches at its carriage factory in Islamabad with the assistance of Chinese engineers under the technology transfer agreement.To a question, the official said that Pakistan Railways had signed a contract with major Chinese high-speed train manufacturer CRRC Tangshan Co Ltd in August 2021 for 230 modern, high-speed passenger coaches.\nHe said the passenger trains included 80 economy coaches and 80 air-conditioned standard trains, 30 lounge-type trains and others.The manufacturing of 184 coaches in the country would be under the technology transfer project as the Chinese firm will provide spare parts, raw materials and expertise for the coaches planned to be manufactured at Pakistan Railways Carriage Factory in Islamabad, he added.\nHe said Pakistan has signed another similar contract with a Chinese firm to manufacture 800 freight wagons and 20 brake wagons. After receiving 200 modern freight wagons from China, the country would begin manufacturing 620 modern wagons at its Mughalpura workshop and the carriage factory in Risalpur, he added.\nThe official said that with the new coaches and technology transfer, Pakistan Railways aimed to improve its operation system and the condition of its railway tracks that along with other issues such as poor maintenance, and official negligence led to some of the most fatal railway accidents in the world.",
  "retrievedAt": "2025-08-11T15:56:58.114Z"
}
