{
  "title": "Poland-Pak trade volume reaches over € 800 million: Polish Ambassador",
  "link": "https://www.app.com.pk/national/poland-pak-trade-volume-reaches-over-e-800-million-polish-ambassador/",
  "date_published": "2022-12-02T10:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP):Ambassador of Poland to Pakistan Maciej Pisarski has said that the trade volume between Pakistan and Poland had reached over € 800 million and both the countries were focusing on exploring more avenues of trade and investments in multiple sectors.\nDue to a preferential trade system with the European Union and GSP plus status, Poland has been one of the fastest-growing markets for Pakistani products, he added.\n“Our ambition is not only to increase the volume of our trade, but we also want to expand and enrich our trade and economic exchange to make it a two-way street, with more Polish businesses operating in Pakistan.\nWe are looking forward to expand our presence in areas involving new innovative technologies, addressing the needs of the digital economy and green transition”, he said and added that defense cooperation remained a potential area of growth.\nThe Ambassador made these remarks while addressing Poland’s Independence Day and Polish Armed Forces Day celebration ceremonies here Friday.\nThe Ambassador emphasized that the jewel in the crown of our economic cooperation was the contribution of Polish companies; Polish Oil and Gas Company PGNIG and Exallo Drilling to strengthen Pakistan’s energy security.\nPGNIG has invested more than three hundred million dollars in developing gas extraction projects in Sindh province.\nThe company has brought innovative technology and unique know-how to deliver Pakistani gas to consumers, he told.\nHe said freedom and independence are the most valued gifts that each nation cherishes and defends, adding that in November 1918, Poland regained its independence after 123 years of partition.\nHighlighting the bilateral relations, he said that Poland and Pakistan were celebrating the 60th anniversary of establishing diplomatic relations between countries this year.\nOur relationship has matured and solidified throughout this time.\nWe are close friends and effective international partners.\nWe have worked together to increase regional stability and international peace.\nWe have put our people in the center of our cooperation, the Ambassador expressed.\nHe said that Poland valued its historical links with Pakistan and enjoyed the multifaceted collaboration.\nThe two countries significantly developed their political, economic and defense cooperation, he added.",
  "retrievedAt": "2025-08-11T15:56:56.165Z"
}
