{
  "title": "DEA delegation calls on DG Customs Intelligence",
  "link": "https://www.app.com.pk/national/dea-delegation-calls-on-dg-customs-intelligence/",
  "date_published": "2022-12-02T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 2 (APP): A high-powered delegation of the Drug Enforcement Administration (DEA), Department of Justice, USA, led by the Country Attaché for Pakistan Jaffrey A Konvalinka called on the Director General Customs Intelligence Faiz Ahmad, here, on Friday.\nThe DG explained to the delegation the core functions of customs intelligence and highlighted that the organization did not operate randomly but carried out its operations on the basis of credible information.\nThe DG further said the customs intelligence had fairly a good expertise in gathering information and the success rate of it hits was more than 90%.\nHowever, he added, that with the support of the DEA of the US government, it would certainly improve Pakistan’s capacity further.\nJaffrey, the Country Attaché, said the Drug Enforcement Administration (DEA), of the US government, was established in 1973 and it has more than 4,000 employees located in hundreds of offices across the country and around the world to fulfil its mission.\nThe primary function of the DEA was the interdiction of controlled substances worldwide by collecting, analyzing and disseminating information on their movement.\nHe assured assistance of the Drug Enforcement Administration, Department of Justice, USA in capacity building of the Directorate General of Customs Intelligence on speedy information gathering and quality post-seizure investigations.\nMeanwhile, the opening of a dedicated communication channel for improved coordination between the two agencies was also agreed during the meeting.\nThe Country Attaché Jaffrey also assured support for improved liaison and coordination between the Directorate General of Customs Intelligence and the Foreign Law Enforcement Community (FLEC) to meet new and emerging challenges with respect to narcotics interdiction in Pakistan and in the region.",
  "retrievedAt": "2025-08-11T15:56:48.538Z"
}
