{
  "title": "Palestinian ambassador expresses gratitude to Pakistan for support, expressing solidarity",
  "link": "https://www.app.com.pk/national/palestinian-ambassador-expresses-gratitude-for-expressing-solidarity/",
  "date_published": "2021-05-23T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Ambassador of Palestine in Pakistan Ahmed Rabei Sunday on part of the Palestinian leadership and people expressed gratitude to the government of Pakistan, nation and political leadership for expressing solidarity with the Palestinian people.\nThe ambassador conveyed his heartfelt gratitude for the remarkable efforts of Pakistan to support the Palestinian freedom and condemnation of the Israeli atrocities being carried out against the unarmed Palestinians while urging the international community to take concrete and immediate steps for the resolution of the Palestine issue.\n“Your efforts are greatly appreciated for speaking up and pushing for an emergency session of the OIC meeting and the UN General Assembly to hold ceasefire, de-escalation and an end to atrocities,” he added.\n“Pakistan played an important role in building, steering the discussion and building a consensus. This historical act will be remembered, not only by the Palestinians, but the entire world, and it will be a history to remember for generations, “a press release of the Palestinian embassy quoted the ambassador as saying.\nHe said that they would not forget the observance of May 21 as Palestinian solidarity day across Pakistan which was declared by the Prime Minister of Pakistan and the decision of the parliament passing unanimous resolution, condemning the Israel’s systematic oppression of the people of Palestine and demanding the UN to probe the human rights violations.\nThe ambassador further said that they were extremely grateful to all the people of Pakistan for their unwavering support to the Palestinians and the message of unity which had strengthened and encouraged the spirits and gave a boost the morale of the beleaguered Palestinians.",
  "retrievedAt": "2025-08-11T20:45:18.920Z"
}
