{
  "title": "Merit, transparency and ensuring rule of law are hallmark of PTI: PM",
  "link": "https://www.app.com.pk/national/nations-cant-survive-without-ideals-pm/",
  "date_published": "2021-05-23T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Prime Minister Imran Khan Sunday said merit, transparency and rule of law were the hallmark of the Pakistan Tehreek-e-Insaaf (PTI) and vowed that the party would not compromise on these ideals.\nChairing a meeting of the PTI’s core committee, the prime minister said nations cannot survive without setting high ideals. He stressed upon the party leaders and members to strictly adhere to the Pakistan Tehreek-e-Insaf ideology of ensuring the rule of law, a party press release said.\nThe core committee members said that the PTI government was confronting a number of mafias and pointed that the objective of the establishment of PTI was to enforce rule of law and provide justice to everyone.\nThe meeting also renewed its pledge that NRO would not be given to anyone belonging to any party. The members expressed the resolve that the PTI government would go to every extent to achieve these goals.\nThe meeting also decided that they would not compromise on the basic principles at any cost and would make every effort to promote the basic ideals of the party.\nThe committee also appreciated the prime minister’s bold and prudent approach over the Palestine issue and for effectively raising voice over Islamophobia at the international fora.\nWhile lauding the prime minister and his economic team on the effective economic policies, they said these were beginning to yield result as was evident from farmers’ prosperity and hoped that the agriculture sector would further improve in the days ahead.\nThe Committee noted that despite the Covid19 pandemic, the economic wheel moved on bringing further tangible stability. The core committee also congratulated the government on the progress being witnessed in the construction and agriculture sectors.\nThe meeting also discussed the forthcoming Azad Kashmir elections and the Minister for Kashmir Affairs Ali Amin Gandapur briefed the committee about the amendments in the relevant laws.\nThe committee was informed that the PML-N government had changed laws for polls with a hidden agenda for rigging and sabotage of the electoral process.\nThe committee while expressing concerns, urged urgent elections reforms to end any possible rigging and misuse of official resources and money.\nThe committee observed that the PTI was striving for fair, transparent and impartial elections which had the confidence of all citizens.\nThe prime minister underlined the need and significance of the use of modern technology in this regard.\nEndorsing the views of the prime minister, the committee said that the use of electronic voting machines in the next elections would ensure fair and transparent polls.\nThe PTI would introduce such transparent and efficient technology of electronic voting in the country, which could not be questioned by anyone, they added.\nThe meeting also lauded the role of overseas Pakistanis in the prosperity of the country and appreciated their record remittances. Considering their vital role, the PTI was striving to provide them voting rights with the use of modern technology so that they could participate in the election process.\nExpressing strong reservations over the negative propaganda through a post on the official page of the Election Commission, the committee expressed the confidence that the Commission would take immediate strict action and initiate proceedings against the responsible.\nThe prime minister also directed the chief ministers of Punjab and Khyber Pakhtunkhwa for taking steps to hold local government elections.\nThe committee also felicitated the chief minister KPK for reduction of poverty and provision of health care cards in the province under which every resident was provided with health insurance worth one million rupees. The members termed it one of the most important and historic achievements of the PTI’s government.\nParty chief organizer Saifullah Niazi and secretary-general Aamir Kiyani were directed to field candidates in the by-elections after consultations with the relevant members of parliament and assemblies and under a well-devised strategy.",
  "retrievedAt": "2025-08-11T20:45:19.255Z"
}
