{
  "title": "Farrukh rebuts Marriyum’s claim of ‘incorrect’ data on economic growth",
  "link": "https://www.app.com.pk/national/farrukh-rebuts-marriyums-claim-of-incorrect-data-on-economic-growth/",
  "date_published": "2021-05-23T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP): Minister of State for Information and Broadcasting Farrukh Habib Sunday categorically rejected the claim of Pakistan Muslim League-Nawaz (PML-N) spokesperson Marriyum Aurangzeb that the government had released ‘wrong’ data on economic growth.\nIn a statement, he termed the data, released by National Accounts Committee (NAC) on the country’s economic growth, ‘realistic’, adding “If someone [opposition] has an iota of doubt on the figures, he should come forward and prove them wrong.”\nThe minister said days were gone when the economic growth data was tempered and the governments of various parties [which are now in opposition] came up with fudged figures to befool the public.\nHe maintained that the present government had shared ‘accurate’ and ‘valid’ data with public and media.\nFarrukh said the opposition parties were completely baffled by the current projection of economic growth, declared by the NAC at 3.9 per cent, adding “It is hard for the opposition to digest it.”\nHe said despite of several challenges on the internal and foreign front such as Coronavirus pandemic, Locust attack and Pak- India tensions, the country’s economy was on right track due to prudent economic policies of Prime Minister Imran Khan. This was the major reason of opposition outcry on the current economic projection, he added.\nFarrukh said the prime minister was striving to get the country rid of foreign debts by transforming its economy into exports and production oriented.\nHe said the country’s exports surged by 13.5 per cent, while the large-scale manufacturing grew by nine percent. Likewise, almost every sector of the country including automobile, textile and others posted a marked increase, he added.\nComparing the present government’s economic performance with the PML-N’s, he said currently the foreign exchange reserves had reached at $23 billion. It stood at $9 billion during the last year of PML-N in the government (2018).\nWhen Pakistan Tehreek-e-Insaf came into the power the per-capita income was $1,498 dollars, which was now increased to $1,604, he added.\nHe said the PML-N economic policies were not sustainable and it had deceived the public by projecting unrealistic Gross Domestic Product (GDP) growth during its tenure.\nIt was the present government’s economic policies that ensured improvement in the GDP growth, he added.\nAt the time of PML-N, the current account deficit of the country was $19.2 billion with an economic growth of 5.5 percent, but it had registered a surplus of $1 billion with four per cent GDP growth during the PTI government.\nMoreover, the country received record remittances of $24 billion during the current fiscal year, while $ 1billion deposited in the Roshan Digital Bank accounts, in addition to an increase of $ 2.5 billion in Euro Bonds.\nIt was the present government which had exposed the previous one, he said citing PML-N leader Miftah Ismail example who criticized his own party’s finance minister Ishaq Dar for artificially maintaining the Pakistani rupee against the US dollars in the market.\nAs regards the delay in appointment of Pakistan Bureau of Statistics (PBS) head, he said it was the present government that introduced reforms in the department and attached it with the planning commission in administrative terms.\nHe said the last financial year of India, April March 2020-2021 was closed on -8 percent growth as well as of the United Kingdom that closed at – 9.9. At the same time, Bangladesh stood at 1.6 per cent while Turkey at 1.8 percent.\nHad the government not grappled with the prevailing challenges, the country’s GDP growth would have been higher than four per cent, he added.\nHe said those who remained indulged in corrupt practices and severely damaged the national economy throughout their life were now misleading the public while challenging government economic figures.\nThe minister asked the PML-N spokesperson to share his party’s tales on money laundering, fake accounts and establishment of off-shore businesses with public instead of giving lectures to the government on economy.",
  "retrievedAt": "2025-08-11T20:45:18.921Z"
}
