{
  "article_id": "2025-01-17_50ef3a49138eb15768992ab096026c5d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/azerbaijan-ambassador-visits-numl-to-commemorate-black-january/",
    "retrieved_at": "2025-08-27T11:45:07.141Z"
  },
  "metadata": {
    "title": "Azerbaijan Ambassador visits NUML to commemorate Black January",
    "author": null,
    "date_published": "2025-01-17T10:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 375,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 17 (APP): Ambassador of Azerbaijan to Pakistan, Khazar Farhadov visited the National University of Modern Languages (NUML) on Friday in remembrance of the tragic events of January 20,1990, known as Black January. The event, organized by the Azerbaijan Language and Culture Center, was held in solemn remembrance of the tragic events of Black January, to honour the martyrs who sacrificed their lives for Azerbaijan's independence. During his visit, Ambassador Khazar Farhadov met the Rector NUML, Maj Gen (R) Shahid Mehmood Kayani HI(M). Director General NUML, Brig Shahzad Munir, Dean Faculty of Languages, and other senior officials were also present during the meeting. The Rector warmly welcomed the Ambassador, highlighting the strong and historic brotherly ties between Pakistan and Azerbaijan. Both dignitaries emphasized the importance of further enhancing collaboration in education, particularly through exchanges between the universities of the two nations. The Ambassador appreciated Pakistan's unwavering support for Azerbaijan on regional and international issues and praised the cultural and educational bonds shared by the two countries. The Rector expressed interest in initiating joint academic projects and cultural exchanges to strengthen mutual understanding and cooperation. On this occasion, the Rector extended heartfelt condolences to the Ambassador and the people of Azerbaijan over the recent tragic airline crash, praying for the departed souls and their families. Following the meeting, the Ambassador participated in the commemorative event organized by the Azerbaijan Language and Culture Center at NUML. Students, faculty, and dignitaries paid homage to the martyrs of Black January through poetry, speeches, and heartfelt tributes. The Dean of the Faculty of Languages, the Head of the Turkish Language Department and the Head of the Azerbaijan Department highlighted the significance of the sacrifices made during the fateful events of January 1990. In his address, Ambassador Farhadov expressed gratitude to NUML for keeping the spirit of Azerbaijan's history alive and underscored the resilience and patriotism of those who laid down their lives for Azerbaijan's sovereignty. He lauded the role of the Azerbaijan Language and Culture Center at NUML in fostering a deeper understanding of Azerbaijan's culture and history among Pakistani students. The event concluded with the resolve to strengthen the existing partnership between Pakistan and Azerbaijan, not just at the governmental level but through people-to-people connections and academic collaborations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}