{
  "article_id": "2025-01-17_604fc0776d0fd145d0d7b6adf19a9583",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/judicial-commission-nominates-2-names-for-ihc-3-for-bhc-as-additional-judges/",
    "retrieved_at": "2025-08-27T11:46:21.327Z"
  },
  "metadata": {
    "title": "Judicial Commission nominates 2 names for IHC, 3 for BHC as Additional Judges",
    "author": null,
    "date_published": "2025-01-17T15:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 17 (APP):The Judicial Commission of Pakistan has finalized nomination of two names for appointment as Additional Judges for Islamabad High Court and three names for Baluchistan High Court in two separate meetings held at the Supreme Court premises here Friday. The two meetings of the Judicial Commission of Pakistan, one for considering the nominations for the appointment of Additional Judges in the Islamabad High Court and the second for considering the nominations for the appointment of Additional Judges in the High Court of Balochistan, were held in the Conference Room of the Supreme Court of Pakistan, at Islamabad. In the first meeting, the Commission, by majority of its total membership, nominated Muhammad Azam Khan, District and Session Judge and Inaam Ameen Minhas, Advocate Supreme Court, for their appointment as Additional Judges of the Islamabad High Court. In the second meeting, the Commission unanimously nominated Muhammad Asif, Advocate Supreme Court, Muhammad Ayub Khan Advocate Supreme Court and by majority of its total membership, nominated Muhammad Najam-ud-Din Mengal, Advocate Supreme Court, for their appointment as Additional Judges of the High Court of Balochistan. In both meetings, the Commission unanimously decided that nominees who did not secure the required majority of the total membership of the Commission for finalization of their nominations this time may be re-nominated for future vacancies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}