{
  "article_id": "2025-01-17_eb7906e788a380cab95bd34640c0f6d6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iobm-hosts-talk-by-shark-tanks-usman-bashir/",
    "retrieved_at": "2025-08-27T11:45:56.333Z"
  },
  "metadata": {
    "title": "IoBM hosts talk by Shark Tank’s Usman Bashir",
    "author": null,
    "date_published": "2025-01-17T07:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 312,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI, Jan 17 (APP):The Institute of Business Management (IoBM) hosted an engaging talk with Usman Bashir, a prominent entrepreneur, investor, and one of the Sharks on Shark Tank Pakistan. During the session , Usman shared his journey from being a student in Pakistan to building a successful entrepreneurial career in the USA, said a spokesperson of IoBM on Friday. He recounted how he felt overwhelmed when invited to become a Shark on Shark Tank Pakistan. Usman Bashir emphasized the importance of providing capital and mentorship to young innovators of Pakistan, noting that many possess potential but lack the resources and guidance to turn their ideas into reality. He shared his inspiring business journey, starting from managing a single gas station to expanding his company, BTCM (Braketime Corner Marketing), into a network of over 300 fuel stations across more than sixteen U.S. states, in collaboration with leading global fuel brands. BTCM also operates a back office in Pakistan, employing more than 500 people. Usman Bashir underscored the need for a strong foundation in scalable business success, focusing on robust infrastructure, teamwork, and interpersonal skills. Addressing students, he urged them to set clear goals, collaborate effectively, and execute smartly, particularly during the critical years between 20 and 25. \"This is the time to craft a vision and pursue it with determination,\" he said, highlighting the importance of combining hard work with smart strategies for impactful results. Talib Karim, President of IoBM, congratulated Usman Bashir on his achievements, emphasizing perseverance and dedication in turning ideas into ventures. He highlighted the pivotal contributions of IoBM alumni to Shark Tank Pakistan, including the co-founders of its production company and streaming platform, as well as its host-all proud IoBM graduates. In closing, Nabhan Karim, HoD MARCOM, delivered the vote of thanks, expressing optimism about Usman Bashir's inspiring journey and its profound impact on the entrepreneurial landscape of Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}