{
  "article_id": "2025-01-17_e4e174908d7fbd3b18f80610918c18bf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rain-windstorm-and-snowfall-predicted-in-northern-and-western-pakistan/",
    "retrieved_at": "2025-08-27T11:46:47.779Z"
  },
  "metadata": {
    "title": "Rain, windstorm, and snowfall predicted in northern and western Pakistan",
    "author": null,
    "date_published": "2025-01-17T12:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 267,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 17 (APP):The Pakistan Meteorological Department (PMD) has forecast moderate rain-windstorms accompanied by snowfall over hilly areas in northwest Balochistan and northern parts of the country from January 18 to 21, as a westerly wave is expected to approach the region on January 18. The weather system is expected to bring moderate rain and windstorms to areas including Quetta, Ziarat, Chaman, Pishin, Qilla Abdullah, Qilla Saifullah, Chagi, Noushki, Kalat, Barkhan, Khuzdar, Harnai, Zhob, Musakhel, Kharan, Kech, Panjgur, and Gwadar from January 18 to 20. Similarly, rain-windstorms and snowfall are predicted in Chitral, Dir, Swat, Shangla, Kohistan, Mansehra, Abbottabad, Haripur, Buner, Bajaur, Mohmand, Khyber, Orakzai, Kurram, Waziristan, Peshawar, Charsadda, Nowshera, Swabi, Karak, Kohat, Murree, Galliyat, Gilgit-Baltistan, and Kashmir from January 18 to 21. Light rain is also expected in Islamabad, Rawalpindi, Attock, Jhelum, and Chakwal on the evening and night of January 18 and during the day on January 19. The PMD has warned of possible flash floods in Chagi, Noushki, Kharan, Pishin, Qilla Abdullah, and Quetta during the night of January 18 and the morning of January 19. Moderate to heavy snowfall may cause road closures and slippery conditions in Naran, Kaghan, Chitral, Dir, Swat, Kohistan, Mansehra, Abbottabad, Shangla, Astore, Hunza, Skardu, Neelum Valley, and Quetta during this period. There is also a possibility of landslides and avalanches in hilly areas of Khyber Pakhtunkhwa, Gilgit-Baltistan, and Kashmir. The tourists and travelers are advised to exercise caution, while farmers have been urged to plan their activities accordingly. The authorities in vulnerable areas have been instructed to remain alert and take necessary measures to prevent any untoward incidents.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}