{
  "title": "Proactive monsoon measures in place: Chairman FFC",
  "link": "https://www.app.com.pk/national/proactive-monsoon-measures-in-place-chairman-ffc/",
  "date_published": "2024-07-11T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Chairman of the Federal Flood Commission, Engineer Ahmed Kamal said on Thursday that rigorous efforts have been made this year to prepare for the monsoon season.\nTalking to PTV World News, he said that all the federal and provincial organizations were proactively preparing for timely alerts and necessary actions for the monsoon season’s flooding.\n“All federal and provincial organizations start their preparations in January and February each year,” he added.\nKamal said this year alone, four meetings concerning monsoon preparations were held on March 4, April 26, June 10, and most recently on July 4. In these meetings, detailed directions were issued to all federal and provincial units.\nHe said letters were sent to the chief secretaries of the provinces regarding river encroachments and critical shore points on river systems to ensure effective flood fighting.\nThe Chairman FFC also addressed the issue of timely repairs to the Sukkur barrage gates with the Sindh provincial irrigation department.\nHe stressed the importance of having concrete contingency plans for all barrages and dams.\nKamal said, “We need to have well-prepared, well-knitted, and well-implemented contingency plans in place to safeguard the population, especially in the emergency situations.”\nSo far, he said 58 flood fighting plans from various provincial and federal organizations have been received and placed on the commission’s website.\nSpecific instructions have been given to the management of Tarbela and Mangla Dams, with flood mitigation committees for these dams, he added.\nThe Chairman FFC also advocated for the federal departments to have some leverage to assist at the district level, using a top-down and bottom-up approach for better on-ground results.\nHe further said that ‘The River Flood Plan Management Act’ has been shared with provinces for implementation soon.\n“Ensuring effective flood management and preparation is crucial for safeguarding lives and property,” Kamal said, underscoring the importance of coordinated efforts at all administrative levels.\nHe underlined the importance of coordinated efforts at all administrative levels and added that effective flood management and preparation are crucial for safeguarding lives and property.",
  "retrievedAt": "2025-08-11T03:51:37.789Z"
}
