{
  "title": "Govt making concerted efforts to reduce electricity prices: Awais Leghari",
  "link": "https://www.app.com.pk/national/govt-making-concerted-efforts-to-reduce-electricity-prices-awais-leghari/",
  "date_published": "2024-07-11T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Minister for Power Division Sardar Awais Ahmad Khan Leghari has apprised the National Assembly Standing Committee on Energy (Power Division) that the Power Division was making concerted efforts to reduce the price of electricity by intensifying anti-theft campaigns and reducing line losses.\nThe committee which met with Muhammad Idress in the Chair and was attended by MNAs; Dr. Tariq Fazal Chaudhary, Raja Qamer ul Islam, Chaudhry Naseer Ahmed Abbas, Rana Muhammad Hayat Khan, Khurshid Ahmed Junejo, Syed Waseem Hussain, Junaid Akbar, Malik Anwar Taj, Sher Ali Arbab, Haji Imtiaz Ahmed Chaudhry and Ali Afzal Sahi. Muhammad Iqbal Khan. The senior officers from Ministry of Energy (Power Division) and its attached departments also attended the meeting\nThe Secretary, Ministry of Energy (Power Division) briefed the Committee on working and performance of the Ministry and its attached departments. The Secretary informed that the Power Division dealt with the matters relating to development of power resources of the country, electric utilities, liaison with international engineering organization in power sector, federal agencies and institutions for promotion of special studies in power sector etc.\nHe further apprised that the Ministry had plans for development of large scale alternative renewable energy (ARE) projects including hydro power projects, local manufacturing of solar panels and solarization of agriculture tube-wells.\nDiscussing the matter raised by Muhammad Iqbal regarding the disconnection, over-billing and unannounced load shedding of electricity in erstwhile FATA, the Minister for Power Division apprised the Committee that subsidy of Rs 65 billion has been granted to the erstwhile FATA in the current budget. The Committee directed the Peshawar Electric Supply Company to give detailed briefing on the said matter in the next meeting of the Committee.",
  "retrievedAt": "2025-08-11T03:51:40.676Z"
}
