{
  "title": "PM stresses using technology for effective enforcement of customs duties",
  "link": "https://www.app.com.pk/national/pm-stresses-using-technology-for-effective-enforcement-of-customs-duties/",
  "date_published": "2024-07-11T07:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Prime Minister Shehbaz Sharif on Thursday emphasised taking all-out measures to do away with corruption in customs operations, removing unnecessary hurdles and using artificial intelligence and hi-tech equipment to ensure full enforcement of customs duties.\nThe prime minister, chairing a meeting to discuss the matters related to the Federal Board of Revenue (FBR) and Pakistan Customs, called the customs sector a backbone of country’s economy and said the FBR reforms and complete digitisation would guarantee economic security.\nHe instructed the authorities concerned to ensure the third-party audit of reform initiatives in FBR and other departments and bring all such projects under one umbrella.\nPrime Minister Shehbaz directed to increase revenue collection through better enforcement and establish a project management unit for reforms in the customs sector.\nHe said all the issues related to the mis-invoicing should be resolved and under-invoicing be eliminated to protect Pakistan’s industries and products. He also sought details of revenue collection as a result of enforcement and also instructed establishing a regulatory framework for the operations of the shipping industry.\nThe prime minister called for a third-party audit of a web-based one-customs system (WeBOC).\nDuring the briefing on the customs operations, it was told that the operations of the Pakistan Customs had been fully automated and experts of international repute had been engaged to bring in reforms that would feature modern AI-based systems.\nIt was told that around 72.4 percent of imports and exports were cleared through the green channel and Pakistan Customs collected Rs240 billion in additional revenue through valuation controls from July 2023-June 2024, which was around 80% above the previous year’s collection.\nFederal cabinet members Ahad Khan Cheema, Muhammad Aurangzeb and Ali Pervaiz Malik, Deputy Chairman of Planning Commission Jahanzeb Khan, Attorney General Mansoor Awan, PM’s Coordinator Rana Ehsan Afzal, Member of National Assembly Barrister Aqeel Malik, FBR Chairman Zubair Tiwana and relevant senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T03:52:06.800Z"
}
