{
  "title": "Rain likely at various parts of country:PMD",
  "link": "https://www.app.com.pk/national/rain-likely-at-various-parts-of-countrypmd-4/",
  "date_published": "2024-07-11T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Pakistan Meteorological Department (PMD) has forecast mainly hot and humid weather for most parts of the country during the next 24 hours.\nHowever, rain-wind/thundershower is expected at isolated places in Khyber Pakhtunkhwa, northeast Punjab, Pothohar region, Kashmir and Gilgit Baltistan.\nRain-wind/thundershower is also likely at isolated places in northeast Balochistan and central Punjab.\nHot and humid weather is likely with chances of rain-wind/thundershower in Islamabad and surrounding during morning/night.\nIn Khyber-Pakhtunkhwa, rain-wind/thundershower is expected at isolated places in Dir, Swat, Chitral, Kohistan, Shangla, Buner, Battagram, Abbottabad, Mansehra, Haripur, Khyber, Mohmand, Bajaur, Swabi, Mardan, Nowshera, Peshawar, Kohat, Hangu, Karak, Lakki Marwat, Bannu, D.I.Khan, Tank, Waziristan and Kurram. Isolated heavyfalls may also occur during the period.\nIn Punjab, rain-wind/thundershower is expected in Murree, Galliyat, Rawalpindi, Attock, Chakwal, Talagang, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Wazirabad, Lahore, Sheikhupura, Sialkot, Narowal, Sahiwal, Kasur, Okara, Pakpattan, Vehari, Jhang, Toba Tek Singh, Nankana Sahib, Chiniot, Faisalabad, Khushab, Sargodha, Mianwali, Bhakkar, Layyah, Multan, Khanpur, Rajanpur and Dera Ghazi Khan.\nHot and humid weather is expected in other districts of the province.\nIn Balochistan, mainly hot and humid weather is expected in most districts of the province. However, rain-wind/thundershower is expected at isolated places in Barkhan, Musakhel, Zhob, Quetta, Zhob, Qilla Saifullah, Loralai, Kohlu, Khuzdar, Lasbela and surroundings.\nIn Sindh, mainly hot and humid weather is expected in most districts of the province. However, partly cloudy weather with chances of rain/drizzle at isolated places in Tharparkar, Mithi, Umerkot, Badin, Mirpurkhas, Thatta and Karachi during evening/night.\nIn Kashmir/Gilgit-Baltistan, rain-wind/thundershower is expected in Kashmir and Gilgit-Baltistan. Isolated heavy falls may also occur in Kashmir during the period.\nDuring the last 24 hours, hot and humid weather prevailed over most parts of the country. However, rain-wind/thundershower occurred at isolated places in northeast Punjab, Pothohar region, Khyber Pakhtunkhwa, northeast Balochistan and Gilgit-Baltistan.\nThe rainfall recorded during the period was Punjab: Dera Ghazi Khan 05mm, Attock 02, Mangla, Murree, Sialkot (city) 01, Khyber Pakhtunkhwa: Malamjabba, Bannu 02, Balochistan: Zhob 02, Gilgit-Baltistan: Astore 01mm.\nThe highest maximum temperatures recorded were Dadu, Sibbi 47C, Jacobabad 46 and Dalbandin 45C.",
  "retrievedAt": "2025-08-11T03:51:33.311Z"
}
