{
  "title": "Pakistan, Azerbaijan sign 15 agreements, MoUs to enhance bilateral cooperation in diverse fields",
  "link": "https://www.app.com.pk/national/pakistan-azerbaijan-sign-15-agreements-mous-to-enhance-bilateral-cooperation-in-diverse-fields/",
  "date_published": "2024-07-11T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Pakistan and Azerbaijan on Thursday signed 15 Memorandum of Understandings (MoUs) and agreements to promote bilateral cooperation in a range of fields including trade, commerce, tourism, mines & minerals, science technology, law & justice and cultural exchange programs.\nPrime Minister Muhammad Shehbaz Sharif and Azerbaijan President Ilham Aliyev witnessed the signing ceremony held here at the PM House.\nDeputy PM and Foreign Minister Ishaq Dar and Azerbaijan Deputy Minister of Foreign Affairs Samir Sharifov signed a Memorandum of Understanding (MoU) between the Ministry of Foreign Affairs of Azerbaijan and the Ministry of Foreign Affairs of Pakistan on Consular Affairs.\nPreferential Trade Agreement between the government of Azerbaijan and the government of Pakistan was signed by Commerce Minister Jam Kamal Khan and Deputy Minister of Economy Azerbaijan Sahib Mammadov.\nSimilarly, an MoU on the cooperation between the Ministry of Economy of Azerbaijan and the Ministry of Privatization of Pakistan in the field of privatization of state property was signed by Minister for Privatization Abdul Aleem Khan and Deputy Minister of Economy Azerbaijan Sahib Mammadov.\nAnother agreement on Transit Trade between the governments of Azerbaijan and Pakistan was also signed between the two countries.\nThe two sides also agreed on a Memorandum of Cooperation (MoC) between the Ministry of Justice of Azerbaijan and Minister of Law and Justice of Pakistan. The MoC was signed by Minister for Law Azam Nazeer Tarar and Azerbaijan Minister for Defence Industry Vugar Mustafayev.\nAn Memorandum of Understanding (MoU) between the government of Pakistan and Azerbaijan on cooperation in the field of mineral resources and geology was signed by Petroleum Minister Dr Musadik Malik and Azerbaijan Minister of Energy.\nCultural Exchange Program between Pakistan and Azerbaijan for the year 2024-2029 was signed by Minister for Heritage and Culture Attaullah Tarar and Azerbaijan Minister of Foreign Affairs Samir Sharifov.\nLikewise the two sides also signed an MoU between the Ministry of Digital Development and Transport of Azerbaijan and the Ministry of Information Technology and Telecommunication of Pakistan on cooperation in the fields of information and communication technologies.\nAn MoU on cooperation between Azerbaijan Television and Radio Broadcasting (CJSC) and Pakistan Television Corporation (PTVC) was signed by Secretary Information Shahera Shahid and Ambassador of Azerbaijan Khazar Farhadov.\nThe two sides also signed an MoU on establishing of twinning links between the city of Baku and Islamabad, and another MoU between Small and Medium Business Development Agency of Azerbaijan and SMEDA Pakistan.\nAn agreement between Government of Pakistan and Government of Azerbaijan for scientific and technological cooperation was also signed between the two sides.\nAn agreement on cooperation in the field of tourism between government of Azerbaijan and Government of Pakistan was signed by Secretary IPC Nadeem Irshad Kayani and Azerbaijan Minister of Defence Industry.\nAn MoU on cooperation in the field of literature between the institute of literature named after Nizami Ganjavi of Azerbaijan National Academy of Sciences (ANAS) and Pakistan Academy of Literature (PAL) was signed by Chairman Pakistan Academy of Letters Prof Dr Najeeba Arif and Ambassador of Azerbaijan Khazar Farhadov.\nAir Services Agreement was also signed between the governments of Pakistan and Azerbaijan.",
  "retrievedAt": "2025-08-11T03:51:34.515Z"
}
