{
  "title": "PMD closely monitoring flood situation through its observatories across country: DG PMD",
  "link": "https://www.app.com.pk/national/pmd-closely-monitoring-flood-situation-through-its-observatories-across-country-dg-pmd/",
  "date_published": "2024-07-11T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Director General, Pakistan Meteorological Department (PMD), Mahr Sahibzad Khan Thursday said that his department is closely monitoring the rainfall and flood situation round the clock through its observatories installed across the country and disseminating information to all the stakeholders to take precautionary measures.\n“Through its 116 observatories, PMD is assessing the weather situation promptly to keep all the stakeholders aware about any unusual weather to take precautions”, the DG PMD said during a presser, flanked by senior officials of the department.\nHe said that the country has received 08 percent above normal rainfall during the ongoing monsoon season which will last till mid of September.\nThe Punjab province, he told, has received 59 percent more rainfall. However the other provinces have received lesser rainfall with Khyber Pakhtunkhwa – 01 percent, Azad Jammu and Kashmir – 18 percent, Balochistan – 28 percent,\nSindh – 62 percent and Gilgit Baltistan – 63 percent.\nThe monsoon activity, he said, is likely to increase in the coming days in upper and central parts of the country.\nSahibzad Khan said that although the water level in the rivers is increasing with frequent rainfall but there is no such alarming situation so far. The PMD is also issuing comprehensive weather advisories to all the stakeholders to adopt timely measures to avoid any uncertain situation.\nHe said the department is issuing separate advisories for the tourists and farmers to keep them well informed about the weather.\nHe said that the lightening detectors, provided by China, are also being utilized to gather the data of lightning from across the country which lead to rain and thunderstorm.\nHighlighting the accuracy and efficiency of PMD in issuance of weather forecast and warnings, the DG said that World Meteorological Organization (WMO) acknowledged PMD timely and accurate forecast of floods of the year 2022.\nAbout the weather situation, the DG said that the tendency of above normal rainfall is expected in most parts of the country especially in northeastern Punjab and lower Sindh during the month of July. The day time maximum temperatures are expected to remain nearly normal over most parts of the country during this month.\nHe said from July to September, above normal rainfall is expected in most parts of the country with maximum departure over upper Punjab and lower Sindh. Northern Khyber Pakhtunkhwa and Gilgit-Baltistan may get nearly normal rainfall whereas most parts of Balochistan may also receive above normal rainfall during the season.",
  "retrievedAt": "2025-08-11T03:51:39.179Z"
}
