{
  "title": "Pakistan, Germany share rich history of diplomatic relations: Gilani",
  "link": "https://www.app.com.pk/national/pakistan-germany-share-rich-history-of-diplomatic-relations-gilani/",
  "date_published": "2024-07-11T15:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Chairman Senate Syed Yousaf Raza Gilani Thursday said that Pakistan and Germany share rich history of diplomatic relations founded in mutual trust, cooperation and a commitment to global peace and development.\n“Germany is a valuable partner of Pakistan bilaterally and in the EU context and we are keen to further strengthen this partnership” he expressed these views in a meeting with a three member German parliamentary delegation led by Michael Muller, MP, German Bundestag.\nThe Chairman Senate specially mentioned the high level contacts and said that Pakistan desires to promote more interactions at all levels, said a news release.\nHe also underscored the need to promote parliamentary exchanges between the two countries and said that high level political contacts help bring people closer.\nHe informed that the Senate of Pakistan was working on establishing friendship groups to promote people to people contacts for better understanding.\nWhile appreciating the development cooperation, he expressed the desire to continue efforts for tackling climate change related challenge.\nHe said that German assistance for rehabilitation flood and earthquake victims was remarkable as it helped in providing relief to the homeless and shelter less communities during the crisis at that time.\nBoth Pakistan and Germany, he said, enjoy cordial relations and cooperation at international forums like IPU and CPA. Such a bond of friendship and collaboration shows that Germany is a trusted partner, Chairman Senate remarked, he added.\nThe Senate Chairman also emphasized increasing bilateral trade volume and said that huge potential exists to further boost mutual trade and economic cooperation.\nDuring the meeting, the Chairman Senate observed that education, sports particularly football, energy, health, environment and climate change are some of the areas where Pakistan can learn from German experiences.\nHe also appreciated Germany for providing scholarships to Pakistani students for higher studies. He specifically observed that inordinate delays in the issuance of student, family reunion and business visas were creating hardships for the people and hoped that the issue would be addressed as early as possible.\nThe Chairman said that Pakistan was committed to promoting peace and stability in its neighborhood and beyond on the principles of UN charter for peaceful settlement of disputes through dialogue and diplomacy.\nHe said that durable peace in South Asia remains contingent upon peaceful resolution of Jammu and Kashmir dispute in accordance with the relevant UNSC resolutions and as per aspirations of the Kashmiri people.\nHe said that human rights had remained a top concern for European countries and in this regard, they may use their influence over India to improve the human rights situation in the Indian illegally occupied Jammu and Kashmir (IIOJK) and halt political engineering.\nHe also highlighted the Palestine situation and said that it was deeply upsetting for Pakistan that Israeli aggression against civilians in Gaza and Rafah does not show any sign of stoppage. He called upon the international community to take steps for immediate ceasefire and reiterated that there can be no peace in the region unless dialogue based approach on the two States solution is adopted.\nOn defence cooperation between Pakistan and Germany, he called for revisiting the German decision for imposing ban on selling small arms to Pakistan.\nRegarding Afghanistan, he said that Pakistan hosted more than 3.5 million Afghan refugees for decades after the Soviet invasion and still continues to host a large number of refugees. Currently there are three thousand refugees who have not been relocated and Germany should help in this regard.\nPeace in Afghanistan is in the best interest of Pakistan, however, the human rights violations are a great concern for us. “My passion is to work for peace”, the Chairman Senate said and added, we want a stable, prosperous, independent, sovereign and peaceful Afghanistan which is in the best interest of Pakistan and the region.\nThe Chairman Senate also acknowledged the positive role played by Pakistan diaspora in the socio-economic development of Germany while saying the community is acting as a bridge between Pakistan and Germany.\nSenator Sherry Rehman, Senator Irfan Siddiqui and Senator Abdul Qadir from the Pakistani side also expressed their views during the meeting.\nThey called for cooperation in diverse sectors including energy and climate change to introduce new approaches and pathways for de-carbonization. Senator Sherry appreciated German assistance in the field of climate finance. Senator Irfan Siddiqui emphasized the need to enhance cooperation in the education sector. Senator Abdul Qadir observed to further cement business to business linkages.\nHe observed that 60 percent of our population consists of youth and in this regard called for more technical training programs from medium to highly skilled workers and continues exchange of technology.\nThe leader of the German delegation thanked Chairman Senate for the warm welcome at the Parliament House.\nHe said Pakistan is an important country for Germany and it should continue to act as a stability anchor for the region.\nHe also called for broadening the mutual collaboration through diversified linkages. He said that Pakistan was most affected by the impacts of climate change and there was huge potential where both Pakistan and Germany can work together and share experiences.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:51:35.979Z"
}
