{
  "title": "Diplomats, analysts, politicians, religious scholars say a group of people can’t dictate Govt on foreign policy",
  "link": "https://www.app.com.pk/national/diplomats-analysts-politicians-religious-scholars-say-a-group-of-people-cant-dictate-govt-on-foreign-policy/",
  "date_published": "2021-04-17T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Diplomats, analysts, politicians and religious scholars have said that formulation and implementation of foreign policy is the government’s job and a group of people cannot dictate it to toe their line.\nThe violent protest of Tehreek-i-Labbaik Pakistan (TLP) workers has been condemned by people hailing from different walks of life including religious scholars, politicians, intellectuals and human rights activists.They said no such groups should be allowed to spread religious hatred in society and resorted to violence.\nThey urged the government to take stern action against the miscreants for ensuring writ of the state.\nThe government has officially banned the Tehreek-i-Labaik Pakistan under the\nanti-terror laws for discouraging the narrative of extremism, intolerance and violence in the country and issued a notification accordingly.\nThe extreme step comes in response to nearly three days of rioting after leader of TLP Saad Rizvi was arrested.\nThe TLP workers had blocked roads and highways across the country and destroyed public and private property. The enraged workers also attacked policemen, leading to loss of precious lives injuring and hundreds of people.\nTalking to APP, former ambassador Asif Durrani said formulation and implementation of foreign policy was the government’s job, adding that a political or religious group could give their opinion to government on an issue but they could not dictate it.\nHe said such demand of TLP to expel the ambassador of France from Pakistan was neither fair diplomatically nor politically. The former envoy said no such group should be allowed to spread religious hatred in society and resorted to violence on issues of foreign policy.\nFormer ambassador Ayaz Wazir said nowhere in the world such kind of groups dictated the governments to follow their line of action on international issues, adding that it was job of the government to run its global affairs.\nDr Qibla Ayaz, Chairman Council of Islamic Ideology (CII) told APP, “The protests that block roads, ambulances, demonstrate violence and harm people were against the spirit of Islamic injunctions.”\nHe said official decisions should be taken by the stakeholders (expert officials) who understood the nature of international laws and bilateral relations and not by a group of people.\nWelcoming the government decision of banning TLP, the Awami National Party (ANP) Provincial President Aimal Wali Khan told APP that despite in opposition, “ANP as ideological political party of the country supports the government to fully act upon the National Action Plan (NAP) by taking action against all the extremist groups and ban them.\nReligion should no more be exploited for political purposes by the pressure groups to bring bad name to the country by playing with the public sentiments”, he added.\nSecretary General South Asian Free Media Association (SAFMA), Imtiaz Alam said, “I don’t think religion permit violence, hate, and destruction and those who want to champion the cause of the Prophet (Peace Be Upon Him), they should truly follow his teachings.” He said, “Simply banning of the group was not enough, the use of religion for political purposes should also be stopped.”\nMajority of people on social media have also criticized the blatant violence of the TLP protesters on roads. Federal Minister Ch Fawad Hussain said on his twitter account that Islam has spread in the subcontinent with message of humanity,\nlove and peace through saints. He said it was the duty of each and every Muslim to discourage the extremists of TLP who wanted to change the identity of Islam by fueling violence and extremism in the country.\nThe government could not be blackmailed while those who committed violence against the police personnel should be brought to justice, he added.\nTalking to APP, Hafiz Mohammad Tahir Ashrafi, Special Representative of the Prime Minister on Religious Harmony and Middle East said peaceful protest was the basic right of the people in democratic societies.\nHe, however, said, “No state can tolerate killing of its people, burning of their properties and holding them hostage, it was not only sad but also condemnable.”\nRegarding ban on TLP, he said, “Looking into the current circumstances, the government has decided in the best interest of the country and the nation to ban the party, he added.",
  "retrievedAt": "2025-08-11T20:38:08.309Z"
}
