{
  "title": "Punjab all set to scale up contact tracing of coronavirus cases: Minister",
  "link": "https://www.app.com.pk/national/punjab-all-set-to-scale-up-contact-tracing-of-coronavirus-cases-minister/",
  "date_published": "2021-04-17T17:46:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 17 (APP): Punjab is all set to scale up contact tracing and increase the number of smart lockdowns in the wake of increasing number of Corona cases.\nThis was said by Punjab Health Minister Dr Yasmin Rashid in the NCOC meeting at the Specialized Healthcare and Medical Education Department here on Saturday.\nDr Yasmin Rashid apprised the participants about measures to increase the capacity of public sector hospitals, vaccination status, implementation of SOPs and measures for smart lockdowns. Federal Minister Asad Omar appreciated Punjab’s performance for control of the Corona Pandemic.\nThe Health Minister said the Punjab government was utilizing all out resources to control the pandemic. The treatment capacity of government hospitals was being gradually improved, she informed. She said the SOPs were being implemented.\nShe said that overall 27,000 citizens were being vaccinated per day,adding that the Corona testing capacity was also being continuously improved.\n“Our current focus is on scaling up the Contact Tracing,” she added. The minister said that smart lockdowns were being enforced in cities showing higher positivity ratio.\nPeople were being regularly updated about the seriousness of the situation and the importance of SOPs, she said.\nShe said that Oxygen supply remained uninterrupted for all hospitals.\nShe said the Punjab government was getting more vaccines very soon, adding that during the holy month of Ramazan, the vaccination of citizens was being undertaken in two shifts.\nShe said the morale of the frontline health workers was high. Secretary Specialized Healthcare and Medical Education Barrister Nabeel Awan and Secretary Primary and Secondary Healthcare Department Sarah Aslam were present whereas Special Assistant to Prime Minister Dr. Faisal Sultan, Health ministers of all provinces and officials of the National Command and Control Center attended via video link.",
  "retrievedAt": "2025-08-11T20:38:03.346Z"
}
