{
  "title": "Maryam promises rebuilding homes, compensation for losses to flood victims",
  "link": "https://www.app.com.pk/national/maryam-promises-rebuilding-homes-compensation-for-losses-to-flood-victims/",
  "date_published": "2022-08-31T14:34:00.000Z",
  "source": "APP",
  "content": "RAJANPUR, Aug 31 (APP): PML-N Vice President Maryam Nawaz Sharif on Wednesday promised to rebuild homes of the flood hit communities and compensate them against the losses they had suffered in the catastrophic floods triggered by torrential monsoon rains that turned into ferocious hill torrents, hitting Rajanpur and Dera Ghazi Khan districts.\nLIVE #APPNews : Pakistan Muslim League-Nawaz leader Maryam Nawaz Sharif interacts with the flood-affected people #FloodsInPakistan #FloodReliefOperations https://t.co/3K4loBtiXR\n— APP  (@appcsocialmedia) August 31, 2022\nDuring her visit to Fazalpur city, the only urban area of Rajanpur submerged by the floods, the PML-N central leader sympathized with the flood victims including women and children and told them that the federal government would not leave them alone in the extremely difficult times.\nMaryam said she realized the pain and agony inflicted by floods on the people of Rajanpur and was deeply saddened after witnessing homes destroyed in streets and Mohallahs of Fazaalpur.\nThe PML-N vice president said she was visiting flood hit areas on the instructions of his father, PML-N Supremo Muhammad Nawaz Sharif so that the flood hit people should not feel themselves alone.\n“I am here to promise PML-N will leave no stone unturned in serving the people. These are testing times that forced the people to settle in relief camps. But they must not worry. Federal government would not only rebuild your homes but also compensate against losses,” she added.\nMaryam said, she held in high esteem the unbreakable relationship of love and respect with the people, adding this relationship would stay alive forever.\nShe met with women availing shelter at a relief camp on a road near Daanish School Fazalpur, talked to them and hugged children there.\nShe praised the women for their courage of survival and said that relief operation was in progress while rehabilitation process would also begin soon to restore life on the landscape ravaged by floods.\nShe distributed tents, food items, medicines, blankets, and clothes among the affected people.\nDeputy Speaker Punjab Assembly Sardar Sher Ali Gorchani thanked Maryam Nawaz Sharif for paying visit to the flood hit areas, adding it rekindled hopes among the affected people that they would soon be returning to normal life.\nChief Leghari Tribe Pakistan and former Senator Sardar Jamal Khan Leghari, former MNA Sardar Hafeez Ur Rahman Dareshak, PML-N leader Sardar Ammar Awais Khan Leghari, former MPA Syed Abdul Aleem Shah, and Sania Ashiq also sympathized with the flood hit people on the occasion.\nEarlier, upon her arrival, the PML-N workers and office bearers accorded war welcome and showered rose petals on Maryam Nawaz Sharif at Muhammad Pur and Fazalpur.",
  "retrievedAt": "2025-08-11T15:29:47.331Z"
}
