{
  "title": "Sanjrani calls upon international community to support Pakistan",
  "link": "https://www.app.com.pk/national/sanjrani-calls-upon-international-community-to-support-pakistan/",
  "date_published": "2022-08-31T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Chairman of Senate Sadiq Sanjrani on Wednesday called upon the international community to extend support to Pakistan to cope with the current floods situation which had affected various parts of the country.\nDuring a meeting with Ambassador of Qatar, Sheikh Saoud Abdul Rahman Al-Thani, the Chairman commended the support of the developed countries and especially Qatar extended to Pakistan during the current natural crisis.\nMatters of mutual interest, bilateral relations and the prevailing flood situation in Pakistan were discussed during the meeting.\nThe visiting dignitary expressed solidarity and regretted the loss of precious lives due to the devastating flash flood in Pakistan.\nChairman Senate underlined that Pakistan and Qatar have a common vision for the development and prosperity of the region, adding that trade, diplomatic, parliamentary and institutional cooperation needs to be enhanced further.\nPakistani diaspora living in Qatar are playing an important role in the economic development of Qatar and cementing ties between the two countries.The meeting also discussed and agreed on speeding up exchanges of high-level delegations and taking economic ties to new heights.\nWhile discussing the current flood situation in Pakistan, Chairman Senate stressed the need for speeding up the relief efforts as scores of people, particularly in Balochistan and Sindh have suffered due to the large-scale defacement caused by the flash floods.\nHailing the efforts of the Emir of Qatar, Sanjrani said that the Emir of Qatar has played a key role in the overall economic development and prosperity of Qatar. The efforts of the Emir of Qatar are praise-worthy and inspirational, he added.\nBoth sides reiterated their resolve for supporting each other during hard times and further enhancing cooperation in diverse fields.",
  "retrievedAt": "2025-08-11T15:29:53.493Z"
}
