{
  "title": "Rehabilitation efforts to kick in after damage assessment in flood-hit areas: Kaira",
  "link": "https://www.app.com.pk/national/rehabilitation-efforts-to-kick-in-after-damage-assessment-in-flood-hit-areas-kaira/",
  "date_published": "2022-08-31T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Adviser to the Prime Minister on Kashmir Affairs and Gilgit-Baltistan (GB), Qamar Zaman Kaira on Wednesday said full fledge rehabilitation efforts would be initiated after complete damage assessment which was underway.\nIn a joint news conference, Adviser to the Prime Minister on Kashmir Affairs Qamar Zaman Kaira and Minister for Railways Khawaja Saad Rafique said the unprecedented torrential rains had swept away all the mud houses in Sindh and Balochistan where damage assessment was not possible due to inundation and no access to affected districts.\nKaira said there was unmatched downpour season in Sindh as 1,700 millimeters (mm) rainfall was recorded in Badin and almost 1300-1500mn in its majority areas whereas the weather pattern was similar in other affected districts of Khyber Pakhtunkhwa (KP).\nHe said that monsoon rains in GB’s backward areas increased water flows in rivers across the country which resulted in high flood in Sindh province due to its geographical terrain.\nThe water from all regions including the neighbouring Balochistan entered into Sindh that wreaked havoc, he said, adding, “accessing people is difficult in the prevailing situation.”\nDespite government’s earnest efforts, the damage assessment was not possible due to complete destruction of bridges and road infrastructure damages.\n“We will do rescue and relief first then will focus on rehabilitation,” he said lashing out at the Pakistan Tehreek-e-Insaf (PTl) leadership for hurling blatant criticism on government’s donation collections.\nHe accused the PTI leadership of tainting the minds of donors to by spreading misinformation about misappropriations in the disbursement procedures. “There have been no major donations rather only few from UAE, Turkey and China have been received. However, Imran Khan preempted to destroy foreign relief efforts through his orchestrated narrative.”\nHe said that this was an attack on Pakistan, adding, “PTI should have enmity with its opponents but not with the country.”\nHe lambasted the PTI leadership and critics for accusing the government to have zero presence on ground for relief efforts. “There is huge flooding in the affected areas. The district administrations have the public servants and employees at its disposal to respond to the affected people whereas the public and private sectors are evenly affected due to heavy rains.”\nHe said in this scenario the armed forces were the public departments and national institutions that responded and acted in coordination with the federal government.“This is inaccurate to say that there is no government in the flood affected areas.\nThe armed forces are doing their job with an unmatched dedication and commitment in calamities all around. They have always rendered huge services and sacrifices as from soldiers to generals embraced martyrdom in flood relief efforts.”\nHe underscored that the crisis was huge and the damages were unprecedented as there were almost two million houses damaged across the country in flashfloods and torrential rains.\nKaira informed that all the available tents were dispatched and more orders were placed to local and foreign manufacturers. “We are making emergency measures but it will take time. It was continuously raining in the affected areas and there was no access to those areas.”\nHe regretted that the media continued highlighting Imran Khan and Shahbaz Gill stories despite the government’s exhortations to pay heed to floods in Sindh and Balochistan during the first spell.\nHe thanked all donors and non-governmental organisations Akhuwat, Salani, Al-Khidmat and others international NGOs for doing great job in flood impacted areas. “We will leave no one alone in this crisis,” he reiterated.",
  "retrievedAt": "2025-08-11T15:29:50.363Z"
}
