{
  "title": "President underlines need for long term planning to control flood devastation",
  "link": "https://www.app.com.pk/national/president-underlines-need-for-long-term-planning-to-control-flood-devastation/",
  "date_published": "2022-08-31T09:21:00.000Z",
  "source": "APP",
  "content": "NOWSHERA, Aug 31 (APP):President Dr Arif Alvi here Wednesday said the recent flood have made colossal losses to public lives and properties and underlined the need for long term planning to control devastation of floods in future.\nTalking to floods victims at relief camp established at government high school Amangarh here, the President said the floods have badly affected Nowshera, Charsadda, Swat, Dir, DI Khan, Tank and others districts of Khyber Pakthunkhwa where a large number of people were displaced and looking for our help.\nHe said hotels, roads, bridges, houses, livestock, standing crops and gardens were also affected by the devastating floods in Khyber Pakthunkhwa.\nThe President directed the provincial government to further expedite relief and rehabilitation operations besides accelerating efforts for reconstruction of houses in the flood hit areas.\nThe President said that all government organizations including armed forces of Pakistan were working in coordination to provide relief to the flood victims.\nWhile highly appreciating Pakistan’s armed forces’ role in evacuation of flood victims in Khyber Pakthunkhwa and others provinces, the President said that their role in distribution of food and non food items among the affected population was also praised worthy.\nDr Arif Alvi said flood victims were looking for our help and assistance in this hour of need and urged the entire nation including philanthropists to come forward and generously contribute for their assistance and help.\nThe President also appreciated performance of local and International NGOs including Red Crescent during floods relief operations. The President expressed satisfaction over the provision of assistance facilities including food and non food items to flood survivors inside the camp and inquired about their problems and demands. The President also expressed sympathies with flood victims.\nLater, the President inspected flood situation in River Kabul from Mardan bridge. Earlier, the President was giving detailed briefing by Deputy Commissioner Nowshera Mir Raza Ozgan about rescue, relief and rehabilitation operations in Nowshera district. The President was informed that about 25,000 flood victims were accommodated in 100 relief camps in Nowshera district.\nLikewise, about 150,000 people were affected from floods in Nowsehra and the KP Government has made assistance amount doubled for flood victims. Due to timely floods information to masses, the people around banks of river Kabul were shifted to safer places and the flood protected embankment along river Kabul have averted big losses in Nowshera.",
  "retrievedAt": "2025-08-11T15:29:54.820Z"
}
