{
  "title": "166 Pakistani students selected for Erasmus+ Programme",
  "link": "https://www.app.com.pk/national/166-pakistani-students-selected-for-erasmus-programme/",
  "date_published": "2022-08-31T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): The Higher Education Commission (HEC) on Wednesday held a pre-departure session for 166 Pakistani students, 86 men and 80 women, who have won scholarships and will soon leave for different European countries to study under the Erasmus+ Scholarship Programme.\nMoving up from third place last year, Pakistan has been ranked first in the world for number of scholarships awarded under the Erasmus Mundus scholarships this year, as a total of 3,013 students from 133 countries have been selected for the scholarships.\nThe pre-departure session held to celebrate the scholarship awardees for 2022 was graced by Chairman HEC Dr. Mukhtar Ahmed, Deputy Head (Chargé d’Affaires) Delegation in EU in Pakistan Mr. Thomas Seiler, Executive Director HEC Dr. Shaista Sohail, representatives from European Embassies in Islamabad, Erasmus alumni, and new Erasmus Master’s scholarships awardees.\nAddressing the ceremony, Dr. Mukhtar Ahmed congratulated the Pakistani students on their selection and advised them to play the role of Pakistani ambassadors to portray the real face of Pakistan through their performance and character.\nHe urged them to exploit the opportunity to not only acquire knowledge but also strengthen networking for becoming part of a global team in future.\nRegarding the enormous increase in the number of scholarship winners, he said, “it is important to be first, in terms of numbers, in winning the scholarship, but it is more important to maintain the tempo in the coming years.”\nHe asserted that the Pakistani youth, being dynamic and adaptive, will adapt themselves to the European culture and society while staying strongly connected to their native traditions and culture.\nThomas Seiler stated that EU is open to embrace globalisation which cannot help without exchange of people and cultures.\nHe said that the EU member states recognise the significance of higher education in terms of reaping the fruits of globalisation and contributing to the socio-economic development of countries.\nThe Chargé d’Affaires expressed pleasure that the Pakistani students were well-prepared to earn as much as 166 scholarships.\nHe called upon the scholarship awardees not to be nervous about a new county as they will certainly experience a number of pleasant discoveries alongside acquisition of education. He said that the Erasmus+ Programme’s team has an effective coordination with the EU member states.\nIt is pertinent to mention here that the Erasmus scholarship award started its operation at Pakistan in 2014 and HEC offered it facilitation to EU in 2016. Last year, 126 Pakistani students were awarded out of a total of 2,542 scholarships awarded worldwide.\nPakistan thus ranked third in the world in the number of scholarships. A total of 421 scholarships were awarded from 2015 to 2020-21.\nHEC provides support in dissemination of Erasmus scholarships through workshops and information sessions in higher education institutions across Pakistan.\nIt publishes the details of scholarships on its website for faculty and students and facilitates in sending off the Pakistani selected scholars.\nThe Erasmus+ Programme is a prestigious, integrated, international study programme, jointly delivered by an international consortium of higher education institutions.\nIt is designed to support programme countries efforts to benefit from European knowledge institutions in a lifelong learning perspective. It is a programme for education, training, youth and sport for 2021–2027.\nIt offers a range of opportunities for higher education students, staff and institutions from around the world. It places a strong focus on social inclusion, the green and digital transitions, and promoting young people’s participation in democratic life.",
  "retrievedAt": "2025-08-11T15:29:42.961Z"
}
