{
  "title": "Girls remain on top in federal board intermediate results 2022",
  "link": "https://www.app.com.pk/national/girls-remain-on-top-in-federal-board-intermediate-results-2022/",
  "date_published": "2022-08-31T11:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Federal Board of Intermediate and Secondary Education (FBISE) on Wednesday announced the results of Higher Secondary School Certificate (HSSC) Part-II Annual Examinations 2022.\nThe girls were hailed for being dominant and clinching top slots in 2022 HSSC exams, in a ceremony held at the FBISE, which was attended by the Chairman Higher Education Commission (HEC) Dr Mukhtar Ahmad as chief guest, Chairman Federal Board Qaisar Alam, position holders, parents and teachers.\nAccording to details, 75,368 regular, private and ex-students enrolled in the HSSC Part II examinations, out of which 61,741 passed with a percentage of 83.35.\nIn Humanities Group, the first position was secured by Faiza Younis from Islamabad Model College for Girls F-7/2 Islamabad, with 1018 marks, while the second position was clinched by Emaan from Mashal Degree College for Women Wah Cantt. with 991 marks.\nHowever, the third position was shared among Maheen Gul from Jamia Tul Mohsanat H-13 Islamabad and Unsa BiBi from Wise School & College for Girls, Wah Model Town Wah Cant with 989 marks .\nIn Pre-Medical Group, the first position was achieved by Tooba Abdul Basit from Punjab College Attock Refinery Road Rawalpindi with 1081 marks. The second position was taken by Minahil Rashid from Army Public School and College (Girls) Humayun Road Rawalpindi Cantt. with 1077 marks. The third position was secured by Emaan Safdar from Army Public School and College Gujranwala Cantt. with 1076 marks.\nIn Pre-Engineering Group, the first position was secured by Huda Noor Ahmad from Sir Syed College Wah Cantt with 1071 marks.\nThe second position was shared between two students including Abdul Rehman Memon and Amal Kashif both from Hamza Army Public School and College (Girls) Stadium Road Rawalpindi with 1070 marks. The third position was clinched by Saaim Ahmed from F.G Sir Syed College, The Mall Rawalpindi with 1068 marks.\nIn General Science Group, the first position was taken by Iqra Mehmood Punjab College Attock Refinery Road Rawalpindi securing 1061 marks. The second position was clinched by Aysha Hussain from Askaria College Girls Wing Rawalpindi with 1056 marks, while third position was taken by Rao Muhammad Haris Fazaia Inter College E-9 Islamabad with1054 marks.\nIn Commerce Group, the first position was taken by Muhammad Abdullah from HCCS Educational System Main Peshawar Road Rawalpindi Cantt with 1028 marks. Similarly, the second position was shared among Aniqa Safdar and Rabia Ansari, both from Harvard College of Commerce Sciences Main Peshawar Road Rawalpindi with 1025 marks. While the third position was clinched by Muhammad Taha Mustafa from Fauji Foundation College for Boys New Lalazar Rawalpindi Cantt with 1020 marks.\nOn this occasion, Chairman Higher Education Commission (HEC) Dr Mukhtar Ahmad congratulated the students, parents and teachers on their success in the exams and wished them good luck in the future.\n“Our youths are talented and have enough potential to compete the world” Dr Mukhtar said while lauding position holders for getting highest marks.\nHe also suggested all the educational boards across the country to declare the results on same day so that the students would not suffer in getting admissions in the universities.\nChairman HEC stressed the Secretary Inter Board Committee of Chairmen (IBCC) to make sincere efforts to achieve the task of convincing all educational boards for declaring results on same day, adding, HEC will provide all kind of support to IBCC in that regard.\nEarlier, in his opening remarks, Chairman FBISE Qaisar Alam shared the salient features of the results and said that the results were compiled only in 38 days.\n“We used the latest technology in conduction of exams to ensure transparency” he added. He further said that Federal Board is playing leading role among other boards of the country in advancement in conduction of exams.\nQaisar Alam also briefed the participants about the overall procedure of exams conduction through technology. He said that we have moved from rote learning to conceptual learning by adopting new techniques. He added that qualitatively the results are better in 2022 than previous few years.",
  "retrievedAt": "2025-08-11T15:29:51.643Z"
}
