{
  "title": "PM to roll out detailed rehabilitation plan soon: Saad",
  "link": "https://www.app.com.pk/national/pm-to-roll-out-detailed-rehabilitation-plan-soon-saad/",
  "date_published": "2022-08-31T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Minister for Railways Khawaja Saad Rafique on Wednesday said that Prime Minister Shehbaz Sharif would roll out a detailed rehabilitation and reconstruction plan for the flood-hit areas after consultation with the coalition partners soon.\nAddressing a press conference along with Adviser to Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira, he said the armed forces, National Disaster Management Authority (NDMA), Provincial Disaster Management Authorities, philanthropists and civil administration have played a crucial role for the relief activities.\nSaad Rafique said that all these institutions should continue their role till the rehabilitation and restoration of all the flood impacted areas.\nThe minister said the catastrophic floods have broken the record of 2010 super floods that most impacted the areas of Balochistan and Sindh while the situation in Khyber Pakhtunkhwa and Punjab was also worrisome.\nHe said the country was already passing through a pressing economic crisis, and on such occasion the floods destroyed the economy and all the government institutions were engaged in rescue operations.\nSaad Rafique said the recovery phase would be even more difficult, and the prices of vegetables were skyrocketing but the government would leave no stone unturned for the rehabilitation of flood victims.\nHe said the whole nation was actively participating to help the flood victims whereas the international community had also joined hands to help Pakistan in the need of hour. “On the other hand the evil mind (PTI Chief Imran Khan) was stopping the chief ministers of Punjab, Khyber Pakhtunkhwa, Gilgit Baltistan and Prime Minister AJK to attend the Flood Relief Conference which was held at PM House.”\n“We held a flood relief plan meeting which was participated by Chief Ministers of all provinces, Chairman NDMA and military leadership while Punjab, Khyber Pakhtunkhwa, Gilgit Baltistan and AJK Prime Minister abstained from participating in the meeting,” he said.\nSaad Rafique asked the PTI that the country could not run with lies and deceits. The minister said he did not want to talk about politics in the current situation but everyone knew that Pakistan had bid farewell to the International Monetary Fund (IMF) but it halted because the previous government took the IMF programme and did not make reforms.\n“India and Pakistan Tehreek-e-Insaf (PTI) had tried to sabotage IMF relief programme and the recent audio leaks of Shaukat Tarin and Khyber Pakhtunkhwa Finance Minister are evident to the nation,” he added.\nSaad Rafique said that IMF programme was a temporary relief but “Our prime target is self-dependence of Pakistan for which the government is committed and reforms to be made,” he said.\nThe minister said the assistance is not sufficient and the government would have to rely on its own resources.\nHe said that Pakistan was being saved from becoming Sri Lanka, from bankruptcy, at that time India and Shaukat Tarin hatched out conspiracy against the country.The minister said that Pakistan Railway would continue its operations despite the damage of rail track for transportation of essential commodities and medicines to flood-affected areas.\nHe said that four trains were functional for supplying relief goods that would be distributed to the flood affectees with help of NDMA and PDMAs whereas one of the cargo train had reached the affected area.\nTo a query, he said that no government used to conduct telethon rather utilized its own resources to assist the flood relief activities and in case of mega disaster and insufficient resources the international community was called for help.\nThe minister urged all the political forces and provincial governments to shun politics of confrontation and help out the flood affectees with full force.\nSaad Rafique asked all the political parties to show unity and responsibility in the difficult time instead of pursuing their own vested interests.",
  "retrievedAt": "2025-08-11T15:29:53.239Z"
}
