{
  "title": "Google trained over 800 Pakistani women developers",
  "link": "https://www.app.com.pk/national/google-trained-over-800-pakistani-women-developers/",
  "date_published": "2022-08-31T15:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):More than 800 women developers across Pakistan received training through a series of Women Techmakers sessions organized by Google this year.\nThe events were held as part of celebrations for International Women’s Day (IWD), and covered important topics such as online safety, as well as coding and presentation skills, a news release on Wednesday said.\nThe theme behind IWD this year is #ProgressNotPerfection, which seeks to celebrate the progress of women in all of its forms rather than holding on to preconceived notions of perfection and failure.\nIn line with the theme, the Women Techmaker sessions by Google featured inspiring women speakers who shared stories on how they resolved roadblocks in their lives and careers, as well as networking events, which enabled women participants to connect with more people in the industry and forge new opportunities.\nFarhan S. Qureshi, Google Regional Director for Pakistan, Bangladesh and Sri Lanka said: “At Google, we actively work to recognise the achievements of women in tech, and inspire more women in Pakistan to embark on a tech career.\nThe Women Techmakers ambassadors have done an amazing job this year to organize meaningful and helpful programmes for the women developer community, and we look forward to seeing more women in tech step up to become role models for other women.”\nHira Tariq, a WTM Ambassador in Karachi, said: “Based on feedback, the Women Techmakers sessions brought a lot of positive energy to the women communities and gave many women the confidence to overcome obstacles in their own journeys.\nAligned with the theme of #ProgressNotPerfection, we have hopefully helped spread the message that it is okay for women to fail and that we should celebrate the incremental successes we make for the women community.”\nSince 2013, Google has hosted thousands of Women Techmakers events across 75+ countries in honor of IWD. The mission is to build a world where all women can thrive in tech, and through the events, we help provide visibility, community, and resources for women in tech.",
  "retrievedAt": "2025-08-11T15:29:44.397Z"
}
