{
  "title": "Pakistan’s textile industry plays crucial role in country’s economy: Sanjrani",
  "link": "https://www.app.com.pk/national/pakistans-textile-industry-plays-crucial-role-in-countrys-economy-sanjrani/",
  "date_published": "2022-08-31T17:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Senate Chairman Muhammad Sadiq Sanjrani on Wednesday said in-line with the global demands, we must continuously strive to attain a sustainable balance with our production and preservation of resources, so that we can reap maximum benefits as producers, suppliers, and buyers around the globe.\nAddressing the 5th Inspiring Change Conference 2022, he emphasized that Pakistan’s textile industry plays a crucial role in the country’s economy and accounts for a major chunk of Pakistan’s total exports.\nBesides it provides direct employment to the country’s industrial workforce which is of immense importance, he further added.\nThe chairman said Pakistan holds potential to expand its exports of textile goods.\nHe said this potential can only be realised if we conform to the latest research and technological advancements.\n“The industrialists should think out of the box, create synergies,” Sanjrani added.\nHe said being the largest manufacturing industry in Pakistan it has spread its grip globally and continues to prosper despite facing many challenges.\nOnly with creative ideas and efficient manufacturing, we can compete with an ever-evolving global industry, he emphasized.\nHe urged the textile industry to focus on and support endeavours for improving Pakistan’s cotton production by investing in high yield seeds and techniques.\nSanjrani congratulated  TEXTalks International and all the sponsors and stakeholders for making this conference a success.\nSenate Deputy Chairman Mirza Muhammad Afridi, Senator Abdul Qadir, Chairman of Senate Standing Committee on Petroleum and Natural Resources, Senator Faisal Saleem Rehman, Senator Zarqa Taimoor Suharwardhi and others also attended the event besides large number of people from the textile industry.",
  "retrievedAt": "2025-08-11T15:29:40.795Z"
}
