{
  "title": "PM directs immediate evacuation of tourists on emergency basis",
  "link": "https://www.app.com.pk/national/pm-directs-immediate-evacuation-of-tourists-on-an-emergency-basis/",
  "date_published": "2022-08-31T07:10:00.000Z",
  "source": "APP",
  "content": "KALAM, Aug 31 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday directed the relevant authorities to immediately evacuate tourists from the area who were left stranded there after the link roads were damaged by recent flash floods.\nUpon the direction of the prime minister, a helicopter arrived there to airlift the tourists on an emergency basis. The prime minister directed for expediting the operation of shifting of the people to safe areas.\nThe prime minister arrived here to review the losses and rescue, relief and rehabilitation efforts.\nThe prime minister also directed the Frontier Works Organization (FWO) to restore the damaged roads on an emergency basis.\nOn the occasion, the prime minister also met a number of people and tourists and inquired about their issues. He assured that the federal government would take all possible steps to assist them in this hour of need.\nThe prime minister said that he would be supervising all these measures.\nTalking to people, the prime minister appreciated the residents for their assistance to the affected fellows. He said the government would not leave the affected people alone in these hard times.\nThe prime minister expressed his anguish as to why construction in the course of river was allowed.\nHe said it was not a suitable time for political criticism and assured that they would sit with the provinces who were like four brothers to devise a future course of action after a joint survey was completed over the estimated losses.\nThe prime minister said that after the National Finance Commission (NFC) Award of 2010, the income resources were distributed and a large chunk was given to provinces, while among the distributed award, the remaining amount was being spent by the federal government to pay salaries of its employees, the interest for the foreign debts, and meet other necessary expenditures.\nUnder the NFC award, the provinces had got resources, he said, adding that still the federal government would provide all possible support.\nHe said an amount of Rs28 billion was allocated by the federal government which was distributed among the flood affectees.\nThe prime minister further assured that he would ask the federal minister for communication and DG FWO for immediate restoration of the damaged roads so that connectivity links could be restored in the affected areas.",
  "retrievedAt": "2025-08-11T15:30:02.344Z"
}
