{
  "title": "Hurriyat leaders, organizations pay rich tribute to Syed Ali Gilani",
  "link": "https://www.app.com.pk/national/hurriyat-leaders-organizations-pay-rich-tribute-to-syed-ali-gilani/",
  "date_published": "2022-08-31T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): In Indian illegally Occupied Jammu and Kashmir, Hurriyat leaders and organizations on Wednesday paying rich tribute to martyred veteran Hurriyat leader, Syed Ali Gilani, have reiterated the Kashmiris’ resolve to continue his mission till reached its logical conclusion.\nAccording to Kashmir Media Service, Syed Ali Gilani throughout his life championed the right to self-determination of the people of Jammu and Kashmir and advocated the settlement of the Kashmir dispute in line with the UN resolutions and the Kashmiris’ aspirations.\nIncarcerated senior leader of All Parties Hurriyat Conference, Mirwaiz Umar Farooq, in a statement issued in Srinagar said the people of IIOJK will always remember Syed Ali Gilani’s commitment, dedication and contribution in the ongoing struggle for Kashmiris’ right to self-determination.\nGilani sahib dedicated his whole life for the Kashmiri people and their right to self-determination, he said.\nThe Mirwaiz said the people of IIOJK will carry on their freedom struggle despite Indian state terrorism. India has turned IIOJK into a huge prison where every right of the people has been usurped, he said, adding that the international community must help the Kashmiris in this situation.\nJammu and Kashmir Democratic Freedom Party, headed by illegally detained Shabbir Ahmad Shah, in a statement in Srinagar said Syed Ali Gilani’s peerless contribution and indomitable role in the Kashmiris’ ongoing struggle for right to self-determination will always be remembered.\nIt said unwavering and untiring services of the veteran leader for the Kashmir cause will be remembered for a long time in the annals of Kashmir history.\nIt said, Syed Ali Gilani was a fearless leader who took an uncompromising stance on the Kashmir dispute and became a voice for the voiceless Kashmiris and he never compromised on his cherished ideals.\nThe DFP maintained that jails, house arrest and torture could not deter the veteran leader from pursing the collective cause of freedom for which Kashmiris have rendered matchless sacrifices.\nIt added that the Kashmiri people will continue the mission of Syed Ali Gilani and other martyrs till they achieve their goal of freedom from Indian illegal occupation.\nThe DFP reaffirmed its support to APHC’s call for the march towards Hyderpora in Srinagar, tomorrow. It urged the people of IIOJK to assemble in huge numbers at Syed Ali Gilani’s grave at Hyderpora to pay their homage to the deceased leader who devoted his entire life for the Kashmir cause.\nMeanwhile, APHC-AJK chapter leaders, Mushtaq Ahmad, Syed Manzoor Ahmad Shah, Syed AIjaz Rehmani and Raja Khadim Hussain Shaheen in their statements issued in Islamabad said that Syed Ali Gilani was a figure of greatness and courage and a symbol of steadfastness against oppression and tyranny. They said Syed Ali Gilani is not the name of a person but an ideology, a movement.\nThey maintained that the veteran leader’s struggle, courage and sacrifices will continue to inspire the oppressed and weak nations of the world whose freedom has been taken away by big countries. They added that Syed Ali Gilani’s mission and ideals are alive and will remain alive and he will be remembered as a great leader of the past and present century.\nThe APHC-AJK leaders also urged the international community and world human rights organizations to force India to stop its state terrorism in IIOJK and to give the Kashmiris their right to self-determination.",
  "retrievedAt": "2025-08-11T15:29:38.937Z"
}
