{
  "title": "President for preserving precious rainwater, fortification against floods",
  "link": "https://www.app.com.pk/national/president-for-preserving-precious-rainwater-fortification-against-floods/",
  "date_published": "2022-06-17T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP):President Arif Alvi Friday called upon the federal and provincial governments to take all necessary measures to preserve the precious sweet water brought by mother nature by the monsoon weather system.\nHe said that monsoon helped augment growth of food and increased the production of cheap hydroelectricity ensuring economic growth. He stressed that all precautionary measures should be taken to prevent flood-like situations in the country to save lives and property.\nThe President said that the monsoon rain system would soon mark the beginning of the cultivation of rain-fed Kharif crops and will determine the yield of rice, wheat, sugarcane, oilseeds, pulses, fruits and vegetables, and the quality and quantity of dairy products.\nThe President said that the quantity of monsoon rain harnessed and preserved by the country will determine the quality and quantity of our agricultural production, will provide freshwater to fill aquifers and wells, refill the dams and replenish the underground water reservoirs.\nThe President warned that “we must conserve water and if we failed to harness this precious resource brought free of cost by Almighty Allah to us, we will grow less food; agribusinesses will not produce enough to sell; governments will have to import expensive food; electricity will become more expensive, and will limit the development of large businesses”.\nThe President called upon the federal and provincial authorities to take necessary precautionary measures beforehand to prevent flood-like situation, mudslides, and possible water outbursts, especially in rural and hilly areas to save precious lives and properties.\nHe said Pakistan needed to work on both structural and non-structural measures for flood protection which might include raising the storage capacity of  dams, supplementing capability of early flood forecasting and flood warning, restoration of existing wetlands and proper planning of urban development.\nThe President said, “We should also increase our preparedness and relief services by ensuring flawless coordination amongst different provincial and federal departments involved in water management and flood protection to save possible loss of lives, properties and livelihood. Besides our country men must recognize the preciousness of water and everyone must conserve this resource,” he said.",
  "retrievedAt": "2025-08-11T15:05:55.839Z"
}
