{
  "title": "New UNICEF’s Representative in Pakistan Abdullah A. Fadil presents credentials",
  "link": "https://www.app.com.pk/national/new-unicefs-representative-in-pakistan-abdullah-a-fadil-presents-credentials/",
  "date_published": "2022-06-17T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 17 (APP): Abdullah A. Fadil, the new Representative of the United Nations Children’s Fund (UNICEF) in Pakistan has presented his credentials to Ambassador Asim Iftikhar Ahmad, Additional Secretary (United Nations) at the Ministry of Foreign Affairs.\nAccording to a press release issued by UNICEF, Fadil has recently arrived in the country, where he will be leading the new multi-sectoral UNICEF Country Programme of Cooperation (2023-2027) in partnership with the Government, in support of the National Development Plan.\nAmbassador Asim Iftikhar Ahmad appreciated UNICEF’s continued support for Pakistan’s national development priorities and its partnership with the government in pursuance of UNICEF’s mandate for children.\nUNICEF works to help every girl and boy realize their right to health, including immunization, nutrition, education, child protection, water, sanitation and hygiene, and social protection – with a focus on children and adolescents living in the most deprived families and hardest-to-reach communities.\nCommending Pakistan’s efforts to improve indicators for children, Abdullah A. Fadil assured the government about UNICEF’s commitment to continue supporting federal and provincial authorities in view of achieving the best results for every child.\nFadil brings with him over 25 years of experience in international development and humanitarian relief, strategic management, peace-making and peacebuilding, public policy and administration, and advocacy work in Africa, Europe, and the Middle East.\nPrior to this assignment, Fadil served as UNICEF’s Representative in Sudan from 2016 to 2021.\nHe also served as the Director of the United Nations Humanitarian Monitoring Mechanism for Syria, where he worked on the delivery of humanitarian assistance to Syrians from Jordan, Turkey, and Iraq (2014-2016).\nBetween 2013 to 2014, he was the Deputy Head of Mission and Chief of Staff of the Organization for the Prohibition of Chemical Weapons (POCW), as part of the UN joint mission in Syria on the elimination of Syrian chemical weapons.\nFadil also served with the United Nations Truce Supervision Organization (UNTSO) in the Middle East, the UN Mission in Sudan (UNMIS), the International Civil Aviation Organization (ICAO), the United Nations African Union Mission in Darfur (UNAMID), the Department of Peacekeeping Operations (DPKO) in New York, the United Nations Interim Administration Mission in Kosovo, the Organization for Security and Cooperation in Europe (OSCE) and McGill University in Canada.\nFadil holds two Master of Science degrees one in Public Policy and Management from the School of Oriental and African Studies (SOAS), and one in Industrial Relations and Personnel Management from the London School of Economics (LSE).",
  "retrievedAt": "2025-08-11T15:05:58.177Z"
}
