{
  "title": "AJK PM emphasizes simplification of tax system to make it business friendly",
  "link": "https://www.app.com.pk/national/ajk-pm-emphasizes-simplification-of-tax-system-to-make-it-business-friendly/",
  "date_published": "2022-06-17T17:28:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Jun 17 (APP): Azad Jammu and Kashmir Prime Minister Sardar Tanveer Ilyas Khan emphasised the need for removing existing complexities in the region’s tax system to make it easier and business friendly.\nThe AJK PM made these remarks while addressing a high-level meeting of the Central Board of Revenue in the federal metropolis on Friday.\nThe meeting was attended by Minister for Finance and Inland Revenue Abdul Majeed Khan, Chairman Central Board of Revenue Faheem Ahmad Khan, Secretary Services and General Administration Raja Amjad Pervez Ali Khan, Principal Secretary Syed Shahid Mohi-ud-Din Qadri, Commissioner Inland Revenue Department AJK (Head of the Department), besides other CBR and IRD officials and others.\nSpeaking on the occasion, the AJK PM said that restoring the Inland Revenue Department to its original condition was the government’s first priority.\nReferring to complexities in the region’s (AJK) tax system, he said that there was dire need to remove all the complexities and cumbersome procedures in the existing system so that businessmen and investors could have no problems.\nThe AJK PM stated that the CBR should encourage local industrialists, encourage taxpayers by making the tax collection system people friendly and transparent.\n“Make people realize that our state is all that matters the most. You may disagree with the government but when it comes to the state, we are one and every single citizen of the state is bound to play a responsible role for its welfare,” the AJK PM said.\nThe AJK PM directed the officials of the Inland Revenue Department to compile a list of the top 100 prominent tax payers of Azad Kashmir in a bid to appreciate their efforts.\n“Hire a well reputable tax consultant to rectify the existing Revenue Act and make the existing Act valid and competent,” he said, adding that all possible measures would be taken to make the CBR a better institution and whatever legal loopholes exist in the CBR Act would also be removed.\nCBR was working under the Government of Azad Kashmir from 1948 to 1979, however, during the tenure of late General Hyat Khan in 1980 the department was brought under the control of Kashmir Council.\nThe AJK PM was informed that under the 13th Amendment, the government regained its authority over the CBR.\nIt was stated that the CBR was currently operating under the CBR Act 2020, which has some loopholes that need to be addressed.\nHighlighting the CBR’s performance, the officials present in the briefing informed the PM that after 13th amendment the CBR had earned more revenue than its target in tax collection.\nIn the year 2020-21, the CBR had collected taxes worth 29 billion rupees against the revenue target of Rs 28 billion rupees.\nThe target for tax collection in the current financial year is 31 billion rupees, which will be completed by the end of the year. Till now the CBR has collected about 30 billion rupees in terms of tax collection.",
  "retrievedAt": "2025-08-11T15:05:55.597Z"
}
