{
  "title": "Pakistan team bag SAAF Cross Country Championships title",
  "author": null,
  "content": "ISLAMABAD, Feb 23 (APP):Pakistan team bagged the SAAF Cross Country Championships 2025, title here at the Fatima Jinnah Park (F-9) on Sunday.\nPakistan won both first position trophies in senior 10km and junior 8km competitions in the cross country athletics championship. The Sri Lankan team bagged the second position while Bangladesh and Maldives grabbed the third and fourth positions, respectively.\nGen. (R) Ehsan ul Haq was the chief guest on the occasion while Maj. Gen. (R) Mohammad Akram Sahi, Chairman SAAF, Brig. (R) Sultan Mehmood Satti, Chairman Islamabad Athletics Association (IAA), Brig. (R) Wajahat Hussain, President Athletics Federation of Pakistan (AFP) and Col. (R) Shahjehan Mir, Secretary General were also present.\nMeanwhile Ambassadors of Nepal, Sri Lanka and other senior diplomats from Maldives and Sri Lanka came to watch and encourage their teams in action.\nThe event was held under the auspices of Athletics Federation of Pakistan (AFP). This is the first time in 77 years that SAAF Cross Country was held in Pakistan. Last SAAF Games were held in Islamabad in 2004.\nAll member countries (Bangladesh, Bhutan, India, Maldives, Nepal, Pakistan and Sri Lanka) of SAAF showed interest to participate in the mega event but at the last moment due to unavoidable circumstances, Indian and Bhutan Teams could not make it.\nMeanwhile, the member countries which featured in the championship included Bangladesh, Maldives, Nepal, Pakistan and Sri Lanka.\nThe competitions were held in two categories including Men10km and Men under 20 years 8km. A track of 2km was made, for Category – 1(5 Laps) Category -2 (4 Laps).\nFor holding this event the credit also goes to Ministry of Inter Provincial Coordination (lPC), Pakistan Sports Board (PSB) and AFP.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:01:41.740Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-team-bag-saaf-cross-country-championships-title/",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T15:09:00.000Z"
}
