{
  "title": "Health experts advise parents to monitor children’s mobile screen time to ensure healthy balance in their lives",
  "author": null,
  "content": "ISLAMABAD, Feb 23 (APP):The excessive use of mobile phones among children has become a pressing concern for parents, educators, and health experts.\nWith the widespread availability of smartphones and tablets, kids were spending increasing amounts of time glued to their screens, sparking fears about the impact on their physical and mental health.\nAccording to this APP Scribe, many parents reported that their children were spending hours each day playing games, watching videos, and chatting with friends on their mobile devices adding that this excessive screen time was leading to a range of problems, including sleep deprivation, eye strain, and decreased attention span, they complained.\nA mother of 10-year-old Sabrena expressed her deep concern about her child’s phone addiction saying, “I have noticed a significant change in my child’s behaviour since they started using a smartphone and they are constantly glued to the screen, and it’s affecting their mood, their grades, and their overall health”.\nShe said that children have become inseparable from their devices adding that they can’t seem to put it down, even during meals or family time.\n“She feels like I have lost control over my child’s phone use which is affecting my child’s grades and they are not focusing on their schoolwork like they should be, they are constantly on it, and I don’t know how to limit their screen time, she stated.\nHealth experts warned that excessive mobile phone use could have serious long-term consequences for children, including increased risk of obesity, decreased physical activity, and impaired cognitive development.\nA paediatrician Saira Jabeen said “Children need a balanced diet of physical activity, social interaction, and mental stimulation to develop properly adding that excessive mobile phone use can disrupt this balance and have serious consequences for their health and wellbeing.\nShe advised limiting screen time to 1-2 hours daily can ensure a healthy balance adding that encourages kids to engage in outdoor games and sports to promote physical activity and teamwork.\nShe recommended monitoring children’s mobile phone use to set responsible boundaries and limits, while also encouraging social interaction to foster essential communication skills and emotional intelligence.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:02:36.407Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/health-experts-advise-parents-to-monitor-childrens-mobile-screen-time-to-ensure-healthy-balance-in-their-lives/",
  "dateList": "2025-02-23",
  "date_published": "2025-02-23T07:08:00.000Z"
}
