{
  "title": "Certified cotton seed to be provided to farmers: Minister",
  "link": "https://www.app.com.pk/national/certified-cotton-seed-to-be-provided-to-farmers-minister/",
  "date_published": "2021-04-11T12:37:00.000Z",
  "source": "APP",
  "content": "MULTAN, Apr 11 (APP):Federal Minister for National Food Security and Research, Syed Fakhar Imam said on Sunday that efforts were being made to provide certified cotton seed to farmers in order to increase the cotton production.\nHolding a joint press conference with Punjab Minister for Agriculture Syed Hussain Jahania Gardezi, Syed Fakhar Imam said that government was committed to facilitate farmers and said that issues of the farmers would be resolved on top priority.\nHe claimed that targets of agriculture crops have been achieved despite locust attacks, however, concerned departments facing problems in achieving target of cotton crop.\nHe said that the incumbent government has increased wheat support price to Rs 1800 per 40kg under the initiative to facilitate farmers. He said that steps were being taken to provide latest technology to farmers in order to decrease their expenses and increase their income. He said that the South Punjab had been neglected in the past by the previous governments in distribution of funds but the incumbent government paying special focus on development of the deprived area.\nSpeaking on the occasion, Punjab Minister for Agriculture Syed Hussain Jahania Gardezi said that farmers playing a vital in identifying agriculture related issues.\nHe said that suggestion of farmers would also be considered in policy making. He said that the incumbent government paying special focus on agriculture sector as it had been neglected in the past.\nThe minister said that work continued on different projects with funds of Rs 300 billion under Prime Minister’s Agriculture Emergency Porgram.\nHe said that farmers have been given subsidy of over Rs 470 million on latest machinery adding that 50 percent subsidy was being given to farmers on drip irrigation system and 60 percent was being offered on solar system. He said that the Punjab Seed Council have approved 147 new seed varieties of different crops.\nGardezi maintained that fake pesticides and fertilizers have been captured while 900 cases have been registered against the 1,000 outlaws involved in this business and 20 factories have been sealed for manufacturing fake pesticides and fertilizers.\nHe said that 78,000 acre barren land has been made able for cultivation during the last two years across the province.",
  "retrievedAt": "2025-08-11T20:37:02.764Z"
}
