{
  "title": "Anti Covid-19 SOPs implementation to be ensured in Mosques during Ramazan: Ashrafi",
  "link": "https://www.app.com.pk/national/anti-covid-19-sops-implementation-to-be-ensured-in-mosques-during-ramazan-ashrafi/",
  "date_published": "2021-04-11T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 11 (APP): The standard operating procedures (SOPs) against coronavirus would be implemented in letter and spirit in mosques in the holy month of Ramazan-ul-Mubarak aiming to curb the spread of pandemic.\nSpecial Aide to Prime Minister on Religious Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi announced on Sunday while talking to media.\nHe said mosques would not be closed during the month of Ramazan and urged scholars and leaders of all schools of thought and sects to take precautionary measures during the month of Ramadan in mosques and adhere following 20 point guidelines agreed between the government and ulema to keep Coronavirus at bay.\nThe third wave of Coronavirus was extremely dangerous and everyone should ensure safety of others by seeking forgiveness to Allah and following preventive measures.\nAshrafi said that the registration of any madrassa or mosque was not being canceled.\nThe process of consultation with the Ulema-Mashaykh was underway regarding the Waqf Property Act.\nRegistration of seminaries has started with the Ministry of Education, and if the head of a madrassa or mosque has a complaint against any official for registration process, he can contact the office of Hafiz Muhammad Tahir Mehmood Ashrafi.\nReplying to a question, Ashrafi said that the government would gift the nation celebrating one-Eid and starting same day Ramadan adding that the meeting of Ruet-e-Hilal Committee had been summoned in Peshawar to resolve differences on crescent sighting.\nThe sole purpose of convening crescent sighting body meeting was to end the differences over the start of Ramazan.\nTo another question, he appealed traders to reduce the margin of profit in honor of Ramazan and benefit the nation against hoarding and inflation.",
  "retrievedAt": "2025-08-11T20:36:59.267Z"
}
