{
  "title": "Corruption engulfs whole system into socio economic turmoil: NAB Chairman",
  "link": "https://www.app.com.pk/national/corruption-engulfs-whole-system-into-socio-economic-turmoil-nab-chairman/",
  "date_published": "2021-04-11T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 11 (APP):National Accountability Bureau (NAB) Chairman Justice (Retd) Javed Iqbal, said that the corruption is a technique adopted just to bypass the rule of law and engulf the whole system into socio economic turmoil.\nIn a statement, he said corruption, being the root cause of almost all ills, gives birth to multifarious problems including nepotism, favoritism and negating meritocracy, transparency and accountability, he said in a statement.\nThe Chairman NAB said that due to the initiatives taken by the present management of NAB, eradication of corruption has become the voice of the whole nation. Transparency International Pakistan has also appreciated NAB’s performance whereas the survey conducted by Gillani and Gallop, 59 percent people have shown trust upon NAB.\nHe said that NAB has a mandate to carry out Awareness activities functions against corruption in pursuance of Section 33C of National Accountability Ordinance (NAO). Under NAB’s Awareness and Prevention campaign across the country, NAB has been engaging different Governmental, Non-Governmental Organizations, media, Civil Society and other segments of society in order to aware people at large. During 2020, NAB’s Awareness campaign was effectively highlighted by the Media Wing of NAB in print and electronic media free of cost without spending any Budget of NAB on media campaign.\nChairman NAB, said that all ATM machines of scheduled Banks carry NAB’s message “Say No to Corruption” across the country in order to aware people about the ill effects of corruption.\nNAB and Higher Education Commission (HEC) have signed a Memorandum of Understanding (MoU) for creating awareness amongst the students of various Universities and Colleges. Due to this collaboration, over 50, thousands Character Building Societies have been established in various Universities and Colleges across the country so that students may be aware about the ill effects of corruption at an early age.\nNAB and SNGPL, IESCO, LESCO, GEPCO, FESCO and K-Electric join hands to print NAB messages in order to disseminate awareness about the ill effects of corruption.\nIESCO and other organizations have started printing NAB messages on electricity bills and Gas bills.\nNAB in Collaboration with PTA has disseminated NAB message “Say No to Corruption to all mobile phone subscribers across the country through different mobile phone companies at the eve of International Anti-Corruption Day in order to aware people belonging to all segments of society about the ill effects of corruption.\nNAB in Collaboration with the Federal Film Censor Board continuously aired NAB’s video message on “Say No to Corruption in all Cinema Houses of the country. NAB’s initiative has been appreciated by the public at large but due to COVID-19, all cinemas are closed.\nNAB message “Say No to Corruption” is being printed on all government tenders issued for publication in newspapers in Balochistan and Gilgit Baltistan.\nJustice Javed Iqbal has said that NAB strongly believes in Zero Tolerance Policy against Corruption. NAB’s Anti-corruption campaign is carried widely for awareness and prevention of corruption besides enforcement across the board during 2020.\nThe excellent feedback received about NAB’s effective and proactive Awareness and prevention campaign, NAB has decided to continue its nation-wide Awareness and Prevention campaign free of cost as during 2021 in order to aware people about the ill effects of corruption.\nHe said that NAB hopes that joint efforts of all stakeholders can collaborate to check corruption and corrupt practices before happening with the help of all stakeholders, civil society, media and people at large.",
  "retrievedAt": "2025-08-11T20:36:58.951Z"
}
