{
  "title": "Ravi City, Bundle Islands projects very important in view of rising demand in housing sector: PM",
  "link": "https://www.app.com.pk/national/ravi-city-bundle-islands-projects-very-important-in-view-of-rising-demand-in-housing-sector-pm/",
  "date_published": "2020-12-03T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):Prime Minister Imran Khan on Thursday said that in the wake of rising demand in the country’s housing sector, the two mega development projects including Ravi City, Lahore and Bundle Islands, Karachi were very important.\nHe expressed these views while presiding over a meeting here regarding Pakistan Islands Development Authority (PIDA) and Ravi Riverfront Urban Development Authority (RUDA).\nMinister for Information and Broadcasting Senator Shibli Faraz, Minister for Maritime Affairs Syed Ali Haider Zaidi, Special Assistants to PM Dr Shehbaz Gill, Syed Zulfiqar Abbas Bukhari, Governor Sindh Imran Ismail, Chairman Naya Pakistan Housing Authority, Chairman Ravi Riverfront Urban Development Authority and Chairman Pakistan Islands Development Authority besides senior officials attended the meeting.\nThe prime minister stressed on the need of highlighting positive aspects of the projects through an awareness campaign.\nHe said people should be informed that how the two projects would help address various economic and environmental issues besides, creating employment opportunities and reducing pollution.\nThe prime minister said that they also have to ensure the maximum participation of Overseas Pakistanis in the two projects.\nHe further directed that time-lines should be stipulated for the completion of various phases of the projects and their implementation ensured.\nThe meeting was informed about the progress made so far in the two projects. It was told that Frontier Works Organization (FWO) and National Logistics Cell (NLC) have started work in Ravi Riverfront Urban Development Authority with clearly defined timelines for the completion of various phases of the project.\nThe meeting was also informed about the partnership process with Chinese companies.",
  "retrievedAt": "2025-08-11T20:05:40.511Z"
}
