{
  "title": "Dossier highlighting Indian state-sponsored terrorism being discussed by world: DG ISPR",
  "link": "https://www.app.com.pk/national/dossier-highlighting-indian-state-sponsored-terrorism-being-discussed-by-world-dg-ispr/",
  "date_published": "2020-12-03T15:18:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 03 (APP):Director General of Inter Services Public Relations (ISPR) Major General Babar Iftikhar on Thursday said the dossier presented by Pakistan would be flagged at all global fora to highlight Indian state-sponsored terrorism on its territory.\nThe dossier brought forward the proofs of India as a state sponsoring terrorism, vindicating what Pakistan had been saying for long, he said in an interview with Global Village Space (GVS) – an international media outlet.\nDuring the interview, the ISPR DG dilated upon diverse security and defence related issues linked with regional peace and stability, including the China Pakistan Economic Corridor (CPEC), Afghan Peace Process and the situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nMajor Genl Babar said the matter started with the revocation of Article 370 of Indian Constitution (in August, 2019) stripping the IIOJK of its special status to IIOJK. “Ever since then India has been facing negative press.”\nHe said the world had taken note of the dossier and started discussing it. “Despite a lot of Indian efforts, an objective analysis of the dossier has been started by the global community” and that objectivity was a major plus, he added.\nThe Foreign Office, he said, had presented the dossier to the permanent members of the United Nations Security Council (P-5 countries), the UN Secretary General.\nThe latest statement of Organisation of Islamic Cooperation (OIC) (at the session of its Council of Foreign Ministers held in Niger), he said, had endorsed it where Foreign Minister Shah Mahmood Qureshi interacted with his counterparts from its member countries.\n“It has been a strong worded statement of the OIC on what is happening in the IIOJK,” he added.\nThe ISPR DG vowed:”Here on, we are going to take it to every possible forum and it’s not one of the things rather there has been series of actions made in the aftermath.”\nTo a question, he said India perceived CPEC as a game changer for the region as it would provide connectivity to the entire region.\n“[In this scenario], Pakistan became a connectivity hub after the inception of this project. This project has the ability and potential to bring prosperity to the whole region and its not only a mere North West thing.”\nHe said CPEC was an economic initiative which was visible from its name. However, Indians were uncomfortable and had very strange arguments about the project, he added.\nMajor Gen Babar underscored that security issues around the CPEC project were increasing. “Indians have decided that there are such timelines after which CPEC becomes irreversible so it should be retarded before that time limit. They don’t want to let the project become successful.”\nHe said the Pakistan Army had raised two divisions for the project’s security whereas eight to nine regular regiments were maintained for the protection of the routes of entire corridor. Paramilitary forces were also the part of the security apparatus for the CPEC routes, he added.\n“We are taking every possible measure to secure CPEC where our Chinese counterparts have expressed their satisfaction on the security measures.”\nHe said the Indians were trying to tarnish Pakistan’s international image to harm CPEC. The Indian sponsored terrorists were targeting the Chinese manpower and local labour working on the project.\n“There are a lot of dimensions to the security of this project (CPEC). Alhamdulilah (By the grace of Almighty Allah) we have taken all-out measures.”\nAs regards terrorist attacks from across the Afghan border on its soil, the ISPR DG said, Pakistan was in regular contact with the Afghan government over the matter. Pakistan realized that the Afghan government had capacity issues and never blamed them for the terrorism from across the border.\nMajor Gen Babar, while shedding light on the Indian designs in the IIOJK and along the Line of Control (LoC), said India wanted to externalise what was going inside the country. It had had been continuously trying to tag indigenous freedom struggle of the people of IIOJK to terrorism.\n“What kind of measures they are taking in IIOJK, increase in the intensity and lethality of ceasefire violations from 2014 to 2019 have increased manifolds. At the time, there are maximum ceasefire violations and deaths in Azad Jammu and Kashmir (AJK).”\nThe ISPR DG said India was linking the Kashmir freedom movement with terrorism and blaming Pakistan for the so-called infiltration into IIOJK. However, the UN military observer missions, deputed both in India and Pakistan, and the global missions taken to the LoC (by Pakistan) to show the deployment and security grids developed by India, ruled out any such possibility.\nHe said the IIOJK was the most militarized region in the world with with 900,000 Indian troops deployed, equal to the size of Pakistan Army. “Infiltration in such strict security arrangements is not possible; however, Indians are trying to divert global attention to Pakistan as on what is happening in IIOJK is mainly due to penetration of terrorists.”\nHe said a group of ambassadors was taken to the LoC, who saw the damages inflicted by the Indian Army troops at the civilian population (in AJK). The place about which the Indian military leadership was making a noise that around 150-200 terrorists were ready to permeate into the IIOJK, was also shown to the ambassadors of various countries.\nMajor Gen Babar said: “Either they [Indian Army Troops] fire on us or we fire back on them it is the Kashmiris who will suffer. It is a regular Indian pattern that we see they employ to externalise their internal issues.”\nHe added that the Indians were in the state of denial whereas Pakistan on the other side, when the new government came into power, extended its full support for peace.\nHe termed the misinformation and propaganda news proliferating on social media a major challenge.\n“In order to cope with this, the best thing is to ensure transparency. We have investigated the social media accounts, perpetrating and sharing propaganda news and negative content, are being operated from India.”\nTo a query on Fifth Generation Warfare, the ISPR DG explained that it employed all tools of national power and focus on two main spheres, which in Pakistan’s case were economy and information domains.\nHe said anything related to the Pakistan Army was erroneously shared and propagated to endorse the malicious propaganda of enemy countries.\nHe regretted that a trivial news item was reported by the international media that was actually perpetrated from India. He was referring to the social media top trend civil war in Karachi that stormed Twitter resulting in news items reported by the global media.\nHe noted that 90 percent of negative press was generated from Indian websites. (In the prevailing misinformation spree) the Indian media had lost its credibility to a larger extent by propagating fabricated and concocted news.\nIndia, he said, was targeting Pakistan in diplomatic, economic, military, information and law domains. They were also lobbing before Pakistan’s appearance in the Financial Action Task Force (FATF) plenaries.\n“India is targeting Pakistan from different directions to target the trajectory Pakistan is having for the future,” he added.\nThe ISPR DG said the threat perception in Pakistan’s was very clear that India was equipping itself with advance technological gadgets as all the defence treaties (with other countries) were offering those facilities.\nThe defence spending disparity between Pakistan and India, he said, was 1:9. The world must realise that any imbalance of power in South Asia would impact the region and the entire world.\nRegarding the western border fencing project, Major Gen Babar said: “Our aim has been to ensure better management of this project. The fencing has been carried out in one of the most difficult terrains of the area as it has been a very porous border.”\nAbout 83 percent of Pak-Afghan border was being fenced and would be completed by the end of this month, he added.\n“Pakistan has also initiated border fencing in Pak-Iran border area of its western borders whereas 30 percent of the fence has been carried out and will be completed by December 2021,” he said.\nHe explained that some areas were snow clad in the bordering region, where posts would be manned in a different way. A complete management of the western borders would be ensured, which would help control smuggling and other crimes and would have major dividends for the country.\nThe ISPR DG said two world class border terminals, among five to improve border management and trade, would be established at Torkham and Chaman border terminals.\nThe western border, he said, would be completely fenced to contain terrorist activities from across the border and border crimes.\nTo a query about the impact of fencing along the western border, he said the number of terrorist incidents had decreased massively.\nHe said India was making massive efforts create disturbance inside Pakistan, with targeting mainly border areas. The Border Management Initiative showed its significance for new military-civil leadership. Prime Minister Imran Khan announced a new border management force, which would be raised under the Ministry of Interior and would centrally manage the national borders from all routes of land and water.\nTo a question, he said: “Pakistan’s role in the Afghan Peace process is of a facilitator and has done what it can in the best of her capacities.”\nIt was optimistic on the future course of the peace process as it believed that only Afghans had the right to decide what would happen next in the peace negotiations, he added.\n“All the parties, including Afghan and US governments had acknowledged Pakistan’s role in the Afghan Peace Process and said Pakistan played the most positive role in bringing the Afghans, including the Taliban and Afghan government, to the table to hold talks.”\nThe ISPR DG also explained the military diplomacy doctrine followed by the current army leadership. “Chief of Army Staff (COAS) General Qamar Javed Bajwa’s vision about military diplomacy is that we need peace within and around us, which has been received very positively.”\nPakistan’s military leadership, he said, had reached all the military leaderships in the region and around. “Our military engagements with China, Gulf region, US and Russia and it’s all we have gone to explore new venues and taking Pakistan’s international image to a new level.”\nThe outreach, whether it was for military training, strategic venues and others, was giving many dividends to Pakistan, he added.\nHe also shed light on Pakistan’s successful fight against COVID-19 and unprecedented civil-military collaboration to effectively cope with the pandemic. “The Pakistan Army right from the day one has been part and parcel of every effort made by the government and people of Pakistan to deal with the contagion.”\nThe National Command and Operation Center (NCOC), he said, was manned by both the military and civil officials where the idea was to form a better strategy for amicably dealing with the disease.\nHe said the Information Technology (IT) needs of the NCOC were fulfilled by the Pakistan Army. “Be it information, IT and administration or enforcement, the Pakistan Army has been the thick and thin of everything involved.”\nHe said the first wave of COVID-19 provided a chance for capacity building of the deficient departments. “We should (now) manage the second wave of the wave in a better way.”\nThe ISPR DG also lauded the role of media in educating and exhorting the masses to check the spread of coronavirus.\nBeing the information arm of the NCOC, he said, ISPR had run many media campaigns worth billions of rupees free of cost to educate, encourage and advise the masses to ensure adherence to safety guidelines.\n“We have to help each other and remain more careful than before to fight this pandemic.”",
  "retrievedAt": "2025-08-11T20:05:38.967Z"
}
