{
  "title": "FM thanks OIC Envoys for strong support during 47th CFM Session in Niamey",
  "link": "https://www.app.com.pk/national/fm-thanks-oic-envoys-for-strong-support-during-47th-cfm-session-in-niamey/",
  "date_published": "2020-12-03T17:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 3 (APP):Foreign Minister Shah Mahmood Qureshi on Thursday met the Organization of Islamic Cooperation (OIC) Envoys based in Islamabad to thank them for OIC’s strong and unequivocal support during the 47th Council of Foreign Ministers (CFM) Session in Niamey.\nHe underlined that the unanimous adoption of a strong and comprehensive Resolution on the Jammu & Kashmir dispute, explicit reiteration of the OIC’s principled position in the Niamey Declaration, and presentation of the Report on the visit of the Secretary General’s Special Envoy for Jammu and Kashmir to Pakistan and AJK reaffirmed the centrality of the Jammu & Kashmir dispute for OIC and Muslim Ummah.\nThe Foreign Minister also thanked the OIC countries for their support in adoption of other resolutions of importance to Pakistan, including:\nSafeguarding the Rights of Muslim Minorities in non-OIC States and Destruction of Babri Masjid and Protection of Islamic Holy Places.\nHe also expressed gratitude for the adoption of the Pakistan-sponsored Resolution on combating Islamophobia.\nThe Foreign Minister added that Pakistan looked forward to hosting the 48th Session of CFM in 2021.\nHe underscored that as prospective CFM Chair and member of the Executive Committee, Pakistan will constructively engage with the entire OIC membership to promote unity, peace and prosperity among the Muslim Ummah.\nPresident AJK Sardar Masood Khan thanked the OIC for its consistent support for the Kashmir cause and solidarity in the wake of the grave situation in Indian Illegally Occupied Jammu and Kashmir.\nThe OIC is the second-largest inter-governmental organization after the United Nations with 57 members and five observer states, spanning over four continents.\nIt also represents the collective voice of Muslim Ummah. Pakistan is a founding member of the OIC.",
  "retrievedAt": "2025-08-11T20:05:36.279Z"
}
