{
  "title": "Opposition showing irresponsible attitude to protect looted money: Gill",
  "link": "https://www.app.com.pk/national/opposition-showing-irresponsible-attitude-to-protect-looted-money-gill/",
  "date_published": "2020-10-30T12:52:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 30 (APP):Special Assistant to Prime Minister on Political Communication Shahbaz Gill said on Friday that Prime Minister Imran Khan had always given a befitting reply to anti Islam forces to foil their nefarious designs.\nHe said this while addressing the press conference at the Press Information department here.\nHe said:” Prime Minister Imran Khan can offer all kinds of sacrifice for sanctity, dignity and honour of our beloved Holy Prophet Hazrat Muhammad (Peace Be Upon Him), adding that PM Imran Khan had written letters to leaders of different countries across the globe to play their role for curbing Islamophobia.\nKeeping in view the ideology of Riasat-e-Madina, Panagahs (shelter homes) were established across the country to mitigate sufferings of needy people, he maintained.\nHe said it was the responsibility of the government to make decisions not the opposition.\nOn matters of national integrity, the opposition, media and people from different walks of life were taken into confidence, he said, adding that the opposition was informed about the wisdom behind the decision regarding Abhinandan.\nHe said: “We believe in Geneva Convention it is very much there but prior to it we believe in the laws of Riasat-e-Madina.”\nShahbaz Gill said laws of Riasat-e-Madina clearly had defined how to treat prisoner of war that was why when Abhinandan went back to India, he accepted that he was treated very well by the Pakistan Army.\nAbout Ayaz Sadiq statement, Gill said his statement was not true at all. When India attacked Pakistan violating international laws, Indian aircrafts dropped payload somewhere in forest and returned.\nOn the very next day, two Indian air jets were shot down by the Pakistan Air Force, he added.\nHe said the PML-N’s leadership narrative was to protect their looted money and to create\ndivision in the national institutions.\nHe said the Pakistan Armed Forces had always rendered unprecedented sacrifices for integrity of the country and would continue the same in future as well.\nThe opposition should do politics on governance but not show irresponsible attitude towards national interest, Shahbaz Gill said.\nHe said: ” The PML-N leaders wanted to halt the process of accountability and\nto achieve their personal motives,” adding that the opposition should do politics rather attacking on the integrity of the country.\nHe said that PML-N, B and C category leadership should protect themselves from the anti state narrative of the PML-N leadership.\nHe said the opposition should utilize freedom of expression to that extent where it did not harm integrity of the country.\nTo a question, he said: “We don’t stop any one from holding public gatherings but now Pakistan has to form a code of conduct in this regard.”",
  "retrievedAt": "2025-08-11T19:57:30.626Z"
}
