{
  "title": "UNAOC High Rep calls for mutual respect of religions",
  "link": "https://www.app.com.pk/national/unaoc-high-rep-calls-for-mutual-respect-of-religions/",
  "date_published": "2020-10-30T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP):Spokesperson High Representative for the United Nations Alliance of Civilizations (UNAOC), has expressed deep concern over the growing tensions and instances of intolerance triggered by the publication of the satirical caricatures depicting Prophet Muhammed.\nThe High Representative in a ‘Call for mutual respect’ issued from New York stressed that insulting religions and sacred religious symbols provoked hatred and violent extremism leading to polarization and fragmentation of the society, said a foreign office statement.\nHe said inflammatory caricatures had also provoked acts of violence against innocent civilians who were attacked for their sheer religion, belief or ethnicity.\nHe called for mutual respect of all religions and beliefs and for fostering a culture\nof fraternity and peace.\nThe High Representative stressed that the freedom of religion or belief and the freedom of expression are interdependent, interrelated and mutually re-enforcing rights rooted in the Articles 18 and 19 of the Universal Declaration of Human Rights.\nUpholding and protecting these fundamental rights is the primary responsibility\nof member states, he added.\n“At the same time, freedom of expression should be exercised in a way that fully respects the religious beliefs and tenets of all religions,” he said.\nThe High Representative re-affirmed that acts of violence cannot and should not\nbe associated with any religion, nationality, civilization or ethnic group.\n“Violence can and should never be justifiable or acceptable response to acts of intolerance on the basis of religion or belief,” he said.\nThe High Representative recalled the UN Plan of Action and Strategy on Hate Speech which provides guidance on fighting hate speech, racism and discrimination.\nHe stressed that addressing hate speech does not mean limiting or prohibiting freedom of speech.\n“It means keeping hate speech from escalating into something more dangerous, particularly incitement to discrimination, hostility and violence, which is prohibited under international law,” he said.\nThe High Representative also recalled the UN Plan of Action to Safeguard Religious Sites that is anchored in a set of principles including mutual respect for all peoples, regardless of their faith, culture of history; responsibility to build bridges of mutual understanding and cooperation; diversity to accept and respect the differences among human beings.\nThe High Representative noted that all major world religions espouse tolerance\nand peaceful coexistence in a spirit of shared humanity.\nHe emphasized for rejecting and standing-up against those who falsely and maliciously invoke religion to score political gains, create misconceptions, fuel division and spread fear and hatred.\nThe High Representative strongly encouraged interfaith and intercultural dialogue and the debate of ideas at the local, national and international levels which can be a powerful tool against religious intolerance, prejudices and stereotyping.\nThe High Representative reiterated the readiness of UNAOC to support any efforts that promote continued dialogue and foster mutual respect and understanding.\nThe United Nations Alliance of Civilizations was created 15 years ago to serve as a soft power tool for conflict prevention through the promotion of intercultural and interreligious dialogue and building bridges of understanding between different cultures and religions.",
  "retrievedAt": "2025-08-11T19:57:30.645Z"
}
