{
  "title": "President seeks Ulema’s guiding role on environment protection, social harmony",
  "link": "https://www.app.com.pk/national/president-seeks-ulemas-guiding-role-on-environment-protection-social-harmony/",
  "date_published": "2020-10-30T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP): President Dr Arif Alvi Friday reiterated his call for enhanced role of mosques and pulpits to create awareness on the issues of environmental protection, women rights, stunted growth and disease prevention.\nHe was addressing the opening session of National Seerat Conference on “Environmental pollution and our responsibilities in the light of the life of Holy Prophet (PBUH)”, held in connection with the Eid Milad-un-Nabi (SAW) here by the ministries of religious affairs and climate change.\nAlso addressed by Minister for Religious Affairs and Interfaith Harmony Pir Nurul Haq Qadri, Minister of State for Climate Change Zartaj Gul, SAPM Malik Amin Aslam, Prime Minister’s Representative on Religious Harmony Tahir Mahmood Ashrafi, the moot was attended by hundreds of religious scholars from across the country.\nThis was the first time that the environmental protection was chosen as the subject of annual Seerat Conference to highlight the issue of climate change for Pakistan being among seven countries badly hit by the phenomenon.\nThe president said some 1400 years ago, Holy Prophet Hazrat Muhammad (Peace Be Upon Him) had given the message of a clean and green society, who had even strictly directed against harming trees, orchards, minors and women during the battles.\nHe said the mosques were the most effective forum to teach the people on the environmental protection, respect for the women’s inheritance rights and adoption of precautions to spread the communicable diseases like COVID-19.\nSimilarly, the pulpit could also help prevent stunted growth of the children by promoting the Quranic teachings of 24-month breastfeeding which would improve health of both the mother and child, he added.\nDr Alvi, who earlier distributed prizes among the best research paper writers on the Holy Prophet’s (PBUH) life and teachings, said Pakistanis had successfully contained the virus by wearing masks, frequent hand washing and social distancing.\nHe, however, reiterated that the disease was not yet over and it was still essential to stick to the precautions for averting its second wave.\nHe viewed that besides the nation’s discipline, Allah’s blessing was another major reason behind the success which He showered as a reward for the people and the government’s compassion towards the poor countrymen in the hour of distress.\nThe president told the audience that the Holy Prophet’s (PBUH) instructions to share the personal conveyance with the pedestrians was in fact a message to reduce the number of vehicles which was also being promoted in the form of car sharing across the world to reduce pollution.\nHe suggested the Council of Islamic Ideology to formulate a list of most important issues, which should be unanimously emphasized and highlighted by the prayer leaders in their Friday sermons.\nEndorsing an earlier speaker’s views, the president called for highlighting the similarities and to avoid playing up differences to create sectarian and societal harmony.\nHe viewed that the world was more interested about their interests and least bothered about the moralities and human rights, as evident from the its response towards the human rights abuses in the Indian Illegally Occupied Jammu and Kashmir.\nReferring to Prime Minister Imran Khan’s speech at the United Nations General Assembly, President Alvi said Imran Khan had emerged as a Muslim world leader by raising their voice against Islamophobia and blasphemy.\nThe European countries which had criminalized the denial of holocaust must also realize that any desecration of the Holy Prophet (PBUH) hurt the sentiments of billions of Muslims, he stressed.\nCondemning the patronage of display of blasphemous caricatures by French President Macron, the president said he was in fact creating division within his own society.\nReligious Affairs Minister Pir Nurul Haq Qadri, in his address, condemned the blasphemous caricatures republished and displayed in France under the patronage of French president.\nHe lauded the prime minister’s decision to observe the week starting from Friday (October 30) as the ‘Week for Love of the Holy Prophet (PBUH)’ and said the contemptible attempts by the West could never undermine the Holy Prophet’s love and reverence in the Muslims’ hearts.\nThe prime minister was also taking multiple measures to prevent such malicious attempts in future by bringing unity among the Muslim world, he remarked.\nMinister of State Zartaj Gul highlighted the importance of environmental protection under Islamic injunctions, which, she said, further necessitated the followers to take the issue seriously.\nShe said with Pakistan’s glaciers melting fast, water table depleting, weather getting severer and untimely rains impacting crops, per capita water availability had decreased from 5500 cubic meters to just 1,000 cubic meters.\nAbout 64% population was deprived of clean drinking water and 40% deaths occurred due to waterborne diseases, she added.\nNevertheless, she said, the incumbent government was taking multiple steps to mitigate the impacts of climate change like 10 Billion Tree Tsunami, construction of five dams, banning shopping bags, conservation of national parks and setting up the Water Table Regulatory Authority for ground water recharge.\nSpecial Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam said the coronavirus was one of the many consequences of imbalance created by the humans in the natural circle.\nBut the world must take it as an opportunity to take remedial measures like the ones being taken under the Clean and Green Pakistan initiative.\nStressing the role of Ulema, the SAPM said it could bring huge change if the Muslims engaged in environmental protection measures with the religious passion because the Holy Prophet (PBUH) had repeatedly instructed for environmental protection.\nAllama Tahir Ashrafi said the Muslims could tolerate any injustice but never the desecration of their beloved Holy Prophet (PBUH).\nHe called for an international legislation to ban such blasphemous acts and assured the audience that the government would take all-out measures to bring the evil practice to an end.\nThe Secretary Ministry of Religious Affairs, prominent religious scholars including Syed Ziaullah Shah Bukhari, Pirzada Junaid Amin, Samia Raheel Qazi and Allama Arif Wahidi also addressed the conference.",
  "retrievedAt": "2025-08-11T19:57:32.494Z"
}
