{
  "title": "Pakistan condemns Israeli strike on Qatar as ‘Blatant Violation of Sovereignty’ : FO Spox",
  "author": null,
  "content": "ISLAMABAD, Sep 12 (APP):Pakistan on Friday strongly condemned the recent Israeli aggression against the State of Qatar, describing it as an egregious violation of Qatar’s sovereignty and international law, Foreign Office Spokesperson Shafqat Ali Khan said during the weekly media briefing.\n“This highly provocative and reckless action constitutes a blatant violation of Qatar’s sovereignty, international law, the UN Charter, and norms governing inter-state relations,” Shafqat Khan told journalists at the Ministry of Foreign Affairs.\nHe said Pakistan expressed complete solidarity with the brotherly State of Qatar and called upon the international community to hold Israel accountable for this “unprovoked and unlawful aggression.”\n“This reckless act is yet another manifestation of Israel’s continued disregard for international peace and security, and its policy of destabilizing the region,” he added.\nShafqat Ali Khan said Prime Minister, Muhammad Shehbaz Sharif undertook an official visit to Qatar following the Israeli attack on Doha on September 9, to express solidarity with the Qatari leadership and people.\nDuring his meeting with Amir of Qatar, Sheikh Tamim bin Hamad Al Thani, the prime minister conveyed Pakistan’s strongest condemnation of the Israeli attack and reaffirmed Pakistan’s full support in defending Qatar’s sovereignty and territorial integrity.\nShafqat Khan said the prime minister also conveyed condolences on the loss of innocent lives and wished a speedy recovery to the injured. “The prime minister emphasized that Israel’s brazen aggression must be stopped, and the Muslim Ummah must stand united in the face of such provocations,” he said.\nHe added that the Prime Minister appreciated Qatar’s role in promoting peace in Gaza and highlighted that the attack was clearly aimed at undermining regional stability and sabotaging ongoing peace efforts.\nShafqat Khan confirmed that Pakistan, at Qatar’s request, initiated an emergency session of the UN Security Council, which was also supported by Algeria and Somalia, to discuss the situation arising out of the Israeli aggression.\nAddressing the UNSC, Pakistan’s Permanent Representative to the UN, Ambassador Asim Iftikhar, warned that Israel’s attack was a deliberate attempt to derail diplomatic efforts and prolong civilian suffering, he added.\nHe termed it part of a larger pattern of aggression by Israel in the region, including in Gaza, Syria, Lebanon, Iran, and Yemen, in violation of international humanitarian law and the UN Charter.\nThe Foreign Office Spokesperson highlighted a series of important diplomatic engagements during the week: Kazakhstan’s Deputy Prime Minister and Foreign Minister, Murat Nurtleu, visited Pakistan from September 8–9, accompanied by a high-level delegation. Both sides reviewed the full spectrum of bilateral relations and signed an Action Plan of Cooperation between the foreign ministries to boost engagement in trade, agriculture, technology, defense, and cultural sectors.\nHe added that Turkish Minister of National Defence, Yasar Güler, led his country’s delegation to the 16th Pakistan-Türkiye Joint Ministerial Commission (JMC), co-chaired by Commerce Minister Jam Kamal Khan.\nHe said the meetings resulted in a comprehensive review of cooperation in defence, trade, transport, pharmaceuticals, education, and tourism.\nHe announced that Pakistan officially assumed the Chairmanship of the SCO’s Regional Anti-Terrorist Structure (SCO-RATS) on September 10.\nHe said Pakistan, in its capacity as Chair, would lead regional efforts to counter terrorism and extremism through joint activities in cyber security, border control, and countering terrorist financing.\n“As a frontline state in the global fight against terrorism, Pakistan has made unparalleled sacrifices to ensure regional and global security,” Khan noted.\nCommenting on the human rights situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Khan strongly condemned India’s continued denial of bail to senior Kashmiri leader Shabbir Ahmed Shah, who has been diagnosed with cancer.\nHe also expressed concern over the arbitrary takeover of 215 schools run by the Falah-e-Aam Trust, calling the move “coercive and unjust.”\n“These steps are a clear manifestation of the Indian authorities’ high-handed approach,” he said, urging India to respect the fundamental rights of the Kashmiri people and allow them their inalienable right to self-determination as enshrined in UN Security Council resolutions.\nShafqat Ali Khan also expressed deep sorrow over the loss of precious lives in Nepal due to recent tragic events. “We extend our heartfelt condolences to the bereaved families and wish a swift recovery to the injured. Pakistan stands in solidarity with the resilient people of Nepal,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:50:54.090Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-condemns-israeli-strike-on-qatar-as-blatant-violation-of-sovereignty-fo-spox/",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T17:38:00.000Z"
}
