{
  "article_id": "2025-10-15_b18a26896c3335319b19a4b162a3f4c4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/over-100-pakistani-it-firms-register-in-saudi-arabia-under-vision-2030/",
    "retrieved_at": "2025-10-17T00:05:41.187Z"
  },
  "metadata": {
    "title": "Over 100 Pakistani IT firms register in Saudi Arabia under Vision 2030",
    "author": null,
    "date_published": "2025-10-15T14:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 351,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 15 (APP): Pakistan is expanding its trade and investment footprint in Saudi Arabia, with over 100 Pakistani information technology (IT) firms now formally registered to operate in the Kingdom. The move aligns with Saudi Arabia's Vision 2030, which emphasizes digital transformation, innovation, and value-added business cooperation. According to documents available with Wealth Pakistan, these Pakistani companies have joined Saudi business networks to offer advanced technological solutions in fintech, e-commerce, and software development. A professional network comprising Saudi IT specialists and Pakistani technology suppliers is also being formed to facilitate long-term collaboration and joint projects. The Trade and Investment Section of Pakistan's Consulate General in Jeddah has concurrently redirected its focus toward the promotion of minerals, marble, and construction materials. It has organized multiple webinars and business-to-business (B2B) meetings on Himalayan salt, decorative stones, and other building materials to highlight Pakistan's export potential in these sectors. Earlier this year, during the Health Engineering and Minerals Show (HEMS) held in Lahore, 12 Saudi buyers participated, reflecting a growing interest in Pakistan's mining and construction industries. The event served as a platform for connecting Pakistani exporters with potential Saudi partners and investors. To enhance export readiness and compliance, the trade mission has intensified its market intelligence sharing and technical assistance efforts. Lists of 29 product categories showcased during the three-day \"Made in Pakistan\" exhibition in Jeddah on February 5 this year were shared with 137 Pakistani exhibitors to help them connect with Saudi importers. In addition, new market reports on sports goods, textiles, and industrial fans have been circulated among Pakistani exporters to inform their market entry strategies. A major step forward came through workshops and technical briefings on Saudi Standards, Metrology and Quality Organization (SASO) certification. These sessions guided exporters on meeting the Kingdom's national standards - a key prerequisite for gaining access to Saudi markets. These collective efforts demonstrate Pakistan's strategic shift from traditional commodity-based exports toward knowledge-driven, technology-oriented, and certified trade. Moreover, the diversification in IT, minerals, and construction sectors can help Pakistan secure a stronger and more sustainable footing in Saudi Arabia's rapidly transforming economy under Vision 2030.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}