{
  "article_id": "2025-10-15_6784e7c34f6d0a1b2a70f562f6489fd1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/army-destroys-several-afghan-tank-positions-militant-camp-along-pak-afghan-border/",
    "retrieved_at": "2025-10-17T00:06:29.382Z"
  },
  "metadata": {
    "title": "Army destroys several Afghan tank positions, militant camp along Pak-Afghan border",
    "author": null,
    "date_published": "2025-10-15T07:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 203,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Oct 15 (APP): Pakistan Army gave a prompt and befitting response to unprovoked firing by Afghan Taliban and Khwarij terrorists in Kurram Sector along the Pak-Afghan border. According to security sources, Taliban posts suffered heavy losses due to the retaliatory fire by the Pakistan Army. The army destroyed the fourth tank position of the Afghan Taliban at Shamshad Post within an hour. The militants affiliated with Fitna al-Khawarij and the Taliban reportedly fled their positions in panic. The security sources further said that an important commander of Fitna al-Khawarij was reportedly killed in retaliatory response of Pak Army. They said that the strikes destroyed several tank positions at the Nargsar post in Afghanistan's Khost province, killing multiple fighters of Taliban and Fitna al Khawarij. The post is now vacant after the strike. One of the Taliban posts was seen raising a white flag before its fighters abandoned it, security officials said. The army also destroyed a sixth tank and its crew at Turkmanzai Top, with flames visible from the wreckage. Security sources said that a training camp opposite the Polsen Post linked to Kharji Malik Naeem was also completely destroyed in strike. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/10/WhatsApp-Video-2025-10-15-at-07.02.57.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}