{
  "article_id": "2025-10-15_dcffb9cc3dd88c8c0823bcbde3008812",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/statements-of-two-medical-witnesses-recorded-in-sana-yusuf-murder-case/",
    "retrieved_at": "2025-10-17T00:04:23.283Z"
  },
  "metadata": {
    "title": "Statements of two medical witnesses recorded in Sana Yusuf murder case",
    "author": null,
    "date_published": "2025-10-15T19:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 235,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 15 (APP):The hearing of the TikToker Sana Yusuf murder case was held before Additional District and Sessions Judge Muhammad Afzal Majoka, where accused Umar Hayat was brought from Adiala Jail under strict security. During the proceedings, the prosecution presented two witnesses, Dr. Harpal Kumar and Dr. Amna, whose statements were officially recorded. According to court details, Dr. Harpal Kumar had examined the body of Sana Yusuf, while Dr. Amna had conducted the post-mortem. State prosecutor Raja Naveed Hussain requested the court to ensure that the defence counsel cross-examines both witnesses on the same day, arguing that delays in cross-examination were unnecessarily prolonging the case. He stated that both witnesses were medical professionals with busy schedules, and their cross-examination should not be postponed further. The court, after hearing arguments, directed the defence lawyers to complete the cross-examination of prosecution witnesses in the next hearing. The case was then adjourned till October 18. According to the prosecution, more than 30 witnesses will testify in the case, out of which statements from three have been recorded so far, including police officer Usama, Dr. Harpal Kumar, and Dr. Amna. However, the defence has not yet cross-examined any of the witnesses. TikToker Sana Yusuf was allegedly shot dead at her home, and the police later arrested Umar Hayat in connection with the murder. He has been in judicial custody since his arrest and remains lodged in Adiala Jail.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}