{
  "article_id": "2025-10-15_56bcc42b3f55af10b1efdd57acab32c6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ehsan-elahi-murder-case-two-suspects-killed-in-noon-encounter-crossfire/",
    "retrieved_at": "2025-10-17T00:05:10.959Z"
  },
  "metadata": {
    "title": "Ehsan Elahi murder case: two suspects killed in Noon encounter crossfire",
    "author": null,
    "date_published": "2025-10-15T17:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 245,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 15 (APP): In the jurisdiction of Noon Police Station, Islamabad, two suspects linked to the high-profile murder of CDA Director Land Ehsan Elahi were killed during a police encounter when their own accomplices opened fire during a raid. An official told APP on Wednesday that the deceased were identified as Abid Yasin and Abrar Khan, who had earlier confessed to their involvement in the murder of Ehsan Elahi in Blue Area and the attempted murder of Qaiser Ashfaq. Police said the suspects had been arrested during checking in the Noon area, where they also tried to fire at police but were overpowered, and weapons were recovered from them. According to the FIR No. 976/25 registered at Humak Police Station, the suspects admitted during interrogation that their accomplices were also involved in the crime. Acting on this information, the police took them to a location to help identify the other fugitives. As soon as the team reached, their accomplices suddenly attacked the police party with heavy gunfire. The police officers remained safe due to protective measures. After the situation was brought under control and the area searched, both arrested suspects were found dead, hit by their own accomplices' bullets. Their bodies were shifted to hospital for post-mortem. Officials confirmed that raids are continuing to arrest the remaining suspects still at large. They added that ICT Police will not rest until every person involved in the brutal killing of Ehsan Elahi is brought to justice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}