{
  "article_id": "2025-10-15_856ae1e58d507b5be87d27ae2e411507",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistans-relationship-with-palestine-rooted-in-religious-historical-brotherly-ties-gilani/",
    "retrieved_at": "2025-10-17T00:05:50.878Z"
  },
  "metadata": {
    "title": "Pakistan’s relationship with Palestine rooted in religious, historical, brotherly ties: Gilani",
    "author": null,
    "date_published": "2025-10-15T14:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 413,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 15 (APP):Chairman Senate Syed Yousaf Raza Gilani on Wednesday said that Pakistan's relationship with Palestine is rooted in religious, historical, and brotherly ties. The meeting between, the chairman senate and Ambassador focused on bilateral relations, the regional situation, post-ceasefire peace efforts in Palestine, and ongoing humanitarian assistance initiatives, said a news release. Gilani warmly welcomed the Palestinian Ambassador and reaffirmed that the people and Parliament of Pakistan stand in complete solidarity with the people of Palestine and strongly condemn Israel's aggression, grave human rights violations, and the massacre of innocent civilians. He added that during his tenure as Prime Minister of Pakistan, he had always extended unwavering support for the right of self-determination of the Palestinian people and consistently raised his voice against Israeli atrocities at all international forums. The Chairman paid rich tribute to the courage and resilience of the Palestinian people, who have written a new chapter in history through their unmatched bravery and sacrifices. He said that the recent ceasefire represents a new ray of hope for the people of Palestine, and Pakistan considers this development an important step towards lasting peace in the region. The Chairman Senate stated that Pakistan has always played a constructive role in promoting global peace and considers a just resolution of the Palestinian issue as the key to lasting peace in the Middle East. He reiterated Pakistan's unwavering support for the establishment of an independent, viable, and contiguous State of Palestine with in accordance with relevant UN resolutions and pre-1967 borders. He further informed that Pakistan has been a strong voice for Palestine at the United Nations, OIC, Inter-Parliamentary Union, and Non-Aligned Movement. The Ambassador highlighted Pakistan's assistance for the people of Gaza. He added that Pakistani universities are offering higher education opportunities to Palestinian students. He reiterated Pakistan's firm belief that sustainable peace in the Middle East is intrinsically linked to the right of self-determination of the Palestinian people. He emphasized that peace can only be achieved when Palestine is granted its legitimate rights and Israeli occupation comes to an end. Urging unity within the Muslim world, the Chairman called on all Muslim countries to raise a collective voice for Palestine, stating that the issue of Palestine is not just a national cause but a matter of conscience for the entire Ummah. The Chairman Senate reaffirmed that Pakistan will continue to stand shoulder-to-shoulder with its Palestinian brothers, extending political, diplomatic, moral, and humanitarian support until the realization of their just cause.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}