{
  "article_id": "2025-10-15_891c15ed4cadb60486d545aef0fcffb6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/turkmen-envoy-meets-aurangzeb-khichi-to-boost-cultural-ties-between-pakistan-and-turkmenistan/",
    "retrieved_at": "2025-10-17T00:06:26.103Z"
  },
  "metadata": {
    "title": "Turkmen Envoy meets Aurangzeb Khichi to boost cultural ties between Pakistan and Turkmenistan",
    "author": null,
    "date_published": "2025-10-15T12:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 388,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 15 (APP):Pakistan and Turkmenistan are set to open a new chapter of cultural collaboration as Turkmen Ambassador, Atadjan Movlamov met with Federal Minister for National Heritage and Culture Division, Aurangzeb Khan Khichi here on Tuesday. The meeting focused on enhancing cultural exchanges, tourism, and people-to-people linkages between the two brotherly nations. Welcoming the ambassador, the minister said Pakistan and Turkmenistan share deep-rooted relations based on common history, faith, and cultural values. He announced that Pakistan is ready to sign the Programme on Cooperation in the Field of Culture (2024-2026), which will formalize bilateral collaboration in arts, literature, and heritage preservation. Aurangzeb Khichi emphasized that promoting cultural ties should go hand in hand with economic and trade cooperation, adding that the proximity of the two countries, with a flight duration of under two hours, offers great potential for tourism and artistic exchange. Referring to regional connectivity projects such as the Turkmenistan-Afghanistan-Pakistan-India (TAPI) gas pipeline, the Minister said similar initiatives in culture and heritage could strengthen regional understanding and peace. \"Pakistan's 5,000-year-old civilizational heritage, from Gandhara to Mohenjo-Daro, is a treasure worth exploring and sharing,\" he noted. The Minister also proposed holding joint cultural festivals in both countries to highlight their artistic traditions. Extending an invitation to Turkmenistan for Lok Mela 2025, scheduled from November 07-16 at Lok Virsa, he said the event would provide a platform for cultural collaboration. Ambassador Movlamov welcomed the proposal and confirmed Turkmen participation in the festival. Aurangzeb Khichi further announced plans for a special cultural evening at the Pakistan National Council of the Arts (PNCA), featuring performances and exhibits reflecting Pakistan's diverse heritage, and invited the Ambassador to attend. Both sides agreed to appoint focal persons from their respective ministries to expedite the signing of the upcoming Memorandum of Understanding (MoU). The Turkmen envoy assured full cooperation in advancing cultural and tourism ties and emphasized joint efforts to boost mutual understanding through art and creativity. Secretary of the National Heritage and Culture Division, Asad Rehman Gillani, termed the forthcoming cultural cooperation programme a milestone in strengthening bilateral friendship, adding that it would pave the way for artist exchanges, literary translations, exhibitions, and participation in each other's national festivals. He said the initiative reflects the shared commitment of Pakistan and Turkmenistan to deepen cultural linkages and celebrate their historic ties through meaningful collaboration.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}