{
  "title": "Air Chief witnesses Bahrain International Air Show 2022",
  "link": "https://www.app.com.pk/national/air-chief-witnesses-bahrain-international-air-show-2022/",
  "date_published": "2022-11-11T07:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP):Chief of the Air Staff, Air Chief Marshal Zaheer Ahmed Baber Sidhu on Friday attended the opening ceremony of Bahrain International Air Show (BIAS-2022) in which “Pride of Pakistan” JF-17 Thunder aircraft also participated.\nA large number of delegations from different countries were also present at the occasion, a Pakistan Air Force (PAF) news release here received said.\nThe indigenously manufactured JF-17 fighter jet displayed alongside other aircraft and defence equipment at the event, remained the star attraction of the show.\nWhile interacting with the Pakistan Air Force contingent, the Air Chief lauded PAF personnel’s performance in the airshow and said that their participation in the event was a matter of pride for the nation and appreciated their efforts for bringing laurels to the country.\nHe also praised the PAF team for putting up a nice show at the mega event. Later on, he visited various stalls and met several high ranking officials.\nEarlier in the day, the PAF personnel briefed the eager crowd about the combat aircraft’s operational capabilities and sophisticated weaponry.\nThe spectators were ecstatic to see the pride of Pakistan in their midst. Apart from the static display, the Pakistan Aeronautical Complex- manufactured JF-17 aircraft also presented an aerobatics performance.\nThe excitement of the eagerly awaiting crowd was worth watching as the aircraft roared in the skies of Bahrain. The much anticipated display was thoroughly enjoyed by the spectators and they fervently clapped as the fighter jet landed back at the airstrip.\nThe participation of JF-17 Thunder aircraft in the airshow has proved to be an excellent opportunity to showcase its cutting edge capabilities. It has also given an opportunity to the potential buyers to assess the fighter jet’s immense potential in the international market.",
  "retrievedAt": "2025-08-11T15:52:25.876Z"
}
