{
  "title": "Swati remains absent from committee’s meeting formed to probe his leaked video scandal: Haideri",
  "link": "https://www.app.com.pk/national/swati-remains-absent-from-committees-meeting-formed-to-probe-his-leaked-video-scandal-haideri/",
  "date_published": "2022-11-11T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): Jamiat Ulema-e-Islam-Fazl (JUI-F) Senator Maulana Abdul Ghafoor Haideri on Friday said Pakistan Tehreek-i-Insaf (PTI) Senator Muhammad Azam Khan Swati remained absent from two consecutive meetings of the parliamentary special committee formed to probe his video leak scandal.\nTalking to media after chairing the meeting as convener, he said four members of the upper house of parliament made contact with the PTI stalwart but he did not attend the meeting.\nThe way Senator Swati had created hype in the media over his leaked video, he must come in the meeting so that the culprits should be brought to justice as soon as possible, he added.\nHe alarmed that if he would not attend the meeting, it would raise question on the credibility of alleged video tape.\nHe mentioned that the next meeting of committee would be held on Monday, November 14 to further deliberate on the matter.\nHaideri proposed the PTI’s lawmakers to attend the committee’s meeting as it has one-pint agenda to investigate the Swati’s indecent video tape.\nHe said making such disgusting videos in a bid to harass the people were against the moral ethics in the civilized societies.\nCondemning the Swati’s alleged incident, he said the series of insulting politicians, journalists and people of good repute in the society through audio and video tape leaks should be stopped now.\nHe, apart from government, urged the human rights organizations to play their due role into the matter and devise a joint strategy to cope with such cases in the future.\nHe explained that Senate Chairman Muhammad Sadiq Sanjrani, taking up the issue of Swati’s leaked video, formed a special committee comprising of all parties’ parliamentary leaders in Senate.\nThe aim of this whole exercise was to probe the alleged video scandal and provide all possible assistance the affected legislator, he added.",
  "retrievedAt": "2025-08-11T15:52:25.866Z"
}
