{
  "title": "CARE International, MMBL join hands to promote financial capacity development",
  "link": "https://www.app.com.pk/national/care-international-mmbl-join-hands-to-promote-financial-capacity-development/",
  "date_published": "2022-06-14T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): CARE International in Pakistan (CIP), an international non-governmental organization (INGO), was collaborating with Pakistan’s largest digital bank, Mobilink Microfinance Bank Limited (MMBL) to bolster the mission of promoting financial inclusion across the nation through innovative digital financial solutions.\nThe collaboration was powered by CIP’s Ignite project, funded by the Mastercard Center for Inclusive Growth, is enabling financial and technological access for entrepreneurs, especially females. The project was part of a global collaboration between CIP and the Center for Inclusive Growth.\nOn the occasion, special advisor to the prime minister, Ms. Romina Khurshid Alam praised the collective efforts of both CIP and MMBL, towards fostering a synergistic approach to enhance the financial inclusion of women entrepreneurs in Pakistan.\nMoreover, she indicated that women’s economic empowerment was a key priority area for the government and encouraged the promotion of similar initiatives to reach the under banked segments of the population, especially women. She added that such projects continue to lend unwavering support for women’s long-term financial development and the nation’s economic growth.\nThrough this strategic partnership, CIP and MMBL aim to accelerate the financial inclusion of more than 12,000 entrepreneurs, especially females who have been running their businesses for at least two years and have employed a minimum of 2-10 staff members.\nEnhancing access to credit and subsidized loan products help scale their operations considerably. In addition, the collaboration would also support the capacity building and mentoring of these budding entrepreneurs with a focus on the use of digital technologies.\nAddressing the audience, President & CEO of MMBL, Ghazanfar Azzam, said, “There are about 100 million unbanked people in Pakistan, and at least 82% of them are women. Women, in particular, lack access to formal digital financial services, making it difficult for them to participate in economic activity. MMBL, through this strategic partnership with CIP, is focused on training female entrepreneurs across the country to upskill their technical and professional skills, thereby reducing poverty and boosting prosperity by financially empowering them. This strategic partnership would play a critical role in promoting financial inclusion across the country and further the common goal of closing the gender gap in the financial sphere.”\nAdil Sheraz, Country Director CIP, said “With women constituting more than 50% of Pakistan’s population, gender equality in all its interventions was a key focus area for CIP. Through this collaboration with MMBL, we seek to facilitate the much-needed access to finance and capacity building for growth-oriented entrepreneurs, especially women. This collaboration with MMBL was part of CIP’s focus on synergistic efforts to enhance financial inclusion in the country, especially for women.”\nLisa Richman, Eastern Europe, Middle East and Africa Director for the Mastercard Center for Inclusive Growth, said: “At Mastercard, we believe that financial inclusion was the path to a prosperous future for all. We were committed to supporting entrepreneurs in their digital transformation journey and through the Center for Inclusive Growth. We would continue to provide entrepreneurs, especially women, with the financial tools, training, know-how, resources and technologies they need to connect with the digital economy to drive further growth and become more resilient. We were proud to build on our longstanding global partnership with CIP as we mark the next chapter in our journey in Pakistan.”",
  "retrievedAt": "2025-08-11T15:05:12.133Z"
}
