{
  "title": "Bilawal for strengthening Pak-Iran economic diplomacy to unlock true potential",
  "link": "https://www.app.com.pk/national/bilawal-for-strengthen-pak-iran-economic-diplomacy-to-unlock-true-potential/",
  "date_published": "2022-06-14T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP): Foreign Minister Bilawal Bhutto Zardari Tuesday, expressing the desire to expand bilateral relations between Pakistan and Iran, vowed to strengthen economic diplomacy bilaterally for unlocking the true potential.\nThe foreign minister, in an interview with the Islamic Republic News Agency (IRNA) before his official visit to Tehran, said that “facilitating trade and exploiting the true potentials of Iran and Pakistan was important for us.”\nBilawal Bhutto, along with a political and economic delegation, left for Iran on Tuesday morning for a two-day visit. Ambassador of Iran to Pakistan Seyed Mohammad Ali Hosseini was also present on the occasion.\nHe said people of the two countries had a long historic relationship, sharing religious, cultural, and other bonds, adding that “his country, his party, and his family, have a longstanding relationship with the people of Iran and I look forward to improving and enhancing the relationship between the two countries.”\n“I am looking forward to my first bilateral visit to Iran,” he added.\nHe added Pakistan wanted to enhance its economic activity with all countries and was focusing on economic diplomacy. There has been a lot of cooperation in the past with Iran and Pakistan looked forward to enhancing this cooperation, he added.\n“We want to enhance progress on border markets and go a long way to facilitate commercial activity on both ends and I am looking forward to having meaningful conversations with my counterparts to unlock the true potential of the economic relationship,” he noted.\nThe foreign minister said despite the connectivity, shared borders, cultures, and history, there was a lot more potential for both sides to enhance tourism.\n“I really hope that we will be able to discuss these issues, enhance the modes and means of transport between the two countries, and encourage not only obviously religious and spiritual tourism between the two countries but also economic tourism and people-to-people activities.”\nRegarding Afghanistan, he said the situation in Afghanistan was on everyone’s mind, particularly those in the region or in the neighborhood who were directly impacted by the developments in Afghanistan.\n“I am sure I would have deep meaningful conversations on this topic as well,” the foreign minister said.\nHe said during his two-day stay in Iran, he would hold a detailed exchange of views with his Iranian counterpart on all areas of mutual interest.\nHe will also call on the Iranian president and meet other dignitaries. He will also visit Mashhad on Wednesday.\nLast month, the foreign ministers of Pakistan and Iran had discussed bilateral trade, border markets, and the situation in Afghanistan, on the sidelines of the World Economic Forum (WEF).",
  "retrievedAt": "2025-08-11T15:05:08.283Z"
}
