{
  "title": "662 Kashmiris martyred since August 5, 2019 in IIOJK: Report",
  "link": "https://www.app.com.pk/national/662-kashmiris-martyred-since-august-2019-in-iiojk-report/",
  "date_published": "2022-08-05T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): The occupation Indian forces have martyred 662 Kashmiris, including 13 women, in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) since August 5, 2019, Kashmir Media Service said in a report on the completion of three years of the puppet regime’s illegal and unconstitutional move.\nThe report said at least 2,278 people were critically injured due to the use of brute force, including firing of bullets, pellets and teargas shells by the Indian troops, paramilitary and police personnel on peaceful demonstrators and mourners in the territory.\nSince the Hindutva Indian government of Narendra Modi’s illegal move of repealing the special status of the territory on August 5, 2019, killings, extrajudicial executions, arbitrary arrests, destruction of property and other grave human rights violations have witnessed a surge to an alarming proportion.\nThe report revealed that senior Hurriyat leader Muhammad Ashraf Sehrai was among dozens of Kashmiris who died in the custody of Indian police.\nIt pointed out that the killings since August 5, 2019 were higher than those in 2011, 2012, 2013, 2014, 2015 and 2019. Most of the victims were killed in fake encounters and in custody during violent cordon and search operations in the length and breadth of the territory.\nThe report said many youth were picked up from their houses and then eliminated after being labeled as “Mujahideen” or over ground workers of ongoing struggle of right to self- determination and Hurriyat organizations. Most of the arrested youth were booked by Indian forces under black laws like Public Safety Act and Unlawful Activities (Prevention) Act (UAPA).\nIt said the killings by troops since August 5, 2019 till date had rendered 38 women widowed and 91 children orphaned. The troops damaged over 1,093 houses and structures, and molested or disgraced 125 women and arrested 17,993 people, including aged woman and half a dozen girls during cordon and search operations across the occupied territory.\nThe report maintained that the life of Kashmiris had been particularly made miserable since India illegally abrogated Article 370 and 35A of its constitution in 2019. The move, it added, was aimed at snatching away the identity of the Kashmiris through changing the Muslim-majority status of the occupied territory into a minority.\nAs the entire occupied Kashmir has been turned into an open-air prison, thousands of Hurriyat leaders and activists, religious and political leaders, businessmen and civil society members and youth were arrested after or before August 5, 2019 and still continue to remain in different jails of India and IIOJK.\nProminent among them are All Parties Hurriyat Conference Chairman  Masarrat Aalam Butt, Shabbir Ahmed Shah, Muhammad Yasin Malik,  Aasiya Andrabi, Nayeem Ahmed Khan, Fehmeeda Sofi, Naheeda Nasreen, Ghulam Ahmad Gulzar, Mushtaqul Islam, Altaf Ahmed Shah, Ayaz Muhammad Akbar, Peer Saifullah, Raja Merajuddin Kalwal, Shahid-ul-Islam, Farooq Ahmed Dar, Syed Shahid Yousuf, Syed Shakeel Yousuf, Muzafar Ahmad Dar, Ghulam Muhammad Butt, Muhammad Yousuf Mir, Muhammad Yusuf Falahi, Muhammad Rafiq Ganai, Hayat Ahmed Butt, Dr Qasim  Fakhtoo, Ghulam Qadir Bhat, Muhammad Shafi (Khan) Shariatee, Showket Hakeem, Mehrajidin Nanda, Waheed Ahmad Gojri, Mehmood Toopewali, Feroz Adil Zargar, Dawood Zargar, Noor Fayaz, Eng Rashid,  human rights activists, Khurram Parviaz and Muhammad Ahsan Untoo and journalists Asif Sultan and Fahad  Shah, who have languishing in different jails of India.\nSenior APHC leader Mirwaiz Umar Farooq continues to remain under house detention in Srinagar while senior resistance leader Mohammad Ashraf Sehrai died during incarceration.\nAt least, 4,500 people have been detained under black laws, Public Safety Act and Unlawful (Prevention) Act (UAPA).\nThe report deplored that press freedom was under a constant threat in the IIOJK where journalists were detained and harassed. The new media policy introduced by the Modi regime in IIOJK had further restricted the flow of free information in the territory, it added.\nIt pointed out that India was using brutal tactics to achieve its nefarious goals in IIOJK. “The Modi regime is engaged in changing the Muslim majority status of the occupied territory. For this purpose, it has granted domicile certificates to thousands of Indians.\n“Properties of pro-freedom leaders are being confiscated to pressurize the leadership. India is re-arranging constituencies in the IIOJK to give more seats to Hindus,” it deplored.\nThe report, however, said the worst Indian brutalities and cruelties had failed to subdue the freedom sentiment of the Kashmiri people, who were determined to keep fighting for their rights, including the right to self-determination.",
  "retrievedAt": "2025-08-11T15:20:50.281Z"
}
