{
  "title": "People of Balochistan fully support Kashmir’s struggle: CM",
  "link": "https://www.app.com.pk/national/people-of-balochistan-fully-support-kashmirs-struggle-cm/",
  "date_published": "2022-08-05T10:44:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 05 (APP): Chief Minister Balochistan Abdul Quddus Bizenjo said on Friday the people of Balochistan fully support the just right of self-determination of Kashmiris.\nIn a message on the eve of Youm-e- Istehsal Kashmir, he said “We will continue to raise our voice against Indian state oppression at every forum,”\n“Modi led fascist government has become totally deranged as it is using all means to forcefully suppress the voices of millions of Kashmiris,” he said.\nTerming the Indian illegal and unilateral move of August 05, 2019, he said that the unstoppable series of Indian state atrocities on Occupied Kashmir continues unabated.\n“So far, tens of thousands of innocent Kashmiris have been martyred, thousand others injured and hundreds paralyzed,”\nReferring to Indian government’s conspiracy theory, he feared that extremist Hindus were being settled in IIOJK by removing the special status of Kashmir and taking away their lands.\nGovernment machinery is being used to convert the majority of Muslims into a minority.\nStressing the need for international support, he called upon the international community to notice of the oppression and cruelty of the Indian state institutions\n“According to the resolution of the United Nations, Kashmiris should be given their right to vote and self determination,” he maintained.\nCM said that Kashmir is the integral part of Pakistan and the relationship and bond between Pakistanis and Occupied Kashmiris is beyond description.\n“India wants to erase the love of Pakistan from the hearts of the Kashmiris of Occupied Kashmir,” he said, adding that India forgets that the hearts of Pakistanis and Occupied Kashmiri brothers beat together.\nCondemning, in strong terms, the conviction of Kashmiri Hurriyat leader Yasin Malik to life imprisonment, he said that the purpose of Yasin Malik’s punishment was to end the voice of Kashmiris.\nIt would be foolish of India that it will be able to deprive the Kashmiris of their right through cruelty and coercion.\nHe, however, vowed that we will have to be a strong and powerful voice of the oppressed Kashmiri brothers and prayed that May Allah grant success to the oppressed people of Kashmir in their just cause.",
  "retrievedAt": "2025-08-11T15:20:53.568Z"
}
