{
  "title": "WKAF calls upon India to end its annexation of IIOJ&K",
  "link": "https://www.app.com.pk/national/wkaf-calls-upon-india-to-end-its-annexation-of-iiojk/",
  "date_published": "2022-08-05T05:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):The World Kashmir Awareness Forum (WKAF) called upon India to end its annexation of Illegally Occupied Jammu and Kashmir (IIOJK) and  restore civil liberties so that the people of the territory could decide about their future.\nThe WKAF issued the following statement on the occasion of third anniversary of the illegal abrogation of Article 370 and 35 A on August 5, 2019.\n“We resolutely stand against every illegal and manipulative step the Indian regimes have taken against our people and our national sovereignty since its invasion in 1947. Those steps include but are not limited to a full-scale invasion into our historically sovereign state and denial of the right to self-determination in defiance of the specific and mandatory UN Security Council Resolutions on Kashmir.\n“Further, we condemn the draconian laws passed by the Modi administration following the abrogation of Article- 370 and 35-A, under which it is stealing public and private resources—land, water, minerals, and lumbar without any compensation or legal recourse,” it said.\nThe statement said under these laws, Kashmiri Muslims are summarily terminated from their government jobs without cause. Muslims in high government jobs are being demoted and replaced with imported Indian personnel. Political leaders and human rights activists are thrown into crowded filthy prisons across India far away from their families. without recourse to any due legal process.\nThe WKAF said, “Right of free speech and free movement, particularly international travel is limited and, in some cases, completely denied. Kashmir is going through an untenable existential crisis and must be stopped by international intervention. Kashmiri political prisoners must be set free, and the reign of terror must be stopped.”\nIt said the time and again, we appeal to the UNHCHC, OIC, and the United Nations to intervene and persuade India to rescind the Article 35 A and restore freedom to all Kashmiris in and outside Kashmir.\nIt said on November 22, 2021, Khurram Parvez, the coordinator of the Jammu Kashmir Coalition of Civil Society, and the Asian Federation Against Involuntary Disappearances chairperson, was unlawfully arrested by NIA following a raid of his residence and under the Unlawful Activities Prevention Act (UAPA).\nThis act has been used by Indian forces to harass, assault, and imprison Kashmir’s human rights activists, political leaders, and journalists. Such actions by the NIA are politically motivated and are part of the Indian government’s attempt to further silence Kashmiri voices.\nAs these heinous acts against the indigenous people of Jammu and Kashmir continue, the resiliency of the local people and the hope they have for self-determination grows stronger.\n“We stand in fierce opposition to India’s actions against the people of Kashmir and condemn any restriction of free speech and expression throughout the region.\nWe must stop the Indian government’s attack on free speech in the region and urge the government and international community to ensure that rights activists, political leaders, and local journalists are allowed to work freely and without harassment.\nOur thoughts are with all political prisoners and theirs family during this unlawful arrest”, the statement said.",
  "retrievedAt": "2025-08-11T15:21:02.494Z"
}
