{
  "title": "PM for rising above politics for extensive relief, rehab of flood victims",
  "link": "https://www.app.com.pk/national/pm-for-rising-above-politics-for-extensive-relief-rehab-of-flood-victims/",
  "date_published": "2022-08-05T07:43:00.000Z",
  "source": "APP",
  "content": "DERA GHAZI KHAN, Aug 5 (APP): Prime Minister Shehbaz Sharif on Friday said helping the flood-affected people was the time to rise above politics and providing them an across-the-board service of relief and rehabilitation.\nAddressing here at a public gathering, the prime minister said the demand for water channel by the locals would be fulfilled soon.\nThe prime minister vowed to leave no stone unturned till every flood victim was provided relief.\nThe prime minister said as per the 2010’s National Finance Commission award, around 58 percent of the resources went to the provinces and called upon the provincial governments to address the needs of the people.\nHe recalled that during his chief minister-ship, he utilized the funds of Punjab to launch the development projects.\nThe prime minister said the federal government was committed to provide relief to the people affected by floods and ensure their early rehabilitation.\nHe emphasized on ensuring that the compensation be disbursed among the victims.\nHe said the federal government had increased the cash assistance for injured people from Rs25,000 to 250,000 and had also announced a similar compensation of Rs0.5 million for both mud and concrete houses damaged completely and Rs 0.2 million for partially hit ones.\nHe urged upon the departments concerned to take measures in advance to cater to new rain spells in the flood-affected areas.\nThe prime minister also mentioned that August 5 was a reminder about the ruthless barbarity meted out to the Kashmiris of Indian Illegally Occupied Jammu and Kashmir.\nHe said Pakistan would continue to support the just right of Kashmiris for their self-determination and condemn India’s illegal revocation of the special status of Jammu and Kashmir.\nEarlier, during his visit to the flood-hit areas of south Punjab including Dera Ghazi Khan, Rojhan and Rajanpur, he called the need for joint survey by federal and provincial governments to assess the damages in the wake of floods.\nThe prime minister on the occasion was given briefing by the authorities concerned regarding the ongoing relief and rehabilitation work in the area including supply of food, drinking water and basic health facilities to the displaced people staying at temporary shelters.\nFederal Minister for Information Marriyum Aurangzeb, Special Adviser Ataullah tarar, Member National Assembly Sardar Riaz Mehmood Khan Mazari, Aslam Bhootani and Chairman National Disaster Management Authority Lt Gen Akhtar Nawaz accompanied the prime minister.",
  "retrievedAt": "2025-08-11T15:21:01.115Z"
}
