{
  "title": "Sanaullah reaffirms Pakistan’s support to Kashmiris",
  "link": "https://www.app.com.pk/national/sanaullah-reaffirms-pakistans-support-to-kashmiris/",
  "date_published": "2022-08-05T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP): Minister for Interior Rana Sanaullah Khan while paying rich tribute to those who laid their lives in freedom movement of Pakistan and Kashmir on Friday reiterated Pakistani support to Kashmiri people in their freedom struggle from India.\nAddressing an event regarding celebration of 75th Anniversary of Pakistan “An Exclusive Talk” organized by Islamic International University Islamabad (IIUI) here, the minister said India always violated United Nation Resolutions and tried to eliminate special status of Indian Illegally Occupied Jammu and Kashmir  (IIOJK) some three years ago.\nIndia would never succeed to suppress the indigenous freedom movement of Kashmir people, he said. While strongly condoning Indian forces unabated atrocities in the (IIOJK), the minister assured full support to the Kashmiris people. India was facing internal chaos and soon would divide in so many parts, he said. The minister said that Pakistan came into being in the name of Islam and has unique position in all Muslim countries.\nPakistan was achieved after untiring efforts of our forefathers under the acumen leadership of Quaid-e-Azam Muhammad Ali Jinnah, he said. He said later the time had proved that demand for separate country for muslims in sub-continent was right decision.\nHe said the entire Muslim Ummah expressed their pleasure when Pakistan became first Islamic nuclear power country in 1998. The minister said Pakistanis were determined to overcome problems being face by the country.\nHe thanked the Saudi government and Crown Prince Muhammad bin Salman for their generosity and timely support in times of economic crisis. Pakistan was moving forward fast and would soon overcome all challenges, he added. The minister also appreciated the university for organizing the event  to celebrate the 7th Anniversary of Pakistan.",
  "retrievedAt": "2025-08-11T15:20:52.381Z"
}
