{
  "title": "No one be allowed to disrespect Parliament, Constitution: Asad Mehmood",
  "link": "https://www.app.com.pk/national/no-one-be-allowed-to-disrespect-parliament-constitution-asad-mehmood/",
  "date_published": "2023-05-15T14:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): Minister for Communications Maulana Asad Mehmood on Monday alleged that the “superior judiciary is making ‘Imrandarana’ decisions, apparently under the influence of Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan”.\n“However, the public has given its verdict as evident from the massive sit-in outside in front of the apex court. No one will be allowed to disrespect the Parliament and the Constitution,” he said while speaking in the National Assembly.\nMaulana Asad expressed his concern over the targeting of sensitive buildings by Imran Khan’s supporters, which was equally condemned by the nation.\nThe agenda of Imran Khan, he said, was to create chaos in the country and the JUI-F had pointed it out well before time. His party believed in the supremacy of Constitution and that was why it joined hands with other parties to oust Imran Khan from the Prime Minister’s House in a constitutional manner.\nHe claimed that the Constitution (Article 63-A) was re-written, which was the reason for the current constitutional crisis. However, the Parliament had passed legislative proposals and resolutions defining the role of every institution, which could not be ignored.\nThe Parliament would uphold the supremacy of the Constitution, he reaffirmed.\nParliamentary Leader of Balochistan Awami Party (BAP) Khalid Hussain Magsi said a rational approach was required to handle the current political crisis and challenges being faced by the country.\nThe law should take its due course against those who had created anarchy and unrest after the arrest of Imran Khan, he added.\nMinister for Planning, Development and Special Initiatives Prof Ahsan Iqbal alleged that partial decisions by the superior judiciary had caused the constitutional crisis.\nHe accused Imran Khan of embezzling Rs 60 billion for personal gains, who, he alleged, was “given undue favour by the courts” and such an attitude was not acceptable as it would promote an unjust system.\n“The Parliament should file a reference against the top judge in the Supreme Judicial Council”, he added.\nMinister for Climate Change Sherry Rehman accused Imran Khan of inciting the PTI workers to violence and arson after his arrest.\nShe recalled that the Pakistan Peoples Party workers did not resort to violence over the ‘judicial murder’ of the party’s founder and former prime minister Zulfikar Ali Bhutto. On the contrary, the PTI workers went on rampage across the country and set the state buildings on fire though their leader were arrested legally.\nThe minister stressed that elections should be held simultaneously throughout the country.\nMuhammad Akhtar Jan Mengal of the BNP said the current situation had not emerged in a day. Had the institutions worked in their constitutional domains then there would not have been any political and constitutional turmoil in country.\nHe called for “public execution of the corrupt elements” to purge the system of all its ills.\nAbdul Akbar Chitrali of the Jamaat Islami said the country was passing through a tumultuous and critical situation with a severe economic crisis, and the common people were its worst victims as the inflation had made their lives miserable and they could not afford to buy even daily essential items.\nChitrali strongly condemned attacks on the Jinnah House (Lahore) and Radio Pakistan’s building in Peshawar, besides desecrating the statue of Shaheed Captain Colonel Sher Khan, who was a national hero.\nHe said the politicians should be allowed to resolve political matters through dialogue instead of by any institution.\nHe also called for an across the board accountability and all those should be taken to task who were involved in damaging public and private properties.\nShahida Rehmani of the PPP said the political parties would never comprise on the sovereignty of the parliament. I\nShe said it was a conspiracy to roll back China Pakistan Economic Corridor.\nQaisar Sheikh of the Pakistan Muslim League-Nawaz said arsenal attacks on public and private properties was a pre-planned acts of terrorism.\nLater the House was adjourned to meet again on Tuesday at 11 a.m.",
  "retrievedAt": "2025-08-11T08:30:00.647Z"
}
