{
  "title": "OIC news agencies to discuss media’s role for sustainable development at Kazan Forum on May 18",
  "link": "https://www.app.com.pk/national/oic-news-agencies-to-discuss-medias-role-for-sustainable-development-at-kazan-forum-on-may-18/",
  "date_published": "2023-05-15T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): The Union of OIC News Agencies (UNA) will organize an extended media session on May 18-19, themed “Russia – the Islamic World: Media Cooperation for Sustainable Development and Economic Prosperity.\nTo be held in Kazan, Russia, the Forum would be organized in the framework of the International Economic Forum “Russia – the Islamic World: Kazan Forum 2023, said a press release.\nThe session, organized in cooperation with “Tatmedia” Republican Agency for Press and Mass Communications, will be participated by the information department in the General Secretariat of the Organization of Islamic Cooperation, the Islamic Centre for Trade Development and several news agencies and media outlets from OIC countries and Russia.\nTopics of media cooperation between the Islamic world and Russia will be considered during the session, including “Media as Driving Force for Sustainable Development and Economic Partnerships” and “Practical Steps to Strengthen Media Partnerships at the International Level”.\n“The upcoming session is a chance to address global media challenges, build connections and share information among news agencies, and promote peace and tolerance in the media industry,” said the Acting General Director of the Union of OIC News Agencies (UNA), Mohammed Abd Rabbo Al-Yami.\nHe said that UNA’s organization of this session was part of its efforts to improve media institutions in Islamic countries by utilizing expertise from around the world and enhancing coordination between member news agencies, ultimately increasing their presence and participation in international events.\n“Currently, the media make the driving force of sustainable development and economic partnership between the countries. That is why media cooperation – “media diplomacy” – promotes the diplomacy of its states in modern conditions and provides equal access to information. In this regard, Russia stands for an active dialogue with the countries of the Islamic world to combat common information threats,” said Aidar Salimgarayev, head of “Tatmedia” Republican Agency for Press and Mass Communications.\nIt is expected that the Kazan Forum, in its fourteenth edition, will witness more than 140 working sessions to discuss the economic partnership between Russia and Islamic countries in the presence of more than a thousand participants, including business people and investors from the Middle East and the countries of the OIC.",
  "retrievedAt": "2025-08-11T08:30:01.765Z"
}
