{
  "title": "HR violations rise dramatically in Indian Occupied J&K",
  "link": "https://www.app.com.pk/national/hr-violations-rise-dramatically-in-indian-administered-jk/",
  "date_published": "2023-05-15T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): Human rights violations have risen dramatically in Indian administered Jammu and Kashmir since 2019 when the government of India revoked the special status of the region,” warned a UN Independent Expert, one week before a G20 meeting to be held in Srinagar.\n“By holding a G20 meeting of the working group on tourism on 22-24 May,” warned Fernand de Varennes, UN Special Rapporteur on minority issues, “the government of India is seeking to normalize what some have described as a military occupation by instrumentalising a G20 meeting and portraying it as an international “seal ofapproval”, despite what Volker Türk, the U.N. high commissioner for human rights, told the U.N. Human Rights Council a few weeks ago about “worrying human rights situation in the Kashmir region”.\nThe Special Rapporteur issued a statement on Monday describing the massive rights violations including torture, extrajudicial killings, denial of political participation rights of Kashmiri Muslims and minorities, following the suspension of democratic rights and local elections due to direct rule from New Delhi on 6 August 2019.\n“The situation there has – if anything – become much worse since myself and fellow UN independent experts transmitted a communication to the Government of India in 2021. We then expressed our grave concerns that the loss of political autonomy and the implementation of the new Domicile Rules and other legislation could alter thedemographic composition of the former state of Jammu and Kashmir, may result in political disenfranchisement, and significantly reduce the degree of political participation and representation of the Kashmiri and other minorities previously exercised in the former state, undermining their linguistic, cultural and religious rights”, he said. “On all counts this seems to be occurring on the ground, in a repressive and sometimes brutal environment of suppression of even basic rights”.\nThe Independent Expert noted that there have been reports of significant numbers of Hindus from outside the region moving into Kashmir. Dramatic demographic changes are underway in Jammu and Kashmir tooverwhelm native Kashmiris in their own land.\nAccording to de Varennes, the G20 is unwittingly providing a veneer of support to a facade of normalcy at a time when massive human rights violations, illegal and arbitrary arrests, political persecutions, restrictions and even suppression of free media and human rights defenders continue to escalate. “International human rights obligations and the UN Declaration of Human Rights should still be upheld by organisations such as the G20”, he added, concluding that “the situation in Jammu and Kashmir should be decried and condemned, not pushed under the rug and ignored with the holding of this meeting”.\nSpecial Rapporteurs are part of what is known as the Special Procedures experts of the Human Rights Council. Special Procedures experts, the largest body of independent experts in the UN Human Rights system, is the general name of theCouncil’s independent fact-finding and monitoring mechanisms that address either specific country situations or thematic issues in all parts of the world. Special Procedures experts work on a voluntary basis; they are not UN staff and do not receive a salary for their work. They are independent from any government or organization and serve in their individual capacity.",
  "retrievedAt": "2025-08-11T08:29:54.862Z"
}
