{
  "title": "ISSI, Balkan Studies Centre sign cooperation protocol",
  "link": "https://www.app.com.pk/national/issi-balkan-studies-centre-sign-cooperation-protocol/",
  "date_published": "2023-05-15T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): In a virtual ceremony on Monday, the Institute of Strategic Studies Islamabad (ISSI) and Balkan Studies Centre (BSC) of the International University of Sarajevo (IUS) concluded a cooperation protocol.Signed by Director General ISSI Ambassador Sohail Mahmood and Rector of IUS Prof. Dr. Ahmet Yildrim, this is the first Cooperation Protocol of its kind between the think tanks of Pakistan and Bosnia & Herzegovina.\nDr. Shakaib Rafique, Deputy Head of Mission at the Embassy of Pakistan in Sarajevo, was also present on the occasion.\nDirector of ISSI’s Center for Strategic Perspectives (CSP), Dr. Neelum Nigar, briefed the IUS participants about the working of the institute and its outreach program with various think tanks and research and educational institutions around the world.\nWelcoming the signing of the Cooperation Protocol, Director General ambassador Sohail Mahmood stated that it will help establish a long-term institutional relationship between ISSI and BSC and enable the two sides to fruitfully collaborate in producing quality research and fostering policy dialogue on issues of common interest. He also highlighted the cordial relations between Pakistan and Bosnia & Herzegovina and stated that the signing of this protocol was consistent with the vision of the leadership of both countries in terms of forging closer linkages at the people-to-people level. He also thanked the Pakistan Embassy in Sarajevo for facilitating this initiative.\nRector IUS Prof. Dr. Ahmet Yildrim, in his remarks, highlighted the scope of work of BSC, appreciated all those who had facilitated the present initiative, and stated that BSC looked forward to a fruitful partnership and joint activities within the framework of the Cooperation Protocol. He also alluded to the close, cordial ties between Bosnia & Herzegovina and Pakistan.\nDr. Shakaib Rafique, speaking on the occasion, congratulated the two Institutes on signing the Cooperation Protocol, stressing that it was the first of its kind between think tanks of Pakistan and Bosnia & Herzegovina and would lead to more progress in the future. He underscored that this collaboration would be part of the growing fruitful bilateral relationship between the two countries.",
  "retrievedAt": "2025-08-11T08:29:57.293Z"
}
