{
  "title": "Lawmakers demand to try PTI chairman under Army act",
  "link": "https://www.app.com.pk/national/lawmakers-demand-to-try-pti-chairman-under-army-act/",
  "date_published": "2023-05-15T08:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): Lawmakers in the National Assembly while strongly condemning arsenal attacks on Jinnah House, radio Pakistan Peshawar building, damaging public and private properties in various parts of the country by Pakistan Tehreek-e-Insaf (PTI) violent protesters on Monday demanded to try its chairman Imran Khan under Army Act.\nSpeaking in the National Assembly here they said such elements made the entire country hostage by creating anarchy and commotion and damaging public and private properties. Such anti-state elements do not deserve any leniency and they should be taken to task, they added.\nLeader of the Opposition in NA Raja Riaz Ahmed termed Imran Khan a ‘fitna’ when he was arrested in a corruption case; his (Imran) supporters resorted to violent protest and torched the historical Jinnah House, Radio Pakistan Peshawar besides damaging statues of martyrs.\nFitna Khan has ashamed the whole nation but he was given a warm welcome at the Apex court, he said.\nHe demanded that a case should be registered under the army act against ‘Fitna Khan’ besides trying under the army act.\nHe also urged the chair to adjourn the Housing proceeding for 10 minutes or play the national anthem several times in solidarity with armed forces and Pakistan.\nSaladuddin of Muttahida Qaumi Movement (MQM) said anti state elements deserved no leniency and those involved in attacking and damaging public and private properties should be tried under army act.\nHe said many persons were taken into custody from the courts’ premises after cancellation of their bails. The entire country was made hostage by the miscreants of PTI who restored to violent protest soon after the arrest of Imran Khan, he added.\nHe said there were solid corruption evidence against Imran Khan in Al-Qadir case but he was giving special treatment by the judiciary.\nHe said that on May 9, a vehicle in which he and MNA Sabir Qaimkhani were traveling towards Islamabad was also attacked by PTI violent protesters near Chungi-26. He demanded strict action against ‘Fitna Khan’ and his supporters after registering cases against them.\nSalauddin Ayubi of JUI-F while condemning PTI and Imran Khan for torching toll plaza, public and private properties demanded of the government to declare PTI as terrorist organization and impose ban on it. The PTI wanted civil war in the country, he added.\nHe said PTI not only destroyed country’s economy but also trying to create anarchy.\nAbdul Qadir Mandokhel of PPP said a transparent inquiry should be held in arsenal attacks on Jinnah House and other public and private properties by the PTI workers. Imran Khan should be nominated in attack on Jinnah House, he added.",
  "retrievedAt": "2025-08-11T08:30:03.808Z"
}
