{
  "title": "Fact check: Viral video of footballer Cristiano Ronaldo making statement in favour of Palestine is a deepfake - World - DAWN.COM",
  "author": null,
  "content": "Posts from multiple users on various social media platforms since April 7 were circulating a video showing star footballer Cristiano Ronaldo making a statement in support of Palestine. However, the video is old from an interview in January 2022 and has been edited using AI.\n\nThe current Israeli offensive in the Gaza Strip, which began in response to Hamas’s unprecedented attack on October 7, 2023, has killed more than 50,000 Palestinians and destroyed much of the housing and hospital infrastructure in the enclave. The death toll is feared to be much higher due to thousands still missing under the rubble.\n\nSeveral celebrities have condemned the actions of Israel in its military campaign and made statements in favour of Palestine.\n\nOn April 7, a video was shared on TikTok by a user showing Ronaldo making a statement in support of Palestine. In the video, Ronaldo can be heard saying:\n\n“I love Palestine. Hey, I’m Cristiano Ronaldo speaking. Can’t you see what’s happening? The people of Palestine are suffering beyond imagination. The Israeli forces are bombing them mercilessly. Gaza is turning into rubble. Children are crying, parents are lying lifeless, and the world remains silent. The air in Gaza smells of blood and sorrow. I have always stood with the people of Palestine.”\n\nThe post was viewed by more than 151,000 users.\n\nThe same video was also shared on Instagram by an account with the caption: “I love Palestine, CR7.”\n\nThe post received over 224,669 likes.\n\nSeveral other Instagram users shared the same video as can be seen here, here and here.\n\nA fact-check was initiated to determine the veracity of the claim due to its virality and because of keen public interest in both the situation in Palestine and the activities of the football star.\n\nAnalysing the video through multiple tools to detect evidence of tampering or use of artificial intelligence showed that Attestiv.ai assigned the video a 35 per cent suspicion rating, indicating a moderate likelihood of tampering, while Deepware did not detect any signs of manipulation.\n\nHowever, a visual analysis of the video revealed clear inconsistencies as the lip-syncing was visibly off. Ronaldo’s lip movement did not align with the audio, strongly suggesting that the video was edited. This is a common indicator of manipulated content, as noted in the Massachusetts Institute of Technology (MIT) guide on identifying deepfakes.\n\nA reverse image search yielded a video uploaded to YouTube on January 13, 2022, by Beanyman Sports titled: “I don’t accept less than top three! Rangnick will do a good job | Cristiano Ronaldo full interview.”\n\nThe interview was well before the current Gaza conflict erupted, and Ronaldo made no mention of Palestine in the full video.\n\nHe was seen wearing the same Manchester United varsity jacket, having the logo of Adidas on the left side, with the same earring, microphone placement and facial expressions as in the viral clip.\n\nFurther investigation showed that various news outlets have previously fact-checked multiple videos of Ronaldo that were edited using AI and falsely circulated with claims that he had made statements in support of Palestine.\n\nA keyword search showed that the star athlete has not publicly commented on the conflict in any way in the past.\n\nTherefore, the fact-check determined that the claim regarding a viral video showing Cristiano Ronaldo making a statement in favour is Palestine is false. The video is old from January 2022 and has been edited using AI.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ and UNDP.",
  "tags": [],
  "categories": [],
  "image": "https://i.imgur.com/nsVkarS.jpeg",
  "retrievedAt": "2025-08-25T14:24:42.444Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905051/fact-check-viral-video-of-footballer-cristiano-ronaldo-making-statement-in-favour-of-palestine-is-a-deepfake",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T12:36:16.000Z"
}
