{
  "title": "74 killed in deadliest US attack on Yemen, Houthis say - World - DAWN.COM",
  "author": null,
  "content": "US strikes on a Yemeni fuel port killed at least 74 people, Houthi rebels said on Friday, in the deadliest attack of Washington’s 15-month campaign against the group.\n\nThe strikes on Ras Issa aimed at cutting off supplies and funds for the rebels that control large swathes of the Arabian Peninsula’s poorest country, the United States military said.\n\nImages broadcast by a Houthi-run television station showed large blazes lighting up the night sky, following the latest in an intensified barrage of attacks under US President Donald Trump.\n\nHouthi health ministry spokesman Anees Alasbahi said rescuers were still searching for victims at the fuel terminal on the Red Sea, suggesting the number of dead could rise.\n\n“The death toll … has risen to 74 martyrs and 171 wounded in a non-final count,” he said.\n\nAFP was not able to verify the figures independently.\n\nThe Houthis later announced missile attacks on Israel and two US aircraft carriers.\n\nIsrael’s military earlier on Friday said it had intercepted a missile launched from Yemen.\n\nProtesters chanting “Death to America! Death to Israel!” gathered in cities around the country, including one major demonstration in the capital Sanaa on Friday.\n\n“The American military build-up and continued aggression against our country will only lead to more counter-attacks and attack operations, clashes and confrontations,” Houthi military spokesman Yahya Saree told the crowd in Sanaa.\n\nThe strikes on Thursday came just before the US resumes negotiations with Iran over its nuclear programme in Rome on Saturday, following warnings that Tehran is getting closer to building an atomic weapon.\n\n“The military actions in Yemen are clearly sending a signal to Tehran,” Mohammed Albasha, a US-based consultant, told AFP.\n\nThe US military has hammered the Houthis with near-daily air strikes for the past month in a bid to stamp out their attacks on shipping in the Red Sea and Gulf of Aden.\n\nClaiming solidarity with Palestinians, the rebels began attacking the key maritime routes and Israeli territory after the Gaza conflict began in October 2023. They paused their attacks during a recent two-month ceasefire.\n\nIn a statement, United States Central Command (Centcom) said: “US forces took action to eliminate this source of fuel for the Iran-backed Houthi terrorists and deprive them of illegal revenue that has funded Houthi efforts to terrorise the entire region for over 10 years.”\n\nThe US strikes began in January 2024 but have resumed and multiplied under Trump, starting with an offensive that killed 53 people on March 15.\n\nFootage broadcast early Friday by Al-Masirah showed a fireball igniting off the coast as thick columns of smoke rose above what appeared to be an ongoing blaze.\n\nThe Houthi TV station later screened interviews with survivors lying on stretchers, including one man with burns on his arms.\n\n“We ran away. The strikes came one after the other, then everything was on fire,” one man who said he worked at the port told Al-Masirah.\n\nIsrael carried out air strikes on Ras Issa and elsewhere in Yemen in January, describing the targets as military infrastructure. Similar Israeli strikes that also included Ras Issa took place in September.\n\nIran called the latest US strikes “barbaric”, while Hamas denounced them as “blatant aggression”.\n\nThe US bombing campaign intensified last month following Houthi threats to resume attacks on international shipping in protest at Israel’s blocking of aid to the Gaza Strip.\n\n“The message today is unmistakable: the US is targeting not only Houthi military assets and personnel, but also their economic infrastructure,” Albasha said.\n\nHouthi attacks on the Red Sea shipping route, which normally carries about 12 per cent of global trade, have forced many companies into costly detours around the tip of southern Africa.\n\nSeparately, US State Department spokeswoman Tammy Bruce accused the Chinese satellite firm Chang Guang Satellite Technology Company of “directly supporting” Houthi attacks on “US interests”.\n\nBruce did not initially provide details, but later referred to “a Chinese company providing satellite imagery to the Houthis”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/18122851bd43643.jpg",
  "retrievedAt": "2025-08-25T14:24:44.588Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905040/74-killed-in-deadliest-us-attack-on-yemen-houthis-say",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T08:10:15.000Z"
}
