{
  "title": "One million children in Rawalpindi to be vaccinated against polio - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A week-long anti-polio campaign will start from April 21 to vaccinate more than one million children of less than five years old.\n\nThis was informed in a meeting held with Deputy Commissioner Dr Hassan Waqar Cheema in the chair to review the arrangements for the anti-polio campaign.\n\nThe meeting was attended by the additional deputy commissioner of headquarters, officials of the Health Department, district administration, World Health Organisation (WHO) members, and other concerned institutions.\n\nDuring the briefing in the meeting, it was informed that the ongoing polio campaign will start from April 21, in which children across the district will be vaccinated against polio.\n\nIt was informed that in the last drive, the number of children vaccinated in different tehsils under “out-of-the-house” coverage was 52,156, and 90,675 children were vaccinated against polio in schools, 38,705 children were vaccinated in street corners, while 29,608 children were vaccinated against polio at fixed sites. Thus, a total of 247,683 children were vaccinated outside their homes.\n\nApart from this, a detailed briefing was also given at the tehsil level regarding National Immunization Day (NID) and Sub-National Immunization Day (SNID) 2025, according to which the overall target is to protect 1,006,712 children from polio.\n\nThe target of door-to-door vaccination is 7,31,726 children, while a total of 3,749 teams have been formed to participate in this campaign. The deputy commissioner said that complete eradication of polio is the top priority of the government, and no negligence will be tolerated in this campaign.\n\nHe directed all departments to complete this national duty with coordination and cooperation. He also appealed to parents to cooperate with the teams and ensure that their children are vaccinated against polio so that we can protect our future from disabilities.\n\nFurthermore, the deputy commissioner directed the relevant institutions to compile a list of the children and ensure that all children are vaccinated by the end of the campaign.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:44.803Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905003/one-million-children-in-rawalpindi-to-be-vaccinated-against-polio",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T03:33:44.000Z"
}
