{
  "title": "Pakistan, Russia agree to advance partnership - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakis­tan and Russia on Thursday agreed to advance multi­di­mensional partnership sig­­nalling a continued de­­e­pening of relations bet­w­een the two countries.\n\nThe understanding was reached during a meeting between Russia’s Deputy Foreign Minister Sergei Ryabkov and Pakistan’s Deputy Prime Minister and Foreign Minister Ishaq Dar in Islamabad.\n\nThe DPM reaffirmed Pa­­kistan’s strong commitment to its ties with Rus­sia, the Foreign Office said in a statement. It was agreed to pursue a long-term, multi-dimensional partnership spanning tra­de, energy, security, culture, education and people-to-people exchanges.\n\nRyabkov is visiting Isla­mabad to lead Russia’s de­­legation at the 15th round of the Pakistan-Russia Consultative Group on Strategic Stability.\n\nPakistan-Russia relati­o­­ns have seen significant growth in recent years. The bilateral agenda has expanded rapidly to inclu­­de economic, military, and energy collaboration.\n\nIn 2024, bilateral trade crossed the $1 billion mark, supported by progress in energy cooperation, including talks on liquefied natural gas (LNG) supplies and the Pakistan Stream Gas Pipeline project.\n\nThe 9th session of the Pakistan-Russia Inter-Go­vernmental Commission, held in Moscow last year, resulted in the signing of eight agreements across sectors such as education, healthcare, trade, and industrial development.\n\nHigh-level visits from Russia, including Prime Minister Mikhail Mishus­tin and Deputy Prime Mi­­nister Alexei Overchuk’s trips to Islamabad in 2024, have reinforced the trajectory of growing ties.\n\nMilitary cooperation has also expanded, with joint exercises such as Druzhba VII focusing on counterterrorism and strengthening defence coordination.\n\nThe arms trade between the two countries has further solidified security links.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/181019154a691d2.jpg",
  "retrievedAt": "2025-10-12T02:36:13.747Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904956/pakistan-russia-agree-to-advance-partnership",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:40.000Z"
}
