{
  "title": "Chinese investment welcome with open arms: KP govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government on Thursday said it was committed to providing all possible facilities and security to Chinese investors to enable them to do business anywhere in the province.\n\nAddressing an international seminar on the China-Pakistan Economic Corridor project at the China Window“ here, adviser to the KP chief minister on finance Muzammil Aslam, special assistant on industries Abdul Karim Khan and adviser on information Barrister Muhammad Ali Saif said that a special security unit will ensure the protection of Chinese investors and their property.\n\nThey, however, said that the federal government must abolish the NOC requirement for Chinese and other foreign nationals.\n\nMr Aslam said it was commendable that Chinese President Xi Jinping wished to comprehensively advance bilateral cooperation under the Belt and Road Initiative a foundational platform in neighbouring countries.\n\nPromises facilities, security to investors\n\n“As a flagship project under the Belt and Road Initiative, the CPEC has brought Pakistan $25.4 billion in direct investment, 236,000 jobs, 510km of highways, over 8,000 megawatts of electricity and 886km of core transmission lines,” he said.\n\nThe aide to the CM emphasised the need for resolving investor issues, ensuring their security, and working to provide an investment-friendly environment.\n\nHe said that while much had been written, read and said about Pakistan-China friendship, it was time to move beyond that and focus on economic development in Pakistan, especially in Khyber Pakhtunkhwa, with Chinese cooperation so that people could gain employment and embark on a new journey toward prosperity.\n\nSpecial assistant on industries Abdul Karim Khan said that the CPEC, a key component of China’s Belt and Road Initiative, was a game changer not only for Pakistan but for the entire region as well.\n\nHe said the project offered countless opportunities in infrastructure, energy, industry and mutual trade.\n\n“Our province, due to its geographical significance, resources and human capital, could play a key role in the second phase of CPEC. It is fully prepared to reap the benefits of this project,” he said.\n\nMr Khan said the government was taking strong steps to establish industrial zones and special economic zones and create a favourable environment for investors.\n\nHe said the Rashakai Economic Zone was a prominent example of successful policy, where local and foreign investors were showing great interest.\n\nSpokesman for the KP government Barrister Mohammad Ali Saif said it was undeniable that the CPEC was a joint project for economic development and prosperity between Pakistan and China.\n\nHe said China would build a high-level connectivity network to deepen development integration, strengthen industrial and supply chain cooperation, maintain regional stability, cooperate with law enforcement and security institutions, address various risks and challenges, promote people-to-people connections and exchanges, and facilitate the people’s movement.\n\nOn the occasion, Chinese investors expressed a strong interest in putting money in the province but highlighted challenges in that respect.\n\nThey said that if the provincial government took concrete steps to resolve those issues, significant investment opportunities could be unlocked not only in Peshawar but across the province. They noted that such investments would create thousands of employment opportunities for local communities.\n\nDuring the concluding session of the seminar, prominent Chinese businessman Wang Qi, who has already invested in multiple sectors across the country, said that KP’s strategic geographical location made it a highly attractive destination for foreign investment.\n\nHe said Chinese investors were eager to invest in various sectors such as agriculture, minerals, livelihoods, precious and semi-precious stones, and marble, both individually and in collaboration with local stakeholders.\n\n“Chinese investors face significant hurdles, including delays in obtaining no objection certificates to enter the province, which greatly hampers the investment process,” he said.\n\nMr Qi, who is the president of the Zhejiang Chamber of Commerce in Pakistan and the chief representative of Beijing Mineral Technology Company, a subsidiary of the China National Geological Survey Bureau, in Pakistan, urged the provincial government to capitalise on President Xi Jinping’s Belt and Road Initiative.\n\n“The Belt and Road Initiative offers enhanced cooperation to neighbouring countries, particularly during the second phase of CPEC,” he said.\n\nMr Qi advocated for the establishment of a one-window operation system to streamline investment procedures and eliminate bureaucratic red tape.\n\nHe announced that if the KP government introduced investor-friendly policies, he was prepared to initiate major investments that could immediately employ over 50,000 skilled local workers, with the potential to increase further.\n\nMr Qi also commended the formation of the Special Security Unit for the protection of Chinese citizens in Pakistan. He paid tribute to the security forces for “their unwavering commitment to ensuring the safety of Chinese nationals.”\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6801cda17b2ca.jpg",
  "retrievedAt": "2025-08-25T14:24:44.394Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905019/chinese-investment-welcome-with-open-arms-kp-govt",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T03:56:34.000Z"
}
