{
  "title": "Ahmadi man lynched as TLP supporters storm worship place in Karachi’s Saddar: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A 46-year-old businessman was lynched when a few hundred supporters of the religiopolitical party Tehreek-i-Labbaik Pakistan (TLP) stormed a place of worship belonging to the Ahmadi community in Karachi’s Saddar area on Friday to prevent it from observing religious rituals, according to officials.\n\nSpeaking to Dawn.com, South Deputy Inspector General of Police (DIG) Syed Asad Raza said the deceased owned a shop at Tariq Road. As soon as he learned about TLP supporters storming the Ahmadiyya Hall in Saddar, he closed his shop and went to the site of the incident.\n\n“We have decided to lodge a murder case against the TLP leaders and workers. We are waiting for relatives to lodge the first information report (FIR). If they do not register the case, then the FIR will be registered on behalf of the state against the TLP workers,” the DIG said.\n\nHowever, the TLP denied the allegation and said it was not to blame for the incident.\n\nRaza added that the police were in the process of identifying the suspects. “No one will be spared,” declared the South police chief.\n\nHe said that around 400 TLP supporters had gathered outside the community hall, which is situated near the mobile market, adding that the police were already deployed there in the wake of similar incidents in Shah Latif, Surjani and Khokhrapar areas of the metropolis.\n\nDIG Raza said the police, Rangers, and district administration took swift action and provided protection to the Ahmadi community members present inside the place of worship.\n\nHe said the lynching incident occurred near the auto parts market, located near the community hall, where the man was beaten up by TLP supporters, adding that he was taken to a hospital where he succumbed to his injuries.\n\nRaza later told Dawn.com that the police retrieved CCTV footage of the incident, which showed that the victim was filming the TLP protesters from behind the community hall with his cell phone when someone from the mob identified him.\n\n“They initially beat him. When he fell to the ground, the mob began beating him more severely, leading to his death,” he said, adding that the deceased was an active member of the Ahmadi community.\n\nRaza said around 40 members of the community who were taken in “protective custody” by the police to save them from the mob had been released and sent back to their homes. He vowed that no case would be registered against the community members.\n\nHe said relatives had taken away the body after an autopsy at Civil Hospital Karachi.\n\n“They told the police that they will get the FIR registered after consultation with the community on Saturday,” he police official added.\n\nAhmadi community spokesperson Amir Mehmood told Dawn.com that the deceased, who was a known figure of the community, was “passing through the area around 100-150 metres away from the place of worship when TLP supporters recognised him and began beating him, leading to his death”.\n\nPreedy Station House Officer Shabbir Husain also told Dawn.com that the 46-year-old man was “filming the TLP workers near Hashu Centre when the mob started beating him and killed him”.\n\n“We called a prison van to move around 45-50 members of the community inside the community hall to a safe place,” he said.\n\nMehmood, however, said that he was not aware that the deceased was shooting a video of the mob.\n\nPolice surgeon Dr Summaiya Syed told Dawn.com that the deceased received multiple injuries all over his body. “Death occurred due to hard and blunt impacts on the head, leading to fractures and bleeding,” she said.\n\nMeanwhile, TLP spokesperson Rehan Mohammed Khan told Dawn.com that the party had nothing to do with the lynching. “Our stance is clear.”\n\nHe said it was the job of law enforcement agencies to take appropriate action, maintaining that the party was protesting peacefully and demanding legal action.\n\n“What is the evidence for the DIG and SSP (senior superintendent of police) who are blaming the TLP workers for killing the man?”\n\nThe Sindh Human Rights Commission (SHRC) took notice of the incident and directed DIG Raza to conduct a thorough, impartial and expeditious investigation through a senior/competent officer with efforts to focus on identifying and apprehending the culprits.\n\nIn a notice, the SHRC also asked the DIG to submit a detailed report within 15 days.\n\nThe SHRC also said that immediate steps should be taken to ensure the safety and security of the Ahmadi. “Additional police personnel should be deployed as needed to maintain law and order, and effective liaison mechanisms with community representatives must be established to de-escalate tensions and prevent further incidents,” the SHRC said.\n\nIt warned that the present case “holds the potential to escalate into communal and inter-religious tensions”.\n\nIt emphasised the need for the police to adopt “proactive and extraordinary measures to safeguard the vulnerable group and mitigate the ripple effects of such sensitive incidents”.\n\nThe Human Rights Com­­mission of Pakistan (HRCP) said it was “appalled” by the incident, which it denounced as a “failure of law and order” that was a “stark reminder of the continued complicity of the state in the systematic persecution of a beleaguered community”.\n\nIt said the perpetrators of the attack in Saddar must be swiftly traced, arrested and prosecuted “without caving in to pressure from the far right to release those responsible”.\n\nSeparately, former senator Farhatullah Babar, president of the PPP Human Rights Cell, strongly condemned the “most heinous incident”, stating that the incident demonstrated a “dangerous rise in intolerance and of pathetic breakdown of the criminal justice system in the country”.\n\n“It is hoped that the perpetrators will soon be hauled and brought to justice,” Babar said while speaking to Dawn.com.\n\nOffering condolences to the heirs of the victim, the former senator demanded state protection for all minorities, calling for the setting up of the Minorities Commission “by an act of Parliament as ordered in the 2014 Supreme Court verdict”.\n\nLast month, the HRCP said it had observed a growing trend of mob-led attacks on homes of families belonging to religious minorities, as well as their places of worship.\n\nThe HRCP also spoke of Ahmadis’ “arbitrary detention”, “desecration of their graves” and the “vulnerability of Hindu and Christian women” to forced conversion.\n\nThe report, titled Under Siege: Freedom of Religion or Belief in 2023-24, said over 750 persons were in prison on charges of blasphemy, as of October last year. It documented at least four faith-based killings, three of which targeted the Ahmadi community.\n\nA key finding of the report is that disinformation on social media was the spark behind most of the registered blasphemy cases.\n\nHRCP observed an “increasing weaponisation of blasphe­­my laws against Ahmadis”, with cases often initiated by law enforcement officials themselves.\n\nAdditional reporting by Imran Gabol.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/18203828f8e74a2.jpg",
  "retrievedAt": "2025-08-25T14:24:42.524Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905048/ahmadi-man-lynched-as-tlp-supporters-storm-worship-place-in-karachis-saddar-police",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T11:32:21.000Z"
}
