{
  "title": "IMF sees global growth hurt by trade tensions - Business - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Rising trade tensions and sweeping shifts in the global trading system will trigger downward revisions of the International Monetary Fund’s economic forecasts but no global recession is expected, IMF Managing Director Kristalina Georgieva said on Thursday.\n\nGeorgieva said countries’ economies were being tested by a reboot of the global trading system — sparked in recent months by US tariffs and retaliation by China and the European Union — that had unleashed “off the charts” uncertainty in trade policy and extreme volatility in financial markets.\n\n“Disruptions entail costs … our new growth projections will include notable markdowns but not recession,” she said in an address ahead of the spring meetings of the IMF and World Bank in Washington next week.\n\nTrump’s tariffs and the turmoil in financial markets are expected to dominate the spring meetings, which bring together central bankers and finance ministers from around the world.\n\nElevated uncertainty also raised the risk of financial market stress, Georgieva said, noting that recent movements in US Treasury yield curves should be taken as a warning. “Everyone suffers if financial conditions worsen,” she said.\n\nGeorgieva said the world’s real economy is functioning well, with a strong labor market and a solid financial system, but warned that increasingly negative perceptions and concerns about recession could also affect economic activity.\n\n“One thing I learned through crisis periods is perceptions matter as much as reality,” she said. “If perceptions change negatively that can be quite detrimental to the performance of the economy.” US President Donald Trump has upended the global trading system with a tsunami of new tariffs, including a 10 per cent US duty on goods from all countries and higher rates for some, although those have been paused for 90 days to allow negotiations. China, the EU and other countries have announced retaliatory measures.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68019011e66a1.gif",
  "retrievedAt": "2025-08-25T14:25:01.422Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904925/imf-sees-global-growth-hurt-by-trade-tensions",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:47.000Z"
}
