{
  "title": "PTI livid after party leaders, Imran’s sisters ‘removed from Adiala’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The situation around Adiala jail in Rawalpindi remained tense on Thursday after police once again stopped the family of incarcerated PTI founder Imran Khan from meeting him in pri­son, despite an order by the high court in this regard.\n\nPolice briefly detained the sisters of the former prime minister at a checkpoint close to the heavily guarded prison after the PTI leaders engaged in a heated argument with pol­ice officials for not allowing them to meet the incarcerated party founder.\n\nA police official, however, denied any arrests, saying the PTI leaders were “respectfully esco­rted out of the jurisdiction of Rawalpindi district” amid tight security. Later, police escorted the PTI leaders to the Chakri interchange.\n\nNational Assembly Opposition Leader Omar Ayub, Sunni Ittehad Council (SIC) chief Sahibzada Hamid Raza and Punjab Opposition Leader Ahmed Khan Bhachar were also among the detained people.\n\nSimilarly, seven PTI leaders, including the ex-premier’s sisters Aleema Khan, Noreen Khan Niazi, and Uzma Khanum, and their cousin Qasim Khan, were also taken away by police in a prison van.\n\nThe police, while taking them to the prison van, warned them that they had warrants to arrest them. However, a senior police official denied showing the PTI leaders any warrants.\n\nEarlier, several PTI leaders, including Mr Khan’s sisters, had gathered at an under-construction plaza on Adiala Road to demand a meeting with the former prime minister when the “arrests” were made.\n\nThe entire Adiala Road was cordoned off, with heavy police deployment and checkpoints set up to restrict access to the prison. The main gate of the under-construction plaza, where the PTI leaders had gathered, was also sealed.\n\nA police official told Dawn they did not arrest anyone on Thursday, rather the family of the PTI chief was “respectfully escorted” out of their jurisdiction.\n\nAleema Khan, who had earlier been stopped at the Dahgal checkpoint, voiced her frustration at being denied visitation rights, despite prior assurances. She told reporters that they would not leave without meeting Imran Khan.\n\nPTI leader Zartaj Gul, speaking to the media, said that the court and jail manual both permitted them to Mr Khan, so what was the excuse now?\n\nMeanwhile, Sahibzada Hamid Raza criticised the government’s selective approach, stating: “Some people are allowed to meet Imran Khan without court orders or official lists, while others are barred. My name will never be on the list of compromised people.”\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/18075404d853c4f.jpg",
  "retrievedAt": "2025-08-25T14:25:14.940Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904948/pti-livid-after-party-leaders-imrans-sisters-removed-from-adiala",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:27.000Z"
}
