{
  "title": "Citizens in capital lose Rs620m to criminals in three months - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Culprits stole cash and valuables worth at least Rs620 million in the federal capital during the first three months of this year, as the police registered at least 1,289 cases over different incidents, including dacoities, robberies, snatching, burglaries, and thefts.\n\nDetails collected from the capital police revealed that the cash and valuables were either looted or stolen from Islamabad from January 1 to March 28 in different dacoity, robbery, snatching, burglary, and theft incidents.\n\nBesides 518 tolas of gold, 15 vehicles, 93 motorcycles, 924 mobile phones, and 87 laptops were either looted or stolen during the said period, while two people were murdered during a robbery and a burglary.\n\nSimilarly, 20 people were injured, including 10 who had firearm injuries.\n\nPolice register over 1,200 cases from Jan 1 to March 28\n\nAccording to the cases registered with the police, 304 criminal activities targeted houses and residential areas, whereas 139 cases pertained to commercial centres, including shops. 846 incidents occurred in public spaces.\n\nThe police registered six dacoity cases in which Rs11 million in cash and valuables worth Rs9 million were looted.\n\nOut of the total, four such incidents took place at houses, and one each at a commercial centre and an open area. 12 tola of gold and two mobile phones were also looted.\n\nMoreover, the police also registered 438 robbery incidents. 10 were committed at houses, 42 at commercial centres, and 376 in open areas. At least one person was murdered, 10 were shot and injured, and five sustained other injuries during such incidents.\n\nThe robbers also looted Rs69 million in cash and valuables worth Rs129 million. Gold weighing 141 tola, six vehicles, 73 motorcycles, 429 mobile phones, and five laptops were also looted.\n\nThe police also registered 196 cases of snatching, in which Rs15 million in cash and valuables worth Rs75 million were looted. In such incidents, most of which occurred in open spaces, four people were injured.\n\nBesides, the culprits also looted six tolas of gold, five vehicles, nine motorcycles, 282 mobile phones, and three laptops.\n\nThe police also registered 155 incidents of burglary, 122 committed at residential areas, and 33 at commercial centres, resulting in the death of one man. Burglars stole Rs12 million in cash and valuables worth Rs88 million. 139.5 tolas of gold, two motorcycles, 37 mobile phones, 30 laptops, and seven animals were stolen in this activity.\n\nThe police also registered 494 incidents of theft, 157 targeting residential areas, 62 at commercial centres, and 275 targetting citizens in open areas. Rs50 million in cash and valuables worth Rs158 million were stolen.\n\nGold weighing 219 tolas, four vehicles, nine motorcycles, 176 mobile phones, 49 laptops, two meters, 32 batteries, eight tires, 10 transformers, three cycles, 52 animals, and 143 birds were also stolen in this activity.\n\nPolice officers said the number of criminal activities and complaints lodged with the police was much higher, claiming the police did not register cases against at least 9,088 complaints despite issuing e-tags.\n\nBesides, another practice is emerging in the capital police as they are downgrading the severity of crimes. Robbery cases were being registered as dacoity incidents, while snatching incidents were being registered as fraud, they claimed.\n\nDeputy Inspector General of Police (Operations) Jawad Tariq was approached for comments.\n\nHe replied that they “will get the exact figures”. However, he did not respond by the time this report went to press.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:46.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905001/citizens-in-capital-lose-rs620m-to-criminals-in-three-months",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T03:31:55.000Z"
}
