{
  "title": "Ban on heavy vehicles extended as fresh curbs imposed on rickshaws - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: In pursuance to continued efforts of the provincial government to control the menace of dumper-related fatal incidents in Karachi, the city administration on Thursday extended the complete ban imposed on heavy vehicles in the city during daytime for another two months.\n\nThe ban on the movement of heavy vehicles was initially imposed for two months on Feb 14 in the wake of widespread protests by people, political parties and civil rights campaigners over the alarming increase in fatal incidents involving heavy vehicles mainly dumper trucks.\n\nWhile allowing heavy vehicles to operate in the city from 10pm to 6am for two months, the city administration authorised the district and traffic police to register cases against the violators of the ban.\n\nSpeaking to Dawn, Home Minister Zia Lanjhar said that the ban was imposed to regulate heavy vehicles and any action resulting in public inconvenience would be dealt with sternly.\n\nTrucks allowed to operate in city between 10pm and 6am for two months\n\nHe said that the decision was taken to mitigate the rising number of road accidents caused by heavy vehicles and enhance traffic flow in the metropolis.\n\nAccording to a notification issued by Karachi Commissioner Syed Hassan Naqvi, the authorities have re-imposed the 60-day ban, which would remain in place for the next 60 days to regulate the movement of heavy vehicles in the city, except from 10pm to 6am.\n\nThe commissioner said that vehicles carrying essential commodities such as water, cooking oil, medicine, oxygen cylinders for medical facilities, meat and other items were exempted from the ban.\n\nHeavy vehicles have been allowed on three routes, including the Superhighway (to New Karachi Industrial Area via Slip Road); National Highway (to Godown Chowrangi via Manzar Petrol Pump, Younas Chowrangi, Dawood Chowrangi to Road 8000 near Jam Sadiq Bridge); and Northern Bypass (to Mauripur Road, Jinnah Bridge, Karachi Port, Mai Kolachi Road up till NLC intersection).\n\nClampdown on rickshaws\n\nEarlier on Wednesday, the authorities had clamped a strict ban on the movement of rickshaws, unauthorised extended rickshaws and Qingqis on 11 major roads.\n\nOn Thursday, the imposition of the ban affected a large number of commuters, especially students and people belonging to lower-income groups, who mostly rely on extended rickshaws for their daily commute.\n\nThe order said that the rickshaws were prohibited from operating on key Karachi roads for two months from April 15 to June 14, 2025.\n\nThe roads where rickshaw operations are now banned include Sharea Faisal, I.I. Chundrigar Road, Shaheed-i-Millat Road, and other important city routes.\n\nAlthough the ban on the movement of rickshaws on major arteries of the city has been imposed to mitigate the traffic congestion, it has started to affect a large number of people due to a limited number of public transport buses.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:47.041Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904899/ban-on-heavy-vehicles-extended-as-fresh-curbs-imposed-on-rickshaws",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:19:07.000Z"
}
