{
  "title": "Probe finds over 200 kanal land was illegally transferred to Bahria Town Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Over 200 kanal land of a cooperative housing society was illegally transferred to property tycoon Malik Riaz’s Bahria Town Lahore, the National Accountability Bureau (NAB) said on Thursday.\n\nNAB conducted an inquiry against officials of the Official Employees Cooperative Housing Society Ltd, revenue department and Bahria Town Lahore over the illegal transfer of the land.\n\n“The inquiry proceedings unearthed that a piece of land measuring 204 kanals and three marlas worth billions of rupees, located in Mauza Manak and Mauza Bhai Kot, Tehsil Raiwind, Lahore, of the Official Employees Cooperative Housing Society Ltd was illegally and unlawfully transferred to M/s Bahria Town,” NAB said in a statement issued to the press and added that owing to the timely reporting of the fraudulent activity by Assistant Registrar (Housing-V) Jahanzeb Akbar, the entire land had been successfully restored.\n\n“The land in question has been transferred back to its rightful owner — the Official Employees Cooperative Housing Society,” the bureau said.\n\nNAB says the land was successfully restored and transferred back to the owner\n\nThe bureau did not say a word in whose tenure — PTI, Mohsin Naqvi’s caretaker setup or PML-N — in Punjab, this land was illegally transferred to Bahria Town.\n\nThe NAB chairman has appreciated Jahanzeb Akbar’s performance and issued a letter of appreciation for him to the Punjab chief secretary.\n\nThe NAB probe is underway as to how the officials of the Official Employees Cooperative Housing Society Ltd, revenue department and Bahria Town Lahore, in connivance with each other made the illegal transfer of the land in question.\n\nThe housing projects of Malik Riaz have come under scrutiny of NAB after the PML-N came to power. The bureau has already declared Malik Riaz an absconder in the Al-Qadir Trust case in which former prime minister Imran Khan is convicted.\n\nMr Riaz is currently in the United Arab Emirates (UAE) and NAB has announced plans to bring him back through Interpol.\n\n“The government is reaching out to the UAE for the extradition of Malik Riaz through legal channels,” NAB said and that Malik Riaz is an absconder in the case related to the repatriation of £190m through the UK’s National Crime Agency (NCA), and is wanted by the court.\n\nNAB has already frozen innumerable assets of Bahria Town and Malik Riaz. According to NAB, Riaz had illegally occupied public and private land to build his Bahria Town housing schemes.\n\nThe bureau has asked citizens not to invest in this project since that may be considered ‘money laundering’ by the government.\n\nMalik Riaz, no stranger to Pakistan’s power corridors before his fall from grace, plans to develop ‘Bahria Town Dubai’, a luxury housing project.\n\nNAB had also issued a statement about this project saying: “The general public at large is hereby advised and warned to refrain from investing in the stated project (Bahria Town Dubai). If the general public at large invests in the stated project, their actions would be tantamount to money laundering, for which they may face criminal/legal proceedings,” the statement had said.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:46.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904992/probe-finds-over-200-kanal-land-was-illegally-transferred-to-bahria-town-lahore",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T03:23:01.000Z"
}
