{
  "title": "Imran ready for dialogue for country’s sake, says Gandapur - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur on said Thursday that the incarcerated PTI founding chairman was ready for a dialogue, but only for the sake of the country, not for personal gain.\n\nHe was speaking to a joint general house of the Lahore High Court Bar Association and the Lahore Bar Association, both led by Senator Hamid Khan-led professional group.\n\n“Imran Khan is ready for a dialogue not because he wants power or the prime minister’s chair, but because he dreams of building a proud, independent nation,” CM Gandapur reiterated.\n\nHe said the objective of the negotiations should be the national interest and stability of Pakistan.\n\nState minister says govt weighing possibility of trying PTI founder in military court\n\nHe stated that Pakistan cannot be governed through coercion.\n\nHe alleged that the rigging in the 2024 general elections proved that the country was being run by selected, not elected, people.\n\nHe claimed that Imran Khan was in jail not because of any wrongdoing, but because “he is a threat to the current system”.\n\nCM Gandapur said that repeated experiments had been conducted on this nation to impose selected individuals on the people. As a result, he said, Pakistan plunged into Rs76 trillion debt.\n\nHe said Pakistan was created in the name of Islam, but it lost both self-respect and sovereignty.\n\nCriticising the system further, CM Gandapur said, “You want selected people because you are the ones who want to run and overthrow governments. If you’re the judge, the lawyer, and the complainant, then how can a country function like this?”\n\nHe went on to say that Imran Khan speaks for the nation, for Muslims, for Islam and for the sanctity of the Prophet (PBUH).\n\nHe asked, “How long will you keep Imran Khan behind bars? When the voice of 240 million people is not being heard by the establishment and the decision makers, it means they are not with the people, but with their personal interests.”\n\nThe chief minister said the PTI launched a peaceful movement, but its rallies were stopped, leaders and workers jailed, and even Imran Khan’s wife was imprisoned.\n\nReferring to last year’s November protest in Islamabad, he said that when people decided to rise, they respo­n­ded with bullets, killing 14 of PTI supporters and injuring many others.\n\nKP CM Gandapur also announced a financial grant of Rs50 million for the Lahore High Court Bar Association.\n\nHe also thanked LHCBA Presi­dent Malik Asif Ahmad Nissoana and LBA President Mubashir Rehman Chaudhry for inviting him.\n\nNadir Guramani adds from Islamabad: When asked whether Imran Khan could be tried by a military court, Minister of State for Law Barrister Aqeel Malik said that the matter was being considered.\n\n“As a student of law, I believe that the legal provision exists,” he told DawnNewsTV on Thursday, adding that since the matter was currently sub-judice, he would refrain from commenting on the minutiae.\n\n“But the matter is being discussed, [we] are examining all aspects; that how can a civilian be tried under the army act. The FB Ali case is also being examined,” he said.\n\nWhen asked whether he knew if the PTI had engaged in talks with the establishment, Barrister Aqeel was dismissive.\n\n“Imran Khan has no other choice than to speak to other parties and politicians… on political issues. The writing is on the wall,” he concluded.\n\n“The PTI was elected with the help of the establishment, yet they always proclaim that it should not have a role in politics. Now they are saying that they don’t want to talk to politicians, they only want to talk to the establishment.”\n\n“But it is all a façade,” he maintained, adding that the party had no contacts with the powers that be at any level.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6801a7fa9ec52.gif",
  "retrievedAt": "2025-10-12T02:35:35.512Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904955/imran-ready-for-dialogue-for-countrys-sake-says-gandapur",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:40.000Z"
}
