{
  "title": "Pak-Afghan trade talks begin after year-long hiatus - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and Afghanistan on Thursday resumed high-level trade and investment talks after a year-long gap to facilitate cargo movement at border stations to maintain unfettered bilateral and transit trade.\n\nThe last high-level meeting took place between both countries in March 2024, when Commerce Secretary Mohammad Khurrum Agha visited Kabul and met Afghan Acting Minister for Industry and Commerce Nooruddin Azizi to discuss bilateral trade and transit.\n\nAccording to a statement released by Afghanistan’s commerce ministry, a big demand emerged for the renewal of the Afghanistan-Pakistan Transit Trade Agreement (APTTA), transit facilitation, counter-smuggling commodities, and exporting Afghan coal to Pakistan.\n\nThe Afghan side also discussed making Torkham port operational 24/7, allowing bilateral trade through Ghulam Khan port, crossing heavy vehicles between the two countries’ territories, providing bank guarantees, and establishing an inclusive mechanism for port administration between the two countries.\n\nMr Azizi is leading a high-level delegation to Pakistan to explore ways to enhance trade ties. On Thursday, he also met with Pakistan’s Commerce Minister Jam Kamal.\n\nAccording to the statement, Pakistan proposed forming a joint committee to hold regular sessions to address trade-related issues. Discussions also touched on the situation of Afghan refugees.\n\nPakistan’s exports to Afghanistan increased 84.25 per cent to $592.84m in 8MFY25 from $321.75m last year. Imports stood at $18.21m against $5.47m in 8MFY24. The Torkham border was closed for nearly 27 days during this period, disrupting trade.\n\nPakistan’s main export to Afghanistan in the current fiscal year has been sugar, with more than 700,000 tonnes exported over the past four months, most of it bound for Afghanistan.\n\nAn official announcement from Pakistan’s commerce ministry said the talks revolved around strengthening bilateral trade relations, resolving transit issues, and improving border cooperation.\n\nCommerce Minister Kamal welcomed the Afghan delegation and emphasized the historical and cultural ties between the two countries.\n\nBoth sides held comprehensive discussions on key issues impacting bilateral trade, including procedural hurdles, regulatory requirements, cargo handling, documentation, scanning, and cargo monitoring processes.\n\nThe two ministers also emphasized the importance of a structured border management framework to enhance customs coordination, facilitate cross-border movement, and reduce trade disruptions. They discussed cooperation in agricultural exports, coal, carpets, and resolving issues around Afghan cotton exports.\n\nThe Afghan Minister expressed optimism that mutual trade potential can be fully realized through continued dialogue and close collaboration.\n\nBoth sides reaffirmed their commitment to improving economic connectivity and trade integration and expressed hope that upcoming technical-level meetings would produce practical solutions to overcome existing bottlenecks.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:24:59.687Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904921/pak-afghan-trade-talks-begin-after-year-long-hiatus",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:47.000Z"
}
