{
  "title": "Record $1.2bn surplus in March - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Pakistan recorded its highest-ever monthly current account surplus in March, with a surplus of $1.195 billion compared to $363 million in the same month last year, the State Bank data showed on Thursday.\n\nThe March surplus accounted for the largest share of the $1.859bn total surplus posted during the July-March period of the ongoing fiscal year.\n\nThe previous month also witnessed a historic inflow of remittances, which reached $4.1bn. The surge has prompted the SBP to raise its annual remittance target from $35bn to $38bn for FY25.\n\nDespite the SBP governor’s assertion that import restrictions have been lif­ted, imports of goods during the nine-month period rose modestly to $43.39bn from $39.06bn a year earlier — an increase of just $4.33bn. Exports of goods also increased by $1.77bn, reaching $24.66bn in the same period.\n\nTherefore, the trade deficit in goods and services widened to $21.05bn in July-March FY25 compared to $18.36bn in the same period last year — an increase of $2.7bn. Nonetheless, the current account remained in surplus, largely due to robust remittance inflows.\n\nFinancial experts attributed the strong March performance to record remittances sent by overseas Pakistanis. The inflows jumped 33 per cent year-on-year to $28bn during the nine months under review from $21bn in the year-ago period.\n\nThe higher inflows have also encouraged the central bank to raise its foreign exchange reserves target to $14bn, up from $13bn.\n\nThe only quarter with a deficit so far in FY25 was the first quarter (July-September), which posted a shortfall of $402m. This was followed by a strong second quarter (October-December) with a surplus of $1.562bn. The third quarter (January-March) posted a surplus of $699m, including the record $1.195bn in March alone.\n\nIn its previous monetary policy statement, the SBP projected that the current account would remain within a surplus or deficit of 0.5pc of GDP. The ongoing trend suggests a likely surplus in the April-June quarter as well.\n\nCurrency analysts noted that the record remittances and current account surplus had helped stabilise the exchange rate, improving investor sentiment and potentially paving the way for foreign inflows.\n\nForeign direct investment\n\nMeanwhile, Foreign Direct Investment (FDI) rose by 14pc during July-March FY25, reaching $1.64bn compared to $1.44bn in the same period last year. While the increase of $202m is notable, analysts said the total remains modest for a country of 250 million people.\n\nDespite offering special incentives and promoting its mineral wealth in Balochistan, the government has struggled to attract large-scale FDI over the past three years. Business leaders said political instability and security concerns continue to deter international investors.\n\nHowever, there is optimism that Gulf countries may increase investment in Pakistan, particularly as lower oil prices drive them to diversify their portfolios.\n\nForeign exchange reserves\n\nThe SBP’s foreign exchange reserves declined by $127m during the week ending April 11, primarily due to external debt repayments. The reserves now stand at $10.57bn, the lowest level since mid-September.\n\nThe country’s total reserves, including those held by commercial banks, are now $15.66bn. The reserves are expected to rise following a forthcoming disbursement of around $1bn from the International Monetary Fund.\n\nPM hails surplus\n\nPrime Minister Shehbaz Sharif has also expressed satisfaction over the current account surplus of $1.2 billion in March 2025, the highest in history.\n\nIn a statement, the prime minister said the surplus current account surplus was a “reflection of a stabilising economy”.\n\n“…[T]he current account surplus was $1.85 billion in the first 9 months of this fiscal year,” he said.\n\nThe prime minister attributed the current account surplus to rec­ord remittances, increasing exp­orts and the “tireless efforts” of the government’s economic team.\n\n“We are striving for the sustainable development of the country.”\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:36:09.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904945/record-12bn-surplus-in-march",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:27.000Z"
}
