{
  "title": "Record March surplus fuels rally on PSX - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite overnight concerns regarding a contraction in Large-Scale Manufacturing and decreasing foreign exchange reserves, the Pakistan Stock Exchange (PSX) experienced renewed buying interest from equity investors on Thursday. This boost in confidence was driven by a record current account surplus and a series of positive developments, enhancing the overall economic outlook.\n\nAhsan Mehanti of Arif Habib Corporation said the market showed a sharp recovery amid a $1.2bn record current account surplus in March and a first-ever two-year extension in an oil credit facility from Kuwait, which would ease rupee instability and attract foreign inflows.\n\nHe added that the rating upgrade from Fitch, surging Asian equities and crude oil prices, record remittances and low inflation were other key factors that contributed to the bullish close at the PSX.\n\nTopline Securities Ltd said the benchmark KSE-100 index recovered 881 points or 0.76pc to close at 116,901.13. Investor sentiment was buoyed by record-high remittances, contributing to a historic current account surplus in March. The surplus for the first nine months of FY25 reached $1.9bn.\n\nAdditionally, the rally in cement stocks was fuelled by a Rs25 per bag increase in cement prices, further supporting the market’s upward momentum.\n\nIndex performance was primarily driven by heavyweight stocks, including United Bank, PSO, National Bank, Mari Energies, and Maple Leaf Cement, which collectively contributed 515 points, underscoring their pivotal role in sustaining market momentum.\n\nAli Najib, Head of Sales at Insight Securities, said the all-time high monthly current account surplus reflects improving external balances, strengthening reserves, easing currency pressure, and signalling sustained macroeconomic stability in 9MFY25.\n\nHowever, the market participation remained slow as the trading volume decreased by 15.3pc to 408.06 million shares while the traded value fell by 16.63pc to Rs32.12bn day-on-day.\n\nStocks contributing significantly to the traded volume included Maple Leaf Cement (23.79m shares), The Bank of Punjab (23.32m shares), Cnergyico PK (17.94m shares), Fauji Cement (16.94m shares) and National Bank (16.60m shares).\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68018fd3f3694.gif",
  "retrievedAt": "2025-08-25T14:25:00.348Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904923/record-march-surplus-fuels-rally-on-psx",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T01:18:47.000Z"
}
