{
  "title": "Wazirabad workers ‘denied’ salaries ahead of Easter - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRANWALA: More than 110 Christian sanitation workers employed under the “Suthra Punjab” initiative in Wazirabad were allegedly denied their salaries during the Easter holiday, triggering protests and raising serious concerns about ‘exploitation’ by a private waste management company contracted by local authorities.\n\nAccording to protesting workers, the company provided only partial payments ranging from Rs8,000 to Rs12,000, rather than full monthly wages, even as they continued their duties during the Easter holiday - a major religious festival for the Christian community.\n\nThe affected employees claim they are not formally on the municipal payroll and are thus at the mercy of the private contractor managing sanitation operations under the provincial cleanliness campaign.\n\nMeanwhile, another group of workers from Sindh, also deployed by the company, staged a protest by lying down on roads in response to withheld salaries. A video of a company official allegedly attempting to run over a protester with a vehicle went viral on social media, intensifying public outrage.\n\nCompany spox says employees to be paid before festival\n\nSources indicate that around 40 workers who are officially employed by the Municipal Committee Wazirabad did receive their salaries on time. However, those working directly under the contractor have not been paid in full.\n\nWorkers told journalists that exploitation has become a routine under the new waste management set-up and that their grievances are being consistently ignored.\n\nSanitation services have been disrupted in various neighbourhoods due to the protests, leaving garbage to pile up across the city and creating unsanitary conditions. The situation, locals say, is a slap in the face to the much-promoted “Suthra Punjab” campaign.\n\nCompany officials, however, deny the allegations. A representative claimed that all employees would be paid in full before Easter and dismissed reports of Rs14 million in outstanding dues to the Sindhi contractor as baseless.\n\nCivic and business communities have called on Chief Minister Maryam Nawaz to take immediate notice of the situation and initiate strict action against those responsible for the workers’ mistreatment and the breakdown of municipal services.\n\nPublished in Dawn, April 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2018/04/5ac0f3d53a953.jpg?r=1458390608",
  "retrievedAt": "2025-08-25T14:24:47.037Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904978/wazirabad-workers-denied-salaries-ahead-of-easter",
  "dateList": "2025-04-18",
  "date_published": "2025-04-18T03:10:58.000Z"
}
