{
  "title": "Government taking steps to strengthen national economy: Attaullah Tarar",
  "link": "https://www.app.com.pk/national/government-taking-steps-to-strengthen-national-economy-attaullah-tarar/",
  "date_published": "2024-04-06T11:34:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 06 (APP): Federal Information Minister Attaullah Tarar said on Saturday that the incumbent government was taking all possible measures to strengthen the national economy and the economy and the industry both were showing positive signs.\nIn a press conference at the PML-N’s Secretariat here he that Bloomberg stated it clearly that Prime Minister Shehbaz Sharif had a good experience of talking to financial institutions and bringing economic reforms.\n“The previous 16- month government saved the country from default and helped stablize the Pakistani rupee and even during the tenure of the interim government the rupee remained stable.\nThe stability of the rupee helped stabilize the country’s economy and positive news were coming with regard to the stock exchange as well,” he maintained. He said all these positive indicators were showing that business confidence had increased in the country. He said it was very unfortunate that anti-state elements which could not digest the country’s progress were stuck to their negative agenda. “Chinese engineers were attacked in Dasu and Prime Minister Shehbaz Sharif visited Dasu and met Chinese engineers and expressed grief over the incident besides offering condolences,” he added.\nHe said that Minister for Overseas Pakistanis and Human Resource Development Chaudhry Salik Hussain went to Wuhan, China, on a special flight that carried mortal remains of five Chinese personnel, who had died in the terror attack and expressed condolences with the Chinese government and officials.\nHe said that the PML-N government had always given importance to Pak-China friendship. He said, “After the incident, the Prime Minister Shehbaz Sharif visited the Chinese Embassy and met the Chinese Ambassador. The premier also visited Dasu to boost the morale of the Chinese engineers and give a message that Pakistan gives high importance to its friendship with China.”\nAttaullah Tarar said that the Prime Minister had presided over many meetings on Chinese security and an committee was formed for an inquiry into the Dasu incident as Chinese. He said that Prime Minister Shehbaz Sharif had ordered action against RPO Hazara division, DPO Upper Kohsitan district, DPO Lower Kohistan district, Dasu Hydropower Project Security Director and  KP Special Security Unit Commandant in fifteen days.\nThe information minister that the quick action was a proof that no compromise would be tolerated on the security of the Chinese in future. He further said that Prime Minister Shehbaz Sharif was personally supervising security matters pertaining to Chinese projects and the Chinese and an effective system was being evolved in this regard.\nHe said, “We pay homage to all those who sacrificed their lives in war against terrorism.”\nHe said that the Pak armed forces and law enforcement agencies of the country were determined to root out terrorism and would not allow anybody to harm the country’s peace. Regarding a Guardian report on extrajudicial killings by India in different countries, Attaullah Tarar said that today the Foreign Office had also issued a statement in which not only rejected the statement of the Indian defence minister but condemned it.\nHe said that the international community should also take notice of the extrajudicial killings.\nHe said, “Pakistan is fully alert and capable of defending itself but we want peace in the region.” He said yesterday he had visited Karachi and met journalist organizations including PBA, APNS, CPNE and problems facing the media industry were also discussed. Problems of journalists and media workers had been highlighted and pending dues of media workers and reporters would be paid prior to Eid-ul-Fitr, he added.\nHe said an all-out effort would be made to ensure payment of pending dues in the next two days as per the direction of Prime Minister Shehbaz Sharif, adding that all approvals in this regard had been completed.\nHe further said, “Today we would leave for a visit to Saudia Arabia along with Prime Minister Shehbaz Sharif. The delegation visiting Saudi Arabia consisted of the family members of the primer besides members of the cabinet. The delegation would leave for Saudi Arabia on a commercial flight and all members of the delegation would bear their expenses and no burden would be put on the government kitty.”\nHe said that the delegation besides him included Finance Minister Muhammad Aurangzeb, Foreign Minister Ishaq Dar, Minister for Economics Affairs Ahad Khan Cheema.\nHe hoped that positive news related to this visit would come, adding that besides performing Umrah, special meetings were also expected.\nHe said being Information Minister he would keep the Pakistan media updated about the developments taking place there.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:45:28.553Z"
}
