{
  "title": "BJP regime continues to usurp all rights including religious freedom in IIOJK: APHC",
  "link": "https://www.app.com.pk/national/bjp-regime-continues-to-usurp-all-rights-including-religious-freedom-in-iiojk-aphc/",
  "date_published": "2024-04-06T11:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP): The All Parties Hurriyat Conference (APHC) has strongly condemned the occupation authorities for disallowing Jumatul Wida prayers at the historic Jamia Masjid in Srinagar, saying the Kashmiri Muslims have been deprived of all freedoms including religious freedom in Indian Illegally occupied Jammu and Kashmir.\nAccording to Kashmir Media Service, the APHC spokesman Advocate Abdul Rashid Minhas in a statement in Srinagar said that barring Kashmiri people from offering Jumatul Wida prayers at Srinagar’s historic Jamia Masjid, imposition of enforced lockdowns on Jamia Masjid and house arrest of Mirwaiz by the BJP regime were brazen violations of religious and other basic rights of the people of the territory.\nThe statement said curtailment of religious freedom of Kashmiri Muslims is yet another illustration of Hidnutva BJP/RSS regime’s ongoing assault on religious freedoms which constitute serious violation of applicable international human rights law.\nHe lamented that the Jamia Masjid has been subjected to regular bans & lockdowns by Indian authorities in the last over 3 decades, adding not allowing congregational prayers at the grand mosque represent deep-rooted prejudice on the part of Indian authorities for Muslim sentiments in IIOJK.\nReferring to the recent killing of two innocent youth by the Indian troops in Uri area of Baramulla, the APHC spokesman said the Modi regime has intensified the genocide of Kashmiris after abrogating the special status of IIOJK. However, he maintained, the Kashmiris are determined to resist Hindutva regime’s nefarious plans meant to snatch away their rights, identity and homeland.\nThe APHC urged UN and other world peace and freedom loving countries to hold India accountable for its suppression of religious rights & other freedoms of the people in IIOJK.",
  "retrievedAt": "2025-08-11T01:45:06.679Z"
}
