{
  "title": "Crown Prince Abu Dhabi Sheikh Khaled to arrive Pakistan on Thursday",
  "author": null,
  "content": "ISLAMABAD, Feb 26 (APP): At the invitation of Prime Minister Muhammad Shehbaz Sharif, Crown Prince of Abu Dhabi, Sheikh Khaled bin Mohamed bin Zayed Al Nahyan, on Thursday will arrive here on his first official visit to Pakistan.\n“He will be accompanied by a high-level delegation, including Ministers and senior officials, as well as prominent business leaders. This visit underscores the deep-rooted fraternal ties between Pakistan and the United Arab Emirates (UAE) and reflects the shared commitment to further strengthen bilateral economic partnership,” Foreign Office Spokesperson said in a press statement on Wednesday.\nDuring the visit, the crown prince will engage in wide-ranging interactions with the leadership of Pakistan, to exchange views on matters of mutual interest, reinforce historical bonds and promote economic as well as investment cooperation.\nSeveral agreements and Memorandums of Understandings will be signed during the visit to bolster existing robust framework for long-term collaboration in multifaceted sectors.\nThese commitments are expected to open new opportunities for joint ventures and projects aimed at furthering economic cooperation between both the countries and their peoples.\n“Pakistan and the UAE have always enjoyed a relationship characterized by mutual respect, trust, and shared aspirations. The visit of Crown Prince Sheikh Khaled bin Mohamed bin Zayed Al Nahyan demonstrates commitment of two countries to elevate the mutual cooperation, reflective of growing partnership and robust people to people linkages,” it was further added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:08:32.139Z",
  "source": "APP",
  "link": "https://www.app.com.pk/global/crown-prince-abu-dhabi-sheikh-khaled-to-arrive-pakistan-on-thursday/",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T14:14:00.000Z"
}
