{
  "title": "Khalid Maqbool Siddiqui inaugurates AIOU’s newly developed ‘Exam Management System’",
  "author": null,
  "content": "ISLAMABAD, Feb 26 (APP):Federal Minister for Education and Professional Training, Khalid Maqbool Siddiqui, inaugurated the newly developed ‘Exam Management System (EMS)’ of Allama Iqbal Open University (AIOU).\nSpeaking at the occasion, he stated that aligning the examination system with the demands of the modern era is a commendable initiative by Allama Iqbal Open University, for which the Vice Chancellor, Professor Dr. Nasir Mahmood, and his team deserve appreciation.\nThe Education Minister said that the world is changing, and Allama Iqbal Open University has embraced modern requirements by integrating technology into education.\nHe expressed his desire for collaboration between Allama Iqbal Open University and Virtual University to train the new generation in IT, producing experts needed globally.\n“Transparency in the examination system will bring changes in various sectors of life, and we welcome this step towards transparency taken by Allama Iqbal Open University,” he added.\nVice-Chancellor AIOU, Prof. Dr. Nasir Mahmood in his speech, stated that digitizing the examination system was a necessity of the time, which will enhance security, accuracy, and overall transparency in the examination process.\nHe mentioned that the journey towards reforming the examination system began in 2018 and has now been successfully completed. As a result of this initiative, the university is no longer dependent on external institutions.\nDr. Nasir further emphasized that incorporating technology into the management of exams will now lead to savings in both time and resources.\nController of Examinations, Mian Muhammad Riaz, highlighted that the university conducts exams for approximately 500,000 students each semester across 1,200 different courses, setting up more than 500 examination centers from Skardu to Gwadar.\nAfter the exams, nearly 2 million answer scripts were received from these centers, consuming significant time and university resources. With the new system, both time and resources will be saved, and the overall examination process will become more transparent.\nDeputy Controller of Examinations, Syed Faheem Hussain Shah, provided a detailed overview of the Exam Management System, while Deputy Controller of Examinations, Huda Javed, performed the duties of stage secretary.\nThe event was attended by the university’s four deans, professors, principal officers, and a large number of students, while regional directors participated online.\nIt is worth mentioning that Allama Iqbal Open University developed the Exam Management System in collaboration with Pakistan Post Foundation. The Managing Director of Pakistan Post Foundation, Abdul Razzaq, was also present at the ceremony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:09:46.696Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/khalid-maqbool-siddiqui-inaugurates-aious-newly-developed-exam-management-system/",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T10:47:00.000Z"
}
