{
  "title": "Pakistan, Uzbekistan pledge to enhance regional connectivity, bilateral cooperation",
  "author": null,
  "content": "ISLAMABAD, Feb 26 (APP): Prime Minister Muhammad Shehbaz Sharif and Uzbek President Shavkat Mirziyoyev on Wednesday agreed on enhancing regional connectivity and strengthening bilateral cooperation particularly in trade, tourism, energy, and cultural relations.\nPrime Minister Muhammad Shehbaz Sharif and President of Uzbekistan Shavkat Mirziyoyev held a bilateral meeting in Tashkent. The prime minister is on a two-day official visit to Uzbekistan, PM Office Media Wing said in a press release.\nDuring the meeting, both leaders discussed enhancing the mutual cooperation expressed their satisfaction over the progress achieved about bilateral cooperation during the last 33 years of diplomatic relations between Pakistan and Uzbekistan.\nThe two leaders agreed to increase bilateral trade volume to $2 billion within the next four years, to ensure the effective implementation of the Transit Trade Agreement (2021) and the Preferential Trade Agreement (2023), promote investment in the special economic zones of both countries and foster collaboration between the business communities of Pakistan and Uzbekistan.\nBoth leaders also acknowledged the strategic importance of the Uzbekistan-Afghanistan-Pakistan railway project for promoting regional trade and connectivity and reaffirmed their commitment to its implementation.\nBoth sides also discussed enhancing tourism between Pakistan and Uzbekistan, particularly focusing on cooperation between Termez, Bukhara and Lahore, Karachi.\nThey expressed their shared views on the global and regional issues, and both leaders emphasized the role of international organizations, particularly of the United Nations in promoting sustainable development and achieving global peace and security.\nPrime Minister Shehbaz Sharif underscored the need to further strengthen the historical and cultural ties between Pakistan and Uzbekistan and emphasized the importance of opening new vistas for trade and economic cooperation.\nHe also reiterated Pakistan’s commitment to joint initiatives in respect of regional connectivity.\nThe prime minister described the strong partnership between Pakistan and Uzbekistan as beneficial not only for both nations but also for the overall development and prosperity of the region.\nUzbek President Shavkat Mirziyoyev expressed his desire to deepen relations with Pakistan and highlighted the significance of mutual cooperation between the two countries for the regional stability and development.\nHe also praised the government of Pakistan for its efforts towards economic stability and the national progress and reaffirmed Uzbekistan’s commitment to taking trade and economic partnership with Pakistan to new heights.\nFollowing the meeting between the two leaders, high-level talks were held between the delegations of both countries.\nThe Pakistani delegation included Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Minister for Commerce Jam Kamal Khan, Minister for Investment and Privatization Abdul Aleem Khan, Minister for Information and Broadcasting Attaullah Tarar and Special Assistant Tariq Fatemi.\nDuring the meeting, the delegations had a detailed discussion on the potential for strengthening cooperation in trade, tourism, energy, education, culture, regional connectivity, and defense.\nBoth sides also emphasized upon taking of practical steps to achieve the shared objectives of mutual interest.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:09:08.862Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-uzbekistan-pledge-to-enhance-regional-connectivity-bilateral-cooperation-2/",
  "dateList": "2025-02-26",
  "date_published": "2025-02-26T11:54:00.000Z"
}
