{
  "title": "PR spends Rs.1862 M for rehabilitation of track between Kotri-Khanpur",
  "link": "https://www.app.com.pk/national/pr-spends-rs-1862-m-for-rehabilitation-of-track-between-kotri-khanpur-2/",
  "date_published": "2023-09-07T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP): Pakistan Railways is spending Rs. 1862.84 million for the rehabilitation of 518 kilometers of track between Kotri-Khanpur under the project of Immediate Track Safety Works (ITSW-I).\nDespite financial constraints, the management of Pakistan Railways is putting maximum effort into improving infrastructure including tracks, bridges, and stations, an official in the Ministry of Railways told APP.\nUnder the project of rehabilitation of Karachi Port tracks, 24-kilometre tracks, 17 level crossings, and seven bridges have been rehabilitated, along with the replacement of turnouts.\nThe official said that Railway Dry Ports at Lahore (Mughalpura), Badami Bagh, and Azakhel have been upgraded.\nHe said under the Immediate Track Safety Works (ITS W-II & IMTS W-III), the railway track between Tando Adam-Khanpur covering 456 kilometers would be rehabilitated at a cost of Rs. 4830.437 million and Rs.4875.461 million, respectively, by replacing the US components of the track and ensuring the safety of train operation.\nA PC-I amounting to Rs.4930.22 million for the rehabilitation of track machinery has been approved, which would ensure the quality of track maintenance work.\nMeanwhile, 11 stations have been upgraded, including Peshawar, Hassan Abdal, Rawalpindi, Gujranwala, Lahore, Narowal, Nankana Sahib, Raiwind, Okara, Sahiwal, and Bahawalpur, under PSDP projects.\nThe project of up-gradation of Main Line-I at a cost of $6.683 billion has been negotiated with the Chinese side for completing the ML-1 in two phases consisting of four packages, he added.\nThe assets of Pakistan Railways are mainly related to the track (11881 kilometers), and rolling stock (15699), and most of these assets have lived their useful life.\nTherefore, he said the department has taken several measures for efficient maintenance of these assets, which include an increase in fiscal space for maintenance through the transfer of pensions, reduced utility bills through solarization, improved procurement management through prioritized procurement, and an efficient fuel management system.\nHe said the department is gradually shifting from a manual to a mechanized track maintenance regime for enhanced productivity and quality, while improved governance of the maintenance system through the introduction of IT-related interventions (ERP) and the provision of professional human resources was also among the top priorities.\nRegional Connectivity is an important aspect of the Pakistan Railway development framework. Presently, Pakistan Railway has planned to improve its functional links with regional countries, including India and Iran, he added.\nFurthermore, the official said the following new rail links would be established, including the Uzbekistan-Afghanistan-Pakistan (UAP) Railway Connectivity Project through Kohat-Kharlachi.",
  "retrievedAt": "2025-08-11T09:30:31.235Z"
}
