{
  "title": "7th Sept, a historic day for preservation of Prophethood: Haqqani",
  "link": "https://www.app.com.pk/national/7th-sept-a-historic-day-for-preservation-of-prophethood-haqqani/",
  "date_published": "2023-09-07T13:21:00.000Z",
  "source": "APP",
  "content": "AKORA KHATTAK, September 7 (APP):Jamiat Ulema-e-Islam (Sami) Chief Maulana Hamid ul Haq Haqqani on Thursday emphasized that 7th September held immense historical significance for Pakistan, Islam, and the preservation of Prophethood.\nAddressing a gathering of thousands at the sprawling Darul Hadith of Darul Uloom Haqqania in Akora Khattak, he said, “On this day, we receive a gift from our national leadership to commemorate this historic day. Among those who have contributed to the defense of the nation alongside the preservation of Prophethood are our respected elders, including Sheikh-ul-Hadith Maulana Abdul Haq, and revered father of the nation, Shaheed Namoos-e-Risalat, Sheikh-ul-Hadith Maulana Sami ul Haq, Shaheed Maulana Mahmood, Hazrat Maulana Shah Ahmed Noorani, Professor Ghafoor, Maulana Ghulam Ghaus Hazarvi, and Sheikh-ul-Hadith Maulana Taqi Usmani, as well as the then Prime Minister Zulfikar Ali Bhutto and other members of the National Assembly.”\nMaulana Haqqani who is also the Deputy Caretaker of Darul Uloom Haqqania said the entire nation was engaged in prayerful ceremonies to honor the founder of Darul Uloom Haqqania Sheikh-ul-Hadith Maulana Abdul Haq as “today is also the death anniversary of Sheikh-ul-Hadith Maulana Abdul Haq.”\nHe said this day stood as a testament to our commitment to defending the nation and safeguarding the doctrine of Prophethood.\nHe said my father, Shaheed Maulana Sami ul Haq, and Maulana Taqi Usmani, under the guidance of Sheikh-ul-Hadith Maulana Abdul Haq, dedicated forty-one hours to prepare the book “Qadianiat aur Millat-e-Islamiya ka Mauqif” with compelling evidence for the National Assembly.\nHe said this very book was presented and read aloud in the National Assembly by the Attorney General of Pakistan.\nMaulana Haqqani said leaders such as Maulana Mahmood, Sheikh-ul-Hadith Maulana Abdul Haq, raised their powerful voices in the National Assembly, and it was on their foundation that Qadianis were declared non-Muslims, which is still a part of our Constitution.\n“Qadianis are traitors to our Constitution who have not accepted it to this day, and our rulers continue to grant them privileges, which is a moment of reflection,” he added.\nHe appealed to all educational institutions, mosques, and religious centers across Pakistan, especially the Jamiat Ulema-e-Islam Pakistan, to remember these great leaders in their prayers as their tireless efforts converted the Qadiani Fitna into a minority.\nMaulana Haqqani emphasized the need to eradicate sectarianism and prejudice within the Islamic world. He called upon everyone to unite the Muslim community and promote the message of Dawa and Tabligh worldwide. Through this, the Muslim Ummah and Pakistan could become stronger, he maintained.\nThe ceremony was attended by prominent scholars and religious leaders, including Hafiz Shaukat Ali, Maulana Irfan ul Haq, Maulana Luqman ul Haq, Maulana Osama Sami, and many other esteemed teachers and scholars.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:30:46.655Z"
}
