{
  "title": "Gohar boosts bilateral ties with Brazil at National Day Celebrations",
  "link": "https://www.app.com.pk/national/gohar-boosts-bilateral-ties-with-brazil-at-national-day-celebrations/",
  "date_published": "2023-09-07T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 07 (APP): Caretaker Federal Minister for Commerce and Industries and Production Dr. Gohar Ejaz Thursday greeted the 201st Brazilian National Day celebrations as a chief guest expressing solidarity and conveying warm wishes to Brazil.\nDr. Ejaz highlighted Brazil’s remarkable economic progress, calling it a global role model and a source of inspiration for Pakistan.\nHe mentioned that bilateral ties have strengthened as evidenced by Brazil’s active participation in TEXPO-2023 and Food-Agri 2023 exhibitions held in Karachi in May and August 2023.\nThese visits, organized by the Trade Development Authority of Pakistan, included exploration of local industries, leading to the signing of several Memorandum  of Understanding (MOUs).\nEmphasizing the potential for boosting trade in auto parts and IT sectors, the minister underscored Pakistan’s appeal as an investment destination with a sizable consumer market, open to investment across various sectors with attractive incentives.\nDr. Ejaz extended an invitation to Brazil’s public and private sectors to invest in areas of mutual interest, particularly agriculture, highlighting the prospect of sustainable agriculture practices and renewable energy solutions.\nDespite the geographical distance, he urged both nations to improve transportation and logistics infrastructure, such as maritime routes, air connectivity, and Customs procedures, to facilitate cross-border commerce.\nAdditionally, the minister advocated for increased business-to-business interactions and cooperation in agriculture, energy, and technology sectors.\nHe also highlighted the Special Investment Facilitation Council (SIFC), which aims to allocate 10 million acres of barren land to the corporate sector for an agricultural revolution.\nDr. Ejaz emphasized the potential of collaborative research and development efforts, aiming to benefit both nations and contribute to the global economy.\nHe reaffirmed Pakistan’s commitment to strengthening bilateral relations and fostering prosperity.\nBrazilian Ambassador to Pakistan, Olyntho Vieira expressed his willingness to work together in discovering new avenues for bilateral trade and cooperation to bring both nations closer in a larger aspect.\nParticipants among others of different missions were present to grace the event.",
  "retrievedAt": "2025-08-11T09:30:56.622Z"
}
