{
  "title": "Foreign students gain insight into modern IT technology and embrace the 5.5G era",
  "link": "https://www.app.com.pk/national/foreign-students-gain-insight-into-modern-it-technology-and-embrace-the-5-5g-era/",
  "date_published": "2023-09-07T10:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP):Esteemed students hailing from universities across the Middle East and Central Asia actively engaged in enlightening discussions centered around the applications of modern IT technology and the integration of 5.5G technology during the roundtable session as part of Huawei’s Seed for the Future Program 2023.\nThe roundtable, titled “Embracing the 5.5G World: Unleashing Innovative & Sustainable Growth in the MECA Region,” delved into ensuring the secure and extensive deployment of 5.5G technology. Furthermore, the students received valuable guidance on theme selection for the Seed for the Future Program 2023 competition.\nDistinguished speakers, including Mr. Ramy Boctor, CTO of Vodafone Qatar, Jawad Abbassi, Head of MENA at GSMA; Eng. Dalal Al Ishaq, Infrastructure and Access Section Head at the Communications Regulatory Authority, and Kamal Zain, CSO at Huawei GN discussed the diverse benefits of 5.5G technology and its applications across various industries, with a particular focus on its relevance in the energy sector and other sectors.\nThe speakers emphasized that embracing the latest technologies and evolving into the 5.5G era were essential steps to ensure that our infrastructure could cater to the demands of a more immersive experience and unlock the potential for sustainable digital economic growth.\nThey emphasized 5.5G as a crucial connectivity technology with the capacity to provide substantial benefits in the realms of social, industrial, economic, and sustainability. They underscored the significance of perpetually advancing connectivity infrastructure, embracing cutting-edge technologies within the 5.5G era, and integrating sensing communication. This progression toward the 5.5G era was imperative for meeting the demands of enhanced digital experiences and unlocking the potential for sustainable economic growth.\nThe speakers emphasized that 5.5G represents a pivotal milestone on our path to an intelligent world. By fostering collective efforts to define and refine industry standards within the 5.5G era, the ICT industry could propel itself swiftly toward achieving this vision of an intelligent world.\nSubsequently, students were divided into groups and participated in programs titled ‘Leadership Workshop’ and ‘Tech4Good Kick Off/Select a Theme.’ Guided by moderators Belle, Mehdi, Salam, and Nats, the students selected themes and formed teams to devise innovative technological solutions for social or environmental issues.\nParticipating students would present their Tech4Good projects to judges, who would account for 80% of the final marks, while moderators would contribute 20%.\nNine ambitious Pakistani students from prestigious institutions, including NED University of Engineering and Technology, Balochistan University of Information Technology, Engineering and Management Sciences (BUITEMS), the University of Azad Jammu & Kashmir, Mehran University of Engineering and Technology (MUET), Karakoram International University (KIU), COMSATS University Islamabad (CUI), Institute of Management Sciences (IMSciences), and The National University of Sciences & Technology (NUST), were also in attendance. They, along with their respective teams, actively participated in the sessions towards collectively selecting a theme.\nEight exceptional teams comprising 40 students would advance to the second phase of the Tech4Good program, scheduled to take place in Dubai, UAE, from September 10 to 16, 2023.\nThe winners of this phase would earn the opportunity to compete in the final global competition in China, where they would face teams from around the world.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:30:50.164Z"
}
