{
  "title": "AIOU to celebrate Golden Jubilee in 2024",
  "link": "https://www.app.com.pk/national/aiou-to-celebrate-golden-jubilee-in-2024/",
  "date_published": "2023-09-07T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 07 (APP): Vice Chancellor of Allama Iqbal Open University (AIOU), Prof. Dr. Nasir Mahmood on Thursday said that the university would celebrate its Golden Jubilee in 2024.\nIt was decided during a meeting in which discussed plans for the Golden Jubilee celebrations of the university, said a news release.\nAs AIOU will mark its 50th anniversary next year, he instructed the Deans, Professors and Principal Officers to ensure the participation of students in the celebrations.\nVarious committees have been formed by the university administration to finalize preparations for the event.\nThese committees will be responsible for highlighting the historical context of the university, setting up a history corner, and organizing alumni associations, conferences, seminars, and convocations in the main campus and provincial capitals.\nAll committees have started working with full enthusiasm to celebrate the 50 years of AIOU.\nIt is pertinent to mention here that the university began its journey in 1974 with basic courses.\nSubsequently, intermediate and BA level programs were introduced, followed by MA and MSc level programs in the 1990s and then MPhil and PhD level programs.\nToday, AIOU stands as the largest university in the country in terms of student enrollment and has largely achieved its founding objectives.\nAs of June 2023, more than 46 lakh students have graduated from AIOU.\nIt is worth mentioning that this university started from a rented house and now operates 54 regional offices in different cities across the country.\nSince its establishment, the university has made significant progress in various fields, which is why it has decided to celebrate its Golden Jubilee on the completion of 50 years.",
  "retrievedAt": "2025-08-11T09:30:31.670Z"
}
