{
  "title": "Devcom-Pakistan launches ‘Mansoor Rahi Cubism Award’ in memory of legendary artist",
  "link": "https://www.app.com.pk/national/devcom-pakistan-launches-masoor-rahi-cubism-award-in-memory-of-legendary-artist/",
  "date_published": "2024-06-22T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP): A celebrated Cubist artist from Pakistan Mansoor Rahi whose recent passing left an indelible mark on the global art landscape, was honoured by his disciples of the Generation Rahi at a memorial event held here on Saturday.\nTo commemorate his legacy and contributions to the world of art, Devcom-Pakistan announced the launch of the Mansoor Rahi Cubism Award on the occasion, said a press release.\nAn open competition would be announced soon in collaboration with the Rahi General and other art galleries and organizations.\nSpeaking at the reference in memory of Mansoor Rahi, Devcom-Pakistan Executive Director Munir Ahmed said, Rahi was the only Pakistani artist widely recognized for his significant work in Cubism art, a genre that he not only mastered but also imparted to countless aspiring artists who became known collectively as the Generation Rahi. His influence extended far beyond Pakistan, influencing the international art community with his unique artistic vision and technique, he said.\nThe memorial event, attended by prominent figures from the art world, served as a tribute to Rahi’s life and career, highlighting his impact on contemporary art practices.\nDevcom-Pakistan, took the opportunity to announce the establishment of the Mansoor Rahi Cubism Award. This award aims to recognize and encourage excellence in Cubism in Pakistan, celebrating artists who demonstrate innovation, creativity, and a commitment to pushing artistic boundaries, much like Mansoor Rahi did throughout his illustrious career.\nAhmed said the Mansoor Rahi Cubism Award would be a symbol of honour and inspiration for artists dedicated to the Cubist tradition, fostering a spirit of creativity and innovation in the art community.\nHajra Mansoor appreciated the Generation Rahi for organizing the reference in memory of his late legendary artist husband, and also appreciated the announcement of the Mansoor Rahi Cubism Award by Devcom-Pakistan.\n“I am deeply touched and grateful for honoring my late husband, Mansoor Rahi. This award will not only celebrate his artistic legacy but also inspire future generations of artists. The launch of the Mansoor Rahi Cubism Award is a fitting tribute to Mansoor’s lifelong dedication to the art of Cubism.”\n“As Mansoor’s wife and lifelong supporter of his artistic journey, I am moved by the recognition bestowed upon him through this prestigious award. I believe it will encourage artists to explore and innovate within the Cubist tradition, just as Mansoor did. This award embodies Mansoor Rahi’s passion for artistic exploration and innovation.”\nOn behalf of our family, I extend my sincere gratitude to Devcom-Pakistan for creating the Mansoor Rahi Cubism Award. It is a testament to Mansoor’s enduring impact on the art world and a source of pride for all who admired his work, she said.\nNahida Raza, artist and organizer of the Reference, said the Generation Rahi will keep up the Mansoor Rahi’s tradition of promoting the art fraternity and the upcoming artists through various initiatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:23:39.109Z"
}
