{
  "title": "Balochistan accommodated all sectors, initiates flagship projects in budget 2024-25: Nosherwani",
  "link": "https://www.app.com.pk/national/balochistan-accommodated-all-sectors-initiates-flagship-projects-in-budget-2024-25-nosherwani/",
  "date_published": "2024-06-22T12:02:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 22 (APP): Balochistan Minister for Finance Mir Shoiab Nosherwani on Saturday said that the provincial government has presented a balanced budget, accommodated all sectors and initiated flagship projects to facilitate the poor masses of the province.\nAddressing a post-budget press conference here along with Minister for Planning and Development Mir Zahore Buledi, Spokesperson Balochistan Shahid Rind, he said that the government strived hard to satisfy the public and gave top priorities to health, education, climate change, law and order.\nShoaib Nosherwani said that the government has continued around 1500 pending schemes of public interest and the tendering process would kick off from the first week of the new financial year. He said with efforts of the Chief Minister Mir Sarfraz Bugti, the federal government has included 16 schemes of Balochistan in the federal public sector development program 2024-25.\nHe said that a huge part of provincial income consists of federal transfers and provincial receipts are the main part of their economic resources which include distributable pool and direct transfer as formula decided under NFC.\nHe said the total budget for the fiscal year is Rs 955.6 billion, in which the total share of federal transfer is Rs 726.6 billion and the total share of provincial revenues is Rs124.4 billion. The contribution of foreign project assistance is Rs 17.9 billion.\nThe minister said that the total expenditure estimated for the next financial year 2024-25 is Rs 930.2 billion, in which the total volume of current expenditure is Rs 564.8 billion and the capital expenditure is estimated at Rs 22.1 billion, while the total volume of the development budget is Rs 321 billion, in which the total of the provincial PSDP is Rs 219.5 billion.\nHe said apart from this, 28.2 billion rupees are expected in the form of Foreign Project Assistance (FPA) in the next financial year, while the share of Federal Development Projects (Outside PSDP) is 73.2 billion rupees.\nThe minister said that when the incumbent provincial government in view of economic challenges and financial difficulties, had reviewed the provincial development programme during the current fiscal year, which included 9788 schemes with a total proposed cost of Rs 229.3 billion, out of which 5068 new schemes and 4720 ongoing schemes were included.\nHe said that for the first time in the history of the province, their government has taken important steps through reforms in which a significant amount of funds has been allocated for the implementation of public services through the provincial non-developmental budget.\nHe said that due to financial pressure, the cost of the proposed provincial development projects has been reduced to Rs 125.9 billion.\nHowever, he said that the schemes which were important from the point of view of public services and public service delivery, continued to be implemented and 2172 important schemes have been completed during the current fiscal year 2023-24. In the next fiscal year 2024-25, the total size of the provincial PSDP will be Rs 219.5 billion, in which the number of ongoing schemes is 3976 and the number of new development schemes is 2704, he added.\nProvincial Minister Mir Zahore Buledi said that all sectors have been covered and equal projects have been included in the budget 2024-25 in view of the public demands.\nHe said the provincial government has presented Rs25 billion surplus budget prepared a comprehensive, balanced public sector development program and minimized the expenditures. He said in the PSDP 2024-25, 64 per cent amount has been allocated for on-going schemes and the remaining 36 percent allocation has been specified for new projects.\nHe said the government has increased the allocation of the Balochistan Educational Endowment Fund (BEEF) by Rs 2 billion and provided scholarships to 75000 students so far and Rs 2 billion has been allocated for out-of-school children.\nBuledi said that the government has allocated Rs 2.3 billion for the second phase of the green tractors scheme and Rs 10 billion for the green Balochistan initiative.\nSecretary Finance Babar Khan said that there are 319000 employees in Balochistan and the increase of salaries in budget 2024-25 would impact the provincial budget from Rs 27 billion to Rs 29 billion annually.\nHe said the government has created around 3000 new posts to minimize the financial impact.\nSpeaking on the occasion Spokesperson of the Balochistan government Shahid Rind said that the provincial government has allocated Rs1 billion for the expansion and launching of people’s bus service in Quetta and Turbat respectively.\nHe said the three major hospitals of Quetta would be made semi-autonomous, with the support of the Sindh government, and the Balochistan government would establish a GAMBAT model hospital for liver diseases in Naseerabad, similarly, an NICVD-style hospital for heart diseases would be updated in Quetta.\nShahid Rind said the provincial government has allocated a huge chunk of the budget for the establishment of Burn units in 14 districts and the launch of rescue 1122 operation in 10 districts of the province.\nHe said the chief minister has issued clear directions that the funds of the departments that show slowness in implementing projects would be converted to other departments in order to encourage the authorities concerned to complete the approved development projects on time.\nhe said that the Balochistan government has collected Rs 10 billion in revenue from the mining sector and the Balochistan Revenue Authority has collected Rs 32 billion so far.",
  "retrievedAt": "2025-08-11T03:23:18.493Z"
}
