{
  "title": "ECO countries’ including Pak’s carpet design displayed at Tehran carpets exhibition",
  "link": "https://www.app.com.pk/national/eco-countries-including-paks-carpet-design-displayed-at-tehran-carpets-exhibition/",
  "date_published": "2024-06-22T11:42:00.000Z",
  "source": "APP",
  "content": "Tehran, Jun 22 (APP): ECO member states displayed their carpet arts including Pakistani carpet designs during Economic Cooperation Organisation (ECO) regional exhibition of carpet arts held in Tehran.\nBesides the carpet exhibition, a parallel workshop on the art of old carpet restoration was also inaugurated on the occasion, said a press release received here from Tehran on Saturday.\nWhile inaugurating the carpet exhibition, President of Economic Cultural Institute (ECI) Tehran, Saad S Khan emphasised that carpet is the most ancient of regional art that is common across all the regional countries.\nMeanwhile, professors and scholars speaking on the occasion talked about the common heritage of carpet designs in Pakistan, Iran, Afghanistan, Turkmenistan and other regional countries that are members of the Economic Cooperation Organization (ECO) based in Tehran.\nTurkmenistan even holds Carpet Day each year as a national state holiday, Dr Saad said.\nThe scholars highlighted the cultural significance of carpets as a cultural symbol, carpets’ role in hospitality in traditional homes and the importance of carpet weaving as a form of livelihood. Experts explained various techniques for restoring old, worn out or torn carpets, up to a century old, which can be restored to appear as good as new.\nThe ceremony was followed by a widely attended exhibition at the ECI Art Gallery in Tehran of hand-made unique carpets from the countries of the region including Pakistan. There was a live demonstration of carpet restoration being done by artisans. Thousands of visitors from across ECO countries are expected to visit this year’s ongoing carpet exhibition.",
  "retrievedAt": "2025-08-11T03:23:18.276Z"
}
