{
  "title": "CDA Chairman arranges reception to acknowledge sanitary workers’ best performances on Eid-ul-Azha",
  "link": "https://www.app.com.pk/national/cda-chairman-arranges-reception-to-acknowledge-sanitary-workers-best-performances-on-eid-ul-azha/",
  "date_published": "2024-06-22T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP):Chairman CDA and Chief Commissioner Islamabad Mohammad Ali Randhawa on Saturday arranged a reception in honor of sanitary workers who served on Eid-ul-Azha on the instructions of Federal Interior Minister Mohsin Naqvi.\nHe announced  to pay one month basic salary as bonus to CDA workers who performed best sanitation duty during Eid holidays in Islamabad.\nOn the occasion of Eid-ul-Azha, the sanitary workers who made the Zero Waste City operation a success deserve to be congratulated and encouraged, said Interior Minister Mohsin Naqvi in his message.\nHe said that Islamabad got the honor of being the cleanest city due to the excellent communication and mutual cooperation of all the departments and the citizens including the employees and officers serving the city will be encouraged at all levels.\nChairman CDA Mohammad Ali Randhawa, IG Islamabad Police, Deputy Commissioner Islamabad and other officers attended the reception, a large number of sanitary workers served on Eid-ul-Azha also attended the reception.\nCDA sanitary workers are grateful to the Federal Home Minister for encouraging them by sitting with their officers for the first time, the workers expressed their joy.\nAddressing the reception, Muhammad Ali Randhawa said that all the officers and our heroes sanitary workers worked with zeal.\n“I salute our heroes for making the Islamabad Zero Waste City operation a success”, Chairman CDA Muhammad Ali Randhawa said.\n“May Allah honor us all and the name of Islamabad emerges as a unit”, Chairman CDA Muhammad Ali Randhawa said.\nHe said that for the first time, the Prime Minister of Pakistan congratulated everyone of you for your hard work.\nThe prestige of Islamabad has increased because of the sanitary workers, said CDA Chairman adding that the development work continued even during the days of Eid ul Azha, which has restored the confidence of the citizens in the institution.\nSetting up a control room at Safe City and introducing biodegradable bags helped make the operation a success, CDA Chairman said.\nDeputy Commissioner Islamabad Irfan Memon addressing the audience said that for the first time in the history of Islamabad, the services of sanitary workers were acknowledged at high level.\nChairman CDA and Chief Commissioner Islamabad deserve congratulations for bringing these unsung heroes of ours to the fore, IG Islamabad in his speech said.\nHe said that in order to keep the city clean, the workers did not bother day or night, nor did they see happy time with families as they were only engaged in work/service on Eid days.\n“I salute these workers and their wives on behalf of Islamabad Police”, said IG Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:23:44.071Z"
}
