{
  "article_id": "2025-03-30_093b9b65f0adffe5975bb434f1b52588",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/eid-travel-rush-ict-admin-cracks-down-on-bus-fare-overcharging/",
    "retrieved_at": "2025-08-27T14:07:50.961Z"
  },
  "metadata": {
    "title": "Eid travel rush: ICT admin cracks down on bus fare overcharging",
    "author": null,
    "date_published": "2025-03-30T11:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 284,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 30 (APP):As thousands flock to bus terminals in Islamabad to reunite with families for Eid, the Islamabad Capital Territory (ICT) administration is launching surprise inspections to curb fare overcharging. In this regard, special teams, led by the district administration, are monitoring terminals, verifying ticket prices with passengers, and penalizing transporters violating government-set rates. To ensure compliance with official fares, the Islamabad district administration has formed special squads to conduct unannounced visits at bus terminals. Teams, including magistrates and transport officials, are interacting directly with passengers to confirm fares and inspect tickets, said the spokesman of ICT administration. On the occasion, Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon stated, \"All buses must display fare charts on their windshields. Terminals caught overcharging will be shut down immediately.\" Four buses have already been suspended for violating rules. Meanwhile, DC Memon, alongside the Secretary of the Islamabad Transport Authority, personally visited the Faizabad terminal, questioning passengers about fares and tickets. \"We've deployed teams at all terminals since Friday to handle the Eid rush,\" Memon added. Officials have mandated that fare lists be visibly posted at terminals and inside buses. Transporters charging extra face fines, terminal closures, or legal action. Authorities urge travelers to report overcharging via a dedicated helpline. \"Complaints are being acted on immediately,\" said Memon. Terminals violating fare rules risk immediate sealing, and transporters may face detention. \"Eid in custody awaits those exploiting passengers,\" warned Memon. The crackdown aims to balance fare compliance with smooth travel during the holiday rush. DC Memon reiterated, \"Report overcharging instantly. Your input is critical to enforcing fairness.\" As Eid approaches, the administration remains on high alert to protect passengers from price gouging while ensuring timely reunions for families.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}