{
  "article_id": "2025-03-30_9148340ea390c998b3f04033ac76cc9a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-sharif-extends-eid-ul-fitr-greetings-to-crown-prince-of-kuwait/",
    "retrieved_at": "2025-08-27T14:07:45.147Z"
  },
  "metadata": {
    "title": "PM Shehbaz Sharif extends Eid-ul-Fitr greetings to Crown Prince of Kuwait",
    "author": null,
    "date_published": "2025-03-30T14:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 243,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Mar 30 (APP):Prime Minister Muhammad Shehbaz Sharif on Sunday held a telephone call with His Highness Sheikh Sabah Al-Khaled Al-Hamad Al-Mubarak Al-Sabah, Crown Prince of the State of Kuwait, and extended warm greetings and best wishes to the Crown Prince as well as to His Highness Sheikh Meshal Al-Ahmad Al-Jaber Al-Sabah, Amir of the State of Kuwait, and the brotherly people of Kuwait. Recalling the historical brotherly ties between the two countries, the Prime Minister reaffirmed Pakistan's desire to further strengthen its cordial relations with Kuwait for mutually rewarding cooperation. He fondly recalled his warm and productive meeting with the Crown Prince in New York last year on sidelines of the UN General Assembly's annual session. The Prime Minister emphasized the need upon to further enhance bilateral economic, investment and trade cooperation between the two countries through close collaboration and exploring joint initiatives. In this spirit, he extended a most cordial invitation to the Crown Prince to undertaken an official visit to Pakistan, at his earliest convenience. The invitation was most graciously accepted by the Crown Prince, who also said that his visit would be preceded by the visit of the Prime Minister of Kuwait to Pakistan. His Highness Sabah Al-Khaled Al-Hamad Al-Mubarak Al-Sabah warmly reciprocated Prime Minister's Eid greetings and conveyed best wishes for the people of Pakistan. He agreed upon the need to work closely together to further strengthen bilateral cooperation for mutual benefit and prosperity of the two countries.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}