{
  "title": "Islamabad gears up for Marka-e-Haq, Independence Day celebrations with citywide festivities, enhanced security",
  "author": null,
  "content": "ISLAMABAD, Jul 26 (APP):The Capital Development Authority (CDA), in collaboration with the Islamabad Administration and Metropolitan Corporation Islamabad (MCI), is making elaborate preparations to celebrate Marka-e-Haq and Pakistan’s Independence Day with patriotic zeal and grandeur.\nIn a high-level meeting chaired by Chairman CDA and Chief Commissioner Islamabad Muhammad Ali Randhawa, officials reviewed citywide arrangements to mark the occasion under the guidance of Federal Interior Minister Mohsin Naqvi. Senior officers from CDA, Director Generals, and board members were in attendance.\nThe meeting finalized plans for a comprehensive city beautification campaign that includes hoisting the national flag on all government buildings, illuminating major roads such as Constitution Avenue, Club Road, Srinagar Highway, and Jinnah Avenue, and decorating key areas with digital streamers and LED lights.\nSpeaking at the meeting, Chairman Randhawa said, “We are preparing to celebrate Marka-e-Haq and Independence Day in a dignified and spirited manner that reflects our national pride. This is a moment to honor our brave armed forces and show unity as a nation.”\nA wide range of public events is planned across Islamabad, including cultural shows, flag hoisting ceremonies, fireworks, and national song competitions. Special activities will be held for schoolchildren, such as debates, painting contests, and tableau performances.\nAll 279 parks in the capital will be decorated with lights, while football, cricket, and paddle courts will be restored and opened for public use. Public transport buses, including electric buses, will also carry Marka-e-Haq and Independence Day branding.\nRandhawa emphasized that efforts are also underway to improve the city’s overall environment by enhancing cleanliness, maintaining parks, repairing children’s swings, and managing traffic flow to ensure a smooth and enjoyable experience for residents.\nTo ensure safety during the festivities, the CDA, in coordination with Islamabad Police, will implement strict security measures. These include the installation of checkpoints at city entry and exit points, CCTV monitoring at sensitive locations, and deployment of special security teams.\n“The Marka-e-Haq is not just a tribute to our armed forces—it marks the beginning of a new era for our nation,” said Randhawa. “It is a symbol of unity and resilience, reminding us that Pakistanis are always ready to stand shoulder to shoulder with their defenders against any threat.”\nThe celebrations are expected to draw large public participation and reflect a collective expression of national solidarity in the wake of recent challenges.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:09:17.120Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/islamabad-gears-up-for-marka-e-haq-independence-day-celebrations-with-citywide-festivities-enhanced-security/",
  "dateList": "2025-07-26",
  "date_published": "2025-07-26T16:54:00.000Z"
}
