{
  "title": "PM strongly condemns Israeli blockade of aid to Palestinians in Gaza",
  "author": null,
  "content": "ISLAMABAD, Jul 26 (APP): Prime Minister Muhammad Shehbaz Sharif Saturday strongly condemned the Israeli blockade of aid to the Palestinians in Gaza resulting in food shortages.\nHe made the condemnation during a telephonic conversation with Ameer Jamaat-e-Islami Hafiz Naeem-ur-Rehman.\nBoth leaders expressed deep concern over the ongoing Israeli brutality against the defenceless Palestinians in Gaza.\nThe Prime Minister also strongly condemned the increasing inhuman Zionist atrocities in Gaza.\nHe said Pakistan will continue diplomatic efforts at all levels to end the Israeli blockade of aid to Gaza and restore the supply of food items to the Palestinian brothers and sisters, including children and women who are starving.\nPakistan will continue to provide diplomatic and moral support to the defenceless Palestinian brothers and sisters who are victims of Zionist oppression and barbarism, he stressed.\nPakistan, he added, will keep raising its voice against the inhuman atrocities being committed against its Palestinian brothers and sisters in Gaza at every forum of the world and before other nations.\nWhile the government of Pakistan continued to provide relief goods to the oppressed Palestinian brothers and sisters in Gaza through diplomatic channels, Al-Khidmat Foundation ensured the delivery of relief goods to Gaza by launching a nationwide campaign, he noted.\nThe Prime Minister appreciated the noble initiative and efforts of the Ameer of Jamaat-e-Islami and Al-Khidmat Foundation to send relief goods to the victims of Gaza.\nThe Ameer of Jamaat-e-Islami said that Palestinian leaders had contacted him and appealed to the Prime Minister of Pakistan to play a leading role in reaching ceasefire and providing food aid in Gaza.\n“The Palestinian people and the entire Islamic world have high hopes from Pakistan and its leadership,” he said adding the Prime Minister should make special contact with the international community, including Islamic countries, and play a leading role.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:08:55.199Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-strongly-condemns-israeli-blockade-of-aid-to-palestinians-in-gaza/",
  "dateList": "2025-07-26",
  "date_published": "2025-07-26T16:43:00.000Z"
}
