{
  "title": "FC to assist police in strengthening Muharram-ul-Harram security: IG",
  "link": "https://www.app.com.pk/national/fc-to-assist-police-in-strengthening-muharram-ul-harram-security-ig/",
  "date_published": "2024-07-03T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):The Inspector General Police (IGP) Islamabad reviewed various on going initiatives including the new recruitments, the welfare of police officers, the effective security arrangements for Muharram with the assistance of Frontier Constablery, and the security measures taken through Safe City, and issued orders to the officers.\nAccording to the details, Inspector General of Police (IGP) Islamabad Syed Ali Nasir Rizvi, chaired important meetings at the Central Police Office Islamabad.\nThe meetings were attended by DIG Headquarters Syed Mustafa Tanveer, DIG Security Muhammad Jawad Tariq, DG Safe City Malik Jamil Zafar, and other senior police officers.\nThe senior police officers briefed IG Islamabad on the new recruitment process and the welfare of police officers. IG Islamabad reviewed the implementation of measures taken for new recruitments and the welfare of police officers.\nHe also issued orders to complete the recruitment process with merit and transparency, to include educated youth in the police force, and to take further steps for the welfare of police officers.\nAdditionally, IG Islamabad chaired a meeting consisting of senior police officers to ensure effective security arrangements in the federal capital during Muharram-ul-Harram.\nHe reviewed the responsibilities of FC and the role of Safe City Islamabad for comprehensive security arrangements during Muharram-ul-Harram. FC will assist Islamabad Police in fulfilling its duties during Muharram, he added.\nIn the meeting, new targets were assigned to the IT and Technical teams regarding the installation of more cameras for better functionality of Safe City Islamabad during Muharram.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:39:38.110Z"
}
