{
  "title": "Promoting Chess game must for enhancing cognitive skills, critical thinking among youth: Romina",
  "link": "https://www.app.com.pk/national/promoting-chess-game-must-for-enhancing-cognitive-skills-critical-thinking-among-youth-romina/",
  "date_published": "2024-07-03T10:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):Coordinator to the Prime Minister Romina Khurshid Alam has said that chess is recognised globally for its benefits in enhancing cognitive skills and critical thinking among its players.\nHowever, encouraging chess at various levels including at educational levels can significantly help foster interest and participation among people of all ages to promote the game in the country.\nAddressing as a chief guest at the the Mian Sultan Khan National Chess Championship Pakistan event, the PM’s climate aide said, “Chess is a classic board game that’s been around for centuries and is played by millions of people worldwide.\nIt’s a game of strategy and tactics where two players, each controlling 16 pieces, compete to capture the opponent’s king.”\nThe event was organised here on Wednesday by the Headstart School Gulmohar Campus Islamabad to encourage students to develop their cognitive skills and critical thinking.\nRomina Khurshid Alam said that this championship, with over 140 participants from across Pakistan, is a vital platform for promoting chess and nurturing young talent.\nThe Prime Minister’s National Mind Sports Initiative, the largest of its kind, reflects our government’s commitment to fostering intellectual growth and mental agility, the PM’s coordinator highlighted.\n“Our government has opted whole of the government approach and we are integrating climate change awareness and sustainability through educational programs, sports, art on side and policies, planning, and climate finance on the other,” said Romina Khurshid Alam.\nRomina Khurshid Alam highlighted, “Chess is not only a game of skill and intellect but also a rich cultural phenomenon with a deep history and significant competitive scene.\nPlayers of all ages and skill levels enjoy its challenges and the opportunities it provides for creativity and strategic thinking.”\n“Chess also help players learn and make decisions based on evaluating multiple factors, such as the value of pieces, positional advantages, and potential threats and apply the same strategy to tackle problems in the day-to-day life.\nThis also improves decision-making skills under pressure,” the PM’s coordinator added.\nMs Khurshid Alam called for need to promote national the chess game by establishing more local chess clubs in the country, where players would meet regularly to play, learn, and compete. These clubs can offer structured tournaments, coaching sessions, and social gatherings centered around chess.\nBesides, Introducing chess into school curricula or after-school programs and setting up chess clubs in schools could also help students develop critical thinking, concentration, and social skills while fostering a love for the game, she added.\nEarlier, Shedding light on the legacy of Asia’s first Chess Grandmaster, PM’s coordinator Romina Khurshid said that Mian Sultan Khan was a pioneering figure in chess and represented the subcontinent globally in the early 20th century, inspiring players across Pakistan and Asia.\nThe Chess Federation of Pakistan’s efforts to secure the Grandmaster title for Mian Sultan Khan, up to early 2024, are commendable, she emphasised.\nThe PM’s coordinator urged all stakeholders to extend all-out support to promote chess and other mind sports in Pakistan, enhancing youth development and international representation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:40:12.401Z"
}
