{
  "title": "CUI, CERN to strengthen, expand collaboration",
  "link": "https://www.app.com.pk/national/cui-cern-to-strengthen-expand-collaboration/",
  "date_published": "2024-07-03T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 03 (APP):COMSATS University Islamabad (CUI) and European Organization for Nuclear Research (CERN) would strengthen and expand collaboration in the field of science and technology\nThis was discussed during an interaction of the CERN delegation and senior officials of CUI.\nHosted a two-member delegation of the European Organization for Nuclear Research (CERN) at its Islamabad Campus.\nThe two member delegation from CERN was comprised of Dr. Luciano Musa, Project Leader ALICE, (A Large Ion Collider Experiment) CERN, alongside Dr. Luca Malgeri, Senior Researcher.\nThey were joined by Dr. Zafar Yasin, Director CERN Secretariat, Pakistan Atomic Energy Commission (PAEC) and Dr. Altaf Ur Rahman, Director. CERN, Switzerland.\nIt was informed that since joining ALICE in 2008 and achieving full membership in 2012, COMSATS University Islamabad has been integral to advancing scientific research in collaboration with CERN.\nTo revive and expand this partnership, the university leadership recently formed a specialized CERN Liaison Group.\nHeading this initiative Dr. Tahir Naeem, Director Planning, Development, and Human Resource Development (P, D and HRD), CUI was designated as Focal Person to manage all collaborative efforts and future programs with CERN.\nDr. Hammad Omer, Head, CUI International Office, Dr. Muhammad Anis-ur-Rehman, Head Department of Physics, CUI, Dr. Uzma Tabassam, Associate Professor, Department of Physics, and Rubina Bhatti, Additional Director (P, D and HRD) were part of the CUI CERN Liaison Group.\nThe discussants focused on expanding collaboration across CUI’s seven campuses, embracing various disciplines beyond Physics, while exploring diverse avenues, like faculty fellowships, research partnerships, and financial support for visiting students, joint projects, and PhD supervision as well as plans for interdisciplinary collaborations.\nThe CERN officials expressed strong endorsement for CUI’s proposed initiatives and broadening collaborative efforts.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:39:44.249Z"
}
