{
  "title": "ICT admin gears up for monsoon with safety measures",
  "link": "https://www.app.com.pk/national/ict-admin-gears-up-for-monsoon-with-safety-measures/",
  "date_published": "2024-07-03T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 3 (APP):Deputy Commissioner (DC) Islamabad, Irfan Nawaz, chaired a high-level meeting to organize arrangements for the upcoming monsoon rains in the Federal Capital.\nThe meeting included representatives from the 111 Brigade, the sanitation wing, and related institutions to review the monsoon preparedness, according to the Islamabad Capital Territory (ICT) Administration spokesman.\nDuring the meeting, disaster management and related agencies provided a briefing on the activities planned for the pre-monsoon, rain, and potential urban flooding.\nThe meeting decided to clean the drains before the monsoon begins. This task would be carried out jointly in sectors, rural areas, and societies. Additionally, cleanliness in these areas would be ensured, and drainage equipment would be provided to the Union Councils.\nRescue camps will be set up in various areas, and operations will be conducted to remove encroachments on the drains. During the rain, low-lying areas and drains will be monitored closely.\nA fire brigade vehicle equipped with de-watering sets will be on standby. Inspections of housing societies will also be conducted during the rain. If the water level in Rawal Dam rises, the spillways will be opened. In case of rain or flooding, decisions will be made in coordination with the armed forces.\nThe monsoon preparations also include various activities to ensure safety and cleanliness. The pre-monsoon drain cleaning plan is almost complete, with work still ongoing in some areas.\nMachinery for cleaning the city is ready and has been delivered to rural and residential areas. Standard Operating Procedures (SOPs) will be implemented in case of heavy rainfall. During the rain, rescue teams equipped with de-watering sets will be in the field, ready to respond immediately to calls about standing water.\nLast year’s heavily affected areas are being monitored. Meetings with all relevant departments have marked such areas, particularly due to last year’s incident in the E-11 area.\nThe environmental wing of the Capital Development Authority (CDA) will be virtually present on the roads to take immediate action if a tree falls, the meeting decided.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:40:01.682Z"
}
