{
  "title": "Faisal Kundi asks Imran Khan to start election campaign instead of hiding",
  "link": "https://www.app.com.pk/national/faisal-kundi-asks-imran-khan-to-start-election-campaign-instead-of-hiding/",
  "date_published": "2023-01-27T10:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety, Faisal Karim Kundi Friday asked Imran Khan to start campaign for the upcoming Punjab and Khyber Pakhtunkhwa elections instead of hiding himself in Zaman Park.\nAddressing a presser along with the Secretary General Pakistan People’s Party (PPP), Nayyar Hussain Bukhari, the SAPM said that Imran Khan might be planning to run the election campaign like work from home instead of coming into the field.\nCriticizing PTI for their performance in Khyber Pakhtunkhwa, Faisal Kundi said that the province which was once peaceful is now suffering from unrest due to the ineffective policies of the PTI government.While the Khyber Pakhtunkhwa government has no funds to pay salaries of the government employees.\nAbout the recent audio leak, the SAPM said that the PTI has been calling others thieves and dacoits but the recent audio leak had exposed their own corruption for which they should be held accountable.He said Pakistan People’s Party has always demanded the formation of an independent medical board to prove whether Imran Khan has received bullet injuries or not.\nFaisal Kundi said that it happened for the first time in the history of the world that a person is having plaster on his leg when the bullet has not damaged his bones which he satirically termed as a strange tradition of Shaukat Khanum hospital.\nMeanwhile, Secretary General Pakistan People’s Party (PPP), Nayyar Hussain Bukhari said that the present government would complete its tenure and general elections across the country would be held in time.He said that early elections were not the solution to get rid of the challenges being faced by the country.\nHe said Minister for Foreign Affairs and Chairman PPP Bilawal Bhutto Zardari had invited the Pakistan Tehreek-e-Insaf (PTI) for dialogue without any condition.Nayyar Bukhari said that Chairman PTI Imran Khan had isolated Pakistan from the whole world but Bilawal Bhutto had put maximum efforts to restore cordial relations with the world.\nHe said that PTI was badly failed in delivering on any front during the last four years and today the whole nation was questioning PTI’s commitments to the provision of jobs and houses.Nayyar Bukhari said that the fact of the international economic crisis and its impact on Pakistan cannot be denied but the incumbent government was putting maximum effort to address the challenges.\nHe said: “Two assemblies of Khyber Pakhtunkhwa and Punjab have been dissolved but the National Assembly would complete its constitutional term”.Nayyar Bukhari said the leadership and the workers of PPP have rendered huge sacrifices for the strengthening of democracy and the parliamentary system in the country.\n“PPP doesn’t believe in dictation, former Chief Minister Punjab Chaudhry Pervaiz Elahi’s statement about not dissolving the provincial assemblies is in front of everyone,” he added.Faisal Karim Kundi and Nayyar Hussain Bukhari welcomed the members who joined Pakistan People’s Party from Kohistan, Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T05:50:30.000Z"
}
