{
  "title": "PM confident of deal with IMF current month",
  "link": "https://www.app.com.pk/national/pm-confident-of-deal-with-imf-current-month/",
  "date_published": "2023-01-27T09:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP): Prime Minister Shehbaz Sharif on Friday expressed confidence that Pakistan would conclude a deal with International Monetary Fund (IMF) the current month in a bid to overcome the financial challenges.\nAddressing here at the launch of the Green Line train service between Islamabad and Karachi, the prime minister said the headway in talks with IMF would help the country address the current economic situation.\nThe IMF delegation will be visiting Islamabad from January 31 to February 9 to continue discussions regarding the ninth review of the $7 billion Extended Fund Facility (EFF).\nThe prime minister emphasized the adoption of austerity at a massive scale to tackle difficult economic problems.\nHe said the government had set its priority keeping in view its foreign exchange reserves, thus allowing the import of medicine and food as essential items.\nHe said courageous nations stand united while braving the challenges with resilience.\nShehbaz Sharif expressed confidence that with dedication and commitment, the country would soon regain its glory.\nHe regretted that the Green Line project, which was initiated during the tenure of then prime minister Nawaz Sharif, was delayed by the previous government in a mala fide.\nHe endorsed the concept of outsourcing Pakistan Railways to make it better equipped and at par with contemporary services.\nThe prime minister said Main Line-1 (ML-1) railway track was a top priority for the government and mentioned that China was committed to its early completion.\nHe pointed out that the previous government indulged in baseless accusations of corruption against Chinese companies, and stressed that the coalition government was working on restoring the ties.\nThe new train service comprising modern coaches imported from China was launched from the Margalla train station, Islamabad.\nThe prime minister visited various coaches of the train and appreciated the services provided for the travellers to make their journey comfortable.The Green Line train will have stops at the stations at Rawalpindi, Chaklala, Lahore, Khanewal, Bahawalpur, Rohri, Hyderabad and Drigh Road, Karachi stations.The turnaround time of the Green Line is set at 22 hours, which will be reduced gradually.\nMinister for Railways Khawaja Saad Rafiq said the ticket would cover breakfast, lunch, hi-tea, and dinner besides wifi. Apart from this, he said, high-quality bedding and utility kits will also be provided to the passengers.\nHe said around 2,200 passengers would benefit from the train service to be run between Islamabad to Karachi.\nHe said Pakistan Railways would formulate rules for the approval of the cabinet in the next few days regarding the collection of revenue from its land. He stressed\nFinance Minister Ishaq Dar said Pakistan had become the 24th largest economy in the world under the leadership of then prime minister Nawaz Sharif.\nPlanning Minister Ahsan Iqbal said the delay in development projects by the previous government incurred irreparable losses to the country.",
  "retrievedAt": "2025-08-11T05:50:34.910Z"
}
