{
  "title": "France announces scholarships of 225,000 Euros for outstanding Pakistani students",
  "link": "https://www.app.com.pk/national/france-announces-scholarships-of-225000-euros-for-outstanding-pakistani-students/",
  "date_published": "2023-01-27T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP): Pakistani students with outstanding academic records can benefit from 170 scholarship programmes being offered by the French Government, universities, or companies in the year 2023.\nA total of 225,000 Euros (Rs 59.3 million) has been earmarked for the purpose, out of which 197,000 Euros (Rs 52 million) will be allocated to talented students who wish to pursue a Master’s degree in France, according to a French Embassy press release issued here on Friday.\nScholarship programmes, covering all fields of knowledge and level, are listed on the Campus Bourses scholarship search engine on the Campus France Pakistan website https://www.pakistan.campusfrance.org/. The last date for submitting applications for the scholarships is April 2 (12 a.m.).\nApplications for the Master’s scholarships can be filed in two ways: ‘France Excellence for Climate Change’ and ‘France Excellence Master’.\nBoth the scholarships cover return air tickets, visa fees, tuition fees, social security, and online crash courses (all in French), while in the case of ‘France Excellence for Climate Change’, full tuition fees and a monthly allowance of 860 euros will also be provided.\nDepending on the availability, preferred access to university residences will also be offered.\n“The selected academic programmes for the ‘France Excellence for Climate Change’ scholarships of the Embassy of France for 2023 encompasses top-notch degrees delivered by some of the best French higher education institutions, like IMT Atlantique or Rennes School of Business – all specialized in providing courses on climate change resilience covering scientific, managerial and economic fields,” the press release said.\nThe embassy said every year it awarded scholarships to meritorious young Pakistanis to go to France for Master’s degrees taught in English, short French language training, or art residences.\n“The ‘France Excellence Master’ scholarships programme funded by the Embassy of France in Pakistan is designed to help Pakistani students residing in Pakistan to continue their education at Masters level in France in priority areas set up by the French and Pakistani governments: economics, public policy, environment, and energy,” the press release added.",
  "retrievedAt": "2025-08-11T05:50:26.088Z"
}
