{
  "title": "Saad urges masses to use Green Line Train for generating revenue",
  "link": "https://www.app.com.pk/national/saad-urges-masses-to-use-green-line-train-for-generating-revenue/",
  "date_published": "2023-01-27T08:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Minister for Railways and Aviation Khawaja Saad Rafique Friday urged the masses to use the state-of-the-art Green Line Train inaugurated by Prime Minister Shehbaz Sharif for boosting the revenue.\n“It is my appeal to all the citizens to travel in the newly inaugurated Green Line Train which has been equipped with modern facilities,” the minister said while addressing the inauguration ceremony of the train.\nHe said Prime Minister Shehbaz Sharif had personally inspected the Green Line Train which could help 2,200 passengers travel daily from Islamabad to Karachi in a cosy environment.\nThe minister said the train would leave Margalla Railway Station at 3pm and reach Karachi at 2:20 PM the next day. The train would stop at Rawalpindi, Lahore, Khanewal, Bahawalpur, Rohri Junction and Hyderabad stations during the journey.\nSaad Rafique said the train would provide state-of-the-art services to the passengers including comfortable sleepers, WIFI, quality meals, tea, bottled water, newspapers, standard bedding and air-conditioned rooms.\nHe said the passengers would have the facility of online booking and e-ticketing through which they can purchase e-tickets for their journey on the official website of Pak Railways or through the smartphone application which is available on the Google Play Store.\nThe minister said the Green Line was first inaugurated in 2013 by then-Prime Minister Nawaz Sharif. However, its services were suspended by the previous government of Pakistan Tehreek-e-Insaf (PTI).\nHe said the “gentry” services of Green Line Train had been outsourced with due diligence and after a competitive bidding process so that more revenue could be generated for the department.\n“The revenue of Pakistan Railways stood at Rs 18 billion when the last time Pakistan Muslim League-Nawaz (PML-N) came into power in 2013, he said, adding it jumped to Rs 54 billion when the government completed its tenure in 2018,” he added.\nHe said unfortunately, the previous PTI government totally neglected the department and appointed blue-eyed officers who damaged the department’s revenue growth altogether.\nSaad Rafique said concerted efforts were being made to boost the revenue of the department, however, financial support was imperative to undertake reforms for a revival of the Pakistan Railways.\nThe minister said Pakistan Railways had worked out a plan for branding several passenger trains and railway platforms to generate maximum revenue for the department.\nHe said the branding of the trains and platforms would not only address the increasing deficit of Pakistan Railways but also allow private firms to advertise their products for this purpose.\nSaad Rafique said some Rs 200 million were required to run the day-to-day affairs of Pakistan Railways, but it was just generating Rs 155 million in revenue per day.\nHe extended gratitude to the apex court for allowing to use of its land for commercial purposes which would definitely boost the revenue of the department. Rules would be framed in this regard and sent to the Federal Cabinet for approval soon which would help exploit the commercial potential of Pakistan Railway lands.\nSaad Rafique urged the relevant stakeholders to give maximum business to Pakistan Railways for freight which would not only ensure cargo mobility at an affordable rate but also save road infrastructure.",
  "retrievedAt": "2025-08-11T05:50:35.726Z"
}
