{
  "title": "NAB submits record of 80 references to accountability court",
  "link": "https://www.app.com.pk/national/nab-submits-record-of-80-references-to-accountability-court/",
  "date_published": "2023-09-21T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): The National Accountability Bureau (NAB) on Thursday submitted the record of 80 references to the Registrar Office Accountability Court in light of the judgment of the Supreme Court, pertaining to the restoration of specific cases.\nThe NAB prosecutor shared the list of 80 references with the Registrar Office wherein the 26 cases were shifted to the relevant courts after scrutiny.\nThe administrative judge Muhammad Bashir instructed the staff to apprise him about the cases against private, public office holders and government employees. The judge said that the prosecutor would inform the court that which was maintainable or not.\nThe prosecutor said that they would present record of all cases before the court to ensure implementation on the judgment of the top court.\nLater, the NAB produced the record of cases. The reference against former prime minister Yousaf Raza Gilani pertaining to corruption in universal services funds was sent to AC-II, Rental Power case against ex-prime minister Raja Pervaiz Ashraf and Benazir Income Support Reference was submitted to AC-III. Naudero Power Project reference against Pervaiz Ashraf and case pertaining All Pakistan Project Company, were also submitted to Act-III.\nThe NAB list included the references against Yousaf Raza Gilani, former prime minister Shaukat Aziz, former president Asif Ali Zardari pertaining to Park Lane, Kidney Hills case against Ijaz Haroon and cases against Khawaja Abdul Ghani Majeed.\nMeanwhile, the Accountability Court served notices to Raja Pervaiz Ashraf in rental power case and noted that charges had already been framed against him in this case. Similarly, the court also sought arguments in reference against Farzana Raja. The same court also served notices to respondents in Lok Virsa corruption reference against Robina Khalid and others. The court also summoned the co-accused in person in the case.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:45:04.263Z"
}
