{
  "title": "SC dismisses appeal pertaining to refund of income tax under tribal areas’ special status",
  "link": "https://www.app.com.pk/national/sc-dismisses-appeal-pertaining-to-refund-of-income-tax-under-tribal-areas-special-status/",
  "date_published": "2023-09-21T14:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): The Supreme Court (SC) on Thursday dismissed an appeal in a case pertaining to income tax refund under the special status of tribal areas of Khyber Pakhtunkhwa.\nA three-member SC bench headed by Chief Justice of Pakistan Qazi Faez Isa heard the case.\nDuring the course of proceedings, Riaz Hussain, the petitioner’s counsel, adopted the stance that the Khyber Pakhtunkhwa government and the Customs Department had issued notifications related to tax refunds for tribal people.\nThe CJP questioned whether the petitioner wanted issuance of separate notifications for the tribal areas vis-à-vis all laws of Pakistan.\nJustice Athar Minallah said that if the special status (of tribal areas) were maintained then a separate notification was required.\nThe CJP remarked that what was the problem in paying a small amount of tax when the petitioner lived in Pakistan availing all facilities. Roads, bridges and schools were built from the tax revenue, he added.\nThe petitioner’s lawyer said that income tax could not be imposed in that tribal areas, and that his client wanted refund of tax worth Rs 3.7 million.\nJustice Athar Minallah remarked that the old status of tribal areas no longer existed as they had been merged into the KP.\nLater, the apex court dismissed the appeal for income tax refund under the special status of the tribal areas.\nPetitioner Muhammad Tahir, a resident of Mansehra, had filed an application for refund of income tax paid in 2011 and the Income Tax Tribunal had given a verdict in his favour. However, the Peshawar High Court suspended that decision, which was upheld by the apex court today.",
  "retrievedAt": "2025-08-11T09:44:10.165Z"
}
