{
  "title": "Govt to set up 5,000 joint E-working centers for freelancers: Dr. Umar Saif",
  "link": "https://www.app.com.pk/national/govt-to-set-up-5000-joint-e-working-centers-for-freelancers-dr-umar-saif/",
  "date_published": "2023-09-21T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Caretaker Federal Minister for Information Technology and Telecommunications Dr. Umar Saif has said that steps are being taken to attract global investors in the proposed venture capital for startups.\nThe minister said he will also visit Saudi Arabia soon while the government is going to set up 5,000 joint e-working centers for freelancers.\nDr. Umar Saif said that interest-free loans to establish the joint E-Working Centers and to facilitate freelancers, resulting in millions of employment opportunities in the country.\nHe said that there was a positive discussion with the Caretaker Finance Minister Dr. Shamshad Akhtar on a 5-point agenda related to the IT Sector.\nThe issue of dollar retention to the IT industry was discussed in detail and will give good news in this regard soon.\nThis move will not only transfer overseas IT accounts to Pakistan and restore investor confidence, but also accelerate the flow of dollars in the country and increase the volume of IT exports immediately.\nFurthermore, Caretaker IT Minister Dr Umar Saif has said that PSEB should redefine its role to assist IT companies in getting international clients and business and to brand Pakistan in the global market he said this while presiding over the 58th meeting of The Pakistan Software Export Board (PSEB) here on Thursday.\n“Pakistan has a unique position in terms of its IT professionals and time zone, it is very important to introduce its IT/ITeS products to the world in the required manners. PSEB must collaborate with Pakistan trade and commerce missions in Pakistani embassies world over to help grow the exports of Pakistani IT companies” he added.\nDr. Umar Saif directed PSEB, that all necessary steps should be expedited for the training of 200,000 IT professionals to add $5 Billion in IT Export.\nThe meeting also discussed matters related to the IT industry & increasing investment in the country.",
  "retrievedAt": "2025-08-11T09:44:10.158Z"
}
