{
  "title": "Death of ailing Pakistani national in Afghan jail prompts concerns",
  "link": "https://www.app.com.pk/national/death-of-ailing-pakistani-national-in-afghan-jail-prompts-concerns/",
  "date_published": "2023-09-21T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): The death of an ailing Pakistani national in an Afghan prison has sparked significant concerns and calls for the interim Afghan government to work professionally to promote the values of brotherhood and harmony between the two countries.\nA resident of Kohat, Behram Shah died on August 18, in Mazar-i-Sharif jail. He was detained by the Afghan authorities on the complaint of an Afghan citizen Abdul Hamid. Bahram Shah was accused of failing to pay a small amount he had taken the guarantee of.\nAccording to an analyst, this was not the first time that the Afghan Interim government was acting carelessly in such matters. Even after two years, the interim Afghan government is unable to handle such matters, he commented.\nAs per the report of Afghan jail authorities, Bahram Shah suffered a heart problem and was being treated in the Civil Hospital of Mazar-i-Sharif. During the treatment, the doctor suggested moving him to Kabul and undergoing an operation.\nIn his examination report, the doctor expressed serious concerns over Bahram Shah’s health and suggested his immediate release.\nHowever, Afghan judge Maulvi Mubarak ignored the doctor’s report and made Bahram Shah’s release conditional on providing another guarantor.\nThe death of a Pakistani citizen is an act of negligence on the part of the interim Afghan government. Earlier, two Pakistani laborers were rescued from an illegal private detention of an Afghan citizen, the analyst added.\nHe said the Afghan foreign ministry was not even aware of the incident the inhuman treatment meted out to the Pakistani prisoner.\nExpressing dismay over such inhumane and immoral treatment of Pakistani citizens, the Pakistani officials urged the interim Afghan government to take into account Pakistan’s 40-year hosting of Afghan citizens so that bilateral relations between the two countries were not affected.",
  "retrievedAt": "2025-08-11T09:44:11.374Z"
}
