{
  "title": "OGRA strongly rejects misinformation campaign",
  "link": "https://www.app.com.pk/national/ogra-strongly-rejects-misinformation-campaign/",
  "date_published": "2023-09-21T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Oil and Gas Regulatory Authority (OGRA) on Thursday strongly denied the false propaganda circulating on social and national media, evidently aimed at maligning the organization and diverting attention from its actions against illegal and malicious activities of illegal smuggling of Iranian oil and use of flare gas.\nIn an official statement, a spokesperson emphasized that OGRA maintained a profound dedication to its core mission, which involved transparently regulating and overseeing Pakistan’s oil and gas sector with the highest standards of integrity and diligence.\nThe OGRA remains unwavering in efforts to ensure safety, compliance and fairness for all stakeholders and the nation.\nHe urged the public and media to seek accurate information and refrain from spreading harmful misinformation that could damage the reputation of an institution dedicated to safeguarding Pakistan’s energy consumers and promoting a responsible oil and gas sector.\nThe OGRA spokesperson expressed concern that a few self-proclaimed troublemakers are misleading the public with disinformation. He urged the media to verify OGRA’s stance before broadcasting or publishing news related to the oil and gas sector.\nHe emphasized that OGRA’s primary goals included promoting competition, encouraging private investment and ownership in the mid and downstream petroleum industry and safeguarding public interests through effective and efficient regulations.\nHe pointed out that OGRA was indirectly overseeing a significant portion, approximately one-third, of the government’s economy, with the Oil and Gas sector’s market share exceeding $25 billion annually.\nHe pledged to persist in fostering a secure, progressive and competitive oil and gas industry through close collaboration with all stakeholders. This commitment aims to protect the interests of the nation and maintain the trust of its citizens.",
  "retrievedAt": "2025-08-11T09:44:17.130Z"
}
