{
  "title": "Govt takes steps for medical education’s betterment",
  "link": "https://www.app.com.pk/national/govt-takes-steps-for-medical-educations-betterment/",
  "date_published": "2023-09-21T14:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Caretaker Federal Minister for Health Dr. Nadeem Jan on Thursday said that effective measures are being taken for the improvement of health services and medical education.\nThe minister said this during a visit to Shaheed Zulfiqar Ali Bhutto Medical University.\nVice Chancellor Shaheed Zulfiqar Ali Bhutto Medical University Dr. Tanveer Khaliq gave a briefing on various educational activities, recent performance and challenges in the university.\nDr. Nadeem Jan said that universities should play their role keeping in view the modern requirements of research and training in the field of medicine.\nHe said that special attention needs to be given to research in the health sector in Pakistan.\nDr. Nadeem Jan said that the government is paying special attention to strengthening the health emergency system.\nThe staff of the medical department should maintain their principles and standards, he added.\nThe minister said that the government is taking concrete steps to develop medical education on modern lines.\nDr. Tanveer Khaliq informed the minister that the university has developed AI-based arterial blockage diagnosis software at Shaheed Zulfiqar Ali Bhutto Medical University Islamabad.\nThis software will play an important role in the field of vascular surgery, Dr. Tanveer Khaliq added.\nHe said that the university is among the top five universities in the THE ranking in Pakistan. The university has also been shortlisted in the QS ranking.\nHe said that the construction of the new academic block of Shaheed Zulfiqar Ali Bhutto Medical University has been started.\nThe project will be completed in a short period of just three years for which a huge sum of three billion rupees has been allocated.",
  "retrievedAt": "2025-08-11T09:44:12.527Z"
}
