{
  "title": "KP Assembly outperforms other provincial assemblies in legislative business during 2018-23: PILDAT",
  "link": "https://www.app.com.pk/national/kp-assembly-outperforms-other-provincial-assemblies-in-legislative-business-during-2018-23-pildat/",
  "date_published": "2023-09-21T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP):  Khyber Pakhtunkhwa Assembly outranked all other provincial assemblies in terms of legislation by passing a total of 188 bills during 2018-23, followed by Punjab Assembly  (180 bills), Sindh Assembly (149 bills) and Balochistan Assembly (96 bill).\nBalochistan Assembly was the only provincial assembly to complete its five-year term until August 12, 2023, according to a brief comparative analysis of the performance of four Provincial Assemblies for the period (2018-2023) compiled by Pakistan Institute of Legislative Development and Transparency (PILDAT).\nWhile the Provincial Assemblies of Punjab and KP were dissolved prematurely on January 14 and January 18, 2023 respectively, the Sindh Assembly too was dissolved just before the conclusion of its term on August 11, 2023, it added.\nIn terms of the status of transparency and access to information by four Provincial Assemblies, KP Assembly outranked all other Provincial Assemblies with a score of 8.5 out of 11, followed by the Punjab Assembly which ranked second with a score of 7 out of 11, Balochistan Assembly ranked third by securing 6.5 score out of 11 and Sindh Assembly ranked at last number with 5.5 score.\nOut of the four Provincial Assemblies, only the Punjab Assembly had provided complete attendance records of Members of Provincial Assembly (MPAs) on its website.\nSindh Assembly outranked other three Provincial Assemblies in terms of sittings held during five-years of its term as it convened 326 sittings with an average of 65 sittings per year, followed by Punjab Assembly (274 sittings) with an average of 62 sittings per year,  KP Assembly (248  sittings) with an average of 56 sittings per year.",
  "retrievedAt": "2025-08-11T09:44:16.808Z"
}
