{
  "article_id": "2025-06-05_8f5b5b222822b509c2fc50f48bd30719",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/issi-marks-world-environment-day-2025-experts-urge-urgent-action-on-climate-plastic-crisis/",
    "retrieved_at": "2025-08-27T10:48:53.424Z"
  },
  "metadata": {
    "title": "ISSI marks World Environment Day 2025; experts urge urgent action on climate & plastic crisis",
    "author": null,
    "date_published": "2025-06-05T14:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 469,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 05 (APP):The Centre for Strategic Perspectives (CSP) at the Institute of Strategic Studies Islamabad (ISSI) on Friday organized an in-house event to commemorate World Environment Day 2025. Ambassador Shafqat Kakakhel, Chairperson, Board of Governors, Sustainable Development Policy Institute (SDPI), was the keynote speaker on the occasion, said a press release. In her introductory remarks, Dr. Neelum Nigar, CSP, emphasized that World Environment Day is a moment to reflect not only on the national but also the global dimensions of environmental degradation - from plastic pollution to the escalating impacts of climate change. She stressed the need to examine what policy and institutional responses are required to confront these challenges in a manner that is both just and effective In his welcome remarks, Director General ISSI Ambassador Sohail Mahmood highlighted the growing urgency of the global climate crisis and noted with concern that the targets set under the Paris Agreement are increasingly at risk of being missed, and that many international commitments made over the years remain off-track. He pointed to the widening gap between global climate goals and actual progress, referencing key areas such as climate-induced disasters and the mechanisms for loss and damage. Ambassador Sohail Mahmood emphasized that Pakistan faces acute environmental stress. He underlined that Pakistan's environmental challenges are multi-faceted and deeply intertwined with regional and global dynamics, requiring urgent and sustained focus. Ahmed Naeem Salik, Research Fellow at ISSI, during his remarks, called attention to Pakistan's plastic pollution crisis and identified enforcement, and governance issues as key challenges for the country. He urged the government to adopt a national plastic policy, phase out single-use plastics, enforce corporate accountability, support eco-friendly alternatives, and launch mass awareness campaigns. Mr. Salik emphasized that without coordinated action and societal change, the cost of plastic will continue to be paid by people and the environment alike. In his keynote address, Ambassador Kakakhel reflected on the key global milestones and agreements that have shaped international environmental governance since the Industrial Revolution. He underscored the significance of landmark events such as the 1972 Stockholm Conference-the first major international gathering on the environment-and foundational frameworks like the Rio Declarations, which collectively laid the groundwork for both developed and developing countries to engage in shared environmental responsibility. He noted that while these efforts have fostered global cooperation, the emergence of climate change has intensified existing environmental challenges, making the situation more urgent and complex. Ambassador Kakakhel emphasized that Pakistan has remained actively engaged in international forums on environmental protection and made seminal contribution to some of the foundational documents safeguarding the interest of the developing countries. He noted that despite these strides, substantial work still lies ahead to effectively address the evolving climate and environmental crises. The meeting concluded with an interactive discussion with the research faculty, followed by a tree plantation ceremony.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}