{
  "article_id": "2025-06-05_56ba1b06244523b8e0231cc9602f4498",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/motorway-police-launch-crackdown-against-overcharging-ahead-of-eid-ul-azha/",
    "retrieved_at": "2025-08-27T10:50:29.439Z"
  },
  "metadata": {
    "title": "Motorway police launch crackdown against overcharging ahead of Eid-ul-Azha",
    "author": null,
    "date_published": "2025-06-05T08:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 229,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 5 (APP): In a bid to ensure safe and fair travel for commuters, the National Highways and Motorway Police (NHMP) have launched a nationwide campaign targeting overcharging and overloading by public transport operators during the Eid-ul-Azha. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/06/WhatsApp-Video-2025-06-05-at-12.43.35.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume. According to the spokesperson of the Motorway Police, all bus companies have been strictly directed to refrain from charging passengers more than the officially approved fares. \"Strict action will be taken against violators,\" said Additional Inspector General (IG) of the North Region. \"Heavy fines will be imposed on transporters found guilty of overloading or overcharging,\" the Additional IG warned. \"No concession will be granted when it comes to the fitness of passenger vehicles.\" Passenger vehicles operating without valid route permits and fitness certificates will be sent back and barred from entering the motorways. Authorities emphasized that only roadworthy vehicles will be allowed to operate to ensure passenger safety. As part of the campaign, Motorway Police officers were holding briefings at different sections of motorways for passenger vehicle drivers. The officers outlined the consequences of overloading and speeding, emphasizing the importance of adhering to regulations for a safer journey. The Motorway Police has reiterated its commitment to providing safe, smooth, and fair travel for all commuters. For any complaints or assistance, travelers are encouraged to contact the Motorway Police Helpline at 130.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}