{
  "article_id": "2025-06-05_3fadb416ee70a4d1bf156ef4a8097722",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/quaid-i-azam-university-faces-severe-financial-crisis/",
    "retrieved_at": "2025-08-27T10:49:20.341Z"
  },
  "metadata": {
    "title": "Quaid-i-Azam University faces severe financial crisis",
    "author": null,
    "date_published": "2025-06-05T12:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 236,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 05 (APP):Quaid-i-Azam University Islamabad (QAU), one of Pakistan's premier institutions of higher learning, is currently facing an acute financial crisis that has severely impacted its operations. This month, in a deeply concerning development, the university was only able to disburse partial salaries to its employees ahead of Eid al-Azha, while pensions for retired faculty and staff remain unpaid. This marks the second such incident in the current fiscal year, said a press release from the Academic Staff Association(ASA) of the university Earlier in January, the salary disbursement was also delayed, compelling the university to secure a loan from a private bank-a debt which remains unsettled. The financial strain has further crippled the university's ability to meet essential obligations. Since Fall Semester 2023, QAU has been unable to pay medical reimbursements, compensation for extra courses, internal and external reviewers'/examiners' bills, visiting faculty payment and research grants. The institution is currently operating under a budget deficit exceeding one billion Pakistani rupees. Despite repeated appeals and formal communications to the relevant authorities throughout the past year, no substantial action has been taken to address the financial crisis. If an immediate and comprehensive financial support/bailout package is not extended, the university risks lowering its performance. Academic Staff Association (ASA-QAU) urgently appeals to the authorities concerned to take swift and decisive action. The integrity, reputation, and future of this prestigious institution depend on timely intervention and sustained financial support.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}