{
  "article_id": "2025-06-05_27e6f6ec14c6193bb945b33502b462d5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/3500-officers-on-eid-duty-as-police-tighten-security-across-capital/",
    "retrieved_at": "2025-08-27T10:48:29.206Z"
  },
  "metadata": {
    "title": "3,500 officers on Eid Duty as police tighten security across capital",
    "author": null,
    "date_published": "2025-06-05T15:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 378,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 05 (APP):Islamabad Capital Territory (ICT) Police have finalized a comprehensive security and patrolling plan to ensure the safety of citizens during Eid-ul-Azha, deploying more than 3,500 police officers across the federal capital. An official told APP on Thursday that the security measures are being implemented under the special direction of the Inspector General of Police (IGP). Deputy Inspector General of Police (DIG) Muhammad Javad Tariq said that officers will be deployed at mosques, imambargahs, shopping centers, graveyards, bus terminals, railway stations, and cattle markets to maintain law and order and assist citizens. DIG Tariq said that special deployment has been made at major shopping hubs including Jinnah Super Market, F-6, F-10, and Aabpara Market. Dolphin Force personnel will conduct patrols in these areas to prevent any untoward incidents. DIG Tariq added that a shift-based security arrangement has also been made at the city's bus terminals, where SHOs have held meetings with terminal managers to coordinate the deployment of volunteers for public assistance. DIG Tariq said that police presence has also been ensured at graveyards and the railway station. A dedicated force will be deployed at Faisal Mosque for crowd management during Eid prayers. Moreover, Islamabad Traffic Police (ITP) has prepared a comprehensive traffic management plan to maintain smooth vehicular flow and effective parking arrangements across the city. DIG Tariq said that a special patrolling plan will be implemented during Eid holidays, with Falcon and CRT vehicles actively patrolling their assigned sectors. Additional patrol vehicles have also been provided to local police stations to enhance vigilance. Special security measures have been taken at recreational points across Islamabad, and no parking will be allowed near places of worship. DIG Tariq said that strict checking will be conducted at all entry and exit points of the city. Bomb Disposal Squad will carry out area checks to preempt any threats. Police teams have also been directed to patrol both urban sectors and rural areas during the holiday period. Commando units will assist local police in ensuring foolproof security. DIG Tariq urged citizens to lock their homes securely before leaving for Eid prayers or celebrations and to stay in contact with local police. \"Police officers are working round the clock to safeguard your life, property, and peace of mind,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}