{
  "title": "Cheap power generation crucial as energy import bill swells to $27 bln: PM",
  "link": "https://www.app.com.pk/national/cheap-power-generation-crucial-as-energy-import-bill-swells-to-27-bln-pm/",
  "date_published": "2022-12-05T09:57:00.000Z",
  "source": "APP",
  "content": "MANGLA, Dec 5 (APP): Prime Minister Shehbaz Sharif on Monday said Pakistan was in dire need of generating cheap electricity as the energy import bill exorbitantly touched $27 billion.\nHe was addressing the inaugural ceremony of the refurbishment project of Units 5 and 6 of the Mangla Dam Hydroelectric Power Plant, carried out with the support of the United States Agency for International Development (USAID).\nPM Shehbaz Sharif said Pakistan, which was already facing immense challenges of economic stability, could not bear the heavy costs of energy import bills and thus needed to utilize alternative sources of electricity production.\nHe regretted that in 75 years, both democratic and military rulers were responsible for not building sufficient dams to meet the energy needs.\n“Had the water reservoirs built on time, the country’s energy import bill would not have swelled to $27 billion,” he said, pointing out that “powerful lobbies and cartels” did not let materialize the construction of dams and launch of solar power projects.\nAlso, in the wake of recent flash floods in the country, he said, dams were crucial to mitigate the effects of climate change.\nThe prime minister termed the assistance of USAID for the refurbishment of the units of Mangla dam as a “wonderful example of cooperation” between Pakistan and the United States.\nHe lauded the valuable grant of $150 million by USAID along with the financial support by the Development Agency of France amounting to 90 million euros besides another pledge of 65 million euros. Also, WAPDA (Water and Power Development Authority) contributed $178 million (Rs 20 billion rupees) from its own resources, he said.\nHe expressed satisfaction over the interest of the U.S. to carry out an extension programme of the country’s largest Tarbela dam.\nShehbaz Sharif said the 75-years-old friendship and bilateral relationship between Pakistan and the U.S. had further strengthened at the levels of trade and investment.\nUnited States Ambassador Donald Blome said the Mangla dam was a great symbol of U.S.-Pakistan cooperation and added that the U.S. was also assisting WAPDA in increasing the power generation capacity of the Tarbela and Gomal Zam dams.\nHe said maintenance and upgrades of dams were of critical importance in the wake of climate change and expressed hope that the green alliance between the two countries would prove beneficial for the energy and agriculture sectors of Pakistan.\nThe General Electric Hydro France Project Director said despite the challenges of the COVID-19 pandemic, the suspended projects of refurbishment were carried out effectively.\nHe mentioned that six more units of Mangla dam would also be refurbished in the future.\nChairman Water and Power Development Authority (WAPDA) Lt Gen (retd) Sajjad Ghani said the refurbishment of the units of Mangla dam was in line with the keen interest of the federal government to provide clean, green and cheap energy to the people of the country.\nHe said WAPDA had not only initiated new hydropower projects, but also been rehabilitating\nand upgrading its existing hydel power stations including Mangla to maximize the ratio of environment-friendly and low-cost hydel electricity in the national grid.\nPrime Minister of Azad Kashmir Sardar Tanveer Ilyas, Special Assistant to PM Tariq Fatemi, Secretary Water and Power Division Hassan Nisar, and senior officials were present.\nThe prime minister also visited the refurbished units of the dam, where he was given a detailed briefing about the project.",
  "retrievedAt": "2025-08-11T15:57:56.659Z"
}
