{
  "title": "World looking for morality based world order rather than one based on vested interests: President Dr. Arif Alvi",
  "link": "https://www.app.com.pk/national/world-looking-for-morality-based-world-order-rather-than-one-based-on-vested-interests-president-dr-arif-alvi/",
  "date_published": "2022-12-05T17:05:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 05 (APP): President Dr. Arif Alvi on Monday said that the world at the moment is looking for some kind of morality-based world order instead of cooperation based upon vested interests.\nPresident Dr. Arif Alvi passed these remarks in his speech as chief guest at the inaugural ceremony of 1st Pakistani-Polish International Scientific Conference organized by the Federal Urdu University of Arts, Science and Technology – FUUAST’s department of International Relations here at Governor House here.\nHe said that the borders have now become irrelevant because the challenges are going to be across borders, therefore, the approach should also be adapted accordingly.\nTalking of the impacts of global warming, President Dr. Arif Alvi said that the effects of climate change also cross borders.\nDr. Arif Alvi said that cooperation in present times is no longer dependent on travel documents like visa because nowadays people stay in one country while they work in an other one.\nHe appreciated FUUAST for organizing such knowledge-sharing and collaborative platforms for the students and academicians of the country and said that the conference theme “Pakistan-Poland Relations: Challenges & Opportunities in the Changing World Order”, is also very important”.\nSpeaking about the growth of information technology sector, he said that the IT sector has proved that even a small company can also make a big impact.\nEarlier, in his welcome address, sharing details of 1st Pakistani-Polish International Scientific Conference, Chairman IR department Dr. Asghar Ali Dashti said the conference will be held on December 6-7 at IBA city campus here.\nIt has been jointly organized by FUUAST’s IR department and the Institute of Political Science, University of Warmia and Mazury Poland, he said.\nHe said that the conference aims to provide an opportunity for academicians, professionals and students to exchange innovative ideas on the emerging fields between both states. He said that this was the 1st conference being organized with Polish University under MoU signed between Federal Urdu University (FUUAST) and the University of Warmia and Mazury Poland last year.\nIn his address, Director of the Institute of Political Science, Faculty of Social Sciences, University of Warmia and Mazury- Poland Prof. Arkadiusz Zukowski said that we are engaged in research and educational works at international level and we want to cooperate in various fields.\nHe recalled that the FUUAST and the University of Warmia and Mazury – Poland inked an agreement of mutual cooperation last year.\nProf. Arkadiusz Zukowski said that the topic of the conference is impressive and termed it a kind scientific diplomacy.\nActing Vice Chancellor FUUAST, Prof Dr. Mohammad Ziauddin expressed gratitude to President Dr. Arif Alvi for gracing the opening ceremony with his presence.\nHe said that Poland is an important country in Europe, which is located at a significant geographical position as it is also considered a gateway to Europe.\nHe said that the relations between Pakistan and Poland need to be further strengthened and this conference will be a breakthrough in political, diplomatic and economic relations between the two countries.\nHe said that FUUAST is also providing guidance and counseling to the students and the students will learn a lot from this conference.\nExecutive Director Institute of Business Administration (IBA Karachi), Akber Zaidi said that the IBA- Karachi is also a public sector university like the FUUAST and we are committed to cooperate with other institutes for promotion of education and research activities.\nAkber Zaidi said that we feel pleasure to share with all the universities what the IBA has achieved.\nThe inaugural ceremony was attended by Acting Vice Chancellor FUUAST, Prof Dr. Mohammad Ziauddin, Director of the Institute of Political Science, Faculty of Social Sciences, University of Warmia and Mazury Prof. Arkadiusz Zukowski, Rector of the University of Warmia and Mazury Poland Jerzy A Przyborowski, Executive Director IBA Karachi, Akber Zaidi, Dr. Faisal Javed of FUUAST’s IR department, Assistant Professor FUUAST’s IR department Dr. Rizwana Jabin and other notables.\nThe conference is jointly organized by FUUAST, University of Warmia and Mazury – Poland, Higher Education Commission of Pakistan along with other partners including IBA Area Study Centre for Europe (ASCE) | University of Karachi.",
  "retrievedAt": "2025-08-11T15:57:49.045Z"
}
