{
  "title": "Ashrafi rejects US report on religious freedom in Pakistan, Saudi Arabia",
  "link": "https://www.app.com.pk/national/ashrafi-rejects-us-report-on-religious-freedom-in-pakistan-saudi-arabia/",
  "date_published": "2022-12-05T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 5 (APP):Special Representative of the Prime Minister on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Monday rejected the report of the United States (US) on religious freedom in Pakistan and Saudi Arabia.\nAddressing a press conference, Ashrafi, who is also the chairman of Pakistan Ulema Council, said the minority communities in Pakistan equally enjoyed all human rights like the rest of the citizens of the state.\nHe said the information being provided to the US Commission on Religious Freedom was not based on reality as the elements allegedly involved in disinformation against Pakistan had their own hidden agendas to disrepute the peace-loving country in the comity of nations.\nHe invited the US Commission to pay a visit to Pakistan and witness the ground realities of the standard of living of minority communities in the country.\nHe emphasized the US commission to revisit the report and urged not to be part of any conspiracy against Pakistan, adding that if someone had apprehensions it could be resolved with mutual understanding as issues were part of life.\n“The way, Muslims were being humiliated in the wake of Islamophobia in Canada, US, England and European countries, it was crystal-clear before the world,” he maintained.\nAshrafi said since the beginning of December, the Christmas celebrations had kick started in the country, adding that in the same way, Hindu and Sikh communities were observing their religious festivals without any fear at any nook and cranny of the country because their legal rights were completely protected in the Constitution.\nExpressing his astonishment, he said there was no mention of India where minorities were being treated as third-class citizens. “It proves that the report on religious freedom is based on prejudice and it has nothing to do with reality,” he opined.\nHe further mentioned that Haramain Sharifain was the center of Muslim Ummah’s faith and the Saudi Arabia’s government was serving them in the light of Quran and Shariah.\nAshrafi quoting a verse of Quran said the entry of non-Muslims was prohibited in the jurisdiction of two holy cities – Makkah and Madina, adding that the US should desist from giving its guidelines on the religious matters of Muslims.\nRegarding the current social and economic challenges being faced by Pakistan, he said its solution was lying in unity and negotiation.He proposed Pakistan Tehreek-e-Insaf (PTI) Chief Imran Khan to opt for unconditional dialogue as there was a dire need for electoral reforms before the general elections in the country.\nHe also asked the Imran Khan to avoid “loose talk” against the former army chief Qamar Javed Bajwa as he had been his “well-wisher and helped him through thick and thin in the PTI’s tenure”.\n“It was Imran Khan who used to praise General Bajwa as the most democratic person,” he reminded.",
  "retrievedAt": "2025-08-11T15:57:52.798Z"
}
