{
  "title": "Garbage dumping, burning near populated area irks Warsak road dwellers",
  "link": "https://www.app.com.pk/national/garbage-dumping-burning-near-populated-area-irks-warsak-road-dwellers/",
  "date_published": "2024-03-23T15:14:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 23 (APP):The dwellers of Warsak road while expressing grave concern and condemnation over dumping and incineration of solid waste within the proximity of populated area by Water and Sanitation Services Peshawar (WSSP), have appealed Chief Minister Khyber Pakhtunkwa, Ali Ameen Gandapure to take notice and provide relief to them from this environmentally hazardous practice threatening serious health problems.\nTalking to APP here on Saturday, the dwellers of Warsak road informed that WSSP has started the practice of dumping of solid waste and its burning at an open land near Prime Hospital.\nThe site which is apparently a parking area for heavy waste carriers of WSSP is located in very close proximity of populated area. Several housing societies including Officers Garden, Prime Villas, Hamad Gardan, Arbab Cottage, Green Cottage and few others are getting affected due to non-professional approach of WSSP of dumping of garbage and burning, they informed.\n“Solid waste burning and its incineration is an illegal practice according to Environmental Protection Act of Khyber Pakhtunkhwa and Environment Protection Agency should take action against WSSP,” demands Habib Qureshi, Advocate High Court Peshawar and an affectee of unhealthy practice.\n“Government has reserved a proper site for dumping of solid waste in the periphery of Peshawar city near Phando area, than why the practice is adopted in a populated area,” Habib asked.\n“The residents of nearby areas are continuously experiencing stinky smell which is not only causing nuisance to them but toxic fumes emitted through burning of waste is creating respiratory problems, coughing and throat ailments,” complained Zubair Rafiq who lives in the vicinity of Prime Hospital on Warsak road.\nThe air quality level of Peshawar is already much polluted and burning of solid waste besides its dumping is further aggravating the situation, Zubair opined. Zubair also showed a video of thick black smoke covering a large portion of sky in the area due to burning of solid waste at WSSP site.\nHe said Rescue 1122 was also contacted for dousing of fire, but the request was declined over the plea that the organization initiate action in response to accidental fire.\nZubair said a large area within the vicinity of WSSP site is littered with ash which spread in the air and late drops on ground after burning of solid waste.\nHe said the high ups of WSSP should take action against those who are causing this nuisance and health problems to the people through adopting such an immoral practice of not properly dumping solid waste at designated site.\nThe affected people also urged Governor Khyber Pakhtunkhwa, Haji Ghulam Ali and Mayor Peshawar, Muhammad Zubair as being a resident of Warsak road they should also take notice and initiate action for stopping this practice.\nThey also warned that if the practice of dumping of waste within vicinity of populated area is not stopped, they would resort to block Warsak road for all kinds of traffic. Meanwhile, the WSSP staff deputed on the site when asked for reasons behind dumping and burning of waste near populated area, replied\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:31:21.481Z"
}
