{
  "title": "Increased diagnostic testing for drug resistance",
  "link": "https://www.app.com.pk/national/increased-diagnostic-testing-for-drug-resistance/",
  "date_published": "2024-03-23T15:21:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 23 (APP):On World Tuberculosis Day, Doctors Without Borders/Medicine Sans Frontiers (MSF) encourages medical service providers and practitioners in Pakistan to enhance drug resistant tuberculosis (DRTB) diagnosis by increasing the use of GeneXpert diagnostic testing among suspect tuberculosis (TB) cases.\nAdditionally, patients who do not show improvement with initial TB treatment need to be urgently referred to health facilities specialized in treating DRTB.\nAccording to a press statement, MSF medical team is concerned that DRTB patients referred to the MSF managed Programmatic Management of Drug-Resistant Tuberculosis (PMDT) site in Gujranwala district, Punjab, are only a fraction of people infected in the community and that a significant portion of DRTB cases is going undetected and untreated.\n“Many of the patients we see at the PMDT clinic have been misdiagnosed and have a history of unsuccessful treatment regimens, characterized by a cycle of temporary improvement followed by relapse,” says Dr. Shoaib, MSF medical coordinator.\n“With the correct treatment these patients have a good chance of recovering, but they need to be identified as DRTB patients first,” he says.\nNational statistics confirm this concerning trend of low enrollment of DRTB cases, indicating that many individuals infected with DRTB are either undetected or misdiagnosed. In Gujranwala, only 136 out of the expected 340 DRTB cases were enrolled at the PMDT site in 2023.\nWorld Health Organization (WHO) data show that at the national level the ratio is even more significant, with only 23% of the estimated 20.000 DRTB cases being identified1 and receiving appropriate treatment.\nThe WHO ranks Pakistan as the fourth highest-burden country for DRTB world wide. Tuberculosis is a major public health problem and is an infectious disease caused by a bacterium that primarily targets the lungs but can also impact other parts of the body and lead to life-threatening complications.\nThough TB is treatable with antibiotics, bacterial resistance to commonly used TB medications can develop, causing the treatment to become ineffective.At the MSF PMDT clinic, referred patients are tested with a GeneXpert testing machine which, in a matter of hours, allows our doctors to accurately diagnose TB, determine which drugs are effective against it and start the patient on treatment.\nGeneXpert molecular diagnostic testing is preferable to smear microscopy which identifies less than half of all TB cases and does not detect resistance to rifampicin. It is a more flexible testing method that can process non-sputum samples, such as stools and tissue, to help detect extra pulmonary and paediatric DR-TB cases.\n“By optimizing the utilization of existing GeneXpert machines and increasing the number of locations where people can get tested, we can improve the early detection of DRTB cases” says Dr. Shoaib. “This will lead to better treatment outcomes and significantly contribute to stopping the spread of the disease within the communities”.\nMSF is working with Pakistan medical authorities and other health actors to improve case-finding, providing for instance, training sessions to staff from health facilities on the effective utilization of GeneXpert equipment.\nWith the national TB programme focusing on prioritizing the detection of DRTB cases in the coming years, a further reduction in the price of GeneXpert cartridges, building upon the initial modest drop announced in September, would help increase testing capacity and effectively curb the disease.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:31:21.300Z"
}
