{
  "title": "Posters resurface in IIOJK with greeting messages on Pakistan Day",
  "link": "https://www.app.com.pk/national/posters-resurface-in-iiojk-with-greeting-messages-on-pakistan-day/",
  "date_published": "2024-03-23T08:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP): Posters have once again surfaced in Srinagar and other areas of Indian illegally occupied Jammu and Kashmir, with solidarity and greeting messages for the people and Government of Pakistan on Pakistan Day being celebrated today.\nThe posters and Pakistan flags appeared in Srinagar, Bandipore, Doda and other areas of IIOJK, said a press release.\nThe posters displayed by APHC and other Hurriyat organizations were inscribed with slogans like ‘Hum Pakistani Hain, Pakistan Hamara Hai’, ‘Kashmir is jugular vein of Pakistan’, ‘Jammu and Kashmir is part of Pakistan’ and ‘Go India Go Back’.\nThe posters with the Pakistan flags were also bearing pictures of Quaid-e-Azam Muhammad Ali Jinnah, Allama Muhammad Iqbal, Liaqat Ali Khan and Army Chief General Syed Asim Munir.\nThe posters also said that India had turned Kashmir into a military garrison, adding the Kashmiris wanted freedom from Indian illegal occupation and they would never compromise on their just cause of right to self-determination.\nThe posters praised the founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah for his vision and the epic struggle for the establishment of a separate homeland for the Muslims of the sub-continent. They also signified the immortal bond of Kashmiris with Pakistan and their undefeatable yearning for becoming a part of the great nation.\nPolitical experts say the posters are a message to India that it cannot weaken the Kashmiris’ freedom movement through its military occupation and brutalities.\nThey said that the posters have well explained the Kashmiris’ demand for freedom from Indian illegal occupation and Jammu and Kashmir’s complete merger with Pakistan.\nMeanwhile, videos and posters were uploaded on social media platforms including Twitter and Facebook, felicitating Pakistanis on their national day.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:31:19.873Z"
}
