{
  "title": "Pakistan wants to take US ties beyond counter terrorism, Afghanistan: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-wants-to-take-us-ties-beyond-counter-terrorism-afghanistan-qureshi/",
  "date_published": "2021-09-21T16:11:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 21 (APP): Foreign Minister Shah Mahmood Qureshi Tuesday said that as the US mission in Afghanistan was over, Pakistan wanted to take its bilateral ties beyond counter terrorism and Afghanistan, while keeping them both among the priorities.\n“Now that the U.S. military mission in Afghanistan is over, we want to take our relationship beyond counterterrorism and Afghanistan—which, of course, would remain priorities… In short, we have all the ingredients in place to build a more substantive and broad based relationship that is anchored in trade, investment, and people-to-people linkages,” the foreign minister said in a conversation at Council on Foreign Relations here.\nThe foreign minister, who is currently in New York to attend the UN General Assembly session, said for Pakistan, the US remained an important partner.\nThe event was attended by a large number of analysts and members from the think tank community as well as media persons.\nIt was the first physical session at the CFR after a hiatus of 18 months and Foreign Minister Qureshi was the first guest invited to the first such event held both physically and virtually.\nPresident CFR Ambassador Richard Haass welcomed the Foreign Minister to the Council, which is one of the United States’ leading thinks and the publisher of the Foreign Affairs journal.\nQureshi said the US was still Pakistan’s largest export market and a major source of foreign remittances.\nHe said the talented young Pakistanis continue to gravitate towards American college campuses and Silicon Valley incubators. Finally, we have a large and politically engaged Pakistani American community that is a bridge between our two countries, he added.\nHe said Pak-US engagement had often been narrowly framed, dictated either by short-term security interests or the imperative to deal with a common challenge.\n“We want to break out of this pattern,” he remarked.\nQureshi said after September 11 terrorist attacks, Pakistan and the US came together to decimate Al Qaeda’s core leadership and architecture. The bilateral cooperation produced results, leading President Biden to conclude earlier this year that the United States had achieved its core objective in Afghanistan.\nThe foreign minister told the gathering that as Pakistan shifted its focus towards “geo-economics,” the country wanted to leverage its connectivity infrastructure—including the China-Pakistan Economic Corridor—to enhance regional trade and economic integration. Pakistan saw the United States as an important partner in this regard, Qureshi added.\nThe foreign minister said Pakistan being an over 220 million people market, Pakistan’s young but exciting start-up tech culture showcased its untapped investment potential. With the government’s climate-friendly energy policies, there are now tremendous opportunities for U.S. companies that specialize in renewable and clean energy.\nUltimately, an economically strong Pakistan can be an anchor of stability in a region that has suffered through 40 years of war in Afghanistan, the minister remarked.\nThe foreign minister said Pakistan could work with the US through the Development Finance Corporation to generate economic activity along the Pakistan-Afghanistan border to help Afghan people rebuild their war-ravaged country.\nReferring to the regional situation, he told the gathering that after assuming the office, Prime Minister Imran Khan offered that he would take “two steps” towards peace if India took one.\n“Our message was simple: Pakistan and India should be fighting poverty instead of each other. Unfortunately, India not only spurned our overtures for peace but took actions in Occupied Jammu and Kashmir that have pushed South Asia into a blind alley,” he remarked.\nHe recalled that Imran Khan had come to the UN two years ago and warned that India’s annexation of the disputed territory of Jammu and Kashmir would not silence the Kashmiri people’s cry for self-determination—no matter what level of violence and suppression India unleashes against the Kashmiris. This has proved to be true.\nHe said Pakistan remained committed to finding a peaceful solution to the Jammu and Kashmir dispute, the main obstacle to lasting peace and stability in the region.\nHe said it was up to India to break the impasse and create conditions for the resumption of meaningful dialogue with Pakistan.\nAbout Afghanistan, he said the stunning developments there had reset the regional landscape as no one could have expected that the Ghani government would fall so quickly.\nForeign Minister said while the Taliban made rapid military gains on the ground this summer, Ashraf Ghani’s government was busy inciting hatred against Pakistan on social media. Unfortunately, successive Afghan governments found it was easier to play to the international gallery by blaming Pakistan for every problem in Afghanistan, than looking at the corruption and rot within.\nHe said the speed of Ghani regime’s collapse proved that President Biden had made the right call. As both he and Prime Minister Khan have pointed out, continuing the war in Afghanistan would not have changed the outcome.\n“The international coalition did achieve its mission in Afghanistan: Al Qaeda is a shadow of what it was on the morning of September 11, 2001, and the U.S. mainland has not been attacked again. These are clear successes—successes that, let me repeat, were achieved with Pakistan’s cooperation, Qyureshi commented.\nHe said Pakistan and US shared the same objectives in Afghanistan and the former should not be blamed for correctly diagnosing the limitations of trying to solve the political problem in Afghanistan through military means.\n“Instead of re-litigating the past, we now have to look forward. Our most urgent priority in Afghanistan must be to avoid a humanitarian crisis… The collapse of the Afghan economy could cause another refugee crisis at our border. Since Pakistan cannot take more Afghan refugees, they will inevitably look farther afield—to the Gulf, to Europe, even to North America,” he added.\nHe said as an immediate neighbor, Pakistan could not afford to disengage and the international community should hold the Taliban to their commitments on providing safe passage to those who want to leave the country as well as counterterrorism, human rights, and political inclusivity.\n“Ostracizing Afghanistan proved to be a mistake in the 1990s and it would be a mistake now.  An isolated and unstable Afghanistan would be the exactly the kind of place that would lure terrorist groups,” Qureshi said.\nHe said Pakistan was already experiencing an upsurge in terrorist attacks by the Tehreek-e-Taliban Pakistan and the Balochistan Liberation Army.\n“So while we should expect the Taliban to honor their pledge and not allow terrorist groups to use Afghan territory to attack any other country again, we have to find more creative ways to elicit their cooperation on a sustainable basis.”\nTo a question, the foreign minister said by eliminating terrorist network through a military operation, Pakistan had done its bit and cleansed the area from militants which had not been brought into mainstream.\nHe said if the international community failed to engage and deal with immediate humanitarian crisis and frozen funds not released then it would bring in instability.\nHe said Pakistan would do its best to persuade Taliban to adopt more inclusive approach.\nAbout the women right to education, he said Afghanistan had changed and one could not say that women could not go to schools as no Sharia law prohibited doing so.\nAbout Pak-US ties, he said it was mistake to abandon Afghanistan in 90s and it would be mistake to not have a continued working relation with an ally.\n“We are not asking for any assistance, nor any dole out. We are offering opportunities for investment. Come and take advantage of opportunities… We are focusing on geo-economics, not geo-politics. This is huge shift,” he added.",
  "retrievedAt": "2025-08-11T21:17:49.526Z"
}
