{
  "title": "Regional peace elusive sans Kashmiris’ right to self-determination",
  "link": "https://www.app.com.pk/national/regional-peace-elusive-sans-kashmiris-right-to-self-determination/",
  "date_published": "2021-09-21T13:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): The world amid Global Day of Peace celebration needed to realize that the regional peace of South Asia was linked to right to self-determination of Kashmiris for freedom from illegal occupation of India.\nThe world was observing International Day of Peace, but peace was something quite unknown to the peace-loving Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK) which was facing the worst state terrorism unleashed by India in the seized valley for the past 74 years.\nIndian occupation forces were committing war crimes in the disputed regions and the world must take action and sanction Indian Army, paramilitary forces and political leaders for committing war crimes in IIOJK.  On August 5, 2019, India ripped off the special status and autonomy of the disputed Jammu and Kashmir region after imposing a military lockdown and snapping all communications with the outer world.\nOver three thousand Kashmiris including resistance leaders, men and women and youth were facing illegal detentions in interrogation centers, jails in IIOJK and India.  The day-to-day deteriorating human rights situation in occupied Jammu and Kashmir and gross human rights violations were being committed by the Indian occupational forces with impunity.\nThe freedom of expression and right to assembly was in a state of suspension in the occupied territory.  This struggle was in line with the United Nations charter where Kashmiris demand their birth right to get freedom that would be continued until Kashmir was liberated from India’s occupation.\nKeeping in view, the disappointing attitude of the human rights mongers of the world, Pakistan believed that durable peace, security and development in the region hinge on peaceful resolution of the long-standing Kashmir dispute. Regional peace elusive sans Kashmiris’ right to self-determination.\nThe world amid Global Day of Peace celebration needed to realize that the regional peace of South Asia was linked to right to self-determination of Kashmiris for freedom from illegal occupation of India.\nThe world was observing International Day of Peace, but peace was something quite unknown to the peace-loving Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK) which were facing the worst state terrorism unleashed by India in the seized valley for the past 74 years.\nIndian occupation forces were committing war crimes in the disputed regions and the world must take action and sanction Indian Army, paramilitary forces and political leaders for committing war crimes in IIOJK.\nOn August 5, 2019, India ripped off the special status and autonomy of the disputed Jammu and Kashmir region after imposing a military lockdown and snapping all communications with the outer world.\nThe freedom of expression and right to assembly was in a state of suspension in the occupied territory.  This struggle was in line with the UN charter where Kashmiris demand their birth right to get freedom that would be continued until Kashmir was liberated from India’s occupation.\nKeeping in view, the disappointing attitude of the human rights mongers of the world, Pakistan believed that durable peace, security and development in the region hinge on peaceful resolution of the long-standing Kashmir dispute.",
  "retrievedAt": "2025-08-11T21:17:57.411Z"
}
