{
  "title": "Election reforms need of the hour to end rigging: Fawad",
  "link": "https://www.app.com.pk/national/cabinet-okays-44-rise-in-employees-house-rent-ceiling/",
  "date_published": "2021-09-21T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain Tuesday took exception to the non serious attitude of opposition parties giving preference to personal interests over issues of national importance.\nAddressing a post cabinet briefing, he termed electoral reforms ‘need of the hour’ and regretted that the opposition was only interested to save the money they had looted from national exchequer while in power.\nHe said the government had approached the opposition several times for holding talks for evolving consensus over the issue of electoral reforms, but it was unfortunate that they could not see beyond personal interests.\nThey only wanted that they should not be asked to return national wealth looted and plundered by them and their leadership while being into the power, he said while asserting that most of them were not even interested in becoming the prime minister of the country.\nThe minister said the government had a clear vision to grant voting right to the overseas Pakistanis who were backbone of the national economy.\n“It is not possible that we do not allow overseas Pakistanis to cast vote in the election,” he added.\nGiving details of the decisions taken in the Federal Cabinet meeting chaired by Prime Minister Imran Khan, he said the proposal for 44 per cent increase in the current house rent ceiling of the government employees had been green lighted.\nIt was aimed at providing major relief to public servants in the wake of high rates of houses fares in the major cities especially in Islamabad, he added.\nThe increase would be applicable to the federal government employees from grade 1 to 22, he said, adding the initiative was taken after reviewing the increase in the houses’ fares in major cities. Such practice was repeated after every three years, he noted.\nThe minister said the forum accorded approval to include Uzbekistan in the business visa list. The move was aimed at strengthening ties with the Central Asian state as well as providing relief to the business community of the two countries, he added.\nThe Cabinet okayed the import of films from the regional countries so that the film industry could be uplifted by reviving cinema culture through screening of such movies.\nFawad said Jammu and Kashmir State Property Budget worth Rs 190.383 million for the Fiscal Year 2021-22 had also been approved by the Cabinet.\nThe forum also accorded approval to hire services of M/s KPMG Taseer Hadi and Co. for [audit] of the National Database and Registration Authority financial accounts for fiscal year 202-21.\nHe said Asif Rauf had been appointed as the Chief Executive Officer of Drug Regulatory Authority for the next three months.\nThe minister said the Cabinet had expressed concern over giving membership of Parliamentary committees to those Senators and Members of National Assembly who had some sort of conflict of interest with the bodies.\nHe said the National Assembly Speaker and Senate Chairman would be requested to ask those members to tender resignation, otherwise legislation would be done to remove them from those committees.\nFawad expressed the hope that those members having a conflict of interest in some standing committees would resign themselves.\nHe said the Federal Cabinet was told that the country had gained a landmark victory against the crippling disease of polio. Ministry of National Health Services was appreciated and congratulated by the cabinet members on achieving such milestone.\nThe minister said only one case of polio was reported in the last seven months which was the lowest level of reported cases in the country after such a long time.\nAny country, which wanted to get polio-free country status, it had to be remained polio-free for three years, consecutively, he added.\nIt was a good omen that such a level against the disease was achieved after a hiatus, he remarked while expressing the hope that the authorities would continue to move against the disease with the same spirit and the country would eventually emerge as a polio-free in future.\nHe said the Federal Cabinet, on the request of World Food Programme, also granted one-time permission to make concession in the port policy orders for release of shipments from Saudi Arabia.\nAbout inclusion of Uzbekistan in the business visa list, he said the initiative would ensure availability of five-year multi-visa facility at the relevant Pakistan Consulate within 24 hour-time.\nThe minister said with addition of Uzbekistan in the list, the bilateral ties would be strengthened further.\nFawad said Pakistan and Uzbekistan especially its political leadership including Prime Minister Imran Khan and Uzbek President Shavkat Mirziyoyev enjoyed good ties especially in the context of Afghanistan and trans Mazar-i- Sharif train which would connect Karachi and Gawadr with Tashkent via the landlocked country.\nHe called the Mazar-i-Sharif train as a ‘landmark’ vision of the present government, saying talks on the matter were going forward in a remarkable manner.\nThe minister said the Pakistan Telecommunication Authority (PTA) presented a policy directive to the meeting on a judgment referred by the Islamabad High Court to the Federal Cabinet regarding blockage of social media companies and inappropriate content on social media sites.\nThe policy directive was meant to apprise the court that the government was fully empowered to take action for removal unlawful of contents from the social media.\nAbout contemporary social media rules and regulations, he said the government was working on two-pronged strategy to address social media related issues through new policy initiatives.\nThe strategy was not only aimed at tightening noose around those companies that were delaying action against producers of pornographic content, but also taking legal action against the individuals, involved in making objectionable content in Pakistan, he added.\nHe said issues related to social media had become a major problem in the country that was why a new policy debate on the matter was being initiated that would be led by Minister for Human Rights Dr Shireen Mazari. The debate would help evolve new laws for the purpose, he added.\nAs regards to the revival of film industry, the minister said since the covid-19 cases witnessed a sharp decline and the Federal Cabinet decided to allow screening of Iranian, Turkish and other countries’ movies, the negotiations with the National Command and Operation Center for opening of cinemas were underway.\nHe said the government had already given different incentives to the film industry and announced that concession in electricity tariff would be offered to the cinema houses for boosting such business activity.\nFawad said in a first, a new alternative dispute resolution mechanism was put in place in the Federal Capital under which ADR centers would be set up in Islamabad.\nIn the first phase, he said family issues would be referred to the Alternative Dispute Resolutions (ADRs) so that such matters could be resolved through mediation and burden on the judicial system would reduce.\nWhat he regarded as a system akin to old ‘Panchayat’ system, he said the ADR in its updated form was adopted by the developed countries like the United States and the United Kingdom where it produced 75 per cent and 80 per cent results, respectively.\nThe minister said for the first time, modern technology would be opted to so that the upcoming census could be completed within 540 days.\nPrime Minister Imran Khan had formed a committee as some details of the census were yet to be determined, he added.\nHe said the next general elections would be held under the new census and after delimitation of the constituencies.\nFawad said this news might hurt some people who were desperate to see fresh elections in the next few months.\nHe said reformation of the electoral system was imperative before the next elections and opposition was being approached for the purpose.\nTo a query, Fawad said that a calculator had been added to the ballot box which would automatically calculate the number of votes polled for all candidates. The world had moved far ahead in the use of technology in elections but Pakistan was just adding a calculator to the ballot box at this stage, he added.\nTo another question, he said that hybrid war and fake news were interlinked and these were fake threats which resulted into the postponement of recent New Zealand tour.\nDetails of the tour cancellation were being collected and would be shared in a separate press conference, he added.\nHe said Pakistan Television Corporation had suffered financial loss of up to Rs 250 million due to the cancellation of New Zealand and England cricket teams tours.\nThe legal teams were working about how to seek compensation for the huge losses, he added.The minister said there must be a price for saying ‘absolutely not’ to [the world powers].\nThe role of the Election Commission of Pakistan was discussed in the Cabinet at length, he said while responding to another query.\nHe said the opposition parties’ members only wanted halt in the ongoing accountability process.About inflation, he said the issue was discussed in detail during the meeting which was told that there were the lowest prices for petroleum products in the country as compared to the world.\nGas prices in Pakistan were lower than of Qatar which was one of the major exporters of the commodity, he added.\nThe minister said the real achievement was that the income of over 70 per cent of the population had also increased significantly.\nHe said 60 per cent of the population in Pakistan was associated with the agriculture sector and which had an additional income of Rs 1,100 billion in the recent past.\nThe minister said the income of millions of people associated with construction industry had also increased.\nHe said the government was reviewing the policy of export of vegetables to stabilize their prices in the local market.",
  "retrievedAt": "2025-08-11T21:17:49.091Z"
}
