{
  "title": "Collective aspiration of Kashmiris is to join Pakistan: AJK President",
  "link": "https://www.app.com.pk/national/collective-aspiration-of-kashmiris-is-to-join-pakistan-ajk-president/",
  "date_published": "2020-08-13T06:51:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) : Aug 13 (APP): President of Azad Jammu & Kashmir Sardar Masood Khan has said that historically the people of Jammu and Kashmir had decided to join Pakistan well before the Independence of Pakistan.\n“This decision, he said was unanimously made during the meeting of the All Jammu and Kashmir Muslim Conference held on July 19, 1947”, the President shared these remarks while speaking to the concluding session of the Summer School 2020 Kashmir Boot Camp organised by the Centre for Security, Strategy and Policy Research (CSSPR) on the topic “Kashmir: Conflict, Crisis and Dialogue”.\nThe web-conference was moderated by Dr Rabia Akhtar, Director CSSPR, and was attended by over 40 students, AJK President office told media on Wednesday.\n“It was the collective aspiration of the Kashmiris to accede to Pakistan. This will of the Kashmiris was trampled because of the connivance of the Maharaja, the Indian government and the British colonisers who forcefully tried to annex Kashmir to India”, he said.\nThe President said that after the independence of India and Pakistan, the people of AJK and Gilgit-Baltistan fought a war against the Maharaja and liberated these areas.\nHe added that had the Indian government not deployed their forces at Srinagar the whole State of Jammu and Kashmir would have been liberated. “The area we know as AJK and GB have now become a defensive rampart for Pakistan”, he said.\nPresident Masood Khan said that the people of Kashmir had suffered tremendously over the past 73 years. He added that in the month of November 1947, the Muslims of Jammu were forced to leave the area and were pushed towards Sialkot.\nThis exodus resulted in the martyrdom of 237,000 unarmed Muslim Kashmiris at the hands of the Maharaja’s forces, Indian army and RSS goons, while another 300,000 were permanently displaced. Till this day, he said, 500,000 Kashmiris have sacrificed their lives in pursuit for freedom, liberty and self-determination.\nThe AJK President said that this past year has been the darkest period in the history of Jammu and Kashmir. On August 5 last year, the Indian forces imposed a military siege in IOJK which had led to the intensification of killings, maiming, blinding and enforced disappearances within the occupied territory. Almost three months into the occupational lockdown, on October 31, the Indian government bifurcated, annexed and brought this internationally recognised disputed area under the direct control of New Delhi. India also issued fake maps in which they showed AJK and GB within the geographical boundaries of the Indian federation.\nCondemning India’s illegal moves, the President said that the Indian government had gone a step further by introducing the New Domicile Rules leading to an unprecedented transformation of the local demography. He said that all these steps are a violation of international laws and conventions.\nThe President urged that India must be brought to task for their crimes against humanity, war crimes, genocide and human right violations. Last century, he said, the perpetrators of such crimes were tried and made an example of but India, unfortunately, has been given a free pass due to its so-called strategic ties with major world powers.\nHe said that India has falsely indicated that they will be able to very effectively check China’s economic growth in the region and beyond.\nMasood Khan said that Indian leadership including Prime Minister Modi and Rajnath Singh have resorted to nuclear signalling and have publically claimed to use nuclear weapons against Pakistan.\n“This kind of manoeuvring is unprecedented and no nuclear State has gone down this path”, he said.\nThe President while highlighting the response on Kashmir by the international community, said, the leading media outlets of the world, human rights organisations, prominent parliaments, their parliamentarians and the diaspora community have helped raise the profile of the Kashmir dispute. He especially praised the efforts of the diaspora community who have been working very hard by organising major events and reaching out to political leaders in their country of adoption.\nThe AJK President said that on the diplomatic front we have had considerable success as we have convened three debates on Kashmir at the UN Security Council. The last meeting held on 5 August 2020 has been quite substantive and symbolic as it was held on date commemorating one-year of occupational lockdown.\nHe said that the onus is on us to exploit the opportunities and the communication bonanza we had been provided. We must call out India, as silence will embolden India to continue committing human rights violations in IoJK.\n“We have to re-strategize our Kashmir policy. We will not be handed Kashmir on a silver platter. We have to make the Kashmir issue into an international movement. We have to achieve a critical mass. Then only we will be heard”, he maintained.\nResponding to questions from the participants, the President said that Pakistan’s efforts since August 5 have been very effective and its outreach has been penetrative.\nHe added that India has taken a major hit after the moves they had taken and now the taboo of not speaking against India was broken as the US Congress and leading Parliaments of the world have held multiple hearings, passed resolutions and published reports on Kashmir. The ASEAN has also been mobilised and countries like Turkey, Malaysia, Iran and others have stood by us on Kashmir.\nTo another question, he responded that the military option can never be ruled out.\nThe delicate nuclear equilibrium in South Asia has restricted a full-fledged war and India under its malicious strategy has been using low-cost, high-yield military tactics like ill-planned surgical strikes and violating Pakistan’s air space. “We will respond and the Pakistan Army is ready to fight for Kashmir”, he said.\nA participant suggested Pakistan withdraws from all bilateral agreements with India. Masood Khan responded that we have no need to withdraw from them as India has already taken unilateral decisions on Kashmir and through its own actions made these bilateral agreements redundant.\n“No peace with India is possible under the current conditions. How can we have peace with India when they are brutalising and maiming one part of our realpolitik.\nWe will go to any frontier, any length to ensure that the lives of the Kashmiris are saved and they are granted their right to self-determination”, said President Masood.",
  "retrievedAt": "2025-08-11T19:39:10.471Z"
}
