{
  "title": "Ambassador appreciates long-standing friendship between Japan , Pakistan",
  "link": "https://www.app.com.pk/national/ambassador-appreciates-long-standing-friendship-between-japan-pakistan/",
  "date_published": "2020-08-13T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP): Ambassador of Japan to Pakistan, Matsuda Kuninori Thursday appreciates long-standing friendship between Japan and Pakistan and reiterated his resolve to work together to further deepen and strengthen the existing friendly relations between the two countries.\nThe ambassador congratulated the Pakistani people on the occasion of the country’s 73ed Independence Day which is marked on August 14th.\n“On behalf of the government and the people of Japan, I will like to express my sincere congratulations to the government and the people of Pakistan on their 73rd Independence Day and best wishes for further peace and prosperity in Pakistan. I will also like to appreciate Pakistan’s efforts to maintain stability in this region and its contribution to various United Nations peace-keeping missions all over the world, and I am sure Pakistan will continue doing so” he said in his message of felicitation.\nAmbassador Matsuda also mentioned the decades-old history of Japan-Pakistan cordial relationship and Pakistan’s significant role during the reconstruction of Japan after Second World War (WWII).\nHe said “when Japan started to pave the way for reconstruction after the end of WWII, Pakistan was one of those countries which manifested tolerance towards Japan and welcomed its return to the international community as a signatory of San Francisco Peace Treaty in 1951.\nI will like to express my heartfelt gratitude to the government and the people of Pakistan for that critical and generous support of reconciliation.”\nThe ambassador assured Japan’s commitment to continuously supporting Pakistan’s socio-economic development and promised that he continued working on strengthening political, economic, cultural and people-to-people ties between Japan and Pakistan.\nHe added that in response to the challenges of COVID-19 and locust invasion, Japan had provided assistance for Pakistan’s efforts to fight those difficulties and would continue to support Pakistan, as global cooperation was indispensable to tackle the on-going and borderless challenges.",
  "retrievedAt": "2025-08-11T19:39:09.418Z"
}
