{
  "title": "Prime minister launches first anti-stunting Ehsaas Nashonuma program",
  "link": "https://www.app.com.pk/national/prime-minister-launches-first-anti-stunting-ehsaas-nashonuma-program/",
  "date_published": "2020-08-13T11:47:00.000Z",
  "source": "APP",
  "content": "KHYBER, Aug 13 (APP): Prime Minister Imran Khan Thursday launched the country’s first ever Ehsaas Nashonuma Program aimed at preventing the stunted growth of children as 40 percent of children suffer the impaired growth mainly due to poor nutrition.\nInitially launched in nine districts across the country, the program featured maintenance of data of pregnant and lactating mothers and their under-two year babies besides providing them quarterly stipend and healthy diet.\nAccompanied by Federal Religious Affairs Minister Pir Nurul Haq Qadri, Special Assistant to PM on Social Protection and Poverty Alleviation, KP Governor Shah Farman, Chief Minister Khyber Pakhtunkhwa Mahmood Khan, the prime minister visited a Nashonuma Center established here.\nDr Sania Nishtar briefed the prime minister about the features and significance of the program launched in pursuance of the his vision to address the issue of stunting among the children.\nThe prime minister also interacted with the beneficiary women of the anti-stunting program as the country stood second in the region for stunting with 40 percent of the children facing stunted growth due to malnutrition or other reasons.\nA budget of Rs 8.52 billion has been earmarked for the government funded three-year Nashonuma program. The beneficiaries would be provided quarterly stipend of Rs 2,000 for girls and Rs 1,500 for boys.\nIn the initial phase, 33 Nashonuma centers have been established in nine districts including Khyber, Upper Dir, Bagh, Ghizer, Hunza, Kharmang, Kharan, Badin and Rajanpur.\nThe districts have been selected on the basis of prevalence rate of stunting. The establishment of all 33 Nashonuma centers will be completed by end of August.\nFour centers have already been set up in Rajanpur, six in Upper Dir and three in Khyber while six will be established in Badin, three each in Kharan and Bagh and eight in Gilgit Baltistan.\nAn application has also been designed to maintain the health record of the beneficiaries and special registration desks have also been set up for beneficiary women at the centers.\nSpecial awareness sessions would be held for the beneficiary women in their regional languages for what special literature including charts, posters and educational videos have been designed.\nThe centers would also be equipped with special ATM machines to dispense the amount of stipend through biometrics.",
  "retrievedAt": "2025-08-11T19:39:02.956Z"
}
