{
  "title": "Armed forces aware of Indian capability, fully ready to crush enemy’s designs: ISPR DG",
  "link": "https://www.app.com.pk/national/armed-forces-aware-of-indian-capability-fully-ready-to-crush-enemys-desins-ispr-dg/",
  "date_published": "2020-08-13T02:06:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 13 (APP): Inter Services Public Relations (ISPR) Director General Major General Babar Iftikhar Thursday said the Pakistan armed forces were fully aware of Indian intentions and capability, and were completely ready to crush the enemy’s designs in any war domain.\nAddressing a media briefing here, he paid tribute to the workers, leaders and martyrs of Pakistan Movement, especially Quaid-e-Azam Mohammad Ali Jinnah and Dr Allama Mohammad Iqbal. He congratulated the nation and the media persons on the 73rd Independence Day of Pakistan and said freedom was a great blessing and its worth could only be explained by a Kashmiri mother, who had lost her child at the hands of occupation forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nBesides the IIOJK situation, the ISPR chief shed light on the country’s overall security situation, Indian ceasefire (CFVs) violations at the Line of Control, Pak-Afghan border situation and other issues.\nMaj Gen Babar said the IIOJK had been under the history’s worst siege by the occupation forces for the last one year. India under a sinister design was committing the worst human rights abuses and genocide of Kashmiri people.\nThrough its tyranny and reign of terror, India in fact wanted to displace the Kashmiri Muslims. The honour of women and children was not safe while the youth were being killed in so-called counter terrorism operations and buried in unmarked graves, he said, adding the Kashmiri leadership had been detained for the past many years.\nHe said the Government of Pakistan had highlighted the Kashmir Issue at all global forums which were now raising their voices against Indian aggression and oppression of Kashmiris. “Genocide Watch, international human rights bodies and global media despite strict military siege have highlighted the Indian armed forces brutalities unleashed on innocent Kashmiri people.”\nThe ISPR chief said United Nations Secretary General Antonio Guterres also emphasized the need to ensure fundamental human rights of the IIOJK people. The Kashmir issue was debated by the United Nations Security Council thrice that showed the need to resolve this dispute at the international level, he said.\nAs regards the LoC situation, he said despite the appeal from the UN Secretary General for ceasfire during the COVID-19 pandemic, India had continued its cowardly acts of targeting peaceful civil population along the LoC.\nIndia since the pandemic outbreak had committed 1927 CFVs and deliberately targeted civilian population. He said,“Some 16 innocent Kashmiris were martyred during Indian CFVs and 158 injured.” The martyrs included five children, seven women and four men whereas 41 children and 50 women were among the injured.\nThe Indian forces used mortars and heavy ammunition during CFVs, he added. Major General Babar said recently the international media persons visited the LoC and were given complete access to the civil population and those affected due to the Indian CFVs. They [themselves] had assessed the situation of the LoC, while on the contrary India had not given access to the international media and UN observers to know on ground situation in the IIOJK.\n“Pakistan will ensure the protection of the Kashmiris along LoC and has decided to build shelters inside the residences of the local people along the LoC. Around 1,000 shelters have been built the work on the rest is underway.”\nThe ISPR chief said the India through its hegemonic designs was disturbing the regional and global peace and creating imbalance in the world. The fire of communal hatred, racism and caste system ignited by the Indian government had engulfed the whole country. The Indian attempts to externalize its internal failures had reached the point where the lava of its hatred and aggression would become a catastrophe for the whole region, he added.\nHe said a recent UN report had revealed that India was nurturing of terrorist groups on its soil and was using them against its neighbouring countries, particularly Pakistan, to destablise their peace and prosperity.\nThe attackers of Pakistan Stock Exchange and facilitators of terrorist groups in Pakistan had links with India, which was supporting them through money laundering, he added.\nThe ISPR DG said India was accumulating huge arsenal, which showed its expansionist designs. India topped the list of countries buying weapons.\n“Pakistan is aware of Indian designs and its ability,” he said, adding wars were not only fought with weapons rather the people’s trust and national resolve was the true asset of the armed forces of a country.\nDespite the country’s limited resources the Pakistan Armed Forces, he said, were fully alert and ready to respond to the enemy in every war domain.\nThe ISPR DG said Pakistan had played a key role in the Afghan peace process. “Peace in Afghanistan means peace in Pakistan” and that why Pakistan was the biggest proponent of peace in Afghanistan.\nHe said the Afghan peace process was proceeding and now it was time for launching a programme for dignified repatriation of Afghan refugees. It should be managed within the earliest possible timeframe duly facilitated by all the stakeholders, he added.\nAs regard the Operation Radd-Ul-Fasaad, he said the entire nation along with the armed forces had fought a successful war against terrorism, that was acknowledged by the entire world. It was hard earned success.\nDuring the operation, he said, over 46,000 square kilometers area was cleansed from the terrorists with over 18,000 terrorists killed and 400 explosive devices recovered and defused. About 194,958 intelligence based operations (IBOs) were conducted , in which 70,000 weapons and 5 million ammunition were recovered.\nSome 70 improvised explosive devices (IEDs) were also dismantled, which showed how much risk was involved for the security personnel, he added.\nHe said under the border management initiative, long term measures were taken along Iran and Afghan borders, including establishment of border terminals, scanners, biometric systems, border posts, forts and fencing.\n“This will help benefit the people of both sides as it will help in containing terrorism and smuggling.”\nFor effective border management, he said, the capacity building of FC Khyber Pakhtunkhwa and Balochistan was underway.\nHe said around 1,700 kilometers, out of total 2,611 kilometers long border with Iran and Afghanistan, had been fenced, which included 730 kilometers in Khyber Pakhtunkhwa and 980 kilometers in Balochistan. “Recently the Pakistan Army started fencing tough areas, especially the one lying at 11,000 feet height in Waziristan.”\nHe said Pak-Iran border fencing would be completed by the end of 2021 as over 400 out of 1,000 border posts and forts had been built.\nMaj Gen Babar said the improved border fencing and management had resulted in decline of IED explosions, illegal trafficking and smuggling. It had also helped restore peace in the tribal areas. The civil administration and institutions, fully backed by the Pakistan Army, were engaged in building and development of the tribal districts.\nThe terrorists’ narrative had also been made ineffective with change of public opinion with success in the war against terror, he remarked.",
  "retrievedAt": "2025-08-11T19:39:00.622Z"
}
