{
  "title": "People rejected PTI’s politics of confrontation: Musadiq Malik",
  "link": "https://www.app.com.pk/national/people-rejected-ptis-politics-of-confrontation-musadiq-malik/",
  "date_published": "2024-11-24T17:20:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 24 (APP): Federal Minister for Petroleum Musadiq Malik on Sunday said people had rejected PTI’s politics of agitation and confrontation, which is aimed at destabilizing the country and no any convoy was taken out out from Punjab, Sindh and Balochistan.\nKhyber Pakhtunkhwa CM and Bushra Bibi heading towards Islamabad but they would never succeed in their nefarious designs, he said while addressing a press conference here at PSO head office.\nFederal Petroleum minister said PTI was ruling in KP since last 11 years and during their rule in the province several major terrorist incidents were occurred. He cited APS tragedy, Police Lines incident and several other terrorist incidents claiming lives of innocent civilians as well as security forces Jawans.\nSenator Musadiq said in the past our security forces had initiated successful operations like Zarab-e-Azab and eliminated terrorist networks from our soil and terrorists had fled away but when PTI took over the reins of power in KP they brought all terrorist elements back to our soil.\nHe said terrorists were involved in killing of miners, innocent people in tribal areas of the Khyber Pakhtunkhwa and PTI is responsible of all these terrorist incidents.\nSenator Musadiq Malik said PTI wanted to storm the capital and at that time when foreign leaders are coming to Pakistan. The aim of this agitative step is to bring bad name for Pakistan, Musadiq Malik said and warned no one would be allowed to harm Pakistan’s stability.\nPetroleum minister said Pakistan had overcome economic crisis and heading towards stability, our Stock Exchange is going to break the records by crossing100000 index limit at that time these elements want to destabilize the economy.\nMusadiq Malik refered the visit of Belarusian president who is due in the capital today and both the countries would hold talks to enhance cooperation in diverse fields.\nHe also recalled that PTI last time announced protest during SCO Summit and it was evident that they want to derail Pakistan’s journey towards development and prosperity.\nMusadiq said PTI leaders want Imran Khan to remain in jail, which is why they are being engaged in politics of chaos.\nMusaddiq said that the people rejected PTI’s call to storm Islamabad, and no convoy has left from other parts of the country except Khyber Pakhtunkhwa.\nFederal Minister said that Bushra Bibi made an irresponsible video statement and accused the friendly country, who always supported Pakistan in every difficult time. Saudi Arabia has stabilized the country’s economy by giving billions of dollars not only to our governments but also to the PTI government.\nHe said that Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur and Bushra Bibi are coming with a convoy to storm Islamabad, but they will fail.\nPTI Punjab leaders are nowhere to be seen and are making voluntary arrests so that they can say that they had been arrested, claimed Musaddiq Malik.\nHe said resolving People’s problems was government’s priority and due to steps taken by the federal government inflation had drastically decreased.\nHe criticized the KP government for not controlling law and order situation and refered the Parachanar incident where several innocent people were brutally murdered. He said it was matter of regret and sorrow that many people had been killed in Parachinar and the relatives are still sitting on the road carrying the dead bodies of their loved ones, but the Chief Minister is busy leading the protests. Ali Amin Gandapur should pay heed to law and order situation in his province but he is busy in attacking federal capital and the Punjab, Musadiq said, adding that no one would be allowed to destabilize Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:35:14.234Z"
}
