{
  "title": "SC rejects plea to suspend Deputy Speaker NA ruling",
  "link": "https://www.app.com.pk/national/sc-rejects-plea-to-suspend-deputy-speaker-na-ruling/",
  "date_published": "2022-04-03T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP):The Supreme Court on Sunday rejected a request to suspend the National Assembly (NA) Deputy Speaker Qasim Suri’s ruling and directed the Attorney General for Pakistan to submit it on Monday.\nA three-member bench of the apex court comprising Chief Justice Umar Ata Bandial, Justice Ijaz Ul Ahsan and Justice Mohammad Ali Mazhar heard the suo moto notice case on the current situation in the country following the dismissal of a no-confidence motion against Prime Minister Imran Khan by the NA Deputy Speaker and the subsequent dissolution of the NA by President Arif Alvi.\nDuring the course of proceedings, Chief Justice Bandial said that all orders and actions initiated by the prime minister and the president regarding the dissolution of the National Assembly would be subject to the court’s order.The chief justice said the law and order situation in the country should not deteriorate, instructing all political parties to act responsibly.\nHe said that no unconstitutional step should be taken by any state institution and that no one should try to take advantage of the situation. Public order should be maintained, he added.He said that the court did not want to drag the hearing on account of Ramazan and that notices should be issued to all the political parties.\nHe also ordered the interior and defence secretaries to brief the court on the law and order situation.The chief justice ordered that the PPP’s request be accepted and said the court would review the deputy speaker’s actions. The court, however, rejected a request to suspend the deputy speaker’s ruling.\nJustice Bandial remarked that President Arif Alvi should be made a respondent in the case since it was an important matter.The court issued notices to Attorney General Khalid Khalid Jawed Khan, the speaker, deputy speaker, defence secretary, interior secretary, all political parties and adjourned the case’s hearing till Monday.",
  "retrievedAt": "2025-08-11T14:39:06.521Z"
}
