{
  "title": "At least 11 dead, 3 wounded as truck crashes in KP’s DI Khan: Rescue 1122 - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least 11 people were killed, and another three were injured after a truck crashed in Khyber-Pakhtunkhwa’s Dera Ismail Khan, rescue 1122 said on Friday.\n\nSpeaking to Dawn.com, spokesperson Rescue 1122, Bilal Ahmad Faizi, said that, “Eleven people lost their lives and three were injured as the truck’s brakes failed, causing it to crash in the Dana Sar Daranda area of DI Khan.”\n\n“The deceased include five women, a child, and a man,” he said, adding that the three injured were rushed to the District Headquarter Hospital DI Khan.“\n\nHe further said that the truck was travelling from the Khanozai area of Balochistan.\n\n“Seven of the bodies were also taken to the hospital by the Rescue 1122 team, while four bodies were moved to the hospital by the local people,” he said.\n\nThe deceased people have not yet been identified.\n\nPublic Relations Officer of DI Khan Police Yaqoob Khan, in a statement, said, “Police are compiling a report for the identification of the deceased and arranging for the bodies to be handed over to their families.”\n\nAccidents are common on highways and motorways across Pakistan, caused by reckless driving, speeding, driver fatigue, and poor vehicle maintenance. Poor road conditions contribute to mishaps, while weak enforcement of traffic laws allows violations to go unchecked, worsening the situation.\n\nOn September 11, two women were killed, while four people were injured after a jeep they were travelling in plunged into a ravine in Mansehra. Two days prior, on September 9, five members of a family were killed in a road accident on the Hazara Motorway in Haripur. The accident took place when a trailer en route to Rawalpindi collided with a car near the Maqsood interchange on the motorway.\n\nIn July, five people lost their lives in a collision between a car and a truck on Chashma Road in DI Khan district.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/26124634a163f5e.webp",
  "retrievedAt": "2025-10-12T00:13:51.065Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944745/at-least-11-dead-3-wounded-as-truck-crashes-in-kps-di-khan-rescue-1122",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T08:09:27.000Z"
}
