{
  "title": "UK to launch digital ID scheme to curb illegal migration - World - DAWN.COM",
  "author": null,
  "content": "UK Prime Minister Keir Starmer on Friday announced plans for a new nationwide digital ID in a bid to curb illegal migration, but the move faces strong opposition in country that has long-resisted such moves.\n\nThe new digital ID will be held on people’s phones and there will be no requirement for individuals to carry or be asked to produce it, said the government.\n\nHowever, it will be “mandatory as a means of proving your right to work,” a statement said.\n\n“This will stop those with no right to be here from being able to find work, curbing their prospect of earning money, one of the key ‘pull factors’ for people who come to the UK illegally,” it added.\n\nThe government said the drive will also make it simpler to apply for services like driving licences, childcare and welfare, while streamlining access to tax records.\n\nThe announcement comes as Labour, the party in government, prepares to hold its annual conference, with Starmer under intense pressure, particularly over immigration.\n\n“Digital ID is an enormous opportunity for the UK … it will also offer ordinary citizens countless benefits,” Starmer said.\n\n“We are doing the hard graft to deliver a fairer Britain for those who want to see change, not division,” he added.\n\nThe UK has traditionally resisted the idea of identity cards and does not have a central civilian registry or identification requirements in public.\n\nThe Conservative-led government in 2011 repealed legislation by Tony Blair’s government that created voluntary national identity cards and a resident registry database.\n\nKemi Badenoch, leader of the opposition Conservatives, wrote on X that her party “will oppose any push by … the government to impose mandatory ID cards on law abiding citizens.\n\n“We will not support any system that is mandatory for British people or excludes those of us who choose not to use it from any of the rights of our citizenship,” she added.\n\nThe left-wing Liberal Democrats also said that they “cannot support a mandatory digital digital ID where people are forced to turn over their private data just to go about their daily lives”.\n\nAnd Nigel Farage, leader of the hard-right Reform UK party that polls predict will form the next government, said: “I do not see a single benefit to the government having digital ID other than them controlling what we do, what we spend and where we go.”\n\nA petition demanding that ID cards not be introduced had collected more than 650,000 signatures early on Friday, but recent polling suggests majority support for the move among the public.\n\nAt the moment, UK citizens generally use driving licences, passports and utility bills as means of identification, depending on the situation.\n\nThe government says is “will listen to a range of views on how the service will be delivered”, as part of a public consultation to be launched later this year.\n\nIt also promised that the scheme will be available for those who aren’t able to use a smartphone.\n\n“The public consultation will engage with groups who aren’t as experienced with the digital world, like the homeless and older people, learning from other countries that have done this well,” said the government statement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/26151548d5fbaa0.webp",
  "retrievedAt": "2025-10-12T00:13:49.883Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944760/uk-to-launch-digital-id-scheme-to-curb-illegal-migration",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T10:17:29.000Z"
}
