{
  "title": "US tells India that Russian oil curbs are key to trade deal progress - Business - DAWN.COM",
  "author": null,
  "content": "Trade negotiators from the United States have told their Indian counterparts that curbing purchases of Russian oil is crucial to reducing India’s tariff rate and sealing a trade deal, two people familiar with the talks told Reuters.\n\nWhile trade negotiations are on a positive track, a US official said, more work is needed to ensure India addresses US concerns over market access, the trade deficit and purchases of Russian oil.\n\nUS President Donald Trump has sought to pressure India, the European Union and members of Nato to curb purchases of Russian oil as a way to cut Moscow’s revenue and hasten an end to the war in Ukraine.\n\nThe Trump administration has shown a willingness to use maximum leverage to advance its policy goals, as evidenced by its linking trade negotiations with India to demands that it curb Russian oil purchases.\n\nTrump has expressed growing frustration over the slow progress toward ending Russia’s war in Ukraine, a conflict he pledged to resolve from his first day in office.\n\nThe US has already imposed an extra 25 per cent tariff on imports from India to pressure New Delhi to halt its purchases of discounted Russian crude oil, bringing total punitive duties on Indian goods to 50pc and souring trade negotiations between the two democracies.\n\nBut Trump has refrained from imposing additional tariffs on Chinese imports over China’s purchases of Russian oil, as his administration navigates a delicate trade truce with Beijing.\n\nIndia and China are the two largest buyers of Russian oil, which is already subject to numerous US sanctions that have constrained Moscow’s access to global markets.\n\nIn response, India has defended its oil imports, emphasising the economic benefits and accusing Western nations of hypocrisy for continuing trade with Russia despite sanctions.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:13:49.667Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944803/us-tells-india-that-russian-oil-curbs-are-key-to-trade-deal-progress",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T18:02:07.000Z"
}
