{
  "title": "ATC in Karachi sentences ‘RAW agent’ to life imprisonment - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: An anti-terrorism court (ATC) on Thursday sentenced a man, said to be an agent of the Indian intelligence agency Research and Analysis Wing (RAW), to life imprisonment on charges of waging war and conspiracy against the country.\n\nThe ATC-XV judge, who conducted the trial inside the judicial complex in Karachi central prison, convicted Muhammad Saleem and sentenced him to life imprisonment on three counts for offences under Sections 121-A (punishment for conspiracy to wage war or abetting waging of war against Pakistan), 122 (collecting arms, etc, with intention of waging war against Pakistan), and possession of explosive substances.\n\nThe court also handed down an additional 14-year imprisonment on terrorism charges and 10 years each for possessing unlicensed weapons and explosives. However, all the sentences shall run concurrently, the court ruled.\n\nThe accused appeared in court on bail and he was taken into custody after the pronouncement of the verdict.\n\nProsecution says Saleem illegally entered Pakistan from India in 1989; SIU arrested him in October 2024 with illegal weapons, explosives\n\n“In the present case hand grenade with detonator was recovered which proves that… if [it was] not recovered from the possession of accused could have been used for wreaking havoc upon innocent persons,” the judge write in the verdict.\n\nThe court noted that the record showed that during the interrogation, the accused disclosed that in 1989, he had illegally entered Pakistan after crossing the border and came to Karachi. Later, he had allegedly obtained a computerised national identity card and a Pakistani passport.\n\nSpeaking to Dawn, prosecutor Anila Malik said that during the trial, documents related to the accused’s travel history were produced before the court, which showed that he had travelled to India three times, in 2012, 2013 and 2014.\n\nShe added that the accused used to drive a rickshaw in India, however, after an accident in which he killed a child, he illegally entered Pakistan.\n\nThe prosecutor claimed that during the investigation, the documentary evidence revealed his links with agents in India and that he had been working at their behest.\n\nThe court noted in its order that the accused in his statement did not produce any justification to visit India on several occasions. It added that he had also not denied that in 1989, he had illegally entered the country.\n\nOn the other hand, the defence counsel argued during the trial that the prosecution had failed to establish any link between the accused and RAW. He pointed out that “no CRO [criminal] record is available against the accused and he is not a previous convict in any other case.”\n\nThe counsel contended that the prosecution had examined eight witnesses, but all of them were either policemen or relatives of the accused, while no private witness was produced.\n\nRejecting the defence pleas, the court observed that police officials were as competent witnesses as any other, unless the defence was able to successfully shatter their credibility or bring on record any mala fide intent on the part of the police to depose against the accused.\n\n“It is observed that in cases like present case wherein any people from public try not to indulge themselves as witness of the occurrence so as to avoid future enmity with the terrorists,” the verdict reads.\n\nIn October 2024, acting on a tip-off, the Special Investigation Unit (SIU) had apprehended the accused and seized grenades, a rocket launcher, 9mm pistols and several fake service cards of various departments from him.\n\nThe SIU had claimed that the accused was also found to be carrying multiple passports and identity cards under different names, while evidence and documents were found regarding the suspect going to India several times.\n\nThey claimed he had been operating in Karachi on behalf of RAW, allegedly gathering sensitive information and conducting subversive activities.\n\nThree separate FIRs were registered at the SIU police station under Sections 23(1) of the Sindh Arms Act 2013, Sections 4 and 5 of the Explosive Substance Act read with Section 7 of the Anti-Terrorism Act of 1997.\n\nPublished in Dawn, September 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:14:19.642Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944638/atc-in-karachi-sentences-raw-agent-to-life-imprisonment",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T00:17:36.000Z"
}
