{
  "title": "UK signs $468m deal to supply India with missiles - World - DAWN.COM",
  "author": null,
  "content": "Britain said on Thursday it had signed a £350 million ($468m) contract to supply the Indian army with UK-manufactured lightweight missiles, as part of a deepening weapons and defence partnership between the two countries.\n\nThe announcement came as British Prime Minister Keir Starmer was visiting Indian counterpart Narendra Modi in Mumbai, where the pair hailed the potential of the commercial links from their months-old trade deal.\n\nIn its statement on the defence deal, the British government said the new contract for Lightweight Multirole Missiles made by Thales in Northern Ireland would secure 700 jobs at a factory which currently makes the same weapons for Ukraine.\n\n“The deal paves the way for a broader complex weapons partnership between the UK and India, currently under negotiation between the two governments,” it said.\n\nStarmer has, over the last 12 months, thrown his weight behind Britain’s defence sector to try to drive higher economic growth, pledging to up spending in line with Nato targets, as well as focusing on winning exports, such as a recent $13.5 billion frigate contract with Norway.\n\nBritain also said on Thursday it reached a new milestone with India on a tie-up for electric-powered engines for naval ships as both countries signed the next phase of a deal, worth an initial £250m.\n\nStarmer’s visit, accompanied by the largest-ever business delegation, “reflects the new energy and broad vision” in the partnership, Modi said after talks with the British prime minister.\n\n“India’s dynamism and the UK’s expertise together create a unique synergy,” Modi said, speaking in Hindi.\n\n“Our partnership is built on trust … it is a clear reaffirmation of our shared commitment to … build a brighter future for the people of both our nations.”\n\nStarmer said the focus of his visit was about doubling down on the potential of the trade deal, expected to take effect within a year.\n\n“When we leave India tonight, I expect that we will have secured major new investments creating thousands of high-skilled jobs in the sectors of the future.”\n\nAn Indian foreign ministry statement said the two sides agreed to set up an India-UK connectivity and innovation centre and a joint centre for AI, and unveiled a critical minerals industry guild to bolster supply chains and promote green technologies.\n\nThey also announced joint investment in a climate technology startup fund and set up new collaborations on health and renewable energy, an offshore wind task force, and a health research partnership, among other things, it said.\n\nBut the two countries do not agree on everything.\n\nAfter Modi wished Russian President Vladimir Putin a happy birthday on Tuesday, Starmer joked to reporters that he would not be doing the same, given Britain’s strong backing for Ukraine and condemnation of Russia over its invasion.\n\nBritain says it respects India’s strategic independence and Scottish Secretary Douglas Alexander, a former trade minister who joined the delegation, told reporters the issue had not prevented Starmer from leveraging close ties with Modi to expand the UK economy.\n\nSeparately, Modi said flying instructors from the Indian Air Force would serve as trainers with the Royal Air Force, as part of their agreement for cooperation in military training.\n\nNew Delhi has for decades been dependent on Moscow for much of its military hardware but has slowly moved away in recent decades to buy from France, Israel, and the US.\n\nBritain said two UK universities had been given approval to open new campuses in India, which it said would help the UK expand its influence “without adding pressure to domestic migration figures”, as the government tightens rules around international students and has said more Indian visas weren’t on the agenda for talks.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/091607563f63d62.webp",
  "retrievedAt": "2025-10-12T04:22:47.984Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947680/uk-signs-468m-deal-to-supply-india-with-missiles",
  "dateList": "2025-09-26",
  "date_published": "2025-10-09T11:16:01.000Z"
}
