{
  "title": "Imaan Mazari files grievance letter over ‘inaction’ in workplace harassment case against IHC CJ Dogar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Rights activist and lawyer Imaan Zainab Mazari-Hazir on Friday filed a grievance letter over “inaction” on her workplace harassment complaint against Islamabad High Court (IHC) Chief Justice Sarfraz Dogar.\n\nJustice Dogar had warned Mazari of a contempt of court case and was reported to have gone as far as passing warning remarks along the lines of “getting a hold of her”. Multiple lawyers’ bodies had issued condemnatory statements and called for the judge’s dismissal from the post of the IHC top judge.\n\nOn Sept 15, Mazari approached an inquiry committee of the IHC and the Supreme Judicial Council (SJC), filing a complaint under Section 4 (procedure for holding inquiry) of the Protection against Harassment of Women at the Workplace Act 2010.\n\nAs Justice Saman Rafat Imtiaz took cognisance of Mazari’s complaint, the IHC administration stripped the judge of her powers to entertain harassment complaints. Instead, IHC’s Justice Inaam Ameen Minhas was appointed as the competent authority to oversee the case. This prompted Mazari to approach the Supreme Judicial Council (SJC) against Justice Dogar’s shunting of a female judge for taking up a harassment complaint against him.\n\nIn today’s letter, addressed to Justice Minhas — a copy of which is available with Dawn.com — Mazari said that the competent authority under the act was “required to communicate the charges to the accused within three days of receipt of the complaint, and the accused was required to submit a written defense within seven days from when the charge was communicated to him”.\n\n“I am unaware of the status of my complaint, as I have not been informed by the competent authority in this regard,” she wrote.\n\nMazari called for a “clear urgency” to address the matter, saying, “I request redressal of my grievances at the earliest.”\n\nShe also brought up the matter of Justice Imtiaz’s removal as the competent authority and the appointment of Justice Minhas as a replacement, saying the move was “unlawful” as the “accused cannot alter the competent authority or impede my complaint by abusing his position of authority”.\n\nShe also highlighted “continuing acts of reprisal” by CJ Dogar following the complaint. “As you must be aware, such reprisals are strictly prohibited under the 2010 Act, and as competent authority, you are required to ensure that I am not subjected to such reprisals,” she said.\n\nAccording to the letter, on Sept 16, Mazari’s client Mahrang Baloch’s case was fixed for a hearing before him, and Mazari’s proxy counsel requested a transfer of the case to any other bench due to the pending complaint.\n\n“The accused refused to transfer the case, requiring me to appear before him despite the fact that under the law, no woman subjected to such treatment would be required to be in the presence of her alleged harasser,” she wrote.\n\n“The aforementioned facts and circumstances clearly depict the brazen abuse of authority by the accused to shield himself from inquiry in my complaint,” she noted.\n\nMazari further said that her application seeking preservation of CCTV footage from the day of the incident remained “unanswered”, requesting “immediate intervention in securing this crucial evidence”.\n\nMazari had submitted an application to the IHC’s registrar for the preservation of CCTV footage of the “unfortunate incident” that took place with her.\n\nIn the application, she said: “I write to you today to seek [the] preservation of CCTV footage of the Honourable Chief Justice’s courtroom no.1 from September 11, 2025 between 9am and 11am, as an unfortunate incident took place with the undersigned counsel, as a result of which it is imperative that the exchange recorded on the CCTV footage is preserved.\n\n“I would also request [the] provision of a copy of the CCTV footage from the aforementioned date and time on the USB I have annexed herewith this instant application.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/26133537f5d6f74.webp",
  "retrievedAt": "2025-10-12T00:13:51.487Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944746/imaan-mazari-files-grievance-letter-over-inaction-in-workplace-harassment-case-against-ihc-cj-dogar",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T09:00:26.000Z"
}
