{
  "title": "FBR extends e-invoicing deadline for sales tax registrants - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) has extended the deadline for integration with its electronic invoicing system for all sales tax registered entities, following slow compliance and enforcement challenges.\n\nThe earlier deadline for phased integration was set to begin on Aug 1, but has now been extended through staggered deadlines starting from Oct 15 up to Dec 31, according to a notification issued under SRO1852 of 2025.\n\nDespite repeated official reminders, a significant number of registered sales tax entities continue to evade integration with the FBR’s electronic monitoring system. The issue has gained renewed urgency following a high-profile enforcement action in the federal capital.\n\nSaeed Book Bank, one of Islamabad’s most prominent retailers, became the centre of media attention after the Regional Tax Office (RTO) Islamabad issued formal notices demanding compliance with the FBR’s digital invoicing system. The store’s failure to integrate with the prescribed electronic platform ultimately led to the sealing of its premises — a move that has sparked debate over enforcement practices and business accountability.\n\nBusinesses now have staggered compliance dates till Dec 31\n\nTax authorities have reiterated that integration with the digital system is mandatory under current regulations, aimed at improving transparency and curbing tax evasion. However, resistance from certain quarters continues to pose challenges to the broader digitisation drive.\n\nThe FBR has issued a notification SRO1852 of 2025 to direct all sales tax registered to complete the registration and testing for integration of their hardware and software with the FBR’s computerised system through a licensed integrator or PRAL and shall issue electronic invoices, not later than the respective dates.\n\nThe rollout begins with public companies, and all importer, all of whom must complete registration by Oct 15, testing by Oct 25, and begin issuing e-invoices by Nov 1. Similarly, companies with turnovers exceeding Rs1 billion — declared in sales tax returns for the last twelve months — must also complete registration by Oct 15, testing by Oct 25, and begin issuing electronic invoices by Nov 1.\n\nCompanies with turnovers between Rs100 million and Rs1bn must complete registration by Oct 25, undergo testing by Oct 31, and begin issuing electronic invoices by Nov 15. Those with turnovers not exceeding Rs100m are required to register by Nov 15, complete testing by Nov 25, and start issuing electronic invoices by Dec 1.\n\nAll individuals and association of persons with turnover exceeding Rs100m declared in sales tax returns for the last 12 months are required to register by Oct 10, complete testing by Oct 25, and start issuing electronic invoices by Nov 1.\n\nMoreover, in the case of registered persons other than listed are required to register by Dec 10, complete testing by Dec 25, and start issuing electronic invoices by Dec 31.\n\nAccording to the notification, all specified sales tax registered entities are directed to must integrate their hardware and software with the FBR’s computerised system to ensure compliance and transparency in sales tax documentation. This move is part of the government’s broader digital enforcement strategy aimed at curbing tax evasion and improving revenue collection.\n\nPublished in Dawn, September 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:22:50.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944640/fbr-extends-e-invoicing-deadline-for-sales-tax-registrants",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T00:17:26.000Z"
}
