{
  "title": "Quetta ATC refuses to extend BYC chief Mahrang Baloch’s physical remand: lawyer - Pakistan - DAWN.COM",
  "author": null,
  "content": "An anti-terrorism court (ATC) in Quetta on Friday refused to extend the physical remand of Baloch Yakjehti Committee (BYC) chief Dr Mahrang Baloch and other organisers, according to the group’s lawyer.\n\nAdvocate Israr Jatak, a member of BYC’s legal team, told Dawn.com, “Quetta ATC-1 refused to extend the physical remand of five accused, namely Mahrang, Bebow Baloch, Sibghatullah Shahji, Beberg Baloch and Gulzadi and ordered them to be sent to jail on judicial remand.”\n\nIn a hearing presided over by Judge Muhammad Ali Mubeen, the Counter Terrorism Department (CTD) produced Mahrang and others in court today after the completion of their 15-day physical remand granted on September 11.\n\nAdvocate Shoaib Mengal, along with Advocate Jatak, appeared in the court on behalf of the accused.\n\nThe CTD requested the court for an extension to the physical remand of the accused, but Judge Mubeen refused, asking for the accused to be handed over to jail custody.\n\nOn September 11, a Quetta ATC judge extended the physical remand of Dr Mahrang and other organisers of the group on the police’s request.\n\nThe BYC is a Baloch advocacy group working against enforced disappearances since 2018. Mahrang, along with other BYC members, was arrested on March 22 on allegations of “attacking” the Quetta Civil Hospital and “inciting people to violence”. The arrests were made a day after the group faced a police crackdown while protesting against alleged enforced disappearances.\n\nShe was taken into custody under Section 3 of the Mainte­nance of Public Order (MPO) — a law that empowers authorities to arrest and detain individuals suspected of posing a threat to public order — for a period of 30 days (first term). Thereafter, her detention was extended for an additional 30 days (second term) through a decision of the Balochistan Home Department in April.\n\nAfter the BYC leaders had completed three months in custody in June, the provincial government issued a fourth extension order, extending their imprisonment by another 15 days.\n\nFollowing their detention under the MPO, cases were also registered against Mahrang and other BYC leaders under different sections of the Anti-Terrorism Act and the Pakistan Penal Code.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/261419467cbd0c9.webp",
  "retrievedAt": "2025-10-12T00:13:51.756Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944755/quetta-atc-refuses-to-extend-byc-chief-mahrang-balochs-physical-remand-lawyer",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T09:37:13.000Z"
}
