{
  "title": "Woman kidnaps newborn from Lahore’s Mayo Hospital - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: An unidentified woman allegedly kidnapped a newborn girl from the paeds ward of the Mayo Hospital on Thursday.\n\nThe baby was shifted to one of the major public healthcare facilities of Punjab from the Lady Aitchison Hospital for some tests recommended by the doctors.\n\nThe police rushed to the hospital on being informed of the incident by its administration and launched investigations.\n\nEarlier, a similar incident was reported in the Lahore General Hospital, where a woman kidnapped a newborn. The police had, however, arrested the woman and recovered the baby within 48 hours of the incident.\n\nAbout the fresh incident, a police official says that the wife of a Muridke resident, Qasim, delivered the baby two days ago in the Lady Aitchison Hospital.\n\nOn Thursday, he said, Qasim got his newborn baby admitted to the paediatric ward of the Mayo Hospital, where she was to undergo some tests.\n\nMeanwhile, as per the hospital sources, a woman allegedly dodged the security staff, entered the ward and took away the newborn.\n\nThe official says it is a matter of serious concern that the hospital administration took no special measures to avoid such incidents.\n\n“We examined the security cameras that captured the suspect (woman),” the police official says, adding that police teams have been deputed to trace the kidnapper woman with the help of more private and Punjab Safe Cities Authority cameras.\n\nThe Mayo Hospital CEO told the media that a committee has been constituted to identify the lapses and the negligence of the staff concerned.\n\nA senior doctor, Prof Imran Hassan, heads the committee, he said, adding that the police have also been asked to investigate the kidnapping incident.\n\nPublished in Dawn, September 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:14:17.809Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944606/woman-kidnaps-newborn-from-lahores-mayo-hospital",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T00:17:41.000Z"
}
