{
  "title": "Chaos at Sindh High Court hearing on IHC judge’s ‘disputed’ law degree - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Two-judge bench declines Justice Jahangiri’s plea to join proceedings\n• Insists court will first hear and decide maintainability of petitions\n• Petitioners and their lawyers walk out of courtroom, stage protest\n\nKARACHI: Heated sce­nes were witnessed at the Sindh High Court on Thursday as a two-judge bench dec­lined to entertain the plea of Islamabad High Court Justice Tariq Mehmood Jahangiri to become a party in proceedings on seven petitions, challenging the cancellation of his law degree.\n\nThe two-judge constitutional bench (CB) comprising Justice Mohammad Karim Khan Agha and Justice Adnan-ul-Karim Memon, however, set aside the IHC judge’s application, insisting that it would first hear and decide the maintainability of the petitions before it.\n\nJustice Jahangiri, accompanied by IHC Justice Saman Rafat Imtiaz, pleaded for a right of hearing, saying he was the aggrieved party and Karachi University (KU) had not issued him a notice before canceling his degree.\n\nLawyers for the petitioners, however, objected to the jurisdiction of the bench and urged the court to decide their objections first.\n\nThe proceedings drew a large number of lawyers inside and outside the courtroom, with many chanting slogans, clapping and later staging a protest outside the SHC against one of the judges.\n\nThe petitioners and their lawyers also walked out of the courtroom in protest over their objections not being addressed and the court’s refusal to entertain Justice Jahangiri’s plea.\n\nSome lawyers later claimed that the bench had dismissed the petitions for non-prosecution, though the written order is expected to be issued today (Friday).\n\nThe petitions had been filed last year by various bar associations, lawyers and a member of the KU syndicate, challenging decisions of the university’s Unfair Means Committee (UMC) and Syndicate that canceled Justice Jahangiri’s degree.\n\nIn September last year, the SHC had suspended, through an interim order, the KU decisions, restraining the university from taking coercive measures.\n\nThe court had observed that every citizen’s right to fair trial was protected but that no hearing had been provided to Justice Jahangiri before the cancellation of the degree, which appeared obj­ec­­tionable, illegal and without authority.\n\nThe petitions were fixed for Thursday’s hearing after the Sindh Higher Education Commission (SHEC) filed an urgent application seeking vacation of the interim stay order.\n\nJustice Jahangiri also appeared in person, filing an application to intervene in the proceedings. However, Justice Agha remarked that the court would first examine the issue of maintainability.\n\nSenior lawyer Faisal Siddiqui, representing a petitioner, questioned how the issue could be decided without hearing the aggrieved person.\n\nJustice Jahangiri introduced himself at the rostrum and reiterated that, as the affected party, he had a fundamental right to be heard.\n\nBarrister Salahuddin Ahmed pointed out that Justice Memon was also part of a division bench that, in September last year, had suspended KU’s cancellation order.\n\nHe added that the matter had originally been fixed before another constitutional bench headed by Justice Yousuf Ali Sayeed for Sept 30, but was later transferred without explanation to the present bench.\n\nHe argued that the matter should return to CB-II, as transfers of cases are the domain of a three-judge committee, and questioned how a constitutional bench could override an administrative order. Advocate Siddiqui also argued that the case should be heard by a regular bench rather than a constitutional bench.\n\nThe petitioners’ lawyers further questioned the SHEC’s urgent application, arguing that the commission itself had admitted it had no role in the matter and should be removed as a respondent. They expressed surprise that the SHEC was now seeking an urgent hearing.\n\nJustice Jahangiri told the bench that he had always upheld his oath as a high court judge, testifying that his degree was genuine. “I did not act as a puppet, nor did I make decisions at the behest of any sector commander,” he asserted.\n\nThe IHC judge, recently barred from exercising judicial powers by an IHC division bench, asked the SHC to grant him the right of hearing.\n\nThe petitioners and their lawyers, however, left after the bench maintained it would decide maintainability first.\n\nLater, speaking to the media, Barrister Ahmed demanded that the bench recuse itself, voicing strong resentment over the transfer of the case, the conduct of the hearing and the court’s refusal to hear the aggrieved judge.\n\nIn a pointed remark aimed at the ruling PPP, he said: “The Sindh High Court should remain a court of law and not turn into a ‘People’s High Court’.”\n\nPublished in Dawn, September 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:14:05.757Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944693/chaos-at-sindh-high-court-hearing-on-ihc-judges-disputed-law-degree",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T02:07:51.000Z"
}
