{
  "title": "Yamal dazzles again to inspire Barca comeback in epic against Inter - Sport - DAWN.COM",
  "author": null,
  "content": "BARCELONA: Inter Milan’s Denzel Dumfries may have been named Man-of-the-Match with his two goals and one assist but it was Barcelona youngster Lamine Yamal everybody was talking about again after the teams’ 3-3 draw in a Champions League semi-final for the ages.\n\nComparisons to Lionel Messi were aple­nty after the teenager had dazzled once more, not only scoring an important goal but tormenting the Inter defence throughout the night and hitting the crossbar twice as the Catalans came back from two goals down to leave the tie in equilibrium ahead of the return leg in Milan next Tuesday.\n\nAfter witnessing from the touchline how Yamal pushed his Inter lineup to the limit, Simone Inzaghi said talents like the 17-year-old come around only once in a half century.\n\n“He’s the kind of talent who is born every 50 years, I had never seen him live and he really impressed me today,” the Inter coach said. “Lamine Yamal caused us so many problems in the last 25 minutes of the first half, we doubled up him… and then we lacked players elsewhere on the pitch…\n\n“Barca are a team of fantastic players and to come here and play a game like this, against the most offensive and most beautiful team in the world must make us proud. We could also have won it but we were playing against a team that has a phenomenon of the kind born every 50 years.”\n\nBarcelona coach Hansi Flick described his player as “a genius” after Yamal put on his latest talent show in his 100th game for the club’s senior squad.\n\n“He’s special. I’ve said it before, but he’s a genius,” Flick said. “In the big matches, he shows up, and I think he enjoyed the situation. I’m really happy that this talent, if it only comes every 50 years like Simone said, I’m glad it’s for Barcelona.”\n\nIt was Barcelona’s first semi-final since 2019, and the team powered by teen spirit, shorn of injured top goalscorer Robert Lewandowski came up against an experienced, wily side, runners up in 2023 and looking to go one better this time.\n\nIt has been a decade since the Catalan giants last reached the final, winning in Berlin with Lionel Messi as their omnipotent leader, and Barcelona are dreaming of a return to Germany for the Munich final on May 31.\n\nAfter Marcus Thuram and Dumfries produced two outstanding finishes even the most resolute fans started to wonder if this was a bridge too far.\n\nInter had lost their previous three mat­ches without scoring a goal — the first time that had happened in more than 13 years. That run had seen them surrender their Serie A lead and exit the Coppa Italia.\n\nThuram had missed those three matches with a left thigh injury. Dumfries had been sidelined for even longer, missing eight matches with a hamstring problem before returning as a late substitute last weekend.\n\nThe duo immediately showed Inter what it had been missing as Thuram back-heeled in a cross by Dumfries to stun Barcelona just seconds after kickoff. Dumfries then doubled Inter’s lead in the 21st minute with a bicycle kick.\n\nFear tried to set in but Yamal was too quick for it. Three minutes after Inter’s second, he struck. After all, he said on the eve of the game he had left his fears behind playing in the park in his hometown of Mataro.\n\nThe winger, on his 100th appearance for the club, showed strength to shrug off Thuram, skill and speed to ditch Henrikh Mkhitaryan and then, putting the ball on his left foot, he curled a shot past the turning heads of at least two more Inter players. The ball smacked the far post and was cradled in the net.\n\nThat goal made Yamal — at 17 years, 291 days — the youngest scorer in a Champions League semi-final.\n\nHe went so close to bettering that moments later when he glided past two defenders and sliced a shot from a sliver of an angle off the crossbar.\n\nYamal fed passes to Ferran Torres and Dani Olmo for back-to-back shots that Inter goalkeeper Yann Sommer saved before Raphinha took over and headed a ball down for Torres to ram home for 2-2 before halftime.\n\nDumfries notched his second in the 64th, heading home a corner kick to put Inter back ahead. However, Barca were quickly back level when Raphinha’s blistering shot from outside the top of the box struck the crossbar and ricocheted in off the back of Sommer, going down as an own goal.\n\n“We had a good game,” Dumfries said. “I think after three straight defeats we saw the real Inter, playing with heart. I’m proud of us. Obviously we wanted to win but I think it was a good game and everything’s still open, we’ll see at San Siro.”\n\nYamal was disappointed that Barca’s final push for a winner came up short. He said he appreciated the praise but just wanted to focus on the next match with a European Cup just two wins away.\n\n“I am happy to have helped the team, and now we need to go for more,” Yamal said. “We knew we could have won the game but now we are just focused on the second leg and going through.”\n\nFresh from providing two superb assists in the Copa del Rey final as Barca beat Real Madrid, Yamal had dismissed any comparison to Messi in his first press conference for his club a day before Inter came to town, and then he went on to score a goal typical of the Argentine.\n\nLike Messi so often did, the fearless teenager has a knack for delivering at key moments in the crucial games.\n\nIt was reminiscent of his Euro 2024 semi-final goal against France, pulling Spain level after Les Bleus had opened the scoring, on the way to winning the trophy.\n\nYamal has 15 goals and 24 assists in 49 appearances this season, but beyond the numbers — behind Lewandowski and Rap­h­inha for goal contributions — what makes him truly special is the thrills he provides.\n\nIn that regard he is more like Brazil star Neymar than Messi, in his penchant for the spectacular and ease with which he pulls off tricks.\n\n“I try and enjoy myself, I think that is the secret, to enjoy it,” Yamal, who made his debut at 15, said.\n\nAs Neymar did while at Barca, Yamal dyed his hair blond last week.\n\n“I do it so the time ahead of the game passes quicker… I do it because I’m bored at home,” he explained.\n\nEveryone else will be too, counting down the days until the second leg.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681402ea09a1e.gif",
  "retrievedAt": "2025-08-23T08:11:53.395Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907865/yamal-dazzles-again-to-inspire-barca-comeback-in-epic-against-inter",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:43.000Z"
}
