{
  "title": "Iran must ‘walk away’ from all uranium enrichment, Rubio says - World - DAWN.COM",
  "author": null,
  "content": "Iran has to ‘walk away’ from uranium enrichment and long-range missile development and it should allow American inspectors of its facilities, US Secretary of State Marco Rubio said on Thursday as a round of nuclear talks was postponed.\n\nRubio’s comments underscore the major remaining divisions in talks between the countries to resolve the long-running dispute over Iran’s nuclear programme, with US President Donald Trump threatening to bomb Iran if there is no agreement.\n\n“They have to walk away from sponsoring terrorists, they have to walk away from helping the Houthis (in Yemen), they have to walk away from building long-range missiles that have no purpose to exist other than having nuclear weapons, and they have to walk away from enrichment,” Rubio said in a Fox News interview.\n\nIran has repeatedly said it will not give up its missile programme or its uranium enrichment — a process used to make fuel for nuclear power plants but which can also yield material for an atomic warhead.\n\nOn Thursday, a senior Iranian official told Reuters that the scheduled fourth round of talks due to take place in Rome on Saturday had been postponed and that a new date would be set “depending on the US approach”.\n\nRubio said Iran should import enriched uranium for its nuclear power programme rather than enriching it to any level.\n\n“If you have the ability to enrich at 3.67 per cent, it only takes a few weeks to get to 20pc, then 60pc, and then the 80 and 90pc that you need for a weapon,” he said.\n\nIran has said it has a right to enrich uranium under the terms of the nuclear Non-Proliferation Treaty.\n\nIt denies wanting to build a nuclear bomb.\n\nRubio also said Iran would have to accept that Americans could be involved in any inspection regime and that inspectors would require access to all facilities, including military ones.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:11:24.311Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907979/iran-must-walk-away-from-all-uranium-enrichment-rubio-says",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T11:47:08.000Z"
}
