{
  "title": "Rs527m plan to provide hot meals to 11,000 primary students in Karachi schools - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government and World Food Programme (WFP) will co-finance a one-year pilot School Meals Project in Malir District for 2025-26 academic session with Rs578.39 million.\n\nThe plan aims at providing daily hot meals to 11,000 primary school students, till class five, to improve learning, attendance and nutrition.\n\nSindh Chief Minister Syed Murad Ali Shah and WFP Country Director Ms Coco Ushiyama discussed the project along with other collaborative efforts in maternal and child healthcare sectors at a meeting held at the CM House.\n\nThe meeting participants focused enhancing ongoing initiatives such as the nashonuma and mamta programmes and decided on a joint effort to combat malnutrition and improve school retention through a new school-feeding scheme, said a statement on Thursday.\n\nThe Sindh government will contribute Rs462.71 million (80 per cent) while the WFP will provide Rs115.68 million (20pc). This initiative is designed to combat classroom hunger, enhance concentration and academic performance, and reduce gender disparities by incentivising girl’ education.\n\nCM says Sindh govt-WFP pilot initiative aims to reduce malnutrition in schoolchildren\n\nA centralised kitchen system will be established for meal preparation, packaging, and distribution. The meals will include lentils, rice/bread, vegetables, and a weekly serving of fruit.\n\nThe Sindh Food Authority, along with a dedicated Food Safety Officer, will ensure hygiene and nutritional standards. The WFP will oversee implementation through a third-party contractor and will lead monitoring, evaluation and reporting.\n\nThe pilot project will specifically target peri-urban schools in Malir that have basic infrastructure, clean water, and sanitation facilities. Schools must also meet minimum student enrolment thresholds.\n\nA robust monitoring system will track key metrics such as enrolment, retention, and attendance, to maintain 70 pc daily attendance. The WFP will conduct baseline and endline evaluations to inform potential scaling-up across Sindh. Data from the Education Management Information System (EMIS) and school records will be utilised to measure impact.\n\nThe CM emphasised that beyond educational benefits, the project is expected to reduce malnutrition, stimulate local job creation through food procurement and strengthen community food systems. He also highlighted the programme’s potential to empower girls by providing targeted incentives and improving school participation.\n\nThe project will offer crucial insights into sustainable school meal delivery models and guide future efforts for scaling up across Sindh, said Murad Shah.\n\nMs Ushiyama provided an overview of WFPs current programmes in Sindh, with a special emphasis on maternal and child nutrition (MCN). She discussed areas, including stunting, wasting, conditional cash transfers (CCT), and food supplement distribution to address malnutrition.\n\nChief Minister Murad Ali Shah expressed appreciation for WFPs contributions and shared details of the Sindh governments health-focused initiatives.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:11:41.207Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907858/rs527m-plan-to-provide-hot-meals-to-11000-primary-students-in-karachi-schools",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:56.000Z"
}
