{
  "title": "Indian forces continue house raids, search operations in occupied Kashmir - Pakistan - DAWN.COM",
  "author": null,
  "content": "Indian forces on Friday raided and searched over a dozen houses in different areas of Srinagar in occupied Jammu and Kashmir.\n\nThe April 22 attack in occupied Kashmir’s Pahalgam killed 26 people, mostly tourists, marking one of the deadliest assaults in the region since 2000. India has implied cross-border links without evidence, while Pakistan’s civilian and military leadership have rejected the accusation and called for a neutral probe.\n\nThe Indian police continued their operations on the orders of the Indian Home Ministry and lieutenant governor Manoj Sinha under the Unlawful Activities (Prevention) Act (UAPA), according to Kashmir Media Service.\n\nDuring search operations, the Indian forces seized house and bank documents, mobile phones and other digital devices from the residents.\n\nAll Parties Hurriyat Conference (APHC) spokesman Advocate Abdul Rashid Minhas expressed concern over the unsettling atmosphere created by house raids, looting of house goods and attacking properties.\n\nHe urged the United Nations to take immediate notice of the deteriorating situation in the occupied territory and resolve the Kashmir dispute according to the UN resolutions and aspirations of the Kashmiri people.\n\nFollowing the Pahalgam incident, Indian troops and paramilitary forces escalated operations across the valley, carrying out widespread house raids and arbitrary arrests.\n\nLast week, Indian soldiers blew up the family homes of two men who police alleged were among a gang that carried out the attack.\n\nThe Indian forces arrested more than 2,000 Kashmiris and demolished several homes in a sweeping crackdown by Monday.\n\nMeanwhile, the Azad Kashmir government called on residents near the border with India to stockpile food.\n\n“Instructions have been issued to stock food supplies for two months in the 13 constituencies along the Line of Control (LoC),” AFP quoted AJK Prime Minister Chaudhry Anwar ul Haq from the local assembly on Friday.\n\nThe regional government has also created an emergency fund of one billion rupees ($3.5 million) to ensure the supply of “food, medicines and all other basic necessities” to the 13 constituencies, he said.\n\nGovernment and privately owned machinery were also being deployed to maintain roads in the areas along the LoC, he added.\n\nFearing a military escalation, authorities also shut more than 1,000 religious schools for 10 days on Thursday in Kashmir.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/02150420310b5da.jpg",
  "retrievedAt": "2025-08-23T08:11:24.052Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907966/indian-forces-continue-house-raids-search-operations-in-occupied-kashmir",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T10:48:15.000Z"
}
