{
  "title": "Rain turns weather in twin cities pleasant - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Heavy rains accompanied by gusty winds in the twin cities of Rawalpindi and Islamabad on Thursday evening provided relief to the people facing heatwave for the last one week.\n\nEarlier, in the day, temperature swelled to 36 degree Celsius but in the evening, gusty winds and rain brought the temperature down to 26 degree Celsius.\n\nThe gusty winds in the twin cities uprooted many trees on Old Airport Road, Jhelum Road, G.T. Road, Peshawar Road, Islamabad Expressway, Karnal Sher Khan Road and other areas.\n\nFortunately, there have been no reports of loss to public life or property at the time of filing this report.\n\nA Met Department official said that his department recorded 35 knots (70 km per hour) wind from north to west at Zero Point, 64 knots (128 km per hour) at Islamabad International Airport while 52 knots (104 km per hours) from north to west in Chaklala, Rawalpindi.\n\n“Moist currents are penetrating upper parts of the country. A shallow trough of westerly wave is affecting upper parts of the country and it will continue till May 4,” he said.\n\nHe said that rain, windstorm/thunderstorm is expected in Kashmir, Khyber Pakhtunkhwa, Potohar region, Islamabad, Northeast/Central Punjab and Gilgit-Baltistan. Isolated hailstorm/heavy falls may also occur during this period. Dust/Wind/thunderstorm-rain is expected at isolated places in upper Sindh and northeast Balochistan during evening/night.\n\n“Wind-thunderstorm/hailstorm and lightning may damage loose structures like (electric poles, trees, vehicles and solar panels, etc.) till May 4,” he said. However, he said, the intensity of the wind will reduce in coming days but stressed the need for adopting precautionary measures.\n\nThe Met Office recorded 8 mm rain at Shamsabad and 8 mm at Chaklala in Rawalpindi while 9 mm at zero Point, 8 mm at Saidpur, 3 mm at Bokra and 7 mm at Golra in Islamabad.\n\nOn the other hand, Water and Sanitation Agency (Wasa) imposed rain emergency in Rawalpindi and deployed staff and machinery along Leh Nullah and low lying areas in the garrison city for round the clock in three shifts till May 4.\n\nWasa Managing Director Saleem Ashraf told Dawn that all the emergency staff had been asked to remain on duty to deal with any emergency. He said that the city was divided in four sectors and the teams would be remained alert in 10 areas which had been declared vulnerable.\n\nHe said that all the machinery had been deployed in low lying areas especially around Leh Nullah to stop water logging. He said that the water level will remain low on Thursday.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6813dd7a8d0ef.jpg",
  "retrievedAt": "2025-10-12T02:50:59.711Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907830/rain-turns-weather-in-twin-cities-pleasant",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:33:10.000Z"
}
