{
  "title": "AJK steels itself for possible escalation - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Tourists stopped from entering Neelum Valley, other areas near LoC\n• Govt orders religious seminaries to shut for 10 days\n• Sections of Karachi, Lahore airspace will remain closed for eight hours daily throughout the month of May\n\nMUZAFFARABAD / RAWALPINDI: With the threat of an Indian escalation looming over Azad Jammu and Kashmir (AJK), its prime minister indicated on Thursday that his government was considering imposing an emergency in the territory if something untoward happens.\n\nAlso on Thursday, authorities stopped tourists from entering Neelum Valley and other sensitive areas near the Line of Control (LoC) in view of the security situation.\n\nThe government has ordered all religious seminaries in the region to remain closed for 10 days, while the owners of hotels, guesthouses, restaurants, and marriage halls have pledged to place their establishments at the military’s disposal in case India launches an attack.\n\nMeanwhile, Pakistan announced that certain sections of airspace over the two largest cities — Karachi and Lahore — will remain closed for eight hours a day throughout the month of May.\n\nIn addition, flights to and from destinations in Gilgit-Baltistan continued to face disruptions due to the closure of airspace in that region.\n\nPreparedness plans\n\nSpeaking during a session of the Legislative Assembly on Thursday, AJK Prime Minister Chaudhry Anwarul Haq said his administration was monitoring the situation on the Indian frontier.\n\nHe assured the House that his government had made arrangements to ensure the availability of food, medicines, and other basic necessities in the 13 constituencies located along the LoC.\n\n“We have established an Emergency Response Fund and transferred Rs1bn into it… arrangements have been made to ensure food, medicines, and other essential supplies,” he said, adding that administrations and residents in the border areas had been directed to stock rations for two months.\n\nIn addition, official and private machinery was being deployed to keep roads open in the LoC constituencies of Neelum, Jhelum, Poonch, Haveli, Kotli and Bhimber.\n\nAdditionally, the State Disaster Management Authority, Rescue 1122, and Civil Defence had been directed to remain prepared for any emergency.\n\nStating that India had been exposed before the world as a terrorist state, Mr Haq urged the nation to remain vigilant, warning that the “vile adversary could resort to any ghastly act.”\n\n“I assure you that if India commits any kind of aggression, the government, the people, and all political and religious parties and leaders are fully prepared to respond to its aggressive designs,” he said.\n\nMr Haq added that Indian occupation forces had resorted to unprovoked firing along the LoC on Thursday and had been given a strong and timely response by the army.\n\nLater in the day, PM Haq hosted a multi-party meeting at his official residence, where participants, including leaders from outside the Legislative Assembly, ren­ewed the resolve to teach India a befitting lesson in the event of any aggression.\n\nRestrictions\n\nAlso on Thursday, authorities began stopping tourists from entering the Neelum Valley and other sensitive areas near the LoC.\n\nMany visitors who were unaware of the fresh restrictions were turned back from the Marbal checkpost, and even AJK residents who were not local to these areas were stopped from proceeding further.\n\nIn Leepa Valley, officials advised residents to avoid areas near the LoC and urged them to cooperate with law enforcement agencies to ensure their safety.\n\nSeparately, the government ordered all religious seminaries to remain closed for 10 days, citing a heatwave.\n\nHowever, official sources indicated that the decision was based on intelligence rep­orts suggesting India mi­ght target such institutions, under the pretext\n\nof hitting militant training centres. “We are dealing with such a cunning, cruel, and conspiratorial enemy that no vile act can be ruled out,” said Minister for Law Mian Abdul Waheed.\n\nIn a related development, the Joint Action Committee of Hotels, Guesthouses, Restaurants, and Marriage Halls of AJK held an emergency meeting to express solidarity with the army.\n\nChaired by Raja Ilyas, the meeting included members from Kotli, Mirpur, Bagh, Rawalakot, and Neelum, some of whom joined via video link.\n\nParticipants pledged to hand over their establishments to the Pakistan Army through the AJK prime minister if India launched an attack.\n\nAirspace closures\n\nPakistan has also decided to close certain sections of the airspace over Karachi and Lahore between 8am and 4pm (local time) for the month of May “due to operational reasons”.\n\nThe restrictions will not be applicable on Sundays.\n\nNew Delhi had earlier closed its airspace to Pakistani planes on Wed­nesday, a few days after Islamabad banned Indian planes from overflying.\n\n“Affected routes are located between flight levels 9,000 and 25,000 feet,” according to the latest Notice to Airmen (Notam) issued by the Pakistan Civil Aviation Authority (PCAA).\n\nThe decision affects selected corridors within the FIRs rather than a complete shutdown, and is being implemented as a precautionary security measure, officials added.\n\nAlthough authorities say the closure will not significantly disrupt commercial flight operations, as aircraft will be rerouted via alternative flight paths during the restricted hours, these hours are considered peak times for domestic flights.\n\nThe closure comes in addition to restrictions already in place in the skies over Gilgit-Baltistan, as PIA flights from Islamabad to Gilgit-Skardu were cancelled for a second day on Thursday. The airspace was unavailable between 1:30am and 10pm on Thursday.\n\nSeparately, rain and windstorms in northern parts of Pakistan disrupted the flight schedule, with as many as five international and domestic flights delayed and diverted to other cities due to bad weather in Islamabad.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:12:09.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907876/ajk-steels-itself-for-possible-escalation",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:20.000Z"
}
