{
  "title": "Punjab health dept to hire daily-wage doctors to keep hospitals functional - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE/Rawalpindi: As the Young Doctors’ Association (YDA) Punjab chapter on Thursday threatened to shut down indoor services at all the public sector hospitals across the province from the coming Monday, the health department issued an order to hire doctors on daily wages to keep the healthcare facilities fully functional, besides terminating services of 12 more young doctors.\n\nThe health authorities have already cancelled leaves of all doctors and nurses in the province.\n\nHolding a presser in Lahore, the YDA Punjab leaders announced expanding their agitation province wide in response to the terminations and suspensions of young medics and nurses by health authorities, saying they were not be afraid of the departmental punishments, victimisation and arrests by police.\n\nMeanwhile, senior representatives of the Punjab Nurses Association (PNA) and the Pakistan Medical Association (PMA) also came forward in the YDA’s support.\n\nEarlier, the young medics shut down the OPD services at different public sector hospitals in the province for the last 10 days, while the government responded by terminating services of 17 doctors and nurses for denying treatment to patients.\n\nYDA Punjab warns of closure of indoor services from Monday\n\nYDA Punjab chairman Dr Salman Haseeb told journalists on Thursday that the Lahore police lodged two cases against more than 400 employees of the government hospitals who were protesting peacefully against the outsourcing of the health facilities.\n\nHe said the police allegedly tortured and arrested many employees, including the YDA leaders.\n\nHe also condemned the actions of the health department, saying the employees reserved the right to lodge a protest for their “legitimate demands” under the law of the land.\n\nThe YDA leaders and nurses urged three-time former premier Nawaz Sharif and Chief Minister Maryam Nawaz to intervene and resolve the issue on the table.\n\nThey alleged that some elements in the health department were misleading the Punjab government by distorting facts regarding demands of the protesting employees.\n\nThey said that they were ready for negotiations with the government representatives only. To a question, the YDA Punjab chairman said that all the health sector employees, including doctors, nurses and paramedics, have decided to close down the indoor services at all the state-run hospitals from coming Monday, if their demands were not accepted.\n\nThere are reports that the Punjab health department has terminated services of more than 30 young doctors and nurses so far for closing down OPD services at the state-run hospitals and denying treatment to patients. A senior official of the Rawalpindi Medical University (RMU) told Dawn that the RMU called a meeting of professors and the administrations of the Holy Family Hospital (HFH), Benazir Bhutto Hospital (BBH) and Rawalpindi Teaching Hospital (RTH) to deal with the situation following the YDA announcement of shutting down indoor services at the hospitals across Punjab.\n\nHe says that doctors from tehsils have been brought to run the OPDs in the major hospitals and disciplinary action has been taken against the YDA’s local leadership for not performing duties.\n\nOn the other hand, YDA’s Rawalpindi chapter president Dr Aarif Aziz says that his services were terminated by BBH administration and of the association’s secretary general Dr Fakhar has been suspended from the service.\n\nHe says the YDA’s general meeting has been called on Friday (today) to chalk out a plan to deal with the new situation. However, he says, no strike was observed in emergency and other wards in any hospital in Rawalpindi.\n\nHe says that the doctors are protesting against the “wrong decision” of the government and instead of victimising them, the government should sit on the table and resolve the issue.\n\n“We are not demanding salaries, but we are struggling to save the public sector hospitals from the contractors,” he says.\n\nHe says that outsourcing means patients will be deprived of affordable treatment. He added that medical education and training will also be negatively affected and employment and working conditions of doctors will deteriorate because of outsourcing health facilities.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:11:39.259Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907844/punjab-health-dept-to-hire-daily-wage-doctors-to-keep-hospitals-functional",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:33:03.000Z"
}
