{
  "title": "Six drown as boat capsizes in Khanpur dam - Pakistan - DAWN.COM",
  "author": null,
  "content": "HARIPUR: Six members of a family drowned when the boat they were riding overturned in Khanpur Dam due to heavy winds that lashed the area here on Thursday afternoon.\n\nPolice and eyewitnesses said that a family from Peshawar was on a picnic to the dam and decided to take a boat ride and when the their boat reached the middle or the reservoir, heavy winds started blowing and the boat overturned.\n\nLocal divers rushed to the site of accident and rescued five members of the family who were identified as Shakila Naz wife of Shakil, Awais, 3, Yasir son of Sher Rehman, 12, and Hafsa, 7, d/o Shakil and the boat driver Khalid. While Suleman, 20, son of Shakil Ahmed, went missing and despite efforts he could not be found, SHO Khanpur police station Haroon Khan told Dawn.\n\nWhen approached for comment, the president Boats Association Khanpur, Raja Hanif Ahsan Kiyani, said that heavy winds caused the accident. He added that all the picnickers were wearing life jackets.\n\nHe told Dawn that the winds were so heavy that several boats and jetties on the reservoir bank were also damaged after colliding with each other.\n\nMeanwhile in another rain and heavy winds related incident a teenage boy was killed while his two cousins were injured critically when the boundary wall of their house fell on them in village Sarahdna in Khanpur area.\n\nPolice and hospital sources said that the boys were playing in the street when heavy winds started blowing coupled with downpour and the boys moved near the brickwall of their home to take shelter but it fell burying them all.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:11:28.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907816/six-drown-as-boat-capsizes-in-khanpur-dam",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:33:15.000Z"
}
