{
  "title": "Labour Day observed in Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Thousands of workers of different organisations observed the International Labour Day in Quetta and other parts of Balochistan on Thursday and held rallies demanding increase in their salaries, ratification of ILO C-176, workers welfare fund, social security, inclusion of mine workers in EOBI and reducing the age limit of workers from 55 to 50 for retirement benefits.\n\nThe workers of All-Pakistan Labour Federation, Pakistan Central Mines Labour Federation and other unions gathered at the Quetta Press Club to observe the day.\n\nAddressing the participants, labour leaders paid tribute to workers of the Chicago Labour Movement of 1886, where workers laid down their lives demanding an eight-hour workday and other facilities for workers.\n\nAddressing the rally, the leaders demanded the government to increase monthly salaries and wages in accordance with rising inflation and ratify the ILO Convention C-176 on safety of mine workers.\n\nThere was a strong call for extending Worker Welfare Fund benefits and coverage of social security, and Employees’ Old-Age Benefits Institution (EOBI) to mines’ workers.\n\nThe leaders also insisted that the pension age for mines’ workers should be reduced from 55 to 50 years, considering the hazardous nature of their work.\n\nEmployees of the Government Printing Press appealed for provision of utility and house rent allowances.\n\nFurther demands included concrete measures to eliminate child labour, improved healthcare and life insurance coverage for workers of Qesco and mining sectors and immediate regularisation of daily wage employees at Utility Stores Corporation as ordered by the high court.\n\nSimilar rallies were held in Dera Murad Jamali, Gwadar, Hub, Khuzdar, Loralai, Sibi, Pishin and other towns and cities of the province.\n\nAli Jan Mangi from Nasirabad, Abdul Wahid Shahwani from Khuzdar and Behram Baloch from Gwadar also contributed to this report\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:51:05.270Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907904/labour-day-observed-in-balochistan",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:32.000Z"
}
