{
  "title": "Shahid Khaqan Abbasi opposes use of force for political stability - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Former prime minister and Awam Pakistan Party (APP) chief Shahid Khaqan Abbasi has opposed the use of force as a means to restore political stability in the country, arguing that such issues should be addressed through meaningful negotiations to end hatred and uncertainty.\n\nSpeaking at a joint press conference at Sarawan House on Thursday, alongside former senator Nawabzada Lashkri Raisani, Mr Abbasi emphasised that the genuine representatives of the people should be entrusted with resolving Balochistan’s longstanding issues. He criticised the establishment of the “Form 47 government”, asserting that only authentic public representation could bring real change.\n\nFormer Khyber Pakhtunkhwa governor Sardar Mehtab Abbasi, former federal minister Humayun Aziz Kurd and other political figures were also present during the press conference.\n\nMr Abbasi said the “Form 47 government” had failed to deliver anything to Balochistan or to Pak­istan at large.\n\nHighlighting the province’s continued suffering over the past 15 years, he pointed to recent tragic events, including the hijacking of a train — a scenario he described as unthinkable in the 21st century.\n\nHe said that despite the presence of numerous security check posts in and around Quetta, people still felt unsafe. The former PM asserted that Pakistan could only progress if the Constitution was implemented in letter and spirit.\n\n“It is not possible for Pakistan to prosper while Balochistan remains impoverished,” Mr Abbasi said. He said that true peace could not be restored until Balochistan’s reso­urces were used to benefit the province’s youth.\n\nOn the occasion, Mr Raisani expressed concern over the recently-passed Mines and Minerals Act 2025, calling it a gross violation of the Constitution and the 18th Amendment.\n\nHe warned investors that any agreements made under the act would be annulled when an opportunity arises, rendering such investments void.\n\nHe said the law was passed with the collaboration of both government and opposition figures, adding that the law had drawn opposition from both religious and nationalist leaders in Balochistan.\n\nHe also condemned the federal government for selling the Reko Diq project to foreign entities under what he described as a non-representative setup.\n\nHe said that 99 per cent of the elected representatives were the product of “Form 47” manipulation, and that the act had shattered the hopes of Balochistan’s future generations, who had long looked to their province’s natural resources for progress and prosperity.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:50:44.723Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907905/shahid-khaqan-abbasi-opposes-use-of-force-for-political-stability",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:32.000Z"
}
