{
  "title": "Old friends in three-way contest for PFF presidency - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: The race to become Pakistan Football Federation’s first elected president in almost six years has begun in earnest.\n\nAmong the three contestants for the post — after the PFF Normalisation Committee released the final list of candidates after the completion of the scrutiny process — are old friends Taha Alizai and Mohsen Gilani, who have been actively involved in Pakistan football for decades.\n\nThen, there is Haji Zakaullah, a relative novice who has come to the fore after being influential in the organisation of the game in his district of Gujranwala and emerged as a contender after garnering support from the Punjab province.\n\nThe elections, due on May 20, are set to bring an end to a FIFA-initiated normalisation process that began in September 2019, following years of turmoil in the country’s football governing body.\n\nThe incoming president will have to immediately put the house in order, specifically the restoration of domestic foo­t­ball, with events having been few and far between during the NC’s tenure.\n\nThe new PFF chief will also have to deal with several forces that have for long tried to introduce a franchise league system but have been so far unsuccessful without an elected leadership at the helm of the country’s football governing body.\n\nMost importantly, the new president will also have to ensure more growth opportunities for the national teams, with the men’s side currently participating in the qualifiers for the 2027 AFC Asian Cup.\n\nThe bigger question is about who of the three will win the race.\n\nMohsen and Taha hold decades of experience in organising and developing the sport. The former is a former FIFA development officer while the latter is the founder of Karachi United FC — the first club in the country to run on professional lines.\n\nBoth of them supported Zahir Shah in his battle for power with Faisal Saleh Hayat, the long-time PFF chief recognised by FIFA until the appointment of the NC.\n\nThey were both alleged to have been influencing the first iteration of the NC led by Humza Khan — a notion they both have dispelled — and they fell out soon after the composition of the NC was changed.\n\nZahir Shah seemed to be the front-runner heading towards the long-due elections, with Mohsen having made his intentions clear earlier that he would be running separately.\n\nTaha’s candidacy came to the fore once the PFF Disciplinary Committee imposed a 10-year ban on Zahir Shah last month.\n\nWith each candidate requiring five nominations each from the 25-member PFF Congress, it is believed that both have some sort of support from the powerful government-backed departments that bring a total of seven votes to the election.\n\nWith Mohsen also having submitted his candidacy for one of three vice-president positions, the old association might still come together and leave Zaka clinging on to little hope of winning the election.\n\nHowever, the PFF has seen a fair share of drama over the years and with a secret ballot to decide the presidency, it may still be anyone’s game.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:50:39.363Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907863/old-friends-in-three-way-contest-for-pff-presidency",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:43.000Z"
}
