{
  "title": "KU teachers demand probe into ‘KWSC negligence’ over pipeline burst - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Kuts, Fapuasa seek compensation from Sindh govt for damages incurred by KU and its staff\n• Water utility claims ruptured line to be repaired by tomorrow\n\nKARACHI: The Federation of All Pakistan Universities Academic Staff Association (Fapuasa) and Karachi University Teachers’ Society (Kuts) have called upon the Sindh chief minister to take notice of what they called “inexcusable negligence” of the Karachi Water and Sewerage Corporation (KWSC) that resulted in a significant damage to KU property following the rupture of an 84-inch pipeline on the campus.\n\nThey also demanded that the Sindh government give compensation for the losses incurred by the university and its staff members.\n\nIn a letter addressed to the CM, Fareed Achakzai, the general secretary of Fapuasa, stated that the association wanted to bring his attention towards the failure of the KWSC in resolving the prolonged water leakage on the KU campus.\n\n“The academic community is facing unprecedented disruption, and we urge you to intervene in this matter. We request your office to direct the KWSC to swiftly resolve the water leakage issue and provide fair and timely compensation for the losses incurred by the university and its staff,” the letter reads.\n\nThe Fapuasa official urged the CM to ensure accountability and stated that the association fully supported the Kuts’ demand for a relief package.\n\nEarlier, the Kuts expressed its deep concern over the recent flooding at the university and called on the Sindh government, particularly the CM, to take immediate action.\n\nIt demanded a relief and bailout package to mitigate academic, research, and residential losses, and to restore the damaged infrastructure.\n\nKuts also demanded a transparent investigation into the KWSC negligence to identify those responsible for the incident and taking strict action against them.\n\nRepair work to be completed by tomorrow: KWSC\n\nThe KWSC on Thursday said that the repair work on the 84-inch damaged water supply line would be completed by Saturday (tomorrow).\n\nA water utility spokesman said KWSC Chief Operating Officer (COO) Engineer Asadullah Khan visited the university on Thursday to inspect the supply line.\n\nThe COO was informed by the chief engineer that the repair work would be completed by Saturday evening and that the restoration of the water supply would be ensured without further delay.\n\nThe spokesman added that the KWSC team was actively working to restore water supply to the campus where the line leakage played havoc as the vast area, including staff housing colony, was flooded with water.\n\nThe COO said the repair work would be continuously monitored to ensure the timely restoration of the water supply to the affected residents.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681400d07bf9e.gif",
  "retrievedAt": "2025-08-23T08:11:41.534Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907859/ku-teachers-demand-probe-into-kwsc-negligence-over-pipeline-burst",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:56.000Z"
}
