{
  "title": "Irsa to finalise Kharif water allocation as river inflows improve - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: With an improvement in hydrological conditions, the Indus River System Authority (Irsa) has convened a meeting of its advisory committee on Monday to review the water situation and finalise anticipated availability for the remaining Kharif 2025 season.\n\nKharif season begins on April 1, and water availability criteria and distribution among provinces are usually settled for the entire season by the advisory committee in the last week of March.\n\nBut given peculiar sca­rce water conditions, it had allocated only drinking water shares to provinces for April — the first month of the season generally used for sowing crops. Provinces had delayed sowing because of the unprecedented water shor­tage, estimated at 43 per cent at the time.\n\nIrsa’s advisory committee decided on March 26 to meet again in the first week of May to take stock of the latest situation and finalise “Anticipated Wat­er Availability Criteria” and set provincial water shares for the season.\n\nThe shortage has since dropped to about 25-27pc to be finally approved by the committee on May 5. The water storage in reservoirs, particularly Mangla and Tarbela, has further improved to 1.762 million acre-feet (MAF), up from 1.3 MAF on April 20 and almost zero on April 1.\n\nIrsa has invited irrigation and agriculture secretaries from the four provinces, Wapda’s members for water and power, the chief engineering adviser and the chairman of the Federal Flood Commission, along with all Irsa members, to attend the crucial meeting.\n\nThe authority has already increased provincial water shares, raising hopes about better cotton sowing that was earlier feared to dent Kharif crops amid a 43pc water shortage for the season predicted on March 26 by the Irsa’s advisory committee.\n\nThe committee earlier resisted provincial pressures on March 26, particularly from Sindh, for lower allocations and gave monthly allocations to provinces from the maximum shortage scenario.\n\nAs a result, the provinces were given minimum shares, mostly sufficient only for drinking instead of irrigation.\n\nThe provinces generally delayed sowing crops where possible.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:50:22.075Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907881/irsa-to-finalise-kharif-water-allocation-as-river-inflows-improve",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:20.000Z"
}
