{
  "title": "Smart lockdown enforced in KP locality amid rising mpox cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "The administration of Khyber Pakhtunkhwa’s district Khyber has enforced a 12-day smart lockdown in a locality in tehsil Jamrud, Associated Press of Pakistan reported on Friday.\n\nKhyber Pakhtunkhwa has now recorded a total of 17 cases of mpox during the past three years. Most of the patients had arrived either from the United Arab Emirates or Kingdom of Saudi Arabia, where the disease was endemic. In August last year, the World Health Organisation declared mpox an emergency of international concern.\n\nThe district administration of Khyber imposed the smart lockdown in the Pump House locality of Ghandi, sealing all entry and exit points, according to a notification issued by its deputy commissioner, retired Captain Bilal Shahid Rao.\n\nThe report says the decision aims to prevent further transmission of the virus within the community.\n\n“During the lockdown, only essential services will be allowed to operate, such as grocery shops, pharmacies, general stores, tandoors, and emergency services,” the report added.\n\nLegal action will be taken against anyone violating the lockdown restrictions within its stipulated time period, the report quoted the officials as saying.\n\n“Residents have been advised to cooperate with health teams, follow health guidelines and avoid any unnecessary movement.”\n\nLast week, a 31-year-old male resident of Khyber district tested positive after he was screened while departing for Dubai at Bacha Khan International Airport. Following the confirmation of his case, KP health department issued directives to the district health officer of Khyber for immediate surveillance and contact tracing.\n\nThe disease, caused by the monkeypox virus, leads to flu-like symptoms and pus-filled lesions. It is usually mild but can kill, with children, pregnant women and people with weakened immune systems, such as those with HIV, all at higher risk of complications.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:11:25.908Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907968/smart-lockdown-enforced-in-kp-locality-amid-rising-mpox-cases",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T10:19:12.000Z"
}
