{
  "title": "LHC stresses transparency in private firms’ shareholdings - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Lahore High Court’s Rawalpindi bench stressed the need for transparency in shareholdings of private companies and ruled that details of shares could only be shared within eligible members.\n\nLHC Justice Jawad Hassan dismissed a petition filed by Imran Ahmed Malik and two others against Sohawa Flour and General Mills (Pvt) Limited, ruling that the petitioners have failed to meet statutory requirements for rectifying the company’s share register under the Companies Act, 2017.\n\nThe petitioners sought the court’s intervention under Section 126(1)(b) of the Companies Act, 2017, alleging that former shareholders had sold their entire shareholding in Sohawa Flour Mills (Pvt.) Limited through agreements dated 2019–2021 but they failed to update the company’s register.\n\nThey requested the court to direct the respondents and the Securities and Exchange Commission of Pakistan to record their names as shareholders.\n\nThe petitioners asserted that agreements for the sale of shares and properties (valued at Rs100 million) were executed, but the share transfer was unlawfully delayed.\n\nThe old shareholders, on the other hand, contended that the agreements were disputed as fraudulent, with pending civil litigation and argued that no valid transfer deeds were executed, and the company’s board never approved the shares’ transfers.\n\nJustice Jawad Hassan, presiding as the Company Judge, emphasised that rectification of a company’s share register under Section 126 requires strict compliance with the Companies Act.\n\nThe judgment highlighted the lack of proper documentation and found no stamped transfer deeds or share certificates’ submission which was a violation of mandatory procedures under Sections 74–76 of the Act.\n\nThe petitioners were neither registered members nor shareholders of the company, a prerequisite for invoking Section 126, the court observed.\n\nThe alleged agreements involved properties not owned by the petitioners, as confirmed by district authorities. Civil suits challenging the agreements’ validity are ongoing.\n\nThe judgement reinforces the necessity of due process in corporate share transfers, underscoring that summary proceedings under Section 126 cannot bypass factual disputes or statutory requirements.\n\nJustice Hassan concluded that the petitioners have failed to prove their status as members or shareholders. Without fulfilling Section 126(1)(a), they cannot invoke relief under Section 126(1)(b). The petition was dismissed with no order as to costs.\n\nPublished in Dawn, May 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:51:15.141Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907907/lhc-stresses-transparency-in-private-firms-shareholdings",
  "dateList": "2025-05-02",
  "date_published": "2025-05-02T00:32:32.000Z"
}
