{
  "title": "We have not been informed about delay in £190m case verdict: Imran’s lawyer - Pakistan - DAWN.COM",
  "author": null,
  "content": "Amid rumours about the verdict in the Al-Qadir Trust case being deferred, one of the lawyers representing PTI founder Imran Khan and his wife, Bushra Bibi, stated on Sunday that there has been no confirmation that the verdict has been postponed.\n\nOn December 23 — the original date the verdict was supposed to be announced — an Islamabad accountability court postponed its verdict in the case until January 6 due to winter vacations.\n\nJudge Nasir Javed Rana said, “The verdict will not be announced today; [winter] vacations are coming and there is also a course at the high court.” Officially, the court went on winter vacation from December 24 until January 1.\n\nImran and Bushra were indicted in the case on February 27, shortly after the general elections.\n\nThe case alleges that Imran and Bushra obtained billions of rupees and land worth hundreds of kanals from Bahria Town Ltd for legalising Rs50 billion that was identified and returned to the country by the United Kingdom during the previous PTI government.\n\nDawn.com contacted lawyer Khalid Yousuf Chaudhry, who said that the court had not informed the PTI founder’s legal team about the postponement. “The court staff did not confirm whether the verdict had been delayed,” he said.\n\nIn a video statement seen by Dawn.com, Chaudhry addressed rumours circulating on social media that the date of the verdict has changed, with other users claiming it will be announced in 10-12 days.\n\n“Social media and TV channels are claiming that the verdict has been postponed,” he said. “I want to say that we have not yet received any information about this.\n\n“Our legal team has not been informed whether we have to go to Adiala Jail or the judicial complex in G-11 for the verdict hearing,” Chaudhry clarified. “I have been trying to contact the court staff since this morning about where the hearing will be, but we have not received any official information.”\n\nChaudhry said that the defence not being informed about where the hearing would take place is a “major question mark for the judiciary”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/052053362a54a8b.png",
  "retrievedAt": "2025-08-26T07:27:11.570Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883279/we-have-not-been-informed-about-delay-in-ps190m-case-verdict-imrans-lawyer",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T16:14:11.000Z"
}
