{
  "title": "Angry at ‘substandard’ road work, Karachi mayor withholds contractor’s payment - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: City Mayor Barrister Murtaza Wahab vowed on Saturday that he would not tolerate substandard development work by contractors and ordered withholding payment to a contractor responsible for a poor quality work on Ghulam Allana Road.\n\nThe warning came during a meeting chaired by the mayor in the Karachi Metropolitan Corporation head office.\n\nOfficers of the KMC engineering department attended the meeting. The mayor issued a 10-day notice to contractors asking them to improve their performance or be ready to get blacklisted.\n\n“The contractors who do not deliver quality work will not be paid,” a statement issued after the meeting quoted the mayor as saying.\n\nSays poor quality construction will not be tolerated\n\nIt added that the mayor issued orders to withhold the payment to a contractor of the development of G. Allana Road on the basis of a review report which suggested that the structure had not been built according to defined standards.\n\nThe mayor said quality should be a non-negotiable standard for all projects and that he had zero tolerance for substandard work.\n\n“A comprehensive strategy is being implemented to oversee the progress and quality of all ongoing initiatives,” said the statement.\n\n“The meeting participants decided that the newly designed poles for streetlights would be installed to enhance the beauty of the city.\n\nEfforts should also be made to ensure that roads, footpaths, and other public welfare works are of high quality and aesthetically pleasing, contributing to the overall beauty of the city.\n\n“The primary goal of developing basic infrastructure in Karachi is to enhance facilities for citizens and address their concerns,” the statement quoted the mayor as saying.\n\nOfficers and engineers must ensure swift and efficient implementation of all directives in this connection, the statement added.\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:27:32.624Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883147/angry-at-substandard-road-work-karachi-mayor-withholds-contractors-payment",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T02:39:07.000Z"
}
