{
  "title": "Govt to take another shot at separating IRS, Customs - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Mini­ster Shehbaz Sharif has app­roved the separation of two revenue collection bodies, Customs and Inland Revenue Services (IRS), a move strongly resisted by tax groups in the past.\n\nThe prime minister accorded his approval last month to the recommendation submitted by the task force for overhauling the maritime sector.\n\nThe committee had proposed at least 99 measures, ranging from infrastructure rehabilitation to enhanced facilitation at ports, with specified timelines for implementation, according to official documents seen by Dawn.\n\nThe bifurcation of IRS and Customs streams will be carried out by March 31.\n\nPM approves recommendation by task force for overhauling maritime sector; plan to be carried out by March 31\n\nChanges to FBR structure\n\nUnder the existing structure, the Federal Board of Revenue (FBR) is an overarching body, with IRS and Customs being two of its wings, as per the revenue authority’s website.\n\nThe IRS collects sales tax, income and federal excise duty, while Customs imposes levies on goods being traded across borders.\n\nThe proposed reforms envision three separate boards to oversee FBR’s functions and policy formulation.\n\nThis included a policy board to develop income tax, sales tax and federal excise duty policies. The board, headed by the finance minister, would have members from the private sector.\n\nTwo separate oversight and governance boards will be established for the IRS and Customs.\n\nThese boards will be chaired by a retired tax official or an expert nominated by the finance minister. These boards would also have representations from the private sector.\n\nIf the plan is implemented, the post of the FBR chairman would cease to exist and be replaced by chairpersons of these boards.\n\nThe reforms also suggest replacing current FBR members with director generals of IRS and Customs. The tax collection structure and method will not change the field formation.\n\nThe two establishments — IRS and Customs — will be attached to the Revenue Division.\n\nThe DGs would have administrative, financial and operational control over their establishments, including budgeting, posting, and transfers.\n\nPrevious attempts\n\nA similar move was announced by then caretaker finance minister Shamshad Akhtar on Nov 16, 2023.\n\nThe decision was later ratified by the then cabinet as well. However, the incumbent government has not implemented the proposed plan as yet.\n\nThe plan is again expected to draw the opposition of tax bodies, with officials also questioning the government’s seriousness in seeing through these reforms.\n\nA senior tax official has expressed this scepticism, stating that the government has “no intention of reforming the tax administration”.\n\nThe official predicted that the fate of this move wouldn’t be different from the one in the past.\n\nThe apprehension stems from the fact that the FBR has yet to appoint a separate member for Customs administration — a recommendation also approved by the prime minister. Currently, a single member oversees the administrative affairs of both tax groups.\n\nThe government has unveiled a comprehensive transformation plan to address the substantial revenue gap of around Rs7.1 trillion. Central to this transformation is the deployment of digital solutions for tax collection.\n\nAdditionally, in line with the IMF agreement, the government is considering separating the tax policy formulation from collection.\n\nAccording to sources, the FBR still plays a role in Customs’ policy formulation.\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:43:06.243Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883195/govt-to-take-another-shot-at-separating-irs-customs",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T03:02:58.000Z"
}
