{
  "title": "Uzbekistan to launch direct flight to Karachi in bid to strengthen bilateral ties: envoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "Uzbekistan’s Ambassador to Pakistan Alisher Tukhtaev has announced his government’s plan to introduce a new direct flight route between Uzbekistan and Karachi this year, describing it as a significant step to foster closer ties between the two nations, the Associated Press of Pakistan (APP) reported on Sunday.\n\nPakistan and Uzbekistan are strengthening ties through trade and economic cooperation. A $1 billion trade deal was signed in 2023, and plans for further collaboration, including a roadmap for industrial cooperation, show the two sides’ commitment to boosting regional connectivity.\n\nDuring his official visit to Karachi from January 2-4, Ambassador Tukhtaev addressed the Trade Development Authority of Pakistan (TDAP), Karachi Chamber of Commerce and Industry (KCCI), and members of the business community in Sindh’s metropolis.\n\nHe highlighted the historic and brotherly relations between Uzbekistan and Pakistan, underpinned by shared cultural and religious affinities.\n\n“Our two nations are closer than ever, thanks to the realisation of the long-awaited vision of regional connectivity,” the ambassador said, per the report, emphasising the ongoing efforts to enhance economic cooperation and strategic collaboration.\n\nAmbassador Tukhtaev shared that Uzbekistan implemented a soft visa regime for Pakistani citizens in September 2023, facilitating business and tourist travel. This initiative, coupled with the recently launched direct flights between Tashkent and Lahore, shows Uzbekistan’s commitment to fostering people-to-people connections and promoting mutual understanding.\n\nHighlighting the trade potential, the ambassador noted that mutual trade between Uzbekistan and Pakistan has tripled over the past five years, rising from $122 million in 2019 to $387 million in 2023.\n\nHe stressed the untapped opportunities for further collaboration, particularly in sectors such as textiles, pharmaceuticals, leather and tannery, food processing, and agribusiness.\n\nAmbassador Tukhtaev also commended the success of the “Made in Pakistan” single-country exhibition held in Tashkent last June, which provided an invaluable platform for entrepreneurs from both nations to forge new trade and investment agreements.\n\nBuilding on this momentum, he announced plans for a “Made in Uzbekistan” industrial exhibition in Karachi later this year, expressing confidence that it would further strengthen economic ties.\n\nThe ambassador extended an invitation to a delegation from the KCCI to visit Uzbekistan and explore investment opportunities in regions such as Bukhara, Sirdarya, Surkhondarya, and Kashkadarya.\n\nHe assured full support from the Uzbek Embassy in facilitating government-to-business (G2B) and business-to-business (B2B) meetings during such visits.\n\n“Uzbekistan offers a safe, conducive, and liberal environment for investment,” he stated, urging Pakistani businesses to capitalize on opportunities in various sectors where Sindh excels. He also welcomed the idea of organizing B2B meetings alongside business delegation visits to materialize trade and investment prospects.\n\nAmbassador Tukhtaev’s visit underscored the commitment of both nations to advancing regional connectivity, strengthening economic partnerships, and fostering deeper bilateral ties.\n\nMeanwhile, the Director General of Airports Air Vice Marshal (AVM) Zeeshan Saeed has convened a meeting at PAA Headquarters to address the matter of stray dogs spotted in the General Aviation Area, according to a press release issued by the PAA on Sunday.\n\n“The session was attended by the Deputy Director General Airports Sadiq ur Rehman, Directors of APS, HR, and SQMS representatives, as well as other key officials. The acting Airport Manager and Manager Airside were also present,” the statement said.\n\nThis statement follows videos of stray dogs in the general aviation area of Jinnah International Airport Karachi being shared on social media.\n\n“During the meeting, the Manager Airside provided a detailed briefing on wildlife and vegetation control measures implemented in the airside. It was emphasised that the airside is fully fenced and under 24/7 surveillance by specialized bird and wildlife control teams,” the statement continued.\n\nComprehensive safety inspections are carried out before every landing and takeoff, ensuring the highest standards of operational safety. Records show no formal reports of stray dogs or wildlife presence on the airside, the statement said.\n\nThe statement added that no flight cancellations due to wild animals’ intrusions have occurred, as confirmed by operational records. Additionally, there have been no formal reports of stray dogs coming near taxiing aircraft in the General Aviation Area.\n\n“The Pakistan Airports Authority remains committed to maintaining the highest safety and security standards across all its facilities,” the statement concluded.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/05194222cf8f860.jpg",
  "retrievedAt": "2025-08-26T07:27:11.606Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883271/uzbekistan-to-launch-direct-flight-to-karachi-in-bid-to-strengthen-bilateral-ties-envoy",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T15:01:36.000Z"
}
