{
  "title": "Confused state - Newspaper - DAWN.COM",
  "author": null,
  "content": "WHEN it comes to combatting violent terrorism, the state’s efforts seem to be suffering from a lack of focus. The policy confusion at the top tier was evident in the remarks made by Prime Minister Shehbaz Sharif during a recent meeting of the Apex Committee of the National Action Plan. On the one hand, PM Sharif seemed worried about terrorist infiltration and stressed the need for all stakeholders to collaborate with security forces to eliminate the threat. At the same time, however, he also took the opportunity to make divisive remarks targeting the main opposition party, describing it as being involved in “anti-state activities” and seemingly equating its confrontational activities with the violence perpetrated by actual terrorists. As prime minister, he really should have spoken more circumspectly.\n\nWhile it is true that some of the criticism levelled by the opponents of this government has been unfair and rather harsh, even downright condemnable in some instances, the beauty of democracy is that it is tolerant of even the most critical viewpoints. It is, therefore, reasonably expected that there be some clear distinction drawn between people who are critical of government policies, and people who dismiss the idea of Pakistan altogether and wish to replace it through violence with a fascist state. Terrorism is a serious challenge that needs to be met with a united resolve. If anything, the prime minister should be more worried about how his government has been treating rival politicians and the media, and the negative consequences of these policies on the general health of society. By repeatedly attacking critics of government policies and by branding all criticism as ‘fake news’ or ‘digital terrorism’, he is only alienating this government in the real fight against terrorism.\n\nWith opposition leaders unanimous in their complaints about censorship and coercion by the state, the media left debilitated by curbs and restrictions on what can and cannot be reported, and public dissenters being targeted and silenced by the state, fringe elements, which are already adept at operating from the shadows, can take over the narrative-setting function, as we are witnessing now. This should serve as a lesson that when people’s representatives and responsible journalists are not allowed to speak freely, the public can turn to much more undesirable elements to fill that void. Therefore, instead of ‘othering’ critics and stifling their voices, the government must provide them space so that built-up pressures and frustrations can be released in reasonable ways. Not allowing dissent risks creating a pressure-cooker like situation which can explode in very unpredictable ways. The government needs all the support it can get against the growing threat from violent terrorism. It must stop complicating the task for itself. Branding criticism as anti-state activity has never worked, and will not work in this case either.\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:27:14.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883204/confused-state",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T03:24:23.000Z"
}
