{
  "title": "Myanmar govt to release 6,000 prisoners - World - DAWN.COM",
  "author": null,
  "content": "NAYPYIDAW: Myanmar’s embattled junta government on Saturday said it would release almost 6,000 prisoners as part of an annual amnesty to mark the country’s independence day.\n\nThe military has arrested thousands of protesters and activists since its February 2021 coup that ended Myanmar’s brief democratic experiment and plunged the nation into turmoil.\n\nMore than 5,800 prisoners — including 180 foreigners — will be freed, the junta said in a statement on Saturday, when the country marks 77 years of independence from British colonial rule.\n\nAround 600 of those included in the amnesty had been sentenced under Section 505 (a) of the penal code, junta spokesman Zaw Min Tun said in an audio statement to media. The law prohibits any action deemed to undermine the military and carries a maximum jail term of three years.\n\nHe added that “most” of the foreigners pardoned were Thai nationals who had been arrested in casinos on the border. The military said it ordered the pardons “on humanitarian and compassionate grounds”. The junta also announced that 144 people who had been sentenced to life in prison would have their sentences commuted to 15 years.\n\nMyanmar frequently grants amnesty to thousands of prisoners to commemorate holidays or Buddhist festivals. Last year, the junta announced the release of more than 9,000 prisoners to mark independence day.\n\nThe annual independence day ceremony held in the heavily guarded capital Naypyidaw on Saturday saw around 500 government and military attendees.\n\nA speech by junta chief Min Aung Hlaing — who was not present at the event — was delivered by deputy army chief Soe Win.\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6779d89b62d0f.gif",
  "retrievedAt": "2025-10-12T00:43:31.787Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883184/myanmar-govt-to-release-6000-prisoners",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T02:37:58.000Z"
}
