{
  "title": "Balochistan MPAs oppose handing over Levies area to police - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: A bipartisan resolution in the Balochistan Assembly has opposed the handover of the area under Levies jurisdiction to the police.\n\nThe resolution moved on Saturday, was opposed by Chief Minister Sarfraz Bugti, who said the government had no plan to abolish the Levies force.\n\nThe joint resolution was moved by Mir Rehmat Baloch during the assembly session presided over by Speaker Abdul Khaliq Achakzai.\n\nThe other movers included opposition leader Mir Younis Zehri, Syed Zafar Ali, Rehmat Baloch, Zabit Reki, Khair Jan Baloch, Dastagir Badini, Maulana Hidayatur Rehan, Asghar Ali and Ume Kalsoom.\n\nLawmakers say move failed in past; CM says govt plans to modernise force\n\nThe resolution stated that the experience of converting areas under Levies jurisdiction into “A area” failed in the past and a similar attempt shouldn’t be made again.\n\nUnder the law, Levies operate in parts of Balochistan declared “B-Area” by the government. In these areas, the Levies, under the command of division and district officials, act as a law enforcement agency.\n\nIn the “A-Area”, Balochistan Police acts as a law enforcement agency.\n\nAccording to the movers of the resolution, the government was planning to convert the area under Levies jurisdiction into police’s without consulting representatives of the people.\n\nMr Zehri, the opposition leader, pointed out that the attempt to dissolve the Levies during Musharraf’s era was a failure, as the Balochistan police could not establish peace in the province.\n\nProvincial Minister Noor Mohammad Dummar criticised the idea of abolishing the Levies, stating that no such proposal had been presented to the cabinet, making further discussion unnecessary.\n\nProvincial Minister Mir Sadiq Umrani confirmed that no decision had been made regarding the dissolution of the Levies, and the government should clarify this issue.\n\nIn response, CM Bugti clarified that the provincial government had al­­ready taken steps to modernise the Levies force.\n\nHe pointed out that the government would not make any decisions without the consent of assembly members and suggested creating a committee inclduing government and opposition members, retired police officers, and Levies representatives to improve the Levies force.\n\nHe said the government was open to reforms and emphasised the assembly’s role in lawmaking, not infrastructure development.\n\nThe speaker then referred the matter to the Standing Committee on Home and Tribal Affairs and adjourned the session indefinitely.\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:27:43.671Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883165/balochistan-mpas-oppose-handing-over-levies-area-to-police",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T02:38:29.000Z"
}
