{
  "title": "Pant leads India’s fightback in Sydney - Sport - DAWN.COM",
  "author": null,
  "content": "SYDNEY: An explosive Rishabh Pant slammed the second-fastest Indian Test half-century on Saturday to drive the tourists to a 145-run lead with four wickets left after an intense day two of the decisive fifth Test against Australia in Sydney.\n\nAt the close, India were 141-6 with Ravindra Jadeja on eight and Washington Sundar six after they dismissed Australia for 181 in reply to their first-innings 185.\n\nAustralia lead the series 2-1 with India needing to win at the Sydney Cricket Ground to retain the Border-Gavaskar Trophy.\n\nPant signalled his intent by plundering a six on his first ball and reached 50 after just 29 deliveries with another big shot that cleared the ropes.\n\nOnly his 28-ball half-century against Sri Lanka in 2022 was faster for India. He was finally dismissed for 61 off 33 by Pat Cummins, but Scott Boland was India’s main tormentor, taking 4-42.\n\nPant’s exploits set up an exciting finale, amid doubts over whether skipper Jasprit Bumrah will take any further part.\n\nHe left the field after bowling one over following lunch and was driven from the SCG, likely for hospital scans. Bumrah was seen returning before stumps.\n\nIn his absence, Prasidh Krishna (3-42), Mohammed Siraj (3-51) and Nitish Kumar Reddy (2-32) stepped up to fill the void and dismiss Australia after they resumed on 9-1.\n\n“It’s been a hell of a Test, it’s been in fast-forward mode,” said Australian all-rounder Beau Webster, who top-scored with 57 and took a wicket.\n\n“With the amount of wickets, I am just happy that I could contribute with the bat, few catches and wicket there as well, so really happy.\n\n“It’s a real tussle,” he added. “We don’t know what a good score is yet and obviously plenty on offer for the quicks.”\n\nYashasvi Jaiswal got India’s second innings off with a bang, crunching four boundaries from the first over by Mitchell Starc.\n\nBut the opening partnership was quickly shattered when KL Rahul was bowled for 13 by Boland, whose line and length was impeccable.\n\nHe pounced again in his next over with a ball that jagged back to deliver the same punishment to Jaiswal (22).\n\nVirat Kohli desperately needed a big score — for himself and the team — but failed to deliver again, perishing in the slips for six with his nemesis Boland once more the destroyer.\n\nIt was likely the 36-year-old Kohli’s last Test innings in Australia, with India usually only visiting every four years.\n\nWebster claimed Shubman Gill (13) as his first Test wicket, but at the other end Pant was on a mission until an edge off Cummins carried to wicketkeeper Alex Carey.\n\nBoland claimed his fourth to remove Reddy cheaply.\n\n“As many runs as possible would be great for us because we don’t know what the wicket will be behaving like for us,” said Prasidh.\n\n“There’s no particular number in mind, but as many as we can score. We are ready to bowl them out for whatever.”\n\nAustralia lost Sam Konstas (23), Marnus Labuschagne (two), Travis Head (four) and Steve Smith (33) before lunch.\n\nIn front of his home crowd, Smith looked set to become only the 15th batsman and fourth Australian to reach 10,000 Test runs.\n\nBut he was made to wait, five runs short, after Prasidh enticed an edge to Rahul in the slips.\n\nThe home side resumed after a dramatic final-ball wicket on Friday when Bumrah — captaining the side after Rohit Sharma was “rested” — had Usman Khawaja caught.\n\nThat Australian body blow came two balls after Bumrah and Konstas had a tense exchange.\n\nThe 19-year-old Konstas padded up again on seven with new partner Labuschagne, who didn’t last with Bumrah getting the faintest edge to Pant.\n\nA fearless Konstas slammed Bumrah to the boundary, then produced an audacious reverse ramp shot for another four.\n\nBut the teenager overplayed his hand and fell to a Siraj outswinger, attempting a drive that flew to Jaiswal at gully.\n\nSiraj removed Head in the same over with another gem to leave Australia at 39-4.\n\nSmith and Webster, who replaced the dropped Mitchell Marsh, began the rebuild before Prasidh dismissed the veteran just before lunch and bowled Carey soon after their return.\n\nIndia then took 3-4, with Reddy at the forefront, as the tail collapsed.\n\nSCOREBOARD\n\nINDIA (1st Innings) 185\n\nAUSTRALIA (1st Innings, overnight 9-1):\n\nS. Konstas c Jaiswal b Siraj 23\n\nU. Khawaja c Rahul b Bumrah 2\n\nM. Labuschagne c Pant b Bumrah 2\n\nS. Smith c Rahul b Krishna 33\n\nT. Head c Rahul b Siraj 4\n\nB. Webster c Jaiswal b Krishna 57\n\nA. Carey b Krishna 21\n\nP. Cummins c Kohli b Reddy 10\n\nM. Starc c Rahul b Reddy 1\n\nN. Lyon not out 7\n\nS. Boland b Siraj 9\n\nEXTRAS (B-9, LB-2, NB-1) 12\n\nTOTAL (all out, 51 overs) 181\n\nFALL OF WICKETS: 1-9 (Khawaja), 2-15 (Labuschagne), 3-35 (Konstas), 4-39 (Head), 5-96 (Smith), 6-137 (Carey), 7-162 (Cummins), 8-164 (Starc), 9-166 (Webster)\n\nBOWLING: Bumrah 10-1-33-2, Siraj 16-2-51-3 (1nb), Krishna 15-3-42-3, Reddy 7-0-32-2, Jadeja 3-0-12-0\n\nINDIA (2nd Innings):\n\nY. Jaiswal b Boland 22\n\nK. L. Rahul b Boland 13\n\nS. Gill c Carey b Webster 13\n\nV. Kohli c Smith b Boland 6\n\nR. Pant c Carey b Cummins 61\n\nR. Jadeja not out 8\n\nN.K. Reddy c Cummins b Boland 4\n\nW. Sundar not out 6\n\nEXTRAS (B-4, LB-4) 8\n\nTOTAL (for six wickets, 32 overs) 141\n\nFALL OF WICKETS: 1-42 (Rahul), 2-47 (Jaiswal), 3-59 (Kohli), 4-78 (Gill), 5-124 (Pant), 6-129 (Reddy)\n\nSTILL TO BAT: J. Bumrah, M. Siraj, P. Krishna\n\nBOWLING: Starc 4-0-36-0, Cummins 11-4-31-1, Boland 13-3-42-4, Webster 4-1-24-1\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:11:01.454Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883154/pant-leads-indias-fightback-in-sydney",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T02:38:46.000Z"
}
