{
  "title": "No end in sight to blockade of KKH over excessive loadshedding - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: People of Hunza continued their sit-in at Aliabad for the second consecutive day on Saturday, blocking Karakoram Highway in protest against 22-hour loadshedding and demanding uninterrupted power supply to the area where temperatures have plunged to 20 degrees below freezing point.\n\nThe protesters spent Friday night in a camp set up on the road. They said they would call off the protest only after an uninterrupted power supply is ensured to people of the area.\n\nThe sit-in call was given by the Hunza Awami Action Committee and the All Parties Traders Association. On Friday, demonstrations were held in Sost, near Khunjerab Pass, Galmit Gojal and Aliabad.\n\nThe Karakoram Highway remained blocked for many hours and a strike was observed in many areas of Hunza.\n\nProtesters say the 22-hour power cut, amid freezing cold temperature, has disrupted their lives\n\nActivists from different political parties and social organisations, including a member of the GB Assembly from Hunza, Ubaidullah Baig, also participated in the sit-in.\n\nThe protesters said the people of Hunza had been living in agony for the past few months as loadshedding had upended their lives.\n\nThey said that because of 22-hour loadshedding in the midst of bone-crunching temperatures, all business activities in the area have come to a standstill. They alleged the GB government was not serious in alleviating their suffering.\n\n“The federal government earns billions of rupees in taxes and duties through trade between Pakistan and China via Khunjerab Pass, but it is not interested in providing basic amenities to locals.”\n\nUbaidullah Baig, the GB Assembly member from Hunza, said his region was being discriminated against by the GB government.\n\nRehan Shah, a PML-N leader, and PPP leader Zahoor Ahmed also addressed the demonstrators, saying the people of Hunza had now decided to fight for their rights. They blamed top officials of the power department for the unusual loadshedding. The officials concerned are not providing fuel to operate thermal generators, they alleged.\n\nThey called upon the federal government to launch more power projects in the area to address the loadshedding problem on a long-term basis.\n\nThey declared that they would continue the protest till the acceptance of their demands.\n\nOn Friday night, the district administration held talks with the protesters to persuade them to end their sit-in, but the agitators refused to do so.\n\nPublished in Dawn, January 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6779cd184d6ec.gif",
  "retrievedAt": "2025-08-26T07:27:42.531Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883164/no-end-in-sight-to-blockade-of-kkh-over-excessive-loadshedding",
  "dateList": "2025-01-05",
  "date_published": "2025-01-05T02:38:29.000Z"
}
