{
  "title": "KP Assembly passes bill to establish climate action board - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa Assembly on Tuesday approved the KP Climate Action Board Bill, 2025, for the establishment of a climate action board.\n\nThe development came during a session chaired by Speaker Babar Saleem Swati.\n\nThe draft law moved by law minister Aftab Alam Afridi was unanimously passed by the house after the incorporation of amendments suggested by some opposition members.\n\nUnder the law, the climate action board will “plan, oversee and execute all climate-related initiatives, streamline decision-making and synergise cross-sector efforts to address climate risks faced by the province and for matters connected there with and incidental thereto”.\n\nDemands release of Imran’s detained nephews, action against those ‘misusing powers’\n\nThe draft bill says the climate action or climate initiatives mean any programmes, projects or activities meant to mitigate climate change and the risks associated therewith, adapt to climate change, support climate change research and promote awareness about the climate change with the objective to reduce greenhouse gas emissions, encourage low-carbon economy, enhance climate change resilience and promote sustainable development.\n\nSection 3 of the bill states that there will be the Khyber Pakhtunkhwa Climate Action Board to coordinate and oversee climate strategies across departments to ensure harmonisation of efforts. The board will be administratively and functionally independent, while the government will make best efforts to promote, enhance and maintain the board’s independence.\n\nThe board will have the authority to develop, review, amend and oversee the execution of climate policies and action plans for the province; advise government on climate policies, commitments and strategies; conduct and maintain provincial greenhouse gas inventories and establish emissions baselines, and conduct, promote and oversee research on mitigation, adaptation and climate finance.\n\nThe board will also be responsible for climate tagging of all schemes in the Annual Development Programme for alignment with climate goals, mobilising financial resources for climate action and establish, operate and maintain the dedicated Climate Action Board Fund, and coordinating and pitching provincial projects for international climate financing like Green Climate Finance, Climate Investment Finance and Global Environment Facility.\n\nIt will also facilitate participation in carbon markets, support the generation of carbon credits, establish and implement carbon pricing mechanisms to encourage low-carbon development, monitor and evaluate the implementation and progress of climate action programmes and projects. Also, the board will conduct public awareness campaigns on climate change, promote environmental sustainability, engage with stakeholders, including communities, industries and civil society, and ensure community resilience to climate change, including systems for adoptive and shock responsive social protection.\n\nThe additional chief secretary (planning and development) will be the chairperson of the board, while its members include secretaries of the finance, law, climate change, energy and powers, transport, local government departments, four nominees from the private sector at least one woman and two members of the provincial assembly to be nominated by the speaker.\n\nStatement of object and reasons for the bill said KP faced growing climate-related threats, such as extreme weather, glacial melt and deforestation, which endangered lives, ecosystem and economic stability. However, the absence of a centralised institutional mechanism has limited its ability to respond effectively.\n\nThe house also approved the Khyber Pakhtunkhwa Aasan Karobar Bill, 2025, and the Khyber Pakhtunkhwa Tourism (Amendment) Bill, 2025.\n\nThe lawmakers also adopted a resolution demanding the release of Shershah Khan and Shahraiz Khan, the nephews of PTI founder Imran Khan.\n\nThe resolution, moved by PTI MPA Asif Khan Mehsud, also called for the immediate withdrawal of “false and vindictive charges” against Shershah and Shahraiz.\n\nIt also demanded accountability of all those “misusing power” and urged authorities to ensure such acts are not repeated.\n\nThe resolution said no citizen should be subjected to arbitrary arrest, prolonged detention or political victimisation.\n\nThe chair later adjourned the session until next Friday.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:01:24.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939219/kp-assembly-passes-bill-to-establish-climate-action-board",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:48:17.000Z"
}
