{
  "title": "New recipes help Pakistani mothers ward off malnutrition - DAWN.COM",
  "author": null,
  "content": "Clutching their hungry babies, a group of mothers mix a semolina dish under the guidance of a teacher, an attempt to curb malnutrition, which affects nearly one in two children in Sindh.\n\nDespite Sindh being home to the mega port city of Karachi, the financial centre of the country that sprawls along the Arabian coastline, children in rural areas just a few hours away face stark levels of wasting and stunting.\n\nIn the arid village of Sujawal, lethargic children with prominent bones wilt in the searing heat as social workers educate mothers on nutrient-rich ingredients and dispel myths around food.\n\n“Before, we only gave our children potatoes because they were always available at home,” said Shahnaz, 25, who has radically changed the diet of her six children, weak and frequently sick, after a year of classes.\n\nNow, convinced that children should eat a varied diet, she has introduced affordable ingredients such as lentils and semolina into her cooking, lifting her daughter out of malnutrition.\n\nIn impoverished rural Sindh, 48 per cent of children under five suffer from malnutrition and 20pc from its most severe form, wasting, according to the latest national survey on the issue conducted in 2018.\n\nIn this class, Azma, a social worker, shows mothers how to cook with semolina — easily available in the market.\n\n“Semolina is cheap — for 50 rupees it can last a week if you’re feeding one to two spoonfuls daily to a six-month-old child,” she explained to AFP.\n\nIn Sindh, a province of 55 million people where contraception remains taboo and large families are the norm, 3,500 mothers have benefited from cooking classes developed by UNICEF.\n\nLike many mothers in the area, Kulsoom, 23 and pregnant with her sixth child, all born prematurely and underweight, once only fed her children pieces of fried flatbread.\n\n“One of my children died, and my youngest is extremely weak, so I was advised to take these classes,” said Kulsoom, who goes by only one name, like most women in her district.\n\nParents are recommended to feed babies solid foods from about six months old, but in rural Sindh, this often means adult leftovers, too spicy for young stomachs.\n\n“The main problem is the lack of dietary diversity,” says Mazhar Iqbal, a nutritionist for UNICEF.\n\nIn Pakistan, 38pc of children eat only two or fewer of the eight food categories recommended by UNICEF.\n\nMeat is saved for special occasions, yet inexpensive protein alternatives exist, such as chicken offal, boiled bones, lentils and beans.\n\nAs for fruit and vegetables, they are usually fried, losing their nutrients.\n\nBakhtawar Kareem joined the programme after her child died of anaemia.\n\n“I have no money. Sometimes we eat, sometimes we don’t,” she lamented, scanning the swollen belly of her one-year-old daughter, who has only sparse clumps of hair.\n\nLike 72pc of children in the village, her daughter has stunting, well above the average rate in Pakistan of 42pc — one of the highest in the world.\n\nStunting is most closely associated with brain development and physical growth, and can have long-term physical and mental impacts.\n\nVulnerable to a lack of clean water and sanitation, which contributes to malnutrition, children often also suffer from dengue fever or malaria, from vomiting, diarrhoea, or difficulty urinating, and have abnormally swollen bellies.\n\nBut the vicious cycle of malnutrition begins with the mothers.\n\n“With early marriages and repeated pregnancies, more than 45pc of women in Sindh are anaemic,” said the nutritionist.\n\n“This increases the risk of having low birth weight babies, who are more likely to suffer from malnutrition.”\n\nIn Sujawal, where only a quarter of the population can read and write, myths about food also deprive women of vital nutrients.\n\nFarrah Naz, the head of the Global Alliance for Improved Nutrition in Pakistan, regularly has to repeat that eggs and dried fruits do not cause women to bleed more during their periods.\n\nCultural norms around women serving meals to men first and eating the leftovers — despite the physical work they carry out in the fields — also contribute to poor health.\n\n“And when food runs out, it’s their rations that are cut first.”\n\nHeader Image: The photograph, taken on July 29, 2025, shows female health workers teaching mothers how to prepare nutritious meals for their children during a UNICEF nutrition programme at Fateh Muhammad Soomro village in the Sujawal district of Sindh. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/05132239f11f2e4.webp",
  "retrievedAt": "2025-09-06T10:02:03.271Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939900/new-recipes-help-pakistani-mothers-ward-off-malnutrition",
  "dateList": "2025-09-03",
  "date_published": "2025-09-05T08:55:41.000Z"
}
