{
  "title": "Boxer Imane Khelif not competing at world championships amid sex testing appeal - Sport - DAWN.COM",
  "author": null,
  "content": "Imane Khelif has the right to appeal World Boxing’s decision barring her from events unless she undergoes genetic sex testing but the Algerian is not competing at the world championships as she has not entered, World Boxing president Boris van der Vorst said.\n\nWorld Boxing, which will oversee boxing in the 2028 Olympics, introduced mandatory sex testing for all boxers in its competitions in May, less than a year after Khelif and Taiwan’s Lin Yu-ting won gold in Paris amid a gender-eligibility row.\n\nBut Khelif appealed to the Court of Arbitration for Sport — sport’s highest court — seeking to overturn World Boxing’s ruling asking boxers to undertake a PCR (polymerase chain reaction) genetic test.\n\n“She has the right to do this (appeal). For us, it’s important to stress that we introduced mandatory testing in order to have safe and competitive competitions, fair competitions,” Van der Vorst said on Wednesday.\n\n“We announced it in May. And for us, everyone is equal. Every woman here has to submit several documents, including the sex testing.”\n\nThe World Boxing Championships get underway in Liverpool on Thursday and when asked if Khelif would have failed the test, Van der Vorst said: “It’s too early to draw conclusions.\n\n“She has simply not entered on behalf of her own federation here in Liverpool.”\n\nThe Algerian Boxing Federation did not immediately respond to a request for comment.\n\nOn Tuesday, World Boxing confirmed Taiwan’s Lin would not be competing at the world championships either.\n\n“I know that she also is not part of the entry list of the National Federation,” Van der Vorst added.\n\nThe Dutchman had apologised in June when World Boxing specifically named Khelif in their announcement on mandatory sex testing.\n\nHowever, he defended the decision for such tests to ensure they had “safe and fair competitions”.\n\n“We are speaking not only about amateur boxing, but Olympic boxing. For us, that’s our brand, because that’s the ‘why’ of World Boxing. We established World Boxing in order to save the Olympic dream,” he said.\n\n“Boxing is a combat sport and it is important to have safe and fair competitions. So, for us, it’s really crucial to introduce this kind of testing. I think it’s an important step that we show that we want to protect female boxing.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/031752099127f06.webp",
  "retrievedAt": "2025-09-06T10:01:02.510Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939434/boxer-imane-khelif-not-competing-at-world-championships-amid-sex-testing-appeal",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T12:50:51.000Z"
}
