{
  "title": "90pc of world lives on degraded land, unhealthy air, water stress: WB - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Ninety per cent of the world lives with either degraded land, unhealthy air, or water stress, according to a new World Bank report, which says that restoring natural systems is possible and can yield high returns.\n\nIn low-income countries alone, eight of out ten people live without all three — healthy air, water, and land — according to the report, ‘Reboot Development: The Economics of a Livable Planet’. New evidence shows that the loss of forests disrupts rainfall, dries soils, and worsens droughts, costing billions of dollars.\n\nThe report also identifies a nitrogen paradox where fertilisers boost yields, but overuse in some regions harms crops and ecosystems, costing as much as $3.4 trillion annually. And air and water pollution silently damage health, productivity, and cognition, thereby sapping human potential, the report estimates.\n\nIf managed well, however, nature can create jobs, drive economic growth, and build resilience. Using natural resources more efficiently could reduce pollution by as much as 50 per cent. Improving farm-level practices of nitrogen fertiliser use can deliver 25 times greater benefits than their cost, while boosting crop yields.\n\nImproving water and sanitation services could be lifesaving: chlorinating water at point of use could save a quarter of the children that prematurely die from water-related issues. “Pollution markets” not only reduce air pollution, they are also cost effective: each dollar spent yields about $26 to $215 in benefits.\n\nAround 80 pc of the people in low-income countries live with all three environmental stressors — degraded land, polluted air, and water stress. By contrast, in high-income countries 43 per cent of people are not exposed to any of the three stressors.\n\nThe report says the scale of impacts is so vast that humans have transitioned from being passive beneficiaries of the planet to becoming the dominant force in its transformation.\n\nToday humans and their livestock account for an astonishing 95 per cent of total mammalian biomass (by weight) on Earth, leaving wild mammals a vanishing 5 per cent.\n\nThe Earth has transgressed six of the nine environmental thresholds — termed “Planetary Boundaries” — needed for human progress, the report says.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:01:52.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939244/90pc-of-world-lives-on-degraded-land-unhealthy-air-water-stress-wb",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:20.000Z"
}
