{
  "title": "17 killed, over 1,500 injured in traffic accidents in August: Rawalpindi CTP - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: At least 17 people were killed while 1,542 were injured, 697 of them critically, in 1,409 road traffic accidents in Rawalpindi district in August 2025, as the City Traffic Police (CTP) have not set a casualty reduction target aiming to cut road casualties in the current month.\n\nIt may be recalled that 17 people were killed while 1,473 were injured in 1,318 road traffic accidents in July, whereas the number of deaths on roads did not increase in August. However, the number of injured increased from 1,473 to 1,542 in August.\n\nChief Traffic Officer Farhan Aslam, who has recently assumed the charge, told Dawn that the traffic police had carried out a survey of hot spots where most of the accidents had occurred. In view of the survey, extra police have been deployed and traffic laws enforcement has been ensured, aiming to reduce the casualties during the current month, he said.\n\nAccording to a spokesman for the Emergency Services Department, 1,409 road traffic accidents were reported in August, in which a total of 1,559 people were victims.\n\nThe spokesman said 1,409 road traffic accidents were reported during August, and a total of 1,559 people were the victims.\n\nIn these road traffic accidents, 17 people were killed, 697 were seriously injured, and 845 slightly injured, he said.\n\nRescue 1122 promptly responded to all accidents on time, maintaining the average response time and providing timely rescue services to all victims.\n\nThe majority of these road traffic accidents involved car and motorcycle riders. Of the 1,559 traffic accidents, the victims included 1,324 men and 235 women. Most of the victims were between the ages of 11 and 40, said the spokesman.\n\nCauses of accidents included speeding, careless driving, wrong turns, tyre blowouts, and others.\n\nThe emergency services emphasised the observance of traffic rules, if the road traffic accidents are to be reduced.\n\nMeanwhile, 88 fire incidents were reported to the emergency services in the district in August in which one person was injured.\n\nThe firefighters and the district rescue administration saved a total of approximately Rs95 million from potential damage in these fire incidents.\n\nA spokesman for the emergency services said rescue teams arrived at the scenes in a timely manner and carried out rescue operations. Rescue firefighters were able to control these incidents in a timely manner through professional action.\n\nThe causes of fires included short circuits, careless use of cigarettes, gas leakage and others. Rescue 1122 is also working to reduce the number of fire incidents.\n\nEnforcement of fire safety rules, fire safety training, and other programs are ongoing to reduce the number of fire incidents, he said.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:01:30.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939233/17-killed-over-1500-injured-in-traffic-accidents-in-august-rawalpindi-ctp",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:48:10.000Z"
}
