{
  "title": "Diplomatic tour de force: China’s Xi shows he’s ‘totally in charge’ - World - DAWN.COM",
  "author": null,
  "content": "When Chinese leader Xi Jinping organised his first parade to mark the anniversary of the end of World War II, in 2015, he placed his two predecessors by his side in a show of respect and continuity of leadership.\n\nTen years on and having eliminated domestic opposition as he serves an unprecedented third term as president, Xi was flanked on Wednesday at the 80th anniversary parade by Russia’s Vladimir Putin and North Korea’s Kim Jong Un.\n\nChinese Communist Party leaders were interspersed among overseas guests. The parade followed Xi’s high-profile summit with Indian Prime Minister Narendra Modi at a weekend meeting of the Shanghai Cooperation Organisation (SCO) in Tianjin, and the Chinese leader’s rare visit to Tibet last month.\n\nThis display of diplomatic clout, stamina and geopolitical ambition has helped quell concerns among some China observers about the 72-year-old president’s vitality, linked to sporadic absences and — so far unknown — succession plans. It has also helped divert domestic attention from slowing growth, experts say.\n\nLongevity was on the leaders’ minds as they walked up to the rostrum at Beijing’s Tiananmen Square — Xi and Putin were caught in a hot mic moment discussing organ transplants and the possibility that humans could live to 150 years old.\n\n“This week of triumphant diplomacy for Xi shows that he remains totally in charge of the elite politics of the Communist Party,” said Neil Thomas of the Asia Society, a New York-based think tank. Unable to get the same legitimacy from economic growth as his predecessors, Xi has turned toward nationalism “to try and make up for it”, Thomas said.\n\n“It’s a way to divert attention from economic challenges and to make his citizens proud to be Chinese, even if it’s harder to feel that from the day-to-day experiences of unemployment, falling house prices and stagnant wages.”\n\nXi underscored his elder statesman image with fashion choices: a grey suit in the style of those worn by Mao Zedong, matching his greying hair, in contrast to the black suits of his counterparts and his own black attire from a decade earlier.\n\nHis number two, Premier Li Qiang, whose role has diminished at home, was charged with relatively minor meetings with leaders of Malaysia and Uzbekistan. High-profile engagements with Kim, Modi, Turkish President Tayyip Erdogan and several others fell to Cai Qi, who heads the party’s Central Secretariat, responsible for its sprawling administration.\n\nIn response to a Reuters request for comment, China’s foreign ministry referred to news conference transcripts related to the recent diplomatic events, showcasing China’s partnerships with developing nations and positioning Beijing as committed to peaceful development and international cooperation.\n\nMany countries that sent their leaders to China in the past week have been hit by US President Donald Trump’s trade tariffs this year, including India, which remains a significant buyer of Russian oil, hit by sanctions over Putin’s invasion of Ukraine.\n\nIn one of the most memorable moments in the flurry of diplomatic encounters, Modi and Putin walked over for a chat with Xi while holding hands, underscoring personal tensions between Trump and Modi, as well as Washington’s failure to draw historically non-aligned India in to counter Russia and China.\n\n“Ultimately one of the biggest driving factors of the SCO show of solidarity has been US policy,” said Even Pay, a director at strategic advisory firm Trivium China.\n\nTrump, who called the military parade “beautiful” and “very, very impressive”, made a barbed post on social media saying China was working with Putin and Kim to “conspire against The United States of America”.\n\nThe Kremlin responded that they were not conspiring and suggested Trump’s remarks were ironic.\n\nAnalysts say Xi’s whirlwind of activity underscores China’s ambition in presenting itself as a reliable partner to developing nations on the global stage, offering advantages like investment opportunities and even a new development bank — a major step forward for the SCO, which has expanded markedly over past decades to also include India, Pakistan and Iran.\n\n“China’s message as a more reliable, stable alternative to the United States is resonating with large swathes of the world, particularly across Asia, which sees the United States as an increasingly belligerent force in world affairs,” said Eric Olander, editor-in-chief of the China-Global South Project, a research agency.\n\n“A lot of developing countries and middle-power states may still be a bit ambivalent about what China’s proposing with its new governance and development initiatives, but at least what China is talking about is forward-looking, which is crucial for economies with large populations of young people looking for better employment opportunities,” Olander said.\n\nXi faces considerable challenges in managing this large and often fractious coalition as he eyes a potential fourth term of office in 2027 to further cement his legacy as the most powerful Chinese leader since Mao.\n\nEntrenched Chinese foreign policy positions, including territorial disputes and industrial subsidies that have flooded foreign markets with cheap exports, will likely remain friction points, experts say, while India’s deep distrust of China will not dissipate because of one brief meeting.\n\n“It’s not necessarily a big-picture shift towards a more China-led international order,” said the Asia Society’s Thomas.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/05161744a93aebc.webp",
  "retrievedAt": "2025-09-06T10:02:05.315Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939932/diplomatic-tour-de-force-chinas-xi-shows-hes-totally-in-charge",
  "dateList": "2025-09-03",
  "date_published": "2025-09-05T12:08:24.000Z"
}
