{
  "title": "Kalabagh proposal finds no takers, save for Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After ign­i­ting a storm over his ‘conditional’ support for the controversial Kalabagh Dam, Khyber Pakhtu­nkhwa Chief Minister Ali Amin Gandapur on Tuesday doubled down on his statement, saying it was the need of the hour.\n\nThe KP CM’s support for the long-proposed-but-never-built project stirred a veritable hornet’s nest, with even his own party leaders opposing his endorsement for the controversial project.\n\nHowever, the maverick politician’s views prompted endorsement from unlikely quarters — the Punjab government, led by PML-N.\n\nA day earlier, at rain-hit event held at KP House in Islamabad, the KP CM had expressed ‘conditional support’ for projects like the Kalabagh Dam, saying they were necessary for the sake of future generations.\n\nHowever, in the same bre­­­ath, he said that the reservations of all stakeholders, including provinces, should be addressed prior to its construction.\n\nPolitical circles have been abuzz since then, with many struggling to decide whether to view his remarks as courageous or foolhardy.\n\nIn another interaction with journalists in the capital on Tuesday, CM Gandapur referred to international studies that favoured the construction of the controversial Kalabagh Dam.\n\nHe said he had brought up the issue during a recent meeting of the Council of Common Interests (CCI), but claimed that some “foolish people” were against it.\n\nMeanwhile, Punjab Information Minister Azma Bokhari on Tuesday said that for the first time, the Punjab government had found itself in agreement with the KP CM on this issue. Speaking at a presser, she said that Punjab endorsed what Mr Gandapur had said about the Kalabagh Dam.\n\nShe said that Pakistan was among the countries most severely affected by climate change, making the construction of new dams a national necessity. She even suggested that all provinces should work on a joint action plan.\n\nBut the KP CM’s statement had his own party puzzled. PTI leader and former National Assembly speak Asad Qaiser told Dawn Mr Gandapur’s statement did not reflect party policy.\n\n“The party has always made it clear that there should not be any controversial project in Pakistan. At the moment, there is need to strengthen the federation. The policy of Imran Khan is very clear, no such project can be started without consensus and the same has been suggested by the party’s Central Executive Committee,” he said.\n\nAsked why he thought the chief minister would make such a statement, Mr Qaiser said that Gandapur should not have discussed the controversial issue.\n\n“I cannot fathom how he has made the statement without discussing it within the party. I would say that it is his personal opinion and not party policy”, he added.\n\nMeanwhile, PTI Sindh leader Haleem Adil Sheikh called the proposal a “dead horse” which the party has never supported.\n\nIn a statement, Mr Sheikh said that jailed PTI founder Imran Khan had repeatedly opposed the controversial dam’s construction during his tenure, making the party’s stance clear.PPP leader Nisar Khuhro also expressed his annoyance over the KP CM’s statement, recalling that Sindh, KP and Balochistan have opposed the project in the past.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:59:19.036Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939250/kalabagh-proposal-finds-no-takers-save-for-punjab",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:14.000Z"
}
