{
  "title": "Trump says he plans to hold talks on Ukraine in coming days - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Wednesday he plans to hold talks about the war in Ukraine in the coming days after his Alaska summit with Russian President Vladimir Putin in August failed to achieve a breakthrough.\n\nTrump has been frustrated at his inability to put a halt to the fighting, which began with Russia’s invasion of Ukraine in February 2022, after he initially predicted he would be able to end the war swiftly when he took office in January.\n\nTrump said he would be holding talks in the next few days. A White House official said Trump is expected to speak on the phone on Thursday with Ukrainian President Volodymyr Zelensky.\n\nThe French presidency said earlier today that several European leaders, including Zelensky and France’s Emmanuel Macron, would call Trump on Thursday afternoon.\n\nThat call was expected to follow a mostly virtual meeting on Thursday, hosted by France, of some 30 countries to discuss their latest efforts to provide Ukraine with security support once there is a peace agreement with Russia. The European leaders were also expected to denounce Moscow’s unwillingness to negotiate.\n\nPutin has shown little interest in ending the war after he and Trump voiced optimism about making progress during their meeting in Anchorage on August 16.\n\n“I have no message to President Putin,” Trump told reporters at the White House as he met Polish President Karol Nawrocki.\n\n“He knows where I stand, and he’ll make a decision one way or another. Whatever his decision is, we’ll either be happy about it or unhappy about it, and if we’re unhappy about it, you’ll see things happen,” he said.\n\nTrump did not explain what he meant, but he has talked about the possibility of imposing more sanctions on Russia.\n\nRussian President Vladimir Putin told Kyiv that there was a chance to end the war in Ukraine via negotiations “if common sense prevails”, an option he’d prefer, but that he was ready to end it by force if that was the only way.\n\nSpeaking in China at the end of a visit there, Putin said that he perceived “a certain light at the end of the tunnel”, given what he said were sincere efforts by the US to find a settlement to Europe’s ‘biggest land war’ since World War Two.\n\n“It seems to me that if common sense prevails, it will be possible to agree on an acceptable solution to end this conflict. That is my assumption,” he told reporters in Beijing.\n\n“Especially since we can see the mood of the current US administration under President Trump, and we see not just their statements, but their sincere desire to find this solution.\n\n“And I think there is a certain light at the end of the tunnel. Let’s see how the situation develops. If not, then we will have to resolve all the tasks before us by force of arms.”\n\nPutin did not, however, indicate any willingness to soften his long-standing demands that Ukraine abandon any ideas of joining Nato, reverse what Moscow has described as discrimination against Russian speakers and ethnic Russians, or step back from the idea that Moscow must have full control of at least the Donbas area in eastern Ukraine.\n\nHe said he was ready to hold talks with Zelensky if the Ukrainian president came to Moscow, but that it remained to be seen whether such a meeting was worthwhile.\n\nHe repeated his view that Zelensky, who has not faced re-election due to martial law despite his official term in office expiring, was illegitimate. Kyiv flatly rejects that, saying it is impossible to hold meaningful elections at a time of war.\n\nZelensky has been pressing to meet Putin to discuss the terms of a possible deal, even though the two sides remain far apart, urging Washington to sanction Moscow again if Putin does not agree.\n\nTrump has also said he wants the two leaders to meet and spoken of but not yet imposed secondary sanctions on Russia.\n\nPutin told reporters he had always been open to meeting Zelensky, but reiterated the Kremlin’s oft-repeated stance that such a meeting had to be well prepared in advance and lead to tangible results.\n\n“As for a meeting with Zelensky, I have never ruled out the possibility of such a meeting. But is there any point? Let’s see,” said Putin.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/03225634bd79293.webp",
  "retrievedAt": "2025-09-06T10:00:58.144Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939457/trump-says-he-plans-to-hold-talks-on-ukraine-in-coming-days",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T18:10:51.000Z"
}
