{
  "title": "Khawaja Asif’s outburst comes under ‘friendly fire’ in NA - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Hanif Abbasi suggests defence minister resign instead of ‘abusing bureaucracy for publicity’\n• PTI boycotts NA proceedings, holds parallel ‘public assembly’ outside Parliament House\n\nISLAMABAD: Differences within the federal cabinet surfaced on Tuesday during a National Assembly debate on the flood crisis when Railways Minister Hanif Abbasi openly criticised Defence Minister Khawaja Mohammad Asif for his remarks on the government’s handling of the disaster.\n\nAlthough he did not name his cabinet colleague, Mr Abbasi made multiple references to the defence minister’s speech on the floor of the house a day earlier.\n\nHe even suggested that Mr Asif resign from the cabinet instead of “levelling allegations against parliament and abusing bureaucracy only to gain [media] publicity”.\n\nMeanwhile, members of the opposition PTI boycotted the proceedings and staged a parallel “public assembly” outside Parliament House to protest alleged political victimisation.\n\nSpeaking in the debate, Mr Abbasi accused some politicians of attacking institutions simply to go viral on social media. “If this is all they have to say, they should leave the government benches and sit in the opposition, because such language does not suit treasury members,” said Mr Abbasi, who was elected MNA from Rawalpindi.\n\nOn Monday, Khawaja Asif had described the recent devastation as a “man-made disaster”, blaming politicians and bureaucrats for unchecked encroachments on waterways and for allowing housing societies and hotels on riverbeds.\n\nHe also urged local government elections, criticising his own party’s government in Punjab for failing to hold them.\n\nHe also blamed a “contracting company” for the flood devastation in his home constituency, Sialkot.\n\nResponding to the defence minister’s speech, Mr Abbasi said that those who had been a part of the system for the past 40 years were now criticising the system and “demanding local government elections”.\n\nMr Abbasi took the floor when Mr Asif had already left the assembly hall after briefly attending the proceedings.\n\n“Does a contractor dare to carry out substandard work and run away with money in Rawalpindi?” said Mr Abbasi, stating that it was the responsibility of the MNAs to keep a check on such activities.\n\nHe said blaming the entire bureaucracy was unfair, noting that the obsession with going viral in politics had become a “disease”. “I have seen politicians resigning from the cabinet whenever a finger is raised at them. They left the ministry but stayed in the party,” he said while indirectly suggesting the defence minister resign from the cabinet.\n\nFederal Minister for Water Resources Mueen Wattoo said surveys were underway to assess flood-related losses, including damage to crops, livestock, and houses, with compensation to be provided to all affected families. He said estimates were being finalised to ensure timely financial assistance.\n\nPTI’s protest\n\nEarlier, before leading a walkout, PTI leader Asad Qaiser said his party was standing with the flood victims and the leadership had already directed the party workers to visit the affected areas.\n\nHowever, he said the party had decided to boycott the National Assembly proceedings to protest the policies of the “fascist” government, adding that the PTI members had already submitted their resignations from the standing committees.\n\nMeanwhile, talking to reporters after his meeting with former prime minister Imran Khan at Adiala Jail in Rawalpindi, PTI Chairman Barrister Gohar Ali Khan said the party’s decision to resign from standing committees was “final and irreversible”.\n\nQuoting the jailed former prime minister, he reportedly said that Imran Khan fully endorsed the party’s decision to boycott by-elections and supported the resignations submitted by members from parliamentary committees.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:59:15.154Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939249/khawaja-asifs-outburst-comes-under-friendly-fire-in-na",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:14.000Z"
}
