{
  "title": "Israel amasses troops ahead of offensive in Gaza City - World - DAWN.COM",
  "author": null,
  "content": "• Forces kill 56 Palestinians, including 10 in air strike on residential building\n• Belgium to recognise Palestinian state at UNGA\n\nJERUSALEM: Israel intensified its military build-up on Tuesday as reservists began responding to call-up orders ahead of a planned offensive to capture Gaza City, nearly two years into a devastating war.\n\nDespite mounting pressure at home and abroad to end its campaign in the Palestinian territory, Israel is gearing up to seize Gaza’s largest city — intensifyi­­ng bombardments and operati­ng in the outskirts in recent days.\n\nGaza’s civil defence agency said Israeli forces killed at least 56 people on Tuesday, including 10 in an air strike on a residential building in the southwest of Gaza City.\n\nAFP footage from the aftermath of the strike in the Tel al-Hawa neighbourhood showed Pa­­­lestinians carrying a dead girl from the rubble of the top floor.\n\n“We were sleeping safely in our homes and suddenly we wo­­ke up to the sound of bombing and destruction and found most of our neighbours murder­­ed and injured,” said Sanaa al-Dreimli.\n\nThe United Nations estimates that nearly a million people live in Gaza City and its surroundings, where a famine has been declared.\n\nIn a statement, the Israeli military said it had been preparing in recent days “ahead of expanded combat operations and the large-scale mobilisation of reservists”.\n\nSpeaking at an event in Jeru­salem, Defence Minister Israel Katz said: “Tens of thousands of reservists have left their homes, families and jobs to once again answer the national call — the return of all prisoners and the neutralisation of Hamas.”\n\nApproving the military’s pla­ns for the conquest of Gaza City in late August, Katz said he had authorised the call-up of about 60,000 reservists.\n\nIsraeli media reported that some 40,000 reservists were being called up in the first mobilisation wave.\n\nOn the ground in Gaza City, weary Palestinians told AFP they felt helpless and desperate ahead of the looming offensive.\n\n“There is no place for us to go, and no means to get there. We are exhausted physically and mentally from displacement and from the war,” 60-year-old Amal Abdel-Aal, who lives in a tent in western Gaza City, told AFP by telephone.\n\n“We have come to wish for death.”\n\nPalestinian state\n\nBelgium on Tuesday became the latest Western country to say it will recognise the State of Palestine at the UN General Assembly this month, following similar announcements by Australia, Canada and France.\n\n“Palestine will be recognised by Belgium at the UN session! And firm sanctions are being imposed against the Israeli government,” Foreign Minister Maxime Prevot wrote on X.\n\nIn July, French President Emmanuel Macron said France would recognise a Palestinian state at the UN meeting, due to be held from September 9 to 23 in New York. More than a dozen other Western countries have since called on others to do the same.\n\nPrevot said the decision came “in view of the humanitarian tragedy” unfolding in Gaza, where Israeli offensives have displaced most of the population at least once and the UN has declared a famine.\n\n“In the face of the violence perpetrated by Israel in violation of international law, given its international obligations, including the duty to prevent any risk of genocide, Belgium had to take strong decisions to increase pressure on the Israeli government and Hamas terrorists,” Prevot wrote.\n\n“This is not about punishing the Israeli people, but rather about ensuring that its government respects international and humanitarian law and taking action to try to change the situation on the ground,” he added.\n\nIn a post on X on Tuesday, the military’s Arabic-language spo­kesman warned Gazans of the upcoming “expansion of comb­­at operations towards Gaza City”.\n\n“We wish to remind you that in Al-Mawasi enhanced services will be provided, with an emphasis on access to medical care, water and food,” Avichay Adraee said, referring to an area in the south which Israel designated a humanitarian zone in the early months of the war but which has been hit by repeated strikes.\n\nIn mid-August, UN human rights office spokesman Thame­­en al-Kheetan said Palestinians in Al-Mawasi had “little or no access to essential services and supplies, including food, water, electricity and tents”.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/03084951df10b42.webp",
  "retrievedAt": "2025-10-12T03:59:00.662Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939247/israel-amasses-troops-ahead-of-offensive-in-gaza-city",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:20.000Z"
}
