{
  "title": "Paperboard industry warns of dumping risk - Business - DAWN.COM",
  "author": null,
  "content": "LAHORE: The government’s decision to fix a low Import Trade Price (ITP) of $610 per tonne for coated bleached board is likely to encourage the dumping of cheaper paperboard products — primarily from China — posing a serious threat to Pakistan’s domestic industry.\n\nMillers warn of job losses, revenue erosion, and idle capacity as they struggle to compete with underpriced imports.\n\nThe Pakistan paperboard industry has criticised the ITP as significantly lower than India’s recently imposed minimum import price (MIP) of $770 per tonne (CIF) for the same product, reflecting New Delhi’s efforts to protect its local industry. The $160 per tonne gap — a 26pc difference — has created an unlevel playing field, local producers say.\n\n“While India is shielding its capacity, employment, and investment, Pakistan is becoming a dumping ground for Chinese surplus,” said an industry source. “Our mills are rapidly losing market share and profitability.”\n\nThe coated bleached board — also known as folding box board — is widely used in packaging across the pharmaceutical, FMCG, food, and export sectors. Domestic manufacturers, who have invested heavily in machinery and co-generation plants, claim to have sufficient capacity to meet 100pc of national demand, replacing the need for imports.\n\nSeeks import price revision to avert job, factory losses\n\nThe industry argues that undervaluation of imported paperboard has led to a surge in under-invoiced shipments, which not only harms local production but also deprives the government of legitimate customs revenue. It has urged authorities to revise the ITP in line with the Indian benchmark to restore competitiveness and curb dumping.\n\nIn 2018, the National Tariff Commission (NTC) imposed a 28pc anti-dumping duty on the product, but it was never enforced. Exporters subsequently altered product descriptions to bypass the duty, prompting a fresh NTC investigation, which industry sources claim is facing procedural delays.As a result, monthly imports — previously 5,000–5,500 tonnes — have more than doubled, averaging 12,000 tonnes during the last fiscal year, further squeezing local manufacturers.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:59:22.663Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939298/paperboard-industry-warns-of-dumping-risk",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:35.000Z"
}
