{
  "title": "Construction activity spurs cement demand - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Rising construction activity continued to fuel cement demand in August, with total sales climbing 10.33pc year-on-year to 3.097 million tonnes, up from 2.807m tonnes in the same month last year. Export volumes also posted a strong gain, rising 22.13pc to 749,723 tonnes from 613,857 tonnes in August 2024.\n\nAccording to data released by the All Pakistan Cement Manufacturers Asso­ciation (APCMA), overall cement dispatches — including domestic sales and exports — reached 3.846m tonnes in August 2025, up 12.45pc from 3.421m tonnes in the same month last year.\n\nThe previous month, July 2025, showed even stronger performance, with domestic sales up 18.61pc and exports surging 84pc year-on-year.\n\nDuring the first two months of FY25 (July–August), total cement dispatches rose by 21pc to 7.847m tonnes compared to 6.492m tonnes in the same period of FY24. Domestic consumption stood at 6.090m tonnes, up 14.25pc from 5.331m tonnes, while exports surged 51.29pc to 1.757m tonnes from 1.161m tonnes.\n\nTotal despatches rose 21pc in July-August FY25\n\nAn APCMA spokesperson noted that despite challenges posed by heavy rains and flooding in parts of the country, the sector has shown resilience. He urged the government to reduce taxes on cement to ease reconstruction costs in flood-affected areas.\n\nFahad Hussain Khan of BMA Capital Management estimated cement capacity utilisation in August 2025 at 56pc, compared to 51pc in August 2024 and 59pc in July 2025.\n\nAccording to the Pakistan Bureau of Statistics (PBS), cement prices varied regionally during the month. In the North, the average retail price rose by Rs19 per 50kg bag month-on-month (MoM) to Rs1,396, while in the South, it fell by Rs5 per bag to Rs1,443.\n\nMr Khan added that cement demand is likely to recover further in FY26, supported by improved fiscal space, easing inflation, and lower interest rates.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:01:42.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939300/construction-activity-spurs-cement-demand",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:35.000Z"
}
