{
  "title": "La Nina may return to impact climate patterns from Sept onward: World Meteorological Organisation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: La Nina may return to impact weather and climate patterns from September onward, according to the latest World Meteorological Organisation (WMO) update.\n\nBut despite the temporary cooling influence of La Nina, temperatures are still expected to be above average for much of the world, the WMO cautioned on Tuesday.\n\nThe WMO data indicates a 55 per cent likelihood that sea surface temperatures in the equatorial Pacific will cool to La Nina levels from September to November. About 90 per cent of the excess heat from global warming is stored in the ocean, making ocean heat content a critical indicator of climate change.\n\n“For October to December 2025, the probability of La Nina conditions slightly increases to about 60 per cent. There is little chance of El Nino developing during September to December,” WMO said in an update.\n\nAccording to the UN agency, there is a slim chance (45 per cent) that Pacific temperatures will stay as they have for the past six months, when neither the cooling La Niña nor its opposite number, the warming El Niño, caused unusual spikes or dips in sea surface temperatures.\n\nThe UN agency’s forecast for the El Niño Southern Oscillation phenomenon is an important climate intelligence tool which could “save thousands of lives when used to guide preparedness and response actions”, insisted WMO Secretary-General, Celeste Saulo.\n\nThe information could also translate into millions of dollars of savings in agriculture, energy, health and transport, she said.\n\nImportant as La Nina and El Nino are in shaping our climate by altering ocean surface temperatures and impacting changes in winds, pressure and rainfall patterns, human-induced climate change is still “increasing global temperatures, exacerbating extreme weather, and impacting seasonal rainfall and temperature patterns”, the WMO noted.\n\nEach year of the past decade has been the top 10 warmest on record, the UN agency warned earlier this year, with 2024 the hottest yet, with “exceptional land and sea surface temperatures and ocean heat”.\n\nCiting six international datasets, WMO said that global average surface temperature was 1.55°C (34.79F) above the 1850-1900 average.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/03094835305b19a.webp",
  "retrievedAt": "2025-10-12T03:59:18.069Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939325/la-nina-may-return-to-impact-climate-patterns-from-sept-onward-world-meteorological-organisation",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:27.000Z"
}
