{
  "title": "PHF chief rules out Pakistan’s participation in Jr World Cup - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: Insisting that sending the teams to India for international events amid heightened political tensions was not possible, Pakistan Hockey Federation (PHF) president Tariq Hussain Bugti on Tuesday said the country will not compete in the Jr World Cup later this year.\n\nThe event is scheduled to be held in Indian cities of Chennai and Madurai from Nov 28 to Dec 10.\n\nPakistan, primarily due to ongoing political strains with New Delhi particularly after a short yet intense military clash between the nuclear-armed neighbours in May, are not competing in the Asia Cup too which is currently in progress in the Indian city of Rajgir.\n\nTalking to reporters in Lahore on Tuesday, Bugti while acknowledging that not participating in international events in India was hurting the country’s hockey, said the national cause was bigger than everything.\n\n“As there is a war-like situation [currently] prevailing between Pakistan and India, there is no possibility that the PHF will send its team to India for the Junior World Cup. [For the same reason] we did not send our [senior] team for the Asia Cup,” Bugti said.\n\n“We have informed the International Hockey Federation [about missing the events in India]; it will provide Pakistan with an opportunity to qualify for the [senior] World Cup through a qualifying round,” he added.\n\n“The entire world knows about the present [political] scenario between India and Pakistan. Therefore, they recognise that it is not possible for Pakistan teams to tour India.”\n\nMeanwhile, the PHF chief thanked the government for sanctioning Rs250 million to ensure national senior team’s participation in the 2025-26 FIH Pro League that will feature the game’s nine top teams. The PHF had sought Rs350 million for the league.\n\n“It is a good step taken by the federal government in order to bring improvement in our team which will face world’s top teams in the Pro League. And the PHF will field its best team to get full benefit from this event,” he said.\n\nBugti also revealed that the Pakistan Sports Board had also received Rs250 million from the Finance Ministry, adding modalities were being finalised between the PSB and the PHF on how to use this fund in the best possible way.\n\nThe FIH invited Pakistan to participate in the Pro League as runners-up of the FIH Nations Cup held in Malaysia this year after winners New Zealand withdrew from the league due to financial constraints.\n\nSpeaking on the occasion, Bugti agreed that a separate foreign coach for goalkeepers should be hired for the national team to strengthen this vital department of the game.\n\n“The PHF also wants a helping hand from the federal government to hire the services of a suitable foreign coach for goalkeepers,” he said.\n\nPublished in Dawn, September 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:01:01.353Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939287",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T00:47:46.000Z"
}
