{
  "title": "Info Ministry promotes national cohesion, projects Pakistan’s soft image: NA told",
  "link": "https://www.app.com.pk/national/info-ministry-promotes-national-cohesion-projects-pakistans-soft-image-na-told/",
  "date_published": "2023-05-22T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):Parliamentary Secretary for Information and Broadcasting Choudhry Muhammad Shahbaz Babar on Monday informed the National Assembly that the Ministry of Information and Broadcasting (MoIB) promoted national cohesion and projected a soft, progressive and democratic image of Pakistan within and abroad.\nReplying to a question during the Question Hour, he said the Information Ministry was responsible for promoting the state narrative, and projecting government policies and programmes for public awareness.\n“As per Rules of Business 1973, the ministry is entrusted with the responsibility to provide policy guidelines to the state electronic media, relating to internal publicity on national matters, press relations, including delegations of journalists and other information media, provision of facilities for the development of newspapers industry and liaison and coordination with agencies and media on matters concerning government policies and activities,” he added.\nShahbaz Babar said the ministry was also responsible to formulate and implement policies, laws, rules and regulatory framework in respect of print, electronic and digital media.\nThe Parliamentary Secretary said, “The Press Information Department (PID) extends professional support to ministries and Federal Government organizations for effective projection of the policies and programmes of the government, and runs media campaigns on government initiatives to create awareness among the masses.”\nAlongside promoting a soft image of the country, it also countered negative propaganda against the state, he added.\nHe said the Associated Press of Pakistan (APP) was the official news agency, which also worked for promoting the national narrative.\nSimilarly, he said, the Directorate of Electronic Media and Publications (DEMP) “produces documentaries and publishes journals/ publicity material”.\nShahbaz Babar said the Pakistan Television (PTV) was the singular terrestrial national channel with maximum outreach. The Pakistan Broadcasting Corporation (PBC), being the national broadcaster, countered propaganda against the state in various languages, he added.\nHe said the Information Ministry’s representatives were working in various missions abroad.",
  "retrievedAt": "2025-08-11T08:32:11.715Z"
}
