{
  "title": "NA for prosecuting those involved in May 9 incidents under existing laws",
  "link": "https://www.app.com.pk/national/na-for-prosecuting-those-involved-in-may-9-incidents-under-existing-laws/",
  "date_published": "2023-05-22T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):The National Assembly on Monday adopted a resolution demanding to prosecute all abettors, planners, facilitators and those directly or indirectly involved in arson, attacks on military installations as well as public and private properties on May 9 under existing laws of the country.\nThe House through the resolution moved by Minister for Defence Khawaja Asif vehemently condemned the shocking, brazen, heart wrenching and shameless incidents, which took place in certain parts of the country on 9th May, 2023 and tarnished the national image.\nIt expressed its full faith in and complete solidarity and support for the Armed Forces of Pakistan.\nThe House resolved that 9th May should be reckoned as Black Day and that all abettors, planners, facilitators and those directly or indirectly involved in arson, attacks on military installations as well as public and private properties should be prosecuted/tried under the existing laws of the country including, Anti-terrorism Act 1997, Army Act 1952 and Pakistan Penal Code 1860.\nIt urged all relevant authorities to implement social media rules and regulations in order to tackle propaganda being unleashed against the country’s institutions, both from within and outside of Pakistan, under the patronage and facilitation from multiple players.\nIt stated that those involved in such propaganda campaigns should strictly be dealt with as per law.\nThe resolution further stated,”We reiterate our commitment to national unity, harmony and integrity in the wake of current geostrategic situation and deprecate all anti-state elements which attempt to destabilize the country.”\nIt further stated that resolution of all political issues must always stay within the realm of parliamentary and democratic norms and resorting to violence against state institutions, public and private properties is totally unacceptable.",
  "retrievedAt": "2025-08-11T08:32:10.641Z"
}
