{
  "title": "Imran’s govt did nothing except hatching conspiracies against country: Amir Muqam",
  "link": "https://www.app.com.pk/national/imrans-govt-did-nothing-except-hatching-conspiracies-against-country-amir-muqam/",
  "date_published": "2023-05-22T11:47:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, May 22 (APP):Adviser to Prime Minister for Political and Public Affairs, National Heritage and Culture Engr Amir Muqam on Monday said that Imran Khan’s government did nothing except hatching conspiracies against the country.\nAddressing the inaugural ceremony of newly established NADRA centers in Shangla, Adviser to Prime Minister Engr Amir Muqam said that May 9 was the darkest day in the history of the country when Imran Niazi led miscreants attacked country institutions.\nThey caused huge loss to the public exchequer and the dignity of the country that the worst enemies of Pakistan could not do during the past 75 years, he added.\nHe said that now it is crystal clear that Imran Niazi was working on enemy’s agenda and Imran and his followers were working against the sanctity of Pakistan.\nImran Niazi wanted to create rift in the nation’s ranks using negative propaganda in his narrative, he added.Engr. Amir Muqam said that Pakistan Muslim League Nawaz is the only political party that can steer the country out of current challenges.\nHe also expressed solidarity with the state institutions and asked the people to reject foreign agent like Imran Khan and choose people who are ‘made in Pakistan’.\nEngr Amir Muqam said that the incumbent government is fully committed to resolving the problems of the masses, especially the womenfolk. He added that Prime Minister Muhammad Shehbaz Sharif has put the country on the right track and in the near future people will avail its fruits.\nEarlier, Adviser to Prime Minister for Political and Public Affairs, National Heritage and Culture Engr Amir Muqam has inaugurated separate NADRA centers for women in Alpurai and Bisham and Gratis centers in Karora and Olander Bilkani.\nThe Adviser to Prime Minister Engr Amir Muqam warmly received on arrival at the venues of inauguration by the local people.\nThe local people also chanted slogans in favour of Engr Amir Muqam and former Prime Minister Muhammad Nawaz Sharif, Prime Minister Muhammad Shehbaz Sharif and Pakistan Muslim League N Chief Organizer Maryam Nawaz.In this regard, ceremonies were held in Alpurai, Bisham, Karora and Olander Bilkani which were also attended by NADRA senior officials and administration.\nThe Adviser to Prime Minister unveiled the plaque to formally open the women NADRA Centers. He said that keeping in view sufferings, special centers for women with female staff members have been established in the NADRA centers, Alpurai and Bisham to facilitate them.\nWith special efforts of Adviser to Prime Minister Engr Amir Muqam, the NADRA Gratis Centers established at Karora and Olander Bilkani were inaugurated.\nUnder this NADRA issues CNIC for free as a privilege to persons belonging to some special categories, like disables, BISP beneficiaries and employees of some government organizations.\nEarlier, he also inaugurated XEN PESCO Divisional Office at Shangla, which would facilitate the people at their doorstep.",
  "retrievedAt": "2025-08-11T08:32:14.447Z"
}
