{
  "title": "G20 summit in IIoJK, futile exercise on India’s part: Kaira",
  "link": "https://www.app.com.pk/national/g20-summit-in-iiojk-futile-exercise-on-indias-part-kaira/",
  "date_published": "2023-05-22T13:46:00.000Z",
  "source": "APP",
  "content": "BAGH, May 22 (APP):Advisor to the Prime Minister on Kashmir Affairs and Gilgit-Baltistan Qamar Zaman Kaira Monday said India could not hide worst human rights situation in Indian Illegally Occupied Jammu and Kashmir (IIoJK) by holding G-20 summit in the valley.\n“By holding G-20 summit in IIoJK, India wants to convey a message to the world that all is good in the valley, but it will prove a futile exercise on New Delhi’s part,” he said in an exclusive talk with APP during his visit here.\nHe lashed out India for its ulterior motives behind the summit which was meant to deceive and mislead the world.\nModi government’s intention was to dampen the morale of the people of Occupied Kashmir by creating a smokescreen before the world, he added.\nHe emphasized that the unwavering spirit of freedom among the Kashmiri people remained steadfast, and the entire Pakistani nation stood united in solidarity with Kashmiri brethren.\nUnder the leadership of Prime Minister Shahbaz Sharif and Foreign Minister Bilawal Bhutto Zardari, he said the entire Pakistani nation condemned holding of the summit in G-20.\nKaira said Pakistan’s outreach to friendly countries and member states of G-20 had been bearing fruits as several countries had decided not to participate in the moot.\nHe categorically stated that Pakistan was against India’s decision to hold G-20 summit in the disputed territory.\nThe advisor said India had been oppressing Kashmiris through use of force and propaganda, and by denying their fundamental rights.\nThe main objective was to strip them off their identity and suppress their unwavering determination.\nKashmiris had never succumbed to the Indian subjugation and would never do so, he added.\nHe said the international community should play proactive role to resolving Kashmir issue as per the resolutions of the United Nations.\nThe situation in IIoJK would have been different if the international community had played its due role in the past, he added.\nKaira said overseas Pakistanis and Kashmiris would continue to highlight Kashmiris’ plight around the globe to shake the world’s conscience.",
  "retrievedAt": "2025-08-11T08:32:13.458Z"
}
