{
  "title": "Alastair Lamb paid tribute for raising awareness about Kashmir",
  "link": "https://www.app.com.pk/national/alastair-lamb-paid-tribute-for-raising-awareness-about-kashmir/",
  "date_published": "2023-05-22T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):Secretary for Foreign Affairs Dr Asad Majeed Khan Monday said writings of Alastair Lamb have helped raise awareness about the historical context, legal complexities and human rights implications of the Jammu and Kashmir dispute and encouraged a more informed discourse on the subject.\n“We are gathered here to celebrate and honour Alastair Lamb, an eminent researcher and historian, whose name has become synonymous with intellectual vigour and unwavering commitment to the pursuit of truth,” said Dr. Asad Majeed at an event “Remembering Alastair Lamb: A Tribute to an Eminent Scholar” organised by India Study Centre at Institute of Strategic Studies Islamabad here.\nDr. Asad Majeed, who was the chief guest at the commemorative event, praised the life and unmatched scholarship of Alastair Lamb. The Foreign Secretary emphasized that it was the right time to recognise the scholarly contributions by Alastair Lamb as India was using its position as a G20 Chair and convening a meeting in the occupied Jammu and Kashmir. He added that, clearly, India was trying to mislead the international community by peddling the fake narrative of ‘normalcy’ in IIOJK in complete disregard of the UNSC resolutions and in violation of the principles of UN Charter and international law.\nWhile delivering his welcome remarks, Director General ISSI Ambassador Sohail Mahmood stated that Alastair Lamb was the first academic who examined British archives on Kashmir and, through his meticulous research on the genesis of the Jammu & Kashmir dispute, had definitively demolished the Indian case about the legitimacy of the State’s “accession” to India.Alastair established beyond any doubt that the Maharaja could not have signed the so-called ‘Instrument of Accession’ on 26 October 1947, as he was on road to Jammu and that there was no evidence of any contact between him and Indian emissaries on that day. Today, by holding a G20 working group meeting in Srinagar, India was desperately seeking legitimacy for its illegal occupation, which Pakistan and the people of Kashmir had rejected from the outset, he added.DG Sohail Mahmood put forth several recommendations that included conferment of high civil award (posthumously) upon Alastair Lamb; establishing an ‘Alastair Lamb Chair for Kashmir Studies’ in one of the leading universities of Pakistan or AJK; and establishment of a Library and Resource Centre in the name of Alastair Lamb where his work and other related materials should be kept.\nDr. Arshad Ali, Director India Study Centre in his introductory remarks said that the demise of Alastair Lamb was a huge loss to the field of scholarly research, particularly related to the origin of the Jammu and Kashmir dispute. Alastair Lamb’s lifelong commitment to academic research and his unwavering pursuit of knowledge have greatly enriched our understanding of the Kashmir issue. Alastair Lamb’s profound influence and contributions to the understanding of the Jammu and Kashmir dispute will continue to inspire generations of scholars, researchers and students, perpetuating his intellectual legacy for years to come.\nMuhammad Farooq Rehmani, former convener APHC-AJK chapter, paid rich tributes to Alastair Lamb as a historian of modern Kashmir. He said that Alastair Lamb was a great political historian and the people of Kashmir were indebted to him in many ways. He also underscored the importance of familiarizing the youth with the history of the Kashmir dispute and all aspects related to it.\nDr. Salma Malik, Associate Professor at Quaid-e- Azam University, stated that the work of Alastair Lamb was widely acknowledged and, at the same time, segments in India had sought to make him a ‘controversial figure.’ This was because he spoke the truth and challenged the Indian narrative while debunking many of the myths advanced by India. Dr. Salma Malik added that many people did not realise the importance of the work done by Alastair Lamb. She suggested that in order to promote Kashmir studies, Lamb’s research on Kashmir and his cartographic work should be taught at universities.\nIftikhar Gilani, a prominent Kashmiri Journalist, lamented that, despite having 5000 years of documented history of Jammu and Kashmir, the events of 1947 had been clouded in mystery. However, work by writers like Joseph Korbel and Alastair Lamb provided a clear picture on events relating to the genesis of Kashmir dispute. Alastair Lamb’s major contribution was to challenge the date of the signing of alleged Instrument of Accession after meticulous research.\nAmbassador Khalid Mahmood, Chairman Board of Governors (BoG) ISSI, while concluding the event said that at the time of partition and emergence of Kashmir dispute, the basic principle was violated and India grabbed Hyderabad and Junagadh on one basis, and Jammu & Kashmir on another basis. India manipulated the ‘accession’ issue and weaved a web of deception and also told the world that the future of the state will be decided by the people of Kashmir, but later it backtracked on its solemn pledges. He said solid research work was needed to counter India’s claims and that void was filled by Alastair Lamb.",
  "retrievedAt": "2025-08-11T08:32:11.512Z"
}
