{
  "title": "Govt devising strategy to ensure effective control on selling, use of drugs: NA told",
  "link": "https://www.app.com.pk/national/govt-devising-strategy-to-ensure-effective-control-on-selling-use-of-drugs-na-told/",
  "date_published": "2023-05-22T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):Minister for Narcotics Control Nawabzada Shazain Bugti Monday informed the National Assembly that the government was devising a comprehensive strategy to curtail movement of narcotics while legislation for ensuring effective control on selling and use of drugs was under consideration as well.\nResponding to a calling attention notice regarding sale of ice and other drugs openly in the country, he said,“The government is devising a new system to effectively check the illegal business of narcotics and we are confident that new system will help closing all those avenues being used by drug traffickers,”\nCurrently, the minister said the ministry’s staff strength was 3,600 as its personnel were performing duties at airports, ports and other border areas.\nAnti Narcotics Force (ANF) he said, and other federal and provincial agencies and departments were actively engaged in controlling the menace of drugs that was evident from the fact that out of total recovery of drugs and narcotic substances across the world as much as 17 percent was recovered in Pakistan alone.\nOn a query about use of narcotics in educational institutions, the minister informed that government was working on legislative framework which would empower the enforcement agencies to carry out random drug testing in educational institutions.\nIt would help discouraging the trend of drug usage among the youth that was future of Pakistan and must be prevented from indulging in self harming habits like drugs, he added.\nBesides stringent measures to control the drug peddling across the country, the government was also focused on effective measures for rehabilitation of drug addicts; he said adding that federal and provincial governments were working jointly to achieve the set goals.\nAbout rehabilitation of addicts, he said that three model addiction rehabilitation and treatment centres were functioning in Sindh, one each at Karachi, Hyderabad and Sukkur, in collaboration with the provincial government.\nDiscussion, he said, was underway with Sindh government for establishing more rehab centres in the province and provincial government has agreed in principle that rehabilitation and treatment centres should be set up at district level, he informed.",
  "retrievedAt": "2025-08-11T08:32:11.104Z"
}
