{
  "title": "Country won’t survive if any leniency shown to May 9 arsonists: PM",
  "link": "https://www.app.com.pk/national/country-wont-survive-if-any-leniency-shown-to-may-9-arsonists-pm/",
  "date_published": "2023-05-22T15:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): Prime Minister Shehbaz Sharif on Monday said that the country would not survive if any leniency was shown to the perpetrators of the arsons on May 9 involving the desecration of the martyrs, monuments, and damaging the security installations.\n“The nation will not forget this heart-rending incident. We don’t have any personal vendetta. But those who desecrated the martyrs, Ghazis, and their monuments, and burnt Jinnah House … they will have to be tried under the law. And if any leniency is shown to them, the country will not survive,” he said addressing the National Assembly.\nHe said the coalition parties had faced many ordeals but the May 9 incident was intolerable.\n“This is the nation’s trust and I will return it to them,” he remarked.\nThe prime minister thanked the House for adopting a resolution against May 9 riots and explained that the cases pertaining to the attack on civilian infrastructure would be tried under anti-terrorism law but those concerning the military installations would be heard by the military courts and that no special laws were being promulgated for the purpose.\nResponding to his tweet, the prime minister rubbished PTI chief Imran Khan’s claim that he had made replaced a senior military officer after he informed him about his wife Bushra Bibi’s involvement in corruption.\n“Imran Niazi once again told a blatant lie before the nation… I said so because I personally know it,” he told the House.\nHe said the arsons following the arrest of Imran Niazi in a NAB case involving Rs60 billion corruption was a heartbreaking incident the nation never went through. He said during his government, Imran Niazi pushed the whole opposition to the wall but they never resorted to damaging the public property.\nReferring to the Al Qadir Trust case, the prime minister said Rs60 billion was supposed to be transferred to the national kitty but the matter was approved secretively by that time federal cabinet.\nHe said after undermining the Pak-US ties through the allegations of the regime change conspiracy, Imran Niazi was now seeking help from America. Similarly, he also hurt the Pak-China fraternal ties by hurling allegations of corruption in the China-Pakistan Economic Corridor.\nHe said same China had again come up to support Pakistan on the Kashmir cause by staying away from the G-20 summit being hosted by India in IIOJK and that similar reports were also coming about Saudi Arabia and Turkiye.",
  "retrievedAt": "2025-08-11T08:32:10.810Z"
}
