{
  "title": "Boy kept in chains by his father freed in Lakki Marwat - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: A boy kept in chains by his father was released by the police in Bannu district on Thursday.\n\nA police official said that the incident came to light when a video appeared on the social media platforms showing a 10-year-old boy chained by his father at a small grocery outlet in the rural locality.\n\nDPO Saleem Abbas Kulachi took notice of the incident and directed DSP Arshad Khan for prompt action,” he maintained. He said a police party reached the area where they found the boy in a small shop.\n\n“The policemen released the boy, arrested his father and shifted him to the police station,” he claimed. He said that later the police also released the father when he apologised for the act and assured the police officials that he would not repeat the mistake in future.\n\nMeanwhile, a government team has asked the elders of Nurar tribe of Bannu district to withdraw their May 12 protest call as the district administration and police were making full efforts to secure the safe release of a kidnapped schoolteacher.\n\nBannu deputy commissioner Muhammad Faheem along with DPO Saleem Abbas Kulachi met with the elders at the residence of Pir Sahib Zaman and told them about the efforts launched by the government agencies for the recovery of the abducted teacher.\n\nMiryan tehsil council chairman Pir Kamal Shah, Malik Sher Ayaz Khan, Malik Sharif Khan, Malik Dil Nawaz Khan, Malik Sadar Khan, former district naib nazim Pir Munir Shah, Satar Ali Shah, Malik Ishaq and other elders were in attendance.\n\nThe government officials assured the elders that the kidnapped teacher would be freed from the captivity of captors as the police and other law enforcement agencies were actively engaged in that regard.\n\nIn the prevailing situation, the Nurar tribesmen and residents of the district should exhibit patience and trust in the police and LEAs for the recovery of the teacher, they maintained.\n\nThey asked the elders to call off planned agitation as it could hamper efforts aiming to free the hostage safely.\n\nPir Sahib Zaman and other elders said on the occasion that Farman Ali Shah, a government schoolteacher hailing from Nurar tribe had been kidnapped by unknown armed men on April 23 and since then the tribesmen had been protesting, but to no avail.\n\nThey thanked the administration and police authorities for their efforts and said that the tribesmen wanted peace on their land and they were not in favour of disturbing law and order.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:58:51.308Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909663/boy-kept-in-chains-by-his-father-freed-in-lakki-marwat",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T04:52:19.000Z"
}
