{
  "title": "Civil defence drills launched in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Punjab Chief Minister Maryam Nawaz has ordered launch of mock exercises of Civil Defense and Rescue 1122 in the province.\n\nThe mock drills have been started by fully activating the Civil Defense Department across the province. The CM directed the district administration to monitor the civil defense drills. Rescue 1122 has also started conducting mock exercises in different cities across Punjab.\n\nShe directed civil defense and Rescue 1122 to remain stand by and alert at all times in order to deal with any emergency situation. The civil defense will help and guide the citizens in emergency situation. Civil defense exercises have begun in Rawalpindi, Murree, Jhelum, Chakwal, Sargodha, Narowal, Gujranwala, Hafizabad, Sialkot. Mock exercises are underway in Sahiwal, Pakpattan, Multan, Khanewal, Muzaffargarh, Layyah, Vehari, Hafizabad and other cities.\n\nMaryam Nawaz condemned drone strikes in various places including Lahore. She paid tribute to the Pakistan Army for timely shooting down Indian drones. She appreciated timely response of the administration, police, rescue services and Pakistan Air Force.\n\nShe directed the police, administration and other institutions to remain alert round the clock in Lahore, Gujranwala, Chakwal, Rawalpindi, Attock, Bahawalpur and other cities.\n\nShe directed the relevant stakeholders to provide best medical treatment facilities to the civilians and officers getting injured during drone attacks in different cities of Punjab.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:58:26.918Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909618/civil-defence-drills-launched-in-punjab",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T01:58:01.000Z"
}
