{
  "title": "BCCI suspends IPL ‘with immediate effect for one week’ - Sport - DAWN.COM",
  "author": null,
  "content": "The Board of Control for Cricket in India (BCCI) has decided to suspend the remainder of the ongoing Indian Premier League (IPL) 2025 “with immediate effect for one week”, according to a statement on Friday.\n\nAn IPL match on Thursday was abandoned midway after fighting began in India’s border regions, but the cricket board attributed the disruption to a power failure at the stadium in the hill city of Dharamsala.\n\n“Further updates regarding the new schedule and venues of the tournament will be announced in due course after a comprehensive assessment of the situation in consultation with relevant authorities and stakeholders,” said the statement from BCCI Honorary Secretary Devajit Saikia, a copy of which is available with Dawn.com.\n\n“The decision was taken by the IPL Governing Council after due consultation with all key stakeholders following the representations from most of the franchisees, who conveyed the concern and sentiments of their players, and also the views of the broadcaster, sponsors and fans; while the BCCI reposes full faith in the strength and preparedness of our armed forces, the Board considered it prudent to act in the collective interest of all stakeholders.\n\n“At this critical juncture, the BCCI stands firmly with the nation. We express our solidarity with the Government of India, the Armed Forces and the people of our country,” the statement said.\n\n“While cricket remains a national passion, there is nothing greater than the nation and its sovereignty, integrity, and security of our country. The BCCI remains firmly committed to support all efforts that safeguard India and will always align its decisions in the best interest of the nation,” the statement added.\n\nEarlier today, the Press Trust of India reported that “a cloud of uncertainty had loomed over the future of the ongoing edition since the cancellation of Thursday’s match between Punjab Kings and Delhi Capitals in Dharamsala midway following air raid alerts in neighbouring cities of Jammu and Pathankot.”\n\n“It does not look nice that cricket goes on while the country is at war,” a BCCI official told PTI, confirming the suspension of the league, which was to wind up on May 25 in Kolkata.\n\nThe world’s richest cricket tournament began its current season on March 22, and the final fixture was scheduled to be played on May 25, with matches being spread over 13 venues across the country.\n\nAccording to ESPN Cricinfo, IPL 2025 was 58 games old, including the abandonment in Dharamsala. There were 12 games left to play in the group stage, scheduled for Lucknow (2), Hyderabad, Ahmedabad (3), Delhi, Chennai, Bengaluru (2), Mumbai, Jaipur, followed by the playoffs, to be played in Hyderabad and Kolkata.\n\nPakistan and India have been locked in conflict since Wednesday, when India targeted multiple locations in Pakistan, claiming they were “terrorist infrastructure” in response to a deadly attack in occupied Kashmir last month.\n\nNew Delhi named two Pakistani nationals as suspects and accused Islamabad of being involved in the attack, a charge Pakistan denied. Subsequently, Islamabad sought an independent probe.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:20:55.431Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909693/bcci-suspends-ipl-with-immediate-effect-for-one-week",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T07:32:34.000Z"
}
