{
  "title": "May 9 and military courts: What the SC decision means for civilians - Pakistan - DAWN.COM",
  "author": null,
  "content": "In a momentous ruling, the Supreme Court (SC) on Wednesday allowed civilians accused in the May 9, 2023 riots — triggered by the arrest of former Prime Minister Imran Khan — to be tried in military courts.\n\n“The legal fate of some 103 individuals facing military trials remained in limbo from December 2023 till Tuesday, a period of about a year and a half,” noted Dawn’s editorial today.\n\nThe 5-2 verdict by the Constitutional Bench overturns an earlier ruling that had declared military trials of civilians null and void, and restores key sections of the Pakistan Army Act (PAA) that allow military jurisdiction over certain civilian offences.\n\nThe bench not only overturned that decision but also restored three contentious provisions of the PAA that had previously been struck down. It also directed the government to introduce legislation within 45 days to ensure that civilians tried in military courts are granted the right to appeal their sentences in a high court.\n\nHowever, the decision was not unanimous — the two dissenting judges, Justices Jamal Khan Mandokhail and Naeem Akhtar Afghan — declared military court convictions “without jurisdiction” and unconstitutional. Rights groups and leaders of Pakistan Tehreek-i-Insaf (PTI) have likewise decried the ruling, citing concerns over due process.\n\nThe legal fraternity has weighed in too, warning that the judgment threatens the right to a fair trial and chips away at civilian justice system.\n\nLawyer Basil Nabi Malik criticised the SC’s verdict, calling it “as shambolic as it was hurried”. He added, however, that the ruling was unfortunately expected. “As many are saying out loud nowadays, the purpose of the 26th Amendment has been achieved. And with history as its witness, judges are being said to be doing the bidding of the ruling elite, once again,” he remarked.\n\nMalik added that the verdict shows “a total surrender of civilian rights”, with “fundamental rights becoming nothing more than irrelevant provisions in a Constitution that is being treated like a book of fiction by those ordained to protect it”.\n\nIn a similar vein, Barrister Rida Hosain said that by sanctioning the trial of civilians by military courts, “the court has surrendered our fundamental rights and displayed a complete lack of faith in the civilian justice system. The verdict is a huge setback for our justice system”.\n\n“In a remarkable finding, the court held that the right to a fair trial is ‘fully protected’ under the Army Act. Under military law, members of the executive act as judges, trials take place behind closed doors, and there is no reasoned judgment. Fundamental rights are at the discretion of executive authorities, who grant or deny them at their whim,” she noted.\n\nHosain further pointed out an apparent contradiction in the judgment’s reasoning: “The court has referred the matter to Parliament for ‘considering and making’ a law providing an independent right of appeal to the High Court. If the right to a fair trial is protected in military courts, why is an independent right to appeal required?” According to her, “this is a concession by the bench, that the law, as it currently stands, does not comply with fair trial standards”.\n\n“Civilian judges have revived a law first introduced by a military dictator, Ayub Khan, allowing the court martial of civilians. The order is rife with contradictions and undermines the principle of institutions acting within their constitutional domain,” she concluded.\n\nDrawing on the said concerns, lawyer Mirza Moiz Baig added that the ruling “spells the death of citizens’ right to a fair trial”.\n\n“While the announcement of the verdict coinciding with India launching an attack on Pakistan may have obviated any serious critique, the judgment gives short shrift to the ways in which military court trials offend against the right to due process and a fair trial,” he pointed out.\n\nLike Rida, he expressed concern over the erosion of public trust in the judiciary, noting: “With serious concerns already surrounding the constitutional benches formed after the 26th Amendment, the judgment further erodes public confidence in the SC’s ability to uphold citizens’ rights”.\n\nBaig, however, admitted that it would be remiss to not acknowledge the importance of Justice Mandokhel and Afghan’s dissents, adding, “Will the brooding spirit of the law heed their words though?”\n\nLawyer Abdul Moiz Jaferii described the SC’s ruling as “devoid of any reasoning other than the regurgitation of facts as narrated by the government”. He shed light on the absence of an independent forum of appeal against such convictions rendered by military courts. “The judgement is pinned upon the hope that an admitted fundamental legal defect … will hopefully be cured,” he says.\n\nJaferii went on to argue that the Constitutional Benches had fulfilled their mandate. “They have given back to the establishment the ability to play judge, jury and executioner with civilians they deem worthy of their attention,” he said. Referring to the delay in the court’s decision, he added, “These benches took six months after the 26th Amendment to put this order together. It was perhaps an effort to try and make us all forget this was their raison d’être (reason for being)”.\n\n“The recent short order reveals how deep the rot runs,” commented lawyer Ahmad Maudood Ausaf.\n\nHe noted that legal scholars across the board have long maintained that military courts clash with fundamental rights — particularly the right to a fair trial guaranteed under Article 10A of the Constitution. “That debate has been laid bare, and I will not revisit its anatomy here,” he remarked.\n\nInstead, he highlighted the court’s institutional inconsistency. “In a common law jurisdiction where precedent is seminal, what demands urgent attention is how, within just six months, the court has reversed its decision without any change in facts, law, or context,” he said. “Such institutional inconsistency doesn’t just confuse precedent — it erodes the trust essential for the apex court to exercise its writ”.\n\n“Some might even argue that the court has lost its writ, or a significant part of it, as a consequence of its past decisions and their execution. And if the honourable justices continue interpreting in the same fashion, one must ask: how relevant will the apex court remain?” he said, questioning the very authority of the court in the public eye.\n\nHe also cast doubt on the timing of the ruling, stating, “At a time when Pakistan confronts a palpable external threat from India, this judgment — so hollow in reasoning and so strategically timed — feels like a quiet calculation: perhaps, under the pressure of war drums, the public would look away”.\n\nAccording to lawyer Zainab Shahid, the SC’s short order is “a major setback for fundamental rights, constitutionalism and the separation of powers in Pakistan”. She argued the ruling is the result of a “two-year executive effort to dismantle judicial independence”, particularly through the 26th Amendment aimed at overturning the court’s earlier decision against military trials.\n\nShahid said the judgment “makes a mockery of Articles 8(5) and 10A of the Constitution,” which guarantee the right to a fair trial and prohibit suspension of fundamental rights except as clearly provided by the Constitution. “The Constitution envisions an exception for members of the armed forces — not civilians,” she stressed.\n\nCriticising the bench’s reliance on the government’s narrative of the May 9 events, she said the court “assumes the guilt of those involved” and aims to “make an example of PTI’s protestors” while sidestepping why ordinary courts aren’t fit to try civilians.\n\nShe also flagged a “bizarre contradiction” in the ruling: while claiming military courts uphold due process, the bench still asked the government to legislate an independent right to appeal. “This convoluted judicial maneuver is more likely to be a face-saving device… than a just outcome for civilians left at the mercy of court martials,” she said.\n\nMeanwhile, lawyer and activist Jibran Nasir said that despite repeated condemnation of judges such as former justices Muhammad Munir and Abdul Hameed Dogar in the past, “it appears that nothing has changed in the corridors of power”.\n\n“Our highest offices, whether executive or judicial, continue to be occupied by highly compromised individuals,” the lawyer said.\n\nHe said that recognising military trials of civilians as constitutional was akin to suspending the chapter on fundamental rights in the Constitution.\n\n“The Supreme Court taking refuge with the military and risking erosion of public trust may provide job security to the judges, but it has robbed the SC of its sanctity,” Nasir said, adding that the very institutions which were to “ensure order in society are sowing seeds for anarchy”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/09163019c453560.gif",
  "retrievedAt": "2025-08-23T08:20:50.227Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909718/may-9-and-military-courts-what-the-sc-decision-means-for-civilians",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T11:34:41.000Z"
}
