{
  "title": "Israelis close six UN schools in occupied east Jerusalem - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: The head of the UN agency for Palestinian refugees on Thursday decried an “assault on children” after Israel closed all six of its schools in annexed east Jerusalem, months after an Israeli ban on its activities took effect.\n\n“Storming schools & forcing them shut is a blatant disregard of international law”, UNRWA chief Philippe Lazzarini posted on X, describing the move as “an assault on children.\n\nUNRWA spokesman Jonathan Fowler said that Israeli forces “closed six United Nations schools in annexed east Jerusalem on Thursday, posting closure orders on the six buildings and forcibly entering three of the six schools”.\n\nAn eyewitness present at two of the schools in the Shuafat refugee camp reported that Israeli forces entered the premises and posted a closure notice stating the schools were operating without “authorisation”. The children had to leave the premises, with many departing in tears.\n\nSeveral young pupils, some visibly moved and others shocked, hugged in front of the school before they left. UNRWA said one of its staff members was detained.\n\nUN terms school closures ‘assault on children’\n\n“From May 8, 2025, it will be prohibited to operate educational institutions, or employ teachers, teaching staff or any other staff, and it will be forbidden to accommodate students or allow the entry of students into this institution,” the closure order in Hebrew read.\n\nUNRWA’s director in the West Bank, Roland Friedrich, said that “heavily armed” forces surrounded the three UNRWA schools in Shuafat camp at 9am.\n\nFriedrich added that 550 pupils aged six to 15 were present when the closure was enforced, calling it “a traumatising experience for young children who are at immediate risk of losing their access to education.”\n\nFriedrich said police were deployed in the area around three separate schools in other parts of east Jerusalem, which has been annexed by Israel since 1967. UNRWA said that the school year for 800 children had “been ended by force”.\n\n‘Violation of right to education’\n\nThe Palestinian Authority condemned the move in a statement, calling it a “violation of children’s right to education”. In a statement, its education ministry called the closures a “crime” and urged international institutions “to assume their responsibilities and defend the right of refugee children to a free and safe education”.\n\nUNRWA has provided support for Palestinian refugees around the Middle East for more than 70 years, but has long clashed with Israeli officials, who have repeatedly accused it of undermining the country’s security. At the end of January, Israeli legislation came into force banning the agency’s activities.\n\nDue to the annexation, the law applies to east Jerusalem but not to the rest of the West Bank, which has been occupied by Israel since 1967. Contact between it and Israeli officials is also forbidden.\n\nA series of investigations found some “neutrality-related issues” at UNRWA, but stressed Israel had not provided conclusive evidence for its headline allegation. Never­theless, the UN said in August that nine staff working for UNRWA would be sacked because they may have been involved in the attacks.\n\nAdalah, an Israeli group defending the rights of the Arab minority, reported that Israeli police were raiding six UNRWA-run schools in east Jerusalem.\n\nThe organisation filed a petition with Israel’s Supreme Court in mid-January arguing the new legislation against UNRWA violated “fundamental human rights and Israel’s obligations under international law”.\n\nThe Supreme Court rejected its request for the legislation to be suspended. In April, Adalah demanded a halt to the closure orders on UNRWA-run schools at the Supreme Court.\n\nThe state responded that the Jerusalem municipality was offering alternative schooling and the court rejected the NGO’s motion. Adalah called the proposed alternatives “wholly inadequate”. The United Nations considers the annexation of Jerusalem’s eastern sector illegal.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681d463183b1f.gif",
  "retrievedAt": "2025-08-23T08:21:07.090Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909551/israelis-close-six-un-schools-in-occupied-east-jerusalem",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T01:36:50.000Z"
}
