{
  "title": "Thalassemia a challenge for whole family, not just victim, says Murad - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sindh Chief Minister Syed Murad Ali Shah has emphasised the urgent need to raise awareness about the hereditary and life-threatening challenges of thalassemia.\n\n“Thalassemia is not just a challenge for the individual patient but for the entire family,” he said in his message on the occasion of World Thalassemia Day and urged the public to donate blood to help save the lives of thalassemia patients, stressing the importance of raising awareness to prevent the disease.\n\n“Protecting the younger generation from thalassemia is a top priority for the Sindh government,” he added.\n\nThe CM highlighted that modern medical facilities were being provided for the treatment of thalassemia throughout the province. According to the data from the Sindh Blood Transfusion Authority, 9,525 patients, the majority of whom are children, were registered across 26 centres in Sindh.\n\nMr Shah also mentioned that the Sindh government had established free diagnostic desks for thalassemia and hepatitis at two National Database and Registration Authority centres located in Korangi and Safoora. Additionally, efforts were underway to promote pre-marital screening to curb the spread of the disease, he added\n\nThe chief minister stressed that awareness campaigns are being conducted in educational institutions, media platforms, and community programmes. “More effective measures are needed to prevent thalassemia,” he said, suggesting that the introduction of a comprehensive screening programme could significantly reduce the prevalence of the disease.\n\nHe also underscored the essential roles of parents, teachers and religious leaders in addressing thalassemia and announced that public awareness campaigns would be further intensified across the province.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:21:06.304Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909531/thalassemia-a-challenge-for-whole-family-not-just-victim-says-murad",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T01:36:57.000Z"
}
