{
  "title": "Global militaries to study India-Pakistan fighter jet battle - World - DAWN.COM",
  "author": null,
  "content": "A dogfight between Chinese-made Pakistani jets and French-made Indian Rafale fighters will be closely scrutinised by militaries seeking insights that could offer an edge in future conflicts.\n\nA Chinese-made Pakistani fighter plane shot down at least two Indian military aircraft on Wednesday, two US officials told Reuters, marking a potential major milestone for Beijing’s advanced fighter jet.\n\nThe aerial clash is a rare opportunity for militaries to study the performance of pilots, fighter jets and air-to-air missiles in active combat, and use that knowledge to prepare their own air forces for battle.\n\nExperts said the live use of advanced weapons would be analysed across the world, including in China and the United States which are both preparing for a potential conflict over Taiwan or in the wider Indo-Pacific region.\n\nOne US official, speaking on condition of anonymity, told Reuters there was high confidence that Pakistan had used the Chinese-made J-10 aircraft to launch air-to-air missiles against Indian fighter jets.\n\nSocial media posts focused on the performance of China’s PL-15 air-to-air missile against the Meteor, a radar-guided air-to-air missile produced by European group MBDA. There has been no official confirmation these weapons were used.\n\n“Air warfare communities in China, the US, and a number of European countries will be extremely interested to try and get as much ground truth as they can on tactics, techniques, procedures, what kit was used, what worked and what didn’t,” said Douglas Barrie, senior fellow for military aerospace at the International Institute for Strategic Studies.\n\n“You have arguably China’s most capable weapon against the West’s most capable weapon, if indeed it was being carried; we don’t know that,” Barrie said. The French and Americans would likely be hoping for similar intelligence from India, Barrie said.\n\n“The PL-15 is a big problem. It is something that the US military pays a lot of attention to,” a defense industry executive said.\n\nRafale manufacturer Dassault Aviation declined comment and the MBDA consortium could not immediately be reached for comment on a French public holiday.\n\nWestern analysts and industry sources said crucial details remained unclear including whether the Meteor was carried and the type and amount of training the pilots had received. Arms firms would also be anxious to separate technical performance from operational factors, analysts said.\n\n“There will be audits of what works and what doesn’t work, but I think the other overlay is the proverbial fog of war,” said Byron Callan, a Washington-based defense expert and managing partner of Capital Alpha Partners.\n\nUS arms companies are getting constant feedback about how their products are working in the war in Ukraine, he said.\n\n“So I absolutely expect the same to be the case with India’s European suppliers, and Pakistan and China are probably sharing the same feedback. If the PL-15 is working as advertised or better than expected, the Chinese would like to hear that.”\n\nA defense industry source from a Western country operating the Meteor said an online picture of a seeker appeared to feature the component of a missile that had missed its target.\n\nThere are conflicting reports on whether Pakistan has the domestic version of the PL-15 from the PLAAF, China’s air force, or the lower-range export version publicly unveiled in 2021.\n\nBarrie, who has written extensively on the missile, said he believed that Pakistan most likely has the export version.\n\nA Western industry source dismissed claims that the rocket-powered PL-15 had longer range than the air-breathing Meteor but acknowledged that its capability “may be greater than was thought.” The Meteor’s range has not been officially published. “At the moment it’s not possible to judge anything. We know so little,” the industry source said.\n\nThe PL-15’s range and performance have been a focus of Western interest for years. Its emergence was seen as one of many signals that China had moved well beyond reliance on Soviet-era derivative technology.\n\nThe United States is developing the AIM-260 Joint Advanced Tactical Missile via Lockheed Martin partly in response to the PL-15 and its beyond-visual-range performance — part of a broader reset of Western priorities toward China.\n\nEuropean nations are exploring a mid-life upgrade for Meteor, which specialist publication Janes says could involve propulsion and guidance, but analysts say progress has been slow.\n\nUS President Donald Trump in March awarded Boeing the contract to build the US Air Force’s most sophisticated fighter jet yet, which would likely include stealth, advanced sensors and cutting-edge engines.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/09140807a811eff.jpg",
  "retrievedAt": "2025-08-23T08:20:53.825Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909714/global-militaries-to-study-india-pakistan-fighter-jet-battle",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T09:15:38.000Z"
}
