{
  "title": "Hundreds stranded as conflict disrupts Pakistan’s air traffic - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI / LAHORE: Flight disruptions left hundreds of passengers stranded at the country’s major airports, with many failing to reach their destinations due to last-minute cancellations.\n\nLahore, Islamabad, Karachi and Sialkot airports were the most affected, as air traffic was halted for several hours amid rising tensions between Pakistan and India. How­ever, flight operations at the four airports later resumed on Thursday after temporary suspensions.\n\nThe Pakistan Airports Authority (PAA) initially said that flight operations at Karachi’s Jinnah Inter­nat­ional Airport would remain suspen­ded until midnight, but they resu­med earlier than scheduled. Flight operations at Islamabad, Lah­ore and Sialkot airports resumed by evening.\n\nEarlier in the day, the PAA had temporarily suspended operations at Karachi, Lahore and Sialkot airports until Thursday noon, citing operational reasons. Islamabad International Airport also briefly suspended flights during the day.\n\nLater, the PAA extended the closure at Lahore, Islamabad and Sialkot until 6pm before confirming their reopening.\n\nPakistan International Airlines (PIA) confirmed that the country’s ongoing security situation severely disrupted air operations nationwide.\n\n“In the interest of air safety, some routes have been restricted as a precaution, affecting several flights,” a PIA spokesperson said. “The temporary closure of air routes has been undertaken to protect the assets of domestic carriers and ensure passenger safety.”\n\nThe airline urged passengers to remain patient and cooperate with airline staff, adding that its call centre was actively contacting affected travellers.\n\nFor passengers of diverted flights, PIA said it had made arrangements for meals and accommodation. Passengers were advised to check flight status via the PIA website or helpline before heading to the airport.\n\nPassengers stranded\n\nPassengers said that they faced immense difficulties due to last-minute cancellations. “I was scheduled to fly to Washington via Doha in the early hours of Thursday from Lahore airport, but the airline rescheduled the flight for later that morning.\n\nGhazala Bibi, another traveller, said her flight to Dubai from Sialkot was cancelled at the last minute due to the airport’s suddenclosure.\n\nPassengers arriving from abroad also faced immense difficulties due to diversions. Domestic air travellers encountered similar issues, with flight operations disrupted for a third consecutive day due to intermittent airport closures.\n\n“Domestic flights have been badly affected over the past three days,” an official said.\n\nThe Haj flight operation, which began recently, has also been almost suspended amid the escalating situation between the two countries.\n\nWhile a tour operator told Dawn that most international airlines had suspended flights to and from Pakistan until May 10, the PAA said it was continuously issuing revised notices to airmen or Notams to update the status of airport operations and the opening of airspace.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/090720319959e1b.gif",
  "retrievedAt": "2025-08-23T08:21:34.114Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909570/hundreds-stranded-as-conflict-disrupts-pakistans-air-traffic",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T01:36:14.000Z"
}
