{
  "title": "Lahore drug court directs urgent regulation of infant formula products - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: In a landmark judgment, the Drug Court Lahore has directed authorities to take urgent steps to regulate the manufacturing, sale, and quality of baby milk, baby food, infant formula, and related products.\n\nThe court highlighted serious gaps in the oversight of these products, which are widely consumed by infants and young children across Pakistan.\n\nThe case was initiated on a petition expressing concerns over substandard and unregistered baby food products allegedly causing serious health issues among infants.\n\nDrug Court Chairman Muhammad Naveed Rana noted that despite the presence of laws such as the Drugs Act 1940, Drugs Act 1976, and the Drug Regulatory Authority of Pakistan (DRAP) Act 2012, there is no clear mechanism for testing or regulating these products.\n\nThe chairman expressed regret that no Drug Testing Laboratory (DTL) in Pakistan is currently equipped to analyse the quality of baby milk and related products, leaving manufacturers largely unchecked.\n\nJudge regrets no lab in the country is equipped to analyse quality of baby milk\n\nHe observed that many baby food items contain over 40 ingredients — including vitamins and minerals — yet there is no system to verify whether manufacturers’ claims about their contents are accurate.\n\n“There is no clearly designated authority to monitor the sale of these products,” the judge noted.\n\n“It is alarming that, despite the presence of the aforementioned laws, not a single case has been filed against any company or individual for manufacturing or selling substandard or unregistered baby milk, baby food, infant formula, or related products.”\n\nSubstandard products, the judgment warned, have been linked to malnutrition, weakened immunity, developmental delays, digestive disorders, and contamination — all posing serious risks to infant health.\n\nThe judge pointed out that Drap has enlisted 291 baby food products under the Alternative Medicines and Health Products (Enlistment) Rules, 2014. However, no legal action has been taken against substandard products since Drap’s inception in 2012. Citing a medical report, the judge noted that poor-quality formula milk has been seriously harming infants’ health. He raised concern that thousands of newborns in Pakistan — often fed such products on doctors’ recommendations — are suffering due to unchecked quality standards.\n\nJudge Naveed Rana emphasised that under the 18th Amendment, provinces have the authority to legislate independently for the welfare of their populations, and must act accordingly.\n\nHe directed the Drap, the director general of Drugs Control Punjab, and the secretary of the Provincial Quality Control Board to draft legislation and establish testing and regulatory mechanisms for baby food products. The court gave the authorities three months to submit progress reports, with the next hearing scheduled for June 16.\n\nThe judgment underscored the urgency of safeguarding the health of infants — described as the future of the nation — and called on both federal and provincial health and law ministries to take immediate action.\n\nCopies of the order have also been sent to the federal health minister, federal law minister, Punjab chief minister, and other relevant officials.\n\nThe judgment was co-signed by technical members of the Drug Court, Dr. Tanvir Ahmad Usmani and Muhammad Irfan Munir.\n\nThe petition was filed by Mujahid Abbas, who argued that formula milk products must be enlisted and regulated under existing drug laws. He contended that substandard formula milk is causing various illnesses among infants and pointed out the absence of any laboratory in Pakistan capable of checking these products’ quality.\n\nThe petitioner also questioned the exorbitant prices being charged by companies for these essential products.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:21:05.194Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909619/lahore-drug-court-directs-urgent-regulation-of-infant-formula-products",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T01:58:01.000Z"
}
