{
  "title": "Flash floods damage roads, agricultural land in several districts in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Heavy rain trigged flash floods in Mohmand, South Waziristan and Upper Kohistan districts on Thursday, damaging roads and agricultural land.\n\nHowever, no casualty was reported from any districts of the province. Heavy rainfall triggered flash floods in several areas of Halimzai tehsil in Mohmand district including Shanikhel,Tarikhel, Barokhel, Durbakhel and Babikhel.\n\nThe flood, caused by overflowing mountain streams, swept away dozens of livestock and damaged houses and link roads.\n\nIn Ghaiba Khwar area, rainwater inundated homes and shops, posing a serious risk of structural collapse. Following public concerns about flooding caused by heavy rain at Ghaiba Chowk, Rescue 1122 was contacted and water rescue teams were deployed there.\n\nKandia tehsil of Upper Kohistan remains cut off from other areas\n\nThe main Peshawar-Bajaur road remained blocked for some time due to flood. Assistant Commissioner Usman Hamza said that the road was cleared with the help of locals. He added that Rescue 1122 dewatering pumps were sent to the area to remove standing water.\n\nFlash flood triggered by torrential rain wreaked havoc in Spin area of Wana tehsil in South Waziristan Lower, causing widespread damage to agricultural land and disrupting local infrastructure.\n\nAccording to locals, flood water washed away standing crops. The sudden onset of flood left people with little time to respond, resulting in significant agricultural losses.\n\nStrong winds accompanying the downpour also uprooted rooftop solar panels in several homes, affecting electricity supply in the area.\n\nAt some places, orchards and residential properties sustained partial damage. Water level rose sharply in seasonal streams and nullahs, prompting concerns of further flooding in adjacent low-lying areas.\n\nIn Upper Kohistan, Kandia tehsil was cut off from the rest of the district after floodwater inundated the only road in the area.\n\n“Residents of most parts of the tehsil are facing serious difficulties in travelling to other areas of the district and in transporting patients to health facilities. The Kandia stream has overflowed and submerged the main artery,” Kandia tehsil chairman Anwarul Haq told journalists on Thursday.\n\nHe said that water level in the stream swelled significantly, inundating a large section of the road and eroding adjacent land. “The main artery linking Kandia to the district has been submerged in Suluj, Kudgul and Thui areas,” he said.\n\nMr Haq said that the water level could rise further in the coming days, posing a growing threat to streamside settlements. Kandia is a calamity-prone area that has previously suffered human and financial losses due to flash floods and collapse of giant glaciers.\n\nMeanwhile, a meeting of the district administration was held to plan construction of an alternative road to mitigate flood damage and restore traffic flow in the tehsil.\n\nThe meeting was chaired by Deputy Commissioner Tariq Ali Khan and attended by Kandia tehsil chairman, the general manager of Dasu hydropower project and officials of communication and works department and other agencies.\n\nThe deputy commissioner directed the general manager of Dasu hydropower project and officials of communication and works department to immediately survey the flood-affected areas in Kandia.\n\n“The newly-built road has been inundated, affecting the lives of locals. Wapda must ensure swift construction of an alternative route to prevent further damage,” he said.\n\nThe general manager of Dasu hydropower project assured the deputy commissioner that the submerged section would be rebuilt as soon as the damage assessment was completed.\n\nMeteorological department said that the provincial capital received 10mm rain when the downpour lashed the city in the evening. The rain also resulted in power outage in several parts of the city. However, no causalities due to rain were reported in part of the city.\n\nPublished in Dawn, May 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681d8acabf900.jpg",
  "retrievedAt": "2025-10-12T02:58:49.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909665/flash-floods-damage-roads-agricultural-land-in-several-districts-in-kp",
  "dateList": "2025-05-09",
  "date_published": "2025-05-09T04:54:29.000Z"
}
