{
  "title": "NA speaker welcomes Qatari govt’s special initiative to educate one million Pakistani children",
  "link": "https://www.app.com.pk/national/na-speaker-welcomes-qatari-govts-special-initiative-to-educate-one-million-pakistani-children/",
  "date_published": "2022-04-26T15:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): National Assembly Speaker, Raja Pervaiz Ashraf, on Tuesday welcomed the initiative of Qatari government to support Pakistan for educating one million children.\nThe speaker, in a meeting with Ambassador of State of Qatar Sheikh Saoud Bin Abdulraham Al-Thani, who called him in the Parliament House, said Pakistan and Qatar were intertwined in shared traditions and values.\nSeeking enhanced cooperation in business and trade by Qatari businessmen and traders, the speaker held that Pakistan was a land of vast opportunities.\nRaja Pervaiz, who is also the former Prime Minister also extended strong commitment to enhance parliamentary cooperation between both the countries.\nWelcoming Qatari ambassador’s remarks regarding enhancing cooperation with new government, he[ Raja Pervez Ashraf] said Pakistan and Qatar would continue to work for regional prosperity and development.\nSheikh Saoud Bin Abdulraham, highlighting long standing affiliation with Pakistan, said he considered himself as Pakistani.\nHe said the government of Qatar was going to educate 2.3 million children in the region out of which one million children would be from Pakistan and 1.3 million would be Afghani refugees settled in Pakistan.\nSheikh Saoud Bin Abdulraham said the Qatari government was offering five-year work visa to 5,000 Pakistani personnel for security duties.He also apprised the Qatari government was donating 10 aircraft to Pakistan’s Navy and three shipment of medication for needy in Pakistan.\nBesides, the ambassador expressed well wishes to Raja Pervaiz Ashraf on the behalf of the chairman of Qatar Majlis Al-Shora on being elected as the NA speaker.",
  "retrievedAt": "2025-08-11T14:46:00.097Z"
}
