{
  "title": "Rana Tanveer takes notice of Pak students issues studying in China",
  "link": "https://www.app.com.pk/national/rana-tanveer-takes-notice-of-pak-students-issues-studying-in-china/",
  "date_published": "2022-04-26T18:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Federal Minister for Education and Professional Training Rana Tanveer Hussain, while taking notice of the matter, met the Pakistani students delegation.\nThe students had returned from China in the middle of their studies after the Covid-19 outbreak some two years ago and since then they were unable to rejoin their educational institutes in China due to certain issues.\nIn a meeting, representatives of Ministry of Foreign Affairs (MoFA), Higher Education Commission (HEC), Aviation Division and senior officers of the ministry were in attendance.\nRepresentatives from MoFA informed that in the 1st phase, China had given a list of 251 students to Pakistan, out of which 60 percent students had been successfully reached out.\nThe minister directed HEC to use all resources in reaching out to students who were not being contacted before and also to set up an effective coordination mechanism among all stakeholders for getting necessary details.\nWhile considering the financial constraints of the students, Rana Tanveer directed the authorities of education ministry for working out a mechanism, whereby, the government will assist the students by sharing the related costs involved.\nHe also directed Pakistan’s Education Attaché to Beijing for playing a central coordinating role and to rigorously follow-up with Chinese authorities in the best interest of Pakistani students.\nIt is pertinent to mention that due to zero Covid-19 tolerance policy of China’s government, the air space for regular flights, and option of road travel are restricted.\nThe minister reiterated that education was the highest priority of the present government and assured the students of resolving their problems on war footing basis and that they will be assisted in every possible way.",
  "retrievedAt": "2025-08-11T14:45:58.577Z"
}
