{
  "title": "SDPI, Denmark’s Embassy collaborate to spearhead Carbon Market",
  "link": "https://www.app.com.pk/national/sdpi-denmarks-embassy-collaborate-to-spearhead-carbon-market/",
  "date_published": "2023-09-16T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): The Sustainable Development Policy Institute (SDPI), in collaboration with the Embassy of Denmark in Pakistan, has jointly organized a project inception workshop “Unlocking pathways to support implementation of carbon markets in Pakistan”.\nThe project aims to conduct a need assessment for knowledge and capacity gaps for the implementation framework of carbon markets in Pakistan, assess potential regulatory and information barriers, identify potential opportunities and challenges in the implementation of carbon markets across different sectors in Pakistan, and identify potential investment opportunities created by carbon markets in Pakistan, with a particular emphasis on building public-private partnerships (PPPs), a news release said.\nUnder this project, the two organizations aim to provide an actionable work plan to effectively implement carbon markets in Pakistan, learning from the best practices of Denmark for SDG 13 (climate action) and SDG 17 (partnerships for goals).\nSpeaking at the inception workshop, Dr. Abid Qaiyum Suleri, Executive Director, SDPI, said that unleashing the potential of carbon credits and financing offers benefits in harnessing the challenge of climate change and greenhouse gas emissions and can also address the foreign exchange deficit crisis for Pakistan. This requires identifying a focal point among ministries and building their capacity to anchor projects in carbon markets.\nWith the collaboration of the Embassy of Denmark, SDPI aims to bridge the gap between the knowledge pool and policymakers to create a conducive environment where Pakistan can unleash and avail itself of the low-hanging fruits of global carbon markets, he remarked.\nDr. Khalid Waleed, Research Fellow and Lead Researcher, Energy Unit, SDPI, stressed the importance of integrating sustainable energy and environment in macro-economic policies, developing industries for environmental sustainability initiatives like carbon markets, permaculture, and circular economy markets to attract foreign direct investments, and interlinking inter-industry regional and international carbon trading.\nThis will enable the prevention of environmental degradation and increase income levels for sustainable economic growth in Pakistan in parallel. He urged increasing taxation on carbon-intensive goods and industries and offering carbon market credits and offsets to increase carbon compliance.\nHighlighting the potential of carbon markets, he said that low-carbon energy solutions alone can generate US$10 billion annually. He further said that firewood is emission-intensive, and with natural gas resources depleting in Pakistan, carbon markets can provide alternative green fuels.\nSyeda Hadika Jamshaid, Carbon Market Advisor, Ministry of Climate Change and Environmental Coordination, informed that the Ministry has signed an MoU with Verra to develop the voluntary carbon market (VCM), develop the capacity of the private sector, and align the MOCC as convener for VCMs.\nShe further elucidated that MoCC is also developing a guiding policy document to create a conducive environment, capacity, and awareness for carbon trading in the country. She stressed that attracting international investors is hinged on policy clarity and consistency and urged working on projects that can generate co-benefits rather than conventional projects.\nSyed Aqeel Hussain Jafri, Director (Policy), Private Power & Infrastructure Board, believes renewable energy can play an integral role in carbon markets, with the private sector eager to mobilize and operationalize carbon market structures in the country. Carbon markets will not only aid in achieving nationally determined contributions (NDCs) but will also pivot finances for low-carbon technologies, he said.\nAshok K. Chandhel, Senior Program Officer, Auditor, and Accreditation Body Engagement at Verra, elucidating the initiatives being jointly steered by MoCC and Verra, informed that Verra will assist in developing the capacity of Ministry officials, operating the registry for carbon markets, verification, and methodology for carbon market projects.\nDr. Omar Mukhtar Khan, Team Leader, Sustainable Energy and Economic Development (SEED), stressed capitalizing on forests and renewable energy projects to strengthen climate action and promote economic growth through carbon credits.\nVardah Malik, CEO of Profectus Advisory Services, stressed the importance of diversifying the carbon projects to include electric vehicles, carbon capture and storage, wind, solar energy, hydrogen fuels, plastic credits, etc. and highlighted that Pakistan is much behind other countries, thus losing a competitive edge. She stressed that Danish experience could help Pakistan engage large private corporations, especially in hard-to-abate sectors.\nLydia Omuko-Jung, Senior Legal Consultant, Climate Focus, highlighted that the issue of lack of public sector capacity for developing carbon markets is a common issue faced by many countries. The key lies in understanding that the public sector must create incentives for the private sector rather than focus solely on developing regulatory frameworks.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:40:21.514Z"
}
