{
  "title": "US Assistant Secretary’s visit highlights 75th anniversary of bilateral ties",
  "link": "https://www.app.com.pk/national/us-assistant-secretarys-visit-highlights-75th-anniversary-of-bilateral-ties/",
  "date_published": "2022-07-02T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 2 (APP): US Assistant Secretary of State for International Narcotics and Law Enforcement Affairs (INL) Todd D. Robinson has visited Islamabad from June 29 – July 2 to discuss the US-Pakistani partnership, highlighting the 75th anniversary of bilateral relations.\nDuring his visit, assistant secretary Robinson met with senior government officials to discuss US-Pak cooperation on several topics, including counternarcotics, gender issues, transnational crime, and border security.\nThe assistant secretary Robinson also took part in celebrating the 75 years of US-Pakistani relations and INL’s 40-year partnership with Pakistan under the theme “justice, security, and prosperity.”\nOn June 30, the assistant secretary participated in the groundbreaking of the Anti-Narcotics Force Academy (ANF) construction and training project, valued at $2.2 million (451.7 million PKR), hosted by implementing partner United Nations Development Program (UNDP).  Ministry of Narcotics Control Minister Shahzain Bugti and ANF Director General Ghulam Shabbir Narejo also attended.\nThe assistant secretary also attended a ceremony to celebrate the delivery of $1.44 million (295.7 million PKR) of commodities to the excise, taxation and narcotics control of Khyber Pakhtunkhwa, a KPK provincial agency that has a drug interdiction mandate.\nOn July 1, the assistant secretary joined Inspector General of Frontier Corps Khyber Pakhtunkhwa North Major General Adil Yamin, Inspector General of Frontier Corps Khyber Pakhtunkhwa South Major General Muhammad Munir Afsar, and senior Frontier Corps leadership for an inauguration and agreement signing ceremony for two joint projects worth approximately $10.5 million (2.1 billion PKR).\nThe inauguration celebrated completion of 45 new structures at FC KP North’s Warsak Training Center, including accommodation barracks for 500 men and 128 women, classrooms, and facilities for physical training.\nThe officials also signed an agreement for the construction of women’s facilities at eight existing FC KP South regional headquarters.\nThe US government-funded project will provide barracks, dining halls, kitchens, and other facilities that will support stationing of up to 128 women Frontier Corps members at each location.",
  "retrievedAt": "2025-08-11T15:11:18.424Z"
}
