{
  "title": "Govt. to ensure legislation for national interest, pubic welfare in joint session",
  "link": "https://www.app.com.pk/national/govt-to-ensure-legislation-for-national-interest-pubic-welfare-in-joint-session/",
  "date_published": "2021-11-11T10:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): Adviser to Prime Minister on Parliamentary Affairs Dr. Babar Awan on Thursday said the government is committed to ensure legislation for national interest and welfare of the people in joint session of parliament which has been postponed for few days.\nThe Adviser in a presser said the incumbent federal government has reforms agenda for the welfare of people and it is ready to engage the opposition for negotiations on legislative proposals to be tabled in joint session of Parliament. He said the government would make all possible efforts to develop consensus with the opposition on pro-public agenda and voting in Parliament would decide in case of any difference on it.\nHe said that joint session has been postponed for time being and the opposition would be engaged to assist in legislation for national interests. He said that Speaker’s office and Ministry of Parliamentary Affairs were contacted for joint session and it was agreed to talk with opposition on legislation related to electoral reforms and welfare of public.\nDr. Babar Awan said that a joint parliamentary committee has been already constituted to consider the electoral reforms bill including the Elections (Amendment) Bill, 2021 and the Elections (Second Amendment) Bill, 2021. He elaborated the purpose of the bills and said the government only wants to conduct fair and transparent Elections in the country\nHe said that the government is serious about electoral reforms as it is keen to provide opportunity to overseas Pakistanis to participate in the polls. The government, he said, wanted to bring electoral reforms for the country and not for Pakistan Tehreek-e-Insaf (PTI).\nIt is not for the first time that joint session has been summoned, he said adding that it was earlier summoned for legislation related to FATF as the several meetings were held with the opposition but it did not support the government for the purpose.\nAdviser to Prime Minister Dr. Babar Awan said that multiple bills have been referred to the joint session of parliament. These legislative proposals are of national importance and for protection of women, children rights, peasants’ and public welfare, he added.\nHe said that bills to be considered in the joint session mainly included the International Court of Justice (Review and Re-consideration) Bill, 2021; the Hyderabad Institute for Technical and Management Sciences Bill, 2021; the Islamabad Rent Restriction (Amendment) Bill, 2020; the Financial Institutions (Secured Trnasactions) (Amendment) Bill,\n2021; the Anti-Rape (Investigation and Trial) Bill, 2021; the Muslim Family Laws (Amendment) Bill (Section 4), 2021; the Muslim Family Laws (Amendment) Bill (Section 7), 2021; the Criminal Laws (Amendment) Bill, 2021; the Loans for Agricultural, Commercial and Industrial Purposes (Amendment) Bill, 2021; the COVID-19 (Prevention of Hoarding) Bill, 2021 and the Islamabad Capital Territory Charities Registration, Regulation and Facilitation Bill, 2021.\nHe said the opposition wants to maintain status quo and not supporting the PTI government to fulfill the tasks related to public welfare.\nDr. Babar Awan said that millions of rupees incur on the sitting of Parliament and we should do utmost effort to reduce sufferings of people and resolve their problems. He said that Prime Minister believes in supremacy of law and he appeared in apex court last day.\nOur agenda is non-political and for the people of Pakistan, he said adding that PTI government is ready sit with the opposition for pro-public legislation.",
  "retrievedAt": "2025-08-11T21:35:23.005Z"
}
