{
  "title": "Govt extends Sehat Sahulat Program services to more deserving people: Dr. Faisal",
  "link": "https://www.app.com.pk/national/govt-extends-sehat-sahulat-program-services-to-more-deserving-people-dr-faisal/",
  "date_published": "2021-11-11T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): Special Assistant to Prime Minister on National Health Services, Regulation, and Coordination, Dr. Faisal Sultan on Thursday said that the federal ‘Sehat Sahulat Program’ has been expanded to the entire population of the federal capital, Punjab and Gilgit-Baltistan.\nAddressing a ‘Sehat Sahulat Program’ ceremony, Dr. Faisal said that now under Sehat Sahulat Program and Quami Sehat cards, the government will issue health cards to all citizens of the federal capital and all districts of Punjab and GB.\nHe said that the objective to extend the program was to serve the deserving people with the mission of a prosperous and healthy nation along with achieving the goal of Universal Health Coverage for indoor services.\nHe said that the Ministry of National Health Services, Regulations, and coordination along with the Government of Punjab had started the process for the procurement of insurance companies for the year 2022-2025 to implement Sehat Sahulat Program as per the directives of Prime Minister Imran Khan.\nHe said that the procurement process for Phase-III of the program had been concluded today by the “Financial Opening of Proposals’’ in presence of the evaluation committee, media representatives and other dignitaries.\nDr. Faisal Sultan said that today is the financial opening day and after this contract will be awarded to the selected insurance company for the next three years to carry out this huge task of Universal Health Insurance in Pakistan.He said that from December 31st, 2021, Sehat Sahulat Program and Quami Sehat Card will be gradually expanded to all the permanent residents of ICT, Punjab and Gilgit Baltistan.\nHe added the program had already covered all the permanent residents of newly merged districts of Khyber Pakhtunkhwa, District Tharparker of Sindh, entire Azad Jammu and Kashmir along with persons with permanent disability and the transgender community.\nHe said that this program is 100% funded by the Government of Pakistan and participating provincial governments.He also hoped that Governments of Balochistan and Sindh will also join Universal Health Insurance in near future to materialize our dream of National Universal Health Insurance by providing Quami Sehat Card to each and every citizen of Pakistan to protect them against catastrophic healthcare expenditure of million of rupees for serious issues like cardiac surgeries, cancer treatment and renal failure, etc.\nAdditional Secretary Ministry of National Health Services, Nabeel Awan said that through this social health protection initiative, all permanent residents of relevant areas will be provided with free-of-cost health insurance to secure indoor health care services from empaneled hospitals through a very transparent and computerized mechanism.\nCEO, federal ‘Sehat Sahulat Program’, Muhammad Arshad said that the services which are being provided by ‘Quami Sehat Card’ included open-heart surgeries, insertion of stents, management of cancer, neurosurgical procedures, burn management, accident management, dialysis, intensive care management, deliveries, C section and other medical and surgical procedures up to the limit of Rs one million per family per year.\nHe said that there is a facility of Inter-Provincial and Inter-District portability for availing free of cost services from any empaneled hospital in Pakistan.\nDr. Faisal said that the ‘Sehat Sahulat Program’, is the flagship program of the present government in Pakistan as per the vision and directives of Prime Minister Imran Khan, through which support and assistance were being provided against catastrophic healthcare expenditure.\nHe said that this scheme will bring robust improvement in treatment and access to quality health care services to the population and will bring revolution in the health sector of Pakistan.",
  "retrievedAt": "2025-08-11T21:35:23.008Z"
}
