{
  "title": "Troika Plus meeting showcases Pak-China commitment to regional peace",
  "link": "https://www.app.com.pk/national/troika-plus-meeting-showcases-pak-china-commitment-to-regional-peace/",
  "date_published": "2021-11-11T14:15:00.000Z",
  "source": "APP",
  "content": "BEIJING, Nov 11 (APP): China fully supports Pakistan in all its efforts for conducive political stability and social reconstruction in Afghanistan and consensus building in the world.\nPakistan is an important force in creating and maintaining regional peace. Over the years, Pakistan has played the most important role for advancing peace and reconciliation in Afghanistan and is still playing an irreplaceable role.\nThese views were expressed by Cheng Xizhong, Visiting Professor at Southwest University of Political Science and Law and senior Fellow of the Charhar Institute in a statement issued on Thursday.\nHe said that Pakistan is hosting the extended Troika meeting. The special representatives and envoys for Afghanistan from China, Russian Federation, the United States and Pakistan are participating in the Troika Plus meeting.\nThis is the first full-fledged Troika Plus meeting after Taliban’s takeover of Afghanistan.\nHowever, while the international community, especially China, Russian Federation and Pakistan, are committed to peace and stability in Afghanistan, India is now acting on the stage and held an “important international meeting” on November 10 to hold security dialogue on Afghanistan, he added.\nCheng Xizhong remarked that India is a destroyer of Afghanistan, not a “peacemaker”, and is not qualified to host such a meeting on Afghanistan.\nPakistan therefore refused to participate. The Chinese side said that we were busy and had no time to participate.\nOver the past 20 years, India has maintained close relations with the puppet regime in Kabul through economic assistance and political support.\nAfter the Taliban came to power, India’s influence in Afghanistan has been increasingly marginalized.\nBy hosting the Afghanistan meeting, India wants to show its sense of presence on the Afghan issue under the current situation, expand its voice by increasing contacts with regional stakeholders such as the Central Asian countries, Iran and Russia, strive to reverse the passive diplomatic situation since the Taliban came to power, and avoid further damage to its strategic interests in the region, but it is certain that India’s efforts will be futile.",
  "retrievedAt": "2025-08-11T21:35:20.542Z"
}
