{
  "title": "Stray dogs in aviation area perturb PAA - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Pakistan Airports Auth­ority (PAA) Dire­ctor General Air Vice Marshal Zeeshan Saeed convened a meeting to address the matter of stray dogs spotted in the general aviation area.\n\nAccording to a press release issued by PAA on Sunday, the meeting was attended by the deputy director general of airports, Sadiqur Rehman, directors of APS, HR, and SQMS representatives, as well as other key officials. The acting airport manager and manager of airside were also present.\n\nThe meeting, held at the PAA headquarters, took up the of stray dogs spotted in the general aviation area.\n\nThe participants were briefed by the airside manager about the wildlife and vegetation control measures implemented by the authorities.\n\nAccording to a statement issued by the PAA, the meeting was informed that the airside is fully fenced and under 24/7 surveillance by specialised bird and wildlife control teams.\n\nThe meeting was told that comprehensive safety inspections are carried out before every landing and takeoff of planes to ensure the highest standards of operational safety.\n\nThere have been no formal reports of stray dogs or wildlife presence on the airside.\n\nThe director general instructed officials concerned to explore the use of advanced technology to further enhance airside safety and security.\n\nThe DG also visited the general aviation area, adjacent to but separate from the main airport premises. Due to its semi-open location, the area is vulnerable to stray animal intrusions.\n\nPublished in Dawn, January 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:29:33.392Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883408/stray-dogs-in-aviation-area-perturb-paa",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T00:46:45.000Z"
}
