{
  "title": "Poll petitions’ delay - Newspaper - DAWN.COM",
  "author": null,
  "content": "THOUGH electoral transparency and justice are essential for the health of any democracy, the relevant quarters in Pakistan seemingly remain unconvinced of the need to address poll disputes with alacrity. While nearly a year has passed since 2024’s controversial general elections, only 27pc of poll petitions have been decided by election tribunals. Though the process may have picked up pace, the speed at which it is proceeding is still unacceptably slow. By law, petitions have to be decided within 180 days of their filing.\n\nThe figures, released by electoral watchdog Fafen, point to the fact that tribunals in Punjab, Sindh and KP are moving particularly slow, while those in Balochistan have performed relatively better. It should be pointed out that due to a legal dispute between the ECP and LHC, eight election tribunals were only notified in Punjab last October. Initially, only two tribunals had been notified in Pakistan’s most populous province, even though most of the petitions had been filed in Punjab. Of the petitions that have been decided so far, most have been dismissed by the tribunals.\n\nThe road to a functioning and dynamic democracy will remain a long and winding one unless key lacunae affecting Pakistan’s electoral process — such as post-election disputes — are resolved with speed and fairness. A cloud continues to hang over last year’s polls, and when tribunals take an inordinate amount of time to decide disputes, popular doubts about the whole process are only solidified.\n\nFrom the controversy of issuance of Forms 45 to the slothful resolution of poll disputes, it seems that the stakeholders are not concerned about the need to present Pakistan’s electoral process as free, fair and transparent. This attitude needs to change for the betterment of Pakistani democracy. While the tribunals need to pick up the pace, political parties must highlight the need to reform the electoral process, so that elections in this country are free from controversy.\n\nPublished in Dawn, January 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:29:12.329Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883402/poll-petitions-delay",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T00:50:57.000Z"
}
