{
  "title": "Cabinet body defers plan to allot 14,008 acres of state land for corporate farming in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government has postponed for a month the decision on allotment of 14,008 acres of state land to an army-backed company for corporate agriculture farming.\n\nWhile the Karachi Bar Association (KBA) had adopted a resolution to condemn what it called the provincial government’s decision to lease out 14,008 acres of state land to an army-backed company for agriculture farming, informed sources told Dawn that no such decision has so far been taken.\n\nInstead, they said, a meeting of the sub-committee of the Sindh cabinet, which met earlier this week with Home Minister Zia Lanjar in the chair, had actually put off the matter for a month and decided that local public representatives and stakeholders should first hold a meeting to ascertain the availability of the state land in district Umerkot.\n\nThe sources said that the meeting discussed at length the issue of lease of 14,008 acres in dehs Horingo and Chhor in Umerkot district in favour of Green Corporate Initiative (Pvt) Ltd, a company under the umbrella of the Pakistan army for the corporate agriculture farming initiative for cultivating available barren land in all the provinces of the country.\n\nHome Minister Lanjar says land would be rented out for 30 years after ascertaining project’s viability\n\nThe meeting was of the view that a lot of homework was yet to be done before taking final decision to allot land for corporate agriculture farming, the sources added.\n\nThey said the local administration of Umerkot had been instructed to identify the land and check if some portions were in legal possession of local residents.\n\nThey said the administration had also been asked to check how much grazing area was included in the land to be allotted for corporate farming.\n\nThe sources said the meeting also obse­rved that no advertisement regarding the proposed land was given in newspapers.\n\nTalking to Dawn, Home Minister Lanjar, who also holds the portfolios of law and parliamentary affairs, said the land would not be leased out to the company, rather it would be rented out for 30 years for corporate agriculture farming after ascertaining whether the project was viable and would not affect the rights of local people.\n\nThe land would be handed over after a proper survey, demarcation and verification that such land was not located in prohibited areas and not under any pending litigations or court orders, he said.\n\nAlso on Saturday, Sindh Chief Minister Murad Ali Shah told reporters that “barren land” would be utilised for the Green Corporate Initiative, which aims to launch corporate farming.\n\nLast year, the caretaker Sindh government had formally entered into an agreement with the army-backed company to give it over 52,000 acres of land in six districts for corporate farming.\n\nA government-to-government (G2G) Joint Venture Agreement was signed at the Chief Minister House between the Sindh government and M/s Green Corporate Initiative (Private) Limited.\n\nThe local administration in the province had identified approximately 52,713 acres of “barren” land — 28,000 acres in Khairpur, 10,000 acres in Tharparkar, 9,305 acres in Dadu, 1,000 acres in Thatta, 3,408 acres in Sujawal and 1,000 acres in Badin — to be handed over to the company to execute its ‘Green Pakistan Initiative’.\n\nHowever, nationalist parties and civil rights campaigner have been voicing concern against the project since the launch of the initiative.\n\nOn Friday, the KBA released a statement signed by newly-elected President Amir Nawaz Warraich and General Secretary Ghulam Rehman Korai, terming the provincial government’s decision as a “dangerous precedent”.\n\nIt said that the move undermined the rights of local farmers and small-scale agriculturalists who depended on such lands for their livelihood.\n\nThe KBA demanded to review and reverse the lease decision, emphasising that the state land should be allocated primarily for the benefit of the local communities.\n\nPublished in Dawn, January 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:44:31.673Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883359/cabinet-body-defers-plan-to-allot-14008-acres-of-state-land-for-corporate-farming-in-sindh",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T00:47:08.000Z"
}
