{
  "title": "PPP takes offence to another PML-N move - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Marri slams establishment of maritime authority without PPP input, demands CCI meeting\n• Minister claims to have met Sindh CM, other PPP leaders to take them on board\n\nISLAMABAD: Already at odds with the PML-N on how to run the country, the PPP on Sunday took exception to the establishment of the Pakistan Maritime and Seaport Authority by the federal government as it reminded the Shehbaz-led government of its crucial support in sustaining the government.\n\nThe differences between the two parties have been simmering for a while and a recent meeting between Prime Minister Shehbaz Sharif and President Asif Ali Zardari to revive trust seemingly failed to put an end to these disagreements.\n\nA statement by PPP leader Shazia Marri on Sunday put the spotlight back on these disagreements as the PPP leader criticised the PML-N-led government for failing to consult the PPP on key decisions, including the establishment of the Pakistan Maritime and Seaport Authority. She said that “the government’s survival hinges on PPP’s support”.\n\n“While we have said it again and again that the federal government has PPP’s support, the day we withdraw that support, the federal government will collapse,” she warned, adding, “Perhaps, the PML-N does not realise this.”\n\n“Both the Sindh government and the Pakistan People’s Party were kept in the dark regarding the decision to establish the authority,” she claimed.\n\nMs Marri said her party had also been demanding a meeting of the Council of Common Interests (CCI), which had not been convened for the past eleven months. “The Constitution is being constantly and openly violated,” she said, adding that the prime minister was “constitutionally bound to convene a meeting of the Council of Common Interests within three months”.\n\n“The opinion and matter of the establishment of the Maritime and Seaport Authority should be brought to the Council of Common Interests,” she said rhetorically asking if it was “wise to sabotage the Constitution on important national issues, without taking allies and provinces into confidence”.\n\nThe PPP spokesperson called the Centre’s appro­ach “beyond understandable” and one that would only widen the gap bet­ween the two allies. “The opinion of allies and provinces should be taken bef­ore the recommendations of the task force on the maritime sector, maritime affairs, and KPT proposals,” she added, highlighting that it would be “better for everyone” if the country was run on constitutional and legal principles.\n\nHowever, the maritime affairs minister, Qaisar Ahmed Sheikh, said the PPP leadership, including Sindh Chief Minister Syed Murad Ali Shah, was taken on board regarding the PMSA formation.\n\n“I have already talked with Murad Ali Shah on the matter and two PPP leaders Mehreen Bhutto and Asad Niazi spent a whole day with me on Saturday, and we discussed the issue,” the minister said.\n\n“I live in Karachi and will keep PPP leadership and the Sindh government updated on the issue,” he said, adding that a task force has been formed for the PMSA that included all stakeholders.\n\nTensions between the federal government and its ally PPP have deepened, with senior party officials expressing a “lack of confidence” in the federal government.\n\nIssues such as internet restrictions, criticised by PPP Chairman Bilawal Bhutto-Zardari as an atte­mpt at censorship, have further strained the ties.\n\nSimilarly, protests by PPP lawmakers in parliament, including a walkout over federal ministers’ absence, reflect the growing discord, though the PPP chief has urged continued engagement with the PML-N government.\n\nDespite differences between the two parties, observers believe that the presence of a common adversary — Imran Khan — will compel them to collaborate to maintain the present setup, with the backing of the establishment, which is playing a crucial role in holding this unlikely alliance together.\n\nPublished in Dawn, January 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:29:47.395Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883370/ppp-takes-offence-to-another-pml-n-move",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T00:46:31.000Z"
}
