{
  "title": "PM orders inquiry into Lesco reinstatement, overbilling, alleged graft - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Prime Minister Shehbaz Sharif has ordered a thorough investigation into the reinstatement of 12 officers of the Lahore Electric Supply Company (Lesco), allegations of overbilling, Federal Investigation Agency (FIA) involvement in unlawful practices and other related matters concerning Lesco operations in recent months.\n\nThe premier has directed the submission of the inquiry report within the next 10 days, Dawn has learned.\n\n“The prime minister has been pleased to constitute a committee comprising Shahid Khan (former federal secretary), the Power Division’s federal secretary, a representative of Lesco’s Board of Directors (Human Resource Committee), and a representative of the Intelligence Bureau to investigate the reinstatement of officers in Lesco with a history of corruption, assessing the process and rationale behind their reinstatement,” reads an official order issued by the Prime Minister’s Office.\n\nThe notification outlines several tasks for the committee, including:\n\nInvestigating Lesco’s involvement in unauthorised electrification in the Khayaban-i-Ameen housing scheme, focusing on illegal installations; reviewing the procurement process for illegal Hitachi circuit breakers and any related contractual and procedural irregularities; analysing the financial implications and procedural violations linked to June 2024’s overbilling incidents; examining the role of FIA officers in concealing and mishandling Lesco-related cases, with an emphasis on accountability and investigative integrity; verifying corruption allegations against the incumbent Lesco CEO, and assessing the legal validity and compliance with rules in the appointment of Chaudhry Muhammad Amin, the former Lesco CEO.\n\n“The committee may co-opt any person as required and is instructed to submit its report/recommendations within 10 days for the Prime Minister’s perusal and consideration,” the notification states.\n\nSpeaking to Dawn, an official source, specifically regarding the reinstatement of the officers, claimed that these executive engineers and superintending engineers (previously designated as officers on special duty) were posted after the prior Lesco board allowed their reinstatement, as the allegations against them could not be substantiated.\n\n“It was a general inquiry involving all power distribution companies, conducted in light of an IB report. Most officers, including those at Lesco, resumed their duties after the allegations proved unfounded. Consequently, our previous board instructed us to post them after securing approval from the HR committee, which we did,” the official explained.\n\nSubsequently, the new government’s Lesco board instructed the management to designate these officers as special duty officers, which was implemented.\n\nThe management later approached the ministry, highlighting the idleness of these officers, who were still receiving full salaries and benefits. The ministry eventually allowed Lesco to reassign them.\n\n“So, what is unlawful if the officers, against whom no wrongdoing was proven, were reinstated and posted?” the official argued, asserting that the reinstatement process adhered to regulations.\n\nThe official, however, expressed a lack of information about the other issues under investigation.\n\nPublished in Dawn, January 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:29:21.720Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883339/pm-orders-inquiry-into-lesco-reinstatement-overbilling-alleged-graft",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T00:50:12.000Z"
}
