{
  "title": "Fact check: Imran listed as honourable mention in 500 most influential Muslims for 2025, not ranked in top 25 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts from multiple users on social media platform X since January 3 claimed that PTI founder Imran Khan was ranked in the top 25 in the 2025 edition of ‘The Muslim 500: The World’s 500 Most Influential Muslims’. However, Imran was not among the top 50 and was included as an honourable mention.\n\nThe Royal Islamic Strategic Studies Centre (RISSC) is a research institute based in Amman, Jordan. It has been publishing an annual report titled ‘The 500 Most Influential Muslims’ since 2009, recognising and highlighting individuals who have made significant contributions to Muslim communities.\n\nIt also includes an “Honourable Mentions” section, that features notable individuals who might not have made the main list but are still influential in their own right. These mentions are often seen as more of a gesture of recognition rather than a formal ranking.\n\nOn January 3, Pakistani-Sikh journalist Harmeet Singh shared a screenshot of the “Top 50 and Honourable Mentions Listed by Category” section from ‘The Muslim 500’ report for 2025.\n\nThe post was captioned: “The Royal Islamic Strategy Centre, a Jordanian organisation, ranked Imran Khan at number 24 in its list of the 500 most influential people in the world’s Muslims for 2025. While Imran Khan remains in prison.”\n\nThe post gained 92,700 views.\n\nJournalist Jameel Farooqui shared a similar claim, racking up 15,000 views.\n\nAn account spotlighting trends in entertainment and the news also shared the claim with the caption: “Imran Khan honoured as one of the 25 most influential Muslims.”\n\nThe post was viewed by 115,700 users and re-shared 2,000 times.\n\nA video of anchor Samina Pasha was shared by the official X account of PTI West Punjab wing with the caption: “Imran Khan’s name is included in the top 25 influential Muslim personalities in the world. The list includes kings from various Arab countries, including the Saudi crown prince. Only Imran Khan is from Pakistan. Imran Khan is an influential personality even though he is in prison. Samina Pasha.”\n\nThe same claim was widely shared by other users as can be seen here, here, here, here and here.\n\nMeanwhile, former PTI propagandist turned critic Farhan Virk claimed otherwise, saying: “Another PTI fraud caught! After seeing this tweet, I downloaded the full edition of 2025 and Imran Khan’s name is not in the first 50 names. From Pakistan, Mufti Taqi Usmani and Maulana Tariq Jameel are the names. They are forging by putting up a picture of the old edition.”\n\nHis post gained 63,600 views and the same claim was shared by other anti-PTI users as well.\n\nA fact-check was initiated to determine the veracity of the claim due to its virality and keen public interest in news pertaining to Imran.\n\nChecking the 2025 edition showed that contrary to the claims by both pro and anti-PTI posts, Imran was indeed included as the 24th number in the list of honourable mentions for rulers and politicians but was not part of the ranked top 50 personalities.\n\nDescribing how the list of top-ranked 50 and honourable mentions worked, the list said: “The Top 50 individuals are ranked and listed first. The remaining 450 names are then listed (not ranked) in categories of influence, with a small number also chosen to be in our honourable mentions section to value the notable contributions made in their fields.”\n\nTherefore, Imran was included as the 24th listing in the honourable mentions for rulers and politicians and not ranked at 24th. He was also not a part of the top 50 list which is indeed ranked.\n\nTherefore, the factcheck determined that the claim that Imran was ranked 24th on the list of the 500 most influential Muslims for 2025 is misleading. The incarcerated politician is not ranked in the main top 50 list but rather is listed in the “Honourable Mentions” section of the report for rulers and politicians at 24th. The report clarified that, unlike the ranking in the top 50, the order of listing in the honourable mention sections carried no significance.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ and UNDP.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:28:55.006Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883479/fact-check-imran-listed-as-honourable-mention-in-500-most-influential-muslims-for-2025-not-ranked-in-top-25",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T12:46:58.000Z"
}
