{
  "title": "IMF wants strict levy on captive power plants - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Mandates gas disconnections to industrial CPPs by the end of January\n• Says captive plants must transition to grid electricity or pay equivalent costs\n• Compliance critical for the country to qualify for $1bn tranche in March\n\nISLAMABAD: Showing no flexibility towards changing a key structural benchmark, the Inter­national Monetary Fund (IMF) has asked the government to impose a substantial levy on gas supply to industrial captive power plants (CPPs) to eliminate any cost benefit between the grid power and their in-house electricity generation.\n\nUnder the $7bn Exte­nded Fund Facility (EFF) signed in September last year, Pakistan has to deliver on one of the major structural benchmarks that required gas disconnections to CPPs by the end of January 2025 to qualify for disbursement of the second of the seven $1bn tranches in March. The two sides will meet for the first biannual review in the second half of February.\n\n“We will end captive power usage by end-January 2025 (structural benchmark),” reads the sovereign agreement sig­ned by Finance Mini­ster Muhammad Aurangzeb and the State Bank of Pakistan Governor Jameel Ahmad with the IMF in September last year.\n\nPushed by the influential industrial sector led by textile exporters and gas utilities, particularly Lahore-based Sui Nor­thern Gas Pipelines Limited, the petroleum division has since been advocating for a reversal of this commitment on the grounds that this was creating surplus LNG in the system at a substantial loss to the entire LNG supply chain, from imports to the consumer end.\n\nOfficials in the petroleum division and gas companies claim that there is a surplus of around 50 cargoes per year or close to 250 cargoes in five years. Industrial units, on the other hand, claim a loss of export competitiveness in case of gas-LNG disconnection.\n\nOfficials said Pakistan tried to convince the IMF to change the structural benchmark on the grounds that there were some challenges to electricity grid stability and supplies. The IMF did not show any flexibility about the programme benchmark and instead suggested the imposition of Rs1,700-1,800 per unit (million British thermal units or mmBtu) on top of the prevailing LNG price for CPPs in case of electricity supply challenge, according to gas sector sources involved in these talks.\n\nThat takes the gas price to CPPs to around Rs5,000 per unit from around Rs2,800 to Rs3,200, depending on global oil prices. “This is not acceptable to industrial consumers. They would rather shift to alternate fuels or even use coal or burn old tyres,” the official said, adding that industrial units and gas companies were being sacrificed for the whims of a few and the survival of an ailing power sector.\n\nA finance ministry official confirmed that the IMF structural benchmark was intact. “There is no change as of now. We have to deliver on our commitment,” he said, adding that IMF did not quote the amount of the levy but conceded that even at the current gas price, CPPs had an advantage of more than Rs1,500 per million cubic feet per day (mmcfd).\n\nThe IMF has demanded that the gas supply to CPPs be “disincentivised” in a manner that distortion between the power supply from the national grid and in-house generation through captive plants is eliminated, where the power supply was a problem.\n\n“They (CPPs) should shift to the electricity grid or pay its equivalent price. Gas incentive should end,” he said, summarising the IMF stance.\n\nThe Ministry of Finance has given a written commitment to the IMF that prices for captive power users will continue to be increased where network distribution and reliability are present, whereas other captive power users should make the transition to the electricity grid by the end of this year.\n\nInterestingly, Petroleum Minister Dr Musadik Malik had recently blamed the caretaker government for tying its hands in sovereign agreements for the termination of gas supplies to industrial CPPs “against the national interests, economic viability” and even accounting considerations“.\n\nThe minister had said that the IMF was being convinced to give up demand for gas disconnection to CPPs.\n\nThe gas companies claim that gas supply disconnection to industrial CPPs was a recipe for formal default of Pakistan State Oil (PSO) and two gas companies — SNGPL and SSGCL as their combined estimated losses would go beyond Rs400bn per year.\n\nThey complain that some powerful bureaucrats had transferred power companies’ liabilities to the petroleum sector to ensure that power sector balance sheets and circular debt look good.\n\nIt was reported that over $6bn LNG-related infrastructure investment and around $4bn worth of annual LNG supply chain was put in place on the premise that RLNG would be utilised in “must-run power plants”, but these commitments were gradually diluted to 66pc “take or pay”, then to 33pc and then ultimately to the closure of power plants.\n\nThe power sector’s circular debt had, therefore, stabilised to a large extent but proportionately developed in the gas sector. On top of the receiving end is PSO, which is bound by a sovereign contract to receive LNG from Qatar on “take or pay”.\n\nThe two gas companies are unable to make payments to PSO for LNG offtake and have been further declining throughput.\n\nPublished in Dawn, January 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:29:44.558Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883368/imf-wants-strict-levy-on-captive-power-plants",
  "dateList": "2025-01-06",
  "date_published": "2025-01-06T00:46:31.000Z"
}
