{
  "article_id": "2025-06-12_c6abaa298006133c2b38e2601d89ddf8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/wajiha-qamar-vows-to-resolve-private-educational-institutions-issues-on-priority-basis/",
    "retrieved_at": "2025-08-27T11:05:39.748Z"
  },
  "metadata": {
    "title": "Wajiha Qamar vows to resolve private educational institutions’ issues on priority basis",
    "author": null,
    "date_published": "2025-06-12T08:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 291,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 12 (APP):Minister of State for Education, Ms. Wajiha Qamar, has said that private educational institutions are a vital pillar of the national education system, and their issues will be resolved on a priority basis. She made these remarks during a meeting held here yesterday with Hafiz Muhammad Basharat, President of the Private Educational Society and a candidate for the Board of Governors, Federal Board. The meeting included detailed discussions on the challenges faced by the private education sector, the rising number of out-of-school children, and improvements in education policies. Hafiz Muhammad Basharat informed the Minister that private schools are providing quality education to millions of children, but rising inflation, lack of policy continuity, and stringent regulations from oversight bodies pose serious challenges. He stressed that private institutions could play a crucial role in reducing the number of out-of-school children if they are supported at the policy level. Ms. Wajiha Qamar reiterated that the Ministry of Education values the contribution of the private education sector and is working on a comprehensive and effective strategy to address its concerns. She noted that collaboration between public and private institutions is essential to reintegrate out-of-school children into the education system. Also present at the meeting, Professor Rafiq Tahir highlighted the need for continuous consultation with private institutions during policy formulation. Chaudhry Shakeel Chauhan shed light on the practical challenges faced by private schools in the field and emphasized the importance of government support. Meanwhile, Chaudhry Imran praised the efforts of private institutions in improving education standards and providing student facilities, and called for their concerns to be raised at higher levels. The meeting concluded on a positive note, with all participants agreeing to strengthen coordination and cooperation to promote education in the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}