{
  "article_id": "2025-06-12_18a4f72dc29a92e3a4cc0b04c5212a27",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/heatwave-grips-country-pmd-issues-warning-amid-soaring-temperatures/",
    "retrieved_at": "2025-08-27T11:05:41.110Z"
  },
  "metadata": {
    "title": "Heatwave grips country: PMD issues warning amid soaring temperatures",
    "author": null,
    "date_published": "2025-06-11T19:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 406,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 11 (APP):The Pakistan Meteorological Department (PMD) has forecast mainly hot and dry weather across most parts of the country, with very hot conditions expected in the plains. A warning has also been issued for a severe heatwave expected to persist through Thursday (June 12). According to the Met Office, dust-raising and gusty winds are likely during the afternoon in plain areas, while isolated rain-wind/thunderstorms may occur in parts of upper Khyber Pakhtunkhwa, Pothohar region, Kashmir, and Gilgit-Baltistan during the evening or night. The PMD has warned that temperatures are likely to remain 5-7C above normal in the upper half of the country, including central and upper Punjab, Islamabad, Khyber Pakhtunkhwa, Kashmir, and Gilgit-Baltistan. In the southern half, which includes upper and central Sindh, southern Punjab, and parts of Balochistan, temperatures are expected to be 4-6C above normal. The public is strongly advised to avoid direct exposure to sunlight between 11:00 am and 4:00 pm and to stay well-hydrated during the intense heat. In Islamabad, very hot and dry conditions are expected during the day, with a 30 percent chance of dust/thunderstorm rain in the evening or night. In Khyber Pakhtunkhwa, hot and dry weather will persist across most districts, with very hot conditions in the plains. Areas such as Chitral, Dir, Swat, Malakand, Mansehra, and Peshawar may experience isolated rain-wind/thunderstorms in the evening or night. Most districts of Punjab will face very hot and dry weather, with gusty winds likely in the plains. Isolated thunderstorms are forecast for Murree, Galiyat, Attock, Chakwal, Talagang, Jhelum, and Rawalpindi. Sindh will remain under intense heat and dry conditions, with coastal areas expected to experience gusty winds. Hot and dry weather will prevail across most parts of Balochistan. Very hot conditions are anticipated in the plains with gusty winds during the day. In Kashmir and Gilgit-Baltistan, the day will remain hot and dry, though isolated rain-wind/thunderstorms may develop in the evening or night. Over the past 24 hours, the country witnessed scorching conditions. The highest recorded temperatures included Bhakkar and Jacobabad at 49 C, followed by Sibbi, Noorpur Thal, Sargodha, Gujranwala, and Hafizabad at 48 C. Other cities such as Attock, Sheikhupura, Mandi Bahauddin, Jhelum, Bahawalnagar, Sialkot, Layyah, and Dera Ismail Khan also recorded extreme highs at 47 C. As the heatwave continues, the Met Office urges the public, particularly vulnerable groups such as children and the elderly, to take necessary precautions and remain indoors during peak hours.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}