{
  "article_id": "2025-06-12_880f3fb8106f6eb8505bf7644b62fa82",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-railways-minister-visits-quetta-railway-station-inaugurates-cctv-control-room-a-gym/",
    "retrieved_at": "2025-08-27T11:05:14.330Z"
  },
  "metadata": {
    "title": "Federal Railways Minister visits Quetta Railway Station, inaugurates CCTV control room, a gym",
    "author": null,
    "date_published": "2025-06-12T08:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 250,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA, Jun 12 (APP):Federal Minister for Railways Muhammad Hanif Abbasi, accompanied by Senator Ahmad Khan Khilji, paid a detailed visit to the Quetta Railway Station on Thursday. During the visit, the minister interacted with passengers aboard the Jaffar Express bound for Peshawar, listened to their concerns, and assured them of continued improvements in railway services. Divisional Superintendent (DS) of Quetta Railways, Imran Hayat Khan, briefed the minister on ongoing developments and infrastructure enhancements at the station. The minister inaugurated the control room for the newly installed network of 29 modern CCTV cameras aimed at enhancing security and surveillance at the station. He also inaugurated a newly established gym facility at the Railway Officers Club. Speaking on the occasion, Federal Minister Hanif Abbasi emphasized that Pakistan Railways is committed to providing the best possible facilities to its passengers. He further directed that the Business Class waiting room at the Quetta station be opened for all passengers, not just premium ticket holders, as a gesture to promote inclusivity and comfort. The minister praised the efforts of DS Imran Hayat Khan and his team for the commendable management and maintenance of the Quetta Railway Station, calling it a model of efficiency and passenger care. Minister Abbasi also presented a cheque of Rs. 5 million to the mother of Constable Faisal, who was martyred in a recent terrorist attack in Machh. He expressed his condolences and reaffirmed the government's resolve to stand with the families of those who sacrifice their lives for the nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}