{
  "article_id": "2025-06-12_de0349c77cbb4add226a6017272d2908",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/parliamentary-delegation-raises-concern-over-weaponization-of-water/",
    "retrieved_at": "2025-08-27T11:05:22.198Z"
  },
  "metadata": {
    "title": "Parliamentary delegation raises concern over weaponization of water",
    "author": null,
    "date_published": "2025-06-12T18:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 225,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "BRUSSELS, Jun 12 (APP):The high level parliamentary delegation led by Chairman Bilawal Bhutto Zardari addressed a roundtable titled \"South Asia at a Crossroads: Navigating Security Dynamics in a Changing Geopolitical Landscape\" at the prestigious Egmont Institute in Brussels. Chairman Bhutto Zardari delivered a compelling overview of the evolving strategic balance in South Asia, highlighting the region's growing fragility in the face of an increasingly assertive power with revisionist ambitions. He noted recent acts of military provocation based on unsubstantiated allegations, unprovoked strikes on civilian targets, and a troubling disregard for international law, warning of efforts to reshape the regional order through unilateralism and coercion. The delegation raised concern over the weaponization of water, condemning the move to place the Indus Waters Treaty in abeyance. They stressed that this step endangers ecosystems and livelihoods across the region, and undermines one of the world's most successful water sharing frameworks. Manipulating shared natural resources for political leverage, they warned, sets a dangerous precedent and erodes principles of international cooperation. Underscoring the imperative of peace, the delegation reaffirmed Pakistan's commitment to regional stability, constructive dialogue, and multilateralism. They emphasized that lasting peace in South Asia requires the peaceful resolution of the Jammu and Kashmir dispute in accordance with UN Security Council resolutions, and called for a global consensus to deter reckless state behaviour that threatens regional and global stability.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}