{
  "title": "Riphah University awards degrees to 14 Ph.D graduates, 115 gold medalists",
  "link": "https://www.app.com.pk/national/riphah-university-awards-degrees-to-14-ph-d-graduates-115-gold-medalists/",
  "date_published": "2021-08-28T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): As many as 14 Ph.D graduates and 115 gold medalists were conferred degrees during the 15th Convocation of Riphah International University held here in hybrid mode on Saturday.\nThe convocation was attended virtually by over 1600 graduating students. President Dr. Arif Alvi is the Patron of Riphah International University. However, due to the Covid-19 restrictions the President in a message message urged the young students to work hard and bring laurels for the country.\nDuring his speech, he appreciated Riphah’s vision and mission to inculcate Islamic ethical values in its academic programmes and to excel in the fields of research and education. He also appreciated the efforts of Riphah for the separate education for females.\nHe extended his greeting to Riphah for organizing high values conferences in Medical Education, Pharmaceutical Sciences, Rehabilitation Sciences, Lifestyle medicine, and other conferences.\nHe congratulates graduating students, their parents, and teachers as well as the university authorities on their achievements.\nThe chief guest for today’s convocation was Hassan Muhammad Khan, Chancellor Riphah International University.\nSpeaking on the occasion, he congratulated all the graduates and wished them a bright and successful future. He said that Riphah provides education, which is beyond academic knowledge but also focus on character building.\nHe said that Riphah groomed its students to improve the intellectual and personal growth, preparing them to become informed leaders and valuable citizens of Pakistan with focus on Islamic ethical codes.\nHe said that this year Islamic International Medical College has completed a journey of 25 years which is now recognized as a premier medical institution. He spoke that the university has progressed exponentially in terms of the number and quality of programmes, faculty, and students.\nThe ethos of the University are based on the emphasis on high quality in academics and research horizons. He extended his felicitations to the Vice-chancellor, graduating students, faculty members, and parents on this joyous occasion.\nProf. Dr. Anis Ahmed said that with Allah SWT’s blessing and support, coincides with our completion of 25 years of an educational struggle to introduce a value-based program of learning.\nThe creation of the Islamic International Medical College Trust in 1995 by the Founding Managing Trustee Late Major General Zulfiqar Ali Khan was a landmark of a meaningful and objective-based educational movement.\nHe mentioned that Riphah is not only a quality educational institution, it is a movement for Islamic beliefs and social change.\nHe mentioned that Riphah is a state-of-the-art educational institute which is offering 146 academic programs, 22000 Plus enrolled students, and 908 Faculty Members.\nBrig (R) Salim Ahmed Khan, Registrar Riphah International University conducted the proceedings of the 15th convocation in befitting manners and thanked all the committee members for organizing the successful ceremony.",
  "retrievedAt": "2025-08-11T21:08:41.300Z"
}
