{
  "title": "Peace in Afghanistan existential issue for Pakistan: Dr Moeed",
  "link": "https://www.app.com.pk/national/peace-in-afghanistan-existential-issue-for-pakistan-dr-moeed/",
  "date_published": "2021-08-28T18:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): National Security Adviser (NSA) Dr Moeed Yusuf on Saturday said the peaceful resolution of Afghan crisis and peace in the region is an existential matter for Pakistan.\nAddressing a discussion held on Evolving Afghanistan situation, the NSA briefed the foreign media correspondents on Pakistan’s perspective.\nDr Moeed said Pakistan wanted to make sure that the international community played its due role in bringing stability to the conflict hit region of Afghanistan.\nHe underlined that if the global community made the Taliban a pariah in the region then it would incur drastic impacts in the form migration and terrorism spill over to Pakistani side.\nHe briefed the foreign media journalists that Pakistan had graciously hosted around five million Afghan refugees since 1979 with it’s own available limited resources and would continue further till a dignified repatriation mechanism was worked out by the global players.\n“Due to our prevailing economic situation, we are not able to take on more refugee inflow burden into Pakistan,” he added.\nThe NSA presented a detailed historic and contemporary view of the perspective maintained by Pakistan over the Afghan issue and the historical background in this regard.\nHe underscored that Pakistan Embassy in Kabul was the only one operating 24/7 to assist evacuation. “Around 8,000 people have been evacuated including 30 female journalists who were rescued on priority following their request. It will keep on working to assist more in the evacuation process,” he added.\nHe urged that the world must stop blaming the victim as Pakistan bore maximum brunt of the conflict in Afghanistan and lost over 80,000 lives and more than $152billion economic losses.\nSpeaking on the occasion, Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain said Pakistan was the only country that had proved to be accurate in its assumption and perspective over Afghan issue.\nHe said Pakistan wanted all stakeholders and partners of the international community involved in Afghanistan to play their role in averting a massive humanitarian catastrophe in the making.\nThe discussion was followed by an extensive question hour session where the NSA responded to the media queries.\nResponding to APP’s query, he said capacity building of the Afghan government institutions was a key concern and a pertinent issue and Pakistan would be looking to see global community playing its sincere role along with local players in this regard.\nReplying to another query, he said Pakistan wanted to work with everyone for a peaceful resolution of Afghan conflict and it also sticks to it’s stance of dignified return of the Afghan refugees to their country.",
  "retrievedAt": "2025-08-11T21:08:46.167Z"
}
