{
  "title": "India makes canny attempts to misuse BRICS to fulfill anti-Pakistan designs",
  "link": "https://www.app.com.pk/national/india-makes-canny-attempts-to-misuse-brics-to-undermine-pakistans-anti-terror-successes-sabotage-kashmir-movement/",
  "date_published": "2021-08-28T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): Deviating from BRICS’ sole objective of limited purpose partnership, India is making cunning attempts to use the forum to undermine Pakistan’s anti-terror achievements and sabotage the indigenous freedom movement of Kashmir through agenda-setting.\nConstituting Brazil, Russia, India, China and South Africa, the BRICS brings together four continents with five major emerging economies accounting for 42% of the world’s population.\nIt is a “limited purpose partnership” as it was meant for interstate cooperation among group to rebalance global economy.\nWith India holding its current chair, the BRICS summit is scheduled to be held on September 9 this year. Prelude to the summit, meeting of BRICS Counter Terrorism Working Group (CTWG) was also held in July and discussed the Foreign Terrorist Fighters (FTF).\nThough the NSAs’ meeting discussed the current situation in Afghanistan, India as usual tried its best to drag Pakistan into discussion without directly mentioning its name. India also remarked that Lashkar-e-Taiba (LeT) and Jaish-e-Mohammad (JeM) are enjoying a “state support”.\nIn fact, in order to hide its internal vulnerabilities and embarrassment faced after takeover of Afghanistan by Taliban, India is once again using the “mantra” of “cross border terrorism” hinting Pakistan at BRICS forum which is not even meant to discuss such issues between two states.\nThe forum is supposed to focus on economic gains instead of being exploited as a tool for political gains. National agendas of one particular member country should have no place in the forum.\nHistorically, India has been using BRICS to target Pakistan and setting of terrorism as agenda for the meet by India is a canny attempt to undermine Pakistan’s extensive and successful efforts against terrorism.\nIndia is attempting to overshadow Pakistan’s counter terrorism achievements especially proscription of LeT and JeM and collaboration with global and regional countries amid US withdrawal to bring peace to Afghanistan.\nBesides, India is also likely to use this forum to sabotage the indigenous Kashmir freedom movement by labeling the freedom fighter as “Pakistan sponsored Foreign Terrorist Fighters (FTFs) during the upcoming BRICS Summit.\nThe Narendra Modi regime would try to convince the member states to tighten the monitoring and removal of material uploaded by Kashmiris on social media in the name of cyber security as “use of social media by terrorists is already on the BRICS meeting agenda.\nIndia is also likely to link the terror financing issue with the FATF and would try its utmost through “fake facts” to orchestrate a case to continue to keep Pakistan on the grey list.\nThe misuse of BRICS by India is nothing new as the country always misled forum members. While the rest of the BRICS members would never openly endorse either side in the Indo-Pakistan tension, India in a way tried to secure its stance vis-à-vis Pakistan by taking advantages of its agenda-setting powers for the summits.\nAs a matter of fact, India is involved in financing and supporting terrorism in Pakistan but plays innocent at international forums including BRICS.\nIndia is totally flabbergasted and confused over the takeover of Afghanistan by the Taliban as all its mischievous notions carried out with the support of previous Afghan govt have failed and billions of dollars flooded in Afghanistan by India have gone for a six.\nTwo of the BRICS members, China and Russia have already welcomed Taliban and have shown their strong willingness to work with future Afghanistan leaving India in a great fix.\nBesides BRICS, India is also using its influence over FATF which kept quiet on sponsor and financing of terrorism by India in Pakistan through BLA and Kulbhushan Jadhav.\nOn 14 Nov 2020, Pakistan presented a dossier that contained “irrefutable proofs” of India’s sponsorship of terrorism and called on the international community to recognize the rogue behaviour by a state that refuses to adhere to international laws and UN Conventions.",
  "retrievedAt": "2025-08-11T21:08:45.084Z"
}
