{
  "title": "Peace in Afghanistan to benefit entire region: FM",
  "link": "https://www.app.com.pk/national/peace-in-afghanistan-to-benefit-entire-region-fm/",
  "date_published": "2021-08-28T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Saturday said that peace and stability in Afghanistan would benefit the entire region.\nIn a press statement, the foreign minister said that neighbouring countries of Afghanistan were well aware of the situation there.\nReferring to his recent visit to four different countries, Qureshi said that he met the leadership of these countries, adding their views over Afghanistan were fact- based.\nThe foreign minister cautioned that worsening situation in Afghanistan would affect them all. Taliban leadership had been in contact with all, he added.\nQureshi said that Afghan people had been bracing the devastating impacts of decades of war and they wanted durable peace, adding that they had been the victims of past mistakes.\nThe positive message from Afghanistan should be encouraged and if the country was left aloof, it would cause negative impacts upon all, he maintained.\nThe foreign minister further said that Pakistan had been facilitating in the evacuation process of diplomatic missions of various countries from Afghanistan and the PIA was playing a significant role in this regard.\nHe said the international community was acknowledging Pakistan’s role.\nHe said India had been the top spoiler and playing negative role against Pakistan and for this purpose, it had pulled together different terrorist groups to carry out terrorist activities.\nQureshi warned that India was trying to destabilize the regional peace and stressed upon keeping a vigil over such designs.\nThe foreign minister said that Pakistan had not closed its borders with Afghanistan and took steps over border management.\nAbout his telephonic conversation with the British counterpart, he said that they had discussed Afghanistan, besides, he urged the UK government to review the red listing issue.",
  "retrievedAt": "2025-08-11T21:08:41.334Z"
}
