{
  "title": "President Alvi stresses for agricultural research to enhance yield",
  "link": "https://www.app.com.pk/national/president-alvi-stresses-for-agricultural-research-to-enhance-yield/",
  "date_published": "2021-08-28T18:42:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 28 (APP): President Dr. Arif Alvi on Saturday emphasized on research for better seed of various crops especially rice and cotton to increase yield which will reduce the production cost as well and become competitive in the regional, international markets.\n“Lack of research and marketing of unmatured seed has caused big loss to our cash crops,” he said while addressing 13th annual awards distribution ceremony of Rice Exporters Association of Pakistan (REAP) here which was also attended by Federal Minister for Privatization Mohammed Mian Soomro, Special Assistant to Prime Minister on Marine Affairs Mehmood Maulvi and foreign diplomats.\nOn REAP side, the prominent were its patron-in-chief Abdul Rahim Janu, Chairman Abdul Qayyum Paracha, Senior Vice Chairman Faisal Jehangir, Vice President Asfaq Ali.\nThe President regretted that in the past unmatured seeds of rice and cotton were marketed which created many problems including confusion among the farmers.\nNow, he continued, the government had introduced bills to ensure strong checks over sale of low standard seeds along with creating awareness among the farming community to use\nlatest techniques of agriculture to increase yield.\nThe government has also fought for copy rights and protected Pakistani Basmati rice in international market.\nHe also unerdlined the need for alternative methods of irrigation to cope with increasing shortage of water in the country.\nSometimes, government had to intervene and suggest the farmers to switch over to\nanother cash crop which needed less water intake.\nThe country’s population was increasing which need more food and solution lied only in strengthening our agriculture sector through use of modern technology, increased research and training to farmers.\nDr. Arif Alvi emphasized on more value addition in agriculture production including rice, fruits and especially cotton to earn more foreign exchange for the country.\nHe said the world was also moving for organic food including fruits.\nPakistan have to work for the same as there was big demand for organic fruits in the world.\nHe appreciated the REAP efforts to export rice of more than Rs 2 billion despite many challenges due to COVID-19 and hoped they would achieve their target of Rupees five billion export in next couple of years.\nHe also praised the government policy for manage the covid-19 situation.\nPrime Minister Imran Khan’s vision was to save life and livelihood of the people simultaneously which provided very good results.\nHe also acknowledged the positive attitude of the people of Pakistan to fight Covid pandemic.\nHe said there was need for intellectual decisions to navigate the country to prosperity and the present government under the leadership of Prime Minister Imran Khan had succeeded on many fronts.\nPakistan’s economy was now stable with growth rate of 4 percent.\n“All things are moving rightly and Pakistan would emerge as strong country”, he remarked.\nEarlier, he distributed awards among 100 top rice exporters.\nPatron-in-Chief of REAP, Abdul Rahim Jannu and Chairman REAP Abul Qayyum Paracha briefed the President about the issues and hindrances in export of rice.",
  "retrievedAt": "2025-08-11T21:08:45.892Z"
}
