{
  "title": "Caretaker government stood by commitment of holding elections on February 8: Solangi",
  "link": "https://www.app.com.pk/national/caretaker-government-stood-by-commitment-of-holding-elections-on-february-8-solangi/",
  "date_published": "2024-02-07T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 7 (APP): Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi said on Wednesday that the caretaker government had stood by its commitment of holding general elections on the schedule given by Election Commission of Pakistan ( ECP).\nAddressing the inaugural ceremony of Media Coordination and Facilitation Center established by Press Information Department here, he said tomorrow morning the voting would start and by midday half of the polling would have been done.\nReferring to speculations, he said there were doubts and concerns in people’s minds regarding the elections.\n“We stood by the promise of holding polls and elections are being held (tomorrow), putting aside all fears and rumours,” Murtaza Solangi maintained.\nThe minister said that the caretaker government had taken all possible steps for ensuring the conduct of free and transparent elections.\nHe said after oath-taking of caretaker government on August 17 last year, in his first press briefing here the very next day , the first question he was asked about the elections and his answer was that elections would be held on the timeframe given by the ECP.\nMurtaza Solangi said that this country was established under constitutional democracy and constitutional federal parliamentary system was the foundation of its political system.\nHe said he as spokesperson of the government had reiterated time and again that elections would be held on the time given by ECP.\n“When the date of February 8 was given, our consistent answer was that the polling stations will open at 8.00 am on Thursday February 8”, he added.\nThe minister said that announcement of unofficial results would start tomorrow evening and , the official results will be released by the ECP within three days time period.\nHe said there were many challenges and problems in holding elections but the government was not discouraged by anything.\nThe minister said that Ministry of Information and Broadcasting facilitated the media and provided authentic and verified news to the public through the relevant institutions.\nHe said that the Press Information Department had set up Media Facilitation Center to facilitate both local and foreign media in coverage of elections.\nFederal Information Secretary, Shahera Shahid said that all possible facilities would be provided to the journalists in the Media Coordination and Facilitation Center here and other cities as well.\nShe said that Press Information Department had been establishing such centres during elections in the past as well and it had a experienced officers and staff.\nOn the elections,anyone could approach the centre set up by PID for getting information and assistance, she maintained.\nPrincipal Information Officer (PIO) Dr Tariq Mehmood Khan in his opening remarks at the inauguration ceremony of Media Coordination and Facilitation Center, stated that Media Coordination and Facilitation Centers had also been established in PID offices across the country.\nHe informed the media persons that a total 4,763 accreditation cards had been issued to journalists who wanted to cover the elections.\nOut of total, PIO said, that around 1219 cards were issued in Islamabad, 776 in Lahore, 878 in Karachi, 363 in Peshawar, 167 in Quetta, 132 in Hyderabad, 482 in Faisalabad and 746 in Multan.\nMedia Coordination and Facilitation Center will also provide transportation facilities to journalists, Dr. Tariq Mehmood added.\nIn that regard, different routes had been finalised to cover the election process.\nDuring the coverage the computer facility for Journalists as well as refreshment arrangements had also been made, he said.\n“Our app and Media Helpline will also work continously during the election process in case of help needed by any journalist,” he said.\nThe PID staff would provide their best services round the clock in these centres, he added.\nSimilarly, the Director General Public Relations Karachi, Lahore, Quetta, Peshawar, Hyderabad, etc informed about arrangements made to cover the electoral process in their respective provinces. They assured to provide all out support to the journalists during the coverage of general elections 2024.\nEarlier Caretaker Minister for Information and Broadcasting Murtaza Solangi inaugurated the PID Media Coordination/Facilitation Centre.\nThis center has been exclusively established to facilitate local and international journalists covering the upcoming election.\nThe Centre aimed to provide journalists with all the necessary facilitation under one roof, ensuring access to reliable information and logistical support throughout the electoral process.",
  "retrievedAt": "2025-08-11T00:20:15.605Z"
}
