{
  "title": "All arrangements for February 8 election completed, 15, 696 polling stations for 21.928mn voters setup in KP: PEC",
  "link": "https://www.app.com.pk/national/all-arrangements-for-february-8-election-completed-15-696-polling-stations-for-21-928mn-voters-setup-in-kp-pec/",
  "date_published": "2024-02-07T09:29:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 07 (APP):All arrangements have been completed by Election Commission of Pakistan for free and transparent election in Khyber Pakthunkhwa where over 21.928 million registered voters would decide fate of 713 candidates contesting for national assembly seats and 1,814 candidates of provincial assembly seats on Thursday (tomorrow).\nProvincial Election Commission (PEC) Spokesman told APP on Wednesday that all arrangements for February 8, 2024 general election were completed in Khyber Pakthunkhwa including merged tribal districts where over 1,80,000 trained polling staff were deployed for polling duties.\nHe said that there are over 11.944383 million male and 99,83,737 million female who exercise right of votes in KP including merged tribal districts.  Similarly, 4,180 polling stations were set up for male, 4,287 polling stations for female and 6600 collective polling stations in Khyber Pakthunkhwa, he said, adding that 4,178 polling stations were declared highly sensitive and 5,925 sensitive where police and security personnel would be deployed for smooth conduct of the election process.\nAs per ECP’s Code of Conduct, there would be a complete ban on electioneering and persuading voters within 400 meter distance of the polling stations and only polling camps of the polling parties could be established at 400 meters distance in rural areas and 100 meters in urban areas of the province.\nThe spokesman said that district returning officers, returning officers, police and administration would ensure implementation of ECP’S code of conduct during the polling process and can take strict action against violators.\nHe said that 45,440,000 ballot papers were printed for elections and foolproof security arrangements were made for voters at polling stations.\nTo ensure foolproof security, he said police, frontier constabulary, frontier corps and Pakistan Army would be deployed and no one would be allowed to disrupt the polling process on election day, he said.\nHe said strategy was also chalked for snowfall districts of Khyber Pakhtunkhwa and arrangements for election results were made at Qayyum Stadium, Eidgah and Returning Officers offices.\nMeanwhile, Chief Secretary Khyber Pakthunkhwa, Nadeem Aslam Chaudhary, IGP Akhtar Hayat Gandapur and Additional Chief Secretary Home, Abid Majeed visited the office of Provincial Election Commissioner and inspected preparations regarding handing over of polling materials.\nThey also inspected the monitoring control room at PEC where they were briefed by the joint secretary provincial election commission.\nMeanwhile, Interior Minister Dr Gohar Ejaz visited Chief Secretary Office KP on Tuesday night where he was briefed about security arrangements made for smooth conduct of the election.\nThe Minister underlined the need of significance of the contingency plans in case the online system of ECP did not function and asked the top officials of KP Bureaucracy to ensure efficiency of back up mechanism through pre-polls drill exercise.\nThe minister highly praised the efforts put to develop the online application for the conduct of GE-2024 i.e. provincial election workplace that would doncut polls through in over 15,000 polling stations in the province.\nFollowing the end of the election campaign last night, the supporters of candidates were seen busy preparing their parties’ polling booths outside of the polling station for education of young and female voters.\nGreat enthusiasm is being witnessed among voters in Khyber Pakthunkhwa where young voters were eagerly awaiting to poll their first votes. The polling would start 8.a.m and would continue till 5pm without any break. Soon after completion of voting process, counting of ballot papers would start in presence of voters and results on farm 45 of ECP would be shared with ROs and to be fixed on the concerned polling stations for information.\nThe tribal voters of erstwhile Fata were jubilant to participate in the second direct general elections and all were awaiting to poll their votes in large numbers in favour of their candidates on February 8, 2024.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:20:32.896Z"
}
