{
  "article_id": "2025-05-20_add587fce6db82c00964e9849ebcf0f4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-holds-seminar-on-drug-awareness/",
    "retrieved_at": "2025-08-27T15:41:50.656Z"
  },
  "metadata": {
    "title": "AIOU holds Seminar on “Drug Awareness”",
    "author": null,
    "date_published": "2025-05-20T14:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 342,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 20 (APP):A drug awareness seminar was held on Wednesday at Allama Iqbal Open University(AIOU) to create awareness about the abuse of drug use among youth. Addressing the seminar, Professor Dr. Sher Muhammad, Dean Faculty of Sciences warned about the harmful effects of drugs, stating that drugs not only destroy individuals but also lead society and future generations toward ruin. He emphasized that while various institutions are taking practical steps to curb drug abuse, it is now the responsibility of students to play their part in this mission. On the occasion, Deputy Director of the Anti-Narcotics Force, Adnan Shaukat praised the efforts of Allama Iqbal Open University in raising awareness against drugs. He stated that drug abuse is a global issue that is severely affecting the younger generation. The purpose behind the formation of the Anti-Narcotics Force was to stop the smuggling of drugs across the country's borders, to eliminate involved groups, and to establish a drug-free society. He added that educational institutions, where the future of the country is being shaped, are also at risk of drug abuse. Therefore, with the support of the Higher Education Commission, Pakistan awareness sessions are being organized in all major universities across the country. Rana Shafiq, Focal Person of the Higher Education Commission Pakistan, informed the participants about the steps being taken in the fight against drugs. Dr. Zehra Kiran, a medical officer from the Anti-Narcotics Force, discussed the rehabilitation of drug-affected patients. Meanwhile, Dr. Majid Mehmood Baghram, Chairman of the Department of Business Administration, gave a presentation on stress management. Professor Dr. Syed Aamir Shah, Director of Administration and Coordination, delivered the closing remarks, stating that without raising awareness, winning the war against drugs is not possible. Therefore, a drug-free Pakistan is our mission.AIOU's Chief Security Officer Lt. Col(R) Khurram Jamal Cheema also spoke on the occassion. The seminar was organized by the Directorate of Student Advisory and Counseling Services in collaboration with YPDC (Young Peace and Development Corps-AIOU). A large number of university faculty members, senior officials, and students attended the event.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}