{
  "article_id": "2025-05-20_e0df6a6bd6b1c6ea6201549aaad02c54",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gov-launches-2nd-phase-auction-for-non-operational-power-plants/",
    "retrieved_at": "2025-08-27T15:40:22.412Z"
  },
  "metadata": {
    "title": "Gov launches 2nd phase auction for non-operational power plants",
    "author": null,
    "date_published": "2025-05-19T19:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 223,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 19 (APP):Acting on the directives of the Ministry of Power Division, state-owned power generation companies (GENCOs) have launched the second phase of the phased auction process for outdated and non-operational power plants. According to a spokesperson for the Ministry of Energy, a ceremony was held at GENCO Holding Company Limited where bids for the plants of JPCL (GENCO-I) and NPGCL (GENCO-II) were officially opened by GENCOs and NESPAK at 10:30 AM and 2:30 PM, respectively. Following successful bids in the first phase, additional plants under JPCL, CPGCL, and NPGCL have now been presented for auction in the second phase. The initiative aims to optimize the use of financial resources through the sale of inactive assets. Only one company-Siddiq & Sons Company from Karachi-submitted a bid for the Jamshoro JPCL plant. No bids were received for the power plants located in Muzaffargarh and Faisalabad. While the initial deadline for bid submission was set for May 19, the date for receiving and opening bids for the Guddu power plants under CPGCL has been extended to May 30, 2025. In total, 29 power plants have been put up for auction. These plants have a combined generation capacity of 4,074 megawatts and carry a reserve price of Rs. 40,661 million. The auction includes various blocks and units located in Jamshoro, Guddu, Muzaffargarh, Quetta, and Faisalabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}