{
  "article_id": "2025-05-20_3a60d0ea1211e8739d4e0ad707da8138",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nust-open-houses-showcase-transformative-student-innovations-and-industry-linkages/",
    "retrieved_at": "2025-08-27T15:42:26.589Z"
  },
  "metadata": {
    "title": "NUST Open Houses showcase transformative student innovations and industry linkages",
    "author": null,
    "date_published": "2025-05-20T12:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 20 (APP):The National University of Sciences and Technology (NUST) recently hosted a series of Open Houses across three of its premier institutions, highlighting groundbreaking student innovations and strengthening academia-industry linkages. The institutions included the School of Civil and Environmental Engineering (SCEE), the School of Electrical Engineering and Computer Science (SEECS), and the School of Mechanical and Manufacturing Engineering (SMME). The events served as dynamic platforms for final-year students to exhibit cutting-edge projects that reflect NUSTas commitment to research, innovation, and real-world problem-solving. At SCEEas Open House and Job Fair, students from Civil Engineering, Environmental Engineering, and Geographical Information Systems (GIS) programs presented 54 final-year design projects. The event attracted over 60 leading organizations such as FWO, NDMA, NESPAK, WAPDA, GIZ, and Halcrow Pakistan Ltd., offering students invaluable networking and career opportunities. SEECS showcased pioneering student projects in emerging fields including Artificial Intelligence, Robotics, Internet of Things (IoT), Cybersecurity, FinTech, and Sustainable Technologies. Visitors toured cutting-edge laboratories and engaged with project teams to explore innovative tech solutions rooted in NUSTas outcome-based education model. Meanwhile, SMMEas Open House saw over 120 final-year students presenting more than 35 advanced engineering projects, reflecting interdisciplinary creativity in the realms of mechanical and manufacturing engineering. The event attracted significant participation from industry professionals, academia, and alumni. The Open Houses not only celebrated the ingenuity of NUSTas students but also reinforced the universityas mission to produce future-ready graduates equipped to drive technological and societal progress.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}