{
  "article_id": "2025-05-20_373f99018a4415741db667461d936081",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-conducts-national-simulation-exercise-focused-on-flood-glof-hazards/",
    "retrieved_at": "2025-08-27T15:41:24.307Z"
  },
  "metadata": {
    "title": "NDMA conducts national simulation exercise focused on flood, GLOF hazards",
    "author": null,
    "date_published": "2025-05-20T15:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 199,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 20 (APP): The National Disaster Management Authority (NDMA) launched a two-day national-level Simulation Exercise (SimEx) at its headquarters in Islamabad to improve preparedness and bolster coordination between federal and provincial institutions in handling climate-induced disasters. The activity, held from 20th to 21st May 2025, was attended on the opening day by Federal Minister for Climate Change, Musadik Malik, who praised NDMA's proactive efforts in organizing simulations to prepare for seasonal and glacial hazards.. He stressed the importance of integrated climate resilience planning and timely response mechanisms at all levels of governance. On the first day, the exercise simulated large-scale floods and Glacial Lake Outburst Floods (GLOF), testing early warning dissemination, evacuation protocols, relief coordination, and emergency response in both lowland and high-altitude areas. SimEx scenario briefs were shared through a dedicated portal based system. The event brought together representatives from PDMAs, GBDMA, SDMA, armed forces, law enforcement, civil administration, and humanitarian partners. Participants reviewed response protocols, and shared feedback to improve future planning. On the sidelines, NDMA also hosted a Monsoon Coordination Conference to assess seasonal readiness and discuss gap analysis for effective risk management. The exercise will conclude on Wednesday with further evaluations and technical sessions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}