{
  "article_id": "2025-05-20_b90d453a8729921485b583a18ad1ce55",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-unveil-first-ever-climate-budget-amid-mounting-environmental-challenges-dr-shezra-mansab/",
    "retrieved_at": "2025-08-27T15:40:52.642Z"
  },
  "metadata": {
    "title": "Pakistan to unveil first-Ever Climate Budget amid mounting environmental challenges: Dr Shezra Mansab",
    "author": null,
    "date_published": "2025-05-20T18:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 850,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 20 (APP): Minister of State for Climate Change and Environmental Coordination Dr Shezra Mansab Ali Khan Khara on Tuesday announced Pakistan's first climate-focused budget for the fiscal year 2025-26 under which 30% of all public development projects will undergo a Climate Public Investment Management Assessment (CPIMA), marking a significant shift towards integrating climate considerations into national economic planning. Video Playerhttps://www.app.com.pk/wp-content/uploads/2025/05/WhatsApp-Video-2025-05-20-at-23.23.17.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume. The announcement was made during the Pre-Budget Dialogue 2025, titled \"Rethinking Economic Policy for a Just Energy Transition,\" organized by the Sustainable Development Policy Institute (SDPI) in collaboration with the Policy Research Institute for Equitable Development (PRIED), said a press release. The event brought together key policymakers, economists, parliamentarians, and energy experts to discuss aligning fiscal strategies with climate resilience and sustainability goals. Dr Kharal highlighted the multifaceted challenges Pakistan faces, including increased vulnerability to climatic risks affecting agriculture, India's suspension of the Indus Water Treaty exacerbating water scarcity, and the constraints imposed by the IMF's austerity program limiting development expenditures. She noted that the energy sector's inefficiencies and circular debt continue to strain the national budget, necessitating a transition to sustainable energy solutions. Dr Abid Qaiyum Suleri, Executive Director of SDPI, emphasized the economic imperatives driving the energy transition. He pointed out that rising fuel prices and the liberalization of the second-hand automobile market could accelerate the adoption of hybrid and electric vehicles, thereby promoting energy efficiency and reducing dependence on fossil fuels. Shahid Hafeez Kardar, former Governor of the State Bank of Pakistan, stressed the need for economic policies that prioritize long-term sustainability over short-term stabilization. He advocated for shifting from reactive subsidies to proactive investments, including the use of green bonds and performance-based incentives to finance climate initiatives. Khalid Mansoor, Senior Fellow at the Pakistan Regional Economic Forum and former Special Assistant to the Prime Minister on CPEC Affairs, highlighted the transformational phase of CPEC, focusing on energy transition, smart agriculture, value-added textiles, and digital transformation. He emphasized the importance of tripartite collaboration involving Pakistan's private sector, international investors, and China to synchronize capital across multiple domains. Dr Sajid Amin Javed, Deputy Executive Director of SDPI, pointed out that Pakistan's economic policy has been primarily focused on stabilization, often neglecting sustainability goals. He advocated for the imposition of carbon taxation and petroleum levies to achieve revenue targets while promoting green energy transition as a solution to macroeconomic problems. Shah Jahan Mirza, Managing Director of the Private Power and Infrastructure Board (PPIB), noted that Pakistan has already achieved 47% clean energy generation in its current energy mix. He called for encouraging local development of solar energy panels and equipment, highlighting the need to resolve the 17% duty on energy equipment and assembly parts under the Solar Energy Policy. Dr Khaqqan Najeeb, senior economist emphasized that energy issues in Pakistan are rooted in governance and management challenges rather than just energy costs or inefficiencies. He called for a unified and authoritative energy regulator to develop a competitive energy market and harmonize climate budgeting to create greater fiscal space. Afia Malik, an economist, cautioned that petroleum levies directly impact the poor, suggesting that carbon taxes on emitting energy sources would transfer the burden to final consumers, including the middle class. She stressed the need for equitable fiscal policies that do not disproportionately affect vulnerable populations. Shiraz Shah, Head of Resilience, Environment, and Climate Change at UNDP, underscored that energy transition is a governance issue requiring a multi-sectoral approach. He emphasized the necessity of coordinated efforts across various sectors to effectively manage the transition to sustainable energy. Malik Amin Aslam, former Special Assistant to the Prime Minister on Climate Change, highlighted that Pakistan cannot circumvent the impacts of climate change, which could force the country to spend 9% of its GDP on resilience efforts. He advocated for the implementation of carbon taxes to ensure that revenues collected are invested in climate resilience initiatives. Dr Khalid Waleed also pointed out that the IMF has updated its framework to include climate change considerations, transitioning from PIMA to CPIMA. He noted that about 20% of public sector investments should be dedicated to climate-supporting and climate-resilient projects, emphasizing the importance of aligning fiscal policies with climate objectives. MNA Arshad Abdullah Vohra (MQM Pakistan) emphasized that climate change and energy transition are two distinct subjects. He highlighted that energy and power are federal subjects, while climate change has become a provincial responsibility following the 18th Constitutional Amendment. Addressing urban resilience, he revealed that 4 million people in Karachi live in non-resilient housing, including 1 million registered slum dwellers. The affordability crisis is worsening, especially for slum residents who require alternate energy sources. Karachi, he noted. Sanaullah Baloch, former Senator and current Member of the Provincial Assembly of Balochistan, delivered a presentation on \"Balochistan, Energy Justice, and Economic Development.\" He recalled that Pakistan was among only five countries in the world that discovered natural gas in 1955, and Balochistan's gas contributed to $200 billion in value. He asserted that the industrial revolution across Pakistan was driven by Balochistan's gas, likening energy to the bloodstream of a nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}