{
  "title": "Pakistan Navy celebrates 75th Independence Day with national fervour",
  "link": "https://www.app.com.pk/national/pakistan-navy-celebrates-75th-independence-day-with-national-fervour/",
  "date_published": "2021-08-14T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP):An inspiring Change of Guard ceremony was held at mausoleum of Quaid-e-Azam Muhammad Ali Jinnah celebrating 75th Independence Day of Pakistan.\nA smartly turned out contingent of Pakistan Naval Academy cadets; arrayed meticulously in ceremonial dresses assumed guard duties at Mazar-e-Quaid, with effervescent spirit and enthusiasm to mark the Independence Day celebrations, said a Pakistan Navy news release.\nCommandant Pakistan Naval Academy, Commodore Sohail Ahmed Azmie graced the occasion as Chief Guest and reviewed the Guard.\nThe chief guest and Pakistan Navy contingent presented Qaumi Salam to the Father of the Nation, Quaid-e-Azam Muhammad Ali Jinnah.\nThe ceremonial Guard mounting was followed by laying of floral wreath at the Mazar-e-Quaid by the chief guest on behalf of Chief of the Naval Staff, officers and men of Pakistan Navy.\nLater, the chief guest offered Fateha and recorded his remarks in the visitor book paying rich tribute to our beloved Quaid.\nEarlier, the day dawned with gun salutes and special prayers were offered in all masajid in naval areas for solidarity and progress of the country.\nPakistan Navy Ships and Establishments were illuminated in Navy’s traditional manner. Flag hoisting ceremonies were held at Units of Pakistan Navy at Islamabad, Lahore, Karachi, Gwadar and Ormara.\nNumerous Independence Day events were held at Pakistan Navy units and establishments including singing of national anthem at daybreak and graceful display of Pakistan Navy Band. Boat rallies at Gwadar and Ormara as well as various sports events and Independence Day shows and rallies by school children were also part of day long celebrations.\nBesides, Pakistan Navy organized mangroves plantation as part of ‘Own a Tree” campaign in collaboration with Sindh Forest Department at Satawa Creeks, Shah Bandar.\nThe mangroves plantation campaign will continue from 14-20 August 2021 and approximately 100,000 mangroves/ saplings will be planted at Shah Bandar to provide safe and healthy environment for the future generations.\nOn the occasion of Independence Day 2021, the President of Pakistan has approved military & civil awards to Officers, CPOs/ Sailors and Civilians of Pakistan Navy.\nThe awards include 02 Hilal-e-Imtiaz (Military), 08 Sitara-e-Imtiaz (Military), 04 Tamgha-e-Imtiaz (Military) and 01 Tamgha-e-Basalat. In addition, 02 awards of Imtiazi Sanad and 39 awards of Tamgha-e-Khidmat (Military) have been approved upon Master Chief Petty Officers, Chief Petty Officers and Sailors.\nLetter of Commendation from Chief of the Naval Staff has been approved for 48 Officers, Master Chief Petty Officers, Chief Petty Officers/ Sailors and civilians.\nPakistan Navy celebrated Independence Day with resolute to protect homeland against any aggression.",
  "retrievedAt": "2025-08-11T21:04:57.436Z"
}
