{
  "title": "Independence Day celebrated with national zeal, zest in Faisalabad",
  "link": "https://www.app.com.pk/national/independence-day-celebrated-with-national-zeal-zest-in-faisalabad/",
  "date_published": "2021-08-14T17:53:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Aug 14 (APP): The 75th Independence Day was celebrated with national zeal and zest throughout Faisalabad district with a commitment that all-out efforts would be made for steering the country out of multifaceted crises and no stone would be left unturned for the protection, progress and prosperity of Pakistan.\nThe main flag hoisting ceremony was held at Commissioner Complex where State Minister for Information & Broadcasting Farrukh Habib along with Chairman NA Standing Committee on Finance Faiz Ullah Kamoka, MNA Khurram Shehzad, Provincial Parliamentary Secretary for Labour Shakeel Shahid,\nMPA Chaudhry Lateef Nazar, MPA Mian Waris Aziz, MPA Firdous Rae, Divisional Commissioner Saqib Mannan, Deputy Commissioner Muhammad Ali, CEO Education Ali Ahmad Siyan hoisted the national flag while a large number of people belonging to different walks of life participated in the ceremony.\nAt 8:58 a.m., siren was also blown after which one minute silence was observed and the active troops of police, Civil Defence, Rescue 1122 and Dolphin Force presented salute to the national flag.\nThe schoolchildren presented Milli Naghmas (national songs) while special prayers were offered for the development and prosperity of the country.\nLater, Parks & Horticulture Authority (PHA) distributed free saplings among the citizens in Zila Council Chowk where State Minister for Information & Broadcasting Farrukh Habib, Chairman NA Standing Committee on Finance,\nRevenue and Economic Affairs Chaudhry Faizullah Kamuka, MNA Khurram Shehzad, MPA Chaudhry Latif Nazar, MPA Mian Waris Aziz, MPA Firdous Rae, Divisional Commissioner Saqib Mannan, Deputy Commissioner Muhammad Ali and Director General PHA Asima Ijaz Cheema also distributed plants among the people.\nAnjuman Tajiran also arranged Jashan-e-Azadi function at Clock Tower Chowk where State Minister for Information & Broadcasting Farrukh Habib cut the cake and hoisted the national flag.\nLater, talking to media persons during cake cutting ceremony of Electronic Media Association at Iqbal Stadium Faisalabad, the state minister congratulated the nation on 75th Jashan-e-Azadi and said that every Pakistani should be aware of negative propaganda of anti-state elements and play their active role to foil international conspiracies and to protect Pakistan’s point-of-view on its sovereignty, integrity and solidarity.\nEarlier, the day dawn with special “Dua” in the main mosques after Fajr prayers for the prosperity of the nation and solidarity of Pakistan. Quran Khawani was held for the departed souls of the martyrs of Pakistan movement.\nVarious social, political, trade and religious organizations also arranged a number of events to highlight the importance of independence.\nProvincial Minister for Public Prosecution Chaudhry Zaheerud Din addressing Jashan-e-Azadi program in Jaranwala said that economic sovereignty is imperative to make Pakistan developed and prosperous. The entire nation should reaffirm its vow to play active role for economic sovereignty of the country, he added.\nVice Chancellor (VC) Government College Women University Faisalabad (GCWUF) Prof Dr Robina Farooq also addressed Jashn-e-Azadi function in the university and stressed the need to promote Quaid-e-Azam’s clarion call of faith, unity and discipline in order to emerge an ideal state across the globe.\nMeanwhile, Chief Executive Officer (CEO) Faisalabad Electric Supply Company (FESCO) Engineer Bashir Ahmad addressed a flag hoisting ceremony in FESCO Headquarters and said that independent homeland “Pakistan” is the result of sacrifices offered by our forefathers. Therefore, the present generation should play its due role to drag out Pakistan from prevalent crises and put it on road to progress and prosperity, he added.\nThe similar function were also arranged at Faisalabad Chamber of Commerce & Industry (FCCI), Government College for Women Saif Abad, Government College for Women Karkhana Bazaar, Government Associate College for Women Chak 266/R-B Khurarianwala, Central Station of Rescue 1122 Faisalabad, Kamal Pur and Aminpur posts of Punjab Highway Patrol (PHP) police,\nQasr-e-Behbood, district office Pakistan People’s Party, Board of Intermediate & Secondary Education (BISE) Faisalabad Complex, Faisalabad Development Authority (FDA) Headquarter, Tehsil Office Tandlianwala, Government Postgraduate College for Boys Sammundri,\nGovernment Municipal Graduate College Abdullah Pur, District Health Authority Office, Municipal Committee Dijkot Office, Government Crescent Model Higher Secondary School Sheikhupura Road and Faisalabad Institute of Cardiology.\nThe markets and streets were decorated with buntings and national flags.\nBanners were displayed at the important roads and intersections pertaining to the slogans on patriotism.\nThe police and district administration also made stringent security arrangements on Jashan-e-Azadi in Faisalabad.",
  "retrievedAt": "2025-08-11T21:04:53.758Z"
}
