{
  "title": "Kashmiris to observe Black Day as India celebrates independence on Aug 15",
  "link": "https://www.app.com.pk/national/kashmiris-to-observe-back-day-as-india-celebrates-independence-on-aug-15/",
  "date_published": "2021-08-14T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): As India celebrates Independence Day on August 15, the Kashmiris on both sides of the Line of Control (LoC) and all over the world would observe it as Black Day to condemn the Indian oppression and revocation of territory’s special status.\nThe observance of Black Day is also meant to convey a message to the international community that India continued to deny their right to self-determination guaranteed by the United Nations Security Council resolutions.\nThe Black Day will mark a complete shutdown in Indian Illegally Occupied Jammu and Kashmir (IIOJK), called by the All Parties Hurriyat Conference and the Hurriyat Forum led by Mirwaiz Umar Farooq and supported by almost all Hurriyat leaders and organizations, according to Kashmir Media Service.\nThe Kashmiris would also hold anti-India demonstrations across the world in front of Indian embassies to draw the world attention towards the Indian brutalities in the occupied territory.\nThe shutdown in IIOJK will be part of Ashra-e-Muzahamat (10-Day Resistance) being observed on the call of the APHC from August 05 to August 15, 2021.\nBlack flags will be hoisted everywhere while protest rallies will be organised against the gross human rights violations being perpetrated by Indian troops in the occupied territory.\nMeanwhile, the occupation forces have converted the Kashmir valley, particularly Srinagar, into a military garrison and a big concentration camp by deploying Indian troops and police personnel all around.\nThe authorities have arrested dozens of Kashmiris and intensified restrictions in Srinagar and other areas ahead of India’s independence day, causing more difficulties for the already besieged people of IIOJK.\nThe Indian forces, police and the paramilitary Central Reserve Police Force (CRPF) during house raids arrested dozens of youths in Srinagar, Badgam, Pulwama and other areas.\nThe personnel have intensified patrolling, vehicle checking and frisking in Srinagar and other parts of the occupied Kashmir Valley.\nThe IIOJK authorities have ordered all government employees to attend the India’s Independence Day functions on August 15.\nIndian forces have also warned father of martyred youth leader Burhan Muzaffar Wani, who is a school principal, of losing his job if he did not unfurl the Indian flag on India’s Independence Day.\nThe authorities have also ordered the staff members and Head of the Institutions of School Education Department to sing the national anthem of India on its Independence Day.\n“Anti-India rallies followed by protest demonstrations in all small and major cities and towns at both sides of the LoC, will be all mark of the day”, National Events Organizing Committee Mirpur District sources told APP.\n“Participants of the protest rallies will wear black bands around their arms as a sign of hatred against India , according to the organizers of the special black day programs.\nIn Azad Jammu & Kashmir, anti-India rallies will be staged and processions will be brought out in all small and major cities including AJK’s capital city of Muzafferabad and all other nine district headquarters of Mirpur, Kotli, Bagh, Bhimbher, Palandri, Rawalakot, Haveili, Jhelum Valley and Neelam valley.",
  "retrievedAt": "2025-08-11T21:04:58.018Z"
}
