{
  "title": "Govt takes initiatives to foil propaganda of anti-state elements: Farrukh Habib",
  "link": "https://www.app.com.pk/national/govt-takes-initiatives-to-foil-propaganda-of-anti-state-elements-farrukh-habib/",
  "date_published": "2021-08-14T15:23:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Aug 14 (APP):State Minister for Information and Broadcasting Farrukh Habib on Saturday said the country was facing the fifth generation warfare and the government had taken bold and innovative initiatives to foil nefarious designs of anti-state elements.\nTalking to the media after a cake-cutting ceremony held by the Electronic Media Association (EMA) at Iqbal Stadium here, he said Pakistan had detected 3.7 million negative messages of anti-state elements circulated around the world.\nHowever, the government had taken bold steps to foil such conspiracies and took measures to project and promote pro-Pakistan trend across the globe, he added.\nHe said every Pakistani individual should aware of these negative tactics and play\nan active role to foil the international conspiracies, adding that the people should protect\nPakistan’s viewpoint regarding its sovereignty, integrity and solidarity on all forums.\nHe said the government was also striving hard to provide basic amenities to the masses at\ntheir doorsteps and in this connection,\nInsaf health cards had been provided to entire population in Khyber Pakhtunkhwa while the Punjab government had allocated Rs 600 billion to provide this facilities to all citizens across the province till the end of this year.\nResponding to a question, the state minister said that no one could be allowed to flee abroad if his name was on the Exit Control List (ECL) or he was convicted.\nHe said the Pakistan Democratic Movement (PDM) had completely failed, therefore, the opposition should concentrate on electoral reforms which were necessary to eliminate rigging.\nResponding to another question, he said Rs 4 billion had been approved for the Wasa\nFaisalabad and this amount would be used on improvement of disposal stations. Similarly,\nRs1.5 billion would be spent on replacement of old sewer lines and purchasing for\nnew machinery, he added.\nEarlier, the minister also cut a cake to celebrate the Independence Day under the aegis\nof the Electronic Media Association.\nParliamentary Secretary Labour Shakeel Shahid, Member Provincial Assembly (MPA) Chaudhary Latif Nazar and others were also present.",
  "retrievedAt": "2025-08-11T21:04:59.300Z"
}
