{
  "title": "Peace jirga urges people to shun armed groups - Pakistan - DAWN.COM",
  "author": null,
  "content": "• QPJ announces launch of joint movement for stability in Panjgur\n• Demands production of missing persons; rejects violent protests\n\nGWADAR: A Qaumi Peace Jirga (QPJ) on Sunday urged people to disassociate themselves from the ar­med groups, drug smugglers and to launch a joint struggle for restoring peace and order in Panjgur district.\n\nThe jirga was organised in Panjgur town’s main mosque jointly by all parties’ citizen action committee, traders’ committee and members of civil society against insecurity and prevailing law and order situation.\n\nSpeakers at the jirga included Citizens Action Committee Chairman Advocate Aladdin, JUI-F District Emir Hafiz Muhammad Azam, former provincial minister Ghulam Jan Baloch, BNP-Mengal Deputy Secretary General Mir Nazeer Ahmed, Mir Kafaitullah Baloch, PML-N Divisional President Ashraf Sagar, PPP Divisional General Secretary Agha Hassan Shah, Jamaat-i-Islami District Emir Hafiz Safiullah Baloch, Haq Do Tehreek leader Mullah Faryad, Haji Abdul Aziz, Shoaib Baloch and Fareed Ahmed.\n\nThey expressed deep concern over the law and order situation in Panjgur and strongly condemned the recent killing of Zeeshan Baloch, a student of Panjgur University.\n\nThey emphasised that the individuals responsible for his abduction and murder were not outsiders but belonged to the town.\n\nThey noted that such tragic incidents had been taking place because the culprits are not identified or held accountable.\n\n“If people of Panjgur do not break their silence on these incidents, the situation will deteriorate further in the coming days,” the speakers warned. They called on residents to unite against those disturbing the peace of the district.\n\nSpeaking about the missing persons, they said: “If someone is involved in a crime, he should be produced in court for punishment according to the law. We believe in peaceful struggle and not in taking weapons.”\n\nThey suggested, “We have to disassociate ourselves from armed groups for restoring permanent peace.”\n\nThe jirga will now work toward launching an organised movement for peace, they said.\n\nThe jirga concluded with a call to the authorities and law enforcement agencies to take a decisive action against armed groups responsible for disturbing peace and stability in Panjgur district.\n\nThe event was attended by a large number of people, including leaders, workers of political parties, members of civil society, and representatives of traders.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/081055584f0f2a7.jpg?r=105609",
  "retrievedAt": "2025-08-17T20:26:31.644Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924003/peace-jirga-urges-people-to-shun-armed-groups",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T00:59:55.000Z"
}
