{
  "title": "Australia rebuffs US calls to commit advance troops - World - DAWN.COM",
  "author": null,
  "content": "SYDNEY: Australia will not commit troops in advance to any conflict, Defence Industry Minister Pat Conroy said on Sunday, responding to a report that the Pentagon has pressed its ally to clarify what role it would play if the US and China went to war over Taiwan.\n\nAustralia prioritises its sovereignty and “we don’t discuss hypotheticals”, Conroy said in an interview with the Australian Broadcasting Corporation. “The decision to commit Australian troops to a conflict will be made by the government of the day, not in advance but by the government of the day,” he said.\n\nThe Financial Times reported on Saturday that Elbridge Colby, the US under-secretary of defence for policy, has been pressing Australian and Japanese officials on what they would do in a Taiwan conflict, although the US does not offer a blank cheque guarantee to defend Taiwan.\n\nColby posted on X that the Department of Defence is implementing President Donald Trump’s “America First” agenda of restoring deterrence, which includes “urging allies to step up their defence spending and other efforts related to our collective defence”.\n\nChina claims democratically governed Taiwan as its own and has not ruled out the use of force to bring Taiwan under its control. Taiwan President Lai Ching-te rejects China’s sovereignty claims, saying only Taiwan’s people can decide their future.\n\nAustralian Prime Minister Anthony Albanese, speaking in Shanghai at the start of a six-day visit to China that is likely to focus on security and trade, said Canberra did not want any change to the status quo on Taiwan.\n\nConroy said Australia was concerned about China’s military buildup of nuclear and conventional forces, and wants a balanced Indo-Pacific region where no country dominates. He said China was seeking a military base in the Pacific, which was not in Australia’s interest.\n\nGoal is no war\n\nTalisman Sabre, Australia’s largest war-fighting exercise with the United States, opened on Sunday on Sydney Harbour and will involve 40,000 troops from 19 countries, including Japan, South Korea, India, Britain, France and Canada.\n\nConroy said China’s navy might be watching the exercise to collect information, as it had done in the past.\n\nThe war games will span thousands of kilometres from Australia’s Indian Ocean territory of Christmas Island to the Coral Sea on Australia’s east coast, in a rehearsal of joint war fighting, said Vice Admiral Justin Jones, chief of joint operations for the Australian Defence Force.\n\nThe air, sea, land and space exercises over two weeks will “test our ability to move our forces into the north of Australia and operate from Australia,” Jones told reporters.\n\n“I will leave it to China to interpret what 19 friends, allies and partners wanting to operate together in the region means to them. But for me… it is nations that are in search of a common aspiration for peace, stability, a free and open Indo-Pacific,” he said.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/1310573531d7689.jpg?r=105807",
  "retrievedAt": "2025-08-17T20:26:04.575Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923998/australia-rebuffs-us-calls-to-commit-advance-troops",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T01:00:13.000Z"
}
