{
  "title": "Areas in and around Lahore declared ‘no bird zones’ for aircraft security - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The government has launched a grand operation to ensure the safety of aircraft in and around Lahore, aiming to prevent bird strikes that pose a threat to aviation.\n\nThe district administration, wildlife department and the Environment Protection Authority have been mobilised to implement strict measures in this respect. A key decision involves establishing ‘No Bird Zones’ through ‘ring fencing’ (creating an aerial safety perimeter)in various areas of Lahore.\n\nChief Minister Maryam had specifically instructed Senior Minister Marriyum Aurangzeb, who also holds portfolio of environment protection, climate change and wildlife minister, to activate Punjab’s first-ever ‘Wildlife Force’ to spearhead these efforts.\n\nA series of stringent actions will be enforced to eliminate factors attracting birds near the airport, including closure of unlicensed slaughterhouses and poultry farms operating near airports, enforcing a strict compliance of waste disposal regulations for bakeries near airports, prohibiting any businessactivity near airports that poses a risk of bird congregation, banning poultry farms, bakeries, and slaughterhouses operating without proper environmental safeguards.\n\nTanning and leather goods manufacturing companies will face strict enforcement of environmental regulations, with an immediate ban on open-air animal hide processing.\n\nScattering grains on rooftops, shrines, pigeon fancying to be banned in these zones\n\nThe dumping of garbage near airports is completely prohibited and the use of covered dustbins has been made mandatory. The wildlife rangers have received immediate orders to commence operations. Some areas, including Lahore Eastern Bypass, Manawan Hospital Dahoori Wala, PKLI, Chungi Amar Sidhu, Ichhra, and Chah Miran, have been declared ‘No Bird Zones’ and operations will begin from these locations.\n\nThe Punjab government’s notification emphasizes eliminating all reasons for large flocks of birds gathering near the airports. This includes banning the scattering of grains on rooftops and in public places, including shrines, prohibiting the rearing of pigeons and large-scale pigeon flying, and taking measures to prevent excessive bird gatherings.\n\nThe government says that Wildlife Rangers, district administration, and other relevant departments will take action against violations in accordance with the Punjab Wildlife Act. This includes potential arrests, penalties, and fines.\n\n“Bird strikes during aircraft take-off and landing, as well as low-altitude flights are a major cause of accidents,” states the Punjab government’s notification.\n\nIt highlights that according to the International Civil Aviation Organisation (ICAO) and the International Air Transport Association (IATA), over 90pc of bird strike incidents occur below 3,000 feet.\n\nMarriyum Aurangzeb termed these measures crucial for ensuring safe air travel and protecting hundreds of human lives.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/27100924c4d0e19.jpg?r=101019",
  "retrievedAt": "2025-08-17T20:25:41.608Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924038/areas-in-and-around-lahore-declared-no-bird-zones-for-aircraft-security",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T01:00:26.000Z"
}
