{
  "title": "Bitcoin tops $120,000 for the first time - World - DAWN.COM",
  "author": null,
  "content": "Bitcoin crossed the $120,000 level for the first time on Monday, marking a milestone for the world’s largest cryptocurrency as investors bet on long-sought policy wins for the industry this week.\n\nBitcoin scaled a record high of $121,207.55 in the Asian session on Monday, before pulling back slightly to last trade 1.6 per cent higher at $121,015.42.\n\nStarting today, the US House of Representatives will debate a series of bills to provide the digital asset industry with the nation’s regulatory framework it has long demanded.\n\nThose demands have resonated with US President Donald Trump, who has called himself the “crypto president” and urged policymakers to revamp rules in favour of the industry.\n\n“It’s riding a number of tailwinds at the moment,” said IG market analyst Tony Sycamore, citing strong institutional demand, expectations of further gains and support from Trump as reasons for the bullishness.\n\n“It’s been a very, very, strong move over the past six or seven days, and it’s hard to see where it stops now; it looks like it can easily have a look at the $125,000 level,” he said.\n\nThe surge in bitcoin, which is up 29pc for the year so far, has sparked a broader rally across other cryptocurrencies over the past few sessions, even in the face of Trump’s chaotic tariffs.\n\nEther, the second-largest token, scaled a more than five-month top of $3,050.90, while XRP and Solana gained about 3pc each.\n\nThe sector’s total market value has swelled to about $3.78 trillion, according to data from CoinMarketCap.\n\nEarlier this month, Washington declared the week of July 14 as “crypto week”, where members of Congress are set to vote on the Genius Act, the Clarity Act, and the Anti-CBDC Surveillance State Act.\n\nThe most significant bill is the Genius Act, which would create federal rules for stablecoins.\n\nElsewhere, prices of crypto-listed exchange-traded funds (ETFs) in Hong Kong similarly surged.\n\nSpot bitcoin ETFs launched by China AMC, Harvest and Bosera all scaled record highs, while the three ether ETFs managed by the asset managers were up roughly 2pc each.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/141107477088e58.png",
  "retrievedAt": "2025-08-17T20:25:03.382Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924124/bitcoin-tops-120000-for-the-first-time",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T06:12:00.000Z"
}
