{
  "title": "GB bans new construction near Hunza lakes, eco-senstive sites in Baltistan division - Pakistan - DAWN.COM",
  "author": null,
  "content": "Gilgit-Baltistan has imposed a moratorium on all kinds of construction and expansion of hotels on three famous lakes in Hunza, as well as in ecologically-sensitive areas in the Baltistan division, it emerged on Monday.\n\nEarlier this month, the Gilgit-Baltistan Environmental Protection Agency (GB-EPA) recommended a five-year ban on the construction and expansion of hotels on three lakes in Hunza.\n\nLast month, the GB administration imposed a fine of Rs1.5 million on a hotel for allegedly dumping sewage waste into Attabad Lake.\n\nThe development came a day after a foreign tourist and vlogger named George Buckley posted a video on his Instagram page, claiming that sewage water was being pumped out by the hotel into the Attabad Lake.\n\nA notification by the office of the Hunza Division Deputy Commissioner, dated July 11, available with Dawn.com, said, “Accordingly, issuance of any new no-objection certificates (NOCs) for construction or expansion of commercial or residential structures is hereby suspended with immediate effect and until further orders, in the following areas.”\n\nThe notification specified that no new constructions or extensions would be allowed in the Attabad and Borit lake areas, and a complete ban would be imposed on construction near the Duiker lake owing to “fragile mountain ecology and limited carrying capacity”.\n\nA separate notification by the Baltistan Division Deputy Commissioner ordered to, “Impose a region-wide moratorium on new construction of hotels/motels in ecologically-sensitive areas until full compliance with the Ecologically Sensitive and Critical Areas Rules 2023 is verified.”\n\nPreviously, in a July 4th letter addressed to the Baltistan division commissioner, the GB-EPA identified uncontrolled hotel construction activity in central Skardu and surrounding areas, Upper Kachura and Lower Kachura Lake vicinities, Hargeisa Nullah, Bashoo Nullah and Meadows, and Chook or Zookh Nullah near Kachura as areas of concern.\n\nIt also identified tourism hotspots in Shigar, Kharmang, and Ghanche districts.\n\nIn a letter addressed to the Hunza DC dated July 1, the GB-EPA recommended an “Immediate halt to new hotel constructions in central Hunza lacking proper wastewater systems and a five-year moratorium on all hotel-related construction and expansion in central Hunza, Duikar, Attabad, and Borit Lake[s]”.\n\nThe letter also called for a complete ban on construction along the banks of Borit Lake, with strict regulation of boating and its notification as an eco-tourism destination to protect its ecological function.\n\nThe recommendations state that environmental problems are becoming critical due to hotels built on the culturally important lakes of Attabad, Duiker, and Borit in central Hunza.\n\nAccording to the letter, a recent investigation into improper disposal of sewage by hotels had revealed facts of unorganised and shoddy construction and also identified shortcomings such as inadequate wastewater discharge systems and construction defects.\n\nThe report said that this unregulated and unsupervised development is compromising public health, freshwater resources, and sustainable development of the tourism sector, and is causing destruction to the ecosystem.\n\nIt further stated that the sewage disposal system of hotels is outdated, ineffective and low capacity, resulting in water channels and the Hunza River being directly polluted.\n\nThe report has disclosed that when the drinking water was tested in this poor situation, sewage contamination was confirmed, posing the risks of typhoid, dysentery and hepatitis.\n\nAccording to the report, the widespread use of diesel-powered generators by hotels is also causing air pollution, which is posing a respiratory hazard to tourists. It added that this practice is contrary to the concept of a clean, environmentally friendly place.\n\nThe report also shed light on the situation of Duiker Lake. Due to the uncontrolled construction of hotels, the environment at this lake is rapidly deteriorating.\n\nThe agency expressed fear that inadequate sewage and poor human waste disposal arrangements are damaging the fragile mountain environment of the area.\n\nThe report recommends a five-year ban on all new construction and hotel expansion around Attabad Lake to help protect water quality, maintain ecological balance, and protect it from natural disasters, especially floods and landslides, as well as ensure the constant availability of clean drinking water.\n\nThe agency recommends that boating and tourist activities in the lake should be restricted for this purpose. The report says that the lake is a protected area under Section 172 of the Forest Act 2019. It is an important habitat for migratory and endangered bird species.\n\n“However, boating activities here are creating a disturbing situation for nesting and movement of birds in this place, which is seriously damaging the international importance and ecological functions of the lake,” the letter said.\n\nThe GB-EPA called for a transition to eco-friendly, community-based tourism is urgently needed. This model ensures:\n\n“With responsible tourism policies, Hunza can become a global benchmark for sustainable mountain tourism,” the letter said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:24:35.157Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924157/gb-bans-new-construction-near-hunza-lakes-eco-senstive-sites-in-baltistan-division",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T12:01:11.000Z"
}
