{
  "title": "EU ‘holding back’ in search of tariff deal with Trump - World - DAWN.COM",
  "author": null,
  "content": "BRUSSELS: EU chief Ursula von der Leyen said on Sunday that Brussels will continue to hold off on hitting back at US steel and aluminium tariffs, as it seeks a deal to avoid broader 30 per cent levies.\n\nUS President Donald Trump on Saturday threw months of painstaking negotiations into disarray by announcing that he would hammer the 27-nation bloc with the sweeping tariffs if no agreement is reached by Aug 1.\n\n“The United States has sent us a letter with measures that would come into effect unless there is a negotiated solution, so we will therefore also extend the suspension of our countermeasures until early August,” von der Leyen told journalists.\n\n“At the same time, we will continue to prepare for the countermeasures so we’re fully prepared,” she added.\n\nThe move by von der Leyen will spur hope that Trump’s latest threat — in which he also targeted Mexico — has not killed off the progress made in negotiations so far between Brussels and Washington.\n\n27-nation bloc also announces ‘political agreement’ with Indonesia on trade deal\n\nBrussels has readied duties on US goods worth around 21 billion euros ($24 billion) in response to the levies Trump slapped on metal imports earlier this year.\n\nBut it announced in April it was holding off on those measures to give space to find a broader trade agreement with the Trump administration.\n\n‘Hand remains outstretched’\n\nEU trade ministers are set to meet on Monday in Brussels to discuss the bloc’s response to Trump’s latest move — and crucially, how strong a line to take with Washington.\n\nGermany’s finance minister Lars Klingbeil said on Sunday that “serious and solution-oriented negotiations” with the US were still necessary, but added that if they fail, the European Union would need “decisive countermeasures to protect jobs and businesses in Europe”.\n\n“Our hand remains outstretched, but we won’t accept just anything,” Klingbeil told the daily newspaper Sueddeutsche Zeitung.\n\nSince returning to the presidency in January, Trump has unleashed sweeping stop-start tariffs on allies and competitors alike, roiling financial markets and raising fears of a global economic downturn.\n\nBut his administration is coming under pressure to secure deals with trading partners after promising a flurry of agreements.\n\nSo far, US officials have only unveiled two pacts, with Britain and Vietnam, alongside temporarily lower tit-for-tat duties with China.\n\nEU-Indonesia ‘political agreement’\n\nMeanwhile, the European Commission president and Indonesian President Prabowo Subianto on Sunday announced a “political agreement” to conclude a long-awaited free trade deal.\n\n“We’re living in turbulent times, and when economic uncertainty meets geopolitical volatility, partners like us must come closer together. So today we’re taking a big step forward in this partnership,” von der Leyen told journalists in Brussels.\n\n“I am very pleased to report that we have just reached a political agreement on an ambitious Free Trade Agreement,” she said.\n\nA European Commission statement called Sunday’s agreement a “decisive milestone” towards striking the deal — which is to be concluded in September by EU trade chief Maros Sefcovic and Indonesia’s chief economic minister Airlangga Hartarto.\n\n“There’s a lot of untapped potential in our trade relationship. And therefore, this agreement comes at the right time, because the new agreement will open new markets,” von der Leyen said.\n\nPrabowo called the announcement in Brussels a “breakthrough”.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:26:55.266Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924020/eu-holding-back-in-search-of-tariff-deal-with-trump",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T00:59:49.000Z"
}
