{
  "title": "Revamped Federal Constabulary not a police force, state minister Talal Chaudhry clarifies - Pakistan - DAWN.COM",
  "author": null,
  "content": "Minister of State for Interior Talal Chaudhary on Monday stressed that the revamped Federal Constabulary (FC) was not a police force.\n\nPresident Asif Ali Zardari on Sunday promulgated an ordinance empowering the federal government to transform the FC, a border security force, into the Federal Constabulary to maintain law and order, supplement the law enforcement agencies, and address the diverse security needs in a coordinated manner.\n\nAccording to the ordinance, the Frontier Consta­bulary was originally established to maintain law and order in frontier and border areas, ensuring the security of these critical regions, and preserving public peace in remote territories. However, the changing dynamics of national security, the increasing frequency of emergencies, natural disasters, civil unrest, and other emerging threats necessitated a more adaptable and versatile force to respond to such challenges.\n\nBefore this ordinance, the use of force by the government for VIP security often attracted criticism, but now, under the name of protecting “escort”, the force can be freely used for the personal security of the elite.\n\nAddressing a press conference today in Faisalabad with FC Commandant Riaz Nazir Gara, Chaudhry said: “The Federal Constabulary will be the Federal Constabulary. No one should confuse it with the federal police.”\n\nHe said the Frontier Constabulary was being restructured and renamed only to bolster internal and national security. The minister said that the revamping was an institutional necessity to improve coordination, compensation and capability of this force across all provinces and territories.\n\n“It is purely a defence-related issue to strengthen national defence by providing support to the law enforcement agencies,” he added.\n\nHe said that the FC had played a pivotal role in maintaining peace and security within the country and along its borders for nearly a century, yet the force was not accorded the recognition and benefits comparable to other security forces in Pakistan.\n\nHe lamented that despite limited salaries and fewer privileges, FC personnel had consistently served the nation with unwavering dedication.\n\n“Now, Prime Minister Shehbaz Sharif and Federal Interior Minister Mohsin Naqvi have decided to transform FC into a federal force to address the disparity with upgraded structure and scope under the new name of Federal Constabulary,” he added.\n\nHe clarified that while the name was being changed, the identity and core function of the FC as a constabulary remained intact. “The restructuring would help ensure that its personnel receive salaries, training and benefits equal to those of other national security forces,” he added.\n\nHe said that the FC had a long role in combatting drug trafficking, smuggling and supporting civil law enforcement agencies during sensitive events such as Muharram, elections and anti-polio campaigns.\n\n“Now it will continue to carry out these responsibilities under its new federal framework,” he added.\n\nChaudhry said that with the reorganisation, the jurisdiction of the Federal Constabulary would be expanded to include all four provinces as well as Gilgit-Baltistan and Azad Jammu & Kashmir.\n\nHe said that recruitment would be opened to all citizens from across the country and the federal government would bear all operational and financial responsibilities, relieving the provinces of any budgetary burden.\n\nThe development prompted concern among opposition parties and human rights groups that it could be used as a tool of political repression.\n\nThe announcement came after the PTI said it would stage nationwide protests starting on August 5, the second anniversary of party founder Imran Khan’s arrest. Several such protests since his August 2023 arrest have turned violent, in some cases paralysing the capital Islamabad for days.\n\nPTI leader Zulfikar Bukhari said the changes should be subject to parliamentary discussion.\n\nThe new force “should not be used as a gimmick to silence political opponents, as has been previously witnessed when the government applied such laws against a large number of the PTI leadership and supporters”, he said.\n\nHis concern was echoed by Haris Khalique, secretary of the Human Rights Commission of Pakistan.\n\n“We are alarmed by the changes being made to the security and law enforcement structure of the country without any debate in parliament,” Khalique said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/14200608c98bf87.jpg",
  "retrievedAt": "2025-08-17T20:24:20.825Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924177/revamped-federal-constabulary-not-a-police-force-state-minister-talal-chaudhry-clarifies",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T15:48:52.000Z"
}
