{
  "title": "Faisal Kundi, Amir Muqam confer on KP situation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Khyber Pakhtunkhwa (KP) Governor Faisal Karim Kundi on Sunday met Pakistan Muslim League-Nawaz’s (PML-N) KP President Amir Muqam at Governor House and discussed upcoming meeting of opposition leaders in the province.\n\nAmid reports of a possible change of PTI-led government in KP, a PML-N source told Dawn that Mr Kundi has planned a meeting of opposition leaders at Governor House soon.\n\nThe Jamiat-i-Ulema-i-Islam-F (JUI-F) has opposed any change of provincial government through a presidential order, Governor’s Rule, but did not rule out a constitutional and parliamentary way like a ‘no-confidence motion’, JUI-F leader Maulana Ghafoor Haideri said on Sunday.\n\nThe source said Gover­nor Kundi and Amir Muqam discussed the possible change in KP as Prime Minister Shehbaz Sharif formed a committee to seek the support of oppo­sition leaders in the province to achieve the goal.\n\nMeanwhile, Mr Kundi visited the residence of former PTI leader and incumbent adviser to the PM Pervez Khattak to condole the death of his sister.\n\nA few days ago, the governor also met JUI-F chief Maulana Fazlur Rehman.\n\nMr Kundi also called on Prime Minister Shehbaz Sharif recently, followed by the issuance of a press release stating that the PM tasked Mr Kundi with starting a campaign to form a new government in KP and hold consultations with opposition members of the provincial assembly. Both Mr Kundi and Mr Muqam had been tasked with meeting JUI-F chief Maulana Fazlur Rehman for further consultations.\n\nLast week, Opposition Leader in the Khyber Pakh­tunkhwa Assembly Dr Ibadullah visited Governor Kundi. The meeting, which was also attended by PPP’s KP chapter president Mohammad Ali Shah Bacha, discussed overall political situation in the province.\n\nMedia reports said that Dr Ibad had briefed the governor on the ongoing coordination and mutual engagement among members of the opposition parties.\n\nThe two leaders also exchanged views on the recent outreach by independent members of the provincial assembly and discussed the upcoming Senate elections.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/6872f52a119e3.jpg",
  "retrievedAt": "2025-08-17T20:27:08.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924028/faisal-kundi-amir-muqam-confer-on-kp-situation",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T00:59:43.000Z"
}
