{
  "title": "India orders its airlines to check fuel switches on Boeing jets - World - DAWN.COM",
  "author": null,
  "content": "India on Monday ordered its airlines to examine fuel switches on several Boeing models, while South Korea said it would order a similar measure, as scrutiny intensified of fuel switch locks at the centre of an investigation into a deadly Air India crash involving a Boeing 787.\n\nThe moves by India and South Korea came despite the planemaker and the US Federal Aviation Administration telling airlines and regulators in recent days that the fuel switch locks on Boeing jets are safe.\n\nThe locks have come under scrutiny following last month’s crash of an Air India jet, which killed 260 people. A preliminary report found that the switches had almost simultaneously flipped from run position to cutoff shortly after takeoff.\n\nThe report noted a 2018 advisory from the US Federal Aviation Administration (FAA), which recommended, but did not mandate, operators of several Boeing models, including the 787, to inspect the locking feature of fuel cutoff switches to ensure they could not be moved accidentally.\n\nIndia’s Directorate General of Civil Aviation said it had issued an order to investigate locks on several Boeing models, including 787s and 737s, after several Indian and international airlines began making their own inspections of fuel switches.\n\nThe regulator oversees the world’s third-largest and fastest-growing aviation market, and its move raises the stakes for Boeing, whose aircraft are used by three of the country’s four largest airlines.\n\nA spokesperson for the South Korean transport ministry said checks there were in line with the 2018 advisory from the FAA, but did not give a timeline for them.\n\nBoeing referred Reuters’ questions to the FAA, which was not immediately available to comment outside regular hours. The company’s shares were up 1.4 per cent in US premarket trading.\n\nSome other global airlines were weighing their own inspections or had begun their own checks.\n\nIn a statement, Japan’s JAL said safety was its top priority, adding, “We are closely monitoring the investigation into the incident and will implement any necessary inspections based on its findings.”\n\nOver the weekend, Air India Group started checking the locking mechanism on the fuel switches of its Boeing 787 and 737 fleets and has discovered no problems yet, a source familiar with the matter told Reuters.\n\nAbout half the group’s 787s have been inspected and nearly all its 737s, the source added, speaking on condition of anonymity. Inspections were set to be completed in the next day or two.\n\nOn Sunday, citing a document and sources, Reuters reported that the planemaker and the FAA had privately issued notifications to airlines and regulators that the fuel switch locks on Boeing planes were safe and checks were not required.\n\nThe Air India crash preliminary report said the airline had not carried out the FAA’s suggested inspections, as the FAA’s 2018 advisory was not a mandate.\n\nIt also said maintenance records showed that the throttle control module, which includes the fuel switches, was replaced in 2019 and 2023 on the plane involved in the crash.\n\nA preliminary investigation into the crash raises additional questions about the incident, and the investigation is far from over, Air India’s CEO said in a memo on Monday.\n\nThe preliminary investigation report released by India’s Aircraft Accident Investigation Bureau (AAIB) on Saturday depicted confusion in the cockpit shortly before the crash of the Boeing.\n\nIn a staff memo reviewed by Reuters, Air India CEO Campbell Wilson said the report had “triggered a new round of speculation in the media … Unsurprisingly, it provided both greater clarity and opened additional questions”.\n\nHe added: “The preliminary report identified no cause nor made any recommendations, so I urge everyone to avoid drawing premature conclusions as the investigation is far from over.”\n\nThe memo said the preliminary report found no mechanical or maintenance faults and that all required maintenance had been carried out.\n\nThe Boeing 787 Dreamliner bound for London from the Indian city of Ahmedabad began to lose thrust and sink shortly after takeoff. All but one of the 242 people on board and 19 others on the ground were killed.\n\nAccording to the AAIB report, in the flight’s final moments, one pilot was heard on the cockpit voice recorder asking the other why he cut off the fuel.\n\n“The other pilot responded that he did not do so,” the report said. It added that the plane’s engine two fuel cutoff switches flipped almost simultaneously, but did not say how.\n\nThe preliminary report suggested no immediate action for Boeing or General Electric, whose engines were fitted on the aircraft.\n\nAirline Pilots’ Association of India (ALPA), which represents Indian pilots at the Montreal-based International Federation of Air Line Pilots’ Associations, has rejected any presumption of pilot error and called for a “fair, fact-based inquiry”.\n\n“The pilots had passed their mandatory pre-flight breathalyser and there were no observations pertaining to their medical status,” Campbell said in his memo.\n\nALPA India, another pilots’ body with 800 members, also accused the probe agency of “secrecy” surrounding the investigation, saying “suitably qualified personnel” were not involved in it.\n\n“We feel that the investigation is being driven in a direction presuming the guilt of pilots and we strongly object to this line of thought,” ALPA India president Sam Thomas said in a statement issued on Saturday.\n\nThe Indian Commercial Pilots Association (ICPA) said it was “deeply disturbed by speculative narratives … particularly the reckless and unfounded insinuation of pilot suicide”.\n\n“There is absolutely no basis for such a claim at this stage,” it said in a statement on Sunday, adding, “it is deeply insensitive to the individuals and families involved.”\n\n“To casually suggest pilot suicide without verified evidence is a gross violation of ethical reporting and a disservice to the dignity of the profession,” it said.\n\nThe ICPA was referring to a number of aviation experts suggesting engine fuel control switches can only be moved deliberately and manually.\n\nThe commanding pilot of the Air India plane was Sumeet Sabharwal, 56, who had a total flying experience of 15,638 hours and, according to the Indian government, was also an Air India instructor. His co-pilot was Clive Kunder, 32, who had 3,403 hours of total experience.\n\nAir India has come under heightened scrutiny on multiple fronts following the crash.\n\nOn July 4, the European Union Aviation Safety Agency said it would investigate budget unit Air India Express, after a Reuters report revealed the airline failed to promptly replace engine parts on an Airbus A320 as mandated, and falsified records to indicate compliance.\n\nThe US FAA and Boeing have privately issued notifications that the fuel switch locks on Boeing planes are safe, a document seen by Reuters showed, and four sources with knowledge of the matter said.\n\nThe FAA’s Continued Airworthiness Notification on July 11 came after a preliminary report into the crash, which raised questions over engine fuel cutoff switches.\n\nThe FAA’s notification to Civil Aviation Authorities, seen by Reuters, said: “although the fuel control switch design, including the locking feature, is similar on various Boeing airplane models, the FAA does not consider this issue to be an unsafe condition that would warrant an Airworthiness Directive on any Boeing airplane models, including the Model 787.”\n\nWhen asked for comment, the FAA said it did not have anything to add beyond the notification.\n\nBoeing also referred to the FAA notification in a Multi-Operator-Message sent to the airlines in the past few days, which said the planemaker is not recommending any action, two of the sources with direct knowledge said.\n\nThe preliminary investigation report into the crash referred to a 2018 FAA advisory, which recommended, but did not mandate, operators of several Boeing models, including the 787, to inspect the locking feature of the fuel cutoff switches to ensure it could not be moved accidentally.\n\nThe report said Air India had said it had not carried out the FAA’s suggested inspections, as the FAA 2018 advisory was not a mandate. But it also said maintenance records showed that the throttle control module, which includes the fuel switches, was replaced in 2019 and 2023 on the plane involved in the crash.\n\nThe report noted “all applicable airworthiness directives and alert service bulletins were complied with on the aircraft as well as engines.”\n\nALPA India, in a letter posted on X, said the preliminary investigation report referred to the 2018 FAA advisory “concerning the fuel control switch gates, which indicates a potential equipment malfunction”.\n\nTwo US safety experts said on Saturday they backed ALPA India’s request to be observers in the probe, but said the investigation report did not suggest a bias toward pilot error.\n\nJohn Cox, a pilot and former ALPA US representative, said AAIB’s report seemed objective and fair.\n\nThe Indian aviation regulator ordered Indian airlines to examine fuel switches on Boeing aircraft, including the 787 and 737 models, to check for any malfunctions in their locking mechanism.\n\nThe Directorate General of Civil Aviation said it had issued the order after several Indian and international airlines began making their own inspections of fuel switches.\n\nReuters earlier reported that Air India Group had begun inspecting fuel switches on its Boeing 787 and 737 aircraft over the weekend and had discovered no problems yet.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1417581634716e7.jpg",
  "retrievedAt": "2025-08-17T20:24:25.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924163/india-orders-its-airlines-to-check-fuel-switches-on-boeing-jets",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T13:16:27.000Z"
}
