{
  "title": "PCB includes own officials in body for scrutinising clubs - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: In a highly surprising and deviating step, the Pakistan Cricket Board (PCB), instead of forming an independent scrutiny committee, has included its own officials in a body that will start scrutinising clubs across the country.\n\nAccording to a PCB document available with Dawn, the said committee comprises director domestic cricket operations as the chairman while senior general manager domestic cricket operations, general manager domestic linkages, senior manager legal PCB and assistant manager domestic linkages are its members.\n\nMoreover, the PCB constitution about club cricket in clause No. 9 says: “Any person aggrieved by the result/decision of the scrutiny committee may file an appeal against such result/decision, before Election Commission PCB within seven days of the announcement of the scrutiny result/decision.”\n\nHowever, as there has been no functional election commission in the PCB for the last 16 months, no one can decide the appeals, if any, against the scrutiny of clubs.\n\nMoreover, natural justice demands that the election pro­c­ess be independent of PCB officials. As a tradition, no PCB officials of the past conducted the scrutiny of clubs.\n\nThe election commission, according to the PCB Constitution, is an independent department and is to be appointed by the patron.\n\nBut as currently there is no EC, the elections in Sialkot, Multan and Faisalabad reg­ions are yet to be completed.\n\nNormally, a scrutiny committee works under EC who is independent of the Board, and is appointed by the PCB patron — the prime minister.\n\nIf an EC is not appointed in near future, it is feared that the entire system of the PCB at regional, district and club level is very much likely to collapse.\n\nAccording to the Clause 29(4) of the PCB Constitution, in the first stage of the elections in districts or regions, the voting lists of clubs are to be determined by the EC.\n\nAnd if active clubs or electoral college in each district is decided by PCB officials then the entire arrangement of holding free, fair and transparent elections by an independent EC will collapse.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/151315044d5065e.jpg?r=131514",
  "retrievedAt": "2025-08-17T20:26:08.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923981/pcb-includes-own-officials-in-body-for-scrutinising-clubs",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T01:00:08.000Z"
}
