{
  "title": "‘New deadline’ douses spark of PTI protest - Pakistan - DAWN.COM",
  "author": null,
  "content": "• No plan given for Imran-announced protest; workers ask if 90-day plan has replaced Aug 5 movement\n• KP CM claims party will decide after three months ‘whether to continue with politics’\n• Days after founder eschewed talks, Gandapur claims Imran ready to sit with powers that be\n\nLAHORE: Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur seemed to throw a wrench in the works of a nationwide protest, annou­nced by PTI founder Imran Khan, which is expected to climax on Aug 5, marking two years of the former PM’s imprisonment.\n\nAt a press conference on Sunday, where party leaders were expected to announce the plan for this protest, CM Gandapur caused confusion when he came up with a new 90-day timeline for what he called ‘a final push’.\n\nFlanked by PTI leaders who had arrived in Lahore to launch their movement for the release of Imran Khan and his spouse, CM Gandapur said that the 90-day countdown had already begun.\n\nHowever, the mixed messages left party workers questioning whether this meant a postponement of the Aug 5 protest plan, or something else altogether.\n\nAt the press conference, the KP CM appeared to surprise even his party colleagues when he said, “The protest campaign had started last night and would reach its crescendo in 90 days for a final showdown”.\n\nThe KP CM did not mention any date, but when quizzed by reporters, he reiterated the party’s position that the protest campaign would be taken to its peak by Aug 5 using political means.\n\n“We have to decide within 90 days whether we should even do politics in this country… if [political means] do not lead to a result, then we will let you know about our plan of action that will come forward,” he said, adding that he had given himself three months to prepare for the protest.\n\n“We will either do or die,” the KP CM said, adding there was no use of politics in the country as “there is no politics”.\n\nDissent from Aliya\n\nPTI Punjab chief organiser Aliya Hamza Malik was conspicuous by her absence from the presser. While PTI Secretary General Salman Akram Raja explained that she was “busy”, Ms Malik questioned this claim in a subsequent tweet.\n\n“What strategy has been announced for the release of Imran Khan, how and where the protest campaign will begin? Who replaced the Aug 5 plan with 90 days?”\n\n“I myself do not know where I was busy for the past two days,” she said, in a jibe at Mr Raja.\n\nSome PTI workers also said that it appeared as if the party had let them off the hook for the Aug 5 protest. Some voices also questioned why the party leadership had yet to announce a proper plan for the movement, given that Aug 5 was just a few weeks away, and wondered whether this meant the protest plan had been postponed.\n\n‘Door open for talks’\n\nEven though the idea of dialogue was shunned in a tweet from Imran Khan’s official X account last week, the KP chief minister, apparently on behalf of the former premier, once again offered the military establishment to engage in dialogue with the party.\n\n“Now we are giving an open offer (to the establishment) to hold dialogue with us or we will get to ‘tread on our own path’ with clear timeline and targets”.\n\nHe also criticised the powers that be for indulging in politics. Reiterating that the establishment had hijacked the system, the KP CM said the PTI would hold dialogue with the powers that be and went on to add that “they can let the (puppet) politicians sit beside them”.\n\n“We no longer want to waste time talking to the ruling politicians, who carry no power to make a decision,” he added.\n\nWhile the PTI has consistently been demanding talks with the establishment, these overtures have not received a positive response from the concerned quarters thus far.\n\nThe KP CM also blamed state institutions for a spike in terrorism in Balochistan and KP.\n\n“When it is asked about making and breaking governments, it simply says the institution is apolitical,” he quipped, while asking the establishment to accept its mistakes and rectify them. He said the army was earning a ‘bad reputation’, and asked where it wanted to take the country.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:27:09.482Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924027/new-deadline-douses-spark-of-pti-protest",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T00:59:43.000Z"
}
