{
  "title": "Heavy rain lowers temperature, raises water level in Rawal, Khanpur dams - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Heavy rain lashed the twin cities of Rawalpindi and Islamabad on Sunday, bringing down the temperature and increasing the water levels in Rawal and Khanpur dams.\n\nThe rain began at 5:50pm and continued for an hour, causing the mercury to drop to 25 degrees Celsius. Residents experienced a pleasant change in the weather after the downpours.\n\nThe district administration, Water and Sanitation Agency (Wasa), Civil Defence, and Rescue 1122 remained on high alert throughout the day to deal with any emergency.\n\nThe Meteorological Department recorded 12 millimetres (mm) of rainfall at Chaklala, 7mm at Pirwadhai in Rawalpindi and 4mm at Saidpur and 9mm at Bokra in Islamabad. It forecast hot and humid weather in the country with isolated rainfall in Rawalpindi and Islamabad.\n\nMet Office says more rains expected as monsoon currents penetrating from Arabian Sea and Bay of Bengal\n\nWasa Managing Director Saleem Ashraf said that monsoon rains from June 25 to July 13 increased water level by 6.2 feet in Rawal Dam and one foot in Khanpur Dam. He expected that more rains in coming will fill the water reservoirs.\n\nHe said the current water level in Rawal Dam was 1744 feet with its maximum capacity 1952 feet. Last year, the dam filled twice during the monsoon season. Once it fills, the water is usually sufficient until the winter rains, he added.\n\nAbout Khanpur Dam, Mr Ashraf said water level in the reservoir was 1921 feet against its maximum capacity of 1982 feet. At present, its water is enough to fulfill the requirements of twin cities for 63 days.\n\nThe twin cities rely on water from three main dams: Rawal, Simly and Khanpur. Rawalpindi city and Cantonment get water from Rawal and Khanpur dams while Islamabad is supplied water from Simly and Khanpur dams. The remaining water requirements are met through tubewells.\n\nThere are more than 500 tubewells in Rawalpindi city and 200 in cantonment areas.\n\n“Water shortage will occur in cantonment areas and Islamabad in coming days if there are no more rains in the catchment areas of Khanpur and Simly dams,” said a senior official of Chaklala Cantonment Board.\n\nMeanwhile, rainwater accumulated at low lying areas in the garrison city and created slushy mess on main roads. Puddles of water were seen on the main roads and low lying areas.\n\n“Leh Nullah rose to six feet at Kattarian and five feet at Gawalmandi bridge. We have already imposed rain emergency from July to September,” said the Wasa managing director while talking to Dawn.\n\nHe said teams were on their toes to drain out rainwater. He said the teams will remain alert till July 17 as Met Office had issued a warning of more rains.\n\nA Met official said monsoon currents were penetrating into the country from Arabian Sea & Bay of Bengal. A strong westerly wave was also likely to enter upper and central parts of the country.\n\nRain-windstorm/thundershower is likely at isolated places in Khyber Pakhtunkhwa, northeast/south Balochistan, Kashmir, Islamabad, Punjab, Sindh and Gilgit-Baltistan. Isolated heavy falls are likely in Islamabad, KP, Kashmir, north-east Punjab, Potohar region and northeast Balochistan.\n\nThe Met Office warned that heavy to very heavy rains may generate flash floods in local nullahs/streams of Murree, Galliyat, Mansehra, Kohistan, Abbottabad, Buner, Chitral, Dir, Swat, Shangla, Nowshera, Swabi, Mardan, Islamabad/Rawalpindi, hill torrents in D.G Khan, northeast Punjab, Kashmir and parts of Balochistan.\n\nLandslides/mudslides may cause roads closure in the vulnerable hilly areas of KP, Murree, Galliyat, Kashmir and Gilgit-Baltistan.\n\nHeavy downpour may cause urban flood in low lying areas of Islamabad/Rawalpindi, Gujranwala, Lahore, Sialkot, Sargodha, Faisalabad, Nowshera and Peshawar.\n\nPublished in Dawn, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6874721bd1960.jpg",
  "retrievedAt": "2025-08-17T20:25:34.472Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924078/heavy-rain-lowers-temperature-raises-water-level-in-rawal-khanpur-dams",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T02:56:10.000Z"
}
