{
  "title": "Can the future be debtless? - Business - DAWN.COM",
  "author": null,
  "content": "Circular debt, which represents a persistent cycle of unpaid debts and liabilities cascading through different power sector entities and impacting the entire energy supply chain, remains one of the most stubborn challenges to Pakistan’s macroeconomic stability.\n\nThe recent power division data shows that the debt has grown to nearly Rs2.4 trillion as of March 2025, straining the power sector and putting enormous pressure on the country’s broader fiscal landscape. Past attempts to resolve circular debt, which mostly revolved around frequent upward tariff adjustments or sporadic bailout packages, have failed due to the power sector’s underlying inefficiencies.\n\nThe latest attempt involves significant resolution of circular debt stock, even if the flow remains a looming threat, through bank borrowings of Rs1.29tr, comprising Rs683 billion as the largest restructuring of power sector debt sitting on bank balance sheets and Rs612bn as the largest ever fresh “syndicated financing”.\n\nCollectively, according to the Pakistan Banks Association (PBA), this represents the largest banking transaction in Pakistan’s history, nearly 4.5 times bigger than the previous largest transaction.\n\nInitially, some of the participating banks were not happy with the deal because they had to agree to a 135 basis point reduction in their rate both for the restructured and new debt, closing the new facility to Kibor minus 90 bps. Some were unhappy because their balance sheets are suddenly laden with what they call “risky power sector debt”, as the government has decided to spread the debt among 18 banks according to the size of their share in the total bank deposits. But that is water under the bridge now.\n\nMany in the power sector and the banking industry consider the liquidation of debt as a “departure from the old cycle of borrowings and patchwork solutions”. PBA chairman Zafar Masud, who played a key role in negotiations with the government, notes that more than half of the Rs1.29tr debt is already on the banks’ books. It’s been sitting there for a while and currently lacks identifiable cash flows to support its repayment.\n\nFresh efforts tackling the recurring circular debt offer cautious optimism that might finally steer the country out of its power problems\n\n“Now cash flow in the shape of an already existing debt service surcharge (DSS) in the electricity bills will be utilised by the lending banks to recover loan repayments at source. There’ll be no new burden on consumers, and the deal will help in clearing up all the new and old debt in the next four to six years, depending on where the interest rates stand. The lower the interest rates, the quicker the payment of this debt,” he said.\n\nThe government has indeed taken some steps to control leakages, improve governance, enforce cash flow discipline, and ring-fence funds to pay the sector debt. The finance ministry’s decision to redirect the Rs3.23/kWh DSS solely towards debt reduction, rather than letting it disappear into the general pool, reflects fiscal prudence.\n\n“This time reforms go beyond temporary bailouts. There is an emerging focus on plugging systemic leakages, enforcing timely payments across the supply chain and rethinking subsidy structure to reach the vulnerable without distorting the entire revenue cycle. Enhanced governance in Discos [distribution companies] and technology-led oversight using digital monitoring tools are being rolled out to cut theft and line losses — the chronic ailments that have drained the sector for decades,” Mr Masud observes.\n\nNonetheless, he cautions, “This is not the end, only a breather. Nepra [National Electric Power Regulatory Authority] warns that average utilisation of the 45,888 MW installed generation capacity remains just 34 per cent, and even peak utilisation is a mere 56pc. Consumers continue to pay for idle capacity while distribution companies remain plagued by infrastructure decay, theft, inflated billing and dismally low recoveries.\n\nWhile the debt stock has been resolved at this point in time, the flow must stop going into the future — circular debt is not a disease in itself; it is a symptom of a broken system\n\nThis is exactly what worries most power sector experts. “We have been down this road before. In 2013, the PML-N government paid Rs480bn to clear outstanding circular debt, only for it to start accumulating again shortly after, because the root causes remained unaddressed,” Tahir Basharat Cheema, a former Pakistan Electric Power Company chief, had told this correspondent shortly after the government had begun negotiations with banks.\n\nGiving details of the deal, the PBA chief says all credit goes to Pakistan’s banking industry for demonstrating professionalism and commitment to the national economy. “Banks stepped up, taking a larger view of the economic revival, knowing that healthier power sector cash flows will reduce financial risks and unlock growth opportunities for banks themselves.”\n\nIf rates fall further, the debt repayments will accelerate, freeing up the banks’ balance sheets, releasing sovereign guarantee headroom for priority sector financing, and reviving liquidity within the power sector itself. Power companies could now gain room to invest in upgrades, efficiency, and financial discipline, while banks can redeploy freed capital into productive lending for small and medium enterprises, agriculture, green energy, and industrial revival.\n\nHowever, Mr Masud urges: “Let us be clear-eyed: the real battle is far from over. While the debt stock has been resolved at this point in time, the flow must stop going into the future. If we lose momentum, if the governance reforms stall, if privatisation of Discos remains shelved, if distribution efficiency improvements and collections falter, we will end up back where we started. Circular debt is not a disease in itself; it is a symptom of a broken system. The power sector crisis was not created overnight, nor will it be resolved overnight.”\n\nWhile challenges remain, the momentum generated by the fresh efforts offers hope that the country, grappling with the repeated energy shortages and economic pressure, might finally steer out of the recurring power debt spiral.\n\nThe success of this initiative will hinge on rigorous implementation and sustained oversight. If the current roadmap holds, there is cautious optimism that the power sector could emerge as a case study in structural turnaround rather than a perennial fiscal liability.\n\nPublished in Dawn, The Business and Finance Weekly, July 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:26:22.987Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924051/can-the-future-be-debtless",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T01:00:03.000Z"
}
