{
  "title": "Girls topmost priority in govt’s undergraduate scholarships programme: Shafqat",
  "link": "https://www.app.com.pk/national/girls-topmost-priority-in-govts-undergraduate-scholarships-programme-shafqat/",
  "date_published": "2020-03-13T03:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP):Minister for Federal Education and Professional Training Shafqat Mahmood Friday said the incumbent government is planning to allocate Rs5 billion for the undergraduate scholarships in which the girls would be given preference.\nHe said the maximum number of scholarships to girls would help increasing literacy ratio in more than half of the population of the country.\nHe was addressing to a seminar titled “Leave No Girl Behind: Scaling up What Works for Adolescent Girls in Pakistan” organized by the British High Commission (BHC) and the United Kingdom Department for International Development (DFID) in in collaboration with Idara-e-Taleem-o-Aagahi (ITA) here at Pakistan National Council of Arts (PNCA).\nThe minister pointed out that girls are facing difficulties as educational institutions in many parts of the country, are away from their houses.\n“Keeping in view the following issue, we are considering to launch evening classes especially for girls in the educational institutions,” he added.\nOn the occasion, British High Commissioner to Pakistan Dr Christian Turner said, the UK has pledged to advance at least 12 years of quality education for all the girls across the world.\nHe said Pakistan can only reach its full potential if women are given voice and a choice.\n“We will continue to build on our exemplary UK-Pakistan partnership to support girls’ education and their financial independence,” the high commissioner said.\nBaela Raza Jamil of ITA said strong evidence reveals that Siyani Sahelin is a highly scalable and accelerated programme that should reach every corner of the country for all drop out girls (from schools) to complete their education and enter the workforce equipped with certified skills and confidence.\nShe recalled that the ITA aims to tackle gender inequality for disadvantaged out of school adolescent girls (aged 9-year to 19-year) in three districts of South Punjab including Muzaffargarh, Bahawalpur and Rahim Yar Khan.\nDFID Pakistan Head Annabel Gerry added that the UK is pleased to support collective action to step up our efforts to advance girls’ education in Pakistan.\n“We believe in leading by example and building sustainable partnerships, our support so far has benefited millions of girls in primary and secondary schools in Pakistan”, she recalled.\nShe claimed that the DFID is also targeting more than 20,000 hardest to reach and the most marginalised girls in South Punjab to get the quality of education they deserve and earn livelihoods for themselves and their families.\n“Together, we can work to ensure that we #LeaveNoGirlBehind and improve the lives of girls and women in Pakistan.”\nA panel discussion was also held with participation from Country Director Population Council Dr Zeba Sathar, filmmaker and activist Sharmeen Obaid Chinoy, Kaarvan Crafts Foundation chief executive officer Danish Jabbar Khan and Shirakat Executive Director Bilquis Tahira which was moderated by Saima Anwer, Senior Education Adviser at DFID Pakistan.\nThe panelists had a consensus that although the government has outlined ambitious plans for girls’ education and empowerment, much more needs to be done as the problem is far too big and complex to tackle in organizational silos.\nSpecial Assistant to the Prime Minister on Poverty Alleviation and Social Safety Dr Sania Nishtar said participation of women in country economic and social development sectors is too low.\n“Due to this backdrop, the incumbent government allocated 50 percent of total Ehsaas programme for women and similarly 50 percent scholarships are also planned to give girls”, she said.\nBesides this, Dr Nishtar claimed, we have taken many steps for women’s development such as family planning task force, online assistance of women through provision smart phones by government, legislation for elimination of forced assiduity and others.\nOn the occasion, she lauded the Siyani Sahelian programme and highlighted the steps taken by the government in bridging gender gap and empowering girls in the country.",
  "retrievedAt": "2025-08-11T18:56:51.766Z"
}
