{
  "title": "USC announces Ramzan relief package from April 15: Umer Lodhi",
  "link": "https://www.app.com.pk/national/usc-announces-ramzan-relief-package-from-april-15-umer-lodhi/",
  "date_published": "2020-03-13T01:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP):Utility Stores Corporation (USC) Managing Director Umer Lodhi Friday announced that ‘Ramzan relief Package’ will start from April 15 at all Utility stores of the country with fixed price and available stock, where subsidy will be given over 19 essential commodities.\nTalking to private news channel, Umer Lodhi expressed that this year subsidy was increased for common people as compared to previous years and present government under the dynamic leadership of Prime Minister Imran Khan had also directed the management of all stores to devise an effective price control mechanism and ensure availability of essential daily use items during the Holy Ramazan.\nHe mentioned that Ramzan package would be applicable including sugar, wheat flour, pulses, gram flour, dry dates, rice, tea, beverages and tetra pack milk, from April 15, adding, USC was already providing subsidy on five kitchen items which will further increased in holy month.\nTo fulfill the needs of citizens,he said before the start of holy Ramazan government has planned to open more than 250 to 300 utility stores across the country which would be functional soon for the relief of middle man.\nUmer Lodhi said, all basic food items are now available on utility store outlets at fixed prices lower than the open market which will further remained continue till the month of Ramadan”.\nThe present government’s relief package was aimed at providing basic food items and commodities at subsidized rates through the country’s 4000 outlets of the Utility Stores Corporation (USC).\n“USC is committed to maintain transparency in the corporation and will provide quality items to the customers across the country, under the PM relief package”, he added.\n“There will not be shortage of food items as the situation is under control and efforts are being made to further boost up supplies by the management”, he said.\nHe said an indiscriminate crackdown should be launched on profiteers and hoarders.\nThe government will ensure price-control and check hoarding and artificial price hikes as well during the month of Ramazan, he said.\n“We are very satisfied with the arrangements so far and the people and the media would definitely appreciate our efforts,” he added.\nReplying a Question, he said 100% stocks are available in USC branches countrywide, adding, no any high price commodities were sold in any store and we are providing fixed price rate items on all USC stores.\nTo ensure smooth supply of these items, he said that inspection teams were also formed which would monitor the supply on daily basis.",
  "retrievedAt": "2025-08-11T18:56:54.674Z"
}
