{
  "title": "Pakistan’s borders with Afghanistan, Iran closed; Int’l flights to operate from Islamabad, Karachi, Lahore airports: FM",
  "link": "https://www.app.com.pk/national/pakistans-borders-with-afghanistan-iran-closed-intl-flights-to-operate-from-islamabad-karachi-lahore-airports-fm/",
  "date_published": "2020-03-13T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP):The government, in the wake of international scenario regarding coronavirus (COVID-19), on Friday decided to restrain the operation of international flights to Islamabad, Karachi and Lahore airports alone.\nThe decision was taken in an extraordinary meeting of the National Security Committee (NSC) presided over by Prime Minister Imran Khan, said Foreign Minister Makhdoom Shah Mehmood Qureshi in a statement issued here.\nHe said that the meeting besides the members of NSC was also attended by Chief Ministers and Health Ministers of all the four provinces, representatives of Azad Kashmir, Services Chiefs and the head of National Disaster Management Authority (NDMA).\nThe Foreign Minister said that the meeting as part of protective measures against COVID-19 – already declared by the World Health Organization (WHO) as pandemic, also decided to close Pakistan’s border crossings at Torkhum, Taftan, Chaman and Sost for the next 15 days.\nHe said that the government was fully cognizant of the situation and had developed a mechanism under which the Centre and Provinces were coordinating and exchanging latest information and update on the virus.\nNDMA, in coordination with its provincial offices, would lead this protective campaign to ensure a united and national level response, he added.\nThe Foreign Minister said that as Special Assistant on Health Dr. Zafar Mirza presented an action plan and the measures being taken at airports to check the threat of COVID-19, Prime Minister Imran Khan directed to formulate comprehensive plan to tackle this threat in effective way.\nDuring the meeting, he said, various decisions were also taken for limiting public gatherings including the religious congregations and the closure of schools, cinema houses and wedding halls.\nThe Foreign Minister said that Pakistani Missions and Embassies abroad have also been directed to cancel or postpone functions or ceremonies and avoid attending any gathering.\nHe said that 3,800 people, who had entered the country from Taftan border, have been quarantined and were now being allowed to travel to their respective cities and areas.\nThe Foreign Minister said that the government has also decided to import ventilators in enough quantity so as to ensure availability of the same whenever and wherever required.\nHe said that the whole nation including the country’s institutions should stand united to face the challenge.",
  "retrievedAt": "2025-08-11T18:56:48.897Z"
}
