{
  "title": "Pakistan to continue to support Kashmiris’ right to self-determination: NSA",
  "link": "https://www.app.com.pk/global/pakistan-to-continue-to-support-kashmiris-right-to-self-determination-nsa/",
  "date_published": "2021-08-06T18:00:00.000Z",
  "source": "APP",
  "content": "WASHINGTON, Aug 6 (APP): Special Assistant to PM on National Security Dr. Moeed Yusuf on Friday strongly condemned the Hindutva inspired policies of Modi government and its brutal repression of Kashmiris in the Indian Illegally Occupied Jammu and Kashmir (IIOJK),\nHe emphasized that the government of Prime Minster Imran Khan and people of Pakistan were heavily invested in getting the Kashmiri brethren their right to self-determination.\nMoeed Yusuf was speaking at a special event organized by the Embassy of Pakistan in Washington DC to observe the Youm-e-Istehsal Kashmir on the second anniversary of India’s illegal and unilateral actions of 5 August 2019 in the disputed territory of Jammu and Kashmir.\nHe expressed Pakistan’s unflinching support for the just struggle of the Kashmiri people for their inalienable right to self-determination as envisaged in the UNSC Resolutions and in accordance with the wishes of the Kashmiri people.\nDr. Moeed Yusuf said that Pakistan would continue to avail every possible political, diplomatic and legal option to achieve this objective.\nOther speakers included Dr. Asad Majeed Khan, Ambassador of Pakistan to US, Dr. Imtiaz Khan, Professor at Georgetown University, Ms. Danielle Khan, Special Assistant to Dean at Johns Hopkins School of Advanced International Studies and Col (R) Wesley Martin, Political Analyst and Human Rights Activist.\nMessages of the President and Prime Minister of Pakistan were read out on the occasion. A Special video message from President Azad Jammu and Kashmir and a short documentary highlighting the context of Indian illegal actions of 5 August 2019 were also screened.\nAmbassador Dr. Asad M. Khan lauded the role of the Pakistani and Kashmiri American community in highlighting the gross human rights violations in IIOJK and bringing the voice of innocent Kashmiris to the US government and halls of U.S. Congress.\nHe stressed upon them to continue raising their voice to sensitize the US government, the Congress and the civil society on the need for an early resolution of this grave issue.\nProfessor Imtiaz Khan and Ms. Danielle Khan expressed their sheer pain and grief over the continued torture and inhumane treatment meted to Kashmiri people in IIOJK.\nThey called upon the international community, particularly the US to take practical steps to urge India to end its human rights violations in IIOJK.\nCol Wes Martin in his remarks, drew attention towards the grave security threat posed by the Indian actions and called upon the UN Secretary General to send peace keeping Mission to IIOJK to stop Indian genocide of Kashmiris.\nHe said that history was witness to the drastic results of inaction by the international community on such genocides in the past.\nThe Embassy also arranged a photo exhibition highlighting the recent spate of Indian atrocities and massive human rights violations in the IIOJK.\nThe event was well attended by participants from diverse background, who expressed their support and solidarity for the people of IIOJK.",
  "retrievedAt": "2025-08-11T21:02:52.968Z"
}
