{
  "title": "Present govt focuses on sustainable projects: Shibli Faraz",
  "link": "https://www.app.com.pk/national/present-govt-focuses-on-sustainable-projects-shibli-faraz/",
  "date_published": "2021-08-06T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): Federal Minister for Science and Technology, Syed Shibli Faraz said that his ministry, carrying forward the vision of the present government, will play its due role to enhance the footprint of Pakistan in OIC in the field of Science and Technology to achieve greater technological and trade related benefits for Pakistan.\nThe minister was speaking during a meeting with Ambassador Rizwan Saeed (Permanent Mission of Pakistan to OIC in Jeddah) who called upon the former here on Friday.\nThe minister stated that the present government was focusing on sustainable projects which could continue to benefit people for the long term.\nThe minister reiterated the fact that it is important to establish trust elements between industry and universities to ensure technological advancement and progress.\nThe main focus of the meeting was to strengthen the role of Pakistan in matters related to technological advancements to further national interest in trade and economic benefits for the country under the platform of OIC.\nOrganization of Islamic Cooperation (OIC) is the leading Islamic Organization representing 57 Islamic Countries and thus holds a considerable trade market for Pakistan especially in African Countries.\nShibli Faraz said, “We have to spell out our priorities and take charge to push further our efforts for maximization of benefit for Pakistan.”\nHe further added, “We may emulate the Turkey model in this regard tailored according to the strengths and weaknesses of Pakistan. The Ministry intends to play its role in steering and strengthening COMSTECH.”\nAn important platform in this regard for Pakistan is the COMSTECH Standing Committee on Scientific and Technological Cooperation headed by the President of Pakistan.\nThe platform can provide an opportunity as a future instrument of trade policy as well.\nThe Ministry of Science and Technology intends to engage and play an effective role in effective utilization of COMSTECH to ensure maximum benefit for Pakistan.\nHe said that the next year, Pakistan is set to host the OIC Council of Foreign Ministers; the preparation year in this regard is thus more important for Pakistan to effectively channel utilization of the OIC for furthering trade, technological advancements and other cooperation.",
  "retrievedAt": "2025-08-11T21:02:55.204Z"
}
