{
  "title": "Over 3.02 mln voters to exercise right of franchise in general election Sunday",
  "link": "https://www.app.com.pk/national/over-3-02-mln-voters-to-exercise-right-of-franchise-in-general-election-sunday/",
  "date_published": "2021-07-23T07:29:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jul 23 (APP):Over 3.02 million registered voters both male and female in all 33 constituencies of Azad Jammu and Kashmir including 12 constituencies meant for Pakistan-based J&K refugees, would exercise their right of franchise to elect the 53 seat AJK Legislative Assembly on Sunday (July 25).\nTalking to APP, an official of AJK Election Commission Arshad Hussain Khawaja told that polling will start at 8:00 a.m. in the morning and will continue till 5:00 p.m. without any pause.\nThe registered voters shall have to produce original computerized national identity card at the polling station at the time of exercising the right to vote.\nThe Pak Army, civil armed forces with the coordination of the local law-enforcement agencies including AJK police, Punjab constabulary, KP and Frontier Constabulary have started reaching at all 45 constituencies to assist civil administration for maintaining law and order and holding of the polls in absolutely free, fair, peaceful and transparent manner.\nThe polling staff is all set to move for their respective polling stations of their duties set up across AJK and in the constituencies of refugees dwelling in all four provinces of Pakistan, the official said.\nThe AJK Election Commission has set up a control room to receive the elections results from all the district returning officers soon after the polling.\nPolice have released a fool-proof security plan, said SSP Raja Irfan Salim.\nHe said that polling stations have been set up by the AJK Election Commission in all four constituencies of Mirpur district comprising Dadayal, Chakswari, Mirpur city and Khari Shareef to facilitate over 2.40 lakh registered voters in the district.",
  "retrievedAt": "2025-08-11T20:59:50.954Z"
}
