{
  "title": "No need to panic, coronavirus situation still under control, says Zafar Mirza",
  "link": "https://www.app.com.pk/national/no-need-to-panic-coronavirus-situation-still-under-control-says-zafar-mirza/",
  "date_published": "2020-03-16T01:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP):Special Assistant to the Prime Minister on Health Dr Zafar Mirza Monday said that government has extended its emergency coronavirus measures that include travel restrictions and a ban on public gatherings to the entire country.\nTalking to private news channel, Zafar Mirza said that there was no immediate need to lockdown cities in the country as situation related to corona virus is still under control.\nHe assured the public that the current preventive measures adopted by the health ministry are sufficient to control the spread of the novel coronavirus in Pakistan, adding, however, that measures would be tightened up if the situation turns more serious.\nUnder the new emergency measures, all recreational and sporting events will be canceled or postponed, while public places like restaurants, parks are ordered to shut until corona situation is not stable.\nHe further advised public to adopt safety measures as suggested by the health experts to remain safe from the contagion.\nTalking about recent cases of Coronavirus in country, he said the number of confirmed cases of COVID-19 in Pakistan has climbed to 53 but there is no need for panic as situation is yet under control\nMirza urged upon the media to put their share of creating mass scale public awareness against pandemic effects of coro­navirus in the country.\n“Government of Pakistan is completely prepared to fight coronavirus and country has made timely and appropriate arrangements that stopped the spread of the virus. Pakistan is the last country which was affected by the virus in this region.”\nMirza said it is not only the responsibility of Health Ministry but every individual is responsible for safety, adding, the government has launched a comprehensive awareness campaign and people should have to follow the guidelines.\nThe coronavirus affects those people who have less immunity, he added.\nThe Ministry of Health deputed manpower at all the entry and exit points in Pakistan and the screening of the travelers is being carried out at airports and seaports through thermal screening, he mentioned.\nHe further said that foreign flights are restricted to operate only in major cities including Lahore, Karachi and Islamabad as aerial operations will remain suspended at other airports.\nHe said any person who has symptoms of Corona should contact with 116 helpline as ministry of health has activated a statewide public hotline for citizens or providers needing guidance regarding the novel coronavirus, or COVID-19.\nHe advised people to keep proper distance from infected people and use mask when they sneeze or cough. The president said that the war against Coronavirus was his own and personal.\nReplying a question, SAPM Zafar Mirza entailed that he had emphatically demanded for an end to the lockdown in Occupied Kashmir in the presence of Indian Prime Minister who has illegally annexed the land since more than 200 days.\n“In view of the health emergency it is imperative that all the restrictions in the disputed territory (Kashmir) must be lifted immediately, opening up communication and movement would facilitate dissemination of information, allow distribution of medical supplies and enable containment and relief efforts to proceed unimpeded,” he demanded.\nReplying another question, he said different hospitals in Punjab have been equipped with coronavirus testing and prevention kits and the cases being reported from Pakistan’s most populated province are being looked at and treated thoroughly.",
  "retrievedAt": "2025-08-11T18:57:24.265Z"
}
