{
  "title": "Coronavirus Command & Control Center starts functioning: Mirza",
  "link": "https://www.app.com.pk/national/coronavirus-command-control-center-starts-functioning-mirza/",
  "date_published": "2020-03-16T02:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP):Special Assistant to the Prime Minister on National Health Services Dr. Zafar Mirza on Monday said the Command and Control Centre for Coronavirus (COVID-19) has started functioning to have a centralized mechanism for regular sharing of information, latest updates, figures and directions on the disease.\nAddressing a press conference, Dr Zafar Mirza said so far 94 confirmed coronavirus cases had been reported from the country, while worldwide 172,000 patients were tested positive from 147 countries out of which 78,000 patients had recovered.\nHe said the government had decided to start spray to control infection in selected public and private buildings, hospitals and public places and for this purpose an advisory would be issued on the use of insecticide.\nHe said an advisory had also been issued on use of mask, and advised to avoid unnecessary use of mask, urging the citizens to come for coronavirus test only in case of high level of vulnerability like arrival from affected countries or dealing with the coronavirus patient.\nHe said the most necessary use of N95 mask was for health staff or persons with having coronavirus like symptoms, adding there was no need of use of mask by a normal person.\nHe said the role of media was important and it was decided that an effective awareness campaign would be launched on electronic, print and social media to create awareness among public about the disease by sharing public service messages with the support of Inter Services Public Relations (ISPR).\nHe asked the Ulema, political leaders, youth, teachers, students and volunteers to come forward and play their role in educating masses on prevention aspects.\nHe added that everyone should disseminate the message of social distance to avoid the disease.\nHe said the federal and provincial governments were committed to prevent the coronavirus, and were on same page for implementing a unified policy to protect Pakistan from the virus.\nDr Mirza said it had been decided to avail the services of Pakistan Rangers in smooth screening of incoming passengers at airports.\nHe said a strict vigilance was already being maintained at the airports with screening of incoming travelers and their follow up by dedicated public health teams and airport health authorities.\nHe added that an effective screening mechanism had been adopted at all Points of Entry (POE) to have a check on coronavirus patients.\nHe said there was a foolproof screening process adopted by the health officials at Taftan border for 6,000 Zaireen who were returning back from Iran.\nDr Zafar Mirza said the government had allocated 14 laboratories to provide free diagnostic facility in all major cities.\nHe added that the government had also conducted meetings with private laboratories having capability of diagnostic facility to convince them to conduct test of coronavirus on subsidize rates.\nHe said the first meeting of National Coordination Committee on Coronavirus was held to discuss plans to effectively curb the spread of disease by evaluating the situation on day to day basis.\nHe added that National Coordination Committee was constituted on the direction of Prime Minister Imran Khan.\nHe said the National Coordination Committee was responsible to implement the decisions of National Security Committee (NSC).\nHe added that decisions for closure of all educational institutions including public and private schools, universities, vocational institutions and Madaris had already made by the committee.\nHe said taking the situation as a national challenge, all possible steps were being taken to ensure implementing national action plan and for this all available resources would be utilized to protect citizens from the disease.",
  "retrievedAt": "2025-08-11T18:57:21.840Z"
}
