{
  "title": "Govt to set up ECE centers in existing primary school; 100 classrooms to enhance childhood education facilities",
  "link": "https://www.app.com.pk/national/govt-to-set-up-ece-centers-in-existing-primary-school-100-classrooms-to-enhance-childhood-education-facilities/",
  "date_published": "2024-06-01T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP): The Government of Pakistan is establishing Early Childhood Education (ECE) centres in existing primary school 100 classrooms in Islamabad to enhance early childhood education facilities and ensure quality education for young children.\nThis project aims to provide a foundation for lifelong learning by focusing on the critical early years, facilitating foundational learning and skills, said a press release here on Saturday.\nIt aligns with Sustainable Development Goals (SDG-4 and SDG-5), ensuring children are well-prepared for formal schooling. Initially, fifty urban and fifty rural areas are selected for the construction and renovation of 100 classrooms into ECE centres with appropriate furniture and materials and providing trained Montessori teachers and support staff.\nAs a result the project significantly improves educational infrastructure.\nThe initiative promotes holistic development, including physical, intellectual, emotional, social, and moral growth, which helps reduce dropout rates, improve attendance, and enhance retention. The project targets enrolling 6,000 students annually, thereby improving the early childhood education enrollment ratio and ensuring gender equality by providing equal educational opportunities for boys and girls.\nEconomically, the project creates 300 jobs, including teaching and non-teaching positions and contributes to developing a skilled and educated workforce.\nTo address ECE needs, the project will establish a total of 100 ECE classrooms with the structure of kindergartens with five ECE rooms, one activity room, and a play area in 10 urban centres, and convert 50 existing classrooms into ECE centres in rural schools.\nThe provision includes specialised Montessori teachers (PPS-05), Montessori Teacher/Aide (PPS-04), and support staff (Ayas, PPS-01), hired through Education Service Providers (ESP) or FDE.\nLearning during the early years plays a critical and formative role in acquiring concepts, developing skills and attitudes, and nurturing hidden potential, laying the foundations for lifelong learning. This period is marked by rapid physical, intellectual, emotional, social, and moral development.\nQuality early childhood care and education significantly positively impact children’s future learning, careers, and adult lives as responsible citizens. Investment in Early Childhood Education (ECE) benefits individuals, the education system, and society as a whole.\nECE is crucial for developing cognitive abilities, communication skills, creativity, problem-solving, and social skills, setting the stage for enhanced learning outcomes in subsequent grades. Children who receive ECE before enrolling in primary school exhibit lower dropout rates, improved attendance, better retention, and completion, and smoother transitions to higher educational levels.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:53:05.128Z"
}
