{
  "title": "KP governor appreciates people for always standing with Pakistan’s security force",
  "link": "https://www.app.com.pk/national/kp-governor-appreciates-people-for-always-standing-with-pakistans-security-force/",
  "date_published": "2024-06-01T18:31:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 01 (APP): Governor Khyber-Pakhtunkhwa Faisal Karim Kundi appreciated people’s vision on Saturday and termed it exemplary who always stand by and salute the courage and bravery of the security forces.\nHe expressed these remarks while addressing people at Wagah border crossing. He admired the fascinating scene of love and devotion of the country people here, who completely showed their love to motherland, dedication to the guards of the country’s borders, adding our people’s vision is exemplary who always salute the courage and bravery of the security forces,\nSector Commander Rangers Brigadier Ashfaq welcomed the KP governor on his arrival at Wagah border. According to a spokesperson for the Governor’s House, Kundi participated in the prestigious ceremony of lowering the flag on the Wagah border. He appreciated the enthusiasm of the Pakistan Rangers and the people participating in the ceremony. At the end of the ceremony, the KP governor was also briefed about border limits, security issues as per international laws.\nHe also recorded his comments in the visitor’s book at the Wagah border and also inspected the museum set there containing the culture of the four provinces of Pakistan, Gilgit-Baltistan and Azad Kashmir. He said that on the Wagah border, one could see the fascinating scene of love and devotion of the people showing their love to motherland, dedication to the guards of the country’s borders. He said our people’s vision is exemplary who always salute the courage and bravery of the security forces, Faisal Karim Kundi said that our country is our identity, adding may Allah almighty keep its glory, honor and dignity forever.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:53:03.220Z"
}
