{
  "title": "Indonesian envoy shares strategies for pluralism at ‘Jamia Dar-ul-Uloom Haqqania’",
  "link": "https://www.app.com.pk/national/indonesian-envoy-shares-strategies-for-pluralism-at-jamia-dar-ul-uloom-haqqania/",
  "date_published": "2024-06-01T18:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 01 (APP): Indonesian Chargé d’Affaires, Rahmat Hindiarta on Saturday visited Jamia Dar-ul-Uloom Haqqania to share Indonesia’s exemplary experiences in managing pluralism highlighting its approach to fostering harmony in a diverse society.\nThe session commenced with Vice Chancellor Maulana Rashid-ul-Haq Sami, accompanied by his brother Maulana Hamid-ul-Haq Haqqani, extolling Indonesia as a model of Islam.\nReflecting on his recent visit to Indonesia in November 2023 as part of the Pakistani Ulema and Scholars Delegation, Maulana Rashid emphasized, “The cleanliness and public order are intrinsic to life in Indonesia. The Indonesian people are known for their friendliness and mutual respect.”\nIn his address, the Chargé d’Affaires noted Indonesia’s status as the world’s largest Muslim-majority country, despite its distance from Islam’s birthplace in Makkah. “Indonesia comprises 17,000 islands with a population of 280 million, 87 percent of whom are Muslims. The rest are Catholic, Protestant, Hindu, Buddhist, and Confucian,” he explained to the Haqqanian students in Arabic.\nHighlighting the challenges of managing pluralism, Hindiarta underscored Indonesia’s success through the implementation of Pancasila, a foundational philosophical theory of Indonesia. He remarked, “Indonesia does not explicitly declare itself an Islamic country. However, the first principle of Pancasila is the belief in One Almighty God.” He said his visit coincided with Pancasila Day, celebrated on June 1, ever year.\nHe said Pancasila, first presented by President Sukarno on June 1, 1945, encapsulates five principles: belief in One Almighty God, just and civilized humanity, Indonesian unity, democracy guided by inner wisdom through deliberation, and social justice for all Indonesians. These principles were pivotal during the preparation for Indonesia’s independence, reflecting a commitment to a cohesive national identity amidst diversity, he maintained.\nIn response to a teacher’s query about Pakistan fostering unity among its diverse cultural and religious backgrounds, the Chargé d’Affaires expressed optimism, asserting that Pakistan could achieve stronger bonds as long as the spirit of “One Pakistan” was maintained.\nAddressing a student’s query on whether Indonesia views all religions as one, Hindiarta clarified that “Indonesia respects all religions but does not consider them the same.”\nAt the conclusion of the session, Hindiarta presented a plaque of Pancasila to signify the understanding between the Indonesian Embassy and Jamia Dar-ul-Uloom Haqqania. In return, he was presented several books authored by the late Maulana Sami-ul-Haq and his son, Maulana Rashid-ul-Haq.\nDuring the visit, Hindiarta and Third Secretary Axelsyah Miraza toured the library, mosque, classrooms, and other facilities, including the graveyard of the Jamia’s founders, enhancing the diplomatic and educational exchange between Indonesia and Pakistan.",
  "retrievedAt": "2025-08-11T02:52:41.359Z"
}
