{
  "title": "Controlling inflation, provision of employment opportunities govt’s top priorities: Masadik Malik",
  "link": "https://www.app.com.pk/national/controlling-inflation-provision-of-employment-opportunities-govts-top-priorities-masadik-malik/",
  "date_published": "2024-06-01T12:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP): Minister for Petroleum Division Dr Masadik Masood Malik on Saturday said that controlling inflation and providing employment opportunities to the people were the government’s top priorities.\nAddressing a press conference here, he said on the directives of the prime minister, maximum relief was being ensured to the masses and inflation witnessed a gradually decrease in the country. The premier has given targets to all the ministers to serve the people and reduce their burden by controlling inflation and creating job opportunities for them, he said.\nHe said factors like floods and natural calamities besides Russian-Ukrainian and Middle East conflicts caused an increase commodity cycle. However, owing to the efforts of the incumbent government and targets given by the Prime Minister, the ratio of the Consumer Price Index (CPI) has decreased from 37 per cent to 17 per cent, he said.\nSimilarly, the food inflation has also reduced from 40 per cent to 11.5 per cent adding that we were going towards stability. Prices of petroleum products have also been slashed and around Rs 25-26 per litre relief on petrol was given to the people in one month, he added.\nHe expressed the hope that inflation would further witness a down trend in the days ahead. Tractors’ purchases have also registered a 50 per cent increase while urea production recorded a 17 per cent jump in the last one year, he added.\nThe minister said the government would give a balanced and relief-oriented budget with an increase in 30 per cent increase in tax collection. The country’s exports also witnessed an increase while imports have decreased, he said.\nHe said more incentives would be given to small business and IT sectors in the budget.\nTo a question, he said the PML-N government set up power plants to generate electricity at affordable rates. They always gave preference to the State rather than their personal politics, he said.\nTo another question, he said there were always doors open in politics and his party leadership always called for reconciliation and dialogue. PML-N leadership always stressed the need for a charter of economy and democracy, he said.",
  "retrievedAt": "2025-08-11T02:53:04.757Z"
}
