{
  "title": "KP CM chairs meeting to review current situation of corona pandemic in different districts",
  "link": "https://www.app.com.pk/national/kp-cm-chairs-meeting-to-review-current-situation-of-corona-pandemic-in-different-districts/",
  "date_published": "2021-04-09T17:36:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 09 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan on Friday chaired a meeting to review the current situation of corona pandemic in different districts and healthcare capacity for treatment of corona patients in the province.\nThe meeting reviewed in detail the capacity of public sector hospitals for the treatment of COVID-19 patients with special focus on the availability of oxygen in the hospitals.\nIt was told in the meeting that at present there was no shortage of oxygen in major hospitals of the province adding that the health department was regularly monitoring the oxygen supply situation in the province and immediately necessary steps were being taken to ensure timely provision of oxygen where the demand increases.\nExpressing the grave concern over the increasing ratio of corona positive cases in the certain districts of the province, the meeting decided to ensure strict implementation of SOPs and precautionary measures to contain the further spread of pandemic in the province.\nTalking to the participants, Chief Minister appealed to the citizens to strictly follow corona SOPs and other precautionary measures especially use of face mask adding that the public cooperation was essential to efficiently deal with the current situation of corona pandemic.\nHe directed the authorities concerned to launch special campaigns regarding implementation of SOPs and precautionary measures in the districts where positivity ratio is on rise.\nBriefing about the oxygen availability situation in the major hospitals of province, it was informed that at present oxygen tank capacity in Hayatabad Medical Complex is 13,000 liters, adding that additional one tank with capacity of 6,000 liters would be provided within a week.\nSimilarly, oxygen tank capacity in Lady Reading Hospital Peshawar is 17,000 liters and one additional tank of oxygen with capacity of 8,000 liters will be ready in five days adding that 5,000 liters oxygen was also being added to the existing capacity of 3,000 liters in Mardan Medical Complex.\nIt was informed that existing oxygen tank capacity of Ayub Teaching Hospital Abbottabad was 15,000 liters adding that one current tank was being upgraded through which additional 1,000 liters would be added to the total oxygen capacity of hospital.\nThe meeting was told that the number of beds for COVID patients in public sector hospitals was being increased on need basis, during the last few weeks some 29 ICU beds, 257 HDU beds and 272 low flow beds had been added to beds reserved for COVID patients in tertiary hospitals whereas 116 ICU, 398 HDU and 840 low flow beds would be added in next weeks.\nThe meeting was informed that average positivity ratio of corona cases in the province was 15.4% adding that testing capacity has been increased to more than 8,000 tests per day.\nIn order to ensure implementation of corona SOPs, the meeting has decided to convene special meeting of Provincial Task Force against corona pandemic and a conference of Commissioners and Deputy Commissioners in next couple of days.\nOn the occasion, it was also decided in principle to install an oxygen plant to fulfill the requirement of oxygen in future in the hospitals.\nProvincial Minister for health Taimur Saleem Jhagra, Chief Secretary Dr. Kazim Niaz and high ups of health department attended the meeting.",
  "retrievedAt": "2025-08-11T20:36:35.450Z"
}
