{
  "title": "President of Niger, Pakistani envoy discuss bilateral ties",
  "link": "https://www.app.com.pk/national/president-of-niger-pakistani-envoy-discuss-bilateral-ties/",
  "date_published": "2021-04-09T15:00:00.000Z",
  "source": "APP",
  "content": "Ambassador of Pakistan Ahmed Ali Sirohey Friday held a meeting with President Republic of Niger Bazoum Mohamed and discussed matters of mutual interest.\nDuring the courtesy call in Niamey, Ambassador conveyed message of greetings and goodwill for peaceful transfer of power and his election as President of Niger, which he very warmly reciprocated.\nAmbassador of Pakistan briefly touched upon bilateral relations existing between the two countries and informed that both countries were maintaining excellent cooperation at the international and regional fora.\nHe further informed that Pakistan was cognizant of the needs of our brothers in Niger.\nIn this regard, Pakistan recently handed over gift of food assistance consisting 42,000 bags of Pakistani rice for flood affected people. Ambassador also informed him about various efforts undertaken by Pakistan Embassy Niger including; organizing bilateral meetings on various regional, International fora, promotion of trade and commercial relations, signing of MoU in the field of defence and trainings to the Nigerien security personnel and relief and food assistance program for flood affected population.\nUpon arrival at Presidency, President Bazoum Mohamed  very warmly received the Ambassador of Pakistan and asked to convey good will message to the leadership of Pakistan. President Bazoum greatly acknowledged and appreciated the role of Pakistan Embassy in enhancing bilateral cooperation in various fields. He especially thanked our leadership in assisting Niger in addressing flood affected population in their food security issues. He stressed to increase high-level interaction that will provide both countries a useful opportunity to discuss various areas of bilateral cooperation. While replying to the invitation extended to him to visit Pakistan, he stated that he will visit in the last quarter of this year. President Bazoum wished to increase Pakistan’s cooperation in various sectors including agriculture, health, education, aviation, IT, textile, tanneries, infrastructure projects, Halal meat processing and irrigation.\nAmbassador of Pakistan assured him full co-operation in disseminating information about the opportunities in above-mentioned sectors for potential Pakistani investors and Pakistani institutions.",
  "retrievedAt": "2025-08-11T20:36:40.195Z"
}
