{
  "title": "Changing a corrupt system is a long process, but still doable: PM",
  "link": "https://www.app.com.pk/national/amidst-status-quo-resistance-change-a-time-taking-but-doable-challenge-pm/",
  "date_published": "2021-04-09T08:51:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 9 (APP): Prime Minister Imran Khan Friday said that changing a corrupt system was a long process, but was still doable, despite the presence of strong status quo lobbies that resisted systemic reformation.\n“The status quo doesn’t allow change. It makes them lose their money [earned through corrupt practices]. How will they make money if they don’t resist change? This way, a whole [vicious] system is developed in the society,” the prime minister said while addressing the groundbreaking ceremony of affordable apartments for the low-income group here.\nHe was referring to the resistance faced by the government from various lobbies, and sectors, in its efforts to bring automation aimed at eliminating corruption.\nLIVE #APPNews : Prime Minister Imran Khan addressing ground breaking ceremony for construction of affordable apartments under Naya Pakistan Housing Program #Lahore @LHRDevAuthority#نیا_پاکستان_ہاؤسنگ\nhttps://t.co/ny1tPVjeC6\n— APP  (@appcsocialmedia) April 9, 2021\nPunjab Governor Chaudhry Sarwar, Chief Minister Sardar Usman Buzdar, federal and provincial cabinet members, chairman of Naya Pakistan Housing Program Lt. General (Retd) Anwar Hyder and Vice Chairman of Lahore Development Authority Imran Munir attended the event.\nUnder the LDA City project, a joint venture of Naya Pakistan Housing Authority and LDA, a total of 35,000 modern apartments would be constructed for the low-income group under Prime Minister Imran Khan’s initiative to provide housing facilities.\nIn the first phase of the project, 4000 apartments would be constructed, out of which 2000 have been allocated for the government employees getting less than Rs 50,000 per month in salary.\nIn order to ensure transparency in the project, a computerized balloting would be held soon and the Prime Minister would initially distribute allotments among the applicants selected through balloting.\nThe prime minister appreciated the Punjab chief minister, cabinet members and particularly LDA Vice Chairman Imran Munir for putting in all efforts to pave way for the mega pro-poor project.\nImagine the impact on the disenfranchised segment the brilliant Prime Minister is making!\nHonorable @ImranKhanPTI lays foundation for LDA City Naya Pakistan Apartments today. This project will provide affordable homes to 35,000 families.#RiyasateMedina#نیا_پاکستان_ہاؤسنگ pic.twitter.com/8CwpQuaUoS\n— Zartaj Gul Wazir (@zartajgulwazir) April 9, 2021\nHe said the project’s launch was impossible without the passage of foreclosure law for mortgage finance and thanked the judiciary for resolving the issue pending since years.\nImran Khan said in Pakistan, mortgage finance stood at around 0.2% against above 80pc in western countries.\nHe said the passage of the foreclosure law enabled the people without cash to buy or construct their own house. The people would be able to avail the housing finance by paying the instalments from the money they use for house rent.\nPrime Minister @ImranKhanPTI planted a sapling at groundbreaking ceremony of LDA Naya Pakistan Apartments.#نیا_پاکستان_ہاؤسنگ #Plant4Pakistan pic.twitter.com/01rJkQ4aa6\n— Prime Minister’s Office, Pakistan (@PakPMO) April 9, 2021\nThe prime minister said he had seen deteriorating the system in the country and it required a vision and commitment to change the corrupt system.\n“But it is doable as we know many countries which have transformed themselves. We will have to change ourselves if Pakistan has to meet the 21st-century challenges,” he remarked.\nHe again appreciated Imran Munir for bringing in automation to facilitate the construction sector which was booming in the country evidenced by the record cement sale last month.\nHe also appreciated Naya Pakistan Housing Authority for holding sessions with State Bank, FBR, and commercial banks to bring maximum ease for the construction sector as well as remove hassles from the housing loan process.\nImran Khan told the gathering that the construction industry supported another 30 allied industries, thus becoming a major sole source to boost the economy.\nThe prime minister also spoke high of Punjab Bank President Zafar Masood for supporting the wealth creation, like any “outstanding” banker and contrary to some typical banks which banked upon government’s deposits.\nReferring to his vision of Naya Pakistan and Madina State, the prime minister said Madina state was based on two golden principles of rule of law and humanity.\nHe said the today’s Scandinavian welfare states and others in the West were also pursuing the very noble principles.\n“Today, a full battle is going on Pakistan to make big mafias accountable before law. There are big political mafias too which are resisting the rule of law. This a defining moment of Pakistan. As we establish the writ of law, the society will liberate,” he said.\nHe said the Madina state had taken full responsibility for its poor people despite resource constraint.\nHe said the incumbent government was also trying to follow the same principles by extending universal health coverage, building Panagahs and introducing mobile kitchens for the poor.\nHe said KP government had extended Sehat Insaf Card to entire population while Punjab would also achieve the same by this yearend to make the beneficiaries avail free medical treatment of up to Rs 1 million.\nHe said even the developed countries did not have such universal health coverage.\nHe said on Sunday, he would launch an initiative of mobile kitchen to serve free of charge food to the poor people in their respective areas.\nQuoting a recently published UNDP report, the prime minister said as per the UN data, the poverty ratio had declined in KP province during last seven years while the human development index had shown a positive trend.\nMoreover, he said the government would collect data of its entire population by June which would help the government pay a direct subsidy to deserving people.\n“God willing, Pakistan is going to become a welfare state,” he hoped.\nAddressing the gathering, Chief Minister Usman Buzdar said the apartment’s scheme would be no lesser than any modern society to be equipped with all amenities including a huge park, underground electricity lines and a cricket stadium.\nHe said even after project’s completion, the LDA would be responsible for maintaining the infrastructure.\nThe chief minister said the government was on its course towards fulfilment of its commitments with the people.",
  "retrievedAt": "2025-08-11T20:36:43.889Z"
}
