{
  "title": "COVID-19 claims 105 lives, infects 5,312 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-105-lives-infects-5312-more-people/",
  "date_published": "2021-04-09T10:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 09 (APP):The national tally on Friday of total active COVID-19 cases recorded 69,811 with 5,312 more people tested positive for the deadly virus and 2,390 people recovered from the disease during the last 24 hours.\nNinety-eight corona patients have died during past 24 hours, 98 of whom were under treatment in hospital and seven out of the hospital in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 105 deaths occured during last 24 hours, 33 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 81 percent, Bahawalpur 68 percent, Gujranwala 88 percent and Lahore 79 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Rawalpindi 64 percent, Gujranwala 85 percent, Peshawar 84 percent and Gujrat 80 percent.\nAround 509 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 54,948 tests were conducted across the country on Thursday, including 9,392 in Sindh, 25,871 in Punjab, 8,090 in Khyber Pakhtunkhwa (KP), 8,711 in Islamabad Capital Territory (ICT), 1,257 in Balochistan, 467 in GB, and 1,160 in AJK.\nAround 625,789 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 710,829 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 14,069, Balochistan 20,097, GB 5,097, ICT 64,173, KP 96,128, Punjab 243,295 and Sindh 267,970.\nAbout 15,229 deaths were recorded in country since the eruption of the contagion. Around 4,521 have perished in Sindh among one of them died in hospital in past 24 hours.\n6,851 in Punjab had died with 58 deaths occured in past 24 hours. 52 of them in the hospital and six out of hospital. 2,553 in KP where 33 of them died in hospital and one out of hospital on Thursday, 597 in ICT among six of them died in hospital on Thursday, 213 in Balochistan among one of them died in hospital on Thursday, 103 in GB and 391 in AJK among five of them succumbed to the deadly virus in hospital on Thursday.\nA total of 10,639,825 corona tests have been conducted so far, while 630 hospitals are equipped with COVID facilities. Some 4,787 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:36:43.040Z"
}
