{
  "title": "Around two dozen MoUs expected in a few days as SIFC gets popular: Jilani",
  "link": "https://www.app.com.pk/national/around-two-dozen-mous-expected-in-a-few-days-as-sifc-gets-popular-jilani/",
  "date_published": "2023-09-28T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Minister for Foreign Affairs Jalil Abbas Jilani on Thursday said that around one-and-half to two dozen MoUs with different countries were expected to be signed within the next few days as the forum of Special Investment Facilitation Council (SIFC) had become popular.\nThe foreign minister, in a news conference on his return from the US visit, told the media that during the interactions with the foreign delegates including the business community on the sidelines of the UNGA session in New York, the response about the SIFC was very positive.\nHe said a delegation of the Pak-US businessmen was expected next month which was also the outcome of the SIFC’s establishment as well as the positive indicators of Pakistan’s economy.\nHe said as SIFC was focused on the promotion of agriculture, IT and mining, the country was striving to enhance its IT exports to $10 billion.\nThe foreign minister, who apprised the media about his as well as Caretaker Prime Minister Anwaar-ul-Haq Kakar’s engagements in New York rubbished the notions of rolling back the China-Pakistan Economic Corridor (CPEC).\n“The CPEC is a very transformative project. There is absolutely no question of rolling it back… I can say with 100 percent surety that you will just see progress in CPEC in the coming years. There should be no doubt about it,” he remarked.\nHe told the newsmen that apart from his address at the UNGA session, the prime minister addressed the meetings on Sustainable Development Goals, Global Development Initiative, climate change and pandemic besides holding bilateral meetings with world leaders.\nSimilarly, Foreign Minister Jilani said he also held around 20 bilateral meetings besides attending the OIC Contact Group’s meetings on Kashmir and Palestine, besides media interactions.\nTo a question, he reiterated that there had been no change in Pakistan’s foreign policy vis-a-vis Palestine and Israel as the country always advocated for the self-determination rights of the Palestinians.\nLikening the issue of Kashmir with Palestine, the foreign minister said Pakistan’s position was based on the policy of protecting its own interests as both issues involved the denial of self-determination rights.\nHe called the participation in UNGA session the “most cost-effective” way to highlight Pakistan’s position before the world under one roof and said the delegation comprised the prime minister, foreign minister, and foreign secretary.\nHe said many countries expressed their condemnations of the Islamophobic incidents which also persuaded Denmark to initiate legislation to criminalize the desecration of holy books with many other countries also mulling over a similar approach.\nThe foreign minister opposed the notion of Pakistan facing any isolation rather said that except a few, all of the foreign ministers he had met, expressed their desire to interact with Pakistan’s delegation considering the country an important player on multiple forums.\nResponding to a query, he said not only Pakistan, but the world was concerned about the terror incidents originating from Afghanistan and that the Afghan side had also committed at the trilateral forum to not allow misuse of their soil against any other country.\nAsked about the oil purchase from Russia, the foreign minister said by doing so Pakistan had not violated any sanction as many other countries were also in the trade relationship with the country.\nAbout the policy of deporting the illegal nationals, he said it was not just about the Afghan nationals but all of those from any country. He said the policy was approved by the cabinet and would be enforced strictly.\nThe foreign minister said the killing of a Khalistan leader in Canada had unmasked India with some countries also calling for a UN-led probe into the incident. He said India had been carrying out such killings in all South Asian nations and viewed that the matter of Sikh leader’s murder would not settle so easily.\nTo a question, Jilani said Pakistan was in talks with Iran side to address the impediments in the execution of the Iran-Pakistan gas pipeline project.",
  "retrievedAt": "2025-08-11T09:51:38.350Z"
}
