{
  "title": "Love, not charity; BISP is an expression of care for deprived: Chairman BISP",
  "link": "https://www.app.com.pk/national/love-not-charity-bisp-is-an-expression-of-care-for-deprived-chairman-bisp/",
  "date_published": "2023-09-28T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Chairperson Benazir Income Support Programme (BISP), Dr. Muhammad Amjad Saqib has said that BISP is a manifestation of love and care for the less fortunate members of our society.\n“BISP is about much more than providing monetary aid; it is not charity, it’s our expression of love for the deprived segments of society”, he said during a heartwarming address to a gathering of BISP employees at the BISP Auditorium Hall.\nDr. Muhammad Amjad Saqib expressed his unwavering commitment to altering the prevailing perceptions about the program.\nWhile addressing, he passionately spoke about the crucial role that education plays in uplifting individuals and society as a whole.\nHe expressed concern over the fact that millions of children in Pakistan do not have access to education and emphasized the need to change this reality.\n“Education is the real game-changer,” he stressed, underlining that it is a national, social, and religious responsibility to ensure that every child in Pakistan receives education.\nChairperson BISP called upon the BISP employees to be custodians of this noble mission and to start a movement and campaign for a reformed society.\nHe envisioned a society where every child has access to education, and where love, humanity, brotherhood, and sacrifice form the core of our values.\nDr. Muhammad Amjad Saqib acknowledged that 9.3 million families benefited from BISP’s support and the program operates on the principles of humanity, brotherhood, and responsibility.\nDespite limited resources, BISP serves as one of the largest platforms dedicated to supporting those in need. It is a blessing and a privilege to be part of this initiative, he said.\nChairperson BISP stressed that all BISP’s offices across the country must commit to creating a positive mindset and encourage families to send their children to school.\nHe urged all the stakeholders to join hands in this transformative journey toward a more inclusive, loving, and educated Pakistan.",
  "retrievedAt": "2025-08-11T09:51:35.999Z"
}
