{
  "title": "Eid Miladun Nabi to be celebrated with splendor in federal capital",
  "link": "https://www.app.com.pk/national/eid-miladun-nabi-to-be-celebrated-with-splendor-in-federal-capital-2/",
  "date_published": "2023-09-28T09:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): As the month of Rabi-ul-Awwal dawned, Pakistan has come alive with vibrant celebrations in honor of Eid Miladun Nabi, the birthday of the Holy Prophet Muhammad Peace Be Upon Him, slated for September 29.\nThe devout across the country have embarked on adorning mosques, homes, and businesses with resplendent lights, creating a captivating atmosphere. In the bustling Industrial Area, Sector I-9, industrialists have not only adorned their business establishments but also illuminated the roadsides with an array of colorful lights, lending a picturesque charm to the surroundings.\nGovernment buildings, following an annual tradition, have been aglow with radiant lights in preparation for the 12th Rabi-ul-Awwal, the date observed for this revered occasion. In recognition of the significance of Eid Miladun Nabi, both the federal and provincial governments have officially declared September 29 as a public holiday, marking it as a day of traditional and religious reverence.\nIn anticipation of the festivities, the Islamabad Capital Territory administration, Islamabad Police, and Islamabad Traffic Police have devised stringent security and traffic plans to ensure the smooth progress of rallies in the federal capital and its adjacent areas during the celebration of Eid Miladun Nabi. This proactive approach would maintain peace and security throughout the commemorations.\nSpeaking to APP, Muhammad Amir Attari, a Public Relations Officer of Dawat-e-Islami in Islamabad, shared details of the grand celebrations planned for this auspicious occasion. He disclosed that numerous rallies would be organized, commencing from various sectors and suburban areas of the federal capital, as a tribute to the Holy Prophet Muhammad Peace Be Upon Him.\nThe main march, orchestrated by Dawat-e-Islami in the federal capital, would commence from Jamea Masjid Faizan-e-Madina, Sector G-11 Markaz, following Friday Prayer. It would culminate at the same venue with Magrib Prayer, accompanied by supplications for Pakistan’s peace, progress, prosperity, security, and sovereignty.\nAmir Attari emphasized that these rallies, in commemoration of Eid Miladun Nabi, would not be confined to Pakistan alone but would resonate across the world, demonstrating heartfelt reverence for the Holy Prophet Muhammad Peace Be Upon Him under the banner of Dawat-e-Islami.\nHe also noted the substantial investment in the decoration of Faizan-e-Madina, Islamabad, with captivating lights. Furthermore, he highlighted that Mehfil-e-Milad (gatherings to celebrate the birth of the Prophet) and Seerat Conferences were being held nationwide to shed light on the exemplary life of the Holy Prophet Peace Be Upon Him and to inspire believers to follow His noble path, ultimately contributing to the betterment of humanity.\nIn addition, the Ministry of Religious Affairs and Interfaith Harmony would host the two-day 48th International Seerat-un-Nabi Conference — Practical Wisdom for Economic Prosperity in the light of Sunnah — on Rabi-ul-Awwal 11-12 (September 28-29) in the federal capital.\nMinistry’s Spokesperson Muhammad Umar Butt informed APP that renowned Ulema and religious scholars, both national and international would address the conference to highlight the multiple aspects of the Sunnah Holy Prophet Muhammad Peace Be Upon Him, besides tackling the contemporary issues confronting the Muslim Ummah.\nHe said the first day of the conference, would feature the distribution of awards for Seerat-related articles and books. The theme of current year’s competition for articles and books, was “Practical Wisdom for Economic Prosperity in the light of the Life of the Prophet Muhammad (Peace Be Upon Him),” he added.\nUmar Butt said a total of 137 books and 94 articles on the theme had been submitted to the religious ministry and after thorough review and shortlisting by a committee of at least three experts, including professors with doctorates, a high-level apex body would eventually take a final decision about their publications. He said the 66 recipients of shields, certificates, and cash prizes, would include 31 individuals receiving awards for books and 35 for articles.\nUmar Butt said the religious ministry had also planned to get standard articles on the Seerat-un-Nabi published for their placement at libraries in universities and research institutions across the country. Naat Khawan would also recite Naat during the opening session of the conference, he added.\nOn the second day, he mentioned that Ulema and scholars would highlight multiple aspects of the Holy Prophet Peace Be Upon Him’s life, particularly with reference to economic concepts, including economic stability, role of state, charity, and women participation in economy.",
  "retrievedAt": "2025-08-11T09:52:01.038Z"
}
