{
  "title": "Senate body expresses concerns about sale data on dark web",
  "link": "https://www.app.com.pk/national/senate-body-expresses-concerns-about-sale-data-on-dark-web/",
  "date_published": "2023-09-28T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): The Senate Standing Committee on Information Technology and Telecommunication Thursday expressed concerns about the sale of Pakistani public data on the Dark web and instructed the safeguarding of public data, including NADRA and banks.\nChairman of the Committee Senator Kauda Babar offered legislative support if needed for the production of data.\nThe official of the Ministry stressed the need for establishing the Computer Emergency Response Team (CERT) to combat cyber threats and called for public awareness on the cyber security in Pakistan.\nThe official also briefed the Committee on the National Cyber Security Policy (NCSP) approved in July 2021.\nSenator Afnan Ullah Khan emphasized the importance of penetration testing through ethical hacking, an important step for ensuring data protection.\nThe Committee also received a briefing from the CEO of IGNITE regarding its initiatives across the country.\nIGNITE has successfully established eight National Incubation Centers (NICs) in Pakistan, generating Rs 15 billion in revenue, creating 128 thousand jobs, and incubating over 1400 startups.\nThe Chairman of the Committee commended the IGNITE for its role in enhancing the startup ecosystem and urged the establishment of NICs in more cities, especially in Balochistan, to benefit the youth in that region.\nAdditionally, the Committee was briefed on the NTC infrastructure and services in Sindh and Balochistan. NTC, the official telecom and ICT service provider to the Government of Pakistan, manages 128 thousand connections and has established multiple data centers across the country.\nSenator Kauda Babar expressed reservations about the high rates and quality of service provided by NTC, urging improvements and offering legislative support, if needed.\nThe Chairman also lamented the delay in the installation and provision of National Mobile Roaming Services, despite the allocated funding from USF.\nHe directed to expedite the process, especially in Balochistan, to address connectivity issues faced by the people.\nThe meeting was attended by Senators Afnan Ullah Khan, Rubina Khalid, Sana Jamali, Seeme Ezdi, Sania Nishtar, Shahdat Awan, Secretary Ministry of IT and Telecommunication and CEOs of NTC and IGNITE.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:51:30.927Z"
}
