{
  "title": "19 killed as Israel razes high-rise in Gaza City - World - DAWN.COM",
  "author": null,
  "content": "• US sanctions three Palestinian human rights organisations\n• WHO chief urges Tel Aviv to stop starving people to death\n\nGAZA CITY : The Israeli military intensified its bombardment in Gaza City on Friday, demolishing a high-rise building it claimed was used by Hamas, as part of a its campaign to take over control of the area.\n\nIn a statement, the military said it had “identified significant Hamas terrorist activity within a wide variety of infrastructure sites in Gaza City, and particularly in high-rise buildings,” adding it would target those sites “in the coming days”.\n\nLess than an hour later, it announced it had struck one such building, accusing Hamas of using it “to advance and execute attacks against troops in the area.”\n\n19 killed in Gaza\n\nIsraeli strikes killed at least 19 people in and around Gaza City, an area the Israeli military is planning to conquer.\n\nCivil defence spokesman Mahmud Bassal said that attacks targeted buildings and tents sheltering displaced Gazans in various neighbourhoods and city outskirts.\n\nIsraeli Defence Minister Israel Katz vowed to intensify operations, with Israeli military spokesman Nadav Shoshani saying on Thursday that the start of the campaign to seize Gaza City will not be announced in advance to “maintain the element of surprise”.\n\nHamas video release\n\nAlso on Friday, Hamas released a video of two Israeli prisoners, with one captive saying he was being held in Gaza City. The edited video featured an exhausted-looking Guy Gilboa-Dalal, 24, who said he feared being killed by Israel’s offensive.\n\nGilboa-Dalal and Alon Ohel, who is also seen briefly in the video, is among 48 people still held by Hamas in Gaza, with 20 of them thought to be alive.\n\nUS sanctions\n\nOn the diplomatic front, the United States on Thursday imposed sanctions on three leading Palestinian human rights organisations.\n\nThe US State Department designated Al-Haq, Al Mezan Center for Human Rights, and the Palestinian Centre for Human Rights, stating they “have directly engaged in efforts by the International Criminal Court to investigate, arrest, detain, or prosecute Israeli nationals, without Israel’s consent”.\n\nThe decision drew swift condemnation. UN Human Rights Chief Volker Turk called the move “completely unacceptable,” saying the sanctions would have a “chilling effect”.\n\nWHO appeal\n\nThe World Health Organisation (WHO) chief on Friday urged Israel to stop the “catastrophe” of people starving to death in Gaza, saying at least 370 people have died from malnutrition since the war began.\n\n“This is a catastrophe that Israel could have prevented, and could stop at any time,” WHO Director-General Tedros Adhanom Ghebr­eyesus told reporters. “Starvation of civilians as a method of war is a war crime that can never be tolerated.”\n\nIsrael has denied famine, insisting the territory was suffering from a “man-made shortage engineered by Hamas”.\n\nPublished in Dawn, September 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/06075925afbd1f4.webp",
  "retrievedAt": "2025-09-06T10:14:46.479Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940061/19-killed-as-israel-razes-high-rise-in-gaza-city",
  "dateList": "2025-09-06",
  "date_published": "2025-09-05T23:52:22.000Z"
}
