{
  "title": "Trump signs order offering some tariff exemptions to countries with US trade deals - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump signed an executive order offering some tariff exemptions as soon as Monday to trading partners who strike deals on industrial exports such as nickel, gold and other metals, as well as pharmaceutical compounds and chemicals.\n\nTrump has spent his first seven months in office building up massive tariff increases to reorder the global trading system, cut US trade deficits and extract concessions from trading partner countries in negotiations.\n\nHis latest order identifies more than 45 categories for zero import tariffs from “aligned partners” who clinch framework pacts to cut Trump’s “reciprocal” tariffs and duties imposed under the Section 232 national security statute.\n\nFriday’s order brings US tariffs in line with its commitments in existing framework deals, including those with allies such as Japan and the European Union.\n\nThe exemptions for countries with US trade deals are set to begin at 12:01 a.m. EDT/0401 GMT on Monday, it said.\n\nPakistan is also among the countries that have signed trade deals with the US. Islamabad successfully negotiated a reduction in reciprocal tariffs — from 29 per cent to 19pc — after the two nations concluded a trade deal in July.\n\nThis was after Trump announced that the US had concluded a deal with Islamabad that would allow the two allies to work together on developing Pakistan’s vast oil reserves.\n\nHowever, it is not clear yet that whether Pakistan would benefit from Trump’s latest order or not.\n\nIn the order, Trump says his willingness to reduce tariffs depends on the “scope and economic value of a trading partner’s commitments to the United States in its agreement on reciprocal trade” and US national interests.\n\nThe cuts cover items that “cannot be grown, mined, or naturally produced in the United States” or produced in sufficient volume to meet domestic demand.\n\nA White House official said it also creates new carveouts for some agricultural products, aircraft and parts, and non-patented articles for use in pharmaceuticals.\n\nIn situations where a country has struck a “reciprocal” trade deal with the United States, this will allow the US Trade Representative, the Commerce Department and customs to waive tariffs on covered imports without a new executive order from Trump, the official said.\n\nThe zero-tariff items identified in the order include graphite and various forms of nickel, a key ingredient in stainless steel manufacturing and electric vehicle batteries.\n\nAlso covered are compounds used in generic pharmaceuticals, including the anesthetic lidocaine and reagents used in medical diagnostic tests.\n\nThe order encompasses various types of gold imports, from powders and leaf to bullion, a key import from Switzerland, which is struggling with US tariffs of 39 per cent as it has not yet reached a trade deal.\n\nThe order also permits tariffs to be scrapped on natural graphite, neodymium magnets, light-emitting diodes (LEDs) and eliminates previous tariff exemptions on certain plastics and polysilicon, a key component of solar panels.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/061402099e9d859.webp",
  "retrievedAt": "2025-09-19T14:28:58.852Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940163/trump-signs-order-offering-some-tariff-exemptions-to-countries-with-us-trade-deals",
  "dateList": "2025-09-06",
  "date_published": "2025-09-06T09:50:41.000Z"
}
