{
  "title": "Floods suspended train operations on five sections in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The train operations on five rail sections in Punjab have to be suspended because of the damage caused to the railway track and other infrastructure by the continuing floods and rains in the province.\n\nDue to the heavy rains and floods, which also disrupted the train operations for a short time across the country, the power distribution companies (Discos), including the Lahore Electric Supply Company (Lesco) and Gujranwala Electric Power Company (Gepco) also faced a massive loss of electricity supply infrastructure, Dawn has learnt.\n\nAccording to an internal report compiled by the Pakistan Railways (PR) and shared with Dawn, the Narowal-Sialkot section has been closed since Aug 27 after the floodwater breached a portion of the track. Moreover, a Girder Span of bridge No 7 near Aik Nullah misaligned, allowing floodwater to maintain a high level, overtopping the track.\n\nThe report says that the repair works are underway on the damaged section, which is expected to be ready for resumption of the train operation by Sept 12.\n\nThe report mentions that the Chak Jhumra-Shaheenabad (Sargodha) section was also temporarily closed for the rail traffic on the night of Aug 29, while an exceptionally high flood damaged bridge No 132 & 134 near Chiniot. The efforts are underway to repair/reconstruct the bridge to restore the train operation on this section, it adds.\n\nSimilarly, it says, the Wazirabad-Sialkot section has also closed since Sept 3 due to flooding and rain, allowing water to overtop the track between the Wazirabad–Sodhra Kopra section.\n\nAllama Iqbal Express also faced detention for two hours due to flooding. The Jhang-Shaheenabad section has also been closed following flooding in the area since Aug 28, after the flood caused breaching near Rivaz Railway Bridge over the river Chanab. The floodwater is still passing through the breached section, as the train traffic remains suspended.\n\nThe report further says that the Khanewal-Shorkot section is also closed since Sept 3, as the rail traffic was put on hold on this section due to high flood levels at Abdul Hakim Bridge No 27 at Railway km 36/10-14 and due to breaches at KM. 41/13-14, 42/13-14 & 43/01 on Sept 4 between Abdul Hakim-Darkana stations.\n\nThe flood situation has also caused temporary disruptions in the train operations at the Shahdra-Faisalabad section due to the cutting of an embankment at bridge No 10 last month. The trains are passing through this section with a restricted speed limit.\n\nThe report says that at the Lahore-Badami Bagh section, a tree fell on the track, causing the detention of Tezgam Express for 50 minutes, last month. The rail traffic also faced disruption at the Uggoki-Sialkot section last month after the floodwater overtopped the track by 12 inches, resulting in a 2-hour and 20-minute detention of the Sialkot Express.\n\nAt the Port Qasim-Bin Qasim rail section, the track faced blockage of trains for 12 hours due to a breach on both sides on Aug 20. The Kotri-Dadu section also remained blocked for three hours on Aug 20 due to boulder and mud sliding, the report adds.\n\nIt says that the Tando Adam-Hyderabad section also remained closed for freight train operations due to the accumulation of water in the Hyderabad yard for 15 hours on August 22. Likewise, the Peshawar Saddar-Cant section also remained closed for around two hours due to urban flooding in Peshawar on Aug 18.\n\nMeanwhile, Lesco is also facing damage to its supply system in various parts of its jurisdiction, which comprises Lahore, Kasur, Nankana, Okara and Sheikhupura districts.\n\nDue to the floods, as many as 67 11kV feeders were affected. Of these, 55 have been re-energised. “As many as 73,724 consumers suffered power disruptions, and of them, 13,073 are still without electricity. In Kasur and Okara, precious material (cables) and power infrastructure were affected by the floods, whereas Lahore’s various parts also faced issues.\n\n“The floods have affected our infrastructure. But our teams worked day and night to restore power supply to the flood-affected areas. Still, 17 per cent of the total 73,724 consumers are affected,” Lesco Chief Executive Officer Ramzan Butt said in a statement.\n\nThere are also reports of massive losses in the areas of Gepco, Multan Electric Power Company (Mepco) and Faisalabad Electric Supply Company (Fesco).\n\n“In Bajwat, a rural area of Sialkot, the residents of 85 villages are without electricity since Aug 26,” an official told Dawn from Sialkot on the phone.\n\nPublished in Dawn, September 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68bb5b482ed7c.gif",
  "retrievedAt": "2025-09-06T10:14:14.079Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940044/floods-suspended-train-operations-on-five-sections-in-punjab",
  "dateList": "2025-09-06",
  "date_published": "2025-09-05T23:53:52.000Z"
}
