{
  "title": "Sales of BYD cars cross 2,000 in six months - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Hub Power Company (Hubco) has disclosed that BYD has sold over 2,000 cars in less than six months, while more than 500 orders have already been placed for its Shark model. The company is currently importing completely built units (CBUs) under the normal duty regime.\n\nHubco is setting up a completely knocked down (CKD) assembly plant in Gharo with an annual production capacity of 25,000 units.\n\nAccording to a report by Asad Ali of Topline Securities, based on the company’s analyst briefing, financial close is expected in the last quarter of 2025. The project carries an estimated cost of $150 million, structured on a 60:40 debt-to-equity ratio.\n\nBoth foreign and local lenders are on board, with a term sheet already signed. Hubco expects CKD production to begin within 24 months.\n\nRegarding ownership, the company clarified that the project is a 50:50 joint venture between Hub Power Holding — a wholly owned Hubco subsidiary — and Mega Conglomerate.\n\nBYD has not taken an equity stake in the venture. Globally, BYD has pursued 100pc ownership in markets such as Thailand and Brazil, making this its first global partnership without equity participation.\n\nOn EV charging, the company noted that while chargers were initially sourced from Europe, Chinese suppliers have now made them more affordable. It added that EV charging stations become financially viable with usage of three cars per day.\n\nHubco plans to install chargers every 150-200 kilometres along the Karachi-Peshawar motorway over the next six months.\n\nSeparately, Sazgar Engineering Works Ltd plans to roll out CKD models of the TANK-500 and CANNON plug-in hybrid vehicles (PHEVs) by March 31, 2026. The company had earlier launched its first CKD PHEV — the Haval H6 1.5L — on Aug 16, 2025, according to its FY25 annual report.\n\nPublished in Dawn, September 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:14:31.957Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940066/sales-of-byd-cars-cross-2000-in-six-months",
  "dateList": "2025-09-06",
  "date_published": "2025-09-05T23:52:57.000Z"
}
