{
  "title": "Civil, military leadership pay tributes to soldiers and martyrs as nation observes 60th Defence Day - Pakistan - DAWN.COM",
  "author": null,
  "content": "The country’s top military brass, Prime Minister Shehbaz Sharif and President Asif Ali Zardari have paid glowing tributes to soldiers and martyrs from the armed forces as the nation observes the 60th Defence Day today.\n\nThe Defence Day is observed every year on September 6 to commemorate the legacy of the 1965 War, “when the Indian forces crossed international border in the darkness of night to attack Pakistan but the nation foiled [the] nefarious designs of the enemy,” a report by the state broadcaster Radio Pakistan recalled.\n\nThe report said commemoration began with a 31-gun salute in Islamabad and 21-gun salute in provincial capitals.\n\n“Special prayers were offered in mosques for the progress and prosperity of the country, and independence of Indian Illegally Occupied Jammu and Kashmir from the clutches of India,” it added.\n\nKarachi marked Defence Day with a changing of the guard at Quaid-i-Azam’s mausoleum, performed by a contingent from the Pakistan Air Force.\n\nDawnNewsTV broadcast images showing personnel marching, performing elaborate display drills, singing the national anthem and hoisting the flag at the Karachi landmark.\n\nAir Vice Marshal Shehryar Khan also attended the ceremony.\n\nIn his address broadcast on DawnNewsTV, he said: “The people and protectors of Pakistan, whether they are on the battlefield, the frontiers or in the streets of our cities, are always prepared.\n\n“The recent operation Bunyanum Marsoos brought back the memory of September 6, 1965. It proved that if our armed forces and brave people stand together, then no power can defeat us … Any act of aggression against Pakistan will be met with a befitting response. The score will not be 6-0, but, with the help of God, 60-0.”\n\nIn Lahore, a changing of the guard ceremony took place at Mazar-i-Iqbal, with Lahore Corps Commander Lieutenant General Fayyaz Hussain Shah attending as the chief guest, according to state broadcaster PTV News.\n\n“The corps commander visited Iqbal’s mausoleum, where he laid a wreath of flowers and recited the fatiha,” the report read.\n\nPTV News added that the occasion was commemorated with a 21-gun salute, as well as a gun salute by a contingent from the Pakistan Army.\n\nA statement issued by the military’s media affairs wing in relevance to the day said that on behalf of the armed forces, Chief of Army Staff Asim Munir, Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza, Chief of Naval Staff Admiral Naveed Ashraf and Chief Air Marshal Zaheer Ahmed Baber Sidhu paid tributes and “offered their deepest respect to the valiant martyrs and their families on the 60th Defence and Martyrs’ Day”.\n\n“September 6, 1965, epitomises the unflinching resolve and unshakeable spirit of the Pakistani nation. On this historic day, our brave soldiers, with the support of nation, stood like an insurmountable wall against blatant aggression, thwarting the nefarious designs of an enemy far superior in arms and numbers.\n\n“The feats of heroic valour and sacrifice left an indelible message on the sands of time, that a united nation can never be defeated,” it added.\n\nThe statement further stated that the “courage of our fearless heroes continues to inspire future generations and their legacy shall live on forever”.\n\n“Today, the nation honours and salutes its martyrs, its ghazis and their resilient families who have offered unparalleled sacrifices for the security of this great country,” it said.\n\nRecalling that the armed forces had stood resolutely against external aggression and terrorism and “have always supported the people of Pakistan in calamities and natural disasters”, it expressed their resolve to extend all-out support to people affected by the recent floods.\n\nReferring to the calamity, it said the Defence Day would be observed with “utmost humility”.\n\nThe statement further read: “Today, we reaffirm our pledge to uphold the sacred responsibility entrusted to us by the nation. Pakistan’s armed forces remain ever vigilant and prepared to defend the country against all kinds of threats. Any attempt to disrupt our hard-earned peace will be met with a befitting and decisive response.”\n\nIn separate messages ahead of Sept 6, the PM Shehbaz and President Zardari reaffirmed the nation’s commitment to safeguarding its sovereignty, countering external threats, and building a united, prosperous future.\n\nThey also recalled the 1965 War with India, noting that Pakistan’s valiant armed forces, with the full support of the people, had thwarted enemy aggression, proving that the country possesses the will and capacity to defend its independence and integrity.\n\nHighlighting the recent Oper­ation Bunyanum Marsoos, Marka-i-Haq, PM Shehbaz lauded the Pakistan Army, Navy, and Air Force for their unmatched professionalism and combat skills under the strategic leadership of Field Marshal Asim Munir.\n\nHe reaffirmed Pakistan’s commitment to peace and constructive international engagement but war­ned against ignoring the reality of continuous Indian provocations and shifting regional dynamics.\n\nExpressing solidarity with the oppressed people of occupied Kashmir, the prime minister reiterated unwavering support for their struggle for self-determination, stressing that it cannot be suppressed by force.\n\nHe also strongly condemned ongoing Israeli aggression in Palestine and urged the international community to ensure the protection of civilians and uninterrupted humanitarian aid to Gaza.\n\nIn a separate message posted on X today, the premier said Pakistan’s policy of peaceful coexistence and constructive engagement with the world, as well as the nation’s commitment to strengthening and modernising defence capabilities.\n\nHe added: “National defence is inseparable from economic stability. Only by rising above personal differences and working for the collective good can we achieve lasting prosperity and self-reliance.”\n\nEarlier, President Zardari, in his message, paid tribute to the valiant sacrifices of the nation’s armed forces and reaffirmed Pakistan’s unwavering commitment to its defence and sovereignty.\n\nHe described September 6 as a glorious chapter in the country’s history and emphasised that the spirit of sacrifice from the 1965 War continued to serve as a guiding light for future generations.\n\nThe president highlighted the significance of this year’s Defence Day in light of the recent Operation Bunyanum Marsoos conducted in May 2025 against India.\n\n“Just as our courageous forces demonstrated extraordinary valor and dedication in 1965, our sons once again proved their unmatched bravery during this year’s operation,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/06134249a4753eb.webp",
  "retrievedAt": "2025-09-06T10:13:46.319Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940142/civil-military-leadership-pay-tributes-to-soldiers-and-martyrs-as-nation-observes-60th-defence-day",
  "dateList": "2025-09-06",
  "date_published": "2025-09-06T05:58:25.000Z"
}
