{
  "title": "US Navy SEALs botched secret 2019 mission in North Korea: report - World - DAWN.COM",
  "author": null,
  "content": "Elite United States Navy SEALs launched an audacious operation in 2019 to plant a listening device in North Korea to spy on the country’s reclusive leader, Kim Jong Un, The New York Times (NYT) reported on Friday, but the mission quickly unravelled and culminated in the deaths of multiple civilians.\n\nThe operation came in the first administration of US President Donald Trump during sensitive nuclear talks with Kim, whom the US leader met three times.\n\nThe mission was considered so risky that it required direct presidential approval, the NYT said, but Trump insisted on Friday he had no knowledge of the operation.\n\n“I don’t know anything about it. I’m hearing it now for the first time,” the president told journalists.\n\nDespite months of practice, the mission still went horribly wrong, the * NYT* reported.\n\nThe SEALs — from the same unit that killed Osama bin Laden in 2011 — approached North Korea in mini-submarines that exposed them to frigid water for hours, then swam ashore, according to the newspaper, which interviewed two dozen people to piece together the account.\n\nThe special forces personnel thought they were alone, but didn’t see a small boat in the area. The boat later approached the mini-subs, with the crew carrying flashlights. One person jumped into the water.\n\nThinking the mission was compromised, the senior enlisted SEAL ashore opened fire on the boat, as did the others with him. When they reached the boat, they found two or three bodies, but no guns or uniforms: the dead were apparently civilians who were diving for shellfish.\n\nThe SEALs used knives to puncture the lungs of the boat’s crew so the bodies would sink, and were able to escape unharmed.\n\nThe NYT said the operation prompted a series of military reviews that found the killings were justified. The results of the reviews were classified, and key congressional leaders were kept in the dark.\n\nWhile the failed mission did not create a major international crisis, it easily could have, and the incident highlights both the impunity and secrecy under which America’s elite forces operate around the globe.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/06191433ed04082.webp",
  "retrievedAt": "2025-09-19T14:29:02.480Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940199/us-navy-seals-botched-secret-2019-mission-in-north-korea-report",
  "dateList": "2025-09-06",
  "date_published": "2025-09-06T14:23:27.000Z"
}
