{
  "title": "PML-N withdraws support to mayor Karachi after tensions boil over in KMC - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Parliamentary party leader announces joining opposition in City Council\n• Criticises civic body for ‘not resolving’ city’s problems, says ‘N-PPP’ alliance to continue at federal level\n• Calls on JI to discuss no-confidence motion against mayor\n• Move unlikely to threaten Murtaza Wahab’s position as numbers still in his favour\n\nKARACHI: The Pakistan Muslim League-Nawaz (PML-N) on Friday formally announced its decision to withdraw support from the Pakistan Peoples’ Party (PPP)-led local government set-up and Karachi Mayor Murtaza Wahab, citing his ‘poor’ performance, unfulfilled commitments and their exclusion from key administrative processes as the reason for the critical move.\n\nSpeaking at a press conference, PML-N parliamentary party leader in the City Council Feroz Khan strongly criticised the PPP for what he described as a “complete betrayal of promises” made prior to the mayoral election.\n\nWith 14 members in the City Council, the PML-N leader lamented that despite voting in favour of the PPP candidate for mayor — a decision influenced by their alliance at the Centre — the party was sidelined in key decisions and governance matters in Karachi. “There was a clear understanding between our leaderships, but that agreement was never honoured once Murtaza Wahab assumed the office,” he claimed.\n\nMr Khan clarified that while the PML-N remained in alliance with the PPP at the federal level, the situation in Karachi had reached a “tipping point”. “The dynamics in the Centre are different, but locally, the party cannot be part of a government that ignores our mandate, excludes us from governance, and fails to deliver on public issues.”\n\nHe added that the party’s decision to move to the opposition benches in the City Council was made after consultations with senior party leadership.\n\nHours after the press conference, Mr Khan along with other party members of the City Council reached out to the Jamaat-i-Islami, signalling a political realignment in the City Council.\n\nA PML-N delegation visited the office of the JI’s Idara Noor-i-Haq and met City Council Opposition Leader Advocate Saifuddin. The two sides discussed various options, including the possibility of a no-confidence move against Mayor Wahab.\n\nWith 130 members, the JI is the second largest group in the City Council. However, a potential alliance between the PML-N and JI would unlikely threaten Mayor Wahab’s position, as he holds a simple majority in the City Council with support from over two dozen PTI dissidents, in addition to his party’s 155 members and some others.\n\nAt the press conference, the PML-N leader strongly criticised the mayor and the Karachi Metropolitan Corporation (KMC) for what he termed their “abysmal” performance in resolving the city’s civic problems.\n\nHe pointed to mounting piles of garbage across major neighbourhoods, calling them a clear sign of neglect and administrative failure by the city authorities.\n\n“The people of Karachi are being forced to live in unacceptable conditions while the KMC continues to make hollow claims,” he said, demanding immediate action and accountability from the city’s leadership.\n\n“When the PPP needed our support to elect Murtaza Wahab as mayor, they promised the moon. But after securing the seat, they forgot every commitment made to us. This is not just political opportunism it is a breach of trust.”\n\nHe said that the PML-N had high hopes that the alliance would deliver on promises to address Karachi’s pressing problems, but instead, the PPP’s city administration reduced itself to “photo sessions and press statements” with no tangible improvement on the ground.\n\n“Mian Nawaz Sharif’s vision was to restore Karachi as the city of lights, a city that drives Pakistan’s economy and represents its diversity. Unfortunately, that vision is not being respected by those currently in charge of the city,” he added.\n\n“We took this step after months of patience and repeated attempts to get our concerns addressed. This is not a hasty decision; it is a necessary one for the people of Karachi and for the credibility of our party,” he added.\n\nThe PML-N leader emphasised that the party would now play the role of a “constructive opposition” in the City Council.\n\n“We will not obstruct for the sake of opposition. Our goal is to ensure that the people of Karachi are served. We will raise every public issue and hold the city administration accountable,” he added.\n\nPublished in Dawn, September 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:14:13.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939997/pml-n-withdraws-support-to-mayor-karachi-after-tensions-boil-over-in-kmc",
  "dateList": "2025-09-06",
  "date_published": "2025-09-05T23:53:44.000Z"
}
