{
  "title": "Submarine cable damage may degrade internet services during peak hours: PTCL - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan Telecommunications Limited (PTCL) announced on Saturday that cuts to submarine internet cables in Saudi waters may impact internet services in the country during peak hours.\n\nIn a statement shared on X, the telecom giant said the submarine cable cuts near Saudi capital Jeddah had impacted the partial bandwidth capacity SMW4 (South Asia-Middle East-West Asia) and IMEWE (India-Middle East-Western Europe) networks.\n\n“Internet users in Pakistan may experience some service degradation during peak hours,” the PTCL statement read. “Our international partners are working on priority to resolve the issue while our local teams are actively arranging alternative bandwidth to minimise the impact.”\n\nThe Ministry of Information Technology has not issued any statement on the development yet.\n\nThis is not the first time that damage to undersea internet cables has affected services in Pakistan.\n\nInternet users across Pakistan complained of slow internet and hindered access to services throughout 2024. On January 3 this year, PTCL said teams were “diligently” working to resolve the matter of disruptions faced by users after a fault in the AAE-1 subsea internet cable connecting Pakistan slowed down the network speed in the country.\n\nOn January 16, PTCL announced that internet services were “now fully operational” after the complete restoration of the Asia-Africa-Europe-1 (AAE-1) undersea internet cable.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:13:46.509Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940154/submarine-cable-damage-may-degrade-internet-services-during-peak-hours-ptcl",
  "dateList": "2025-09-06",
  "date_published": "2025-09-06T08:15:43.000Z"
}
