{
  "title": "Indian PM Modi says ties with US still ‘very positive’ - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi said on Saturday that New Delhi and Washington still shared “very positive” ties, after US President Donald Trump reaffirmed their personal friendship and downplayed his earlier remarks about “losing India” to China.\n\nThe exchange comes amid strains after Washington imposed tariffs of up to 50 per cent on Indian imports, accusing New Dehli of fuelling Moscow’s deadly attacks on Ukraine by purchasing Russian oil.\n\nBut Trump and Modi, both right-wing populists, have shared a strong bond since the US president’s first term.\n\n“Deeply appreciate and fully reciprocate President Trump’s sentiments and positive assessment of our ties,” Modi wrote on X, adding that India and the United States shared a “very positive and forward-looking comprehensive and global strategic partnership”.\n\nEarlier, Trump told reporters that he “will always be friends with Modi”.\n\n“India and the United States have a special relationship. There is nothing to worry about,” Trump said, downplaying his earlier remarks about “losing India” to China.\n\nLast week, Modi visited China to attend a gathering of the Shanghai Cooperation Organisation, his first visit to the country in seven years signalling a thaw between the two Asian powers.\n\nTrump has appeared irritated at New Delhi as he seeks credit for what he said was Nobel Prize-worthy diplomacy for brokering peace between Pakistan and India following the worst conflict in decades between the nuclear-armed neighbours in May.\n\nIndia, which adamantly rejects any third-party mediation on the Kashmir issue, has since given the cold shoulder to Trump.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/06115229ed0f448.webp",
  "retrievedAt": "2025-09-06T10:13:42.969Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940148/indian-pm-modi-says-ties-with-us-still-very-positive",
  "dateList": "2025-09-06",
  "date_published": "2025-09-06T07:00:21.000Z"
}
