{
  "title": "Bilawal sees ‘agriculture emergency’ in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Seeks loan, electricity bill waivers for flood-hit farmers\n• Says PM has assured him of help for affected people\n• Accuses India of violating Indus treaty by withholding flood data\n\nKASUR: As floods continue to batter Punjab and severely impact farmers, PPP Chairman Bilawal Bhutto-Zardari on Thursday urged both the federal and provincial governments to declare an agricultural emergency in the province.\n\nThe PPP leader visited the flood-hit Talwar Post in Kasur, on the border with India, met affected families and later spoke to the media.\n\nAccording to statement, Mr Bhutto-Zardari also telephoned Prime Minister Shehbaz Sharif and briefed him on the problems being faced by farmers across Punjab.\n\nHe told the premier that the floods had caused severe damage to the agriculture sector and said the Centre must play its role in helping farmers.\n\nAccording to a readout of the call issued by the PPP, PM Shehbaz assured Mr Bhutto-Zardari that the government would take all possible steps to help the disaster-stricken farmers of Punjab.\n\nThe PPP leader also demanded that electricity bills of farmers in disaster-hit districts be waived, while the repayment of agricultural loans should either be delayed or written off.\n\nHe also proposed cash transfers to the affected farmers through the Benazir Income Support Programme (BISP), as was done in the wake of previous floods.\n\nIn the aftermath of the catastrophic floods in 2010 and 2011, the government had partnered with international donors to roll out cash grant programmes through the Watan Card and Pakistan Card schemes.\n\nTheir success was eventually replicated with the BISP programme, which has since won international acclaim for its effectiveness in augmenting poverty alleviation efforts.\n\nIn Kasur, the PPP chairman heard the grievances of farmers and stressed that the federal and provincial governments should work together to provide relief to the affected people.\n\nThe PPP will stand with the provincial government during the relief and reconstruction phases, he said, adding that no single government can cope with a calamity of this scale. Speaking at Talwar Post, Mr Bhutto-Zardari accused India of violating the Indus Waters Treaty (IWT) and withholding flood-related information from Pakistan.\n\nHe said that in doing so, India had forgotten basic humanity.\n\nMr Bhutto-Zardari praised Punjab Chief Minister Maryam Nawaz for making efforts to provide relief to people displaced by the floods, and stressed the need to stand shoulder to shoulder with farmers.\n\nThe PPP chairman also directed his party workers to take an active part in relief activities and assured the affected families that his party would not abandon them.\n\nMr Bhutto-Zardari was received by senior PPP leader Chaudhry Manzoor Ahmed during his visit to Kasur. The PPP chairman was accompanied by Punjab Governor Sardar Saleem Haider, former National Assembly speaker Raja Pervaiz Ashraf, Hasan Murtaza, Nadeem Afzal Chan and Qamar Zaman Kaira.\n\nPublished in Dawn, September 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68bb6b3d74c9f.jpg",
  "retrievedAt": "2025-09-06T10:14:46.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940088/bilawal-sees-agriculture-emergency-in-punjab",
  "dateList": "2025-09-06",
  "date_published": "2025-09-05T23:52:17.000Z"
}
