{
  "title": "NCSW calls for standardising minimum marriage age across Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: National Commission on the Status of Women (NCSW), in collaboration with UNFPA and Legal Aid Society, convened a consultation on Friday to address the pressing issue of child marriage in Pakistan.\n\nOpening the session, Ume Laila Azhar, who is NCSW chairperson, stressed the urgent need to standardise the minimum age of marriage across Pakistan, highlighting persistent gaps in the implementation despite Sindh pioneering law.\n\nKey insights were shared by government representatives, law enforcement, civil society and community stakeholders emphasising on more female station house officer (SHOs) and specialised training for handling child marriage cases.\n\nReforms in nikah registration through digitisation and mandatory CNIC verification were also emphasised by participants. Among other demands was on strengthening Sindh Child Protection Authority’s role with resources and awareness. Participants also emphasised on government ownership to ensure sustainability and real improvements.\n\nShaheena Sher Ali, who is Minister Women’s Development Department Sindh, reaffirmed strong government commitment, stating, “We have been personally taking on cases of child marriage, abuse, and abduction, and we know firsthand challenges survivors face.”\n\nThe consultation concluded with a joint call to action on strengthening CMRA implementation, scaling up community awareness, engaging religious leaders, and ensuring coordinated government and civil society efforts. Participants stressed on wearing team jackets to protect the rights of girls and ensure a safer future for every child.\n\nPublished in Dawn, September 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:14:14.211Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940010/ncsw-calls-for-standardising-minimum-marriage-age-across-pakistan",
  "dateList": "2025-09-06",
  "date_published": "2025-09-05T23:53:58.000Z"
}
