{
  "title": "Asia Cup: Pakistan gearing up for India rematch, says captain Salman Agha - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan captain Salman Agha said his team were ready to face India in the next round of the Asia Cup on Sunday after last week’s group-stage match between the arch-rivals ended in acrimony when the Indian side refused to shake hands.\n\nPakistan beat United Arab Emirates in their final Group A game on Wednesday to advance to the Super Fours stage, where they will also play two teams from Group B in a round robin format.\n\nBilateral cricket between India and Pakistan has been suspended since 2013, and they play each other only in multi-team tournaments.\n\n“We are ready, we are ready for any challenge,” Salman said after their 41-run victory against UAE.\n\n“We just want to play good cricket. If we play good cricket, like we have played in the last few months, I think we’ll be good against any side.”\n\nFakhar Zaman made 50, but Pakistan’s frontline batters disappointed against the UAE’s modest attack, with opener Saim Ayub falling for his third successive duck in the tournament.\n\nSalman acknowledged they had to bat better.\n\n“We got the job done, but we still need to improve our batting in the middle order,” Salman said.\n\n“That’s been a concern and something we need to work on.”\n\nIndia had cruised to a seven-wicket victory over Pakistan last weekend in the first cricket match between the sides since a four-day military conflict between the nuclear-armed neighbours in May.\n\nWhile the match itself passed without incident, there was no shaking of hands between the captains at the toss or among the players at the end. India skipper Suryakumar Yadav dedicated their victory to the armed forces back home, which was seen as politicisation of the game.\n\nThe Pakistan Cricket Board (PCB) called for match referee Andy Pycroft’s immediate removal for a code of conduct “violation” and considered withdrawing from the tournament before going ahead with Wednesday’s match. The board alleged that Pycroft told Pakistan skipper Salman Ali Agha not to shake hands with Indian counterpart Suryakumar Yadav before the match.\n\nThe matter was settled after the PCB said ahead of yesterday’s match that Pycroft had apologised to the manager and captain of the Green Shirts over a controversy during the recent Pakistan-India match.\n\nIndia and Pakistan could meet for a third time at the tournament if they both reach the September 28 final.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:29:12.467Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942884/asia-cup-pakistan-gearing-up-for-india-rematch-says-captain-salman-agha",
  "dateList": "2025-09-06",
  "date_published": "2025-09-18T07:33:10.000Z"
}
