{
  "title": "Mohsin Naqvi praises Mianwali Police for eliminating 10 extremist terrorists",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-praises-mianwali-police-for-eliminating-10-extremist-terrorists/",
  "date_published": "2024-10-25T05:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Interior Minister Mohsin Naqvi has praised the brave efforts of Mianwali Police for their successful operation that resulted in the elimination of 10 extremist terrorists in the Mianwali district on Friday.\nThe police action was described as a major blow to terrorist activities in the region and a testament to the courage and efficiency of Punjab’s law enforcement agencies.\nIn an official statement, Minister Naqvi commended the District Police Officer (DPO) of Mianwali, Akhtar Farooq, along with his entire police team, for their exceptional performance in thwarting what could have been a devastating attack by the terrorists. The operation, which was carried out in a strategic and daring manner, successfully neutralized the terrorists and prevented any harm to civilians in the area.\n“The brave personnel of Punjab Police have brought 10 extremist terrorists to a humiliating end,” Naqvi said, emphasizing the significance of the operation. He added that the terrorists were part of a dangerous extremist network seeking to spread fear and chaos in the region, but their evil plans were crushed by the prompt action of the police.\nNaqvi also highlighted the broader impact of this successful mission on the ongoing fight against terrorism in the country. “The Mianwali police team courageously thwarted the nefarious designs of extremist terrorists,” he remarked, pointing out how their decisive actions served as a crucial contribution to national security.\nThe minister took the opportunity to extend his congratulations to the Inspector General of Punjab Police (IG) Usman Anwar and his entire force, recognizing their leadership and operational excellence. “I congratulate Punjab Police Commander IG Usman Anwar and his team,” he stated, underscoring the collaborative efforts that led to the operation’s success.\nIn a message directed to the public, Naqvi expressed that the nation should be proud of its law enforcement officers who risk their lives every day to ensure the safety of the people. “The nation is proud of the achievements of Mianwali Police,” he said, while praising the exceptional bravery of the officers involved in this particular operation.\n“The brave sons of Punjab Police have achieved significant successes in the fight against terorrism,” the Interior Minister declared, reflecting on the sacrifices and efforts made by the force to uphold peace and stability across the province.\nIn closing, Naqvi hailed the officers who carried out the mission as national heroes. “The police officers who killed 10 extremist terrorists are the nation’s heroes,” he concluded, expressing his gratitude for their dedication and service.\nThis operation comes as a strong message to terrorist organizations attempting to disrupt peace in the country. With the continuous efforts of law enforcement agencies, Pakistan remains committed to defeating terrorism in all its forms.",
  "retrievedAt": "2025-08-10T20:22:24.415Z"
}
