{
  "title": "Tarar for completion of Safe City Project in Sindh to contain crime and terror incidents",
  "link": "https://www.app.com.pk/national/tarar-for-completion-of-safe-city-project-in-sindh-to-contain-crime-and-terror-incidents/",
  "date_published": "2024-10-25T14:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Minister for Information and Broadcasting, Attaullah Tarar on Friday urged the Sindh government to ensure completion of Safe City Project that was crucial to contain terrorism and crime rate in the province.\nThe minister was replying to the queries of Member National Assembly (MNA), Sharmila Sahiba Faruqui of Pakistan Peoples Party.\nTarar said a Rs5.6 billion funding has been allocated by the Sindh Government and some 43 poles were installed in Karachi from Airport to the Red Zone. However, there was no harm in seeking technical assistance from other provincial departments for the project that had to be implemented into phases. He added that the remaining zones should be completed on priority.\nThe Punjab Safe City Authority, he said would also provide full support to the Karachi Safe City projects as Peshawar and Karachi needed Safe City systems the most. The federal government was ready to provide all assistance in that regard.\nThe first Safe City Project was established in the federal capital, whereas a four times bigger system was developed in Lahore, he added.\nAttaullah Tarar said the Lahore Safe City project had played a pivotal role in controlling terrorism and crime, particularly in the investigation and tracking of DIG Traffic Lahore, Captain (R) Mobeen Shaheed’s killers. The project enabled authorities to probe and track the facilitators who aided the suicide bomber in reaching the spot.\nHe said: “We have facial recognition facility in the Safe City project as all details are available. However, a separate briefing in the committee should be held on this matter.”\nThe project, he said was a government to government initiative between the Sindh government and the NRTC, Ministry of Defence, he informed.",
  "retrievedAt": "2025-08-10T20:20:53.544Z"
}
