{
  "title": "Mohsin Naqvi strongly condemns terrorist attack on FC checkpoint in DI Khan",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-strongly-condemns-terrorist-attack-on-fc-checkpoint-in-di-khan/",
  "date_published": "2024-10-25T12:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Interior Minister Mohsin Naqvi on Friday condemned an attack by extremist terrorists on a Frontier Corps (FC) checkpoint in Dera Ismail Khan.\nThe assault, which led to the tragic loss of ten FC personnel, has drawn widespread condemnation and prompted pledges of solidarity from the government and the nation.\nMinister Naqvi, in his statement, expressed deep sorrow over the loss of these brave soldiers, paying tribute to their unwavering dedication and sacrifice.\n“These ten FC soldiers achieved the highest rank of martyrdom defending our nation,” said Naqvi.\nHe highlighted the valor and selflessness displayed by these personnel, emphasizing that their service for peace and security in Pakistan would never be forgotten.\nThe Interior Minister also denounced additional attacks on law enforcement officers across the region. In Bannu, SHO Jani Khel’s police vehicle was targeted in a similar violent incident, while Sub-Inspector Inayatullah in Kohat was fatally shot in a separate attack.\nMinister Naqvi expressed his condolences, extending heartfelt sympathy to the families of these martyrs. “We are grieving with the families of the fallen officers,” Naqvi remarked, “and as a nation, we honor their sacrifices with immense pride.”\nIn a tribute to all the fallen heroes, Naqvi underscored the unique role of FC and Khyber Pakhtunkhwa police in the fight against terrorism, highlighting the critical need for unity and resilience in the face of extremist threats.\n“The great sacrifices made by our FC and police officers in the line of duty cannot be repaid or forgotten,” he stated, affirming the government’s commitment to stand by the bereaved families during this difficult time.\nHe assured that the nation holds these sacrifices in high esteem, recognizing the unmatched courage demonstrated by these security forces in the pursuit of peace and stability for Pakistan.\n“The martyrs will always remain alive in our hearts, and their legacy of bravery is a source of inspiration and pride for the entire country,” Naqvi said, pledging continued support to the families of the fallen.\nNaqvi concluded by reaffirming the government’s dedication to supporting the security forces in their mission to safeguard Pakistan.\nHe commended the FC and police for their ongoing efforts, acknowledging the courage they exhibit daily in the face of grave dangers.\nThe sacrifices made by these heroes, he stated, underscore the collective debt owed by the nation to those who put their lives in the line for Pakistan’s future.",
  "retrievedAt": "2025-08-10T20:21:28.398Z"
}
