{
  "title": "COMSATS, ISSI agree to collaborate for Science Advocacy & Regional Development",
  "link": "https://www.app.com.pk/national/comsats-issi-agree-to-collaborate-for-science-advocacy-regional-development/",
  "date_published": "2024-10-25T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):The Commission on Science and Technology for Sustainable Development in the South (COMSATS) and the Institute of Strategic Studies Islamabad (ISSI) signed a MoU for complementing each other for Science Advocacy and Regional Development on Friday.\nIt was signed by Executive Director COMSATS, Ambassador Dr. M. Nafees Zakaria, and Director General ISSI, Ambassador Sohail Mahmood, here at COMSATS Secretariat, a news release said.\nThe signing ceremony was witnessed by Ambassadors and diplomats, Heads/representatives of COMSATS’ partner organizations, as well as senior officers of COMSATS and ISSI.\nThe COMSATS is an intergovernmental organization of 27-member developing countries, committed to advancing scientific research, innovations and technologies for sustainable development. ISSI is an autonomous premier think tank of the Ministry of Foreign Affairs dedicated to providing in-depth understanding and objective analyses of regional and global strategic issues impacting international peace and security.\nThe MoU will pave the way for collaboration for activities such as scientific research, studies and publications, professional exchange and capacity building, sharing of knowledge and experiences, science diplomacy, and\nAmbassador Sohail Mahmood deliberated on ISSI’s commitment to expanding partnerships and outreach to niche specialised institutions.\nHe considered COMSATS as one such organization focused at S&T for development. Mahmood highlighted ISSI’s vision of next generation programs that concentrate on youth-inclusive dialogue and research. He noted that we need to pay critical attention to topics such as “Global South” and Middle Powers — the key players in both geopolitical and geo-economic landscapes.\nIn his remarks, Ambassador Zakaria expressed unflinching commitment of COMSATS to pass on the benefits of contemporary technologies to its Member States, and noted that COMSATS aspires to benefit from the strengths of ISSI with an aim to promoting intra-South reliance and cooperation.\nHe highlighted some of the recent initiatives of COMSATS in the emerging fields of science and technology. He considered the MoU signing as beginning of mutually beneficial collaboration between COMSATS and ISSI.\nThe collaboration reflects the shared commitment of COMSATS and ISSI to harness latest technologies and innovation for sustainable development on a global scale.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:21:10.127Z"
}
