{
  "title": "PM pays tribute to PMA cadet for embracing martyrdom while fighting against terrorists",
  "link": "https://www.app.com.pk/national/pm-pays-tribute-to-pma-cadet-for-embracing-martyrdom-while-fighting-against-terrorists/",
  "date_published": "2024-10-25T18:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday paid tribute to a Pakistan Military Academy (PMA) Kakul cadet Arif Ullah for embracing martyrdom while bravely fighting against the terrorists in Lakki Marwat.\nIn a statement, the prime minister said Cadet Arif Ullah Shaheed set an example of courage and bravery by thwarting the cowardly attack on innocent worshippers.\nThe cadet, who was on leave, could not tolerate innocent citizens becoming victims of terrorism, he said adding that the spirit of patriotism and loyalty to the homeland exhibited by the Pakistan Army was unmatched anywhere in the world.\nHe said terrorists should be well aware of the brave young men they are trying to confront.\nThe dedication and commitment of Cadet Arif Ullah Shaheed serve as a guiding light for the younger generation, he remarked.\nThe prime minister emphasized that Cadet Arif Ullah Shaheed and his family were a source of pride for the entire nation, including himself.\n“The Pakistani nation can never forget the sacrifices of its martyrs.”\nExpressing commitment to continue fight against the scourge of terrorism until it is completely eradicated from the country, the prime minister said the entire Pakistani nation stood shoulder to shoulder with the armed forces of Pakistan in the war against terrorism.\nWith brave young men like Cadet Arif Ullah Shaheed, terrorists will never succeed in their malicious designs to spread chaos in our homeland, PM Shehbaz said.\nHe prayed for the elevation of ranks of the martyr in Jannah and grant of courage to the bereaved family members to bear the loss with equanimity.",
  "retrievedAt": "2025-08-10T20:20:33.516Z"
}
