{
  "title": "Accurate reporting key to tackling trafficking, smuggling: Kundi",
  "link": "https://www.app.com.pk/national/accurate-reporting-key-to-tackling-trafficking-smuggling-kundi/",
  "date_published": "2024-10-25T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Friday emphasised the crucial role of accurate reporting in guiding government actions, particularly in combating Trafficking in Persons and Smuggling of Migrants, where media plays a vital part.\nHe expressed these views while addressing an interactive session with journalists on media reporting in Trafficking in Persons (TIP), Smuggling of Migrants (SOM) and bonded labor in Pakistan organized by the Sustainable Social Development Organization (SSDO),where he was the chief guest.\nGovernor Faisal Karim Kundi praised SSDO’s initiative and called the awareness session a significant effort in addressing Trafficking in persons and forced labor. He said that media reports on Trafficking in Persons (TIP) and the Smuggling of Migrants (SOM) play a critical role in shaping national policies and improving society. “Accurate reporting, based on factual information and current laws, can support the government’s efforts in dismantling trafficking networks,” he said.\nHe explained that the police handle cases of internal trafficking with in the country, while the FIA is responsible for investigating cross-border trafficking.\nThe Governor further stressed the importance of protecting the identities and dignity of victims when reporting on these sensitive issues. He encouraged media professionals to evaluate the actions of law enforcement agencies within the framework of the law to improve their effectiveness. He also said that the media can serve as a bridge between victims and governmental and non-governmental organizations that provide legal aid.\nOn this occasion, Executive Director of SSDO, Syed Kausar Abbas, expressed his gratitude to Governor Khyber Pakhtunkhwa Faisal Karim Kundi and Journalists for attending the event. He highlighted the growing concern of Trafficking in persons (TIP) and bonded labor in Pakistan. Syed Kausar Abbas stressed that to tackle these issues, media and law enforcement agencies must collaborate with a solid strategy. He added that it is very important to fully implement the Prevention of Trafficking in Persons Act, 2018 to counter this challenge.\nDuring the session, journalists were briefed on national and international laws related to trafficking in persons ( TIP) , Syed Kausar Abbas informed the participants that Trafficking in persons in Pakistan occurs in two forms, internal trafficking within the country and cross-border trafficking. He said that children under the age of 18 are most vulnerable with child labor and exploitation in commercial sex being widespread. Both men and women, as well as children and transgender’s are victims of this exploitation.\nExecutive Director of SSDO, Syed Kausar Abbas, elaborated on the efforts of law enforcement agencies such as the Federal Investigation Agency (FIA), Police, Labor departments and child protection institutes that are working against human trafficking. The Prevention of Trafficking in Persons Act, 2018 stipulates that those convicted of human trafficking could face up to seven years in prison, fines up to 1 million rupees, or both.",
  "retrievedAt": "2025-08-10T20:20:49.048Z"
}
