{
  "title": "PTI orchestrated ‘armed attack’ on prison vans near Sangjani Toll Plaza: Tarar",
  "link": "https://www.app.com.pk/national/pti-orchestrated-armed-attack-on-prison-vans-near-sangjani-toll-plaza-tarar/",
  "date_published": "2024-10-25T16:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Friday said the Pakistan Tehreek-e-Insaf (PTI) had orchestrated an armed attack on prison vans near Sangjani Toll Plaza.\n“Armed workers of the PTI including a son of the MPA of the PTI from KPK Liaquat Sahib attacked the prison vans which were carrying 83 detainees, and slowed down near the Sangjani Toll Plaza,” said the minister while talking to the media.\nHe said upto 30 persons in four cars attacked the vans to help the detainees to escape from the custody of the police which had successfully repulsed the attack. Two police personnel got injured, but all those who tried to flee had been re-arrested.\nFour assailants including the son of the PTI’s MPA have been arrested, while their weapons and two cars were taken into custody, he said, adding interrogation of the arrested persons was underway.\nTarar said rest of the assailants and their cars were being traced and would be taken into custody soon. All those involved in the planning and abetment of the attack would face the law, he added.\nThe authorities had the CCTV footage of the attack, said the minister while debunking a flimsy story worked out by the PTI which claims that the police had staged the attack and itself opened the gates of the vans for prisoners and then vandalized the vehicles by themselves.\nThe PTI’s reaction over the incident is “ludicrous”, he said asking its spokesperson to be ashamed of himself for churning out such lies that showed the party had nothing to do but “deceit and fraud”.\nThe minister condemned the attack which was planned by the PTI in a habitual criminal manner and just like gangsters, who always attacked a prison van at a time when it was supposed to be slowed down.\nTarar said the PTI had a history of attacking the state, citing the incidents of May 9 which included attack on memorials of the martyrs, and vandalizing of PTV building and the Parliament’s gate during the sit-in of 2014.\nThey always resorted to the politics of violence, he said, vowing a strict legal action against the perpetrators of the attack.\nAn example will be set to prevent recurrence of such incidents and the writ of the state would be established at all cost, he stressed.\nHe said nobody would have dared to challenge the writ of the state if the perpetrators of May 9 were taken to the task.\nThe minister said those who attacked the state in civilized societies like the United States and London were imprisoned upto 20 years for attacking the state.",
  "retrievedAt": "2025-08-10T20:20:48.800Z"
}
