{
  "title": "10 frontier constabulary soldiers martyred in DI Khan",
  "link": "https://www.app.com.pk/national/10-frontier-constabulary-soldiers-martyred-in-di-khan/",
  "date_published": "2024-10-25T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):In a tragic incident, 10 soldiers of the Frontier Constabulary (FC) laid down their lives in defense of their nation when Khawarij terrorists launched a fierce attack on an FC checkpoint in Darazinda, Dera Ismail Khan.\nThe assault, executed under the cover of darkness, was a well-coordinated effort by militants who targeted the Zam FC checkpoint using heavy weaponry.\nAccording to a spokesperson from the Ministry of Interior, the FC soldiers stood firm and courageously fought back, ultimately sacrificing their lives to protect the checkpoint and thwart the terrorists’ assault.\nThe Ministry of Interior spokesperson confirmed that ten FC soldiers were martyred in the confrontation, and three others sustained injuries. Despite the overwhelming threat posed by the heavily armed attackers, the soldiers’ bravery prevented the terrorists from advancing further. “The martyred soldiers thwarted the terrorists’ attack on the checkpoint by laying down their lives,” the spokesperson said, honoring the soldiers’ ultimate sacrifice.\nAmong the martyrs, six soldiers hailed from South Waziristan, while four were from the Karak district. The names of the martyrs have been released, including Naib Subedar Muhammad Jan, Naik Arif, Lance Naik Saeed-ur-Rehman, Sepoy Akhunzada, and Sepoy Hazratullah. Sepoys Mushtaq, Abdul Samad, Imran, Basir, and Mehtab also embraced martyrdom.\nTheir brave resistance served as a testament to their commitment to the security of Pakistan and the preservation of peace in the region.\nThree FC personnel were also wounded during the exchange of fire with the attackers. The injured soldiers—Naik Hamza, Sepoy Hasan, and Sepoy Sabir Ayub—were swiftly transferred to the Combined Military Hospital (CMH) in Dera Ismail Khan for medical treatment. Their condition is currently stable, and they are receiving the necessary care.\nPaying tribute to the martyred soldiers, the spokesperson emphasized that the FC remained unwavering in its resolve to combat terrorism and secure peace for Pakistan.\n“We pay tribute to the martyrs of the FC,” the spokesperson stated, noting that these great sacrifices only serve to strengthen the forces’ determination to eradicate terrorism. The Frontier Constabulary remains committed to eliminating the scourge of terrorism and ensuring peace,” the spokesperson added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:21:56.124Z"
}
