{
  "title": "Ahsan Iqbal chairs meeting to review rehabilitation of NJHPP",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-chairs-meeting-to-review-rehabilitation-of-njhpp/",
  "date_published": "2024-10-25T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):Minister for Planning and Development Ahsan Iqbal on Friday chaired a meeting to discuss progress and potential solutions for the rehabilitation of the Neelam Jhelum Hydro Power Project (NJHPP).\nThe meeting was attended by the Minister for Water Resources and senior officials from relevant departments, including WAPDA and the Ministry of Water Resources, said a news release.\nIn line with directives issued by the Prime Minister in May, an International Panel of Experts (IPOE) was engaged to investigate the structural issues affecting the project’s Head Race Tunnel (HRT).\nThe panel, consisting of experts including a renowned Pakistani geologist, was tasked with identifying the causes of recent challenges.\nDuring the meeting, officials provided an update on dewatering activities, which commenced in May and were successfully completed by July.\nThis process enabled the IPOE to conduct an on-site inspection in September and submit an Inception Report detailing the current state of the tunnel infrastructure.\nThe report highlighted areas of the tunnel floor that require attention, alongside recommendations for enhanced ventilation, lighting, and worker safety measures.\nThe experts’ Terms of Reference (TORs) include a comprehensive evaluation of factors impacting the tunnel and recommendations for improvements in design, construction, and contract management.\nThey also proposed a risk assessment for the HRT and TRT (Tail Race Tunnel) and outlined steps for the tunnel recovery plan.\nThe minister emphasized the importance of a detailed action plan and advised the departments to continue collaborating with independent experts.\nA follow-up session is planned for next week to further refine strategies for the project’s rehabilitation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:20:41.049Z"
}
