{
  "title": "Shehbaz Sharif pays tribute to Benazir Bhutto as ‘crusader for human rights & democracy’",
  "link": "https://www.app.com.pk/national/shehbaz-sharif-pays-tribute-to-benazir-bhutto-as-crusader-for-human-rights-democracy/",
  "date_published": "2022-12-27T06:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): Prime Minister Shehbaz Sharif on Tuesday paid tribute to politician Benazir Bhutto on her death anniversary, saying that she was a “crusader for human rights and democracy”.\nShehbaz Sharif said Benazir Bhutto left an indelible mark on politics of the country, adding that the void left by her martyrdom continues to widen over the years.\nHe said the black day of 27 December 2007 is an unforgettable day relating to the martyrdom of a beloved leader of the people.\n“Benazir Bhutto is a shining example of democratic and political struggle who sacrificed her life while fighting for the rights of people,” he said.\nHe mentioned that as the first woman prime minister of the Islamic world, Benazir Bhutto, was a fascinating story of continuous struggle throughout her life.\n“We pay tribute to the historical services of Benazir Bhutto for the country, people and democracy,” he said.\nHe recalled that Pakistan Muslim League leader Muhammad Nawaz Sharif and Pakistan Peoples Party’s Benazir Bhutto gave the historical gift of the Charter of Democracy that started a new era in the country’s politics.\nHe term d the Charter of Democracy  a landmark achievement of the political vision of the country’s leaders which ushered in a new political culture and tradition in Pakistan.\nShehbaz Sharif said Benazir Bhutto took a bold and clear stand against terrorism and added that her martyrdom showed the country’s determination against the menace.\nHe said Benazir Bhutto also rendered immense services for the strengthening of national defence, constitutional institutions and for social welfare.\nThe prime minister extended condolences to the family of Benazir Bhutto including his husband Asif Ali Zardari, son Bilawal Bhutto and all other relatives.\nHe prayed to Allah Almighty to elevate the ranks of all martyrs including Benazir Bhutto, and grant patience to the families.",
  "retrievedAt": "2025-08-11T16:04:18.055Z"
}
