{
  "title": "PM for fast-tack solarization of federal govt’s buildings to slash costly fuel import bill",
  "link": "https://www.app.com.pk/national/pm-for-fast-tack-solarization-of-federal-govts-buildings-to-slash-costly-fuel-import-bill/",
  "date_published": "2022-12-27T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday said that they had devised a plan to immediately convert all the federal government entities’ buildings on solar power by April next year to slash a huge chunk out of the country’s costly fuel import bill hovering around $27 billion.\nUnveiling further details, the prime minister said that the procedures for conversion of solar power should be fast-tracked as they had set April 2023 as the timeline for the implementation of this plan.\nAddressing a solarization conference, the prime minister said under the plan, all the federal government ministries, departments, authorities and their offshoots in the provinces would immediately shift on solar energy.\nHe said it would be a model for the rest of the provincial governments as the federal government would not make additional expenditures over the solarization process.\nThe prime minister also urged all the relevant authorities and the stakeholders to complete the required process by the end of April next year and meet the timeline which had been set.\n“Consider it as our political, social, national and religious duty to implement it as soon as possible,” he opined.\nThe prime minister said with these urgent measures, they would be able to generate 300 MW to 500MW of cheap power, thus reducing the import bill worth billions of dollars each year.\nThe prime minister assured that the whole process would be conducted through transparent bidding via a third party.\nHe also urged the provincial chief ministers to emulate the federal government’s launched pattern and introduce solar systems in their respective provinces and assured the federal government’s complete assistance in this regard.\n“It is the only option of our survival as a nation,” he added.\nThe prime minister said that the process for the generation of 10,000MW solar power in the country had already commenced and such a conversation by the federal government buildings would be the first phase.\nEnumerating the economic challenges faced by the country due to skyrocketing fuel and gas prices after the Russia-Ukraine conflict, he said that developing countries like Pakistan had to bear the brunt.\nHe said $27 billion costly fuel import bill was a big challenge for the countries like Pakistan, adding the ongoing conflict had also surged prices of gas and worsened its availability as the supply to Europe was disrupted.\nThe prime minister said during the Covid pandemic, the prices of gas were crashed to the lowest and it was sold at $2 per unit, the then government committed a criminal negligence by not securing its import and due to it, now the whole nation had been suffering.\nHe said during former prime minister Nawaz Sharif’s tenure, a 15-year agreement for the purchase of LNG at 13.2 per cent of the Brent was reached with Qatar, but unfortunately, it was politicized by the subsequent government.\nNow due to the global situation, gas was not available while the fuel was being sold at an exorbitant price in the global market, he said, adding that they would have to convert to solar and renewable energy with lightning speed.\nThe prime minister said during the previous PML-N government, efforts were made for the production of cheap hydel electricity and land worth Rs100 billion was acquired for the construction of Bhasha dam, but those were long-term measures to generate affordable power in the country.\nHe said under China Pakistan Economic Corridor (CPEC), coal and gas-fired projects were completed by the PML-N government during 2015 to overcome 20 hours crippling power outages in the country.“The green lands were turned barren, industries came to grinding halt, and country’s exports were nosedived”, the prime minister recollecting the past said that in those trying times, former premier Nawaz Sharif remained firm and took the bull by the horns with setting up power plants and thus ended the load-shedding which was a big achievement, ‘something like the finest chapter in the history of the country, making the nation stronger.”\nThe prime minister said that different past governments in the country had not carried out reforms which swelled the circular debt and the costly power was generated.\nHe cited issues like power theft, transmission losses and expensive fuels as the reasons behind the costly power production and said the circular debt in power sector had reached to whopping Rs2.5 trillion. Similarly, the gas circular debt was also spiraling.\nThe prime minister regretted that due to lack of responsibility and the backlog of years had turned the circular debt into a huge mountain. Those governments had committed negligence that did not introduce reforms to reduce the circular debt, he added.\nHe said the federal coalition government was an eight-month nascent one facing a mountain of challenges that kept on piling for decades and expressed the resolve to slowly and gradually overcome these with commitment.\nCriticizing the PTI’s government, the prime minister said the NAB-Niazi connivance had pushed the country into economic and political turmoil. “Unfortunately, he will sorrowfully state that a witch-hunting was carried out and a vendetta in the name of accountability was unleashed against politicians. Worst kind of vengeance was manifested which amounted to fascism. Public servants were disheartened and the government officials faced NAB,” he observed.\nHe said that as Khadim-e-Punjab when he compared his tenures with the previous government of PTI, he could feel a huge difference.\nThe prime minister referring to current economic challenges maintained that the entire nation was expecting them to given them respite from the price hike.\nHe said when they had to pay $27 billion on expensive fuel and spent their local resources for its import, they could not expect development. Only through the conservation of their resources in a proper manner like solar and renewable resources, they would be able to generate inexpensive electricity.\nHe said the coalition government never wanted to transfer the burden of price hike. In the past, the agreement with the International Monetary Fund (IMF) was blatantly breached by the PTI’s government.\nThe prime minister regretted that if they wanted to give any subsidy in any sector, they had to go to IMF ‘which is a factor and painful reality’.\nHe said that they had no other option, but would have to implement the IMF programme and lauded the Pakistani nation for braving the burden of the price hike with patience.",
  "retrievedAt": "2025-08-11T16:04:12.119Z"
}
