{
  "title": "President upholds order to grant due share to sisters in inherited property",
  "link": "https://www.app.com.pk/national/president-upholds-order-to-grant-due-share-to-sisters-in-inherited-property/",
  "date_published": "2022-12-27T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): President Dr Arif Alvi has upheld the orders of the Federal Ombudsman for Protection against Harassment of Women at Workplace (FOSPAH) to grant four sisters their due share in the inherited property belonging to their deceased father after putting the property for open auction or sale and the proceeds to be distributed among all the siblings.\nThe President gave these orders under the Enforcement of Women’s Property Rights Act, 2019 in a case where four sisters had complained to FOSPAH that their brothers had declined to give their inherited right of share in the property of their deceased father and had prayed that their respective shares should be given to them.\nThe President in his decision observed that the brother along with other legal heirs of the deceased had signed a statement agreeing to enter into an amicable settlement, according to which the property in question, a house in Rawalpindi, would be evaluated through a commission appointed by FOSPAH to evaluate the market value of the said property.\nAfter fixing the market value of the said house, every sharer of the house would be given his or her due share as per the shari share and also all the expenses made would be adjusted whoever had spent duly.\nThe President underscored that such an amicable settlement could not be brushed aside at the desire and instance of a single signatory whereas all others were owning and accepting the same settlement.\nHe further stated that it was a well-settled principle of law that a person cannot blow hot and cold and a person having a choice between two courses of conduct is to be treated as having made an election from which he cannot resile.\nHe noted that in the instant case, the brother had signed the joint statement with his consent during the course of the proceedings before the Ombudsman and had stated that he had no objection to the evaluation of the said property.\nAs per details, Shabana Hanif, Nabeel Ulfat, Rehana Zulfiqar, and Naila Naeem (the complainants) who are real sisters had filed a complaint under the Act, stating that their father had left a three-storey house in Rawalpindi and their four-brothers had declined to give their share in the property.\nOne of the brothers had contended before FOSPAH that the complainants had already sold their respective shares in respect of the inherited property by executing different agreements.\nHe further contended that after the sale of their respective shares in his favour the complainants had filed the complaint with FOSPAH.\nDuring the course of the proceedings, the parties unanimously agreed that the property should be partitioned among them as per their respective shares and in case it was not partitionable, it should be sold and proceeds should be distributed among siblings.\nAfter the settlement, the brother, Tanvir Sarfaraz Khan, resiled from his words by saying that the sisters had already transferred their respective shares and thus any settlement was out of the question.\nThe FOSPAH had rejected this plea of the brother and had ordered to appoint a local commission to evaluate the market price of the property for sale as per rules and procedures.\nTanvir Sarfaraz Khan then filed a representation with the President, which he rejected on the above-mentioned grounds.",
  "retrievedAt": "2025-08-11T16:04:15.815Z"
}
