{
  "title": "Pakistan, Mongolia agree to form JMC, inter-parliamentary union to boost ties",
  "link": "https://www.app.com.pk/national/pakistan-mongolia-agree-to-form-jmc-inter-parliamentary-union-to-boost-ties/",
  "date_published": "2024-10-17T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Pakistan and Mongolia on Thursday agreed to form a Joint Ministerial Commission to enhance cooperation in trade, tourism, agriculture and mining sectors, and an inter-parliamentary union to expand the bilateral parliamentary ties.\nThe bilateral relations were discussed in a meeting between Prime Minister Shehbaz Sharif and his Mongolian counterpart Luvsannamsrain Oyun-Erdene here on the sidelines of the SCO Council of Heads of Government (CHG) Meeting.\nIn the meeting, Prime Minister Shehbaz suggested that both sides should explore new avenues of mutually advantageous cooperation with a particular focus on trade, investment, people-to-people contacts and connections.\nHe offered the Mongolian side to send civil servants to training institutions in Pakistan and also proposed to declare 2025 as the year of Pakistan-Mongolia Friendship to bolster the brotherly ties among the two countries.\nPrime Minister Shehbaz warmly welcomed Prime Minister Oyun-Erdene and noted that his visit marked a new chapter in the history of the bilateral relationship, defined by mutual respect, goodwill and amity.\nFelicitating him on his re-election as the Prime Minister of Mongolia, Shehbaz Sharif stated he looked forward to working closely with Oyun-Erdene in the days ahead to further strengthen cooperation between the two countries.\nOyun-Erdene warmly felicitated the prime minister on the successful conduct of the SCO CHG Meeting and appreciated Pakistan’s leadership role as SCO CHG Chair. He reciprocated that Mongolia shared Pakistan’s desire to build stronger and closer bilateral relations through joint efforts and collaboration.\nThe Mongolian prime minister also planted a sapling in the lawn of the Prime Minister’s House.\nPrime Minister Shehbaz offered Mongolian side to send civil servants to training institutions in Pakistan and also proposed to declare 2025 as the year of Pakistan-Mongolia Friendship to bolster the brotherly ties among the two countries.",
  "retrievedAt": "2025-08-10T20:08:17.369Z"
}
