{
  "title": "ECP fixes Oct 28 as last date for postal ballot",
  "link": "https://www.app.com.pk/national/ecp-fixes-oct-28-as-last-date-for-postal-ballot/",
  "date_published": "2024-10-17T12:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): The Election Commission of Pakistan (ECP) on Thursday fixed Oct 28 as the last date for receiving applications for postal ballot papers for by elections to the Provincial Assembly, Balochistan PB-08, Sibi.\nIn a statement, the ECP said that the facility, under the law, has been extended to the persons in government service, members of armed forces, their wives and such of their children as are registered voters and ordinarily reside with them provided they are stationed at a place other than the place in which their constituency is situated.\nPersons with any physical disability who are unable to travel and hold a national identity card with a logo for physical disability issued by the national database and registration authority (NADRA) can also vote via postal ballot, the poll body said, adding persons who are detained in prison or held in custody are also entitled to vote by postal ballot.\nThe statement said that the persons appointed by the returning officers, including police personnel, for the performance of any duty in connection with an election at polling stations other than the one at which they are entitled to cast their vote are advised to apply for postal ballot to the returning officers within three days of their appointment.\nIt said that the applications for postal ballot should be made on the prescribed form with the returning officer concerned of the constituency. Application Forms for Postal Ballot can be obtained from Mansoor Ali Shah, Assistant Commissioner, Sibi Contact No. 0833-9230180. The application Form may also be downloaded from ECP’s website www.ecp.gov.pk.\nThe voters to whom postal ballots are issued will not be entitled to vote in person at the polling stations. The application should be forwarded/endorsed by the office/ department of the voter concerned to guard against unauthorized person applying for postal ballot.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:08:14.201Z"
}
