{
  "title": "NDMA continues aid to conflict-hit Gaza, Lebanon",
  "link": "https://www.app.com.pk/national/ndma-continues-aid-to-conflict-hit-gaza-lebanon/",
  "date_published": "2024-10-17T07:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): National Disaster Management Authority (NDMA) continues to provide humanitarian aid to the war-affected people of Gaza and Lebanon on the directives of the Prime Minister of Pakistan.\nThe second consignment of aid was dispatched on Thursday from Karachi to Lebanon. This aid shipment, sent by NDMA in collaboration with Al-Khidmat Foundation, comprises approximately 100 tons of supplies, including medicines, ready-to-eat meat, tents, tarpaulins, warm bedding, winter clothing, and powdered milk. The aid was dispatched via flight from Jinnah International Airport, Karachi, to Beirut, Lebanon, a news release said.\nThe send off ceremony held at Jinnah International Airport was attended by the representatives from NDMA, the Ministry of Foreign Affairs Al-Khidmat Foundation and local administration. During ceremony, the attendees emphasized the urgent need to provide relief to the war-torn populations of Palestine and Lebanon, considering the ongoing conflict and the needs of the affected communities.\nThey reaffirmed the Government of Pakistan’s commitment to supporting their brothers and sisters in distress and stressed the importance of collaboration by welfare organizations and the Pakistani public in strengthening these efforts.\nThis is Pakistan’s 12th aid shipment to Palestine and Lebanon. Prior to this, 10 aid consignments were sent to Palestine, and Thursday marked the second shipment to Lebanon. The Government of Pakistan continues to send relief supplies based on the needs of the war-affected populations of Lebanon and Palestine.\nDuring a meeting held at the NDMA headquarters on October 11, 2024, Federal Minister, Ahsan Iqbal, announced the establishment of a special account named the “Prime Minister’s Relief Fund for Gaza and Lebanon,” as per the Prime Minister’s directives. This fund will collect donations from the public to aid their brothers and sisters in Gaza and Lebanon who are facing war emergencies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:08:35.036Z"
}
