{
  "title": "Senate passes Deposit Protection, Establishment of Special Court (Overseas Pakistanis Property) Bills unanimously",
  "link": "https://www.app.com.pk/national/senate-passes-deposit-protection-establishment-of-special-court-overseas-pakistanis-property-bills-unanimously/",
  "date_published": "2024-10-17T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): The Senate on Thursday passed the Deposit Protection Corporation (Amendment) Bill, 2024 and the Establishment of Special Court (Overseas Pakistanis Property) Bill, 2024 unanimously.\nMinister for Finance and Revenue moved the bill to amend the Deposit Protection Corporation Act, 2016 (The Deposit Protection Corporation (Amendment) Bill, 2024) in the House.\nThe statement of objects and reasons of the bill says that for the sake of stability of financial system, the bank resolution and recovery regime in Pakistan is being further strengthened. Resolution of financial institutions often depends upon a sound and reliable funding mechanism in order to enable the Resolution Authority to prepare and execute an effective resolution scheme that would be able to bridge any gaps in assets and liabilities of a non-viable bank. The funds held by a deposit protection agency is conceptually similar to the protection provided to depositors, in case of bank failure, as in both cases the funds provided by the deposit protection agency is used to protect deposits’ interest and contribute towards financial system’s stability.\nThe amendments are aimed at enhancing the mandate of the Deposit Protection Corporation from ‘Pay-box-only’ to Pay-box plus’ i-e to facilitate in the resolution of its member institution.\nSimilarly, Minister for Overseas Pakistanis and Human Resources Development moved the bill to establish special courts for adjudication of petitions in respect of immovable properties of overseas Pakistanis (The Establishment of Special Court (Overseas Pakistanis Property) Bill, 2024) in the House.\nCommenting on the salient features of the bill, Minister for Overseas Senator Saalik Hussain said that the bill has been moved on the great demand from the Pakistanis living abroad. It would ensure secure process of land purchasing through online process by overseas Pakistanis.\nLeader of the House in the Senate, Senator Syed Ali Zafar hailed the bill presented for the overseas. Meanwhile, Senator Danish Kumar said that overseas approached him and demanded to bring such kind of law to secure their property in Pakistan. Through online process of property purchasing, the overseas will not have to bear travel expenditures.\nSenator Irfan Ul Haq Siddiqui said that the bill has already been approved from the committee.\nThe house passed the both the bills through clause by clause.\nMeanwhile, Minister for Finance Muhammad Aurangzeb on behalf of Minister for Interior Syed Mohsin Raza Naqvi introduced the National Forensics Agency Bill, 2024 in the Senate.\nChairman Senate Syed Yusuf Raza Gillani referred the bill to the concern standing committee for detailed deliberation.\nMoreover, the Finance Minister on behalf of Minister for Law and Justice laid before the Senate the Annual Report on the observance and implementation of principles of policy (2020-21), as required under clause (3) of Article 29 of the Constitution.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:08:11.623Z"
}
