{
  "title": "NAPHDA violation of financial obligations abandoned ‘Low-Cost Housing Project’ in Ali Pur: Tarar",
  "link": "https://www.app.com.pk/national/naphda-violation-of-financial-obligations-abandoned-low-cost-housing-project-in-ali-pur-tarar/",
  "date_published": "2024-10-17T15:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Minister for Information and Broadcasting, Attaullah Tarar Thursday said the Naya Pakistan Housing and Development Authority (NAPHDA) failed to fulfill its financial obligations that led to financial constraints causing slow progress of low-cost housing project at Ali Pur Farash.\nHe said while responding to the query of Member National Assembly (MNA), Aliya Kamran’s query pertaining to abandoned and in complete projects of Capital Development Authority (CDA) and the slow pace development of Ali Pur Farash project on behalf of the Interior Minister.\nAttaullah Tarar said Ali Pur Farash project was not abandoned by the CDA but rather non-fulfillment of contractual obligations, non-payment by NAPHDA and violation of the memorandum of understanding (MoU) between CDA, NAPHDA and FWO led to halted financial progress.\n“It is 66% complete and remaining halted due to financial constraints and unfulfilled contractual obligations,” he said.\nCost escalation in Ali Pur Farash project has increased multiple times and the matter should be referred to the committee concerned, he said.\nThe Speaker National Assembly referred it to the Standing Committee on Interior.\nThe Minister for Information informed that the Margalla Avenue extension till Bari Imam was the new road development project that would be completed in next two months as swift progress was underway.\nHe added that the Serena Chowk underpass was conceived by the Minister Interior which was under the original plan to facilitate foreign guests and high profile functions which would start from Serena Chowk to Jinnah Convention Center would be launched soon.\n“A complete plan for U-turns, and underpasses is being prepared and ground breaking would be done soon,” he said.\nThe Jinnah Convention Center, he said was refurbished in mere two months span by CDA which was a great achievement. He lauded Chairman CDA, Ali Randhawa for efficient work during the SCO summit preparations.\nReplying another query of MNA, Dr Mahreen Razzaq Bhutto on levy of development charges on E-12 sector allottees, Attaullah Tarar said the penalty imposed by CDA could be paid in installments. However, the plots value has increased manifold from the original land price, he added.\nThe Minister said that the CDA should consider the financial capacity of the allottees while enforcing the development charges.\nHe added that the CDA should notify a grievance committee to facilitate allottees facing financial constraints. “We will form TORs for original allottees and are unable to pay the development charges,” he said.\nThe model villages’ project envisioned organized rural development and all facilities were given to rural population that helped develop Saidpur as a model that garnered many tourists, he added.\nResponding to MNA Shaista Pervaiz Malik, he said under Ministry of Interior, CDA is actively working at the Rawal Dam, running cleanliness campaigns and sports activities including rowing.\nA tourist spot has been established at Rawal Dam developed by CDA and tourists number was increasing there that made it a iconic symbol and one of the main attractions of the metropolis, he added.\nThe matter would be taken up to the Punjab Government for joint collaborative measures on cleanliness of the Dam, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:08:09.015Z"
}
