{
  "title": "Benazir Kafalat quarterly stipends amount to be increased upto Rs. 13,500 by 2025",
  "link": "https://www.app.com.pk/national/benazir-kafalat-quarterly-stipends-amount-to-be-increased-upto-rs-13500-by-2025/",
  "date_published": "2024-10-17T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid has announced increase in the amount of the Benazir Kafalat quarterly installment for beneficiaries upto Rs. 13,500 by the year 2025.\n“The amount of Benazir Kafalat stipends will be increased from Rs. 10,500 to Rs. 13,500 by the year 2025” she said during a visit to the Benazir Nashonuma Center at Sindh Government Hospital PIB Colony in Karachi.\nThe chairperson inspected the facilities, interacted with the women beneficiaries of the program, and expressed satisfaction with the availability of adequate services,said a news release.\nWhile speaking to media personnel at the hospital, Senator Rubina Khalid praised the Sindh Health Department for providing necessary facilities and resources for the program.\nShe highlighted that child stunting is a significant issue that BISP is addressing by providing both cash and nutritional support to mothers of children up to two years of age.\nShe added that 9.3 million families are currently registered with the BISP and this number is expected to reach 10 million by 2025.\nThe chairperson rejecting the notion of BISP promoting dependency, stated that BISP is a visionary initiative of Shaheed Mohtarma Benazir Bhutto and President Asif Ali Zardari and has been recognized globally due to its impact.The programme aims to eradicate poverty, empower women, and reduce income disparity.\nTo ensure its effectiveness, she mentioned that an independent third-party survey and monitoring are conducted annually. Regarding the issue of the agent mafia and the limited number of banks handling cash transfers, Senator Rubina Khalid shared that BISP is in discussions with the State Bank of Pakistan to streamline cash transfers for beneficiaries.\nShe also announced that BISP has added six more banks to its network for cash transfers, which will reduce the reliance on a few banks and curb the influence of deceving agents.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:08:17.997Z"
}
