{
  "title": "SPARC calls for collective action to safeguard children from tobacco harms",
  "author": null,
  "content": "ISLAMABAD, Feb 07 (APP):The Society for the Protection of the Rights of the Child (SPARC) has commended the Government of Pakistan for its significant achievements in tobacco control, which stand as a testament to its commitment to protecting public health and safeguarding future generations from the harmful effects of tobacco use.\nAt a networking meeting with journalists, Dr Khalil Ahmad, Program Manager at SPARC, stated: “Tobacco use remains one of the most pressing public health crises in Pakistan, claiming the lives of over 163,000 Pakistanis annually, or about 11% of all deaths. The addictive nicotine in tobacco products—including cigarettes, e-cigarettes and heated tobacco products—has proven links to deadly diseases such as heart disease, lung disease and cancer. Globally, tobacco use kills more than 8 million people each year, with 1.2 million deaths caused by exposure to second-hand smoke.”\nHe further mentioned that in Pakistan, 24 million adults use tobacco products, including 15.6 million smokers and 7.6 million users of smokeless tobacco. These figures underline the urgency for robust and sustained interventions to prevent tobacco-related harm.”\nDr Khalil said the civil society organizations and international supporters of tobacco control operate legally in Pakistan and have played a pivotal role in supporting the regulation of tobacco products in accordance with the WHO Framework Convention on Tobacco Control, to which Pakistan has been a Party since 2005.\nHe said, “It is crucial that we promote positivity and progress in society while preventing such false narratives from gaining traction.”\nHe also highlighted the importance of collaboration between the government and civil society in maintaining progress toward a healthier society, and said that it is important that we as one nation, stand firm against tobacco use and prevent it from harming our future generations.\nThe session served as a platform for meaningful dialogue between health advocates and journalists, fostering a shared understanding of the urgent need for stronger tobacco control measures. Participants emphasized the collective responsibility of media, civil society, and policymakers in countering misinformation and reinforcing efforts to protect public health. The discussion concluded with a renewed commitment to fight against the misinformation campaigns and false narratives, and not let them gain attention of the masses.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:28:12.697Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sparc-calls-for-collective-action-to-safeguard-children-from-tobacco-harms/",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T15:04:00.000Z"
}
