{
  "title": "PIC serves show-cause notice to CEO K-Electric",
  "link": "https://www.app.com.pk/national/pic-serves-show-cause-notice-to-ceo-k-electric/",
  "date_published": "2024-11-08T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 08 (APP):The Pakistan Information Commission (PIC) has issued a show cause notice to the Chief Executive Officer of K-Electric for failing to comply with the commission’s order to furnish information requested by a citizen under the Right of Access to Information Act, 2017.\nDespite the PIC’s order, dated October 7, 2024, K-Electric has yet to fully comply, leading the commission to take additional action to enforce transparency.\nThe case originated with a citizen’s request for specific information regarding K-Electric’s handling of electricity theft cases. The citizen has sought details on theft cases registered through FIRs in K-Electric’s Tipu Sultan area, reasons for the cancellation of certain FIRs, and information on compromised cases where K-Electric allowed installments or restored electricity connections. Additionally, the appellant requested data on individuals granted bail for electricity theft, including certified copies of relevant court judgments.\nDuring the October 7 hearing, Abdullah Langa, Public Relations Officer for K-Electric, appeared before the Commission, presenting a written reply similar to an earlier submission made in July. K-Electric’s stance sought exemption from disclosure, claiming the requested data would compromise individual privacy, endanger safety, and potentially damage the company’s economic interests.\nThe Commission examined K-Electric’s claims but found them inadequate to justify withholding the information. The PIC determined that the information sought should not be exempted on grounds of confidentiality.\nIn a new argument presented during the October hearing, K-Electric asserted that it does not qualify as a “public body” under the Right of Access to Information Act. The company’s response cited the federal government’s limited stake of 24.36% in K-Electric, claiming that the government holds no influence over its daily operations, decision-making, or management.\nThe Commission, however, dismissed this defense, noting that K-Electric performs public services and receives government subsidies, thereby classifying it as a public body under the Act. The Commission also rejected K-Electric’s procedural objection regarding the two-member quorum of the Commission, referencing the Right of Access to Information Rules, which allow for decisions by two commissioners.\nFollowing its review, the Commission directed K-Electric to provide the requested information, including certified copies of FIRs registered between January 1, 2023, and April 30, 2024, details of compromised cases, and the reasons for FIR cancellations. Additionally, while K-Electric was directed to provide information on cases where bail was granted to accused individuals, the PIC clarified that certified copies of court judgments should be obtained directly from the relevant courts.\nThe PIC has instructed K-Electric’s Public Information Officer to submit the information to the appellant within 15 days, marking a firm stance by the Commission in enforcing transparency and public accountability.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:09:07.179Z"
}
