{
  "title": "VC AIOU urges youth to embody Iqbal’s philosophy of ‘Selfhood’",
  "link": "https://www.app.com.pk/national/vc-aiou-urges-youth-to-embody-iqbals-philosophy-of-selfhood/",
  "date_published": "2024-11-08T09:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 08 (APP): Vice Chancellor Allama Iqbal Open University (AIOU) Prof. Dr. Nasir Mahmood has urged the today’s youth to embody Iqbal’s philosophy of “selfhood” to achieve confidence, resilience, and a spirit of leadership.\nIn an Interview with APP here on Friday, VC AIOU said that Iqbal’s philosophy, centered on self-empowerment, strength, and societal harmony, is essential for building an ethical, peaceful society based on mutual respect and compassion.\nHe also encouraged young people to integrate Iqbal’s teachings into their lives. “Iqbal’s poetry and philosophy offering guidance not only to Muslims but to all humanity. His message is as relevant today as it was in his era” he mentioned.\nIn its commitment to Iqbal’s vision, AIOU has laid a strong foundation for fostering knowledge and understanding of Iqbal’s work, encouraging students to explore the thoughts of this universal philosopher who aspired to create a morally upright society grounded in Islamic values and human dignity.\nTo a question, he informed that Allama Iqbal Open University has established the ‘Iqbal Gallery,’ a significant cultural space honoring the legacy of renowned poet-philosopher Dr. Allama Muhammad Iqbal.\nDr. Nasir Mahmood said this gallery serves as a testament to the university’s commitment to promoting Iqbal’s thought and philosophy among the youth. “We are proud to be associated with the name of Iqbal, our national poet and a mammoth in knowledge and wisdom,” Dr. Mahmood remarked.\nFurthermore, Dr. Mahmood highlighted that the Iqbal Gallery houses over 3,288 volumes, including rare books, journals, sketches, paintings, stamps, and photographs.\nHe said the collection also features preserved letters penned by Iqbal to others and those sent to him, alongside calligraphy of his poetry and iconic photographs capturing memorable moments of his life.\nTo another query, Dr. Nasir noted,“This initiative reflects our deep affection for Iqbal and our commitment to preserving his legacy.”\nThe gallery, he said, has become a key research center on Iqbal studies in Pakistan, attracting scholars and educators nationally and internationally.\nThe university’s main library also includes an ‘Iqbal Corner,’ with approximately 5,000 Iqbal-related books benefiting hundreds of students daily, he mentioned.\nDr. Mahmood emphasized that this gallery provides scholars, students, and researchers with valuable resources to delve into Iqbal’s contributions.\nThe Iqbal Studies Department at AIOU offers courses at undergraduate and postgraduate levels, including M.Phil and Ph.D. programs, he said and added, to till date, the department has graduated over 500 M.Phil and 120 Ph.D. students, many of whom serve in prestigious roles domestically and abroad.\nHighlighting the importance of Iqbal’s teachings, VC AIOU noted that the university organizes annual seminars, poetry recitation contests, and visits to Iqbal’s mausoleum, fostering a deep engagement with his work.",
  "retrievedAt": "2025-08-10T15:09:03.902Z"
}
