{
  "title": "10th Islamabad Literature Festival kicks off",
  "link": "https://www.app.com.pk/national/10th-islamabad-literature-festival-kicks-off/",
  "date_published": "2024-11-08T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP):The 10th edition of the Islamabad Literature Festival (ILF), organized by Oxford University Press (OUP) Pakistan, in Collaboration with Getz Pharma, and NEO Paints (Gold Sponsor), opened to an enthusiastic crowd on Friday.\nThe theme ‘Sustainability: Words Change Mindsets,’ was well received and enabled persuasive discourses throughout the day. ILF has become a vital platform for intellectual growth and literary exploration in the beautiful capital of Pakistan.\nThe Inaugural session comprised a hearty welcome address by Arshad Saeed Husain, Managing Director, Oxford University Press Pakistan; keynotes by, Jane Marriot, British High Commissioner to Pakistan, Maleeha Lodhi, Former Permanent Representative of Pakistan to the United Nations; and Zehra Nigah, Poet and scriptwriter.\nRemarks were shared by Natalie Baker, Deputy Chief of Mission, US Embassy, Islamabad. The inaugural session concluded with an enthralling performance, titled ‘Jaag,’ by Samiya Mumtaz and Adnan Jahangir. Three enriched sessions, exploring the journey to economic growth, and Urdu and Pushto literature followed.\nSenator Muhammad Aurangzeb, Federal Minister for Finance and Revenue; In a conversation with Vaqar Ahmed, titled ‘Economic Stabilization and the Journey to Growth,’ discussed Pakistan’s investment climate, stating that the figures are visible to all.\n“Philanthropy is a valuable resource, but the country needs taxes to sustain long-term growth. Energy costs are moving towards affordability, but further structural reforms are necessary. State-Owned Enterprises (SOEs) must undergo reform and should be privatized. The private sector must take the lead, and the dependency on the government must be reduced to allow for more efficient and effective management” he mentioned. “Exploring sustainability and the persuasive potential of literature being a key driver for a better world.”\nJane Marriott CMG OBE, British High Commissioner to Pakistan said, “UK is focused on both Climate and Educational emergency in Pakistan and hopes to bring a substantial change for the future generations. It is an obligation on all of us – even those with a modicum of power – to bring a shift. Words can change mindsets, but actions are needed.”\nNatalie Baker, sharing her excitement said, “I have been here only three months, but I would encourage everyone to learn more about the absolutely wonderful culture, language and history of Pakistan.”\nSharing her perspective, Maleeha Lodhi stated “Utilization of the undervalued soft power is needed for navigating the terrain of global environment today. Sans agility we risk being marginalized, and therefore we must work with the technology in the increasing digital world and utilize the outreach of social media to maintain a positive image.”\nArshad Hussain said, “In this age of constant innovation, understanding the minds shaped by the digital era becomes paramount. We must move beyond traditional systems to build one that meets the evolving needs of a world torn by conflict yet striving for connection.”\nZehra Nigah, known for her poetry highlighting social issues, appreciated the equitable stance of the OUP, by always ensuring perfect exposure to Urdu literature.\n“Literature festivals have shown a remarkable resilience; amidst all chaos – the words of literature have proudly held their place.”\nExploring Urdu poetry with Inaam Nadeem, the talk highlighted concerns for new writers and poets to move forward beyond the traditions and explore new avenues. Significant insights into the value of Pushto literature were shared by eminent guests in conversation with Afrasiab Khattak.\nThe festival, over the next two days, is set to explore an exciting lineup of activities, including author signings, a book fair, a food court, and media rooms, making it a must-visit attraction for art enthusiasts.\nAbout Oxford University Press Oxford University Press (OUP) is a branch of the University of Oxford, dedicated to global publishing for various audiences. They produce dictionaries, educational materials, children’s books, journals, and more. With roots dating back to 1478, OUP received printing rights in 1586, extended to cover all book types in 1636.\nThe Press is overseen by Delegates from the university’s faculty who approve proposals and work closely with editors.\nThe Chief Executive, also known as the Secretary to the Delegates, manages OUP’s operations. Presently, OUP operates in 50+ countries, publishing in 90+ languages, making it the largest university press globally.\nAbout OUP Pakistan Oxford University Press Pakistan, established in 1952, operates as Oxford University Press Pakistan (SMC-Private) Limited.\nIt has its head office in Karachi and regional branches in Lahore, Islamabad, and Multan, with additional bookshop-cum-offices in Peshawar and Faisalabad. The press focuses on education, publishing school textbooks, higher education materials, academic works, and reference materials.\nIt covers a wide range of subjects, including law, economics, literature, and more. OUP Pakistan also emphasizes local content, supporting Pakistani authors and books about Pakistan. It distributes its publications globally through offices in Oxford, New York, Dubai, and Delhi.\nThe press advocates for cultivating a culture of book-reading in Pakistan and fights against piracy. The name ‘Oxford’ signifies authority and quality in Pakistan and around the world.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:08:44.840Z"
}
