{
  "title": "Monsoon emergency helpline 16 becomes functional: PMD",
  "link": "https://www.app.com.pk/national/monsoon-emergency-helpline-16-becomes-functional-pmd/",
  "date_published": "2022-07-06T05:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP):An emergency helpline number ’16’ has become functional and section 144 is being imposed near rivers and dams during the current spell of monsoon, said Pakistan Meteorological Department (PMD) on Wednesday.\n“All authorities concerned are advised to remain vigilant and take precautionary measures during the forecast period”, said PMD Director Dr Zaheer Ahmad Baber while talking to a private news channel.\n“The caller will only have to dial 16 and it will be routed to the flood emergency response department concerned”, he added.\nUnder the influence of this weather system, a rain-windstorm and thundershowers are expected in Islamabad, Kashmir, Gilgit-Baltistan, Swat, Mansehra, Kohistan, Abbottabad, Haripur, Peshawar, Mardan, Swabi, Nowshera, Rawalpindi, Murree, Attock, Chakwal, Jhelum, Sargodha, Hafizabad, M. B Din, Sialkot, Narowal, Lahore, Gujranwala, Gujrat, Sheikhupura, Faisalabad, Jhang, Okara, Sahiwal and Bahawalnagar.\nHe advised travelers and tourists to remain extra cautious during the forecast period.Pakistan Disaster Management Authority (PDMA) had already directed all relevant departments to spread awareness among the public about urban flooding and how to prevent it.\nWe all were fully prepared to deal with any kind of emergency, he added.Replying a question, he said that people living close to river plains and watercourses had been issued timely alerts and all provincial health departments had also been advised to ensure placement of necessary staff and medicines where required.\nA comprehensive action plan for preventing flood in Nullah Lai and other drains of the city had been devised to mitigate flood and damages from it, the PMD Director concluded.",
  "retrievedAt": "2025-08-11T15:12:49.076Z"
}
