{
  "title": "Rs nine billion disbursed among 4.9 million existing beneficiaries of Benazir Kafalat program",
  "link": "https://www.app.com.pk/national/rs-nine-billion-disbursed-among-4-9-million-existing-beneficiaries-of-benazir-kafalat-program/",
  "date_published": "2022-07-06T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 6 (APP): Over nine billion rupees have been disbursed among 4.9 million existing beneficiaries of Benazir Kafalat program under the Sasta Petrol/Sasta Diesel Scheme being executed by Benazir Income Support Program (BISP).\nAccording to an official source, the existing beneficiaries of Benazir Kafalat program are receiving their payments of Rs 2000 from the designated banks while the process of payments to those who are applying through 786 SMS service will start soon.\nTill Wednesday, out of eight million registered families of Benazir Kafalat program, 4.9 million existing beneficiaries of Benazir Kafalat program have received their amount.\nAfter receiving payment message from BISP, the registered families of Benazir Kafalat Program belonged from Punjab, Sindh and Balochistan may receive their payments from biometric ATMs of Habib Bank and those from Khyber Pakhtunkhwa, Gilgit Baltistan and Azad Jammu and Kashmir from Bank Alfalah.\nAll those who are not registered with Benazir Kafalat program and have applied in the scheme by sending an SMS to 786 are requested to wait for the message of eligibility and payment.\nThey will receive a payment message shortly after the message of fulfilling the required eligibility criteria.\nIt is pertinent to mention here that the federal cabinet approved a relief package of worth Rs 28 billion to counter the effects of increased petroleum prices on the poor citizens.\nThe package covering 14 million families (overall 90 million people) which is around 30 percent of the total population has entered the phase of execution through starting payments of Rs 2000 to the existing eight million beneficiaries of Benazir Kafalat Program.\nHowever, six million people are being identified through the National Socio-Economic Registry (NSER). Those who have less than Rs 40,000 monthly income can apply for the scheme through sending SMS to 786.",
  "retrievedAt": "2025-08-11T15:12:46.898Z"
}
