{
  "title": "Splashing colours brings joy on Holi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The full moon and harvest time, when the agriculture fields are lush with bright yellow mustard flowers swaying in the breeze, was also an occasion for the Hindu community to celebrate the Holi, the festival of colour.\n\nAs members of the Hindu community arrived in huge numbers at the main gate of the Shri Swaminarayan Mandir on Thursday, the big ground behind the temple echoed with laughter and exclamations of delight. “Happy Holi!” “Holi Hai!”\n\nRight in the middle of the big ground, the firewood and hay Holi Mata, resembling a Native American teepee, was ready to be set ablaze. Families were taking rounds around it while praying as they sprinkled holy water. Newly-married couples and new mothers with their metal thalis that had a coconut, incense sticks, a small diya and some fruit and sweets, along with different powdered colours such as red, pink, yellow, blue, purple and green, carried out the puja rituals.\n\nIt was quite a challenge for Khushi, a young mother, to control Aradhya and Yuvika, her two little girls, who had arrived with balloons full of coloured water in a bucket. “They plan to throw the water bombs on people and I can’t stop them,” the helpless mother told Dawn. She, in fact, became her mischievous daughters’ first victim. Drenched to the skin, she also couldn’t be mad at them.\n\nThere was also young Kartik, who was regretting not having a water cannon, they called a pichkari, to drench people. “They were being sold near the main gate and we offered to buy him one before coming to the ground but he did not want it then,” said Kavita, his mother. “Now after seeing so many children playing with pichkari, he is asking him to also buy him one,” his father Mukesh Kumar added, smiling and shaking his head.\n\nMeanwhile, Pawan Kumar, who had arrived at the temple from Punjab Chowrangi, said that he had been coming there every day. This time he was taking with him boxes of vegetable biryani. “It is a prasad offering as well as delicious food,” he said. “I’m just going to safely place the boxes inside my car before going back to play Holi,” he smiled.\n\nThere was loud music playing famous Holi songs from Bollywood movies along with the dowsing and splashing of colours until it was time to set ablaze the Holi Mata. Then you could only hear bhajans as the fun turned into rituals of faith. With a microphone in hand, one of the temple volunteers, Vinod Madhani, led the bhajan singing with “Om Jai Jagdish Hare”, which gradually turned into a chorus with everyone else joining in. The children too stopped their games until the Holi Mata had burned down completely. Then it was back to the festivities.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d384a7ae27e.gif",
  "retrievedAt": "2025-08-25T15:10:45.689Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897769/splashing-colours-brings-joy-on-holi",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:56:15.000Z"
}
