{
  "title": "Media’s role crucial for climate action, says UK diplomat - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistani journalists have a crucial role in highlighting climate action and holding the government accountable for its commitments, said Jo Moir, Development Director at the British High Commission, on Thursday.\n\nSpeaking at a Climate Journalist workshop, she acknowledged the challenges faced by journalists covering climate stories. She emphasised three key areas where climate journalists could focus their reporting: Nationally Determined Contributions (NDCs), climate finance, and glacial preservation.\n\n“The nationally Determined Contributions are at the heart of discussions on mitigating climate change. Journalists can play a critical role in tracking these commitments and ensuring countries are held accountable, especially when targets start to slip,” she said.\n\nThe second crucial aspect, she noted, is climate finance. “This is a technical subject that involves international climate funds, climate negotiations, and the role of private sector investments”.\n\nIt is imperative that financial commitments on climate action are met and funds are utilised effectively. The third key issue specific to Pakistan is glacial preservation. Moir highlighted that the year has been declared by the UN as the International Year of Glacial Preservation.\n\n“Pakistan, with its 7,000 glaciers, faces severe challenges such as rapid glacial melting, glacial lake outburst floods, and water scarcity. These directly impact communities, making it essential to bring these issues to global attention.”\n\nShe also stressed the importance of amplifying youth voices in climate reporting. “Young people are inheriting a world where action is urgently needed.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:56:35.541Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897796/medias-role-crucial-for-climate-action-says-uk-diplomat",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:55:38.000Z"
}
