{
  "title": "Bilawal praises Balochistan train rescue, says it ‘exposed terrorists to whole country’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP Chairman Bilawal Bhutto Zardari on Friday praised the Balochistan government and law enforcement agencies (LEAs) for the Jaffar Express rescue operation, saying it “exposed the terrorists to the whole country.”\n\nThe hijacking took place on Tuesday afternoon when the Jaffar Express train, en route from Quetta to Peshawar with 440 passengers aboard, was attacked by Balochistan Liberation Army (BLA) militants. The attackers opened fire and took the passengers hostage, leading security forces to launch a two-day operation to rescue them.\n\n“I commend the provincial government and law enforcement agencies for this success, and we stand united with them,” Bilawal said during a ceremony in Karachi.\n\n“This was an outrageous and heinous terrorist attack. When we learned that it had occurred in such a remote location, I anticipated a prolonged operation. However, the efficiency and speed with which this incident was handled not only led to its swift resolution but also exposed these terrorists to the entire country.”\n\nThe former foreign minister added that whether it was religious terrorism or terrorism under any other pretext, the PPP and all its workers were committed to tackling this challenge.\n\n“God willing, the entire country will succeed in this war,” he said.\n\n“I’m sure you all would join me in condemning the outrageous terrorist attack in Balochistan over the last couple of days and saluting the bravery with which our armed forces not only took on the terrorists but freed those in captivity,” Bilawal added.\n\nOn Wednesday evening, Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry had confirmed the conclusion of the operation, stating that all 33 terrorists present at the site were neutralised. He also confirmed that 21 passengers and four Frontier Corps personnel lost their lives in the hijacking, but no hostages were harmed during the final rescue phase.\n\nOn Thursday, a high-level security conference was held in Quetta, reaffirming the state’s resolve to counter any attempt to destabilise Pakistan with full force. Prime Minister Shehbaz Sharif, Chief of Army Staff General Syed Asim Munir, federal and provincial ministers, senior civil and military officials, and representatives of political parties attended the meeting, according to state-run Radio Pakistan.\n\nFollowing the moot, PM Shehbaz, in a press conference, urged national unity and called on Pakistan’s political leadership to sit together with the military to discuss the challenges facing the country.\n\nBalochistan has witnessed an uptick in terrorist attacks over the past year. In November 2024, at least 26 people were killed and 62 injured after a suicide blast ripped through a Quetta Railway Station.\n\nIn 2024, the banned BLA emerged as a key perpetrator of terrorist violence in Pakistan, according to a report by Islamabad-based think tank Pak Institute for Peace Studies (PIPS).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/14140306d108f70.jpg",
  "retrievedAt": "2025-08-25T15:10:31.110Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897854/bilawal-praises-balochistan-train-rescue-says-it-exposed-terrorists-to-whole-country",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T09:15:13.000Z"
}
