{
  "title": "RESCUING THE RIVER - Newspaper - DAWN.COM",
  "author": null,
  "content": "“WE HEAR about the protests almost daily; another one is planned [today] at different locations along the mighty Indus in Sindh. We will be doomed if water flows downstream shrink further.”\n\nThirty-something Shaukat Mallah is a fisherman who is desperately awaiting monsoon rains, as they will restore flows in the river. With the rising water comes his prized catch — the culinary delight of palla machli.\n\nLast year, Shaukat recalls, his group was only able to catch just over a dozen. But since October, with flows dwindling to a trickle, the chances of bagging a palla have become very slim indeed.\n\nSitting at a small shop on the riverbank in Jamshoro’s Sain Dino village, he expresses the hope that better flows downstream of Kotri will help him have a decent catch this year.\n\nProtests against new canals and Sindh’s water-related grievances highlight the same issue; the amount of water available in the Indus system is dwindling\n\nThe protests he refers to are those being staged against the plan to draw more canals from the Indus to irrigate corporate farming projects in south Punjab and Sindh.\n\nThis controversial project has divided riparian communities up and down the country, with the representatives of Sindh being the most in their critique.\n\nOn March 14, the world observes the International Day of Action for Rivers.\n\nOn this day, diverse communities all around the world come together to call for the preservation of these life-giving waterways, which are increasingly under threat from pollution, non-sustainable growth and the drying out of their catchment areas.\n\nFor people like Shaukat, the canals project is just such a threat. Looking out towards the bone-dry river bed, he says he has to find odd jobs, like masonry work, to earn a living while waiting for the water to rise.\n\nWorried farmers\n\nFlows downstream of Kotri have been almost negligible since November. On March 13, the level of Tarbela’s reservoir stood at 1,404.5 feet, against a dead level of 1,400 feet. The Indus River System Authority (Irsa) has already warned Punjab and Sindh to brace for up to 35pc shortage in last leg of the Rabi season.\n\nIn Sukkur, one can already see a shortage. “An overall 40pc shortage is being observed in Sindh,” Aziz Soomro, who is in charge of the control room at Sukkur Barrage, told Dawn on Thursday.\n\nBut despite this trend, farmers in Sindh say that their counterparts upstream have continued to scale up production and cultivated area, without any care for what happens downstream.\n\n“Its not only that the area of cultivation in Punjab has increased, but the number of crops that consume more water has also gone up,” argues Sindh Abadgar Board (SAB) President Mahmood Nawaz Shah.\n\nThere has been an almost 19 per cent increase in paddy acreage between the years 2022-23 and 2023-24. Sugarcane crops, which occupy around 0.65m acres in Sindh, stand over 2.3m acres in Punjab, he says.\n\nSea intrusion\n\nBut freshwater fishermen or farmers aren’t the only ones affected by the declining flows; sea intrusion is another major problem for Sindh, caused by the depletion of river flows.\n\nThis phenomenon is already manifesting itself at an alarming rate in the coastal Thatta, Sujawal and Badin districts, forcing entire villages to relocate. Even the government doesn’t know the full extent of the displacement caused by the seawater’s march upstream.\n\nMunawar Ali Baloch is no stranger to this occurrence. A former resident of the Kharochhan taluka of Thatta, he becomes nostalgic during an encounter at the Khobar creek, where the waters of the Indus head towards the Arabian Sea.\n\n“Our area was known for rice cultivation; we had fertile lands and orchards too. They are nowhere to be found today”, he says, despairingly.\n\nBut the May 1999 cyclone wreaked havoc in coastal districts, Munawar says, adding that while the sea eventually receded, it turned the groundwater brackish.\n\nSince 2019, Munawar has lived in the Bagan area of Keti Bandar, where he makes a living by catching and selling mud crabs.\n\nDwindling flows\n\nEvery year, the use of two link canals by Punjab causes acrimony with Sindh. In the lower riparian’s view, Punjab draws water from the Indus, through these two canals, while Sindh faces shortage in kharif. This is why Sindh vehemently opposes the diversion of Indus river water upstream for any new project or canal.\n\nAccording to Sindh Irrigation Secretary Zarif Khero, an analysis of data from 1976-77 to 2023-24 on flows downstream of Kotri shows that 26.807MAF are the average flows recorded in this period.\n\nThis period was actually marked by frequent floods, he explains, adding that after 1999, the river dynamics changed completely due to climate change.\n\nOver the past quarter century, provincial irrigation data shows that average flows at Kotri were around 14.035 MAF. Similarly, from 1997 onwards, the number of ‘zero flow days’ in a year has only increased; since the year 2000 to 2018, the number of ‘zero flow’ days has well remained above 300.\n\nShifts in climatic patterns have also interfered with the regularity of river flows. A case in point is the recent snowfall in the country’s northern areas, which began nearly two months later than usual. The annual cycle of precipitation in the river’s catchment area which yields greater flows in spring and summer has also been disturbed.\n\nWith more and more people and crops to quench, it is obvious that the amount of water available in the Indus system is only going to decrease in the years to come. If remedial measures are not taken quickly, the ecosystems that Shaukat and Munawar have depended on for years and years may disappear completely.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:57:45.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897797",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:55:38.000Z"
}
