{
  "title": "Barbs fly even as NA resolves unity against terror - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Heated debate between PTI, PML-N members over Jaffar Express incident\n• Defence minister accuses PTI of ‘siding with BLA’\n• Asif’s resignation sought over security lapse\n• Terrorists taking advantage of disunity: Bilawal\n\nISLAMABAD: The National Assembly on Thursday witnessed a heated exchange between lawmakers of the ruling PML-N and the opposition PTI, as the House unanimously adopted a resolution calling for national unity against terrorism and extremism.\n\nThe resolution, tabled by Federal Minister for Parlia­mentary Affairs Dr Tariq Fazal Chaudhry, condemned the recent hijacking of the Jaffar Express train in Balochistan and all forms of terrorism that endanger citizens’ lives. The House vowed to take “every possible measure to eliminate terrorism” and pledged that no terrorist activity would go unchecked.\n\nIt affirmed that “no group, no individual and no ideology that seeks to undermine our nation’s peace, prosperity and sovereignty will be allowed to spread fear, hatred or violence within the territorial limits of the country”.\n\nThe National Assembly also committed to “working relentlessly to root out terrorism in all its forms and manifestations, ensuring that those who attempt to destabilise the country face the full force of the law”.\n\nIn his speech, Defence Minister Khawaja Muhammad Asif accused the PTI of sympathising with the banned Balochistan Liberation Army (BLA). He criticised PTI leaders for allegedly “politicising” the Jaffar Express hijacking on social media and accused them of misrepresenting facts.\n\nHe claimed that certain PTI figures abroad, through their verified accounts, had credited the release of hostages to the terrorists. When opposition lawmakers demanded he name such individuals, Mr Asif reto­rted, “Why should I name those who lack the courage to fight while remaining in Pakistan?”\n\nWhen Mr Asif called such people absconders, a PTI lawmaker, in return, recalled that Nawaz Sharif remained an absconder for quite some time.\n\nTaking a jibe at PTI leader Omar Ayub Khan, who is the grandson of former dictator Gen Ayub Khan, Mr Asif said, “Those people mocked us on Form-47 who have had three martial laws, whose elders abrogated the Constitution of Pakistan for the first time.”\n\nHe criticised the former dictator for “stealing the right to vote” from the people and handing it to 80,000 people in the name of “basic democracy”.\n\n“Until we, as politicians, do not acknowledge the mistakes of the past 76-77 years as a nation and community, we would not be able to proceed ahead,” he said.\n\nBilawal warns of rising terrorism\n\nPakistan Peoples Party (PPP) Chairman Bilawal Bhutto-Zardari, addressing the House, warned that terrorists were exploiting political disunity.\n\nHe stressed that the PPP had long opposed all forms of terrorism — religious, separatist or politically motivated — and had paid a heavy price, including the assassination of his mother, former prime minister Benazir Bhutto.\n\n“The fire of terrorism has erupted again, and we are in a more vulnerable position than before,” he said, adding that Pakistan lacked the unity and consensus it once had, allowing terrorists to take advantage.\n\nMr Bhutto-Zardari said continuous attacks from Khyber Pakhtunkhwa to Balochistan were a growing threat.\n\n“Terrorists have no ideology, no religion. Their only aim is to obstruct Pakistan’s progress, backed by foreign funding and logistical support,” he said.\n\n“From Parachinar to Bolan, these people are playing Holi with the blood of the Pakistani people. Every political party should term these terrorists as a common enemy,” he added.\n\nThe PPP chairman urged political parties to unite against terrorism and suggested the formation of a National Action Plan 2.0, similar to the first NAP launched under Nawaz Sharif’s government.\n\n“We fulfilled the expectations of the people in the shape of the 18th Amendment and the NFC Award. We combatted the people who are not willing to accept humanity and our Constitution. We defeated them in North and South Waziristan, Karachi, Balochistan and Fata. We can defeat them again,” he said.\n\nAsad criticises security failures\n\nPTI parliamentarian and former National Assembly speaker Asad Qaiser criticised the government’s handling of national security, arguing that Defence Minister Asif should have briefed the House on the Jaffar Express attack instead of engaging in political mudslinging.\n\n“It seems PTI and social media are occupying the minister’s mind more than national security,” he said, adding that Mr Asif should demonstrate moral courage and tender his resignation for the serious security lapse.\n\n“How can a policy against terrorism be devised when there is no representative government in the centre and no respect for the Constitution?” he asked, alleging that the absence of legitimate governance had weakened the country’s security apparatus.\n\nHe also questioned the treatment of Baloch leaders, mentioning the arrests and legal actions against Sardar Akhtar Mengal and Adil Bazai. “There is no Constitution, law and respect for institutions in the country,” he said.\n\nHe said Pakistan would have to revisit its foreign policy, particularly due to strained relations with Iran and Afghanistan.\n\nMr Qaiser said the government needed to address the root causes of terrorism and added that no promised development projects were undertaken in ex-Fata districts.\n\nDurable solution for peace\n\nPashtoonkhwa Milli Awami Party (PkMAP) Chief Mah­mood Khan Achakzai criticised Pakistan’s historical policy of supporting foreign militants.\n\nHe urged the government to acknowledge past blunders, prioritise the supremacy of parliament and recognise the right of provinces over their resources.\n\nHe also lamented alleged electoral manipulation, saying, “Pakistan is at a critical juncture, and we must accept that the real winners of the general elections [of 2024] were the party of Prisoner No. 804 [a reference to imprisoned PTI founder Imran Khan].”\n\nMQM-P leader Dr Farooq Sattar called for finding a durable solution for peace in the country instead of short-term firefighting measures.\n\nHe noted that rising terrorism was linked to political polarisation and called for revising the National Action Plan to reflect new security challenges.\n\nMr Sattar also proposed convening a multi-party conference in response to the Jaffar Express attack, similar to the one held after the 2014 Army Public School massacre.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/14084538516c5d8.jpg",
  "retrievedAt": "2025-10-12T01:56:46.057Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897737/barbs-fly-even-as-na-resolves-unity-against-terror",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:55:25.000Z"
}
