{
  "title": "Balochistan Assembly condemns use of women for suicide attacks - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan Assembly on Thursday adopted a resolution condemning the use of women in terrorist activities in the province.\n\nThe lawmakers proposed a joint action plan in consultation with all stakeholders to restore peace and order in the province.\n\nThe resolution was moved by Meena Majeed, the chief minister’s adviser, during the session presided over by Speaker Abdul Khaliq Achakzai on Thursday.\n\nBaloch separatists have used women to carry out attacks in recent months.\n\nJoint action plan urged to restore peace in province\n\nEarlier this year, a Frontier Corps (FC) personnel was martyred in a suicide attack by a woman bomber in Balochistan’s Kalat district.\n\nThe resolution emphasised the importance and respect of women in Baloch society, calling it a “significant and beautiful aspect” of their culture.\n\nMs Majeed said the Balochistan government was providing women with opportunities in every field, fostering their involvement in education, politics and social sectors.\n\nShe expressed regret that terrorist organisations were exploiting Baloch women and innocent students for their malicious purposes.\n\nShe said these groups were using women as suicide bombers, thus contributing to the exploitation and degradation of Baloch women and their social values.\n\nMs Majeed condemned the terrorists and called on the government to take immediate steps against them.\n\nThe resolution further stressed that the recent terrorist attacks in the province must be strongly condemned and necessary action should be taken to stop these groups from violating the dignity and values of Baloch women.\n\nMember of Provincial Assembly Ali Madad Jattak also condemned the use of women as shields by terrorists and claimed that foreign interference in the country was evident.\n\nProvincial Minister Noor Muhammad Dummar said the attacks on innocent people and forces by terrorists were a challenge that must be confronted.\n\nSeveral members highlighted the deteriorating economic conditions, rising unemployment, and social inequalities as contributing factors to the instability in Balochistan.\n\nOpposition Leader Mir Younis Aziz Zehri condemned the Jaffar Express attack and called for a united approach to find solutions.\n\nZabid Ali Reki pointed out that the worsening situation in Balochistan was leading to attacks on leaders of Jamiat Ulema-i-Islam, and political parties need to come together to address the causes of the instability.\n\nProvincial Minister Sardar Abdul Rahman Khetran expressed concern over receiving threat calls he received the previous night.\n\nHe said he had traced the phone number and identified a suspect person. The minister added that he is free to settle the matter at the tribal level.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:10:59.815Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897794/balochistan-assembly-condemns-use-of-women-for-suicide-attacks",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:55:38.000Z"
}
