{
  "title": "Asteroid probe snaps rare photos of Martian moon - World - DAWN.COM",
  "author": null,
  "content": "PARIS: On the way to investigate the scene of a historic asteroid collision, a European spacecraft swung by Mars and captured rare images of the red planet’s mysterious small moon Deimos, the European Space Agency (ESA) said on Thursday.\n\nEurope’s HERA mission is aiming to find out how much of an impact a Nasa spacecraft made when it deliberately smashed into an asteroid in 2022 in the first-ever test of our planetary defences. But HERA will not reach the asteroid — which is 11 million kilometres from Earth in the asteroid belt between Mars and Jupiter — until late 2026.\n\nOn the long voyage there, the spacecraft slingshotted around Mars on Wednesday. The spacecraft used the planet’s gravity to get a “kick” that also changed its direction and saved fuel, mission analyst Pablo Munoz told a press conference.\n\nFor an hour, HERA flew as close as 5,600 kilometres from the Martian surface, at a speed of 33,480 kilometres an hour. It used the opportunity to test some of its scientific instruments, snapping around 600 pictures, including rare ones of Deimos.\n\nThe lumpy, 12.5 kilometre-wide moon is the smaller and less well-known of the two moons of Mars.\n\nExactly how Deimos and the bigger Phobos were formed remains a matter of debate. Some scientists believe they were once asteroids that were captured in the gravity of Mars, while others think they could have been shot from a massive impact on the surface.\n\nThe new images add “another piece of the puzzle” to efforts to determine their origin, Marcel Popescu of the Astronomical Institute of the Romanian Academy said.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d387fdbb473.gif",
  "retrievedAt": "2025-10-12T01:57:10.649Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897791/asteroid-probe-snaps-rare-photos-of-martian-moon",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:56:04.000Z"
}
