{
  "title": "Johns Hopkins University slashes 2,000 jobs after Trump administration grant cut - World - DAWN.COM",
  "author": null,
  "content": "The Johns Hopkins University said on Thursday it will slash over 2,000 jobs in the US and abroad after the administration of President Donald Trump terminated $800 million in grants to the renowned academic institution.\n\nIt marked the biggest layoff in the university’s history and involved 247 domestic US workers for the academic institution and another 1,975 positions outside the US in 44 countries.\n\nThe job cuts impact the university’s Bloomberg School of Public Health, its medical school and affiliated non-profit for international health, Jhpiego.\n\n“This is a difficult day for our entire community. The termination of more than $800 million in USAID funding is now forcing us to wind down critical work here in Baltimore and internationally,” the university said in a statement shared with media.\n\nSince taking office on January 20, Trump and his billionaire ally Elon Musk have attempted to dismantle the US Agency for International Development.\n\nThe Trump administration has canceled more than 80 per cent of all the programmes at USAID following a six-week review, US Secretary of State Marco Rubio said on Monday.\n\nIn addition to attacks on the US foreign aid agency, the Trump administration is also probing 60 American universities, including Hopkins, over pro-Palestinian protests on campuses.\n\nThe Trump administration alleges protesters are anti-Semitic.\n\nDemonstrators deny the allegations and say the US government is conflating their criticism of US ally Israel’s military assault on Gaza that has killed at least 48, 515 Palestinians with anti-Semitism.\n\nLast week, the US cancelled $400 million in grants and contracts to New York’s Columbia University.\n\nThe Trump administration is also seeking to deport Mahmoud Khalil, a Palestinian graduate student who has played a prominent role in pro-Palestinian protests at Columbia.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:10:30.760Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897841/johns-hopkins-university-slashes-2000-jobs-after-trump-administration-grant-cut",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T09:34:52.000Z"
}
