{
  "title": "Drug rehab to be part of Sehat Card programme: KP CM - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur on Thursday announced that drug rehabilitation would soon be integrated into the government’s Sehat Card health insurance programme.\n\nHe made the announcement during a special ceremony held here to reunite over 1,200 drug addicts, rehabilitated in four months, with their families.\n\nCabinet members, MNAs and MPAs, government officials and civil society representatives attended the event.\n\nA statement issued here said that during the third phase of Drug-Free Peshawar initiative, which ran from Nov 2024 to March 2025, a total of 1,239 addicts were rehabilitated.\n\n1,200 drug addicts reunited with families after rehabilitation\n\nIt said that on this occasion, individuals who had successfully completed the Drug-Free Peshawar programme’s third phase were reunited with their families.\n\nThe third phase of the programme was launched in November 2024, during which 1,239 drug addicts were rehabilitated. Among them were 13 women and 28 underage boys. The rehabilitated individuals included 611 from Peshawar, 536 from other districts of the province, 48 from Punjab, 10 from Sindh, and 26 Afghan citizens.\n\nThis is the largest drug rehabilitation programme to date, with a substantial allocation of Rs320 million.\n\nChief Minister Gandapur expressed joy at the reintegration of rehabilitated individuals with their families and said the programme aimed to make the province drug-free and help addicts return to normal life so they can become productive and responsible citizens.\n\nMr Gandapur emphasized that this initiative is not limited to the province alone but is a nationwide and even global programme, as people from other provinces and even Afghanistan have benefited from it. “We do not reject anyone based on their province or nationality,” he added.\n\nAli Amin Gandapur highlighted that this rehabilitation project began in 2022, and in its first two phases, a total of 2,400 drug addicts were successfully treated. This included 1,154 individuals from Peshawar, 1,039 from other districts of Khyber Pakhtunkhwa, 170 from Punjab, Sindh, Balochistan, Azad Jammu and Kashmir, and Gilgit-Baltistan, and 34 foreign nationals.\n\nMr Gandapur said that his leader’s vision is to establish a welfare state where the government cares for its people like a mother.\n\n“The deputy commissioners only need to bring drug addicts to the relevant office, and the government will bear the cost of their treatment,” he said.\n\nThe chief minister urged people to hand over drug addicts for rehabilitation and said the government would ensure their treatment.\n\nHe said that drugs neither brought happiness nor peace; they only led to destruction.\n\n“True peace and progress lie in following the commandments of the Almighty Allah,” he said.\n\nThe chief minister urged people to fight against drug dealers and expel them from their communities.\n\n“The police will support you. Inform them, and they will take immediate action. We must not spare drug dealers, as they are the enemies of our children and youth,” he said.\n\nMr Gandapur emphasised the collective responsibility to eliminate drugs and drug traffickers. He thanked the business community for providing employment opportunities to rehabilitated individuals.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:57:10.450Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897755/drug-rehab-to-be-part-of-sehat-card-programme-kp-cm",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:56:33.000Z"
}
