{
  "title": "Aurangzeb vows support for EU businesses in Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb on Friday expressed the government’s commitment to supporting European Union (EU) businesses in Pakistan and facilitating their operations, which included ensuring the timely repatriation of dividends and profits, state-owned Radio Pakistan reported.\n\nIn Jan, exports to European countries grew8.62 per cent in the first five months of FY25, driven by higher shipments to western states. Pakistan’s exports to the EU rose to $3.866 billion in July- November, up from $3.559bn a year earlier, according to the State Bank of Pakistan data.\n\nThe EU is Pakistan’s second-largest trading partner, with GSP+ status granting duty-free or minimal-duty access. However, the scheme requires tangible progress on 27 international conventions covering human and labour rights, environmental protection, climate change, and good governance.\n\nTalking to the Ambassador of the European Union, Riina Kionka, in Islamabad, Aurangzeb expressed appreciation for the EU’s support for Pakistan, particularly the importance of the GSP Plus facility.\n\nHe highlighted that GSP+ had been critical for Pakistan’s efforts to drive export-led growth.\n\n“The two sides reaffirmed their shared commitment to enhancing the economic and trade ties between Pakistan and the European Union and to creating a thriving and mutually beneficial business environment for both sides,” the report said.\n\nDr Kionka emphasised that European companies are increasingly viewing Pakistan as a hub for potential business opportunities, according to the report.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/141457291e93a4f.jpg",
  "retrievedAt": "2025-08-25T15:10:31.936Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897852/aurangzeb-vows-support-for-eu-businesses-in-pakistan",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T08:39:12.000Z"
}
