{
  "title": "IHC to hear plea challenging govt’s powers to promote officers today - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court will resume on Friday (today) hearing of a petition challenging arbitrary powers of the government to promote or supersede officers on the basis of vague rules.\n\nThe matter related to the government’s arbitrary powers to promote blue-eyed bureaucrats was brought before the IHC by BS-21 officer of the Federal Board of Revenue (FBR) Shah Bano Ghaznavi.\n\nThe petitioner said that the recent promotions, postings and transfers in the top bureaucracy are politically motivated as the government has showered blessings on favourites and penalised those who are not in the good books of the government.\n\nIHC Justice Sardar Ejaz Ishaq Khan will resume the hearing on the petition of Ms Ghaznavi on Friday.\n\nPetition terms recent promotions, postings and transfers in top bureaucracy ‘politically motivated’\n\nIn the initial hearing of the case, Justice Khan questioned the FBR under which legal framework can the department decide to deprive an officer of his or her right to earn on-going Performance Evaluation Reports (PERs), which is his or her right under the law, for the purpose of promotion.\n\nWhat legally prescribed criteria is for removing an officer from a functional post and placing him or her in a so-called admin pool, which appears to the court to be just another name for an officer on special duty.\n\nIf the answers to the above two questions are not satisfactory, why should this court not refer this matter to the Supreme Court for appropriate direction to this court whether to initiate contempt proceedings, in view of the six-member judgement of the Supreme Court in Corruption in Haj Arrangements in 2010.\n\nIn its response, the FBR claimed that placing officers in the administrative pool is a long-standing practice which is aimed at ensuring the “operational efficiency”.\n\nThe court, however, dismissed this argument, stating that an unlawful practice does not become legal simply due to its duration.\n\nThe court also criticised the FBR’s reply for being evasive and failing to justify how such placements serve efficiency.\n\nThe petitioner’s counsel contended that the officer’s reassignment is based on a summary moved before the prime minister, suggesting undue influence in the promotion process.\n\nThe court found this claim serious enough to demand an official clarification.\n\nThe court directed the FBR chairman and the secretary to the prime minister’s office to submit affidavits confirming whether such a summary was moved.\n\nIf the affidavits are not filed, the court ordered that the relevant summary be placed on record before the next hearing.\n\nPublished in Dawn, March 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:56:25.662Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897799/ihc-to-hear-plea-challenging-govts-powers-to-promote-officers-today",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T01:55:38.000Z"
}
