{
  "title": "Finance Minister attends International Customs Day celebrations in Karachi",
  "link": "https://www.app.com.pk/national/finance-minister-attends-international-customs-day-celebrations-in-karachi/",
  "date_published": "2024-01-27T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):Caretaker Federal Minister for Finance, Revenue and Economic Affairs, Dr Shamshad Akhtar attended the International Customs Day (2024) celebrations in Karachi.\nThe event was held annually on January 26 to highlight the contributions of customs administrations across the globe, said a news release on Saturday.\nThe minister graced the occasion as the chief guest which was also attended by diplomats, civil servants, senior officers of the military and civil armed forces, business professionals and media representatives. The ceremony commenced with a Guard of Honor presented to the Chief Guest by a well-dressed contingent of Preventive officers and sepoys of the Collectorate.\nDr Shamsad called upon all stakeholders to work together to secure the international trade supply chain. She expressed optimism that the FBR would collect revenue of more than Rs9.4 trillion during the current financial year.\nShe said that a reform process based on consultation has also been initiated in FBR and highlighted the importance of Customs in cross-border trade.\nThe minister emphasized the importance of the Single Window activity in Customs operations. Member Customs Operations, Dr Fareed Iqbal Qureshi reiterated the need for new initiatives to keep abreast of the evolving role of Pakistan Customs for safeguarding the economic frontiers and ensuring all possible facilitation for legitimate trade.\nCollector of Customs Enforcement Karachi highlighted the need for inter-agency cooperation to tackle impediments being faced by Customs on the appraisement as well as enforcement side.\nThe Finance Minister also distributed certificates of merit issued by the World Customs Organization (WCO) for officers rendering exceptional services in the discharge of their duties. In line with the theme this year, Pakistan Customs also recognized other entities and law enforcement agencies for their cooperation in achieving its goals.\nLike every year, the World Customs Organization also dedicated this year to a special cause. The year 2024 was dedicated to the theme of “Customs Engaging Traditional and New Partners with Purpose” by the Organization which aptly captures the need for cooperation with other entities for effective service delivery by Customs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:58:21.090Z"
}
