{
  "title": "Kupwara Massacre victims’ families still await justice 30 years on in IIOJK",
  "link": "https://www.app.com.pk/national/kupwara-massacre-victims-families-still-await-justice-30-years-on-in-iiojk/",
  "date_published": "2024-01-27T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 27 (APP):The families of victims of Kupwara massacre in Indian illegally occupied Jammu and Kashmir (IIOJK) continue to await justice even after the passing of thirty years.\nOn January 27, 1994, a day after India’s Republic Day, Indian troops had massacred 27 civilians in Kupwara town. The mass killing was carried out by the troops to punish people for observing a shutdown on January 26, according to KMS.\nLocal people had told the media and investigation agencies that a day before the carnage took place, an Indian army officer had asked the local shopkeepers not to observe the shutdown and attend the Indian Republic Day celebrations at the local camp. However, the shopkeepers didn’t turn up at the celebrations.\nBut the next day, when they were opening their shops, Indian soldiers came in trucks and fired at them indiscriminately, killing 27 people and injuring scores of others.\nIn the wake of a petition filed by the Chairman of International Forum for Justice and Human Rights, Muhammad Ahsan Untoo, the Human Rights Commission of the occupied territory had asked the authorities concerned to submit a report about the massacre.\nThe police investigation team had sought response from the army, which issued a letter stating that a Court of Inquiry had been constituted to probe the incident but the outcome of the Court of Inquiry was not furnished to the police.\nThe Kupwara massacre is a reminder of the criminal face of Indian troops. The history of occupied Kashmir is filled with Kupwara-like massacres.\nIndian troops involved in Kupwara carnage and other mass killings in the occupied territory have not been punished till date.\nIndia must remember that such brutalities cannot stop Kashmiris from taking the freedom struggle to logical conclusion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:58:45.035Z"
}
