{
  "title": "ECP starts issuing postal ballot papers to eligible voters",
  "link": "https://www.app.com.pk/national/ecp-starts-issuing-postal-ballot-papers-to-eligible-voters/",
  "date_published": "2024-01-20T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): The Election Commission of Pakistan (ECP) has started the process of providing postal ballot papers to eligible individuals for the upcoming general elections for both national and provincial assemblies.\nThe forthcoming general elections in the country are slated for February 8 next month and the preparations for the event are in their final stages, an official told APP here Saturday.\nThe election oversight watchdog has specified a deadline of January 22 for submitting postal ballot paper applications.\nEligible voters must download a postal ballot application form the electoral authority’s website. Upon receiving the postal ballot, voters should then send their votes to the relevant District Returning Officer (DRO) within the specified time, he said.\n“The individuals receiving postal ballots will not have the privilege to cast their votes in person at the polling stations,” he said.\nThe application must be forwarded or endorsed by the voter’s office to prevent unauthorized individuals from applying for a postal ballot, as per the ECP. Once an application is received, the returning officer is obligated to send a ballot paper and envelope to the voter by post, in accordance with the Elections Act 2017.”\nThe envelope must display a certificate of posting on its face, with the posting date to be filled in by the relevant post office official when the voter sends it. Following the receipt of their postal ballot, the act states that a voter should record their vote as prescribed. Once recorded, the voter is required to post the ballot paper to the returning officer in the provided envelope, ensuring it arrives before the consolidation of results.\nThis provision of postal ballot is uniquely crafted to allow government officials, armed forces personnel, individuals in public offices, and their spouses and children residing away from their constituencies to cast their votes in advance of the official polling day.\nThe eligibility criteria also include individuals in detention and those with physical disabilities, given that they possess a computerized national identity card (CNIC) featuring a disability logo issued by the National Database and Registration Authority (NADRA).\nThe Election Commission has set January 22, 2024, as the deadline for receiving applications for postal ballot papers for the upcoming general elections to the national and provincial assemblies of Punjab, Sindh, Khyber Pakhtunkhwa and Balochistan,” the ECP official stated.\nThe official encouraged individuals appointed by Returning Officers, including police personnel and polling staff assigned to various polling stations, to submit their postal ballot applications within three days of their appointment.\n/395",
  "retrievedAt": "2025-08-10T23:46:26.482Z"
}
