{
  "title": "48th Int’l Seerat-un-Nabi Conference helps to promote religious harmony, economic wisdom",
  "link": "https://www.app.com.pk/national/48th-intl-seerat-un-nabi-conference-helps-to-promote-religious-harmony-economic-wisdom/",
  "date_published": "2023-09-18T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, September 18 (APP): The Ministry of Religious Affairs and Interfaith Harmony is all set to host the 48th two-day International Seerat-un-Nabi (Life of the Prophet Muhammad, Peace Be Upon Him (PBUH)  conference on the of Rabi-ul-Awwal 11 and 12   (September, 28 and  29) in the federal capital.\nThis conference will feature the distribution of awards for Seerat-related articles and books. The theme of this year’s competition for articles and books is “Practical Wisdom for Economic Prosperity in the Light of the Life of the Prophet Muhammad, Peace Be Upon Him.”\nNotably, all submitted articles and books are rigorously reviewed by a committee consisting of at least three experts, including professors with Ph.D. degrees.\nSubsequently, their reports are handed over to a high-level apex committee, which makes the final decision on which publications deserve recognition.\nThis year, a total of 137 books and 94 articles on Seerat were received, resulting in 31 individuals receiving awards for books and 35 for articles.\nThe 66 fortunate recipients will be honored with shields, certificates, and cash prizes.\nFurthermore, the Ministry of Religious Affairs and Interfaith Harmony plans to print and provide standard articles to libraries in universities across the country, as well as research institutions focusing on Seerat-un-Nabi Peace Be Upon Him.\nThe International Seerat-un-Nabi Conference will consist of two main sessions.\nIn the first session, awards will be presented to authors and poets who have participated in the Seerat-related competition.\nThe second session will explore various aspects of the Prophet’s life, with scholars and orators discussing topics related to economic concepts in light of Seerat-un-Nabi.\nThe conference aims to bring together renowned religious scholars, both national and international, to bridge intellectual gaps and promote understanding among scholars.\nIt is expected to have a positive impact on religious harmony and moral values.\nAdditionally, a Naat (eulogy) gathering will be held to celebrate the beloved Prophet Muhammad, Peace Be Upon Him, during the opening session of the conference.\nThe second day of the conference will feature the illumination of various facets of the Prophet’s life, with scholars and orators discussing topics such as economic stability, state’s role, charity, and women’s participation in economic growth, all in the light of Seerat-un-Nabi Peace Be Upon Him.\nThis event promises to be a significant platform for exchanging ideas and promoting a harmonious society based on the teachings of the Prophet Muhammad (PBUH).",
  "retrievedAt": "2025-08-11T09:41:19.340Z"
}
