{
  "title": "SC adjourns hearing in pleas against practice & procedure act till Oct 3",
  "link": "https://www.app.com.pk/national/sc-adjourns-hearing-in-pleas-against-practice-procedure-act-till-oct-3/",
  "date_published": "2023-09-18T18:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): The Supreme Court on Monday adjourned hearing till October 3, in petitions against Supreme Court Practice and Procedure Act 2023.\nIn a written order pertaining to this day’s hearing, the court said that the petitioners and Attorney General of Pakistan (AGP) have to answer the questions raised by the full court bench in this case. The AGP had told the bench that he had to visit Vienna in connection with a case about the Indus Water Treaty.\nIt said that the chief justice would hold a consultation with two senior judges about the challenges being faced by the said act. Justice Ijaz ul Ahsan and Justice Sardar Tariq Masood agreed on the point that the top court would prepare the practice and procedure itself. The court instructed the respondents to file written comments till the next date of hearing.\nIt said that the top court had been requested to form a full court bench to hear this case, adding that the petitioners had also not objected to it. Subsequently, the court decided to constitute a full bench comprising all 15 judges of the top court presided by Chief Justice of Pakistan Qazi Faez Isa heard the petitions against Supreme Court Practice and Procedure Act 2023. First time in the history of the country, the court decided to make a pilot experiment of a live telecast of a case proceeding through Pakistan Television (PTV).\nDuring the course of the proceeding, the federal government submitted written comments to the court and prayed the court to terminate the petitions against the act. It adopted the stance that the petitions against the legislation of the Parliament were not maintainable. It said that the Parliament was authorized to do legislation under Article 191 of the Constitution. It said that the act would affect the independence of the judiciary and Supreme Court.\nAt the outset of the hearing, the chief justice asked the petitioners’ lawyer to note down the questions of the court and answer once comfortably after the preparation.\nAddressing lawyer Khawaja Tariq Rahim, the CJP said that the top court has its own authority to exercise its powers, do you think the Supreme Court Rules 1980 are in conflict with the Constitution?\nHe inquired whether your client had any personal interest or brought the application in public interest.\nThe CJP said that the judge takes an oath that he will work under the Constitution and the law, what is my opinion or yours is not its position. He said the lawyer had not mentioned an article that was in conflict with the Constitution. If Parliament had attacked our right we would have taken it up like many cases, whose right can be taken away by this law, he asked.\nThe chief justice further said that I have taken an oath to obey the Constitution and the law, but I have not taken an oath to obey the decisions of the Supreme Court.\nHe asked the lawyer that tell me what is the violation of the Constitution. What is the original jurisdiction of the Supreme Court? Where fundamental human rights were violated should be told, he said.\nCJP Qazi Faez Isa said that if the decision of the 5-member bench was applied to the 3-member bench, the judges could never give a conflicting decision.\nJustice Athar Minallah questioned lawyer Khawaja Tariq if he supported what happened in the past. You tell me whether the whole law was wrong or a few clauses, he asked. He inquired the lawyer as he wanted to say that it was not the scope or power of Parliament to make this law. If the Chief Justice has unlimited power to form a bench then are you satisfied, he questioned.\nJustice Minallah said that read the entire law, the powers of the Chief Justice have been divided between him and two senior judges. If Parliament has abolished the monarchy of the Chief Justice, what is wrong with it? Which fundamental right is affected by granting the right of appeal? He said that the petitioners are saying that the law is good but the Supreme Court should have made it itself.\nJustice Munib Akhtar said that Article 184/3 is judicial power, and an attempt was made to prevent the court from exercising its powers. He asked how can a bench be constituted without judicial authority. He remarked that if the Parliament makes court rules, the power to regulate the court will also go to it.\nJustice Mansoor Ali Shah asked the lawyer to add one of his questions, if 17 judges sit and make this law, then it is right, if Parliament made it, then it is wrong? This is your whole case I think, he said.\nJustice Shah said that the Chief Justice is not the master of the roster in the whole world. By taking the authority of the Chief Justice, how has Article 9 been affected, he asked.\nHe further said that due to the division of power of the Chief Justice, the independence of the judiciary has increased, adding that it does not connect it with the independence of the judiciary and the powers of the Chief Justice.\nJustice Jamal Mandokhel inquired whether this authority was given to the Supreme Court in the Constitution or in the law and if the authority of the Supreme Court or the Chief Justice decreased after the law was introduced. He asked the lawyer do you want to limit the power of Parliament to legislate?\nJustice Ijaz ul Hassan said that Section 4 of the Act was in the Constitution of 1956 but was removed later, was no constitutional amendment required for this legislation?\nGiving arguments, AGP Mansoor Usman Awan said this law is related to the powers of a post, adding that this law will bring transparency to the institution. He said that these petitions are inadmissible. Under the Government of India Act, the Judiciary made laws with the approval of the Governor General, he added.\nHowever, under the Constitution of Pakistan, 1956, the Judiciary regulations were subject to the approval of the President, he said.\nJustice Munib said that the independence of the judiciary was mentioned in the Constitution of Pakistan in 1973. The executive branch was removed while making the Constitution, but the judicial branch was there.\nThe chief justice asked that when laws were made with the approval of the President, did the President have discretionary power or approval on advice?\nThe AGP said that the laws made by the Supreme Court in the United States must be consistent with the Congress Acts.\nThe Supreme Court Practice and Procedure Act addresses public concerns.\nAttorney General Mansoor Usman said that the case is before the full court, so I am keeping the defendant. No one’s rights are being violated by the Supreme Court Practice and Procedure Act.\nChief Justice of Pakistan Qazi Faez Isa said that my fellow judge has asked an important question, who will be the party affected by this legislation? Who is harmed by this act?\nGiving arguments, Lawyer Khawaja Tariq Rahim said that the Parliament created a committee of three judges to legislate the decision of public cases. He said according to Schedule 4 of the Federal Legislative List, the SC makes its own rules of practice and procedure.\nHe said that I am noting the questions and give the answer later. This application has been brought in the public interest. The three judges cannot sit and interpret the Constitution.\nAnother petitioner’s lawyer Imtiaz Siddiqui Advocate said that the authority of the Chief Justice of Pakistan has been affected, adding that the Parliament cannot do such legislation.\nHe said that if the prevailing procedure is not adopted, then the law of Parliament will also be wrong, and fundamental rights will be affected by the wrong procedure.\nThe AGP also prayed to the court to grant time for further arguments as he had to travel abroad. The further hearing of the case was, later, adjourned.",
  "retrievedAt": "2025-08-11T09:41:43.029Z"
}
