{
  "title": "Renowned architect Abdur Rahman Hye remembered",
  "link": "https://www.app.com.pk/national/renowned-architect-abdur-rahman-hye-remembered/",
  "date_published": "2023-09-18T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): Renowned architect Abdur Rahman Hye popularly known as A.R. Hye was remembered on Monday on the occasion of his death anniversary.\nHe is considered as pioneer of institutional architecture in Pakistan.\nBorn on December 17, 1919 Abdur Rahman Hye graduated from Sir J. J. College of Architecture, Bombay and then traveled to the United Kingdom.\nHe completed his architecture degree from the University of Edinburgh in 1951 and was awarded a membership of the Royal Institute of British Architects (RIBA).\nHye specialized in tropical architecture at the Architectural Association School of Architecture in London in the 1960s.\nWhen Pakistan got independence, he moved to Pakistan and tried to establish himself on the architectural forefront of the newly born state.\nOne of the biggest tasks he was granted on his return was to design and build the infrastructure of the new country.\nLater on in 1958, Hye joined the government and became the first chief architect of the government of Pakistan.\nHe designed many architectural buildings which were government sponsored across the country in cities like Karachi, Islamabad, Lahore, Quetta, Peshawar, Jhelum, Multan. Gujrat, Faisalabad and Hyderabad.\nSome of the buildings designed by A R Hye included Nishtar Medical College, Multan, Quaid-e-Azam Medical College, Bahawalpur,Auditorium of Lahore College for Women University, Addition in the buildings of APAPW College for Women, Officers Housing, GOR III Shadman, Lahore, Dhaka Polytechnic Institute, Dhaka and Buildings at Mayo Hospital, Lahore\nHe retired from federal service in 1981. Later on he lived a few years in the United States of America but finally settled in Islamabad in 1995. He lived a peaceful life in Islamabad in a house designed by himself.\nA R Hye took his last breath on September 18, 2008 in Islamabad.",
  "retrievedAt": "2025-08-11T09:41:45.492Z"
}
