{
  "title": "CDA, ICT admin attacked during action against qabza mafia in Chontra",
  "link": "https://www.app.com.pk/national/cda-ict-admin-attacked-during-action-against-qabza-mafia-in-chontra/",
  "date_published": "2023-09-18T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):The Capital Development Authority (CDA) with the assistance of ICT administration and Islamabad Police on Monday initiated anti-encroachment operations against the land mafia without any discrimination, where the enforcement teams were attacked by the non-locals who opened fire under the guise of the genuine affectees.\nIn this regard, CDA, district administration and Islamabad Police conducted a joint operation against the qabza mafia (encroachment mafia) in Meraberi area of Chontra.\nDuring the operation, qabza mafia opened fired and pelted stones on officers and officials of CDA and Islamabad Capital Territory Police, a news release said.\nIt was pertinent to mention here that negotiations were also held with the genuine affectees of the area to demolish the houses constructed after 2004. After the negotiations, the operation was started by the CDA Enforcement, Land and Rehabilitation, and Islamabad Police teams with the support of the administration. During the operation, five houses were demolished and the miscreants started firing which resulted in injuring one of the protestors on the spot.\nThe land award of Meraberi (Chontra)  was announced in 1969. Rehabilitation benefits and compensations have been paid to affectees in lieu of acquired land.  According to the 1985 SUPARCO  map, there were a total of 30 houses. In 2004, when this land was handed over by the CDA to the concerned department for further use, there were 342 houses at that time.\n“At present there are nearly 15 to 20 families who are local and genuine affectees. The remaining 80 percent are non-locals or have either purchased CDA-acquired land through stamp papers or are living on rent in houses built by local people,” the CDA said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:42:06.585Z"
}
