{
  "title": "HEC announces undergraduate scholarships for students of GB",
  "link": "https://www.app.com.pk/national/hec-announces-undergraduate-scholarships-for-students-of-gb/",
  "date_published": "2023-09-18T09:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): The Higher Education Commission (HEC) has announced Undergraduate Scholarships for the students of Gilgit-Baltistan to study at top Pakistan Universities/Institutions.\nAccording to the official sources, the applications are invited from outstanding students of Gilgit-Baltistan who intend to pursue undergraduate studies (four/five years BS Programmes) from HEC-recognized public sector Universities/Degree Awarding Institutions (DAIs). The Scholarships are being offered for the academic year 2023-24 in all areas of study/disciplines under the project titled, “Undergraduate Scholarship Programme for the students of Gilgit-Baltistan in Top Pakistani Universities/Institutions (Batch-III)”.\nThe sources said that Gilgit-Baltistan has significant geographical importance and is the terminal point of CPEC. The main aim of this programme is to provide financial assistance to GB’s students aspiring for undergraduate studies in the best Public Sector Universities in Pakistan.\nThe programme is also in line with the Sustainable Development Goals (SGDs) of Pakistan i.e. To eradicate extreme poverty and mobilize resources; therefore, to accomplish these goals, the government has directed HEC to expand higher education scholarships for the least developed areas and reduce inequality within the country, they added.\nMeanwhile, the general eligibility criteria for all these scholarships are as under: the applicants must have domicile/local certificate of Gilgit-Baltistan, applicants must have completed Higher Secondary School Certificate (HSSC)/Equivalent, the applicants who are already availing any other HEC/Government scholarship are not eligible to apply.\nThe award of scholarships will be made irrespective of gender, caste, race, and religion.\nHowever, as per selection criteria, the HEC Scholarship Aptitude Test shall be arranged by HEC/ETC.  Applicants must secure at least 50% marks in the test. The test result will be valid for 01 year.\nThe selected applicants shall secure admissions by themselves in the defined program of study in Pakistan.\nThe scholar shall sign an agreement/undertaking before availing of the scholarship. The terms and conditions laid down in the agreement/undertaking and award letter shall be binding for both parties.\nFinal award letters shall be issued after securing the admission and the completion of all required formalities including the legal documents.\nThe students are required to apply through the following HEC Online Application System? https://eportal.hec.gov.pk/? till 30 September, 2023.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:42:02.813Z"
}
