{
  "title": "More rain-wind/thundershowers expected in coming days with occasional gaps",
  "link": "https://www.app.com.pk/national/more-rain-wind-thundershowers-expected-in-coming-days-with-occasional-gaps-2/",
  "date_published": "2023-09-18T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):Pakistan Meteorological Department (PMD) has forecast more rain-wind/thundershowers for various parts of the country in the coming days with occasional gaps that would turn the weather pleasant by reducing temperatures.\nAccording to the PMD, few heavy or isolated very heavy falls are expected in Thatta, Badin, Sajawal, Umerkot, Tharparkar and Mirpurkhas.\nThe synoptic situation has revealed that a low pressure area (LPA) was located over Southeast of Rajasthan (India) and likely to move south westwards during next 48 hours.\nUnder the influence of this system, rain/wind-thundershowers with moderate to isolated heavy falls is expected in Lower Sindh including Tharparkar, Umerkot, Mirpurkhas, Sanghar, Khairpur, Badin, Sajawal, Thatta, Jamshoro, Larkana, Dadu, Karachi, Hyderabad, Naushahro Feroze, Shaheed Benazirabad, Mitayari, Tando Muhammad Khan, Tando Allah Yar while at isolated places in Sukkur, Ghotki, Qambar Shahdadkot, Barkhan, Sibbi, Zhob, Kalat, Khuzdar, Lasbella and Awaran from September 18 (evening/night) to September 20.\nRain/wind-thunderstorm Kashmir, Gilgit Baltistan, Islamabad, North and Eastern Punjab including Pothohar region, Murree, Galliyat, Sargodha, Gujranwala, Hafizabad, Mandi Bahauddin, Narowal, Sialkot, Lahore, Kasur, Sheikhupura, Faisalabad, Okara, Sahiwal, Bahawalnagar and Bahawalpur, Upper Khyber Pakhtunkhwa including Dir, Swat, Chitral, Mansehra, Abbottabad, Kohistan, Mardan, Nowshera, Swabi, Peshawar and Kohat from September 18 (evening/night) to September 21 with occasional gaps.\nAbout the possible impacts, few heavy to isolated very heavy falls may inundate low lying areas in Thatta, Badin, Sajawal, Umerkot, Tharparkar and Mirpurkhas from  September 18 (night) to September 20.\nThe PMD has advised the farmers to manage their crop activities accordingly and tourists and travelers to remain cautious to avoid any untoward situation during the period.\nWind-thunderstorm may damage loose structures like electric poles, solar panels etc. The general public has been advised to stay at safe places during wind-storm/lightning/heavy rains.\nThe PMD has alerted the concerned authorities to take necessary precautionary measures during the forecast period.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:41:41.242Z"
}
