{
  "title": "Population growth rate 2.55 percent annually: Economic Survey",
  "author": null,
  "content": "ISLAMABAD, Jun 9 (APP): According to the 7th National Population and Housing Census 2023, Pakistan’s population was 241.5 million growing at 2.55 percent annually.\nAccording to the Economic Survey 2024-25, in 2023, the male population was 124.32 million (51.5% share) while the female population was 117.15 million (48.5%).\nA significant share of Pakistan’s population is young, with 26% aged 15-29 years, while 53.8% fall withinthe working-age group of 15-59 years.\nUnder the Prime Minister’s Youth Skill Development Programme (PMYSDP), 56,000 individuals have been trained in 39 emerging IT skills, 53 industrial skills, and 34 technical skills.\nThe program targets domestic and international job markets, including Saudi Arabia, UAE, Gulf countries, the EU,Japan, and South Korea.\nUnder PMYSDP, 16,000 IT students have been trained and certified National Institute of Population Studies (NIPS) was currently finalizing the population projections at National, Provincial and district levels for 2024 and onwards on the basis of population census 2023. in collaboration with globally recognized IT companies like Google, Microsoft, and Cisco.\nUnder the PMYSD Programme Batch-I of 362 students has completed training in high-impact IT in 16 FDE colleges with the collaboration of NUST, NUML, and\nThe government has expanded the Prime Minister’s Youth Business and Agriculture Loan Scheme by adding new tier-4 to provide financing for laptops and support to prospective overseas workers.\nDuring 2024, the Bureau of Emigration and the Overseas Employment, and the Overseas Employment Corporation registered 727,381 workers for overseas employment.\nThe MoPHRD issued 65 new licenses to Overseas Employment Promoters, increasing the total\nnumber of active license holders to 2,264, aimed at boosting manpower exports from Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:57:55.891Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/population-growth-rate-2-55-percent-annually-economic-survey/",
  "dateList": "2025-06-09",
  "date_published": "2025-06-09T13:35:00.000Z"
}
