{
  "title": "Pro-farmer enabling environment imperative to make agriculture sector globally competitive: Asad Qaisar",
  "link": "https://www.app.com.pk/national/pro-farmer-enabling-environment-imperative-to-make-agriculture-sector-globally-competitive-asad-qaisar/",
  "date_published": "2020-04-16T06:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP):National Assembly Speaker Asad Qaisar Thursday said a pro-farmer enabling environment was imperative to make Pakistan’s agriculture sector globally competitive.\n“The upcoming federal budget should be an opportunity to revive the lost momentum of the agriculture sector” he said this during a meeting with Minister for National Food Security and Research Syed Fakhar Imam and Minister for Planning and Special Initiatives Asad Umer, said a press release.\nThe Speaker said the agriculture sector required greater investment packages as the sector was and would remain critical to Pakistan’s national food security, poverty alleviation and sustainable livelihoods of the people.\nSpecial Committee on Argi- Products had effectively pushed for protecting the interest of the farmers and agriculture sector, he said adding that this commitment should be translated into substantive outcomes in the upcoming budget.\nThe Speaker asked the Minister to ensure that present lockdown did not affect the wheat harvesting.\nHe said that the recommendations of the National Assembly Special Committee on Agricultural Products (SCAP) were intended to bring about the fundamental policy shifts in the interest of the farmers and agriculture sector.\nAsad Qaisar opined that given the fact that after the 18th amendment, food and agriculture is predominantly a provincial subject while food security and exports are a federal subject , the provincial governments may be reached out and synergies be forged in reviving Pakistan’s agricultural growth.\nHe further said that the Special Committee and the Ministry of National Food Security should comprehensively deliberate on the proposals and furnish a comprehensive report to the Committee by the end of this month.\nMinister for National Food Security Syed Fakhar Imam said that the support of the National Assembly Special Committee on Agricultural Products was crucial to uplift Pakistan’s agro-economy.\nHe assured that all the issues hindering wheat harvesting would be addressed in coordination with provincial governments.\nMinister for Planning and Special Initiatives Asad Umer said that agriculture sector was lagging behind due to irrational approach of previous governments.\nHe said that government would certainly make recommendation of the Special Committee, part of the upcoming budget. He also informed that government had taken measures to bring investment in agriculture sector.\nOn the sidelines of the meeting, it was also decided that MNA.\nShandana Gulzar Khan will replace Syed Fakhar Imam as convener of the Sub-Committee of the SCAP after his appointment as the Federal Minister for National Food Security and Research.",
  "retrievedAt": "2025-08-11T19:06:32.026Z"
}
