{
  "title": "G 20 debt relief to give developing world a fiscal space for pro-poor spending: Qureshi",
  "link": "https://www.app.com.pk/national/g-20-debt-relief-to-give-developing-world-a-fiscal-space-for-pro-poor-spending-qureshi/",
  "date_published": "2020-04-16T06:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP):Foreign Minister Shah Mahmood Qureshi Thursday said that on Prime Minister Imran Khan’s appeal, the G20 countries had decided to provide debt relief to 76 developing countries giving them a fiscal space to make spending on their worst-hit segments of population amid Covid-19 pandemic.\n“This is a great decision. This is a very timely decision. Look at the scope of this decision. 76 countries will benefit from it. This will be enforced immediately from May 1,” the foreign minister said addressing a press conference here.\nHe said despite many cautious voices, the prime minister had launched an appeal to the world community on April 12, calling for debt restructuring for the developing world as the extraordinary spending by them had shrunk their fiscal space badly impacting the revenue generation and exports.\nHe said after scraping, Pakistan could only manage an economic stimulus package of $8 billion though it was unprecedented.\nHe said the developing world faced two more difficulties of no fiscal space and a fragile health system. On one side, their revenue and exports are under bad impact, while on the other, there expenses are on increase as they need more hospitals, ventilators and other equipment, he added.\nHowever, he said the prime minister told the world that the immediate response from the world could be a debt relief which would have its spin-off impact on the developed world too.\nHe said following the prime minister’s call, the UN and IMF chiefs endorsed the proposal and thus prompting the G 20 countries to make a “historic decision.”\nBehind the prime minister’s appeal, there was a threadbare discussion at Foreign Office, government’s economic team, with Pakistan’s permanent representatives at New York and Geneva, his letters and discussions with around 30 foreign ministers and heads of the international financial institutions.\nThe foreign minister told media that this was the prime minister’s forth global initiative during his less than two years term including drive against climate change, campaign against eliminating Islamophobia, action against corrupt and illicit financial flows, and the latest being the initiative against debt relief.\nTo a question, the foreign minister said the developing countries would get relief on both the principal and interest amounts. He said the relief would be given by all the financial institutions including IMF and World Bank.\nHe hoped that the relief would have a substantial impact on Pakistan and the developing countries. Earlier, the relief was granted to the least developing countries, but after Pakistan’s initiative it was extended to 76 countries of the developing world.\nHe said the global pandemic required a global consensus. Even Pakistan decided to take part in a video moot of SAARC health ministers hosted by India despite the fact that the latter always undermined the regional forum.\nTo a question, the foreign minister said the federal government had convinced the provincial governments to reopen the airports in different cities to allow the return of stranded Pakistanis abroad. Pakistan also arranged chartered flights for the return of foreigners from Pakistan.\nResponding to a question, Qureshi urged the US President Donald Trump to review his decision of suspending the American funding to the World Health Organization as it was the time to cooperate.\nHe also assured that the impact of the debt relief would surely be passed on to the masses.",
  "retrievedAt": "2025-08-11T19:06:34.256Z"
}
