{
  "title": "Islamic lifestyle vital to prevent infectious coronavirus: AJK president",
  "link": "https://www.app.com.pk/national/islamic-lifestyle-vital-to-prevent-infectious-coronavirus-ajk-president/",
  "date_published": "2020-04-16T06:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 16 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Thursday stressed ulema, mushaikh and prayer leaders to boost the morale of the people in the wake of novel coronavirus to make the crusade against the pandemic a success.\n“The ulema should keep watch on the elements issuing unauthorized edicts to create dissension among the masses and harming the inter-sect unity of the Muslims,” he said.\nHe was talking to a delegation of the ulema of different schools of thought who called on him at Aiwan-e-Sadr under the leadership of the Secretary Religious Affairs Sardar Javed Ayub. Other members of the delegation included Mufti Mehmoodul Hassan Ashraf, Maulana Syed Ghulam Yasin Shah, Maulana Zahid Asri, Maulana Mohammad Altaf Safi, Prof. Qazi Mohammad Ibrahim Khan, Maulana Danyal Shahab, Maulana Mufti Mohammad Ibrahim Aziz, Maulana Farid Abbas Naqvi and Maulana Nazir Qadri.\nThe president asserted that the coronavirus had also attracted the attention of the Western intellectuals towards the golden Islamic principles and they are stressing to follow them.\nTherefore, he maintained, the ulema should take its advantage, and present the real Islamic teachings across the world.\nHe appealed to the ulema to maintain interfaith harmony in the state, and motivate philanthropists and well off people to support the poor and vulnerable communities through Zakat, Sadqat and donations. They should guide the people in the light of golden principles of Islam and Shariah and as per directives of the medical experts.\nThe President said people should be apprised of the significance of both physical and spiritual purity, frequent exercise of handwashing, social distancing, proper distance with others during prayers in the mosques and adopting other precautionary measures to prevent the spread of coronavirus.\nWhile citing a recent report published in the leading US journal Newsweek, Sardar Masood Khan said that in the report, a renowned US intellectual and Prof. Dr Craig Considine of the Rice University has pointed out that Prophet Muhammad Peace Be Upon Him (PBUH) had narrated 1,400 years ago all the precautionary measures the world is adopting today to prevent the pandemics. The way the world is attracting towards purity, suggests that the whole of mankind would become physically pure before the pandemic is controlled.\nThe president said that although the Azad Kashmir government has not imposed any restrictions on five times prayers in the mosques and Traveeh prayers during Ramadan, but it is obligatory for the ulema to ensure compliance with the directives of medical experts in letter and spirit.\nAbout the situation in occupied Kashmir, Sardar Masood Khan said that our brethren in the held territory are fighting both Modivirus and coronavirus. “The Indian government has no strategy to respond to coronavirus in occupied Kashmir,” he underlined and said that thousands of Kashmiri people detained in the Indian prisons have been exposed by the Indian government to the infectious virus.\nOn this occasion, the ulema stressed that implementation of the Islamic teachings in letter and spirit alone was a panacea to curb the pandemic.",
  "retrievedAt": "2025-08-11T19:06:33.034Z"
}
