{
  "title": "Chiseled by challenges, Pakistani nation to sail through corona crisis successfully: President",
  "link": "https://www.app.com.pk/national/chiseled-by-challenges-pakistani-nation-to-sail-through-corona-crisis-successfully-president-hopes/",
  "date_published": "2020-04-16T05:29:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Apr 16 (APP):President Dr Arif Alvi Thursday hoped that the Pakistani nation would successfully sail through the crisis of COVID-19 pandemic as multiple challenges in the past had chiseled it into a brave and steadfast nation.\nAddressing the distribution ceremony of ration boxes among the coolies (loaders) of Pakistan Railways arranged by Pakistan Bait-ul-Mal at Rawalpindi Railway Station, the president said, starting from hosting millions of Afghan refugees to fighting out terrorism and sectarianism, the Pakistani nation stood steadfast against all hardships.\nMinister for Railways Sheikh Rashid Ahmed, Special Assistant to Prime Minister Sania Nishtar, Managing Director Pakistan Bait-ul-Mal Aon Abbas Buppi and Country Director Islamic Relief Umair Hassan also attended the ceremony besides the railway loaders.\nWith the cooperation of Pakistan Bait-ul-Mal, the bulky ration packs, containing all basic food items, were provided by the donors as well as Pakistan Army.\nThe president said coronavirus had emerged as global challenge and being a developing economy, Pakistan could not give relief package worth trillions of dollars like the developed countries; however, the government was providing cash assistance worth Rs 12,000 each among 12 million worst-hit families to help them feed their families. The way, the Pakistani nation braved the hardships was unprecedented in the history, he added.\nHe said in one way or the other, the lockdown would ultimately affect the economy but the government would have to maintain a balance to keep the economy working.\nThe president, who earlier inspected the train converted into the quarantine facility to support the government in its anti-COVID-19 operations, said though the ratio of coronavirus cases was lower than the feared estimates, however the people should show no laxity towards the precautionary measures with frequent hand washing and social distancing above all.\nHe said a decision regarding the Tarawih prayer would be taken on April 18\nafter consultation with Ulema.\nHe also advised the countrymen to give out maximum alms and zakat during the holy month so that the support system for the needy could continue working.\nThe president who later distributed ration boxes among the loaders called for showing unity and discipline to face the COVID-19 challenge, exemplifying the role of German and Japanese people who had rebuilt their countries after Second World War through their hard work and unity.\nHe also lauded the pro-poor efforts of the railways minister and hoped that\nthe railways would revive its usual operations and overcome the losses once\nthe pervading situation ends.\nMinister for Railways Sheikh Rasheed Ahmed lauded the role of the loaders\nand their hard work and thanked the MD Bait-ul-Mal and Chief of Army Staff General Qamar Javed Bajwa who had donated 3,000 ration bags for the railway loaders.\nHe said the prime minister would soon inaugurate this converted train that would be taken to Taftan within 24 hours. He said seven railways hospitals were also on standby.\nHe said the Pakistan Railways had lifted around 265,000 passengers short before the commencement of the lockdown so that the people could not suffer as had happened in India.\nThe minister said in a presser on Saturday, he would announce the donation of one day salary by the railway workers to the Prime Minister’s Corona Relief Fund.\nHe said besides its sanctity, the month of Ramzan also marked the collection of zakat and alms by the mosques and seminaries and said with all precautions, more than five people could be allowed to pray in the mosques.\nHe said fortunately, the situation had not deteriorated in Pakistan as feared, but viewed that the crisis would change the world scenario altogether.\nDr Sania Nishtar said the world was faced with an ordeal but the nation would sail through it with all out support by the government.\nShe said under Ehsaas, an Emergency Cash Programme had been launched to support 12 million families and the ration distribution scheme would also be launched by next week.\nShe said being an important pillar of Ehsaas Programme, the Pakistan Bait-ul-Mal was playing a vibrant role to support the government in its social safety endeavour.\nShe appreciated the railways minister for advocating the case of poor in the cabinet meetings by bringing out different ideas.\nIn his address, MD Bait-ul-Mal Aon Abbas Buppi said as per Prime Minister Imran Khan’s directives, the government was targeting the most vulnerable segments of the society who had been badly hit by the closures of their workplaces during the lockdown.\nHe said as the railways workers also faced an adverse economic impact owing to the suspension of trains operations, so the PBM decided to distribute ration bags among them across the country.\nBesides, the railways loaders, the PBM was also supporting the transgender community, newspaper hawkers and the transport workers, he added.\nBesides being in close coordination with the philanthropists and civil society organizations, Aon Abbas Buppi is also active on social media handling even the individual complaints of the people, needing assistance in this distressing time.",
  "retrievedAt": "2025-08-11T19:06:37.812Z"
}
