{
  "title": "WIFAS program reaches 50 public sector schools",
  "link": "https://www.app.com.pk/national/wifas-program-reaches-50-public-sector-schools/",
  "date_published": "2023-12-18T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): Federal and Punjab governments and Nutrition International (NI) started the school-based weekly Iron Folic Acid Supplementation project aimed at anaemia’s reduction among adolescent girls.\nThe pilot project benefited over 5000 in-school adolescent girls with weekly Iron Folic Acid Supplementation (WIFAS) and education about nutrition and anaemia.\nNutrition International joined hands with the Nutrition Wing of Ministry of National Health Services Regulations and Coordination (MoNHSRC), Integrated Reproductive Maternal Newborn, Child Health and Nutrition Program (IRMNCH&N) Punjab and Lodhran district’s health and education authorities to pilot a school-based Weekly Iron Folic Acid Supplementation (WIFAS) program in 50 public sector schools.\nThe pilot project reached more than 5,000 adolescent girls with the recommended scheme of WIFAS and enhanced their knowledge about nutrition and iron deficiency anaemia.\n‘There’s a need for a comprehensive integrated Behaviour Change Communication Strategy including family planning, nutrition, maternal and child health, EPI, polio and all other things happening at the ground level, said Dr. Nadeem Jan, Federal Minister for National Health Services.\nHe appreciated the efforts of the Nutrition Wing, Ministry of National Health Services Regulations and Coordination and Nutrition International for taking initiatives aimed at improving the health and nutrition outcomes of women and adolescent girls.\nHe tasked his Ministry to develop a special task force on Nutrition to strategize and guide on Nutrition Programming in the country using life cycle approach.\nHe told the participants that two million doses of MMs have been donated to the Ministry for Pregnant women and 10 million dollars have been committed by a donor for local production of MMS in Pakistan which will be a great step towards improving the nutritional status of women.’\nHe reiterated the commitment of his government to focus on the health and nutrition of population especially the most vulnerable including women, children and adolescents.\n‘WIFAS pilot project has been a well-coordinated and comprehensive program with a set of activities around adolescent health and nutrition’, Dr. Khawaja Masuood, National Coordinator Nutrition.\nHe said that iron deficiency anaemia is one of the key public health problems faced by adolescents in Pakistan.\nAs per the findings of the National Nutrition Survey 2018, 54.7% of the country’s adolescent girls are anaemic, with a higher prevalence in rural areas (56%) than urban areas (53%).\nThe consequences of outcomes due to anemia and malnutrition can lead to diminished human capital and academic potential.\nThe government of Pakistan has developed the Pakistan Adolescent Nutrition Strategy and Operational Plan (2020-2025) that includes WIFAS, however, there was a need to develop an implementation model for delivering the program in practical settings.\nContinuing its mandate of providing technical assistance on nutrition to the government, Nutrition International initiated the WIFAS pilot project in Lodhran district of Punjab.\nThe project was implemented in collaboration with the District Health Authority and District Education Authority, Lodhran along with technical oversight and leadership from the Nutrition Wing, MoNHSRC, IRMNCH&NP Primary and Secondary Health Care Department of the Government of Punjab.\nBesides the provision of WIFAS, the project also focused to improve knowledge and practices of adolescent girls and their immediate influencers concerning iron deficiency anaemia through capacity building of education and health staff.\nGirls constitute 48% of the total adolescent population in Pakistan and half of them are anaemic.\nAddressing their nutritional needs is critical not only for their own health and wellbeing but for the generations they produce, stated by Dr. Shabina Raza, Country Director, Pakistan, Nutrition International.\nSharing the key achievements of the project, Dr. Raza said, the pilot phase was successful in showcasing an operational model of implementing the WIFAS program for in-school adolescent girls and generating acceptance from all stakeholders including national, provincial, and district-level government authorities, schools, community, and beneficiaries.\nThe project was successful in improving nutrition outcomes of adolescent girls in the project area, through behavior change communication and enhanced their knowledge about anaemia and its prevention.\nBuilding on the successful pilot, Nutrition International has expanded the program to two new districts – Swabi in Khyber Pakhtunkhwa and Pishin in Balochistan.\nIn its new phase in 2022-2025, the project will reach at least 60,000 adolescent girls with WIFAS and appropriate education about anaemia.\nLukas Van Arragon, Second Secretary Development, Canadian High Commission Islamabad said health and nutrition are specifically ranked high among Canada’s international assistance priorities.\nHe said that WIFAS program itself has been an existing and promising initiatives because it is clearly doing what good deployment work should do.\nThe event was attended by over 80 participants including, Representative from UNICEF, WFP, International and National NGOs, Civil Society and Media. Dr. Faisal Waheed, CEO District Health Authority Lodhran, Dr. Fazal Majeed, Director Nutrition Khyber Pakhtunkhwa (KP), Dr. Musa, Project Director integrated Health KP, Dr. Abdul Latif, District Health Officer, Swabi, Ayaz Kamboh, Assistant Director Education Lodhran also participated.",
  "retrievedAt": "2025-08-11T11:04:16.545Z"
}
