{
  "title": "Minister urges to promote Arabic language",
  "link": "https://www.app.com.pk/national/minister-urges-to-promote-arabic-language/",
  "date_published": "2023-12-18T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP): Caretaker Minister for Federal Education and Professional Training, Madad Ali Sindhi on Monday said that the Arabic language is a great asset of Muslims and stressed the need to further promote it.\nAddressing a conference, “Role of Institutions and Individuals in the Reviving the Arabic Language” organized by the Faculty of Arabic, International Islamic University Islamabad (IIUI) he said that Arabic is an eloquent language, it is a flowing river whose flow is increasing day by day.\nHe said that the role of the International Islamic University in the promotion of Arabic is exemplary where teachers from many other countries including Egypt, Sudan, and Saudi Arabia are playing an excellent role.\nHe said that institutions like the International Islamic University should be promoted in society and the other universities should also adopt the IIUI’s style of education.\nTalking about the importance of education, he said the only solution to development lies in prioritizing education.\nSpeaking at the conference, Muhammad Mutahar Al-Ashbi, the Ambassador of the Republic of Yemen said that Arabic is the language of the Qur’an, and steps should be taken to promote Arabic.\nExpressing his views, Acting President of IIUI Dr. Abdul Raheman said that the role of the Arabic language is important in economic and academic development.\nHe also mentioned that IIUI is already serving the cause of the promotion of the Arabic language with great efforts.\nHe apprised that at IIUI, courses of Quran comprehension and functional Arabic language are compulsory.\nOn the occasion, the Dean of the Faculty of Arabic, Dr. Fazal Ullah suggested that Arabic must be included as a compulsory subject at the Primary level, as well as it may also be included at a higher level in the curriculum. He also briefed about the aims and objectives of the conference.\nThe conference was also addressed by Dr. Habib-ur-Rahman Asim, and other researchers and experts in Arabic language.",
  "retrievedAt": "2025-08-11T11:04:20.976Z"
}
