{
  "title": "Pakistan can no longer compromise its national security by accommodating huge number of undocumented immigrants: PM",
  "link": "https://www.app.com.pk/national/pakistan-can-no-longer-compromise-its-nationals-security-by-accommodating-huge-number-of-undocumented-individuals-pm/",
  "date_published": "2023-12-18T12:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 18 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar has said that as Pakistan stood at the crossroads of history, it could no longer continue to compromise its national security by accommodating huge number of undocumented immigrants.\n“Our ultimate aim is to build a safer, more peaceful and prosperous Pakistan – with associated benefits for our own people, for the region, and the wider world,” the prime minister wrote in an article published in The Telegraph on Sunday.\nHe said that the governments across the world were adapting to a new era of mass migration linked to conflict, climate change, and economic opportunism.\nHe said the UK Government’s plan to deport illegal immigrants to Rwanda was a sign of that pressure. The heated debate surrounding the proposal and the many efforts to derail the scheme illustrated the huge challenges for policymakers as they sought to balance human rights with hard realities.\nSimilarly, he said, France was also struggling, while Italy had expressed fears that it might become “Europe’s refugee camp”. After opening its arms to several million refugees in recent years, Germany was also feeling the strain, prompting the announcement of tough new deportation measures.\nThe situation in the United States was no easier, he remarked.\n“Pakistan’s problem is of a different magnitude altogether. Over the last three to four decades, between four and five million migrants (roughly the population of Ireland) have arrived. Many have no right to remain. Despite being a non-signatory to 1951 Convention on Refugees (and its 1967 Protocol), we have generously accommodated the single largest caseload of refugees,” the prime minister wrote.\nHe said the hospitality was in Pakistan’s DNA and that was why the country had fulfilled its legal, moral and humanitarian obligations, and would continue to do so.\n“We have worked very hard, over a very long period of time, to accommodate as many as we can while giving those with no right to remain ample opportunity to leave voluntarily.”\nUnfortunately, Prime Minister Kakar said that despite frequent opportunities to repatriate voluntarily, and multiple government attempts to register those who remained undocumented, a significant number had persistently refused to formalise their status, choosing instead to stay in the shadows.\nHe said that while Pakistan had benefited from many hardworking and law-abiding migrants, the overall socio-economic and security cost of the huge influx had been staggering.\n“Many work on the black market, paying no tax, depressing wages for legitimate workers. They are also susceptible to exploitation by the criminal underworld, with all its disturbing links to terrorist organisations operating in the region,” he remarked\nHe said that since August 2021, at least 16 Afghan nationals had carried out suicide attacks inside Pakistan, while 65 terrorists killed in encounters with security forces, mainly in the bordering region, were identified as Afghans.\n“No responsible government can ignore such concerns. Whenever we raised this with the interim Afghan government, they advised us to “look inwards”. We have finally decided to heed to their advice to put our house in order,” the prime minister commented.\nHe said that Pakistan’s painstaking repatriation programme had attracted predictable criticism from those who did not understand the complex history of the problem – or the extraordinary efforts that had been made to avoid forcible deportations.\nHe said in order to ensure the welfare of those being repatriated, the government had strictly directed all the officials involved in the programme to treat deportees with due respect and care.\n“Furthermore, our emphasis is on voluntary, safe and dignified repatriation of individuals (along with their legally acquired assets), and not on deportation. Some 93 per cent of those who have returned to Afghanistan have done so voluntarily. Importantly, none of the 1.46 million Afghans who applied for proof of registration cards have been returned; nor have 800,000 or so individuals who hold Afghan citizen cards.”\nHe said that some 79 transit centres had been set up, providing free meals, shelter and medical facilities while additional crossing points had been opened on the Pakistan-Afghan Border to facilitate the processes.\nMoreover, the security personnel were escorting the immigrants to border crossings, taking particular care of women and children. Emergency helplines were available to report any abuses, he added.\nPrime Minister Kakar recalled that the abrupt withdrawal of Western allies from Afghanistan in August 2021 prompted a whole new influx of refugees to Pakistan. Hundreds of thousands of Afghan nationals crossed the border, claiming their lives were in danger.\n“Again, we take their welfare very seriously, recognising that some do require special protection. We will not deport at-risk groups, such as musicians, journalists, and human rights activists. We do however need help from other countries,” he said.\nHe said only 59,033 of the new arrivals had been resettled outside Pakistan, while 42,068 awaited evacuation to the West. The rest had failed to put forward a convincing case to anyone for asylum, and continue to stay in Pakistan illegally, he maintained.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:04:46.754Z"
}
