{
  "title": "Kashmir to get freedom soon from Indian clutches: President",
  "link": "https://www.app.com.pk/national/pakistan-wants-peaceful-resolution-of-iiojk-under-unsc-resolutions-president/",
  "date_published": "2022-02-05T05:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): President Dr Arif Alvi Saturday said that Pakistan wanted a peaceful resolution of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) issue in accordance with the resolutions of the United Nations Security Council, guaranteeing right of self-determination to the oppressed Kashmiri people.\nThe president said IIOJK had never been a part of India and Pakistan did not even recognize the Indian constitution, illegally enlisting the occupied territory as its part.\nThe president was leading a Kashmir solidarity walk participated by Speaker National Assembly Asad Qaisar, Chairman Senate Sadiq Sanjrani, Chairman Parliament Special Committee on Kashmir Shehryar Afridi, Interior Minister Shaikh Rashid Ahmed, ministers, members of parliament, officers of the foreign office, Kashmiri leaders, media and a large number of people. The solidarity walk was taken out in front of the Ministry of Foreign Office at the Constitutional Avenue and culminated at the D-Chowk.\nThe participants were carrying placards and banners, and raised slogans, expressing moral, diplomatic and political support to the people of Indian Illegally Occupied Jammu and Kashmir for their right to self-determination in accordance with the United Nations Security Council resolutions.\nThe president said that the day was not far off when the oppressed people of IIOJK would get freedom from the Indian clutches.\nThe president called upon the international community to ensure implementation of its promises made to the people of IIOJK regarding their legitimate right to self-determination in accordance with their aspirations.\nThe president said that in order to suppress the freedom voices, the Indian forces had imposed a complete lockdown in IIOJK and there had been media blackout, so that Kashmiri voices and images highlighting continuous Indian atrocities could be gouged.\nHe said “The hearts of people of Pakistan and Kashmiri people beat together, when there is bloodshed in IIOJK, the people in Pakistan are hurt.”\nThe president said Pakistan had been reminding the world to honour its commitment with the Kashmiri people.\nLauding Kashmiris’ sacrifices, he said Quaid-e-Azam, had termed Kashmir a jugular vein of Pakistan and the Kashmiri people were proving it by shedding their blood.\nHe also referred to late Kashmiri leader Syed Ali Geelani’s statement that Kashmir and Pakistan, both belonged to them.\nThe president said, on this day, he wanted to reinforce such feeling.\nHe said with August 5 actions, the Indian government had violated the UNSC resolutions, Geneva Convention and their Charters. It had breached its promises made with the international community.\nThe president said to silence the voices, about 800,000 Indian forces in IIOJK were conducting cordon and search operations, ensuing fake encounters with imposition of curfew whereas putting Kashmiri leaders under house arrest. They even did not let people attend late Geelani’s funeral.\nThe president reiterating Pakistan’s moral, diplomatic and political support to the people of IIOJK, said that Indian cruelties had been continuing unbated during the last 70 years.\nIndia took the issue to the UN and Pakistan reposed trust in the global body to resolve it, he said, lamenting that due to the vested interests, morality had no longer any value in the world.\nAll the suppressed people across the world had been looking towards an organization to come to their rescue, he added.\nThe president said there had been institutionalized crimes committed against the Kashmir people including gang rape and use of pellet guns.\nThe president dared India to use pellet guns in any part of India. India had been using Israeli model to suppress the Kashmiri voices. The president also denounced the demographic changes being made in the IIOJK.\nHe said India would not succeed in its nefarious designs.\n“Pakistan stands with Kashmir and will continue to stand as it is part of our body,” he maintained.\nHe opined that India had been setting itself on fire with its policies.\nThe president said Pakistan had given a befitting reply over Balakot incident and was ready to respond to any Indian aggression with full force.\nThe president reiterated that Indian government should open IIOJK to media, and the international delegations to witness the ground realities there.\nHe said holding of Kashmir Premier League showed to the world the contrasting pictures of Azad Kashmir and the IIOJK.",
  "retrievedAt": "2025-08-11T14:15:39.014Z"
}
