{
  "title": "Pakistan, China PMs review bilateral ties, regional situation",
  "link": "https://www.app.com.pk/national/pakistan-china-pms-review-bilateral-ties-regional-situation/",
  "date_published": "2022-02-05T17:11:00.000Z",
  "source": "APP",
  "content": "BEIJING, Feb 5 (APP): Prime Minister Imran Khan held wide-ranging talks with Li Keqiang, Premier of the State Council of the People’s Republic of China here on Saturday and the two leaders reviewed the entire gamut of bilateral ties including discussions on the bilateral economic and trade relations, onward march of CPEC and important issues of regional and global concern.\nHe was accompanied by the Foreign Minister; Minister for Finance; Minister for Planning, Reform and Special Initiatives; Minister for Information and Broadcasting and senior officials.\nCongratulating Premier Li for organizing Beijing Winter Olympics, the Prime Minister highlighted that strategic ties between Pakistan and China served the fundamental interests of the two countries and were a factor of peace and stability in the region. He added that successful celebrations of the 70th anniversary of the establishment of diplomatic relations held last year injected a new impetus to bilateral friendship.\nThe Prime Minister thanked the Chinese government for support and assistance to Pakistan in dealing with the COVID-19 pandemic and timely supply of vaccines.\nThe Prime Minister appreciated the transformational impact of CPEC on Pakistan’s infrastructure, energy, socio-economic development and improvement in livelihoods of the people. He underlined that Pakistan was committed to high quality development of CPEC through its mutually reinforcing industrial, trade, health, digital and green corridors.\nThe Prime Minister shared with Premier Li the measures taken by the government to provide policy guidance and support for enhanced Chinese investments in the CPEC SEZs and Special Technology Zones, and for safety and security of Chinese nationals, projects and institutions in Pakistan.\nExchanging views on the regional security situation, the Prime Minister highlighted the serious situation in IIOJK as well as the importance of urgent action by the international community to alleviate sufferings of the Kashmiri people. He also underscored the importance of Pakistan and China working together to promote shared objectives of peace, stability and development in Afghanistan and regional connectivity.\nThe two leaders agreed to work closely on further deepening bilateral economic engagement and reaffirmed their commitment to further advance the multifaceted strategic cooperative ties and building the Pakistan-China Community of Shared Future in the New Era.",
  "retrievedAt": "2025-08-11T14:15:24.665Z"
}
