{
  "title": "Pakistan embassy Cairo observes Kashmir Solidarity Day",
  "link": "https://www.app.com.pk/national/pakistan-embassy-cairo-observes-kashmir-solidarity-day/",
  "date_published": "2022-02-05T16:43:00.000Z",
  "source": "APP",
  "content": "CAIRO, Feb 5 (APP): A seminar titled “Kashmir – A long standing issue on the Agenda of UNSC” was organized by the embassy of Pakistan here on Saturday to observe Kashmir Solidarity Day.\nThe guest speakers in their presentations inter-alia conveyed that Indian Illegally Occupied Jammu and Kashmir (IIOJK) was a disputed territory between Pakistan and India, and India had no right to unilaterally change its disputed status; the issue was on the agenda of UNSC and should be resolved in accordance with UNSC resolutions and aspiration of the people of Jammu and Kashmir; Indian government’s fascist, anti-Kashmiri and anti-Muslim actions should be emphatically condemned by the international community; human rights violations in IIOJK, pose a grave humanitarian situation, requiring urgent attention of the world community; and the international community must act immediately and impress upon India to reverse its actions of August 05, 2019 and stop apartheid of Kashmiris.Ambassador Sajid Bilal in his remarks, inter alia, highlighted the legal, humanitarian, and political aspect of the Kashmir issue, underscoring the gravity of humanitarian crisis in IIOJK. He paid tribute to the Kashmiris for their valiant and longstanding struggle against the continuous Indian brutalities. The ambassador reiterated steadfast support of the government and people of Pakistan for Kashmiris’ right of self-determination till Kashmir was liberated from the clutches of illegal Indian occupation.\nThe participants also observed a minute of silence for the Kashmiri martyrs and other victims of brutal Indian oppression in IIOJK.A documentary on Kashmir was played during the event. The children of PISC performed a tableau and a song to highlight various aspects of the plight of the Kashmiris, under Indian Illegal Occupation.A large number of intellectuals, journalists, students and Pakistani community notables attended the event.",
  "retrievedAt": "2025-08-11T14:15:25.824Z"
}
