{
  "title": "PM, Uzbek President discuss bilateral ties",
  "link": "https://www.app.com.pk/national/pm-uzbek-president-discuss-bilateral-ties/",
  "date_published": "2022-02-05T13:30:00.000Z",
  "source": "APP",
  "content": "BEIJING, Feb 5 (APP): Prime Minister Imran Khan met with President of Uzbekistan Shavkat Mirziyoyev on the sidelines of Winter Olympics Opening Ceremony here on Saturday and the two leaders exchanged views in detail on the entire gamut of bilateral relations based on shared bonds of faith, history and culture and marked by cordiality and close cooperation.\nThe two leaders reaffirmed their resolve to comprehensively upgrade Pakistan-Uzbekistan partnership across the broad spectrum and continue taking practical steps for the implementation of the key projects.\nPrime Minister Imran Khan underscored the importance of enhanced trade and economic cooperation, particularly through operationalizing the landmark bilateral Transit Trade Agreement (UPTTA) and finalizing the Preferential Trade Agreement. He also reiterated Pakistan’s full support to the Trans-Afghan railway project and exchanged views on next steps in taking it forward over the coming months.\nTo further improve connectivity and people-to-people contacts, the Prime Minister underlined the need to enhance tourism, take all steps for resuming direct flights, strengthen banking links, and facilitate visas procedures.\nThe two leaders also discussed cooperation in education and culture and recognized progress on joint research and media ventures, including joint film on Baburi heritage and dubbing of Pakistani dramas in Uzbek language.\nThey also exchanged views on issues of regional peace and stability. The two sides stressed the need to continue economic and humanitarian assistance to Afghanistan by the international community to avoid any further deterioration of the situation. Stressing the need for practical engagement, the two leaders agreed that a peaceful, stable and prosperous Afghanistan was vital for regional stability as well as for the realization of infrastructure and connectivity projects.\nPrime Minister Imran Khan stated that the people of Pakistan were looking forward to welcoming President Mirziyoyev on his visit to Pakistan. The two sides agreed to work closely to ensure concrete outcome of the visit.",
  "retrievedAt": "2025-08-11T14:15:30.926Z"
}
