{
  "title": "Chinese companies to be facilitated for investment in Pakistan: PM",
  "link": "https://www.app.com.pk/national/chinese-companies-to-be-facilitated-for-investment-in-pakistan-pm/",
  "date_published": "2022-02-05T16:13:00.000Z",
  "source": "APP",
  "content": "BEIJING, Feb 5 (APP): Prime Minister Imran Khan while appreciating the interest of Chinese companies for enhancing business ties with Pakistan, highlighted that government of Pakistan had offered many incentives to foreign enterprises especially from China for investment in Pakistan Special Economic Zones.\nThe Prime Minister stated this during his second day of meetings with business leaders of China’s top state-owned and private enterprises here on Saturday.\nThe executives who met the Prime Minister included Chairmen of China Energy Engineering Corporation (CEEC), China State Construction Engineering Corporation (CSCEC), Power China, East Sea Group, China Railway Group Limited (CREC), China Metallurgical Group Corporation (MCC), Beijing Century Industrial Development Co. Ltd (CENTINCO) and the CHINAMEX Group.\nDuring the meetings, the Chinese businesspersons briefed the Prime Minister on the progress of their on-going projects in Pakistan and future investment plans worth billions of US dollars in the fields of energy, refining, petrochemical, infrastructure development, water management, information and communication technology (ICT), and housing.\nChina Energy is a Fortune 500 conglomerate operating in the fields of energy, water management, transportation and construction; CSCEC’s major areas of focus are communications and engineering; Power China provides services in the energy & water sectors; East Sea Group is an international energy and chemical trading company; CREC focuses on engineering, real estate development, Railways and mining sectors; MCC is the world’s largest metallurgical construction contractor; CENTINCO specializes in industrial, infrastructure refining and petrochemical projects; and CHINAMEX Group has carried out urban development projects in several countries.\nThe Prime Minister assured that Pakistan would continue to support and facilitate the Chinese companies for their expanded footprints in Pakistan.\nThe Prime Minister was accompanied in the meetings by the members of cabinet and senior officials.",
  "retrievedAt": "2025-08-11T14:15:30.205Z"
}
