{
  "title": "Flea markets – A way out for poor to survive in winters",
  "link": "https://www.app.com.pk/national/flea-markets-a-way-out-for-poor-to-survive-in-winters/",
  "date_published": "2024-12-15T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): Amidst the rising prices of woolies, flea markets are once again an easier way out for poor dwellers of different cities in the country to survive during winter by purchasing cheaper used woolen wear.\nEvery year with the very onset of winter, the poor and low income groups including those from Rawalpindi and Islamabad flock to flea markets in search of affordable warm clothing for their family members.\nAs soon as weather changes and cool breeze starts blowing, significant influx of people can be observed at these markets in twin cities, where they purchase essential winter items like sweaters, woollies, caps, socks, jackets and hoodies. These purchases are vital to protect themselves and their children from cold, especially at a time when many are battling seasonal allergies, chest infections and influenza.\nSeasons come and go, but with no change in lives of millions of poor Pakistanis who every year have to bank on used clothes brought in by importers mostly from western countries. No matter how much it hurts their ego and self-respect, they are left with minimal options when fresh and branded woolies are far out of their reach.\nThe ongoing inflationary wave has eroded the purchasing power of all social classes. However, it is the lower middle class and poor segments of society that are bearing the brunt of this economic crisis. Now even the people are seen complaining of rising prices of even the used clothes at flea markets.\n“Even the second-hand clothes that we used to buy every winter for our children are now priced high and gradually slipping out of our reach,” said Sajid Abbasi, a buyer in Rawalpindi.\nFather of four children, Sajid is now even concerned about sparing some money for buying these clothes as he could already meet his ends hardly with his present income. “Buying just the most essential winter items for my children has upset my monthly budget. I can’t even imagine the plight of those, who are even worse off and even can’t afford these clothes.”\nHe said, flea markets, once considered as a haven for poor and low income groups due to affordable shopping, have now become a source of frustration due to skyrocketing prices.\nIt is not the case of Sajid alone but hundreds of thousands other who lost their jobs during recent economic recession especially surfacing due to faulty policies of the Pakistan Tehreek-e-Insaaf government. Although the present government is struggling for economic revival even by making unpleasant decisions under compulsion yet the effects of previous follies can be witnessed clearly in the lives of poor and labor class.\nAbida Rehman, another buyer, explained the challenges faced by single-income households. “Amidst surging prices of all commodities, managing to buy clothes for my three children has become difficult when only one person in family is earning.”\nMiss Rehman also criticized online retailers, saying, “these websites selling leftover or imported clothes are exploiting customers by charging exorbitant prices while compromising on quality.”\nDespite challenges and with some higher prices than the past, flea markets still remain a resource of clothes for many families.\n“Flea markets, by offering a variety of imported clothes at economical prices, allow people to present themselves respectably in a society where appearance matters, especially at workplaces,” said Nisar Ahmed, a father of four children.\nComplaining of rising prices, Nisaar admitted the same time that flea market was bit better place for the people like him to go than the main and costly markets. “Flea market, at least leaves an option open for people like to maintain a bit of dignity.”\nRetailers at these markets also attribute the rising costs to economic factors as stated by Bilal Nadeem, a seller of second-hand and leftover clothing. “The prices of winter items have increased due to various reasons. If we sell these clothes at reduced rates, it will result in losses for us. Even now, we’re earning minimal profit due to inflationary environment.”\nAmanullah, another seller at Sunday Bazaar, mentioned to rising fuel prices and increased taxes as primary reasons behind inflated prices of second-hand goods. “Last year, we used to sell men’s warm jackets for Rs. 1,200 to Rs. 1,500. This year, these items are priced between minimum Rs. 1,500 to Rs. 2,000. The same is the case with women wear and children clothes whose prices have also risen as compared to previous years.”\nThe rising cost of living continues to exert pressure on low-income families, forcing them to make difficult choices in their quest for winter essentials. While flea markets used to offer some respite, their affordability is also coming under threat, leaving both buyers and sellers grappling with the effects of a struggling economy.\nIf the prevailing situation continues for a few more years, many more slipping down the poverty line shall obviously find it difficult for them to even buy from flea markets. Therefore, equitable distribution of wealth, some earning opportunities and masses welfare oriented measures were direly needed to save lower middle and poor segments of society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:47:31.837Z"
}
