{
  "title": "People of Pakistan stands with Lebanon in crucial time: Atta Tarar",
  "link": "https://www.app.com.pk/national/people-of-pakistan-stands-with-lebanon-in-crucial-time-atta-tarar/",
  "date_published": "2024-12-15T14:54:00.000Z",
  "source": "APP",
  "content": "ISTANBUL, Dec 15 (APP):Federal Minister for Information and Broadcasting Attaullah Tarar on Sunday said the people of Pakistan had always supported their brothers and sisters in Lebanon in crucial times, and would continue to do so in the future.\nThe Minister, during a meeting with his Lebanese Counterpart Ziad Makary, acknowledged the role of Lebanon in regional peace and stability, and discussed matters of mutual interest including repatriation of stranded Pakistanis in Syria and relief supplies for the people of Lebanon who have been affected by the war.\nHe expressed his gratitude to the Lebanese leadership for facilitating the immediate evacuation of Pakistani citizens stranded in Syria via Beirut.\n“The recent talks between the Prime Ministers of the two countries paved the way for the return of Pakistanis stranded in Syria, for which we are grateful to the Lebanese government,” said the minister while referring to a contact made by Prime Minister Shehbaz Sharif to his counterpart who took immediate action and provided immediate facilities to Pakistanis stranded in Syria.\n“This shows the strength of our relations,” he added.\nTarar reiterated the government’s commitment to further strengthen its relations with Lebanon.\nThe Minister of Information of Lebanon acknowledged the support of Pakistan to the people of Lebanon,  and particularly expressed gratitude to Prime Minister Shehbaz Sharif and the government of Pakistan for sending relief supplies to the people of Lebanon.\nHe said Pakistan’s continuous support reflects the strength of our bilateral relations.\n“It was a pleasure to see a large number of Pakistanis at Beirut airport who are returning home,” he remarked.\nHe reaffirmed his government’s commitment to further strengthen bilateral relations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:47:06.514Z"
}
