{
  "title": "PMLN believes in service-oriented politics: Rana Sanaullah",
  "link": "https://www.app.com.pk/national/pmln-believes-in-service-oriented-politics-rana-sanaullah/",
  "date_published": "2024-12-15T17:57:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Dec 15 (APP):Advisor to Prime Minister on Political & Public Affairs Rana Sanaullah Khan said on Sunday that Pakistan Muslim League-Nawaz (PML-N) had always strived for public welfare and betterment as it believes in service-oriented politics.\nAddressing the inaugural ceremony of Rescue 1122 station at Narwala Bypass here, he highlighted the developmental contributions of PMLN in the region and said that the Rescue 1122 station was a small example of our commitment to serving people.\nHe said credit goes to Prime Minister Shehbaz Sharif and Chief Minister Punjab Maryam Nawaz for progress of Faisalabad, as under their leadership, all development projects were successfully executed in this metropolis.\nCriticising the political instability in the country, he said that Pakistan would have been ranked among developed countries today if the journey of service-oriented politics had not been disrupted in 2018.\nHe accused the past governments of creating chaos and said that deep-rooted conspiracies were hatched for promoting politics of hate and hatred which had pushed us from 23rd to 47th place globally.\nRana Sanaullah condemned the leaders who, according to him, incited disorder and promoted a culture of mockery and left the youth misguided. “These unfortunate leaders are now facing consequences for their misdeed,” he added. He also criticised the protests and anarchic politics and said that there was no room for such ugly tactics in politics of Pakistan.He said that a certain group used propaganda to mislead the public and caused political confrontations in the country. They also fabricated the incidents by using outdated or unrelated footage, he said, adding that false narratives might gain temporary traction but the truth always prevailed.\nHe praised CM Maryam Nawaz for her contributions to political leadership and said that Maryam had brought a new direction to the politics with her primary focus on providing relief to the common man.\nHe vowed that the PML-N would continue to tackle the challenges like inflation and economic crises as they had previously overcome the menace of load shedding and terrorism. He said that the government was committed to resolving public problems on top priority basis. “Maulana Fazl-ur-Rehman was supporting us and we are confident of overcoming the recent challenge by December 17,” he added.\nEarlier, he also inaugurated the newly-established Rescue 1122 station near Aminpur Bungalow on Narwala Bypass.\nA large number of people belonging to all walks of life including notables of the area were also present, in addition to MPA Zafar Iqbal Nagra, Deputy Commissioner (DC) Captain (retd) Nadeem Nasir, District Emergency Officer Rescue 1122 Zafar Iqbal, PML-N leader Mian Ajmal Asif.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:47:01.638Z"
}
