{
  "title": "Nation standing firm against terrorism: PM",
  "link": "https://www.app.com.pk/national/nation-standing-firm-against-terrorism-pm/",
  "date_published": "2024-12-15T18:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): Prime Minister Shehbaz Sharif said that the whole nation was standing against coward terrorists as a wall of fortified steel and will remain standing and would not forget the tragedy of attack on Army Public School, Peshawar on December 16, 2014.\nIn a message on the 10th anniversary of tragedy of Army Public School, he said today ten years had passed after an unforgettable tragedy and loss of lives at Army Public School and “our heart is still in grief and we are shedding tears of blood”.\nIt was a tragic event which brought grief to our hearts, he remembered.\nOn December 16, 2014 coward, cruel and barbaric terrorists entered Army Public School and while causing death and destruction took away lives of 144 innocent children, he recalled.\nHe said most of the children who fell victim to this barbarity were small children who departed the world leaving people in grief.\nTheir lives, dreams, hopes and future were taken away from them, he said adding, “We cannot forget the loss of these children despite the passage of all this time.”\nThe prime minister said the small children faced unprecedented barbarism and cruelty and embraced martyrdom.\nThe pain of the families and parents whose loved ones and children were taken away from them, could not be mitigated, he added.\nHe said the nation should keep in mind that the fitna of Khawarij and other terrorists and anti state elements had nothing to do with the religion or the social values.\nThese terrorists targeted innocent Pakistanis to achieve goals at the behest of enemies of the country, he added.\nHe said the whole nation including him saluted the bravery of the teachers and children and pay tribute to the courage of the security forces who were tackling the anti state elements with steadfastness and determination.\n“Let us reiterate our determination to create a peaceful and secure country where no innocent faces any barbarity and cruelty and no child goes to school in fear and all perpetrators are given exemplary punishment for their crimes.”\nShehbaz Sharif said, “We have to make a collective pledge and we owe it to the martyrs and affectees of this tragedy that their sacrifices will not be in vain.\n“We will not forget and we will not forgive. Pakistan Paindabad,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:46:39.130Z"
}
