{
  "title": "Three-day drama festival concludes at PNCA",
  "link": "https://www.app.com.pk/national/three-day-drama-festival-concludes-at-pnca/",
  "date_published": "2024-12-15T16:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): The three-day drama festival, organized by the Pakistan National Council of the Arts (PNCA), concluded after mesmerizing the audience with vibrant performances.\nOn the final day, Government College University Faisalabad (GCUF) presented the first and second plays, along with a stand-up comedy performance.\nThe third play was staged by “Revenant,” while the fourth was presented by QDC. The event concluded with a musical band performance by “Team Raasta.”\nRenowned television artist and producer,\nHumaira Rasheed was the chief guest while Assistant Professor Dr. Sara Ali and Dr. Faisal Zaki Naqvi were also special guests.\nThe awards were distributed among the winners of the first, second, and third positions over the three days of the festival.\nDr. Waqar Azim from PNCA, along with PhD scholars Farhan and Murtaza, served as judges for the event.\nThe festival witnessed a large audience on the final day as well, who enthusiastically applauded the performers.\nThe students’ spontaneous acting kept the audience captivated and received a huge round of applause.\nThe three-day “Tamasha” drama festival, held at PNCA, showcased thought-provoking plays performed by 24 universities and theater groups.\nThe event was organized in collaboration with the Quaideen Dramatic Club of Quaid-e-Azam University, Islamabad.\nThe festival featured performances by students and youth groups from universities and colleges across Pakistan. The plays, cultural dances, and theatrical performances highlighted social issues and provided a blend of entertainment and meaningful narratives.\nThis festival offered the residents of the twin cities a quality cultural experience. The presentations on theater essentials were part of the event.\nBy presenting the talent of various theater groups, the festival aimed to provide quality entertainment to art enthusiasts in the federal capital.\nEach play carried a story and a message, combining strong acting, dialogue delivery, and script techniques.\nApart from offering entertainment, the event promoted healthy activities among the youth and revived the concept of theater in the twin cities under the theme of peace, love, and harmony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:46:43.302Z"
}
