{
  "title": "Kashmir Black Day observed to condemn 74 years of India’s illegal occupation",
  "link": "https://www.app.com.pk/national/kashmir-black-day-observed-to-condemn-74-years-of-indias-illegal-occupation/",
  "date_published": "2021-10-27T18:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): The Kashmir Black Day was observed on Wednesday across the country and abroad to condemn the 74 years of Indian illegal occupation of parts of Jammu and Kashmir, and to reaffirm Pakistan’s unwavering support for the just struggle of the Kashmiri people.\nA solidarity walk initiated from the Ministry of Foreign Affairs was led by President Dr. Arif Alvi, who also addressed the participants.\nThe Foreign Secretary presented a specially designed memento to the President. The memento depicted the ongoing human rights violations by the Indian Occupation forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n-The Kashmir Memento-\nThe memento by the Ministry of Foreign Affairs turned out to be a unique step of documenting the reign of India’s terror in Kashmir through art, but with a strong message for the world.\nThe memento comprised miniature figures of five icons depicting the struggle of Kashmiris including Hiba Nisar, the youngest victim of pellet guns fired by the Indian security forces, which had resulted in the loss of her eyesight.\nThe glass-encapsulated memento also showed Bashir Ahmed, a 65-years-old resident of Srinagar, who was martyred by the Indian occupation forces in front of his toddler grandson.\nThe dove with a flag of the United Nations highlighted the Kashmiris’ right to self-determination, while the clock in the background symbolized 815 days of the occupation of the Kashmir valley since August 5, 2019.\nThe clocktower of the Srinagar’s iconic Lal Chowk was placed as a witness to the struggle of several generations of Kashmiris.\n-Three ‘Chinar’ saplings-\nTo honour the supreme sacrifices of three generations of Kashmiris in pursuit of their right to self-determination, Foreign Secretary Sohail Mahmood planted three Chinar (maple leaf) saplings at the Ministry of Foreign Affairs this morning.\nThe saplings of Chinar, the native tree of the Kashmir Valley, was planted in the lawns of the Ministry of Foreign Affairs to observe the Kashmir Black Day.\nThe Foreign Secretary on the occasion said the gesture was to pay tribute to Kashmiris’ struggle for self- determination and supreme sacrifices by their three generations who braved the 74 years of Illegal Indian occupation.\n-Leadership’s messages on support to Kashmiris-\nMessages by the President, Prime Minister and Foreign Minister were issued to mark the Kashmir Black Day 2021. In the messages, the leadership reiterated Pakistan’s strong resolve to continue its support for the Kashmiri people until the realization of their inalienable right to self-determination.\n-Foreign missions observe Kashmir Black Day-\nPakistan’s missions abroad also organized a range of activities to raise global awareness about the Jammu and Kashmir dispute and to reaffirm solidarity with the Kashmiri people.\nTo perpetuate its illegal occupation, India is instituting demographic change in IIOJK in contravention of international law including UN Charter, UN Security Council resolutions and the 4th Geneva Convention.\nIn order to crush the legitimate Kashmiri struggle for self-determination, India has unleashed worst form of state-terrorism and wide-spread and systematic violations of human rights against the people of IIOJK in complete disregard of international human rights and humanitarian laws.\nDurable peace and security in South Asia hinge on peaceful resolution of the long-standing Jammu and Kashmir dispute in accordance with the relevant UN Security Council resolutions and wishes of the Kashmiri people.\nThe Foreign Office said that Pakistan calls upon the international community to impress upon India the imperative to reverse its unilateral and illegal measures instituted in IIOJK since 5 August 2019.\nIt also urges to stop all human rights violations, revoke the demographic changes in IIOJK, and peacefully resolve the Jammu and Kashmir dispute in accordance with international legitimacy, the FO said.\n“Pakistan will continue to extend all possible support to the Kashmiri people for the realization of their inalienable right to self-determination as enshrined in international law, United Nations Charter and the relevant UN Security Council Resolutions,” the FO said.",
  "retrievedAt": "2025-08-11T21:31:53.806Z"
}
