{
  "title": "Ten of thousands of women killed, tortured, raped in reign of terror in IIOJK",
  "link": "https://www.app.com.pk/uncategorized/390283/",
  "date_published": "2021-10-26T20:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Indian Illegally Occupied Jammu and Kashmir (IIOJK) over the years had become the worst nightmare for Kashmiri women as Indian forces subjected tens of thousands of them to severe human rights abuses including rape, torture and murder.\nIndian forces had sexually assaulted and gang-raped more than 11,000 women in illegally Occupied Jammu and Kashmir during the past three decades, according to various reports.  While 2,342 women were martyred as well.\nIndian forces’ aggression and violence in the Illegally Occupied Jammu and Kashmir region had also left close to 23,000 women widowed, the Kashmir Media Service (KMS) said in one of its report.\nThe 2,342 women victims were among 95,723 civilians martyred by Indian soldiers in total in the unfortunate region.\nThe Indian forces use harassment and molestation as a weapon of war to not only suppress Kashmir’s liberation struggle but to deter activists and leaders from their campaigns using the fear that the women they love would be subjected to sexual abuse.\nMoreover, over 100,000 women were suffering from mental health issues due to the violence perpetrated by Indian police and troops.\nAccording to the KMS, Kashmiri leaders had consistently demanded impartial probes into the cases of rape, murder and other human rights violations against women including Kunanposhpora mass rape and Shopian tragedy.\nIn a well-reported case, a 9-year old girl, Asifa Bano, was abducted and gang-raped by Indian police personnel and fanatics affiliated with extremist Hindu organizations in the Kathua area of the Jammu region in January 2018,” it added.\nIn September 2021, Pakistan issued the 131-page dossier covering separate chapters on war crimes committed by the Indian army.\nAccording to the dossier, since 1989, there had been over 96,000 extrajudicial killings, around 162,000 cases of arbitrary arrests and torture, and over 25,000 pellet gun injuries. Moreover, 11,250 women were raped, around 23,000 widowed and over 108,000 children orphaned.\nThe dossier pointed that rape and sexual violence had been used widely as a weapon of war by the Indian forces. According to Human Rights Watch, Kashmiri women were subjected to rape by occupation forces: during ‘search and cordon operations’ and during reprisals after military ambushes.\nOne of the most horrific incidents of sexual violence in the occupied territory was the Kunan Poshpura mass rapes and gang rapes of 1991 where more than 300 Indian army soldiers of “Rajputana Rifles”, under the command of Col. KS Dalal, raped as many as 150 women in just one night. Despite condemnation by the international community, and even after 30 years, the Indian state has refused to acknowledge the crimes, while the survivors are left with no avenues to pursue justice, even as the IOF has continued its barbarism with complete impunity.\nIn a ghastly act, two women, Aasiya and Neelofar were abducted, raped and subsequently killed by Indian men in uniform in Shopian in May 2009.\nPakistan’s dossier pointed that violence against women had increased in recent years. Since 2014, 3,884 women and girls had been raped and gang-raped by occupation forces, while 662 women had been killed. 141 perpetrators, involved in 63 cases of sexual violence, had been identified in the dossier.\nWhile half widows of Kashmir illustrate one of the starkest forms of the general insecurity in Kashmir.\nThese women were left with a new fractured identity as a ‘half widow. Uncertain whether their husbands were dead or alive; their status is in limbo, leading to pervasive economic, social, legal and psychological problems.\nThe wives and mothers of men who had ‘disappeared’, who had been picked up and taken into custody by the Indian authorities, or killed, remain in a tragic state of suspense. They were unaware of their true marital identity in the complete absence of information on the fate of their loved ones.\nThe half-widows did not get to know about their husbands, whether they were dead or alive and live in the hope that one day they might return home. These women continued to live their lives, seeking livelihoods, supporting their children financially and emotionally. The absence of any assured rehabilitation measures rendered them emotionally bruised, psychologically traumatized, economically disturbed and even physically crippled.\nThese half-widows continue to suffer in silence and the lack of a structured database was painfully evident as no thorough record had been maintained or comprehensive survey conducted to measure the problem realistically. Therefore, in order to seek recognition, and thus redress, a research paper had documented the saga of such women.\nKashmir had been classified as the world’s most militarised zone. Many commentators called the conflict zone as a chamber of secrets carrying tears of women whose sons, husbands and brothers have vanished without a trace.\nPakistan had demanded that the international community, including the United Nations and its relevant human rights machinery and civil society organisations, fulfil their obligations towards Kashmiris by playing their part to “end the Indian rule of tyranny and oppression”.\n“We expect the United Nations to compel the government of India to allow free access to special procedure mandate holders of the UN Human Rights Council for independent investigations of human rights violations,” said Minister for Foreign Affairs Shah Mehmood Qureshi said while releasing the dossier during a press conference.",
  "retrievedAt": "2025-08-11T21:31:56.250Z"
}
