{
  "title": "Kashmir solidarity forum Japan submits memorandum to UN, Indian embassy in Japan",
  "link": "https://www.app.com.pk/national/kashmir-solidarity-forum-japan-submits-memorandum-to-un-indian-embassy-in-japan/",
  "date_published": "2021-10-27T18:33:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 27 (APP):Barrister Shahid Majeed, the organizer of Kashmir Solidarity Forum Japan on Wednesday submitted\na Memorandum to the United Nations Mission and Indian Embassy in Japan on the occasion of International Black Day.\nShahid, a well known Kashmir leader said that Kashmiri people living all over the world have observed October 27 as International black day.\n“On October 27, 1947, the Indian Army invaded Jammu and Kashmir and occupied it in complete violation of the partition plan of the Indian subcontinent and against the aspirations of Kashmiris.\nIndia’s illegal occupation has created an alarming situation in Jammu and Kashmir where innocent people are being killed every day by the Indian forces which had failed to curb their voice for freedom“, Shahid Majeed told APP from Tokyo after submitting Memorandums to UN mission and Indian Embassy.“October 27 has been a day of misery since 1947 as India has been trying to implement its immoral agenda in the entire region ever since and the entire world clearly knows India’s frustrated efforts for establishing its so called supremacy in the region“.\nBarrister Shahid Majeed said the heinous designs of the Indian government to maintain its illegal hold on Jammu and Kashmir has put the safety and future of South Asia at stake.\nHe termed the October 27 as the darkest day in the history of Kashmir and said that Indian troops occupied Kashmir against the will of Kashmiri people.Barrister Shahid Majeed said that Kashmiris had been fighting for their birthright for the last seven decades and would continue the independence movement till it reached to its logical conclusion.\nHe said that Kashmiris around the Line of Control and around the world observe October 27 every year as Black Day to renew their pledge for their struggle for independence.\nThe Organizer Kashmir Forum Japan said that Kashmiri people would never accept India’s forcibleoccupation of their land.He said New Delhi and human rights organizations and international powers should realize theground reality and resolve the ongoing conflict in accordance with the aspirations of Kashmiripeople.Barrister Shahid Majeed said the situation in Kashmir was getting worse with each passing dayand their quest for freedom was getting more momentum and the day was not far away whenKashmir would get their legitimate right of freedom.",
  "retrievedAt": "2025-08-11T21:31:51.694Z"
}
