{
  "title": "KP CM directs selection of sites for building modern hospitals",
  "link": "https://www.app.com.pk/national/kp-cm-directs-selection-of-sites-for-building-modern-hospitals/",
  "date_published": "2020-12-25T14:41:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 25 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan has directed the concerned authorities for start home work including identification of suitable land for the establishment of state of the art hospitals at regional level in Malakand, Hazara and South regions.\n“The sites of these hospitals should be easily accessible to all the districts of the regions,” he said.\nHe issued these directives while presiding over a meeting regarding the development portfolio and public issues of Malakand region here the other day, said an official handout issued here Friday.\nMembers of provincial cabinet and Members Provincial Assembly from Malakand Region, high ups of provincial departments and federal entities attended the meeting.\nThe meeting reviewed in detail progress on the ongoing developmental schemes in the regions whereas the elected public representatives flagged issues faced the general public in their respective constituencies\nThe chief minister further directed the high ups of health department and PESCO for necessary steps to provide power express lines to the remaining District Headquarters Hospitals of the province on priority basis so that uninterrupted supply of power to these hospitals is ensured for round the clock health service delivery to patients.\nHe also directed the concerned authorities to resolve those issues on priority basis further directing them to show significant progress on ground to resolve those issues in next meeting to be held a month later.\nMost of the issues identified by the MPAs related to health, education, clean drinking water, irrigation, electricity and road infrastructure.\nOn this occasion, the elected representatives pointed out deficiencies of engineers and other technical staff of works departments in the their constituencies, and the chair directed the concerned authorities to convene a special meeting of all the high ups of all works departments, Revenue Department and Public Service Commission to for a way forward to hire these technical staff of works departments in a speedy pace.\nThe chief minister also directed the high ups of health department take necessary measures for up-gradation of hospitals in the region where there is a genuine required and to ensure provision of all the required medical equipments to these hospitals.\nTalking on this occasion, the Chief Minister stated that the provincial government was working on various projects for revamping and strengthening of all the Basic Health Units and Rural Health Centres.\nSimilarly, a scheme is also being executed to provide all the required medical equipments to Tehsil and District Headquarter Hospitals of the province adding that with the completion of these schemes, healthcare facilities in the province would be strengthened to the desired level and people will notice a visible change to this effect.\nSome of the MPAs raised the issue of non availability of clean drinking water in some areas in their constituency to which the chair directed the Public Health Engineering department to carry out feasibility studies for water supply schemes in those areas.\nRegarding the issues related to road infrastructure projects as identified by the elected representatives, the chief minister directed the authorities concerned to submit Monitoring & Evaluation report on all the ongoing projects of roads and bridges in the region.\nBriefing the meeting about the developmental portfolio of various districts of the region it was informed that 28 different schemes with a total cost of Rs. 4.00 billion have been reflected in the Annual Development Program for district Malakand, 46 schemes worth Rs. 8.00 billion for district Buner, 28 schemes worth Rs. 3.00 billion for district Shangla, 35 schemes worth 6.00 billion for district Chitral, 46 schemes worth Rs. 11.5 billion for Dir Lower and 40 schemes with a total cost of Rs. 12.00 billion have been reflected in the current ADP for district Upper Dir.\nThe Chief Minister termed the timely completion of the ongoing developmental schemes as the top priority of his government and directed the Planning department to give priority to the completion of on going schemes in the release of funds.",
  "retrievedAt": "2025-08-11T20:11:10.086Z"
}
