{
  "title": "Qureshi calls Qatari FM; lauds Qatar’s timely steps to contain Covid-19",
  "link": "https://www.app.com.pk/national/qureshi-calls-qatari-fm-lauds-qatars-timely-steps-to-contain-covid-19/",
  "date_published": "2020-04-02T02:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 2 (APP):Foreign Minister Shah Mahmood Qureshi Thursday held a telephonic conversation with Deputy Prime Minister and Foreign Minister of Qatar Mohammad bin Abdulrahman Al Thani and discussed the situation resulting from the rapid spread of the Covid-19 pandemic.\nForeign Minister Qureshi said that Pakistan was deploying all available resources to curtail the spread of Covid-19 pandemic and reduce its impact.\nHe appreciated the timely measures taken by the Qatari government which had helped contain the disease in Qatar.\nThe foreign minister apprised his Qatari counterpart about Prime Minister Imran Khan’s call for debt relief and restructuring to enable the developing countries to free up resources to combat the disease and shore up economies.\nQureshi also appreciated the role played by the State of Qatar in facilitating the peace process in Afghanistan.\nThe foreign minister expressed deep concern over the situation in the Indian Occupied Jammu and Kashmir (IOJ&K), where the coronavirus had spread and fatalities were being reported.\nContinued restrictions on movement and communication were imperiling the health and safety of eight million Kashmiris, he added.\nHe called for immediate lifting of all restrictions to allow dissemination of information and unfettered supply of medicines, and other essentials.\nThe foreign minister also called for immediate release of all Kashmiri leaders, youth and civil society members, who had been languishing in Indian jails and were at heightened risk of contracting the infection.\nThe Qatari foreign minister thanked Shah Mahmood Qureshi for his call and highlighted the steps being taken by Qatar to contain the pandemic.\nHe underscored the importance of learning from the experience of the countries which had managed to control the disease successfully.\nAl Thani described Pakistan’s call for debt restructuring for developing countries as an important and timely initiative and stated that Qatar was supportive of it.\nThe two ministers underscored the need for joint efforts to deal with the current challenges and agreed to stay closely engaged on all issues of common interest.",
  "retrievedAt": "2025-08-11T19:02:16.324Z"
}
