{
  "title": "Masood Khan lambasts India over New Domicile Rule in IOJK",
  "link": "https://www.app.com.pk/national/masood-khan-lambasts-india-over-new-domicile-rule-in-iojk/",
  "date_published": "2020-04-01T23:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP):President Azad Jammu and Kashmir Sardar Masood Khan Thursday strongly condemned India’s move whereby non-local people, predominantly Hindus from India , will be given domicile in the Indian Occupied Jammu and Kashmir (IOJK), a disputed state.\n“Kashmiris will never accept these rules and oppose them with tooth and nail”, he said in a video message.\nThis new rule will replace the rights of indigenous Kashmiris under Article 35-A of the Indian Constitution that covered permanent residence, education, employment and acquisition of property.\nThe AJK President called upon the UN Security Council and Secretary General Antonio Gutteres to intervene because the issue is on the agenda of the Council.\nIndia, he said, “cannot change the demographic composition of a disputed territory recognised as such by the UN Security Council resolutions”.\nThe Human Rights Council and the International Committee of the Red Cross (ICRC) should also take cognizance because Indian actions violate the Fourth Geneva Convention, Additional Protocol I and the Statute of the International Criminal Court covering illicit transfer of population and changes in demography. “This is a war crime”, the President said.\nThe new domicile rule lays down that those Indians with 15-year stay, 7-year study or having appeared in Class10/12 exams, in IOJK, will quality for the domicile. Migrant workers from different Indian states as well as the so-called West Pakistan refugees will also be given that status.\nThe President said the BJP-RSS regime announced these heinous and unlawful rules in the dead of night, without the consent of the Kashmiris, to change demography of IOJK. “It committed this crime against humanity under the cover of the coronavirus crisis and information blackout”, he added.\nPractically, he said, these rules obtain by force for former Indian armed forces personnel and civil servants as well as for their families and children.\nTerming these arbitrary rules as a new phase of depredation and exploitation of the Kashmiris, President Khan said that “a frenzied rush for land grab will start, forest land will be stolen, and even agricultural land will be confiscated”.\nThe President highlighted that this is the beginning of ethnic cleansing and intensification of genocide in IOJK in violation of the international humanitarian law.\nThe BJP-RSS regime, he said, has also used the domicile rule to divert attention from its failed policies on COVID-19 and poor economic peformance. “A large number of migrant workers are on the roads, without food and shelter. Kashmir has been used as a scapegoat to hide that failure”, he said.\nThe new domicile rule is nothing but a crass manifestation of Hindu supremacist doctrine of Hindutva. “India has already planned to allocate huge chunks of Kashmiri land for RSS parcharaks so that they can have a permanent foothold in IOJK to terrorise and brutalize Kashmiris and get for themselves lucrative projects and jobs”, the President said\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:02:28.080Z"
}
