{
  "title": "FM, UNSG discuss situation arising out of Covid-19 pandemic, ways to mitigate its impact",
  "link": "https://www.app.com.pk/national/fm-unsg-discuss-situation-arising-out-of-covid-19-pandemic-ways-to-mitigate-its-impact/",
  "date_published": "2020-04-02T00:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 2 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi on Thursday held a telephone conversation with UN Secretary General Antonio Guetteres, to discuss, inter alia, the situation arising out of Covid-19 pandemic and ways to mitigate its impact.\nRecalling that Prime Minister Imran Khan had at the outset called for debt relief for developing countries, the foreign minister endorsed the UN Secretary General’s call for extending international cooperation and solidarity with the developing countries, and affirmed Pakistan’s support for his three-pronged approach (enhancing response capacity ensuring that restructuring and recovering better by 2030 sustainable development agenda) to address the crisis.\nThe foreign minister agreed with the Secretary General’s assessment that the pandemic was one of the most challenging crises to confront humanity since the Second World War. Minister .\nHe also welcomed the Secretary General’s imitative to establish the emergency $ 2 billion Covid-19 Response and Recovery Fund.\nHighlighting the perils of the socioeconomic fallout of the pandemic, Foreign Minister Qureshi in particular sought the Secretary General’s support for debt relief for the developing countries as well as additional efforts to combat the flight of capital and ensuring financing for Sustainable Development Goals.\nThe Foreign Minister underscored Pakistan’s deep concerns over continued restrictions in the Indian occupied Jammu and Kashmir (IOJ&K), despite confirmed cases and deaths due to Covid-19, as well as continued incarceration of political leaders, youth and members of the civil society.\nHe called for urgent lifting of communication restrictions, allowing unfettered access to medical and other essential supplies in IOJ&K, and immediate release of all political prisoners, including Yasin Malik, who remained seriously ill.\nThe foreign minister briefed the Secretary General about the latest move by India to change the occupied territory’s demographic structure by introducing new domicile rules, underscoring that Pakistan had been consistently sensitizing the international community on this score.\nThese illegal steps were in clear violation of UN Security Council resolutions, bilateral agreements and international law, including the 4th Geneva Convention.\nThe Foreign Minister stressed that the UN and the international community must take steps to prevent India from changing the demography and distinct identity of IOJ&K.\nThe Afghan peace process was also reviewed. The Foreign Minister noted that the US-Taliban Peace Agreement afforded an historic opportunity for Afghans to forge durable peace and stability.\nHe reaffirmed Pakistan’s commitment to continue to facilitate the Afghan peace and reconciliation process as part of a shared responsibility.",
  "retrievedAt": "2025-08-11T19:02:21.888Z"
}
