{
  "title": "Corona increases students, parents’ worries",
  "link": "https://www.app.com.pk/national/corona-increases-students-parents-worries/",
  "date_published": "2020-04-02T02:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP):Coronavirus had multiplied the worries and troubles of parents regarding the education of their children at the start of new academic session.\n”Due to lockdown and restricted movement, markets and bookstores are closed so children are facing great difficulty in completing the given assignments , parents are compelled to allow children play indoor games instead of focusing on studies,” said Haleema Shahid a concerned mother while talking to APP.\nAs new academic session just kicked off in many educational institutes in Punjab, schools administrations have started sending parents home tasks to get done by the specific deadlines, but without books it seemed impossible to finish the work in time, she added.\nAnother woman Nadia Afzal stated,teachers have mentioned exercises and pages to do the exercises on loose sheets and then send the picture of complete assignment through wattsap, however it could never be done without the textual material.\n” Some of the teachers have shared the images of chapters and topics but my children are not used to study on a small screen of mobile, phone calls and messages keep them distracted,she added.\n”We are confused as there is no other way except online coaching, homework is piling up as we have to do double duty in helping them and preparing their assignments, Sohail Butt a father said.\nDespite of having plenty of time parents could not help their children in studies without the syllabus books,he expressed.\nAfshan Qadeer a mother of three primary students said, she had a home tutor before this COVID-19 spread as she could not comprehend Oxford syllabus,now the unavailability of text books escalated my tension.\nShe said that she could not explain new and advanced topics of new classes to her children, lack of the books doubles her problems,she added.\nAn 11-year-old student of grade 6 Hamna Ali said,her teacher had recommended a stationary and books shop in front of school to buy the course books but the shopowner sells books on the price of his own wish to mint more money.\nDania Malik a home tutor said that it would be hard for the parents indeed to teach the children without any textual aid.\n”Many schools have started the new session a few days ago with pouring enormous workload, students cannot learn without having the real books in hands,a few children have textbooks even many teachers don’t have syllabus books, she added.",
  "retrievedAt": "2025-08-11T19:02:16.774Z"
}
