{
  "title": "Pakistan strongly condemns, rejects Indian action to illegally change demographic structure of IOJ&K",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-rejects-indian-action-to-illegally-change-demographic-structure-of-iojk/",
  "date_published": "2020-04-02T05:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 2 (APP):Pakistan on Thursday strongly condemned and rejected the latest Indian action aimed at illegally changing the demographic structure of Indian Occupied Jammu and Kashmir (IOJ&K).\n“The so-called “Jammu and Kashmir Reorganization Order 2020” is another illegal step by India to settle non-Kashmiris in IOJK by changing the domicile laws. This is a clear violation of international law including the 4th Geneva Convention,” Foreign Office Spokesperson Aisha Farooqui said at the weekly media briefing.\nShe said the Kashmiris in IOJK had out-rightly rejected the new law as ‘unacceptable.” It is indeed, a blatant usurpation of their fundamental rights and an attempt to change the demography and their identity, she added.\nAisha Farooqui said Pakistan had consistently sensitized the international community about the BJP government’s designs for demographic change in IOJ&K to perpetuate India’s illegal occupation of the disputed territory against the wishes and the aspirations of the Kashmiri people.\nShe said the United Nations and the International Community must take immediate cognizance of this illegal Indian action and prevent India from changing the demography of the occupied territory and hold it accountable for its persistent violation of international law.\nTo a question, she said, 55 people had tested positive for Covid-19 in Indian occupied Jammu & Kashmir so far. It is one of the highest risk zones, she added.\nThe Spokesperson said the Foreign Minister Makhdoom Shah Mahmood Qureshi had a detailed telephone conversation with Secretary General OIC, Dr. Yousef A. Al-Othaimeen, on this subject in which the Foreign Minister highlighted that continued restrictions on communication and movement in IOJ&K were preventing unfettered supply of medicines and other essentials, as well as dissemination of information needed to combat the disease.\nHe also highlighted concerns regarding the possibility of spread of Covid-19 among the large number of Kashmiri youth incarcerated by India.\nShe said it had been 242 days since the lockdown and communication blackout of the people in Indian occupied Jammu and Kashmir while voices from around the world continue to condemn the inhuman oppression of the people of Jammu and Kashmir.\nIn its recent statement, she said the Human Rights Watch (HRW) called upon India to lift internet restrictions in IOJK, while underscoring that restricting access to the internet violates multiple rights and can be deadly during a health crisis such as the Covid-19 pandemic, adding that Amnesty International India had also urged the Government of India to release all those arbitrarily detained and restore full internet access.\nAisha Farooqui said Pakistan welcomed the endorsements of IMF, World Bank concerning debt relief and G-20 commitment to address debt vulnerabilities as steps in the right direction and hopes that these would culminate in concrete steps at the earliest possible.\nShe added that the UN Secretary General, also called for “maximum financial and technical support for the most vulnerable people and countries”.\n“We deeply appreciate the help and support of our neighbor and “Iron brother” in this critical time. Our continued collaboration to fight this pandemic is once again a testimony to our All-weather Strategic Cooperative Partnership, the Foreign Office Spokesperson said.\nAbout the relief goods and donations from abroad for Pakistan’s Coronavirus patients, she said that China has extended significant relief assistance to Pakistan to fight the Covid-19 pandemic.\nOn March 28, she said a special aircraft from China brought relief assistance to Pakistan including 12,000 test kits, 300,000 masks and 10,000 protective suits. In addition to this, she said an 8-member medical expert team also arrived in Pakistan from China.\nThe medical team will be in Pakistan for two-week and will also visit Karachi and Lahore, she said, adding, moreover, the Chinese government has also provided support worth $ 4 million for a separate hospital for Coronavirus patients.\nShe said private organizations in China such as the Alibaba Foundation and Jack Ma foundation had donated 50 thousand test kits and 50 million face masks. Another special flight reached Islamabad on pril 2 from Beijing, and brought in relief assistance worth $ 3 million from various Chinese organizations, which was coordinated by our Missions in China. This included PPE, ventilators, face masks and essential testing kits, she added.\nIn addition to the assistance received from China, Aisha said private donors in Singapore, Japan, and UAE had also sent relief assistance.  The US has also earmarked $1 million for capacity building of health sector staff of Pakistan as well as for better identification and investigation of Covid-19 cases.\nAnother US $1 million from existing funds of USAID has been redirected to help Pakistan fight against Covid-19 pandemic, she added.",
  "retrievedAt": "2025-08-11T19:02:10.776Z"
}
