{
  "title": "Pakistan a peaceful country with nuclear capability for deterrence: President",
  "link": "https://www.app.com.pk/national/pakistan-a-peaceful-country-with-nuclear-capability-for-deterrence-president/",
  "date_published": "2020-01-14T03:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP):President Dr Arif Alvi on Tuesday said Pakistan was a peaceful country with an advanced nuclear capability meant for deterrence against any hegemonic designs in the region.\nAddressing at the inaugural session of 17th International Bhurban Conference on Applied Sciences and Technology held here at the Quaid-i-Azam University, the President said the country’s defence was strong owing to immense achievements in the field of strategic and technological knowledge.\nPresident Alvi said war was not in the interest of any state as it brought an overall misery for mankind.\nPakistan too is not interested in indulging in wars with other countries and want to maintain peaceful relations including with its neighbours, he added.\nHe, however, pointed out that the United Nations, formed with a purpose to promote peace and reduce conflicts as a lesson learned from the chaotic world war, was lacking its effectiveness.\nOn issue of Jammu and Kashmir, the president regretted the ‘disappointing response’ by the world, saying democracies had been hijacked by influential lobbies and trade interests.\n“As the people of Pakistan stand steadfast with Kashmiris, the world on the other hand is becoming more and more hegemonic by ignoring an issue of urgent humanitarian crisis and instead siding with business deals,” he said.\nPresident Dr Alvi said Pakistan could make immense progress by utilizing its research knowledge in the field of applied sciences.\n“Knowledge can give us quantum jump to meet the challenges of contemporary world including in medical and bio-sciences, aero-sciences and cyber security,” he said.\nHe stressed the need for instrumenting scientific technology in a manner where humanity rose above nationhood and race.\n“Scientific progress should be for the benefit of mankind with research leading towards common goals, for example addressing the challenge of global warming since polluted skies have no borders,” he said.\nHe said concerns existed on how the societies were going to handle advancement in sciences, particularly in domain of artificial intelligence.\nHe mentioned possibilities of errors, software glitches or a major hacking which he said could cause catastrophic destruction as in case of dealing with nuclear weapons.\nAlso, he said, fake news using technological tools had possibility of influencing opinions through bombardment of even subliminal messages for political gains.\nThe conference from January 14-18 will conduct activities in nine areas including aerostructure, biosciences, control and signal processing, cyber security and assurance technologies, fluid dynamics, medical sciences, underwater technologies and wireless communication and radar.",
  "retrievedAt": "2025-08-11T18:37:09.982Z"
}
