{
  "title": "Communications Ministry’s revenue risen to Rs 25.8 b during last 16 months: Murad",
  "link": "https://www.app.com.pk/national/communications-ministrys-revenue-risen-to-rs-25-8-b-during-last-16-months-murad/",
  "date_published": "2020-01-13T23:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP):Minister for Communications Murad Saeed Tuesday informed the Senate that the revenue of his ministry had increased to Rs 25.8 billion during the last 16 months.\nThe Ministry of Communications had recovered Rs 11.9 billion under different heads, he said while responding to questions.\nMurad Saeed said Swat Motorway was not part of the road network of the National Highway Authority (NHA), rather it fell in the jurisdiction of Khyber Pakhtunkhwa Highway Authority.\nThe minister said persistent complaints about price hike in service areas were received by the NHA and the ministry had sensitized the Government of Punjab to take the corrective action. The NHA had also engaged the concessionaire for improved quality of service and controlled prices.\nAn NHA representative had also visited of service areas on M-II and submitted a report, he added.\nMurad Saeed said the issue pointed out by the inspection teams have already been forwarded to the district coordination officers.\nHe said it was also suggested by NHA that price enforcement agencies must ensure effective and periodic monitoring and conduct surprise raids to each service area to ensure implementation of price rate lists and curb overcharging.\nThe minister said the district administration concerned had evolved a mechanism for price control and quality assurance at outlets in service areas of Motorways.\nMurad Saeed said traffic coming on Motorway M-1 (from north of Pakistan) was required to move to New Islamabad International Airport through another link at Thallian Interchange on Motorway M-2 constructed for the purpose, which was approximately seven kilometers from M-1 Toll Plaza (North Bound).",
  "retrievedAt": "2025-08-11T18:37:20.318Z"
}
