{
  "title": "Nation remembered youngest Pakistani computer prodigy ‘Arfa Karim’",
  "link": "https://www.app.com.pk/national/nation-remembered-youngest-pakistani-computer-prodigy-arfa-karim/",
  "date_published": "2020-01-13T23:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP):Pakistan’s youngest Microsoft Certified Professional, Arfa Karim Randhawa was remembered on her 8th death anniversary today (Tuesday).\nToday, the nation remembered the young computer scientist who, in 2004, at the age of nine, became the youngest Microsoft Certified Professional (MCP).\nArfa gained the title of Microsoft engineer at the age of only 9 years and became the pride of Pakistan. While the owner of Microsoft company Bill Gates has also endorsed her.\nShe represented Pakistan on various international forums, making her family and close relatives proud of her sheer achievements in such a small age.\nIn November 2006, Arfa attended the Tech-Ed Developers conference themed Get ahead of the game held in Barcelona on an invitation from Microsoft. She was the only Pakistani among over 5000 developers in that conference.\nEven in such a small span of life, she piled up uncountable achievements. She also received the Pride of Performance award from the Government of Pakistan.\nOn August 2, 2005, she became the youngest person to receive a first flight certificate from Dubai Flying Club.\nA science park in Lahore, the Arfa Software Technology Park, was named after her.\nArfa had her name in Guinness Book of World Records, she kept the title until 2008.\nArfa was full of life and extraordinary brilliant but unfortunately we lost this gem too soon.\nIn his message on anniversary of Arfa Karim, Punjab Chief Minister Sardar Usman Buzdar has said that Arfa Karim was a symbol of courage and commitment and a ray of hope for the youth.\nHe said that the Punjab government was advancing her mission of promotion of IT and several steps have been taken in this regard.",
  "retrievedAt": "2025-08-11T18:37:15.087Z"
}
