{
  "title": "PM directs ministries, divisions to fill 129,301 vacant posts in 4 months: Firdous",
  "link": "https://www.app.com.pk/national/pm-directs-ministries-divisions-to-fill-129301-vacant-posts-in-4-months-firdous/",
  "date_published": "2020-01-14T05:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP):Prime Minister Imran Khan on Tuesday issued directives to the ministries and divisions to complete the process of recruitment on 129,301 vacant posts within four months.\nBriefing newsmen here regarding decisions of the Federal Cabinet meeting, Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan said no public sector employee would be removed as the government was committed to provide employment to the jobless not to make them jobless. 2020 would be the year of jobs creation.\nThe prime minister directed the ministries and divisions to dispose of all the pending cases of civil servants as per rules and regulations, penalty measures, seniority, promotions and other matters within the period of three months. He gave the directions after a briefing in which it was told that 106,343 cases of employees were pending in the ministries and divisions for the last three decades.\nDr Firdous said the meeting was also informed that 37 million items, including 6,000 official vehicles, of various government departments had been worn out, but no practical steps had been taken to dispose them of.\nThe prime minister tasked the PM’s Delivery Unit to pursue all the relevant ministries to resolve all the pending cases within 45 days, she added.\nShe said the Federal Cabinet gave approval to the proposal for structural and organizational reforms of the Ministry of National Health Services, Regulations and Coordination. It noted that restructuring of the ministry was imperative to fulfill the government’s vision of correcting the imbalance in technical and administrative positions from existing 80 percent staff having no health background to 70 percent technical staff and 30 percent administrative ones.\nIn line with the best international practices, she said,the cabinet approved in principle to change the name of ministry to the Ministry of Health and Population. As part of the reforms, a completely new organogram had been evolved, with key positions filled by technical experts alongside civil servants in high administrative positions that would foster an enabling role for the ministry to function effectively and transparently, she added.\nA new cadre for health among the Civil Services of Pakistan was approved by the cabinet, under which civil servants would be trained for the newly reformed health ministry, further enhancing its performance, the SAPM said.\nDr Firdous said the cabinet also gave approval for launch of inquiry against five homeopathic colleges working in the country. Steps were being taken to adopt best international practices in the homeopathic sector and the ministry would take concrete measures in that regard, she added.\nShe said the Civil Aviation Authority briefed the cabinet that in future there would be no need to get a non-objection certificate for building high-rise buildings near airports, which would help attract investment from overseas Pakistanis.\nDr Firdous said the Power Ministry presented a plan to the cabinet, under which the electricity consumers would soon get relief in bills.\nShe said the allied parties of Pakistan Tehreek-e-Insaf were part of the government and would remain in future too. The Muttahida Qaumi Movement-Pakistan (MQM-P) leaders had presented all their concerns to the committee led by Federal Minister for Planning and Development Asad Umar, which had been conveyed to the prime minister.\nThe special assistant said Prime Minister Imran Khan had already given a package of Rs162 billion for Karachi and it was now time for its implementation and then transferring its benefits to the grassroots level.\nShe said the ailing leaders of Pakistan Muslim League-Nawaz were staying at home instead of being hospitalized and meeting with former Afghan president Hamid Karzai, and sometime found at a five star hotel having dinner with the family in London. The Sharif family had been given 48 hours to present a report on the health condition of Nawaz Sharif, she added.",
  "retrievedAt": "2025-08-11T18:37:10.628Z"
}
