{
  "title": "15 districts of Balochistan have university campuses: Senate told",
  "link": "https://www.app.com.pk/national/15-districts-of-balochistan-have-university-campuses-senate-told/",
  "date_published": "2020-01-13T23:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 14 (APP):Minister for Federal Education, Professional Training, National History and Literary Heritage Shafqat Mahmood Tuesday said that 15 districts out of 34 districts of Balochistan have been enjoying the facility of university or its campuses.\nDuring the question hour session in the Senate, the minister said that whereas 19 districts were without any Higher Education Institutions (HEIs) at present.\nHe said provision of higher education facilities in underdeveloped areas, having potential of a university or a campus was one of the priorities of the Higher Education Commission (HEC).\nShafqat Mahmood said that accordingly, the HEC in line with the government’s vision 2025 initiated planning for establishment of university campus at each district.\nThe minister said the mapping of HEI‘s coverage at district level was prepared in 2015 and 67 districts (including 27 districts of Balochistan) were identified having no university or campus.\nHe said the mapping was shared with all the relevant stakeholders like Ministry of Planning, Development and Reforms, Ministry of Federal Education and Professional Training, Chief Ministers of Provinces/Regions, Governors/ Chancellors and Vice Chancellors of all public sector universities to determine priority of respective provincial governments.\nThe HEC prepared an umbrella project titled establishment of sub-campuses of public sector universities at district level (Phase-1), which was approved by ECNEC on January 2017 at a capital cost of Rs. 5206.280 million, he added.\nShafqat Mahmood said under this project, 21 sub-campuses of public sector universities were being established across the country including five in Balochistan.\nHe said the approved implementation period of the project was 36 months (February 2017 to February 2020).\nThe minister said in addition to this umbrella project, the government had approved six development projects at a total cost of Rs. 8988.537 million for the establishment of new campuses and universities in Balochistan.\nShafqat Mahmood said the names of 26 heritage sites were included in Pakistan tentative list for nomination as World Heritage sites. The sites included Badshahi Mosque, Lahore (1993), Wazir Khan Mosque, Lahore (1993), Tobs of Jahangir, Asif Khan and Akbari Sarai, Lahore (1993), Hiran Minar and Tank, Sheikhupura (1993) and others\nIt was stated that no funds and assistance have been provided by the Global Heritage Fund to Pakistan for the heritage sites, the minister added.\nHe said in the wake of 18th Constitution Amendment all heritage sites stood devolved to respective province since April, 2011 and concerned provincial departments were responsible to take necessary step for seeking partnership with Global Heritage Fund (GHF) on those sites which have the department of Archaeology & Museums have potential for promoting cultural tourism.\nThe minister said it was further stated that Department of Archaeology and Museum has always extended its cooperation by providing its professional advices and expertise to provincial departments of Archaeology for promotion of cultural tourism in country.\nHe said that in pursuance of Supreme Court‘s judgement regarding reduction in fees of private schools of Islamabad, three public notices were issued in the national dailies.\nShafqat Mahmood said wherein clear instructions were issued to private schools of Islamabad to comply the orders of the court in letter and spirit.\nThe minister said in addition complainants/parents were asked to visit the office of the authority (ICT-PEIRA) along-with paid fee vouchers for the month of November/December, 2018 and unpaid fee voucher of January/February, 2019.\nAccordingly, he said the authority had determined their fees in line with order of the Supreme Court and subsequently directed private schools of Islamabad to issue revised fee vouchers.\nThe minister said that similarly, individual notices to defaulter private schools of Islamabad were also issued to ensure compliance to court orders.",
  "retrievedAt": "2025-08-11T18:37:17.373Z"
}
