{
  "title": "Indian diplomat summoned to convey concerns over open genocide calls",
  "link": "https://www.app.com.pk/national/indian-diplomat-summoned-to-convey-concerns-over-open-genocide-calls/",
  "date_published": "2021-12-27T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): Indian Charge d’ Affaires on Monday was summoned to the Ministry of Foreign Affairs to convey Government of Pakistan’s serious concerns to the Indian government over widely reported open calls by Hindutva proponents for carrying out genocide of Indian Muslims.\nThese violent hate speeches were made during the “Dharma Sansad” held at Haridwar, Uttarakhand from 17-20 December.\nIt was impressed upon the Government of India that it was highly reprehensible that the Hindu Raksha Sena’s Prabodhanand Giri and other Hindutvafigures who called for ethnic cleansing have neither expressed any regret nor the Indian government has condemned or taken any action against them so far, Foreign Office spokesperson said in a press release.\nPakistan called on the international community including the United Nations, Organization of Islamic Cooperation (OIC and relevant human rights organizations to hold India accountable for its gross and systematic human rights violations against minorities, particularly Muslims and take immediate measures to save them from impending genocide.\nIt was conveyed to the Indian side that the reported hate speeches had been viewed with grave concern by civil society and cross-section of the people of Pakistan and around the world.\n“Regrettably, the toxic narrative against minorities, particularly Muslims and their persecution understate patronage has become a norm under the current Hindutva-driven BJP-RSS combine government in India,” it was added.\nPakistan also urged India to ensure the safety, security and wellbeing of its minorities including protection of their religious places and way of life.\nThe Indian side was reminded that such incitement to violence by Hindutva figures including ruling party’s elected members also preceded the anti-Muslim riots in New Delhi in February 2020.\nThe continued grave violations of human rights of minorities, especially Muslims and their places of worship, anti-Muslim legislations by the Union Government of India and several BJP-ruled states, and continued incidents of violence against Muslims on flimsy pretexts by Hindutva groups with complete impunity and often under state patronage highlight the worsening trend of Islamophobia and present a grim picture about the fate of Muslims in India.\n“India is expected to investigate these hate speeches and incidents of widespread violence against minorities, particularly Muslims and their houses of worship and take measures to stop such incidents from recurring in future,” the spokesperson further said.",
  "retrievedAt": "2025-08-11T21:46:11.139Z"
}
