{
  "title": "Quaid-e-Azam envisioned Pakistan as a peaceful, welfare state: Fawad",
  "link": "https://www.app.com.pk/national/quaid-e-azam-envisioned-pakistan-as-a-peaceful-welfare-state-fawad/",
  "date_published": "2021-12-27T10:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Monday said it was the vision of Quaid-e-Azam and Allama Iqbal to establish an Islamic welfare state where Muslims and minorities could live freely and peacefully irrespective of their caste and creed.\nAddressing the inaugural ceremony of a photo exhibition on the life of Quaid-e-Azam Muhammad Ali Jinnah at Pak-China center, he said the message of Quaid-e-Azam Muhammad Ali Jinnah about future Muslim state was very clear.\nThe minister opined that today the biggest challenge was how to reclaim Pakistan of Quaid-e-Azam Muhammad Ali Jinnah.\nFawad said Prime Minister Imran Khan wanted to transform Pakistan into a state as was envisioned by Quaid-e-Azam Muhammad Ali Jinnah.\nHe said many Indian and Bangladeshi writers were confused about Quaid-e-Azam and his vision of Pakistan.\nThe minister said Quaid-e-Azam made clear his vision of Pakistan in his three major speeches – one in the Constituent Assembly, his addresses to the Army officers and the bureaucracy.\nHe said both Quaid-e-Azam and Allama Muhammad Iqbal were modern, progressive and visionary leaders who realised in advance what would happen to Muslims and other minorities in the future.\nAllama Iqbal, he said, had realized long ago what difficulties Muslims could face, and Quaid-e-Azam decided to create Pakistan after realizing the intentions Hindu politicians.\nCondemning the tragic incident of Sialkot, the minister said the entire Pakistani nation was united. On the contrary, he said such incidents with Muslims were normal in India.\nHe said today’s New York Times carried a front page article exposing atrocities being committed against the Christian community in India.\nHe said Narendra Modi and the ruling BJP had made the lives of all minorities miserable in India.\nThe minister said India was facing decline today under Narendra Modi’s government which was an extremist and fascist regime.\nPurpose of establishing Pakistan was to protect rights of minorities, he said adding that Pakistan was the bright hope for the region amid growing tendencies of extremism and religious fanaticism in the neighbourhood.\nFawad said Quaid-e-Azam was clear in his message, getting his message to the common man was the biggest battle.\nTerming the photo exhibition on the occasion of Quaid-e-Azam Muhammad Ali Jinnah’s birth anniversay a welcome step, he said, “We have to start a movement to convey the message of Quaid-e-Azam to the common man”.\nHe said this year Quaid-e-Azam’s birthday was celebrated in a befitting manner, fireworks were set off in Islamabad, a party of colors and light was held for which he congratulated all the organizers.\nSecretary Information and Broadcasting Shahera Shahid and senior officers of the Ministry of Information and Broadcasting and attached departments were also present on the occasion.",
  "retrievedAt": "2025-08-11T21:46:17.334Z"
}
