{
  "title": "President urges int’l community to take notice of grave human rights violations in IIOJK",
  "link": "https://www.app.com.pk/national/president-urges-intl-community-to-take-notice-of-grave-human-rights-violations-in-iiojk/",
  "date_published": "2021-12-27T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): President Dr Arif Alvi on Monday urged the international community to take notice of the grave human rights violations being committed by the Indian Security Forces against the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe said that India had unleashed a reign of terror against the innocent people of IIJOK and had subjected them to the worst forms of state terrorism for decades.\nThe President was talking to Pakistan’s Permanent Representative to the United Nations, Ambassador Munir Akram, who called on him here at the Aiwan-e-Sadr.\nHe highlighted that the real face of India needed to be exposed at all international fora, which had been involved in the extra-judicial killings, torture and incarceration of innocent Muslims of IIOJK and other minority groups.\nThe President said that it was the responsibility of the international community to stop India from committing gross human rights violations and implement UN Security Council Resolutions on Kashmir.\nHe reiterated that Pakistan would continue to support the Kashmiri people in their just struggle for their right to self-determination.\nThe President deplored the fact that India was persecuting minority groups, particularly Muslims and Christians, adding that India’s inhuman treatment of minorities and its belligerent posture posed threat to regional peace and stability.\nHe termed the 17th extraordinary session of the OIC Council of Foreign Ministers, hosted by Pakistan, as highly successful that attracted the world’s attention to the grave humanitarian and economic situation of Afghanistan.\nThe President highlighted that the OIC-CFM session reflected Pakistan’s commitment to a stable and prosperous Afghanistan.\nHe expressed satisfaction that the OIC-CFM session generated international support to help address the economic and humanitarian challenges being faced by the people of Afghanistan.",
  "retrievedAt": "2025-08-11T21:46:17.028Z"
}
