{
  "title": "Govt effectively tackling environmental issues: Ali Muhammad",
  "link": "https://www.app.com.pk/national/govt-effectively-tackling-environmental-issues/",
  "date_published": "2021-12-27T15:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan Monday said the government was fulfilling its responsibility effectively while confronting environmental issues, asking the public to play due role in keeping their surroundings clean and green.\nWinding up the debate on a motion moved by Senator Mushtaq Ahmed to discuss the measures taken by Pakistan Environmental Protection Agency for protection, conservation and improvement of environment in line with the domestic and international environmental standards, he said the cleanliness was considered ‘half of faith’ in the religion of Islam and stressed the need for avoiding wastage of water.\nHe said improper use of water was a serious matter, adding no government could succeed in achieving the environmental protection goal without the help of people.He said Prime Minister Imran Khan did not start the Billion Tree Tsunami for political gains, and accordingly the government initiated a tree planting campaign at the national level and the people should participate in it actively.\nThe minister said the ban on use of plastic bags was imposed in Islamabad in 2019 and there should be its strict implementation.\nAli Muhammad said that 3500 kg polythene bags were confiscated and fines of Rs 2,700,000 were imposed.\nThe minister said a Pakistani delegation attended the COP-26 conference where the BillionTree Tsunami Project had been recognized internationally.\nHe said the present government was taking all possible steps to address the environmental issues; and working on projects like Mohmand Dam to build water reservoirs.\nEarlier, initiating the debate, Senator Mushtaq Ahmed said environmental protection was an important issue and the Lahore city had become the one of the most polluted cities in the world.\nSenator Mushahid Hussain Syed said implementation of ban on plastic bags in Islamabad should be ensured.\nSenator Faisal Javed said Prime Minister Imran Khan always gave preference to the future of the nation over political interests.\nSenator Ijaz Chaudhry, Senator Azam Nazir Tarar, Senator Mehr Taj Roghani also participated in the discussion.",
  "retrievedAt": "2025-08-11T21:46:12.220Z"
}
