{
  "article_id": "2025-10-06_673482e9d194b6a74010484790826e3c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/saudi-shura-council-delegation-arrives-in-pakistan-for-high-level-talks/",
    "retrieved_at": "2025-10-11T23:52:10.428Z"
  },
  "metadata": {
    "title": "Saudi Shura Council delegation arrives in Pakistan for high-level talks",
    "author": null,
    "date_published": "2025-10-06T20:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 212,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 06 (APP):A high-level parliamentary delegation from Saudi Arabia's Shura Council, led by Chairman Dr. Abdullah bin Mohammed bin Ibrahim Al-Sheikh arrived in Islamabad on Monday at the special invitation of Speaker of the National Assembly Sardar Ayaz Sadiq. The visit underscores the deep-rooted historical and fraternal ties between Pakistan and Saudi Arabia, grounded in mutual respect, faith, and a shared vision for regional prosperity. Speaker Sardar Ayaz Sadiq warmly welcomed the delegation upon arrival at the Parliament House, where Saudi Ambassador Nawaf Saeed Al-Maliki was also present. In a symbolic gesture of friendship, the Parliament House was illuminated in green lights to honour the visit - a sign of love and solidarity with Saudi Arabia, described by officials as a \"brotherly Islamic nation.\" During their stay, the Saudi delegation is scheduled to meet with President Asif Ali Zardari, Prime Minister Muhammad Shehbaz Sharif, and Chief of Army Staff Field Marshal General Syed Asim Munir. The discussions will focus on enhancing parliamentary cooperation, strengthening bilateral relations, and promoting peace and development in the region. \"The visit reflects the shared values and enduring partnership between our nations,\" said Speaker Sardar Ayaz Sadiq. \"It is an opportunity to further deepen parliamentary collaboration and strengthen the bonds of friendship between Pakistan and Saudi Arabia.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}