{
  "article_id": "2025-10-06_d36b45bce57005ef03b08913589b990f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-disposes-of-contempt-case-against-ex-chief-judge-gb/",
    "retrieved_at": "2025-10-11T23:53:25.039Z"
  },
  "metadata": {
    "title": "IHC disposes of contempt case against ex-chief judge GB",
    "author": null,
    "date_published": "2025-10-06T16:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 06 (APP):The Islamabad High Court (IHC) on Monday disposed of the case against former Chief Judge Gilgit-Baltistan Rana Shamim's alleged affidavit in favor of Nawaz Sharif in the Panama Papers case after 3 years. The court disposed of the contempt of court case due to ineffectiveness. Chief Justice Sardar Sarfaraz Dogar heard the contempt of court case against Rana Shamim and others. Lawyer Aamir Abdullah took the stand that Rana Shamim had submitted an apology letter, after which the case was not scheduled, now this case has become ineffective. The Deputy Attorney General said that this case has been fixed after a long time. In this case, only Rana Shamim was indicted. In the last hearings, Rana Shamim had submitted an apology letter to the court. Chief Justice Sarfaraz Dogar said that then we will dispose of this case. The High Court disposed of the contempt of court case due to ineffectiveness. In 2021, former judge Rana Shamim had alleged in his affidavit that former Chief Justice Saqib Nisar had ordered an Islamabad High Court judge not to take bail of former Prime Minister Nawaz Sharif and Maryam Nawaz. When Rana Shamim's affidavit was published in the newspaper, former Chief Justice Athar Minallah took notice of the matter and initiated contempt of court proceedings.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}