{
  "article_id": "2025-10-06_74d6d16d78fb343080f5f5ec6a313383",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/private-sector-key-to-boost-pakistan-malaysia-bilateral-trade-pm-shehbaz-sharif/",
    "retrieved_at": "2025-10-11T23:53:29.748Z"
  },
  "metadata": {
    "title": "Private sector key to boost Pakistan-Malaysia bilateral trade: PM Shehbaz Sharif",
    "author": null,
    "date_published": "2025-10-06T15:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 577,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PUTRAJAYA, Oct 6 (APP): Prime Minister Shehbaz Sharif on Monday stressed the vital role of the private sector in driving economic growth, urging business leaders from Pakistan and Malaysia to seize new opportunities for bilateral trade and investment. Addressing the Pakistan-Malaysia Business and Investment Conference, the prime minister emphasized that governments could only create enabling environments, but real progress depended on private enterprise. \"It is the private sector that must drive the engine of growth,\" the prime minister said adding \"Governments can only lay the foundation and provide a framework, business should be run by business houses, enterprises, and experts, not government.\" The conference, attended by Malaysian Prime Minister Anwar Ibrahim and a host of entrepreneurs from both countries aimed to explore joint ventures and deepen trade relations. PM Shehbaz expressed confidence that enhanced cooperation between Pakistani and Malaysian businesses could reduce Pakistan's reliance on external financial assistance. He also praised Malaysia's remarkable economic transformation under the leadership of Prime Minister Anwar Ibrahim, calling it \"nothing less than a miracle.\" He expressed confidence that with similar commitment and cooperation, Pakistan too could achieve sustained economic growth and independence from international financial support. \"We are currently under an IMF program that is helping stabilize our economy. This program will end in two years. But if entrepreneurs from both Pakistan and Malaysia step forward, commit to joint ventures, and build lasting business relationships, I believe we can say goodbye to the IMF forever,\" the prime minister added. Prime Minister Anwar Ibrahim on the occasion stressed the need to foster collaboration under ASEAN, noting that expanding the grouping's economic footprint would benefit the entire region. He assured Pakistani entrepreneurs of his government's support in facilitating smoother business processes and regulatory cooperation. He also uttered a few few words in Urdu that was warmly applauded by the audience, further highlighting the warmth between the two nations. PM Shehbaz said as the fifth-largest producer of cotton and milk, and the fourth-largest mango producer globally, Pakistan offered immense potential for value-added agricultural exports. \"Our mangoes are among the best in taste worldwide. With Malaysian expertise, we can build SME-based processing units for off-season packaging, value addition, and export.\" He said Pakistan will export $200 million worth of Halal meat to Malaysia assuring to compete on price, quality, and shipment commitments. Highlighting the vast mineral potential of Pakistan, he pointed to the Rekodek copper and gold mine in Balochistan as a major opportunity for joint investment, especially in the context of the global energy transition. The prime minister said Pakistan had also vast potential of tourism as the country's northern areas Gilgit, Baltistan, Hunza, Nanga Parbat, and K2 and many other areas offered world-class destinations. \"With Malaysian tourism expertise, we can transform these regions into major international tourist attractions,\" he said. He also proposed leveraging the country's young and skilled labor force to support Malaysian industries, where rising labor costs had become a concern. The prime minister pointed out that Pakistan also offered cost-effective skilled labor, and by combining investment portfolios, both sides could establish joint production units that export to Gulf countries, Central Asia, and beyond. As regards the government's performance on the economic front, the prime minister noted that Pakistan's macroeconomic indicators were showing encouraging results. Inflation has dropped from 36% to single digits, and policy rates have decreased from 22.5% to 11%, he said. The prime minister emphasized that combined efforts could unlock new horizons in trade, investment, and industrial collaboration.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}