{
  "article_id": "2025-10-06_8ffc4161b4aae7467fd1296f8e50917b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-anti-polio-campaign-to-be-launched-from-oct-13/",
    "retrieved_at": "2025-10-11T23:52:35.243Z"
  },
  "metadata": {
    "title": "National anti-polio campaign to be launched from Oct 13",
    "author": null,
    "date_published": "2025-10-06T19:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 248,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 06 (APP):The National Emergency Operations Centre (NEOC) has announced that the national anti-polio campaign will be conducted across the country from October 13 to 19. According to NEOC, during the week-long campaign, more than 45 million children under the age of five will be administered oral polio vaccine (OPV) to protect them from the crippling disease. An additional dose of Vitamin A will also be given to children during the campaign to help strengthen their immune systems. More than 400,000 trained polio workers will take part in the campaign across the country to ensure every eligible child receives the vaccine. As per provincial data shared by the NEOC, in Punjab, over 23 million children under five will be vaccinated while Iam Sindh, more than 10.6 million children will be targeted. In Balochistan, over 2.6 million children will receive the drops while in Khyber Pakhtunkhwa, around 7.2 million children will be covered. The NEOC said that in Islamabad, over 460,000 children will be vaccinated while in Azad Jammu and Kashmir, more than 760,000 children will be administered the vaccine. In Gilgit-Baltistan, over 280,000 children will be reached during the drive. The NEOC has appealed to all parents and caregivers to ensure that every child under five years of age receives the polio drops during the nationwide campaign from October 13 to 19. The NEOC also urged parents to complete the full course of routine immunization for their children to protect them from polio and other preventable diseases.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}