{
  "article_id": "2025-10-06_d410898d4a69487e4a9af623eadd625e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/judge-of-denmark-supreme-court-visits-scp/",
    "retrieved_at": "2025-10-11T23:53:49.963Z"
  },
  "metadata": {
    "title": "Judge of Denmark Supreme Court visits SCP",
    "author": null,
    "date_published": "2025-10-06T14:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 06 (APP):Mr. Justice Muhammad Ahsan, Judge, Supreme Court of Denmark, visited the Supreme Court of Pakistan on its invitation. The visiting dignitary is an eminent jurist with a distinguished career in constitutional and administrative law, who has served in various judicial and academic capacities in Denmark. He is recognized for his contributions to judicial reform and international legal cooperation globally. During his visit to the Supreme Court of Pakistan on Monday, Mr. Justice Ahsan was warmly received by the Chief Justice of Pakistan, Justice Yahya Afridi. The distinguished guest attended a reception hosted by the Judges of the Supreme Court, where they engaged in insightful discussions on global judicial best practices. Earlier, Mr. Justice Ahsan was given a guided tour of the Supreme Court Building, including the Public Facilitation Centre and the Supreme Court Museum. He was briefed on the Court's ongoing digitalization initiatives, judicial reforms, and measures aimed at enhancing transparency, efficiency, and access to justice. He also observed court proceedings and interacted with representatives of the Bar for the exchange of views on comparative judicial practices between Pakistan and Denmark. The visit underscores the growing cooperation between the judiciaries of Pakistan and Denmark, fostering mutual understanding, the exchange of legal expertise, and collaboration in areas such as judicial capacity-building, digital transformation, and access to justice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}