{
  "article_id": "2025-10-06_bea3989545a32f448d373b2f2fc52695",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/breast-cancer-awareness-campaign-highlights-importance-of-early-detection/",
    "retrieved_at": "2025-10-11T23:52:35.336Z"
  },
  "metadata": {
    "title": "Breast cancer awareness campaign highlights importance of early detection",
    "author": null,
    "date_published": "2025-10-06T18:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 189,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 06 (APP):In connection with the international Breast Cancer Awareness Month, a series of awareness campaigns, seminars, and community outreach activities are being held across Pakistan to educate women about the importance of early detection and regular screening. Health experts emphasized that breast cancer remains one of the most common cancers among women in Pakistan, but early diagnosis can significantly improve survival rates. Medical professionals urged women to conduct regular self-examinations and consult doctors for timely mammography. Various organizations, including hospitals, universities, and NGOs, have joined hands to spread awareness through pink ribbon events, walks, and free screening camps. Landmark buildings and institutions across major cities are being illuminated in pink as a symbol of solidarity with breast cancer survivors. Dr. Ayesha Malik, an oncologist, stated, \"Awareness and early detection are the most powerful tools in the fight against breast cancer. Every woman should prioritize her health and never ignore warning signs.\" The campaign also encourages men to play an active role in supporting the women in their families to seek medical advice without hesitation. The month-long activities will continue nationwide, promoting the message: \"Early Detection Saves Lives.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}