{
  "article_id": "2025-10-06_f6386fb338f3fe7c69babf5525ce2b28",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-sherry-voices-concern-over-flood-impact-rejects-political-distraction/",
    "retrieved_at": "2025-10-11T23:52:34.988Z"
  },
  "metadata": {
    "title": "Senator Sherry voices concern over flood impact, rejects political distraction",
    "author": null,
    "date_published": "2025-10-06T19:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 248,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 06 (APP):Pakistan People's Party Parliamentary, Leader in the Senate, Senator Sherry Rehman, on Monday expressed concern over the widespread impact of floods in Sindh and Punjab and called for unity while discouraging political distractions. Speaking in the Senate, she called for calm and collective action, emphasising that the crisis transcends provincial boundaries and requires a unified response. This is not a provincial problem - as over 6.5 million Pakistanis have been affected by the floods - these are not Punjabis or Sindhis, they are Pakistanis. It's a national crisis, she stated, calling on the government to speak with one voice. Senator Rehman highlighted the staggering scale of destruction, noting that the floods have caused damages worth Rs 3,856 billion - approximately $13.6 billion - with an additional Rs740 billion in potential future economic losses. She drew attention to Punjab's losses, reporting Rs 630 billion in damages and 3.3 million acres of farmland submerged. \"This is where our attention should be,\" she urged. Turning to relief efforts, the Senator reiterated PPP's call for transparency and effective aid delivery. She cited the 2022 floods, during which BISP disbursed Rs70 billion to over 2.8 million families, each receiving Rs 25,000. \"We didn't ask for anything for ourselves - only that the aid reach those who need it most,\" she said. Reflecting on the 2022 floods, she recalled, \"When Sindh was hit, one-third of the country was underwater. We worked with all stakeholders and declared Pakistan's right to climate finance.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}