{
  "title": "NA passes Finance Bill 2023 with certain amendments",
  "link": "https://www.app.com.pk/national/na-passes-finance-bill-2023-24-with-certain-amendments-2/",
  "date_published": "2023-06-25T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):The National Assembly on Sunday passed the Finance Bill 2023 with certain amendments in the proposed budgetary measures and the total outlay of Rs 14.48 trillion to achieve macroeconomic stability and the set target of a 3.5 Gross Domestic Product (GDP) growth rate.\nThe House rejected all the amendments moved by the lawmakers from the Opposition benches. The Finance Bill, moved by Minister for Finance and Revenue Senator Mohammad Ishaq Dar, was passed with majority vote after clause-by-clause reading. The House echoed with desk thumping as the House passed the budget.\nThe passage of the Finance Bill has successfully brought to an end the budgetary process started on June 9 with the budget speech of the finance minister at the National Assembly.\nThe bill now would go to the President for assent who will sign it into a law and effective from July 1, 2023.\nSpeaker National Assembly Raja Pervaiz Ashraf put all the amendments proposed by lawmakers Maulana Abdul Akbar Chitrali, Saira Bano, Nisar Cheema, Zahra Wadood Fatimi, Nawab Sher Waseer, Asiya Azeem, which were with a majority vote; except for Maulana Abdul Akbar Chitrali’s amendment, which was included in the bill for the Assembly’s approval.\nConsequently, the amendment proposed by MQM member Salahuddin was also rejected by the House. In the light of the Senate recommendations, the National Assembly also approved the amendments proposed in the Finance Bill 2023-24 by the Finance Minister.\nThe bill, presented in the House on June 9 by the finance minister for consideration, got the approval of the National Assembly with certain changes in the figures related to revenue targets and other matters in the budget for the upcoming fiscal year.\nAccordingly, the revenue target of the Federal Board of Revenue (FBR) had increased from Rs9.2 trillion to Rs 9.415 trillion, provincial revenue from Rs 5.276 trillion to Rs5.39 trillion, federal government expenditures from Rs 14.46 trillion to Rs 14.48 trillion, the pension volume from Rs 761 billion to Rs 801 billion, the subsidy volume would stand at Rs1.064 trillion, and the grants volume at Rs. 1.405 trillion.\nAs a result of all these measures, improvements would be seen in the budget’s deficit, and the fiscal deficit would decrease by Rs 300 billion.",
  "retrievedAt": "2025-08-11T08:47:51.076Z"
}
