{
  "title": "Asad Mehmood calls for review of FATA merger",
  "link": "https://www.app.com.pk/national/asad-mehmood-calls-for-review-of-fata-merger/",
  "date_published": "2023-06-25T08:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): Minister for Communication, Asad Mehmood, on Sunday urged the government to thoroughly review the merger of the Federally Administered Tribal Areas (FATA) in light of the ongoing challenges faced by the region.\nSpeaking on the floor of the National Assembly, the minister emphasized the need to ascertain the desires of the people of FATA through a referendum.\nMinister Mehmood highlighted that although progress has been observed in the FATA areas, it is crucial to obtain firsthand information about the issues faced by the local population.\nHe urged government officials to personally visit the area and assess the ground realities to gain a comprehensive understanding.\nRegarding the ongoing discussions about appointments within Pakistan Post, the minister clarified that the matter is currently under review by the committee.\nHe assured the House that details of the findings will be shared once the committee concludes its deliberations.\nHe emphasized the need to avoid exploiting this issue for political gain and highlighted discrepancies in the appointment of division personnel.\nHe said that if it is proven that an individual from one division has been appointed to another division, as claimed by a Member of the National Assembly, he would resign from his position.\nProudly highlighting the achievements of the Pakistan Post, the minister emphasized the organization’s remarkable progress under the diligent efforts of its officers.\nNotably, Pakistan Post has successfully overcome financial deficits and received international recognition for its accomplishments.\nMinister Mehmood also emphasized the expansion of road networks and motorways throughout the country, resulting in improved connectivity for the citizens.\nThe Minister revealed that approximately 50 new projects have been included in the current Public Sector Development Program (PSDP), showcasing the government’s commitment to national development.\nHe disclosed that over the past year, around 2,000 contract employees have been regularized without any discrimination, demonstrating the government’s dedication to providing equitable employment opportunities.",
  "retrievedAt": "2025-08-11T08:48:02.340Z"
}
