{
  "title": "No double-pension for government employees of grade 17-22:  Dar",
  "link": "https://www.app.com.pk/national/no-double-pension-for-government-employees-of-grade-17-22-dar/",
  "date_published": "2023-06-25T08:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): Minister for Finance and Revenue Senator Mohammad Ishaq Dar clarified on Sunday that there would be no double pension for government employees falling in the category of Grade 17-22.\nResponding to a point raised by Minister for Water Resources Syed Khursheed Ahmed Shah in the National Assembly, the minister explained that the restriction would not apply to government employees below Grade 17, as there were instances where some employees retired after 15-20 years of service and started another job.\nThe minister stated that if some employees (Grade 17-22) were working on a contract basis after retirement, they would have to choose one pension that suited them, as the policy began from the top.\nHe emphasized that this was an old issue that should have been resolved earlier, which the incumbent government had started to redress.\nIshaq Dar mentioned that there was no specific timeframe for pension payments to the dependents of retired employees and widows after their passing. However, this has now been limited to 10 years.\nHe stressed that such reforms were crucial because the pension budget had reached Rs 800 billion, which was nearly 50 percent less than the current figure a few years back. He warned that without these reforms, it would become unsustainable for the country.\nAddressing concerns raised by Ghous Bux Khan Mahar of the Grand Democratic Alliance (GDA) regarding the withdrawal of the urea subsidy, the minister stated that the government aimed to promote local fertilizer production and achieve self-sufficiency in this sector.\nHe mentioned that several Pakistani companies were planning to invest over $200 million in the urea production sector.\nHe assured the House that the challenges faced by the agriculture sector, considered the backbone of the national economy, would be addressed in due course of time through mutual consultation with all stakeholders.",
  "retrievedAt": "2025-08-11T08:48:02.299Z"
}
