{
  "title": "Budget process in NA witnesses active participation of lawmakers",
  "link": "https://www.app.com.pk/national/budget-process-in-na-witnesses-active-participation-of-lawmakers/",
  "date_published": "2023-06-25T11:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): In a highly productive 51st session, the National Assembly (NA) successfully approved the federal budget for the fiscal year 2023-24.\nCommencing on March 27, the session witnessed the presentation of the Finance Bill, 2023 on June 9, 2023, sparking a thorough and engaging debate on the budget.\nThe House, after incorporating numerous recommendations from the Senate, passed the Finance Bill, 2023, alongside the adoption of four resolutions addressing significant issues.\nThe formal budget debate commenced on June 12, with the Leader of the Opposition initiating discussions on the federal budget in accordance with parliamentary tradition.\nAccording to the data compiled through the website of NA and observation of proceedings, a substantial number of lawmakers actively participated in the debate, with around 86 out of 174 NA members lending their voices to the discussions—a significant increase compared to previous years.\nIt is noteworthy that the incumbent 15th NA comprises 174 members, excluding the Speaker, who plays an impartial role as the custodian of the 342-member House.\nDuring the debate, female parliamentarians played a particularly active role, with 22 female MNAs, accounting for 49% of their representation, expressing their views on the Finance Bill for a combined duration of seven hours and 27 minutes.\nLikewise, 64 male lawmakers, representing 50% of male participants, voiced their perspectives on the Finance Bill and the Senate’s recommendations for more than 22 hours. Throughout the budget process, Minister for Finance and Revenue Ishaq Dar, along with State Minister for Finance Dr Aisha Ghaus Pasha, consistently attended the sessions, effectively addressing the concerns raised by lawmakers.\nBoth the ruling party and its allies, recognizing the government’s efforts to prepare an efficient budget amidst rigorous economic challenges, voiced their support.\nFurthermore, a majority of opposition lawmakers hailed the budget’s significance in the face of a demanding economic scenario.\nRepresentatives from various political parties actively participated in the budget debate, including 30 lawmakers from PML-N, 29 from PPPP, ten from PTI, five from MMAP, three from BNP, two each from GDA and MQMP, and one each from PML, JUI-F, BAP, and two independent lawmakers.\nIn total, the NA convened for more than 59 hours over the course of 13 sittings held between June 9 and June 25. The House adopted four resolutions during the session, including condemnation of a political party and its chairman’s actions on May 9, the transfer of development project funds executed under the Sustainable Development Goals (SDGs) program to the non-lapsable account (NLA) at the end of the fiscal year 2022-23, the commemoration of the 70th birth anniversary of the late Shaheed Mohtrama Benazir Bhutto, paying homage to her significant role in the struggle for democracy, and recognition and gratitude towards international and civil society organizations, as well as the Pakistani diaspora, for their contributions to addressing climate change-related issues.\nMinister for Foreign Affairs Bilawal Bhutto Zardari and Minister for Defence Khawaja Muhammad Asif delivered policy statements after the US-India joint communiqué. Throughout the sessions, lawmakers raised approximately 62 points of order, discussing matters concerning foreign affairs, judiciary, agriculture, governance, gas and electricity, law and order, climate change, and agricultural concerns.\nMoreover, the National Assembly approved 133 demands for grants, with no cut motions moved on 97 of them. The House passed the Finance Bill 2023, incorporating specific amendments to the proposed budgetary measures, amounting to a total outlay of Rs 14.48 trillion, aiming to achieve macroeconomic stability and a targeted 3.5% Gross Domestic Product (GDP) growth rate.\nOn June 25, during the session, Minister for Finance and Revenue Senator Mohammad Ishaq Dar moved the Finance Bill, which received majority approval after a clause-by-clause reading. NA Speaker Raja Pervaiz Ashraf put forth the amendments proposed by lawmakers, including Maulana Abdul Akbar Chitrali, Saira Bano, Nisar Cheema, Zahra Wadood Fatimi, Nawab Sher Waseer, Asiya Azeem, and MQM member Salahuddin.\nThe majority of the proposed amendments were rejected, with the exception of Maulana Abdul Akbar Chitrali’s amendment, which was included in the bill through the Assembly’s approval. Following this, the House also rejected the amendment proposed by MQM member Salahuddin.\nIn line with the Senate’s recommendations, the NA approved the amendments proposed in the Finance Bill 2023 by the Finance Minister.\nThe approval of the budget in the House was met with resounding desk thumping, symbolizing the lawmakers’ support. With the successful passage of the Finance Bill, the budgetary process initiated with the finance minister’s budget speech at the NA comes to a close. The bill now awaits the President’s assent, after which it will be signed into law, taking effect from July 1. The approving lawmakers conveyed their congratulations to the government on reaching this significant milestone and expressed hope for greater relief for the public in the future.",
  "retrievedAt": "2025-08-11T08:47:50.065Z"
}
