{
  "title": "Former rulers who ruined economy were crying over possibility of restoration of IMF programme: Marriyum",
  "link": "https://www.app.com.pk/national/former-rulers-who-ruined-economy-were-crying-over-possibility-of-restoration-of-imf-programme-marriyum/",
  "date_published": "2023-06-25T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb said on Sunday that it was strange that those who ruined the national economy were crying over signs of restoration of agreement signed by themselves with International Monetary Fund (IMF).\nIn a statement, the minister said that on May 9, they burned the country, attacked military and private properties, desecrated the memorials of martyrs and now they were preparing to damage the economic interests of the country again.\n“Arsonsits, conspirators and enemies of the country have started crying again as they heard the news that the agreement with the IMF is being restored”, she maintained.\nMarriyum said that the previous regime signed the IMF agreement on strict terms, violated it and then suspended the agreement, then hatched conspiracies against the country and the agreement.\nThe minister said that questions should be asked to those who were crying over the agreement and why did they sign the agreement with the IMF. She said it was ironic that those who were shouting about the agreement, themselves had signed the agreement with the IMF.\n“Not only did they violate and suspend this agreement, but they conspired to make the country default”, she added.The minister said that former Prime Minister Nawaz Sharif during his tenure had stabilized the country’s economy, but “the foreign agent” shook the foundations of the economy and the country had to seek the IMF’s support.\n“Nawaz Sharif is the only leader whose government completed the IMF program and also put the country on the path of development”, she remarked.Taking a jibe on Imran Khan, she said the person who used to claim that he would prefer to die instead of seeking IMF assistance, why did he knock the door of the IMF.\nThe foreign agents who laid economic mines and nearly bankrupted the country and deprived the people of the livelihood were today demanding the resignation of Finance Minister Ishaq Dar, she said and added that shameless criminals who plunged the country into an unprecedented inflation were demanding resignation of Ishaq Dar, who has stabilized the economy.",
  "retrievedAt": "2025-08-11T08:47:44.373Z"
}
