{
  "title": "23rd Annual Sports Gala underway at Sargodha University",
  "author": null,
  "content": "SARGODHA, Apr 23 (APP): The University of Sargodha is buzzing with excitement as the 23rd Annual Sports Gala is underway, bringing together students from various departments to compete in a vibrant array of athletic events.\nMore than just a traditional sporting event, the sports gala stands as a dynamic platform to promote student engagement, encourage healthy competition, and nurture a culture of wellness and self-confidence.\nMale students are participating in the competitions of athletics, badminton, table tennis, chess, basketball, and tennis. Meanwhile, female students are displaying their skills in cricket, handball, football, kabaddi, tug-of-war, and shooting ball, among other events.\nSpeaking about the significance of the event, Director Sports Mahar Ahmad Khan Haral emphasized the multifaceted value of sports. He said sports play a crucial role in maintaining physical health by keeping the body active & fit and also play a vital role in enhancing mental well-being. He emphasized that regular involvement in sports helps students manage academic stress more effectively, improves concentration, and boosts overall morale.\nFurthermore, sports serve as a powerful tool for building teamwork and collaboration, as they teach students to trust one another, work together harmoniously, and strive collectively toward shared goals.\nAdditionally, he highlighted that this initiative reflects the vision of Vice Chancellor Prof. Dr. Qaisar Abbas, who is committed to fostering a balanced academic environment where co-curricular activities like sports play a vital role in promoting mental well-being, teamwork, and a healthier, stress-free student life. The Sports Gala will provide students with a refreshing break from academic routines, allowing them to return to their studies with renewed energy and focus.\nA participant from the Department of Botany, Arooj Fatima, expressed her enthusiasm for the event, stating that it is an empowering experience that goes beyond winning. She emphasized the importance of challenging oneself, learning discipline, and creating lasting memories with peers.\nThe Sports Gala will run until the end of April, offering students a vibrant opportunity to recharge, reconnect, and return to their academic journey with renewed energy and a stronger sense of community.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:48:57.365Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/23rd-annual-sports-gala-underway-at-sargodha-university/",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T13:30:00.000Z"
}
