{
  "title": "Resolves to Provide Justice at the Doorsteps of the People:Mohtasib",
  "author": null,
  "content": "ISLAMABAD, Apr 23 (APP): The Wafaqi Mohtasib (Ombudsman), Ejaz Ahmad Qureshi has called upon the government functionaries to ensure implementation of the institution’s decisions for providing immediate relief to the complainants.\nChairing a meeting with the local heads of the Federal Government agencies at Abbottabad here Tuesday, he said that the Wafaqi Mohtasib is in essence the poor man’s court, committed to providing speedy redressal to the marginalized and backward segments of the society. He urged the government officials to spare no efforts for the resolution of public complaints.\nThe Wafaqi Mohtasib, on the occasion, also referred to the outgoing year 2024, terming it as eventful and productive in the sense that the office received a large number of complaints totaling 226,373, out of which, he said, 223,198 have been resolved satisfactorily. This marked an increase of 17% and 16% in the receipt and disposal respectively over the figures of 2023, he added. He also informed that more than 93% of the decisions have been implemented during 2024 as compared to the year 2023, during which the ratio stood at 85.70%.\nLater, the Wafaqi Mohtasib also met the Press and Media representatives there and apprised them of the major initiatives launched by his office for dispensing administrative relief at the door steps of the people. He said that apart from 126 Khuli Katcheries organized during 2024 across the country, 171 visits have also been undertaken under the OCR programme which led to the resolution of 4840 complaints. “The Wafaqi Mohtasib’s Inspection Teams also undertook 79 Inspection Visits to the Federal Government agencies and departments generating large number of complaints”, he observed.\nThe Wafaqi Mohtasib further informed that with a view to expanding the institution’s outreach, new regional offices have been established at Muzaffarabad (AJ&K), Gilgit Baltistan and Sahiwal and now it has presence in 25 cities of the country. “A regional office shall soon be established at Dera Ghazi Khan too”, he added. He expressed the view that by incorporating modern technology and commissioning of digital platforms, the general public has been facilitated to a large extent in lodging their complaints through the digital means. He also lauded the performance of the regional office Abbottabad for improving it services.\nThe Wafaqi Mohtasib also referred to the steps initiated for ameliorating the lot of children in the country and facilitating the overseas Pakistanis.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:49:01.183Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/resolves-to-provide-justice-at-the-doorsteps-of-the-peoplemohtasib/",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T12:35:00.000Z"
}
