{
  "title": "Conference on Rumi & Sultan Bahu concluded",
  "author": null,
  "content": "ISLAMABAD, Apr 23 (APP): The second day of the three-day international conference titled “Mevlana Rumi & Hazrat Sultan Bahoo – Preachers of Humanity, Peace, Love, and Tolerance” concluded successfully in Islamabad. The event is jointly organized by MUSLIM Institute, Yunus Emre Institute, and the National Language Promotion Department, bringing together scholars, diplomats, students, and cultural enthusiasts from across the globe.\nThroughout the day, a total of twelve academic and dialogue sessions were held, covering a diverse range of topics including Sufi traditions in South Asia, the role of native languages in spiritual expression, the cultural relevance of Sufi poetry, and the influence of Rumi and Sultan Bahoo on modern thought, said a press release.\nIn their addresses, speakers underscored the relevance of Sufi teachings in countering extremism, hatred, and moral decline in society.\n“The essence of religion lies not merely in syllabus content, but in ethics and action,” one speaker noted. “Without genuine character development and moral training, true progress is unattainable. Ethical behavior must be practiced, not just studied.”\nParticipants emphasized that in a world yearning for spirituality, there is an urgent need to reconnect with the inner message of peace and love espoused by the Sufis. “We have everything but lack peace and love.\nThe world is spiritually hungry—let us draw from the spiritual wealth of the Sufi tradition,” remarked a panelist. Special focus was given to Punjabi Sufi poetry, with experts noting its unparalleled influence due to its unique two-syllable expression, found only in the Punjabi language.\nAlthough Hazrat Sultan Bahoo authored more than 140 books in Persian, his Punjabi verses have had the deepest cultural impact and remain widely celebrated. The global appeal of Mevlana Rumi, particularly in Central Asia, was also discussed. In countries like Uzbekistan, Rumi’s philosophy is deeply embedded in religious, educational, and cultural institutions.\nSpeakers reflected on the region’s rich spiritual heritage, declaring it a “cradle of Sufism” where various Sufi orders took root and flourished. Despite diverse methodologies, all Sufi paths ultimately aim for universal welfare and human upliftment.\nA highlight of the day was a spiritual recitation by students from the shrine of Hazrat Sultan Bahoo, who presented the poetry of Rumi and Bahoo in Arabic, Persian, Urdu, and Punjabi, moving the audience with their soulful performances. Additionally, students staged a tableau based on Allama Iqbal’s iconic Persian poem “Peer-e-Rumi o Mureed-e-Hindi” further enriching the conference experience. At the end of the sessions, commemorative shields were presented to all distinguished speakers.\nInternational delegates actively participated and praised the event’s focus on spiritual dialogue and intercultural harmony. The closing ceremony of the conference will take place on April 24, 2025, featuring prominent scholars, journalists, and socio-political figures who will reflect on the continued relevance of Sufi teachings in today’s global context.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:48:03.886Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/conference-on-rumi-sultan-bahu-concluded/",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T17:34:00.000Z"
}
