{
  "title": "Pahalgam attack: Indian media propaganda against Pakistan again exposed",
  "author": null,
  "content": "ISLAMABAD, Apr 23 (APP): The anti-Pakistan propaganda of Indian media has once again exposed as after every terrorist attack in India or in Indian Illegally Occupied Jammu and Kashmir (IIOJK)- it immediately starts leveling baseless allegations Pakistan without any concrete evidence.\n“Indian media habitually blame Pakistan after every attack and hide the truth besides misleading their own people by linking old videos to new incidents,” sources told.\nAccording to the Hindustan Times, the Pahalgam attack occurred at 3:00 PM while the social media accounts linked to the Indian intelligence agency RAW started accusing Pakistan by 3:05 PM, the sources added.\nThey claimed that Indian social media accounts started tweeting with the hashtag #PakSponsoredTerror , within 30 minutes of the Pahalgam attack. Moreover,  BJP leaders JP Nadda and Amit Shah also tweeted about the incident within 30 to 60 minutes, they said.\nOne- three hours after the incident, fake intelligence reports were leaked, which were then massively re-tweeted through RSS troll accounts, the sources said.\nThey said ironically, identical messages are tweeted from 500 Indian accounts of BJP supporters within 15 minutes of the Pahalgam incident. “Within 30 minutes, #PakistanTerrorError becomes a top trend, with tweets from fake Kashmiri names”, they said.\nThey went on to say that the Indian media has historically used such attacks—without evidence—to incite anti-Pakistan sentiment. In fact, these allegations are pre-planned and used to malign Pakistan only, they added.\nThey said that terrorism has no religion but India persistently tries to link it with Muslims especially Pakistan.\nThe Defense Experts also raised serious questions about the Pahalgam incident. “Why hasn’t Indian media shown the bodies of the 27 people allegedly killed in the attack?\nThey said that only a photoshopped image has surfaced on Indian media in which  a woman suspiciously sitting beside a man lying on the ground—with no blood or even a scratch.\nThey questioned, “Why did RAW-linked accounts start tweeting about punishing Pakistan at moment of the so-called attack?\nThe Defence Experts said that whether India can show single evidence proving Pakistan’s involvement in the so-called attack?  “Pahalgam  has distance of at-least 400 kilometer from the Line of Control, and India has deployed 900,000 troops in IIOJK, they said.\nThey questioned that in presence of such huge Indian troops, how such attack is possible?  Why do such attacks always happen when Western or American political leaders are visiting India or when there is a major event in India, they questioned.\nThey said unfortunately India did not learn anything from its past false flag operations. India must answer these questions if it wants the world to believe its fabricated stories, they asserted.\nThey said that India’s ugly face has already been exposed worldwide for sponsoring international terrorism and killing Sikhs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:49:06.831Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pahalgam-attack-indian-media-propaganda-against-pakistan-again-exposed-2/",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T10:30:00.000Z"
}
