{
  "title": "World viewing Pakistan as ‘solution, not problem’ as India’s narrative successfully countered: FM",
  "link": "https://www.app.com.pk/national/world-viewing-pakistan-as-solution-not-problem-as-indias-narrative-successfully-countered-fm/",
  "date_published": "2020-10-12T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Foreign Minister Shah Mehmood Qureshi on Monday said with robust foreign policy and effective counter-propaganda strategy, Pakistan had successfully nullified India’s propaganda on Kashmir and Afghanistan at global platform.\n“Today, the world sees Pakistan as a solution not a problem, thanks to the government’s intense counter-narrative against India in correcting the global perception,” the Foreign Minister said at the inauguration of state-of-the-art media centre, established here at the Agha Shahi Block of Ministry of Foreign Affairs (MoFA).\nThe Foreign Minister said with Pakistan’s forceful counter-narrative building, the world and international media did not blindly believe India’s blatant lies on resumption of normalcy in Jammu and Kashmir, following its illegal act of revoking the Valley’s special status last August.\nOn recent improvement in relations with Afghanistan, he said the previous wrong perception about Pakistan faded away as a clear counter-narrative was adopted by the latter.\nThe Foreign Minister said pursuing an independent foreign policy was a dream, without securing economic stability and food security.\nHe mentioned that Pakistan followed a security-centric approach on foreign policy since its establishment seven decades earlier, however stressed that overcoming the economic vulnerability was equally important to avoid shackles of International Monetary Fund (IMF).\nQureshi said digital diplomacy based on technology was a new global norm amid COVID-19 as leaders and foreign ministers held virtual meetings with their counterparts, with seminars replaced by webinars.\nOn similar lines, he said his ‘Vision Foreign Office’ was trailblazing Pakistan’s diplomacy into 21st century with minimized response time by using modern communication tools and upgraded coordination with line departments.\nHe said worldwide, the Foreign Offices worked with a conservative and cautious approach due to sensitivity of diplomatic matters; however with social media tools like Twitter used by leaders for statements, there was a need to adopt faster response instead of issuing delayed press releases.\nThe press corps of Foreign Office, he said was at the frontline of defending the country’s foreign policy narrative responsibly along with the officials of MoFA.\nHe said the new media centre at MOFA was fully equipped with modern facilities of audio and video transmission to meet the challenges of fast-paced world of news.\nHe mentioned establishment of Strategic Communication Division at MoFA meant to fight global battle of perception, while the 24/7 Crisis Management Centre proved beneficial in dealing with repatriation of stranded Pakistanis in the wake of COVID-19 situation.\nQureshi said the ‘FM Connect’ initiative, introduced in collaboration with different stakeholders, the ‘FM Direct’ mobile phone application for direct link of MoFA officers with Foreign Minister, improved virtual interaction with diplomatic community and setting up of Economic Diplomacy Wing, were highlights of the Ministry’s achievements in diplomatic domain.\nThe government’s other initiatives, he said included improved curriculum at Foreign Service Academy, the need-based roadmaps for Institute of Strategic Studies and Institute of Regional Studies as MoFA’s research arms and setting up of Advisory Council for input from academia.\nForeign Secretary Sohail Mahmood highlighted the strong bond of trust and credibility existed between the Foreign Office and media correspondents regularly covering the related its activities.\nHe said as the Foreign Office shaped up its policy, the press corps played a pivotal role in effectively disseminating and supporting the perspective within the country and abroad.\nForeign Office Spokesperson Zahid Hafeez Chaudhri and a large number of FO press correspondents attended the event.",
  "retrievedAt": "2025-08-11T19:53:35.335Z"
}
