{
  "article_id": "2025-08-25_8fe055c97f50f8df07299fe8f58025ba",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-allocates-rs-1-million-per-project-to-roll-out-ai-prototypes/",
    "retrieved_at": "2025-08-25T13:53:35.108Z"
  },
  "metadata": {
    "title": "Govt allocates Rs 1 million per project to roll out AI prototypes",
    "author": null,
    "date_published": "2025-08-25T11:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 307,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 25 (APP):The government has announced to provide a financial package of up to Rs 1 million for each artificial intelligence (AI) project reaching the prototyping stage. According to the Ministry of Information Technology and Telecommunication (MoIT), official documents available with Wealth Pakistan, the scheme will be carried out through the newly planned Center of Excellence in Artificial Intelligence, which was tasked with bridging the gap between research and industrial applications, said a press release on Monday. According to the documents, at least 400 AI projects in academia and the private sector would be funded annually, with priority for those addressing the socio-economic challenges and key sectors identified under the National AI Policy. The support package will extend beyond fiscal assistance. Along with financial backing of up to Rs1 million, the selected projects will also receive mentorship, incubation opportunities, and regulatory guidance to ensure compliance with international standards. The Centre will further serve as a platform for connecting the innovators with potential investors, increasing the prospects of turning prototypes into viable commercial products. The policy also allocates up to Rs 200,000 for at least 200 research projects annually, particularly academic theses and research work in AI. The findings will be required to be published in recognized international journals and platforms, helping establish Pakistan's presence in the global AI ecosystem. To ensure transparency, a monitoring and evaluation framework will assess the outcomes of funded projects, measuring their commercial viability, societal impact, and contribution to the AI economy. Zakir Syed, Director of Internet Governance at MoIT, said to Wealth Pakistan that the initiative represents a decisive step towards reducing reliance on imported technologies and promoting indigenous solutions. He said by fostering applied research and nurturing talent in both academia and the private sector, the government hopes to establish Pakistan as a regional hub of AI-driven innovation by 2035.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}