{
  "article_id": "2025-08-25_96e9d46338db622128f3c2b1c3ba1aa0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/three-federal-constabulary-personnel-martyred-in-hangu-terrorist-attack-interior-minister-mohsin-naqvi-pays-tribute/",
    "retrieved_at": "2025-08-25T13:53:35.454Z"
  },
  "metadata": {
    "title": "Three Federal Constabulary Personnel Martyred in Hangu Terrorist Attack; Interior Minister Mohsin Naqvi Pays Tribute",
    "author": null,
    "date_published": "2025-08-25T11:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 336,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 25 (APP):Three brave personnel of the Federal Constabulary embraced martyrdom in Hangu after repelling a terrorist assault by India-backed militants, an incident that has once again highlighted the sacrifices of Pakistan's security forces in defending the homeland. Federal Interior Minister Mohsin Naqvi, along with Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur, attended the funeral prayers of the fallen heroes at the Federal Constabulary Headquarters in Peshawar. Inspector General of KP Police Zulfiqar Hameed, Commandant Federal Constabulary Nazir Gaara, Chief Secretary KP, and senior officials were also present. The martyrs were identified as Naik Sadiq Hussain, Constable Abdul Ghaffar, and Constable Zewar Khan. Their coffins, draped in the national flag, were honored with floral wreaths and Fateha was offered for their eternal peace. Speaking on the occasion, Interior Minister Mohsin Naqvi paid rich tribute to the sacrifices of the martyred personnel. \"The sacrifices of these valiant sons will never go in vain. Their courage is a beacon for the nation, and their families are our families. The people of Pakistan will forever remain indebted to them,\" he said. Together with CM Gandapur, the Interior Minister shouldered the coffins of the martyrs as a mark of respect. Later, Minister Naqvi met with the bereaved families, offering condolences and heartfelt sympathy. He reassured them that the government and nation stand firmly by their side in this difficult hour. Prayers were also offered for the elevation of the ranks of the martyrs. The Interior Minister also visited the Federal Constabulary Hospital to inquire after Naib Subedar Kashif, who was injured during the encounter. Commending his resilience, Naqvi remarked, \"You have set an everlasting example of bravery by repelling the enemy attack. The way you confronted India-sponsored terrorists is truly commendable. We are with you today and will always remain by your side.\" The solemn occasion was attended by senior civil and military officials, who underscored the resolve that the blood of martyrs will not go in vain and that the fight against terrorism will continue with full force.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}