{
  "article_id": "2025-08-25_843303b84d7142681c8afd7d63ba8f43",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-appeals-for-unified-national-support-to-flood-victims/",
    "retrieved_at": "2025-08-25T13:53:35.107Z"
  },
  "metadata": {
    "title": "NA Speaker appeals for unified national support to flood victims",
    "author": null,
    "date_published": "2025-08-25T11:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 317,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 25 (APP):National Assembly Speaker Sardar Ayaz Sadiq on Monday called upon citizens, civil society, and the business community to extend wholehearted support to families affected by recent floods across Pakistan, terming rehabilitation a \"collective national responsibility.\" In a statement, the Speaker emphasised that both individual and coordinated efforts were vital to provide relief and rehabilitation to those who had lost their homes, livelihoods, and loved ones. He urged philanthropists, welfare organisations, and civil society to actively contribute to ongoing relief operations, noting that joint efforts alongside government measures would significantly ease the suffering of flood victims. He stressed that coordinated assistance alongside the government's ongoing measures would significantly ease the suffering of the victims. \"Rehabilitation of the flood-affected communities is our collective national responsibility. No segment of society can remain indifferent at this critical hour,\" Speaker Sadiq remarked. He highlighted that the people of Khyber Pakhtunkhwa, Gilgit-Baltistan, Azad Jammu & Kashmir, and several other regions of the country are in urgent need of food, shelter, and medical assistance. Appealing to the business community and generous individuals, the Speaker called for wholehearted contributions for the reconstruction of damaged houses and the restoration of basic facilities in flood-affected areas. Sardar Ayaz Sadiq also appealed to the youth of Pakistan to volunteer their time and energy in relief and rehabilitation efforts. \"Young volunteers can play a decisive role in assisting with the distribution of food, medical supplies, and in rebuilding the lives of those devastated by floods,\" he added. The Speaker urged the nation to demonstrate unity, compassion, and a spirit of sacrifice during this difficult period. He underlined the importance of making affected families feel that they are not alone in their struggle. \"This is a time for solidarity and empathy. Standing by our brothers and sisters in their hour of need is not only a moral obligation but also a national duty,\" Sardar Ayaz Sadiq said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}