{
  "title": "Irresponsible construction exacerbates air pollution in federal capital",
  "link": "https://www.app.com.pk/national/irresponsible-construction-exacerbates-air-pollution-in-federal-capital/",
  "date_published": "2020-02-12T21:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):The irresponsible construction work of the Faisal Avenue G7 and G8 underpass was exacerbating air pollution in the federal capital.\nThe Pakistan Environmental Protection Agency (EPA) data revealed increased ratio of toxic air pollutant-particulate matter of 2.5 microns (PM2.5).\nAn EPA official told APP that the air quality in the vicinity was being monitored through the agency’s online system, which showed increased ratio of pollutants in the air.\n“An EPA team has also visited the project site where no dust control system is put in place by the contractor executing the project. It is mandatory as per the environmental impact assessment report submitted to the EPA,” she added.\nShe said during such road constructions and mega infrastructure projects air quality was obviously reported as bad and polluted.\nThe daily ambient air quality report by EPA stated that PM2.5 was 92.23 microgrammes per metre cube (mg/ m³). The pollution level comprising particulate matter of 2.5 microns (PM2.5) was above the permissible ratio of 35 micrograms per cubic meter (mg/m³), one of the highest ratio noticed in the federal capital.\nWorld Health Organization (WHO) in it’s reports of 2015 claimed air pollution to cause huge number of premature deaths. PM 2.5 had been found hazardous pollutant which could penetrate into human blood through lungs cells.\nThe report mentioned that the 24 hours average concentrations of Nitrogen dioxide (NO2) and Sulphur dioxide (SO2) were noticed below the permissible limits of National Environmental Quality Standards (NEQS) whereas concentration of PM2.5 was within safe limit of NEQS.\nThe daily ambient air quality report of the federal capital by Pakistan-EPA, the 24 hours average ratio of nitrogen dioxide (NO2) and Sulphur dioxide (SO2) were 30 mg/ m³ and 44.21 mg/m³ respectively against the respective National Environmental Quality Standards (NEQS) of 80 mg/m³ and 120mg/m³.\nMetropolitan Corporation Islamabad (MCI) Director Sanitation Sardar Khan Zimir said it was the responsibility of the contractor to manage dust and transplanting trees from the construction site.\nWhen contacted the Member Engineering Capital Development Authority (CDA) Humayun Akhtar said the CDA officials were directed to strictly monitor the project contractors’ pledges made in the environmental impact assessment reports submitted to the Environmental Protection Agency (EPA). However, the EPA would be asked to take measures to implement the protocols and manage the dust control at the project site.",
  "retrievedAt": "2025-08-11T18:47:44.171Z"
}
