{
  "title": "Turkish President arrives on two-day official visit: PM receives at Nur Khan airbase",
  "link": "https://www.app.com.pk/national/turkish-president-arrives-on-two-day-official-visit-pm-receives-at-nur-khan-airbase/",
  "date_published": "2020-02-13T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):President Recep Tayyip Erdogan of Turkey was accorded a warm red-carpet welcome as he arrived here Thursday on a two-day official visit.\nPrime Minister Imran Khan received the Turkish leader at the Nur Khan Airbase. Senior Pakistani officials as well as the Turkish Ambassador to Pakistan were also present on the occasion.\nTwo children, clad in traditional Pakistani costume, presented bouquet to President Erdogan and the Turkish First Lady.\nContingent of static guards presented salute to the visiting dignitaries.\nLater, Prime Minister Imran Khan himself drove President Erdogan to the Prime Minister House for welcome ceremony.\nPresident Erdogan, who was visiting Pakistan on the invitation of Prime Minister Imran Khan, was accompanied by a high-level delegation, comprising cabinet members and senior government officials, as well as heads and CEOs (Chief Executive Officers) of leading Turkish corporations.\nDuring the visit, Prime Minister Imran Khan and President Erdogan will have tete-a-tete, after which they will co-chair the 6th Session of the Pakistan-Turkey High Level Strategic Cooperation Council (HLSCC) in the joint cabinet format.\nAt the conclusion of the Session, a Joint Declaration will be signed. A number of important agreements/MoUs (Memorandums of Understanding) are expected to be concluded. The two leaders will have a joint press stakeout, Foreign Office said in a statement issued here on Wednesday.\nBesides holding a separate meeting with President Dr. Arif Alvi, President Erdogan will also address a Joint Session of the Parliament of Pakistan.\nTogether with Prime Minister Imran Khan, President Erdogan will address the Pakistan-Turkey Business and Investment Forum which brings together leading investors and business-people from both sides.",
  "retrievedAt": "2025-08-11T18:47:33.294Z"
}
