{
  "title": "Saadi to compete at Karate 1-Premier League with hope to earn Olympic spot",
  "link": "https://www.app.com.pk/national/saadi-to-compete-at-karate-1-premier-league-with-hope-to-earn-olympic-spot/",
  "date_published": "2020-02-12T23:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):Pakistan’s established karateka Saadi Abbas is set to compete at Karate 1-Premier League where coveted points towards the Tokyo 2020 Olympic standings are at stake.\nThe three-day event is starting in Dubai on Friday where world’s best karatekas in various weight divisions will be in action with the intent to accumulate the all-important points in pursuit of their Olympic dreams. Saadi will be contesting in 75kg category.\n“Only the best competitors of the world take part in the Premier League. In each weight division 64 athletes will be trying their luck to make it to the global sporting spectacle [2020 Tokyo Olympics],” Saadi told APP on Thursday on phone from Dubai where he is training with the UAE national karate team.\n“These qualifiers are taking place almost every month, so we [karatekas] know each other’s strengths and weaknesses very well. I’ve trained really hard for the event. I’ve tried to remove some of the shortcomings in my game with the help of UAE national coach, who is a highly seasoned trainer,” added the 31-year-old, who is also Pakistan’s sole athlete to represent the country in any weight division at the league.\n“Sometimes it’s also a matter of luck because you have to pay the price even for a very little mistake you make on the day,” added the two-time Commonwealth Championship gold medalist and former Asian Champion.\nCurrently world number 23 in his division, Saadi would have to finish among top five in the league to earn a spot for the Olympics. In case if he remains unable to do that, he would still have the chance to make his dream come true as Pakistan Karate Federation (PTF) is also planning to field him in a series of Premier League Olympic qualifying tournaments.\nAndleeb Sandhu, secretary of PKF told APP that Saadi would keep on featuring in the league qualifying tournaments till their conclusion in May. The next qualifiers are scheduled to take place in Austria on February 28 to March 1, Morroco on March 13 to 15 and Madrid, Spain on April 17 to 19 and May 8 to 10 in Paris, France.\nAndleeb said she was hopeful that the hard training and commitment would pay the dividends and Saadi would live up to the expectations. “At one stage he was among world’s top ten in his weight division. This is a testament to his perseverance and tenacity. He is our only hope and we’re optimistic he can once again improve his ranking to qualify for Olympics,” she added.\nKarate that will make debut at Olympics is one of the five sports added by the International Olympic Committee in sports list of the quadrennial event. However, it will be part of the 2020 programme specifically rather than a permanent sport.",
  "retrievedAt": "2025-08-11T18:47:42.847Z"
}
