{
  "title": "Social media companies will have to open offices in Pakistan: Firdous",
  "link": "https://www.app.com.pk/national/provinces-asked-to-prepare-comprehensive-plan-to-strictly-deal-with-elements-involved-in-adulteration-of-edibles-firdous/",
  "date_published": "2020-02-13T01:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan on Thursday said under the Citizens Protection [against Online Harm] Rules 2020, social media companies would have to open offices in Pakistan, follow laws of the land, and get registered and share their data with the authority concerned.\nTalking to news-persons here outside the Parliament House, she said framing rules were necessary for stopping online propaganda against national solidarity and spread of sectarian hate material etc.\nDr Firdous said at present, there was no mechanism in Pakistan for regulation of the social media, which was being used to spread material against socio-cultural and religious values. The government had to appeal the social media companies for removal of objectionable material.\nShe said the rules were made for the protection of ideological and geographical boundaries of the country and rights of the consumers. After their implementation, the social media companies would be bound to remove objectionable material within six to 24 hours, she added.\nShe rubbished the claim that the rules were being made to impose restrictions on freedom of expression, which were in fact aimed at facilitating the consumers and protecting the national interests.\nThe social media companies would have the right to appeal against the decision of the authority concerned in a high court, she added.\nShe said with the implementation of rules, the payment of millions of dollars to the social media companies would also be regulated through a mechanism.\nThe SAPM said Prime Minister Imran Khan while chairing a high-level meeting directed the provinces to make a comprehensive plan of action to strictly deal with the elements involved in adulteration of edibles items.The meeting was attended by representatives from all the four provinces to control inflation, adulteration and hoarding.\nThe prime minister, she said, was informed that the prices of edible items including flour, sugar, rice, pulses and edible oil remained stable in the country. He, however, expressed his reservations over the price of wheat flour in Karachi.\nShe said PASCO had released 400,000 tonnes of wheat to Sindh, wile the provincial government was demanding more 100,000 tonnes of the commodity from the strategic stock.\nShe said the Balochistan government was directed to take strict action against the elements involved in adulteration and asked for establishment of a food testing laboratory there. No laboratory exited in the province presently.\nDr Firdous said Prime Minister Imran Khan also issued directions for the Food Price Monitoring and National Demand Supply Cell to ensure better coordination among the Centre and provinces in future.",
  "retrievedAt": "2025-08-11T18:47:41.586Z"
}
