{
  "title": "KCR to be functional soon: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/kcr-to-be-functional-soon-sheikh-rasheed/",
  "date_published": "2020-02-13T03:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):Railway Minister Sheikh Rasheed Thursday assured that with the orders of Supreme Court (SC), Sindh government and Railways will start removing all encroachments that come in the way of Karachi Circular Railways (KCR) and it would be functional soon.\nTalking to a private news channel, he reiterating his commitment that the federal government would ensure implementation of the KCR project without any delay and promised all-out assistance to Sindh government in this regard.\nHe said Karachi Circular Railway was the project of Sindh government but after the SC orders the ministry of railways would extend all possible cooperation and support to Sindh government for timely execution of the Karachi Circular Railways (KCR) project which will be complete soon where at least one train will be launch\nin next three months.\nThe Railway Minister said that the Pakistan Railways had become the only railways in the world which was earning profit and achieving its target goals with highest ever revenue under the leadership of Prime minister Imran khan.\nMinister also hailed the positive timely step of Justice Gulzar Ahmed for taking this issue seriously.\nHe said old tracks and signals were among the main causes of the accidents around Railway lines, adding, Main Line-1 (ML-1) was the only solution to all issues where work will start.\nAfter the completion of ML-1 the train would complete its journey from Lahore to Karachi in six hours and from Rawalpindi to Karachi in eight hours adding new signals and tracks would also be constructed, he added.\nHe said that currently 138 trains were running on the track that was the achievement of Pakistan Railways.\nReplying a Question regarding Wheat crises, he said there is no wheat and sugar crises but in past mismanagement was the reason behind this issue, adding, all the district administrations had been directed to ensure government rates of the wheat flour in their respective areas as some of the dealers had created artificial crisis of the flour in provinces.\nHe said strong policies and prudent economic plans of Pakistan Tehreek-e-Insaf (PTI) government had put the country on the way of prosperity.",
  "retrievedAt": "2025-08-11T18:47:35.578Z"
}
