{
  "title": "Pakistan vies for agreement on ‘best economic projects’ during Erdogan’s visit: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-vies-for-agreement-on-best-economic-projects-during-erdogans-visit-qureshi/",
  "date_published": "2020-02-13T01:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):Minister for Foreign Affairs Shah Mahmood Qureshi Thursday said Pakistan was trying to reach an agreement with Turkey on the mutually beneficial best economic projects during the business-to-business interactions to be held during the ongoing visit of Turkish President Recep Tayyip Erdogan.\nThe foreign minister, in a statement on the two-day visit of Tayyip Erdogan who arrived here earlier in the day, said the Turkish president was accompanied by renowned businessmen to meet their Pakistani counterparts, which would herald a new era of Pak-Turkish economic cooperation.\nHe said Prime Minister Imran Khan had desired to form an economic strategic partnership with Turkey and had also discussed the matter in detail with the Turkish government during his visit to the country.\nHe hoped that the two countries would sign an agreement on bilateral cooperation, which would help form a new framework of mutual cooperation.\nHe viewed that the trade, economic and investment ties would held further strengthen the bilateral ties.\nQureshi said Pakistan and Turkey enjoyed historic and ideal relations, and had also supported each other at regional and international forums.\nHe said Erdogan was among those world leaders, who had openly supported Pakistan’s stance on the Kashmir issue even at the United Nations General Assembly. Turkey also stood by Pakistan at the Financial Action Task Force (FATF).\nHe said Pakistan desired to turn the existing bilateral political ties into an economic partnership. Keeping in view its economic challenges, Pakistan would welcome the investment from Turkey as part of its economic diplomacy.",
  "retrievedAt": "2025-08-11T18:47:41.143Z"
}
