{
  "title": "Pak-Turkish leadership affirm to support each other on issues of national interest",
  "link": "https://www.app.com.pk/national/pak-turkish-leadership-affirm-to-support-each-other-on-issues-of-national-interest/",
  "date_published": "2020-02-13T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP):President Dr Arif Alvi and his Turkish counterpart Recep Tayyip Erdogan on Thursday affirmed that Pakistan and Turkey would continue to extend mutual support on issues of each other’s core national interest.\nThey also underscored the importance of fully realizing the immense potential of relationship between the two countries and transforming it into a strong and dynamic trade and economic partnership.\nPresident Erdogan, who along with a high-level delegation arrived here on a two-day visit to attend the 6th Session of High Level Strategic Cooperation Council (HLSCC), met President Dr Alvi at the Aiwan-e-Sadr.\nPresident Alvi, extending a warm welcome to President Erdogan, expressed gratification over the level of enhanced and multifaceted engagement between the two countries. The 6th Session of High Level Strategic Cooperation Council would further strengthen and broaden the fraternal relations between Pakistan and Turkey, he added.\nBoth the leaders underlined the special significance of the historic bilateral relationship between the two countries in diverse areas, including political, economic, cultural, defence and people-to-people contacts.\nPresident Alvi apprised President Erdogan of the worsening human rights situation in the Indian Occupied Jammu & Kashmir and took the opportunity to thank his Turkish counterpart for his principled stand on Kashmir.\nThe two leaders also exchanged views on regional and international issues.\nPresident Alvi highlighted Pakistan’s efforts for peace and reconciliation in Afghanistan and stressed that the world community should extend its help in Afghanistan’s post-conflict reconstruction.\nThe two presidents also agreed that Pakistan and Turkey must continue to work closely to counter challenges facing the Ummah, including Islamophobia.\nThe President and First Lady later hosted a banquet in honour of President and Mrs Erdogan and the entourage accompanying them.",
  "retrievedAt": "2025-08-11T18:47:33.306Z"
}
