{
  "title": "Imran Khan imported terrorism, pushed country to verge of default: Bilawal",
  "link": "https://www.app.com.pk/national/imran-khan-imported-terrorism-pushed-country-to-verge-of-default-bilawal/",
  "date_published": "2022-12-31T16:53:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 31 (APP): Chairman Pakistan People’s Party (PPP) and Foreign Minister Bilawal Bhutto Zardari said on Saturday that PTI chief Imran Khan imported terrorism and pushed the country to the brink of default.\nAddressing the PPP’s candidates nominated for the Local Government from Karachi here on Saturday Bilawal said, “We are bearing the brunt of Imran Khan’s economic crisis”.\nSindh Chief Minister Syed Murad Ali Shah, PPP senior leader and former CM Syed Qaim Ali Shah, PPP Sindh President Nisar Ahmed Khuhro, Ministers Sharjeel Inam Memon, Syed Nasir Hussain Shah, Saeed Ghani, Spokesman for Sindh government Murtaza Wahab and others were also present on the occasion.\nThe PPP chairman said that the county was facing crisis as Imran Khan’s politics of hatred damaged the democracy, politics and economy of the country.\nShaheed Mohtarma Benazir Bhutto laid her life for the people and democracy he said adding that the people laid down their lives and embraced martyrdom for this cause.\nHe said that they would not compromise on the security of the country. PPP had always saved the country in the past and would also save her in the future.\nBilawal said that Imran Khan kept them calling imported government but in fact, he (Imran) imported terrorism and introduced the politics of hatred in the country.\nThe PPP chairman said that PTI MNAs were imploring for not accepting their resignations. He said that in fact, they were escaping from elections.\nHe said that the next mayor of Karachi would be of PPP.\nLG elections were delayed and postponed many times at the eleventh hour, he said adding that jiyalas would foil all conspiracies and win LG elections.\nHe informed that they would expand solid waste management set-up across the province and directed that the common men should be provided cheap fares facility adding that PPP bus service would be expanded across the Sindh province.\nBilawal said they would pull the country out of the crises by following the vision of Shaheed Zulfikar Ali Bhutto and Shaheed Benazir Bhutto.\nSindh Chief Minister Syed Murad Ali Shah addressing the ceremony said that Karachi was termed the worst city in terms of law and order situation in the past but now no terrorist can halt the city.\nThe former government announced Rs1100 billion for the city but it did not give even 11 rupees.\nHe further said that PPP jeyalas would transform Karachi into the best city as it was in the past.\nPPP Sindh President Nisar Ahmed Khuhro said that PPP had fielded its candidates for the first time in Karachi for LG polls.",
  "retrievedAt": "2025-08-11T16:04:55.308Z"
}
