{
  "title": "NDMA working round-the-clock to handle disasters: NA told",
  "author": null,
  "content": "ISLAMABAD, Aug 11 (APP): Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry informed the National Assembly on Monday that the National Disaster Management Authority (NDMA) operates round-the-clock to deal with disasters such as floods, earthquakes, and other emergencies.\nResponding to a calling attention notice about the lack of earthquake awareness campaigns and preparedness drills, particularly in Karachi, he said the NDMA carries out regular risk assessments and technical evaluations to address natural calamities. It also works closely with national and international partners to raise public awareness.\nHe said special efforts are made to alert provincial authorities and local communities in high-risk areas so that timely preventive measures can be taken. Referring to recent floods, which caused significant losses in past years, he said early warnings and hazard assessments had helped save lives and reduce damage.\nDr. Tariq Fazal Chaudhry explained that the NDMA’s main role is coordination and situation analysis, while disaster management operations start at the district level, move to the provincial level, and finally to the national level. Without advance alerts and preparedness measures, he said, losses from recent floods could have been much higher.\nHe said the NDMA, established under the 2010 NDMA Act, works at the national level while coordinating with Provincial Disaster Management Authorities (PDMAs) and district-level bodies.\nThe authority uses both global and national monitoring systems for weather and seismic activity, including dedicated earthquake monitoring portals, to provide real-time data, hazard analysis, and early warnings.\nPublic awareness campaigns and technical assessments, he said, are carried out regularly to anticipate and reduce potential risks.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T19:58:47.392Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ndma-working-round-the-clock-to-handle-disasters-na-told/",
  "dateList": "2025-08-11",
  "date_published": "2025-08-12T02:06:00.000Z"
}
