{
  "title": "ISSI hosts roundtable on “One Year of Modi 3.0 – India’s Foreign Policy Ambitions and Domestic Governance”",
  "author": null,
  "content": "ISLAMABAD, Aug 11 (APP):To evaluate the BJP government’s performance during the first year of its third term, with a particular focus on how ‘Modi 3.0’ fared on domestic socio-political, economic, military, and foreign policy fronts, the India Study Centre (ISC) at the Institute of Strategic Studies Islamabad (ISSI) organised a Round Table on Monday, titled: “One Year of Modi 3.0 – India’s Foreign Policy Ambitions and Domestic Governance.”\nThe roundtable was attended by senior diplomats, practitioners, academics, think-tank experts, and area specialists, said a press release.\nDirector General ISSI Ambassador Sohail Mahmood delivered welcome remarks. Of the panellist, Dr. Raashid Wali Janjua spoke on the internal dynamics of Modi 3.0, while Ambassador Riffat Masood covered the foreign policy arena. The distinguished participants included former Foreign Minister Ambassador Inam ul Haque.\nDuring the course of discussion, it was highlighted that since the beginning of 2025, the BJP has incurred losses in the internal political space, while India lost considerable ground in its international standing and image.  There is deepening polarization in Indian society on political, social, economic, ethnic, linguistic and regional lines.\nThe Waqf bill, migration laws, and revision of voter lists in states like Bihar indicated further shrinking space for the Muslims. ‘Saffronisation’ of key state institutions — including the Planning Commission, Election Commission, High Judiciary, and the Armed forces — has been the hallmark of the Modi era.\nExperts also noted an ostensible rift between the RSS and BJP on a range of issues from appointment of BJP party President, to PM Modi approaching the age of 75 years, to some BJP segments’ clamour for a course independent from Nagpur. In the aftermath India-Pakistan conflict of May 2025, PM Modi’s popularity has declined, but he could probably manage the mounting challenges. Internally, India is coping with issues like poverty, income inequality, and growing unemployment. In today’s India, is witnessing creeping authoritarianism and majoritarianism. Pluralism is increasingly losing ground.\nIt was highlighted that in order to understand Indian policies, particularly towards Pakistan, the Indian “mindset” needs to be understood first. Experts pointed out that India never accepted the creation of Pakistan and the current BJP leadership believed in the RSS fantasy of Akhand Bharat.\nModi’s disdain for Pakistan and his expansionist designs are reflective of this mindset. Across the world, election campaigns mostly focus on internal issues, but in the case of India, election campaigns are more about Pakistan-bashing to stoke nationalism and garner votes.\nIt was underscored that despite ongoing tensions between India and the U.S., the relationship between the two countries would likely remain intact as it is institutionalised and both countries are strategically important to each other. Notably, as compared to the Biden Administration, which was tilted towards India, President Trump has decided to maintain a balance between India and Pakistan.\nParticipants were of the view that both Congress and the BJP are two sides of the same coin. No matter who holds power, India’s antagonistic posture towards Pakistan will remain the same. Indian arrogance has given way to resentment in South Asian countries, but for smaller states in the region it will be difficult to go against India.\nParticipant held the view that since, according to Indian side, “Operation Sindoor is still continuing”, Pakistan must remain vigilant and prepared to effectively respond to new risks and challenges likely to arise in India-Pakistan relations or regionally. Pakistan must be ready for any eventuality, including further false flag operations.\nFurthermore, fallacious thinking exists in India that there is space for conventional war under the nuclear threshold. Pakistan must take steps to disabuse India of this false, irresponsible and dangerous notion. The paramount importance for Pakistan to ensure economic strength and robust defence and deterrent capability was also underscored.\nParticipants cautioned that under Modi, Kashmir’s religious and cultural identity is at risk. Pakistan must continue to raise the Jammu and Kashmir dispute proactively at all available forums. On Kashmir, as well as India’s decision of holding the Indus Waters Treaty (IWT) in abeyance, Pakistan must explore more diplomatic and legal options.\nThe upcoming United Nations General Assembly (UNGA) session would be a good opportunity for Pakistan to raise these two issues. More importantly, Pakistan must work on building more water reservoirs and improving its domestic water management with urgency.\nThe roundtable concluded with a vote of thanks by Ambassador Khalid Mahmood, Chairman BoG, ISSI.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T19:58:33.749Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/issi-hosts-roundtable-on-one-year-of-modi-3-0-indias-foreign-policy-ambitions-and-domestic-governance/",
  "dateList": "2025-08-11",
  "date_published": "2025-08-12T04:19:00.000Z"
}
