{
  "title": "Govt to protect rights of minorities: PM",
  "author": null,
  "content": "ISLAMABAD, Aug 10 (APP): Prime Minister Muhammad Shehbaz Sharif said the government of Pakistan guided by high religious and constitutional values was committed to the full inclusion of minorities in government institutions, Parliament and the national mainstream.\nIn a message on National Minorities Day observed on August 11, he said, “Today, the entire nation, including me, is celebrating National Minorities Day to protect the rights of minorities and appreciate their key role in the country’s development and progress.”\nHe said, ” Today, we renew our pledge to always strive for religious freedom and equal rights of minorities in the light of the teachings of the founder of Pakistan and Islamic teachings”\n“The historic speech of the founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah on August 11, 1947, is an ideological guarantee for the secure future of minorities in Pakistan,” he remarked, adding, “The welfare and well-being of all minorities in Pakistan, be they Sikhs, Christians, Hindus, Parsis, is one of the priority duties of the government of Pakistan.”\n“Pakistan considers the unforgettable services rendered by minorities in every walk of life as its national asset. Many Pakistani sons belonging to minorities have bravely sacrificed their lives in the defence of the country. We pay tribute to them from the bottom of our hearts,” he said adding, “Pakistan is proud of its minorities’ patriotism, professional hard work and attachment to national heritage and culture.”\nThe prime minister said, “It is a matter of satisfaction that minorities in Pakistan enjoy all political, economic and social rights under the Constitution of Pakistan.”\n“Protection of the rights of minorities is not only a constitutional obligation but also our religious duty. Because Islam specifically advocates the protection of civil, religious and social rights of minorities. Ulema and religious leaders play a key role in protecting religious freedom, ensuring the honour and dignity of places of worship and minority representatives,” he noted.\n“All Pakistanis, including minorities, need to realize their national responsibilities by practicing unity and solidarity, mutual respect and tolerance. Today, all Pakistanis and the Government of Pakistan, regardless of colour and race, reaffirm their resolve to fulfil their national duties in a unified manner,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:00:23.205Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-to-protect-rights-of-minorities-pm/",
  "dateList": "2025-08-11",
  "date_published": "2025-08-11T07:00:00.000Z"
}
