{
  "title": "International conference on Al Farabi from Monday",
  "link": "https://www.app.com.pk/national/international-conference-on-al-farabi-from-monday/",
  "date_published": "2020-12-19T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP):A two-day International conference titled, “Global Al- Farabi Forum” will kick off at the COMSTECH Secretariat in Islamabad from December 21 (Monday).\nPresident Dr. Arif Alvi is likely to inaugurate the conference, said a news release.\nThe two-day conference is being organized jointly by COMSTECH (the OIC Ministerial Standing Committee on Scientific and Technological Cooperation) and the Government of Kazakhstan in celebration of the 1150th anniversary of Abu Nasr Al-Farabi, the great Muslim philosopher and scientist who hailed from the lands now included in Kazakhstan.\nThe two-day conference includes lectures, both in person and online, by leading international experts on early Islamic thought, history and philosophy.\nThe list of speakers includes Prof. Asad Q. Ahmed of Berkeley, Prof. Peter Adamson from Munich, Prof. Ann Druart from Washington, Prof. Iftikhar Malik from Bath United Kingdom, Prof. Galimkir Mutanov of Al- Farabi University of Kazakhstan, and Dr. Darkhan Kydyrali of the International Turkic Academy. The distinguished guests include Assistant Secretary General of OIC, Ambassador Askar Mussinov, and the Kazakhstan Ambassador to Saudi Arabia Mr. Berik Aryn.\nOver 120 scholars from several countries (Pakistan, United Kingdom, Kazakhstan, Cameroon, Nepal, Somalia and Sudan) are participating in this major international event.\nThe lectures cover different aspects of the multi-faceted contributions of Al-Farabi as the pioneer who served as a bridge between the ancient Greek thought of Aristotle and others and the early Islamic civilization.\nFor his seminal and profound contributions in developing the foundations of Islamic philosophy Al-Farabi came to be known as the Second Master, the ultimate authority in philosophy after Aristotle.\nBesides the opening session, inaugurated by the President, the conference has five working sessions with lectures, followed by a closing session with a panel discussion titled “Science and the Islamic World-A philosophical assessment”, with a focus on identifying the intellectual and physical impetus required for scientific uplift in the Islamic world of today.\nThe objective of the event is to highlight the great scholarly traditions of Muslims.",
  "retrievedAt": "2025-08-11T20:09:40.336Z"
}
