{
  "title": "PPP, PMLN era loans’ repayment hampers subsidy on essential commodities: Fawad",
  "link": "https://www.app.com.pk/national/ppp-pmln-era-loans-repayment-hampers-subsidy-on-essential-commodities-fawad/",
  "date_published": "2021-10-28T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Thursday said that the government was unable to give subsidy on daily use items especially edibles and petroleum products due to repayment of the foreign loans taken by the previous governments.\nAddressing the oath taking ceremony of Pakistan Television Employees Union, he said from 1947 to 2008, Pakistan took loans amounting to Rs 6,000 billion to execute mega projects and build institutions, while Rs 23,000 billion was borrowed during the past two tenures of Pakistan People’s Party (PPP) and Pakistan Muslim League-Nawaz (PML-N) (2008-18).\nLast year, he said the country had to return $ 10 billion loan, whereas this year, the amount stood at $ 12 billion.\nIn such a situation, it was not possible for the government to pass on maximum relief to the consumers, he added.\nHe said prices of commodities were increased globally after the outbreak of coronavirus, adding ‘Pakistan is no exception’.\nFawad said prices of petroleum products in the international market had witnessed a sharp rise and Pakistan had to import oil products.\nHe said, in the past, Pakistan was self-sufficient in natural gas but now its reserves are depleting by 9 per cent every year, so it was also being imported.\nThe minister said the PPP and PML-N, during their tenures, ruined the national institutions like PTV, PBC and PIA.\nFawad said, the Pakistan Tehreek-e-Insaf government, after coming into power, made serious efforts to reinvigorate institutions. “I have appointed heads of 88 institutions on merit,” he added.\nHe said, Pakistan Television (PTV) has been transformed into a profitable institution by introducing prudent policies of government, in addition to efforts of its management and workers.\nHe extended gratitude to the PTV management and workers for a turnaround in its financial matters and expressed the hope that this journey would continue in coming years as well.\nFawad announced that the welfare and promotion of employees were among the foremost priorities of the present government. The PTV management would take steps in that regard, he added.\nHe said that when PTV was launched it used to be the most modern institution but in the past the governments had not paid attention on its up-gradation.\nEarlier, he administered oath to newly elected office bearers of the PTV employees Union.\nSecretary Information and Broadcasting Shahera Shahid and MD PTV Amir Manzoor were also present on the occasion.",
  "retrievedAt": "2025-08-11T21:32:02.033Z"
}
