{
  "title": "NDMA organized Parliamentarian Caucus",
  "link": "https://www.app.com.pk/national/ndma-organized-parliamentarian-caucus/",
  "date_published": "2021-10-28T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP):National Disaster Management Authority (NDMA) organized a parliamentarian caucus in collaboration with the Ministry of National Food Security, Research and Ministry of Climate Change on disaster risk management.\nParticipants from across the party lines including senators, members of national and provincial assemblies, officials from international agencies, humanitarian networks and Director Generals of Provincial Disaster Management Authorities participated in the caucus.\nThe aim of the caucus was to highlight the role of parliamentarians in disaster management. It also aimed to develop understanding and promoting dialogue on various aspects of disaster risk management, international frameworks, gender equality and child protection. It further emphasized at capacity building of the Parliamentarians in supporting, promoting and implementing national agenda to build resilience.\nChairman NDMA Lt Gen Akhtar Nawaz Satti welcomed the participants and in his opening remarks underscored the role of parliamentarians for disaster risk management.\n“People of Pakistan have always faced disasters with courage and resilience. We need national resolve, political commitment and institutional determination to make the country resilient, build the capacity of departments like NDMA and make Pakistan a disaster resilient country”, he added.\nMinister of National Food Security Syed Fakher Imam on the occasion appreciated efforts of NDMA for providing parliamentarians a platform to initiate dialogue on disaster risk management.\nThe federal minister said “climate change and natural calamities result in disasters and their impact becomes acute threat to sustainable development and peaceful co-existence, if we fail to respond to these challenges with an understanding and collectively as a mission”.\nHe further added elected representatives are key to strengthening disaster risk governance by voicing needs and concerns of the land and people of respective areas.\nMinister Energy Hammad Azhar on the occasion said that “Since past two decades Pakistan has been facing various kinds of disasters. Need of the hour was to have structured organizations like NDMA who could respond immediately.\nlimate change is not going away, unfortunately these disasters are always around the corner, we need to learn from the past disasters and prepare for future, but other than resources we need effective management and coordination to deal with the disasters”.\nMinister of State for Climate Change Zartaj Gul lauded the initiative by NDMA and stated that, climate change stands today as one of the most critical threats to global development and we must focus on long term goals. Ministry of climate change has successfully undertaken numerous initiatives for climate change adaptation and mitigation.\nWhile appreciating the presence of parliamentarians she said that “I am confident after seeing this gathering here today, aiming to be aware and cautious for safe and resilient future of Pakistan that will enable the country to prepare in the face of any catastrophe.”\nParliamentarians actively participated in the caucus and suggested the ways out to deal with disaster risk management. This was the second parliamentarian caucus on the subject, first was held in 2019.",
  "retrievedAt": "2025-08-11T21:32:01.725Z"
}
