{
  "title": "Early diagnosis a key to reducing Pakistan’s highest breast cancer rate in Asia: Begum Alvi",
  "link": "https://www.app.com.pk/national/early-diagnosis-a-key-to-reducing-pakistans-highest-breast-cancer-rate-in-asia-begum-alvi/",
  "date_published": "2021-10-28T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP): Begum Samina Alvi, wife of President Arif Alvi on Thursday said Pakistan had the highest rate of breast cancer patients in Asia and stressed that early diagnosis was the key to addressing the challenge.\nSpeaking at a panel discussion on breast cancer awareness organized by the Pakistan Foreign Office Women’s Association (PFOWA) here at the Ministry of Foreign Affairs, she said if the women knew early symptoms of the disease, the death rate could be reduced.\nBegum Alvi said one in nine women in the country was diagnosed with breast cancer and added that the alarming situation required urgent steps.\nShe said individual barriers such as lack of awareness, shyness, and natural reluctance about breast cancer resulted in diagnosis at late stages of the disease thus increasing the mortality rate.\nSamina Alvi said breast cancer patients needed effective and strong emotional support through family members and social circles.\nShe advised the women to adopt a healthy lifestyle and focus on self-detection to notice any abnormality in their bodies.\nShe commended PFOWA for organizing the panel discussion of doctors, oncologists, and breast cancer survivors aimed at spreading awareness about the disease.\nForeign Secretary Sohail Mahmood said breast cancer was one of the most invasive cancers in women, with related taboos rooted in the society.\nHe said the awareness initiatives on breast cancer played a pivotal role in highlighting the need to control the disease through early diagnosis.\nHe mentioned that this year the breast cancer awareness campaign continued at a stronger pace than previous years with efforts including illuminating buildings with pink lights, and a sustained ‘pink ribbon’ discourse on television and newspapers.\nHe said the Foreign Office would continue to extend support to the awareness campaign on breast cancer.\nPresident PFOWA Mehwish Sohail said owing to the highest mortality rate of breast cancer patients in Asia, a proactive approach was need of the hour to address the challenge.\nBesides medical treatment, she said, it was important to also deal with the socio-psychological impact of the disease.\nShe mentioned that PFOWA was currently supporting the NORI hospital in the treatment of breast cancer patients.\nDuring the panel discussion, the experts highlighted the importance of early diagnosis of breast cancer through screening and self-detection.\nDr Humaira Mehmood, Oncologist at NORI Hospital said breast cancer was getting common in Pakistan, mostly diagnosed between the age of 40 to 49.\nHowever, she said, age was not a binding factor as any woman between 20 to 70 could become a victim of the disease.\nShe said statistics showed that the number of breast cancer patients from Punjab and Islamabad was higher, adding that this was probably due to the availability of screening facilities.\nDr Ayesha Majeed, Radiologist at Pakistan Institute of Medical Sciences (PIMS), said in Pakistan, breast cancer was sporadic in nature and could be either related to genetics or not.\nShe said the facility of mammography and screening needed to be linked with the government’s link to socio-welfare programmes including Ehsaas and Sehat Sahulat to expand their outreach.\nGeneral Secretary PFOWA Fatima Musdassir said a strong family support system could ease the difficult journey of a breast cancer patient.\nBreast cancer survivors Dr Maria Catalina Alliende and Samina Zafar while sharing their personal experiences said a proactive approach was needed if a woman was diagnosed with breast cancer.\nThey urged the survivors to come forward to dispel myths about the disease and raise awareness among more women.\nLater, Begum Samina and Foreign Secretary Sohail Mahmood signed the ‘Think With PFOWA’ wall to be displayed at the breast cancer ward at the Federal Breast Cancer Screening Department at PIMS.\nPresident PFOWA Mehwish Sohail presented a pink shawl to Begum Alvi as a symbol of the breast cancer awareness campaign. On behalf of her organization, she presented a donation cheque to Oncologist Dr Humaira of the NORI Hospital.",
  "retrievedAt": "2025-08-11T21:31:59.853Z"
}
