{
  "title": "Naval Chief visits Tunisia",
  "link": "https://www.app.com.pk/national/naval-chief-visits-tunisia/",
  "date_published": "2022-02-12T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi, who is on official visit to Tunisia called on Tunisian Navy Chief of Staff Rear Admiral Adel Jehane, Minister of National Defence Imed Memmich and other senior Naval officials, separately during his visit.\nUpon arrival at Tunisian Navy Headquarters, the Naval Chief was received by Tunisian Navy Chief of Staff and was presented Guard of Honour, said a Pakistan Navy media release received here.\nDuring the meeting with Tunisian Navy Chief of Staff Rear Admiral Adel Jehane regional maritime security and professional matters of mutual interest including bilateral naval collaboration were discussed.\nThe Naval Chief highlighted Pakistan Navy’s efforts for ensuring maritime security in the region including Regional Maritime Security Patrols and participation in Combined Maritime Forces (CMF).\nChief of the Naval Staff Admiral Muhammad Amjad Khan Niazi also visited La Goulette Naval Base and Naval Academy Menzel Bourguiba and a briefing was given to the Naval Chief on Mission and Organization of Tunisian Navy.\nThe Admiral also visited onboard Tunisian Patrol Boat type ISTIKLAL, indigenously built by Tunisian shipyard.\nLater during meeting with Tunisian National Defence Minister, matters of mutual interest including bilateral defence collaboration were discussed.\nThe Naval Chief underscored the importance of enhancing interactions between the armed forces of both countries through exercises and training exchange programmes.\nTunisian Defence Minister, while acknowledging the significance of bilateral military cooperation in diverse realms, stressed on enhancing collaborations in expanded military domains.\nIt is expected that visit of the Naval Chief will further augment and expand defence ties between the two countries in general and navies in particular.",
  "retrievedAt": "2025-08-11T14:19:16.618Z"
}
