{
  "title": "PM directs reopening/review of 0.238mln citizens’ complaints on PCP",
  "link": "https://www.app.com.pk/national/pm-directs-reopening-review-of-0-238mln-citizens-complaints-on-pcp/",
  "date_published": "2022-02-12T08:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): Prime Minister Imran Khan has desired for reopening of 0.238 million public complaints received on Pakistan Citizen’s Portal with the direction for the respective higher authorities to hold review in these cases under their supervision for disposal on merit.\nAccording to a letter of the Prime Minister’s Office shared by PM Office Media Wing on Saturday, a total of 1.5 million complaints were received on Pakistan Citizen’s Portal (PCP) during 2021, however, a set of 238,098 complaints were earmarked on the basis of public feedback for reopening to the respective authorities for review and better resolution while adhering to merit.\nThe prime minister has directed the federal secretaries, provincial chief secretaries and IGPs to hold exclusive meetings with the heads of the departments/attached departments/divisional commissioners/RPOs etc. and assign the respective caseload of complaints being reopened with specific instructions to review the same in their supervision for disposal on merit.\nIt was further directed that purpose of the review should not be merely increasing positive feedback rather actual disposal of issues/complaints while strictly adhering to the merit/rules and regulations.\n“Responsibility, in the case of each organization/department/formation, shall be entrusted to a senior officer to supervise the review activity at all levels,” it was added.\nTwo sets of complaints/issues which were directed to be reopened/ reviewed included a total of 11,4918 complaints in which relief was granted, whereas 123,182 other issues in which grant of partial relief was indicated.\nIn the first category, complaints selected for reopening included those which had been closed under the status of ‘relief granted’ wherein the citizens had denied the same by posting negative feedback.\nWhile in the other set of complaints selected for reopening/review pertained to the category where partial relief was granted. These warranted either to update the citizens about further progress in their cases if required or forward the same if it involved the role of any other department organizations, the contents of the letter said.\nThe PM’s office further said that out of these total complaints, 107,000 related to the federal departments/organizations, 80,000 to Punjab province, 27,000 to Khyber Pakhtunkhwa province, 15,000 to Sindh, 3,000 to Balochistan province, 11,00 to Azad Jammu and Kashmir, 400 to Gilgit Baltistan which would be subjected to further review.\nThe citizens had posted their concerns/complaints on PCP related to municipal services, power and gas, communication and education sector.",
  "retrievedAt": "2025-08-11T14:19:16.401Z"
}
