{
  "title": "Opposition’s no-confidence move aimed at protecting their corruption: Shahbaz Gill",
  "link": "https://www.app.com.pk/national/oppositions-no-confidence-move-aimed-at-protecting-their-corruption-shahbaz-gill/",
  "date_published": "2022-02-12T14:23:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 12 (APP):Special Assistant to the Prime Minister (SAPM) on Political Communication Dr Shahbaz Gill has said the opposition is attempting to bring a no-confidence motion only to protect their corruption.\nIn a press conference held here on Saturday, he said that the Sharifs of Punjab, Zardari from Sindh and Maulana Fazlur Rehman were members of the same mafia and they got united because of Prime Minister Imran Khan’s campaign against corruption.\nHe said that the opposition wanted to bring no-confidence motion to save themselves from accountability. He said that the opposition parties had been in trouble for few days and all thieves had been united. “In the past, they had been calling each other thieves,” he added.\nThe SAPM said that there was no more time for Shehbaz Sharif as indictment with all proofs of his corruption was ready and now only punishment was to be awarded. “Now Shehbaz Sharif, along with rest of the opposition, was trying to save himself from indictment,” he said.\nDr Shehbaz Gill said that the prime minister would never give an NRO [secret deal] or make any compromise with anyone as he was firm in his stance.\nHe said ‘medals’ should be given to Shehbaz and Zardari for making the poor vendors and peons billionaires, as Shehbaz Sharif appointed Maqsood as a peon for Rs 9,000 monthly salary and then Rs 4 billion were transferred from his account to the opposition leader. Likewise, he added that billions of rupees were kept in the bank accounts of poor employees by Asif Ali Zardari.\nHe said that every action of the opposition would strengthen the government. He decried a television show in which foul language was used against a minister and said that Mohsin Baig, once came with Dr Firdous Ashiq Awan and offered that he could control the media if he was given a certain amount.\nHe said that Uzbekistan had announced using Pakistani seaport, which was a great achievement of the government.He said that the previous government had left Rs 7 billion foreign reserves while the current government raised it to Rs 22 billion.\nHe said that inflation was an international issue, and all countries were facing the same financial situation.Pakistan Tehreek-e-Insaf MNA Jamshaid Iqbal Cheema was also present.",
  "retrievedAt": "2025-08-11T14:19:16.169Z"
}
