{
  "title": "Imperative for int’l community to step in, take practical steps to reverse Indian course in IIOJK: PM",
  "link": "https://www.app.com.pk/national/imperative-for-intl-community-to-step-in-take-practical-steps-to-reverse-indian-course-in-iiojk-pm/",
  "date_published": "2020-08-05T00:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP):Prime Minister Imran Khan Wednesday reiterated his call for the international community to step in immediately and take practical steps to force India to reverse its present course against the Kashmiri people.\n“For the sake of the besieged people of IIOJK, and for the sake of fairness, justice and human dignity, it is imperative that the international community steps in immediately and backs its words of condemnation with practical steps that will force India to reverse its present course against the Kashmiri people,” the prime minister said in his message on Kashmir Siege Day marking 365 days of the unprecedented, inhuman military siege and communication blockade since India’s illegal and unilateral actions of August 5, 2019.\nHe demanded India to realize that martyrdom of each Kashmiri and the burning and destruction of each Kashmiri house, what he said, would only further strengthen the Kashmiris’ resolve for freedom from Indian occupation.\nThe prime minister said throughout the Kashmiris’ struggle, Pakistan would stand shoulder-to-shoulder with its Kashmiri brethren until they realize their inalienable right to self-determination through free and impartial plebiscite under the auspices of the United Nations as per the relevant UNSC Resolutions.\nWhile calling Indian atrocities in IIOJK as a crime against humanity that had destroyed lives, crippled livelihoods, and imperiled the very identity of the people of Indian Illegally Occupied Jammu & Kashmir (IIOJK), he said eight million Kashmiris have been made prisoners in their own homes.\n“Their communication with the outside world has been deliberately revoked to hide the scale of human rights violations being perpetrated against them by the Indian occupation forces. Young men are being extrajudicially martyred in “fake encounters” and so-called “cordon and search” operations, almost on a daily basis, while the real Kashmiri political leadership remains incarcerated,” he remarked.\nThe prime minister said the extremist and expansionist BJP-RSS combine, represented by the current Indian Government, was unabashedly pushing the ‘Hindutva’ agenda.\n“It is seeking to change the demographic structure of the region and turn its Muslim majority into a minority in blatant violation of relevant UN Security Council Resolutions and international laws, particularly the 4th Geneva Convention. As expected, the Kashmiris have rejected these illegal ‘engagements in deception’, and so has Pakistan,” he stated.\nHe said the parliamentarians, journalists, humanitarian workers, international human rights organizations and members of the international community had also raised their voices on the continuing gross human rights violations in IIOJK.\nHe said India stood exposed before the world, yet again, as an oppressor and aggressor. Its so-called secular and democratic credentials stand fully discredited, he added.\n“Let me be absolutely clear: Pakistan will always be with its brothers and sisters in IIOJK. We will never accept, and neither will the Kashmiris, the illegal Indian actions and oppression of the Kashmiri people,” he said.\nHe said India had already failed in keeping the voices of the Kashmiri people from reaching the international community. Now India will fail in forcing its majoritarian, ‘Hindutva’ mindset on a people unwilling to compromise on their just rights and fundamental freedoms, the prime minister added.",
  "retrievedAt": "2025-08-11T19:36:41.399Z"
}
