{
  "title": "lady stresses skilled counseling on breastfeeding to overcome child mortality, stunting",
  "link": "https://www.app.com.pk/national/lady-stresses-skilled-counseling-on-breastfeeding-to-overcome-child-mortality-stunting/",
  "date_published": "2020-08-04T23:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):First Lady Samina Alvi on Wednesday terming breastfeeding a life saver for infants stressed skilled counseling for mothers at community level to help reduce child mortality, stunted growth and malnutrition.\nSpeaking at a webinar titled ‘Support breastfeeding for a healthier planet’, she emphasized on urgently putting in place actions and investment in comprehensive breastfeeding policies and programmes at health facilities.\n“Mothers need assistance and support from their families, health care providers, employers, communities and governments. We, as a society must support women to breastfeed and protect the health and well-being of future generations,” she said.\nShe regretted that many health facilities and health service providers were not providing best optimal breastfeeding counselling and support to mothers, families, and infants.\n“Strengthening the baby-friendly hospital initiatives could go a long way in encouraging skilled breast-feeding counseling,” she said.\nSamina Alvi said breastfeeding gave babies the best possible start in life with breast milk as the first vaccine to assure their good health.\nShe mentioned that Pakistan, as part of 194 member States of World Health Assembly, was committed to increasing the global prevalence of exclusive breastfeeding in the first six months of life to at least 50 percent by 2025.\nAs per latest figures of National Nutrition Survey of Pakistan, she said, Pakistan stood at 45.8 percent on the indicator on ‘early start of breastfeeding within first hour of birth’ and 48.4 percent on ‘exclusive breastfeeding up to six months’.\nDuring the coronavirus pandemic, she stressed the need for “putting more resources and efforts into the endeavors to improve breastfeeding in Pakistan and around the globe in order to save newborns and children from preventable causes of mortality”.\nShe mentioned that Ministry of National Health in Pakistan had introduced ‘Infant and Young Child Feeding (IYCF) guidelines in the COVID-19 context’, supporting skilled service providers.\nShe said messages were also being developed around breastfeeding promotion and protection through a helpline being managed by Ministry of Health and supported by WHO and UNICEF reaching thousands of beneficiaries.\nThe first lady said breastfeeding had cognitive and health benefits for both infants and mothers and was one of the powerful interventions in reducing stunting.\nShe said the children, exclusively breastfed for first six months, were 14 times more likely to survive than non-breastfed children.\n“It has the power to save the lives of women and families and to help national economies grow through lower health care costs and smarter work forces,” she said.\nShe mentioned that breastfeeding helped women in child birth spacing, and also protected against allergies, obesity, diabetes and cancer.\nThe first lady said being part of Shaukat Khanum Breast Cancer Awareness Campaign, she also encouraged women to breastfeed for minimum three months as protection against breast cancer.\nShe advised the mothers to be careful about the use of formula milk and instead give their child breast milk that contained essential nutrients and antibodies for immunity against various diseases.\nShe mentioned that breastfeeding was pivotal for achievement of many of the Sustainable Development Goals (SDGs) as it improved nutrition, prevented child mortality, decreased the risk of non-communicable diseases, supported cognitive development and education.\nShe said as 22 percent of newborn deaths with breastfeeding them within first hour of birth, it was important that all mothers be provided technical, financial, emotional and public support to ensure breastfeeding.\nShe also called upon media to play its role in creating awareness about the benefits of breastfeeding.",
  "retrievedAt": "2025-08-11T19:36:44.456Z"
}
