{
  "title": "Cultivation of outdated wheat varieties causing 50 percent yield gap: Minister told",
  "link": "https://www.app.com.pk/national/cultivation-of-outdated-wheat-varieties-causing-50-percent-yield-gap-minister-told/",
  "date_published": "2020-08-05T06:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):Minister for National Food Security and Research Syed Fakhar Imam on Wednesday was informed that Pakistani farmers were growing 8-10 years old wheat varieties, causing 50 percent less production and reduced national output of major crop.\nThe minister chaired a meeting on increasing wheat production, where Country Representative of International Maize and Wheat Improvement Center (CIMMYT) Dr M. Imtiaz briefed him about the wheat crop scenario in the country.\nDr Imtiaz told that Wheat Productivity Enhancement Programme (WPEP) and Agricultural Innovation Programme for Pakistan (AIP) interventions had a positive impact on productivity, said a press release.\nThe intervention had increased wheat yield from 12 percent to 40 percent aiding to a food secure future, he added.\nThe meeting also discussed the potential strategy for increasing wheat productivity for food safety and security, which involved three factors, including fast increase of seed of new varieties, closing the yield gap and grain minimum price.\nIt was informed that new wheat varieties contribute 50 percent to productivity single handedly.\nIt was informed that CIMMYT’s had trained 10,000 farmers on quality wheat seed production and marketing for a sustainable local seed system strengthening.\nThe CIMMYT initiated Seed banks with NRSP, 7 were active in Bhakkar, P.D Khan, Gujjar Khan, Chakwal, Attock, Mirpur Khas and Swabi.\nIt supported them with newly released varieties, seed graders and trainings on seed production. From these seed banks, local farmers were getting quality seeds with 11 percent lower prices than the market and thus contributing to increase in wheat productivity.\nThe meeting was apprised that less than 60 percent wheat was grown in cotton-wheat and rice wheat systems both of which delay sowing and expose wheat to the terminal heat stress and to rust attack resulting in low yield.\nThere was a need to discourage or ban wheat sowing after mid-December and replace with other short duration corps.\nDr Imtiaz also briefed the minister about impact of Wheat Productivity Enhancement Program on Pakistan wheat improvement and research.\nHe said WPEP was involved in technical backstopping activities, up-gradation of research facilities including mechanization and IT equipment and human resource and its capacity building, including and facilitate coordination.\nSpeaking on the occasion, Fakhar Imam stressed the need to promote high yield varieties of wheat to replace old and disease susceptible varieties.\nSyed Fakhar Imam was of the view that there must be a breakthrough in wheat production in the country and called upon the scientists scientists for working hard to introduce latest wheat varieties to increase output.\nThe minister said there was a need to strengthen the seed system value chain as well to ensure availability of certified seed for growers.\nWe need to choose the best suitable wheat variety and follow timely cultivation of crop to attain proper per-acre output, he remarked.\nHe reiterated to establish dedicated trials to capture yield potential, besides managing wheat crop with optimum inputs including fertilizer, irrigation water, herbicides and fungicides for maximum yield .\nThere was a dire need to promote use of farm machinery , adopting line sowing, use zero tillage and surface seeding technologies to reduce cultivation cost and minimize risk due to shattering, threshing – no comprise on yield , he added.\nSyed Fakhar Imam said that proper storage practices should be followed to avoid post-harvest losses.",
  "retrievedAt": "2025-08-11T19:36:31.157Z"
}
