{
  "title": "Speakers strongly condemn India’s blatant violations in IIOJK at webinar in Washington",
  "link": "https://www.app.com.pk/national/speakers-strongly-condemn-indias-blatant-violations-in-iiojk-at-webinar-in-washington/",
  "date_published": "2020-08-04T23:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):Speakers at a webinar in Washington DC strongly condemned the blatant human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK), urging upon the international community to take notice of the worsening situation in the Valley.\nAmbassador Dr Asad Majeed Khan, Secretary General World Kashmir Awareness Forum Dr Ghulam Nabi Fai, Member Parliament (Labour Party) of United Kingdom M. Afzal Khan, Political Analyst and Human Rights Activist Helene Sejlert and Colonel (retd) Wesley Martin from U.S. Army expressed their views at the event titled ‘A burden on humanity’s conscience’ marking one year of India’s illegal revocation of IIOJK’s special status.\nAmbassador Dr Asad M Khan gave an overview of India’s illegal occupation of the Valley that brought immense sufferings to the people of Kashmir in shape of violence and coercion, says a message received here from Washington DC.\nHe mentioned that inauguration of Ram Mandir on 5th August 2020 and celebrations of dislocation of Babari Mosque were links of the same chain.\nThe Ambassador said Indian atrocities coupled with human rights violations, remained a big challenge to the conscience of the international community.\nHe reaffirmed Pakistan’s position to seek peaceful resolution of Kashmir dispute and reiterated the strong resolve of the government and people of Pakistan to continue extending moral, political and diplomatic support to the Kashmiri brethren.\nHuman Rights Activist Helene Sejlert termed August 5 a “day of mourning and a reminder of the barbaric violence committed by Indian forces in the state of Kashmir”.\n“We have failed Kashmir in every single way over these72 years and therefore we must stand with Kashmiris until their independence,” she said.\nDr Fai spoke at length regarding the practice of issuance of domicile certificates to non-Kashmiris who were in fact people from Indian army and other Indians staying in Kashmir for last seven years.\nHe warned that if left unattended, the “Kashmiri cauldron could explode and destroy the peace of the region”.\nColonel (retd) Martin said Indian atrocities coupled with communication blackout and an unending siege with deployment of additional troops had turned IIOJ&K into an open-air prison.\n“The detention centres for Muslims in India are exactly like concentration camps of Hitler,” he said, urging the world and the people of India to stand up against these acts of violence.\nMP Afzal Khan said minorities in India were falling victim to Hindutva ideology and stressed a peaceful solution to Kashmir is linked with the credibility of United Nation Security Council.\nThe live broadcast of webinar was attended by a large number of people through Facebook and Twitter.",
  "retrievedAt": "2025-08-11T19:36:45.527Z"
}
