{
  "title": "Harassed, intimidated, detained: Journalists in IIOJK afraid of reporting truth",
  "link": "https://www.app.com.pk/national/harassed-intimidated-detained-journalists-in-iiojk-afraid-of-reporting-truth/",
  "date_published": "2020-08-04T22:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):Journalists in Indian Illegally Occupied Jammu and Kashmir (IIOJK) are currently facing the worst kind of harassment and intimidation and coerced to speak truth about the ongoing situation.\nIn recent months, many journalists have been summoned to police stations and had cases filed against them under draconian laws, CNN reported on Wednesday.\nIn some cases, reporters were asked to reveal the source of their stories and explain the pieces of reportage, according to Ishfaq Tantray, the General Secretary of the Kashmir Press Club.\n“The summons to journalists and FIRs (First Information Reports) are clearly aimed at muzzling the press and, as a club, we denounce this practice,” Tantray said.\n“The authorities by these summons and FIRs want to create a fear psychosis among the journalists and force them to toe a particular line.” First Information Reports are police complaints that trigger an investigation, which could lead to a charge under Unlawful Activities (Prevention) Act (UAPA).\nThe UAPA allows individuals named as suspected terrorists to be investigated by the National Investigation Agency, a state body established by the Indian government. The law was introduced to combat terrorism, but rights groups including Amnesty International say it’s being used to curb free speech.\nThe CNN report mentioned that in April this year, charges were filed under UAPA against a photojournalist Masrat Zahra and journalist and author Gowhar Geelani for unspecified social media posts allegedly promoting anti-nationalist content.\nIn June, the administration in Jammu and Kashmir tightened press freedoms even further by approving a new media policy. The “Media Policy-2020” authorizes the Directorate of Information and Publication Relations (DIPR) to “examine” the content of print, electronic and other forms of media for “fake news, plagiarism and unethical or anti-national activities,” and take action against journalists and media organizations.\nIt also states that the government will not release advertisements to news outlets that “incite or tend to incite violence, question sovereignty and integrity of lndia or violate the accepted norms of public decency and behaviour.”\n“It is definitely going to choke the space for the journalists in the region and curb whatever freedom of the press is left,” said Tantray, from the Kashmir Press Club.\nCommunications blackouts are common in Jammu and Kashmir — there have been more than 200 since 2012.\nDespite the pressures of operating in that kind of environment, more than 100 newspaper titles are published in the Kashmir valley, according to Jammu and Kashmir’s Department of Information and Public Relations. They serve a population of more than 7 million people.\nRaashid Maqbool, a media scholar who is pursuing a PhD on media history in Kashmir, said while advertising has long been used as a means of repression and coercion, the situation has worsened for local media since August 2019.\nThis year, India dropped two spots to 142 in the World Press Freedom Index. Reporters Without Borders, which compiles the index, said India’s score had been “heavily affected by the situation in Kashmir.” The communications blackout made it\n“virtually impossible for journalists to cover what was happening in what has become a vast open prison,” it said.\nThe report said as Delhi tightened its control on the region last summer, journalists faced a mix of harassment, surveillance, intimidation and information policing. Roadblocks made it impossible to get to the office, and the lack of telephone and internet connections meant little independent information could be gathered and published anyway.\nUnder constant government surveillance, reporters there were asked to download approved material, including government press releases, for publication in their newspapers, some of the journalists said.\nShams Irfan, a senior reporter for weekly news magazine Kashmir Life until March, said too few computers and phones lines were made available to reporters at Media Facilitation Centre in Srinagar — and even when they had a chance to file, connection speeds were frustratingly slow.\n“It was like living in a dark age. In order to make a one-minute call from the Media Facilitation Center or to access to a computer connected with the internet, we had to sometimes wait for over an hour,” he said.\nIrfan, who now works as a freelance journalist, said it was an open secret that journalists were kept under surveillance in Kashmir. In some instances, police would question some journalists about their stories. The pressure led to self-censorship, Irfan said.\nIndependent journalists in Kashmir believe the local press succumbed to pressure after the August 5 shutdown.\n“To say that the coverage of the Kashmir story in the local press has been shameful would be an understatement,” said Kashmiri journalist Gowhar Geelani.\nThe former editor of the Kashmir Reader newspaper, Hilal Mir, said local media could have done better. “Their hands were tied, no doubt, but they also did nothing to resist it,” he said.\n“We can’t say what was at risk because nobody risked anything.”",
  "retrievedAt": "2025-08-11T19:36:53.382Z"
}
