{
  "title": "Kashmiris facing brutalities of Modi govt with courage: Chohan",
  "link": "https://www.app.com.pk/national/kashmiris-facing-brutalities-of-modi-govt-with-courage-chohan/",
  "date_published": "2020-08-05T01:36:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 05 (APP):Punjab Information Minister Fayazul Hasan Chohan said on Wednesday the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK)\nwere facing brutalities by Modi government with courage and determination.\nTalking to the media at Lahore Press Club, he said that Modi’s fascist\ngovernment could not succeed in demoralizing the valiant Kashmiris in\ntheir just cause of freedom.\nThe information minister on behalf of Prime Minister Imran Khan, Punjab\nChief Minister Sardar Usman Buzdar and people of Pakistan paid tribute\nto innocent Kashmiris of IIOJK for rendering unprecedented sacrifices\nfor achieving the right of self determination.\nHe strongly condemned the Bharatiya Janata Party (BJP), Rashtriya Swayamsevak\nSangh (RSS), Indian media and their establishment for exploiting the innocent\nKashmiris.\nFayazul Hasan Chohan said that Prime Minister Imran Khan was the only\nleader in the history of the country who after taking oath as PM had been\nhighlighting Kashmir issue effectively and kept it alive at all international levels.\nHe said the credit went to PM Imran Khan that in his leadership the IIOJK\nwas added to the official map of Pakistan, adding that Imran Khan was a\nhero of Pakistan and he wanted to see Pakistan as developed and prosperous\ncountry.\nHe said that incident of Babri Mosque had exposed the ugly face of so-called\nsecular India across the globe.\nHe said, “India is not only a threat to regional peace but also for the entire world.”\nHe said that in India temple was being constructed after demolishing historic\nBabari Mosque, whereas, in Pakistan temples were being renovated, work had\nbeen started on Kartarpur corridor and minorities were being given their due rights.\nHe said that India was hurting the sentiments of Muslims through its actions\nwhile in Pakistan all minorities were enjoying equal rights under the constitution\nof Pakistan.\nThe Minister said that international community should take notice of India’s human\nrights violations. He said that those who were conspiring against Pakistan would\nfail in their nefarious designs.",
  "retrievedAt": "2025-08-11T19:36:33.232Z"
}
