{
  "title": "Kashmiris observe Youm-e-Istehsal with renewed pledge to continue freedom struggle till last victor",
  "link": "https://www.app.com.pk/national/kashmiris-observe-youm-e-istehsal-with-renewed-pledge-to-continue-freedom-struggle-till-last-victor/",
  "date_published": "2020-08-05T01:05:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 05 (APP):Kashmiris living across the world Wednesday observed Youm-e-Istehsal to condemn the illegal action of fascist Indian government in Illegally Occupied Jammu and Kashmir state this day last year.\nIn response to the call of Pakistan and the entire Jammu Kashmir State, the first anniversary of the bleak August 05, 2019 day was observed as ‘Kashmir Siege Day’ by the people of Pakistan and Jammu & Kashmir population dwelling both sides of the Line of Control and rest of the world with mass anti-India protest rallies and demonstrations to express severe indignation against Delhi’s sinister action of revoking special status of the internationally-acknowledged dispute state of Indian Illegally occupied Jammu Kashmir (IIOJK).\nMass anti-India protest rallies and processions were held across the state to strongly denounce the completion of one year of military siege in IIOJK.\nThe speakers while addressing the rallies strongly condemned the Indian forces’ atrocities and drew the world attention towards continued repressions and military siege in Illegally occupied Kashmir.\nIn this connection, a major protest rally was held in Muzaffarabad on Wednesday which started from in front of the AJK Supreme Court building to the UN military observer mission in the State metropolis.\nAzad Jammu and Kashmir Prime Minister Raja Muhammad Farooq Haider Khan led the rally.\nThe participants of the rally presented a protest memorandum to the UN military observer mission and drew the attention of the UN Secretary General towards the change of the status of occupied Kashmir which was a clear violation of international law and bilateral agreements between India and Pakistan.\nThe people of IIOJK have been besieged due to continued military siege for the last one year and India has imposed a complete ban on the media and denying the access of world agencies. It call upon Indian government to release all political leaders and activists who have been languishing in different detention centers and allow the visit of all United Nations human rights mission and special representatives of OIC Secretary General in Indian Illegally occupied Jammu and Kashmir. It called upon the world body to implement its agreed resolutions on Jammu and Kashmir and grant the Kashmiris their basic right to self-determination.\nLater, talking to media the AJK prime minister said Kashmiris would not accept any decision on Kashmir against their wishes and aspirations.\nHe urged the Pakistan government to project the Kashmir issue aggressively to expose the Indian nefarious design over the globe.\nThe rally was also attended by the leaders of all political parties, representatives of APHC, civil society and large number of people.\nHe highly appreciated the valor and courage of the people of Illegally Occupied Kashmir for facing continued military siege and communication lockdown for the last one year.\nOn the appeal of the government of Pakistan and AJ&K Governments protest rallies and processions in all the districts and tehsil headquarters of the state were the hallmark of the day to condemn the illegal and immoral actions of the Indian government.\nIn Azad Jammu Kashmir, the Youm-e-Istehsal was marked with the mass anti-India protest rallies and processions at all small and major cities and towns across the liberated territory including the capital city of Muzaffarabad and all nine district headquarters including Mirpur, Rawalakot, Bhimbher, Kotli, Neelam valley, Bagh, Jhelum valley, Haveili and Palandri to express indignation against the above unilateral Indian action stabbing the special status of the disputed IIOJK this day last year at the gun point – denying all international norms and commitments.\nThe Prime Minister of Pakistan Imran Khan visited the AJK metropolis Muzaffarabad and addressed Azad Jammu and Kashmir Legislative Assembly.\nAJK President Sardar Masood Khan, AJK Prime Minister Raja Farooq Haider Khan, Federal Ministers and AJK Cabinet Ministers earlier accorded a rousing reception to the Prime Minister Imran Khan on his arrival in the AJK State’s capital town.\nThe AJK Cabinet ministers, representatives of APHC, leaders of political parties and representatives of civil society were also present on this occasion who later handed over a memorandum to the UN observer mission in Muzaffarabad this afternoon.",
  "retrievedAt": "2025-08-11T19:36:36.740Z"
}
