{
  "title": "‘Our political map on Kashmir reflects Kashmiris’ aspirations, international laws’: Dr Moeed",
  "link": "https://www.app.com.pk/national/our-political-map-on-kashmir-reflects-kashmiris-aspirations-international-laws-dr-moeed/",
  "date_published": "2020-08-04T23:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 5 (APP):Special Assistant to the Prime Minister on National Security Dr Moeed Yusaf Wednesday said that our political map on Jammu and Kashmir was came into existence in accordance with the aspirations of Kashmiri people, UN resolutions on Kashmir and all international laws.\nHe said the step was taken after the India’s illegal action of 5 August 2019 to change the demographic status of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nIn an exclusive talk with a private news channel, the special assistant said that earlier, all the available maps were either based on administrative divisions or infrastructural demarcations. “The political map released by the government today is long needed to internationally highlight and acknowledge our principled stand on the disputed territory of Jammu and Kashmir,” he underlined.\nTo a question, he denied any symbolism of the political map and said it had much more in sight that would put lasting consequences on geo-political situation of the region in future.\nHe said that legislation would also be made, if it was deemed necessary, to ensure uniform implementation of our national political map at all levels, including in educational institutions.\nHe said that Pakistan had to present negations to the India’s false claims, and added that the world would see visible support of Kashmiri people in its favor.\nTo yet another question, the special assistant told that the our political map was made after due consultations with leaders of All Parties Hurriyat Conference (APHC) and leadership of national level political parties besides best coordinated efforts by all the government departments.",
  "retrievedAt": "2025-08-11T19:36:50.045Z"
}
