{
  "title": "Punjab Governor, CM lead rally to observe Youm-e-Istehsal",
  "link": "https://www.app.com.pk/national/punjab-governor-cm-lead-rally-to-observe-youm-e-istehsal/",
  "date_published": "2020-08-05T01:49:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 5 (APP): Punjab Governor Chaudhry Muhammad Sarwar and Chief Minister Sardar Usman Buzdar on Wednesday led Youm-e-Istehsal rally from Governor\nHouse to Faisal Chowk to express solidarity with oppressed people of Indian\nIllegally Occupied Jammu and Kashmir (IIOJK).\nThe National Anthem and anthem of Kashmir were played while sirens were\nalso sounded to record the agitation against Indian cruelties and atrocities\nin Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nPTI leaders, provincial ministers including Fayyazul Hassan Chohan and\nMian Aslam Iqbal besides members of Punjab Assembly participated in the rally.\nAddressing on the occasion, Governor Punjab Chaudhry Sarwar said that\nPrime Minister Imran Khan had effectively presented the case of Indian\nIllegally Occupied Jammu and Kashmir before the world, adding that Pakistan\nwould continue exposing Indian brutalities and human rights’ violations being\ncommitted in IIOJK.\nHe said that minorities in Pakistan were enjoyed religious freedom and Pakistan\nopened Kartarpur Corridor for Sikh yatrees but on the other hand, fascist\nNarendra Modi Indian government had been committing cruelties and atrocities\nagainst Muslims in India.\nThe Governor said that Indian military siege in the valley was a clear violation\nof the United Nations (UN) charter and human rights laws.\nHe said the people of Pakistan would stand with their Kashmiri brethren until\nthey get freedom from the Indian government.\nیوم استحصال کشمیر: وزیراعلی پنجاب @UsmanAKBuzdar کا استحصال کشمیر ریلی کے شرکاء سے خطاب۔ #IIOJKUnderSiege #KashmirSeigeDay pic.twitter.com/464p4wjcPl\n— CM Punjab (Updates) (@CMPunjabPK) August 5, 2020\nOn the occasion, Chief Minister Sardar Usman Buzdar announced to name\nat least a single road in every division after Srinagar and said, “We pay tributes\nto the struggle and sacrifices rendered by the people of Indian Illegally Occupied\nJammu and Kashmir.” The nation would always stand with people of Indian\nIllegally Occupied Jammu and Kashmir in their struggle for freedom.",
  "retrievedAt": "2025-08-11T19:36:34.843Z"
}
