{
  "title": "Pakistan remains steadfast in peaceful Kashmir resolution: President",
  "link": "https://www.app.com.pk/national/pakistan-remains-steadfast-in-peaceful-kashmir-resolution-president-2/",
  "date_published": "2020-08-05T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 05 (APP):President Dr Arif Alvi on Wednesday said Pakistan remained steadfast in the peaceful resolution of Kashmir dispute and asked the world peace bodies to play their role in the wake of worsening human rights situation in the occupied Valley.\nHe was addressing a special 3-D projector event here at the lawns of Parliament House, whose building was illuminated in the colours of Kashmir to express solidarity with the Kashmiris.\nPresident Alvi said the responsibility of shaking the world conscience not only lay upon the government, but also on the entire nation to act in solidarity with the Kashmiris.\nHe lauded Prime Minister Imran Khan for effectively fighting the case of Kashmiris at the international platforms and for updating the world about the ongoing Indian atrocities on the innocent Kashmiris.\nHe mentioned that the country’s leadership never missed any opportunity of raising the Kashmir while holding interactions with foreign dignitaries.\nDr Alvi said Pakistan warned the world about any possible flag operation by India, however on the other hand, also extended a gesture of peace by releasing the captured fighter pilot of Indian Air Force.\nHe said India was not allowing the foreign media and journalists to freely visit the Indian Illegally Occupiued Jammu and Kashmir (IIOJK) and urged the United Nations to take notice of the situation.\nHowever, he said, Pakistan opened Azad Jammu and Kashmir to the world, including international observers and media representatives to freely monitor the situation.\nPresident Alvi said India could not silence the voice of Kashmiris with its oppressive policies such as changing IIOJK’s demography and genocide.\nHe asked the international organizations and Islamic countries to play their role and expressed the hope that “with Allah Almighty’s will, Kashmir will be free from the tyranny of India”.\nNational Assembly Speaker Asad Qaiser said the entire nation stood united in supporting the Kashmiris along with all parties rising above any political differences.\nTomorrow, he said, the parliament in a joint sitting would pass a resolution showing solidarity with the Kashmiris.\nInformation Minister Senator Shibli Faraz said Pakistan would stand by the Kashmiris in their struggle for their right to self-determination and would continue to raise the issue at all forums, including the Parliament.\nHe urged the human rights watchdogs to raise their voice for the oppressed Kashmiris at international level.\nKashmir Committee Chairman Shehryar Afridi said the government effectively fought the case of Kashmir and drew attention of the world towards the ongoing brutality in the occupied Valley.\nThe event was attended by parliamentarians and people from different walks of life.",
  "retrievedAt": "2025-08-11T19:36:55.998Z"
}
