{
  "title": "Minorities enjoying equal rights in AJK:President Masood",
  "link": "https://www.app.com.pk/national/minorities-enjoying-equal-rights-in-ajkpresident-masood/",
  "date_published": "2020-08-11T04:38:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 11 (APP): Azad Jammu & Kashmir (AJK) President Sardar Masood Khan has said that all religious minorities living across AJK were enjoying equal rights.\nUnlike India, minorities in Pakistan and AJK were treated with love, respect and dignity, he said.\nHe stated this while addressing a conference organized by BTM Global on World Minority Day here at the Pakistan Institute for Parliamentary Services.\nThe event was addressed by Chairman Parliamentary Committee on Kashmir Shehryar Khan Afridi, former Prime Minister of Pakistan Raja Pervez Ashraf, Member National Assembly Ramesh Kumar, Member Provincial Assembly Ranjheet Singh, President of the National Council of Churches in Pakistan Dr. Azad Marshall and Chairperson BTM Global Sumaira Farrukh, said AJK President office told media here on Tuesday.\nPresident Masood Khan said that all humans were created equal and there was no discrimination between people of various race, colour and religion. He said that the teachings of Islam had clearly said that all human beings were equal.\nThe President said that Pakistan and AJK had integrated the minorities in the mainstream with considerable success. He added that we will continue to engage religious leaders of minorities to help address their issues.\nTurning to India’s maltreatment of minorities, the President said that when we say India, we do not refer to the 1.3 billion Indians but refer to the current government in power run by BJP and RSS, who propagate Hindu extremism, fanaticism and fascism. This regime excludes all other non-Hindu minorities from the whole of the Subcontinent.\nThey were in the process of disenfranchising the minorities, especially the Muslims living in India by introducing exclusionary measures like the Citizen Amendment Act, the National Population Register and for the Muslims of Indian Illegally Occupied Jammu and Kashmir(IIOJK), they had implemented the New Domicile Rules. Not only this, but he also added, the BJP-RSS regime had targeted the Dalits.\nSardar Masood said the treatment being meted out to Kashmiris in the IIOJK, said that Kashmiris had been killed, maimed, tortured, forcibly disappeared, incarcerated and tortured. Last century, we saw such gruesome scenes in Nazi Germany and Fascist Italy but in these days we see this in IIOJK as Kashmiris were being rounded up for extermination.\nThe Indian regime had failed to win the hearts and minds of the Kashmiris even after taking brutal measures for the past 72 years. Now, they were changing this Muslim majority into a minority”, said Masood Khan The President giving a message to the minorities of IIOJK said, “The Dogras, the Pundits, the Sikhs, Hindus of all castes and the Buddhists were an integral part of the Kashmiri fabric.\nThey were equal citizens of Jammu and Kashmir and they will never be ‘othered’ like they had been made so in mainland India”.\nHe thanked the organizers for opening up this space for Kashmir and praised the various speakers who raised very important points during the conference.",
  "retrievedAt": "2025-08-11T19:38:36.930Z"
}
