{
  "title": "Delegation led by Ghulam Sarwar calls on Punjab CM",
  "link": "https://www.app.com.pk/national/delegation-led-by-ghulam-sarwar-calls-on-punjab-cm/",
  "date_published": "2020-08-11T04:38:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 11 (APP): A delegation of parliamentarians from Rawalpindi district led by Federal Minister Ghulam Sarwar Khan called on Punjab Chief Minister Sardar Usman Buzdar at his office and discussed matters of mutual interest.\nTalking on the occasion, the CM said the journey of public service would be moved forward with pace under the leadership of Prime Minister Imran Khan while the conspiracies of opponents of development would not succeed.\nThe government would respond to the negative politics of propagandists through public service, he added and advised the critics to look into their own inner self.\nOvercoming coronavirus was a big achievement of the government as business activities have been resumed in the Punjab and anti-coronavirus strategy of PM Imran Khan has been acknowledged internationally.\nHe regretted that the opposition tried to politicize coronavirus and added that those who levelled baseless allegations would be left with no future.\nThe CM assured that problems faced by Rawalpindi city would be resolved and pointed out the reconstruction of Lai nullah would help to overcome flood-related damages. A total of Rs 85 billion would be spent on Lai nullah and expressway project, he added.\nThis project would be completed through public-private partnership whereas four interchanges would be constructed along with setting up a plant to separate rainwater from sewage.\nThe dream of the expressway would be materialized by the PTI government, he added.\nUsman Buzdar mentioned that tree plantation would help to overcome environmental degradation around Lai nullah expressway and road movement of the locals would also be improved.\nMeanwhile, various online services have also been provided to the citizens through police application besides setting up protection centres for the transgender community in Rawalpindi.\nOn the other side, 10,000 recruitment were being made to fulfill the shortage of staff in the police, the CM added.\nAmjad Mahmood Chaudhary, Muhammad Latasab Satti, Raja Saghir Ahmed, Javed Kauser, Ch. Sajid Mehmood, Ch. Muhammad Adnan, Wasiq Qayyum Abbasi, Ejaz Khan, Ammar Siddiq Kiyani and Umer Tanvir were included in the delegation.",
  "retrievedAt": "2025-08-11T19:38:37.686Z"
}
