{
  "title": "Pakistan believes in freedom to minorities: Governor Punjab",
  "link": "https://www.app.com.pk/national/pakistan-believes-in-freedom-to-minorities-governor-punjab/",
  "date_published": "2020-08-11T04:37:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 11 (APP): Governor Punjab Chaudhry Muhammad Sarwar has said that religious minorities enjoyed complete freedom in the sate of Pakistan and the government was committed to their welfare.\nAddressing a seminar in connection with the National Minority Day at the Governor’s House here on Wednesday, he said Prime Minister Imran Khan had fulfilled promise of completing Kartarpur Corridor for the Sikh minority despite ongoing tension with the Indian government.\nThe seminar was held under the auspices of Human Rights and Minority Affairs Department. Provincial Minister for Minority Affairs Ejaz Alam Augustine, MPA Mahindar Pal, Dr Manohar Chand, Amarnath Randhawa from Hindu Community, and Chairman Unique Group Prof. Abdul Manan Khurram were the prominent guests.\n“India has become a slaughterhouse of minorities and the world is a witness to the oppression and atrocities being meted out to the minorities in India today”, Sarwar said, adding that Fascist Modi regime is targeting innocent Muslims in India as well as Kashmir and violence against Muslims and burning their homes is no less than terrorism.\nThe governor Punjab said the PTI government was protecting rights of all religious minorities and providing them with religious freedom, adding that the minorities enjoyed equal rights and all facilities in Pakistan.\nSpeaking on the occasion of National Minority Day, he announced opening of the sacred Christian site – Mariamabad – for international tourism besides introducing a quota for religious minorities in public-sector jobs. Resolving to give equal importance to the Christian religious site like Kartarpur Corridor, he said the government will seek funding from the international financial institutions to develop Mariamabad site.\nGovernor Punjab said that effective steps have been taken in order to promote religious harmony in Pakistan and the government will fulfill its promise of religious freedom as envisaged by Father of the Nation, Quaid e Azam Muhammad Ali Jinnah.\nAcknowledging role of minorities in the creation and nation-building, he said affluent members of minorities have made a huge contribution in relief activities during the novel coronavirus (Covid-19) pandemic.\n“Our brothers from minority groups always participated in the celebration of national festivals with us which is a testimony of the cordial relations that we share with minorities”, he responded.\nProvincial Minister Human Rights and Minority Affairs Ijaz Alam Augustine said we are happy that under the leadership of Prime Minister Imran Khan, the incumbent government has always stood by religious minorities.\nHe said it is unfortunate that minorities are subjected to extreme oppression and violence in India, adding that all religious minorities will play their role in nation-building and development of the country.",
  "retrievedAt": "2025-08-11T19:38:38.693Z"
}
