{
  "title": "Lifting lockdown doesn’t mean COVID has ended: Asad Umar",
  "link": "https://www.app.com.pk/national/lifting-lockdown-doesnt-mean-covid-has-ended-asad-umar/",
  "date_published": "2020-08-11T03:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Minister for Planning, Development and Special Initiatives Asad Umar on Tuesday said lifting lockdown or reopening of all sectors in the country did not mean that the COVID-19 pandemic has ended.\nAddressing a media briefing here, the minister said the government had decided\nto reopen various sectors only for the sake of people but unfortunately were\ntaking impression that the corona had ended now.\nHe said chief secretaries of all provinces had been directed to keep strict vigil on the newly opened sectors to avoid violation of Standard Operating Procedures in these sectors.\nAsad Umar who is also chairman of National Command and Operation Center (NCOC), said lifting of lockdown could happened only due to people’s behavior who had so far fully cooperated with the government and followed guidelines issued by the government to contain spread of COVID.\n“The government was unable to do anything if the people had not cooperated with the government”.\nHe also commended role of media by effectively disseminating the government’s messages to the people.\nThe minister recalled that by mid June, as study by London based Imperial College predicted alarming situation for Pakistan and said in Pakistan as many as 78000 people would be dying of Corona daily by August 10.\nHowever he said due to successful strategy of the government only 15 people were killed in the previous day.\nHe said the government’s strategy of contact tracing system remained effective.\nUnder this strategy, he said 1.1 million contacts were traced out of which over one million tests were conducted and positivity ratio of such tests was 10.5 percent.\nFurther, he informed that out of total 185,000 positive cases in the country, over 100,000 cases confirmed from tests conducted through contact tracing system.\nHe said this strategy remained extremely effective in controlling the disease as with the help of one corona patient they managed to reach 10.8 contacts. Now, he said, NCOC teams were also providing training to all provinces.\n“South Africa is considered to be role model in contact tracing system and now Pakistan has also reached that level. This is a world class operation in which NCOC is involved and all provinces are also worked on it successfully,” he added.\nThe minister added that so far as many as 2350 smart lockdowns were imposed and at one time about 700-800 lockdowns were imposed across the country.\nWhile presently there are 85 lockdowns in 20 districts.\nAsad Umar informed that the government was now switching towards micro smart lockdown in which small localities such as one building with multiple units or small Mohallas would be targeted instead of big areas.\nThe minister said India in East and Iran in West were still suffering from the pandemic. During last 10 days, he said, positivity ratio of test conducted in Pakistan was three percent while in Iran 9.4 and in India and Bangladesh it was 9.8 percent and 24 percent respectively.\nSimilarly, he said, as compared to Pakistan the death ratio in Iran was 20 times whereas in India it was five times and in Bangladesh it was two times higher.\n“If all this is happening in our immediate neighborhood, then this can happen in Pakistan as well so I urge the people to please follow SOPs to avoid any new wave of the pandemic in Pakistan”, he added.\nHe said at one stage, Pakistan’s exports and revenue collection was reduced by 40 percent each due to lockdown.\nThis 40 per cent reduction means the income of millions of people in Pakistan was halted who have no bank balances and they have not savings fir even two days expenditures, he said adding with the help of government revenues, development projects run.",
  "retrievedAt": "2025-08-11T19:38:44.146Z"
}
