{
  "title": "Forex reserves up from $8.5 b to $12.5 bn, current account deficit cut from $20b to $ 3b in 2 years, cabinet told",
  "link": "https://www.app.com.pk/national/forex-reserves-up-from-8-5-b-to-12-5-bn-current-account-deficit-cut-from-20b-to-3b-in-2-years-cabinet-told/",
  "date_published": "2020-08-11T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Adviser to the Prime Minister on Finance Abdul Hafeez Sheikh while briefing the Federal Cabinet on the status of economy and economic indicators during the first two years of Pakistan Tehreek-e-Insaf (PTI) government, said the current account deficit had been brought down from $20 billion to only $ 3 billion.\nBriefing the media persons about the decisions of cabinet meeting chaired by Prime Minister Imran Khan, Minister for Information and Broadcasting Senator Shibli Faraz said the cabinet was informed by the finance advisor that the policy of encouraging exports and discouraging unnecessary imports had paid the dividends.\nDue to the government’s prudent economic policies, the foreign exchange reserves of State Bank of Pakistan had increased from $ 8.5 billion to $12.5 billion, he added.\nUnder the Ehsaas programme, the minister said, financial assistance was provided to some 15 million families in a transparent manner, while subsidy was given to the Utility Stores Corporation to ensure supply of daily use items at affordable prices.\nShibli Faraz said the present government had also given a historic package for the construction sector as the resumption of construction activities would create jobs and provide housing facilities to the poor. Under the policy, the poor people would be given loans on minimum mark-up ratio and the government would also give subsidy to them in the purchase of housing units.\nThe government had also given relaxation on taxes to the builders to encourage investment in the housing units, he added.\nThe minister said the economic wheel had begun to turn again and Rs 300 billion more tax revenue was collected than the target.\nHe said with the resumption of economic activities, exports had increased and stock exchange shown growth which was an indication of economic stability. Exports reached $ 2 billion mark in the month of July during the current year against $ 1.2 billion in the past, he added.\nHe said international institutions had given better ratings to Pakistan’s economy, which was a sign of its economic stability. The government had to take difficult decisions and now hard times had almost passed and the nation would soon benefit from good times.\nThe minister said the way the government dealt with the corona pandemic was being appreciated all over the world. Those who had created a hype for a strict lockdown belonged to the elite class, who could not feel the pain for the sufferings of the poor and marginalized people that they had to feed their children from the earnings on a daily basis.\nWith the blessings of Allah Almighty, the pandemic had caused less damage in Pakistan than the developed countries, he added.\nShibli Faraz said the cabinet was given a briefing on the encroachments around the Margalla Road (lslamabad). It was told that during the past one and a half years, the Capital Development Authority had retrieved land worth Rs 450 billion.\nSimilarly, the encroachments on Srinagar Highway had also been removed and trees were planted on the retrieved land, while the Quaid-e-Azam University’s land under illegal occupation of mafia was also recovered.\nThe CDA chairman was directed to provide facilities at the slums and business opportunities to the poor people running kiosks on the civic body’s land, he added.\nThe minister said the cabinet was informed that the process of scrutiny of the licenses of pilots would be completed next month.\nHe said the cabinet decided to celebrate August 14 in a befitting manner and renewal of the pledge would be done not to run the country in the way it was run during the past four decades.\nIt was pledged that the new generation would be given a better Pakistan with rule of law and the constitution, and better employment opportunities.\nHe said the prime minister was informed that payments worth Rs 891 million had been made to the media houses whereas the remaining dues would be cleared at the earliest.\nReplying to the media persons’ questions, Shibli Faraz said the Sharif brothers would be would not be let off scot-free and held accountable for plundering the national exchequer and ruining the state institutions.\nThe practice to make assets from the looted national wealth would have to be eliminated, he added.\nHe said the past governments had rendered Pakistan economically bankrupt due to which the country was facing problems like price hike, flooding in Lahore or Karachi etc.\nNowadays, he said, the opposition leaders were again getting together to save themselves from the ongoing accountability process.\nThey had even tried to get an NRO (National Reconciliation Ordinance) on the pretext of proposing an amendment in the National Accountability Bureau (NAB) law regarding the definition of corruption to their own advantage, he added.\nThe minister criticized Pakistan Muslim League-Nawaz leader Maryam Nawaz for staging a drama to divert the public attention from the real issue and holding a news conference instead of replying to the questions asked by NAB regarding purchase of 1,100-kanal land. It was she, who once claimed that she did not own property in Pakistan what to talk of having property in England, he recalled.\nHe said today Maryam held a press conference, tomorrow Shehbaz Sharif’s group would do so and day after tomorrow another group.\nContrary to the past rulers, he maintained, all the policies adopted by Prime Minister Imran Khan had their focus on the poor and vulnerable segments of the society.\nThe prime minister directed the CDA to devise a plan ti provide substitute means of livelihood to the kiosk holders, he added.\nImran Khan was for the first prime minister, who had no personal business, and neither believed in hereditary politics nor had any intention to bring his sons into politics, he added.\nTo a question about the licenses of PIA pilots, he said the cabinet had set a timeline for the completion of the process regarding genuineness of the licenses. It would have to completed by September 30, he added.\nAbout the outsourcing of airports and related matters, he said the entire process would be completed within 90 days and first of all, legislation would be enacted and legal complications would be removed. Out of 27 airports across Pakistan, barring four or five, the rest were not generating revenue.\nHe said the present government was determined to make difficult decisions, and sort out and reform the institutions, whereas in the past, the country was used only for the vested interests.\nTo a question, he said Saudi Arabia was a brotherly country, which had supported Pakistan in hard times. “We are grateful to them for this.”\nHe said the economic progress during the PML-N government was based on fudged figures as the exchange rate was also kept at a certain level artificially for which the nation had to pay a great price.\nThe Pakistan Peoples Party had only raised the slogan of ‘bread, clothing and shelter’ and done nothing practically in that regard.\nIt was the PTI government, which was taking practical measures for the betterment of the masses, he added.",
  "retrievedAt": "2025-08-11T19:38:30.483Z"
}
