{
  "title": "NLPD hosts Naat recitation ceremony to mark Eid Milad-un-Nabi (PBUH)",
  "author": null,
  "content": "ISLAMABAD, Sep 5 (APP):National Language Promotion Department (NLPD) hosted a Naat recitation ceremony on Friday to commemorate Eid Milad-un-Nabi (PBUH), the birth anniversary of the Holy Prophet Muhammad (SAWW).\nThe solemn and spiritually uplifting gathering featured renowned Naat reciters and was attended by NLPD staff, scholars, and invited guests.\nThe event began with heartfelt recitations by well-known Naat Khawans Muhammad Sibghatullah Qadri and Hafiz Inaam-ul-Haq, who captivated the audience with their soulful expressions of devotion and love for the Prophet Muhammad (PBUH). Their performances were met with enthusiastic applause and appreciation.\nSpeaking on the occasion, Dr. Muhammad Saleem Mazhar, Director General of NLPD, said, “The true essence of life lies in keeping the flame of love for the Prophet Muhammad (SAWW) alive in our hearts. We are indeed fortunate to be gathered here today to remember and honour him together.”\nHe also offered prayers for the acceptance of the gathering and forgiveness of any shortcomings by the attendees.\nDr. Rasheed Hameed, Executive Director of NLPD, in his welcome remarks, addressed the audience. He noted that celebrations commemorating the birth of the Holy Prophet Muhammad (SAWW) were being held all over the world, reflecting the universal reverence for his life and message.\nDr. Hameed further emphasized the unique role of the Urdu language in preserving and promoting Seerat-un-Nabi (PBUH) literature.\n“Urdu holds the distinction of having produced the most extensive body of work on the life and character of the Prophet Muhammad (PBUH). Its literary heritage is rich with devotional poetry and prose, including the works of many acclaimed poets. Even non-Muslim poets have expressed their deep admiration and respect for the Prophet Muhammad (SAWW) through their verses,” he remarked.\nThe ceremony concluded with a collective prayer, invoking blessings upon the Prophet Muhammad (PBUH) and seeking peace, guidance, and forgiveness for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:56:45.685Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nlpd-hosts-naat-recitation-ceremony-to-mark-eid-milad-un-nabi-pbuh/",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T11:45:00.000Z"
}
