{
  "title": "World witnessed Pak Armed Force resolute response in Marka-e-Haq: CNS Admiral Naveed Ashraf",
  "author": null,
  "content": "ISLAMABAD, Sep 05 (APP):Chief of the Naval Staff (CNS) Admiral Naveed Ashraf NI (NIM) T Bt has said that the indomitable spirit to defend the homeland was reaffirmed during ‘Marka-e-Haq’ when the adversary attempted a reckless misadventure on a fabricated pretext.\nIn his message on the eve of Defence Day, the CNS said that the world witnessed resolute response of our valiant Armed Forces, which stood as an impenetrable wall of steel in defence of its sacred soil. Through an exemplary display of deterrence and maritime vigilance, Pakistan Navy ensured the inviolability of national waters and kept the Indian fleet at bay, thus frustrating its naval ambitions.\n“In the chronicles of our national history, certain days stand as luminous milestones, evoking glorious moments of the past.\nSuch days rekindle the fervour of patriotism and reaffirm our solemn resolve to safeguard the sovereignty and territorial integrity of our beloved homeland at any cost. Among these, 6th September holds an exalted place, commemorating an era of unparalleled valour and sacrifices by the gallant Armed Forces of Pakistan in defence of the motherland,” the message said.\nIt is a day that embodies strong resilience, unyielding determination and exceptional courage displayed by the men-in-arms, shoulder to shoulder with their countrymen, in discharge of the sacred duty of national defence. As the decades go by, this historic day continues to inspire national pride, reminding all that Pakistan’s defence remains impervious to any transgression, and if challenged, will be met with a decisive response. Above all, it is an occasion to honour our heroes who have sacrificed their lives to render the nation’s defence impregnable, it further said.\nThis day, reminiscent of the bravery, unity and patriotic fervour of the nation reinforces in us the spirit to serve with utmost integrity, conviction and commitment. The Officers, CPOs, Sailors and Civilians of Pakistan Navy salute our Shuhada and Ghazis and renew their pledge to defend country’s maritime frontiers to ensure robust national security and economic sustainability.\n“As we mark this occasion, let us sincerely offer our gratification to Allah SWT for endowing us with an independent and abundantly resourceful homeland. We must remain mindful that true strength of a nation resides, not solely in the might of its arms or its rich resources, but more so in the allegiance, resilience and cohesion of its people,” the message said.\nThere are adversities along the way, but they make us stronger and more resilient, be it Marka-e-Haq or natural calamities like recent floods, as the nation has always gelled together, its Armed Forces and people side by side, measuring upto every challenge. Each citizen is therefore, entrusted with the responsibility to uphold the ideals of selfless service, ultimate sacrifice and absolute loyalty to ensure that the spirit of 6th September lives on and leads us to our collective destiny. May Allah be our Guide and Protector, Aameen!\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:56:18.717Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/world-witnessed-pak-armed-force-resolute-response-in-marka-e-haq-cns-admiral-naveed-ashraf/",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T14:38:00.000Z"
}
