{
  "title": "Consultation Calls for Stronger Action Against Child Marriage",
  "author": null,
  "content": "ISLAMABAD, Sep 05 (APP):The National Commission on the Status of Women (NCSW), in collaboration with the United Nations Population Fund (UNFPA) and the Legal Aid Society, convened a high-level consultation to deliberate on measures to curb child marriage in Pakistan.\nChairperson NCSW, Ms. Ume Laila Azhar, in her opening remarks, underlined the urgency of standardizing the minimum age of marriage across all provinces. She pointed out that although Sindh pioneered legislation against child marriage, gaps in enforcement remain a major challenge,said in a Press Release issued here Friday.\nDuring the session, government officials, law enforcement authorities, civil society representatives and community stakeholders presented recommendations. These included increasing the appointment of female station house officers (SHOs) and providing specialized police training, reforming nikkah registration through digitization and CNIC verification, enhancing the capacity of the Sindh Child Protection Authority, and ensuring government ownership of initiatives to achieve sustainable results.\nProvincial Minister for Women’s Development, Sindh, Ms. Shaheena Sher Ali, reiterated the government’s commitment, stating that her department had been actively handling cases of child marriage, abuse, and abduction, and was fully aware of the difficulties faced by survivors.\nThe consultation concluded with a joint call to strengthen the implementation of the Child Marriage Restraint Act, increase public awareness at the community level, engage religious leaders in preventive efforts, and promote coordinated action between government and civil society organizations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:55:56.932Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/consultation-calls-for-stronger-action-against-child-marriage/",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T15:25:00.000Z"
}
