{
  "title": "Floods claim 884 lives, impact over 2.1m people: Azam Nazeer Tarar",
  "author": null,
  "content": "ISLAMABAD, Sep 05 (APP): Federal Minister for Law and Justice Senator Azam Nazeer Tarar on Friday termed the ongoing floods a massive natural disaster affecting millions across the country, stressing that dealing with such calamities is often beyond human control, even in advanced nations.\nAddressing the National Assembly, he briefed the House on the scale of devastation and the relief operations under way. He said so far, 884 people had lost their lives, with the toll expected to rise as operations continue, particularly in Punjab.\nThe minister said more than 7,138 houses had been destroyed, while updated figures suggested the number could reach 9,292. Over 6,180 livestock losses had also been reported, with around 2.1 million people directly affected, requiring extensive evacuation and relief support.\nHe informed that the Prime Minister had announced a comprehensive relief package, under which the families of the deceased would receive Rs 2 million, those seriously injured Rs 500,000, and other affected persons Rs 200,000. So far, nearly Rs 690 million had already been disbursed to the affected families, while Rs 1.3 billion had been released to the National Disaster Management Authority (NDMA) for relief and recovery efforts.\nThe minister underlined the importance of coordinated work between the federal, provincial, and district administrations within the three-tier disaster management system. The NDMA, he said, was issuing timely alerts and coordinating resources, noting that 92 percent of flood predictions this season had been accurate.\nTarar called for unity beyond political divides, stressing that the floods were a national tragedy. “There should be no politics in this crisis. We must serve our brothers and sisters with a collective national spirit,” he remarked. He urged the public to assist flood-affected communities generously and assured that the government remained fully committed to restoring the livelihoods of those impacted./APP-rzr-tsw-zah",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:56:21.787Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/floods-claim-884-lives-impact-over-2-1m-people-azam-nazeer-tarar/",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T12:44:00.000Z"
}
