{
  "title": "U.S. Envoy strengthens trade & security ties during Karachi visit",
  "author": null,
  "content": "ISLAMABAD, Sep 26 (APP): U.S. Embassy Islamabad Chargé d’Affaires Natalie Baker concluded a four-day visit to Karachi aimed at deepening economic and security cooperation between the United States and Pakistan.\nDuring her visit, Baker met Sindh Chief Minister Murad Ali Shah and Governor Kamran Tessori to discuss trade, investment, and U.S. support for ongoing flood recovery efforts. She also engaged with Karachi’s leading business groups—including Liberty Group, Gerry’s Group, Kentucky Fried Chicken, and representatives of the Reko Diq mining project—to explore opportunities in technology, energy, minerals, textiles, manufacturing, and port development.\nHighlighting U.S. innovation, Baker learned from textile exporters how RFID and smart labels are streamlining global supply chains. She also held discussions with Liberty Group and Reko Diq’s new country manager on advancing Pakistan’s critical minerals sector, while recognizing U.S. franchises like KFC and their role in supporting local entrepreneurship.\nOn the security front, Baker joined senior officers of the Pakistan Navy to welcome the USS Wayne E. Meyer (DDG 108) at Karachi port. The visit reaffirmed the U.S.-Pakistan naval partnership and shared commitment to regional maritime security.\nBaker also visited the KFC-sponsored Deaf Reach School, where she commended U.S. businesses for championing corporate social responsibility. Since 2014, KFC has supported education and employment for Pakistan’s deaf community, employing more than 250 individuals with hearing disabilities.\n“Strengthening our commercial partnership with Pakistan benefits both our peoples and fosters shared prosperity,” Baker said. “Together, we can ensure the next chapter of our partnership is one of mutual growth and opportunity.”\nCurrently, over 80 U.S. companies operate in Pakistan, directly employing more than 120,000 workers and indirectly supporting another million. Baker stressed that such collaborations unlock Pakistan’s business potential while opening new avenues for American investment.\nHer engagements in Karachi underscored Washington’s commitment to advancing the U.S.–Pakistan relationship through practical cooperation in trade, investment, and security—pillars seen as vital to the growth and stability of both nations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:32:13.872Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/u-s-envoy-strengthens-trade-security-ties-during-karachi-visit/",
  "dateList": "2025-09-26",
  "date_published": "2025-09-26T17:40:00.000Z"
}
