{
  "title": "PM orders swift action on SOE privatisation - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Thursday directed the Privatisation Commission to engage internationally recognised experts to assist in the government’s ongoing privatisation of state-owned enterprises (SOEs), stressing that the process must align with national interest and international standards.\n\nChairing a review meeting on the privatisation programme, the prime minister said he would personally monitor progress to ensure transparency and efficiency. He warned that institutional delays and bureaucratic red tape would not be tolerated.\n\nThe premier emphasised the need to accelerate the process, particularly for loss-making and underperforming SOEs, which he said continue to place a strain on the national exchequer. He instructed the commission to complete the transactions as early as possible while avoiding administrative and legal complexities.\n\nOfficials from the Privatisation Commission briefed the prime minister on the current status of the programme, which includes 24 entities, with active work underway on 15 of them.\n\nAmong the key assets under review are Pakistan International Airlines Corporation Ltd (PIACL), the Roosevelt Hotel in New York, and two power distribution companies for which the government is seeking private sector participation.\n\nThe prime minister urged officials to take immediate steps to improve internal performance across public-sector entities and to ensure that privatisation agreements secure the best possible value for the national exchequer.\n\nHe reiterated the government’s commitment to pursuing privatisation not only as a fiscal measure but also to improve service delivery, operational efficiency, and economic competitiveness.\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/10090137f31dc61.webp",
  "retrievedAt": "2025-10-12T13:16:06.242Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947803/pm-orders-swift-action-on-soe-privatisation",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T02:36:32.000Z"
}
