{
  "title": "Gandapur’s resignation ‘lost in red tape’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Governor House claims it has not received resignation letter, CM Sectt insists it was delivered\n• Gandapur denies being offered his job back, says he won’t accept it\n• Atta Tarar accuses PTI of ‘enabling terrorists’, sees effort to ‘promote militancy’ behind Sohail Afridi’s nomination\n\nPESHAWAR: Despite Imran Khan’s inst­ructions, Ali Amin Gandapur technically re­­mains the chief minister of Khyber Pakh­tun­khwa until his resignation is accepted by the provincial governor.\n\nHis resignation letter, which was shared with the media the previous night, has apparently gotten lost in red tape, with Governor House denying having ever received it.\n\nOfficials at the Chief Minister’s Secretariat told Dawn that Mr Gandapur’s resignation had been delivered to the Governor House on Wednesday night. A copy of the letter seen by Dawn showed that it was received by the governor’s staff at 10:57pm.\n\nHowever, KP Governor Faisal Karim Kundi, who was in Islamabad on Thursday, and other officials at the Governor’s Secre­tariat remained tight-lipped about the issue.\n\nAn official on Mr Kundi’s staff told Dawn that they had yet to receive the resignation letter. “As far as I know, the resignation has not yet reached the Governor’s Office,” the official said, adding that the governor would sign it whenever he received it.\n\nHe further said that Governor Kundi was due to return to the provincial capital on Friday (today).\n\nSpeaking to reporters in Islamabad, Mr Kundi said he had not yet received the chief minister’s resignation and would sign it as soon as it was received. He described reports regarding the receipt of the resignation letter at the Governor House as “fake news.”\n\nMeanwhile, in his first media interaction after ‘stepping down’, Mr Gandapur asserted that the federal government could not topple the PTI government in Khyber Pakhtunkhwa.\n\nCommenting on the delay in the acceptance of his resignation, he termed it a “drama” and advised the government not to waste time, warning that such a delay would harm the province.\n\nWhen asked if he had been re-offered the chief ministership, he denied receiving any such offer, saying that even if such an offer were made, he would not accept it.\n\n‘PTI enables terrorists’\n\nMeanwhile, at a press conference in Isla­m­abad, Information Minister Attaullah Tarar accused the PTI of “enabling terrorists”.\n\nIn his view, the problem that led to Mr Gandapur’s ouster was that he did not do as he was told i.e., “enable and support terrorists and prevent actions against them”.\n\nHe alleged that CM-in-waiting Sohail Afridi was nominated to “support, promote, and enable” terrorism in the province.\n\n“These [people] are enabled by a person sitting in jail,” the information minister said, calling Imran Khan the “chief sponsor of terrorism”.\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/10081014b0931e3.webp",
  "retrievedAt": "2025-10-12T13:16:04.769Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947790/gandapurs-resignation-lost-in-red-tape",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T02:10:21.000Z"
}
