{
  "title": "Air travellers rethink plans as US shutdown causes flight delays - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: The United States government shutdown is hamstringing the travel industry, and its effects are worsening as the stalemate in Congress continues.\n\nTravellers are starting to cancel trips and avoid airports until lawmakers find a way to reopen the government, which may not happen for several more days or weeks. That means a longer stretch of time for key workers — air traffic controllers and security screeners — to go without pay. More workers are calling in sick, leaving fewer staff to handle demand.\n\nTravel representatives are already fretting about the coming Columbus/Indigenous Peoples Day holiday weekend, the first since the shutdown started on Oct 1. The stalemate coincides with peak corporate travel season at a time when the industry is already struggling to achieve its full potential, said Geoff Freeman, president of the US Travel Association.\n\n“If we introduce concern into the system concern about delays, concern about cancellations, concern about TSA being less efficient we’re leading people to stay in the office,” Freeman said, referring to the Transportation Security Administration.\n\n“It’s another reason for people to stay home, whether it’s Americans staying home or foreign travellers avoiding the United States.”\n\nThe US is the only travel market expected to see a decline in spending by foreign tourists this year, as inbound visits are expected to decrease 6.3 per cent year-over-year to 67.9 million, according to data from US Travel and Oxford Economics. Domestic travel is expected to increase 1.9pc this year. Travellers still planning to visit the US have heightened concern about what the shutdown means for their vacation.\n\n“There is some anxiety from ‘What does that mean? Does that mean that we cannot fly? Are people not able to enter the country?’\n\n“All those kinds of questions are coming up,” said Peter van Berkel, president of Travalco, an inbound tour operator. Some travellers abroad are now hesitant to book, van Berkel said.\n\nSo far, the shutdown is not affecting Delta Air Lines operations, CEO Ed Bastian told CNBC on Thursday following its earnings, which showed that sales have accelerated in recent weeks.\n\n12,000 flights delayed\n\nNearly 12,000 flight delays from Monday to early Wednesday were in part tied to Federal Aviation Administration slowdowns due to controller absences, while about 200 flights were cancelled.\n\nAir traffic control staffing issues have emerged sooner in this shutdown than the last major halt to government funding in 2019, leading to unexpected shortages in cities around the country. If it continues, travelers will see “erosion of service” as frustrated air traffic controllers and TSA officers get tired and call in sick, said Sheldon Jacobson, a University of Illinois professor.\n\n“The largest shutdown in history was 35 days in the first President Trump term. Are we going to see 35 days again? There’s no evidence of it being reconciled.”\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e87a0b0aa20.jpg",
  "retrievedAt": "2025-10-12T13:16:05.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947823/air-travellers-rethink-plans-as-us-shutdown-causes-flight-delays",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T03:12:20.000Z"
}
