{
  "title": "Sheikh Mohammed tops racehorse sale with 20 million pound spend - Sport - DAWN.COM",
  "author": null,
  "content": "Sheikh Mohammed outbid Amo Racings Kia Joorabchian to snatch the top lot at the Tattersalls yearling sale in Newmarket this week where over 130 million pounds ($172.63 million) changed hands in a bid to secure racing’s next star.\n\nThe ruler of Dubai’s multi-million pound duel with football agent Joorabchian is in stark contrast to the picture the horse racing industry paints of a sport struggling against potential tax rises and international competition.\n\nBut there was little sign of belt tightening at the Suffolk auction house where almost 500 of Europes best one-year-old future racehorses were offered to the market.\n\nFor over 150 years, the Tattersalls sales ring at Park Paddocks in Newmarket has been the scene of quiet drama where horses are auctioned in their own currency guineas (1 guinea is 1.05 pounds) and bought via a series of barely perceptible nods.\n\nThe Sheikh’s racing operation Godolphin was the biggest purchaser across the three-day sale, spending almost 20m guineas on 23 thoroughbred horses including the top lot, a 3.7m guineas colt by Sea The Stars.\n\nThe sale grossed 127m guineas across 395 lots, almost matching 2024s record 128m guineas.\n\nThe recent death of star sire Wootton Bassett provided a rarity factor to his offspring with 25 of his progeny selling for 14.5m guineas, including a 2.2m guineas colt to Amo Racing.\n\nBuyers from Japan, China, the United States and across the Middle East flock to the British sales ring, fuelled by the long-shot chance of securing the next superstar racehorse or breeding champion.\n\nUS buyers had a strong showing at this year’s sale.\n\nThis was in part driven by the inclusion in President Donald Trump’s One Big Beautiful Bill Act of a provision which allows bloodstock buyers to write-off 100 per cent of the cost of the horse against their income tax in the first year, as well as the lure of more lucrative prize pots at home, said Ed Prosser, US auction house Keeneland’s European representative.\n\nLast year, nearly half of the 455 yearlings sold from Book 1 of Tattersalls’ October yearling sales were bought by international purchasers with 68 going to the United Arab Emirates and 53 to the United States.\n\nNot all horses will be exported, but the numbers are indicative of how international buyers are crucial to the sport.\n\n“We’re increasingly reliant on Middle Eastern purchasers and Americans who have had success with the turf horses,” said Tattersalls chairman Edmond Mahony.\n\nWhile many horses will stay in Britain, losing top breeding and racing talent to other countries is a concern, industry insiders say.\n\nThe eye-watering figures spent at Tattersalls seem to defy the image of a British industry on the brink of decline.\n\nBut trainers, jockeys and racecourse operators maintain ongoing issues like poor prize money, low levels of government support and increasing pressure on the leisure pound are endangering the sport’s future.\n\nNewmarket-based trainer George Scott, who just scored his first Group 1 success with the Sheikh Nasser-owned Caballo de Mar in the Prix du Cadran at Longchamp in France, said smaller trainers were being squeezed.\n\n“The big trainers will get by, but the smaller ones risk being pushed out,” he said. “We’re seeing smaller fields, smaller races and less revenue coming in.”\n\nHe too is worried about talent leaving the country. People are investing heavily in other parts of the world, he said. Japan is taking the best horses and some of those who race in America never come back.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/10205133ffdc16a.webp",
  "retrievedAt": "2025-10-12T13:15:51.155Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947920/sheikh-mohammed-tops-racehorse-sale-with-20-million-pound-spend",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T15:52:07.000Z"
}
