{
  "title": "Govt declares water emergency in Gwadar - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA/GWADAR: The Balochistan government has declared a water emergency in Gwadar and suspended all taxes related to water supply to resolve the issue of serious water shortage the coastal district.\n\nA decision to this effect was taken after a massive protest demonstration was staged by residents of Gwadar.\n\nThe water crisis has been growing with each passing day in Gwadar due to what the people say lethargy of elected representatives and officials concerned who have done nothing to resolve this serious matter for a long time.\n\nThousands of people, including women and children, gathered in front of the office of Gwadar Development Authority and staged a protest demo organised by Amir Kirwan.\n\nThe chief minister took notice declared a water emergency in Gwadar and presided over an emergency meeting on Thursday to discuss the matter, the chief minister expressed dissatisfaction at the lethargic implementation of previously-approved relief measures.\n\nOfficials of the departments concerned briefed the chief minister on the current situation and strategies, however, Mr Bugti criticised lack of tangible progress on the issue despite allocation of necessary funds for the purpose.\n\n“If these measures fail to deliver immediate and effective results, I will personally go to Gwadar and sit in a camp there with the chief secretary to oversee the water supply operation,” Mr Bugti declared.\n\nHe claimed that the government is mobilising all available resources to address this issue and ordered immediate release of funds under the ‘Bridge Financing’ to overcome the crisis.\n\nThe chief minister also directed the Gwadar administration to take a tough action against the tanker mafia, whose exploitative practices have worsened the water situation in the area.\n\nTo enhance water availability, the chief minister ordered an urgent feasibility report for restoring 11 non-functional desalination plants.\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/10082852dee8e34.webp",
  "retrievedAt": "2025-10-16T20:49:42.711Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947787/govt-declares-water-emergency-in-gwadar",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T02:07:06.000Z"
}
