{
  "title": "Athlos eyes ‘sustainable, durable’ growth in track start-up’s second year - Sport - DAWN.COM",
  "author": null,
  "content": "The womens-only track start-up Athlos is gaining traction in its second year in New York, adding new sponsors, expanding its programme with a field event, and laying the groundwork for a multi-meet calendar in 2026.\n\nThe concept, which is the brainchild of Reddit founder and women’s sports entrepreneur Alexis Ohanian, appears to be going from strength to strength.\n\n“We had probably 3X, probably 4X revenue this year, as a result of the fact that we were able to declare victory with that first event,” said Ohanian, who said 3 million tuned in for the inaugural 2024 meet.\n\nHe retained existing sponsors Toyota and Tiffany & Co, while adding new brands, including mobile payment platform Cash App, to provide athletes with prize money “literally when the score is logged.”\n\nThe remark raised eyebrows at the Manhattan press conference on Thursday, especially since the fortunes of another track start-up have nosedived in recent months.\n\nThe Michael Johnson-fronted Grand Slam Track cut its inaugural season short this year and owed its athletes millions in prize money months after the final meet, amid financial woes.\n\nAsked about their mismatched fortunes, Ohanian struck a diplomatic tone: “The reason this league is going to be successful is because of the athletes. And once you understand that, you build from that.\n\n“You can’t go too wrong if you’re prioritising the athletes, and I never lose sight of that,” said Ohanian.\n\nThe approach has lured a number of big names to New York’s Icahn Stadium for Friday’s meet, with 1500 metres world record-holder and three-times Olympic champion Faith Kipyegon and Briton’s 800m Olympic Keely Hodgkinson among the competitors.\n\nThe meet also upped the ante with a dazzling Times Square long jump competition on Thursday, headlined by charismatic Olympic and world champion Tara Davis-Woodhall, who enjoys viral popularity on social media.\n\n“Never in a lifetime would I ever expect to be jumping in the middle of Times Square,” said the American.\n\n“We deserve every second underneath the lights.”\n\n“There’s endless possibilities,“ Davis-Woodhall told the crowd before the event kicked off.\n\nField events have long played second-fiddle to high-octane track and had been frequently overlooked among a recent crop of new athletics meets. World Athletics’ biennial Ultimate Championship, which launches next year, omitted several field events from its programme.\n\nDavis-Woodhall, who won at the World Athletics Championships in Tokyo last month, leapt 6.81 metres to finish atop the standings on her fourth and final jump in front of throngs of fans and curious onlookers assembled in Times Square.\n\nThe competition served as a qualifying event for Friday’s main show, where the final will play out alongside the track events at the sold-out Icahn Stadium on nearby Randall’s Island.\n\nOhanian said he plans to announce meet locations for a new “team format” in 2026, after bringing on Davis-Woodhall, three-times Olympic gold medallist Gabby Thomas and former 100m world champion Sha’Carri Richardson on as owner-advisors.\n\n“What’s crucial for us is let’s grow this thing intentionally,” said Ohanian.\n\n“The most important thing here is we build something that is sustainable and durable.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1017194227f146e.webp",
  "retrievedAt": "2025-10-12T13:15:52.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947903/athlos-eyes-sustainable-durable-growth-in-track-start-ups-second-year",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T12:21:44.000Z"
}
