{
  "title": "Goings-on in Islamabad deepen AJK political uncertainty - Pakistan - DAWN.COM",
  "author": null,
  "content": "POLITICAL uncertainty in Azad Jammu and Kashmir (AJK) has been deepening with each passing day, as both major coalition partners in the Chaudhry Anwarul Haq-led government have urged their leaders to allow them to withdraw from the coalition, ahead of the upcoming elections.\n\nFollowing recent shifts in political affiliations in the 53-member AJK Legislative Assembly, the PPP has raised its strength to 17 and the PML-N to nine, while the PTI forward bloc stands at 20.\n\nThe PTI, which holds the office of the leader of the opposition, is left with only five lawmakers — one of whom has tendered his resignation, although it hasn’t been accepted yet — while two seats are held by members of other parties.\n\nThe PPP’s parliamentary party and some key ticket holders, who met in Islamabad on Wednesday with its regional president Chaudhry Muhammad Yasin in the chair, unanimously resolved that the party should quit the government “sooner rather than later” to protect its political goodwill among the masses.\n\nAmid suspicions that PM Haq ‘supported’ JKJAAC protest, PML-N, PPP lawmakers seek to pull out of ruling coalition\n\nLater, the 17-member parliamentary party held an exclusive meeting that was also attended by a non-legislator, Sardar Tanveer Ilyas. The meeting came in the backdrop of the PML-N’s offer to PPP to form its own government following the possible exit of Mr Haq.\n\n“Yes, we have offered them that we will support them in the event of a new election of the leader of the house. But we will not be part of the government and prefer to sit on the opposition benches,” a PML-N leader confided to Dawn.\n\nThe PPP meeting deliberated on options to pave the way for the prime minister’s exit, either through a no-confidence motion or his voluntary resignation. According to one participant, Mr Ilyas assured the meeting that he would arrange the required tally of 27 to send Mr Haq packing.\n\nThe issue will be further discussed by the PPP parliamentary party on Friday afternoon at Zardari House in Karachi, where the party’s central leadership is expected to take a final decision. Mr Ilyas has also been invited to attend.\n\nA day earlier, the PML-N’s political committee had met in Islamabad, alongside cabinet members Rana Sanaullah and Ahsan Iqbal, where a similar view was expressed — that remaining part of the coalition was politically damaging for the party ahead of the polls.\n\nSources told Dawn that when PM Shehbaz Sharif was briefed about the recent agreement signed in Muzaffarabad between the federal government’s negotiation committee and representatives of the Jammu Kashmir Joint Awami Action Committee (JKJAAC), he was told that PM Haq appeared to have tacitly backed the movement.\n\n“It seemed the AJK premier himself was behind the committee’s hard stance; otherwise, it could not have succeeded in getting each and every demand of the protesters implemented,” a well-placed source quoted a member of the negotiating team as telling the premier.\n\nThis was why the head of the negotiation committee, Raja Pervaiz Ashraf, had hinted to media persons that Mr Haq may be re­­p­laced. However, shortly afterwards, Dr Tariq Fazal Chaudhry sought to play down the claim, saying it was AJK’s internal matter.\n\nMeanwhile, Mr Haq is said to be under intense pressure over the removal of eight cabinet members elected from 12 constituencies of Pakistan-based refugees, in accordance with the agreement with the JKJAAC.\n\nThese ministers belong to all three coalition partners. According to sources, the AJK PM had asked them to step down voluntarily, which was met stiff refusal. Two of them, belonging to the PML-N, even lashed out at the premier through social media posts, accusing him of backing the JKJAAC movement and urging him to resign himself.\n\nThe AJK prime minister has yet to respond to these allegations.\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/100740531af6e92.webp",
  "retrievedAt": "2025-10-16T20:49:02.355Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947778/goings-on-in-islamabad-deepen-ajk-political-uncertainty",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T01:41:03.000Z"
}
