{
  "title": "Security forces repulse attack on DI Khan police training centre; at least 3 terrorists killed - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least three terrorists, including a suicide bomber, were killed in retaliatory fire by police forces after an attack on a police training centre in Khyber Pakhtunkhwa’s Dera Ismail Khan was repulsed on Friday night.\n\nDI Khan District Police Officer (DPO) Sajjad Ahmed Sahibzada confirmed that three terrorists were killed by police forces and added that a large contingent of security forces reached the incident site and cordoned off the area.\n\nPolice confirmed that the training centre premises were cleared and all terrorists involved in the attack were killed.\n\nA search operation, led by DPO Sahibzada, was also conducted in the surrounding areas to ensure no other terrorists were present.\n\nA large contingent of security forces reached the incident site soon after the attack commenced and cordoned off the area. Earlier, there were reports of a loud explosion in the vicinity of the police facility.\n\nDI Khan Police Public Relations Officer (PRO) Yaqoob Khan earlier told Dawn.com that a “suicide bomber and two terrorists have been killed”.\n\nPakistan has witnessed a surge in terrorist attacks, especially in KP and Balochistan, predominantly targeting the police, law enforcement agencies’ personnel, and security forces. Attacks increased after the banned Tehreek-i-Taliban Pakistan broke a ceasefire agreement with the government in 2022.\n\nA senior army officer was martyred during an intelligence-based operation (IBO) in the district a day ago. A cop was martyred in the district after a police checkpoint came under attack from multiple sides by terrorists late on Wednesday.\n\nRecently, multiple areas of KP — including Bannu, Peshawar, Karak, Lakki Marwat and Bajaur — have seen a series of terrorist attacks, particularly targeting police personnel.\n\nLast month, 13 terrorists were killed during an IBO in the district’s Daraban area.\n\nAccording to reports compiled by the Pakistan Institute for Conflict and Security Studies and the Centre for Research and Security Studies, KP remained the most terrorism affected province last month, but also witnessed intensified counterterrorism actions. The province reported 45 attacks that killed 54 people and injured 49.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/10232832bfc2b26.webp",
  "retrievedAt": "2025-10-12T13:15:51.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947923/security-forces-repulse-attack-on-di-khan-police-training-centre-at-least-3-terrorists-killed",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T16:57:01.000Z"
}
