{
  "title": "Soldiers begin patrol in Chicago; states oppose deployment - World - DAWN.COM",
  "author": null,
  "content": "CHICAGO: Over five hundred soldiers began patrolling around an immigration facility on Thursday in Chicago that has become a focal point of protests.\n\nAbout seven or eight soldiers milled around inside the gates at the immigration facility in Broadview, Illinois, on the outskirts of Chicago, carrying sidearms but without rifles, shields or other riot gear.\n\nThe facility, run by US Immigration and Customs Enforcement (ICE), has been the focus of protests since a federal immigration enforcement surge began last month. The agency has fired pepper balls, tear gas and rubber bullets at demonstrators. The Trump administration has marshalled National Guard soldiers, including hundreds from Texas, as legal battles play out.\n\nNational Guard troops are state-based militia forces that, despite wearing US Army uniforms, usually answer to their governors, although the president can commandeer them in limited circumstances. They are more typically deployed to assist with natural disasters.\n\n24 states file appeal\n\nA coalition of 24 states filed a brief on Wednesday in support of Oregon and California’s lawsuit opposing the National Guard deployment in Portland. In urging the appeals court to uphold the lower court, the states argued that the deployment defies the constitution, overrides the state of Oregon’s authority and endangers communities in Portland.\n\nTrump says the troops are necessary to protect federal ICE officers who he says are under threat from street protesters and Democratic elected officials who have refused to cooperate with the White House. Democratic governors and mayors in turn have accused the president of manufacturing a crisis out of political motivations.\n\nTrump is facing four lawsuits over his troop deployments to Portland, Los Angeles, Washington and Chicago.\n\nThe deployments have been found illegal by the two trial courts that have reached early decisions, as judges ruled that protests in Los Angeles and Portland did not warrant a military response.\n\nBut the California court has so far been overruled by the same appeals court that will oversee the Portland case, saying the president’s military decisions must be given great deference.\n\nTrump officials have branded as violent the street protests against his immigration crackdown, though the demonstrations have mostly been small and peaceful, especially when compared to the 2020 demonstrations that erupted across the country following the killing of George Floyd by Minneapolis police. At the federal courthouse in Chicago, where arguments will be heard on Thursday over Trump’s Illinois deployment, the chief judge issued a statement saying “at no point” had she authorised or requested the National Guard’s assistance to secure the building.\n\nThe judge, Virginia Kendall, who chairs the court’s building security committee, said she works closely with the Marshals Service, which has jurisdiction over the interior and exterior security of the courthouse.\n\nHer statement appeared to be in response to a declaration filed by a general that said soldiers would be dispatched to the court due to “two high-profile cases”.\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1009401095d4ed8.webp",
  "retrievedAt": "2025-10-16T20:49:04.333Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947819/soldiers-begin-patrol-in-chicago-states-oppose-deployment",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T03:08:59.000Z"
}
