{
  "title": "Govt set to ink IMF deal after ‘flood adjustments’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The auth­o­rities are hopeful for the finalisation of a staff-level agreement (SLA) with the International Monetary Fund (IMF) during Finance Minister Muhammad Aurangzeb’s upcoming visit to the United States, subject to the consensus on the external account and verified flood-related losses, as well as their fiscal adjustment across central and provincial accounts.\n\nOfficial sources confirmed that the IMF had shared the draft Memor­andum of Economic and Financial Policies (MEFP) with the authorities before a visiting mission left Pakistan after two weeks of engagements.\n\n“We were at the cusp of finalising the SLA, but two crucial tables that form part of the MEFP required further adjustments,” an official said, hoping that the latest data on foreign remittances had strengthened Pakist­an’s stance about the external account.\n\nHe said the State Bank of Pakistan (SBP) would hold its cautious monetary policy stance for now in light of the rebounding inf­l­a­tion. Moreover, the flood-related losses still need to be finalised and verified.\n\nOfficials said the IMF mission appreciated the efforts of the power division, particularly its secretary Dr Fakhre Alam Irfan, for exceeding alm­ost all performance indicators — a rare feat. However, the Fund warned that timely corrective measures, including tariff adjustments, would be crucial for sustainability.\n\nTherefore, the government will have to ensure the timely disbursement of committed subsidies, including the payment of pending bills by the provinces where consumer bills were waived or relaxed in flood-affected districts.\n\nThe provinces, with adjustments against flood losses, must also deliver their cash surplus targets. The government will maintain a tight fiscal policy, particularly regarding the disbursement of development funds, while development projects in flood-affected regions will remain on hold.\n\nThe FBR is set to revise its revenue collection target downward, with measures prepared for implementation by Jan 1, 2026, to address any further shortfalls.\n\nThese issues are expected to be finalised during the upcoming IMF-World Bank annual meetings, where the Pakistani delegation, led by the finance minister and including the SBP governor and FBR chairman, will depart this weekend. Sources said that public debt-related figures, including fixed and flexible interest rates, sukuk and maturities, are safely within targets.\n\nIn an early morning end-of-mission statement, the IMF said that significant progress had been made towards finalising the SLA on the second review under the 37-month Extended Fund Facility (EFF) and the first review of the 28-month Resilience and Sustainability Facility (RSF).\n\nPakistan anticipates receiving around $1.2bn as a combined tranche from the two IMF facilities next month, subject to board approval, based on the expected SLA outcome from policy-level discussions next week.\n\nThe IMF team visited Karachi and Islamabad from Sept 24 to Oct 8 to discuss the second review under EFF and the first review under RSF. “Programme implementation remains strong, broadly aligned with the authorities’ commitments,” the IMF noted.\n\nThe team added that significant progress was made in several key areas, including fiscal consolidation to strengthen public finances while supporting flood recovery, keeping inflation within SBP’s target range through tight monetary policy, restoring energy sector viability via regular tariff adjustments and cost-reducing reforms, and advancing structural reforms to reduce the state’s footprint and strengthen governance. The IMF also highlighted discussions on strengthening climate resilience through reform measures under the RSF.\n\n“The IMF team and the authorities will continue policy discussions with a view to settling any outstanding issues,” it said, adding that the team expressed sympathy for those affected by the recent floods.\n\nPublished in Dawn, October 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/100716459dca912.webp",
  "retrievedAt": "2025-10-16T20:49:46.425Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947782/govt-set-to-ink-imf-deal-after-flood-adjustments",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T01:52:47.000Z"
}
