{
  "title": "Karachi police developing web portal for businessmen to lodge extortion complaints - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Home Minister Ziaul Hassan Lanjar announced on Friday that a web portal is being developed to facilitate traders by registering their complaints regarding extortion and other crimes in Karachi.\n\nEarlier this week, Sindh Inspector General of Police (IG) Ghulam Nabi Memon vowed to provide full protection to economic and commercial activities in collaboration with traders across the province.\n\n“All complaints submitted through this portal will be addressed promptly, and police action will be taken immediately to ensure redressal,” Lanjar said while addressing a press conference at the Karachi Police Office.\n\nFlanked by IG Memon and Karachi Additional IG Javed Alam Odho, Lanjar said any complaint related to extortion slips or threats submitted through the new web portal will lead to the immediate registration of a first information report (FIR), and all legal measures will be ensured against those involved.\n\nAdditional IG Odho said that the initiative is being taken in light of traders reporting “inconveniences” while visiting police stations for lodging an FIR.\n\n“Protecting the business community and providing them with a safe and free business environment are among the top priorities of the Sindh government,” Lanjar said.\n\nHe added that extortion has become a major issue of concern in recent times and emphasised that since Karachi is Pakistan’s economic hub, the government’s foremost priority is to provide a peaceful environment for the business community and all traders, ensuring safe and free business activities at every level.\n\n“Although the issue of extortion has been given significant hype, both the SIU/CIA (Special Investigation Unit/Crime Investigation Agency) and the district police are fully committed to uprooting and eradicating this crime and have been conducting effective and coordinated operations,” the home minister said.\n\n“At present, Wasiullah Lakho and Samad Kathiawari are operating extortion gangs from Iran,” he added. “For their arrest, a formal request for red warrants has been sent, and the Sindh government will also request assistance from the federal interior minister to help ensure the arrest of these criminals involved in such heinous acts.”\n\nThe home minister stated that extortion in a city like Karachi is a highly serious and sensitive matter, and the provincial government has always been committed to providing a business-friendly environment to promote economic activity. However, he stressed that public cooperation is crucial to curb extortion.\n\nLanjar noted that the SIU/CIA and district police have conducted operations in which four extortionists were killed.\n\n“The threats were linked to the Lakho group and Samad Kathiawari, and the government will never allow any group or criminal element to openly distribute extortion slips or intimidate citizens,” he vowed.\n\nAdditional IG Odho added that the police had arrested 20 suspected extortionists within two weeks. He said that there would be zero extortion cases in the city and recalled that the police had also controlled targeted killings in the metropolis.\n\nOn Wednesday, a police crime data report showed that 118 incidents of extortion were reported in Karachi so far this year, of which only 44 were genuine extortion cases, while the remaining 74 pertained to personal disputes and business quarrels. A police statement added that of the 44 cases, 39 were “solved” — a success ratio of 87 per cent.\n\nAdditionally, compared to last year, there has been a “significant” reduction in street crimes during the ongoing year. As of 2024, 252 incidents of street crimes were being reported daily, but this year, only 167 incidents have been reported, a decrease of 52pc.\n\nAccording to a crime statistics report seen by Dawn.com, only six people were killed as of September 2025, compared to 13 as of January 2024.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/101950174aba43c.webp",
  "retrievedAt": "2025-10-12T13:15:51.303Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947913/karachi-police-developing-web-portal-for-businessmen-to-lodge-extortion-complaints",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T15:16:13.000Z"
}
