{
  "title": "4 govt officials, including 2 school teachers, allegedly abducted in KP’s Bannu: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four government officials, including two high school teachers and two workers from the Benazir Income Support Program (BISP), were allegedly abducted from different localities in Khyber Pakhtunkhwa’s Bannu district, officials said on Tuesday.\n\nPer the police, the teachers were “abducted” from GHS Zindi Musa Khan in Bannu’s Mandati Naika Zyarat area, which falls within the limits of Hoid police station.\n\n“The first incident occurred within the limits of Hoid police station, which is under threat of militants,” District Police Officer (DPO) of Bannu Saleem Abbas Kulachi told Dawn.com. “In the past few months, the police station in Hoid has been attacked several times by militants.”\n\nDPO Kulachi added that unknown armed men had taken the school teachers to unidentified locations.\n\nAmong the abductees were the headmaster of the school, who was a resident of Nekam Kaki, as well as a senior school teacher, who was a resident of Bannu, Bannu police spokesperson Kashif Nawaz told Dawn.com.\n\nNawaz added that both teachers were abducted by the militants when they were returning from the school. “A search operation is being conducted in the area to get the abductees released from the terrorists,” he added.\n\nDPO Kulachi also confirmed the second incident. “Terrorists came in a group of 15 to 20 and stormed the BISP payment disbursement point,” he told Dawn.com.\n\nHe added that the terrorists kidnapped two workers from the BISP, identified as assistant director Safiullah and supervisor Shah Khalid. However, the DPO could not confirm the amount of money the terrorists took from the victims.\n\nRecently, multiple areas of KP — including Bannu, Peshawar, Karak, Lakki Marwat and Bajaur — have seen a series of terrorist attacks.\n\nOn Sunday, a soldier was martyred and another injured when unknown assailants opened fire on them near Bannu, according to the police.\n\nIn August, a police constable was martyred in a terrorist attack on a checkpoint in Bannu, where an exchange of fire also left three terrorists dead and three policemen injured.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0717405779f703e.webp",
  "retrievedAt": "2025-10-12T13:11:51.342Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947242/4-govt-officials-including-2-school-teachers-allegedly-abducted-in-kps-bannu-police",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T16:26:36.000Z"
}
