{
  "title": "7 injured after blast derails 4 Jaffar Express bogies in Sindh’s Shikarpur - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least seven people were injured on Tuesday after a blast on a railway track derailed four bogies of the Jaf­far Express in Sindh’s Shikarpur district, according to officials.\n\nWith a rise in terrorist attacks over the past few years, Balochistan has seen a series of incidents where militants blow up train tracks, targeting the province’s transport infrastructure.\n\nSpeaking to Dawn.com, Shikarpur Deputy Commissioner Shakeel Abro said, “A blast had occurred on the train tracks at 8:15am. The incident occurred at a distance of 1km from the Sultan Kot railway station.”\n\nHe said that the blast had caused the derailment of four bogies. Abro said that seven people had been injured, out of which four had been taken to the Combined Military Hospital, while the remaining three had been taken to the Civil Hospital in Shikarpur.\n\nHe said that the Jaffar Express train was bound for Quetta via Jacobabad.\n\nSukkur Deputy Divisional Superintendent Syed Moalim said that the blast occurred while the train was moving on the track. He said that a crane was being brought by railway officials to put the derailed bogies back on the track.\n\nSukkur Divisional Transport Officer (DTO) Mohsin Ali Sial told Dawn.com that “passengers were being taken to nearby stations so that work could commence on repairing the track.”\n\nShikarpur Senior Superintendent of Police (SSP) Shahzeb Chachar added that the remaining bogies had proceeded toward Jacobabad. He said that the blast had targeted a single track used by trains going to and from Quetta via Jacobabad.\n\nHe maintained that police in Jacobabad and Shikarpur were trying to trace the culprits responsible for the incident.\n\nMeanwhile, Sindh Chief Minister Murad Ali Shah condemned the incident. According to Radio Pakistan, Shah sought a report of the incident from the Sindh police inspector general.\n\nHe also directed the Larkana commissioner to provide medical assistance to the injured passengers.\n\nIn August, no loss of life was reported after a bomb blast on a railway track in Balochistan’s Mastung district derailed six bogies of the Jaffar Express. The incident occurred near the Spezand station in Mastung’s Dasht tehsil, when the train was heading from Quetta to Peshawar City station with 350 passengers on board.\n\nThe incident came just three days after Quetta-bound Jaffar Express narrowly escaped a disaster in Balochistan’s Sibi, where a bomb planted near the track exploded just after the passenger train passed.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:45:24.638Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947205/7-injured-after-blast-derails-4-jaffar-express-bogies-in-sindhs-shikarpur",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T07:26:59.000Z"
}
