{
  "title": "After two years of ‘living hell’, Gaza awaits peace - World - DAWN.COM",
  "author": null,
  "content": "• Both sides seek clarifications as indirect talks between Hamas, Tel Aviv kick off in Egypt\n• Trump looking for swift resolution, but insiders say it may take days to iron out all the details\n\nSHARAM EL SHEIKH / WASHINGTON: Two years since the events of Oct 7, 2023, delegations from Israel and Hamas began indirect negotiations in Egypt on Monday, which the US hopes will bring an end to the war in Gaza.\n\nHowever, in a surprising turn of events, the White House on Monday appeared not to outright reject the prospect of recognising a Palestinian state in the future.\n\nThe talks between the two sides facing contentious issues, such as demands that Israel pull out of the enclave, and the disarming of Hamas.\n\nEgyptian state TV reported that the talks had begun at the Red Sea resort of Sharm El Sheikh.\n\n“I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST,” Trump said in a social media post.\n\nBut both sides are seeking clarifications of crucial details, including over issues that have wrecked all previous attempts to end the war and could defy any quick resolution.\n\nThough Trump says he wants a deal quickly, an official briefed on the negotiations, speaking on condition of anonymity, said he expected the round of talks kicking off on Monday would require at least a few days.\n\nAn official involved in ceasefire planning and a Palestinian source said Trump’s deadline to send all hostages back within 72 hours could be impossible to meet in the case of bodies of dead hostages, some of which would need to be located and recovered from burial sites scattered across the battlefield.\n\nA Palestinian official close to the talks was sceptical about prospects of a breakthrough given deep mutual mistrust, saying Hamas and other Palestinian factions were worried that Israel might ditch negotiations once it recovered the hostages.\n\nNegotiators from Hamas will seek clarity on the mechanism to achieve a swap of remaining prisoners — both alive and dead — for Palestinian prisoners held in Israel, as well as an Israeli military withdrawal from Gaza and a ceasefire, according to a statement put out by the Islamist group late on Sunday.\n\nA thorny issue is likely to be the Israeli demand, echoed in Trump’s plan, that Hamas disarm, a Hamas source told Reuters. The group has insisted it will not disarm unless Israel ends its occupation and a Palestinian state is created.\n\nWhite House briefing\n\nIn a surprising turn of events, the White House on Monday appeared not to outright reject recognising a Palestinian state in the future, after being asked about the matter.\n\n“If Hamas does agree to relinquish power and give it up, cede power to this transitional technocratic government, if that does happen, would the Trump administration then recognise a Palestinian state?” Press Secretary Karoline Leavitt was asked during a press briefing on Monday.\n\n“Look, I don’t want to get ahead of the technical talks right now… they’re extremely sensitive,” she responded.\n\n“There’s many things to discuss. Of course, this is hopefully – we expect, and we hope – going to be one of the greatest peace deals this world has ever seen. And the Trump administration is working diligently and working very hard to get there”.\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e46cd2c9fcd.jpg",
  "retrievedAt": "2025-10-16T20:46:08.891Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947134/after-two-years-of-living-hell-gaza-awaits-peace",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:31:37.000Z"
}
