{
  "title": "SC judges record dissent in PTI reserved seats case - Pakistan - DAWN.COM",
  "author": null,
  "content": "The dissenting note in the reserved seats case, authored by Justice Ayesha A. Malik and Justice Aqeel Abbasi, was released on Monday, highlighting divisions within the bench over last year’s dismissal of government appeals.\n\nIn June 2024, the Supreme Court of Pakistan declared Imran Khan’s Pakistan Tehreek-i-Insaf (PTI) eligible for seats reserved for women and minorities, dealing a major setback to Prime Minister Shehbaz Sharif’s ruling coalition. The verdict was announced by a 13-member bench, headed by Chief Justice of Pakistan (CJP) Qazi Faez Isa.\n\nFollowing the verdict, the PPP, PML-N and the Election Commission of Pakistan (ECP) filed review petitions, which were later rejected. Justice Abbasi and Justice Malik then released a dissent.\n\nThe dissenting note stated that all three review petitions were filed against the brief verdict issued on July 9, 2024, and only the ECP submitted additional petitions based on the detailed verdict dated September 23, 2024.\n\n“All arguments raised by the petitioners had already been addressed in the detailed verdict issued on September 23, 2024.“\n\nThe note asserted that all arguments were already addressed in the detailed verdict. It further added that lawyers attempted to reopen the case through fresh arguments; however, the scope of review is limited and a new case can not be initiated.\n\n“Through these reviews, lawyers merely attempted to re-argue the case, which is outside the scope of a review jurisdiction.”\n\nIt stated that only those judgments are subject to review where a clear legal error exists and minor irregularities or differences of opinion cannot be grounds for review.\n\nThe dissenting note further stated that the judgments of the apex court are final and delivered after thorough consideration and also emphasised that a review is not like an appeal and can’t become routine procedure.\n\n“Turning reviews into routine proceedings would disrupt the balance of the justice system.”\n\nIt elaborated that the coalition partners, the PML-N and the PPP did not raise any specific objections to the detailed decision, and both parties only challenged the short order. The petitions were filed on July 13, 2024, whereas the detailed verdict came out on September 23, 2024, the note highlighted.\n\n“Despite the long gap between the short and detailed verdicts, no new legal arguments were presented.,“ concluded the dissenting note.\n\nThrough its March 25, 2024 order, the Peshawar High Court (PHC) had deprived the Sunni Ittehad Council (SIC) — the party joined by PTI-backed independents after the Feb 8, 2024, polls — of reserved seats.\n\nIn a 4-1 verdict, the electoral watchdog ruled that the SIC was not entitled to claim quota for reserved seats “due to having non-curable legal defects and violation of a mandatory provision of submission of party list for reserved seats, which is the requirement of law”.\n\nThe SIC — joined by PTI-backed independents who won the elections sans their electoral symbol — had filed the petition through its chairman, Sahibzada Muhammad Hamid Raza, seeking directives of the court for the ECP to allocate reserved seats to the council based on their strength in the national and provincial assemblies.\n\nThe commission had also decided to distribute the seats among other parliamentary parties, with the PML-N and the PPP becoming major beneficiaries. The decision was challenged by the PTI in the top court.\n\nOn July 13, the apex court, in a unique majority verdict, declared the PTI eligible to receive reserved seats for women and non-Muslims in the national and provincial assemblies, giving it a new lease of life in the legislature by declaring it to be a parliamentary party.\n\nHowever, the ruling was not implemented by the National Assembly, while the ECP had raised some objections. The review petitions against the SC order had been filed by the PML-N, the PPP and the ECP.\n\nOn the date of the first hearing of this case, Justices Ayesha A. Malik and Aqeel Ahmed Abbasi had rejected outright the review petitions filed by the PML-N, ECP and PPP.\n\nSubsequently, their names were excluded from the strength of the Constitutional Bench, even though they were considered part of the bench.\n\nMeanwhile, Justice Jamal Khan Mandokhail had partly allowed the review petitions and maintained his original order of giving 39 seats to PTI, but reviewed the majority judgment to the extent of 41 seats.\n\nIn his July 12 dissenting order, Justice Mandokhail had declared PTI a parliamentary party consisting of 39 members, and thus entitled to reserved seats. Therefore, the ECP should recalculate and reallocate the reserved seats amongst the political parties, including PTI, he held.\n\nThe July 12 majority judgement had asked the rest of the 41 independent candidates to file signed and notarised statements before the commission within 15 days — explaining that they contested the Feb 8 general elections as a candidate of a particular political party. Consequently, the ECP had notified them as PTI members, in light of the judgment.\n\nJustice Muhammad Ali Mazhar and Justice Syed Hasan Azhar Rizvi, who were part of the earlier majority judgement, also reviewed their positions and allowed the review petitions.\n\nHowever, they posited that since the controversy at hand could not be resolved, either by the PHC or the Supreme Court, the ECP should examine and consider afresh the nomination papers/declaration and other relevant documents of all 80 returned candidates, with regard to their affiliation, and take a decision on the allocation of reserved seats within 15 days from receiving a copy of their short order.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:12:32.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947047/sc-judges-record-dissent-in-pti-reserved-seats-case",
  "dateList": "2025-10-07",
  "date_published": "2025-10-06T19:30:42.000Z"
}
