{
  "title": "Exiled BNP leader Tarique Rahman plans return to Bangladesh after 17 years - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Bangladeshi heavyweight politician Tarique Rahman said on Monday he would return “soon” after 17 years in self-imposed exile to contest the first elections since a 2024 mass uprising.\n\nRahman, 59, heir to Bangladesh’s longtime ruling family as son of former prime minister Khaleda Zia, is the acting chairman of the Bangladesh Nationalist Party (BNP), widely seen as a key frontrunner in the upcoming polls.\n\n“For some reasonable reasons my return hasn’t happened… but the time has come, and I will return soon, God willing,” Rahman told BBC Bangla in an interview.\n\nThe elections, due in February 2026, will be the first since a mass uprising ousted prime minister Sheikh Hasina last year, ending her 15-year hardline rule — during which she crushed the BNP.\n\nRahman, known in Bangladesh as Tarique Zia, has lived in London since 2008, saying he fled politically-motivated persecution. Since Hasina’s fall, Rahman has been acquitted of the most serious charge against him; a life sentence handed down in absentia for a 2004 grenade attack on a Hasina rally, which he always denied.\n\nRahman has emerged as an outspoken figure on social media and a rallying point for BNP supporters. “I am running in the election,” he told the BBC, speaking from London.\n\nRegarding the possibility of assuming office as prime minister if the BNP forms the government, he said: “The people will decide.” It is unclear if his mother, 80-year-old Khaleda Zia, who has suffered ill health after being jailed during Hasina’s tenure, will run again herself or play a guiding role behind her son.\n\n“She went to jail in good health and returned with ailments, she was deprived of her right to proper treatment,” he said.\n\n“But… if her health permits, she will definitely contribute to the election.” He also spoke on the ban on Hasina’s Awami League ordered by the interim government of Muhammad Yunus, who will step down after the elections.\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:12:19.804Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947115/exiled-bnp-leader-tarique-rahman-plans-return-to-bangladesh-after-17-years",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:32:10.000Z"
}
