{
  "title": "PTI formally taps Achakzai, Abbas to lead opposition - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After getting the nod from Imran Khan, the PTI nominated Mehmood Khan Achakzai and Allama Raja Nasir Abbas on Monday as its candidates for the slots of Leader of the Opposition in the National Assem­bly and Senate, respectively.\n\nThe nomination letters will be submitted to the secretariats of both houses today (Tuesday).\n\nThe decision was taken after the Peshawar High Court vacated the stay orders against disqualification of Omar Ayub and Shibli Faraz, former leaders of the opposition in the lower and upper houses of parliament, respectively.\n\nSheikh Waqqas Akram, the party’s information secretary, told Dawn that the decision had been made on the orders of Imran Khan.\n\nAleema says only sisters will convey Imran’s messages\n\nHe said the letter of nomination for the opposition leader in the NA was submitted on Monday while that for the Senate slot would be submitted on Tuesday.\n\nAsad Qaiser, the former National Assembly speaker, confirmed the decision, but added that nomination letters for both positions would be submitted on Tuesday (today).\n\nMr Qaiser said both Mr Achak­zai and Allama Nasir Abbas were seasoned politicians and never “compromise on principles”.\n\n“As the country is passing through a crisis, Mr Achakzai is outspoken and is a perfect choice to speak in the lower house on behalf of the opposition.\n\n“Imran Khan’s decision will strengthen the opposition alliance as Mr Achakzai is also head of Tehreek Tahaffuz Ayeen-i-Pakistan (TTAP),” he said.\n\nIn reply to another question, Asad Qaiser said the decisions were made because stay orders for both Omar Ayub and Shibli Faraz were vacated by the PHC.\n\nAfter the disqualification of Omer Ayub Khan and Shibli Faraz, the PTI chief nominated Mr Achakzai and Azam Swati as opposition leaders in the National Assembly and the Senate, respectively, on Aug 20.\n\nSalman Akram Raja, the PTI’s secretary general, gave his assent to the decision.\n\nOnly Imran’s sisters can share his views, says Aleema\n\nSeparately, Aleema Khan asserted on Monday that only Imran Khan’s sisters would now carry the responsibility of conveying his messages, as directed by the incarcerated PTI founding chairman himself.\n\nSpeaking outside Adiala Jail, she said Imran also warned he may soon be shifted to an unknown location and placed in solitary confinement.\n\nImran Khan reportedly expressed concern over a campaign targeting the family members, allegedly because his sisters shared his messages with the masses.\n\n“He said others cannot bear the burden of his words,” Aleema said, stressing that the sisters have never interfered in party matters in 30 years and visit jail solely for him.\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:12:31.988Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947123/pti-formally-taps-achakzai-abbas-to-lead-opposition",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:31:49.000Z"
}
