{
  "title": "Pakistan to be sold advanced US air-to-air missiles by Raytheon - World - DAWN.COM",
  "author": null,
  "content": "Pakistan will be sold Advanced Medium-Range Air-to-Air Missiles (AMRAAM) by United States defence group Raytheon following a modification in the firm’s contract that included the country in the list of buyers, it emerged on Tuesday.\n\nThe US missiles are equipped on F-16 Falcons flown by the Pakistan Air Force (PAF).\n\nA September 30 press release on the contracts issued by the US Department of War for the US Air Force said Raytheon was awarded a $41.6 million firm-fixed-price modification to a previously awarded contract for the enhanced C8 and D3 AMRAAM variants and their production.\n\nIt added that the modification brought the total cumulative face value of the contract to $2.5 billion from $2.47bn.\n\n“Work will be performed at Tucson, Arizona, and is expected to be completed by May 30, 2030. This contract involves foreign military sales to United Kingdom, Poland, Pakistan, Germany, Finland, Australia, Romania, Qatar, Oman, Korea, Greece, Switzerland, Portugal, Singapore, Netherlands, Czech Republic, Japan, Slovakia, Denmark, Canada, Belgium, Bahrain, Saudi Arabia, Italy, Norway, Spain, Kuwait, Finland, Sweden, Taiwan, Lithuania, Isreal, Bulgaria, Hungary, and Turkey,” the contract said.\n\nThe May 7 contract for the AMRAAM deal had not included Pakistan as among the list of buyers for the missile.\n\nThe same missiles were reportedly used in February 2019, when the PAF conducted Operation Swift Retort and shot down two Indian Air Force (IAF) jets intruding into Pakistani airspace over Kashmir.\n\nPakistan had bought 700 AMRAAM in January 2007 in what was the largest international order for the weapon at the time.\n\nThe development comes amid improving ties between Pakistan and the US. Of late, it seems that Islamabad and Washington are in lockstep. The positive signals, which began emanating soon after President Donald Trump’s inauguration, seem to be turning into full-blown bonhomie with Pakistan entering a new phase in its economic and strategic partnership with the US.\n\nFrom acknowledging Pakistan’s counterterror cooperation in the arrest of an IS-Khorasan operative to claiming credit for stopping a nuclear war in South Asia, the country has perhaps featured more in this US president’s day-to-day media interactions than any past ‘commander-in-chief’.\n\nAfter securing what seems to be a major discount in tariff negotiations, attracting US investor interest in its oil and mineral reserves and signalling that its currency market is receptive to digital assets and cryptocurrencies, Pakistan seems to be in the driving seat as far as South Asia is concerned.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0717141319912ed.webp",
  "retrievedAt": "2025-10-12T13:11:53.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947237/pakistan-to-be-sold-advanced-us-air-to-air-missiles-by-raytheon",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T12:31:57.000Z"
}
