{
  "title": "DG ISPR says Chinese weapon systems performed ‘exceptionally well’ during May conflict with India - Pakistan - DAWN.COM",
  "author": null,
  "content": "Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry has said that Chinese weapon systems deployed during Pakistan’s four-day military conflict with India in May performed “exceptionally well”.\n\nDuring the conflict, Deputy Prime Minister Ishaq Dar reportedly said the Pakistan Air Force (PAF) used Chinese J-10C jets in its response to India’s May 7 attack. A report by The Guardian had noted that Pakistan deploying J-10Cs would “mark the first time the Chinese planes — and the PL-15 missiles they were carrying — have been used in combat anywhere in the world”.\n\nIn May, China had expressed ignorance about the use of its jets, saying it was “not familiar with the matter”. In July, however, the Chinese air chief commended the PAF’s “exemplary performance” in the May conflict.\n\nIn an interview with Bloomberg, which was held last week and published yesterday, Lt Gen Chaudhry said: “Of course lately, recent Chinese platforms, they’ve demonstrated exceptionally well.”\n\n“We are open to all sorts of technology,” he added.\n\nLt Gen Chaudhry was quoted as saying that Pakistan had recently raised its tally of Indian aircraft shot down to seven — up from a previous count of six.\n\nRecently, United States President Donald Trump also described how he confronted both nations during an active war that saw “seven aircraft shot down”.\n\nThe DG ISPR also refuted Indian claims of Pakistan losing any planes.\n\n“Pakistan has never tried to play with figures and facts,” Lt Gen Chaudhry said. Pakistan said it downed six Indian jets in retaliation in May, including the French-made Rafale.\n\nIndia’s highest-ranking general has acknowledged that its forces suffered losses in the air, but denied losing six aircraft.\n\n“The conflict marked the largest battlefield deployment of Chinese weaponry in recent history, with the J-10C as well as the PL-15 air-to-air missile seeing live documented fighting for the first time,” Bloomberg stated.\n\nDuring the escalation, shares of Chinese defence-manufacturing companies rallied as tensions between India and Pakistan boosted the outlook for mainland exporters.\n\nAfter the Indian political and military leadership made aggressive statements last week, repeating its terrorism allegations — which Pakistan has repeatedly refuted — the Pakistani military warned on Saturday that any future conflict with India could lead to “cataclysmic devastation”.\n\nA day later, Defence Minister Khawaja Asif said India faced a “decisive defeat with a score of 6-0” in the May escalation, and “if they try again [to go to fight], God willing, the score will be much better than the last time”.\n\nThe May conflict was sparked by an attack on Hindu tourists in occupied Kashmir, which New Delhi, without evidence, linked with Pakistan. Islamabad strongly denied responsibility while calling for a neutral investigation.\n\nPakistan had said it downed six Indian planes after the latter carried out deadly attacks in Punjab and Azad Kashmir. After tit-for-tat strikes on each other’s airbases, it took American intervention on May 10 for both sides to finally reach a ceasefire.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/071326324da2ba0.webp",
  "retrievedAt": "2025-10-16T20:46:36.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947213/dg-ispr-says-chinese-weapon-systems-performed-exceptionally-well-during-may-conflict-with-india",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T09:23:47.000Z"
}
