{
  "title": "PM Shehbaz receives honorary PhD in leadership, governance from Malaysian university - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister She­hbaz Sharif has received an honorary degree of Doctor of Philosophy during his visit to Malaysia in recognition of his “outstanding leadership and contributions to nation-building”.\n\nThe premier arrived in Malaysia on October 5 for a three-day official visit, during which he snapped up six accords and several trade and bilateral agreements.\n\nAccording to Malaysian state news agency Bernama, the International Islamic University Malaysia (IIUM) conferred the degree of Doctor of Philosophy in Leadership and Governance during a special ceremony held yesterday at its Kuala Lumpur campus.\n\nDressed in a blue gown on the occasion, PM Shehbaz termed it a “great privilege and honour” to be part of the event and receive the degree from this “great institute of learning”.\n\nHe appreciated Queen of Pahang Tunku Azizah Aminah Maimunah Iskandariah, who is also the IIUM Constitutional Head, for gracing the event.\n\nThe premier said: “For over four decades, I devoted my humble services to serve the cause of [and] the people of Punjab, the largest province of Pakistan, as their public servant. And now, as the prime minister of Pakistan, and in the line of duty, despite my human failings, I tried my best to serve the people with sincerity of purpose and unwavering commitment.\n\n“I am truly delighted to be associated through this degree of philosophy with one of the most revered seats of learning in the Muslim world and an institution that has championed the integration of knowledge, faith and ethics, and pursuit of excellence,” he added.\n\nThe premier expressed the hope that his visit to the varsity would further strengthen the bonds of academic partnership and collaboration between the IIUM and Pakistan’s leading institutions of higher learning.\n\nThe prime minister emphasised that leadership was not a privilege but a “sacred trust, amanah, which must be exercised with honesty of purpose, sincerity, justice and transparent accountability before Allah”.\n\n“History bears testimony that whenever Muslims held firmly to these glorious principles, they not only flourished themselves but also became a source of guidance for humanity around the globe,” PM Shehbaz said.\n\nHighlighting that the Muslim ummah today confronts “formidable challenges [of] conflict, poverty and disunity, he stressed that it was “in these testing times that we need to hold on together to our values and ethics guided by our religion to be able to reclaim our lost place in the comity of nations”.\n\nAddressing the Pahang queen, the premier said Malaysia was blessed with a very young population and noted that “our responsibility as servants and as leaders is to provide them the right platforms to serve the cause of suffering humanity with compassion and with great commitment”.\n\nThe prime minister read out a few verses of Dr Allama Iqbal and their English version as well. He expressed his wishes for IIUM’s continued success and for a “future of greater unity, brotherhood and very close coordination” for both Pakistan and Malaysia.\n\nIn her remarks, the Pahang queen noted that Shehbaz had “served with vision, discipline and compassion” for four decades.\n\n“From your leadership in Punjab to your role as prime minister, you have shown true leadership is not about power but about purpose, about building lives and uplifting communities through education, healthcare and opportunities.”\n\nShe highlighted that the Punjab Education Endowment Fund “opened the doors of higher learning to thousands who might never have dreamt of university education”. “That is leadership that touches hearts and transforms futures,” Iskandariah noted.\n\nRecalling that Pakistan was a founding partner of the IIUM, she said Pakistani students and alumni continue to “enrich the university and uphold our shared mission of serving the ummah”.\n\nThe Pahang queen also mentioned the Palestine issue, saying “peace on earth and harmony among all mankind” was what “we truly need today with what is happening in Palestine”.\n\nIn a post on X, PM Shehbaz said it was a “truly humbling experience” to be recognised with the honorary degree.\n\n“With great humility, I accepted this honour on behalf of the people of Pakistan as a symbol of the deep-rooted intellectual and cultural connection as well as people-to-people ties between Pakistan and Malaysia,” he added.\n\nIn the afternoon, a post on the Pakistani government’s X account said PM Shehbaz had departed for Pakistan after concluding his visit to Malaysia.\n\nA day ago, PM Shehbaz and his Malaysian counterpart Anwar Ibrahim held several meetings during which they resolved to reignite bilateral cooperation and move towards a more aggressive and forward-looking policy, including the possibility of collaboration under the umbrella of the Asean economic bloc.\n\nOn the economic side, the premier termed PM Ibrahim’s announcement of the import of Halal meat worth $200 million from Pakistan a “welcome step”.\n\nSeparately, PM Shehbaz held a meeting with a delegation of Malaysian business group Gobi Partners, which “showed keen interest in collaboration in e-commerce and financial technologies in Pakistan”, according to state-run Radio Pakistan.\n\nAddressing the delegation, led by Gobi Partners’ co-founder and chair Thomas G. Tsao, the premier highlighted “immense potential” for enhancing cooperation in various economic sectors between the two countries.\n\nHe welcomed Gobi Partners’ confidence in Pakistan’s startup ecosystem, assuring the delegation that the government was implementing “focused reforms to support startups and early-stage investors” via facilitating investments and providing better access to infrastructure, the report added.\n\n“Mobilising both domestic and international capital is our priority to develop a sustainable startup ecosystem,” he said.\n\nPM Shehbaz highlighted that the fintech, e-commerce, and IT services sectors form “the backbone of Pakistan’s national development strategy”.\n\nThe prime minister reaffirmed Pakistan’s commitment to strengthening economic and trade relations with Malaysia, saying: “The government is fully committed to creating a business-friendly environment and improving the ease of doing business in Pakistan.”\n\nReferring to the Pakistan-Malaysia Business and Investment Conference held yesterday, PM Shehbaz said such initiatives were a “welcome step towards promoting business-to-business linkages” between the two countries, Radio Pakistan added.\n\nThe prime minister noted that the Special Investment Facilitation Council was providing all possible support and facilities to foreign investors.\n\nHe highlighted the importance of the digital economy and expressed Pakistan’s readiness to welcome international business groups and investors with an interest in the country’s growing IT, technology, and artificial intelligence sectors.\n\nThe premier’s official visit to Malaysia this week, at the invitation of PM Ibrahim, marks his first since he assumed office in 2024.\n\nThis was highlighted in a joint statement issued by Pakistan and Malaysia today, posted by the High Commission of Pakistan in Malaysia on X.\n\n“Since the establishment of diplomatic relations in 1957, Malaysia and the Islamic Republic of Pakistan have built a partnership premised on mutual respect and shared values,” the statement said.\n\nIt further highlighted the commitments of both leaders to strengthening this partnership via bilateral trade and investment, including Malaysia’s decision to import halal meat from Pakistan that was hailed by the prime minister.\n\nIn turn, Malaysia expressed its intention to expand palm oil exports to Pakistan in line with increasing demand, according to the statement.\n\n“Both sides also agreed to further deepen the bilateral defence cooperation, particularly in the field of defence science, technology, and industry, through knowledge and technology transfer,” the statement read.\n\nBesides deciding to explore collaboration in healthcare, pharmaceuticals, and medical devices, the two premiers also agreed to enhance tourism promotion and cultural exchanges from both sides.\n\nThe leaders acknowledged the importance of sustainable agricultural practices, energy security and healthcare, agreeing to explore joint research and innovation initiatives as well as partnerships in these sectors.\n\nFurthermore, the two sides noted the cooperation on issues within the framework of international organisations, particularly the United Nations and the Organisation of Islamic Cooperation. ’\n\nBoth countries reiterated their shared commitment to “strengthening the solidarity of the Muslim Ummah and upholding the true values of Islam”, calling on the international community to combat “all forms of intolerance”, including Islamophobia and xenophobia.\n\nThe leaders also discussed threats to peace and security in the region. In this regard, they both reaffirmed their commitment to a peaceful and stable Afghanistan, as well as condemning the ongoing genocide in Gaza and reiterating their support for the Palestinian people’s right to self-determination and the establishment of a Palestinian state.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/07114707bee27fe.webp",
  "retrievedAt": "2025-10-16T20:45:46.814Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947200/pm-shehbaz-receives-honorary-phd-in-leadership-governance-from-malaysian-university",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T06:38:54.000Z"
}
