{
  "title": "AJK ‘back to normal’ after week-long strike - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Despite heavy downpour since early morning, normal life returned to Azad Jammu and Kashmir (AJK) on Monday, following the conclusion of a six-day shutter-down and wheel-jam strike by the Jammu Kashmir Joint Awami Action Committee (JKJAAC).\n\nMarkets were abuzz with shoppers, banks were swarmed by cus­­tomers, and roads in major towns, particularly Muzaffa­rab­­ad, rem­ained choked with long qu­­eues of vehicles throughout the day.\n\nAttendance in government of­­fices — thin last week due to the unavailability of public transpo­rt and non-use of official vehicles — was reported to be near normal.\n\nThe biggest crowds, however, were witnessed at banks, which had technically remained open during the lockdown, but saw little or no activity. Government and private sector employees thro­n­g­­ed the branches to withdraw their long-delayed salaries, while pensioners stood in queues for cash.\n\nMany ATMs were either empty or out of order, having not been replenished for days due to the uncertain situation. Ironically, fe­­­­deral minister Ahsan Iqbal, a member of the federal negotiating team, was also seen returning empty-handed last Thursday eve­ning after trying his luck at four different ATMs in the capital.\n\nEven those using mobile banking apps faced disappointment as internet and data services had been drastically throttled during the week, disrupting electronic transactions.\n\n“I had money in my account but no way to access it,” said Rakhshanda Maqbool, a schoolteacher, expressing frustration after finally withdrawing her salary on Monday.\n\nWith fresh cash in hand, cro­wds also poured into grocery sto­res and markets, where sales far exceeded the usual day’s turnover. Many households had run out of food supplies during the weeklong closure, while shortages of medicines and household goods had also deepened.\n\n“Today’s footfall was extraordinary,” said Zafar Mir, owner of a local grocery chain. “People were desperate to restock after a week of uncertainty and shortages.”\n\nPharmacies, though technically exempt from the shutdown, had also remained largely closed. Faisal Javed, owner of a leading pharmacy in Muzaffarabad, said, “We had to call in all our staff to­­day. Many customers prefer buying medicines only from us, and they had been waiting for days.”\n\nEducational institutions, too, regained their usual hustle and bustle, with students returning to classrooms after an unplanned break.\n\nMeanwhile, a meeting of 16 government secretaries was held under the chairmanship of AJK Chief Secretary Khushhal Khan to review implementation of the decisions reached in the agreement between the federal ministers and the JAAC.\n\n“We have already moved a summary for cabinet approval of the agreement,” Mr Khan told Dawn. “A reference has also been sent to the Ministry of Kashmir Affairs for ratification by the federal cabinet.”\n\nHe confirmed that all detained JKJAAC activists had been released.\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/071740399a9fd7a.webp",
  "retrievedAt": "2025-10-12T13:12:32.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947125/ajk-back-to-normal-after-week-long-strike",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:31:43.000Z"
}
