{
  "title": "Balochistan High Court clears way for Quetta LG elections - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan High Court on Monday dismissed all petitions filed by various petitioners regarding local government elections, delimitation and census in Quetta, and directed the Election Commission of Pakistan (ECP) to complete the election process in the provincial capital as soon as possible in accordance with the law.\n\nA two-judge BHC bench comprising Justice Iqbal Ahmed Kasi and Justice Muhammad Najamuddin announced the reserved verdict after completing the hearings and arguments from the petitioners’ lawyers.\n\nThe court observed that the complaints and legal questions raised in all the petitions were of a similar nature; therefore, a single verdict was issued for all.\n\nThe petitioners had contended that the ECP committed serious irregularities in the delimitation of Quetta district, adversely affecting the interests of rural areas.\n\nDirects ECP to complete the electoral process early\n\nThey argued that the delimitation, based on the 2017 census, was in violation of the Constitution, Elections Act 2017, and Balochistan Local Government Act 2010. They claimed that rural areas such as Sariab, Panjpai, and nearby localities had been unjustifiably included in the urban limits, which they described as unnecessary and unfair.\n\nRepresentatives of the government and ECP informed the court that the delimitation process falls entirely under the jurisdiction of the Election Commission under the Elections Act, while conducting the census is the responsibility of the Pakistan Bureau of Statistics.\n\nThe court was informed that the Balochistan government had issued the necessary notifications under the Local Government (Amendment) Act 2022 in compliance with the court’s earlier directives issued in 2022.\n\nIn its judgement, the BHC observed that delimitation is a fundamental and indispensable step to ensure fair representation in elections. It said that maintaining the balance and integrity of the vote is the foundation of every electoral system.\n\nThe court held that the power of delimitation constitutionally lies within the domain of the ECP, and judicial interference at this stage is unwarranted unless a clear violation of law or overreach of authority is proven.\n\nThe court found no merit in the arguments challenging the delimitations based on the 2017 census. It noted that the Council of Common Interests (CCI) had approved the 2023 census on Aug 5, 2023, while the delimitation process had already begun prior to that.\n\nThe court observed that the petitioners had failed to file formal objections against the delimitations before any competent forum, nor had they presented evidence to show that any voter had been deprived of the right to vote.\n\nWhile dismissing all pending petitions, the court directed the ECP to complete the election process promptly and in accordance with the law. All interim orders issued in 2023 were also withdrawn.\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:12:31.726Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947119/balochistan-high-court-clears-way-for-quetta-lg-elections",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:31:49.000Z"
}
