{
  "title": "Dar says ex-senator Mushtaq Ahmad to return on Thursday, with Pakistan embassy in Amman - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar said on Tuesday that former Jamaat-i-Islami (JI) senator Mushtaq Ahmad, who was detained by Israel last week after it intercepted a flotilla of boats carrying aid for Gaza, had arrived at the Pakistan embassy in Amman, Jordan and was in “good health and high spirits”, adding that he would return on October 9.\n\nAhmad led the Pakistani delegation on the 45-vessel Global Sumud Flotilla (GSF), which left Spain last month to break Israel’s blockade of aid to Gaza with activists and politicians, including Greta Thunberg, on board. However, as it approached Gaza, Israeli forces intercepted it, detaining the activists on board before deporting them.\n\nIn a post on social media platform X, Dar said, “I am pleased to confirm that former senator Mushtaq has been released and is now safely with [the] Pakistan embassy in Amman. He is in good health and high spirits.”\n\nHe said that the embassy stood ready to facilitate his return to Pakistan at his wish.\n\n“[I] am pleased to extend our gratitude to all our friendly countries who actively engaged and assisted in this behalf,” he said.\n\nIn a post later in the day, Dar said he spoke to Ahmad on arrival in Islamabad from Malaysia.\n\n“Senator Mushtaq is fine and in high spirits. I lauded the courage and steadfastness of senator Mushtaq for being part of the Sumud Flotilla in support of the Palestinian cause, to break the siege to deliver humanitarian aid to the people of Gaza. Senator Mushtaq thanked for the efforts made by the Pakistan Foreign Office in reaching out to him in Tel Aviv, Israel through a friendly European country’s mission there and for the full support and facilitation for his stay and safety in Amman by Pakistan Embassy.\n\n“Arrangement has been by the Pakistan Foreign Office for return of senator Mushtaq to Pakistan on October 9.”\n\nMeanwhile, Ahmad also posted a video on his X account in which he stated that the fight against the Israeli blockade was not over.\n\n“I have reached Jordan along with 150 of my companions,” he said, adding that he had finally been released from Israeli detention.\n\n“During this time, our hands were cuffed behind our backs, our feet were shackled and chained, we were blindfolded, dogs were set upon us, guns were pointed at us, and we were tortured in the worst way,” he said.\n\nHe said that the activists went on a hunger strike for three days, adding that they were denied access to air, drinking water, medication, and were not allowed to lie down.\n\n“We have been freed,” he said. “And the fight for Palestinian freedom will continue. We will break this blockade. We will go again and again. We will make efforts to save Gaza, and those who are complicit in this genocide — those criminals will be punished,” he asserted.\n\nHe emphasised that the fight would continue “from Adiala jail to Israeli jails”, promising that he would return to Pakistan soon and provide a detailed account of his time on the flotilla as well as in Israeli detention.\n\nOn Sunday, the Foreign Office (FO) said it was actively engaged with international partners to ensure the “safety and prompt repatriation“ of Pakistanis detained by Israel. With regards to Ahmad, it had stated: “We have been further advised that, in accordance with local legal procedures, [former] senator Mushtaq will be presented before a court. Upon the issuance of deportation orders, his repatriation will be facilitated on a fast-track basis.”\n\nOn Monday, FO reiterated that it was making efforts for the safe return of the former senator.\n\n“With the invaluable assistance of the Jordanian government, we are hopeful that the process can be successfully concluded within the next couple of days,” the FO had said. It had also expressed deep gratitude to the “brotherly” government of Jordan for “their exemplary cooperation and generous support”.\n\nPakistan and several other countries had condemned Israel’s “dastardly attack” on the GSF. Prime Minister Shehbaz Sharif had also called for the release of those detained by Israel.\n\nOn Oct 3, he had assured JI chief Hafiz Naeemur Rehman during a telephone conversation that the government was actively engaged in efforts to secure the safe return of Pakistani nationals, including Ahmad.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/071408065efb64b.webp",
  "retrievedAt": "2025-10-16T20:45:43.974Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947218/dar-says-ex-senator-mushtaq-ahmad-to-return-on-thursday-with-pakistan-embassy-in-amman",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T09:22:27.000Z"
}
