{
  "title": "The trouble with the Arabs - World - DAWN.COM",
  "author": null,
  "content": "TO be sustainable, Donald Trump’s peace plan for Gaza must serve the core interests of Arabs, including Christian Arabs, and the Jews of Palestine/Israel equally and fairly. Infirmities in the plan include the history of the Trump-Netanyahu axis to lure quarries with syrupy promises into death traps, as they did with Iran and Qatar. The trust deficit is thus an overarching challenge.\n\nSuppose the hostages were released, as the plan envisages — and it is way past the time they were since their living or dying is immaterial to Netanyahu’s murderous Hannibal Doctrine. What if Israel, with Trump’s support, then launches another widely expected attack on Iran? The discourse would change, wouldn’t it? And the idea of peaceful coexistence would in all likelihood be back to square one. This has happened before. People have won Nobel Prizes by promising Arab-Israeli peace. Why must this one be different, given that Trump and Benjamin Netanyahu are the key players?\n\nAlready, components of the genocidal ruling coalition in Israel see it as their religious duty to spit on Christians whose faces they get close to. They deal more viciously with Muslims, of course, whose lands they covet and claim ownership of through a dodgy and supremacist religious edict. The festering strife suits global hegemons. A potential trigger could be a Russian and Saudi agreement to step up oil production with adverse fallout for American hydrocarbon businesses. An Israeli-Iranian shootout would cynically staunch a potential oil glut.\n\nThe flip side is that interdiction of oil flows would hand Russia a windfall. As the slaughter in Gaza showed, the region is enduring deeper ethnic polarisation. Britain mastered the use of religion and race to divide and rule, something it successfully carried out in Ireland before unleashing devastating experiments in Asia and Africa. The 1917 Balfour Declaration was timed to check the spread of Bolshevism in the Middle East. The antidote would forcibly truncate Palestine on religious grounds. Along the way, Lyndon Johnson loosened JFK’s tight leash on Israel to recraft the Zionist state as America’s unsinkable ship in the Mediterranean. The ties have never looked back.\n\nTrump’s Gaza plan is deemed to have the approval of Saudi rulers, though they are visibly absent from the negotiations. The prospect of Riyadh turning the settler colonial state into an equitable space for all three inhabitants of old Palestine would be tantamount to a miracle. Egypt, whose military dictatorship is funded by Riyadh as a quid pro quo for keeping the lid on the Egyptian hub of the religio-nationalist Muslim Brotherhood, is representing the paymaster in the talks with a grudging Netanyahu-led Israel.\n\nBefore the events of Oct 7, 2023, Hamas was deemed a threat to Arab regimes more than to Israel. Netanyahu had reportedly aligned with Qatar to shore up hard-line Hamas as a foil to a moderate two-state-accepting Fatah.\n\nWas the Fahd plan a sleight of hand, an illusion, or the bus the Arabs missed?\n\nThe plan was jolted when Muslim Brotherhood won the 2012 presidential elections in Egypt in the footsteps of Hamas outvoting Fatah in 2006. Both elections were cancelled by the West whose habit of dissolving uncomfortable democracies is legendary. The Anglo-American overthrow of Mohammad Mosaddegh’s elected government in 1953 in Iran reinstated the Shah as the first blow in the murky politics of oil.\n\nIsrael’s prompting later foiled a religio-nationalist victory in the oil-rich former French colony of Algeria. Secular allies of the former USSR were next. Iraq, Libya and Syria were dismantled at Israel’s behest, with Saudi Arabia playing the staging post in all cases.\n\nWhy then did the Saudis conjure a charming proposal on the Palestinian question in 1981? Was it to pre-empt the tide of mass fervour the Iranian Revolution threatened to unleash against incipiently anti-Palestinian Arab regimes?\n\nThe Saudis unveiled their plan at the 1981 Fez summit of Arab leaders. It was barely two years into the Khomeini phenomenon. The threat became more dire when the Ayatollah met Yasser Arafat at his home in Tehran and set up an elite military guard called the Quds Force named after Jerusalem, sacred to Muslims.\n\nThe Cold War was peaking as Crown Prince Fahd unveiled his proposals to the tense Fez meeting. For the first time in Arab discourse, it included the implicit recognition of Israel. Predictably, Iraq, Syria and Libya rejected Fahd’s implied two-state solution.\n\nRemember, in 1973, Saudi Arabia was leading the Arab oil embargo against US support for Israel. Shortly thereafter, the king who led the protest was shot dead by a royal nephew. The new incumbent promptly rowed back from a future stand-off with Israel. Trump’s so-called municipal deal for a greatly abridged Palestinian homeland is rooted in the Arab rulers’ fear of Palestine. It’s a slippery slope for both sides. The Zionist press is projecting Trump as a headscarf-wearing Hamas protégé and Netanyahu as a traitor to the cause of a ‘Greater Israel’.\n\nWas the Fahd plan a sleight of hand, an illusion, or the bus the Arabs missed? Consider the treasure on offer to decide: 1) Israel to withdraw from all Arab territory occupied in 1967, including Arab Jerusalem. 2) Israeli settlements built on Arab land after 1967 to be dismantled, including those in Arab Jerusalem. 3) A guarantee of freedom of worship for all religions in the holy places. 4) An affirmation of the right of the Palestinian Arab people to return to their homes and compensation for those who do not wish to return. 5) The West Bank and the Gaza Strip to have a transitional period under the UN’s auspices for a period not exceeding several months. 6) An independent Palestinian state should be set up with Jerusalem as its capital. 7) All states in the region should be able to live in peace in the region. 8) The UN or its member states to guarantee the carrying out of these provisions.\n\nThe writer is Dawn’s correspondent in Delhi.\n\njawednaqvi@gmail.com\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e472f911e7b.png",
  "retrievedAt": "2025-10-16T20:45:50.158Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947142/the-trouble-with-the-arabs",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:56:12.000Z"
}
