{
  "title": "One trekker dead, hundreds rescued from Everest blizzard - World - DAWN.COM",
  "author": null,
  "content": "BEIJING: Hundreds of trekkers stranded by an unseasonal blizzard near the eastern face of Mount Everest in Tibet have been guided to safety by rescuers after unusually heavy snow and rainfall pummelled the Himalayas, Chinese state media reported.\n\nSome 350 trekkers had reached the small township of Qudang, while rescuers had made contact with more than 200 others still in the mountains, state broadcaster CCTV reported on Sunday. An evening news bulletin on Monday provided no further updates on the rescue operation.\n\nThe visitors were in the remote Karma valley, which leads to the eastern Kangshung face of Everest, taking advantage of an eight-day National Day holiday in China, which brought hundreds to the area this week.\n\n“It was so wet and cold in the mountains, and hypothermia was a real risk,” said Chen Geshuang, who was part of an 18-strong trekking team that made it to Qudang.\n\nLocals say blizzard in October is highly unusual; claim to have ‘never encountered such weather’ so suddenly during peak season\n\nThe severe weather, which began on Friday evening, was a shocking and dangerous turn for what is normally a peak trekking season.\n\n“The weather this year is not normal. The guide said he had never encountered such weather in October. And it happened all too suddenly,” Chen said.\n\nChen’s party descended from the mountains on Sunday and was greeted with sweet tea by villagers after enduring a harrowing evening of heavy snowfall combined with thunder and lightning.\n\nAn earlier report by state-backed Jimu News said nearly 1,000 people had been trapped by the storm. Hu­­ndreds of local villagers and rescue teams were deployed to help clear snow blocking access to the area.\n\nThe remaining trekkers will arrive in Qudang in stages under the assistance of rescuers organised by the local government, CCTV reported.\n\nThe CCTV report did not say if local guides and support staff for the various trekking parties had all been accounted for.\n\nRegional havoc\n\nSnowfall in the valley, which lies at an average elevation of 4,200 metres (13,800 feet), began on Friday evening and persisted throughout Saturday.\n\nThe Karma valley, first explored by Western travellers a century ago, is a relatively pristine part of the Everest region. Unlike the peak’s arid north face, it boasts lush vegetation and untouched alpine forests, fed by meltwaters from the Kangshung glacier at the foot of the world’s highest mountain.\n\nIt was unclear if trekkers near the north face, which draws large numbers of tourists due to its easy access by paved road, had been affected by the weather.\n\nOctober is typically a peak trekking season, when skies usually clear at the end of the Indian monsoon, offering clear views and stable conditions. The severe weather has caused havoc across the broader Himalayan region. To the south of Tibet in Nepal, heavy rains triggered landslides and flash floods that have blocked roads, washed away bridges and killed at least 50 people since Friday. Thirty-seven of those people died in separate landslides in the eastern Ilam district bordering India.\n\nA South Korean trekker died in Nepal, and his body was recovered by a rescue helicopter on Monday, said Tulsi Gurung, president of the Nepal National Mountain Guides Association. His guide was rescued.\n\nThe hiker, whose name was not released, had climbed the 6,476-metre (21,246-foot) Mera Peak on Saturday.\n\nPublished in Dawn, October 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e468bb93cdb.jpg",
  "retrievedAt": "2025-10-12T13:12:32.436Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947124/one-trekker-dead-hundreds-rescued-from-everest-blizzard",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T01:31:43.000Z"
}
