{
  "title": "Ambassador Hashmi stresses upon commitments to reduce carbon emission",
  "link": "https://www.app.com.pk/national/ambassador-hashmi-stresses-upon-commitments-to-reduce-carbon-emission/",
  "date_published": "2024-04-13T07:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP): Ambassador of Pakistan to Nepal Abrar Hashmi said that developing nations like Pakistan and Nepal bore the brunt of carbon emissions largely produced elsewhere in the world and urged the developed countries to fulfil emission reduction commitments.\n“Pakistan has been active in international negotiations, advocating for measures like the Loss and Damage Fund. Collaboration with Nepal is crucial in leveraging scientific knowledge to mitigate these impacts,” the ambassador said during an interview with Radio Nepal on Saturday.\nThe ambassador said that melting of glaciers in the Himalayan and Karakoram ranges presented serious risks like floods, droughts, and water shortages for both the nations and beyond.\nPakistan, with its diverse zones and seasonal changes, faced these challenges and had experienced devastating floods due to rapid glacier melt in recent years, he added.\n“Pakistan and Nepal, with negligible emissions compared to our populations, need collective action from major emitters. We must highlight this injustice on global platforms for effective climate policy,” the ambassador stressed.\nTo a question, Ambassador Hashmi said that improved connectivity was key to realizing the full potential of their relations, adding initiatives like reviving direct flights via national flag carriers and facilitating private airlines could enhance trade and tourism.\nHe further said that South Asian Association for Regional Cooperation’s (SAARC) progress had been significant, yet more needed to be done. “Addressing developmental disparities and resolving internal issues are critical. Our shared history and civilizations provide a strong basis for revitalizing SAARC’s role in regional cooperation,” Radio Nepal quoted the ambassador as saying.\nAmbassador Hashmi, to another query, replied that cricket offered a great avenue for cooperation. Bilateral series, exchanges at all levels, and collaborative programmes between their cricket boards could benefit Nepal’s cricketing journey, he opined.",
  "retrievedAt": "2025-08-11T01:49:34.778Z"
}
