{
  "title": "Polio victim contributing in fight against climate change, plans to travel 400 cities to plant saplings",
  "link": "https://www.app.com.pk/national/polio-victim-contributing-in-fight-against-climate-change-plans-to-travel-400-cities-to-plant-saplings/",
  "date_published": "2024-04-13T14:12:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 13 (APP): A young polio victim performing as role model for countrymen in ongoing fight against increasing threats of climatic changes has decided to embark on a countrywide travel by visiting 400 cities with the objective of planting saplings and spreading awareness about importance of increasing green cover.\n“The objective of countrywide visit is to convey message about pressing need of planting trees to reduce the impacts of climate changes in shape of devastating floods, erratic rains, global warming, heat wave,” said Khizar Wali Chisti, a young teacher of 32 years age who is a polio victim and walks with the support of crutches with a mission of planting 10 million trees in the country with his hands.\n“I have set the target of planting 10 million trees in the country and so far succeeded in planting more than 150,000 saplings,” said Khizar whose left leg is paralyzed due to polio.  Talking to APP from his hometown, Pak-Patan, Khizar Wali Chisti informs that he is arranging funds to purchase a heavy vehicle for carrying of sapling in different parts of the country.\nThe countrywide journey is tentatively scheduled to start in June 2024 during which Khizar Wali will visit different cities and meet with public to inform them about growing threats posed by climatic changes.\nPakistan is ranked among top ten in the list of most vulnerable countries due to climate induced disasters and the disastrous flood of 2022 is an eye opener for all the countrymen, Khizar opined.\nKhizar also spent recently passed holy month of Ramzan and religious festival of Eid in plantation of trees in different cities of Punjab. During Razman, I visited Lahore and besides planting different trees also planted a Miyawaki forest in the city, he told APP.\nAround a couple of months earlier, Khizar Wali organized Fourth Annual National Tree Festival in Pak-Patan wherein experts from across the country were invited who apprised visitors about importance of planting indigenous trees and tips about kitchen gardening.\nBeing a teacher, Khizar Wali Chisti also tries to create awareness among people about importance of increase in green cover. If heat wave continues to increase with the same pace and temperature kept on around or more than 50 degree celcius in major parts of the country, how people will bear it and there will be crisis of very serious level for mitigation of which we have to work jointly by creating awareness and taking practical measures, he added.\nThere is a need for creating awareness among all sections of society because people from top to bottom and of all ages are getting affected from climatic changes, Khizar stressed. Khizer has formed a group in name of `Green Oasis’ on social media platform for creating awareness about importance of increasing green cover.\nHe upload all his activities regarding planting of trees at different locations on social media with the objective of awareness of his followers spreading in different parts of the world. Apart from environment friendly services, Khizar also concentrates on welfare oriented activities by arranging free health camps, collecting funds for education of poor children and feeding of birds and animals.\nBeing a victim of polio, Khizar Wali Chisti also spreads message regarding importance of vaccination of children against the crippling disease. He said he understands harshness of disability and don’t want to see any other facing the same problems being faced by him and in this connection inform people about importance of immunization of children against polio disease.\nIn response to a question, Khizar said disability caused by polio cannot hinder him from continuing his misssion of increasing green cover of the country broiling due the impacts of global warming.",
  "retrievedAt": "2025-08-11T01:49:33.128Z"
}
