{
  "title": "Health expert advises parents to get polio drops for their children’ healthy future",
  "link": "https://www.app.com.pk/national/health-expert-advises-parents-to-get-polio-drops-for-their-children-healthy-future/",
  "date_published": "2024-06-07T06:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP):Health expert Friday advised that the parents should not pay any attention to rumors regarding the polio vaccine to save them from permanent disability and to cooperate with the polio teams so that the polio virus could be eradicated from\nChild Specialist Dr Nasir Rana, speaking to a private news channel, urged the religious scholars, media, and clerics to play their role in convincing the parents to get their children administered the anti-polio vaccine.\n“It is our religious, moral, and social responsibility to save our future generations from this crippling disease, he said, adding that we have to make Pakistan free from polio.”\nHe said, “Polio vaccination has no negative impacts, as proved by research conducted by religious doctors and physicians.”\nHe said, “Eradication of polio from the country is the responsibility of every citizen, adding that the incidence of polio has been reduced to only a few areas of the country.”\n“There is still a dire need to further educate people living in remote areas to create awareness among the masses about the crippling disease,” he stressed.\nThe federal and provincial governments and district administrations were working on war footing to make the country polio-free, he added.\nPolio drops were safe, and the citizens should not fall prey to false propaganda, he emphasized.\n“Polio is a highly infectious disease caused by poliovirus, mainly affecting children under the age of five. It invades the nervous system and can cause paralysis or even death,” he said.\n“While there is no cure for polio, vaccination is the most effective way to protect children from this crippling disease,” he added.\n“Each time a child under the age of five is vaccinated, their protection against the virus is increased,” he further highlighted.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:04:52.442Z"
}
