{
  "title": "Rai Muhammad Akbar Named Director General of Workers Education",
  "link": "https://www.app.com.pk/national/rai-muhammad-akbar-named-director-general-of-workers-education/",
  "date_published": "2024-06-07T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP): Rai Muhammad Akbar, been appointed as the Director General of the Directorate of Workers Education following the approval from the Prime Minister on Friday.\nAccording to a notification from the Ministry of Overseas Pakistanis and Human Resource Development, Rai Akbar, previously serving as director, is a diligent officer of the Ministry with over two decades of experience in worker education.\nLast year, he satisfactorily finished the required senior management training course at the National Institute of Management.\nIn an interview, Roy Akbar, Director General of Workers Education, emphasized the critical role of workers in country’s economy.\nHe stressed the significance of educating and training them, particularly those going abroad, to enhance production performance. This, he noted, is crucial for Pakistani workers to outperform their regional counterparts and contribute more significantly to the country’s foreign exchange earnings.\nThe government’s top priority is raising awareness about occupational health and safety among domestic workers. A healthy and accident-free workforce is crucial for optimal performance. Additionally, legislation addressing this issue is actively being pursued by the government of Pakistan.\nThe Pakistan Workers Federation has expressed approval of Rai Akbar’s appointment as Director General of Workers Education.\nChaudhry Yasin, Secretary General of the Federation, commended the government’s choice. It’s important to highlight that the Directorate of Workers Education operates under the Federal Ministry of Overseas Pakistanis and Human Resource Development, focusing on training workers on diverse topics.",
  "retrievedAt": "2025-08-11T03:03:15.501Z"
}
