{
  "title": "Musical performances held at PNCA to pay tribute to legendary artists",
  "link": "https://www.app.com.pk/national/musical-performances-held-at-pnca-to-pay-tribute-to-legendary-artists/",
  "date_published": "2024-06-07T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP): To pay rich tributes to the legendary singers in the world of music, Madam Noor Jehan and Mehdi Hassan as well as renowned composer, A. Hameed, the famous singers and musicians gathered at Pakistan National Council of the Arts (PNCA) Thursday evening to present their captivating performances.\nThese tributes underscore the lasting legacy of these artists in the music world, highlighting their unparalleled contributions and the deep respect they received across generations.\nThe outstanding performances by the famous artists including Mehmooda Qamar, Hassan Abbas, Salman Adil, Muhammad Ali, Gulshan Jahan and Raees Muhammad mesmerized the audience while taking them back to glorious era of Mehdi Hassan, Noor Jehan and A. Hameed.\nOn the occasion, Professor Shehbaz presented a speech written on the contribution of Mehdi Hasan while Hasan Raza through a speech shared his thoughts on the personality and contributions of Noor Jahan.\nRizwan Hameed spoke about the huge contributions of A. Hameed who composed a variety of songs and gained immense recognition in the Pakistani film industry.\nThe evergreen songs “Yeh Wadiyan-Yeh Parbatoon ki Shehzadiyan” and “Zindagi Mein tu Sabhi Payar Kia Karty Hain” received huge round of applause from the audience with many started dancing.\nDirector General, PNCA, Muhammad Ayoub Jamali and other senior official were also present on this occasion.\nSpeaking on this occasion, Ayoub Jamali said that the importance of music cannot be denied.\nHe said that these three legendary figures contributed a lot for the music and film industry of Pakistan, setting such an elevated standard which was difficult to achieve by the others in this field.\nAyoub Jamali said that arranging musical programmes on frequent basis is an integral part of PNCA’s activities.\n“Such occasions provide an opportunity to artists, singers and musicians to exhibit their skills and entertain the audience.\nThe audience were of the view that the singers like Noor Jehan and Mehdi Hassan are like institutions for the young budding singers to learn music.\nA large number of music lovers participated in this memorable program.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:04:02.679Z"
}
