{
  "title": "China, Pakistan agree to upgrade CPEC, advance development in second phase",
  "link": "https://www.app.com.pk/national/china-pakistan-agree-to-upgrade-cpec-advance-development-in-second-phase/",
  "date_published": "2024-06-07T15:33:00.000Z",
  "source": "APP",
  "content": "BEIJING, Jun 7 (APP): Prime Minister Muhammad Shehbaz Sharif and Chinese President Xi Jinping Friday held a productive meeting, reaffirming the consensus to high-quality development of China Pakistan Economic Corridor (CPEC) and timely completion of major ongoing projects.\nThe two leaders also affirmed consensus on up-gradation of the CPEC and advancing the development of the mega project in the second phase.\nThe prime minister briefed President Xi on Pakistan’s policies for economic reform and sustained growth, industrial development, agricultural modernization and regional connectivity and the critical role played by CPEC in Pakistan’s development.\nHe asserted Pakistan’s commitment to high-quality development of CPEC and to foster synergy between the development strategies of the two countries through close coordination.\nThe meeting between the two leaders was held here at the historic Great Hall of the People. The two leaders were accompanied by the Federal Ministers and senior officials.\nThis was the first meeting of PM Shehbaz with the President of China since assuming office in 2024. The meeting was marked by traditional warmth reflective of the ironclad friendship and close strategic ties between the two countries.\nThe prime minister thanked President Xi Jinping for the warm and gracious welcome accorded to him and his delegation in China. He recalled the historic visit of the President Xi Jinping to Pakistan in 2015 when the China Pakistan Economic Corridor (CPEC) was formally operationalized marking a new chapter in the bilateral relationship.\nThe two leaders reaffirmed the time-honored ‘All-Weather Strategic Cooperative Partnership’ and expressed the resolve to further deepen cooperation across diverse domains ranging from political and security to economic, trade, and people-to- people exchanges.\nThey also exchanged views on regional and global developments including Afghanistan, Palestine and South Asia including the serious human rights situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). The two sides reiterated their longstanding support on each other’s issues of core interest.\nCommending President Xi’s visionary Belt and Road Initiative (BRI) and Global Development Initiative (GDI), the prime minister underscored that as the flagship project of BRI, China Pakistan Economic Corridor (CPEC) had significantly contributed to Pakistan’s socio-economic development.\nHe underlined Pakistan’s commitment and full support for safety and security of Chinese nationals, projects and institutions in Pakistan.\nHe underlined that the government’s agenda for people centric, socio-economic development resonates with the concept of ‘shared prosperity’ embraced by China.\nPresident Xi Jinping also hosted a banquet in honour of the prime minister , where another round of discussion on different matters of mutual interests was held.",
  "retrievedAt": "2025-08-11T03:03:37.783Z"
}
