{
  "title": "Strong coordination, collective approach emphasised to counter global warming, heat wave: Romina",
  "link": "https://www.app.com.pk/national/strong-coordination-collective-approach-emphasised-to-counter-global-warming-heat-wave-romina/",
  "date_published": "2024-06-07T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP): PM’s Coordinator on Climate Change & Environmental Coordination Romina Khurshid Alam emphasized on strong coordination and collective approach among the federal government and all the provinces to deal with global warming and heat wave effects in the country.\nShe was chairing the first meeting of the task force constituted by the prime minister to propose measures to address the effects of global warming and heat wave and stressed upon the sensitivity of the issue adding that actions need to be initiated on war footing, a news release said.\nHigh-level Inter-departmental Working Group on forest fires apprised the meeting that from May 17 to June 5 2024, total 13 fires erupted in Margalla Hills National Park and adjoining areas which affected 77.58 Hectare area. The vegetation affected in that area include small trees, scrubs, shrubs and chir pine.\nIt was apprised to the forum that well-coordinated response was launched to control these fires by the Ministry of Climate Change, NDMA, Pakistan Army, PAF and CDA. However, the Chairperson raised concerns on the lack of fire beaters availability to firefighters.\nThe Member Operations NDMA presented their strategy to combat heat wave effects adding that they have completed simulation exercise to combat upcoming moon soon spell.\nWhile highlighting the unprecedentedly longer duration heat wave in country, Pakistan Meteorological Department apprised the meeting that except GB all provinces would receive above normal rainfall in upcoming moon soon.\nProbability of urban flooding can’t be ruled out, he said in response of a question. It was also apprised that besides above normal rainfall, temperatures this year would also be higher which would cause more snow melting that on one hand fulfill the water shortage need and on the other hand rise the threats of lake outbursts in northern areas.\nMinistry of Water Resources apprised the chairperson, there is zero shortage of water and every province taking its share according to index.\nMembers of Task Force from AJK and GB while sharing their concerns and recommendations appreciated the formation of Task Force and invaluable ideas received during the meeting.\nThe chairperson, while highlighting the issues of women in disaster-hit areas, stressed on setting up local community’s committees wherein inclusion of women should be ensured who could approach needy women inside their homes to meet their hygienic needs.\nShe directed Ministry of Information Broadcasting to ensure effective awareness in collaboration with PEMRA before any disaster.\nShe also advised to establish a dashboard with the cooperation of ministry of information technology where all data would be readily available for all stakeholders to take timely action.\nWhile concluding the meeting, the Chairperson directed all stakeholders to submit their recommendations in writing before next meeting.",
  "retrievedAt": "2025-08-11T03:03:39.361Z"
}
