{
  "title": "Pakistan, China resolve to protect CPEC from detractors; ensure projects’ timely completion",
  "link": "https://www.app.com.pk/national/pakistan-china-resolve-to-protect-cpec-from-detractors-ensure-projects-timely-completion/",
  "date_published": "2024-06-07T09:30:00.000Z",
  "source": "APP",
  "content": "BEIJING, Jun 7 (APP):Pakistan and China on Friday expressed their firm commitment to protect the China-Pakistan Economic Corridor (CPEC) from its detractors and adversaries,\nbesides ensuring high-quality development and timely completion of its all ongoing projects.\nThe bilateral ties and cooperation were discussed in the delegation-level talks between Prime Minister Muhammad Shehbaz Sharif and Chinese Premier Li Qiang at the Great Hall of the People. The prime minister was accompanied by key members of his cabinet.\nA welcome ceremony was arranged in honour of the prime minister on his arrival at the Great Hall of the People.\nDuring the talks, the two leaders discussed the entire spectrum of bilateral relations, and regional and global developments of mutual interest.\nThey noted that the Pakistan-China All-Weather Strategic Cooperative Partnership was characterized by mutual trust, shared principles and strategic convergence.\nPremier Li congratulated Prime Minister Shehbaz Sharif on Pakistan’s election as a non-permanent member of the United Nations Security Council.\nThe two leaders reaffirmed unwavering support for each other on core issues, and expressed continued commitment and support for the high-quality development of CPEC.\nThey also emphasized the timely completion of all ongoing projects with a special focus on industrial development, agriculture modernization, science and technology, and development of Special Economic Zones for mutually beneficial and socio-economic development of Pakistan.\nThe two sides discussed the significance of Gwadar as an important pillar of the CPEC and agreed to expedite the timely completion of all related infrastructure projects to transform it into a regional economic hub.\nThey also expressed their firm commitment to protect the CPEC from its detractors and adversaries, and to upgrade it in the form of enhanced cooperation.\nPrime Minister Shehbaz reaffirmed Pakistan’s unflinching resolve to ensure the safety and security of Chinese personnel and projects in Pakistan.\nThe two sides agreed to maintain high-level exchanges, including strengthening institutional linkages at all tiers and in all spheres of bilateral cooperation. Pakistan and China would also continue to consult closely on issues of regional and global significance and multilateral fora, especially during the two-year tenure of Pakistan as a non-permanent member of the UN Security Council.\nThe delegation-level talks were followed by an MoU signing ceremony, witnessed by Prime Minister Muhammad Shehbaz Sharif and Premier Li Qiang. The two sides signed 23 memorandums of understanding (MoUs) and agreements deepening cooperation in transport infrastructure, industry, energy, agriculture, media, health, water, socio-economic development and others of mutual interest.\nThe meeting was followed by an official banquet hosted by Premier Li Qiang in honour of PM Shehbaz.\nMeanwhile in his social media post on X, the prime minister said during his meeting with the Chinese premier, he had a detailed discussion on all areas of mutual interest, including bilateral as well as regional and global developments.\n“Reaffirmed our shared desire to further strengthen the Pakistan-China All-Weather Strategic partnership and upgrade CPEC in the form of enhanced cooperation. Noted with satisfaction the steady progress of CPEC which is now moving to its second phase.”\nHe also thanked Premier Li for his kind remarks about his government, and said they witnessed the signing of bilateral MoUs and agreements in various fields.\nPM Shehbaz said he extended a warm and cordial invitation to Premier Li to visit Pakistan.\n“Proud of our friendship with China which draws strength from the hearts of our peoples and their shared desire for peace progress and prosperity,” he concluded.",
  "retrievedAt": "2025-08-11T03:04:06.767Z"
}
