{
  "title": "Govt mulling over fast-track completion of Sukkur-Hyderabad motorway critical route: Riaz Pirzada",
  "link": "https://www.app.com.pk/national/govt-mulling-over-fast-track-completion-of-sukkur-hyderabad-motorway-critical-route-riaz-pirzada/",
  "date_published": "2024-06-07T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP): Minister for Housing and Works, Mian Riaz Hussain Pirzada on Friday informed the Upper House of the Parliament that the government was mulling over various options to ensure fast-track completion of Sukkur-Karachi Motorway as a critical connectivity route.\nThe minister was responding to Senators Jam Saifullah Khan, Zamir Hussain Ghumro, Muhammad Aslam Abro, Poonjo And Syed Kazim Ali Shah, calling attention notice to draw attention of the minister for communication towards inordinate delay in completion of Sukkur-Hyderabad Motorway.\nMian Riaz Pirzada said Sukkur-Karachi route was a missing link near most populated and fertile areas of Sindh province that extremely need a developed connectivity route.\nHe mentioned that after Covid-19 due to economic crunch, the contractor gave up the project that led to delay in completion of the project. The government, he said the government was working out opportunities under CPEC investment, and public-private partnerships with friendly countries like UAE, and Saudi Arabia to invest in developing the project in three parts to complete it at an expedited pace.\nPirzada urged the chair to refer the matter to the committee for an oversight of the House on the matter whereas the government efforts were focused on developing the project within six months.\nHowever, Senator Jam Saifullah prior to putting the agenda before the House condemned the killing of local journalist Nasarullah Gadani in Ghotki and gave his message to all law enforcement agencies (LEAs) that this house was monitoring the situation and demanded efficient probe as per law.\nHe regretted the absence of the minister for communications and said the Peshawar-Karachi Motorway was launched in 2013 by then Prime Minister Nawaz Sharif but only Multan-Sukkur component was completed. “The heaviest traffic is coming from Karachi to Hyderabad and Hyderabad to Sukkur and there have been many life losses in unfortunate incidents,” he added.\nHe urged the government to hold accountable all who impeded the project’s progress and urged the chair to send the matter to the committee. Multan to Sukkur Part was built as per international standards whereas the rest was ignored, he alleged.\nSenator, Zamir Hussain Ghumro said the Sukkur- Karachi traffic was massive life losses were reported on the route, whereas it was inaugurated earlier and should be completed to provide better travelling facilities to the masses.\nSenator, Aslam Abro said Sindh direly needed motorway to promote development and it was need of the hour to address the inferiority complex among Sindhis that they were ignored by the federal capital in mega development initiatives.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:04:02.584Z"
}
