{
  "title": "Pakistan Post releases stamps featuring Kashmir markhor",
  "link": "https://www.app.com.pk/national/pakistan-post-releases-stamps-featuring-kashmir-markhor/",
  "date_published": "2024-06-07T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP):Pakistan Post in collaboration with WWF-Pakistan issued stamps showcasing Kashmir markhor to conserve and protect the markhor population and their habitats in the country.\nThese stamps were released during the launching ceremony organized at the Pakistan Academy of Sciences building here on Friday, a news release said.\nAccording to experts, the Kashmir markhor in this region faces threats that jeopardize its survival.\nThe major threats to the markhor population include habitat loss, agricultural expansion, illegal hunting, climate change, and infrastructure development. These threats have led to a drastic decline in Markhor population across its habitat range.\nConsidering multiple challenges to the markhor population, experts call for comprehensive conservation efforts to protect and preserve this iconic species.\nThe markhor declared the national animal of Pakistan is a large wild goat species native to South Asia and Central Asia, mainly existing in Pakistan, India, the Karakoram range, parts of Afghanistan, and the Himalayas. Since 2015, It has been classified as Near Threatened on the IUCN Red List. Often based on their horn configuration, markhor has been divided into five sub-species namely Astor markhor, Bukharan markhor, Kabul markhor, Kashmir markhor, and Suleiman markhor.\nSpeaking on the occasion, Hammad Naqi Khan, Director General, WWF-Pakistan said that this postage stamp not only celebrated the existence of Kashmir markhor but also highlighted the need for concerted conservation efforts to safeguard their future. This initiative also aimed to draw attention to the species threatened status and the pressing need for habitat preservation and anti-poaching measures.\nHe further said that the issuance of a postage stamp dedicated to the Kashmir markhor would serve as a reminder of our collective responsibility to protect and preserve our natural heritage for future generations.\n“It will also provide a platform to showcase Pakistan’s commitment to wildlife conservation on the global stage,”\nRizwan Hashmi, Additional Director General, Pakistan Post said that our country is home to rich biodiversity including Indus river dolphin, whales, common leopard, snow leopard, and many resident and migratory birds.\nThis postage stamp about Kashmir Markhor expresses government commitment to raising awareness and protecting this threatened species which is confronted with different challenges.\nHashmi further shared that it is essential to promote collaborative conservation initiatives that help address the threats to wildlife and take on-ground actions. He appreciated the role of communities in the protection of the markhor species in Pakistan.\nAs true goats of the Himalayas, the Kashmir markhor is the most spectacular among wild goats, distinguished by its large body, long spiralling horns, thick fur, and a flowing beard and neck ruff. It is widely spread from Afghanistan to Pakistan, Azad Jammu and Kashmir, and Indian occupied Jammu and Kashmir.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:04:01.706Z"
}
