{
  "title": "Balochistan unveils new era of youth development",
  "link": "https://www.app.com.pk/national/balochistan-unveils-new-era-of-youth-development/",
  "date_published": "2021-04-01T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 01 (APP): Balochistan unveils new era of youth development amid beefed up sports, recreation facilities.\nThe Balochistan government had spent Rs 20 billion in the period of three years for improving sports and recreation facilities across the province to bring the youth towards sports and channel their talent in healthy activities, official source said on Thursday.\nThe provincial government has been working on development of 79 schemes in sports sector of the province and the projects would be completed in near feature.\nThe Balochistan government had allocated more than Rs 8 billion to establish international level sports complex at every district of the province to provide world class sports facilities to the youth.\nOn the direction of Chief Minister Jam Kamal Khan, the government was working on timely completion of sports complexes and stadiums in every district of the province.\nThat new sports complexes with huge gymnasium, all indoor sports, squash, cricket nets, dedicated walking track and others facilities would be established in every city of the province to encourage youth to actively take part in sports.\nThe Balochistan government has planned to select young players from across the province for the “Chief Minister’s Youth Talent Programme” to promote new talent, equipped with innovative abilities.\nUnder the initiative, the young players would be selected for the national games.\nHe said the sportsmen from 536 tehsils of Balochistan would be selected on merit.\nThe government had earmarked Rs 600 million for the construction of playgrounds in the\nQuetta city, adding that work on construction of 61 football stadiums in the province was in final stages.\nQuetta is bracing to get six more sports complexes and stadium to provide world class playing facilities to the masses.\nThe government is also working to set up indoor sports complexes in the province so that the youth could participate in co-curricular activities besides educational one.\nHe said the government was encouraging girls to actively participate in sports activities to exhibit their abilities to the world, adding that they were supporting the youth of Balochistan.\nThe province had the honour to produce international players who brought laurels to the country and the government would create more opportunities and provide facilities to the sportsmen for representing the country.\nBalochistan government has initiated work on 27 various development projects of sports sector in the province during current fiscal year.\nThe government has organized 7 nation events in Balochistan including Turbat and Gwadar Jeep Rallies, all Balochistran Hokey and Football cups, boxing event in Quetta.\nThe Balochistan government would establish boxing academy to bring forward the local talent.\nThey were providing full support to the youth of Balochistan to exhibit their abilities to the world.\nRs 1,372 million has also been allocated for constructing football stadiums in five municipal corporations and at 56 municipal committees of the province,\nThe government would also be establishing special grounds for females so that they could participate in sports activities.\nThe government was preparing to organize more events of sports and cultural related activities in the province.",
  "retrievedAt": "2025-08-11T20:34:19.619Z"
}
