{
  "title": "Italian envoy calls on Chief Justice of Pakistan",
  "author": null,
  "content": "ISLAMABAD, Feb 17 (APP):Marilina Armellin, Ambassador of Italy to Pakistan, paid a courtesy call on the Chief Justice of Pakistan, Mr. Justice Yahya Afridi, at the Supreme Court Building here Monday.\nDuring the meeting, both the dignitaries discussed matters of mutual interest, focusing primarily on judicial cooperation and the exchange of best practices between the two countries.\nThe Chief Justice briefed Ambassador Armellin on Pakistan’s constitutional framework, highlighting the trichotomy of power among the three pillars of the State Legislative, Executive, and Judiciary.\nThe CJP emphasized the Judiciary’s mandate is to interpret the law, underscoring its critical role in maintaining balance among these branches.\nAmbassador Armellin noted the similarities between Italy’s and Pakistan’s judicial systems, citing opportunities for mutual learning through judicial education and exchange programs under existing bilateral cooperation frameworks.\nWelcoming these proposals, Chief Justice Afridi remarked, that the exchange programs facilitated by the Ministry of Foreign Affairs would enrich judicial practices and foster deeper understanding between the institutions.\nThe Chief Justice informed the delegation about the upcoming reforms initiatives, specifically creation of “Commercial Litigation Corridor”. This means dedicated courts at district level and dedicated benches at High Courts level and Supreme Court of Pakistan in order to fast track commercial and trade disputes resolution. The purpose of creating special corridor is speedy disposal and early resolution commercial and trade related cases. This is likely to create most stability in implementation of commercial contracts and boost economic activity.\nHe also informed that after the meeting of National Judicial Policy Making Committee (NJPMC) policy initiative matrix will be shared with development partners to pick up activities of their respective choices and accommodating them within the framework of their ongoing or expected programs.\nAmbassador Armellin lauded the proposal, emphasizing that efficient commercial dispute resolution would encourage increased investment and help revitalize the national economy.\nThe meeting concluded on an optimistic note, with both sides expressing readiness to further strengthen cooperation.\nChief Justice reiterated the Judiciary’s commitment to transparency and public engagement in judicial reforms, while Ambassador Armellin underscored Italy’s interest in fostering deeper people-to-people ties highlighting the significant role of the Pakistani diaspora in Italy.\nAs a gesture of goodwill, Chief Justice presented a souvenir to Ambassador Armellin, who reciprocated by offering a memento to the Chief Justice, symbolizing the strong ties between Pakistan and Italy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:49:33.484Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/italian-envoy-calls-on-chief-justice-of-pakistan/",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T12:43:00.000Z"
}
