{
  "title": "Pakistan could benefit from Russia’s shift towards the global south, Experts Say",
  "author": null,
  "content": "ISLAMABAD, Feb 17 (APP):Experts believe that Pakistan stands to gain from Russia’s increasing focus on diversifying relations with states in Asia, Africa, and the broader Global South, as a result of the ongoing Ukraine war.\nThese views were shared at an event on Russia-Iran Comprehensive Strategic Partnership, organized by the Institute of Regional Studies in Islamabad, said a press release here on Monday.\nDr. Igor Matveev, a Professor at the Department of International Business, Financial University in Moscow, discussed the evolving dynamics of Russia-Iran relations, particularly in the context of the Syrian Civil War.\nHe explained that the fall of Bashar al-Assad in Syria played a crucial role in fostering a treaty partnership between Russia and Iran.\nHowever, Dr. Matveev also pointed out that while both countries shared a mutual interest in Syria, each pursued its own regional goals, with Russia sometimes being accused of prioritizing other issues, such as its dealings with Turkey and Libya, over Syria.\nElaborating on the nature of the Comprehensive Strategic Partnership between Russia and Iran, Dr. Matveev stated that the agreement covers a wide range of areas, from defense cooperation to economic collaboration.\nHowever, he noted that it was too early to determine whether this partnership was a strategic move.\nHe emphasized that both Russia and Iran were likely to prioritize their respective regions—Russia with Ukraine and Iran with the Middle East.\nMeanwhile, Mr. Fraz Naqvi, Head of the Iran Program at IRS, argued that Russia’s shift towards the Global South might lead it to seek similar strategic partnerships with other nations, particularly in South Asia.\nHe noted that if India were to formalize a comprehensive strategic partnership with Russia, it could significantly alter the status quo in the region.\nMr. Naqvi also pointed out that this shift offers an opportunity for Pakistan to strengthen its bilateral ties with Russia.\nAs Russia seeks to enhance its relationships in South Asia, the Middle East, and Africa, Pakistan could leverage this new geopolitical alignment to its advantage, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:49:07.421Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-could-benefit-from-russias-shift-towards-the-global-south-experts-say/",
  "dateList": "2025-02-17",
  "date_published": "2025-02-17T13:14:00.000Z"
}
