{
  "title": "Overcoming a bleak tariff situation - Business - DAWN.COM",
  "author": null,
  "content": "Reciprocal US tariffs are altering the dynamics of global trade partnerships, making it critical for Pakistan to gauge the stakes and craft a multi-pronged policy response across time horizons. Over the first 10 months of FY25, Pakistan’s exports to the United States totalled $4.46 billion, while imports from the US were valued at $2.05bn.\n\nAccording to the World Trade Organisation (WTO) tariff profile, Pakistan levies a trade-weighted average tariff of 7.2 per cent on all inbound goods, whereas the US applies a comparatively higher average tariff of 10.7pc on its imports from Pakistan.\n\nApplying these tariffs, the US collected $321 million in tariff revenue on Pakistan exports, while Pakistan earned $219m in tariffs on American imports. Although Pakistan enjoys a positive trade balance, the US garners a greater fiscal gain, collecting approximately 32pc more in tariffs over the 10-month span.\n\nThe impending hike in US tariffs to 29pc as part of the reciprocal trade policy is set to escalate the overall tariff burden — especially for the textile industry, which constitutes 77pc of Pakistan’s export volume to the US — but it could also offer competitive market openings for Pakistan in certain segments as higher tariff walls encumber rival exporting nations, most notably China (50.1pc), Vietnam (46pc), and Bangladesh (37pc).\n\nWhile India remains a formidable rival, particularly in the textile sector, buoyed by a slightly lower reciprocal tariff rate (26pc), this competitive edge can be effectively neutralised through well-orchestrated strategic policy interventions.\n\nThe impending US duty hike is set to escalate the overall burden, but it could also offer competitive market openings\n\nThough the rationale for imposing additional tariffs is anchored in the trade deficit narrative, the United States Trade Representative (USTR) outlined a spectrum of concerns pertaining to its commercial dealings with Pakistan; key grievances include the continued practice of issuing discretionary and non-transparent statutory regulatory orders (SROs), cumbersome & inconsistent import and customs valuation methods, and opaque procurement processes, all of which the United States contends have collectively hurt its exports.\n\nThis rise in the US tariffs, in the immediate term, is likely to suppress demand for Pakistan’s textile exports in the American markets, threatening to ripple through the entire production cycle, leading to production slowdowns, wide-scale layoffs to the tune of half a million jobs, especially in urban areas, and putting pressure on Pakistan’s already fragile foreign exchange coffers.\n\nThese adverse impacts could be further exacerbated by mounting competitive pressure from India, which — due to relatively lower US tariffs and vast economic scale — is better positioned to accommodate reduced pricing margins and secure more favourable trade terms from Washington.\n\nPakistan ought to strategically leverage this opportunity to correct its long-overdue structural trade imbalances with other countries, particularly with China & Gulf countries, by pursuing an import rationalisation strategy grounded in a Pakistan-first trade stance. This realignment would create the policy space necessary for extending concessions to the US in pursuing a more diplomatically and economically palatable trade accord.\n\nIn the period from July to March FY25, China ranked as Pakistan’s top import partner, accounting for a whopping 28.83pc of total imports, while contributing just 7.78pc to Pakistan’s exports. Similar asymmetric bilateral trade is observed with the United Arab Emirates (exports: 5.40pc, imports: 10.6pc), Saudi Arabia (exports: 2.33pc, imports: 7.16pc), Indonesia (exports: 1.03pc, imports: 6.68pc), and Qatar (exports: under 1pc, imports: 6.22pc).\n\nThese trade imbalances with Gulf States are primarily fuelled by crude oil and petroleum product imports, whereas those with China are mainly driven by chemicals, machinery, and electronic equipment.\n\nAs such, a primary strategic response would be to diversify supply sources by channelling part of these imports, such as cotton and soybeans, through the United States.\n\nTo respond to the USTR’s major policy and procedural concerns, Pakistan should strengthen its regulatory credibility by ensuring that the application of SROs is transparent and supported by clear national economic necessity, institutionalising WTO-conforming customs valuation methods, and enforcing standardised review mechanisms.\n\nOver the long haul, policymakers should pursue a strategic blend of export diversification and improving industrial productivity and competitiveness. This involves broadening the export base across product and market frontiers at both domestic and international levels.\n\nIn tandem, increasing the competitiveness of the domestic industrial landscape by making targeted investments in cutting-edge manufacturing technologies, building human resource capacities, and modernising logistics systems will be critical to positioning Pakistan as a more agile, resilient, and competitive economy in the rapidly evolving world economic order.\n\nThe writer is a professor at the University of Sindh.\n\nPublished in Dawn, The Business and Finance Weekly, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:57:36.337Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922707/overcoming-a-bleak-tariff-situation",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:04:01.000Z"
}
