{
  "title": "Nepra, KE put on notice in petition against loadshedding - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court (SHC) on Monday issued notices to the secretary of Power Division, National Electric Power Regulatory Authority (Nepra) and K-Electric (KE) on a petition filed against prolonged loadshedding in the city.\n\nA two-judge bench of the SHC, comprising Justice Muhammad Faisal Kamal Alam and Justice Muhammad Hasan Akber, also put a federal law officer on notice for July 25. It also directed the regional head of Nepra to be in attendance at the next hearing.\n\nNine chairmen of as many town municipal corporations (TMCs) and a member of City Council, all belonging to the Jamaat-i-Islami (JI), have moved the high court against prolonged loadshedding being carried out by the KE in hot and humid weather in the city and inaction on the part of the regulatory authority against the sole power utility.\n\nAt the outset of hearing, the counsel submitted that before moving the SHC, the petitioners had approached Nepra against the KE over prolonged and excessive loadshedding. However, the regulatory authority had not taken any action so far apart from issuing a notice to the power utility on May 6, he added.\n\nHe also maintained that the KE was carrying out up to eight hours of loadshedding in the respective constituencies of the petitioners.\n\nNine JI town chairmen ask SHC to declare policy of planned outages ‘illegal’\n\nAfter a preliminary hearing, the bench in its order said, “Issue notice to the respondents as well as learned DAG, by all modes including electronic made except publication, for 25.07.2025. The regional head of the respondent No. 2 Nepra in Karachi, shall be in attendance on the next date of hearing”.\n\nThe chairmen of nine TMCs — New Karachi, Liaquatabad, Gulberg, Nazimabad, North Nazimabad, Model Colony, Gulshan-i-Iqbal, Jinnah Town and Landhi — as well as a member of the City Council have filed the petition, asking the SHC to declare the KE’s loadshedding policy illegal and unconstitutional.\n\nThe petitioners submitted that after receiving several complaints of public, Nepra had conducted an inquiry against the prolonged loadshedding in the city and it transpired that loadshedding was being carried out by the KE in pursuance of its Aggregate Technical and Commercial (At&C) Losses Policy in proportion to the losses being incurred by the KE in each area.\n\nHowever, they also contended that the regulatory authority had passed an order in April last year declaring the AT&C losses policy not in line with the Nepra Act, 1997 and Performance Standards (Distribution) Rules, 2005 as well as illegal.\n\nNepra had also held that it was the responsibility of the KE to ensure equitable and uninterrupted distribution of electricity services in its territory. It also imposed a fine of Rs50 million on the city’s sole power utility, they maintained.\n\nThe petitioners also submitted that the superior courts had time and again held that access to electricity was part of right to life as enshrined under Article 9 of the Constitution, but the policies of the KE materially infringed upon such a right of the residents of Karachi.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/05104035e0ff372.jpg?r=104101",
  "retrievedAt": "2025-08-17T19:56:59.614Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922677/nepra-ke-put-on-notice-in-petition-against-loadshedding",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:04:15.000Z"
}
