{
  "title": "X blasts India ‘censorship’ order on thousands of accounts - World - DAWN.COM",
  "author": null,
  "content": "Social media platform X said on Tuesday it was “deeply concerned” after the Indian government ordered it last week to block 2,355 accounts, including two Reuters news agency accounts.\n\nMany of the blocked accounts were restored hours later, with New Delhi specifically denying its role in the takedown.\n\nIndia, the world’s biggest democracy, regularly ranks among the top five countries for the number of requests made by a government to remove social media content.\n\n“On July 3, 2025, the Indian government ordered X to block 2,355 accounts in India, including international news outlets like @Reuters and @ReutersWorld,” X’s Global Government Affairs team said in a statement, shared on its platform.\n\nIt said that India’s Ministry of Electronics “demanded immediate action —within one hour — without providing justification, and required the accounts to remain blocked” until further notice.\n\nThe accounts were taken offline late on Saturday, but had resumed operations by Sunday.\n\n“Non-compliance risked criminal liability,” said X, the platform owned by Tesla boss Elon Musk and formerly known as Twitter.\n\n“After public outcry, the government requested X to unblock @Reuters and @ReutersWorld,” it added.\n\n“We are deeply concerned about ongoing press censorship in India due to these blocking orders.”\n\nRights groups say freedom of expression and free press are under threat in India since Hindu nationalist Prime Minister Narendra Modi took office in 2014.\n\nNew Delhi has regularly imposed blanket internet shutdowns during periods of unrest.\n\nIndia in April launched a sweeping crackdown on social media, banning more than a dozen Pakistani YouTube channels for allegedly spreading “provocative” content following an attack in Kashmir.\n\nNew Delhi has also imposed intermittent internet outages in the northeastern state of Manipur since 2023 in the wake of ethnic violence.\n\nNew Delhi has justified internet and social media bans as ways to curb disinformation in a country where hundreds of millions have access to some of the cheapest mobile internet rates in the world.\n\nX said it was “exploring all legal options available” but added that it “is restricted by Indian law in its ability to bring legal challenges”, it said.\n\n“We urge affected users to pursue legal remedies through the courts,” it added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:55:09.452Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922842/x-blasts-india-censorship-order-on-thousands-of-accounts",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T14:10:15.000Z"
}
