{
  "title": "Street economies — the invisible engine - Newspaper - DAWN.COM",
  "author": null,
  "content": "When people talk about urban economies, they often seem to focus more on the obvious, such as luminous high-rises, industrial parks, large infrastructure, and all those formal investments that show up on government dashboards.\n\nBut let’s be honest, particularly in cities across the Global South, that’s only half the story. The real buzz, the real hustle, often hums along in the narrow lanes, the roadside stalls, the open-air repair shops, and the ever-moving handcarts. That’s where rickshaw drivers, mobile phone fixers, street tailors, fruit vendors, and countless others keep the city alive. And yet, these people (despite holding up entire urban economies) are rarely seen in policy documents or GDP calculations.\n\nIt is not some fringe issue, either. As of 2023, per the International Labour Organisation’s World Employment and Social Outlook report launched in 2024, over two billion people around the world were working informally. That is nearly 58 per cent of the global labour force. Even though the percentage dipped slightly from 2015, the actual number of informal workers has never been higher. In developing economies, this sector contributes anywhere from 15pc to 35pc of GDP, according to the World Economic Forum; that is massive.\n\nConsider Pakistan: around three-quarters of the national workforce operate outside formal structures. In urban centres, about 69pc of workers are in the informal sector. And while this sector accounts for roughly a third of the national GDP and dominates non-agricultural employment, its productivity levels are stuck. On average, formal workers produce two to three times more than informal ones. Why? Because informal workers are often cut off from basic systems of credit, training, infrastructure and legal protection. The playing field is not just uneven; it’s tilted steeply.\n\nThat’s why when a government steps in with a policy to support informal workers, it gets attention. One recent example is the Punjab Chief Minister’s initiative to distribute “model handcarts” to street vendors in Lahore. The goal, at least on paper, seems noble, ie giving vendors a cleaner, more standardised setup, formalising their presence, reducing urban chaos, and connecting them to systems that could help them grow. So far, 1,000 carts have been rolled out in Lahore, with plans to scale across 40 districts.\n\nAnd it seems a kind of formalising street vending through structured interventions could actually change their lives. Imagine a vendor who finally gets legal recognition, who’s no longer being pushed around by municipal staff or harassed by extortionists, and who can now apply for a loan or access a support programme. That’s a big deal.\n\nAbout 69pc of urban workers operate informally, cut off from basic infrastructure and legal protection\n\nBut (there’s always a ‘but’) things start to fall apart when the execution doesn’t match the intent. Unfortunately, some news reports have emerged of shady procurement practices, bribes being demanded, inflated costs, and even the suspicious elimination of the lowest bidder. That kind of stuff poisons the entire effort. It turns what could’ve been a smart, inclusive policy into a textbook case of “too good to be true”.\n\nAnd here’s the problem: when well-meaning programmes like this go sideways, they don’t just fail quietly. They actively damage trust — among vendors, the public, and even future reformers. People start thinking, “Why bother?” Worse, they likely become cynical about any new initiative, no matter how genuine it might be. That’s a tough cycle to break.\n\nOf course, Pakistan is not alone in this. Around the world, some cities are getting it right — or at least trying harder. Micro-enterprise zones are popping up, offering proper spaces for vendors with access to sanitation, lighting, and storage. Governments try to roll out digital platforms so informal workers can register, get loans, and tap into markets.\n\nPublic-private partnerships help with skill training and certification. Even financial inclusion is getting a boost through microloans and flexible credit designed for low-income entrepreneurs. These aren’t just policy wins — they’re real changes that lift people up.\n\nBut the catch is we must track what’s working. Are more vendors getting legal status? Is there more municipal revenue from these newly formalised businesses? How many are getting access to microcredit? If we’re not measuring outcomes, we’re just making noise.\n\nGoing back to Punjab’s handcart initiative, the real takeaway is that good ideas need clean execution. Vision alone doesn’t cut it. We need transparency in procurement, genuine participation from vendors, and public accountability embedded into the implementation process. Without that, even the best ideas end up feeling hollow, or worse, performative.\n\nMaybe that is the broader lesson here. Informal workers are not just an issue to be “dealt with” in urban planning. In many ways, they are the urban economy. They are the ones who keep cities functional when everything else falters — during floods, blackouts, and economic downturns.\n\nThey’re an affordable option when formal services become unaffordable. Ignoring them or sidelining them is a massive strategic blunder. Instead, governments and planners need to shift perspective.\n\nWhat if we treated informal workers not as outliers but as partners in development? What if policies were designed with them and not just for them? At the end of the day, real change comes when ambition meets accountability.\n\nThe writer is an urban economist from Pakistan, currently based in the Middle East, focusing on urban economic development, macroeconomic policy, and strategic planning.\n\nEmail: dr.moheyuddin@gmail.com | X Handle: @moheyuddin\n\nPublished in Dawn, The Business and Finance Weekly, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:56:00.743Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922729",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:04:01.000Z"
}
