{
  "title": "PTI, Muqam spar over ex-Fata Jirga committee - Pakistan - DAWN.COM",
  "author": null,
  "content": "• KP rulers say Centre encroaching on provincial domain, seeks immediate dissolution of reforms body\n• Muqam says no plan to roll back merger; federation has ‘responsibility to solve provincial problems’\n\nISLAMABAD: As a committee formed by the prime minister to bring reforms in the ex-Fata region met on Monday, the PTI leaders called out the federal government for alleged attempts to roll back the merger of the tribal districts, with the committee convenor Amir Muqam shooting down these claims as exaggerated.\n\nThe committee was formed last month apparently to revive the ‘jirga system’ in Khyber Pakhtunkhwa for an ‘effective alternate dispute mechanism’.\n\nIt is supposed to examine proposals for the revival of the jirga system and strengthening of the civil administration in the province. Headed by PML-N’s Amir Muqam, its members are Law Minister Azam Nazeer Tarar, Planning Minister Ahsan Iqbal and Interior Minister Mohsin Naqvi.\n\nThe PTI, however, boycotted the Monday meeting and held a press conference instead, rejecting the committee as a “blatant constitutional violation” and “a political stunt to undermine provincial autonomy”. It said the body should be dissolved immediately. The PTI said the Centre through its actions was undermining provincial autonomy and asked the federal government to focus on paying over Rs700 billion owed to tribal districts.\n\nIn a joint press conference, PTI interim chairman Barrister Gohar Ali Khan, flanked by party leaders Shah Farman, Sheikh Waqas Akram, and Iqbal Afridi, said that this was the second meeting of the ‘jirga committee’, but 14 out of 17 MPAs from ex-Fata were not part of the proceedings. He said this was a direct violation of constitutional and democratic rights.\n\nThe PTI leaders reiterated that following the 25th Constitutional Amendment, Fata had been merged into Khyber Pakhtunkhwa and must be governed through its elected provincial representatives, not the federal nominees. Former KP governor Shah Farman warned against attempts to revive the colonial-era governance system, such as the draconian Frontier Crimes Regulation (FCR).\n\n“The federal government is staging all this drama to reassert control, using tools like the Mines and Minerals Bill to hijack provincial resources,” he alleged.\n\nIqbal Afridi, a former MNA from the tribal region, accused the federal government of fiscal discrimination. “Islamabad is taxing the people of Fata without providing them with their due share of funds and the new committee headed by a federal minister has no legal standing: it must be dissolved immediately,” he added.\n\nMr Akram said the committee was an attempt of intimidation. “This is not consultation—it’s coercion. The real ‘jirga’ already exists in the form of elected representatives. Fata’s people know how to protect their rights,” he stated.\n\nHowever, PML-N’s Muqam, who heads the committee, hit back at the PTI in a press conference after the second meeting of the body. The Kashmir Affairs, Gilgit-Baltistan & States and Frontier Regions minister refuted the allegations that the government was planning to take back the administrative control of Fata from KP.\n\n“Talks about ending the Fata merger are not true; FCR was a cruel and outdated law, and it was abolished by the PML-N,” he said, and emphasised that the merger should move forward under a unified national vision.\n\nHighlighting the role of the federal government, the PML-N leader noted that, “Although it is being said this was a provincial matter, the federation has a responsibility to help solve provincial problems too.”\n\nThe minister commented that the Jamiat Ulema-i-Islam (JUI-F) representatives had participated in the committee meeting and said that JUI-F had its own position regarding the tribal districts. “But the goal should be collective national progress and it was disappointing that the PTI remained absent from the meeting; this is not responsible behaviour,” he added.\n\n“Their members confirmed the participation in last night’s communication but later changed their minds, as the PTI members participated in the previous committee meetings they should have come to present their stance this time too,” he added.\n\nMr Muqam also clarified that the 18th Amendment was not being abolished, adding that the federal government wanted to work for Fata’s development within the current system.\n\nIn response to a question about whether the Centre planned to topple the KP government, the minister stated, “There is a time for everything, everything can happen — but there is no such plan for now.”\n\nThe erstwhile Fata comprised Bajaur Agency, Mohmand Agency, Khyber Agency, Orakzai Agency, Kurram Agency, North Waziristan Agency and South Waziristan Agency, which were converted into tribal districts and merged with Khyber Pakhtunkhwa in 2018 through a constitutional amendment. Before that, these agencies were semi-autonomous regions administered directly by the federal government under the FCR.\n\nIkram Junaidi also contributed to this report\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2018/05/5b0fc9abd56ff.jpg?r=505399505",
  "retrievedAt": "2025-08-17T19:58:09.535Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922671/pti-muqam-spar-over-ex-fata-jirga-committee",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:03:43.000Z"
}
