{
  "title": "Edhi: A life less ordinary - DAWN.COM",
  "author": null,
  "content": "This article was originally published on July 8, 2016.\n\nHere is a tribute one always expected to write. Dreaded, but expected. Because one knew nobody, not even Edhi sahib, the one true permanent fixture of life in Karachi, can live forever. And yet, where does one begin?\n\nHow does one write about true greatness? When it seems everyone already has remarkable stories to share about Abdul Sattar Edhi. In my lifetime, I have not come across anyone who touched so many lives in so many different ways. What can then one say that does not sound trite and predictable?\n\nIn the face of a persona that is as much of a Colossus — straddling ethnic, class and religious divides — one is forced to fall back on personal recollections of a personality that was the opposite: humble, supremely matter-of-fact, ordinary, very, very human.\n\nAlso read: Edhi’s eyes become source of vision for two blind persons\n\nI became aware of the man at quite a young age. My mother first interviewed Edhi sahib and his steadfast partner Bilquis Edhi for a magazine she was bringing out in the early 1980s.\n\nShe still recalls his childlike enthusiasm when he found out my mother was interested in palmistry. She wanted to see what kind of lines someone like him, who’d devoted his entire life to caring for others, had. I remember her bringing home his hand-prints, made with the ink of ordinary office stamp pads. She still has them somewhere.\n\nThe next time I heard about them (because Bilquis was inseparable from Abdus Sattar) was when my mother went to them to facilitate an adoption for close friends.\n\nMy mother told me about two Edhi drivers who had been fired by Edhi sahib in front of her that day, for eating with the poor they were delivering food to in a settlement.\n\nIn my mind at the time, they were other-worldly. How could someone be as invested in the happiness and well-being of people they barely knew?\n\nWhen I entered the field of journalism, Edhi was the go-to source for information about any disaster. Karachi was in turmoil, an army operation was on, people were dying left and right. Sometimes a building had collapsed.\n\nIt was the easiest thing in the world to contact the Edhi Centre because they were always accessible, always willing to corroborate or correct official figures.\n\nMost journalists had the Edhi Centre on speed-dial. Everyone trusted Edhi’s figures because it was Edhi and his workers who were removing the debris, Edhi ambulances that were ferrying the injured or picking up the dead, and often burying them.\n\nAlso read: Edhi — The exception to Pakistan's faults\n\nMy first substantive interaction with Edhi sahib was over three days in 1997 when I convinced him to allow me to shoot sequences of him for a video I was working on. He was initially reluctant – and most certainly nothing like the photo-hounds that some engaged in social work are.\n\nI wanted to film him, he wanted me to film his workers and his centres. Eventually we reached a compromise, I’d shoot both.\n\nIt was a hectic shoot because Edhi had no interest in adhering to our schedules. He’d go about his daily routine and if we wanted we could tag along. The maximum allowance I had was to capture him on a walkabout through the streets of Meethadar where his office was located.\n\nOn the streets here, people spontaneously raised their hands to their foreheads to say salaam to him or came to hug him. It barely registered for him.\n\nIn between our shooting, during down-times while the filming crew recuperated or had lunch, I’d sit and talk to him. What I discovered during those frank and very candid discussions was a completely matter-of-fact man.\n\nNot for him the romanticisation of poverty of Mother Teresa, not for him the resignation of the religiously minded, of trusting things to God’s will. He had practical answers for everything and he was very clear in his thoughts — a clarity born out of decades of working with the most disenfranchised, the most neglected in society.\n\nIn fact, if anything made him bitter it was how some mullahs had perverted the spirit of religion with literal interpretations. He would rail many times about how the clergy only created problems for other people, never helped those in need. Sometimes, he’d suddenly remember how his statements could affect his work and drop his voice to tell me not to repeat what he’d said publicly. For the most part, I haven’t ever.\n\nI found it ironic that for someone commonly referred to as a ‘maulana’ (religious scholar), he had no time for the rituals of religion. At times he was an agnostic, at times a fiery socialist, and yet, he embodied in himself all the best parts of his Muslim faith as well.\n\nThrough Bilquis I learned a different side of him. For her he was the obstinate, sometimes uncaring husband who was more obsessed with his office than home.\n\nShe was interested in watching films but he never went with her. She could be bitter too, recalling once how when their own grandson had tragically died in a fire accident, he’d left to go pick up bodies from somewhere else.\n\nAnd yet, she’d never once wavered from the work they had undertaken together, or from her loyalty to him. Together they presented as human a couple as you could imagine to find.\n\nOver the years, I had plenty of other occasions to see both Edhi sahib and Bilquis Edhi, some for reasons that shall remain unrecounted here; each time it was like visiting grandparents.\n\nThere was always something more important to do. Understandable, given the huge empire of services he’d constructed.\n\nAnd yet, a story my brother told me encapsulated perfectly why people universally loved and trusted him.\n\nWhile covering an earthquake in Balochistan for the BBC, my brother came across Edhi sahib who was providing tents and health services to the displaced people there, fundraising and arranging logistics for ambulances and other supplies.\n\n“When I was leaving, I gave him whatever money I had on me, around 2000 rupees, and told him I’d seen sports stores in the area, and inquired if he could buy footballs for the displaced children in the camps to play with.”\n\nMany weeks later, my brother ran into Edhi sahib again, this time covering a conference in Islamabad. Not only did Edhi remember him, he called out to him by name.\n\n“Oye Ali, idhar aao!” he yelled.\n\n“When I went over to him,” recalls my brother, “he said to me ‘I mentioned to Bilquis about the money you gave me and she said the stuff would be cheaper in Karachi and that we should buy it from there and send it back here, and that’s what we did. Just thought you should know.’”\n\nThis was a man handling millions in donations and interacting with thousands of people on a daily basis, it is no wonder then that he has left us all gobsmacked. That’s what true greatness can do.\n\nMay he rest in peace, may his amazing work continue through the institutions he built, and may we come to a point where the Pakistani state does not require more Edhis to do the work for it.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2016/07/5781ff7974650.jpg",
  "retrievedAt": "2025-08-17T19:55:49.097Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1269733",
  "dateList": "2025-07-08",
  "date_published": "2020-07-08T07:37:07.000Z"
}
