{
  "title": "Iran says it has not requested US talks since war - World - DAWN.COM",
  "author": null,
  "content": "Iran said on Tuesday it has not made any request for talks with the United States, after President Donald Trump said Tehran was seeking negotiations following last month’s war with Israel.\n\n“No request for a meeting has been made on our side to the American side,” said Iranian foreign ministry spokesperson Esmaeil Baqaei, according to Tasnim news agency.\n\nTrump said on Monday that Iran was seeking talks with the US and that they had been scheduled, without specifying the time or the location.\n\n“We have scheduled Iran talks. They want to talk,” Trump told reporters in the White House, where he was meeting with Israeli Prime Minister Benjamin Netanyahu.\n\n“They want to meet. They want to work something out. They’re very different now than they were two weeks ago.”\n\nIranian Foreign Minister Abbas Araghchi also reiterated Tehran’s position, rejecting talks at this stage.\n\n“Although Iran has in recent days received messages indicating that the US may be ready to return to negotiations, how can we trust further engagement?” the Iranian top diplomat said in a piece he wrote for the Financial Times.\n\nOn June 13, Israel launched an unprecedented bombing campaign on Iran that targeted military and nuclear sites as well as residential areas, and killed senior military commanders, nuclear scientists and civilians.\n\nThe attacks began days before a planned meeting between Tehran and Washington aimed at reviving nuclear negotiations. The talks have since stalled.\n\nThe US, which had been in talks with Iran since April 12, joined Israel in carrying out its own strikes on June 22, targeting Iranian nuclear sites at Fordow, Isfahan and Natanz. Iranian authorities say the Israeli strikes killed at least 1,060 people. Israel, in turn, was hit by waves of retaliatory drone and missile fire, which authorities said left at least 28 people dead.\n\nA ceasefire between Iran and Israel has been in place since June 24.\n\n“After agreeing to new negotiations in good faith, we have seen our goodwill reciprocated with an attack by two nuclear-armed militaries,” Araghchi, who was also Iran’s top negotiator during the talks with the US, said in the Financial Times piece.\n\n“Iran remains interested in diplomacy, but we have good reason to have doubts about further dialogue.”\n\nOn Tuesday, Iranian President Masoud Pezeshkian came under fire domestically after voicing support for renewed talks with the US, with critics accusing him of being “too soft” in the wake of last month’s attacks on the country.\n\nThe backlash followed the release of an interview with US media personality Tucker Carlson, in which Pezeshkian said Iran had “no problem” resuming talks so long as trust could be rebuilt between the two sides.\n\n“Have you forgotten that these same Americans, together with the Zionists, used the negotiations to buy time and prepare for the attack?” said an editorial in the hardline Kayhan newspaper, which has long opposed engagement with the West.\n\nThe conservative Javan daily also took aim at Pezeshkian, saying his remarks appeared “a little too soft”.\n\nIn contrast, the reformist Ham Mihan newspaper praised Pezeshkian’s “positive approach”.\n\n“This interview should have been conducted a long time ago,” it wrote, adding that “Iranian officials have unfortunately long been absent from the international and American media landscape.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/082234547cc77ec.jpg",
  "retrievedAt": "2025-08-17T19:54:41.548Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922863/iran-says-it-has-not-requested-us-talks-since-war",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T18:00:01.000Z"
}
