{
  "title": "K-Electric reappoints Moonis Alvi as CEO - Pakistan - DAWN.COM",
  "author": null,
  "content": "The board of directors of K-Electric (KE) on Tuesday re-appointed Moonis Alvi as the chief executive officer (CEO), read a statement issued by the power company.\n\n“The board of directors, in its meeting held on July 7, 2025, has re-appointed Syed Moonis Abdullah Alvi as Chief Executive Officer of K-Electric with effect from July 30, 2025,” read a press release by KE.\n\nAlvi joined KE in 2008 and has held key roles in the organisation as the chief financial officer, company secretary and head of treasury prior to his appointment as CEO in 2018, KE said.\n\n“He brings to the helm 30 years of diversified financial experience and has led the creation of a future-ready entity by emphasising digitisation, customer centricity and investments across the energy value chain,” the electricity distribution company said.\n\nIn 2020, Alvi and other senior officials of KE were booked after yet another unsuspecting citizen lost their life due to electrocution in Karachi.\n\nThe government also constituted a special committee to act as one-window operation for K-Electric and sought the removal of the top leadership of the power utility, including Alvi, over its alleged inability to ensure uninterrupted power supply and address disruptions within reasonable time after that year’s monsoon rains.\n\nHighly placed sources had said the government members on the K-Electric board of directors had pushed for the replacement of Alvi and the head of the distribution department with highly motivated professionals who could respond to difficult situations and ensure efficient service delivery. “The existing team did not take timely action,” an official said.\n\nLast year in September, Alvi finally appeared before the Sindh Assembly’s Special Committee on loadshedding and excessive billing and categorically told the provincial government to get the company’s licence cancelled and supply electricity itself.\n\nInformed sources had said that the KE CEO appeared to be an “opinionated person” and took an “aggressive stance” from the outset of the meeting, denying any prolonged loadshedding and excessive billing in Karachi.\n\nIn May, KE came under criticism for extended hours of power cuts in Karachi at a public hearing presided over by National Electric Power Regulatory Authority (Nepra) chairman Waseem Mukhtar.\n\nAlvi had said that power cuts to areas with illegal connections and low recoveries did take place, but no more than three hours.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/0311420231c1312.jpg?r=114215",
  "retrievedAt": "2025-08-17T19:55:25.736Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922828/k-electric-reappoints-moonis-alvi-as-ceo",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T11:11:09.000Z"
}
