{
  "title": "Agriculture: Farm to market — who really wins? - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan’s fruit and vegetable marketing system — regulated by the provincial governments — has evolved in a way that disadvantages both farmers and consumers.\n\nWhile farmers receive unfairly low returns for their produce, consumers pay excessively high prices. The real beneficiaries are middlemen (intermediaries), who dominate the supply chain through multiple opaque layers between farm and retail points. Ironically, these intermediaries extract hefty margins without adding any real value.\n\nIn the last week of May 2025, tomato farmers received as little as Rs10 per kilogram in fruit and vegetable markets, where their bulk produce was sold through auction. That amount was barely enough to cover daily harvesting, packaging, and transport costs, let alone crop production expenses. Meanwhile, wholesalers — known as ‘pharia’ in the market — resold the same tomatoes for Rs20 per kg, and in turn, retailers (shopkeepers and street vendors) charged consumers Rs40 to Rs50 per kg, depending on the locality.\n\nSimilarly, onion farmers earned just Rs12 per kg, while wholesalers fetched Rs22, and retailers charged up to Rs40–45 per kg, all within the same day. This exploitative pricing model is common across nearly all fruits and vegetables.\n\nMoreoever, farmers, even those not indebted to arthees, have to pay a five to eight per cent commission on sales value for mere hours of service. This seemingly minor fee erodes 20–30pc of a farmer’s net crop profit, further reinforcing a system that exploits producers and burdens consumers.\n\nLayers of intermediaries in produce-selling procedures erode farmer profits and reinforce a system that exploits producers and burdens consumers.\n\nFruit and vegetable retailing in Pakistan relies heavily on small-scale retailers with limited daily turnover. At the end of the day, they frequently find themselves with unsold perishable stock and without access to temperature-controlled storage. To offset this waste and meet daily operating costs, retailers raise prices significantly to secure a modest profit from low sales volumes.\n\nRecognising the systematic flaws in the marketing system, the provincial governments have attempted to intervene through initiatives such as Sunday Bazaars, Model Bazaars, and Farmers’ Markets. However, these efforts are poorly aligned with the farmers’ actual needs and capacities.\n\nFor most small farmers, setting up stalls in these bazaars during the short harvesting window (of a few weeks) is impractical and rarely worth the time and effort, as they are already occupied with daily harvesting, packaging, and transportation. As a result, genuine farmers are seldom present. Instead, local authorities often encourage pharia retailers to pose as farmers and resell produce purchased from fruit and vegetable markets.\n\nOther government efforts, such as private markets and model fruit and vegetable markets, are largely focused on cosmetic infrastructure upgrades and have failed to address deep structural inefficiencies.\n\nIn addition, the government focused on regulatory measures to control prices, such as notifying daily price lists for fruits and vegetables. However, its enforcement at the retail level remains weak. Even if fully implemented, these measures may offer slight relief to consumers but do nothing to improve farmers’ plight.\n\nWith the advent of information and communication technology, there was hope that technology-driven solutions would disrupt the exploitative marketing structure. However, even digital platforms, like online fruit and vegetable start-ups, have largely followed conventional models. Many vendors source produce from pharia and deliver it at retail-like prices. High delivery costs and small order sizes make it impossible for them to offer lower prices.\n\nA closer examination reveals that they consistently suffer from conceptual, design, and implementation flaws. Most remain poorly aligned with the actual needs and constraints of both farmers and consumers. As a result, middlemen remain deeply entrenched, widely regarded as a necessary evil, while both producers and consumers continue to bear the brunt of the system’s failures.\n\nGiven the current market structure, the challenges faced by both farmers and consumers, and the lessons learnt from past interventions, professionally managed farmers’ cooperatives could offer the most viable alternative to eliminate intermediaries. These cooperatives can establish and operate retail outlets for fruits and vegetables, backed by contract farming arrangements with member farmers. Such a model can enable farmers to secure fair returns while offering consumers more affordable prices.\n\nHowever, cooperatives in the agriculture sector of Pakistan have largely failed. In contrast, India has seen remarkable success. Large-sized companies like The Indian Farmers Fertiliser Cooperative Limited, one of the world’s largest fertiliser producers, and Amul, a dairy giant, are farmer-owned cooperatives in India.\n\nIn fact, the failure of cooperatives in Pakistan is, arguably, not by default but by design. Society has been intentionally divided on the basis of religion, ethnicity, language, caste, sect, and, more recently, political affiliation. These divisions serve the interests of powerful factions in the country. However, professionally managed cooperatives, led by trained employees, have the potential to rise above these divides and function effectively.\n\nKhalid Wattoo is a development professional and a farmer, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad.\n\nPublished in Dawn, The Business and Finance Weekly, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686c59915cc1b.jpg",
  "retrievedAt": "2025-08-17T19:57:38.353Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922700/agriculture-farm-to-market-who-really-wins",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:04:01.000Z"
}
