{
  "title": "Naqvi to take up visa rejection issue with UAE interior minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says business community’s issues to be resolved on priority basis\n• In meeting with Sharjeel, minister praises Sindh govt for effective Muharram security\n\nKARACHI: Acknowledging the growing number of visa rejections faced by Pakistani citizens, particularly the business community, by the United Arab Emirates (UAE) government, Interior Minister Mohsin Naqvi has said that he will raise the issue with his UAE counterpart this week and is hopeful that the matter will be resolved.\n\nHe expressed these views while talking to representatives of the Karachi Chamber of Commerce and Industry (KCCI) here on Monday.\n\nUpon his arrival at the KCCI, the minister was warmly welcomed by the office-bearers and leading members of the city’s business community, who briefed him on several issues, including law and order, street crime, water shortages, smuggling, narcotics and encroachments.\n\nThe minister assured them that the government was working hard to address all these issues on a priority basis.\n\nAbout the visa problems, he said that he will be meeting with the interior minister of the UAE a day after tomorrow and he will enlighten him about the severity of the issue.\n\nMr Naqvi highlighted the government’s efforts to improve the global ranking of the Pakistani passport. “We are proud of our green passport, and in the future, it will be a source of even greater pride.”\n\nHe also praised the performance of the Sindh police, noting that the law and order situation in the city has significantly improved compared to the past, with a noticeable reduction in crime. “If Karachi is healthy, Pakistan will be healthy,” he remarked.\n\nRegarding smuggling, Mr Naqvi said that the government has made considerable progress in curbing illegal trade. “A few years ago, even the dollar was being smuggled from here, but the situation has improved, and further measures are underway,” he said.\n\nHowever, he clarified that while smuggling had not been completely eradicated, it has been significantly reduced.\n\nHe also stressed the importance of the Safe City Project in curbing crimes, calling it a key initiative endorsed by the prime minister.\n\nHe mentioned Faisalabad as a successful model where the project has led to a decline in overall crimes and expressed his hope that similar efforts would be intensified in Karachi.\n\nOn the issue of verifying potential employees’ criminal backgrounds, the minister said the government will work with the National Database and Registration Authority (Nadra) to streamline ID and SIM card verification, enabling businesses to make informed hiring decisions.\n\nAddressing the problem of encroachments, the minister called for strict legislation, including penalties and fines, to effectively deal with the issue.\n\nBMG chairman Zubair Motiwala, vice chairman Anjum Nisar, KCCI President Javed Bilwani and others were present on the occasion.\n\nEarlier, Mr Motiwala termed land grabbing Karachi’s biggest challenge and criticised the revival of questionable police practices.\n\nHe appealed for surprise inspections of police stations and stressed police reforms, emphasising merit-based promotions and better salaries.\n\nCommissioning ceremony of new boats\n\nAlso on Monday, the interior minister attended the commissioning ceremony of two new RHIB (Rigid Hull Inflatable Boats) inducted into the Pakistan Coast Guards (PCG) fleet at Karachi Port.\n\nUpon his arrival, he was warmly received by PCG Director General Major General Jawad Riaz.\n\nThe ceremony was attended by senior military and civil officials, members of the international community and notable personalities from various walks of life.\n\nSpeaking on the occasion, the interior minister lauded the professionalism and performance of the coast guards, stating that it is the only force in the country that operates simultaneously on both land and sea to prevent smuggling, illegal immigration, and anti-trawling fishing activities.\n\nHe noted that the induction of the two new boats will significantly enhance the operational capabilities of the force and contribute to curbing illicit activities.\n\nVisits Sharjeel’s residence\n\nMr Naqvi visited the residence of Sindh’s Senior Minister Sharjeel Inam Memon.\n\nThe meeting between the two leaders included a detailed discussion on the country’s important political issues.\n\nThe meeting included a detailed discussion on the relations between the federation and the provinces, and joint efforts to ensure national peace and stability.\n\nBoth agreed that all political forces must work together to address the challenges facing the country, in the interest of national unity and public welfare.\n\nThe interior minister appreciated the security arrangements made by the provincial government and police during Muharram.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686c5737df5f7.gif",
  "retrievedAt": "2025-08-17T19:56:57.128Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922680/naqvi-to-take-up-visa-rejection-issue-with-uae-interior-minister",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:04:15.000Z"
}
