{
  "title": "PCB unveils revamped domestic structure for 2025-26 - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Cricket Board (PCB) on Monday unveiled a significantly revised domestic calendar for the 2025-26 season, featuring 522 matches across 12 competitions, with major changes made to the format and structure of the Quaid-i-Azam Trophy and other key tournaments.\n\nIn a notable shift, only eight regional sides will participate in the upcoming Quaid-i-Azam Trophy — the country’s premier first-class competition — compared to 18 in the 2024-25 season. The decision comes just a year after the PCB had introduced a new domestic structure, which was initially said to be given a constitutional cover for consistency.\n\nAccording to the PCB, the top six regional teams from last season have earned automatic qualification for the Quaid-i-Azam Trophy, while the remaining two slots will be filled through the Hanif Mohammad Trophy — a non-first-class tournament that commences on August 15 and marks the start of the new domestic season.\n\nTeams competing in the Hanif Mohammad Trophy include Faisalabad, Rawalpindi, FATA, Hyderabad, Multan, Quetta, D.M. Jamali, AJK, Larkana, and both Blues and Whites sides from Lahore and Karachi. The tournament comprises 31 matches and will be held across Karachi, Multan, Bahawalpur, and Rahim Yar Khan.\n\nThe Quaid-i-Azam Trophy is scheduled to begin on September 22 and run until November 7, featuring 29 matches. Matches will be staged across venues in Islamabad and Rawalpindi.\n\nKarachi — historically a powerhouse in Pakistan’s domestic circuit — failed to place any team in the top six of last season and will now need to qualify through the Hanif Mohammad Trophy. Similarly, Lahore Region has just one team directly qualifying, with its second side also heading into the qualifying tournament. Other automatically qualified regions include Islamabad, Peshawar, Abbottabad, Sialkot, and Bahawalpur.\n\nDespite assurances of stability, this marks yet another significant structural adjustment in Pakistan’s domestic cricket. Critics have pointed to a lack of continuity in decision-making within the PCB, with similar inconsistencies observed in coaching appointments and team leadership amid Pakistan’s underwhelming international performances across formats.\n\nSeparately, the PCB has also restructured the President’s Trophy for departments, introducing a three-tier format: Grade-I (first-class), Grade-II, and Grade-III competitions. Four departmental tournaments — including the President’s Cup (One-Day) — will be contested during the season.\n\nIn a move likely to raise concern, the PCB’s domestic calendar makes no mention of a national women’s tournament. Additionally, the three-day U-19 regional tournament, which was halted abruptly last year after the opening day, has again been excluded without explanation.\n\nMeanwhile, a qualifying round has also been introduced for the National T20. Ten teams will vie for two spots in the Super 10 stage of the tournament, scheduled to be held in Faisalabad from March 1 to 12, 2026. The already-qualified teams for the Super 10 include Karachi Region Whites, Lahore Region Whites, Peshawar, Karachi Region Blues, Sialkot, Islamabad, and Faisalabad.\n\nThe PCB said these structural changes aim to promote merit-based progression, enhance competitiveness, and provide clearer pathways for emerging talent.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/051243310c8f729.jpg?r=125024",
  "retrievedAt": "2025-08-17T19:56:26.130Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922744/pcb-unveils-revamped-domestic-structure-for-2025-26",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T02:32:10.000Z"
}
