{
  "title": "Washed away: How unregulated mining turned the Swat River into a killer - Pakistan - DAWN.COM",
  "author": null,
  "content": "There was once a time when the sound of the Swat River — gushing waters in some places, flapping waves in others — echoed across the mountainous valley. For visitors and locals alike, it was a melody that soothed the darkest of nights and harshest of days. That was years ago. Today, the river stands still and quiet under the weight of those who died in it.\n\nOn June 27, a family of 13 tourists from Sialkot drowned in the flooded Swat River. With feet soaked in the cool water, they were having breakfast on the riverbank near Mingora. Unbeknownst to them, the water level was swiftly rising, and within minutes, they found themselves stranded on a mound of sand in the middle of the river.\n\nThey stood there, waiting for help to arrive. But by the time it came, the family was swept away by the floodwaters, one by one. The deceased included seven-year-old Ayan; Rubina, 45; Ajwa, 18; Sharmeen, 16; Murab, 18; and Tazmeen, 20; from Sialkot. “They all left the house excited for a vacation, but came back home in white shrouds,” a relative mourned.\n\nEven Swat mourns. “We are ashamed,” said Fazal Wadood, a resident and member of the village defence committee.\n\nThe deaths, a video of which went viral on social media, spurred a conversation on social media — about the inefficiency of the local government, the delay in arrival of rescue services and more. But one important factor attributed to the rise in such incidents, as highlighted by locals time and again, remains missing from the discourse: unchecked gravel and sand mining on the bed of the Swat River.\n\n“It has turned our beautiful river into khandarat (ruins),” rued Wadood. “The water used to be our everything … pride, home, livelihood … but it has been reduced to a disaster now.”\n\nThe Swat River is known to be perfect for mining, given its topography. The river flows in the middle of the mountains, making it abundant in gravel and sand, which is a key component of the construction industry. It is a common practice, not just in Pakistan but across the world.\n\nAccording to activist and academic Dr Rafiullah, the mining process involves digging ditches in the river, approximately 15-20ft deep and 10-15ft wide, and letting the water fill them. When sand and gravel flow down with the water, it accumulates in these ditches, which are then extracted by changing the direction of the river and are subsequently transported to crush plants.\n\nThe mining is usually done during the winter months when the flow of the river is slow, while the extraction takes place during summer.\n\nOver the last decade, the mining industry in Swat has seen a boom, with around 350 crush plants established along the path of the 240km-long river, from Kalam to downstream Kanju. Sand is expensive in Swat with a market value of Rs7,000 per daina — a vehicle used to transport the same — while gravel is sold for Rs3,000, making mining a lucrative business.\n\n“The problem is that such ditches have been dug up everywhere, which has turned the river into a well,” Dr Rafiullah told Dawn.com. “Earlier, there was a set route of the river, and so locals were aware where it was deep and where it wasn’t. But when it was dug up, people could no longer tell this because while on the surface, the water remains still, no one knows what is happening underneath.”\n\nOver the past several years, he continued, the people of Swat have lifted their children in coffins. “They were young boys who went to the river for swimming and bathing.” One of them was Wadood’s 17-year-old nephew, whose body was found in a ditch in the town of Aligrama eight days after he had drowned.\n\nDr Rafiullah said that the incident of June 27 was also to be blamed on this unrestrained mining. “The miner had constructed a protective dyke to divert the water flow just 300-400 meters from where the family was seated, but it broke down due to flashfloods and heavy rain, increasing the water levels.”\n\n“Within minutes, the family found itself stranded in the middle of the river … the mound of sand they stood on was artificial, a result of mining. By the time anyone understood what happened, it was too late,” he regretted.\n\nEven the investigation report prepared following the incident, seen by Dawn.com, highlighted that water from the Swat River was diverted due to construction work, which allowed the tourists to venture into the river, believing that the water level was low. Subsequently, the chief secretary of Khyber Pakhtunkhwa issued orders to ban all kinds of mining.\n\nIn Swat, mining falls under the Directorate General of Mines and Minerals KP. The department has divided the river into multiple sectors, and under the Khyber Pakhtunkhwa River Protection Act 2017 and Mining of Minor Minerals from River Bed Rules 2022, it issues a yearly lease to local contractors.\n\n“A district-level committee identifies blocks for mining through site visits and then forwards them to a district auction committee, which then reserves or fixes the prices to each block and issues advertisements,” explained Ashfaq Ahmed Saleem, the additional director general of the minerals department.\n\nSubsequently, an open auction is held, and the highest bidder is allotted the lease, which includes all the rules and regulations for mining. “Currently, 24 plants are functioning on the Swat River, of which six have been auctioned against a total bid of Rs47 million,” Saleem told Dawn.com.\n\n“Apart from these six blocks, any activity on other blocks is illegal,” he said, adding that monthly checks were conducted to ensure compliance with the mining rules.\n\nBut locals say violations are common and lament the administration’s inaction to stop them. For one, the mining rules say that “the lease shall neither divert the natural course of the river, nullah, stream […] nor obstruct the natural flow or water”, but reshaping the river’s route is a common practice in Swat.\n\nIt further says that the mining should be restricted to a maximum depth of three metres, and the distance from the riverbanks should be one-fourth of the river, and should be no less than 7.5 metres. “What happened here, though, was that they dug up the entire river from one side to the other with trenches as deep as 20-30ft,” Swat-based journalist Sohail Asghar Khan pointed out.\n\nAnd this, he added, was the major reason behind rising river-related deaths in the region. “If you go towards the Khwazakhela side, you will see 15-20 excavation machines along the riverbed … and this is the case across the valley now.”\n\nWhen asked about these practices, Saleem said contractors violating the laws were issued notices and, in the absence of rectification, the lease was cancelled.\n\n“As far as mining on unauthorised blocks is concerned, when we catch it, we file a complaint with the police and then a case is sent to the judicial magistrate,” he added.\n\nAccording to data shared by Saleem, over 830 first information reports have been registered against illegal mining activity since 2018. In 2024-25 alone, 92 FIRs were lodged, of which 21 cases are under trial, while fines were imposed on others. Per mining rules, the punishment for illegal mining amounts to Rs0.5 to Rs2 million and up to three years in jail.\n\nFor his part, Rehmat Ali, the chairman of the Malakand Crush Association, told Dawn.com that the right way of mining involved using river channels instead of blocking the river or rerouting it as mentioned in the rules and regulations.\n\n“The lessee shall neither divert the natural course of the river, nullah, stream nor obstruct the natural flow of water,” it states.\n\nBut, Ali lamented, some people were mining via illegal means. “They are not just harming the river but also us, who are doing this the right way,” he rued. According to him, there were about 67,000 families in Swat that were dependent on mining for their livelihoods.\n\n“We have been doing this legally since 2003. We have licenses from the Environmental Protection Agency and all the other relevant departments,” Ali told Dawn.com. “But those who are doing this illegally are putting the economy of Swat at risk.”\n\nHe explained that Swat heavily relied on tourism, which meant the construction industry played a key role in the region, and crush was primarily used for the same, along with roads and bridges. “But when we complain to the government, they fail to take any notice.”\n\nFollowing the drowning incident, the government last week cancelled all the lease agreements for mining in the Swat River and imposed Section 144. However, despite the ban, locals said mining was carried out at places where the administration was nowhere to be seen.\n\n“In fact, just the day after the tourist family was washed away in the floods, these miners were back on the river banks with their excavators,” Wadood said.\n\nThis unregulated mining is not just claiming human lives but also causing irreversible degradation to the ecosystem of the Swat River and its pristine clear waters. “These waters used to be a lullaby for us, but today, all we can hear is the roar of the excavators and the scraping and crunching of the earth they dig,” said Wadood.\n\nThe intensified extraction has rapidly and visibly changed the natural course of the river, triggering a host of environmental challenges such as the degradation of agricultural land, erosion, and the destruction of Swat’s flora and fauna.\n\n“Agricultural land downstream, mostly fields of onion and tomato crops are drying up,” said Sadique Akbar, former professor at the University of Engineering and Technology, Swabi. He told Dawn.com that local farmers, who rely on the Swat River for irrigation, complain that their lands have become less fertile and more prone to flooding and erosion.\n\nThe river’s water, once a home to nearly 17 fish species native to Swat, now fails to provide them with the sustenance required and has thus caused them to go extinct. This is not just affecting the livelihood of fishermen, but also diminishing Swat’s appeal to tourists flocking to the region.\n\n“These fish used to find their food hidden in the riverbed, but extensive mining means it is no longer there,” said Dr Rafiullah. “Trout, which was once the saugat (gift) of Swat, is no longer found in freshwater anymore. Whatever is there is farm-produced. Desi trout can now only be found upstream in Kalam or Bahrain, where the water is clean.”\n\nThis has taken the livelihoods of fishermen in the region, who are now forced to search for other alternatives. Initially, they could catch up to 6kg-7kg of fish, but now, even if they spend an entire day, they can hardly manage a catch, added Sohail Asghar.\n\nMoreover, the lush green trees that once surrounded the river have now completely vanished. Residents say miners cut them down to create roads that could take their excavators and other big machines to the riverbanks. In addition, miners usually collect sand along the banks of the river, which has taken away its beauty. This, despite the mining rules, which state: “after mining of minor minerals, the debris and hindrance shall be removed from the limits of the river or stream.”\n\nSimilarly, seasonal birds that would have stopped by the river earlier for food have now stopped coming there.\n\nSufyan, a resident of Karachi who recently visited the northern areas, described it in these words: “The Swat I saw in pictures is no longer there; instead, a cloud of dust, the buzzing of machines and trucks are everywhere. It is just sad,” he said.\n\nAnd then, there is this constant fear among the residents of losing their children. Swat does not have many options when it comes to recreational activities for locals; they were dependent on the river for that too — swimming, sitting on the banks, and fishing. But none of that is possible anymore. The river they once called theirs has become a stranger today; nothing about it is the same anymore. Only memories remain.\n\nAnd so, the question echoes louder than the lost melody of the Swat River: will anything change before more lives and memories are washed away?\n\nHeader image: Men sift sand alongside the Swat River. — AN Photo",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/070114189cc33af.jpg",
  "retrievedAt": "2025-08-17T19:55:53.329Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921194/washed-away-how-unregulated-mining-turned-the-swat-river-into-a-killer",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T06:10:22.000Z"
}
