{
  "title": "4 dead, two injured in Peshawar house fire: rescue officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four people were killed and two others were injured after a fire broke out in a house located in Peshawar’s Kochi Bazar on Tuesday morning, rescue officials said.\n\nSpokesperson for Rescue 1122 Bilal Ahmed Faizi said in a statement, “Six people were rescued from the fire in critical condition and taken to the hospital.\n\n“However, four of them succumbed to their injuries. They have been identified as Rafiq, Shehnaz, Riaz and his wife.”\n\nFaizi added that the firefighters and ambulances reached the site of the incident soon after receiving information and started rescue operations.\n\n“The firefighters initially rescued three people trapped in a house adjacent to a market and transported them to the hospital for medical assistance,” Faizi detailed in the statement.\n\nDuring the rescue efforts, two firefighters fainted due to the blazing flames. They were taken to the Lady Reading Hospital for treatment, where their condition became stable, he said.\n\nSix fire vehicles and 40 personnel participated in the firefighting efforts, the rescue official continued.\n\n“Firefighters faced extreme difficulty as the house was located in a congested area with narrow alleyways. After hectic efforts, the rescue official confirmed that the flames had been brought under control and the cooling process was underway.”\n\nFire incidents usually occur due to a combination of human negligence, faulty infrastructure, poor safety standards, and environmental factors. Peshawar has faced frequent residential and commercial fires and periodic industrial infernos.\n\nIn October 2024, a fire at a tissue paper factory in the Hayatabad area was doused after more than 26 hours in an operation involving 130 fighters and 31 fire tenders.\n\nThe rescue team said the fire erupted as a huge quantity of polythene was stashed inside the factory, which melted due to the fire, and the blaze was difficult to douse.\n\nIn June 2024, a fire broke out in the Nauthia Phattak area of Peshawar, destroying at least 80 shops mostly selling used goods and injuring three people.\n\nThe officials said the fire erupted at one of the makeshift structures before engulfing the adjacent shops, which mostly dealt in secondhand clothes, shoes and curtains, and a power transformer.\n\nRescue 1122 workers and firefighters from Peshawar, Nowshera, Khyber and Charsadda districts controlled the fire in six hours with around 80,000 litres of water and foam.\n\nAround 110 personnel took part in the operation. Rescue officials said the wooden cabins caught fire due to strong winds and fire engulfed three markets before being brought under control.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/10/671d60c9e81ad.jpg",
  "retrievedAt": "2025-08-17T19:55:46.934Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922786/4-dead-two-injured-in-peshawar-house-fire-rescue-officials",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T07:12:59.000Z"
}
