{
  "title": "PM appoints Qatari princess as brand ambassador after she scales Nanga Parbat - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Tuesday appointed Qatari mountaineer and royal family member Sheikha Asma Al Thani as the brand ambassador for Pakistan’s mountains and tourism after she recently successfully summited Nanga Parbat, the ninth-highest mountain on Earth located in Gilgit-Baltistan region.\n\nKnown as the “Killer Mountain,” the 8,126-metre-high peak is considered one of the world’s most dangerous climbs due to its severe weather conditions and rough terrain.\n\nIn a post on X, the premier felicitated Sheikha Asma on the achievement.\n\n“I am pleased to appoint Her Highness Sheikha Asma Al Thani as the Brand Ambassador for Pakistan’s mountains and tourism.\n\n“My heartfelt felicitations to Her Highness on her recent feat of scaling Nanga Parbat. It is truly inspiring,” he wrote.\n\n“Her achievement sends a powerful message of courage and determination, and stands as a testament to the enduring friendship between Pakistan and Qatar,” he added.\n\nIn a post on Instagram, Sheikha Asma described the relentless challenges she faced on her route to the summit and the emotional toll of the ascent.\n\n“My ninth 8000er and one of the toughest climbs I’ve faced. This mountain tested me in ways I didn’t expect, from black ice beneath my feet to rockfall every few seconds. A constant reminder of how fragile life truly is,” she wrote.\n\n“But even in that danger, there was growth. There was surrender and there was strength I didn’t know I still had. I climb not just to reach summits but to return to what matters, to strip away the noise and reconnect with myself,” she added.\n\n“This mountain will stay with me forever.”\n\nSheikha Asma hoisted Qatar’s national flag at the summit and becomes the first Qatari woman to do so. Her earlier summits include Mount Everest, K2 and Makalu.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:55:26.504Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922833/pm-appoints-qatari-princess-as-brand-ambassador-after-she-scales-nanga-parbat",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T11:51:10.000Z"
}
