{
  "title": "Djokovic survives scare to reach Wimbledon quarter-finals - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Novak Djokovic survived a scare to reach the Wimbledon quarter-finals with a tense four-set victory over Alex de Minaur on Monday.\n\nSeven-time champion Djokovic endured a nightmare start to his last-16 match against the Australian 11th seed on Centre Court, but eventually battled back to win 1-6, 6-4, 6-4, 6-4.\n\nFresh from his 100th win at Wimbledon on Saturday — making him the third player to achieve that feat after Martina Navratilova and Roger Federer — Djokovic reached his 16th quarter-final at the tournament.\n\nAged 38, Djokovic is aiming to win a record 25th major title, breaking a tie with the long-retired Margaret Court, and a record-equalling eighth men’s crown at the All England Club.\n\nThat would make him the oldest Grand Slam singles champion in the Open era.Sixth-seeded Djoko­vic’s 101st victory at Wimbledon came under the gaze of Federer, who was sitting in the front row of the royal box alongside his wife Mirka.\n\nIn the last eight, Djokovic faces Italian 22nd seed Flavio Cobolli, who defeated former Wimbledon runner-up Marin Cilic 6-4, 6-4, 6-7(4/7), 7-6(7/3).\n\nThe 23-year-old will be playing in his Grand Slam quarter-final having never advanced past the third round in his seven previous appearances at the majors.\n\nFormer Olympic champion Belinda Bencic reached her maiden Wimbledon quarter-final — and first at any Grand Slam since 2021 — with a 7-6(7/4), 6-4 victory against Russian world number 17 Ekaterina Alexandrova.\n\nSeventh seed Mirra Andreeva eased past 10th seed Emma Navarro 6-2, 6-3 to reach the quarter-finals for the first time. The 18-year-old faces Bencic in the last eight clash.\n\nRussia’s Liudmila Samsonova defeated Spain’s Jessica Bouzas Maneiro 7-5, 7-5.\n\nSABALENKA STANDS TALL, NORRIE SURVIVES\n\nOn Sunday, women’s top seed Aryna Sabalenka and men’s defending champion Carlos Alcaraz both survived tough tests to reach the Wimbledon quarter-finals and Cameron Norrie kept alive British singles hopes after surviving a five-set thriller.\n\nSabalenka ruined home favourite Emma Raducanu’s dream in the previous round but had the Centre Court crowd cheering her on as she beat Elise Mertens 6-4, 7-6(7/4) in a high-quality duel.\n\nWimbledon’s new automated line-calling technology came under fire after an embarrassing malfunction robbed Anastasia Pavlyuchenkova of a point during her last-16 victory over Britain’s Sonay Kartal on Centre Court.\n\nSpaniard Alcaraz came through a ferocious firefight against Russian 14th seed Andrey Rublev 6-7(5/7), 6-3, 6-4, 6-4 to stay on course for a third successive title.\n\nAlcaraz is bidding to become only the fourth man to win back-to-back French Open and Wimbledon titles multiple times.\n\nThe 22-year-old second seed extended his current winning streak to 22 matches and will take on Norrie for a place in the semi-finals after the unseeded Briton soaked up 46 aces from towering Chilean Nicolas Jarry to win a feisty Court One battle 6-3, 7-6(7/4), 6-7(7/9), 6-7(5/7), 6-3.\n\nWhile Alcaraz seeks a Wimbl­edon hat-trick, Sabalenka is eyeing her first title on the London lawns after missing last year’s tournament with injury and the 2022 edition due to the ban on Russian and Belarusian players, and the 27-year-old made a fast start against Mertens.\n\nSabalenka, who claimed doubles titles at the US Open and Australian Open partnering Mertens, was then put through the wringer before raising her level to prevail.\n\nSabalenka will next face the 37-year-old German Laura Siegemund in the quarter-finals.\n\nSiegemund, the second-oldest pla­y­er to start in the women’s draw this year, swatted aside plucky lucky loser Solana Sierra with a 6-3, 6-2 win.\n\nWhile Sierra was the first lucky loser to reach the last 16 in the professional era, Siegemund created her own slice of history by becoming the oldest woman to reach her first Wimbledon quarter-final.\n\nSierra’s fellow South American, Jarry, fought back brilliantly against Norrie after saving a match point in the third-set tiebreak but fell short in a needle match.\n\nNorrie, a 2022 semi-finalist, is the last British hope after the unseeded Kartal’s run ended with a 7-6(7/3), 6-4 defeat by experienced Russian Pavlyuchenkova.\n\nAmerican fifth seed Taylor Fritz marched on after his Australian opponent Jordan Thompson retired with a thigh injury at 6-1, 3-0 down in their fourth-round meeting.\n\nUp next for Fritz is a meeting with Russian 17th seed Karen Khachanov who thumped Poland’s Kamil Majchrzak 6-4, 6-2, 6-3.\n\nFritz is not the only American to reach the quarter-finals, after 13th seed Amanda Anisimova beat Linda Noskova 6-2, 5-7, 6-4 in the day’s final action.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/686c87d98118f.jpg",
  "retrievedAt": "2025-08-17T19:56:24.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922751/djokovic-survives-scare-to-reach-wimbledon-quarter-finals",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T02:51:22.000Z"
}
