{
  "title": "Govt announces Independence Day to be celebrated under theme of ‘Marka-i-Haq’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Planning Minister Ahsan Iqbal on Tuesday said that this year’s Independence Day would be celebrated under the banner of “Marka-i-Haq” (Battle of Truth) to demonstrate the nation’s resilience, progress, and pride.\n\nThe Pakistan Army had named the period of conflict with India since the April 22 Pahalgam attack to the May 10 conclusion of Operation Bunyanum Marsoos as “Marka-i-Haq” in May.\n\nThe military confrontation between India and Pakistan came as the former blamed Islamabad for the April 22 Pahalgam attack without evidence. On the night of May 6-7, New Delhi launched a series of air strikes on Pakistan, resulting in civilian casualties. Both sides then exchanged missiles, which stretched over the week. It took a US-brokered ceasefire for both sides to finally drop their guns.\n\nIqbal presided over a preliminary meeting today under the prime minister’s directions to celebrate this year’s Independence Day with “full national spirit and renewed resolve”.\n\nSenior representatives from the Inter-Services Public Relations, Ministry of Information and Broadcasting, Ministry of Interior, Ministry of National Heritage and Culture, Ministry of Education and Professional Training, Ministry of Inter-Provincial Coordination and other departments participated in the meeting to discuss how to make the day “truly reflective of the feelings, aspirations and pride of the people of Pakistan”, according to a press release.\n\nIqbal said that this year’s Independence Day was being dedicated to the theme of “Marka-i-Haq” to “honour the courage, faith, and resolve of the nation”.\n\nHe said that the celebrations would send a “clear message to the world that Pakistan stands proud, strong and committed to its sovereignty”.\n\nThe minister added that at the same time, the government aimed to highlight the steady progress being made in economic recovery, defence resilience and international recognition of the country’s leadership, financial stabilisation and expertise, showing that Pakistan’s journey was “not just about survival but about rising to its full potential”.\n\nWhile discussing the activities of the scheduled celebrations, the minister emphasised that every sector and official in charge should ensure that all universities and schools observe the day in the same format. The same was advised for provincial celebrations and celebrations abroad in collaboration with the Overseas Ministry.\n\n“A robust discussion took place where the committee members shared the planned activities and innovative ideas for celebrations at the federal and provincial levels,” the press release said, adding that Iqbal said that a comprehensive plan should be developed with budgets.\n\n“This year, we are not just commemorating another Independence Day; we are marking a moment of national revival. A moment that reflects the resilience of our people, the resolve of our state, and the rise of Pakistan as a global voice of strength, peace, and purpose. The world has seen that while Pakistan is a peace-loving nation, it will never compromise on its sovereignty. Our recent defence of our territorial integrity showed our maturity, strength, and our determination to protect regional stability without weakness.\n\n“We must use this opportunity to honour the spirit of ‘Marka-i-Haq’, a defining chapter in our history where our armed forces, our citizens, our government, and every institution stood together. We are also seeing concrete gains across the board: inflation is down, exports are growing, digitisation is transforming governance and innovation is thriving. This is the time to celebrate Pakistan across every field, including military, economic, cultural and scientific and to tell our story to the world with pride and ambition.”\n\nHe emphasised that the celebrations must be unified. “One voice, one pride from every district, every province and every corner of the globe where Pakistanis live, so the world hears the unmistakable confidence of one nation standing tall.”\n\nMeanwhile, Interior Minister Mohsin Naqvi said while addressing the meeting’s participants: “The nation stands as one united, unshaken, and ready to defeat any designs against it. Our civil and military forces are shoulder to shoulder. These celebrations will reiterate to the world what they are already telling us that we are united and strong,”\n\nInformation Minister Ataullah Tarar shared that extensive plans were underway with song competitions, special programming and a documentary. He assured the meeting’s members that the celebrations would be reflective of the country’s achievements and “celebrate the global acclaim the country is receiving”.\n\nThe participants shared a range of proposals to ensure that the celebrations reflected the “hearts of ordinary Pakistanis and involve everyone” from the cities to the villages, from students to artists, and from businesses to the diaspora.\n\nPlans were also discussed for national songs, dramas, poetry gatherings, documentaries, cultural fairs, public events, school competitions and global embassy activities, “all designed to inspire the nation and tell its story to the world”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/082334191ad6a84.jpg",
  "retrievedAt": "2025-08-17T19:54:42.214Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922864/govt-announces-independence-day-to-be-celebrated-under-theme-of-marka-i-haq",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T18:58:47.000Z"
}
