{
  "title": "Govt lifts bar on corporate earnings of bureaucrats - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Monday opened an avenue for senior bureaucrats to amass virtually unlimited financial gains, while simultaneously imposing austerity measures on these very entities.\n\nIn a notification, the finance ministry said that an earlier order dated July 10, 2014 which capped earnings through board meetings of corporate entities at Rs1 million per annum, stood “withdrawn ab-initio” — meaning it was never issued.\n\nThe order, issued on June 12, 2024 with the approval of the then-federal cabinet, said that “government servants appointed to the board of companies/organisations and who become entitled to [a] fee, shall only be allowed to retain remuneration to a maximum of Rs1m in a financial year”.\n\nAny amount in excess of Rs1m so received was required to be deposited by the officer in the government treasury.\n\nThe decision on capping meeting fees was originally announced by then finance minister Ishaq Dar almost a decade ago.\n\nThat order remained in the field for a couple of years and then ignored. It was categorically reiterated last year, but has now been ‘withdrawn ab-initio’, meaning that the amounts earned throughout FY2024-25 would become legalised as the earnings of those officers.\n\nThe finance ministry issued another notification for continuation of austerity measures, which have now also been extended to federal government’s attached departments, SOEs and statutory bodies including regulatory authorities.\n\nIn case of SOEs, “these austerity measures shall be considered a direction of the federal government under Section 35 of the SOEs (Governance & Operations) Act 2023 and under the relevant sections of their respective organic laws in the case of statutory bodies”, the notification said.\n\nThe restrictions include a complete ban on purchase of all types of vehicles. The ban also includes creation of new posts, treatment abroad and non-obligatory foreign visits at government expense.\n\nSeparately, the ministry also notified an increase of 7pc in net pension of all civil pensioners, including civilians paid from defense estimates, as well as retired armed forces personnel and civil armed forces personnel.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/12/21085342e1f6a3f.jpg?r=085347",
  "retrievedAt": "2025-08-17T19:58:23.655Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922672/govt-lifts-bar-on-corporate-earnings-of-bureaucrats",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:03:43.000Z"
}
