{
  "title": "IHC orders CNIC of blasphemy suspect blocked - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) on Monday directed the Federal Investigation Agency (FIA) to block the national identity card of Komal Ismail — a central but elusive figure linked to an ongoing blasphemy-related case — after she repeatedly failed to appear before the court.\n\nJustice Sardar Ejaz Ishaq Khan issued the order during a hearing on petitions seeking the formation of a judicial commission to investigate alleged incidents of blasphemy.\n\nThe judge expressed dissatisfaction with the FIA’s inability to ensure Komal Ismail’s presence, questioning the agency on the status of previous court directives.\n\nIn response, FIA officials stated that their team had visited the last known address of Komal Ismail, where her nephew informed them that she had married and no longer lived there.\n\nWhen the team proceeded to her in-laws’ residence, they were told she had also moved from there. “Her WhatsApp number is being traced, and efforts are ongoing to locate her,” the FIA representative added.\n\nNadra officials confirmed that Komal Ismail, also identified by the alias “Iman,” had been linked with accused individuals in the blasphemy cases currently under scrutiny. On hearing this, Justice Ejaz Ishaq Khan questioned why her Computerised National Identity Card (CNIC) had not yet been blocked, emphasising that the step was necessary to ensure her appearance before the court.\n\n“The CNIC should be blocked until she is presented in court,” the judge ordered.\n\nMeanwhile, advocate Rao Abdul Rahim raised an objection, stating that the court had issued an adverse order against him in the previous hearing without giving him a chance to be heard.\n\nHowever, Justice Khan reminded the lawyer that the hearings were being held on a daily basis, and he should have remained present. “Your arguments will be heard in due course,” the judge assured. The hearing was subsequently adjourned till Tuesday.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/18111026a17065e.jpg?r=111053",
  "retrievedAt": "2025-08-17T19:56:50.324Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922639/ihc-orders-cnic-of-blasphemy-suspect-blocked",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:04:22.000Z"
}
