{
  "title": "SC urges responsible media coverage of criminal cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Takes notice of broadcast of interview with accused in custody\n• Wants authorities to put an end to such practices\n\nISLAMABAD: Highlighting the legal and ethical ramifications of media coverage during criminal investigations, the Supreme Court on Monday urged media professionals to exercise responsibility in order to safeguard the rights of both the accused and victims while reporting on criminal proceedings.\n\n“A disproportionate and excessive media spotlight and the manner it is presented is likely to create perceptions of guilt and influence the public as well as those who are associated with the criminal proceedings,” observed Justice Athar Minallah in a 25-page judgement.\n\nJustice Minallah headed a three-judge bench that took up the appeal of accused Shahid Ali against the March 15, 2021, decision of the Sindh High Court which had upheld the death sentence earlier awarded by the trial court.\n\nThe case involved the gruesome murder of a seven-year-old boy, Wasim Akram, in Karachi. The boy’s body was discovered in a water tank on March 9, 2014. The appellant, Shahid Ali, was convicted under Section 302(b) of the Pakistan Penal Code (PPC) and sentenced to death by the trial court. However, the Supreme Court acquitted him, extending the benefit of doubt, and directed that he be released forthwith.\n\nThe controversy arose when a journalist interviewed the appellant while he was on physical remand and in the custody of the investigating officer (IO). This interview was later aired on a private television channel on March 27, 2014, in its programme Jurm Bolta Hai.\n\nCalling the case a classic example, the judgement pointed out that the accused was in custody under a court-ordered physical remand solely for investigation purposes. He was presumed to be innocent, but the in-charge of the police station and the IO granted a journalist access to interview him in custody.\n\nThe statement was recorded on camera and disseminated to the general public via the television broadcast. The judgement expressed concern for the victim’s family, who may also have been adversely affected by this act.\n\nThe court found that the police officials had adopted a process they were presumed to know was unlawful and one that could lead to grave violations of the rights of the accused. Their actions created a perception of guilt, despite the fact that the accused was in custody solely for investigation and had not yet been charged, nor had the investigation concluded.\n\nTakes notice of broadcast of interview with accused in custody\n\nThe inadmissible purported confession was broadcast to the public, the judgement said, even though the accused had not been produced before a competent magistrate under Section 164 of the Criminal Procedure\n\nCode (CrPC).\n\nThe judgement also criticised the frequent practice of electronic media showing accused persons paraded before cameras or being questioned by reporters while in custody. Such practices gravely violate the rights of the accused and undermine the fairness of criminal trials, the court observed.\n\nThe court emphasised that both federal and provincial governments must take immediate and effective measures to ensure such practices come to an end.\n\nThe judgement also reminded the media — both print and electronic — of their responsibility to self-regulate their reporting and adopt standard operating procedures aligned with international best practices.\n\nIt called on regulatory authorities to propose such SOPs in consultation with stakeholders, with the aim of protecting the rights of the parties involved, particularly during investigations.\n\nThe court ordered its office to dispatch copies of the judgement to the interior and information secretaries, the Pakistan Electronic Media Regulatory Authority (Pemra), and the chief secretaries of the provinces, directing them to take immediate steps to protect the rights of those involved in criminal proceedings and to safeguard the integrity and fairness of investigations and trials.\n\nPublished in Dawn, July 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/08090529b23d602.jpg?r=090538",
  "retrievedAt": "2025-08-17T19:58:03.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922710/sc-urges-responsible-media-coverage-of-criminal-cases",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T00:03:54.000Z"
}
