{
  "title": "Evidence-based policy key to solving Pakistan’s education crisis: Sohail Akhter",
  "link": "https://www.app.com.pk/national/evidence-based-policy-key-to-solving-pakistans-education-crisis-sohail-akhter/",
  "date_published": "2024-09-30T15:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Joint Secretary of the Ministry of Federal Education and Professional Training (MoFEPT) Sohail Akhter emphasized the Ministry’s critical role in addressing Pakistan’s urgent education challenges during his speech at the two-day workshop on “Facilitating and Communicating Research for Policy Planning and Decision-Making” held here on Monday.\nThe event was organized by the Pakistan Institute of Education (PIE) and Oxford Policy Management (OPM) under the Dare-RC project.\nAkhter highlighted the importance of evidence-based policymaking in tackling systemic issues, including out-of-school children (OOSC), gender disparity in enrollment, and the rural-urban education divide.\nHe noted, “Our policies must be informed by thorough analysis, focusing on districts where female enrollment remains low and addressing foundational learning deficits worsened by the pandemic.”\nAkhter also called for collaboration beyond the education sector, including partnerships with ministries like the Ministry of Climate Change (MoCC), to introduce green and climate education into national curricula.\nDr. M. Shahid Soroya from PIE also addressed the workshop, focusing on the Ministry’s leadership in coordinating with provincial governments to ensure the effective implementation of research-driven policies.\n“While PIE operates at the federal level, we must work closely with the provinces to ensure that the research we generate is not just theoretical but translated into actionable policies that make a tangible impact on education outcomes,” Dr. Soroya stated.\nHe reiterated the importance of sustained collaboration between federal and provincial bodies to align research efforts with on-the-ground realities.\nAdding to the discussion, Harris Khalique from Oxford Policy Management (OPM) underscored the necessity of integrating research into the policymaking process at every stage.\nHe noted that research should not merely inform policy but drive continuous improvements as evidence is gathered.\n“We need to foster a culture where decisions are backed by data, and where research doesn’t just react to crises but anticipates future challenges and proactively shapes the policy landscape,” he said.\nThe closing remarks were delivered by Dr. Zeigham Qadeer, Director of the Research Wing at PIE, who expressed optimism about the workshop’s impact on strengthening service delivery in the education sector.\nHe emphasized the Ministry’s ongoing commitment to evidence-based policy formulation and stressed the need for enhanced collaboration between research producers, policymakers, and provincial education departments.\n“We are hopeful that this training will lead to more effective service delivery and a more robust educational system that responds to the real needs of the population,” Dr. Qadeer stated.\nThe workshop concluded with a reaffirmation of MoFEPT’s commitment to addressing the country’s education challenges, including the introduction of initiatives like school meals and evening shifts to bring children back to school.\nHowever, the speakers agreed that provincial collaboration would be essential to effectively meeting the needs of Pakistan’s growing young population. Through the DARE-RC project, the Ministry continues to foster a culture of research-backed decision-making, driving progress for Pakistan’s children and the country’s future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:27:17.092Z"
}
