{
  "title": "Chairman Senate for expediting uplift work in south Punjab",
  "link": "https://www.app.com.pk/national/chairman-senate-for-expediting-uplift-work-in-south-punjab/",
  "date_published": "2024-09-30T09:37:00.000Z",
  "source": "APP",
  "content": "MULTAN, Sep 30 (APP):Chairman Senate Syed Yousuf Raza Gilani stressed the imperative need to accelerate development work in South Punjab.\nHe said this while during a meeting with Additional Chief Secretary Fuad Hashim Rabbani at Circuit House, here on Monday. The meeting was also attended by Member of the National Assembly Syed Ali Musa Gillani and former MPA Syed Mujtaba Gillani.\nGilani stressed that thorough oversight of ongoing projects was essential to ensure timely completion.\n“Winning public confidence hinges on efficient public service delivery and prompt resolution of pressing issues”, Gilani maintained.\nThe Chairman Senate further stated the need for permanent appointments in key institutions, urging that recommendations be forwarded to the Punjab Government.\nGillani also directed enhanced security arrangements at the region’s revered shrines, particularly Qila Kohna Qasim Bagh.\nHe wished the removal of encroachments around the historic site to facilitate road expansion and improve traffic management.\nReflecting on his tenure as Prime Minister, he recalled that plazas were constructed in Shaheen Market and Ghanta Ghar to relocate traders displaced by anti-encroachment measures.\nHowever, he added that the plan had not been fully implemented.\nThe Chairman Senate also highlighted his role in securing a $10 million grant from the Italian government for the preservation and restoration of Qila Kohna Qasim Bagh and its ancient walls.\nHe stated the delays in utilizing these funds and suggested for the project’s swift completion.\nDuring the meeting, Additional Chief Secretary Fuad Hashim Rabbani provided a comprehensive briefing on ongoing projects and outlined new initiatives in South Punjab, assuring the Chairman Senate of steady progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:27:49.425Z"
}
