{
  "title": "SC dismisses LHC’s verdict regarding election tribunals",
  "link": "https://www.app.com.pk/national/sc-dismisses-lhcs-verdict-regarding-election-tribunals/",
  "date_published": "2024-09-30T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): The Supreme Court of Pakistan on Monday turned down the verdict of Lahore High Court (LHC) regarding election tribunals of Punjab while accepting the appeal of Election Commission of Pakistan (ECP).\nA five-member SC bench headed by Chief Justice of Pakistan Qazi Faez Isa announced the unanimous verdict.\nThe court, in its 11-page judgment authored by the chief justice, said, “We have also received ‘Report’ dated 18 July 2024 from the Registrar which confirms that the matter was amicably resolved between the Hon’ble Chief Justice of the Lahore High Court and the ECP. And, we are informed that sufficient number of election tribunals will be appointed/constituted immediately. Since the matter has been amicably resolved there is no need to decide these cases.\n“We want to record our appreciation that the Hon’ble Chief Justice of the Lahore High Court, who holds an important constitutional office, and the ECP, which is a constitutional body, have amicably settled the matter. Undoubtedly, they realized their respective constitutional and legal responsibilities and rose to the occasion to do the needful.\n“Therefore, since the matter has been amicably resolved to the satisfaction of the Hon’ble Chief Justice of the Lahore High Court and the ECP adjudication was not called for, resultantly, the impugned judgment is set aside and also the notification dated 12 June 2024 issued pursuant thereto. Moreover, though we do not expect, however, since such a dispute may one day have to be adjudicated upon we hold that anything stated in the impugned judgment should not be referred to before any court.”\nObserving that the ECP was a constitutional body and the LHC Chief Justice was a constitutional office holder, and both deserved the highest respect, the court recalled,”We had expressed our confidence that if there had been a face to face meeting and a meaningful consultation ensued the matter could have been amicably resolved.\n“Therefore, without adverting to the merits of the case we had directed the ECP/Chief Election Commissioner to meet with the Hon’ble Chief Justice of the Lahore High Court, in an atmosphere of meaningful consultation with regard to the subject matter.”\nJustice Jamal Khan, in his note, said, “I have had the privilege of going through the judgment authored by the Hon’ble Chief Justice. I concur with the findings rendered and conclusion drawn therein.\n“According to Article 219 of the Constitution, the Commission is exclusively charged with a duty to appoint as many Election Tribunals (‘Tribunal’) as may be necessary for swift disposal of elections petitions.\n“Article 213(3) of the Constitution provides that the Commission shall have powers and functions as are conferred on it by the Constitution and law. To regulate the power and function of the Commission with regard to appointment of Tribunal, procedure has been provided by section 140 of the Elections Act, 2017.\n“No doubt, the power to appoint Tribunals rests only with the Commission, but in order to ensure free and fair election, an independent machinery is necessary. In such view of the matter, the power to adjudicate such delicate task, has been assigned to the judiciary. Therefore, in case of appointing a sitting Judge of a High Court, consultation with the Chief Justice of the High Court concerned by the Commission is a condition precedent.”\n“As several Judges are performing their functions in different Benches, therefore, while nominating Judges, it will be convenient for the Chief Justice to consider availability of Judges at relevant Benches. In this way, the determination of territorial jurisdiction can also be resolved suitably. Once the Chief Justice nominates Judges for the purpose of appointment as Tribunals, the Commission is bound to accept the names and notify them accordingly, unless, there are cogent reasons, which must be communicated to the Chief Justice. If the Chief Justice is satisfied with the reasons advanced by the Commission, he may substitute a Judge accordingly.\n“The Constitution and section 140 of the Act do not provide for any provision, enabling the Commission to request for a panel of Judges for the purpose of appointment as Tribunals. The intention of the Legislature is evident of the fact that they did not assign power to the Commission to 3 ask for a panel of Judges and pick and choose a Judge of its own choice amongst them. The Commission must have a faith in every Judge and can only ask a Judge against each Tribunal. The primacy, therefore, lies in the final opinion of the Chief Justice.\nI hope that now the Commission will take all necessary steps immediately, enabling the Tribunals to start functioning and to conclude the proceedings upon the petitions within the stipulated period of time, accordingly.”",
  "retrievedAt": "2025-08-10T21:26:57.169Z"
}
