{
  "title": "FOSPAH’s nationwide school campaign against harassment",
  "link": "https://www.app.com.pk/national/fospahs-nationwide-school-campaign-against-harassment/",
  "date_published": "2024-09-30T17:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP):The Federal Ombudsperson Secretariat for Protection Against Harassment (FOSPAH), under the leadership of Ombudsperson, Fauzia Viqar, has launched a nationwide initiative aimed at not just informing students of their rights but also empowering them to understand what constitutes harassment and how to prevent it.\nThe groundbreaking campaign began with an awareness session at Government Girls High School in Sohan in collaboration with Islamic Relief Pakistan.\nThe session engaged over 70 female students from grades 9 and 10 in a critical dialogue about their rights to respect, education, and work, along with the protections guaranteed by Pakistani law.\nThe focus of the session went beyond just outlining these rights. The students were taught how to recognize harassment in its various forms whether in schools, homes, or public spaces ensuring that they not only know their legal rights but can also identify and prevent inappropriate behavior before it escalates.\nFOSPAH’s Law Officer Meher Jamy said, “This campaign isn’t just about legal knowledge. It’s about prevention. Too many young people experience harassment and don’t even realize that what’s happening to them is wrong. We must equip them with the tools to understand what harassment looks like and how to stand up against it.”\nShe said FOSPAH’s initiative is a direct response to the growing need for comprehensive education on both the rights of children and the behavior that violates those rights, as ignorance of what constitutes harassment leaves young people vulnerable to exploitation.\nIn the coming months, FOSPAH will conduct an extensive series of seminars and training programs in schools nationwide.\nThese sessions will focus on identifying harassment, understanding the law, and most importantly preventing abuse through knowledge and action.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:26:53.367Z"
}
