{
  "title": "Sherry lauds Chairman Senate’s role in upholding parliamentary traditions",
  "author": null,
  "content": "ISLAMABAD, Mar 08 (APP):Pakistan People’s Party (PPP) senior leader Senator Sherry Rehman on Saturday praised Chairman Senate’s role in maintaining the dignity of the House and upholding parliamentary traditions, said that the Senate must function on the principles of democracy and the rule of law.\nSpeaking on the Senate floor, she acknowledged the PPP’s contributions to strengthening the democratic system, particularly in line with the vision of Shaheed Mohtarma Benazir Bhutto.\nShe also commended the Chairman of the Senate’s decision to issue a production order for detained leaders, calling it a reflection of principled leadership.\nShe said that history would remember actions that reinforce democratic values, urging lawmakers to rise above personal interests and prioritize the integrity of Parliament.\nShe welcomed newly elected senator Asad Qasim Ronjho, she urged him to uphold the supremacy of the Constitution.\nSherry Rehman highlighted the importance of justice and equality, stressing that these principles must be implemented in letter and spirit, rather than remaining symbolic statements.\nRecalling past political scenarios, she lamented that production orders issued during the Pakistan Tehreek-e-Insaf government were often ignored, and opposition voices were silenced.\nDespite these challenges, she reaffirmed that the PPP has always supported dialogue and peaceful negotiations to resolve political differences.\nShe pointed out that when the current opposition leaders were in power, they adopted a hardline stance against their political adversaries.\nShe urged all political parties to move beyond political vendettas and work towards national unity, advocating for a fair and just political system free from discrimination based on political affiliations.\nSherry Rehman said that power must be exercised responsibly and with humility, asserting that political accountability should be transparent and fair, ensuring that no leader or party is unfairly targeted.\nShe reiterated that the PPP remains committed to upholding democratic values with passion and conviction, guided by the vision of Shaheed Benazir Bhutto.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:28:04.707Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sherry-lauds-chairman-senates-role-in-upholding-parliamentary-traditions/",
  "dateList": "2025-03-08",
  "date_published": "2025-03-08T09:22:00.000Z"
}
