{
  "title": "Pakistani nation standing in solidarity with Kashmiri people for their freedom struggle: PM",
  "link": "https://www.app.com.pk/national/pakistani-nation-standing-in-solidarity-with-kashmiri-people-for-their-freedom-struggle-pm/",
  "date_published": "2023-02-05T09:08:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Feb 05 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said that the entire Pakistani nation was standing shoulder to shoulder with their Kashmiri brothers in their struggle for freedom.\nHe said that he had exposed the atrocities and brutalities committed by India against the Kashmiri people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) at different world forum.\nThe prime minister was talking to a delegation of the All Parties Hurriyat Conference (APHC) that called on him, PM Office Media Wing said in a press release.\nThe prime minister stressed upon forging of unity for the national interests by leaving behind all political affiliations.\nHe expressed that the freedom of Indian Illegally Occupied Jammu and Kashmir was not far off if they continued this unity on national issues.\nDuring the meeting, AJK Prime Minister Sardar Tanveer Ilyas, AJK Legislative Assembly Speaker Chaudhry Anwar ul Haq, APHC leaders Mahmood Ahmed Saghir, Altaf Hussain Wani, Muhammad Hussain Khateeb, Faiz Ahmed Naqshbandi, Syed Yousaf Naseem, Manzoor Ahmed Ilyas and Zia Hussain were present.\nFederal ministers Khawaja Saad Rafique, Rana Tanveer Hussain, Marriyum Aurangzeb, Murtaza Javaid Abbasi and Adviser to PM Qamar Zaman Kaira were also present on the occasion.\nThe APHC delegation while warmly welcoming the prime minister expressed that the presence of the prime minister in AJK on the observance of Kashmir Solidarity Day and for the Kashmir cause was a good gesture.\nThey also appreciated the prime minister for exposing the atrocities and aggression of India before the world community and raising the voice of the Kashmiri people across the globe.\nThey said that visit of the prime minister reflected his personal priority to the cause of Kashmir.",
  "retrievedAt": "2025-08-11T05:55:55.703Z"
}
