{
  "title": "“If a referendum could  be held in East Timor and Sudan, why not in Kashmir”: asks AJK PM",
  "link": "https://www.app.com.pk/national/if-a-referendum-could-be-held-in-east-timor-and-sudan-why-not-in-kashmir-asks-ajk-pm/",
  "date_published": "2023-02-05T15:07:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK ) Feb 05 (APP): Prime Minister of Azad Jammu and Kashmir Sardar Tanveer Ilyas Khan while terming the unresolved Kashmir dispute as a constant threat to regional peace has said that if a referendum can be held in East Timor and Sudan, why not in Kashmir.\nWhile addressing a special session of Azad Jammu and Kashmir Legislative Assembly convened on the occasion of Kashmir Solidarity Day in the State metropolis on Sunday the PM said that the United Nations must take effective notice of the prolonged military occupation of Kashmir by India and play its much needed role to settle the long-running dispute in line with the UNSC resolutions.\n“If a referendum can be held in East Timor and Sudan, why can’t it be held in Kashmir?”, the PM said adding that the unresolved Kashmir was a burning spark that has the potential to jeopardize the peace of the whole world.Referring to Britain’s role, the PM said that the responsibility of the Britain was even more important as it quit the subcontinent while leaving the partition of India halfway.” Today we remind the United Nations to complete the incomplete agenda of partition of India”, he said.\nThe AJK premier thanked the Prime Minister of Pakistan Shahbaz Sharif for visiting Muzaffarabad and expressing solidarity with Kashmiri brethren in occupied Kashmir. Denouncing the Modi government’s unilateral move to change the region’s special status, the PM said after abrogating article 379 and 35A the Hindu supremacist regime was hell bent on changing the region’s demography aimed at converting Muslim majority of the state into a minority.\nHe said that India was investing heavily in Occupied Kashmir, but Kashmiris have rejected this so-called investment by the Modi regime. Recalling Hurriyat leader Syed Ali Geelani, the PM said, “SAS Geelani had once said that even if India paves the streets of Kashmir with gold, we would still refuse to identify ourselves as Indians”.\nReferring to Kashmiris’ history of resistance, the PM said that Kashmiris have an enviable history and tradition of fighting against aggressors. Lauding the matchless sacrifices Kashmiris have been rendering for the past 75 years, he said that sacrifices rendered by the people of the occupied Kashmir wouldn’t go in vain.\nHe said that India cannot suppress the Kashmiris’ legitimate struggle but the dint of force. The PM thanked China for opposing the holding of G20 conference in Occupied Kashmir. He said that he had asked the OIC Secretary General to seat Kashmiris in his secretariat. Hailing Pakistan’s consistent support and it’s role to promote and project the Kashmiris’ right to self-determination at international level the PM said that Pakistan had always lend it’s all out support to Kashmir cause despite facing myriad of challenges.\n“Pakistan is the center of hope for oppressed nations of the world”, he said. The Prime Minister said that a package of 500 billion announced by former prime minister Imran Khan for Azad Kashmir should be restored on urgent basis.\nHe also sought tax relief for people in Azad Kashmir.Regarding wheat crisis in Azad Kashmir the PM said that the government had also sent a request to the federal government.The special session convened on the occasion of Solidarity Day was also addressed by Pakistan Prime Minister Muhammad Shahbaz Sharif, Leader of Opposition Chaudhry Latif Akbar, PML-N President Shah Ghulam Qadir, Jammu and Kashmir People’s Party Chief Sardar Khalid Ibrahim and others.",
  "retrievedAt": "2025-08-11T05:55:40.897Z"
}
