{
  "title": "Salik demands UN documents, publications in Urdu",
  "link": "https://www.app.com.pk/national/salik-demands-un-documents-publications-in-urdu/",
  "date_published": "2023-02-05T14:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 05 (APP):Former Federal Minister for Population Welfare and Convener, World Minorities Alliance (WMA), J. Salik on Sunday demanded the United Nations to disseminate and translate it’s documents and publications in Urdu language and declare it as its seventh official language.\nHe also urged the UN to allow designated minorities’ observers (days) at its General Assembly to end disparity.\nThe Convener WMA made these remarks while exchanging views with Patron-in-Chief, WMA Muhammad Saeed Faisal on the upcoming international interfaith conference to be held under the auspices of the Alliance in Washington DC.\nJ. Salik said the UN should ensure distribution of its documents in Bangla, Turkish, Korean and Swahili as these languages were also spoken by millions of people around the globe.\nReferring to his principle demand, he said the UN should realise that Urdu language is widely understood and spoken in the South Asia region and due to rising Indian, Pakistani, Begali, Sri Lankan and Nepali diaspora in the Middle East it is understandable among a large number of people.\nHe added that Pakistan is the only country in the world that has been created by the minorities of the subcontinent against the majority Hindus. The flag of Pakistan is also custodian of equal minorities rights and representation in the country, he added.\nSalik told the Patron-in-Chief that the international interfaith conference due in the first week of March is also intended to advocate for equal rights for the minorites like Muslims, Christians, Jews, Buddhists, Hindus, Sikhs, and people of other faiths as the demograpic representation of different faiths varies from one country to the other.\nHe said the UN should also provide special representation and access to observers belonging to different minorites of the world that would enable them to get recognition and safeguard of their rights at the highest international forum.\nThe Patron-in-Chief Muhammad Saeed Faisal welcomed the suggestions of J. Salik. He also expressed his satisfaction on the preparations for the international interfaith conference.\nHe said the conference is a unique combination of artistic exhibition and intellectual discourse that will convene international figures including politicians, diplomats, UN envoys, observers, US Congressmen, philanthropists, civil society and media.\nSaeed Faisal underlined that the important part of the event is the chariot ride that will carry 25 oil paintings of various international personalities by Markus Salik.",
  "retrievedAt": "2025-08-11T05:55:50.502Z"
}
