{
  "title": "APHC lauds Pakistan for continued support to Kashmir cause",
  "link": "https://www.app.com.pk/national/aphc-lauds-pakistan-for-continued-support-to-kashmir-cause/",
  "date_published": "2023-02-05T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): The All Parties Hurriyat Conference (APHC) on Sunday extended gratitude to the Government of Pakistan and the Pakistani nation for their continued support of the Kashmir cause at all the international fora.\n“We are grateful to the people of Pakistan and their government for always standing by the Kashmiris who have been facing the worst form of Indian subjugation in the Indian Illegally Occupied Jammu and Kashmir,” APHC General Secretary Sheikh Abdul Mateen said while talking to APP.\nHighlighting the importance of the Kashmir Solidarity Day, he said it was not only observed within Pakistan but also across the world where its foreign missions held events and invited dignitaries to sensitize them about the plight of Kashmiris.\nHe said since the Indian forces had closed down the entire occupied valley, gagged the media and imprisoned the political leadership, the commemoration of such days exposed the Indian brutalities before the world.\nThe observance of the Day also helped highlight the message of Kashmiris in print and electronic media, he added.\nThe APHC leader said the Day’s observance was a recognition of the everlasting ideological, geographical, cultural and social ties the people of Pakistan have with their Kashmiri brethren, who had been fighting for decades to liberate themselves from the tyrannic Indian rule.\nHe said the lingering issue warranted the international community’s proactive role for its early resolution and the observance of Solidarity Day resonated with that message and at the same time gave further momentum to the Kashmiris’ freedom movement.\nThe APHC general secretary said the Kashmiris had been braving Indian suppression for the last seven decades and offering sacrifices, and the Pakistani nation by remembering the Day reminded the international community of the gravity of the Kashmir issue.\nHe said no peace would prevail in the region until the Kashmiris get their right to self-determination. The Kashmir issue was a flashpoint as Pakistan and India had already clashed on it. Being nuclear powers another war would be disastrous for the whole world, he added.\nAPHC Press Secretary Imtiaz Wani said despite the heinous crimes and oppressions committed by the Indian occupation forces in the IIOJK, Kashmiris would continue to show their love for Pakistan.\n“Pakistan and Kashmir are conjoined as their history and religion are similar. The love of Kashmiris for Pakistan can be traced back to the partition as they stood against the Dogra Raj and made the liberated area part of their beloved country,” he said.\nThe Kashmiris took pride to bury their martyrs wrapped in the National Flag of Pakistan, Wani added.\nHe said the Indian media kept mum on the atrocities of the occupation forces in the IIOJK and at the same time carried out a propaganda against Pakistan. “India will not succeed in subjugating the valiant Kashmiris, who will continue their struggle till their freedom.”\nHe, however, stressed that the anti-Pakistan propaganda in the wake of Kashmir issue must be countered through an effective media campaign.",
  "retrievedAt": "2025-08-11T05:55:50.426Z"
}
