{
  "title": "India can’t crush Kashmiris’ iron will with use of state terrorism: PM",
  "link": "https://www.app.com.pk/national/india-cant-crush-kashmiris-iron-will-with-use-of-state-terrorism-pm/",
  "date_published": "2023-02-05T08:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP): Prime Minister Muhammad Shehbaz Sharif has said that India is mistaken if it believes, it can crush the iron will of the Kashmiri people.\n“No amount of state terrorism, unleashed by Indian Occupation Forces, can break the will of the Kashmiris or undermine their legitimate struggle,” the prime minister said in a message on observance of Kashmir Solidarity Day.\nThe prime minister urged India to honour its commitments made to Pakistan, the UN and, above all, to the Kashmiri people.\n“On behalf of the entire Pakistani nation, I want to assure our Kashmiri brothers and sisters that we stand shoulder to shoulder with them. We will continue to lend moral, diplomatic and political support to their just cause, until they attain freedom from Indian oppression,” a press release quoted the prime minister saying.\nHe further reiterated that Pakistan would also continue to raise its voice at all international platforms and highlight India’s barbaric actions in Indian Illegal Occupied Jammu and Kashmir (IIOJK).\nEvery year, the prime minister said, on the fifth of February, the people of Pakistan reaffirmed their solidarity with their Kashmiri brothers and sisters.\n“On this Kashmir Solidarity Day, we renew our commitment of our unflinching support to them in their just struggle for inalienable right to self-determination,” he added.\nThe prime minister said the Jammu and Kashmir dispute was one of the oldest, unresolved items on the agenda of the United Nations.\nOver the last seventy-five years, India had continued its illegal occupation of Jammu and Kashmir and suppressed its people, he said, adding thousands of Kashmiris have sacrificed their lives and suffered countless atrocities at the hands of the Indian occupation forces.\nThe already bad situation took a turn for the worst following India’s illegal and unilateral actions of 5 August 2019. These illegal and unilateral steps had been rejected by Pakistan and the Kashmiris, the prime minister maintained.\nHe further said the human rights situation in Indian Illegally Occupied Jammu & Kashmir (IIOJK) remained a source of grave concern to Pakistan and the rest of the world.\n“India has brazenly targeted Kashmiri men, women and children through curfews, blackouts, arbitrary detention, imprisonment, and denial of basic rights,” he said, adding the popular Kashmiri political leadership had been illegally detained or deliberately victimized through fictitious cases.\nThe prime minister said the media had been silenced through coercion and religious scholars have been arrested. Draconian laws had been enacted that denied the fundamental freedoms of the Kashmiri people.\nHe said India had also intensified its campaign to bring about demographic changes in IIOJK, so as to convert the Kashmiris into a minority in their own land. “These actions are in violation of UNSC resolutions and international law, including the 4th Geneva Convention,” he added.",
  "retrievedAt": "2025-08-11T05:55:57.536Z"
}
