{
  "title": "Pakistani nation fully supporting Kashmir cause: Kaira",
  "link": "https://www.app.com.pk/global/pakistani-nation-fully-supporting-kashmir-cause-kaira/",
  "date_published": "2023-02-05T08:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 5 (APP): Adviser to Prime Minister on Kashmir Affairs and Gilgit-Baltistan, Qamar Zaman Kaira Sunday said Pakistani nation was observing the Kashmir Solidarity Day on Sunday (February 5) across the world to give a strapping message of supporting the right to self-determination.\nAddressing a Solidarity walk jointly organized by the Ministry of Foreign Affairs and Kashmir Affairs and Gilgit-Baltistan, he said Kashmir is a jugular vein and an integral part of Pakistan, adding the whole nation is ratifying and endorsing the Kashmir cause since generations to generations.\nHe said the country has always supported the Kashmir indigenous movement to get the right to self-determination and also urged the international community to play its pivotal role in resolving the lingering Kashmir issue as per the wishes of the Kashmiri people.\nThe adviser said the sole objective of celebrating Kashmir Solidarity Day is to shake the conscience of the international community. He further said the world community should break silence over India’s perpetrated atrocities and barbarism against innocent people of Kashmir.\nReiterating government’s resolve to support Kashmiris, Qamar Zaman Kaira said all walks of life including officials, students, journalists and others in Pakistan are supporting just the demand of Kashmiris for the right to self-determination.\nHe said India is using different tactics to suppress freedom struggle of Kashmiris but it will not succeed in its nefarious agenda. “Former Indian Prime Minister Nehru has made a promise with Kashmiris to resolve the dispute through United Nations (UNSC) resolutions and the Indian government should now fulfill his supreme leader promise,” he added.\nSpeaking on the occasion, senior leader All Parties Hurriyat Conference Azad Jammu and Kashmir chapter Ghulam Muhammad Safi thanked Pakistan and its people for supporting Kashmiris in their struggle of freedom.\nObserving the Kashmir Solidarity Day is a meaningful and fruitful to urge international community to pressurize India to impede its tyranny against the oppressed Kashmiri people, he maintained.\nA large number of officials, students, journalists and other had also participated in the Solidarity walk commenced from the Ministry of Foreign Affairs and concluded in D-Chowk Islamabad. The students of Pakistan Sweet Home (PSH) had specially participated under the leadership its CEO Zamrud Khan.\nThe participants had carried placards, banners and posters prescribing that Kashmir is the jugular vein of Pakistan, the international community should break the silence, Kashmiris are waiting for international justice, Kashmir issue has become a human crisis and Pakistan would continue to support the Kashmir cause.\nThey also chanted slogans such as Kashmir wants freedom from Indian illegally occupation, struggle would remain to continue till freedom, and the entire nation is standing with Kashmir.\nOne minute silence was also observed during the walk to express their sympathies with the Kashmir people in this difficult time.",
  "retrievedAt": "2025-08-11T05:55:55.004Z"
}
