{
  "title": "Dr Amjad Saqib’s vision of ending global poverty earns int’l  acclamation",
  "link": "https://www.app.com.pk/national/dr-amjad-saqibs-vision-of-ending-global-poverty-earns-intl-acclamation/",
  "date_published": "2024-01-17T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): Dr. Amjad Saqib has emerged as a unique symbol of hope and innovation in the realm of combating global poverty. As a pioneering advocate for microfinance, Dr. Saqib and his friends have been at the forefront of a transformative movement that seeks to empower individuals, families, and communities by providing them with the financial tools they need to break the chains of poverty.\nDr. Saqib has been recently appointed as the chairperson of the Benazir Income Support Programme (BISP), which is a 1.5 billion dollars annual federal unconditional and conditional cash transfer poverty reduction programme in Pakistan, the global praise was showered on Dr Saqib in an article published in the Independent UK, a British online newspaper.\nMicrofinance, as championed by Dr. Saqib, is not merely a financial strategy but a powerful tool for social change. It involves providing small loans, which are free of interest or mark up, often to those who are seeking support in operational costs but lacking access to traditional banking services, allowing them to start or expand small businesses, invest in education, and improve their overall quality of life. The impact of microfinance is not limited to economic upliftment alone. It is a catalyst for positive change that reverberates through entire communities.\nDr. Amjad elucidated,” Philanthropy and microfinance are powerful tools in our battle against poverty. We aim to empower people so that they can break the vicious cycle and reinvent their lives. However, this is done through a mutual support system.”\nDr. Amjad Saqib left a lucrative career in the Pakistan Administrative Services to serve the underprivileged of Pakistan. Dr. Amjad leads by example. He is the founder and Chairman of Akhuwat, the world’s largest interest free microfinance institution. Since its inception in 2001 with a modest $100 seed fund, Akhuwat has disbursed a staggering $1 billion as interest-free loans, transforming the lives of over 6 million families across Pakistan.\nAt the heart of Dr. Saqib’s and his comrades’ vision is the belief that poverty can be eradicated by enabling individuals to become self-sufficient. Through his groundbreaking work with the Akhuwat Foundation, a non-profit organisation he established in 2001, Dr. Saqib has demonstrated the profound impact of microfinance on the lives of millions. Akhuwat operates on the principle of interest-free microfinance, ensuring that financial assistance is not accompanied by the burdensome weight of exorbitant interest.\nDr. Saqib added, “One of the key strengths of microfinance is its ability to reach those who are traditionally excluded from formal financial systems. In many developing countries, a significant portion of the population lacks access to banks and financial institutions, leaving them trapped in a cycle of poverty. Microfinance breaks down these barriers.” He explained how it offers a lifeline to the underserved and marginalized, often empowering women who, in turn, become agents of change within their communities.\nHis contributions to uplifting the world’s most vulnerable people have earned him global accolades, such as the prestigious Ramon Magsaysay Award in 2021 (also known as the Asia’s Nobel Prize equivalent), the 2018 Islamic Economy Award, and a Nobel Peace Prize nomination in 2022 and the Global Man of the Decade award in 2023. He has also been recognised by the World Economic Forum, the Schwab Foundation, and the late Queen Elizabeth II through the ‘Points of Light’ award.\nDr. Saqib’s and Akhuwat’s approach goes beyond financial transactions; it is a holistic model that considers the social and cultural context of the communities it serves. By fostering a sense of community and shared responsibility, microfinance programs create networks of support that extend beyond financial assistance. This approach not only ensures the success of individual entrepreneurs but also contributes to the development and resilience of entire communities.\nThe success stories emerging from Dr. Saqib’s microfinance initiatives are inspiring and diverse. From small-scale agricultural ventures lifting rural communities out of poverty to urban enterprises empowering women to break gender norms, the impact is profound and far-reaching. These success stories underscore the potential for microfinance to be a powerful tool in the global fight against poverty provided that it does not burden the poor with high interest.\nAs the world grapples with complex challenges, from economic inequality to the aftermath of the global health crises, the importance of innovative interest free solutions like microfinance becomes increasingly apparent. Dr. Amjad Saqib’s vision offers a roadmap for a more equitable and sustainable future, where individuals are not just beneficiaries of aid but active participants in their own upliftment.",
  "retrievedAt": "2025-08-10T23:40:45.148Z"
}
