{
  "title": "Japan announces $3.62 mln grant to support Pakistan’s polio programme",
  "link": "https://www.app.com.pk/national/japan-announces-3-62-mln-grant-to-support-pakistans-polio-programme/",
  "date_published": "2024-01-17T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): The Government of Japan has announced a new US$ 3.62 million grant to procure essential oral polio vaccines as part of its continued support to polio eradication efforts in Pakistan.\nPakistan Polio Programme will use these funds to procure more than 21 million doses of vaccines to support polio campaigns in 2024, said a news release.\nPakistan is one of only two countries globally that has yet to stop polio. In 2023, Pakistan reported a total of 6 cases of polio.\nWith polio cases cornered to only a few locations in the country, the Government of Pakistan and partners are preparing to launch an aggressive plan of activities in 2024 to stop this life altering disease for children.\nEach national immunization drive targets over 44 million children under the age of five, with more than 370,000 frontline\nworkers, predominantly women, playing a crucial role to ensure the Polio Programme’s outreach.\n“Despite the challenges, Pakistan will remain relentless in our drive to put an end to polio in the next year,” said Dr. Nadeem Jan, caretaker Federal Health Minister.\nHe said, “As we prepare to launch polio campaigns in 2024, together with our partners we will maintain an emergency focus towards resolving the remaining challenges that stand in our way to reach all children. “\nThe minister said, “The unwavering support of the Government of Japan has been instrumental in helping us get closer to reaching zero cases. We are thankful to the Government and people of Japan for their continued support towards polio eradication in Pakistan.”\nITO Takeshi, Charge d’ Affaires ad interim of Japan to Pakistan, appreciated the significant gains made last year in controlling the spread of poliovirus.\n“I would like to express my sincere respect to polio workers and law enforcement agencies for their dedicated mission for humanity”, said Mr. ITO.\nNoting the importance of a clear and strong commitment by the Pakistani leadership to end polio, he said, “Japan would like to renew its commitment to continuing its efforts toward the ultimate goal of polio eradication by promoting routine immunization” he added.\nThe new funding is part of the continuous support from the Government of Japan to the Polio Eradication programme since 1996. To date, the grant and loan contribution from the Government of Japan has amounted to approx. US$ 242.16 million dollars to support the Polio programme in Pakistan through UNICEF.\n“We appreciate the government’s commitment to making all-out efforts to ensure all children receive the essential vaccine. We believe that vaccines, the most effective way to strengthen children’s immunity, will be used effectively with the understanding of parents and communities and the efforts of frontline workers. We sincerely hope that all the polio campaigns of this year will be conducted successfully toward zero polio cases”, said Tsuyoshi Hara, Senior Representative, JICA Pakistan Office.",
  "retrievedAt": "2025-08-10T23:40:30.461Z"
}
