{
  "title": "China achieves high quality development targets in 2023: Chinese CG",
  "link": "https://www.app.com.pk/national/china-achieves-high-quality-development-targets-in-2023-chinese-cg/",
  "date_published": "2024-01-17T16:53:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 17 (APP): The Consul General of the People’s Republic of China in Karachi Yang Yundong has said that China had achieved high-quality development targets in the year 2023 with an estimated Gross Domestic Product of 5.2 percent.\nExpediting the pace of work in game changer China-Pakistan Economic Corridor project, major achievements were also made and several high-profile projects were in the completion stage that would benefit the people of Pakistan, he said while addressing the ceremony for awarding certification of recognizing the contribution made by media Friends in Pakistan here at Karachi Consulate on Wednesday.\nYang Yundong said over the past year, China’s economy had successfully withstood international risks and the downward pressure resulting from a combination of multiple domestic factors. It has continued to rebound and show positive trends, with the solid promotion of high-quality development, he added.\nAccording to customs statistics, in 2023, the total value of China’s goods trade imports and exports reached 41.76 trillion yuan, representing a year-on-year growth of 0.2%. The combined exports of the “new three” products—electric passenger vehicles, lithium batteries, and solar cells—reached 1.06 trillion yuan, reflecting year-on-year growth of 29.9%, Chinese CG said, adding that this indicates a sustained optimization and upgrade of China’s export product structure, reflecting a new trend in high-quality development of the Chinese economy.\nElaborating the achievements of the People’s Republic of China, the Consul General said the foreign capital and foreign enterprises continue to show confidence in China’s innovation resources and business environment, as evidenced by their increasing investments in the country. In the first 11 months of 2023, the actual utilization of foreign investment in China exceeded 1 trillion yuan, maintaining a historical high. The Chinese market has become a stage for testing and honing the competitiveness of enterprises.\nReferring to Tourism development, he said the consumer demand continues to recover, with Chinese citizens showing increasing interest in tourism, fitness, entertainment and health maintenance. During the 3-day New Year’s holiday in 2024, domestic tourism in the country saw 135 million trips, marking a remarkable year-on-year growth of 155.3% and ushering in a strong start for consumption.\nIn the first 11 months of 2023, investment in China’s high-tech industries grew by 10.5% year-on-year, surpassing the overall investment growth rate by 7.6 percentage points, Yang Yundong said.\nHe said renewable energy has become a new force in ensuring China’s power supply, with an installed capacity reaching 1.45 billion kilowatts, accounting for over 50% of the country’s total power generation capacity and surpassing historical records in thermal power installations.\nHe said the industrial economy was steadily recovering as on November 4th, the domestically produced large cruise ship “Adora Magic City” was named and delivered, marking China’s capability to simultaneously build aircraft carriers, large liquefied natural gas transport ships, and large cruise ships. This achievement symbolizes the culmination of China’s shipbuilding industry, known as the “three pearls”, he added.\nLooking ahead to 2024, the world economy and trade face challenges of increasing trade protectionism and escalating geopolitical conflicts, the Consul General said China’s economy demonstrates strong resilience, substantial potential, and vitality. It benefits from the institutional advantages of a socialist market economy, the demand advantages of an enormous market, the supply advantages of a comprehensive industrial system, and the talent advantages of a large number of high-quality workers and entrepreneurs.\nHe said in order to build China into a great modern socialist country in all respects, we have adopted a two-step strategic plan: basically, realize socialist modernization from 2020 through 2035, build China into a great modern socialist country that is prosperous, strong, democratic, culturally advanced, harmonious, and beautiful from 2035 through the middle of this century.\nHe said over the past year, Chinese diplomacy had upheld fundamental principles while breaking new ground and forged ahead in China’s external work. We have created a favorable environment for building a great modern socialist country and advancing the rejuvenation of the Chinese nation.\nOn the occasion, senior journalists Manzar Naqvi, Sarmad Ali, Javed Qureshi, Wamiq Zuberi, Dr Jamal Siddiqui, Abdullah Sarohi, Aftab Khan, Syed Turab Shah, Talha Hashmi, Irshad Sanjrani, Sallahuddin Ahmed, Zil e Haider, Sonia, Mariam Hassan, Zahid Karani, Mustafa Karani, Yousaf Karani and others were among those who received the certificates.",
  "retrievedAt": "2025-08-10T23:40:00.153Z"
}
