{
  "title": "NAB chairman advocates Business-Friendly Reforms in collaborative meetings with business community",
  "link": "https://www.app.com.pk/national/nab-chairman-advocates-business-friendly-reforms-in-collaborative-meetings-with-business-community/",
  "date_published": "2024-01-17T11:52:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 17 (APP):The Chairman National Accountability Bureau (NAB) Lieutenant General Retired Nazir Ahmed held a series of meetings with the business leaders of Federation of Pakistan Chamber of Commerce and Industry (FPCCI), Karachi Chamber of Commerce & Industry (KCCI) and other top business community Leaders and assured them in an apparent show of support to the business.\nBusiness leaders held significant discussions with the Chairman NAB in addressing pressing economic challenges and propelling the nation toward growth. They suggested a number of proposals to help steer the country out of the economic turmoil.\nChairman NAB Lieutenant General Retired Nazir Ahmed responded positively and said that he wants to assure the Business Communities that NAB will not harass them and they should openly play their key role in the development of the country. He said that they should be fully focused on wealth creation activities and should do business without any fear.\nChairman NAB stressed that extreme importance would be given to wealth creation activities/ projects which will be encouraged and will be protected from unwarranted pressures and intimidation.\nIt was agreed that the business community, being the very core of our economy, has to be given the respect and status that it deserves. He said that NAB will deal with all businessmen with utmost respect & dignity and will help in creating business friendly environment.\nBusiness leaders emphasized the importance of an enhanced and sustained interactive dialogue between the business community and NAB.\nWhile responding positively, Chairman NAB said that a Business Facilitation Cell would be established initially at Karachi, Lahore and Islamabad including representatives of the business community for better coordination and facilitation of the business community.\nHe said that he believes in participative accountability therefore general complaints against businessmen will be first referred to the Facilitation Cell for immediate resolution/rectification and necessary action as per law.\nThe Chairman NAB updated the business community about his reforms in NAB and future plans.\nHe said that no businessman will be subjected to a media trial during the process of complaint verification and inquiry. He further added that complaints written under fictitious names or anonymous will not be entertained by NAB henceforth. During the course of inquiry, businessmen would be addressed as respondents and their confidentiality would be ensured.\nIt was further agreed that NAB will hold seminars regularly at different Business Forums in order to inform business community about NAB’s objective, operations and framework for better facilitation and also about their rights under the NAB Law.\nTo bolster economic decision-making, Director General NAB Karachi Javed Akbar Riaz assured that all the pending cases against the business community would be completed expeditiously and all efforts would be made to create business friendly environment for the investors.\nProminent Businessmen Aqeel Karim Dhedhi, Arif  Habib, Bashir Jan Muhammad, Habibullah, Atif Ikram Sheikh, Zubair Motiwala, Ahmed Chinoy and many other business community members attended the meetings.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:41:17.034Z"
}
