{
  "title": "Alternative Dispute Resolution essential to alleviate strain on judiciary: Mushaal",
  "link": "https://www.app.com.pk/national/alternative-dispute-resolution-essential-to-alleviate-strain-on-judiciary-mushaal/",
  "date_published": "2024-01-17T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Special Assistant to Prime Minister for Human Rights and Women Empowerment, Mushaal Hussein Mullick, has said that Alternative Disputes Resolution (ADR) is gaining considerable recognition in Pakistan due to its potential to alleviate the burden on the overburdened court system.\nShe was addressing a Workshop organized by Legal Aid and Justice Authority (LAJA), Ministry of Human Rights. The Workshop was aimed at capacity building and imparting training to ADR practitioners in ADR methods such as mediation, arbitration, and negotiation.\nThe workshop was addressed by a distinguished panel consisting of Senior Judge Federal Sharia Court Justice Syed Muhammad Anwar, DG National Police Bureau Ehsan Sadiq, DG. LAJA Dr. Rahim Awan, DG HR Ministry of Human Rights Abdul Sattar, and Executive Director PCHR Choudhary Shafique. The workshop was attended by a large number of aspiring ADR practitioners.\nIn her address she said that the Government, legal community, and various institutions had been taking initiatives to promote ADR and integrate it into the legal framework. She further said that ADR had many advantages to benefit from including; efficiency, cost effectiveness, Confidentiality, and Flexibility.\nMushaal underscored the transformative potential of Alternative Dispute Resolution (ADR) in alleviating the strain on the judicial system. She emphasized that the core objective of ADR was to complement traditional courts and mitigate the backlog of cases. She pointed out that there were 750 cases per judge in Pakistan rendering the conventional court trial process resource intensive and time consuming.\nShe said that one of the key functions of LAJA was to provide legal aid/assistance to poor and vulnerable groups, particularly women and children and enhance public awareness of legal aid and laws in Pakistan. She further said that ADR if institutionalized would prove to be a valuable tool in empowering women, girls and marginalized communities because of its quick dispensation of justice.\nMushaal acknowledged the efforts of the Legal Aid and Justice Authority formed under the LAJA Act 2020 to institutionalize the concept of ADR and establish reconciliatory committees across Pakistan. She further said that these efforts by LAJA would help to prepare a pool of Master Trainers on ADR in the country through capacity building and training sessions on modern ADR techniques and enable the ADR practitioners in dispute resolution mechanisms.\nMushaal emphasized that training ADR practitioners should be our key priority. She further said that the workshop was an important avenue to explore the challenges, opportunities, and new developments in alternative dispute resolution in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:40:16.801Z"
}
