{
  "title": "Director UNESCO calls on Minister for Culture Jamal Shah",
  "link": "https://www.app.com.pk/national/director-unesco-calls-on-minister-for-culture-jamal-shah/",
  "date_published": "2024-01-17T16:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Director and Representative of United Nations Educational Scientific and Cultural Organization (UNESCO) Islamabad, Dr. Youssef Filali-Meknassi, met with Caretaker Federal Minister for National Heritage and Culture Jamal Shah here at his office.\nSecretary National Heritage and Culture Humaira Ahmed, Adviser National Heritage and Culture Division Muhammad Kashif Irshad and other senior officials were also present on the occasion.\nThe Federal Minister and UNESCO Director agreed upon the need for policy and procedural changes to improve coordination and information sharing among various governmental departments working on culture and heritage, Public Relations Officer Akhter Munir said while talking to APP.\nThe minister said that National Heritage and Culture Division has prepared a comprehensive plan for revival of cultural and literary heritage.\nHe informed the Director UNESCO about the strategy for preservation and development of historical sites in federal capital including Mai Qamro Mosque, Muqarab Khan tomb, Rawat Fort and Shah Alla Ditha caves.\nJamal Shah opined that historical sites should be properly documented and conserved, promoting the country’s valuable heritage. He said that federal government was taking solid measures for the preservation and development of the national heritage.\nThe minister praised UNESCO’s cooperation in preservation of Pakistan’s heritage sites, adding that the National Heritage Division requires technical and financial support to continue its efforts. He added that preservation of historic sites like the Mehrgarh Archaeological Site is an urgent need to uplift the country’s potential, and attract tourists.\nIn the meeting, UNESCO Director and Representative Dr Youssef Filali-Meknassi reaffirmed UNESCO’s commitment to work with NHCD on areas of mutual interest.\nHe appreciated the Division’s ongoing efforts to incorporate cultural content in classrooms for children in schools.\nHe discussed the development of informational content on culture for children and possible avenues of dissemination, including television, radio, and web-based sources.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:40:26.081Z"
}
