{
  "title": "Pakistan needs to be more competitive, attractive to benefit from industrialisation: PM",
  "link": "https://www.app.com.pk/national/pakistan-needs-to-be-more-competitive-attractive-to-benefit-from-industrialisation-pm/",
  "date_published": "2024-01-17T09:27:00.000Z",
  "source": "APP",
  "content": "DAVOS, Jan 17 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday said that Pakistan needed to be more competitive and attractive to facilitate the journey of industrialisation in the region.\nThe prime minister, addressing an event titled “20th Pakistan Breakfast at Davos 2024” held by Pathfinders Group on the sidelines of the World Economic Forum, said a trading activity of around $336 trillion trade was happening in China, and GCC countries were also entering into the manufacturing industry.\nHe said China had acquired the transformation stage to relocate some of its industry and Pakistan could be one of those destinations.\nSimilarly, the GCC countries were rich with capital but had geographical disadvantages with the options of either importing the manpower or taking their capital to countries with a conducive environment and cheap energy and labour.\nHe told the gathering of intellectuals, writers and representatives of welfare organisations, that Pakistan was a unique place owing to its diversified culture, geography and topography with the eight highest peaks, deserts of Thar and Balochistan and the plains of Punjab.\nCalling human resources the biggest asset of Pakistan, he said 60 percent of its 240 million population was under 30 years of age which meant whole of energy and required direction.\nHighlighting the achievements of his government, Prime Minister Kakar said the governance structure was improving and that the government would leave behind a blueprint for the next government enabling it to respond to the challenges.\n“I am quite sanguine that people are feeling a deep sense of positivity,” he said and mentioned the structural changes and revamping of the taxation system.\nHe said “spend less on government and earn more” were the two lessons or takeaways of the incumbent government which was also facilitating the private sector to earn money and pay taxes.\nReferring to Pakistan’s ideal geographical situation, he said the whole of Central Asia was looking to have connectivity through Pakistan which had the highest population in the ECO region.\nThe prime minister also gave a historical background of Pakistan’s identity rooted in centuries-old civilizations, diversified culture and languages and said that Pakistan was not a story of a specific religion but a way broader than that with its own ambiance, colors, and cuisines.\nLauding the role of Ikram Sehgal, he said Pakistan needed more storytellers like him and reiterated the resolve to continue partnering with the World Economic Forum and Pathfinder Group.\nIn his remarks, Chairman of Pathfinder Group Zarrar Sehgal emphasised that Pakistan needed to tell the world that it remained an attractive place for investment.\nHe said the government was doing a wonderful job manifested through the rising DGP and downing inflation.\nHe said Pakistan remained a focal point of various avenues like connectivity besides being a part of the solution.\nHe viewed that the investment and reforms in education, digital financial inclusion would help Pakistan’s economy make a turnaround.",
  "retrievedAt": "2025-08-10T23:41:25.130Z"
}
