{
  "title": "Women worst victim of Indian state terrorism in IIOJK; Report",
  "link": "https://www.app.com.pk/national/women-worst-victim-of-indian-state-terrorism-in-iiojk-report/",
  "date_published": "2024-01-17T08:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP): Women have been the worst victims of Indian state terrorism in Indian illegally occupied Jammu and Kashmir (IIOJK) for the last over seventy five years.\nAn analytical report released by the Research Section of Kashmir Media Service, on Wednesday, said at least 685 women have been martyred by the Indian forces’ personnel in the occupied territory since January 2001.\nIt maintained that the Kashmiri women have been the worst sufferers of the harrowing conflict, which has rendered 22,972 women widowed since 1989. It deplored that Indian troops, paramilitary and police personnel had been routinely involved in sexual harassment of women to suppress the Kashmiris’ righteous demand of right to self-determination. It said that the troops had molested and disgraced 11,263 Kashmiri women during the period.\nThe report pointed out that Kunanposhpora mass rape, Shopian double-rape-and murder, and Kathua rape-and-murder of an 8-year-old girl are glaring examples of the extreme brutality of the Indian forces’ personnel in the occupied territory since 1989. Indian troops had molested around one hundred women during a cordon and search operation in Kunanposhpora area of Kupwara on the night of 23 February 1991. Indian men in uniform abducted two women Aasiya and Neelofar on 29 May 2009 in Shopian, raped and subsequently killed them in custody. Their bodies were found in a shallow stream in the town, next morning. An eight-year girl, Aasifa Bano, of Kathua district was abducted, gang-raped and subsequently murdered in January 2018. Seven Hindus including four policemen and a temple priest perpetrated the heinous crime.\nThe report said thousands of women have lost their sons, husbands, fathers and brothers in the occupied territory who were subjected to custodial disappearance by Indian troops, paramilitary and police personnel. As per the Association of Parents of Disappeared Persons, over 8,000 Kashmiris went missing in custody during the past 35 years, it added.\nThe report maintained that thousands of school boys and girls were also injured by the pellets fired by Indian troops while over a hundred including 19-month-old Heeba Jan, 2-year-old Nusrat Jan, Tammana (11), Shabroza Mir (16), Insha Mushtaq (16), Ulfat Hameed (17), Shakeela Begum (35) and Rafia Bano (31) lost their eyesight due to pellet injuries in the territory.\nThe report said that at least 33 women including Hurriyat leaders and activists, Aasiya Andrabi, Fehmeeda Sofi, Naheeda Nasreen, Tabasum Maqbool, Aasiya Bano, Raskeem Akhter, Seeba (an LLM student), Saima Akther, Shazia Akhter, Syeda Saiqa (MA post graduate), Aasiya Akhtar, Anjum Younis, Sheema Shafi Waza, Shams Begam, Zaytun Akhtar, Suraya Rashid Wani, Saima Bashir Mir, Mudifa Iqbal, Rashida Salam Din, Rubeena Nazir and Safeeqa Begum booked under black laws were facing illegal detention for their affiliation with the Kashmiris’ struggle for right to self-determination. It further pointed out that the majority of the Kashmiris suffering from multiple psychic problems are women.\nThe report said that the world community must take cognizance of the plight of the Kashmiri women facing the worst Indian brutalities in the occupied territory.",
  "retrievedAt": "2025-08-10T23:41:24.653Z"
}
