{
  "title": "Police digital license management system leads to arrests and fine collections",
  "link": "https://www.app.com.pk/national/police-digital-license-management-system-leads-to-arrests-and-fine-collections/",
  "date_published": "2024-01-17T07:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Islamabad Capital Police’s newly implemented Digital License Management System (DLMS) is now fully operational and has proven effective in apprehending a court absconder and a wanted criminal.\nMoreover, the system facilitated the collection of payments for over 1,000 traffic challans from 634 violators.\nUnder the guidance of Dr Akbar Nasir Khan, the Islamabad Capital City Police Officer (ICCPO), the police force has activated the DLMS, integrating data on wanted criminals and traffic violators.\n“This initiative ensures the apprehension of wanted criminals and guarantees the collection of traffic challan payments,” the police spokesperson said.\nIn adherence to these measures, 634 violators visited traffic offices, settling more than 1,000 challans. Simultaneously, one court absconder and a wanted criminal were apprehended, initiating legal proceedings.\nThe recently established Digital License Management System by the Islamabad Capital Police has been in full operation since its launch. Violators failing to settle their challans will forfeit all facilities provided by the police.\nAdditionally, the vehicles of these violators are being tracked through the new Brief Cam alerts and Safe City cameras, adhering to legal requirements.\nTo check their challans, citizens can enter their vehicle registration number on the official Islamabad Capital Police website (www.islamabadpolice.gov.pk) or use the provided link: https://ict.islamabadpolice.gov.pk:8081/veri/verify_e_challan.php.\nVehicle owners with fines can conveniently pay their challans through Jazz Cash, mobile apps, or JS Bank wallets. Failure to settle challans will result in stringent legal action against the violators.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:41:52.956Z"
}
