{
  "title": "PM leaves for Turkiye to express  solidarity with quake-hit nation",
  "link": "https://www.app.com.pk/national/pm-leaves-for-turkiye-to-express-solidarity-with-quake-hit-nation/",
  "date_published": "2023-02-16T05:47:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 16 (APP): Prime Minister Muhammad Shehbaz Sharif left here for Turkiye to express solidarity and support with the Turkish people in the wake of massive earthquake.\nTurkish ambassador Mehmet Pacacı and the Counsul General bid adeu to the prime minister from the Lahore Airport.\nBefore departure, Shehbaz Sharif in a tweet said, “I am leaving for Turkiye with a message of unwavering solidarity and support for our Turkish brothers and sisters from the people and government of Pakistan.”\n“True to the spirit of one nation living in two states, we consider their loss as ours,” he said.\nDuring his two-day stay in Ankara, the prime minister will meet President of Turkiye Recep Tayyip Erdogan to personally convey heartfelt condolences on behalf of the entire Pakistani nation over the loss of lives and the widespread damage.\nThe prime minister will reiterate Pakistan’s firm commitment to stand by the Turkish people during difficult times and to continue extending all possible support to the ongoing relief effort.\nThe prime minister will also visit earthquake-affected areas in southern Turkiye, and interact with the Pakistani search and rescue teams deployed in the area as well as survivors of the earthquake.\nIn the wake of the devastating earthquake in southern Turkiye, the prime minister had spoken with President Erdogan on February 6 and assured him of all possible assistance for the rescue and relief effort.\nAll available resources have been fully mobilized to help the Turkish people and the prime minister is personally overseeing the relief effort.\nPakistan and Turkiye enjoy deep fraternal ties. The two countries have resolutely stood by each other during every trial and tribulation.",
  "retrievedAt": "2025-08-11T06:05:58.600Z"
}
