{
  "title": "OGRA issues gas price revision notification",
  "link": "https://www.app.com.pk/national/ogra-issues-gas-price-revision-notification/",
  "date_published": "2023-02-15T20:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP): Oil and Gas Regulatory Authority (OGRA) on Wednesday issued a notification of gas sale price for domestic, commercial and industrial sectors, which would be effective from January 1.\nUnder the “protected category,” as per the notification, the authority has determined Rs 121 per Million British Thermal Unit (MMBTU) gas for domestic consumers using up to 0.25hm3 (in cubic hectometers) gas per month; Rs 150 per MMBTU for users of up to 0.5hm3; Rs 200 per MMBTU for consuming up to 0.6 hm3; and Rs 250 per MMBTU for up to 0.9 hm3.\nElaborating the “protected category,” it said under this group, consumers would “pay a fixed charge of Rs50/-(Less Meter Rent Rs.40).” Domestic users, whose average consumption of last four winter months i.e. November to February would be below or equal to 0.9hm3 gas, to fall in this category.\n“The billing mechanism will be revised so that the benefit of one previous/preceding slab is available to domestic consumer (residential use),” it said determining minimum charges at Rs 172.58 per month.\nWhereas in the “non-protected category,” OGRA would charge Rs 200 per MMBTU gas for consuming up to 0.25 hm3 per month, Rs 300 per MMBTU for up to 0.6 hm3, Rs 400 per MMBTU for up to 1 hm3, Rs 600 per MMBTU for up to 1.5hm3, Rs 800 per MMBTU for up to 2hm3, Rs 1,100 per MMBTU for up to 3hm3, Rs 2,000 per MMBTU for up to 4hm3 and Rs 3,100 per MMBTU for using above 4 hm3.\n“Non-protected category: Includes a domestic consumer other than the one in protected category,” OGRA clarified.\nFor government and semi-government offices, hospitals, clinics, maternity homes, government guest houses, Armed Forces Messes, Langars, Universities, Colleges, Schools and private educational institutions, orphanages, and other charitable institutions along with hostels and residential colonies to whom gas is supplied through bulk meters including Captive Power, OGRA has fixed all off-takes at flat rate of Rs 1600 per MMBTU, with minimum charges of Rs 3,900 per month.\nIn category of Special Commercial (Roti Tandoors), the authority fixed gas sale price Rs110 per MMBTU for consuming up to 1 hm3, Rs 220 per MMBTU for up to 2hm3 and Rs 700 per MMBTU for over 3hm3, with minimum charges of Rs 148.50 per month.\nIn the commercial sector, the authority has determined all off-takes at a flat rate of Rs 1,650 per MMBTU for all establishments registered as commercial units with local authorities or dealing in consumer items for direct commercial sale like cafes, bakeries, milk-shops, tea stalls, canteens, barber shops, laundries, hotels including hotel industry, malls places of entertainment like cinema, clubs, theaters, private offices and corporate firms etc. Minimum charges for these are Rs 6,415 per month.\nFor ice factories, all off-takes have been fixed at flat rate of Rs 1,650 per MMBTU with minimum charges of Rs6,415 per month.\nIn general industrial sector, all off-takes have been determined at flat rate of Rs 1,200 per MMBTU for all consumers engaged in the processing of industrial raw material into value added finished products irrespective of the volume of gas consumed but excluding such industries for which a separate rate has been prescribed. Minimum charges for this sector are Rs 35,540 per month.\nFor Captive Power Plants (General Industry), all off-takes have been fixed at flat rate of Rs 1,200 per MMBTU with minimum charges of Rs 36,653 per month.\nFor export-oriented general industry, the authority fixed all off-takes at flat rate of Rs 1,100 per MMBTU with minimum charges of Rs 27,616 per month, while for export-oriented captive power plants would pay at flat rate of Rs 1,100 per MMBTU with minimum per month charges of Rs 28,729.\nThe CNG sector would pay for all off-takes at flat rate of Rs 1,805 per MMBTU with minimum charges of Rs 46,229 per month, Cement sector Rs1,500 for all off-takes at the flat rate with minimum charges of Rs 45,588 per month.\nFor fertilizer companies, almost all off-takes have been fixed at flat rate of Rs 510 per MMBTU for gas used as feed-stock and Rs 1,500 per MMBTU for gas used as fuel for generation of electricity, steam and for usage of housing colonies.\nHowever, Engro Fertilizer Company Limited will pay $0.70 per MMBTU for all off-takes at flat rate for gas used as feed stock, and Rs 1,500 per MMBTU for gas used as fuel for generation of electricity, steam and for usage of housing colonies.\nIn power sector, all off-takes have been determined at flat rate of Rs 1,050 per MMBTU for WAPDA and KESC’s power stations, with minimum charges of Rs 28,898 per month.\nFor WAPDA’s Gas Turbine Power Station, Nishatabad, Faisalabad, all off-takes would be at flat rate of Rs 1,050 per MMBTU, while its fixed charges per month are Rs 975,000.\nFor Independent Power Producers (IPPs), all off-takes have been determined at Rs 1,050 per MMBTU with minimum charges of Rs 28,898 per month.\nFor Independent Power Producers, all off-takes would be available at flat rate of Rs 824 per MMBTU with minimum charges of Rs 21,209.88 per month.",
  "retrievedAt": "2025-08-11T06:05:58.669Z"
}
