{
  "title": "SC intends to conclude NAB amendment case at earliest: CJP",
  "link": "https://www.app.com.pk/national/sc-intends-to-conclude-nab-amendment-case-at-earliest-cjp/",
  "date_published": "2023-02-16T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP): Chief Justice of Pakistan (CJP) Justice Umar Ata Bandial on Thursday said that the court intended to conclude the NAB amendment case at the earliest.\nA three-member SC bench comprising Chief Justice of Pakistan Umar Ata Bandial, Justice Ijaz Ul Ahsan and Justice Syed Mansoor Ali Shah heard the case filed by former prime minister Imran Khan challenging amendments in the National Accountability (NAB) Ordinance by the government.\nDuring the course of proceedings, Justice Mansoor Ali Shah asked whether it was not clear in the NAB law that where the cases would be transferred.\nAdvocate Makhdoom Ali Khan, counsel for the federal government, said that there was a committee under the chairmanship of Chairman NAB which was looking into the transfer of cases to the relevant forums. In Britain, it was stated that if a matter was not to be decided, it should be referred to a committee, he added.\nHe said that 41 people were acquitted under NAB Ordinance 2019.\nThe Chief Justice said that the court would limit itself to the NAB amendments 2022 in this case.\nAdvocate Makhdoom Ali Khan said that the facts were not stated correctly in Imran Khan’s application. In the petition, the petitioner had to explain the conflict of the NAB amendments with the provisions of the Constitution, he added.\nHe said that there were total 47 legal questions in Imran Khan’s application. Out of these 47 legal questions, only 4 referred to constitutional provisions with NAB amendments, he added.\nHe said that the first two questions in the application for NAB amendments were related to Zia and Musharraf era referendum.\nHe said that the 21 legal questions in the NAB amendment petition were not questions at all. These 21 questions in the application did not refer to any NAB amendments or fundamental rights, he added.\nHe said that in 16 questions of the application, the NAB amendments were referred to, but the violation of fundamental rights was not mentioned. Six questions mentioned fundamental rights but NAB amendments were not mentioned in the petition, he added.\nAdvocate Makhdoom Ali Khan said that Imran Khan had also mentioned the imported conspiracy in the petition. According to the newspapers of the last few days, now this imported conspiracy had also become an exported conspiracy, he added.\nAddressing the counsel, the chief justice said that he had done a forensic audit of Imran Khan’s application. He said that the court wanted to conclude the case early.\nSubsequently, hearing of the case was adjourned till February 21.",
  "retrievedAt": "2025-08-11T06:05:54.965Z"
}
