{
  "title": "Political instability causing economic crisis in country: Tahir Ashrafi",
  "link": "https://www.app.com.pk/national/political-instability-causing-economic-crisis-in-country-tahir-ashrafi/",
  "date_published": "2023-02-16T16:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Thursday informed that Pakistan Ulema Council (PUC) was established in 1990, also announcing relevant celebrations over thirty-three years of the council’s foundation from February 18 to 28 across the country.\nAshrafi, who is also the PUC chairman, said a number of programs including conventions and seminars would be part of ten-day activism and in March, Paigham-e-Islam Conference would also be held.\nHe said the PUC was member of various national and international organizations and played its vibrant role for inter-sect and inter-faith harmony on the globe.\nAshrafi said the PUC had set some targets to achieve in the year 2023 and 2024, and the system of Khilafat-e-Rashida was on its main agenda.\nHe said it would continue its efforts to establish the system of Khilafat-e-Rashida in the country as it was based on justice and equality.\nPointing out flour crisis in the country, Ashrafi said in the system of Khilafat-e-Rashida, it was observed that Khalifa of the time used to provide flour at the doorstep of impoverished people.\nHe said today’s “judicial system is in dire need of reforms as it is not serving the purposes of general public who are languishing in jails for years but it was hearing political cases on top priority”.\nHe said there was no bar at hearing political cases as there should be the supremacy of law and the Constitution and appealed to the Chief justice of Pakistan Umar Ata Bandial to give some extra time to the impending cases.\nHe said these days, there was so much talk of holding elections at every nook and cranny of the country. He said that the elections must be held as per law of the land.\nAshrafi said there would be no use of elections if political and religious parties did not introduce electoral reforms and made it mandatory for all the contesting parties to accept the results of elections open-heartedly.\nHe said the people had no money and they were already overloaded of inflation and the “International Monetary Fund’s unwanted conditions are being accepted due to ailing economy of the country”.\nHe raised the question that what would be the solution if someone did not accept the mandate of any winning party in the elections as it would cost huge public funds spending.\nHe said it was an open secret that in elections, huge public funds were used and that the election commission’s code of conduct was violated.\nAshrafi said Pakistan was lagging behind other nations due to political instability in the country.\nIf Ulema and Mashaykh could be united under the umbrella of Paigham-e-Pakistan then why not political leaders could reach a consensus in the shape of ‘Charter of Pakistan’ to get out the country of prevailing social, political and economic crisis, he added.\nHe asked all the stakeholders to create a congenial environment and sit together at one table to remove their differences and put the country on road to progress.\nGiving example of Nankana Sahib’s disappointing incident, he said they should also devise a mechanism to deal with increasing polarization and extremism in the society.\nHe said nobody would be allowed to use Mehrab-o-Mimber for causing death and destruction in the country.\nAshrafi said if someone was accused of desecration of the Holy Quran or blasphemy of the Holy Prophet Muhammad (Peace Be Upon Him) would be punished by the court of law, also adding that nobody would be given free hand to be complainant, judge and executioner.\nHe said we had to come out of this confusion as such inhuman incidents were bringing bad names to Pakistan, Muslims and Islam across the world.\nHe announced that the PUC had decided not to contest elections until and unless the misuse of money was strictly prohibited in it but it would extend its support to their like-minded people who would fight the elections in their respective constituencies across the country.\nHe further complained that as the holy month of Ramazan was approaching nearer, the price of daily use items had started rising in the country which was totally against the law and Shariah.\nHe said there was a religious degree mutually issued by all schools of thought that those who were allegedly involved in the hoarding of public use items for the sake of extra profit, were earning Haram.\nHe also urged philanthropists to come ahead and help the less privileged segments of society generously.",
  "retrievedAt": "2025-08-11T06:05:47.980Z"
}
