{
  "title": "OIC condemns Israeli attacks on Al-Aqsa, calls for mobilizing efforts to protect Al-Quds",
  "link": "https://www.app.com.pk/national/oic-condemns-israeli-attacks-on-al-aqsa-calls-for-mobilizing-efforts-to-protect-al-quds/",
  "date_published": "2023-01-11T09:05:00.000Z",
  "source": "APP",
  "content": "JEDDAH, Jan 11 (APP): The Executive Committee of the Organization of Islamic Cooperation (OIC) emergency meeting has condemned the continuous Israeli attacks on the Al-Aqsa Mosque and called for mobilizing efforts to protect Al-Quds Al-Sharif.\nThe meeting held Tuesday at the OIC headquarters in Jeddah took place at the request of Palestine and Jordan in coordination with Saudi Arabia, the current chair of the Islamic Summit, and the chair of the Executive Committee to discuss recent developments in Al-Quds and Al-Aqsa Mosque. A communique was adopted by the Committee condemning the Israeli aggression on Al-Aqsa Mosque.\nSaudi Permanent Representative to the OIC, Dr. Saleh Hamad Al-Suhaibani, affirmed that the continuous Israeli attacks on the blessed Al-Aqsa Mosque and the brotherly Palestinian people constitute a provocation to the feelings of millions of Muslims and fuel conflict, extremism, and instability in the region, in addition to being a flagrant violation of relevant international resolutions.\nAl-Suhaibani reiterated the Kingdom’s firm position on the need to provide full protection for Al-Aqsa Mosque and stop serious violations and provocations.\nHe stressed that the Kingdom supports all efforts aimed at reaching a just and comprehensive solution to the Palestinian issue to enable the Palestinian people to establish their independent Palestinian state on the 1967 borders with East Jerusalem as its capital, in accordance with the resolutions of international legitimacy and the Arab peace initiative.\nHe stressed that the Kingdom of Saudi Arabia, as the president of the Islamic Summit and the Executive Committee, hopes that this meeting will come out with a unified Islamic position within the OIC framework and in coordination and integration with active regional and international organizations to stop the Israeli aggression and violations against Islamic sanctities.\nOIC Secretary-General Hissein Ibrahim Taha affirmed that the Israeli attacks against the blessed Al-Aqsa Mosque are an offense against the feelings and beliefs of Muslims around the world, as well as a flagrant violation of international law and UN resolutions.\nHe confirmed that these attacks would fuel violence and tension and destabilize security and stability in the region.\nThe Secretary-General called for responsible international action that compels Israel to stop these serious violations in order to preserve the existing historical and legal status of Al-Aqsa Mosque as a place of worship for Muslims alone.\nHe called for mobilizing and redoubling the OIC’s political, economic, and media efforts in order to protect the occupied Al-Quds, support the steadfastness of its people in the face of Israeli Judaization schemes and defend the inalienable Palestinian rights.\nPermanent Representative of Palestine to the OIC, Ambassador Maher Al-Karaki stressed that the continuous Israeli attacks on Al-Aqsa Mosque this time bore an official trend, as they were carried out by an extremist Israeli minister known for his hostile and racist record against the Palestinian people.\nHe stressed that the escalating Israeli incursions aimed at changing the status quo in Al-Aqsa, dividing it temporally and spatially, and imposing colonial sovereignty over it in flagrant violation of international law and the resolutions of international legitimacy.",
  "retrievedAt": "2025-08-11T05:43:06.234Z"
}
