{
  "title": "President for increasing Pak-UK bilateral trade to US$ 10 billion per annum",
  "link": "https://www.app.com.pk/national/president-for-increasing-pak-uk-bilateral-trade-to-us-10-billion-per-annum/",
  "date_published": "2023-01-11T12:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): President Dr Arif Alvi Wednesday underlined the need to take tangible steps to increase bilateral trade between Pakistan and UK, which stood at £3.1 billion in 2021, to US$ 10 billion per year.\nThis could be achieved in a short span of time by fully utilizing the existing opportunities, exploring new avenues and markets, diversifying products and services, and ensuring economic and political stability in the country, he added.\nThe President was talking to UK’s outgoing High Commissioner to Pakistan, Dr Christian Turner, who called on him here at Aiwan-e-Sadr.\nTalking to the outgoing High Commissioner, the President said that enhanced bilateral cooperation to substantially increase trade and investment from the UK in Pakistan would also help in improving the economic conditions of the country, besides creating jobs to reduce unemployment and sustain higher growth rates in coming years.\nHe said that the UK’s Developing Countries Trading Scheme (DCTS), which would replace the GSP in early 2023, would provide tariff reductions and simpler terms to Pakistan including duty-free exports of over 94% of goods from Pakistan to the UK.\nThe President appreciated the inclusion of Pakistan in the UK’s Developing Countries Trading Scheme (DCTS) and expressed the desire to fast-track the progress on the signing of the Free Trade Agreement (FTA) to substantially enhance trade and signing of an agreement between the two sides for the launch of Trade Dialogue in the coming months.\nDuring the meeting, he appreciated that 120 British companies were operating in Pakistan with cumulative investments of around $10 billion and noted that Foreign Direct Investment (FDI) increased by 22% in the financial year 2020-21 rising from US$117 million to US$143 million.\nThe President also appreciated that over the last five years up to 2019, Pakistan averaged as the largest recipient of the UK’s bilateral overseas development aid (ODA) in Asia.\nHe stressed the need to create bilateral Enhanced Strategic Dialogue (ESD) and Enhanced Strategic Partnership by developing a 10-year roadmap for taking relations forward in diverse fields, including trade, investment and climate change.\nHe expressed the need to further deepen the cooperation between Pakistan and UK in defence and security cooperation, and counter-terrorism cooperation and thanked the UK government for its assistance and support for safe city projects in Islamabad and Lahore and the establishment of a forensic lab in Lahore and extended support to counterterrorism department.\nThe President said that Pakistan suffered from a catastrophic global warming-induced super flood whereas Pakistan’s contribution towards global warming was less than 1%.\nHe added that 33 million people were affected by the floods, millions lost livelihoods, millions of livestock were lost, and millions of acres of crops were destroyed.\nHe said that the international community should help mitigate the impacts of global warming and climate change, and help vulnerable countries build resilience against climate change.\nDuring the meeting, the President also urged the need for engaging the highly qualified and knowledgeable Pakistani diaspora in the UK and creating a system through the Allama Iqbal Open University (AIOU) and the Virtual University of Pakistan (VU) to transfer their knowledge, expertise and intellect to Pakistani students and to improve the country’s education system.\nHe also emphasized on creating linkages among UK’s Higher Education Institutions with AIOU and VU for the exchange of faculty, and cooperation in the critical fields of Science and Technology, including IT.\nDuring the meeting, the increasing permeation of Hindutva philosophy in Indian society was also discussed.\nThe President emphasised that the international community should take notice of the increasing intimidation, harassment and marginalization of minorities, especially Muslims, in India and take tangible steps to pressurize India to give minorities their due rights.\nDuring the meeting, the High Commissioner said that Pakistan with its English-speaking workforce and its proximity to the Middle East was ideally placed for making investments by the UK-based companies.\nHe said that the certainty in economic outlook, political stability and sustained policies would further help in attracting UK investment in Pakistan.",
  "retrievedAt": "2025-08-11T05:43:00.966Z"
}
