{
  "title": "UNICEF continues working on restoration of health facilities in flood-hit areas",
  "link": "https://www.app.com.pk/national/unicef-continues-working-on-restoration-of-health-facilities-in-flood-hit-areas/",
  "date_published": "2023-01-11T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP):United Nations International Children’s Emergency Fund (UNICEF) will continue to respond to urgent humanitarian needs in flood-affected areas, restoring and rehabilitating existing health, water, sanitation and education facilities for families returning home in the months ahead.\n“As families begin to return to their villages, our response has moved with them and our mobile health, nutrition and water teams continue to respond to an immediate lifesaving need,” Abdullah Fadil, UNICEF Representative in Pakistan told here Wednesday.\nHe said, “We will continue to help restore and rehabilitate existing health, water, sanitation, and education facilities, supporting the government’s efforts in climate-resilient recovery and reconstruction. We know the climate crisis played a central role in supercharging the cascading calamities evident in Pakistan.”\nHe said, “We must do everything within our power to ensure girls and boys in Pakistan are able to fully recover from the current disaster and to protect and safeguard them from the next one.”\nAcute respiratory infections among children, a leading cause of child mortality worldwide, have skyrocketed in flood-stricken areas.\nIn addition, the number of cases of children identified as suffering from severe acute malnutrition in flood-affected areas monitored by UNICEF, nearly doubled between July and December as compared to 2021 as an estimated 1.5 million children are still in need of lifesaving nutrition interventions.\nNearly 10 million girls and boys are still in need of immediate, lifesaving support and are heading into a bitter winter without adequate shelter. Severe acute malnutrition, respiratory and waterborne diseases coupled with the cold are putting millions of young lives at risk,” Abdullah Fadil added.\nUNICEF and partners have started providing items such as warm clothing kits, jackets, blankets, and quilts, aiming to reach nearly 200,000 children, women, and men.\nIn response to the worsening child survival crisis, more than 800,000 children have been screened for malnutrition, 60,000 were identified as suffering from Severely Acute Malnutrition – a life-threatening condition where children are too thin for their height – and referred for treatment with Ready-to-Use Therapeutic Food (RUTF).\nUNICEF health interventions have reached nearly 1.5 million people with primary health care services so far, and 4.5 million children have been immunized against Polio in 16 flood-hit districts. UNICEF and partners have also provided more than one million people with access to safe drinking water, and one million with hygiene kits.\nUNICEF Pakistan has permanent field offices in all four provinces and has established four hubs to bring UNICEF operations and programmes closer to the hardest hit areas.\n“We have been working with the government of Pakistan, UN agencies, and NGO partners to respond to the needs of the most vulnerable populations in 55 calamity-affected districts, both for displaced populations and those returning to the location of their destroyed villages",
  "retrievedAt": "2025-08-11T05:42:55.907Z"
}
