{
  "title": "Ahsan visits St John’s Innovation Centre at Cambridge University, discusses collaboration for industrial growth",
  "link": "https://www.app.com.pk/national/ahsan-visits-st-johns-innovation-centre-at-cambridge-university-discusses-collaboration-for-industrial-growth/",
  "date_published": "2023-01-11T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP):Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Wednesday visited St John’s Innovation Centre and Judge Business School at Cambridge University, United Kingdom.\nDuring the visit, the minister had a productive meeting with Managing Director David Gill, Professor Stelios Kavadias, Vice-Dean for Faculty and Director of the EMBA Programme. He also met Michael Kitson, Assistant Director of the Centre for Business Research, said a press release issued here by the Planning Ministry.\nDuring the meetings, Ahsan Iqbal shared Pakistan’s plan to develop a world class innovation centre related to start-ups, entrepreneurship and tech economy.\nHe said, “The Government of Pakistan outlined E5 agenda (Exports, e-Pakistan, Energy, Environment & Equity) to transform its economy into a globally competitive economy with exports serving as major engine of growth.”\nPakistan, he added, had a huge youth bulge and equipping them with quality skills and education was the top priority of the government.\nThe minister said the Pakistan-UK Knowledge Corridor was established in 2016 to develop strong linkages between the top universities of two countries. Promoting academia-industry linkage for competitive industrial growth was a priority under E5 agenda, he added.\nPakistan wanted to benefit from experience of Cambridge University in the area, the minister said.\nAhsan Iqbal stated that Pakistan was one of most vulnerable countries affected by climate change. For developing a resilient and adaptive infrastructure, the government was exploring avenues to promote public-private partnership and social entrepreneurship to complement its investment from public sector, he added.",
  "retrievedAt": "2025-08-11T05:42:47.573Z"
}
