{
  "title": "HEC awards 165 PhD scholars under IRSIP",
  "link": "https://www.app.com.pk/national/hec-awards-165-phd-scholars-under-irsip/",
  "date_published": "2023-01-11T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP):The Higher Education Commission (HEC) held a ceremony at HEC Secretariat here Wednesday to award a six-month fellowship opportunity to 165 Pakistani PhD scholars under International Research Support Initiative Programme (IRSIP).\nChairman HEC Dr. Mukhtar Ahmed graced the occasion as the chief guest.\nStarted with a focus on enhancing the quality of doctoral research, providing an opportunity to scholars to train at advanced labs of prestigious institutes and introducing Pakistani talent globally, HEC has so far distributed a total of 3199 awards under IRSIP.\nOut of these fellowships, 966 have been awarded in the field of Biological and Medical Sciences, 831 in Physical Sciences, 576 in Agriculture and Veterinary Sciences, 471 in Social Sciences, 269 in Engineering and Technology, and 86 in Management Sciences.\nAddressing the ceremony, Chairman HEC said that this project was conceived during the early years of HEC’s establishment with an aim to give dynamic research opportunity to students so they can make bright careers and serve the country. He urged the students to make the best out of this opportunity as it is being provided with a lot of investment, at a time when the country is facing a severe dollar shortage. He requested them to remember Pakistan for facilitating them.\nSpeaking on the occasion, Executive Director HEC shared the breakdown of this session’s awards. “The gender ratio of the awardees is very heartening as 47 percent of the awardees are female scholars, whereas 53 percent are male.”\nThe Vice Chancellor, Capital University of Science and Technology (CUST) appreciated the role of HEC’s scholarship division and said, “I was pleasantly surprised to see how thorough and inclusive the scrutiny process was, and I am really happy to see that HEC has picked the best talent of Pakistani for this golden opportunity.”\nDirector, National Centre of Physics Prof. Aslam Baig said that the purpose of these fellowships was to enhance PhD work in Pakistan, each one of which was costing a hefty amount. I would request you to consider it as a loan and think about the ways of paying it back to your country, he added.\nThe event was also attended by awardees, their families, university faculty and supervisors.",
  "retrievedAt": "2025-08-11T05:42:55.905Z"
}
