{
  "title": "Christians bearing brunt of growing Hindu supremacist juggernaut",
  "link": "https://www.app.com.pk/national/christians-bearing-brunt-of-growing-hindu-supremacy-juggernaut/",
  "date_published": "2023-01-11T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): The recent attacks on churches and Christians in Chhattisgarh, Karnataka, and elsewhere post-Christmas and on New Year celebrations indicated continued violence against Christian minority with alarming regularity.\nAccording to a report of Deccan Herald, unfortunately, the state authorities had been found to be failing to provide a conducive environment of equality for all of its citizens.\nIn the latest incident, hundreds of villagers armed with sticks and iron rods marched into Sacred Heart Church in Narayanpur district, Chhattisgarh, and vandalised the church.\nOver 1000 indigenous people following the Christian faith were driven out of their homes in the villages near Narayanpur in the past couple of months.\nA church in Periyapatna near Mysuru was allegedly vandalised in late December, where miscreants damaged the idol of Infant Jesus, ransacked the altar, and took away the offerings box.\nhttps://timesofindia.indiatimes.com/city/guwahati/assam-police-seeks-info-on-churches-conversions-christian-bodies-unhappy/articleshow/96489872.cms\nAnother report by the Times of India said that on the eve of new year celebrations, Assam police had sought details of the churches established in the last one year in the state and the instances of conversions, which had created a sense of insecurity among the Christian organizations and spoiling the Christmas mood.\nThe New York Times, in its related report, said that anti-Christian vigilantes were sweeping through villages, storming churches, burning Christian literature, attacking schools and assaulting worshipers.\n“In many cases, the police and members of India’s governing party are helping them, government documents and dozens of interviews revealed. In church after church, the very act of worship has become dangerous despite constitutional protections for freedom of religion,” it added.\nTo many Hindu extremists, the report said, the attacks were justified — a means of preventing religious conversions.\nTo them, the possibility that some Indians, even a relatively small number, would reject Hinduism for Christianity is a threat to their dream of turning India into a pure Hindu nation.\nMany Christians have become so frightened that they tried to pass as Hindu to protect themselves.\nBut the organized assaults against churches were propelled by a growing anti-Christian hysteria that is spreading across this vast nation, home to one of Asia’s oldest and largest Christian communities, with more than 30 million adherents.\n“In the past few years, Mr. Modi and his Hindu nationalist party have tugged India far to the right, away from what many Indians see as the multicultural foundation Nehru built. The rising attacks on Christians, who make up about 2 percent of the population, are part of a broader shift in India, in which minorities feel less safe,” it added.\nThe report said Modi was facing increasing international pressure to rein in his supporters and stop the persecution of Muslims and Christians.\nThe United States Commission on International Religious Freedom, a government body, recommended that India be put on its red list for “severe violations of religious freedom”.\nAccording to the United Christian Forum (UCF), an inter-denominational organisation fighting for the rights of Christians in India, the most hate crimes against Christians in 2022 took place in Uttar Pradesh, Chhattisgarh, and Jharkhand.\nUP led the table with 121 hate crimes, followed by Chhatisgarh with 85 and Jharkhand with 39.\nKarnataka and Tamil Nadu were next, with 27 and 26 hate crimes, respectively. The attacks against Christians have increased after several states passed anti-conversions.“Christians are being suppressed, discriminated against and persecuted at rising levels like never before in India,” said Matias Perttula, the advocacy director at International Christian Concern, a leading anti-persecution group. “And the attackers run free, every time.”\nThe most recent flare up in India — the 10th worst country in which to be a Christian, according to a 2022 report by religious liberty advocacy group Open Doors — began around Dec. 9, when Hindu mobs began attacking Christians in outrage over some locals converting to Christianity.\nMany Christian villagers were assaulted and beaten with various makeshift weapons. At least two dozen people had to be hospitalized with injuries.\nAccording to Open Doors, India’s anti-conversion law was introduced and tabled during this winter season – and they were worriedd that it would lead to more attacks against Christians and other minorities during the Christmas season.\n“Increasing numbers of states in India have passed anti-conversion laws. In 11 states, now, these laws state that nobody can be forced or coerced into conversion to another faith—but, in reality, it is often abused to target Christians and other religious minorities, and stop believers worshipping, gathering together or telling others about Jesus. Notably, anti-conversion laws are not used to stop forced conversion (or ‘reconversion’) to Hinduism. In these states, Hindutva is often prevalent – the ideology that all Indians should be Hindu,” the report said.\n“Hindu nationalists are emboldened and sometimes use violence in place of dialogue,” Murry of the Open Doors commented.\n“Freedom of Religion Acts are instrumental in brutally suppressing and exploiting Christian minorities and punishing pastors and church workers.\nIn states where anti-conversion laws have been passed recently, there has been a rapid increase of incidents of persecution against Christians.\nIn recent years, churches were being destroyed, bibles and other Christian literature being confiscated and Christian gatherings being banned.\n“Mobs have verbally and physically attacked believers, even disrupting burial services and marriage ceremonies. Believers face public humiliation, beating, and head shaving,” the Indian media reported.\nSome Christians were forced to participate in a religious ritual as part of “returning” to Hinduism under threat of violence or loss of property.\nHundreds of Christians are still living away from their homes, many currently staying in churches or sporting arenas.\nAccording to the United Christian Forum, there was a 70 percent increase in attacks against Christians from 2020 to 2021.\n“The persecution of Christians in India is intensifying as Hindu extremists aim to cleanse the country of their presence and influence,” reports Open Doors.\n“The driving force behind this is Hindutva, an ideology that disregards Indian Christians and other religious minorities as true Indians because they have allegiances that lie outside India, and asserts the country should be purified of their presence.” About 2.5 percent of India’s population are Christians.\nAnother Christian rights group reported that new Year’s Day, a 500-person mob assembled in the village of Gorra, a small community in the central Indian state of Chhattisgarh, and summoned the town’s Christians and attacked them.  The attack on Gorra’s Christians was far from an isolated incident.\nWeeks of coordinated attacks on tribal Christians in the central Indian state of Chhattisgarh have left nearly 1,500 people homeless and traumatized.\nRight-wing Hindu residents in the Bastar division of the state have chased Christians from their homes and vandalized and demolished their houses and churches, enraged that their neighbors had refused to reject their faith.\nThis aggression came to a head in November, when Hindu right-wing groups organized mahapanchayats (regional council meetings) and began ruling and passing measures designed to evict Christians from their communities.\nThe councils banned Christians from worshiping within their own homes, prevented pastors from visiting Christian families in the village, and forbade local believers from carrying out their rituals like weddings or burying their dead in the village.\nThey also restricted Christians from buying or selling goods and from working.\nLocals blame Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP) and the Rashtriya Swayamsevak Sangh (RSS), the Hindu extremist organization, for inciting the attacks.",
  "retrievedAt": "2025-08-11T05:42:47.578Z"
}
