{
  "title": "Sherry Rehman takes exception over PTI’s politicking amid floods devastation",
  "link": "https://www.app.com.pk/national/sherry-rehman-takes-exception-over-ptis-politicking-amid-floods-devastation/",
  "date_published": "2022-10-10T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Monday took exception to the Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan’s political ambitions, which in the time of floods devastation are not getting subsided, organizing the PTI’s political gatherings and hurling threat to launch a long march towards capital just when the needs of the flood victims were increasing.\n“33 million are affected and the opposition is taking ‘Nazi oaths’ from the people to make them march in Islamabad. People are dying as the country goes through the worst climate event of the century,” the Minister in a statement issued here said.\nSenator Sherry Rehman said Imran Khan had turned all of his speeches into calls for protest while provoking his followers. “These false calls only distract from the enormous task of rebuilding the country from the ruins of these calamitous floods, if you speak these truths PTI cannot accept them,” she stated.\nSpeaking about the efforts her party has been making day and night to ensure flood relief funds pouring in, she said: “This is a record-breaking climate event that has never been witnessed in the history of the world, with 33 million people affected which is nearly half the population of the UK in scale and magnitude of the climate disaster.\nThe government is providing them shelter, food and safe drinking water. We are rescuing them and moving them to safer dry land with shelters so they can get access to basic services. 20.6 million, a number is greater than the size of Switzerland and Portugal’s population combined, are still in need of shelter, food, medical assistance.\n34 districts are crisis affected with 46,000 square kilometers still in fluid conditions, which just for perspective, is more than Switzerland’s entire physical area.\nThe intensity of the floods ripped apart more than 13,000 km of roads and 436 bridges like they were mere sticks, deeming parts of the country unreachable. The damages range from KP in the north to small village like Noshero Feroze in the south, small towns and villages do not have the capacity to deal with the intense flood that broke all records.\nSince mid-June, 1,700 people have lost their lives and 12,867 have been injured. We thankfully not received reports of new deaths in the last 24 hours.\n70 percent of the 33 million affected are women and children. 3.4 million Children are predicted to go hungry. 8.2 million people require urgent medical services, while 4 percent of the disaster affected population is actually pregnant.\n“These numbers indicate how much aid is needed and the scale at which the disaster has spread to leave this many vulnerable. Instead of sharing the burden, Khan has driven differences to such an extent that we are constantly fencing in the political arena instead of pooling our resources.”\nWith more than 1,400 health facilities damaged, 8.2 million people require urgent medical services as hospitals and clinics are drowned in flood waters. Waterborne diseases like dengue, malaria, cholera, skin diseases and others will run rampant if the situation is not controlled with lifesaving and essential medical and hygiene services. Food security will be the next challenge, 9.4 million, acres of standing crops inundated and damaged, this is directly putting at risk 14.6 million people, in the line of a food sector and agriculture crisis. Livelihoods will continue to face aftershocks and 15.4 million more people will be pushed into hardscrabble poverty.\n“This is the real picture and challenge we face today. There is no politics here when the World Bank estimates the total losses to be US$40 billion. This is unprecedented for a country like Pakistan that is already facing heavy import bills due to the global supply chain issues and will be facing subsequent shortages in food across the country.”\n“In government, very few of us, from the highest levels of public offices to all civil and military services, have not had a full night’s sleep since the flood. We are moving every available resource to the lifesaving effort. The Government of Pakistan has repurposed all of its existing budgetary envelopes, including all climate adaptation and resilience funds, to continue to provide ex-gratia compensations to affected households, as the toll of fatalities and loss and damage keep rising. To ensure that the poor have access to immediate cash relief, over USD295 million (PKR64.4 billion) has been dispersed to more than 2.57 million people from the affected populations via our BISP program, with complete transparency.”\n“While the country is going through the century’s biggest climate crisis IK’s game of lies, deceit and tall tales is making him look desperate, at a time when all energy and focus should be on saving people from a future of medium term destitution. All he is doing is draining resources from all those doing the actual word of providing relief. Any time that is spent responding to this bizarre behavior is time taken way from relief work.\nThe minister spoke about need for funds in a situation where the economy has sustained a huge exogenous shock. “We have been busy raising money for humanitarian aid with our second appeal for $816 million co-sponsored by the United Nations General Assembly, we are expecting more relief to come in. These will translate into resources that will help the flood victims, unlike Khan’s empty “pledges” that he overstates in every jalsa. We are looking at arranging food, shelter and medicines for over 8 million people in health distress.\n“Our message is clear, we need to first save people from disease, poverty and despair,” she said. “It is time Khan and PTI do their part and desist from sowing disorder and detracting from the gravest issue Pakistan has faced in living memory.”",
  "retrievedAt": "2025-08-11T15:42:20.709Z"
}
