{
  "title": "ANF recovers 49355 kg drugs during past few months: Minister",
  "link": "https://www.app.com.pk/national/anf-recovers-49355-kg-drugs-during-past-few-months-minister/",
  "date_published": "2022-10-10T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): The Anti Narcotics Force (ANF) has recovered around 49355 kilograms (kg) of drugs during the past few months, Minister for Narcotics Control Nawabzada Shazain Bugti told the Upper House of the Parliament on Monday.\nWinding up the discussion on a motion moved by Senator Bahramand Khan Tangi regarding the unabated use of narcotics drugs specially “ice” in the country with particular reference to the educational institutions, the minister said his ministry has taken multiple initiatives to purge this menace from the society.\nGiving breakup of the recovered drugs, he said some 7486 kg opium, 2719 kg morphine, 65 kg crystal, 3622 kg heroine, 19808 kg hashish, 10kg cocaine, 1383 kg meth, 210 kg ecstasy tablets, 2700 kg poppy seeds, 1 kg cannabis, 2208 kg ketamine and other substances.\nRefuting the concerns of Senator Sania Nishtar about alleged torture on drug addicts in rehabilitation centre, he said her remarks were contradict to the ground situations as all rehab centers were being run by professional staff.\nAbout the number of drug addicts in the country, he said his ministry will conduct a report in that regard and the work will begin from the end of October. After compiling the report it will be published in the September next year.\nTo control use of drugs in educational institutes, Bugti said deliberations were underway with the education ministry to devise a comprehensive policy to safe future of young generation from the use of drugs.\nHe said the number of manpower in the ANF were being increased to enhance its performance, adding that some 3600 personnel were performing duties on dry ports, airports boarders and other areas.\nHe said an application had been moved to establishment division for recruitment of additional 3700 posts.\nTaking floor, Bhramand Khan Tangi said around 40 per cent narcotics were smuggled to Pakistan through Afghanistan, approximately 7 million people in the country were addicted to drugs.\nHe regretted that there was not a single government rehab centre established in Khyber Pakhtunkhwa (KPK) and Balochistan, adding that presently only three centres were functional across the country including Sukkur, Karachi and Islamabad which were not enough to treat the patients.\nReferring to a report on drugs, he said the numbers of addicts were increasing gradually in educational institutes due to easy accessibility of substances.\nHe said students were using drugs inside the premises of educational institutes which was an alarming and needed to be tackled immediately.\nTangi demanded allocation of sufficient funds for establishment of rehabilitation centres, especially in KPK and Balochistan, comprehensive strategy to dismantle drug cartels and smugglers and strict punishment for such people to ensure a drug-free society.",
  "retrievedAt": "2025-08-11T15:42:23.910Z"
}
