{
  "title": "42nd PARA Central meet concludes amid two new national records",
  "link": "https://www.app.com.pk/national/42nd-para-central-meet-concludes-amid-two-new-national-records/",
  "date_published": "2022-10-10T18:08:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Oct 10 (APP): Chief of Army Staff (COAS) General Qamar Javed Bajwa on Monday attended the closing ceremony of the 42nd Pakistan Army Rifle Association (PARA) Central Meet at Jhelum Garrison as Chief Guest where two new national records were set during the shooting competitions.\nThe mega shooting event was conducted at Army Marksmanship Unit from August 22 to October 10. Over 2,000 firers from Army, Navy, Air Force, Civil Armed Forces (CAFs) including Rangers (Sindh, Punjab), Frontier Corps and GB Scouts as well as civilians participated in the competition that comprised numerous events involving different ranges and types of weapons, an Inter Services Public Relations (ISPR) news release said.\nChief of the Air Staff (CAS) Air Chief Marshal Zaheer Ahmed Babar Sidhu was present as the Guest of Honour who gave away the prizes to winning participants.\nIn Inter Formation Competition, Mangla Corps stood first followed by Bahawalpur Corps. In Civil Armed Forces (CAF) category, trophy was won by Punjab Rangers while Gilgit Baltistan Scouts received runners up trophy. In Inter Services Matches, Pakistan Army won three out of four contests including COAS, Chief of Air Staff (CAS) and Chief of Naval Staff (CNS) Matches, while Pak Navy won CISM Match. Pak Navy remained runners up in COAS and CNS Matches while PAF stood second in CAS Match.\nPakistan Army won Shotgun, Long Range and Small Bore Trophies in Open National Matches. Pakistan Navy won the Prime Minister ‘Skills at Arms’ Big Bore National Challenge Match while Pakistan Army secured second position.\nThe Biggest Military Shooting Honour ‘The Master at Arms’ Trophy along with Gold Medal of ‘National Rifle Association of United Kingdom (UK)’ was awarded to Lance Naik Syed Mansoor Ali Shah of 112 Wing Gilgit Baltistan Scouts.\nThe President’s Cup National Challenge Match Trophy was awarded to Major Ahmad Jehanzeb of Army Marksmanship Unit. The Prime Minister ‘Skills at Arms’ Small Bore National Challenge Match was won by Pakistan Army.\nThe ‘Best Shot Match Trophy’ was awarded to Lance Naik Allah Ditta of 165 Field Regiment Artillery. Two new National Records were also made during the National Level matches.\nMajor General Ahsan Gulrez, Director General Military Training (DGMT) participated and made a new PARA National Record by scoring 150/ 150 points with 8 shots Bull Hit in finals of 800 Yards Rifle Match whereas Lieutenant Colonel Junaid Ali Zulfiqar made New National Qualification Record by scoring 150/ 150 points with 12 shots Bull Hit in 800 Yards Rifle Match.\nEleven participants and faculty members of First Sniper course of Pakistan Army Sniper School (PASS) were also awarded prizes and Sniper insignias.\nWhile interacting with participants, the COAS appreciated the firers for their excellent standards of marksmanship. Terming shooting skill as hallmark of a professional soldier, COAS said, “attaining proficiency at shooting must remain at the heart of basic military training objectives.”\nLater, the COAS visited Jari Kas Cantt, near Mirpur AJK. The COAS inaugurated APS Jari Kas and interacted with students. He also addressed officers and men at Jari Kas Cantt.",
  "retrievedAt": "2025-08-11T15:42:20.228Z"
}
