{
  "title": "NA starts debate on post-flood situation in country",
  "link": "https://www.app.com.pk/national/na-starts-debate-on-post-flood-situation-in-country/",
  "date_published": "2022-10-10T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): The National Assembly on Monday formally started debate on the post-flood situation in Balochistan, Khyber Pakhtunkhwa and Sindh.\nMinister for Commerce Syed Naveed Qamar moved a motion under Rule 259 about the situation arising out in the country due to the floods.\nInitiating the debate on the motion, Minister for Climate Change Sherry Rehman said more than 33 million people had been affected due to the recent floods in the country and around 20.8 million of them were in dire need of basic amenities of life.\nShe said some 16,000 kilometers road infrastructure had been perished while several bridges were washed away. Around 1,700 had people lost their lives and more than 13,000 got injured. Over 650,000 pregnant women were facing unsanitary conditions while living in tents.\nThe minister said the government was making its best efforts to provide relief in the tragic moment, while the United Nations had also made appeals to the world assist Pakistan. A total of Rs 70 billion had been disbursed under the Benazir Income Support Programme (BISP), she added.\nShe said water-borne diseases were spreading in the relief camps while hospitals, clinics, mosques and schools were still inundated in the flood hit areas of Sindh.\nShe urged the world to assist Pakistan, which had a meager contribution (less than one percent) to the overall pollution.Pakistan in fact suffered due to global warming and the pollution created by the rich countries, and it was its right to be assisted by the latter, she maintained.\nThe minister criticized the Pakistan Tehreek-e-Insaf (PTI) leadership for “misguiding the people and polarizing the society”. During the Pakistan People Party’s long march, its Chairman Bilawal Bhutto Zardari had urged all the participants to ensure discipline. No property was damaged during that march, she added.\nOn the contrary, she alleged, public property was damaged during the PTI’s political gatherings held till date. However, the party would not be allowed to do so in future, she added.\nGhous Bux Khan Mehar of the Grand Democratic Alliance (GDA) said the people of interior Sindh were facing difficulties in the wake of floods and they needed help from the government. There should be no political point scoring on the issue, she added.\nLater, Speaker Raja Pervaiz Ashraf deferred the debate till Wednesday with the consent of the House.",
  "retrievedAt": "2025-08-11T15:42:21.651Z"
}
