{
  "title": "MWL launches religious diplomacy for common interests, world peace: Secy General",
  "link": "https://www.app.com.pk/national/mwl-launches-religious-diplomacy-for-common-interests-world-peace-secy-general/",
  "date_published": "2022-10-10T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP):The Secretary General of Muslim World League (MWL) Dr Muhammad bin Abdul Kareem Al-Issa on Monday said the MWL had launched religious diplomacy to achieve common interests and maintain peace across the world.\nAddressing a seminar in connection with minorities rights, held here at a local hotel under the auspices of Pakistan Ulema Council (PUC), he said the MWL organized a conference in Riyadh, Saudi Arabia in a bid to create an environment of peace and harmony on the globe and yielded positive response in the wake of all these efforts.\nIn this conference, the MWL took some major initiatives including setting up a platform for religious diplomacy and preparing an international encyclopedia in which all human beings shared values can be discussed from all aspects, he added.\nHe said it was also decided to designate a special day to highlight the shared values of all human beings in detail.\nThe MWL general secretary said we planned to devise a unified curriculum for a better brought-up of our coming generations.\nDr Al-Issa said in light of Riyadh conference, all people would have the rights to practice the religious rituals in accordance with their faith and belief without any reservation.\nHe emphasized that the mutual cooperation between various religions and civilizations was utmost need of the day adding the United Nations had established a global platform to unite the representatives of various religions and civilizations into the matter.\nHe also appreciated Prime Minister’s Special Representative for Interfaith Harmony and Middle East and PUC Chairman Hafiz Muhammad Tahir Mehmood Ashrafi for his unwavering efforts in creating interfaith harmony across the country.\nHe said Ashrafi had left no stone unturned to create religious harmony, brotherhood and tolerance in the society.\nIn the end, he prayed to Allah Almighty to provide him success in his good intention.On this occasion, Ashrafi mentioned that President Dr Arif Alvi had conferred the Hilal-e-Pakistan on MWL Secretary General Dr Al-Issa acknowledging Pak-Saudi friendship and the MWL’s services for Pakistan and the Muslim Ummah.\nPaying tributes on behalf of the government, nation and religious scholars to Dr Al-Issa, he made it clear that Pakistan and Saudi Arabia were tied in unshaken religious and cultural bonds.\nHe assured all out support to the MWL taking steps for the resolution Ummah’s issues.He further said Pakistani nation could go to the last extent for security and sovereignty of Saudi Arabia.\nAshrafi quoted Chief of the Army Staff General Qamar Javed Bajwa as saying that the Pakistan and Saudi Arabia’s defense was correlated. It was pride for us that the Pakistan Army trained Saudi Arabia’s youth, security forces and staffers of various departments, he added.\nMeanwhile Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor lauded the Dr Al-Issa’s efforts for interfaith harmony and projection of soft image of Muslims world-over.\nHe also expressed gratitude to the Saudi government for helping Pakistan in trying times through all possible means besides providing maximum facilities to Pakistani pilgrims during the Hajj 2022.\nThe seminar was attended by Saudi Ambassador to Pakistan Nawaf bin Said Al-Malki, Council of Islamic Ideology Chairman Dr Qibla Ayaz, members of diplomat and minority communities and Ulema and Mashaykh of all schools of thought.\nIn the end, the souvenirs were exchanged with the Saudi dignitaries.",
  "retrievedAt": "2025-08-11T15:42:21.443Z"
}
