{
  "title": "President calls on political parties to resolve issues of economy, elections",
  "link": "https://www.app.com.pk/national/president-calls-on-political-parties-to-resolve-issues-of-economy-elections/",
  "date_published": "2022-10-10T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 10 (APP): President Dr Arif Alvi Monday called on the parties across the spectrum to sit together and resolve issues related to the economy and elections in a bid to end political polarization.\nThe president, in an interview with a private television channel, said dialogue was necessary for settling political issues between the government and the opposition, and the parliament was a suitable place for negotiations, but the same could also be held outside.\nHe said in the first phase, the dialogue could be started among the second-tier leadership of the political parties to remove misunderstandings and bring unity among the public. The people were concerned about the political polarization and one of its causes were different political parties at the helm of affairs at the Centre and in the provinces, he viewed.\nHe said the country was facing multiple issues, including inflation and debt burden. Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan would have to decide about sitting with the government on the issues of economy and election, he added.\nTo a question, Dr Alvi said Article 6 could only be applied to those who either abrogated the Constitution or held it in abeyance with the use of force.\nHe said he had been criticizing the successive governments over the issues of press freedom and the weakening economy, and his criticism was not limited to the present coalition government.\nTo a query, President Alvi said the army was not playing any role in political matters. But the army should play its constitutional role such as it was performing during the natural disasters and recent floods, besides advising the government on foreign affairs, he said in response to another question.\nHe, however, observed that being the biggest stakeholders of the country, the politicians should play their role as they were connected to the people.\nThe president viewed that a broader consultation should be held on the new army chief’s appointment. The government should consult PTI chief Imran Khan on the matter, he added.\nHe said there was a possibility of early elections. Both the Pakistan Democratic Movement and the PTI wanted early polls in the past. Even the Supreme Court had considered the issue of early elections and consulted the politicians.\n“I am trying to evolve an understanding of these issues and I will facilitate the process. The most important issue is the holding of free and fair elections.”\nThe president said for the last 12 years he had been advocating for the use of electronic voting machines in the elections and as it was the only way to stop rigging on polling day. No elections since 1970 had been considered free and fair, he remarked.\nHe said the use of technology was an option to hold transparent elections, as India had been using electronic machines since 1985.\nTo a question, he said Imran Khan got frustrated by the way his government was removed, so he refused to sit in the National Assembly, and instead went back to the people. The PTI could take another decision about its return to the National Assembly, he added.\nDr. Alvi emphasized that the right to protest should be ensured and no issue should be settled through the use of force.\nThe president called for an investigation into the issue of cipher. The Government of Pakistan, he said, had issued a demarche to the United States to convey that the words used in the cipher were not appropriate.\nHe said he was not convinced about a conspiracy for the removal of the government of Imran Khan but sent a letter on the issue of cipher to the chief justice to remove his doubts.",
  "retrievedAt": "2025-08-11T15:42:20.518Z"
}
