{
  "title": "Women in IIOJK immensely tormented by occupation forces: AJK President",
  "link": "https://www.app.com.pk/national/women-in-iiojk-immensely-tormented-by-occupation-forces-ajk-president/",
  "date_published": "2021-03-08T14:35:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 08 (APP):AJK President Sardar Masood Khan has said that as the world is celebrating international Women’s day, thousands of women in Indian Illegally Occupied Jammu and Kashmir (IIOJK) are immensely tormented by occupation of Indian forces.\n“Thousands of women in Kashmir suffer immensely due to the illegal occupation of their motherland.\nSisters have died while saving their siblings, young wives have suffered defending their husbands and mothers have taken their last breath longing for their missing sons,” President said while addressing a 70-member delegation f Air War College of Pakistan Air Force in the federal metropolis on Monday, AJK President office said.\nThe delegation which called on the state president under the leadership of Air Commodore Kashif Jamal Khan was included officers from Jordan, Saudi Arabia, Bangladesh, Sri Lanka, Niger and Egypt.\nSardar Masood Khan said Kashmiri women, children, youth and the old aged people are burning in the flames of a war, which they had not chosen but was imposed upon them. They are molested and objectified to collectively punish for their defiance to illegal Indian rule, he said.\nKhan called upon the world forums and global human rights organizations to help secure the basic rights to IOJK women guaranteed under the Universal Declaration of Human Rights (UDHR) and promised under the Convention on the Elimination of All Forms of Discrimination against Women (CEDAW).\nResponding to various questions asked by the members of the delegation, AJK President said that the actions of August 2019 have exposed India’s false narrative on Kashmir as the international community, members of the UK and the European parliaments, as well as the US Congress, have publicly condemned India for its hegemonic designs.\nWhile apprising the delegation about the history of the liberation of the AJK, President said AJK with its own constitution, president, prime minister and the legislative assembly as well as the independent judiciary is quite distinct from that of Indian Occupied Jammu and Kashmir.\nThe people in Azad Kashmir enjoy all basic rights civil liberties and they are independently struggling to improve their future ahead.",
  "retrievedAt": "2025-08-11T20:27:27.639Z"
}
