{
  "title": "Women’s broad-based inclusion in all spheres a key priority: FM",
  "link": "https://www.app.com.pk/national/womens-broad-based-inclusion-in-all-spheres-a-key-priority-fm/",
  "date_published": "2021-03-08T04:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 8 (APP): Foreign Minister Shah Mahmood Qureshi in Monday said Pakistan would continue to resolutely pursue the full realization of women’s rights, mindful of the challenges but resolved to further build on achievements.\n“The road to women empowerment and gender equality is a long one. Pakistan’s direction, commitment and actions are clear,” the Foreign Minister said in his message on International Women’s Day on March 8.\nThe Foreign Minister said Pakistan, today, joined the international community in celebrating International Women’s Day.\n“It is an occasion to celebrate the progress made in empowering women, and to reaffirm our collective resolve for redoubling efforts to further advance respect for women’s rights,” he said.\nQureshi said Pakistan fully supported this year’s theme of International Women’s Day, “Women in leadership: Achieving an equal future in a COVID-19 world’.\nHe mentioned that during the testing times of the COVID-19 pandemic, women in Pakistan demonstrated remarkable resilience and leadership, effectively contributing to the nation’s response and recovery.\nHe said women stood at the front lines, as health care workers, primary caregivers, innovators, human rights defenders and community organizers Under the guidance of Prime Minister Imran Khan, he said, Pakistan’s landmark Ehsaas emergency cash programme to counter the negative socio-economic impacts of the pandemic was being ably led by a woman.\nThe Foreign Minister said the Constitution of Pakistan upholds the equal status of women and mentioned that “We have made significant advancements in empowering women politically, economically and socially, including through progressive legislative, policy, institutional and administrative measures”.\nHe said ensuring broad-based inclusion of women’s rights in every sphere and at all levels was one of the key priorities of the government.\nAt the international fora, he said, Pakistan’s voice always resonated in favour of women empowerment and gender equality.\nDuring the drafting of the Universal Declaration of Human Rights, Pakistan’s delegate, Begum Shaista Ikramullah, played an active role in the inclusion of Article 16 for the equal rights of men and women to marry and to found family, he added.\nQureshi said despite socio-economic challenges, the number of women in key leadership positions had risen steadily in Pakistan.\nHe said the country had a female Prime Minister, the youngest Nobel Prize winner, the Governor of the State Bank, the Speaker of the National Assembly and numerous women Ministers, Ambassadors, Judges and high-ranking civil servants and diplomats.\nOur women fly fighter jets, serve as UN Peacekeepers, and one of them is now a three-star general in the military, he added.\n“As a nation, we honour and salute their role and contribution to the society and State of Pakistan,” he said.\nThe Foreign Minister said on this day, the plight of women in Indian Illegally Occupied Jammu and Kashmir (IIOJK) could not be forgotten.\nOver the last seven decades, they have endured the worst forms of human rights abuse and oppression at the hands of Indian occupation forces including sexual violence, rape and molestation, he added.\nThe Foreign Minister said these human rights violations had been extensively documented by the Office of the UN High Commissioner for Human Rights in the two Kashmir reports of 2018 and 2019 as well as in various communications and public pronouncements of UN Special Procedures Mandate Holders.\nHe urged the international community to take cognizance of these serious crimes and hold India accountable.",
  "retrievedAt": "2025-08-11T20:27:35.082Z"
}
