{
  "title": "VEON to acquire TPL Insurance - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Jazz has become Pakistan’s first telecommunications company to have a sister insurance company, as VEON Group — the parent company of Jazz — has reached a settlement to acquire shares and management control of TPL Insurance Ltd.\n\nThe development was disclosed by TPL in a notice to the Pakistan Stock Exchange (PSX), while Jazz confirmed that the acquisition would allow it to offer tailor-made insurance products to its customers through digital platforms.\n\nJazz CEO Aamir Ibrahim said the company has been at the forefront of digitising payments in Pakistan, supporting the Prime Minister’s digital economy agenda by promoting the widespread adoption of Raast QR codes.\n\n“Jazz’s ambition is to evolve from a traditional telecom provider to a digital service company, offering a full spectrum of services ranging from broadband and banking to payments, entertainment, and now insurance,” he added.\n\nAcquisition will enable Jazz to offer tailored insurance products\n\nVEON operates in Pakistan through Jazz, JazzCash, and Mobilink Microfinance Bank, collectively serving over 100 million customers across financial services, entertainment, connectivity, and digital platforms.\n\nDespite insurance being often regarded as a luxury rather than a necessity, insurance penetration in Pakistan remains below 1pc of GDP, leaving millions vulnerable to financial shocks from health emergencies, accidents, or loss of life.\n\nJazz currently offers products such as FikrFree Insurance and Healthcare Marketplace, managing more than 10.5 million active insurance policies across over 30 offerings — these range from health and handset insurance to bike coverage, provided through multiple partners.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:04:42.329Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939749/veon-to-acquire-tpl-insurance",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T01:25:13.000Z"
}
