{
  "title": "PSX crosses 154,000 points amid investor optimism despite flood-related risks - Business - DAWN.COM",
  "author": null,
  "content": "The Pakistan Stock Exchange on Friday breached the 154,000-point barrier in intraday trade amid continued investor optimism.\n\nThe KSE-100 index climbed 1,615.05 (1.06 per cent) to stand at 154,280.77 from the last close of 152,665.72 at 3:24pm. The market had opened on a positive note, gaining over 1,000 points by 11am.\n\nFinally, the index closed at 154,277.19, with a gain of 1,611.47 points (1.06pc) compared to the previous session.\n\nAwais Ashraf, research director at AKD Securities, told Dawn.com: “Investors remain optimistic amid improving macroeconomic conditions, particularly the strengthening of the rupee.\n\n“In addition, limited returns in alternative avenues such as real estate, fixed income, commodities, and currency markets make equities a more attractive option,” he added.\n\nThe PSX has witnessed a bullish trend in recent days, despite concerns over risks to the economy due to the ongoing floods, with the Pakistan Business Forum estimating the losses to crops worth billions of rupees.\n\nToday’s gains for a sixth consecutive day follow the government’s treasury bill auc­­tion, which raised Rs491bn against a Rs400bn target.\n\nYousuf M. Farooq, research director at Chase Securities, noted: “The equity market presently reflects the optimism phase of the investment cycle, with selective areas exhibiting signs of incipient euphoria.\n\n“While valuations have normalised relative to the deep undervaluation witnessed two years ago, they are no longer at the exceptionally attractive levels that prevailed during that period,” he added.\n\nHowever, regarding the flood-related risks, he said: “Importantly, the market’s ability to look past the recent floods is a matter of concern, as it signals a potential underestimation of broader macroeconomic and social risks.”\n\nWhile noting that valuations cannot be described as “stretched”, Farooq said they do not offer the margin of safety available earlier.\n\n“For retail investors, this context calls for prudence. Rather than attempting to time near-term fluctuations, a more sustainable approach would be to allocate gradually through systematic investment in mutual funds or by building a diversified portfolio of businesses that are well understood,” he advised.\n\n“The long-term trajectory of wealth creation in equities remains intact, but it requires discipline, patience, and an appreciation of underlying risks rather than speculative positioning.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/05153437eb63e74.webp",
  "retrievedAt": "2025-09-06T10:03:38.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939917/psx-crosses-154000-points-amid-investor-optimism-despite-flood-related-risks",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T11:25:02.000Z"
}
