{
  "title": "Talk of ‘hybrid system’ admission of dictatorship: Justice Minallah - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: Expressing his disappointment with Pakistan’s judicial history since independence, Supreme Court Justice Athar Min­allah on Thursday said that talk of a “hybrid system” in the country actually amou­nted to an admission to the presence of a dictatorship.\n\nSpeaking to the Karachi Bar Association (KBA), the SC judge observed that the only way forward is through the Constitution, adding that every authority had taken an oath to abide by it.\n\nHe argued that the foundation of the Constitution is the people’s right to rule, and set out a simple test: “No institution or government officer should engage in political engineering. Public representatives must come through free and fair elections. But till today this has only remained our dream.”\n\nIn a post on his X account, Defence Minister Khawaja Asif — who had famously spoken about the ‘hybrid system’ in glowing terms — responded to the Supreme Court judge’s remarks later in the day.\n\nPraises those who stuck to their principles despite all odds; says judges ‘allowed themselves to be used’ in Z.A. Bhutto case\n\nAsif pointed out that Mr Minallah had himself served as a provincial minister in the former NWFP government under Gen Musharraf, saying that this was also a “declared martial law”, and called for self-reflection.\n\nIt should be recalled that subsequently, Mr Minallah became one of the leading figures of the lawyers’ movement for the restoration of the judiciary.\n\nIn his remarks at ‘Independence of the Judiciary, Constitutional Governance and Access to Justice: The Way Forward’, a seminar held at the City Courts, Justice Minallah lamented the judiciary’s past failures, while praising those who upheld principles, even at great personal cost.\n\nHe singled out as his heroes five judges of the then-Sindh Chief Court who, in the landmark Maulvi Tamizuddin case, moved to restore the country’s first Constituent Assembly after it was dissolved in 1954 by governor-general Ghulam Muhammad.\n\n“Had those five judges been taken as role models, and had that decision been upheld by the Federal Court at the time, Pakistan would not have seen 77 years of dictatorship; instead, the rule of law would have prevailed,” Justice Minallah said, lamenting that today “people hesitate even to name those judges as their role models”.\n\nThe Sindh Chief Court’s decision in favour of Maulvi Tamizuddin — the assembly’s speaker — was eventually overturned on technical grounds by the Federal Court.\n\nJustice Minallah linked that early precedent to subsequent episodes in which courts, in his view, failed to stand firm.\n\nMusharraf vs SC judges\n\nHe recalled that when Gen Pervez Mus­harraf suspended the Constitution in 1999 and issued a Provisional Constitutional Order, some Supr­eme Court judges refused to take fresh oath.\n\n“Out of those six judges, five belonged to Sindh,” he said. “Some were in line to become chief justice, but they made a principled decision in light of their oath.”\n\nHis remarks come amid strains within the Islam­abad High Court, where judges are split over the new Establ­ishment (Ap­­­p­­ointment and Con­ditions of Service) Rules, 2025. Despite resistance from senior judges, the rules were approved by a narrow majority, while a bid by Justices Babar Sattar and Sardar Ejaz Ishaq Khan to alter the meeting’s agenda was vetoed.\n\n“The 77-year judicial history is not a matter of pride for me,” the judge told the audience, adding that his leaders were those who led the lawyers’ movement,” referring to the nationwide mobilisation that followed the 2007 sacking of the chief justice by Musharraf.\n\n“For the past 77 years, there has been no constitutional governance here,” he said. “In many of my high court judgements, I wrote that there is no rule of law.”\n\nRevisiting Bhutto’s trial\n\nJustice Minallah also revisited one of Pakistan’s most contentious judicial episodes: the 1979 execution of former prime minister Zulfikar Ali Bhutto.\n\nReferring to an interview by General Ziaul Haq, Justice Minallah said the army chief was asked whether judges would be under pressure during the trial of Zulfikar Ali Bhutto. He added that the general replied, “No, that is not the case.” However, Justice Minallah said those very judges later admitted that they had “sent him to the gallows under pressure.”\n\n“But even after 40 years, though the Supreme Court admitted it, no one was held accountable,” he said.\n\nHe further said that in the entire episode, judges were used because they willingly allowed themselves to be used. “Yet even then, three judges dissented,” two of whom belonged to this bar, he said, including Justice Dorab Patel.\n\nSenior lawyer Munir A. Malik, who also spoke at the event, noted that he had the chance to share a platform with Justice Minallah after 18 years.\n\n“I consider Athar Minallah and some judges from Islamabad as an endangered species,” he said, tongue-in-cheek.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:03:47.229Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939778",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T01:24:54.000Z"
}
