{
  "title": "Billions lost: Floods spark agri-emergency call - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Business Forum (PBF) has called for the immediate declaration of an agricultural emergency as widespread flooding devastates large swathes of Punjab and threatens similar destruction in Sindh, jeopardising national food security and economic stability.\n\nIn a letter addressed to Prime Minister Shehbaz Sharif, the forum said preliminary assessments indicated the loss of approximately 60 per cent of the rice crop, 35pc of cotton, and 30pc of sugarcane in central and southern Punjab.\n\nOver 1.8 million people across the Chenab, Ravi, and Sutlej river basins have reportedly been severely affected, with floodwaters now moving southwards along the Indus River.\n\n“The scale of devastation is staggering,” the letter stated, warning that key agricultural targets set for the current fiscal year may now be unattainable. It cautioned that Sindh could soon face a similar catastrophe if immediate preventive measures are not taken.\n\nThe PBF stated that losses have already run into billions of rupees, endangering rural livelihoods and placing additional stress on the broader economy. It emphasised that unless swift, coordinated action is taken, the crisis could spiral into a protracted humanitarian and economic emergency.\n\nPBF warns 60pc of rice, 35pc of cotton and 30pc of sugarcane lost in Punjab; calls for loans, reforms to combat flood devastation\n\nCalling the situation unprecedented, the forum proposed that the federal government officially declare an Agricultural Emergency and initiate immediate relief measures, including the provision of interest-free loans of up to Rs2 million for small and medium-sized farmers to support replantation and recovery efforts.\n\nIt also called for the launch of critical canal infrastructure projects in Punjab and Sindh to improve water management and resilience against future flooding.\n\nWhile appreciating the government’s broader efforts in steering the country through various national challenges, the PBF stressed that the current agricultural crisis required a focused and urgent response. “This is no time for business as usual,” the letter read.\n\nIn addition to emergency aid, the forum recommended longer-term structural reforms. These include removing illegal encroachments along riverbanks, strengthening provincial irrigation and revenue departments, and implementing community-level water storage systems as part of a sustainable flood management strategy.\n\nThe PBF also called for the activation of district price control committees to curb hoarding and profiteering in staple food markets. Anticipating sharp supply shortages, it urged the Economic Coordination Committee (ECC) to authorise the import of wheat and rice through both public and private sector channels to ensure domestic price stability.\n\n“The time for reactive planning is over,” said Khawaja Mehboob ur Rehman, President of the Pakistan Business Forum. “This crisis must be treated as a wake-up call to reform agricultural strategies. We must stop viewing floods purely as disasters and start managing them as resources.”\n\nHe added that the PBF stands ready to work closely with the government in crafting and executing a policy framework aimed at stabilising the agricultural sector and securing the country’s food future.\n\nWith floodwaters still advancing and relief efforts stretched thin, the PBF’s call reflects growing pressure on the federal and provincial governments to take decisive action to mitigate the immediate fallout and avert longer-term agricultural and economic decline.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68ba1912b33c1.gif",
  "retrievedAt": "2025-09-06T10:03:47.375Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939745",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T01:25:13.000Z"
}
