{
  "title": "Two women held for hurling egg at Imran Khan’s sister Aleema in Rawalpindi: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "The police said two women were arrested on Friday for throwing an egg at PTI founder Imran Khan’s sister Aleema Khanum during a media talk in Rawalpindi outside the Adiala Jail, where a hearing of the Toshakhana case was held earlier.\n\nFootage of the incident was widely shared on different news channels and social media accounts, capturing the expression of shock on Aleema’s face when the egg was hurled at her.\n\nAn egg was thrown at PTI founder Imran Khan’s sister Aleema Khanum on Friday while she was holding a press conference in Rawalpindi. The footage of the incident was widely shared on different news channels and social media accounts, capturing the expression of shock on Aleema’s face when the egg was hurled at her. DawnToday\n\nA statement released by the Rawalpindi Police said that the two arrested suspects were PTI supporters, who had travelled to Rawalpindi with other members of the All Government Employees Grand Alliance and the All Pakistan Clerks Association to protest for their unmet demands.\n\n“The egging took place when Aleema Khan did not answer the questions raised by the two women,” the statement said. “They have been taken into police custody and sent to the Adiala checkpoint.”\n\nThe police added that immediately after throwing the egg, the two women tried to run away in their car. “However, their vehicle was surrounded by PTI supporters, some of whom also hurled pebbles at the car and broke the windscreen.”\n\nLater, the PTI reposted a video of a white car on X, dubbing the incident a “shameful attack on Aleema Khan”.\n\nIn a statement posted in a preceding post, the party said PTI workers chased the women right after they hurled an egg at Aleema Khan but police “facilitated them in escaping along with a car as part of a plan”.\n\nThe statement also claimed that the women were sent to the media talk “as part of an agenda”. The party further stated that they had the registration number of the car seen in the video. It also demanded the registration of a first information report of the “attack on Aleema Khan”.\n\n“We strongly condemn such dirty tricks in politics without discrimination. There is opposition in politics, but within the circle of civility,” said Defence Minister Khawaja Asif on X while criticising the PTI for the past actions of its own party supporters towards politicians.\n\nPlanning Minister Ahsan Iqbal said he unequivocally condemned the incident. “Politics must remain a contest of ideas, not of violence or hatred. We should all work to keep it healthy and respectful.”\n\nMinister of State for Interior Tallal Chaudhry said the PTI faced the reckoning of its own past actions. Nonetheless, he said: “Politics runs on differences of opinion, but these differences should be expressed with political decorum. The expression of disagreement should not involve rudeness or incivility.”\n\nSenior PML-N leader Khawaja Rafique slammed the incident as a “shameful, vile and crude act!”\n\n“Shameful! The attack on Aleema Khan is appalling. Even in enmity, a woman deserves dignity. Targeting women is the lowest form of politics and this cheap stunt must be condemned in the strongest words,” said Balochistan National Party-Mengal chief Akhtar Mengal.\n\nSindh Senior Minister Sharjeel Memon too condemned the attack, saying political differences should never justify disrespectful behaviour.\n\nAleema has been campaigning for her brother’s release since August 2024.\n\nImran, imprisoned since August 2023, is serving a sentence at the Adiala Jail in the £190 million corruption case and also faces pending trials in May 9 cases under the Anti-Terrorism Act.\n\nIn November 2014, a plot to attack Imran with rotten eggs and tomatoes was foiled in Gujranwala. Earlier that day, TV channels had reported that angry PML-N activists were purchasing and gathering rotten eggs, tomatoes and shoes to hurl at the PTI founder.\n\nThe eggs and tomatoes were shown covered with the slogan ‘Ro Imran Ro’ (Cry Imran Cry). When the news had aired, local police took action and arrested four PML-N activists who confessed that they had planned to target Imran on Nowshera Road.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/05144654f72cc85.webp",
  "retrievedAt": "2025-09-06T10:03:39.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939910/two-women-held-for-hurling-egg-at-imran-khans-sister-aleema-in-rawalpindi-police",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T09:47:22.000Z"
}
