{
  "title": "India blocks Austrian economist’s X account over ‘dismantle India’ post: report - World - DAWN.COM",
  "author": null,
  "content": "Authorities in India banned the X account of an Austrian economist after he shared a map showing Khalistan having been carved out of India and called for “dismantling India”, the local media reported on Friday.\n\nThe Khalistan movement is a Sikh separatist movement seeking an independent state for the religious minority carved out of Indian territory. It is considered a security threat by the Indian government.\n\nThe economist, Gunther Fehlinger-Jahn, appeared to be calling for the creation of Khalistan in his post on X, stating: “I call to dismanlte India into ExIndia. Narendra Modi is Russia’s man. We need friend of freedom for @KhalistanNet.”\n\nThe map also seemed to be implying the separation of various other regions of India.\n\nAccording to NDTV, India’s Ministry of Home Affairs and Ministry of Electronics and Information Technology “flagged the viral post and directed X to withhold access to the account for Indian users. The account has since been disabled in India”.\n\nThe report added that the post resulted in “angry reactions” on social media.\n\nThe post came after Modi met with the Russian President Vladimir Putin during the Shanghai Cooperation Organisation (SCO) summit in China earlier this week.\n\nSharing a picture of their interaction in another post on Monday, Fehlinger-Jahn stated: “I call for ExIndia. India is now a hostile state to [the] Free World. We must boycott India now! … No Visa for Indians as long as Putin’s friend Narendra Modi stays in power.”\n\nHehlinger-Jahn, as per his X and Linkedin, poses as the chairman for an “Austrian committee” the enlargement of the North Atlantic Treaty Organisation (Nato).\n\nHowever, a Google search did not bring up any results for such a committee.\n\nIn September 2023, Hehlinger-Jahn remarked about Armenia — whose relations with Russia have been strained in past few years — needing to join the Nato, according to Tass news agency.\n\nIn a post earlier today, Hehlinger-Jahn also called for the “fall of [Russian President Vladimir] Putin and the break up of Russia”.\n\nAccording to a Reuters report in May, Putin’s conditions for ending the war in Ukraine include a demand that Western leaders pledge in writing to stop enlarging Nato eastwards.\n\nNew Delhi purchases oil from Moscow and after meeting Modi earlier this week on the sidelines of the summit in China, the Russian president reiterated the need for the issue of Nato’s eastward enlargement to be addressed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/051317347174c02.webp",
  "retrievedAt": "2025-09-06T10:03:40.097Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939891/india-blocks-austrian-economists-x-account-over-dismantle-india-post-report",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T09:56:40.000Z"
}
