{
  "title": "Hundreds waiting to be rescued in Ahmedpur Sial - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK Singh: Hundreds of people were still trapped in floodwaters from the river Chenab in Ahmedpur Sial tehsil of Jhang district while the rescue teams, including those of the Pakistan Army and district administration, are busy in evacuation and relief operations.\n\nA former nazim of Gudara union council, Intikhab Khan Sial, told reporters on Thursday that hundreds of residents of the flood-hit villages of Samanduana, Chak Nori Shah, Namdar Sial, Chadhar, Mouza Waga and Char Yari of Ahmedpur Sial tehsil, are currently waiting to be rescued.\n\nA local politician, Khan Nawazish alleges that the unexpected flood situation in Ahmedpur Sial was created due to a wrong breach made in a road, also used as a spur, near Sultan Bahoo bridge. He claimed that more than 8,000 people were trapped in floodwaters, waiting to be rescued at the earliest.\n\nHe says the river Ravi’s floodwater also affected the Samundana union council, already flooded by the overflowing Chenab. He adds that the floodwater could not be diverted to the river’s main course so that it could move downstream towards Khanewal and Multan.\n\nMeanwhile, a press release issued by the Jhang district administration spokesperson says that Commissioner Raja Jehangir Anwar, RPO Zeeshan Asghar, Jhang DC Ali Akbar Bhinder and DPO Bilal Iftikhar Kiani were in Ahmadpur Sial to supervise the rescue operations.\n\nIt says that 51 boats of Rescue 1122, 22 of the Pakistan Army and 58 privately-owned large boats were being used in the rescue operations.\n\nIt adds that despite extremely difficult conditions, the rescue teams remained busy inevacuating people and livestock in the river belt late on Wednesday night.\n\nIt says that medical services were also being provided in the relief camps by the ‘Clinic on Wheels’ programme vehicles.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/09/68b779ce89e17.jpg",
  "retrievedAt": "2025-09-06T10:03:52.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939826/hundreds-waiting-to-be-rescued-in-ahmedpur-sial",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T03:15:51.000Z"
}
