{
  "title": "FIFA to use dynamic pricing for World Cup ticket sales - Sport - DAWN.COM",
  "author": null,
  "content": "ZURICH: Dynamic pricing will be in operation during the first phase of ticket sales for the 2026 World Cup, with fans paying different prices according to market demand and seats starting at $60, FIFA said on Wednesday.\n\nFans will have their first chance to secure tickets for next year’s World Cup in the United States, Canada and Mexico during the Visa Presale Draw, opening on Sept 10, at 1100 ET (1500 CET) and running until Sept 19.\n\nOpen to qualifying Visa cardholders, tickets for group-stage matches will start at $60, with pricing for later stages, including the final, reaching up to $6,730, FIFA said.\n\nWe have approximately one million tickets available for the first Visa presale draw phase, Falk Eller, FIFA’s Director of Ticketing and Hospitality, told reporters.\n\nHe added that prices would vary based on market demand, a strategy known as dynamic pricing or surge pricing.\n\nDynamic pricing is commonly seen in airline ticket prices and hotel room rates during holiday seasons.\n\nYet it led to complaints from fans of British band Oasis who waited in long queues to get their hands on tickets for this year’s reunion shows only to find that prices had been hiked as part of a “dynamic pricing” scheme.\n\nThe presale will be followed by additional sales phases later in the year.\n\nQualifying Visa cardholders can enter the presale draw by logging into their FIFA accounts during the entry period. A randomised selection will allocate time slots for ticket purchases, though FIFA emphasised that a successful draw entry did not guarantee ticket availability.\n\nFIFA plans to introduce an official resale platform later this year, allowing ticket holders to resell their tickets securely. Eller noted that prices on the resale platform would not be capped, citing the need to compete with unofficial resale outlets and ensure a regulated environment.\n\nFor Mexican residents, FIFA has partnered with PROFECO to offer a resale platform that complies with local legislation, allowing tickets to be sold at their original face value.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:00:24.032Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939793/fifa-to-use-dynamic-pricing-for-world-cup-ticket-sales",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T01:25:23.000Z"
}
