{
  "title": "Ex-PM Shahid Khaqan Abbasi blames govt for sugar crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Former prime minister and convener of the Awam Pakistan Party (APP) Shahid Khaqan Abbasi on Thursday said the governments that are not representative of the people care only for themselves, not for the citizens.\n\n“The government manipulated sugar prices by managing the supply of imported sugar verses locally produced sugar. As a result, Rs300-400 billion were taken out of the pockets of ordinary citizens and transferred into the hands of sugar mill owners,” Mr Abbasi said, addressing a news conference.\n\nHe added that government policies had provided undue benefits to sugar mill owners, while the beverages industry and other factories were forced to buy sugar at higher rates.\n\nHe claimed that even today an additional Rs1bn was going to sugar mill owners through the sale of costly sugar in the retail markets. The government, parliament and price control committees have failed to protect the consumers from this extortion.\n\n“This is the state of governance in country,” Mr Abbasi remarked, adding, “The price of sugar has increased by 50 per cent in one year.”\n\nAccuses NAB of protecting corrupt business practices instead of holding mill owners accountable\n\nThe former premier asked: “Will anyone answer for this sugar price hike?” He said that those in the government should at least admit their mistake, adding that NAB’s job seemed to be protecting corr­u­pt business practices in the country. The APP convener further said that the job of governments was to provide facilities to the people, but, successive governments had failed and caused economic hardships.\n\nHe said that the time to control markets through administrative efforts was over and added that if the price of sugar increases by just one rupee, Rs7bn are taken away from people.\n\nHe pointed out that there was a sugar monitoring committee of the cabinet and at least seven to eight other committees responsible for sugar price control.\n\n“Despite so many committees, the price of sugar went up. When there was already a shortage in the country, why did the government allow its export?” he asked.\n\n“The strange part is that while the private sector was exporting sugar, the government was importing it— and at prices higher than the international market,” he added. He concluded that sugar had not only become more expensive but had also grown scarce in the markets.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/05112603bbf39a7.webp",
  "retrievedAt": "2025-09-06T10:23:30.957Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939754/ex-pm-shahid-khaqan-abbasi-blames-govt-for-sugar-crisis",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T01:25:07.000Z"
}
