{
  "title": "Journalists, rights activists decry curbs on press freedom - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Journalists and rights activists have expressed deep concerns over the growing restrictions on press freedom in the country, with some comparing the current situation to the media censorship witnessed during General Ziaul Haq’s military rule.\n\nThe concerns were raised during events held in the capital on Thursday to pay tributes to Nisar Osmani and CR Shamsi, two veteran journalists and trade unionists, who fought for press freedom and journalists’ rights during martial law regimes.\n\nAt a seminar at the National Press Club, current and former office-bearers of the Pakistan Federal Union of Journalists (PFUJ) and Rawalpindi-Islamabad Union of Journalists (RIUJ) paid tribute to Nisar Osmani and CR Shamsi, highlighting their struggles for a free press.\n\nAnother event was held outside the Dawn offices where the journalists, politicians and rights activists also held a candlelight vigil to pay homage and remember the two trade union leaders.\n\nThe speakers emphasised the need for unity among journalists to collectively resist the government’s measures to suppress freedom of expression. They also vowed to resist the curbs in media and put up struggle against the controversial laws, such as the recent amendments to the Prevention of Electronic Crimes Act, known as Peca.\n\nThe speakers noted that the current climate of fear and intimidation was stifling independent journalism, with many reporters facing harassment, abduction, and assault for doing their job. They were of the view that a free press was essential for a functioning democracy.\n\nThe speakers highlighted that late Osmani was a vocal critic of authoritarian governments, especially General Zia Haq’s dictatorship, when most voices were silenced, and he advocated consistently for press freedom, democracy, and civil liberties, even at great personal risk.\n\nThe speakers also expressed concerns over the closure of roads leading to the NPC and also termed it an attempt to “besiege” the journalists.\n\nThose who attended the two events included PFUJ president Afzal Butt, former secretary general Nasir Zaidi, NPC president Azhar Jatoi, RIUJ president Tariq Virk, senior journalists Fauzia Shahid, Asif Bashir Chaudhry, Mubarak Zeb Khan, Tariq Usmani, former NPC president Shakeel Qarar, head of the PPP Human Rights Cell Farhatullah Babar, and information secretary Tariq Ghouri.\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:01:11.119Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939832/journalists-rights-activists-decry-curbs-on-press-freedom",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T03:21:30.000Z"
}
