{
  "title": "Aid flows as country reels from floods - Newspaper - DAWN.COM",
  "author": null,
  "content": "• UK announces another £1.2m for Sindh; UN allocates $600,000 from Regional Humanitarian Fund\n• Health ministry warns of cholera, typhoid, and dengue risks from contaminated water and stagnant pools\n• No immediate desert locust threat, despite ideal rain conditions: UN report\n\nISLAMABAD: As severe flooding devastates the northern region and Punjab, with impending threats to Sindh, the international community, including the United Kingdom and the United Nations with their partners, has stepped up to aid the flood-stricken areas by releasing funds to expedite relief efforts and enhance disaster preparedness across Pakistan.\n\nThe United Kingdom on Thursday announced an additional 1.2 million pounds to help the government’s coordinated response and assist communities in Sindh prepare before disaster strikes.\n\nAccording to a press release from the British High Commission, the new funding brings the UK’s total humanitarian assistance to £2.53m, providing life-saving support to over 400,000 people.\n\nThe new funds are being deployed to non-governmental organisations in Sindh to enable early warning systems, community evacuations, pre-positioning of essential supplies and the protection of livestock.\n\n“Sindh is in a critical window to prepare and reduce the impact of the upcoming floods,” British High Commissioner Jane Marriott said. “For every dollar spent on prevention, up to seven dollars are saved in response. More importantly, lives are saved, and destruction is avoided.”\n\nThis aid complements £1.33m announced on Aug 22 for early response and relief efforts in Khyber-Pakhtunkhwa, Punjab and Gilgit-Baltistan. That support includes providing dry food rations, search and rescue operations, mobile medical camps and restoring irrigation channels.\n\nAdditionally, the UK has contributed £500,000 to the Start Ready Disaster Risk Financing system in Pakistan. The funds have been released to reach 20,000 people across Punjab, Sindh and KP to anticipate and mitigate humanitarian impacts from future flooding.\n\nUN aid\n\nThe United Nations and its partners are also working closely with Pakistani authorities to assess the humanitarian impact of the floods and identify needs.\n\nEmergency Relief Coordinator Tom Fletcher has released $600,000 from the Regional Humanitarian Pooled Fund to support relief and recovery efforts, according to a statement released by the UN Information Centre in Islamabad.\n\nUN Secretary-General Antonio Guterres expressed his condolences and solidarity with Pakistan. He commended the Pakistani authorities for relocating more than one million people in Punjab, according to the statement attributed to his spokesperson, Stephane Dujarric.\n\nHealth advisories\n\nMeanwhile, the Federal Ministry of Health has released advisories to combat the heightened risk of disease outbreaks.\n\nThe ministry’s research body, the National Institutes of Health (NIH), has warned that extensive water contamination and disease-carrying vectors pose a severe threat to public safety.\n\nThe ministry stated that floodwater has contaminated supplies, raising the risk of a surge in diseases like cholera and typhoid. Additionally, vast areas of stagnant water have created ideal breeding grounds for mosquitoes, increasing the potential for Dengue Fever, Chikungunya and Malaria.\n\nThe advisories, available on the ministry and NIH websites, provide guidance on preventing and controlling vector-borne, food-borne, water-borne, vaccine-preventable diseases and conjunctivitis. A statement issued by the ministry urged all citizens to follow established safety protocols.\n\nNo locust threat\n\nSeparately, a United Nations Food and Agriculture Organisation (FAO) report released on Thursday states that Pakistan faces no immediate threat of locusts.\n\nThe FAO’s “Desert Locust Bulletin” sta­ted that surveys in August found no locusts in key summer breeding areas, and while very small-scale breeding may still occur, “no significant developments are expected”.\n\nIkram Junaidi in Islamabad also contributed to this report\n\nPublished in Dawn, September 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/050815416469f92.webp",
  "retrievedAt": "2025-09-06T10:03:46.330Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939761",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T01:25:01.000Z"
}
