{
  "title": "Justice Shah asks CJP Afridi to publicly answer 6 questions on ‘pressing institutional concerns’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Supreme Court Justice Mansoor Ali Shah has written a letter to Chief Justice of Pakistan (CJP) Yahya Afridi asking him to publicly answer six questions regarding “pressing institutional concerns”, it emerged on Friday.\n\nIn a letter dated Thursday, seen by Dawn.com, Justice Shah said he was reluctantly writing it in “discharge of an unavoidable institutional duty”, adding that what compelled him was “your (CJP’s) persistent and complete indifference”.\n\nThe judge wrote that his “repeated letters and written communications to you (CJP) on the undermentioned issues have gone unanswered and undiscussed; not once have I received a reply-neither in writing nor verbally”, adding that such silence from the chief justice to the senior puisne judge was “not merely discourteous; it undermines the collegial traditions of this court and violates the institutional courtesy without which a constitutional court cannot function”.\n\nJustice Shah said that with the new judicial year commencing from Monday, CJP Afridi had convened a judicial conference to review the reforms undertaken under his leadership and to lay down priority areas for the coming year.\n\n“It is therefore both timely and opportune that the institutional concerns I raise in this letter be addressed squarely by you in that forum. By doing so, you will not only respond to the questions that remain unanswered but also reassure the judges of this court, the bar and the public we serve that your vision of reform is grounded in collegiality, transparency, and fidelity to the Constitution.”\n\nThe questions the judge asked the CJP to answer were:\n\nJustice Shah said the letter must not be construed as a “personal grievance”.\n\n“The concerns I now raise do not come from indolence or neglect, but from a judge who has consistently and conscientiously performed his duty. They are, therefore, institutional concerns borne of experience and responsibility rather than personal complaint,” he explained.\n\nJustice Shah said that he trusted CJP Afridi to use the judicial conference as a “moment of institutional renewal by answering these questions and reaffirming the principles of collegiality and constitutional fidelity”.\n\nJustice Shah said the questions were those that struck at the “heart of independence” and not only the apex court judges, but also the nation, were looking towards CJP Afridi “not for silence but for clarity”.\n\nElaborating on his questions, Justice Shah said the Supreme Court (Practice and Procedure) Act, 2023, was enacted by the apex court to put an end to the “one-man show” in the formation of benches.\n\nHe pointed out that it required that all causes, matters, petitions, appeals or reviews be placed before benches constituted by a committee under the act, adding that its purpose was “clear”: to review pending cases, devise a transparent case-management plan, categorise cases intelligently and allocate them to benches through collective deliberation.\n\n“Yet, since your assumption of office in October 2024, not a single official meeting of the PaPA Committee has been convened. Bench formation and cause lists are being issued unilaterally, without any committee deliberation. Rosters are circulated for signatures, expecting members to endorse them blindly without discussion of case allocation or categorisation. As a senior member of the committee, I have had no opportunity to participate in its work as mandated by law.\n\n“This is a direct violation of the act and raises serious concerns. Why are junior judges regularly assigned to three-member benches while senior judges are confined to two-member benches? Why are matters of national importance with far-reaching policy implications not fixed before senior benches? The pattern suggests that independent judges are being sidelined, not for reasons of efficiency, but for reasons of control.”\n\nJustice Shah said that minutes of five “committee meetings” displayed on the court’s website could not “cure this defect”, arguing that “they were not committee meetings within the meaning of the act but mere discussions about the chief justice’s travel schedule. Even then, their minutes were uploaded in violation of a binding majority decision of the committee. I had recorded my dissent on that occasion, arguing for transparency, but it was disregarded. This is symptomatic of a mindset averse to collegiality and inclined towards dictation.”\n\nThe judge rued that “the genie of the ‘one-man show’, which Parliament sought to bury through legislation, has been released once again”, adding that that was the reason why he had ceased signing the rosters circulated without any meeting.\n\n“By sidelining the committee and withholding even basic information (such as the number of cases to be dealt with or those fixed before larger benches), you have reduced a statutory mechanism of collective decision-making into a façade.\n\n“The result is evident: despite the increase in the number of judges, the court’s pendency remains at 57,455 cases. The very purpose of enhancing the court’s strength — reducing backlog — stands defeated. The unavoidable inference is that enlargement of the court was less about addressing pendency and more about altering its internal balance, thereby diluting the independence and standing of existing judges.”\n\nRegarding the revision of the apex court’s rules, Justice Shah said they were a constitutional document that governed the institution’s functioning and their first revision in four decades was an event of “historic significance”.\n\nHe argued that such a process required a Full Court meeting on the administrative side. “Instead, you chose to approve the draft rules by circulation — a process suited to routine matters, not to reshaping the court’s constitutional framework.\n\n“By avoiding deliberation, you deprived the court of collective wisdom and diminished judicial dialogue. This course reflects a lack of collegiality and a preference for unilateral authority.”\n\nRegarding dissenting opinions, Justice Shah said the court’s recent policy on releasing them with the majority judgment was approved through a unique process of soliciting the views of individual judges by the registrar.\n\nHe said there was no “legal or institutional basis for individual opinion-gathering on such critical matters”, unless specifically authorised by the Full Court, and even then, only for matters that were procedural or minor in nature.\n\nJustice Shah said the above exercise could not be treated as a substitute for Full Court deliberation, nor could responses to this letter be used to formulate policy in isolation.\n\n“A matter of jurisprudential weight was reduced to a secretive tick-box exercise and the court was denied the richness of open deliberation.\n\n“A Full Court meeting is not merely a procedural formality — it is the bedrock of judicial collegiality. It allows all judges of this court to come together, to deliberate, to exchange ideas and, through open dialogue, to persuade or be persuaded. In such a forum, a judge may revise or refine their view after hearing their colleagues, or may help develop a collective wisdom that is far more robust than isolated responses. This essential element of judicial democracy is entirely lost when opinions are sought in writing and in silos.”\n\nJustice Shah said that the GSO dated July 29, 2025, was the “first time” in the court’s history that something had dictated that judges were “whole-time” at the state’s disposal, adding that this was language “wholly alien” to a constitutional court.\n\n“Judges are not regimented officers; their independence is constitutionally entrenched.”\n\nThe judge said the GSO had confined foreign leaves to five categories, but this was a restriction not envisaged in Presidential Order No. 2 of 1997.\n\n“In principle, leave can, if at all, only possibly be considered for refusal where: (i) a part-heard case cannot be adjourned; (ii) urgent administrative duty demands presence; or (iii) a judge is negligent in work and seeks leave to evade it. Yet, in practice, leave is being denied even when none of these circumstances exist-apparently to enforce compliance and control, and to prevent independent judges from speaking at international forums. Such arbitrary denials betray a deep institutional insecurity.”\n\nJustice Shah further railed that the newly introduced requirement under the GSO that a judge must disclose his residential address and contact details was “alien” to the practice of constitutional courts worldwide.\n\n“It borrows from the ethos of civil-service bureaucracy and attempts to transplant it into the judiciary, with deeply corrosive consequences. A judge of this court is not a supervised functionary of the state but a constitutional actor whose independence is both decisional and personal. To compel disclosure of a judge’s private residence is not administration — it is surveillance. It reduces the dignity of the office to that of a monitored employee and cloaks an instrument of control in the garb of procedure.\n\n“No constitutional court of repute — the US Supreme Court, the UK Supreme Court, or the Constitutional Court of South Africa — has ever imposed such a condition. You may not realise it, but by imposing it here, you are striking at the very independence of this court. A judiciary under watch ceases to be a judiciary; it becomes an extension of bureaucracy. Kindly note that no apex court of repute across jurisdictions mandates such disclosure, precisely because the ethos of independence demands institutional courtesy, not surveillance.”\n\nThe senior puisne judge pointed out that the GSO had been “weaponised to create a judicial ‘exit control list’”.\n\nHe noted that leave was no longer a matter of “respect and consultation but of bureaucratic obstruction”, adding that it was an “authoritarian impulse that undermines judicial independence”.\n\nThe judge further pointed out that “disturbingly, these rigid policies bear the imprint of the civil bureaucracy. The registrar — a retired civil servant — appears to be driving an agenda alien to the ethos of a constitutional court. Judges are not governed by the logic of command and control but by independence and collegiality. Judges are not mere agents of government; they are guardians of the people’s liberties.”\n\nLastly, Justice Shah said the apex court and CJP Afridi’s legitimacy “hangs in the balance” in the pending petitions challenging the 26th Amendment.\n\nHe pointed out that the petitions remained unheard for nearly a year, though they concerned the Supreme Court’s independence.\n\n“They must be heard by the original Full Court, excluding judges elevated after the amendment. Until then, any initiative under your leadership remains institutionally fragile, for its foundation is constitutionally suspect. True leadership lies not in managing compliance but in ensuring that the court rises above suspicion as the fearless guardian of the Constitution,” the senior puisne judge concluded.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/05200834180856a.webp",
  "retrievedAt": "2025-09-06T10:03:33.788Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939976/justice-shah-asks-cjp-afridi-to-publicly-answer-6-questions-on-pressing-institutional-concerns",
  "dateList": "2025-09-05",
  "date_published": "2025-09-05T15:38:48.000Z"
}
