{
  "title": "Swiatek recovers against Keys to reach Madrid Open semis - Sport - DAWN.COM",
  "author": null,
  "content": "MADRID: Iga Swiatek kept her Madrid Open title defence alive, as she avenged her Australian Open defeat to Madison Keys with a 0-6, 6-3, 6-2 win against the American in the quarter-finals on Wednesday.\n\nThe second seed will next square off with Coco Gauff, who beat 18-year-old Mirra Andreeva for the third time in as many meetings, 7-5, 6-1.\n\nSearching for her first title of the season, the second-seeded Swiatek recovered from a poor opening set to improve her clean record on clay against Keys to 4-0 and reach a third consecutive Madrid semi-final.\n\nKeys knocked out the Pole on her way to a maiden Grand Slam title in Melbourne three months ago and seemed to have cracked the Swiatek code when she handed her a bagel in the first set on Wednesday.\n\nBut Swiatek, who was contesting a 17th consecutive quarter-final on clay, cut down on her errors and struck back to book a last-four clash with Gauff.\n\n“It was one of the weirdest matches I played,” said Swiatek on court.\n\n“Madi was playing perfectly at the beginning. I just tried to play a bit shorter, put the ball in. I just stayed in there.”\n\nSwiatek is famous for dishing out 6-0 sets and it was unusual for the five-time Grand Slam champion to be on the receiving end of one.\n\n“It didn’t feel good. At least it’s fast, you know, but that’s the only positive thing,” she said.\n\nOn court in the Arantxa Sanchez stadium, Gauff saved two set points while receiving at 4-5 before seizing a one-set lead after 63 minutes of play against Andreeva.\n\nGauff cruised in the second set to dismiss the seventh-seeded Russian and reach her first semi-final of the year — outside of the mixed team United Cup event.\n\nThe fourth-seeded American gave herself a 9/10 grade for her performance, adding: “I think I played really well and stayed composed, even when facing those set points.\n\nElsewhere, Elina Svitolina extended her winning streak to 11 consecutive matches with a swift 6-2, 6-1 rout of Japan’s Moyuka Uchijima in just 52 minutes.\n\nA champion in Rouen last week, Svitolina is undefeated on clay this season and is the first Ukrainian woman to reach the semi-finals in Madrid. The 30-year-old has won her last 22 consecutive sets on the red dirt.\n\nIn ATP action, Novak Djokovic’s conqueror Matteo Arnaldi earned multiple top-20 wins in one event for the first time by knocking out 16th-seeded Frances Tiafoe 6-3, 7-5 to move into the Madrid quarter-finals.\n\nThe Italian world number 44 will take on Jack Draper, who reached his first Masters 1000 quarter-final on clay with a 6-2, 6-2 result against world number 12 Tommy Paul.\n\nOn Tuesday, world No 2 Alexander Zverev was knocked out of the tournament in the round-of-16 by Argentina’s Francisco Cerundolo. Cerundolo, ranked 21, beat the German — a two-time former winner in Madrid — 7-5, 6-3 to repeat his feat from last year.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6812dd155e717.jpg",
  "retrievedAt": "2025-08-23T08:10:22.035Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907722/swiatek-recovers-against-keys-to-reach-madrid-open-semis",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T02:36:00.000Z"
}
