{
  "title": "Tax target missed by Rs831bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) missed its collection target by nearly Rs831 billion in the first 10 months of the current fiscal year, mainly due to a decline in import volume and lower-than-expected inflation, which hit sales tax collections.\n\nThe FBR collected Rs9.299 trillion in July-April FY25 against the budgetary target of Rs10.130tr. However, the collection is 27 per cent higher than the year-ago figure Rs7.350tr.\n\nOn a monthly basis, the FBR collected Rs846bn in April against the target of Rs963bn, indicating a shortfall of Rs117bn. However, according to provisional data released on Wednesday, the collection is 30pc higher than Rs651bn collected a year ago.\n\nA tax official said that despite low inflation and an economic slowdown, revenue collection saw a notable increase of 30pc in April thanks to enhanced enforcement efforts, particularly within the sugar sector and a few other sectors.\n\nFBR raises Rs9.29tr in July-April\n\nThe IMF has revised the FBR revenue collection target for FY25, decreasing it to Rs12.333tr from Rs12.913tr, marking a reduction of Rs580bn. The IMF expressed readiness to adjust the target further downward. However, the prime minister insists that the FBR intensify its efforts to meet the target.\n\nThe shortfall is primarily attributed to reduced import tax collection, sluggish manufacturing growth and unexpectedly low inflation, which has dropped to the lowest single digits in decades.\n\nThe FBR paid Rs427bn in refunds to taxpayers in 10MFY25, up 1.18pc from Rs422bn in the same period last year. However, Rs43bn was refunded in April, almost the same amount as last year.\n\nIn July-April, income tax collection totalled Rs4.479tr, exceeding the target of Rs4.152tr by Rs327bn. The income tax collection grew 28pc compared to last year’s Rs3.505tr.\n\nThe sales tax collection fell short of the target by Rs774bn in 10MFY25, totalling Rs3.174tr against the target of Rs3.948tr. The sales tax collection rose 27pc compared to last year’s Rs2.498tr.\n\nThe customs collection also fell short of the projected target by Rs228bn to Rs1.043tr in 10MFY25 against the target of Rs1.271tr. The customs collection recorded a growth of 17pc when compared with last year’s Rs894bn.\n\nThe Federal Excise Duty collection fell short of the target by Rs156bn to Rs603bn in 10MFY25. The excise duty recorded a growth of 33pc over last year’s Rs453bn.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:10:22.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907709/tax-target-missed-by-rs831bn",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T02:08:49.000Z"
}
