{
  "title": "UN launches heatwave contingency plan as temperatures soar - World - DAWN.COM",
  "author": null,
  "content": "• $830,000 in pre-arranged funds allocated for 12 high-risk districts\n• Karachi, Hyderabad, Sukkur, Jaffarabad, Sohbatpur, Nasirabad identified as hotspots\n\nISLAMABAD: The United Nations has launched a comprehensive ‘Heatwave Contingency Plan’ for Pakistan, targeting areas most vulnerable to extreme heat.\n\nAccording to the United Nations Office for the Coordination of Humanitarian Affairs (UNOCHA), which prepared the plan, anticipatory action efforts in Pakistan are closely aligned with the ‘Inter-sectoral Heatwave Contingency Plan’ and are being further reinforced through OCHA’s coordination role.\n\nBy working in close collaboration with provincial disaster management authorities (PDMAs) and humanitarian partners, the OCHA is facilitating joint planning, mapping of heatwave response efforts and fostering collective preparedness.\n\nIn 2025, pre-arranged fuel funding amounting to $829,728 has been secured to support the readiness and activation phases of heatwave response activities. These interventions aim to reach around 776,000 people across 12 high-risk districts in Sindh, Balochistan and Punjab. Anticipatory actions will be triggered based on pre-agreed thresholds and guided by established action plans.\n\nThe ‘Global Climate Risk Index’ has ranked Pakistan as the fifth most vulnerable country to climate change, highlighting its high exposure to extreme weather events and the resulting economic and human impacts. This ranking indicates that Pakistan is significantly exposed to the effects of climate change, particularly extreme weather events, such as floods and heatwaves.\n\nA mild to moderate heatwave occurs when the daily maximum temperature is three to five degrees Celsius above the normal maximum temperature for a duration of three to five days, which can lead to physical and mental health issues like fatalities and hospitalisation, according to UNOCHA.\n\nLocal factors such as humidity, wind speed, air pressure, population sensitivity and acclimatisation play a role in determining the influence of a heatwave. Urban areas with populations over one million are typically one to three degrees warmer than surrounding areas.\n\nUrban areas — particularly Karachi, Hyderabad, and Sukkur in Sindh and Jaffarabad, Sohbatpur, and Nasirabad in Balochistan — are at high risk and require heat management strategies and public awareness to protect vulnerable populations.\n\nUnder the contingency plan, a total of 38 districts will be targeted in all the four provinces with an estimated affected population of 36.08 million. Sindh will be most affected by the heatwave, followed by Punjab, Khyber Pakhtunkhwa and Balochistan.\n\nBased on the 2024 heatwave situation, the UNOCHA has observed that despite recurring heatwaves, urban areas like Karachi lack effective early-warning systems to mitigate heat-related deaths.\n\nThe absence of affordable cooling technologies, public cooling centres and hydration points exacerbates heat risks in urban settings, it said, calling for subsidies for affordable cooling technologies, public cooling centres in high-density areas, and water kiosks in urban and rural locations.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6812ace6b9387.jpg",
  "retrievedAt": "2025-10-12T02:49:43.845Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907644/un-launches-heatwave-contingency-plan-as-temperatures-soar",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T00:04:10.000Z"
}
