{
  "title": "US-Iran talks postponed, new date depends on US approach, Iranian official says - World - DAWN.COM",
  "author": null,
  "content": "A fourth round of talks between the United States and Iran, which had been due to take place in Rome on Saturday, has been postponed, and a new date will be set “depending on the US approach”, a senior Iranian official told Reuters on Thursday.\n\n“US sanctions on Iran during the nuclear talks are not helping the sides to resolve the nuclear dispute through diplomacy,” the official told Reuters.\n\n“Depending on the US approach, the date of the next round of talks will be announced.”\n\nOman, which mediated earlier sessions of the US-Iran talks, said on Thursday the next round of nuclear discussions provisionally planned for May 3 would be rescheduled for “logistical reasons”.\n\nHowever, a source familiar with the matter told Reuters that the US had never confirmed its participation in the fourth round of talks in Rome.\n\nThe source said the timing and venue of the next round of talks have yet to be confirmed but are expected in the near future.\n\nEarlier on Thursday, Iran accused the US of “contradictory behaviour and provocative statements” after Washington warned Tehran of consequences for backing Yemen’s Houthis and imposed new oil-related sanctions on it in the midst of nuclear talks.\n\nSeparately, Iran’s foreign ministry spokesperson Esmaeil Baghaei said Tehran would continue to engage “seriously and resolutely” in result-oriented negotiations with the US, state media reported.\n\nUS President Donald Trump, who has threatened to attack Iran if diplomacy fails, has signalled confidence in clinching a new pact with the Islamic Republic that would block Tehran’s path to a nuclear bomb.\n\nTrump, who has restored a “maximum pressure” campaign on Tehran since February, ditched a 2015 nuclear pact between Iran and six world powers in 2018 during his first term and reimposed crippling sanctions on Iran.\n\nIran has far exceeded the 2015 agreement’s curbs on its uranium enrichment since the US exited the pact, and European countries share Washington’s concern that Tehran could seek an atomic bomb. Iran says its programme is peaceful.\n\nIran and three European powers — Britain, France and Germany — were scheduled to meet in Rome on Friday to improve strained ties over Tehran’s disputed nuclear programme during this time of high-stakes talks between Tehran and Washington, Iranian Foreign Minister Abbas Araqchi said on Wednesday.\n\nHowever, the senior Iranian official who spoke to Reuters said on Thursday that it was now “not certain” whether Friday’s meeting would go ahead.\n\nOn Wednesday, Washington imposed sanctions on entities it accused of involvement in the illicit trade of Iranian oil and petrochemicals.\n\nSeparately, US Defence Secretary Pete Hegseth warned Iran that it would face consequences for supporting the Houthis, who control northern Yemen and have attacked ships in the Red Sea in what the group says is solidarity with the Palestinians.\n\nWashington has been bombing the Houthis intensively since mid-March, hitting more than 1,000 targets. Tehran says the Houthis act independently.\n\nYesterday, China’s Foreign Minister Wang Yi told a senior Iranian national security official that Beijing appreciated Tehran making diplomatic efforts regarding its nuclear programme.\n\n“China values Iran’s commitment not to develop nuclear weapons” and “appreciates Iran’s diplomatic efforts”, Wang told Ali Shamkhani, secretary of the Supreme National Security Council of Iran, according to a readout of a meeting in Brazil and released by his ministry today.\n\n“[China] is pleased to see ongoing dialogue between Iran and other parties and supports Iran’s necessary cooperation with the International Atomic Energy Agency,” Wang was quoted as saying.\n\nChina’s top diplomat worked with Shamkhani on the surprise 2023 deal restoring ties between Saudi Arabia and Iran, which analysts said signalled Beijing’s desire to be a diplomatic heavyweight in the Middle East.\n\nBut the crisis in Israel and Gaza, as well as Houthi rebels attacking commercial ships in the Red Sea, has sternly tested Beijing’s ability to continue to play a constructive role in handling global “hotspot issues”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/01221256fd35b21.jpg",
  "retrievedAt": "2025-08-23T08:10:15.036Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907772/us-iran-talks-postponed-new-date-depends-on-us-approach-iranian-official-says",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T09:56:40.000Z"
}
