{
  "title": "As India-Pakistan tensions heat up, Gilgit-Baltistan tour operators see their earnings evaporate - Pakistan - DAWN.COM",
  "author": null,
  "content": "A large number of foreign tourists have cancelled their trips to Gilgit-Baltistan due to heightened tensions between Pakistan and India, depriving local tour operators of much-needed earnings, a trade body official said on Thursday.\n\nThe April 22 attack in India-occupied Kashmir’s Pahalgam killed 26 people, mostly tourists, marking one of the deadliest assaults in the region since 2000. New Delhi has implied cross-border links without evidence, while Pakistan’s civilian and military leadership have rejected the accusation and called for a neutral probe.\n\nTensions have since spiked, with Pakistan reinforcing its forces and Indian Prime Minister Narendra Modi granting “operational freedom” to his military. Information Minister Attaullah Tarar said yesterday morning that there was credible evidence of an Indian attack within 36 hours, while Deputy Prime Minister Ishaq Dar said that Pakistan wouldn’t strike first, but would respond decisively and strongly in the face of aggression.\n\nWith tensions running high, Pakistan briefly closed the airspace over Gilgit-Baltistan, while India shut its airspace for all Pakistan-registered aircraft, or those owned and operated by Pakistani airlines or operators, including military craft.\n\nAli Anwar Khan, General Secretary of the Gilgit-Baltistan Tour Operators Association, said, “The threat of war between Pakistan and India has impacted the region’s international tourism this year.”\n\nHe added that tourists, including well-heeled visitors from European and Commonwealth countries, have cancelled their trips to the region due to the heightened geopolitical tensions. Khan added that many tourists from Thailand had cancelled their reservations.\n\nAdditionally, he noted that around eight to ten foreign groups from his company had cancelled their trips, while 200 tour operators had also reported a number of cancellations.\n\nAccording to Khan’s estimate, each operator lost at least $50,000 to $80,000 in potential earnings due to the current situation.\n\nHe said that most countries have already issued travel advisories due to which foreign tourists are rapidly cancelling their tours, while others have confirmed or are waiting for updates.\n\nHe said that one foreign tourist spends an average of $1,500 on a tour. “Now the cancellations will affect the entire industry — from hotels to transport,” he added.\n\nHe said the foreign tourists that are presently in Gilgit-Baltistan are worried about a potential escalation between the two nuclear-armed neighbours. “They want to return to their countries immediately,” he said. “They are expressing fears that if they stay in Gilgit-Baltistan for longer to complete their tours, they will be caught in a possible war between the two countries.”\n\nWith regard to foreign mountaineers who visit the region to scale eight-thousander peaks, including K2, he said that the sector had already been “severely impacted” due to legal battles.\n\nPreviously, tour operators took to court to protest against the hike in taxes and fees for trekking and mountaineering by the Gilgit-Baltistan government.\n\nA dispute between tour operators and the tourism department in Gilgit-Baltistan continues to impact the sector in the mountainous region, as the Supreme Court after suspending the increase in permit fees for foreign visitors had yet to provide clarity on the way forward.\n\nKhan said that the circumstances impacted a total of 2,000 foreign tourists.\n\nAccording to a statement issued by the GB tourism department on Sunday, about 25,000 foreign tourists visited Gilgit-Baltistan last year.\n\nIt said 2,300 foreign mountaineers and trekkers were issued permits by the GB government after paying permit fees, but 22,000 foreign tourists visited Gilgit-Baltistan, and many of them were allowed trekking and climbing without paying fees.\n\nThe Information Department also informed the GB Tourism Department that 700 foreign tourists interested in mountaineering and trekking have applied for permits this year.\n\nHowever, due to the Pakistan Tour Operators Association approaching the court against the permit fees, the issuance of permits — which used to be completed in two to three days — has now been suspended due to court proceedings.\n\nAccording to Director of Tourism Gilgit-Baltistan Iqbal Hussain, around 1.5 million domestic tourists visited the region last year.\n\nHe estimated that the revenue from tourism — domestic and foreign — would be around Rs64 billion.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/01113256d07c0d4.jpg",
  "retrievedAt": "2025-08-23T08:10:18.116Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907749/as-india-pakistan-tensions-heat-up-gilgit-baltistan-tour-operators-see-their-earnings-evaporate",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T08:45:59.000Z"
}
