{
  "title": "Jackal creates panic in Sargodha - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: A jackal caused panic in Sargodha after entering the city on Wednesday.\n\nIt headed straight for the commissioner’s residence — now under the control of the municipality.\n\nRescue 1122 personnel managed to subdue the wild animal and handed it over to the municipal authorities.\n\nHowever, conflicting social media reports claimed the jackal was killed by rescuers.\n\nNo official statement was issued to confirm or deny the claim.\n\nEnters commissioner’s residence\n\nEarlier, Rescue 1122 teams had successfully captured snakes that entered houses at two different locations in the city.\n\nVEHICLE OWNERSHIP: Motorists are facing growing problems due to undocumented vehicle ownership transfer.\n\nAs Sargodha is now included in the Safe City project, e-challans are being sent to the names\n\nregistered with the Excise Department, many of whom are previous owners.\n\nOver the years, many people sold vehicles without formally transferring ownership, and buyers either left the city or resold them all on stamp papers.\n\nThis is creating problems for the documented owners of previous vehicles. Citizens have urged the Punjab government and the Excise Department to allow previous owners to temporarily block their registration records by paying a nominal fine.\n\nThe fine, they suggested, should then be recovered from the new owner at the time of official transfer.\n\nCEO EVENT: The Malik Firoz Khan Noon Business School organized the Second Annual CEO Forum and Product Exhibition at University of Sargodha.\n\nVice Chancellor Prof Dr Qaisar Abbas inaugurated the event. Other distinguished attendees included Dean Faculty of Social Sciences Prof Dr Masood Sarwar Awan, Director of Noon Business School Prof Dr Irfan Shehzad, along with 18 leading CEOs from around the country.\n\nThe event featured a panel discussion on ‘Future Graduate Skills for Job Market’ bringing together industry leaders and academic professionals to discuss evolving workplace demands and a vibrant product exhibition where students showcased their 32 innovative business ideas and entrepreneurial projects.\n\nThe exhibition included a diverse range of prototypes and startup concepts, reflecting students’ creativity, business acumen, and practical application of classroom knowledge.\n\nProf Abbas highlighted the importance of collaborative efforts between academia and industry. He said Industry and academia work hand in hand across the world, but in our country a gap still exists. We are determined to close this gap.\n\nHe further explained that Universities are centers of innovation, and industry has the power to transform those innovations into tangible products. Together, we can commercialize ideas and create impact, he said.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:10:25.030Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907681/jackal-creates-panic-in-sargodha",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T01:36:42.000Z"
}
