{
  "title": "HBL Pakistan Super League: Raza stars as Qalandars end United’s perfect run - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Islamabad United finally met their match.\n\nImperious after winning their opening five games of the ongoing HBL Pakistan Super League season, they were routed by a rampant Lahore Qalandars at the Gaddafi Stadium on Wednesday.\n\nThe 88-run victory saw Qalan­dars win for a second time in two matches and move up to second in the table behind United.\n\nLahore were powered by a brilliant all-round show by Sikandar Raza, as well as valuable contributions from the bat by Sam Billings and Fakhar Zaman with Haris Rauf showing signs of returning to his lethal best with the ball.\n\nAfter Raza and Billings’ late onslaught had boosted Qalandars to 209-6, the former and Haris shared six wickets equally as United were shot out for 121.\n\nRaza (39 off 17, three fours and three sixes) and Billings (38 not out off 17, one four and four sixes), coupled up with poor fielding by United saw Qalandars bounce back from a tricky start.\n\nComing in at number five and six respectively, Billings and Raza combined for a 64-run partnership for the fifth wicket, which came in only 23 balls as Qalandars posted a winning total.\n\nBillings was the third Qaland­ars batter to be handed a reprieve by the United fielders — who missed catching chances to dismiss Fakhar and Daryl Mitchell.\n\nUnited looked to have kept things in control until Hunain Shah dropped a simple catch to hand Fakhar -- at four at that point -- a reprieve in the fourth over off pacer Ben Dwarshuis.\n\nThe missed opportunity was followed by three consecutive boundaries and a six by Fakhar before his opening partner Mohammad Naeem lifted Naseem Shah’s pace for another maximum over square-leg.\n\nNaeem’s stay was ended by a brilliant fielding effort by Dwarshuis to run the youngster out before Fakhar cleared deep square off Jason Holder to take Qalandars to 56-1 by the end of the powerplay.\n\nThe incoming Abdullah Shaf­ique took on Hunain for three fours in the eighth over before Fakhar showed his prowess through the off-side off Shadab Khan’s spin to take Qalandars to 91-1 at halfway stage.\n\nOn a roll, when Fakhar attempted to go big against spinner Imad Wasim in the 11th over, he missed the line for United wicket-keeper Azam Khan to stump him for 44 off 30 (five fours and two sixes).\n\nImad then returned in the 13th to trap Abdullah (22 off 17, three fours) lbw. The former Pakistan all-rounder would have gone on to get his third two overs later, had Sahibzada Farhan held on to an opportunity presented by Billings at deep point after the Englishman had reverse-swept Imad for a six and a four.\n\nUnited faltered in the field once again in the next over with vice-captain Salman Ali Agha misread a skier at long-off to see a Mitchell hit sail over the boundary before the New Zealander, swivelled to clear Holder over deep backward square.\n\nMitchell (28 off 18, two fours and two sixes), however, finally became United’s fourth breakthrough, holing Dwarshuis to Haider Ali at deep midwicket before Billings picked the Austr­alian bowler up over the same reason for six to take Qalandars past 150.\n\nBillings muscled Naseem before scooping him for two more sixes in the next over and the incoming Raza plundered Dwar­shuis audaciously for two fours and as many sixes in the penultimate over.\n\nThe Zimbabwean pumped a six off Holder and squeezed him past point for four more in the final over as Qalandars crossed 200.\n\nIn response, United struggled to 49-1 in the powerplay, which also saw Sahibzada Farhan fall to Shaheen Shah Afridi in the third over. But Salman Ali Agha (36 off 25, two fours and three sixes) and Andries Gous responded to the early loss in style, playing some brilliant strokes to put up 69 off 43 together before the former was cleaned up by a yorker by Sikandar Raza.\n\nWith United at 87-2 by the 10th over, Haris’ fiery pace trapped Azam lbw. Asif Afridi followed it up with Haider’s wicket in the next over as the right-hander hol­ed the spinner out to long-off, where Tom Curran took a decent catch.\n\nHaris then returned to wreck the stumps of Gous (41 off 27, two fours and three sixes), as the ball skid in with pace, and bowled a bouncer to get the incoming Jason Holder caught behind down the leg-side.\n\nImad followed suit, finding Shaheen at mid-off off Curran as United crumbled at 109-7. Raza was holed out to the boundary by Dwashuis and Shadab in the next over before Haris saw Naseem caught in the deep as the Islamabad outfit was bundled out by the end of the 17th over.\n\nScoreboard\n\nLAHORE QALANDARS: Fakhar Zaman st Azam b Imad 44 Mohammad Naeem run out 25 Abdullah Shafique c Haider b Imad 22 Daryl Mitchell c Haider b Dwarshuis 28 Sam Billings not out 38 Sikandar Raza c (sub) b Holder 39 Asif Ali c Salman b Holder 0 EXTRAS (LB-2, NB-2, W-9) 13 TOTAL (for six wickets, 20 overs) 209 DID NOT BAT: Shaheen Shah Afridi, Tom Curran, Haris Rauf, Asif Afridi FALL OF WICKETS: 1-50 (Naeem), 2-97 (Fakhar), 3-108 (Abdullah), 4-145 (Mitchell), 5-209 (Sikandar), 6-209 (Asif) BOWLING: Naseem 4-0-36-0 (1w), Dwarshuis 4-0-51-1 (2w), Holder 4-0-54-2 (2w, 2nb), Shadab 4-0-27-0, Hunain 1-0-13-0, Imad 3-0-26-2 ISLAMABAD UNITED: Sahibzada Farhan c Raza b Shaheen 9 Andries Gous b Haris 41 Salman Ali Agha b Sikandar 36 Azam Khan lbw b Haris 1 Haider Ali c Curran b Asif 5 Shadab Khan c sub b Raza 13 Jason Holder c Billings b Haris 0 Imad Wasim c Shaheen b Curran 2 Ben Dwarshuis c sub b Raza 1 Naseem Shah c Naeem b Haris 11 Hunain Shah not out 0 EXTRAS (W-2) 2 TOTAL (for nine wickets, 15 overs) 109 FALL OF WICKETS: 1-11 (Farhan), 2-80 (Salman), 3-87 (Azam), 4-92 (Haider), 5-104 (Gous), 6-104 (Holder), 7-108 (Imad), 8-109 (Dwarshuis), 9-114 (Shadab) BOWLING: Shaheen 2-0-10-1 (1w), Asif 4-0-24-1, Curran 3-0-24-1, Haris 3.5-0-31-4 (1w), Mitchell 1-0-12-0, Raza 3-0-20-3 RESULT: Lahore Qalandars won by 88 runs. PLAYER-OF-THE-MATCH: Sikandar Raza\n\nCurrent standings\n\nTabulated under (Teams, matches, wins, losses, points, net run-rate) United 6 5 1 10 1.176\nQalandars 7 4 3 8 1.110\nGladiators 6 4 2 8 1.034\nKings 6 3 3 6 -0.217\nZalmi 6 2 4 4 -0.847\nSultans 7 1 6 2 -2.355\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6812ddec2f09b.jpg",
  "retrievedAt": "2025-08-23T08:10:22.195Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907723/hbl-pakistan-super-league-raza-stars-as-qalandars-end-uniteds-perfect-run",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T02:36:00.000Z"
}
