{
  "title": "Pakistan’s media faces existential threat: Freedom Network - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s media is standing at a crossroad amid an existential threat and increased restrictive environment, deteriorating safety and job security, significant challenges to professional integrity of media and its practitioners, says Freedom Network’s annual Freedom of Expression and Media Freedom Report for 2025.\n\nTitled “Free speech and public interest journalism under siege”, the report finds that the existential crisis was triggered by amendments to Prevention of Electronic Crimes Act (Peca) in January 2025 that now “makes it easier” for authorities to arrest, fine and imprison journalists and dissidents — both offline and online — besides other challenges.\n\n“The existential threat is serious as such a situation is seen rare in Pakistani media history. This situation is threatening the very foundation of democracy and the state is more brutal now than it was before to tolerate hard questions,” Freedom Network Executive Director Iqbal Khattak said, as the report launch coincides with World Press Freedom Day being commemorated globally on May 3 every year.\n\nAuthored by Adnan Rehmat, the report provides an overview of the freedom of expression and media freedoms in Pakistan prevalent during May 2024-April 2025.\n\nFreedom Network says crisis has been triggered by amendments to Peca; KP emerges as the most dangerous for journalists, followed by Islamabad and Punjab\n\n“These challenges reflect the broader shrinking space for media freedoms in the country. Such a declining media space means citizens will have little access to information they need to know,” co-author Iqbal Khattak said.\n\nFive journalists were killed during the period the report covered. Three journalists were killed in Sindh and two in Khyber Pakhtunkhwa while at least 82 journalists and other media professionals had faced different types of threats during the same period.\n\nKhyber Pakhtunkhwa emerged as the most dangerous province for journalists where 22 cases were documented while Islamabad recorded the second highest number of 20 cases against journalists and followed by 18 cases in Punjab. Four cases were recorded in Balochistan and one in Azad Jammu and Kashmir.\n\nThe report said at least 14 journalists faced legal cases, mostly under Peca law while in eight cases journalists were arrested or detained in pursuance of legal cases.\n\nGrowing censorship, legal restrictions, violence against journalists, impact of disinformation on media and its practitioners’ integrity, challenges for women media practitioners, effects of political polarisation on media freedom and safety of journalists were key areas the report identified as main reasons for the current situation facing the freedom of expression and media freedom.\n\nThe women’s representation in the country’s media has improved over the time, but significant disparities remained in the period under review.\n\n“Even though inadequately represented in media in quantitative terms, women are active in various forms of media, including print, television, radio and digital platforms,” the report says.\n\nIt recommended “national movement to protect and pursue the constitutional guarantee of freedom of expression and the right to express dissent with policies and state action that impinge on the fundamental rights of citizens”.\n\nThe report also seeks inclusion and engagement to mobilise public and civil society actors to make “the national movement” stronger and working.\n\nA national consensus of key stakeholders for a new charter on digital rights of the citizens of Pakistan that “guarantees the same constitutional guarantees online as offline, and ensure internet access for all, quality internet and digital rights including the right to digital freedom of expression”.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:49:45.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907652/pakistans-media-faces-existential-threat-freedom-network",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T00:04:17.000Z"
}
