{
  "title": "From Samjhauta to Pahalgam, ministers reject India’s rhetoric - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE/KARACHI: Punjab and Sindh ministers Azma Bokhari and Sharjeel Inam Memon on Wednesday strongly criticised Modi government’s allegations and actions in the wake of Pahalgam attack, pointing out that India repeatedly tried to build a false narrative against Pakistan, from the Samjhauta Express bombing to Pathankot and Pulwama attacks, without presenting substantiating proof.\n\nAddressing a press conference, Punjab Information Minister Azma Bokhari said that the Pahalgam attack in India-held Kashmir, despite the presence of 700,000 Indian troops, was a glaring testament to the Modi government’s failure. “Fom Afzal Guru to Pahalgam, every Indian allegation against Pakistan has been debunked, and India has consistently failed to provide credible evidence,” she said.\n\nEven Indian army generals had admitted that several attacks were “staged and fabricated”, yet the Pakistani nation and its armed forces remained resolute, she said, adding that the enemy cancelled its planned exercises after Pakistani jets took to the skies, demonstrating Pakistan’s readiness.\n\n“Pakistan will thwart every enemy plot and protect every inch of its territory,” she said, adding that findings of incidents like Jaffar Express tragedy would soon be made public.\n\nPakistan’s readiness compelled India to cancel exercises, says Azma; Sharjeel warns war would be ‘political and military suicide’ for India\n\nOn the other hand, she also hailed Lahore’s achievement of being globally recognised as one of the safest cities in the world.\n\n‘Suicide for India’\n\nSeparately, Sindh Senior Minister Sharjeel Inam Memon told the media in Karachi that if India imposed a war on its neighbouring nuclear power, it would amount to political and military suicide for India.\n\nThe nation stood fully prepared to defend its sovereignty, he said. “Pakistan possesses one of the finest armies, navies, and air forces in the world, and every citizen is ready to protect the motherland,” he added.\n\nThe minister said the nation along with the armed forces had consistently condemned all forms of terrorism and successfully dismantled terrorist networks sponsored by India. “Presence of an Indian agent like Kulbhushan Jadhav has already exposed India’s true face,” he said.\n\nPakistan had been a victim of terrorism, with over 70,000 citizens having lost their lives in this ongoing struggle, he said. Former PM Benazir Bhutto herself was a victim of terrorism, and that people of all ages, children, youth, and elders had made immense sacrifices in this fight, he added.\n\nDescribing the Pahalgam incident as false flag operation or a complete failure of India’s security agencies, the minister said that so-called democratic India after the incident blocked Pakistani media outlets and YouTubers.\n\nHe categorically rejected the Indian allegations, based on falsehoods, and its attempts to mislead the international community to wrongfully portray the Kashmiri struggle for self-determination as terrorism. “The Pahalgam incident is yet another example of this pattern,” he said.\n\nAccusing India of consistently violating UN resolutions, the minister said India was perpetrating atrocities and oppression against the people of occupied Kashmir. Kashmiri leaders had been imprisoned on fabricated charges, innocent youth had been martyred, and attempts were being made to change the demography of the occupied valley, he added.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/01092138236d597.jpg",
  "retrievedAt": "2025-08-23T08:10:29.806Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907645/from-samjhauta-to-pahalgam-ministers-reject-indias-rhetoric",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T00:04:10.000Z"
}
