{
  "title": "US targets Iran with fresh sanctions ahead of nuclear talks - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The United States on Wednesday imposed sanctions on entities it accused of being involved in the illicit trade of Iranian petroleum and petrochemicals ahead of a new round of US-Iran negotiations on Saturday, as Washington seeks to ramp up pressure on Tehran.\n\nThe US State Department said in a statement it was imposing sanctions on seven entities based in the United Arab Emirates, Turkiye and Iran that it accused of trading Iranian petroleum and petrochemical products. Two vessels were also targeted.\n\nUS Secretary of State Marco Rubio said in a separate statement that the action targeted four sellers and one buyer of Iranian petrochemicals worth hundreds of millions of dollars.\n\nWednesday’s action is the latest move targeting Tehran since Trump restored his “maximum pressure” campaign on Iran, which includes efforts to drive its oil exports to zero and help prevent Tehran from developing a nuclear weapon.\n\n“The President is committed to driving Irans illicit oil and petrochemical exports — including exports to China — to zero under his maximum pressure campaign,” Rubio said.\n\nIran’s mission to the United Nations in New York did not immediately respond to a request for comment. However, Iranian Foreign Minister Abbas Araghchi said the fresh US sanctions during negotiations sent the “wrong message”.\n\nThe action comes as the US has relaunched talks with Iran over its nuclear programme. US and Iranian negotiators will reconvene in Rome on Saturday.\n\nTalks with European powers\n\nIran will hold talks in Rome on Friday with European parties to their now moribund 2015 nuclear deal, its foreign minister said on Wednesday.\n\nReuters reported on Monday that Tehran had proposed meeting Britain, France and Germany, collectively known as the E3, who stuck to the 2015 deal meant to curb Iran’s nuclear activity, which unravelled in 2018 when US President Donald Trump walked out of it during his first term in the White House.\n\n“In my opinion, the three European countries have lost their role (in the nuclear file) due to the wrong policies they have adopted. Of course, we do not want this and are ready to hold talks with them in Rome,” Araghchi told state media.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:49:46.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907643/us-targets-iran-with-fresh-sanctions-ahead-of-nuclear-talks",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T00:04:10.000Z"
}
