{
  "title": "KP govt set to appoint VCs to 19 varsities after a delay of three years - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: After over one year of legal battle, the Khyber Pakhtunkhwa government has decided in principle to appoint regular vice chancellors to 19 public universities following a delay of around three years.\n\nOfficial sources told Dawn that Chief Minister Ali Amin Gandapur had given a nod to the higher education department to notify the appointment of VCs of 19 universities whose appointment process was completed in January 2024.\n\nThey said the candidates, placed on top of the three shortlisted panels for each university, would be notified as VCs within a couple of days.\n\nOfficials said the VC vacancies were advertised during the last PTI government when Mahmood Khan was the chief minister. The academic search committee for the appointment of VCs had interviewed aspirants from January 22 to 26, 2024.\n\nAppointment process was completed in Jan last year\n\nThey said when the process for the appointment of VCs completed, the HED moved the shortlisted names to the last caretaker government for approval.\n\nThe officials said the caretaker cabinet approved the names but a top functionary of the caretaker government withheld it apparently waiting for the formation of the elected government after the Feb 8 polls.\n\nHowever, the PTI government, which was formed after the general elections, refused to accept the process for the VCs’ appointment, insisting that the caretakers didn’t have legal powers to fill top university posts.\n\nThe matter was discussed at various forums and the provincial government finally placed it before the cabinet that decided about the reversal of the process and re-advertising of the positions.\n\nThe provincial government also re-advertised the vacant VC positions but the move was challenged by some candidates in the Peshawar Higher Court.\n\nThe court decided in favour of the candidates that was later challenged by the higher education department in the Supreme Court.\n\nSources said that the provincial government was unable to defend its actions related to VCs and finally decided to notify those candidates as VCs who were shortlisted by the academic search committee.\n\nCurrently, 24 public sector universities in the province are functioning without regular VCs as the tenure of five more heads of universities were completed on March 16, 2024.\n\nThe provincial government also amended the Khyber Pakhtunkhwa Universities Act, 2012, and changed the procedure for the appointment of VCs as under the previous procedure mentioned in the law for the appointment of VCs, the authority of chief minister existed nowhere and instead, the entire power rested with the academic search committee.\n\nAfter amendments to the law, the chief minister replaced the governor as the chancellor of public sector universities and empowered himself to select one of the three shortlisted candidates instead of the top one under the previous procedure.\n\nAccording to official documents, Prof Tahir Irfan Khan stood on top of the three shortlisted candidates for the post of VC of Abbottabad University of Science and Technology, Prof Mohammad Zafar Iqbal for Gomal University Dera Ismail Khan, Prof Mohammad Tahir Khan Khalil for Khushal Khan Khattak University Karak, Prof Aurangzaib Khan for University of Lakki Marwat.\n\nProf Mohammad Ali for Hazara University Mansehra, Prof Gul Mohammad Khan for University of Engineering and Technology Mardan, Prof Qaisar Ali for University of Engineering and Applied Sciences Swat, Prof Dawood Jan for University of Agriculture Swat, Prof Sardar Khan for University of Shangla, Prof Shakib Ullah for University of University Veterinary and Animal Sciences Swat, Prof Johar Ali for University of Peshawar, Prof Mohammad Sadiq for University of Engineering and Technology Peshawar, Prof Jameel Ahmad for Abdul Wali Khan University Mardan, Prof Zahoor Ul Haq for Bacha Khan University Charsadda, Prof Syed Badshah for Shuhada Army Public School University Nowshera, Prof Syed Zafar Ilyas for Kohat University of Science and Technology Kohat, Prof Mohammad Jahanzaib Khan for UET Bannu and Prof Ghazala Yasmeen for Women University Swabi.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:10:27.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907612/kp-govt-set-to-appoint-vcs-to-19-varsities-after-a-delay-of-three-years",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T00:05:10.000Z"
}
