{
  "title": "‘Rupee devaluation, inflation leave minimum wage wholly insufficient’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: As workers worldwide commemorate International Labour Day, the Pakistan Institute of Labour Education and Research (Piler) hosted a seminar on Wednesday to address one of the most pressing issues facing the country’s labour force: the failure to implement minimum wage law.\n\nThe meeting at the Karachi Press Club brought together trade unionists, government officials, and labour activists seeking solutions to protect workers’ rights amid economic instability.\n\nAbbas Haider, joint director of Piler, moderated the event, which was dedicated to the memory of Karamat Ali, the organisation’s founding director whose lifelong advocacy for labour rights continues to inspire the organization’s mission and labour movements.\n\nAgainst the backdrop of spiralling inflation and currency devaluation that have eroded workers’ purchasing power, the seminar tackled the systemic failures that have left millions of Pakistani workers without even the basic wage protections guaranteed by law.\n\nLarge number of workers not paid even the minimum wage, Labour Day moot told\n\nNasir Mansoor, workers’ representative in the Sindh Minimum Wage Board, opened the discussion by highlighting the stark contradictions in employers’ behaviour. “We have witnessed the resistance posed by employers in the minimum wage board. They would give money in charity, but wouldn’t pay their workers fair salary,” Mansoor observed.\n\nHe emphasised that Pakistan’s current minimum wage had become increasingly insufficient due to skyrocketing inflation and currency devaluation, which had left workers unable to afford even basic amenities.\n\nMansoor criticised the fragmentation of workers’ identity along racial, ethnic, and personality lines, noting that “90 per cent of workers don’t have collective bargaining rights”.\n\nHe called for a return to labour-based organising saying “you may love your race, ethnic identity, but you shouldn’t forget the fact that basically you are a worker first”.\n\nBushra Arain of the Sindh Lady Health Workers Union spoke about problems in organising contract workers in the face of significant resistance. “A pharaoh is sitting on every decision-making seat,” she said, describing the authoritarian management style workers faced.\n\nShe said her union’s solidarity enabled them to demand their rights despite facing imprisonments and physical violence during protests.\n\nThe technical aspects of minimum wage evasion were explained by Mirza Maqsood Ahmed of Piler, who detailed how employers manipulated legal language to reduce workers’ compensation.\n\n“Employers argue that social security and EOBI deductions should also be part of wages,” he explained, adding that most of the workers never get registered with these institutions. Ahmed pointed out that the lack of proper worker classification into skilled, semi-skilled, and unskilled categories further enabled employers to keep wages artificially low, along with reducing gratuity and other benefits.\n\nQamar ul Hasan, senior trade unionist, provided historical context that illustrated the dramatic erosion of purchasing power.\n\n“In 2001, 2.5 months of minimum wage would equal 1 tola of gold. Today, you need to work 8.5 months for the same gold,” he stated.\n\nHasan emphasised that the current official minimum wage of Rs37,000 is already insufficient, adding that still an estimated 800 million workforce of Pakistan don’t even receive this legal minimum.\n\nAthar Shah, Director General of Shop Establishment, acknowledged the state’s failure in enforcement of the law.\n\n“We are ashamed that despite having this law, we are unable to implement minimum wage,” Shah admitted. He noted that workers typically preferred jobs where overtime was available because the minimum wage alone could not sustain their families.\n\nThe seminar gained international perspective from Comrade Patrick of the Socialist Network in Brazil, who shared insights from his country’s experience under president of Brazil Lula da Silva.\n\nPatrick explained how Brazil successfully increased the minimum wage and linked it directly to inflation, ensuring workers’ purchasing power remains protected.\n\n“Currently the minimum wage in Brazil is 265 dollars, with no tax on minimum wage,” he stated, adding that “Pakistan is much worse than Brazil” in terms of worker protections.\n\nPatrick advocated for modernising union strategies through what he called “social trade unionism” — building broader alliances between workers, customers, and suppliers to increase leverage against employers.\n\n“We need to use emerging digital tools to proliferate this narrative,” he said, suggesting that social media could help reach previously unorganised sectors like domestic workers and delivery personnel.\n\nLabour rights advocate Habibuddin Junaidi acknowledged the significant labour legislation passed by the Pakistan Peoples Party government in Sindh following the 18th Amendment but emphasised the persistent gaps in its implementation.\n\nHe highlighted security guards as among the most exploited workers, often working 12-hour a day for as little as Rs14,000 per month.\n\nThe seminar concluded with Mehnaz Rehman’s observation that “the difference between rich and poor is widening and the government is doing nothing to address this gap”.\n\nShe said the emerging labour sectors were not documented in traditional frameworks and called for unity among workers and the middle class to address growing inequality.\n\nPublished in Dawn, May 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6812ab8996e6a.jpg",
  "retrievedAt": "2025-08-23T08:10:20.491Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907641",
  "dateList": "2025-05-01",
  "date_published": "2025-05-01T00:04:38.000Z"
}
