{
  "title": "PM Shehbaz inspects under-construction IT Park, directs expedited completion",
  "author": null,
  "content": "ISLAMABAD, Aug 15 (APP): Prime Minister Muhammad Shehbaz Sharif, on the occasion of Pakistan’s Independence Day, paid a special visit to the under-construction Technology Park here, expressing strong displeasure over the slow pace of work and directing authorities to accelerate its completion.\nThis was the Prime Minister’s third inspection of the project, which was originally scheduled to be completed by March 23, 2025, but has faced delays, a Prime Minister’s Office news release said.\nHe reprimanded the concerned officials on-site, stressing that the park must be completed within the revised timeline while meeting international quality standards.\n“Ensure the provision of world-class facilities and double your efforts to finish this project as per the original instructions,” the Prime Minister told the project managers.\nThe IT Park, consisting of two underground floors, a ground floor, and nine upper floors, will feature office spaces, an incubation center, a business support center, R&D laboratories, a Level III data center, an auditorium, and parking for 1,200 vehicles. It is expected to create employment opportunities for youth, boost economic growth, enhance Pakistan’s global IT competitiveness, and bridge the digital divide.\nThe Prime Minister noted that the project had seen little progress during the previous government’s tenure but received special attention from his administration immediately after he assumed office.\nFederal Minister for Planning Ahsan Iqbal, Federal Minister for Economic Affairs Ahad Khan Cheema, Federal Minister for Information and Broadcasting Attaullah Tarar, Federal Minister for Information Technology and Telecommunication Shaza Fatima, and senior government officials accompanied the Prime Minister during the visit.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:11:40.609Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-shehbaz-inspects-under-construction-it-park-directs-expedited-completion/",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T23:47:00.000Z"
}
