{
  "title": "Internet suspension in Balochistan a security measure: Tariq Fazal",
  "author": null,
  "content": "ISLAMABAD, Aug 15 (APP): Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry on Friday informed the Senate that the recent temporary suspension of internet services in parts of Balochistan was solely a security measure.\nResponding to a calling attention notice regarding the suspension of mobile internet across 36 districts of Balochistan on security grounds, he said that under the Pakistan Telecommunication (Reorganization) Act, 1996, such decisions followed a specific process.\nRequests originate from the Ministry of Interior and Narcotics Control, based on recommendations from relevant security stakeholders, and are then forwarded to the Pakistan Telecommunication Authority (PTA) for implementation, he said.\nThe minister said that mobile internet services in Balochistan were suspended from August 6 to August 31 due to credible security concerns.\nHowever, telephone services remained fully operational, and the restriction was limited to mobile internet. “All airlines, including PIA and private carriers, are fully functional in Balochistan, while road and rail links to Quetta and other cities remain open,” he added.\n“These decisions are taken for specific locations where credible security threats exist, not in unrelated areas,” the minister stressed. Recalling past incidents of terrorism in the province — including attacks on the Jaffar Express and the Army Public School in Khuzdar, where innocent children lost their lives — he said such measures are based on intelligence reports and aim to prevent loss of life.\nAddressing concerns about prepaid internet packages purchased by students and residents during the suspension period, Dr. Tariq Fazal assured that he would raise the matter with the relevant ministry. “I commit to the House that unused credit for the days affected by the suspension will be carried forward to the next month so that people, especially students, do not suffer financial loss,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:12:05.509Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/internet-suspension-in-balochistan-a-security-measure-tariq-fazal/",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T22:46:00.000Z"
}
