{
  "title": "SSP Investigation patrols Chehlum route on motorcycle, emphasises zero tolerance for negligence",
  "author": null,
  "content": "ISLAMABAD, Aug 14 (APP): Senior Superintendent of Police (SSP) Investigation Muhammad Usman Tariq Butt on Thursday conducted a day-long motorcycle patrol along the Chehlum procession route in Sector G-6, personally inspecting multiple duty points and briefing deployed officers.\nA police spokesperson told APP that at various duty points, he briefed officers to uphold zero tolerance for any negligence and to prioritize the protection of citizens’ lives above their own.\nHe said that over 5,000 officers and personnel, including CTD commandos, Rangers, Elite Force vehicles, Quick Response Force teams, and female staff, were deployed across the federal capital under a multi-layered security plan. Safe City surveillance, mobile control rooms, and digital monitoring systems remained fully operational.\nDuring inspection of a joint entry point for male and female participants, the SSP observed some officers seated and not actively monitoring the flow of mourners. He reprimanded them, emphasizing that no individual should be allowed entry without thorough screening and that all officers must remain fully alert at all times.\n“My duty is my greatest honour,” Usman Butt told APP. “I will respect only those who respect their duty by safeguarding citizens without negligence during this critical assignment.”\nHe said arrangements were also made to ensure proper meals for duty staff so they could perform their responsibilities effectively. At some locations, the SSP personally assisted in laying barbed wire for crowd control.\nZaireen expressed appreciation for the special arrangements and thanked IGP Islamabad Syed Ali Nasir Rizvi and SSP Usman Butt for their leadership and personal involvement in ensuring safety. The IGP also thanked police officers and personnel for performing 16 hours of continuous duty to secure the procession.\nAccording to the spokesperson, today’s security operations were part of a 15-day preparation phase, including seven complete route sweepings and multiple search operations across the city.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:12:51.859Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ssp-investigation-patrols-chehlum-route-on-motorcycle-emphasises-zero-tolerance-for-negligence/",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T07:01:00.000Z"
}
