{
  "title": "PAA holds e-kacheri to address public concerns; DG Khan Airport runway upgrade by Dec 2026",
  "author": null,
  "content": "ISLAMABAD, Aug 15 (APP):The Pakistan Airports Authority (PAA) on Friday held its seventh e-Kacheri session, chaired by Deputy Director General (Works and Development) Sumair Saeed, to gather public feedback on airport facilities and services nationwide. Senior officials from SQMS, Engineering Services, Commercial and Estate, Human Resources, and Planning and Development also attended.\nThe live-streamed session on PAA’s official Facebook page allowed passengers to share concerns and suggestions covering a wide range of issues — from passenger facilitation, food quality, luggage handling, and flight delays to internet connectivity, ATM availability, and technological upgrades.\nSaeed assured participants that all feedback is taken seriously, with relevant departments instructed to investigate and coordinate with stakeholders, including airlines and agencies such as the FIA. Updates were shared on infrastructure projects, including runway improvements and enhanced service facilities.\nNotably, he announced that the Dera Ghazi Khan Airport runway was being upgraded to accommodate A320 aircraft, with completion scheduled for December 2026. Passenger projections suggest DG Khan will become a financially viable destination for airlines upon project completion, he said.\nHuman resources queries, including recruitment for specialized roles, employee welfare, internship opportunities, and contractor compliance, were also addressed.\n“Your feedback helps us serve you better and improve Pakistan’s airport experience,” Saeed said, thanking participants for their valuable input.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:12:04.964Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/paa-holds-e-kacheri-to-address-public-concerns-dg-khan-airport-runway-upgrade-by-dec-2026/",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T23:34:00.000Z"
}
