{
  "title": "Saudi Arabia reaffirms unwavering support for Pakistan, inks $121 mln deals for health, energy projects",
  "author": null,
  "content": "ISLAMABAD, August 15 (APP): Ambassador of the Kingdom of Saudi Arabia to Pakistan, Nawaf bin Said Al-Malki on Friday reaffirmed Riyadh’s unwavering support for Pakistan’s development journey, highlighting the deep-rooted historic, religious, and cultural ties binding the two brotherly nations.\nSpeaking at a ceremony marking the signing of consulting services contracts to support development projects in Pakistan – financed by the Saudi Fund for Development (SFD) – Al-Malki said the projects would provide vital services, boost economic growth, and contribute to the well-being of the Pakistani people.\n“This event is proof of the deep ties between the Kingdom of Saudi Arabia and Pakistan, based on mutual respect, shared values, and a common vision for prosperity and progress,” he said.\nThe envoy lauded the longstanding bilateral cooperation across religious, political, military, economic, and cultural spheres, terming it a source of pride for both nations. He assured that under the wise leadership of the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and Crown Prince and Prime Minister Mohammed bin Salman bin Abdulaziz Al Saud, Saudi Arabia would continue to stand by Pakistan through thick and thin.\n“I sincerely thank everyone who worked hard to make these projects possible. With our two countries working together, they will be completed successfully and benefit people for many years,” Al-Malki remarked.\nThe signing ceremony was attended by senior officials, including Dr. Saud Alshammari, Director General of Operations in Asia at SFD; Dr. Kazim Niaz, Secretary for the Ministry of Economic Affairs Division; and other dignitaries.\nThe ambassador also extended warm congratulations to the government and people of Pakistan on their Independence Day, noting that the day reflected the strength, unity, and sacrifices of the Pakistani nation. He expressed the Kingdom’s joy in celebrating this milestone with Pakistan and pledged to further strengthen bilateral partnership and cooperation.\nThe Saudi Fund for Development (SFD) has signed consultancy service contracts for three major projects in Pakistan – the King Salman Hospital in Tarlai and the Shounter and Jagran hydropower projects in Azad Jammu & Kashmir – with a combined financing package worth $121 million.\nThe King Salman Hospital will be funded through a $20 million grant from the Kingdom of Saudi Arabia, while the Shounter and Jagran hydropower projects will receive concessional loans of $66 million and $35 million respectively.\nSpeaking on the occasion, Dr. Niaz expressed Pakistan’s deep appreciation for the Kingdom’s consistent and generous assistance, particularly through SFD. He said, “From health to energy to infrastructure, the SFD has always stood with Pakistan, enabling us to open new avenues of growth and opportunity for our people.”\nHe lauded the efforts of consultants and implementing partners, expressing confidence that the projects would uplift local communities and contribute to the country’s overall prosperity.\nHighlighting the “deep-rooted and fraternal” relations between Pakistan and Saudi Arabia, Dr. Niaz said the bond between the two countries is built on “shared values, mutual trust, and common aspirations” and has withstood the test of time.\nHe underscored Saudi Arabia’s role as one of Pakistan’s “most valued and strategic development partners,” noting that SFD’s wide-ranging financial support has brought transformational impact in sectors such as infrastructure, energy, and social development.\nDr. Niaz also commended Ambassador Al-Malki and Dr. Saud Alshammari for their personal commitment to strengthening development cooperation between the two nations.\nThe agreements are expected to accelerate progress in healthcare delivery and renewable energy generation, directly benefiting thousands of Pakistanis and reinforcing bilateral ties.\nAddressing the event, Dr. Saud Alshammari said the agreements marked “an important step in advancing vital initiatives in Pakistan’s health and energy sectors – both priority areas for the nation’s development.”\nDr. Alshammari highlighted the depth of Saudi-Pakistan development cooperation, noting that the Kingdom has so far provided $533 million in grants for 23 projects and $1.2 billion in concessional loans for 21 development projects across the country. “We hope this support contributes to Pakistan’s sustainability and the achievement of its Sustainable Development Goals,” he said.\nHe reaffirmed SFD’s commitment to aligning its assistance with Pakistan’s national development plans, adding: “We wish the Islamic Republic of Pakistan continued peace, prosperity, and progress.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:11:15.179Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/saudi-arabia-reaffirms-unwavering-support-for-pakistan-inks-121-mln-deals-for-health-energy-projects/",
  "dateList": "2025-08-15",
  "date_published": "2025-08-16T02:57:00.000Z"
}
