{
  "title": "Aleem Khan directs urgent road restoration in northern areas after rains, landslides",
  "author": null,
  "content": "ISLAMABAD, Aug 15 (APP):Federal Minister for Communications Abdul Aleem Khan Friday directed the Federal Secretary for Communications and Chairman National Highway Authority (NHA) to personally visit and oversee the immediate restoration of roads in Khyber Pakhtunkhwa and Gilgit-Baltistan following heavy rains and landslides that caused road closures in the northern areas.\nHe directed that NHA should accumulate all resources and get work force and machinery from Punjab and Sindh to utilize in the affected areas, said a press release.\nHe said that road network has been badly damaged which has to be restored as early as possible. He said that NHA teams must start their work without wasting a single minute and put their all efforts to provide relief to the travelers.\nFederal Minister said that the latest wave of Monsoon rains has created alarming situation. He emphasized that NHA must mobilize all resources in the affected areas to remove landslides and reopen roads for traffic as soon as possible. Abdul Aleem Khan directed that NHA teams be urgently deployed and remain fully active in the northern regions, particularly in Skardu, Jaglot, Buner and various parts of Gilgit-Baltistan. He further instructed that where roads are blocked, alternative routes should be used to maintain traffic flow and a detailed report on the restoration work in Gilgit-Baltistan should be submitted immediately.\nExpressing heartfelt condolences and sympathies to the families of those who lost their lives due to heavy rains in Buner and other areas, Abdul Aleem Khan prayed for the departed souls. He also expressed deep grief on the crash of helicopter of KPK Government and lost precious lives in this incident. He said that in this difficult time, every possible assistance should be provided to travelers and citizens and the public should be kept informed of the situation in a timely manner by ensuring that relief activities continue without interruption. Abdul Aleem Khan directed that NHA will have to continue its emergency operations to restore traffic and ensure public safety so that continues travel facilities can be extended to the people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:11:28.419Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aleem-khan-directs-urgent-road-restoration-in-northern-areas-after-rains-landslides/",
  "dateList": "2025-08-15",
  "date_published": "2025-08-16T03:36:00.000Z"
}
