{
  "title": "Ministry completes all arrangements to organize Int’l Real Estate Expo",
  "link": "https://www.app.com.pk/national/ministry-completes-all-arrangements-to-organize-intl-real-estate-expo-2/",
  "date_published": "2022-12-04T08:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 4 (APP): The Ministry of Housing and Works has completed all the arrangements to organize the first ever ‘International Housing and Real Estate Expo’ on December 8 to promote the real estate business in the country, besides ensuring safe and secure housing for the people.\n“A four-day expo will be organized in collaboration with other relevant ministries, agencies, organizations, and authorities to encourage the approved housing projects and uplift the construction sector in the country,” an official in the Ministry told APP.\nHe said that the people associated with the real estate and housing industry across the country would participate in the exhibition.\nThe stall was allocated to all the real estate developers, housing societies, real estate consultants, and construction material-related industries.\nThe main objective of the expo is to create awareness among the masses on approved real estate in the country, he added.\nThe official said that the Ministry would also allocate the stalls to those whose housing projects and companies were approved by the government, taxpayers, and companies with No Objection Certificates (NoCs) from relevant authorities.\nMeanwhile, Secretary of Housing and Works Iftikhar Ali Shallwani told that the construction sector was the biggest provider of job opportunities for it has several other industries attached to it.\n“It was a fundamental right of everyone to have secure and safe housing, and the ministry intended to organize the event to achieve this purpose,” he added.\nIftikhar Shallwani said different stalls would be set up by the Federal Government Employees Housing Authority (FGEHA), Pakistan Housing Authority Foundation (PHAF), and the country’s major builders, developers, and marketing companies.\nThe Secretary said that he had also extended a cordial invitation to the ambassadors of different countries to participate in the upcoming expo and avail the opportunities in the housing sector which were offered by the present government.\nC:sra/P:sra/L:abk/E:abk/I:nsr/W:nsr/R:nsr",
  "retrievedAt": "2025-08-11T15:57:22.845Z"
}
