{
  "title": "Thailand-Pakistan trade volume reaches over $1.8 billion:  Ambassador Chakkrid",
  "link": "https://www.app.com.pk/national/thailand-pakistan-trade-volume-reaches-over-1-8-billion-ambassador-chakkrid/",
  "date_published": "2022-12-04T11:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 4 (APP): Ambassador of Thailand to Pakistan Chakkrid Krachaiwong has said that the bilateral trade volume between Pakistan and Thailand has reached $1.8 billion.\nAddressing the celebration ceremony of the 95th National Day of the Kingdom of Thailand, he said that our bilateral trade volume would reach to highest record as this September has already reached 6 percent higher than the previous year and both countries were focusing on exploring more avenues of trade and investments in multiple sectors.\nHe said that “We have received the good news that Pakistani businessman who joined Rawalpindi Chamber of commerce’s trip to Thailand has invested in buying two hotels in Phuket” which is a good sign for increasing bilateral investments.\nThe Ambassador added that Thailand and Pakistan have celebrated the 70th anniversary of our diplomatic relations. However, linkages between our two countries dated back more than 2,000 years ago. Taxila has been mentioned in Thai student books and plays.\nThe Ambassador emphasized that as a friend, Thailand will work hand in hand with Pakistan to achieve our common goals for the benefit of our people as well as the people of the world.\nSpeaking about the people-to-people exchanges, he said that Thai Airways has decided to resume its direct flights to all three major cities including Islamabad, Lahore, and Karachi.\nThe number of flights would also be increased from just once a week to several times a week. He said from the last many years, Thailand proud to host travelers from Pakistan for vacations and Thai Food.\nExplaining the importance of ASEAN, the Ambassador said that Thailand with the support of other member states in Islamabad has worked closely to enhance multi-faceted cooperation with Pakistan.\nASEAN desks have been established at Rawalpindi and Islamabad Chamber of Commerce to facilitate business people who wish to seek information about doing business in ASEAN, he added.\nHighlighting the significance of the national day, he said that the 5th of December is an important day for Thai people as they commemorate the National Day of the Kingdom of Thailand, the Birthday Anniversary of the late King Bhumibol, and Thailand’s Father’s Day.\nThe 5th of December is also recognized by the UN as “World Soil Day” to acknowledge the late King’s remarkable contributions to soil science for the improvement of the livelihood of people.",
  "retrievedAt": "2025-08-11T15:57:23.386Z"
}
