{
  "title": "Pakistan-Qatar agreements to boost job prospects, SAPM meets separately with Qatari Ministers",
  "link": "https://www.app.com.pk/national/pakistan-qatar-agreements-to-boost-job-prospects-sapm-meets-separately-with-qatari-ministers/",
  "date_published": "2024-01-22T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): Special Assistant to the Prime Minister on Overseas Pakistanis and Human Resource Development (SAPM OP&HRD), Jawad Sohrab Malik, led a successful official visit to Qatar, culminating in the signing of several Agreements & Letter’s\nof Intent (LOIs) with top Qatari companies intended to significantly enhance employment opportunities for the Pakistani workforce in Qatar.\nThe signing of these agreements with renowned Qatari firms, including Qatari Diyar-Saudi Bin Laden Group Construction (QD-SBG), Hamad Bin Khaled Contracting Company W.L.L (HBK), Ali Bin Ali Holding W.L.L, Sheikh Jabor Bin Mansour\nBin Jabor Bin Jassim Al Thani (JMJ) Holding, Tabeeb Care Medical Services, and Al Rawnaq International Commercial Projects, marks a crucial step in strengthening bilateral relations between Pakistan and Qatar in the field of human resource development, a news release said.\nIn addition to these agreements, the Special Assistant to the Prime Minister, Jawad Sohrab Malik held a significant meeting with Hamad Saleh Al Qamra, Chairman of Al Qamra Holding, focusing on the recruitment of Pakistani manpower for various company projects. The visit also included a tour of the View Hospital, a part of Elegancia Health Care, where the recruitment of Pakistani health professionals is underway following a recent MoU between Elegancia Health Care and the Overseas Employment Corporation (OEC) of Pakistan.\nThe primary objective of these initiatives is to create enhanced employment avenues for Pakistani workers in Qatar. SAPM Malik highlighted the potential of Pakistan as a key manpower exporter and detailed the government’s efforts to streamline this process through quality recruitment agencies, skill development, and addressing foreign employers’ needs.\nThe CEOs of the Qatari companies expressed satisfaction with the Pakistani workforce and their willingness to increase Pakistani manpower in their companies, adhering to the governmental regulations of Qatar. The meetings also shed light on the growing demand for skilled labor in sectors like services, maintenance, hospitality, and construction, following Qatar’s significant infrastructural development.\nJawad Sohrab Malik also held separate in-depth one to one meetings with Qatar’s Labour Minister, Interior Minister,and Qatar’s Education Minister during his 3-day visit.\nThese agreements and discussions represent a significant stride in increasing the presence of the Pakistani workforce\nin Qatar, paving the way for mutual economic growth and stronger bilateral ties.",
  "retrievedAt": "2025-08-10T23:48:17.523Z"
}
