{
  "title": "Speakers for capacity building of women political leaders at grass-root level",
  "link": "https://www.app.com.pk/national/speakers-for-capacity-building-of-women-political-leaders-at-grass-root-level/",
  "date_published": "2024-01-22T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): Creating an enabling environment to build the capacity of women leaders in politics at the grass-root level is crucial to increasing their participation and representation in higher power corridors, said the speakers at a Master class titled “Women’s Campaign Readiness Program”, organized by the Sustainable Development Policy Institute and partners here on Monday.\nDr Abid Qaiyum Suleri, Executive Director, SDPI remarked that empowerment of women calls for increasing their effective participation in power corridors and their representation should be supported with sufficient financial allocation.\nHe stressed that the capacity of women leaders should be built from a grassroots level which is only possible by engaging with them. He said that only they can enlighten us about the challenges that confront them especially when conducting electoral campaigns, media engagement and different challenges due to media engagement.\nDr Suleri emphasized that while enhancing the capacity of women leaders is crucial, the role of men in the quest for women’s empowerment cannot be stressed enough. He insisted on sensitizing men about the challenges faced by women and then building their capacity as allies for women’s empowerment.\nSenator Seemi Ezdi addressing the session, said that when it comes to political activism and engagement, women face additional challenges as they are engaged in domestic work and must look after their families as well. She said that despite this, the establishment of women’s wings in political parties has played an important role in enhancing women’s engagement in politics.\nShe said that for every woman entering politics, education and awareness about issues of the masses especially women are critical in enabling their effective role.\nSenator Fawzia Arshad said that there is no denial that women face much more challenges in politics than their male counterparts, but they must remain positive and become saviors rather than victims. She said that women should not consider themselves weak but realize their innate strength.\nSenator Naeema Kishwar Khan urged that local government systems should be strengthened for effective service delivery to the people. She stressed that representatives of the local government systems should question the parliamentarians of their constituencies about the allocation and use of funds. They must also take the initiative to suggest projects and initiatives that are needed in their areas.\nAisha Sayed, a former member National Assembly shared her journey into politics and stressed that beginning a political journey from the grass-root level equips women leaders with diverse experiences and knowledge of the issues of the common public.\nTherefore, she suggested that women must start their journey with grass-root politics. She added that while social norms and family commitments hinder an increase in women’s political representation, their commitment and hard work eventually break these barriers.\nAbdullah Khalid, Project Coordinator, SDPI shedding light on the initiative taken by SDPI informed that the program has been designed to build the capacity of women to increase their active and efficient role in political and electoral reforms.\nHe informed that the training curriculum is based on the need assessment conducted in consultation with political parties as key stakeholders. He added that the review of legislative frameworks in provinces has highlighted the dire need for improvement which calls for enhancing capacity and building knowledge of women leaders.\nHe added that the aim to increase the representation of women in politics lies at the heart of this agenda.\nParticipants of the Masterclass comprised elected and aspiring local government representatives from Punjab, Sindh, Balochistan, and Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-10T23:48:26.331Z"
}
