{
  "title": "Assumptions, rumours about elections have died: Solangi",
  "link": "https://www.app.com.pk/national/assumptions-rumours-about-elections-have-died-solangi/",
  "date_published": "2024-01-22T07:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP):Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Monday said that all assumptions and rumours regarding the general elections had died.\nDelivering his speech at a function organized by the Pakistan Institute of Development Economics ( PIDE)  here, he said that elections will be held on Thursday, February 8, 2024 and the people of Pakistan will exercise their right to vote.\nThe minister said it was the responsibility of the caretaker government to provide support to the Election Commission of Pakistan ( ECP) and it will fulfill its responsibility.\nBeing a parliamentary democracy, he said, the elected representatives had the rightful mandate to run the system in line with the country’s Constitution.\nUrging the national media for responsible reporting on elections, Murtaza Solangi said, “The responsibility of the media had increased a lot with regard to general elections”.\nImportant issues including the economy, foreign policy, education, and health were used to be part of the manifestoes of political parties, Murtaza Solangi maintained.\nHe said that basic issues should be discussed and awareness among the people on national issues should be increased.\n“Today we are facing problems like population growth,” Murtaza Solangi said that it should be controlled.\nHe said it was the obligation of the political parties to fulfill promises made to the electorate.\nHe opined that increasing awareness about national issues was the need of the hour. The minister said that under the 18th Amendment, provinces had been empowered. He also stressed for promotion of democratic attitudes within political parties.\nHe expressed the hope the political parties coming to power after the February elections would take steps for the resolution of real problems in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:49:43.851Z"
}
