{
  "title": "Engineers playing key role in country’s development: President",
  "link": "https://www.app.com.pk/national/engineers-playing-key-role-in-countrys-development-president/",
  "date_published": "2024-01-22T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): President Dr Arif Alvi on Monday stressing the significance of engineering expertise in every sector of life, underscored the need for continued support and recognition of the engineering community to propel the nation towards sustainable growth and prosperity.\nAddressing an event titled “PEC Engineers’ Excellence Award 2022” held at Aiwan-e-Sadr, the president said the Pakistani engineers had, in the past, played key role in the development of the gulf countries. He said Pakistan needed more engineers in various sectors to ensure sustainable development.\nHe said Pakistan produced only 25000 engineers annually which was not enough for the country’s need. Out of these, a sizable portion seeks immigration and goes abroad after graduation. In comparison, the president said that India produced over 1.5 million engineers per year.\nPresident Alvi said human resources had been a big challenge for the country as in other sectors like health, the country needed more human resources. “There are only 150,000 working nurses against the total demand of 0.9 million nurses in the country.” Similarly, he regretted that an alarming number of around 26 million children were currently out of school in the country and would become a big burden in future for the society.\nHe said despite challenges, the Information Technology sector of the country was showing good performance which was evident from the fact that over 2.2 million freelancers were earning their bread and butter along with foreign exchange for the country.\nHe said to increase the number of engineers and to educate the out-of-school children the government needed huge resources. The resources, he said could be managed by bringing reforms in the taxation system. However, he said decades had passed since various financial institutions including the International Monetary Fund (IMF), World Bank and others had been recommending Pakistan to tax the wealthy people. Despite making policies we could not force the elite of the country to pay their due taxes.” The president said, “Only words do not make sense, we need implementation not words”. He pointed out that the country’s tax to GDP was too low at around 9% which needed to be enhanced.\nPresident Alvi said the world was moving towards an abundance of food and resources while we were still stuck in a scarcity of resources.\n“We need champions in every sector to achieve the goals of sustainable development,” he said adding amnesty schemes never worked as the government introduced amnesties every year which yielded no results.\nReferring to the atrocities being committed on the Palestinians in Gaza, the president called for adopting ethics and morality across the societies to maintain peace in the world.\nHe said wars would further complicate the world’s challenges. Due to such complexities, the rich were becoming the richest while the poor were becoming the poorest.\nEarlier, President Alvi conferred awards to Pakistan’s engineers in different categories to acknowledge their contribution towards the country’s development.\nChairman Pakistan Engineering Council (PEC) Muhammad Najeeb Haroon said every year, the Council awards the outperforming engineers to acknowledge their efforts and contribution to the country’s development.\nHe said the engineers had made outstanding contributions in a range of areas including defence production, nuclear technology, water and power, railways, road, communications, agriculture, telecommunication, manufacturing, chemical and petrochemical industries.\nHe informed that the PEC had also achieved historical milestones and represented Pakistan as a signatory and member at all the relevant international professional forums, enabling the country to stand among the technologically advanced and developed nations through the Washington Accord and International Professional Engineers Agreement under the International Engineering Alliance, FEIIC, FEIAP NABEEA and other prestigious forums.\nHe said the PEC was now playing its professional role as a mentor and reviewer to countries like Saudi Arabia, Nigeria, Kenya, Myanmar and Central Asian Republics to join these professional forums.",
  "retrievedAt": "2025-08-10T23:49:08.570Z"
}
