{
  "title": "PTCL, Huawei conduct 50G-PON trial to pioneer next generation fiber optic broadband in Pakistan",
  "link": "https://www.app.com.pk/national/ptcl-huawei-conduct-50g-pon-trial-to-pioneer-next-generation-fiber-optic-broadband-in-pakistan/",
  "date_published": "2024-01-22T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP):Pakistan Telecommunication Company Limited (PTCL), the country’s leading broadband service provider, completed the country’s first successful trial of 50G-PON technology, marking a historic stride towards the introduction of next-generation fiber-optic broadband services in Pakistan.\nThis groundbreaking achievement is a result of PTCL’s strategic partnership with Huawei, a global leader in information and communication technology, said a news release.\n50G-PON, defined by ITU-T as a next-generation Passive Optical Network-based broadband technology, is set to revolutionize Pakistan’s digital landscape.\nWith significantly higher capabilities than the existing GPON and XG(S)-GPON technologies, 50G-PON delivers an astounding 50 Gbps per PON port.\nThe technology is poised to reshape future requirements related to Industries, Enterprises, Campuses and Home Environments, as the advancement unlocks the infinite potential for bandwidth-intensive & low-latency next-generation services.\nKey use cases include evolution towards Holographic Technologies, XR-based Metaverse in home & workplace, Smart Manufacturing based on 3D Machine Vision, Remote Surgery and Medical Clinics, High Performance Gaming, etc. It will also be a valuable tool for business and enterprise services, and is well-suited to serve Smart Campuses, Video Production Studios, Edge Data Centers and Cloud-Centric SMEs and SoHos, etc.\nOne of the remarkable features of 50G-PON technology is its ability to coexist seamlessly with GPON and XG(S)-PON over the same physical and passive optical network. This will allow PTCL to provide significantly higher broadband speeds for its customers through an on-demand service upgrade request.\nGroup Chief Technology and Information Officer (GCTIO), PTCL & Ufone 4G, Jafar Khalid, expressed his enthusiasm on this momentous occasion, stating, “PTCL has achieved another milestone by delivering Pakistan’s first-ever trial of 50G-PON technology. In our ongoing commitment to lead the market in offering next-generation broadband services, PTCL’s collaboration with Huawei on 50G-PON is a massive step towards the future evolution of fiber broadband in Pakistan. This initiative aims to radically enhance consumer user experience and accelerate enterprise digital transformation, contributing to the realization of a viable and prosperous Digital Pakistan.”\nAs PTCL continues to spearhead innovations in the telecommunications sector, the successful trial of 50G-PON technology and its eventual commercial realization reaffirms our dedication to providing cutting-edge solutions that will propel Pakistan into a digitally advanced era.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:48:53.645Z"
}
