{
  "title": "FIA cyber crime working to nab culprits behind spreading hate material on social media: Waqar",
  "link": "https://www.app.com.pk/national/fia-cyber-crime-working-to-nab-culprits-behind-spreading-hate-material-on-social-media-waqar/",
  "date_published": "2024-01-22T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP):Director Cyber Crime of Federal Investigation Agency (FIA), Waqar uddin Syed on Monday said that FIA cyber crime is working round-the-clock to apprehend the culprits behind spreading hate material on social media.\nThe cyber crime is on high alert on spread of hate material on social media, he said while addressing a press conference flanked by the caretaker federal minister for information and broadcasting Murtaza Solangi here.\nDirector FIA cyber-crime Waqar  uddin Syed said: “No one would be allowed to create anarchy or malign state and its institutions through malicious campaign on social media.”\nSo far, FIA cyber-crime wing has identified more than five hundred accounts and monitoring many others, he disclosed. The mandate of the joint investigation team is to submit a report in two weeks time, he said adding that FIA cyber-crime wing is working day & night to apprehend the culprits and bring them into the ambit of law.\nHe stated that cyber crime wing is monitoring all social media applications and platforms which are being used by individuals to spread venomous and misleading content against the state institutions.\nThe cyber-crime wing will not delay any action against those found involved in spreading hate material or running malicious campaign on social media, he said. He added that all police stations and reporting centers have been directed\nto take immediate notice and action against those using social media applications and platforms as a weapon for maligning   state institutions. He said that cyber crimes didn’t have boundaries and therefore, it is difficult to say at this point whether these accounts were being operated or used within the country or outside the state. He, however, said that concerned team of FIA cyber crime wing is working round-the-clock to identify individuals and their locations for further action.\nHe appealed the general public to avoid becoming a tool in the hands of such type of people spearing hate material on social media. He vowed to take indiscriminate action against those found involved in such objectionable and henious activities against the state institutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:49:05.660Z"
}
