{
  "title": "Media strong platform for educating public about uploading any unlawful content on social media: DG PTA",
  "link": "https://www.app.com.pk/national/media-strong-platform-for-educating-public-about-uploading-any-unlawful-content-on-social-media-dg-pta/",
  "date_published": "2024-01-22T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): Director General of the Pakistan Telecommunication Authority (PTA), Ahmed Shamim Pirzada on Monday said that media is a strong platform for creating awareness and educating the public about uploading or sharing any unlawful content on internet and social media.\nAddressing a press conference along with Minister for Information and Broadcasting, Murtaza Solangi and DG FIA, he said, “Media is a strong platform that can help to create public awareness about what kind of content can be shared, and what repercussions shared content may have for the nation.”\nPirzada said that, sometimes, individuals, including youngsters, inadvertently share content that can be harmful to the country and the public on social media.\nThe DG said that the PTA has taken several steps to educate the general public, including writing articles and running media campaigns for awareness.\nAdditionally, the authority holds regular meetings with social media companies every three to six months to address concerns and collaborate on solutions.\nIn response to a question, Pirzada said that occasional technical glitches may occur in the system due to system upgrades, and such issues may be experienced in the next two to three months.\nHe explained that the PTA operates under Section 37 of the Prevention of Electronic Crime Act (PECA), empowering the authority to remove or block unlawful online content in the interest of defence, glory of Islam, contempt of court, decency and morality, defamation, child pornography, the modesty of natural persons, the dignity of natural persons, public order, hate speech, incitement to an offence, etc.\nHe said that any person can lodge a complaint against objectionable internet content, and these complaints are received via the Complaint Management System (CMS).\nHe said, that the PTA also conducts proactive searches on the direction of courts and promptly addresses received complaints, emphasizing its primary duty to remove and block unlawful content.\nThe DG said that about 44 stakeholders, including the Federal Investigation Agency (FIA), provincial home departments, provincial Counter Terrorism Departments, Ministry of Religious Affairs, Ministry of Foreign Affairs, Ministry of Interior, and others, informed the PTA through the portal regarding any unlawful contents and activities.\nHe said that the authority takes swift action upon receiving complaints, underscoring its commitment to removing and blocking any unlawful content.",
  "retrievedAt": "2025-08-10T23:49:12.114Z"
}
