{
  "title": "AJK President described role of technology as vital to prevent spread of pandemics",
  "link": "https://www.app.com.pk/national/ajk-president-described-role-of-technology-as-vital-to-prevent-spread-of-pandemics/",
  "date_published": "2021-05-30T12:03:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 30 (APP):The AJK President Sardar Masood Khan has said that the importance of new technologies in the fight against the coronavirus pandemic cannot be overlooked as these technologies have huge potential for detection, timely diagnosis, effective treatment, and future prevention of the COVID-19.\nAddressing a webinar on “Coronavirus and the role of technologies” organized by the computing and engineering department of the University of Kotli late Saturday, he said that though vaccines and medicines are being used to treat COVID- 19, major reliance has been on prevention, surveillance, and containment of the pandemic, AJK President office told media on Sunday.\nEnumerating the technologies being used to curb the viral spread of coronavirus, the State President said that geospatial technology, artificial intelligence (AI), big data, telemedicine, blockchain, 5G technology, smart applications, Internet of Medical Things (IoMT), robotics, and additive manufacturing are substantially important for COVID-19 detection, monitoring, diagnosing, screening, surveillance, mapping, tracking, and creating awareness about the pandemic.\n“These technologies have been used on a large scale in the developed world, but unfortunately the developing nations are behind the curve in inducting, absorbing, and mainstreaming these technologies,” he added.\nSardar Masood Khan maintained that the technology cannot prevent the outbreak of pandemics; but it can help prevent the spread, inform, warn, and enable people to respond better and mitigate the impact.\nThe AJK president said that areas where technologies can help most are contact tracing by data sharing, digital facial recognition, threat assessment, and disease forecasts by using Artificial Intelligence, robots and drones for goods delivery, automatic temperature monitoring, remote working to ensure social distancing, and software to detect Covid through the chest scans.\nHe said digital technologies are being harnessed to support the public-health response to COVID-19 worldwide, including population surveillance, case identification, contact tracing, and evaluation of interventions on the basis of mobility data and communication with the public.\n“These rapid responses leverage billions of mobile phones, large online datasets, connected devices, relatively low-cost computing resources, and advances in machine learning and natural language processing,” he said.\nHe went on to say that after the outbreak of coronavirus, the AJK government with the help of technologies had established PCR labs and diagnostic centers, upgraded monitoring, and care system in the hospitals, supply of vaccine introduced tele-medicines, and chest scanning.\nSimilarly, after the closure of educational institutions because of lockdown, a revolution was brought about in the distance education and examination systems with the help of technology.",
  "retrievedAt": "2025-08-11T20:46:54.414Z"
}
