{
  "title": "PPP raising water issue to divert attention from lawlessness: Haleem Adil",
  "link": "https://www.app.com.pk/national/ppp-raising-water-issue-to-divert-attention-from-lawlessness-haleem-adil-2/",
  "date_published": "2021-05-30T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Pakistan Tehreek-e-Insaf (PTI) Vice President and the leader of opposition in Sindh Assembly Haleem Adil Sheikh on Sunday said that the PPP rulers were raising water issues to divert attention of masses from worrisome lawlessness in the province.\nAddressing a press conference here, Haleem Adil said that the Sindh government diverted the attention of the masses on the water issue and slowed down operation against the dacoits.\nHe said that the Sindh Chief Minister referred to the report of Anwar Mansoor in which it was written that now water was not available as before. The Sindh Chief Minister mentioned his favourite part from Anwar Mansoor’s report and forgot the rest, he added.\nHe said that the dams which were not controversial could be built former rulers ignored the important matter. He asked who talked about building dams except Prime Minister Imran Khan.\nHe said that some people did not allow telemetry systems to be installed for specific purposes. The report of the new Attorney General Khalid Jawed Khan has also come which was not mentioned by the Sindh Chief Minister, he added that the Chief Minister of Sindh told half the truth.\nHe said that  when the dacoits killed 9 people in Sindh, he went to the affected areas on the issue of dacoit’s terrorism and water. He said that he met the martyrs of the police and prepared a report and presented it in a meeting with the Prime Minister.\nHe alleged that the Sindh government embezzled Rs 7880 billion and people faced difficulties due to this. The robbers started marketing on social media, he added.\nHe said that the attempts had been made to sway the dacoit issue in Sindh over water issue. There was a shortage of water in Sindh but the reasons should be known, he added.\nHe said when Sindh got less resource last year due to coronovirus, Bilawal stated that their resources were not being provided.\nHe said that this time the rainfall was less and the temperature was lower. These were the reasons for the decrease in water, he added. He said that Bilawal Bhutto should have understood the same formula as he himself had said.\nSheikh said that in Sindh, more than 40 percent voters had given vote to them.",
  "retrievedAt": "2025-08-11T20:46:55.275Z"
}
