{
  "title": "First time in history, country collects Rs 4.143 trln revenue: Fawad",
  "link": "https://www.app.com.pk/national/first-time-in-history-country-collects-rs-4-143-trln-revenue-fawad/",
  "date_published": "2021-05-30T10:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 30 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Sunday said first time in the history of the country, a record Rs 4.143 trillion revenue had been collected during the current fiscal year so far.\nThe landmark achievement was made due to prudent economic policies of\nPakistan Tehreek-e-Insaf (PTI) government led by Prime Minister Imran Khan.\nIn a series of tweets, Chaudhry Fawad said positive results of the economic policies of the incumbent government had started yielding results.\nپیپلز پارٹی اور نون لیگ نے معیشت کا جو حشر کیا اس کے نتیجے میں معاشی تکلیفوں کا سامنا کرنا پڑا،ایک طویل انتظار کے بعد معاشی پالیسیوں کے مثبت نتائج سامنے آنا شروع ہو گئے ہیں ملک کی تاریخ میں پہلی بار چارہزار ارب روپے سے زیادہ ٹیکس اکٹھا ہوا، بیرون ملک پاکستانیوں نے معیشت کو\n— Ch Fawad Hussain (@fawadchaudhry) May 30, 2021\nHe said in this scenario, it’s a mind-boggling question that why the opposition was calling for protest demonstrations at a time when the economy was booming and the living conditions of common man were improving. “Who will be benefited from such negative politics”, he questioned.\nThe minister said, Pakistan People’s Party (PPP) and Pakistan Muslim League-Nawaz (PML-N) whenever came into power, had ruined the economy, resultantly the country endured an economic downturn.\nFawad said expatriate Pakistanis have contributed immensely to economic revival by sending over Rs 1,000 billion to the country.\nLikewise, he said, record production of wheat, rice, sugarcane, and maize have been recorded while Rs 1,100 billion had been transferred to the agriculture economy.\nاسٹاک مارکیٹ نے 27 مئی کو 2.21 ارب شیئرز کی خریدو فروخت سے نیا ریکارڈ قائم کیا، اس وقت پاکستان کی مارکیٹ دنیا کی بہترین مارکیٹ ہے، سوال یہ ہے کہ کیااس وقت جب معیشت اوپر جارہی ہے اور عام آدمی کی حالت بدل رہی ہے اپوزیشن احتجاج کی کال کیوں دے رہی ہے؟ ایسی سیاست کا فائدہ کس کو ہوگا\nThe transfer of money, he said, had increased purchasing power of the farmers’ community. Consequently, the sale of tractors had also increased by 64 percent. The use of fertilizer and pesticides also registered a significant increase, he said.\nThe minister added that at present Pakistani market was one of the best performing markets in the world.\nSimilarly, on May 27, the stock market had also set a new record touching the significant level of selling 2.21 billion shares.",
  "retrievedAt": "2025-08-11T20:46:56.671Z"
}
