{
  "title": "104 new confirm cases of coronavirus detected in Sindh during last 24 hours : CM Sindh",
  "link": "https://www.app.com.pk/national/104-new-confirm-cases-of-coronavirus-detected-in-sindh-during-last-24-hours-cm-sindh/",
  "date_published": "2020-04-11T02:35:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 11 (APP):Sindh Chief Minister Syed Murad Ali Shah Saturday said that 104 new coronavirus cases had been detected in the province during the last 24 hours .\n“This is quite worrisome situation and its solution lies in social distancing and observing the lockdown in true letter and spirit,” he said in his video message released from CM House.\nThe chief minister said that during last 24 hours (Friday to Saturday 8am) 531 new samples were tested, of them 104 were resulted in positive.\n“This is 20 percent of the total tested cases which is highest average of positive cases in the world,” he said and added now we had 1318 positive cases in the province.\nSyed Murad Ali Shah said that six patients expired till Thursday morning and the number of expired patients so far had reached to 28. “The death ratio comes to 2.1 percent,” he said.\nHe said 922 patients, including 604 in home isolation and 35 at Isolation center were under treatment in different hospitals. In Hyderabad, 135 patients are under treatment and in Karachi 111 are being treated in different hospitals.\nHe said that 371 persons had recovered and on Saturday 13 patients recovered and returned to their homes. This was good news, he said.\nGiving frequency of the positive cases, the chief minister said that 64 people between 1 to 10 years had been affected, 104 had the age of 11 to 20, 270 of 21 to 30 years, 227 of 31 to 40 year, 182 of 41 to 50 years, 197 of 51 to 60 years, 135 are between 61 to 70 years, 41 are between 71 to 80 and five of 81 to 90 year. This shows that it had affected the age group between 21 to 60 years, he added.\nThe chief minister said that situation of the growth cases of coronavirus required to ascertain how we had to lead our lives onward. “To me, its only solution is lockdown and now few days are left to the present lockdown and we all have to observe it in true letter and spirit,” he said and added even in post-lockdown period people had to ensure social distancing at their work places and at home and even in buses.\nThe CM Sindh said that the on-going lockdown was taken lightly that was the reason why cases in the city and other districts had started increasing.\n‘I have ordered to further tightening the lockdown in Malir and other areas where more cases have been diagnosed,” he said and added “this is very serious matter and we would have to take it seriously.”\nMeanwhile, on the instruction of the chief minister the District East deputy commissioner had sealed 12 union councils of his district where cases had been detected.\nThe union councils sealed in District East include UC-6 Gilani Railways, UC-7 Dalmia, UC-8 Jamali Colony, UC-9 Gulshan-II, UC-10 Pehalwan Goth, UC-12 Gulzar-e-Hijri, UC -13 Safora, UC-14 Faisal , UC-1 Manzoor Colony, UC -9 Jacob Line and UC-10 Jamshed Quarters.\nThe government directed Karachi police and Rangers to cordon off the sealed union council. A notification of the purpose has been issued.",
  "retrievedAt": "2025-08-11T19:04:58.917Z"
}
