{
  "title": "Ehsaas disburses Rs. 13.18 billion to 1.098 million families in 60 hours",
  "link": "https://www.app.com.pk/national/ehsaas-emergency-cash-programme-receives-62750461-sms/",
  "date_published": "2020-04-11T07:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 11 (APP):Ehsaas has disbursed an amount of Rs. 13.18 billion to 1.098 million families all over the country during the 60 hours since beginning of payment process to support the affected people due to lockdown amid COVID-19 crisis.\nThe Ehsaas Emergency Cash payments have been started countrywide on Apr 9, 2020 on the special instructions of the Prime Minister to financially aid more than 12 million deserving families whose incomes are adversely affected by the coronavirus lockdown.\nOut of the planned 17,000 biometrically enabled Ehsaas cash distribution points, 7,317 have been opened countrywide with special protective measures for COVID-19 to facilitate speedy cash payments to those in need.\nEhsaas has set out special protocols to safeguard Corona preventive measures through Ehsaas Emergency Cash distribution including social distancing, sanitization and hand-washing, ensuring wellness and safety of cash recipients.\nThe number of cash distribution centers and counters was being increased to prevent over-crowding of beneficiaries, said a news release issued here on Saturday.\nDr. Sania Nishtar, Prime Minister’s Special Assistant to the PM said, “Since the Ehsaas Emergency Cash operations began nationwide on Thursday, Ehsaas has witnessed long queues in some places but in majority of cases, things were orderly and Rs. 12,000 was being given to hundreds of thousands of people in just two days.”\nAccording to details, overall cash distributions were running smooth across the country except few cases.\nHowever, 40 Ehsaas Emergency Cash retailers have been arrested over swindling beneficiaries in different ways in some parts of the country particularly Sindh, South Punjab and Khyber Pakhtunkhwa.\nTaking strict action on the complaints of beneficiaries lodged through around 34 FIRs, fraudster device operators were arrested by the police and sent to lockups for fraudulently deducting Rs. 500 – 1,000 from every recipient for processing their payment.\nDistrict Administration, Police, military personnel and Ehsaas regional offices jointly stepped up against the corrupt payment operators and arrested them from payment sites.\nThe arrested device operators would be dealt in accordance with the law.\nMeanwhile, Ehsaas regional monitoring teams were closely monitoring payment operations across Pakistan to ensure that deserving families get full payments without any deduction.\nTalking about few cases reported on mismanagement and corruption, Dr. Nishtar stated, “I have written a stern letter to Ehsaas regional officials countrywide to stringently ensure transparent operations in emergency cash disbursements. I shall not tolerate any mismanagement or embezzlement and would continue fighting corruption till my last breath.”\nUrging recipients of Ehsaas Emergency Cash assistance to insist on getting full payment of Rs. 12,000 cash handouts from the retailers, she said, “If any device operator demands any favour or deduction, it should be immediately reported, and the concerned authorities should come into action immediately to take strict action against such persons.”\n“For queries, the citizens can call on the toll-free number 0800-26477,” the Special Assistant added.",
  "retrievedAt": "2025-08-11T19:04:50.896Z"
}
