{
  "title": "CDA begins monthly cleaning of water tanks, filtration plants in Islamabad",
  "author": null,
  "content": "Media error: Format(s) not supported or source(s) not found\nISLAMABAD, Aug 31 (APP): The Capital Development Authority (CDA) has formally begun the monthly cleaning of all overhead water tanks and the maintenance of water filtration plants across Islamabad to ensure clean drinking water to residents.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/08/cda.mp4Media error: Format(s) not supported or source(s) not foundDownload File: https://www.app.com.pk/wp-content/uploads/2025/08/cda.mp4?_=100:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\n“The monthly cleaning of overhead tanks and regular maintenance of filtration plants is being undertaken under the supervision of the Director General Islamabad Water,” a CDA spokesperson told APP, citing directives from Chairman Muhammad Ali Randhawa and Chief Commissioner Islamabad. “This initiative ensures that residents have access to safe, clean water for domestic use.”\nHe said roughly 100 water filtration plants have been installed at various locations throughout Islamabad.\nFilters in these plants are regularly replaced, and repair work is being carried out systematically.\nThe step comes after residents had previously raised complaints about the cleanliness of overhead tanks, prompting CDA leadership to formalize the monthly cleaning schedule.\nIn addition to cleaning, the Director General Islamabad Water Management has started installing flow meters on filtration plants to monitor filter usage and lifespan.\n“Flow meters help us identify which plants require more frequent filter replacements due to higher water consumption, the spokesperson explained.\nSo far, approximately forty plants have received flow meters, allowing for timely maintenance tailored to actual usage patterns.\nTo maintain water quality, the CDA conducts monthly internal laboratory tests and arranges additional testing every two to three months through independent bodies such as the Pakistan Council of Research in Water Resources (PCRWR).\nThese measures, spokesperson said, were intended to reassure residents that the water supplied by filtration plants is safe for consumption.\nThe CDA urged citizens to cooperate and report any water-related complaints. A dedicated WhatsApp helpline, 03357775444, has been established for this purpose, ensuring immediate response to service issues.\n“The Islamabad Water Department is working round the clock to provide clean water,” the spokesperson added. “We encourage residents to inform us of any problems so that action can be taken promptly.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:42:44.348Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-begins-monthly-cleaning-of-water-tanks-filtration-plants-in-islamabad/",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T15:42:00.000Z"
}
