{
  "title": "River Chenab likely to attain exceptionally high flood in next 24 hour",
  "author": null,
  "content": "ISLAMABAD, Aug 31 (APP): The Federal Flood Commission (FFC) has said that River Chenab at Trimmu is expected to attain very-high to exceptionally high flood level during the next 24-hours while exceptionally high flood level will continue in River Sutlej at Ganda Singh Wala.\nAccording to daily FFC report on Sunday, River Chenab at Panjnad is expected to attain very high flood to exceptionally high flood level on 4 th September.\nRiver Indus at Guddu is expected to attain very high flood on 5th September while flash flooding is expected in the Nullahs of D.G. Khan, northeastern Balochistan and tributaries of River Kabul.\nUrban Flooding is expected in Rawalpindi, Gujranwala, Gujrat, Lahore and Sahiwal within next 48-hours, the report further said.\nSimilarly, river Indus is running in low flood at Guddu (Falling trend) while River Chenab is in medium flood at Khanki (Steady condition) and high flood at Qadirabad (Falling trend). River Ravi is also flowing in medium flood at Jassar (Falling trend) and exceptionally high flood at Balloki (Falling trend).\nRiver Sutlej is also flowing in exceptionally high flood at Ganda Singh Wala (Steady condition) and in high flood at Suleimanki (steady condition).\nTarbela Dam is at its Maximum Conservation Level (MCL) of 1550 feet since August 27, 2025. Mangla Reservoir stands at 1225 feet which is 17 feet below its MCL of 1242 feet. The combined live storage of Tarbela, Chashma and Mangla reservoirs stands at 11.933 MAF, which is 89.61% of the total available live storage capacity of 13.316 MAF.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:42:55.621Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/river-chenab-likely-to-attain-exceptionally-high-flood-in-next-24-hour/",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T14:20:00.000Z"
}
