{
  "title": "PBM striving for self-reliance & welfare of millions: Shaheen Khalid",
  "author": null,
  "content": "ISLAMABAD, Aug 31 (APP): Managing Director, Pakistan Bait-ul-Mal (PBM), Senator Capt Shaheen Khalid Butt has said that his organisation is committed to transforming the lives of millions of underprivileged citizens by ensuring access to healthcare, education, and financial assistance, while at the same time promoting self-reliance through vocational and technical training.\nSpeaking in an exclusive interview with APP, Shaheen Khalid Butt said PBM today caters to the needs of around 46 percent of the country’s population, and its doors are never closed to any deserving individual who seeks support. “When I joined PBM, I pledged to move beyond charity and focus on empowering people.\nOur prime goal is rehabilitation, making beneficiaries self-sufficient instead of dependent,” he said. As part of this vision, a pilot project was launched to equip 55 people with vocational skills, and all of them are now earning on their own. “They told me they no longer need PBM’s help, which was the most encouraging feedback. This project will now be expanded across the country,” he added.\nThe MD said that while education support remains a major priority, it must be coupled with practical training. “Low-income families often believe that education alone will end their problems, but when they fail to get the jobs they expect, frustration grows.\nThat is why we are aggressively promoting skill-based courses in plumbing, carpentry, electrical work and other trades, so that education is complemented with income generation. We are also signing MoUs with NAVTTC and other institutions to ensure that those wishing to go abroad are properly trained to earn a respectable livelihood,” he noted.\nHighlighting PBM’s healthcare services, he said that in the last five years the organisation had disbursed Rs. 15.43 billion, benefitting more than 115,000 patients suffering from cancer, kidney failure, heart diseases and other critical conditions. More than 2,000 cochlear implants had also been facilitated during this period.\n“We are covering medical services that are often not even fully available in developed countries. Any patient from a low-income family can get free treatment from public hospitals at PBM’s expense. The number of patients approaching us continues to rise, which is why I request the Prime Minister to increase our budget so that we can serve more people,” he emphasized.\nIn the field of education, PBM has provided 32,197 scholarships worth Rs. 9.79 billion in five years, while 160 Schools for Rehabilitation of Child Labourers were educating 22,792 children.\nAt the same time, 46 Sweet Homes in 40 districts are housing and educating around 4,600 orphans. “Our orphanages have produced confident, successful citizens who are now serving the country as doctors, engineers, army officers and police officials,” he remarked.\nWomen’s empowerment, he said, was another important focus of PBM. A total of 165 Women Empowerment Centres are currently functional, where 19,800 women are being trained this year alone, while nearly half a million women have benefited since the programme’s inception.\nThese centres are offering courses in sewing, beauty skills and cooking, and now digital literacy and IT training will also be included. “We have planned a stipend scheme under which girls will receive a handsome amount during their six-month training, enabling them to start their professional journey with dignity and confidence,” he explained.\nPBM is also running 17 shelter homes that have served 9.66 million people in five years, while 30 food vehicles have delivered 7.75 million meals across the country.\nIn support of persons with disabilities, Rs. 394 million has been provided to more than 27,000 families for assistive devices such as wheelchairs and artificial limbs. “The disabled are the responsibility of the whole society. In developed countries, everyone accommodates them in public spaces and workplaces. In Pakistan too, ramps and other facilities should be ensured everywhere so that they can live without being reminded of their challenges,” he appealed.\nThe MD underlined that PBM was ensuring complete transparency in its work. “We do not deal in cash. All payments for medical facilities, education and financial assistance are made through cheques. Our system leaves no room for malpractice,” he asserted.\nHe added that 60 percent of PBM’s operations had already been digitized, enabling applicants to apply online for healthcare and education support, and the process would soon be fully automated.\nTalking about the future, he said PBM had adopted a clear roadmap focused on e-governance, digitization, public-private partnerships, economic rehabilitation of the poor, expansion of healthcare and revitalization of childcare initiatives. Plans are also underway to establish IT labs in PBM schools for child labourers and to scale up biometric payment systems across projects. “We are also grateful to international partners for their support, such as TIKA, which has promised to set up a commercial kitchen to provide meals for our orphanages and centres,” he said.\n“Pakistan Bait-ul-Mal deals with the poorest of the poor, and it is our mission to serve them with transparency, dignity and inclusivity,” Shaheen Khalid Butt concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:43:39.350Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pbm-striving-for-self-reliance-welfare-of-millions-shaheen-khalid/",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T10:23:00.000Z"
}
