{
  "title": "Parliament’s national security committee gives go-ahead to govt for talks with TTP",
  "link": "https://www.app.com.pk/national/parliaments-national-security-committee-gives-go-ahead-to-govt-for-talks-with-ttp/",
  "date_published": "2022-07-05T17:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 5 (APP): The Parliamentary Committee on National Security on Tuesday gave formal approval to the government for holding talks with the proscribed Tehreek-e-Taliban Pakistan (TTP) besides forming a parliamentary oversight committee to ensure the process moved within the constitution’s ambit.\nThe committee, chaired by Prime Minister Shehbaz Sharif, underscored the importance of the national grand reconciliation dialogue and called Tuesday’s meeting the first step in that direction.\nIt was told that for the stability of regional and internal peace, a government committee was holding talks with the TTP with the Afghan government’s cooperation and led by the civil and military leadership while observing the constitutional limits.\nThe committee said that the final outcomes of the talks would be implemented after the government’s approval and the fulfillment of the formalities within the ambit of the constitution.\nThe participants of the meeting reiterated that Pakistan had achieved unprecedented successes against extremism and terrorism which were also acknowledged globally.\nThe committee also paid tribute to the sacrifices of the nation as well as the security forces which led to the establishment of state’s writ across the country.\nThe parliamentary body reiterated that the powers for the use of force rested only with the government.\nWhile acknowledging the sacrifices of the victims of terrorism including those of the Peshawar’s Army Public School attack, the meeting made it clear that the state had been and would remain the protector of sacrifices of the martyrs as well as the victim families.\nThe parliamentary committee also paid tribute to the brave people from tribal areas who rendered huge sacrifices and faced immense difficulties to achieve peace and stability.\nIt was told that the effective and practical measures by the security forces were part of a strategy comprising the components of clear, hold, construction and devolution of powers to the civil administration.\nThe participants resolved that the government was committed to the empowerment and prosperity of the said areas, in accordance with the people’s desires.\nThe meeting was attended by the national parliamentary and political leadership, Senate chairman, members of the National Assembly and Senate standing committee related to the Parliamentary Committee on National Security, and defence, federal ministers, chief ministers of provinces and Gilgit Baltistan, Azad Jammu and Kashmir prime minister and the military leadership.",
  "retrievedAt": "2025-08-11T15:12:27.425Z"
}
