{
  "title": "Complaint lodged against ETPB official for bribe, fraud in FIA",
  "link": "https://www.app.com.pk/national/complaint-lodged-against-etpb-official-for-bribe-fraud-in-fia/",
  "date_published": "2024-07-24T13:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 24 (APP): A formal complaint has been submitted to the Director of Federal Investigation Agency (FIA) Islamabad Zone, against Imran Arif Janjua, a Deputy Administrator at the Evacuee Trust Property Board (ETPB) for accepting a substantial bribe in exchange for a government job appointment.\nThe complainant, Muhammad Shabbir, detailed the incident in his complaint that his nephew, Shehroze Iqbal, is an educated young man who has been struggling to find employment. In an effort to secure a government job for Shehroze, Shabbir was introduced to Imran Arif Janjua by a mutual friend.\nJanjua, who is currently posted as the Deputy Administrator of Plazas at the ET Complex near the private hotel in Islamabad, assured Shabbir that he could arrange for Shehroze to be appointed as a Naib Tehsildar. In return for this favour, Janjua demanded a sum of five million rupees.\nShabbir claimed that he paid three million rupees in cash to Janjua, in the presence of witnesses Muhammad Rafiq (CNIC No. 37405-0374582-7) and Muzamil Hussain (CNIC No. 37405-8414262-5), both residents of Rawalpindi. He promised that the remaining two million rupees would be paid upon the issuance of the appointment letter.\nHowever, despite the passage of six months and the initial payment, Janjua has not fulfilled his promise, nor he has arranged the job for Shehroze.\nIn his complaint, Shabbir has requested the Federal Investigation Agency (FIA) to initiate appropriate criminal proceedings against Janjua. He has also called for an inquiry into Janjua’s assets acquired during his service.\nThe complaint, dated July 22, 2024, was filed by Shabbir urging the FIA to investigate the allegations and take necessary action in accordance with the law.\nUpon contacting ETPB Deputy Administrator Imran Arif Janjua, he denied the allegations, stating that the application was based on false premises.\nAccording to reliable sources, it was revealed that the accused ETPB Deputy Administer Imran Arif Janjua is a habitual fraudster as the FIA Deputy Director, Abbottabad had also received a formal complaint against him for another scam of Rs. three million rupees.\nThe complainant Kamran Khan, a resident of Haripur, mentioned that he wanted to take ETPB’s property number C-50, located at College Road, Haripur on lease for 30 years. For this purpose, he happened to meet Janjua who demanded nine million rupees as a bribe.\nHe said initially, he paid him Rs. 1.5 million. After two months, he handed over an additional one million rupees, and later, he gave him Rs. 500,000 more according to their mutual agreement.\nKamran pleaded that his hard-earned money should be retrieved and that ETPB Deputy Administrator Imran Arif Janjua should be punished according to the law.",
  "retrievedAt": "2025-08-11T04:04:54.929Z"
}
