{
  "title": "NA body on IT unanimously passes Establishment of Telecommunication Appellate Tribunal Bill, 2024",
  "link": "https://www.app.com.pk/national/na-body-on-it-unanimously-passes-establishment-of-telecommunication-appellate-tribunal-bill-2024/",
  "date_published": "2024-07-24T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP): The National Assembly Standing Committee on Information Technology and Telecommunication unanimously Wednesday passed ‘The Establishment of Telecommunication Appellate Tribunal Bill, 2024’ without any amendments.\nThe Committee, chaired by Syed Amin Ul Haque, discussed ‘The Establishment of Telecommunication Appellate Tribunal Bill, 2024’ in detail.\nA representative from the Ministry of Law & Justice informed the Committee that under the Rule of Business, the constitution of all tribunals falls under the Ministry of Law and Justice.\nRegarding the appointment procedure for the Chairpersons of the tribunal, the representative explained that the Ministry of Law & Justice publishes an advertisement in the newspaper.\nA Search Committee, headed by a Grade 20 Officer, scrutinizes the candidates according to the prescribed criteria. The Search Committee then shortlists the candidates and forwards their names to the Federal Council, which is headed by the Law Minister and includes two Federal Secretaries as members.\nThe Council conducts interviews with the shortlisted candidates and makes recommendations to the Federal Cabinet, which then appoints the Chairperson and members of the tribunals.\nThe Committee expressed concern that the E-Office system launched four years ago, has not been properly implemented within the ministries despite the Prime Minister’s directives.\nState Minister for Information Technology and Telecommunication Shaza Fatima Khawaja said that the implementation of the E-Office system should commence from the top level, including Federal Secretaries and Ministers, and then proceed step-by-step downwards to digitize the entire system.\nShe stressed the importance of all ministries playing their role in implementing the E-Office to promote a paperless environment and improve efficiency.\nThe Committee also recommended that the Ministry devise a policy to ensure the security of official correspondence and documents.\nThe Chairman NITB briefed the Committee regarding the launch of the Apostille application, requested by the Foreign Office to address the needs of overseas employees and their document processing.\nThe Committee highlighted the importance of this application and directed its launch within 15 days to resolve the issues and difficulties faced by overseas employees.\nIt also emphasized the need for the Ministry to collaborate with Provincial Ministers for Information Technology to implement IT policies in other provinces.\nThe NA body expressed concern that four districts in Baluchistan have been deprived of mobile data services for the past three years.\nIt decided to call the Chairman of the PTA to its next meeting to address this issue, stating that access to the Internet is a fundamental right of every citizen.\nThe meeting was attended by MNAs Mukhtar Ahmad Malik, Ahmad Atteeq Anwar, Ammar Ahmad Khan Leghari, Mahesh Kumar Malani, Syed Mustafa Kamal, Pullain, Sher Ali Arbab, and Umair Khan Niazi, as well as officials from the Ministry.",
  "retrievedAt": "2025-08-11T04:04:57.544Z"
}
