{
  "title": "CDA chief vows regular board’s meeting",
  "link": "https://www.app.com.pk/national/cda-chief-vows-regular-boards-meeting/",
  "date_published": "2024-07-24T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP):Chairman of the Capital Development Authority (CDA) Muhammad Ali Randhawa on Wednesday decided to hold regular meetings of its board to track the progress of its initiatives aimed at uplifting and beautifying the federal capital.\nHe decided to this effect while chairing an important meeting to discuss the key issues regarding the sector development of Islamabad, the Islamabad Development Plan, and the financial position of authority.\nThe meeting was attended by members of CDA Board, Administrator Metropolitan Corporation Islamabad and other  formations concerned, said a news release.\nDuring the meeting, the member finance provided a detailed briefing on the CDA’s fiscal status and revenue generation efforts.\nIt was decided that revenue generation status would be presented every week, detailing both targets and achievements to ensure transparency and accountability.\nChairman Muhammad Ali Randhawa emphasized the need for regular oversight by instructing that weekly board meetings be held to track progress and make necessary decisions promptly.\nSeveral major initiatives were discussed in detail during the meeting. These included the computerization of land and property records, the operationalization of a smart app for essential services, and the beautification of the Diplomatic Enclave and parks.\nThe Serena Chowk underpass project, a one-window operation for customer facilitation, and ongoing mega road infrastructure projects were also discussed, signaling the CDA’s comprehensive and multi-pronged approach to the overall development of Islamabad city.\nThese initiatives aim to streamline CDA’s operations, boost revenue generation, and expedite development projects across Islamabad.\nTo enhance oversight of the progress, Chairman Randhawa directed that drone cameras be provided to Members Estates, Building Control, Engineering, Environment and DMA to monitor ongoing projects more effectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:04:53.890Z"
}
