{
  "title": "Sanjrani congratulates nation on completion of 70 Years of Sino-Pak friendship",
  "link": "https://www.app.com.pk/national/sanjrani-congratulates-nation-on-completion-of-70-years-of-sino-pak-friendship/",
  "date_published": "2021-05-07T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP): Senate Chairman Muhammad Sadiq Sanjarani has congratulated the people of Pakistan and China on the completion of 70 years of Pakistan-China friendship.\nIn a special message released on Friday, chairman said that the relations between the two countries have been even strong with each passing day during the last seven decades.\nHe said that relations with China are important in our foreign policy and that is why all political parties are united on bilateral cooperation and friendship with China.\nMentioning friendship and trust, he said that the two countries have stood by each other in every difficult time and last year Pakistan’s upper house was the first parliament in the world to pass a resolution praising China.\nHe further said that Pakistan has also passed two resolutions expressing solidarity with China and supporting Pakistan. It is very encouraging that under the leadership of Xi Jinping, China has made remarkable progress during his tenure, relations between Pakistan and China have grown significantly.\nHe said that CPEC, (China-Pakistan Economic Corridor), a new era has begun in the relations between the two countries and it is gratifying that the first phase of CPEC has been completed. Highlighting the importance of CPEC, he said it is a guarantee of a bright future not only for Pakistan but also for all the countries associated with it.\nOn development projects, he said that new employment opportunities were being created to improve connectivity with CPEC road projects and now it was moving beyond energy and road infrastructure to agriculture, economic zones, tourism and other areas.\nHe said that CPEC is a guarantee of a bright future for various countries in the region and it is one of the best economic projects in the world. The Chairman Senate termed CPEC as not only a game changer but also a fat changer for Pakistan and said that it would benefit not only regional traders and investors but also the general public.",
  "retrievedAt": "2025-08-11T20:42:26.205Z"
}
