{
  "title": "26th proposed Constitutional Amendment to further strengthen Parliament: Bilawal",
  "link": "https://www.app.com.pk/national/26th-proposed-constitutional-amendment-to-further-strengthen-parliament-bilawal/",
  "date_published": "2024-10-19T13:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 19 (APP): Chairman Pakistan Peoples Party (PPP), Bilawal Bhutto Zardari on Saturday said that the 26th proposed Constitutional Amendment package would further strengthen the Parliament and democracy in the country.\nTaking to media persons after meeting the Jamiat-e-Ulema Islam-Fazl (JUI-F) chief for consultations on the draft Constitutional Amendment here at his residence, Bilawal Bhutto said that PPP and Chief JUI-F, Maulana Fazlur Rehman had developed complete consensus on proposed Constitutional Amendment.\nHe expressed his hope that Maulana Fazlur Rehman would personally present the proposed Constitutional Amendment draft in the Parliament as the constitutional reform process is progressing rapidly following extensive consultations.\nBilawal Bhutto said that the coalition aims to repeal the 19th Amendment to strengthen parliamentary powers. He highlighted that the draft is reflective of Maulana Fazlur Rehman’s vision for the amendment.\n“We have agreed on constitutional benches instead of establishing constitutional court,” he said.\nHe expressed optimism about securing the support of the Pakistan Tehreek-e-Insaf (PTI) for this joint initiative, adding that PTI should prove itself as a political party rather than a troop of social media.\nBilawal Bhutto urged the JUI-F chief to engage in talks with PTI leaders, suggesting that if the party opts not to back the\ngovernment’s draft, they should lend their support to the PPP-JUI proposal.\nAddressing criticism from the government regarding the opposition’s role, Bilawal Bhutto emphasized the need for consensus in advancing the amendment.\nHe warned PTI that should they choose to diverge from collaborative efforts, the consequences would solely rest on them.\nBilawal Bhutto remained hopeful that a PTI delegation would meet with Maulana Fazlur Rehman soon to further explore this pivotal constitutional reform. The outcome of these negotiations could shape the future dynamics of Pakistan’s political framework.",
  "retrievedAt": "2025-08-10T20:10:05.367Z"
}
