{
  "title": "Govt, IFAD, WFP, FAO committed to enhance food security, nutrition for underserved communities",
  "link": "https://www.app.com.pk/national/govt-ifad-wfp-fao-committed-to-enhance-food-security-nutrition-for-underserved-communities/",
  "date_published": "2024-10-19T10:41:00.000Z",
  "source": "APP",
  "content": "By Muhammad Ilyas Khan, Mudassar Iqbal\nISLAMABAD, Oct 19 (APP):The United Nations-affiliated organisations, the World Food Programme (WFP), the International Fund for Agricultural Development (IFAD) and the Food and Agriculture Organization (FAO) along with the Government of Pakistan and the local community are committed to enhancing food security and nutrition for underserved communities.\n‘In rural Pakistan, food insecurity and climate change are pressing challenges that threaten the well-being of communities. United Nations-affiliated organizations are actively working to ensure that everyone has access to affordable and nutritious food. Their efforts are particularly focused on vulnerable populations, aiming to strengthen food systems and enhance resilience against the impacts of climate change’, said country representatives of WFP, IFAD and FAO while talking to APP in a panel interview.\nWFP Country Representative Coco Ushiyama said the WFP ensures access to a safe and nutritious diet with the support of its partners. She highlighted the importance of social protection systems, such as the Benazir Nashonuma Programme, which aims to prevent stunting among children by combining nutrition services with health education. Additionally, WFP is engaging in school meal programmes across several provinces, including a new initiative in Balochistan, providing children with nutritious meals sourced from local produce.\nTo a question, she said the WFP’s extensive experience with school meal programmes in over 100 countries has shown success in improving school attendance and academic performance.\nShe added that social protection systems are one way we work to ensure access to healthy diets, and another is through food systems, such as fortifying staple foods in collaboration with 150 local small wheat mills (chakkis) to produce fortified flour.\nShe also mentioned that in addition to these efforts, WFP is supporting local livelihoods by addressing community-specific issues. For example, it is working with partners to improve water access and promote kitchen gardening, enabling families to grow their own nutritious produce.\nThrough a combination of these efforts and ongoing nutrition education, she said that WFP hopes to make healthy, safe, and nutritious diets accessible for all Pakistanis, especially those in rural and underserved communities, she maintained.\nThe IFAD Country Representative Fernanda Thomas said as World Food Day emphasizes the right to nutritious food, it’s crucial to acknowledge the ongoing challenges faced by smallholder farmers in Pakistan.\nTo a question about people living below the poverty line, she said that despite global food production levels, millions still experience hunger, exacerbated by climate shocks, adding that IFAD with the support of the government of Pakistan plays a vital role in promoting climate-resilient farming practices, helping farmers adapt while ensuring food production meets local needs.\nBy focusing on nutrition, gender equality, and sustainable agriculture, she said the IFAD is transforming Pakistan’s rural economy and building resilience to climate change. Replying to a question, she said that together, WFP and IFAD are making significant strides in improving food security, ensuring that all communities have access to healthy, safe, and nutritious food, ultimately working towards a future where no one goes hungry.\nFernanda Thomas said the IFAD’s goal is to not only improve food security but also ensure that farmers can thrive in a changing world, adding that the organization remains committed to transforming Pakistan’s rural economy by supporting farmers, promoting sustainable agriculture, and helping communities build resilience to climate change. Through its focus on nutrition, gender equality, and climate adaptation, IFAD is ensuring that vulnerable communities can secure a better future, she added.\nFood and Agriculture Organization (FAO) Country Representative Florence Rolle said that the FAO along with its partners are making efforts to make healthy food available to poor segments of the society by increasing the supply.\nShe said that 20 per cent of the population in Pakistan is under-weight and 15 per cent is under severe food insecurity, adding that the FAO mandate is to advocate for changes, trying new approaches, new technologies, new practices and new policies.\nFlorence said that success lies in the implementation of the policy and guidelines by the government.\nShe said that FAO aims to strengthen local agricultural systems by promoting sustainable practices that increase both productivity and resilience and emphasises the importance of nutrition-sensitive agriculture to ensure that food production satisfies caloric needs while contributing to improved dietary quality.\nFlorence said that FAO provides technical assistance in implementing nutrition-sensitive approaches in agriculture, which includes integrating fruits, vegetables, and legumes into farming systems to improve dietary diversity.\nRecognizing that gender disparities significantly impact food security and nutrition, FAO works to empower women farmers by focusing on their access to resources, training, and decision-making roles, she said.\nFAO is dedicated to strengthening local food systems to ensure the availability and affordability of diverse, nutritious foods, she added.\nCountry Representative FAO aims to support local governments in Pakistan in addressing food security challenges while promoting healthier diets and sustainable agricultural practices. By focusing on productivity, nutrition, safety, and community engagement, FAO envisions a more resilient food system that meets caloric needs and fosters better nutrition for all Pakistanis, paving the way for a healthier and more sustainable future.",
  "retrievedAt": "2025-08-10T20:10:10.502Z"
}
