{
  "title": "President vows to defeat terrorism, stresses national unity",
  "author": null,
  "content": "QUETTA, Mar 19 (APP):President Asif Ali Zardari on Wednesday reiterated that terrorist elements will be defeated at all costs and that every attempt to divide the nation will fail.\nHe emphasized that the state’s stance on terrorism is clear and that winning the war against terrorism is imperative.\nThe president expressed these views while chairing a high-level meeting on law and order in Quetta today. Chairman of the Pakistan People’s Party (PPP), Bilawal Bhutto Zardari, also attended the meeting.\nChief Minister of Balochistan, Mir Sarfraz Bugti gave a comprehensive briefing on the overall security situation in the province.\nThe meeting was attended by Acting Governor of Balochistan, Captain (Retd) Abdul Khaliq Achakzai, Chief Secretary of Balochistan, Shakeel Qadir Khan, Inspector General of Police, Moazzam Jah Ansari, and other senior officials.\nAddressing the meeting, President Zardari said that Balochistan was close to his heart and its development and sustainable peace remained his top priority.\nHe expressed his desire to see every child in school and stressed the need to equip the youth with modern technology.\nThe president also stated that the Counter-Terrorism Wing will be provided with advanced weaponry to effectively combat criminal elements and terrorists.\nSeparately, President Zardari met with members of parliamentary parties in Balochistan. Chairman PPP Bilawal Bhutto Zardari was also present during the meeting.\nOpposition leaders in the Balochistan Assembly and parliamentary leaders of various political parties presented their concerns and proposals regarding public welfare and the challenges facing the province.\nDuring the discussion, President Zardari  highlighted that he had a special  connection with the people of Balochistan. He emphasized that as Pakistanis, national solidarity must be upheld to take the country forward.\nHe assured that all rights would be granted to the people, stating, “We do not believe in taking away rights but in winning the hearts of the people by granting them their due.”\nHe further stated that all efforts for the welfare and prosperity of Balochistan would yield positive results, with decisions being made that would be remembered in history.\nPresident Zardari also said that he would set up a special camp in Balochistan after Eid to listen to public grievances and suggestions.\nDuring the meeting, Opposition Leader in the Balochistan Assembly, Mir Younas Aziz Zehri appreciated Chief Minister Sarfraz Bugti’s initiatives and assured complete cooperation. The meeting was also attended by Acting Governor Captain (Retd) Abdul Khaliq Achakzai and Chief Minister Mir Sarfraz Bugti.\nOther prominent participants included National Party Chief Dr. Abdul Malik Baloch, Parliamentary Leader of the Pakistan Muslim League-N, Mir Saleem Khan Khosa, Parliamentary Leader of the Awami National Party, Engineer Zamrak Khan Achakzai, and Jamaat-e-Islami member, Mir Abdul Majeed Badini. Members of the Balochistan Cabinet, provincial ministers, parliamentary secretaries, and assembly members were also present during the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:50:52.136Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-vows-to-defeat-terrorism-stresses-national-unity/",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T16:01:00.000Z"
}
