{
  "title": "Tributes pour in for Pakistani film legend Muhammad Ali on 19th death anniversary",
  "author": null,
  "content": "ISLAMABAD, Mar 19 (APP):Pakistani film legend Muhammad Ali was remembered and paid tribute by fans and media on his 19th death anniversary, celebrating his remarkable contributions to the country’s film industry and his enduring legacy as one of Pakistan’s greatest actors.\nHis family moved from Rampur to Rohtak after his birth and then to Multan shortly after the independence of Pakistan.\nMuhammad Ali joined Radio Pakistan Hyderabad as a broadcaster in 1956. He also worked at radio Pakistan Bahawalpur Karachi stations. Zulfikar Ali Bukhari‚ the then Director General Radio Pakistan became his mentor for\nMuhammad Ali used to mention him as his spiritual father, media news channels reported.\nLater he introduced Muhammad Ali to his friend poet and film producer Fazal Ahmed Kareem Fazli‚ who offered him the role of a hero for his new movie Chiragh Jalta Raha.\nBut instead of playing the role of hero Ali accepted the role of villain in the movie. He was known as Shahenshah-e-Jazbaat (The Emperor of Emotions).\nAs a highly versatile actor, he performed historical biographical and patriotic roles; in costume and art movies.\nHe acted in over 300 movies including some Punjabi films and worked with Zeba‚ Shamim Ara and other prominent actors and actresses of the time.\nHe was a versatile actor and played negative as well as character actor roles successfully. He married Zeba‚ a prominent film heroine of her time.\nAli was a cardiac patient and underwent two surgeries.  He is widely considered to be the foremost dramatic performer that the Pakistani film industry has ever had and was conferred with Pride of Performance in 1984 in recognition of his life-long services to the entertainment industry of Pakistan and subsequently became the only actor who was awarded Tamgha-e-Imtiaz.\nMohammad Ali died on March 19, 2006 due to a heart attack in Lahore.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:52:11.216Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/tributes-pour-in-for-pakistani-film-legend-muhammad-ali-on-19th-death-anniversary/",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T09:08:00.000Z"
}
