{
  "title": "FTO establishes ‘Diplomatic Grievances Redressal Cell’ to assist foreign embassies",
  "author": null,
  "content": "ISLAMABAD, Mar 19 (APP): On the directives of the Federal Tax Ombudsman of Pakistan Dr. Asif Mahmood Jah, a specialized Diplomatic Grievances Redressal Cell has been established to assist foreign embassies in Pakistan in resolving tax-related issues faced by their staff and citizens with the Federal Board of Revenue.\nTo lead this initiative, Mr. Almas Ali Jovindah has been appointed as the Head of the Diplomatic Grievances Redressal Cell, said in a Press Release issued here on Wednesday.\nWhile taxation is often viewed as a purely domestic affair, the reality of global presence and diplomatic privileges necessitates a more nuanced approach to the treatment of foreign entities and individuals within a host country’s fiscal system. The creation of this Redressal Cell is, therefore, not merely an administrative measure but a strategic response to an increasingly interconnected world where economic diplomacy plays a crucial role in fostering international relations.\nTo operationalize the aforementioned Redressal Cell and ensure widespread awareness, a specialized training session has been scheduled in April 11 in Islamabad at the FTO Headquarters, where foreign diplomats stationed in Islamabad will be briefed on the role of Federal Tax Ombudsman and methods to seek timely intervention when their citizens encounter tax related difficulties. Such issues are mostly related to Customs and Sales Tax.\nFederal Tax Ombudsman of Pakistan has already played crucial role in some important cases to protect tax rights of foreign stakeholders and has demonstrated that Pakistan’s regulatory landscape is one in which justice is accessible, grievances are heard, and solutions are delivered,  irrespective of nationality.\nMr. Almas Ali Jovindah who has been appointed Head of Diplomatic Grievances Redressal Cell is currently serving as Advisor Legal FTO and is Executive Secretary OIC Ombudsman Association and Executive Secretary Forum of Pakistan. He is also Advisor Media and Head of Overseas Pakistanis Grievances Redressal Cell.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:50:55.288Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fto-establishes-diplomatic-grievances-redressal-cell-to-assist-foreign-embassies/",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T15:38:00.000Z"
}
