{
  "title": "NA Speaker pays rich tribute to the gallantry, sacrifices of PAF on Air Force Day",
  "author": null,
  "content": "ISLAMABAD, Sep 07 (APP):National Assembly (NA) Speaker Sardar Ayaz Sadiq on Sunday paid rich tribute to the Pakistan Air Force for its valor, courage and supreme sacrifices, saluting the heroes of the 1965 Pakistan–India war who defended the nation with unwavering patriotism.\nIn his message on Pakistan Air Force Day, the Speaker said the occasion honors the unmatched dedication and resolute bravery of those who safeguarded the motherland during the 1965 war, embodying the spirit of national pride and selfless service.\nSpeaker Sardar Ayaz Sadiq highlighted the extraordinary achievements of Pakistan Air Force during the 1965 war, especially Air Commodore M.M. Alam’s legendary feat of shooting down five Indian aircraft in less than a minute—an unmatched moment in history, honored as a golden chapter worldwide.\nThe speaker remarked that Pakistan Air Force Day serves as a reminder of the gallant warriors of 1965, whose sacrifices remain an enduring source of inspiration. He specifically acknowledged the contributions of Air Marshal Noor Khan, Air Commodore M.M. Alam, and other valiant heroes who decisively defeated the enemy in the skies. He further stated that Pakistan Air Force remains ever ready to confront any aggression, standing as a formidable shield in every hour of national trial.\nPaying tribute to the current leadership of the Air Force, Speaker Sardar Ayaz Sadiq lauded the courage of Air Chief Marshal Zaheer Ahmed Babar Sidhu and his team, who, in the recent Marka-e-Haq (May 10, 2025), downed six enemy warplanes, proving once again the PAF’s unwavering commitment to the defense of the motherland.\nHe stated that this battle sent a clear message to the world—that Pakistan’s Armed Forces are fully capable of countering any hostility, and ever willing to make every sacrifice for national security.\nSpeaker expressed immense pride in the Pakistan Air Force, praising its bravery, professionalism, and dedication. He reaffirmed the resolve that the nation, standing united with its Armed Forces, will foil every conspiracy and secure a peaceful and prosperous future for the coming generations.\nHe also paid a heartfelt tribute to the families of martyrs for their resilience and sacrifice, assuring them that the entire nation stands with them. Speaker NA offered prayers for the elevation of the martyrs’ ranks and enduring peace, prosperity, and stability for the homeland.\nDeputy Speaker National Assembly, Syed Ghulam Mustafa Shah, also paid homage to the heroes of the 1965 war. He said the nation can never forget the sacrifices of its brave sons. He stated that the day is a renewal of the pledge that the entire nation stands in unity with its Armed Forces.\nHe noted that both the 1965 Pakistan-India war and Marka-e-Haq on May 10, 2025, are golden chapters in the history of the Pakistan Air Force. Deputy Speaker NA also reaffirmed the nation’s unwavering solidarity with the Pakistan Armed Forces in every testing time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:22:33.808Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-speaker-pays-rich-tribute-to-the-gallantry-sacrifices-of-paf-on-air-force-day/",
  "dateList": "2025-09-07",
  "date_published": "2025-09-07T20:21:00.000Z"
}
