{
  "title": "PML- N leadership always adopted path of escaping from country, law: Shibli",
  "link": "https://www.app.com.pk/national/pml-n-leadership-always-adopted-path-of-escaping-from-the-country-law-shibli/",
  "date_published": "2020-08-23T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 23 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said Sunday that history had shown that Pakistan Muslim League-Nawaz (PML-N) leadership always adopted the path of escaping from the country and the law.\nTagging the opposition draft for amendments in National Accountability Ordinance, in a tweet, he said these were the sources and documents through which the NRO was requested.\nHe said that for several days, the PML-N leadership had been giving the impression that they had not demanded any concessions but the draft of the amendments in NAB Ordinance given by the opposition belied the PML- N claim.\nAccording to documents shared by the minister, PML-N proposed amendments to the National Accountability Ordinance 1999 and proposed “Provided however, that NAB shall not conduct any inquiry or investigation or file any reference for an alleged offence after the passing of five years from the date of the transaction or at constituting the offence.”\nIt further proposed that after sub-section (b) a new sub-section (bb) shall be inserted as follows “National Accountability Bureau shall not initiate action on allegations contained in a complaint which is anonymous or pseudonymous or which do not involve public money or in which the amount involve is less than one billion rupees or which under the provisions of any law for the time being in force, cannot be investigated due to lapse of time or relate to a period for which records need not to be maintained by the holder of the public office.”\nIt proposed that sub-section (a) shall be omitted and for sub-section (b) the following shall be substituted, namely: “Where at any time during inquiry or after the authorization of investigation , before or after the commencement of the trial or during the pendency of an appeal, the holder of public office or any other person offers to return to the NAB the assets are gains acquired or made in the course, or as consequence of any offence under this ordinance, the chairman NAB may in his discretion after taking into considerations the facts and circumstances of the case accept the offer on such terms and conditions as he may consider necessary, and if the holder of public office or any other person agreed to return to the NAB the amount determined by the chairman NAB, who shall then refer the case for the approval of the court or the appellate court as the case may be for the release of the holder of public office or any other person as well as his co-accused.”\nIt also proposed that if the chairman refuses to accept the offer, the concerned holder of public office or other person may submit the offer directly to court for consideration and approval. Provided that where the holder of public office or any other person offers to return the assets or gains acquired or made in the course or as a consequence of any offence under this ordinance such a person but not his co-accused shall cease to.",
  "retrievedAt": "2025-08-11T19:42:20.756Z"
}
