{
  "title": "CPEC to inject new impetus to Pak-China relationship, says Chinese DCM",
  "link": "https://www.app.com.pk/national/cpec-to-inject-new-impetus-to-pak-china-relationship-says-chinese-dcm/",
  "date_published": "2024-05-18T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP): China is ready to work with Pakistan to implement the important consensus reached by leaders of the two countries, said Chinese Deputy Chief of Missions (DCM) Shi Yuangqiang at a well-attended seminar on Dynamics of Xinjiang in Pakistani Perspective hosted by Overseas Chinese Association Rawalpindi on Saturday.\nHe noted, “The keenness on Pakistan’s side to greatly enhance the ongoing commercial cooperation was welcoming as it would inject new impetus into China-Pakistan cooperation as China enters a new development phase”.\nTurning to bilateral relations, DCM Shi underscored the importance of the China-Pakistan Economic Corridor (CPEC) and praised Pakistan’s new government’s “5Es” framework, which aligns with China’s approach to high-quality development.\nHe highlighted key achievements of CPEC Phase One, including the construction of renewable energy projects and the establishment of a buffalo embryo laboratory, which have contributed significantly to Pakistan’s economic and social development.\n“Looking forward to CPEC Phase Two, we are ready to work with Pakistan to implement the important consensus reached by leaders of the two countries,” DCM said. “We aim to inject new impetus into China-Pakistan cooperation with China’s new development and promote the in-depth integration of the 5Cs with the 5Es, creating an upgraded version of the CPEC and building a closer China-Pakistan community with a shared future in the new era”, he maintained.\n“China is ready to work with friends from all walks of life in Pakistan to advocate universally beneficial and inclusive economic globalization,” DCM affirmed. “We must work together to make the ‘cake’ of economic globalization bigger and fairly share it, promoting trade and investment liberalization and facilitation for mutual benefit, win-win results, and common prosperity”, he added.\nDCM further elaborated that China’s progress in protecting the rights of all ethnic groups in Xinjiang Uygur Autonomous Region that also signals China’s increasing openness and transparency in displaying the achievements in the region, refuting rumours and lies made by the US-led campaign.\nHe noted that Xinjiang region is enjoying the best time in its history as all the local ethnic population is moving ahead with sustainable development and prosperity contributing their role in the national rejuvenation.\nHe said that there are more than 24,000 mosques located in China and the Muslim community is practicing Islam as the fundamental beliefs of their religion. The Muslims in China are enjoying the religious freedom that rejects the malicious propaganda campaigns of Western think tanks.\nDCM noted that the proactive policies to ensure employment and job security adopted by the local government of Xinjiang have effectively protected all ethnic groups’ basic labour rights, greatly improved their living and working conditions, and fully satisfied their aspirations to create a better life.\n“For years, certain international forces, guilty of ideological bias and prejudiced against China, have been applying double standards in Xinjiang, criticizing “breaches of human rights” while ignoring the tremendous efforts Xinjiang has made to protect human rights. They have fabricated facts to support their false claims of “forced labor” in Xinjiang, and smeared the local government’s work on employment and job security.\nTheir acts amount to a denial of the fact that the local people in Xinjiang enjoy the right to work, aspire to move out of poverty and backwardness and are working toward that goal. Such groundless allegation would be strongly opposed by everyone who values justice and progress”, he noted.\nThe other speakers including President Ex- -Chinese Association M . Nasir Khan, member All-China Federation of Returned Overseas Chinese M. Azeem Khan, Group Captain (Rtd) Sultan M Hali and others highlighted the importance and significance of China Pakistan Economic Corridor, Pak China relationship, religious freedom in Xinjiang and the development phases of China.\nAt the end, awards were also distributed among the speakers and the notable guests who have contributed to the development of Pak-China relationship.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:35:09.646Z"
}
