{
  "title": "Hot and humid weather to persist across Pakistan, rain expected in upper regions",
  "author": null,
  "content": "ISLAMABAD, Jul 01 (APP):The Pakistan Meteorological Department (PMD) has forecast hot and humid conditions to continue across most parts of the country on Wednesday, with chances of rain, wind, and thundershowers at isolated locations in northern and upper regions.\nIn Islamabad, residents can expect humid and partly cloudy weather, with a 35 percent probability of rain and thunderstorms in the capital and surrounding areas.\nIn Khyber Pakhtunkhwa, partly cloudy skies will dominate, while intermittent rain and thundershowers may occur in isolated areas including Dir, Swat, Kohistan, Malakand, Bajaur, Shangla, Battagram, Mansehra, Abbottabad, Haripur, Peshawar, and Kohat.\nPunjab will remain mainly hot and humid, but areas such as Murree, Galiyat, Rawalpindi, Lahore, Sialkot, Jhelum, Gujrat, and Sahiwal may receive scattered rain or thunderstorms. Similar weather conditions are expected in parts of Balochistan, particularly in Musakhel, Barkhan, Khuzdar, Zhob, Kalat, and Mastung.\nSindh continues to bake under intense heat and humidity, with no significant rainfall expected.\nMeanwhile, Kashmir is likely to see rain-wind/thundershowers, whereas Gilgit-Baltistan will remain hot and dry.\nThe rainfall over the past 24 hours was recorded in several regions, notably Rawalpindi (Shamsabad 70mm, Chaklala 55mm), Islamabad (Zero Point 80mm), and Narowal (47mm), with scattered showers across Upper Punjab, Khyber Pakhtunkhwa, Kashmir, Zhob, and Mithi.\nThe highest maximum temperatures recorded on Tuesday included Nokkundi at 46 C, Dalbandin 45 C, while Dadu, Mohenjodaro, Sibbi, and Chilas each touched 44 C, highlighting the intense summer heat gripping the country.\nThe authorities advised citizens to stay hydrated, avoid unnecessary exposure to sunlight, and take precautionary measures during expected rain spells to prevent waterlogging and urban flooding in vulnerable areas.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:08:08.165Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/hot-and-humid-weather-to-persist-across-pakistan-rain-expected-in-upper-regions/",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T17:26:00.000Z"
}
