{
  "title": "Thailand, COMSTECH forge strategic scientific partnership to boost innovation across OIC region",
  "author": null,
  "content": "ISLAMABAD, Jul 01 (APP):In a major step toward strengthening international scientific cooperation, the Ambassador of Thailand to Pakistan, Mr. Rongvudhi Virabutr, visited the OIC-COMSTECH Secretariat in Islamabad, signaling a new era of strategic partnership between Thailand and the Organisation of Islamic Cooperation’s leading science and technology institution.\nThe visit aimed at deepening collaboration in research, innovation, and capacity building across the OIC region and beyond.\nDuring the visit, both sides expressed a strong commitment to expanding joint initiatives in science, technology, and innovation. Prof. Dr. Choudhary welcomed the Thai Ambassador and emphasized Thailand’s pivotal role as an observer state of OIC and COMSTECH, saying the country’s contributions are as vital as those of member states in shaping a future driven by knowledge and discovery.\nAmbassador Virabutr reaffirmed Thailand’s dedication to building strong scientific ties with COMSTECH and praised its efforts in uniting OIC countries through science diplomacy. He endorsed several proposals aimed at fostering bilateral collaboration, including academic exchanges, research fellowships, and youth engagement programs.\nKey areas of cooperation discussed included Thailand’s participation in the COMSTECH Consortium of Excellence (CCoE), youth exchange initiatives, inclusion in the OIC Technology and Innovation Portal, and collaborative contributions to the COMSTECH Journal of Science Communication & Diplomacy. A landmark initiative proposed the establishment of a regional center for halal science research and testing in Thailand.\nIn a push toward inclusive development, COMSTECH also proposed ten annual fellowships exclusively for Thai women scientists, alongside potential cooperation on environmental sustainability, with Thai R&D institutions participating in COMSTECH’s Forum on Environment and Ecosystem Restoration.\nThe meeting concluded with a shared resolve to operationalize the agreed initiatives in a phased and structured manner, reinforcing a mutual vision for harnessing science and technology as tools for sustainable growth and regional connectivity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:08:08.166Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/thailand-comstech-forge-strategic-scientific-partnership-to-boost-innovation-across-oic-region/",
  "dateList": "2025-07-01",
  "date_published": "2025-07-01T17:01:00.000Z"
}
