{
  "article_id": "2025-10-04_e3f9feb913cf097af69fb478a5a28113",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shahbaz-sharif-welcomes-successful-talks-in-azad-kashmir/",
    "retrieved_at": "2025-10-11T23:50:19.015Z"
  },
  "metadata": {
    "title": "PM Shahbaz Sharif welcomes successful talks in Azad Kashmir",
    "author": null,
    "date_published": "2025-10-04T10:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 232,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Oct 04 (APP): The Prime Minister(PM) Shahbaz Sharif on Saturday welcomed the success of the negotiation process in Azad Kashmir and the agreement reached between the government's negotiation committee and the Joint Action Committee. Paying tribute to the members of the negotiation committee,the PM lauded their individual and collective efforts, terming the development a \"great achievement for Pakistan and Azad Jammu and Kashmir.\" He said that the restoration of peace and normalization of the situation was a positive development.\"Conspiracies and rumors have finally come to an end,and all matters have been resolved amicably,Alhamdulillah.\" The Prime Minister also thanked the members of the Joint Action Committee for their role in the successful talks and congratulated them on the restoration of peace. Reiterating the government's commitment,he said \"The government is always ready to resolve the issues of our Kashmiri brothers.Public interest and peace are our priority and we will continue to serve Azad Jammu and Kashmir.\" The PM Shahbaz Sharif urged the people of AJK to avoid paying heed to rumors and assured them that their rights would always be protected. \"We have always been the protectors of the rights of our Kashmiri brothers and sisters and will continue to safeguard their rights in the future as well,\"PM said. The Prime Minister emphasized that his government had always given special attention to the issues of AJK and resolved them on a priority basis.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}