{
  "article_id": "2025-10-04_285832ed57d06e6cf7f4e74262cf6716",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-warns-of-rain-in-islamabad-punjab-khyber-pakhtunkhwa-gilgit-baltistan/",
    "retrieved_at": "2025-10-11T23:49:49.155Z"
  },
  "metadata": {
    "title": "NDMA warns of rain in Islamabad, Punjab, Khyber Pakhtunkhwa & Gilgit-Baltistan",
    "author": null,
    "date_published": "2025-10-04T18:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 200,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 04 (APP):The National Emergencies Operation Center (NEOC) of the National Disaster Management Authority (NDMA) on Saturday warned of possible intermittent rainfall over the next 12 to 24 hours across various regions of Islamabad, Punjab, Khyber Pakhtunkhwa, and Gilgit-Baltistan. The National Emergencies Operation Center (NEOC) has warned of rainfall in the upper catchment areas of key rivers, including Jhelum, Ravi, and Sutlej. In Punjab, showers are forecast across several districts, notably Rawalpindi, Murree, Galiyat, Attock, Chakwal, Jhelum, Mianwali, Hafizabad, Sargodha, and Khushab. In Khyber Pakhtunkhwa, intermittent rainfall is expected in Chitral, Dir, Haripur, Kohat, Kohistan, Khyber, Kurram, and Mansehra. Thunderstorms with rain are also likely in Mohmand, Nowshera, Malakand, Charsadda, Abbottabad, Bannu, Buner, Hazara, Peshawar, Swabi, Waziristan, and adjoining areas. In Sindh, rainfall is likely in Karachi, Jamshoro, Thatta, Badin, Sujawal, Tharparkar, and Umerkot. In Gilgit-Baltistan and Azad Kashmir, possible rain may trigger landslides in mountainous areas. NDMA has urged the public to avoid unnecessary travel in mountainous areas due to landslide risks, stay informed via radio, TV, and the Pak NDMA Disaster Alert app, and follow local authorities' instructions. The National Emergencies Operation Center is actively coordinating with relevant departments to ensure timely updates and effective emergency response.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}