{
  "title": "Pakistan Special Olympics contingent honoured",
  "author": null,
  "content": "ISLAMABAD, Feb 27 (APP): A special ceremony was held at Bank Alfalah’s head office in honor of the Pakistan Special Olympics contingent, which will participate in the 16th World Winter Special Games 2025 in Turin, Italy.\nThe event was attended by Bank Alfalah President Atif Bajwa, Special Olympics Pakistan Chairperson Ronak Iqbal Lakhani, Special Olympics Pakistan Ambassador and renowned actress Sarwat Gilani, squad leader Farkhanda Jabeen, group leader Humeira Kazim, famous female martial artist Iman Khan, as well as national team athletes and officials, said a press release.\nIt is noteworthy that with the support of Bank Alfalah, the national contingent will participate in the games from March 8 to March 16. The team consists of 10 athletes—5 men and 5 women. The World Winter Special Games will feature over 500 athletes from 102 countries, competing in eight different sports, including alpine skiing, cross-country skiing, dance sport, figure skating, floorball, short track speed skating, snowboarding, and snowshoeing.\nSpeaking at the event, Bank Alfalah President and CEO Atif Bajwa expressed hope that the Pakistani special athletes would showcase excellent performance, win medals, and represent Pakistan as ambassadors with great sportsmanship and conduct.\nHe paid tribute to Ronak Lakhani for her 35 years of dedicated service and commended her efforts. Atif Bajwa emphasized that Bank Alfalah remains committed to providing special athletes with the best facilities and opportunities as part of its corporate social responsibility.\nSpecial Olympics Pakistan Chairperson Ronak Lakhani, in her address, expressed gratitude and highlighted the importance of enhancing the abilities of special individuals, enabling them to contribute to building a strong and stable society. She urged the people of Pakistan to pray for the success of the national team in the games.\nCurrently, Special Olympics Pakistan (SOP) has over 35,000 registered athletes, 4,000 coaches, and 6,000 volunteers. Through various programs in sports, health, education, and community development, SOP is positively impacting the lives of individuals with special needs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:14:36.672Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-special-olympics-contingent-honoured/",
  "dateList": "2025-02-28",
  "date_published": "2025-02-27T19:00:00.000Z"
}
