{
  "title": "Pakistan to send first astronaut to space station soon: PM",
  "author": null,
  "content": "ISLAMABAD, Feb 28 (APP): Prime Minister Shehbaz Sharif on Friday said that Pakistan, in collaboration with China, will send its first space manned mission to China’s space station.\nAddressing a ceremony after witnessing the exchange of a cooperation agreement between Pakistan’s Space and Upper Atmosphere Research Commission (SUPPARCO) and China Manned Space Agency, the prime minister said that this was yet another wonderful gesture from Chinese government to further deepen bilateral cooperation in this field.\nHe emphasized that under the dynamic leadership of Chinese President Xi Jinping, not only the space programme was progressing speedily but also mega projects in other sectors were built in Pakistan under China Pakistan Economic Corridor (CPEC) which had really transformed the country’s landscape.\nHe highlighted that Pakistan’s participation in the China Space Station program reflects the deep-rooted ties between the two countries and will contribute to mutual knowledge-sharing and the broader vision of peaceful space exploration for the benefit of humanity.\nUnder the agreement, two Pakistani astronauts will undergo training at the Astronaut Center of China. One selected astronaut shall be trained as a scientific payload specialist, preparing for specialized research aboard the China Space Station (CSS). The astronaut selection process will be completed by 2026, with the aim of flying in an upcoming mission as per CSS planning.\nThe first national astronaut’s mission at CSS will involve conducting cutting-edge scientific experiments in various fields, including biological and medical sciences, aerospace, applied physics, fluid mechanics, space radiation, ecology, material sciences, microgravity studies, and astronomy.\nMinister for Planning and Development Ahsan Iqbal termed the agreement a historic milestone, underscoring its role in accelerating technological innovation, capacity building, and research. He stated that the collaboration with China extends beyond astronaut training, laying the groundwork for Pakistan’s long-term growth in human spaceflight and exploration.\nDirector General of China Manned Space Agency (CMSA), Dr Lin Xinqiang expressed his enthusiasm for this partnership, reaffirming China’s dedication to strengthening international cooperation in space exploration.\nChairman SUPPARCO Mohammad Yousaf Khan regarded the agreement as a landmark in Pakistan’s space journey, emphasizing perseverance, adaptability, and technological progress.\nHe invited youth, professionals, and academia to actively participate in Pakistan’s astronaut program, encouraging them to contribute to the nation’s space exploration efforts through research, innovation, and skill development.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:13:43.085Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-send-first-astronaut-to-space-station-soon-pm/",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T11:46:00.000Z"
}
