{
  "article_id": "2025-07-26_9e0b2279d3e2eefa2d0860ac66c2293b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/daily-online-shopping-trends-to-boost-countrys-digital-economy/",
    "retrieved_at": "2025-08-27T10:09:58.522Z"
  },
  "metadata": {
    "title": "Daily online shopping trends to boost country’s digital economy",
    "author": null,
    "date_published": "2025-07-26T10:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 537,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 26 (APP):An e-commerce expert revealed on Wednesday that daily online shopping in Pakistan has skyrocketed by 500 percent, a surge driven largely by the shift in consumer behaviour following the COVID-19 pandemic. In an interview with a private news channel, e-commerce expert Tanveer Tanoli highlighted the growing trend of online shopping in Pakistan. He stated that, in 2024, the country saw $7.7 billion in online transactions, with projections suggesting this figure will rise to $10.1 billion in 2025. This surge, he noted, is largely driven by the increasing global popularity of e-commerce. He said that in Pakistan, there are 14 crores of internet users, and now due to social media outlets' awareness, there is easier access to online shopping apps such as TikTok, Facebook, Instagram and YouTube, etc., etc. He explained that, in the past, online shopping was largely seen as a trend among the privileged or wealthier segments of society. However, with increasing awareness, it has now become popular among the youth, particularly women, who can conveniently shop from home with ease. He mentioned that starting an online shopping business requires only a modest budget, making it accessible to many. He added that this trend is especially popular among young people, who don't need a large financial investment to get started. Replying to a question relating to what kind of items people do prefer to purchase online, he said that they do prefer to purchase dresses, eatables, shoes, electronic appliances, homemade furniture, electronics gadgets, fashion, luxury items and beauty products, etc., besides, due to online shopping and its quality items, the customers' confidence is increasing day by day, he added. Replying about the Cash on Delivery (COD) method and safety measures to save from online fraud, he said that the Pakistan e-commerce industry is also facing certain challenges, such as payment adaptability issues. He said due to frauds in financial payments, people used to prefer the option \"Cash on delivery\" for some quality products reasons adding that he said nearly 90 per cent of transactions had been done with \"Cash on delivery\" and there had been very little adaptability in people to this online payments option. He recommended that the government should take certain measures and make relevant policies to ensure online payments are more secure, and thus, opting for online transaction options such as Jazzcash, easypaisa, and other banking apps to make payments instantly and securely. Last but not least, he said there is a need to enhance the confidence of the public by creating more awareness campaigns in this regard. He said that due to competition, people need to confirm the quality of the item, and their confidence needs to be enhanced further by sending them the original and new items, adding that this way, there will be documentation also. He advised people should do and prefer online shopping for their necessities, but at the same time, they should not just consume things at home and avoid over-consumption of such shopping at home. He mentioned an Asian Development Bank (ADB) report estimates that in 2024, Pakistanis had spent nearly 10.4 million dollars on online shopping across the country, and the trend is rapidly increasing day by day compared to the previous year.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}