{
  "title": "NDMA issues guidelines for DRM measures during Summer season",
  "link": "https://www.app.com.pk/national/ndma-issues-guidelines-for-drm-measures-during-summer-season/",
  "date_published": "2023-03-14T09:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): The National Disaster Management Authority (NDMA) has issued detailed guidelines for the departments concerned to ensure timely measures for disaster risk management (DRM) during the upcoming summer season.\nThe Authority in its guidelines mentioned that with the onset of the summer season; heatwaves, forest fires and glacial lake outburst flood (GLOF) events could be expected across the country in respective hazard-prone areas.\nIt noted that based on the vulnerability of different regions, the impacts could vary, hence requiring requisite preparations by respective disaster management authorities, rescue agencies, line departments and local administrations.\nThe NDMA guidelines underscored the need for proactive measures from all provincial disaster management authorities (PDMAs), state disaster management authority (SDMA-AJK), Gilgit Baltistan Disaster Management Authority (GBDMA), Islamabad Capital Territory (ICT) administration, health departments, line departments, rescue agencies, responders, urban search and rescue (USAR) teams, Armed Forces and federal departments and ministries to undertake dynamic measures to ensure timely preparations and response against likely hazards.\nFor Heatwave, the guidelines stated that PDMAs in collaboration with district disaster management authorities (DDMAs) and local administration would carry out extensive awareness campaigns for sensitizing the public to likely dangers\nassociated with heatwave-like conditions and associated preventive measures.\nMoreover, the ministries, departments and local administration should undertake the required measures for protecting children from exposure to heatwave conditions in education institutes. Identification of high-risk areas and establishment of heatstroke treatment centres with required doctors and paramedic staff and water.\nIt also advised the Ministry of National Health Services, Regulations and Coordination (MoNHSR&C) to issue necessary instructions to all concerned for enhancing departmental and hospital capacities to manage heatwave conditions.\nFor individual measures, the NDMA guidelines advised the masses to remain hydrated; drink sufficient quantity of water, keep a drinking water bottle for regular intake, stay cool; avoid exposure to direct sunlight and crowded spaces, remain informed; keep track of local weather conditions to avoid exposure to extreme conditions and in case of any signs of illness consult a qualified physician to seek expert medical advice.\nIt also exhorted to plan work, exercise and outdoor activities; manage work timeline according to weather conditions and avoid unnecessary exposure to heatwave-like conditions, special attention and care to the elderly and people with underlying health conditions must be ensured.\nThe guidelines also underscored the need for vehicular fitness as vehicles and humans both can be adversely affected due to heatwave-like conditions, ensure that moves and travels were planned to avoid unnecessary exposure to heat and sun.\nFor Forest and Urban Fires, it is advised to carry out immediate risk and vulnerability assessment of respective regions to identify fire-prone sites and areas. The NDMA guidelines also demanded expediting the work of preparation and mitigation measures in forests namely the creation of fire lines and lanes, ditches, clearance of dry foliage, and dry grass, planning and executing controlled fires. All measures in line with standard operating procedures (SOPs) of the forest department must be ensured.\nIt also underscored the need for fire drills, the fitness of equipment, readiness of water supply and replenishment points, checking and refilling of fire extinguishers, and local communities’ engagement at fire-prone sites to enable round-the-clock monitoring and feedback mechanism for early warnings and alerts for at-risk population and assets, (areas in the vicinity of forests and high-rise buildings/ storage facilities/ warehouses etc).\nThe NDMA in its guidelines also advised holding forest and urban fire mock exercises for both departmental preparedness and combined exercises with all stakeholders for the readiness of men and machinery and equipment.\nFor the GLOF events, it mentioned carrying out immediate risk and vulnerability assessment of respective regions to identify possible GLOF sites and areas in addition to already identified locations.\nIt also noted to ensure a clock monitoring mechanism, and arrangements through all possible means and resources, especially involving the local communities for immediate dissemination of early warnings.\nMoreover, a mass awareness campaign for the general public on GLOFs in at-risk areas covering key steps like avoiding unnecessary movement in such areas, especially across nullahs, streams and rivers, high risk associated with the exponential rise of flow or discharge, which can result in washing away of houses, infrastructure, vehicles, humans and livestock, alerting general masses living in low-lying areas to exercise extra caution including community-based alert system, evacuation plan of at-risk community and conduct of evacuation drills.\nThe law enforcement agencies (LEAs) and Traffic Police should advise travellers regarding likely situations, dangers and safety measures, it added.",
  "retrievedAt": "2025-08-11T06:22:14.984Z"
}
