{
  "title": "Senate body seeks illegal construction details on government accommodation",
  "link": "https://www.app.com.pk/national/senate-body-seeks-illegal-construction-details-on-government-accommodation/",
  "date_published": "2023-03-14T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): The Senate Standing Committee on Housing and Works Tuesday sought details of illegal construction on government allotted accommodation and directed strict action against the encroachers.\nThe committee met here with Senator Haji Hidayatullah in the chair.\nReviewing the matter regarding progress on tendering process to restart construction work related to Kashmir Avenue Apartments Sector G-13, permission to transfer Kashmir Avenue Apartments, the committee was informed that the transfer of Kashmir Avenue (G-13) apartment project had been opened subject to clearance of all outstanding installments payable at the time of transfer of apartments as per payment schedule which is not less than 23 percent of the total cost of the apartment.\nThe committee stressed the need for timely possession of the apartments.\nWhile discussing the retendering process, the committee was of the view that transparency must be ensured and that all out efforts must be made to ensure that there was no usurpation of rights of the contractor due to the termination of the previous contract.\nThe committee probed details to the reasons for terminating the contract before starting the arbitration process.\nDetails of reasons for the termination must be submitted to the committee in the next meeting.\nReviewing the matter of restarting the Residency Housing Project, Peshawar by PHAF, the committee was informed that the main issue that was hindering the project was regarding the possession that had now been settled with the assistance of Commissioner Peshawar.\nIt was recommended that the committee visit the site of the project and meet the Chief Secretary to play a role in expediting the progress of this project.\nThe committee was attended by Senator Falak Naz, Senator Fida Muhammad, Senator Bahramand Khan Tangi, Senator Molana Abdul Ghafoor Haideri and senior officers of the Ministry of Housing and Works along with its attached departments and agencies.",
  "retrievedAt": "2025-08-11T06:22:10.647Z"
}
