{
  "title": "Siddiqui calls for economic analysis to fix responsibility",
  "link": "https://www.app.com.pk/national/siddiqui-calls-for-economic-analysis-to-fix-responsibility/",
  "date_published": "2023-03-14T10:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Senate Standing Committee on Education and Professional Training, National Heritage and Culture Chairman Irfan Ul Haq Siddiqui has called for a thorough analysis of the country’s economic history to determine who was responsible for its current economic woes.\nTalking to a TV channel Senator Irfan-Ul-Haque Siddiqui pointed out that the International Monitory Fund (IMF) program was completed during the era of former Prime Minister Nawaz Sharif in 2017.\nIn 2017, the country’s economy was thriving. Inflation was less than three percent which was touching 35 percent. People were satisfied.\nAs Pakistan continues to grapple with economic challenges, experts are hoping to pinpoint the root causes of the country’s economic deterioration.\nHe also questioned the transparency of former Prime Minister Imran Khan regarding his Toshakhana gifts, stating that legal experts agree that selling the received gifts is illegal and unethical.\nResponding to a question, he said former Prime Minister Nawaz Sharif is set to return to the country soon, although no date has been decided yet.\nHe said the country was destroyed to get rid of one person (Nawaz). Right now India has foreign reserves of $500 billion and Pakistan’s foreign reserves were grappling on mere $ one billion.\nOne has to answer why country’s economy took a persistent downward slide after ousting of Nawaz Sharif from power.\nHe said the people should decide why the country’s once-promising economy has taken a turn for the worse. By comparing the state of the economy pre-2017, experts aim to uncover the root causes of Pakistan’s current economic woes and shed light on the responsible party.\nAs Pakistan continues to grapple with economic challenges, experts must analyze the history of last seven years to determine who is responsible for the country’s current economic turmoil.\nHe said legal experts have deemed the selling of gifts received from Toshakhana as both unethical and illegal. However, the retention of such gifts can be done by moving an application stating the desire to retain the gift received.\nHe said Politicians have been known to receive gifts by paying the price and declaring them in their assets. However, there have been concerns over when Prime Minister Imran Khan retained the gifts he received and when he paid for them. Khan has not declared the gifts he received in his assets and liabilities declaration for two years, which is a legal obligation. It is also mandatory for Khan to declare the amount he received by selling the gifts.\nTo address this issue, it has been suggested that the laws in other countries be examined, and the Council of Islamic Ideology should be consulted for their expert opinion.\nThe gifts received by state functionaries are considered part of the country’s Bait-ul-Mal, which makes it a matter of public concern.\nThe retention and selling of gifts received from Toshakhana continue to be a topic of debate and discussion, highlighting the need for clarity and transparency in the declaration of assets and liabilities by state functionaries.",
  "retrievedAt": "2025-08-11T06:22:14.598Z"
}
