{
  "title": "President rejects speculations about any delay in elections",
  "link": "https://www.app.com.pk/national/president-rejects-speculations-about-any-delay-in-elections/",
  "date_published": "2023-03-14T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): President Dr Arif Alvi on Tuesday, rejecting the speculations about any delay in elections, said he strongly believed that the polls would be held on time.\nThe president, talking to a delegation of the Council of Pakistan Newspapers Editors (CPNE) led by its President Kazam Khan, here at the Aiwan-e-Sadr, said the timely elections would pave the way for improving the political and economic situation of the country.\nHe emphasised the need for upholding the Constitution as the country’s history had proven that the delay in elections had harmed democracy.\nReferring to his meeting with Khyber Pakhtunkhwa Governor Haji Ghulam Ali earlier in the day, the president said the KP governor was a democratic person and he had encouraged him to fix a date for elections in accordance with the Constitution and the order of the Supreme Court of Pakistan.\nHe said he had been playing his constitutional role and his decisions had also been affirmed by the apex court.\nPresident Alvi said he had been playing his role to reduce differences and promote reconciliation among the political parties. He was willing to meet any person or political party for the sake of the country, he added.\nThe president remarked that he had also asked the Pakistan Tehreek-e-Insaf leadership to negotiate with other political parties.\nHe also mentioned that he had good working relations with the government.\nTalking about the prevailing economic situation of the country, President Alvi said he was of the firm opinion that Pakistan would not default as better and effective financial management could help overcome the economic difficulties.\nHe said he was against corruption as it had badly damaged and that was why he returned the National Accountability Bureau Amendment Bill to the parliament.\nHe regretted that delayed decision-making, violation of merit, nepotism, and corruption had caused immense damage to Pakistan.\nHe urged the media to educate the people by providing truthful and responsible analyses and opinions.\nHe stated that despite the rise of new media, print media was still playing a vital role in shaping people’s opinions and informing them about important issues.\nThe president emphasised the need for upholding the freedom of speech in Pakistan.",
  "retrievedAt": "2025-08-11T06:22:13.111Z"
}
