{
  "title": "Coordination among institutions necessary for protection against natural disasters: Sherry Rehman",
  "link": "https://www.app.com.pk/national/coordination-among-institutions-necessary-for-protection-against-natural-disasters-sherry-rehman/",
  "date_published": "2023-03-14T08:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):Federal Minister for Climate Change, Senator Sherry Rehman on Tuesday said coordination among institutions involved in disaster management was necessary for protection against natural calamities.\nAddressing the opening ceremony of the National Disaster Management Authority (NDMA) simulation exercise to ensure the preparedness of the departments concerned to cope with impending disaster risks in the coming summer season, the Minister said the NDMA, PDMA along with other organisations worked together in the rescue and rehabilitation of the disaster affected.\nThe Minister for Climate Change along with Chairman NDMA Lt. General Inam Haider Malik and Country Head WFP Chris attended the inaugural session of 3-day long exercises and delivered opening remarks.\nIn an effort to ensure the preparedness of Federal and Provincial departments for emergencies, NDMA has initiated a series of simulation exercises (Sim Ex) to assess the effectiveness of emergency response strategies and evaluate readiness in the event of a disaster.\nIn this regard, NDMA conducted the first Sim Ex for floods and rain emergencies with the support of the Ministry of Climate Change, UNICEF and Welt Hunger Hilfe (WHH) from March 14-16 in Islamabad.\nSenator Rehman said there was a need to increase cooperation between various institutions to deal with disasters in the future. She added the first task after a natural disaster was to restore basic infrastructure whereas no country could bear the loss of natural calamities on its own.\nDuring the natural calamities, she said the friendly countries were the first to reach out for help. “Pakistan suffered massive losses due to floods. However, affected by glacier melt and heatwave, the spring season is almost over,” Sherry Rehman added.\nThe Minister underlined that climate change was a big threat to human lives, adding, “Problems can be solved easily with mutual cooperation of institutions.”\nMinister Sherry Rehman called for a ‘whole of Pakistan’ approach leading to sustainable development for people and recovery in the aftermath of Floods 2022. She lauded the efforts by the NDMA’s relief operations during Floods 2022 and other emergencies. She emphasized on the importance of collaboration across government agencies, humanitarian organizations, civil society and the private sector for disaster mitigation and building a well-prepared Pakistan.\nThe Chairman NDMA highlighted that the simulation exercises are part of NDMA’s Remodelled National Preparedness and Response System in Pakistan which will be replicated at the Provincial & District level. He said that the success of these simulation exercises underscores the importance of being vigilant and prepared for emergencies and that we can improve our overall resilience and ability to cope with natural disasters through proactive measures.\nThe simulation exercises involved various scenarios, such as flash flooding and landslides caused by heavy rainfall based on Floods 2022. Emergency responders, including NDMA, PDMAs, Armed Forces, PMD, FFC, Rescue 1122, UN organizations, NGOs and representatives of other coordinating Federal and Provincial departments participated in the scenario-based drills. These exercises will allow participants to practice their response skills, communication protocols, and decision-making processes in a realistic and safe environment.",
  "retrievedAt": "2025-08-11T06:22:21.775Z"
}
