{
  "title": "DPM Dar laments world’s double standards at humanitarian crises in Gaza; genocide",
  "link": "https://www.app.com.pk/national/dpm-dar-laments-worlds-double-standards-at-humanitarian-crises-in-gaza-genocide/",
  "date_published": "2024-10-29T17:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Tuesday expressed concerns at the world’s double standards towards the unfolding humanitarian crises, engulfing the people of Gaza, Beirut and the unabated Israeli genocidal steps.\nAddressing a ceremony held here in connection with celebration of 101st Republic Day of Turkiye, he termed the situation in Gaza as a grave injustice being witnessed in the modern history.\nHe stressed that it was crucial for the international community to take urgent steps to stop the Israeli genocidal campaigns in the occupied Palestinian territory as well as its increasing prevocational steps across borders.\nDeputy Prime Minister/Foreign Minister Dar also reiterated Pakistan’s shared stance with Turkiye over the situation in Gaza, Beirut and the condemnation of terrorist steps of Israel.\nHe said that Pakistan and Turkiye always supported Palestinians in their inalienable right to freedom by advocating the creation of a viable, contiguous and independent state of Palestine based upon pre- 1967 borders with Al-Quds Al-Shareef as its capital.\nHe also highlighted that the world today, faced challenges like global security threats, climate change, rising Islamophobia and the social economic struggle, which required unity and collective efforts to meet these challenges.\nPakistan and Turkiye shared identical views on all these issues, he added.\nAbout Pakistan-Turkiye bilateral ties, he said that Pakistan valued its bilateral relations with the brotherly country.\nHe said both countries were supporting each other on all global fora and beyond OIC.\nDar said “Pakistan stands firmly in solidarity with Turkiye, in the wake of terrorist attack in Ankara and reaffirmed unwavering support to its efforts to combating the scourge of terrorism”.\nHe said that journey of Republic of Turkiye was remarkable and it was an inspiration for all. The close affinities between the two brotherly nations resonated powerfully at all levels.\n“Turkiye stood as ally in times of difficulties and needs; devastating earthquake and floods, it always extends helping hands,” he observed. During Covid-19 and its unwavering support at the global fora, spoke volume of the strength of their bonds, he added.\nThe deputy prime minister/foreign minister also referred to Turkiye’s support to Pakistan to become a non permanent member of the UNSC for the two-year term.\nHe opined that the fraternal ties between the two countries continued to grow to new heights with passage of time, adding Pakistan always supported Turkiye on all its core issues, including the fight against terrorism while the latter unequivocally and unwavering extended its firm support and raised voice for the people of IIOJK on numerous global fora.\nDue to their joint efforts in the earlier months of this year, OIC secretary general appointed a permanent envoy on Islamophobia.\nDPM Dar also extended his warmest wishes to the brotherly people of Turkiye and its leadership on the observance of momentous day and prayed for their progress and prosperity.",
  "retrievedAt": "2025-08-10T20:28:17.879Z"
}
