{
  "title": "NUML celebrates 101st anniversary of Turkish Republic Day",
  "link": "https://www.app.com.pk/national/numl-celebrates-101st-anniversary-of-turkish-republic-day/",
  "date_published": "2024-10-29T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): The Turkish Language Department at the National University of Modern Languages (NUML) on Tuesday hosted an event to celebrate the 101st Anniversary of Turkish Republic Day, honouring Turkiye’s rich history and its enduring friendship with Pakistan.\nThe ceremony was graced by Dr. Mehmet Toyran, Education Counselor at the Turkish Embassy, as the esteemed guest of honor. Heads of Departments and faculty members from across the university also attended, contributing to the lively and enthusiastic atmosphere of the event.\nIn his address, Dr. Mehmet Toyran highlighted Turkiye’s proud history and the visionary leadership of Mustafa Kemal Atatürk, who led the country’s freedom struggle and established the independent Turkish Republic.\nDr. Mehmet spoke passionately about the unique, lasting friendship between Turkiye and Pakistan, rooted in shared values, heritage, and culture.\nHe expressed heartfelt gratitude for the support of Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal for Turkiye’s independence, adding that both nations would continue to support each other across all spheres.\nThe head of the Turkish Language Department, Nur Yasemin Rahojoo, and the Head of the Department of Azerbaijan also shared their reflections on the significance of the Turkish Republic Day and the strong ties between the two brotherly countries. They emphasized the celebration as a powerful reminder of the deep-rooted friendship and mutual respect between Pakistan and Turkiye.\nThe highlight of the event was the heartfelt performances by students from the Turkish Department, who showcased their talents through poetry recitations and a theatrical presentation honoring the sacrifices made for Turkiye’s victory. Their moving performances captivated the audience, earning enthusiastic applause.\nThe event concluded with a cake-cutting ceremony, symbolizing the unity and shared spirit between the people of Pakistan and Turkiye. The celebration was an unforgettable tribute to the enduring relationship between these two brotherly nations.",
  "retrievedAt": "2025-08-10T20:28:42.914Z"
}
