{
  "title": "PM appreciates KSA’s support for economic revival",
  "link": "https://www.app.com.pk/global/pm-appreciates-ksas-support-for-economic-revival/",
  "date_published": "2024-10-29T16:07:00.000Z",
  "source": "APP",
  "content": "RIYADH, Oct 29 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday highlighting the importance of deep-rooted brotherly relations between Pakistan and the Kingdom of Saudi Arabia, appreciated Kingdom’s support for the economic revival and stability.\nThe prime minister met with Crown Prince and the Prime Minister of the Kingdom of Saudi Arabia Prince Mohammed bin Salman Al-Saud on the sidelines of the eighth session of the Future Investment Initiative (FII) in Riyadh, PM Office Media Wing said in a press release.\nThe two leaders took stock of the ongoing bilateral engagements, especially in follow up to the decisions taken in previous high-level meetings held in Makkah and Riyadh in April.\nApprising the crown prince on the government of Pakistan’s economic, institutional and policy reforms agenda, the prime minster said that the Kingdom had a central role in Pakistan’ future economic plans.\nThe prime minister appreciated Kingdom’s efforts to promote regional peace and stability in the Middle East and reiterated Pakistan’s unwavering commitment to standby the Kingdom in these efforts.\nThe two leaders exchanged views on regional developments and agreed to closely coordinate positions on regional issues.\nThe prime minister conveyed best wishes for the health and wellbeing of the Custodian of the Two Holy Mosques King Salman bin Abdulaziz Al-Saud.\nSeparately, on X handle, the prime minister posted that he had the honour of meeting Mohammed Bin Salman, the Crown Prince of Saudi Arabia along with his delegation.\n“Thanked him for his gracious hospitality. Pakistan’s ties with Saudi Arabia are historical and time-tested. During our very productive talks we reviewed the progress in Pakistan-KSA relations across multiple sectors and reaffirmed our commitment to strengthening bilateral ties, particularly in areas such as trade and investment , culture, innovation, technology, and beyond,” he further posted.\nLater, the prime minister also attended a dinner reception hosted by Saudi Crown Prince Mohammed bin Salman.\nAt the reception, the two leaders discussed matters of mutual interest, including promoting the bilateral relationship between Pakistan and Saudi Arabia.",
  "retrievedAt": "2025-08-10T20:28:01.738Z"
}
