{
  "title": "Seminar held on empowering women through land rights",
  "link": "https://www.app.com.pk/national/seminar-held-on-empowering-women-through-land-rights/",
  "date_published": "2024-10-29T14:34:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Oct 29 (APP): A national seminar on “Empowering Women Through Land Rights: Advancing SDGs in Pakistan” was held on Tuesday under HEC’s funded project “Women’s Land Rights in Pakistan: Laws, Policy and Practices,”.\nThe seminar was organized by Dr. Mazhar Abbas, the Principal Investigator of HEC’ programme at Government College University Faisalabad, said a press release.\nAddressing the seminar, Dr. Asia Saif Alvi Chairperson Political Science at University of Sargodha determined the interrelationship among women’s rights to land and property, their economic independence and the Sustainable Development Goals.\nShe also emphasized that without ensuring women’s rights to land and property, their economic independence is not possible; and without ensuring their economic independence, achieving the fifth SDG (Women Empowerment and Gender Equality) will remain just a dream.\nShe further said that mere giving of land and property rights to women will not empower them, but for this, finance, credits and skill development programs are very important elements.\nDr. Muhammad Abrar Zahoor Chairman, Department of History and Pakistan Studies, University of Sargodha emphasized that depriving women of their rights to land and property in our society and erecting obstacles in their development and independence are definitely indications towards denying their existence.\nDr. Mazhar Abbas said that unfortunately, in Pakistan, land is a symbol of power and dignity. Due to which men refuse to give share of land and property to women.\nIn other words, until men get rid of their ego and are mentally ready to give women their due share of land and property, attainment of women’s development, prosperity and independence (i.e. the fifth SDG) will not be possible, he added.",
  "retrievedAt": "2025-08-10T20:28:05.939Z"
}
