{
  "article_id": "2025-01-09_6413a52485844b26535f992745f477a0",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884113/myanmar-junta-air-strike-kills-40-ethnic-group-rescue-worker",
    "retrieved_at": "2025-08-26T07:33:32.308Z"
  },
  "metadata": {
    "title": "Myanmar junta air strike kills 40: ethnic group, rescue worker - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T13:29:50.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/091827196e1c5cb.jpg",
    "categories": [],
    "word_count": 440,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "An air strike launched by the Myanmar junta killed at least 40 people in a village in western Rakhine state, a rescue worker and ethnic minority armed group told AFP on Thursday. The Arakan Army (AA) is engaged in a fierce fight with the military for control of Rakhine, where it has seized swathes of territory in the past year, all but cutting off the capital Sittwe. The Rakhine conflict is one element of the bloody chaos that has engulfed Myanmar since the military ousted Aung San Suu Kyi's civilian government in a 2021 coup, sparking a widespread armed uprising. AA spokesperson Khaing Thu Kha told AFP that a military jet bombed Kyauk Ni Maw, on Ramree island, around 1:20pm on Wednesday, starting a fire which engulfed more than 500 houses. \"According to initial reports, 40 innocent civilians were killed and 20 were wounded,\" he said. A member of a local rescue group whose team was helping people in the area told AFP that 41 people were killed and 52 wounded. \"At the moment, we don't even have enough betadine and methylated spirit to treat them as the transportation is hard,\" the rescue worker said on condition of anonymity to protect their safety. Photos of the aftermath of the bombing showed dazed residents walking through charred, smoking ruins, the ground littered with corrugated metal, trees stripped bare of leaves and buildings reduced to a few scraps of walls. AFP has attempted to contact the junta for comment on the incident, but calls have not been answered. Ramree island is home to a planned China-backed deep sea port that when completed will serve as a gateway for Beijing to the Indian Ocean, though construction has been stalled by the unrest. The military is struggling to fight opposition to its rule on multiple fronts around the country and it has been regularly accused of using air and artillery strikes to hit civilian communities. As well as youth-led \"People's Defence Forces\" that emerged to oppose the coup, the military is also battling numerous long-established and well-armed ethnic minority armed groups, including the AA, which control large areas of territory along the country's borders. In November, the UN Development Programme warned that Rakhine was heading towards famine as fighting squeezed commerce and agricultural production. The United Nations last week said that more than 3.5 million people have been displaced by the conflict in Myanmar - an increase of 1.5m from last year. The outlook for the coming year was \"grim\", the UN humanitarian agency OCHA said, with 19.9m people - more than a third of the population - likely to need aid in 2025.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}