{
  "article_id": "2025-01-09_85729a4b2d3e9c280b815580b78ee633",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884128/jimmy-carter-unites-us-as-presidents-attend-state-funeral",
    "retrieved_at": "2025-08-26T07:33:30.321Z"
  },
  "metadata": {
    "title": "Jimmy Carter unites US as presidents attend state funeral - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T17:20:01.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/09223834f1300f4.jpg",
    "categories": [],
    "word_count": 687,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Jimmy Carter brought a brief moment of national unity to a divided America Thursday as five US presidents gathered for the solemn state funeral of the 39th commander-in-chief in Washington's National Cathedral. In historic scenes just 11 days before the inauguration of Donald Trump for what promises to be a turbulent second term, the incoming president and outgoing President Joe Biden set aside their bitter rivalry to mourn Carter together. Former presidents Barack Obama, George W Bush and Bill Clinton also sat with them for the sombre ceremony to honour Carter, who died on December 29 at the age of 100 in his home state of Georgia. Democrat Carter was widely perceived as naive and weak during his single term from 1977 to 1981, but a more nuanced view emerged as the years passed, focusing on his decency and foreign policy achievements. Carter's flag-draped coffin was transported from the US Capitol, where it had been lying in state, and brought into the immense cathedral by an honour guard of service members in ceremonial uniforms. His grandson Joshua Carter gave the first homily to the last president of the \"Greatest Generation.\" President Joe Biden will deliver the eulogy for his fellow Democrat at the neo-Gothic cathedral, a traditional venue for send-offs of US presidents, from Dwight Eisenhower and Ronald Reagan to George HW Bush. Biden, who leaves the White House on January 20 after his own single term in office, has said that Carter asked him to do so when the pair - long-standing friends - met for the last time four years ago. \"Carter was a decent man. I think Carter looked at the world not from here but from here, where everybody else lives,\" Biden said as he gestured from above his head towards his heart. The funeral comes just days before another moment of profound change for the United States, with the return of Trump to the Oval Office. Obama shook hands and chatted with the billionaire Republican. There was also a brief moment of reconciliation for Trump and his former vice president Mike Pence, as they met and shook hands for what is believed to be the first time since the 2021 US Capitol riots when Pence refused to back Trump's false claims to have won the 2020 election. The five presidents joined around 3,000 mourners at the service, and Thursday has been designated a national day of mourning, with federal offices closed. Carter, who served a single term before a crushing election loss to Reagan in 1980, suffered in the dog-eat-dog world of Washington politics and a hostage crisis involving Americans held in Tehran after Iran's Islamic revolution finally sealed his fate. But history has led to a reassessment, focusing on his brokering of a peace deal between Israel and Egypt. He also received high praise for his post-presidential humanitarian efforts and a Nobel Peace Prize in 2002. The first president to reach triple digits, he had been in hospice care since February 2023 in his hometown of Plains, Georgia, where he died and will be buried next to his late wife, former first lady Rosalynn Carter. Mourners began paying their respects on Saturday, as the carefully choreographed six-day farewell got underway with US flags flying at half-staff around the country. A black hearse bearing Carter's remains paused at his boyhood family peanut farm in Plains, where a bell was rung 39 times and staff stood in silent tribute. Crowds gathered along the roadside to say their goodbyes, snap photographs or salute as the motorcade rolled slowly past. Carter's casket arrived at Washington's snow-covered US Capitol on Tuesday atop a gun carriage. It was accompanied by hundreds of service members, with military pallbearers carrying Carter to the Rotunda to lie in state ahead of Thursday's ceremony - the first presidential funeral since Bush Senior died in 2018. Chuck Schumer, the leader of the Democrats in the Senate, described Carter as \"one of the most decent and humble public servants we have ever seen.\" \"President Carter was a living embodiment of leadership through service, compassion, and a thirst for justice for all,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}