{
  "article_id": "2025-01-09_9da27abeac05d22aaa1ffe60fbe30533",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883967/stakeholders-asked-to-submit-budget-proposals",
    "retrieved_at": "2025-08-26T07:34:05.121Z"
  },
  "metadata": {
    "title": "Stakeholders asked to submit budget proposals - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T01:29:27.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: The Federal Board of Revenue (FBR) has begun inviting tax proposals from all stakeholders to enhance the formulation process and reduce backend procedural burdens for Budget 2025-26. The FBR has set Jan 31 as the deadline for receiving budget proposals, advancing its plan to engage all stakeholders in the budget process. In another letter, the commerce ministry has requested tariff-related proposals for the upcoming budget. The deadline for submission is Feb 15 to ensure suggestions are considered during the preparation of the next federal budget. In a letter released on Wednesday, the FBR announced the initiation of proposal development for the Finance Bill 2025. As part of this effort, the FBR has called for input from all stakeholders to refine tax policies for 2025-26. The FBR has outlined specific policy areas - income tax, sales tax, and federal excise duty - for which it seeks stakeholder proposals. According to the FBR, the proposals should confine to broadening the tax base to encourage wider participation in revenue generation and offer suggestions for integrating the entire value chain of all businesses into the general sales tax (GST) regime. Additionally, the proposals should promote progressive taxation by introducing measures that impose higher taxes on affluent classes. Stakeholders are also encouraged to provide their thoughts on phasing out tax concessions and exemptions under all tax laws. The FBR emphasised that tax proposals should facilitate taxpayers and simplify the business process by removing redundancies and streamlining tax laws. Moreover, proposals should focus on reducing tax arbitrage opportunities and enhancing economic efficiency by adhering to the principle of neutrality in taxation. Stakeholders have been asked to address eliminating tax distortions, procedural lapses, and anomalies. It was noted that the identified areas for tax proposals are illustrative and not exhaustive. Proposals are expected to be clear, meaningful, and implementable through additions, deletions, or amendments to existing tax laws. Regarding the submission of the tax proposals, it was stated that the proposals may be provided by the end of the current month. Published in Dawn, January 9th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}