{
  "article_id": "2025-01-09_b6668e82ba310fbbf41475955c742a17",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883988/antarctic-sea-ice-rebounds-from-record-lows",
    "retrieved_at": "2025-10-12T01:11:22.790Z"
  },
  "metadata": {
    "title": "Antarctic sea ice rebounds from record lows - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T01:30:00.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PARIS: Antarctic sea ice rebounded in December after a long period of record lows, US scientists said, giving pause to speculation that Earth's frozen continent could be undergoing a permanent change. The rate of sea ice loss during the warmer spring months of November and December slowed to well below average, the US National Snow and Ice Data Center (NSIDC) said in a statement on Tuesday. This followed a \"prolonged period of record to near-record daily lows\" in 2023 and 2024 - the hottest years in the history books for global temperature rises driven by climate change. By the end of 2024, Antarctic sea ice extent had recovered to 7.3 million square kilometres (2.8 million square miles) - very close to the 1981 to 2010 average, NSIDC said. This erased the record and near-record low extents of October and November, it added. \"This provides a sharp illustration of the high variability of Antarctic sea ice extent,\" NSIDC said. Ocean temperature records - both at the surface and deep below - have tumbled since 2023, driven partly by an El Nino phenomenon that elevated heat around the globe. Scientists have been concerned since mid-2016 that global warming could be setting in motion more lasting changes in how much sea ice forms around the world's coldest continent. NSIDC said this \"regime-shift idea\" took hold particularly after a persistent stretch of below-average sea ice and \"dramatic\" records or near-records in 2017, 2023 and 2024. Published in Dawn, January 9th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}