{
  "article_id": "2025-01-09_cc315d962e419082393a4e344c3a3f2a",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884093/taliban-say-india-is-a-significant-regional-partner-after-meeting",
    "retrieved_at": "2025-08-26T07:33:34.844Z"
  },
  "metadata": {
    "title": "Taliban say India is a ‘significant regional partner’ after meeting - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T11:10:50.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/09143312166065b.jpg",
    "categories": [],
    "word_count": 302,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "The Afghan Taliban's foreign office said they saw India as a \"significant regional and economic partner\" after meeting with its most senior foreign ministry official, the highest level talks with Delhi since their takeover of Afghanistan in 2021. India's Foreign Secretary Vikram Misri met acting Taliban Foreign Minister Amir Khan Muttaqi in Dubai on Wednesday. Afghanistan's foreign ministry said in a statement that they had discussed expanding relations with Afghanistan and boosting trade through the Chabahar Port in Iran, which India has been developing for goods to bypass the ports of Karachi and Gwadar in its rival Pakistan. \"In line with Afghanistan's balanced and economy-focused foreign policy, the Islamic Emirate aims to strengthen political and economic ties with India as a significant regional and economic partner,\" the statement from Afghanistan's foreign ministry said late on Wednesday. India's foreign ministry said after the Dubai meeting that India was considering engaging in development projects in Afghanistan and looking to boost trade ties. No foreign government, including India, officially recognises the Taliban administration. However, India is one of several countries with a small mission in Kabul to facilitate trade, aid and medical support and has sent humanitarian aid to Afghanistan under the Taliban. Regional players including China and Russia have signalled they are willing to boost trade and investment in Afghanistan. The Delhi meeting could ruffle Pakistan, which borders both countries and has fought three wars in the past against India. Pakistan and Afghanistan also have a strained relationship, with Pakistan saying that several terrorist attacks that have occurred in its country have been launched from Afghan soil - a charge the Afghan Taliban denies. Earlier this week India's foreign office told journalists they condemned the anti-terrorist airstrikes conducted late last year by Pakistan on Afghan soil targeting the UN-designated terror group Tehreek-i-Taliban Pakistan (TTP).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}