{
  "article_id": "2025-01-09_7d60e5bbd5432d88486a6640fa37180d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884119/lebanese-parliament-elects-army-chief-joseph-aoun-new-president",
    "retrieved_at": "2025-08-26T07:33:30.712Z"
  },
  "metadata": {
    "title": "Lebanese parliament elects army chief Joseph Aoun new president - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T14:53:37.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/09193314cbf832d.jpg",
    "categories": [],
    "word_count": 532,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Lebanon's parliament elected army chief Joseph Aoun head of state on Thursday, filling the vacant presidency with a general who enjoys US approval and showing the diminished sway of the Hezbollah group after the Israeli invasion of Lebanon. The outcome reflected shifts in the power balance in Lebanon and the wider Middle East, with Hezbollah group badly pummelled from last year's war, and its Syrian ally Bashar al-Assad toppled in December. It also indicated a revival of Saudi influence in a country where Riyadh's role was eclipsed by Iran and Hezbollah long ago. The presidency, reserved for a Maronite Christian in Lebanon's sectarian power-sharing system, has been vacant since Michel Aoun's term ended in October 2022, with deeply divided factions unable to agree on a candidate able to win enough votes in the 128-seat parliament. Aoun fell short of the 86 votes needed in a first-round vote, but crossed the threshold with 99 votes in a second round, according to Parliament Speaker Nabih Berri, after lawmakers from Hezbollah and its Shi'ite ally the Amal Movement backed him. Momentum built behind Aoun on Wednesday as Hezbollah's long-preferred candidate, Suleiman Frangieh, withdrew and declared support for the army commander, and as French and Saudi envoys shuttled around Beirut, urging his election in meetings with politicians, three Lebanese political sources said. A source close to the Saudi royal court said French, Saudi, and US envoys had told Berri, a close Hezbollah ally, that international financial assistance -including from Saudi Arabia - hinged on Aoun's election. Thursday's parliamentary session was attended by several foreign diplomats, including the French special envoy Jean-Yves Le Druan and ambassadors of the Quint committee (Egypt, France, USA, Qatar and Saudi Arabia) that is following up on the issue of presidential vacancy in Lebanon. \"There is a very clear message from the international community that they are ready to support Lebanon, but that needs a president, a government,\" Michel Mouawad, a Christian lawmaker opposed to Hezbollah who voted for Aoun, told Reuters before the vote. \"We did get a message from Saudi of support,\" he added. Aoun's election is a first step towards reviving government institutions in a country which has had neither a head of state nor a fully empowered cabinet since Aoun left office. Lebanon, its economy still reeling from a devastating financial collapse in 2019, is in dire need of international support to rebuild from the war, which the World Bank estimates cost the country $8.5 billion. Lebanon's system of government requires the new president to convene consultations with lawmakers to nominate a Sunni Muslim prime minister to form a new cabinet, a process that can often be protracted as factions barter over ministerial portfolios. Aoun has a key role in shoring up a ceasefire between Hezbollah and Israel which was brokered by Washington and Paris in November. The terms require the Lebanese military to deploy into south Lebanon as Israeli troops and Hezbollah withdraw forces. Aoun, 60, has been commander of the US-backed Lebanese army since 2017. On his watch, US aid continued to flow to the army, part of a long-standing US policy focused on supporting state institutions to curb Hezbollah's influence. Additional input from Anadolu Agency",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}