{
  "article_id": "2025-01-09_eb0940f00e66019ce406411ccbbd9f21",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884120/pti-will-present-written-demands-to-govt-at-third-meeting-per-imrans-instructions-info-secretary",
    "retrieved_at": "2025-08-26T07:33:31.536Z"
  },
  "metadata": {
    "title": "PTI will present written demands to govt at third meeting per Imran’s instructions: info secretary - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T16:12:05.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 461,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PTI Information Secretary Sheikh Waqas Akram on Thursday said that party founder Imran Khan has authorised the party to present written demands during the next meeting with the government amid ongoing negotiations. The information secretary echoed PTI Chairman Barrister Gohar Ali Khan, who said on Wednesday that Imran had permitted the submission of the party's demands in writing to the government. Since Imran's incarceration last year in several cases, PTI's relations with the government and the establishment have deteriorated sharply, marked by protests that frequently escalated into violence amid state repression. Following the turmoil, Imran established a five-member committee to hold talks with \"anyone\", signalling a shift in PTI lawmakers' stance in parliament. In response, Prime Minister Shehbaz Sharif also formed a committee with ruling coalition members. The first meeting between the two sides took place on December 23, while the second one occurred on January 2. So far, the two sides have not made significant headway. The government and the opposition will meet again, possibly this week. After delays, the PTI leaders were finally given access to Imran this week. Following the meeting, the PTI leaders held a press conference in which they demanded an \"unmonitored\" meeting with the party founder. Addressing a press conference alongside PTI MNA Shahid Khattak, Akram said that despite the committee not being granted uninterrupted access, Imran has instructed the committee to present written demands formally. \"We have been unable to access Imran for three-and-a-half months,\" Akram lamented. \"We were not able to have an informative discussion.\" \"Despite the lack of access, he showed seriousness,\" Akram said. \"He told us to write down our demands and submit them [to the government].\" The information secretary added that these demands would be \"written and submitted\" during the third meeting between the government and PTI committees. Akram added that Imran also instructed the committee to form the judicial commission to probe the events of May 9, 2023 and November 26, 2024. \"Imran made it very clear that the judicial commission needs to be formed during this third meeting,\" Akram said. \"He said that if it is not done, he will think that the negotiations are not serious and it will be impossible to continue talks.\" However, the PTI information secretary questioned the government's ability to meet or enforce the PTI's demands. \"The government cannot arrange a meeting with Imran Khan in a jail in the province governed by their own chief minister,\" he said, referring to the Punjab chief minister. \"If they cannot do that, how can we be confident they will enforce our demands? It places a big question mark on the government,\" he stated, adding that the formation of the judicial commission in the third meeting \"will show how serious the government is about continuing talks\".",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}