{
  "article_id": "2025-01-09_de6fba086df1050117847e0508978d96",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884081/bangladesh-garment-industry-rebounds-but-workers-say-little-change",
    "retrieved_at": "2025-08-26T07:33:36.171Z"
  },
  "metadata": {
    "title": "Bangladesh garment industry rebounds, but workers say little change - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T07:58:08.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/091239161ffeceb.jpg",
    "categories": [],
    "word_count": 686,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "In a vast Bangladeshi factory hall thrumming with sewing machines, garment workers churn out seemingly endless pairs of mountain hiking trousers for customers in Europe and North America. Bangladesh's key clothing manufacturing industry supplying global brands was crippled by a revolution that toppled the government last year, in which garment sector protesters played an important role. While owners say business has bounced back, frustrated workers say hard-won concessions have done little to change their circumstances, and life remains as hard as ever. \"It is the same kind of exploitation,\" said garment worker Khatun, 24, asking that only her first name be used when speaking out, which would jeopardise her job. Production in the world's second-largest garment manufacturer was repeatedly stalled by the months-long violence, before protesters forced long-time autocrat Sheikh Hasina to flee in August. An interim government, led by Nobel Peace Prize winner Muhammad Yunus, took over. Scores of factories closed and tens of thousands lost their jobs. But after a five per cent wage hike was agreed in September, the industry rebounded. \"We are doing well,\" said garment producer factory owner S.M. Khaled, who heads the Snowtex company, employing 22,000 workers. The South Asian nation produces garments for global brands - ranging from France's Carrefour, Canada's Tire, Japan's Uniqlo, Ireland's Primark, Sweden's H&M and Spain's Zara. The apparel industry accounts for about 80 per cent of Bangladesh's exports, earning $36 billion last year, dropping little despite the unrest from the $38 billion exported the previous year. \"I am working with at least 15 international brands, and our products will be available in 50 countries,\" Khaled said. \"Almost all garment factories are operating at full swing after waves of unrest. We are on the growth side.\" Despite challenges with a cooling of demand, Anwar Hossain, the government-appointed administrator of BGMEA, said the industry was returning to strength. \"The largest contributor to exports was the apparel sector,\" Hossain said. The garment industry recorded a 13 per cent increase from July-December 2024 - the period after the revolution - compared to the same period the year before, he said. Workers tell a different story. Khatun welcomed the wage rise but said factory managers then hiked already onerous demands for \"nearly unachievable production targets\". Scraping by in the capital Dhaka's gritty industrial suburb of Ashulia, she earns $140 a month including overtime and benefits to support a family of four. The wage increase of $8.25 a month seems a miserly addition. Opening her fist, she showed a 500-taka note, just over four dollars, all she had left after paying rent and other expenses. \"We have good facilities inside the factory, like toilets, a canteen, and water fountains,\" she said. \"But we don't get even a 10-minute break while trying to meet the targets\". Many factory owners were close to the former ruling party. In the immediate days after Hasina was toppled, several factories were damaged in retaliatory attacks. Some owners were arrested and accused of supporting Hasina, who is herself in exile in India skipping an arrest warrant for \"massacres, killings, and crimes against humanity\". \"We weren't receiving salaries on time after the owner was arrested,\" said worker Rana, also asking not to be identified. \"Now, they've offered me half my basic wage, around $60 to $70. I have a six-month-old child, a wife, and elderly parents to support\", he added. Hussain, who lost his job in the unrest, tells a common tale. While he has since found work packing clothes, the new job means he \"doesn't benefit from the increment\" deal, while living costs have risen. \"House rents have shot up with the news of the pay rise,\" he said. Taslima Akhter, from the Bangladesh Garment Workers' Solidarity (BGWS) group, a labour rights organisation, said that \"workers are struggling to maintain a minimum standard of living\". Akhter said factory bosses must push back against global purchasers wanting to maximise profits at the expense of a living wage. \"Garment (factory) owners need to take more responsibility and learn to negotiate better with international buyers,\" she said. \"This industry is not new, and problems are not impossible to solve.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}