{
  "article_id": "2025-01-09_019996f09b9b313599dc6e9842647a4f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884042/taking-cover",
    "retrieved_at": "2025-08-26T07:33:36.439Z"
  },
  "metadata": {
    "title": "Taking cover - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T01:31:54.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 464,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "IT is unfortunate that, instead of taking ownership of important decisions, our officials usually seem keener to make even the good ones appear to be the result of some unavoidable obligation to the country's foreign creditors. This constant shifting of responsibility, or rather, blame, to external stakeholders has meant even necessary changes in state-level policy come to be seen publicly as the result of interference by unforgiving and unsympathetic foreign lenders rather than necessary steps that must be taken in the country's best interests. Take, for example, the finance minister, who, in a recent press conference on government rightsizing, seemed to be at pains to explain that the decision to reduce the size of our arguably bloated government had to be taken because of structural benchmarks set by the IMF. Though the minister admitted that the measure was also in Pakistan's best interests, one wonders why it was made to sound like an IMF prescription rather than a willingly embraced reform. The fact is that the size of the government needs to be cut. The country cannot continue to shoulder the burden of a large and inefficient bureaucracy, given its severely deteriorated economic position. The minister, during his press conference, himself revealed that many of the public sector entities, departments and their managements that were put on the chopping block admitted they had not much to show by way of their accomplishments over the past 20-30 years, but still wanted another six months to deliver results. This would seem to be an admission that, though these entities knew how to turn things around, they chose not to do so - and for decades, no less. While they thankfully did not get another lifeline, one still wonders why the move to cut them to size had to be framed as an obligation to a foreign lending agency. Indeed, the government should have taken pride in announcing that it was taking a major step to hold public servants and their departments accountable for funds they had been wasting for decades. That it did not seem eager to do so not only suggests a lack of concern for how the country's resources have been and continue to be squandered but also a seeming unwillingness to end such wastefulness. Perhaps this is why the finance minister dodged questions at the same press conference regarding why judges and certain categories of bureaucrats had been granted hefty salary increases in recent months. He also would not directly answer questions about whether certain 'favoured' ministries and departments would face cuts. The finance minister, himself an appointed technocrat, may at times feel obligated to deflect responsibility from the elected government. However, it is hoped that this is not also preventing him from taking the right decisions. Published in Dawn, January 9th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}