{
  "article_id": "2025-01-09_0a2266c1dca2d569580d2c073372e614",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884097/trans-fat-must-be-eliminated-to-prevent-ncds-experts",
    "retrieved_at": "2025-08-26T07:33:34.265Z"
  },
  "metadata": {
    "title": "Trans fat must be eliminated to prevent NCDs: experts - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T11:30:15.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/09155414c6bb51e.jpg",
    "categories": [],
    "word_count": 405,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Experts have urged Pakistan's food law and standards enforcement agencies to implement policies against industrially produced trans fats (iTFAs) to prevent noncommunicable diseases (NCDs), a press release said on Thursday. The Centre for Governance and Public Accountability (CGPA) organised a meeting on \"Strategies for iTFAs Reduction: From Policy to Enforcement\" which was attended by senior officials from provincial and regional food authorities, and the director general, of Pakistan Standards and Quality Control Authority (PSQCA), Taufeeq Abbasi. The meeting concluded that food agencies must start enforcement of less than two per cent limit of iTFAs to protect people from cardiovascular and metabolic ailments such as heart attacks, diabetes, cancers, and obesity, the press release stated. Muhammad Anwar, Executive Director of CGPA said, \"The situation of NCDs in Pakistan is quite critical. We have more than 60pc deaths due to various diseases in which food-related risk factors play an important role.\" \"iTFA are harmful for whole body including the heart and around 29pc of deaths happen because of cardiac problems,\" he added. An official from Nutrition International, Zameer Haider, said, \"While NCDs are rising alarmingly and causing disabilities and deaths, we can prevent them with focusing on both the dietary and lifestyle risk factors.\" He added, \"iTFA reduction is one of the interventions which can help save precious lives from premature deaths, diseases and disabilities.\" PSQCA's director general stressed the implementation of policies stating that the authority had set mandatory limits in 2023 but there needs to be a strategy to implement it across Pakistan. According to a CGPA official, the World Health Organisation has a plan of action for iTFA reduction in food supply which is called REPLACE. \"CGPA is helping government agencies to use the plan of action, incorporate it in their monitoring and evaluation processes, and develop reporting mechanisms. It will help Pakistan join the league of top 6 countries such as Saudi Arabia who not only have policies, but enforcement mechanisms and food evaluation methods, too.\" \"Enforcement of iTFA-related prohibition is something we are seriously looking into at Punjab Food Authority (PFA),\" PFA's deputy director, Farha Ather remarked. Meanwhile, KP's food authority director, Abdul Sattar, also commented, \"We have a number of complaints about partial hydrogenation processes which add iTFAs in ghee. It is time that PHO must be banned.\" CGPA called for the implementation of policies stating, \"Our food governance must be improved and enforcement of iTFA reduction strategies must start immediately.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}