{
  "article_id": "2025-01-09_695233b62a7ab88c55ca53c5c29357b8",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884014/woman-held-for-robbing-fathers-house-in-rawalpindi",
    "retrieved_at": "2025-10-12T00:46:19.069Z"
  },
  "metadata": {
    "title": "Woman held for robbing father’s house in Rawalpindi - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-09T01:30:47.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 230,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI: The Rawalpindi police said on Wednesday that they resolved a robbery case, arresting two suspects and recovering Rs8.1 million in cash and of jewellry worth Rs500,000. Rawal Division Superintendent of Police (SP) Haseeb Raja during a press conference revealed that the complainant's daughter turned out to be the main suspect. The case unfolded when a resident of Etihad Colony on City-Sadar Road lodged an FIR with the City police saying that he has been serving as recovery officer in a gas company in Sector G-8/1 of Islamabad. On Tuesday, his daughter was alone at home when unidentified robber entered the house and made off with over Rs9.5 in cash and two gold chains worth Rs500,000. The officer said the police formed a team and started an investigation. The probe revealed that the man's daughter was behind the robbery and who allegedly planned to elope with her lover. SP Haseeb further said police were able to acquire the CCTV footage, which poked holes in the suspect's smokescreen. The girl's hands and sweater were seen in the CCTV footage, which helped the police to trace the accused. Upon interrogation, the main accused allegedly confessed to having committed the crime and revealed that she staged the robbery with his 22-year-old lover to flee abroad. SP Rawal said that the accused will be presented before a court. Published in Dawn, January 9th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}