{
  "title": "Pakistan needs major shift in macroeconomic policies to address inequalities: Minister",
  "link": "https://www.app.com.pk/national/pakistan-needs-major-shift-in-macroeconomic-policies-to-address-inequalities-minister/",
  "date_published": "2022-08-25T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri has said that the current devastated floods which the country was confronted with reiterate the need to invest more in social protection and develop resilience to address the inequalities in the country.\nShe was speaking at a policy dialogue on the Economic and Social Survey of Asia and the Pacific 2022 – Economic Policies for an Inclusive Recovery and Development here on Thursday.\nThe minister said in this crisis time when the floods have rendered heavy financial and life losses adding to human sufferings, Pakistan needs a major shift in its macroeconomic policies to streamline the recovery phase.\nMember of National Assembly, Mehnaz Akbar Aziz said emphasized strengthening people-to-people contacts, and the local government system in these testing times.\nShe stressed the need to include youths, women, children and minorities in debates on economic policies to ensure their inclusivity and to align them with the real time needs of people.\nIt’s time to scale up investment in the health and education sector to address social and economic inequalities, she said, adding that we must focus on job creation and making fiscal space for entrepreneurship for this purpose. She further said that people must be relieved from the financial burden of energy bills and solar energy must be promoted on priority basis in rural areas.\nThis will also ensure that the focus is not deviated from health, social protection and education to energy provision and subsidizing energy.\nHighlighting the important aspects of the macroeconomic model developed for Pakistan, SDPI Executive Director Dr Abid Qaiyum Suleri said that the model has become very relevant in the backdrop of current flood disasters in various parts of the country and diverts our focus on aspects of resilience and social protection.\nHe pointed out that K-shaped recovery has been recorded and various sectors are struggling to bounce back from the negative impact of COVID-19, which requires macro-economic stabilization, fiscal interventions and redistribution policies to bridge the financing gap between sectors.\nSyed Zafar Ali Shah, Federal Secretary for Ministry of Planning, Development and Special Initiatives said that the growth pattern has been disturbed due to the pandemic, however, Pakistan has recovered from negative to 5.9% growth.\nNow, it is time to redistribute efforts for inclusive, fair, and resilient recovery.\nHe said the approval of fiscal policies by the International Monetary Fund has a positive sign on macro-economic stability.\nHe further said that the central bank has a key role in supporting inclusive growth, but it is a challenge to choose between growth or managing inflation triggered by domestic and international stimuli.\nHe said that from Rs 9.5 trillion federal budget, resources must be redirected to control inflation and make pro-poor policies.\nHe emphasized for improving governance structure for smart spending and focus on social protection. He further said the government has directly dispensed Rs 20 billion to the flood victims of Balochistan through direct transfers via BISP and will be carried out for other areas as well.\nHe also mentioned that SDGs are a national priority commitment for which Pakistan has increased 10 points on SDGs development fund.\nAli Kemal, Chief of SDGs Unit, said that in order to achieve the 2030 agenda, $4-7 trillion are required annually but there is a huge gap in the investment.\nIn case of Pakistan, 10% of GDP must be invested while the current investment is only 1% of GDP. Currently, Pakistan is 90% behind its financial resources necessary to achieve SDGs agenda.\nHe expressed the hope that even if we are unable to achieve SDGs by 2030, we would make significant progress in this connection.\nHe pointed out that fiscal stimulus is very harmful during recession which has been proved by various research reports.\nDr Hamza Ali Malik, Director, Macroeconomic Policy and Financing for Development Division, UNESCAP, said that UNESCAP has decided to change the strategy and increase engagement with experts, hold policy dialogues in countries and engage with policy makers to transform the ideas unto reality.\nIn 2021, macro-economic model was developed for Pakistan. There was a widening gap and exacerbating inequalities and called for revisiting major macro-economic policies to address these issues.\nMr. Jian Zheng, Economic Affairs Officer, Macroeconomic Policy and Financing for Development Division, UNESCAP, said that the pandemic has pushed 85 million people to extreme poverty with highly detrimental impacts on informal workers, employment, subdued capital investment by further shrinking fiscal space and exaggerating learning deficits. He stressed the use of multi-pronged strategy to support inclusive recovery based on structural transformation, enhancing the role of Central Bank and fiscal policy interventions for social security net.\nHe said that the government must spend smartly and increased fair tax base. He was of the view that the Central Bank must ensure financial inclusion through Central Bank Digital Currency and promote digital financial literacy.\nDr. Sajid Amin, SDPI Deputy Executive Director, said that the macro-economic model developed by SDPI and Planning Commission is tailored to address the contemporary socio-economic challenges of Pakistan. The model suggests that 9.6% of the GDP must be spent on social protection while the current spending status is much lower. Emphasizing scaling up private financial resources, he said that the model presents ways on bridging the gap by enhancing the availability of private funds.\nHe also stressed the need for reprioritizing spending to more productive sectors. He pointed out that in 2019, the government gave $2 billion coal and oil subsidies, which is equal to the funds received from IMF which reiterates the suggestion of smart spending. He called upon the government to focus on green development in transport and renewable energy, saying that $12 billion can be saved annually by reducing inefficiencies in the rail and road transport sector.\nDr Shabnam Sarfraz, Member of Social Sector & Devolution, Planning Commission, said that the Planning Commission repurposed finances for COVID-19 and built up a case for investments which was successful in securing Rs 72 billion for one project.\nShe said that Planning Commission is cognizant of the need to improve public-private partnerships to increase availability of resources for social sectors and is increasing cooperation among public, private sector, INGOs and CSOs. The Planning Commission is also working on improving 20 tourist destinations to expand economic activity and generate higher revenues from tourism.\nDr Muhammad Ali Talpur, Economic Consultant, Ministry of National Food Security and Research, said that the government realizes the importance of food security for social protection and inclusive development and has increased financial allocation in this respect.\nHe added that during the first year of pandemic, a database on food security was developed in partnership with SDPI which provides essential guidance and support in policy making.\nDr Vaqar Ahmed, SDPI Joint Executive Director, said that the results from the macro-economic model must trickle down to sub-national level for which federal-provincial coordination must be improved as majority of these issues are provincial subjects post 18th Amendment.\nHe further said that greater involvement of public sector and development partners must steer inclusive and resilient recovery and financial resources of non-public players must be rerouted to support these efforts. The coordination between different players and partners must be improved to avoid multiplicity and duplicity of efforts.\nAddressing the crucial role of diaspora, he expressed that idea, technology and resource transfer from diaspora is a pertinent need along with scaling up the role of startups for youth engagement, job creation and inclusive recovery.",
  "retrievedAt": "2025-08-11T15:27:24.487Z"
}
