{
  "title": "Flood havoc-Pakistan going through climate-induced humanitarian disaster: Sherry",
  "link": "https://www.app.com.pk/national/pakistan-going-through-climate-induced-humanitarian-disaster-sherry/",
  "date_published": "2022-08-25T12:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Thursday referring to the havoc wreaked by ongoing unprecedented monsoon rains, said Pakistan was going through a climate-induced humanitarian disaster at the moment.\nThe media should play an effective role in highlighting the plight of flood victims, rescue and relief efforts, and damages to life and property so that the stakeholders could manage a well-coordinated response with the public support, she told a press conference.\nSherry said the country had so far received average 166 millimeters rainfall during the month of August, which was 241% above normal, whereas its southern parts particularly Sindh, got 784% more than normal average rain of the season which was alarming.\nThe Met Office statistics were startling, she said, adding the flash floods caused by massive rains had swept away bridges and communication infrastructure in various areas of the provinces.\nThe current deluge in the Indus River was even more than the super flood of 2010, Sherry remarked.\nThe minister said a national emergency had been declared in the country as Prime Minister Shehbaz Sharif and Foreign Minister Bilawal had postponed their official visits abroad.\n“We are in the eighth spell of monsoon rains with southern Pakistan receiving heavy rains, including 23 districts of Sindh declared as calamity-hit.”\nShe said as half of the country in the south was inundated, the armed forces and National Disaster Management Authority (NDMA) along with provincial governments were actively engaged in rescue and relief activities.\n“Almost 30 million people are without shelter, thousands of them displaced and have no food. As needs assessment is underway and will be completed soon, which will help in approaching donor agencies for relief and rescue as the crisis has surpassed the capacity of the government.”\nShe reiterated that it was not possible for a government or a province to solely handle such massive flooding and heavy rains. “The Prime Minister’s Relief Fund account is active to accept donations for disaster-hit masses whereas tents have been ordered by the NDMA and PDMAs (Provincial Disaster Management Authorities). The prime minister has also opened a war room at the NDMA to spearhead and monitor rescue and relief efforts.”\nThe minister underlined that there was forecast of extended monsoon activity in September, which was again alarming one.\nShe said the Sukkur and Taunsa barrages had high water flow and all available machinery and other resources were being utilized in the affected region. At present all the departments were focused on flood-hit areas to cope with any evolving situation.\nSherry said some 913 people had perished in rain-related incidents, with more number of deaths of the children in Khyber Pakhtunkhwa. However, the number of the injured was also reported high, she added.\nShe said it was now time for donors and the world to support Pakistan, which had always volunteered to assist nations, including its neighbours during natural disasters.",
  "retrievedAt": "2025-08-11T15:27:31.024Z"
}
