{
  "title": "International institutions announce $500 mln for flood affectees on appeal of PM",
  "link": "https://www.app.com.pk/national/international-institutions-announce-500-mln-for-flood-affectees-on-appeal-of-pm/",
  "date_published": "2022-08-25T15:16:00.000Z",
  "source": "APP",
  "content": "The international organizations and financial institutions Thursday announced immediate assistance of more than 500 million dollars for the flood victims on the appeal of Prime Minister Shehbaz Sharif.\nThe PM chaired an important meeting with the international donors here for providing relief to the flood victims.\nThe representatives of the World Bank, Asian Development Bank, international financial institutions, development partners, and donors attended the meeting.\nThe officials of China, the United States and the European Union, agencies of the United Nations and the World Health Organization also took part in the meeting.\nThe Prime Minister briefed the international partners about the devastation caused by floods in the country, particularly in Sindh and Balochistan.\nHe said the country faced an emergency situation because of the historic rains and floods and a large number of people including women and children lost their lives.\nHe told that houses, infrastructure, crops and orchards were destroyed, roads and bridges were washed away and land routes were cut off which made it difficult to carry out rescue and relief activities.\nThe relief activities were expanded with the help of the Pakistan army and helicopters, he informed.\nThe devastation caused by floods was more grave than what happened in 2010, he said adding the affectees needed food, medicines, tents, and temporary shelters.\nHe said the federal government undertook relief activities in coordination with the provinces and the federal and provincial departments were working together.\nThe government released Rs five billion for relief and family of every deceased was given the financial assistance of Rs one million.\nCountry Director for Pakistan, South Asia Region Najy Benhassine informed the PM about the immediate assistance of $ 350 million from the World Bank. He appreciated the flood relief cash programme of the Prime Minister.\nThe World Bank would provide the financial assistance by the end of the current week. The World Bank would also cooperate with Pakistan through a comprehensive plan for the restoration of the infrastructure after an assessment of the losses.\nThe World Food Programme- the agency of the United Nations – also announced\n$ 110 million for the flood affectees. The Asian Development Bank pledged to give $ 20 million assistance while the UK Aid would give 1.5 million pounds.\nWhile the UK Aid also announced another 38 million pounds for the mid term and long term projects for the restoration of the flood affectees.\nThe Prime Minister said each flood victim family was immediately given Rs 25,000 and Rs 80 billion were allocated for this purpose.\nHe said the extent of the destruction of floods was so huge that the federal and provincial governments could not complete the rehabilitation of the flood affectees on their own.\nHe urged international organizations, financial institutions and countries to cooperate with the Pakistan government on an emergency basis, adding a large area of Sindh and Balochistan was already declared disaster hit.\nShehbaz said, “I am personally overseeing the rescue, relief, and rehabilitation activities from day one.”\nThe government had set up a Prime Minister Relief Fund 2022 to speed up the efforts for assistance and restoration of the flood affectees, he said adding the assistance of the international financial institutions and organizations was crucial in the rehabilitation of the affectees.\nHe said the army, government institutions, public service departments, doctors, nurses and volunteers were working with passion in a difficult situation.\nHe lauded all those who were helping out the flood affectees and said he was grieved at the difficult conditions faced by the people stranded in floods.\n“We want to reach out to every affected Pakistani and we want help of the international partners. We need essential items and medical staff to overcome the difficult situation.”\nHe invited international partners to visit the flood-affected areas. The government would make arrangements for the visit of the international partners.",
  "retrievedAt": "2025-08-11T15:27:28.361Z"
}
