{
  "title": "GB top achievers students in FBISE examination visit NSU",
  "link": "https://www.app.com.pk/national/gb-top-achievers-students-in-fbise-examination-visit-nsu/",
  "date_published": "2022-08-25T04:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): A group of twenty students achieving top positions in the Federal Board of Intermediate & Secondary Education from Gilgit Baltistan visited the National Skills University Islamabad (NSU) here on Wednesday.\nThe Chief Secretary of Gilgit Baltistan, Mohyuddin Ahmad Wani, and other high officials were also with this group, said a press release.\nDuring the welcome ceremony, the Vice Chancellor briefed students about the importance of skills education in the contemporary era and various opportunities for the country’s youth, including GB students.\nHe also described the contribution of the Chief Secretary towards uplifting the NSU that was highly appreciated and lauded by the entire administrative and academic members of the university.\nIt is worth mentioning here that Mr. Mohyuddin, before his elevation to the Chief Secretary Gilgit Baltistan, was serving in the Ministry of Federal Education and Professional Training in Islamabad.\nDuring that time, he immensely contributed to the university’s uplift and resolved complex issues of illegal occupations, including several others.\nAfter briefings, students visited different laboratories/workshops for youth training in various skills programs. They took a keen interest in undergraduates and short-term training programs.\nVisiting students’ team described their experience at NSU as very fruitful and full of learning new opportunities for them.\nAccording to them, the National Skills University Islamabad offers educational programs that align with their requirements. Upon the completion of the visit, a reception was organized in honor of the visiting students.\nThe Chief Secretary GB and his team described university successes as exemplary, and its educational programs aligned with workplace demands in the country.",
  "retrievedAt": "2025-08-11T15:27:33.739Z"
}
