{
  "title": "Ahsan appreciates APCEA for donating Rs 15.5m in PM Flood Relief Fund",
  "link": "https://www.app.com.pk/national/iqbal-appreciates-apcea-for-donating-rs-15-5m-in-pm-flood-relief-fund/",
  "date_published": "2022-08-25T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP):Federal Minister for Planning Development & Special Initiatives Professor Ahsan Iqbal on Thursday appreciated the All Pakistan Chinese Enterprises Association (APECA) for donating Rs 15.5 million to the Prime Minister’s Flood Relief Fund.\n“This year, Pakistan has received above average rainfall in the monsoon season. Climate change has hit the country in a big way,” he said in a statement.\n“We are one of the lowest carbon footprint producing country yet we are also among the top 10 countries that are vulnerable to climate change,” he added.\nThe minister observed that the recent rains were unprecedented as Sindh had received more than 400% and Balochistan 370% rainfall, leaving the two provinces to be the badly affected.\nAhsan Iqbal said China was an all weather friend of Pakistan, which always stood shoulder to shoulder whether it was emergency or calamity, or whether it was some economic crisis.\n“The Chinese enterprises realizing their social responsibility donated over Rs 15 million to the Prime Minister’s Relief Fund that speaks volume for the bonding between the two countries and acknowledgment of sufferings that the people of flood hit areas have gone through,” he remarked.\nMoreover, the minister directed the stakeholders concerned to constitute a team of government doctors to provide medical treatment to the flood-affected people while observing that providing health facilities to the masses was the government’s top priority.\nHe issued the directions while reviewing the latest flood situation in the country.\n“The Ministry of Commerce should mobilize all the chambers of commerce of the country to collect funds for the relief of affected people and participate in the philanthropic cause,” he said while directing all the stakeholders to expedite the relief assistance without any delay.\nDuring the meeting, the minister also directed the stakeholders to establish police pickets at choking points to ensure the smooth flow of traffic.\nThe minister as chairman the Relief Committee is holding review meetings on daily basis to take stock of flood situation in the country.",
  "retrievedAt": "2025-08-11T15:27:28.006Z"
}
