{
  "title": "Monsoon rains death toll surges to 903, injure 1293",
  "link": "https://www.app.com.pk/national/monsoon-rains-death-toll-surges-to-903-injure-1293/",
  "date_published": "2022-08-25T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 25 (APP): The above normal monsoon rains across the country on Thursday caused further surge in the lives and property losses as the total death count in various incidents reached 903 and 1293 individuals got injured since the onset of the rainy season.\nThe National Disaster Management Authority (NDMA) issued a 24-hour situation report released on routine basis that accounted overall life, property, and infrastructure losses incurred by the heavy rains lashing out various parts of the country.\nThe heavy rains caused roof collapse incident in Balochistan’s four different areas including two men died in Loralai, a man died in Duki, one in Sibbi and one in Musakhel whereas three children got injured in Duki.\nIn Khyber Pakhtunkhwa’s District Dera Ismail Khan, incidents of roof collapse as a result of heavy rain were reported at different sites that caused death of a male and injured a male and a female.\nIn Punjab’s District Rajanpur, five males died due to drowning in high flow waters.\nIn Sindh, five men, a woman and a child died in Noushero Feroze, four man perished in Larkana, a man , a woman and a child died in Shaheed Benazirabad, a man and three children died in Jacobabad, a woman and a child expired in Badin, a woman in Sanghar died, two children in Tando Muhammad Khan, two children in Kashmore and one in Dadu died during various incidents.\nThere was no incident or loss to report in Azad Jammu and Kashmir, Gilgit Baltistan and Islamabad Capital Territory (ICT).\nIn Gilgit Baltistan (GB), the Mujawir Road at Ishkoman Immit Valley was blocked due to flash flood where restoration work was in progress.\nIn Balochistan, the high flow of water blocked the N-25 Quetta-Karachi Highway as it washed away the Lunda Bridge. Similarly the M-8 motorway was also blocked due to land sliding.\nThe report highlighted that a widespread thunderstorm and rain of heavy to very heavy intensity with extremely heavy falls at isolated places was expected over Sindh, Eastern Balochistan along with Dera Ghazi Khan and Dera Ismail Khan Divisions.\nIt further highlighted that scattered to widespread thunderstorm and rain of moderate to heavy intensity with isolated very heavy falls was expected over the upper catchments of Rivers Kabul and Indus.\nMoreover, scattered thunderstorm and rain of moderate intensity was expected over the upper catchments of Rivers Jhelum, Chenab, Ravi and Sutlej along with Islamabad and Rawalpindi, Sargodha, Gujranwala, Lahore, Multan, Bahawalpur, Peshawar, Kohat and Bannu Divisions.\nIt added that isolated thunderstorm and rain was expected over rest of the country except Western Balochistan.",
  "retrievedAt": "2025-08-11T15:27:31.041Z"
}
