{
  "title": "Ahsan Iqbal terms political stability, continuity of policies crucial for economic uplift",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-terms-political-stability-continuity-of-policies-crucial-for-economic-uplift/",
  "date_published": "2023-02-08T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP): Federal Minister for Planning, Development, and Special Initiatives, Prof. Dr Ahsan Iqbal on Wednesday termed political stability and continuity of policies as essential for achieving economic development in the country.\n“If you want to continue playing in the political theatre; you cannot bring positive reforms in the economic theatre”, he said while speaking at a ceremony to celebrate the landmark of China-Pakistan Space Science and Technology cooperation on the eve of the return of Pakistani Seeds from Chinese Space at COMSTECH auditorium.\nThe ceremony was arranged by the Ministry of Science and Technology, the Embassy of the People’s Republic of China in Pakistan, COMSTECH and the International Center for Chemical and Biological Center, University of Karachi.\nThis space mutagenesis for crop improvement project was jointly collaborated by the People’s Republic of China, the Pakistan Science Foundation (PSF) under the ministry, and the International Centre for Chemical and Biological Sciences, University of Karachi.\nSpeaking on the occasion, Ahsan Iqbal said that strong efforts were needed to overcome the challenge of economic crisis inherited by the ineffective policies of the previous government.\n“As a nation where we stand today; we have to decide either to support polarization, disorder or conflict in the country or uphold the principles of unity and solidarity”, he said.\nAhsan Iqbal said that the secrets behind China’s success lie in stability, social solidarity and continuity of policies which helped the country achieving progress on all fronts.\nThe federal minister stated that space technology is one of those technologies which are most critical for human development and security. All the sectors including health, education, agriculture, forestry, climate change etc. are interlinked with the space technology for advancement.\n“We need to build capacity of our researchers and scientists to utilize space technology for managing all these sectors otherwise we will not be able to manage human resources efficiently and defend our country in future”, he added.\nSince space technology and its application is capital intensive and require sufficient resources for which economic stability is important to achieve, he observed.\nIt is very unfortunate that our country has lagged behind in the field of research and technology, he lamented while stressing the need of utilizing the potential of youth for the advancement in this field.\n“Pakistani young scientists can help country regain the past glory in science and technology”, the federal minister stated.\nAbout the “Seeds in Space” project, Ahsan Iqbal said this project is a milestone in collaborations between scientists of both countries. The project provides a platform for researchers to share knowledge and resources, leading to economic growth. This project is a cornerstone in advancing space science, herbal medicine, and research.\nHe said that Pakistan and China celebrate their longstanding friendship with the launch of a joint project between MOST, Chinese government, the Embassy of China in Pakistan, ICCBS Karachi, the Pakistan Science Foundation, and COMSTECH.\nThe two countries have maintained a strong relationship since establishing diplomatic ties in 1951 and are dedicated to furthering cooperation in all areas of mutual interest. This new project solidifies their commitment to strengthening the “All-Weather Strategic Cooperative Partnership” between the two nations.”\nIn her address, Charge d’Affaires of the Chinese Embassy in Pakistan, Madam, Pang Chunxue praised the scientists of both countries for their joint efforts in a successful scientific experiment. She said that experiment represents a landmark in China-Pakistan Science and Technology cooperation and will be recorded in the history of their friendship.\nShe also said that both countries are committed to building a closer community with a shared future, through open and inclusive cooperation, for the benefit of their peoples and the prosperity of the nations. Ms. Pang said that she believes that deepening cooperation will bring greater benefits.\nSpeaking at the occasion, Pakistani scientist, project and group lead Prof. Dr. M. Iqbal Choudhary, Coordinator General COMSTECH/ Director ICCBS said that ICCBS is proud to announce a major milestone in the cooperation of space science and technology between Pakistan and China with the successful sending of seeds into space.\nThis foundational step marks an important point in the continued growth and partnership between the two countries and will drive future cooperation in the field of space science.Chairman Pakistan Science Foundation Prof. Dr. Shahid Baig said that PSF boosts coordination among Science and technology institutions. Support from Chinese institutions leads to stronger strategic and academic infrastructure in Pakistan. PSF serves as a key tool for socio-economic development.\nIt is the first time that Pakistani seeds including Trigonella foenum-graecum (Methi), Lawsonia inermis ( Mehndi), Moringa Olefera ( Sohanjna), Withania somnifera ( ashwagandha), Tribulus Terrestris ( Gokhroo), Gossypium arboretum (Mughal punta dana) and Caesalpinia bonducella ( Kuranjwa) travel to space and sojourned there for six months in a special environment consisting of microgravity and cosmic radiations.\nThis space mutagenesis for crop improvement project is a mind-blowing research work that will not only provide enormous opportunities for further research on other planets but also make plant cultivation easier in harsh weather conditions e.g drought, and floods caused by global warming. Cultivation of medicinal plants is still at the initial stage in Pakistan so this project is a milestone in the development of Pakistani medicinal plants, drug discovery, and clinical trials.\nThe scientists who contributed to the project included Prof. Dr. M. Iqbal Choudhary, Prof. Dr. Atia tul Wahab, Dr. Yan Wang, Dr. Shakeel Ahmed, Prof. Dr. Ahsana Dar Tariq, and Prof. Dr. Ghazala. H. Rizwani.\nThe ceremony was attended by the Secretary Ministry of Science and Technology, political leadership, diplomats, scientists, and senior officers of the ministry and its attached organizations.",
  "retrievedAt": "2025-08-11T05:58:59.717Z"
}
