{
  "title": "Pakistani pharma firms keen to invest in Ethiopia",
  "link": "https://www.app.com.pk/national/pakistani-pharma-firms-keen-to-invest-in-ethiopia/",
  "date_published": "2023-02-08T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 08 (APP): The pharmaceutical companies in Pakistan have expressed keen interest to produce raw materials of different life-saving drugs for the Federal Democratic Republic of Ethiopia (FDRE) by investing in its health sector.\nThe interest was shown by a delegation of the pharmaceutical industry during a meeting with Ambassador Extraordinary and Plenipotentiary of the FDRE to the Islamic Republic of Pakistan Jemal Beker Abdula here at his office in Islamabad.\nThe delegation, led by President of the Islamabad Chamber of Commerce and Industry Ahsan Zafar Bakhtawari, included Former President of ICCI Zafar Bakhtawari, ICCI Executive Member Shaukat Hayat Khan, ICCI Defence Sub Committee Convener Zahid Maqbool and representatives of different pharmaceutical companies.\n“Pakistan can offer best quality medicines to Ethiopia at par with the international standards as well as on affordable rates,” said the head of a pharmaceutical firm who added that his company was producing 300 different brands of life-saving drugs.\nHe said Pakistan was a $3.2 billion market for pharmaceuticals with an annual growth rate of about 18 percent. “Despite all the odds, our industry market size is growing as we are exporting (our products) to 65 countries including Africa, Central Asian states, and others.\nA representative of another company based in the twin cities said there was a big cluster of pharmaceutical manufacturers in the twin cities of Rawalpindi and Islamabad. “Our company is producing more than 150 life-saving drugs and is also interested in doing business in Africa especially, Ethiopia.”\nAmbassador Jemal Beker said the products produced by Pakistan’s pharmaceutical industry had a good reputation in the world, but unfortunately could not get access to the market of Ethiopia due to the absence of institutional linkages.\n“The first thing we did after opening our embassy in Islamabad was to establish institutional linkages between the two countries,” he said, adding a lot of work had already been done in this regard in collaboration with the authorities concerned in Pakistan.\nHe said the health sector of Ethiopia offered lucrative opportunities for Pakistani businessmen as currently Ethiopia has been importing around 80 percent of pharmaceutical products from other countries.\nThe envoy also assured the delegation of his full support in connecting them with the relevant stakeholders in Ethiopia.\nHe also briefed them on a Pakistani business delegation flying to Ethiopia on March 5-10 for exploring business, trade, and investment opportunities in the land of origins.\n“It is high time for Pakistani businessmen to enter the market of Ethiopia which will eventually give them access to the entire African continent,” he said while urging the business community to join in the delegation which would advance the bilateral relations between the two countries.\nICCI President Ahsan Bakhtawari lauded the efforts of the ambassador for mobilizing a high-profile Pakistani delegation to Ethiopia in a short span of time, which showed his commitment and dedication to promoting trade and economic relations between Pakistan and Ethiopia.\nHe also discussed the matters regarding the inclusion of ICCI representatives in the delegation and said that the trade trip to Ethiopia would open up new avenues for promoting trade and exports with the African region.\nHe also appreciated the efforts of the Ethiopian Ambassador for the start of direct flights by Ethiopian Airline between Addis Ababa and Karachi in March that would help in promoting people-to-people and B2B relations between the two countries.",
  "retrievedAt": "2025-08-11T05:58:45.256Z"
}
