{
  "title": "Art exhibition highlights Indian brutality: Mushaal Mullick",
  "link": "https://www.app.com.pk/national/art-exhibition-highlights-indian-brutality-mushaal-mullick-2/",
  "date_published": "2023-02-08T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP):The Chairperson of the Peace and Culture Organisation Mushaal Hussein Mullick on Wednesday said that art is a good source to exhibit the barbarism of Indian forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nShe was addressing at an Art Exhibition which was organized by National College of the Arts (NCA), the exhibition was to highlight the violations of human rights in IIOJK and Modi-led regime turned the Kashmir valley into a prison of the world.\nMushaal said that the terrorist Indian State had been committing genocide of Kashmiri people in the disputed valley for over seven decades.\nShe said that India was the biggest terrorist State, involved in the brutal killing and torture of innocent and unarmed Kashmiri people for raising the voice against the unlawful subjugation by Indian authorities for last 75 years.\nThe chairperson vowed that the courage of the brave people of the occupied valley could not be dampened by the brutal and inhuman tactics.\nFederal Minister for Education and Technical Training Rana Tanveer said that the world powers duplicity and apathy towards the world’s worst crisis on the surface of the earth, as the fascist government adopted a ruthless policy of genocide and ethnic cleansing of the Kashmiri people of the occupied valley.\nHe said that Kashmiris would never accept the Hindutva regime and would fight for their right to self-determination till the last drop of their blood.However, he stressed the need for a solution to the decades-old Kashmir dispute.\nThe Minister said that UN was legally and morally bound to secure the implementation of its resolutions on Kashmir, adding that settlement of the lingering dispute as per the Kashmiris’ aspirations was imperative for peace and stability in South Asia, as it could trigger a nuclear war between Pakistan and India.",
  "retrievedAt": "2025-08-11T05:58:47.017Z"
}
