{
  "title": "Road safety awareness crucial to reduce traffic fatalities: President",
  "link": "https://www.app.com.pk/national/road-safety-awareness-crucial-to-reduce-traffic-fatalities-president/",
  "date_published": "2023-02-08T08:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP): President Dr Arif Alvi on Wednesday said strict implementation of traffic rules and public awareness about road safety was crucial in the prevention of accidents, thus reducing fatalities.\nThe president urged the legislators to incorporate comprehensive road safety programmes into national planning.\nHighlighting the role of parliamentarians in carrying out effective legislation on road safety, he stressed educating the communities for better enforcement.\nAddressing here at the ‘Road safety conference for parliamentarians’, the president said with increased traffic volume on roads, the importance of ensuring safety measures increased manifold to save precious lives.\nParliamentarians from across the world joined the conference, which was organized by the International Parliamentarians Congress (IPC) in collaboration with ‘Mutehtakm Parlimaan, a European Union-funded project, and the Pakistan Institute of Parliamentary Services.\nPresident Alvi said traffic accidents were one of the leading causes of deaths, mostly due to cranial injuries, and could prove traumatic for the entire family.\nHe said implementation of traffic rules through surveillance cameras, safe road infrastructure, easy-to-understand traffic illustrations, and proper inspection of vehicles could contribute towards reducing accidents.\nThe president also emphasized self-discipline by motorists, particularly the use of seatbelts and wearing of helmets.\nHe advised road users to remain mentally and physically alert to avoid traffic crashes.\nChairman Senate Sadiq Sanjrani, also the President International Parliamentarians Congress (IPC), said globally around 1.3 million people die and 50 million get injured in traffic accidents annually.\nIn Pakistan, he emphasized prioritizing the efforts to enact road safety laws at par with international standards and educate the stakeholders.\nPresident Inter-Parliamentary Union Duarte Pacheco said road safety must be considered a serious health-related problem due to its direct and indirect costs and called upon the parliamentarians to act together on national health safety programmes.\nDeputy Head of the EU Delegation in Pakistan Thomas Seiler stressed the importance of a holistic approach to road safety and urged the governments and partners to implement an integrated safe system approach.\nDirector General World Health Organization Tedros Adhanom Ghebreyesus in his video message mentioned that the Global Plan for the Decade of Action for Road Safety 2021-2030 emphasized reduction of traffic deaths by half.\nThe conference discussed five pillars of road safety including safety management, safer roads and public mobility, safe vehicles, safer road users, and post–crash response.",
  "retrievedAt": "2025-08-11T05:59:05.029Z"
}
