{
  "title": "Senate body on Narcotics Control unanimously passes two bills",
  "link": "https://www.app.com.pk/national/senate-body-on-narcotics-control-unanimously-passes-two-bills/",
  "date_published": "2023-02-08T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 08 (APP):The Senate Committee on Narcotics Control Wednesday unanimously passed two Bills titled “Control of Narcotics Substances (Amendment) Bill,2022” and “Control of Narcotics Substance (Amendment) Act,1997”.\nThe meeting was chaired by Senator Ejaz Ahmed Chaudhary.  The bill titled “Control of Narcotics Substances (Amendment) Bill, 2022 was moved by Senator Mohsin Aziz. The mover said, that the prime objective of the bill was to eradicate drugs from educational institutions.\nHe said that the Bill made it compulsory for all educational institutions to form a ‘Disciplinary Committee’ with representatives of Law Enforcement Agencies as its members with a mandate to carry out inspections on regular basis in university premises and the Disciplinary Committee will also be accountable for its implementation.\nHowever, Senator Rana Maqbool Ahmed, mover of a bill titled “Control of Narcotics Substance (Amendment) Act 1997”, said that the aim of the bill is to abate the victimization of private individuals on malafide charges doctored by their political opponents. Therefore, the committee passed the Bill with minor amendments.\nANF officials informed the committee that in the recent period, the force seized 117 metric tons of drugs and arrested 1516 drug peddlers.\nAbout the viral video of ANF of bribery at Islamabad Airport, the officials apprised that disciplinary action has been taken and all the three accused have been penalized.\nThe Chairman Committee appreciated the efforts of ANF in their pursuit of drug control.\nFurthermore, the senate body was briefed about the annual budget for Public Sector Development Program (PSDP) for the financial year 2023-24.\nOfficials of ANF apprised the committee that seven new projects including the Acquisition of Land for the Construction of the Rehab and Vocational Training Centre for Women and Children Drug Addicts Islamabad, the Construction of ANF Regional Directorate Islamabad, the Construction of an Additional Block on SM Barrack Korangi Karachi, Construction of ANF Regional Directorate Quetta, Construction of ANF Police Station Panjgur, Construction of ANF Special Investigation Cell Islamabad and Extension of ANF Academy Islamabad.",
  "retrievedAt": "2025-08-11T05:58:42.881Z"
}
