{
  "title": "Sci-tech Cooperation integral part of China-Pak bilateral relations: Chinese Charge d’ Affairs",
  "link": "https://www.app.com.pk/national/sci-tech-cooperation-integral-part-of-china-pak-bilateral-relations-chinese-charge-d-affairs/",
  "date_published": "2023-02-08T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP):Charge d’ Affairs of the Chinese Embassy to Pakistan, Pang Chunxue on Wednesday said that cooperation in Science and Technology (S&T) was an important part of the China-Pakistan bilateral relations and both countries had jointly funded more than 475 research projects covering agriculture, aerospace, and chemical industry.\nSpeaking at a ceremony held here to celebrate China-Pakistan Space Science & Technology Cooperation, she said remarkable results had been achieved since the two countries signed an intergovernmental S&T cooperation agreement in 1976.\nMoreover, many projects were also funded between both countries in the field of water resource protection, medical and health care, biotechnology, computer science, environment, energy, meteorology, geology, and technology management.\nShe said, “We are here to have the handover ceremony of Pakistani medicinal plant seeds after a six-month orbit stay in China Space Station. The Shenzhou XIV manned spacecraft was launched into space to conduct a scientific experiment in June 2022 and returned to the ground safely last December. This is the first ever that Pakistani plants were in space. The experiment will surely be recorded in the history of China-Pakistan friendship and a landmark of S&T cooperation.”\nPang Chunxue added that the bilateral S&T cooperation had also been included under the framework of the China-Pakistan Economic Corridor, which will surely provide strong support to the high-quality and sustainable development of CPEC.\nChina’s international S&T cooperation was committed to being open, shared, and inclusive. Space exploration was a common cause of mankind. China insists on conducting cooperation in space exploration based on equality, mutual benefit, peaceful use, and inclusive development, she added.\nCharge d’ Affairs also thanked the scientists of both sides for their joint efforts. She also appreciated the officials of the Ministry of Science and Technology of Pakistan, COMSTECH, and Pakistan Science Foundation for their contributions, and Ambassadors and representatives of COMSTECH member countries for joining us to witness this special occasion.\nCharge d’ Affairs of the Chinese Embassy, also highlighted that three months ago, when meeting with Prime Minister Shabaz in Beijing, Chinese President Xi Jinping expressed that China will further deepen synergy between its development strategies and those of Pakistan, and solidly promote cooperation in areas such as agriculture, science and technology, and people’s livelihood.\nThis event is another vivid example of implementing the consensus reached by the leaders of the two countries. Both countries are committed to building a closer China-Pakistan community with a shared future in the new era, she maintained.\nShe emphasized that China-Pakistan friendship needs to be passed on from generation to generation and “we are delighted to witness that Pakistani teenagers have interacted with Chinese astronauts by writing letters to them, with a Chinese astronaut responding via video. We firmly believe that this communication will surely help to light up the teenager’s space dreams”.",
  "retrievedAt": "2025-08-11T05:59:00.788Z"
}
