{
  "title": "Acrylic paintings by an autistic boy attract applause from visitors at art exhibition in NIC",
  "link": "https://www.app.com.pk/national/acrylic-paintings-by-an-autistic-boy-attract-applause-from-visitors-at-art-exhibition-in-nic/",
  "date_published": "2024-03-10T09:46:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 10 (APP): Acrylic paintings by an autistic boy attracted great applause from visitors who while highly appreciating the talent also expressed the desire of purchasing the drawings as decoration pieces.\nThe paintings were drawn by Muhammad Yousaf, a 12 years old boy with autism and hearing impairment.\nAutism Spectrum Disorder (ASD) is a complex neuro-developmental disorder that affects child’s communication, socialization and cognition. People with ASD often have problems with social communication, interaction, and restricted or repetitive behaviors or interests.\n“Yousaf has an innate inclination towards painting, sketch drawing and from the very early years of life, he is showing interest in drawing on white paper,” informs Yousaf mother.\nYousaf was a severely autistic boy, but dedicated efforts by her parents especially mother brought much improvement in his behavior and understanding.\nMost of the paintings were depiction of rainbow and some were abstract drawings in dark colors, shares Yousaf mother.\nShe said her son has not taken any training from anyone but his inborn penchant towards drawing made him as an amateur painter.\nYousaf also received a prize for his good paintings on last day of the exhibition and as a gesture of encouragement the participants of the event accorded him standing ovation.\n“Yousaf cannot speak but his facial expression expressed the feeling of excitement he had over receiving the prize and honor by people,” recalls her mother.\nShe thanked the organizers of exhibition for providing an opportunity to a special child for display of his talent and being a mother she is of the belief that this favor will help Yousaf a lot in his personality building and improvement of his interaction with people.\nShe said during display of paintings, head of Maskoora Art Academy in Peshawar extended offer of imparting training to Yousaf.\n“Painting is a medium through which Yousaf expresses his inner feelings and I am considering to avail the offer of Maskoora Art Academy for improving his skills,” she told APP.\nYousaf mother urged society members to cooperate with children with ASD for improvement in their behavior and making them able to stand on their feet.\nThe number of ASD children are increasing manifold in the country in general and Khyber Pakhtunkhwa in particular and rehabilitation of these children is a collective responsibility of society, she opined.\nShe complained of non-cooperative behavior by people whenever her child made a mistake in gatherings, public places, stores and even at mosque.\n“ASD children need care, love, politeness and forgiveness which should be realized by people,” she insisted.\nSimilarly, she continued, government should also give a serious consideration to provision of affordable and accessible rehabilitation services to patients with ASD because majority of parents are avoiding treatment due to high cost by private institutes.",
  "retrievedAt": "2025-08-11T01:13:40.840Z"
}
