{
  "title": "Central Ruet-e-Hilal Committee to meet on Monday for Ramazan moon sighting",
  "link": "https://www.app.com.pk/national/central-ruet-e-hilal-committee-to-meet-on-monday-for-ramazan-moon-sighting/",
  "date_published": "2024-03-10T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 10 (APP): The Central Ruet-e-Hilal Committee is set to convene on Monday for the holy month of Ramazan moon sighting at the office of Administrator Auqaf in Peshawar, under the chairmanship of Maulana Syed Muhammad Abdul Khabir Azad.\nThe meeting will witness the participation of esteemed members from both Central and Zonal Ruet-e-Hilal Committees, including Director General Syed Mushahid Hussain Khalid from the Ministry of Religious Affairs and Interfaith Harmony, Ghulam Murtaza from the Space & Upper Atmosphere Research Commission, Dr Sardar Sarfaraz from the Pakistan Meteorological Department, and Zainul Abedin from the Ministry of Science and Technology.\nAmong the distinguished members of the Central Ruet-e-Hilal Committee are Yasin Zafar, Allama Dr Muhammad Hussain Akbar, Mufti Faisal Ahmed, Qari Abdul Rauf Madani, Mufti Ali Asghar Attari, Mufti Yusuf Kashmiri, Mufti Zameer Ahmad Sajid, Pir Syed Shahid Ali Jilani, Maulana Abdul Malik Brohi, Maulana Ashraf Ali, Mufti Qari Mehrullah, Sahibzada Syed Habibullah Chishti, and Maulana Asad Zakaria Qasmi.\nRepresentatives from the Zonal Committee Peshawar include Maulana Ehsanul Haq, Maulana Mufti Fazlullah, Maulana Muhammad Ali Shah, Maulana Syed Abdul Basir Rostami, Allama Abid Hussain Shakri, and Mufti Atiqullah Qadri, along with other esteemed scholars.\nMaulana Syed Muhammad Abdul Khabir Azad emphasized that similar meetings of zonal committees across the country will be held at their respective headquarters in Lahore, Karachi, Quetta, and Islamabad to decide the moon sighting of the month of Ramazan 1445 AH.\nAzad appealed to all citizens of Pakistan to be vigilant in sighting the moon of Ramazan, expressing hope for a unified day of fasting for the country.\nHe also provided contact information for inquiries regarding moon sighting: Chairman (0321-9410041 / 0333-9100619), DG Religious Affairs (0300-6831822), and Office Administrator Auqaf Peshawar (091-9330427).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:14:00.548Z"
}
