{
  "title": "IIUI hosts closing ceremony of PM’s handball talent league for women",
  "link": "https://www.app.com.pk/national/iiui-hosts-closing-ceremony-of-pms-handball-talent-league-for-women/",
  "date_published": "2024-03-10T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): The International Islamic University (IIU) organized the closing ceremony of the Prime Minister’s Youth Talent Hunt Sports Handball (Women) Federal League in Collaboration with the Higher Education Commission (HEC) at Liaquat Gymnasium, Islamabad Sports Complex on Sunday.\nThe event, brought together teams from Islamabad, Skardu, Gilgit, Muzaffarabad, and Mirpur where students showcased exceptional talent and sportsmanship.\nIn a fiercely contested competition, Islamabad emerged victorious, clinching the first position, followed by Muzaffarabad in second place and Skardu securing third place. The winning teams were honoured with cash prizes, medals, and trophies, respectively, for their outstanding performances.\nGuests of honor of the ceremony was Afsheen Akhtar, Project Manager HEC. Sadia Saleem Cheema, Female Student’s Advisor and Incharge Sports & organizing Secretary Nadia Mukhtar were also present on the occasion.\nOrganizing Secretary Ms. Nadia Mukhtar, in her welcome note, thanked  HEC adding the Prime Minister’s initiative to promote sports among youth and giving them the platform to showcase their capabilities and talent providing bright stars to country.\nDr. Sadia Saleem appreciated players and their managers for actively participating in league.\nAs a token of appreciation, shields were presented to Guests of Honors and officials for their unwavering support throughout the league.\nIn a touching gesture, the HEC project managers extended their heartfelt gratitude to the IIU recognizing the invaluable contributions in ensuring the success of the event and nurturing the spirit of sportsmanship among the participating teams.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:14:02.033Z"
}
