{
  "title": "Women health awareness drive concludes at Maroof Int’l Hospital",
  "link": "https://www.app.com.pk/national/women-health-awareness-drive-concludes-at-maroof-intl-hospital/",
  "date_published": "2024-03-10T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): Maroof International Hospital (MIH) has concluded its month-long women’s physical and mental health awareness campaign.\nThe initiative was taken with an aim to educate and empower women across various sectors, including marginalized communities, educational institutions, corporate offices, and industrial areas, culminating on International Women’s Day, March 8.\nDr. Tahira Sadiq, Consultant Cardiologist at Maroof International Hospital, highlighted the alarming statistics of cardiovascular disease being the leading cause of death globally, with one out of three women succumbing to heart diseases.\nShe emphasized the significant risk factors, with 20 percent of women developing diabetes and hypertension during pregnancy, predisposing them to cardiovascular diseases later in life.\nMs. Rubina Afzal Corporate Head MIH said on the occasion that Maroof International Hospital remains committed to promoting women’s health and empowerment, advocating for holistic well-being and raising awareness on pertinent health issues affecting women globally.\nDr. Rubia Usman, Consultant Dermatologist, talked about the concerning prevalence of whitening creams worldwide, citing statistics from various countries.\nShe revealed that the percentage of individuals using whitening creams is alarmingly high.\nDr. Usman cautioned against the use of whitening creams and injections due to safety concerns, potential side effects like skin damage and organ problems, and perpetuation of harmful beauty standards.\nDr. Usman urged individuals to embrace natural skin tones and prioritize overall skin health through safe skincare practices, advising consultation with dermatologists for concerns about skin tone.\nDr. Rashid Khan, Head of the Psychiatry Department, emphasized the significance of mental health in women’s overall well-being.\nHe addressed common mental health issues faced by women, including stress, anxiety, and depression, and highlighted the importance of seeking professional help when needed.\nDr. Khan encouraged women to prioritize self-care activities, such as mindfulness, relaxation techniques, and maintaining social connections, to nurture their mental health.\nDr. Aliya Babar Hameed, Internal Medicine and Geriatric Specialist, emphasized the pivotal role men play in empowering women and provided insightful tips to support this cause.\nShe advocated for women’s holistic health, stressing the importance of regular exercise, balanced diet, and annual screenings for common diseases like Diabetes Mellitus, high blood pressure, high cholesterol, and specific conditions such as breast and cervical cancer.\nDr. Haseeb Shah, Head of the Physiotherapy Rehabilitation Department, enlightened industrial staff on office ergonomics, promoting better workplace health practices.\nHe emphasized the importance of proper desk posture, including adjusting chair height to ensure feet rest flat on the floor and maintaining a neutral spine position.\nDr. Shah also advised regular breaks to stretch and move around to prevent muscle stiffness and fatigue, as well as proper positioning of computer screens to reduce eye strain.\nMs. Nida Ashraf, Nutritionist MIH, provided valuable insights into balanced diets, particularly in the context of intermittent fasting.\nShe emphasized the importance of consuming a well-balanced diet, including whole grains, lean proteins, fruits, and vegetables, during eating windows in intermittent fasting schedules.\nMs. Ashraf advised avoiding deep-fried foods and reducing portion sizes to maintain overall health and weight management.\nThe event culminated in a staff cake cutting ceremony at the hospital, where the chief guest was Mrs. Naseer Ahmed, recognizing the collective efforts and dedication of all involved in promoting women’s health and empowerment",
  "retrievedAt": "2025-08-11T01:13:38.701Z"
}
