{
  "title": "FOSPAH conducts assessment of prison’s condition",
  "link": "https://www.app.com.pk/national/fospah-conducts-assessment-of-prisons-condition/",
  "date_published": "2023-06-15T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): Federal Ombudsperson for Protection against Harassment (FOSPAH) Fauzia Viqar Thursday conducted a comprehensive assessment of prison conditions and the treatment of prisoners during her visit to Central Jail at Kot Lakhpat, Lahore.\nThe primary objective of her visit was to ascertain if women prisoners were subjected to any form of harassment, torture, mistreatment, or abuse at the time of arrest, during police custody, and at the prison.\nAfter conducting meetings with police officials, prison authorities and, interacting with prisoners, she firmly concluded that no harassment or mistreatment was reported by women and that reports of sexual harassment were baseless, said a press release issued here on Thursday.\nDuring her visit, Viqar held productive discussions with the Inspector General of Police Punjab and, Inspector General of Prisons Punjab Mian Farooq Nazeer, to gain insights into the arrest and incarceration of women prisoners.\nIG Police Punjab informed the Ombudsperson about the various facilities of the 1787 complaint system, police protection centres, women’s safety app for victims of harassment and notified harassment inquiry committees to take up issues of harassment at the workplace by staff.\nShe was briefed by the IG Prisons about the complaint redressal system in place to address any grievances or complaints regarding mistreatment or abuse.\nOmbudsperson suggested some improvements in the CMS to get better gender-disaggregated data and improve access of women to complaints mechanisms in prisons.\nShe also inquired about harassment inquiry committees notified in the Prisons Department for prison staff if such mechanisms were available to women prisoners.\nViqar interacted directly with the women prisoners to specifically inquire about their experiences of harassment, torture, mistreatment, or abuse at various stages of the criminal justice process.\nThe comprehensive interviews and discussions with the inmates revealed that there were no substantiated claims of mistreatment, torture, or sexual abuse.\n“I took these media-reported allegations very seriously and made it a priority to investigate the matter thoroughly. The interactions I had with the women prisoners themselves and with prison officials provided no evidence of mistreatment. It is essential that we rely on factual information and ensure the safety of women in prisons. Clear standards for dignified and humane treatment of women prisoners are provided in the Pakistan Prisons Rules, 1978 and I wanted to ensure that those standards were being met” said Viqar.\nSome prisoners informed Viqar that they had not had family visits or access to their lawyers was denied.\nShe took this matter up with the prison administration who informed her that family visits and telephone calls are allowed after judicial remand and clearance of provided phone numbers.\nShe urged prison officials to expedite the process under the Rules and law to ensure the well-being of women prisoners.",
  "retrievedAt": "2025-08-11T08:43:14.787Z"
}
