{
  "title": "UNICEF call for efforts to protect refugee, internally displaced children",
  "link": "https://www.app.com.pk/national/unicef-call-for-efforts-to-protect-refugee-internally-displaced-children/",
  "date_published": "2023-06-14T19:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):United Nations Children’s Fund (UNICEF) on Thursday said that the number of children forcibly displaced from their homes doubled in the last decade, outpacing efforts to include and protect refugee and internally displaced children.\nThe war in Ukraine has forced more than 2 million Ukrainian children to flee the country and displaced more than 1 million children inside Ukraine.\n“For more than a decade, the number of children forced to flee their homes has risen at an alarming rate, and our global capacity to respond remains under serious strain,” said UNICEF Executive Director Catherine Russell. “The increase is in step with the consistent onslaught of conflict, crises and climate disasters around the world. But it also highlights many governments’ underwhelming response to ensure every refugee and internally displaced child can keep learning, stay healthy and develop to their full potential.”\nOf the 43.3 million children who were forcibly displaced by the end of 2022, almost 60% (25.8 million) were internally displaced by conflict and violence. The number of refugee and asylum-seeking children also hit a new record of 17.5 million, a number that does not even include those newly displaced in 2023, including by the conflict in Sudan. UNICEF estimates more than 940,000 children have been displaced because of the conflict to date. In addition, extreme weather events, such as the Pakistan floods and the Horn of Africa drought, led to another 12.0 million displacements of children over the course of 2022.\nInternally displaced and refugee children are often amongst the most vulnerable. Many are denied access to education and health care, miss out on routine immunisation and cannot access social protection.\nFor many children, displacement is becoming increasingly protracted. Most children displaced today will spend their entire childhoods in displacement. Climate-induced displacement is expected to increase rapidly without urgent action to mitigate global warming and prepare communities living on the frontline of the climate crisis.\n“Greater political will is required to address the drivers of displacement and provide long-term solutions for children on the move,” said Russell. “A record number of refugee, migrant and displaced children – a global population that rivals that of Algeria, Argentina or even Spain – demands a commensurate response. We have seen sustained change when governments properly invest in the inclusion of displaced children and families. By working together, we can keep them safe, healthy, learning and protected.”\nUNICEF is calling on governments to leave no child behind by:",
  "retrievedAt": "2025-08-11T08:43:37.136Z"
}
