{
  "title": "Shazia Marri for int’l collaborations to protect vulnerable segments from climate change impacts",
  "link": "https://www.app.com.pk/national/shazia-marri-for-intl-collaborations-to-protect-vulnerable-segments-from-climate-change-impacts/",
  "date_published": "2023-06-15T15:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): Federal Minister and Chairperson, Benazir Income Support Programme (BISP), Shazia Marri Thursday reiterated Pakistan’s commitment to address the climate crisis and advocated for international collaboration to protect vulnerable nations from the impacts of climate change.\nShe was speaking at the closing session of the “Global Forum on Adaptive Social Protection: Protecting lives and livelihoods in times of crisis” held in Berlin.\nShe acknowledged the vulnerability of Pakistan to climate shocks, citing recent devastating floods and the ongoing threat of a cyclone hitting the country and neighboring India.\nIn her talk to the audience, Shazia Marri shed light on the climate vulnerability faced by Pakistan.\nThe country has experienced devastating floods in the past, including in 2010, 2011, 2022, and most recently this year.\nDuring the recent floods, approximately 33 million people were displaced, with 6000 pregnant women directly affected.\nHowever, the incumbent government, through the Benazir Income Support Programme, successfully distributed cash assistance to those affected by the recent floods, she said.\nHighlighting the significance of coordination, Shazia Marri emphasized that BISP was working closely with provincial setups on social safety initiatives to maximize the benefits provided to the targeted segments of society.\nShe expressed willingness to share Pakistan’s experiences with the representatives of the 58 countries present at the forum, showcasing the country’s commitment to global collaboration for social protection.\nThe minister informed the audience about the National Socio-Economic Registry (NSER), which served as a comprehensive database of over 35 million households in Pakistan.\nThe NSER enables BISP to gather essential data and add layers of information to enhance the targeting of beneficiaries, ensuring that the adaptive social protection programme is more effectively tailored to the needs of the potential beneficiaries.\nAdaptive Social Protection was the way forward to deal with all sorts of shocks, she said.\nShazia Marri expressed gratitude to the government of Germany, specifically Minister Schulz, and other partners, including the World Bank and GIZ, for organizing the event.\nThe closing session was moderated by Ms. Conny Czymoch, Independent international moderator and journalist.\nOther speakers, inter alia, included Ms. Svenja Schulze Federal Minister for Economic Cooperation and Development, BMZ; Ms. Esther Schüring, Social Protection Advisor, GIZ; Mr. Colin Andrews, Program Manager, World Bank; Mr. El Hadji Ndiogou Diouf.",
  "retrievedAt": "2025-08-11T08:43:16.673Z"
}
