{
  "title": "Ahsan Iqbal launches data portal for PSDP projects",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-launches-data-portal-for-psdp-projects/",
  "date_published": "2023-06-15T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): Federal Minister for Planning Development and Special Initiatives, Professor Ashan Iqbal on Thursday officially launched Pakistan’s pioneering PSDP portal.\nFor the first time in the country’s history, the data of Public Sector Development Programme (PSDP) projects (ongoing and previous year) worth Rs 1.1 trillion has been made available at the PSDP portal which has been formally launched on Thursday for the citizens to ensure transparency.\nThe event was attended by the Additional Secretary Planning Ministry, Members Planning Commission, the Chairman of Pakistan Space & Upper Atmosphere Research Commission SUPARCO and other stakeholders, said a press release issued here.\nIt is noted that the PSDP, which constitutes the Federal Development Budget, serves as a crucial framework for the government’s development agenda, setting sectoral and regional priorities under the national plan.\nThis strategic move aims to harness the potential of digital technologies to enhance transparency, improve governance, and promote public awareness of the government’s development course and priorities.\nThrough the digital platform, citizens will have greater insight into the development projects being undertaken across the country.\nIt enables them to understand the objectives, scope, and impact of each project, promoting public engagement and participation\nAhsan Iqbal termed this initiative a ‘landmark’ in the country’s history which will ensure transparency in the PSDP projects while engaging the citizens directly through this portal.\n“The initiative will help to eliminate the trust deficit between the state and citizens which remained weak in the past, remarked the minister, while highlighting several initiatives taken by the incumbent government since it came into power in April 2020.\nThe Planning Ministry has recently launched ‘5Es framework for the country’s development while focusing on Exports, Energy E- Pakistan, Environment and Equity. This vital step towards digitalization aligns with the vision of e-Pakistan under the ‘5Es Framework to Turnaround Pakistan’ and underscores the commitment of the Planning Ministry to leverage technology for the betterment of our nation,” remarked the Minister.\nMember Governance, Innovation & Reforms at Planning Commission, Dr Adnan Rafiq who took this initiative, under the vision of Planning Minister Ahsan Iqal highlighted the key features of the project.\n“The portal displays data on all ongoing PSDP Projects which are also accessible to every citizen as the Ministry has already established a Champions of Reforms Network to seek input from citizens in reviewing and evaluating project proposals under PSDP,” explained Dr Rafiq.\nIt is noted that the online portal provides an interactive map interface, allowing users to visualize the geographical spread of projects. The users can search for projects by location, view project profiles, and gain a comprehensive understanding of the development initiatives in specific areas.\nChairman SUPARCO Maj General Amer Nadeem while appreciating the Planning Ministry for taking this important step believed that space technology and its applications play a pivotal role in achieving national development goals worldwide.\n“Geospatial technologies are a powerful tool that has the potential to revolutionise the way we make decisions, thereby saving time and resources and inspiring transparency, ” he added.",
  "retrievedAt": "2025-08-11T08:43:24.073Z"
}
