{
  "title": "Saudi govt launches bid to facilitate Hajj journey for Yemeni pilgrims",
  "link": "https://www.app.com.pk/national/saudi-govt-launches-bid-to-facilitate-hajj-journey-for-yemeni-pilgrims/",
  "date_published": "2023-06-15T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): In a significant move aimed at supporting the brotherly people of Yemen, the Ministry of Hajj and Umrah has announced the launch of a bid by the Saudi government to facilitate the Hajj journey and ensure the safety and security of Yemeni pilgrims.\nAccording to SPA, this initiative seeks to alleviate the suffering of the Yemeni people, help them realize their hopes and aspirations for peace, development, and prosperity, and address the needs of Yemeni residents in various regions of the country.\nTo enable the smooth performance of Hajj and Umrah events, a decision has been made to allow Yemeni pilgrims to arrive at the King Abdulaziz International Airport in Jeddah, departing from the Sanaa International Airport. This measure mirrors the procedures implemented at other land and air border crossings with Yemen.\nThis effort reflects Saudi Arabia’s ongoing commitment to facilitating Hajj for Yemenis who wish to travel through the Sanaa International Airport. It aligns with the continuous efforts and initiatives of the Ministry of Hajj and Umrah to facilitate the performance of Hajj and Umrah for pilgrims from all Arab and Islamic countries.\nThe Ministry of Hajj and Umrah emphasized its dedication to ensuring the safety and security of all pilgrims, including those from Yemen, during their sacred journey. By enabling Yemeni pilgrims to participate in this year’s Hajj and Umrah, the Saudi government aimed to extend a helping hand and support the Yemeni people in their spiritual endeavours.\nThis initiative stands as a testament to the longstanding bond between Saudi Arabia and Yemen, highlighting the Kingdom’s commitment to fostering unity and solidarity within the Muslim community. It also underscores Saudi Arabia’s unwavering dedication to upholding the principles of peace, development, and prosperity among its neighbouring countries.\nAs the preparations for this year’s Hajj pilgrimage are underway, the Ministry of Hajj and Umrah remained committed to implementing effective measures and comprehensive arrangements that guarantee the comfort, well-being, and spiritual fulfilment of all pilgrims, ensuring a memorable and rewarding experience for everyone involved.",
  "retrievedAt": "2025-08-11T08:43:12.854Z"
}
