{
  "title": "Senators call for Charter of Economy to steer country out of economic crisis",
  "link": "https://www.app.com.pk/national/senators-call-for-charter-of-economy-to-steer-country-out-of-economic-crisis/",
  "date_published": "2023-06-15T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP):Senators on Thursday stressed the need for enhancing the country’s revenue, besides inking the Charter of Economy (CoE) like Charter of Democracy (COD) to steer Pakistan out of the economic crisis.\nThey appreciated the government for announcing various incentives for the agricultue and information technology sectors, overseas Pakistanis and youth.\nTaking part in the debate in the Senate, Saifullah Abro of the Pakistan Tehreek-e-Insaf (PTI) said there were so many opportunities available in the country which could help generate revenue. The Guddu Thermal and Lakra Thermal power plants could be rehabilitated with limited funds and could earn hefty revenue for the country, he added.\nHowever, he alleged that the power sector was intentionally destroyed by representatives of Independent Power Producers (IPPs) setting in the every government. Such ‘mafias’ had vested interests and they never wanted rehabilitation of state-owned thermal powers, he added.\nSenator Abro suggested that the government should allocate Rs 2.5 billion for the purchase of CT scan and MRI machines in two government own cancer hospitals in Larkana and Nawabshah from the Benazir Income Support Programme (BISP) Rs 450 billion allocation. Many poor patients from both Sindh and Balochistan visited the two hospitals for their treatment, he added.\nHe was of the view that many lawmakers did not discuss the budget rather they resorted to criticizing their opponent political leaders.\nNuzhat Sadiq of the Pakistan Muslim League-Nawaz termed the budget balanced challenging circumstances. She said 30 to 35 per cent raise in the salaries and 17.5 per cent in the pensions of government employees was a big relief for them, she added.\nNuzhat said the government had also announced special incentives for overseas Pakistanis. Despite financial hardships, no new tax was imposed in the budget to give maximum relief to the masses, she added.\nShe said similarly incentives were also announced for the IT and agriculture sectors. All customs duties had been abolished on the solar related equipment for the promotion of the solar energy in the country, she added.\nNuzhat Sadiq said the PML-N government had launched the PM’s Youth Programme in 2013 and now small loans were also announced for the youth for establishing their own business.\nCondemning the 9th May riots, she said public and historical properties like the Jinnah House and Radio Pakistan Peshawar were burnt, besides attacks other sensitive installations by the miscreants, who should be taken to task.\nShe commended the coalition government for taking pragmatic measures to steer the country out of the crisis.\nImamuddin Shouqeen of the Pakistan Peoples Party Parliamentarians (PPPP) said industry should be revived to generate revenue and end dependence of import. It was need of the hour to provide cheap electricity and gas to the industries, he added.\nHe said solarization of 50,000 tube-wells, import of duty-free seed, Rs 450 billion allocation for the BISP and Baitul Maal, loans for youth etc were some steps to bring real change in the lives of poor masses.\nHe said the last PTI government doubled the national debt and record loans were obtained during its tenure. The circular debt which was Rs 1,148 billion, had jumped to Rs 2,400 billion during the said period, he added.\nThe legislator said the PTI violated the agreement made with the International Monetary Fund and other lenders which resulted in trust deficit. Despite so many challenges, no new tax was imposed except on few luxury items, he added.\nHe also criticized the PTI government for not bringing any economic reforms during its tenure.\nHe said the government had also announced targeted subsidy and Rs 35 billion had been specified for the Utility Stores Corporation for the provision of essential items at subsidized prices.\nHe said all political parties should join hands for CoE like CoD inked by former prime ministers Nawaz Sharif and Shaheed Benazir Bhutto for strengthening of the democracy.\nTaking part in the debate, Pashtoonkhwa Milli Awami Party’s Senator Sardar Muhammad Shafiq Tareen on Thursday shed light on the challenges faced by the agriculture sector in Balochistan after recent flash floods and intermittent rains.\nHe appreciated the government’s allocation of significant funds for the solar system programme in Balochistan. However, he urged the government to prioritize converting provincial tube-wells to solar energy, aiming to alleviate the burden on impoverished farmers.\nSenator Tareen expressed disappointment in the previous government’s Southern Balochistan Scheme, which failed to secure any funds for its execution, denying positive outcomes to the common people in the region.\nHe emphasized the need for effective implementation of development programmes to address the pressing issues faced by the people of Balochistan.\nAwami National Party’s Senator Haji Hidayatullah Khan commended the finance team led by Senator Ishaq Dar for presenting a balanced budget during the critical times.\nHe suggested a far-sighted approach to provide financial relief to government employees, including an increase in pensions and wages to counter the inflation rate.\nSenator Khan proposed granting 200 free electricity units to consumers in Khyber Pakhtunkhwa who had suffered significant financial losses during the war on terror.\nHe also advocated for a five-year tax exemption for the business community in Malakand Division, highlighting their contributions to the local economy.\nAddressing the issue of interest-based systems in financial institutions, he urged the government to take substantial steps to eliminate the from the financial sector.\nBalochistan Awami Party’s Senator Danesh Kumar expressed dissatisfaction over neglecting the proposals of the Upper House for improving the budget by the government. He urged the Chair to uphold the sanctity and privilege of the august House on that count.\nSenator Kumar criticized the government for increasing the national debt in the current fiscal budget and called for a review of the defence budget, emphasizing its importance for Pakistan’s security and sovereignty.\nHighlighting the lack of attention given to development projects in Balochistan, he shed light on the challenges being faced by the province since 2017.\nHe also raised concerns about the non-allocation of funds for minority communities in the budget, urging the government to address the issue.\nPPPP Senator Bahramand Khan Tangi strongly condemned the May 9 tragic incidents, saying the “goons of Pakistan Tehreek-e-Insaf (PTI)” had tarnished Pakistan’s image globally.\nHe alleged that the PTI leadership orchestrated attacks on key installations, including the core commander’s house in Lahore, Pakistan Radio’s building in Peshawar, and Pakistan Air Force’s aircraft in Mianwali.\nHe called for stern action against the culprits and the masterminds behind the incidents.\nSenator Tangi dismissed opposition’s claims about the budget, terming it pro-poor.\nHe urged the government to focus on expanding the tax network instead of burdening the people with more taxes. Additionally, he proposed categorizing the sale of petrol and diesel to alleviate the financial strain on the disadvantaged segments of society.",
  "retrievedAt": "2025-08-11T08:43:18.215Z"
}
