{
  "title": "Cyclone ‘Biparjoy’ potent threat to the vulnerable communities : Sherry",
  "link": "https://www.app.com.pk/national/cyclone-biparjoy-potent-threat-to-the-vulnerable-communities-sherry/",
  "date_published": "2023-06-15T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): Federal Minister for Climate Change and Environmental Coordination Senator Sherry Rehman on Thursday said the very severe cyclonic storm (VCSC) ‘Biparjoy’ of category-3 had observed a decline in its intensity but its density prevailed due to emerging weather conditions posing a potent threat to the vulnerable communities.\nThe federal minister flanked by Chairman National Disaster Management Authority (NDMA) Lieutenant General Inam Haider Malik provided the latest update on the VSCS BIPARJOY to the media here.\nSenator Rehman said the cyclone’s direction had changed from Karachi but its associated risks were prevailing in the impacted areas.\n“The water level rise, rainfall, and storm alerts had already been issued whereas the four districts that would probably face the impacts are Thatta, Sujawal, Badin, and Keti Bandar.”\n“There is a shift in the direction of ‘Biparjoy’ and landfall will take place at night. However, there are 17 different weather stations monitoring the situation and providing the most updated information,” she noted.\n“The distance of the cyclone was almost 235 kilometers (km) from Thatta and it had reduced from 248 km to 230km fromKarachi, which was 155 km away from Keti Bandar has a wind speed of 120-140 km/h,” she added.\nThe Minister added that the sustained surface wind speed was varying. Some 30 feet high waves could rise in the coastal areas and the local people have to stay alert.\n“The cyclone is moving from north to northeast. However, heavy rainfall is expected to take place around 100mm in Karachi, Hyderabad, Dadu, Tando Allah Yar, Tando Mohammad Khan, Sanghar,” she said.\nMoreover, in Balochistan Lasbela, and Hub would also face the predicted rainfall. However, Thatta, Sujawal, Umerkot, Badin and Tharparkar were to face very extreme rainfall of up to 300mm, she added.\n“The government preparations have been made and were prepared to manage the natural disaster,” she said.\n“The evacuation of around 81,925 people have been carried out from the coastal areas by Army, Navy, PMSA, Rangers, and other services during the process.”\nShe informed that Five Corps, 16 companies of Ranges, 1,400 soldiers, and 303 Pakistan Navy personnel were deployed in the field along with two battalions of Coast Guards whereas the Pakistan Air Force was kept standby to chip in the relief and rescue effort.\nThe government of Sindh was taking an effective lead in the process whereas all out efforts had been made to comfortably evacuate the masses from the impacted areas.\n“However, public resistance is natural and it’s not a crime but rather there is a need to inform people to cooperate in this situation,” she added.\nChairman, NDMA Lieutenant General, Inam Haider Malik said, the spread of the cyclone was towards north and north-east and its speed had declined to 130-150km/h.\n“The cyclone’s impact has been delayed but its intensity remained consistent.”\nThe Army and Rangers had successfully carried out an evacuation of people that around about 82,000 and had continued till late at night.\n“As many as 169 relief camps including 100 standby facilities have been established whereas each camp has the capacity to accommodate 7,000 to 8,000 people,” he added.\nThe NDMA Chairman informed that the government of Pakistan and Sindh government had ensured all facilities including food, ration, first aid kits, and water at the relief camps.\nHe added that the present trajectory of the cyclone would be reviewed in the evening.",
  "retrievedAt": "2025-08-11T08:43:30.650Z"
}
