{
  "article_id": "2025-05-17_8457dbdcb256587ca07e20887614ef93",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/indias-river-chenab-diversion-sparks-water-war-fears-in-pakistan/",
    "retrieved_at": "2025-08-27T15:34:33.574Z"
  },
  "metadata": {
    "title": "India’s River Chenab diversion sparks ‘water war’ concerns in Pakistan",
    "author": null,
    "date_published": "2025-05-17T15:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 542,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "LAHORE, May 17 (APP):In a provocative move widely seen as a form of 'hydrological warfare', India has accelerated work on a controversial river-linking project aimed at diverting the flow of River Chenab to the Beas and Ravi rivers, raising grave concerns in Pakistan about its future water security. Water experts and regional analysts have denounced the project as a blatant violation of international norms and the spirit of the Indus Waters Treaty (IWT). The planned diversion, if completed, could drastically reduce Pakistan's access to Chenab's waters, severely impacting agriculture, ecology, and downstream communities. Renowned water resources expert Engineer Arshad H. Abbasi warned that the River Chenab faces an existential threat due to India's proposed Gyspa Dam, which aims to divert the river's flow towards the Beas River. He urged the Government of Pakistan to act immediately to safeguard national water interests. According to reports published by the Kashmir Media Service, the project - first introduced in India's 2011-2012 budget - includes a 23-kilometre concrete tunnel connecting Chenab to the Solang Nullah, which flows into the Ravi River. This would enable India to reroute water towards the Ranjit Sagar Dam. The initiative has been condemned as a direct affront to the Indus Waters Treaty, a landmark water-sharing agreement signed in 1960 between India and Pakistan under the auspices of the World Bank. The treaty grants India control over the eastern rivers-Beas, Ravi, and Sutlej, while Pakistan retains rights to the western rivers-Indus, Jhelum, and Chenab. On April 23, 2025, in the aftermath of the Pahalgam incident, India unilaterally announced the suspension of the treaty, citing national security and accusing Pakistan of supporting terrorism. In response, Pakistan launched a swift and decisive diplomatic and military rebuttal to India's provocative action. Experts, however, maintain that India does not hold the legal authority to suspend or terminate the treaty unilaterally. Former IRSA member Rao Irshad Ali Khan stated that the IWT remains an internationally recognised and binding agreement. \"Under Article 12(4), termination is only possible through the written consent of both parties. India cannot abrogate it unilaterally,\" he stated. Khan also warned that if India attempts to defy the treaty, it would raise serious questions about its commitment to other international agreements. Senior politician and former senator Mushahid Hussain Sayed echoed similar concerns, stating that India's unilateral suspension of the IWT is \"legally indefensible\" and violates international law. \"India is using the Pahalgam incident as a cover to pursue a long-standing agenda of water aggression against Pakistan,\" he said. He urged the Pakistani government to raise the issue at the United Nations and with the World Bank, the treaty's guarantor. Mushahid added that the IWT had survived multiple wars and diplomatic crises over the decades, underscoring its strength and legitimacy. \"India's bypassing of treaty mechanisms - such as the Permanent Indus Commission, neutral experts, and arbitral tribunals - undermines the foundational principles of international cooperation,\" he warned. Adding to environmental and strategic concerns, Chenab - often called the Moon River - flows only 130 kilometres through Himachal Pradesh, covering just 7,500 square kilometres of its total 61,000 square kilometre basin. Despite this, 49 hydropower projects are reportedly under construction on the river within Indian territory, putting immense ecological and geopolitical strain on an already fragile system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}