{
  "title": "Developing countries under Pakistan’s chair successfully achieve “Loss and Damage” fund: FM",
  "link": "https://www.app.com.pk/national/developing-countries-under-pakistans-chair-successfully-achieves-loss-and-damage-fund-fm/",
  "date_published": "2022-12-28T13:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP): Foreign Minister Bilawal Bhutto Zardari has said that the creation of “Loss and Damage” fund under Pakistan’s chairmanship at the UN Climate Change Conference (COP27), in Egypt, last month to support the climate disasters hit countries, was a significant achievement.\nThe foreign minister, referring to the establishment of the fund, said that it was something that climate activists had been struggling for the last 30 years and he was proud that it was achieved under Pakistan’s chair of the G77.\nIn an interview with the Arab News, the foreign minister said that he felt that they had managed to achieve some common ground through the language incorporated in loss and damage.\nObviously, the foreign minister said there were different perspectives as the developing world felt that their carbon footprint was smaller, they had not contributed as much as the developed world to this crisis.\n“The agenda, or the aspiration of the G77, is exactly that. We represent the aspirations of the developing world,” the foreign minister said.\nHe said the ‘Loss and Damage’ fund was a demonstration of developing nations wielding collective strength when they had a common cause, adding “I think we were very successful in creating that consensus.”\nThe foreign minister said time and time again, the G77 had come together to take unanimous decisions, consensus decisions. Every meeting that he chaired had an outcome document.\n“I tend to believe that there’s far more that unites us than divides us. And we should seek common ground, areas in which we can work together, rather than find areas where we disagree,” the foreign minister opined.\n“We need to look at this, not just as the developed world needing to give compensation or reparations to the developing world, but as a more practical approach, a more realistic approach, that we have to work together,” he added.\nForeign Minister Bilawal further stressed that the global south and the global north have to work together. The developing world and the developed world have to work together.\n“Climate justice, climate catastrophe, knows no boundaries, does not care whether you’re rich or poor, whether you contributed to climate change much or you didn’t,” the Arab News quoted the foreign minister as saying.\n“Wherever we look we see climate catastrophes catching up to us and we have to work together to address this issue,” he added.",
  "retrievedAt": "2025-08-11T16:04:25.092Z"
}
