{
  "title": "PTI not serious in returning to NA: Sherry Rehman",
  "link": "https://www.app.com.pk/national/sherry-slams-pti-leadership-for-downplaying-bilawals-advise-on-return-to-assembly/",
  "date_published": "2022-12-28T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said that it was the Pakistan Tehreek-e-Insaf (PTI) leadership who were not serious in returning to the National Assembly.\nThe minister, in a series of tweets, said that it was not the government but the PTI itself which was demonstrating non-seriousness. Accusing the government of being non-serious was contrary to the facts as it had never advised the PTI to dissolve or quit the assemblies.\nApparently referring to a statement of PTI Vice President Shah Mehmood Qureshi, she said he (Qureshi) had testified that the PTI members were willing to return to Parliament and play their due role. However, it seemed that the “ego of a person” impeded them to do so.\nThe foreign minister (Bilawal Bhutto) represented the Federal Government and the reaction of the PTI leader to his advice [returning to the NA] reflected the party’s non-seriousness, the minister added.\nShe wondered whether the PTI leaders would hold the government responsible for the arbitrary decisions of Imran Khan.\n“You are sitting outside the National Assembly, you have announced the dissolution of the provincial assemblies (KP and Punjab), and your members are not allowing the Senate session to continue. Is this your serious parliamentary politics?”\nIf the PTI were interested in serious parliamentary politics, it would have reconsidered the offer of the foreign minister, she added.\nIt may be added that Foreign Minister Bilawal Bhutto Zardari, while addressing a public gathering, in connection with Benazir Bhutto’s martyrdom anniversary in Garhi Khuda Bakhsh on Tuesday, advised the PTI chief to return to the Parliament for representing their voters.",
  "retrievedAt": "2025-08-11T16:04:21.659Z"
}
