{
  "title": "President upholds order to grant COVID Health Risk allowance to 37 employees of NIRM, FGSH",
  "link": "https://www.app.com.pk/national/president-upholds-order-to-grant-covid-health-risk-allowance-to-37-employees-of-nirm-fgsh/",
  "date_published": "2022-12-28T07:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP): President Dr Arif Alvi has upheld the orders of the Wafaqi Mohtasib (WM) to grant COVID Health Risk Allowance to 37 employees of the National Institute of Rehabilitation Medicines (NIRM) and Federal Government Services Hospital (FGSH) who had been deprived of the allowance earlier as being declared non-clinical.\nThe president gave this decision while rejecting a representation of the Ministry of National Health Services, Regulations and Coordination (the Agency) against the order of the Mohtasib recommending it to move a fresh summary to the Prime Minister Secretariat for grant of risk allowance to the complainants.\nThe president in his decision observed that in August 2021, the Agency had provided funds to Federal Government Hospitals/entities to grant COVID Health Risk Allowance to clinical staff and that the Federal Government Polyclinic Postgraduate Medical Institute, Islamabad was also one of the beneficiaries of the fund.\nHe observed that in 2020, all employees were given COVID Risk Allowance, however, in 2021, 37 employees were deprived of the allowance as being declared non-clinical.\nHe noted that the Executive Director had recommended the Agency to grant the allowance to the remaining 37 employees as all clinical and non-clinical staff worked in the same risky environment, and were equally vulnerable and exposed to infection without any exception.\nThe president, in his decision, further highlighted that it was a reality that both clinical and non-clinical employees in the hospital were vulnerable and performing duties within the same premises and environment without any exception.\nHe rejected the Agency’s view that the hospital staff had to work in a vulnerable environment usually, that it was the nature of their job, and that they were already drawing some exclusive allowances.\nHe also rejected the view that only the clinical staff were actively engaged by the hospital administration in various COVID-19 units during the pandemic.\nAs per details, Maqbool Ahmad and others (the complainants) had lodged a complaint with WM that during the COVID-19 pandemic, they kept on performing their duties despite their vulnerability and risk of lives on the directions of the Heads of their Departments along with so many others.\nAccording to them, COVID Risk Allowance was paid to a number of employees who performed duties like them but they were discriminated against by being declared as non-clinical staff whereas both the clinical and non-clinical employees performed duties in their hospitals while being equally vulnerable to infection. Feeling aggrieved they approached the Mohtasib who passed the orders to grant the allowance to the complainants.\nThe Ministry of Health, then, filed a representation to the President against the decision of WM. The President rejected the representation of the Agency and upheld the orders of the WM as maladministration on behalf of the Agency was established on the above-mentioned grounds.",
  "retrievedAt": "2025-08-11T16:04:27.350Z"
}
