{
  "title": "18th Int’l Electrophysiology Conference “Rhythm for Life 2022” kicks off at AFIC",
  "link": "https://www.app.com.pk/national/18th-intl-electrophysiology-conference-rhythm-for-life-2022-kicks-off-at-afic/",
  "date_published": "2022-06-04T08:02:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 4 (APP): The inaugural session of 3-day long 18th International Electrophysiology Conference “Rhythm for Life 2022” was held on Saturday at Armed Forces Institute of Cardiology.  Surgeon General of Pakistan Lieutenant General Nigar Johar was the chief guest on the occasion.\nApart from Cardiac electrophysiologists  from civil military departments renowned subject specialist from various parts of the world including UK, Turkey, Azerbaijan, Qatar, KSA and USA are attending the conference, said an Inter Services Public Relations (ISPR) news release.\nThe convener of the conference Head of Cardiac Electrophysiology Department AFIC Brigadier Professor Azmat Hayat welcomed the participants during the inaugural session.\nIn his welcome address, he spoke about cardiac electrophysiology, the complexities of heart rhythm disorders and the treatment options which were available and improving day by day.\nBrigadier Azmat Hayat pointed out that this complex novel subspecialty of cardiology was rapidly evolving and AFIC was the leading institute of the country and front runner in introducing all the new technologies. “Some of the electrophysiology procedures have more than 97% success rate and eradicating the arrhythmia (an irregular heartbeat) significantly”, he underlined.\nFor the first time, efforts were made to show online proceedings of the conference so that maximum specialist could benefit from valuable insights and learn best practices shared by the experts of various countries.\nOver 2,000 patients recovered after successful treatment at AFIC because of eradication of arrhythmias, the forum was briefed.\nThe inaugural ceremony was also addressed by Professor Jaswinder Singh Gill, Professor Emirates Guy’s and St. Thomas Hospital London UK who thanked the organizers for inviting him and was attending the conference from the last 18 years. He also spoke about the importance of the electrophysiology and understanding of arrhythmias.\nThe conference was also addressed by Public Health Scotland Professor, Mahmood Adil who spoke about the role of the public health and the digital health in the field of medicine.\nThe inaugural ceremony was also addressed by Head of Pakistan Cardiac Electrophysiology Society, Professor Azam Shafqat.\nDuring the session, Surgeon General Lieutenant General Nigar Johar, delivered the Chief Guest addressed. She also emphasized the importance of electrophysiology, the growing needs and demands of this specialty and the enthusiastic participation and contribution of the electrophysiology in the country as whole and the military in specific.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:01:56.383Z"
}
