{
  "title": "UN chief calls for protection of ‘richness, diversity of life on Earth’, on World Environment Day",
  "link": "https://www.app.com.pk/national/un-chief-calls-for-protection-of-richness-diversity-of-life-on-earth-on-world-environment-day/",
  "date_published": "2022-06-04T18:51:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Jun 04 (APP): UN Secretary-General Antonio Guterres has warned that the Earth’s natural systems “cannot keep up with our demands”, saying the planet’s health must be safeguarded.\n“This planet is our only home”,  he said in his message for World Environment Day, to be marked on Sunday.\n“It is vital we safeguard the health of its atmosphere, the richness and diversity of life on Earth, its ecosystems and its finite resources.  But we are failing to do so,” said the UN chief.\n“We are asking too much of our planet to maintain ways of life that are unsustainable,” he cautioned, noting that this not only hurts the Earth, but also its inhabitants.\nSince 1973, the day has been used to raise awareness and generate political momentum around growing environmental concerns, such as toxic chemical pollution, desertification and global warming.\nIt has since grown into a global action platform, helping to drive change in consumption habits, as well as in national and international environmental policy.\nBy providing food, clean water, medicines, climate regulation and protection from extreme weather events, Guterres reminded that a healthy environment was essential for the people and the Sustainable Development Goals (SDGs).\n“It is essential that we wisely manage nature and ensure equitable access to its services, especially for the most vulnerable people and communities,” Guterres underscored.\nMore than three billion people are affected by degraded ecosystems. Pollution causes some nine million premature deaths each year, and more than one million plant and animal species risk extinction – many within decades, according to the UN chief.\n“Close to half of humanity is already in the climate danger zone – 15 times more likely to die from climate impacts such as extreme heat, floods and drought,” he said, adding that there was a 50:50 chance that global temperatures would breach the Paris Agreement limit of 1.5 in the next five years.\n“And by 2050, more than 200 million people each year risk displacement through climate disruption. When world leaders came together 50 years ago at the UN Conference on the Human Environment, they committed to protecting the planet.\n“But we are far from succeeding.  We can no longer ignore the alarm bells that ring louder every day,” warned the top UN official.\nThe recent Stockholm+50 environment meeting reiterated that all 17 SDGs rely on a healthy planet to avert the triple crises of climate change, pollution and biodiversity loss.\nHe urged the governments to prioritize climate action and environmental protection through policy decisions that promote sustainable progress.\nThe Secretary-General outlined recommendations to activate renewable energy everywhere by making renewable techologies and raw materials available to all, cutting red tape, shifting subsidies and tripling investment.\n“Businesses need to put sustainability at the heart of their decision-making for the sake of humanity and their own bottom line.  A healthy planet is the backbone of nearly every industry on Earth,” he said.\nHe advocated for the empowerment of women and girls as “forceful agents of change”, including in decision-making at all levels. “And upheld the usage of indigenous and traditional knowledge to help protect fragile ecosystems,” he stressed.\nThe UN chief flagged that “history has shown what can be achieved when we put the planet first, pointing to a continent-sized hole in the ozone layer that triggered every country to commit to the Montreal Protocol, which phased out ozone-depleting chemicals.\n“This year and the next will present more opportunities for the global community to demonstrate the power of multilateralism to tackle our intertwined environmental crises, from negotiations on a new global biodiversity framework to reverse nature loss by 2030 to the establishment of a treaty to tackle plastics pollution,” he stated.\nGuterres reiterated the UN commitment to lead cooperative global efforts, “because the only way forward is to work with nature, not against it”.\nThe Executive Director of the UN Environment Programme (UNEP), Inger Andersen, reminded that the international day was born at the 1972 UN Conference in the Swedish capital, out of the understanding that “we need to stand up to protect the air, land and water on which we all depend…[and] that the power of people matters, and matters greatly”.\n“Today, as we look to a present and a future of heatwaves, droughts, floods, wildfires, pandemics, dirty air and plastic ridden oceans and yes, wars action is more important than ever, and we are running against the clock.”\nMs Andersen put the responsibility squarely “on all of us”.\nShe highlighted that politicians must see beyond elections to “intergenerational wins”; financial institutions must finance the planet, and businesses should account for nature.\nMeanwhile, David Boyd, UN Special Rapporteur on Human Rights and the Environment, warned that conflicts were intensifying environmental devastation, and rights violations.\n“Peace is a fundamental prerequisite to sustainable development and the full enjoyment of human rights, including the right to a clean, healthy and sustainable environment,” he said.\nConflicts consume “vast quantities” of energy; produce “huge emissions of climate-disrupting greenhouse gases”, increase toxic air, water and soil pollution, and destroy nature, he argued.\nThe UN-appointed independent expert highlighted the environmental fallout of Russia’s invasion of Ukraine, and its rights implications, including the right to live in a clean, healthy and sustainable environment, saying it would take years to repair the damage.\n“Many countries have announced plans to expand oil, gas and coal extraction in response to the war” in Ukraine, Boyd said, while noting that multi-billion-dollar rebuilding and restoration proposals post-conflict, would also add to environmental pressures facing the world.\n“The destruction of thousands of buildings and essential infrastructure will leave millions without safe drinking water – another essential right.”\nAs the world grapples with climate disruption, collapsing biodiversity and pervasive pollution, the UN expert stressed: “It is imperative to end wars, ensure peace and begin the healing and restoration processes as soon as humanly possible.”",
  "retrievedAt": "2025-08-11T15:01:47.318Z"
}
