{
  "title": "DC Islamabad holds Khuli Kutcheri at Bharakahu",
  "link": "https://www.app.com.pk/national/dc-islamabad-holds-khuli-kutcheri-at-bharakahu/",
  "date_published": "2022-06-04T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): Deputy Commissioner (DC) Islamabad Irfan Nawaz Memon on Saturday held an open court ‘Khuli Kutcheri’ at Union Council Bharakahu under open door policy to resolve public problems on priority.\nThe DC was accompanied by officers of Capital Police, Health Department, Local Government and Rural Development department, Islamabad Electric Supply Company (IESCO) and Sui Northern Gas Pipelines Limited (SNGPL).\nAdditional Deputy Commissioner Revenue, Additional Deputy Commissioner East and concerned revenue/union council staff were also present on the occasion.\nThe DC listened to the queries and complaints of the locals and gave directions to the concerned officer/department for immediate redressal.\nA large number of people attended the meeting and lodged their complaints regarding different problems including issuance of domicile, fard, registry, land transfer cases and other revenue matters.\nTalking to media persons, the DC said that the open courts were being conducted at far flung areas of Islamabad after many years to provide relief to the masses. The purpose for holding such meetings was to resolve citizens’ grievances at the earliest and ensure speedy justice, he added.\nHe said the ICT administration was taking strict actions against encroachments, profiteering and hoarding to provide relief to the masses.\nAll Assistant Commissioners and Magistrates were engaged in the redressal of public grievances within their respective jurisdictions, the DC informed the participants.\nHe urged the locals to keep their surroundings clean and plant trees to improve environment of the city.\nHe vowed to conduct ‘Khuli Kutcheries’ regularly to resolve peoples’ problems at their door steps.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:01:56.554Z"
}
