{
  "title": "Polio eradication strategies discussed to overcome challenges",
  "link": "https://www.app.com.pk/national/polio-eradication-strategies-discussed-to-overcome-challenges/",
  "date_published": "2022-06-04T15:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): Pakistan Polio Programme leadership on Saturday discussed the state of polio eradication efforts and strategies to make the country free from this crippling disease.\nThe discussion was held between Federal Health Secretary Dr Muhammad Fakhre Alam and the Pakistan Polio Programme leadership which was also attended by Director General Health, Dr. Rana Safdar, and National Emergency Operations Centre Coordinator Dr. Shahzad Baig.\nThe Federal Health Secretary discussed the current strategies and the way forward to overcome the persistent challenges to polio eradication.\n“The resurgence of cases is a national emergency and risk assessment will be done again across Pakistan on the basis of current epidemiological data. We must consistently work on ways to strategize better and ensure that every last child receives the life-saving polio vaccine,” said Dr Muhammad Fakhre Alam\n“All cases this year, which are eight so far, have been reported from North Waziristan, namely Mir Ali and Miranshah, while all southern districts of Khyber-Pakhtunkhwa remain at high-risk,” Dr Shahzad Baig said in a briefing to the Health Secretary, adding that the programme was vaccinating at all transit points to mitigate the risk of wild poliovirus transmission to other parts of the country.\n“Parents and caregivers who refuse vaccination for their children are putting them at risk of lifelong disabilities,” the secretary emphasized.\n“Every child has a right to a safe and healthy life,” Dr Fakhre Alam added.\nAfghanistan and Pakistan are the only two polio-endemic countries left in the world. Both countries synchronized nationwide immunization campaigns between May 23-27, vaccinating nearly 50 million children under the age of five on both sides of the border.",
  "retrievedAt": "2025-08-11T15:01:47.327Z"
}
