{
  "title": "NA passes three bills including Anti-terrorism (Amendment) Bill, 2024",
  "author": null,
  "content": "ISLAMABAD, Aug 13 (APP): The National Assembly on Wednesday passed the Anti-terrorism (Amendment) Bill, 2024 with majority of votes, rejecting amendments proposed by JUI-F member Aliya Kamran while incorporating an amendment proposed by PPP member Syed Naveed Qamar.\nMinister of State for Interior and Narcotics Control Talal Chauhdry moved the bill further to amend the Anti-terrorism Act, 1997 [The Anti-terrorism (Amendment) Bill, 2024] in the House.\nThe House passed the bill through clause by clause read. Earlier, the House adopted the motion to consider the bill with 125 votes in its favour and 59 against it.\nThe statement of objects and reasons of the bill says, the current security situation requires a robust response that goes beyond the existing legal framework. The erstwhile amendment of Section 11EEEE of the Act ibid are required to re-inserted to empower the government, Armed Forces and Civil Armed Forces with the necessary authority to detain individuals who pose a significant threat to national security. This provision would allow for the preventative detention of suspects based on credible information or reasonable suspicion, thereby disrupting terrorist plots before they can be executed. This will also provide Law Enforcement Agencies with the legal backing to conduct more effective operations against terrorism. It would facilitate the use of Joint Interrogation Teams (JITs), composed of members from various law enforcement and intelligence agencies to conduct comprehensive inquiries and gather actionable intelligence.\nThe National Assembly also passed two more bills including the National School of Public Policy (Amendment) Bill, 2025 and the Petroleum (Amendment) Bill, 2025 as reported by the Standing committees concerned.\nThe bills were moved by Ministry for Parliamentary Affairs Dr Tariq Fazal Chaudhary and Minister for Petroleum Ali Pervaiz in the House respectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-17T20:05:42.921Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-passes-three-bills-including-anti-terrorism-amendment-bill-2024/",
  "dateList": "2025-08-13",
  "date_published": "2025-08-13T23:17:00.000Z"
}
