{
  "title": "CM decides to convert 8672 isolation beds into HDU beds",
  "link": "https://www.app.com.pk/national/cm-decides-to-convert-8672-isolation-beds-into-hdu-beds/",
  "date_published": "2020-07-04T01:18:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jul 04 (APP):Sindh Chief Minister Syed Murad Ali Shah Saturday decided to convert 8672 isolation beds into HDU beds in more than two phases and to purchase more ventilators, more HDU beds with low and high oxygen arrangements.\nThis he said while presiding over a Taskforce meeting of COVID-19 here at the CM Sindh House, said a statement.\nThe meeting was attended by Minister health, minister local government, Minister education, Minister Excise & taxation, Advisor law, Mayor Karachi, Chief Secretary, ACS Home, PSCM, DG Rangers, IG Sindh, Brig Hussain of Corps 5, Commissioner Karachi, provincial secretaries, representatives of WHO, FIA, Pakistan Navy, UNICEF, Dr Faisal, Dr bari, Mushtaq Chhapra and other concerned.\nIt may be noted that at present the Sindh government has 503 ICU beds with ventilators and 1810 HDU beds.\nSyed Murad Ali Shah said that his government has tested 300,247 sample from June 1 against which 62476 cases of coronavirus were detected while during the corresponding period Punjab conducted 286,049 tests and detected 54057 cases, KPK 93377 tests and detected 17479 cases, Islamabad 90557 tests and detected 10703, Gilgit-Baltistan 5100 tests and detected 825 cases, Balochistan 26008 cases and detected 6324 cases and AJK 10351 tests and detected 959 cases. “This shows the Sindh government compared to other province has performed better”, he said.\nSyed Murad Ali Shah said that the comparison with other provinces was not aimed at criticizing them but it was being made to assess and evaluate the performance of the Sindh government.\nHe added that during June 1 to July 3, 2020, some 28 deaths were reported in AJK, 75 in Balochistan, 17 in Gilgit Baltistan, 102 in Islamabad, 529 in KPK, 1347 in Punjab and 987 in Sindh.\n“This is clear that our death rate is lower in term of patients and population than the province,” he said and added the recovery rate in Sindh was better than the others province such as during the said period 518 patients recovered in AJK, 3824 in Balochistan, 689 in Gilgit Baltistan, 8441 in Islamabad, 12608 KPK, 35833 Punjab and 37098 in Sindh.\n“Our fatality rate has been recorded at 1.57 percent, while Punjab has 2.49 percent, KPK 3.03 percent, Gilgit Baltistan 2.06 percent, Balochistan 1.19 percent and AJK 2.2 percent.\n“If fatality rate is compared keeping in view the number of patients and population of the province, Sindh has the lowest rate because of a better healthcare system,” he said.\nGiving comparative analysis of tests per million population, Syed Murad Ali Shah comparing the Sindh government has edge over other countries of the region.\nHe said that Sindh have tested 10047 people per million while Pakistan’s per million tests came to 6115, India 6737, Bangladesh 4981, Sri Lanka 5160 and Afghanistan 1908.\nHe said that the testing capacity which was only 80 per day in February 2020 was increased to 300, then to 1200, 4200, 6500, 8750, 11450 and now 14050 which itself was a record of a provincial government with meager resources.\nSyed Murad Ali Shah giving analysis of three weeks of June said that in the second week of June, 51086 samples were tested which detected 15221 cases and cured 8916 patients.\nIn the third week of June 67534 samples were tested which diagnosed 15095 cases and cured 10702 patients. In the fourth week of June 34,344 samples were tested which produced 7975 cases and cured 7110 patients.\nTalking about the first week of July, Syed Murad Ali Shah said that 18934 samples were tested which detected 4806 cases and cured 3988.\nThis shows that we kept enhancing testing capacity, educated people about the SOPs and succeeded in bringing down the detection rate and enhancing the recovery rate. “This is the success story of our policy and better healthcare system,” he said.\nTalking about challenges, the chief minister said that under current prevalence, it was impossible to predict how many cases were actually there in a defined geographical area.\nMajority of cases are asymptomatic more than 80 per cent, he said and added every country had faced issues to implement SOPs and relaxation follow up.\nThe CM said that we could not screen everybody, therefore adopted a policy of targeted screening.\nHe added that one- time screening was not an option but with continued exposure, one-time screening could never be sufficient.\n“We don’t have unlimited resources, therefore we have to allocate resources where minimum expend on health could be ensured.\nSyed Murad Ali Shah giving example of the district East said that in Gulshan Town 247 and in Jamshed Town 214 cases were detected on June 17 when selective lockdown was started. On July 2, when selective lockdown was lifted 283 cases were detected in Gulshan Town and 90 cases in Jamshed Town.\nDuring the lockdown period 66 patients recovered in Gulshan Town and 187 in Jasmhed Town. It means lockdown has turned to be the only option to contain the cases.\nThe chief minister decided to purchase more ventilators, more HDU beds with low and high oxygen arrangements.\nThe meeting decided to convert 8672 isolation beds into HDU beds in more than two phases.\nHe urged the minister for health to take necessary measures to reduce death from strokes, pulmonary embolism and seizures.",
  "retrievedAt": "2025-08-11T19:26:53.938Z"
}
