{
  "title": "Kashmiri blood will continue to flow until genuine demands not fulfilled : Usman Dar",
  "link": "https://www.app.com.pk/national/kashmiri-blood-will-continue-to-flow-until-genuine-demands-not-fulfilled-usman-dar/",
  "date_published": "2020-08-09T05:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): Special Assistant to Prime Minister on Youth Affairs Usman Dar Sunday paid glowing tribute to young Kashmirs for braving Indian brutalities for their just right to self-determination and Kashmiri blood will continue to flow until genuine demands are not to be fulfilled.\nTalking to PTV news channel, he said that Kashmiri youth is still standing firm for the cause of Kashmir and they would remember how bravely the people of Kashmir were sacrificing against the oppressive and occupant regime of India.\nHe urged the world youth to wake up and raise their voice to project the case of Kashmir as the occupant forces were killing Kashmiris with impunity.\nUsman Dar assured that we loves the youth of Azad Jammu and Kashmir (AJK) as much as we loves the youth of Pakistan, adding, at present the youth are playing the role of a frontline force in the Kashmir liberation movement.\nUsman Dar said Indian Prime Minister Narendra Modi should know the Pakistanis will never forget Kashmir and will never abandon the freedom struggle.\nThe sacrifices of all Kashmiris and Young Burhan Wani will never be forgotten,” he said, adding, there is a need to rise above politics and play role for the resolution of Kashmir issue.\nHe saluted the Kashmiri people who have faced the worst repression in their struggle for the right of self-determination.\nHe paid rich tributes to the thousands of martyrs who had laid down their lives and said that the fruit of their historic struggle would soon bear the fruit of freedom.\nHe said on 5th of August Pakistan reminds the international community of its responsibilities and urges them to fulfill their promise made with the people of Jammu and Kashmir by implementing UN Security Council resolutions.\nUsman Dar said the government has launched a new political map of the country to make the international community fully aware of Indian policies and human rights violations in Indian Illegally Occupied Jammu and Kashmir.\nThe new map launched will definitely negate the illegal Indian move on 5th of August last year, he added.\nHe further explained that it is a known fact that India has been forced to go on back foot since Prime Minister Imran Khan came into power.\nThe foreign policy has been more animated than ever before, he said, adding, the regional situation has now changed and Pakistan is in a strong position as its narrative on Kashmir issue has been acknowledged by the civilized world.",
  "retrievedAt": "2025-08-11T19:37:54.575Z"
}
