{
  "title": "PM for drastic steps to revert back effects of climate change",
  "link": "https://www.app.com.pk/national/pm-for-drastic-steps-to-revert-back-effects-of-climate-change/",
  "date_published": "2020-08-09T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): Prime Minister Imran Khan Sunday urged the nation to fully participate in tree plantation drive to revert the environmental degradation in the country which posed a serious threat to its crops, terrains and livelihood.\nAddressing a big gathering of volunteers of the Tiger Force and people from different walk of life here at Korang Park, the prime minister said that unanimous decisions by the nation always yielded positive results and referred to country’s success in containing the coronavirus pandemic.\nThe prime minister said the climate change was also affecting the country as they had witnessed a reduction of 1.5 million tonnes in wheat production in the current year because the rainfall adversely affected the crop.\nThe prime minister planted a sapling to formally launch country’s biggest tree plantation campaign targeting around 3.5 million trees across the country on Tiger Force day being observed on August 9.\nThe prime minister further said the changes were occurring because of climatic changes, he said, urging the nation to realize its true potential and come forward to share their responsibility in arresting deforestation of the country.\nAbout 80 per cent of the glaciers in the country were facing the risk of melting which could increase desertification in the catchment areas if drastic steps were not taken, he warned.\n“It is our collective duty to make the country green by planting trees,” he stressed.\nThe prime minister also underlined the need to control pollution in the Rawal Lake which provided water to adjacent Rawalpindi city.\nExpressing satisfaction over government’s policy of smart lockdown and the public response against coronavirus pandemic which resulted in bringing down the daily caseload, he asked the people to strictly follow the standard operating procedures (SOPs) as the coronavirus threat was not over.\nThe prime minister stressed upon maintaining the social distance and wearing of masks in public places. He said the world acknowledged the government’s steps to control coronavirus and he also lauded efforts of the National Command and Operation Center (NCOC), Tiger Force and his health team for making hectic efforts in this regard.\nThe prime minister asked the nation to to follow these SOPs during the upcoming month of Muharram ul Haram.  Earlier, Advisor to Prime Minister on Climate Change Malik Amin Aslam said that about 3.5 million saplings were planted across the country on Sunday.\nHe said Pakistan was the 5th most vulnerable country in the world facing the negative effects of climate change.\nReferring to a World Bank’s report on climate change, he called for immediate action to arrest the environmental degradation because the report had identified six districts of Pakistan as ‘hotspots’ which would become inhabitable in future due to rising temperatures.\nThese districts included Hyderabad, Sukkur and Mirpur Khas in Sindh province and Lahore, Faisalabad and Multan in Punjab province.\nA large number of people including Tiger force volunteers planted different saplings in and around the park.  The government has announced to observe August 9 as ‘Tiger Force Day’ across Pakistan when over a million volunteers along with government would plant trees as part of 10 billion Tree Tsunami initiative.\nAs per plan, around 2 million saplings would be planted in Khyber Pakhtunkhwa, 1.19 million in Punjab, 300,000 in Sindh, 57,000 in AJK, 15,000 in Balochistan and 11,500 in Gilgit Baltistan.",
  "retrievedAt": "2025-08-11T19:37:52.790Z"
}
