{
  "article_id": "2025-02-28_75c7bfd644f11aa1fb77bdf0ca24be06",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ayaz-sadiq-meets-president-of-hungary/",
    "retrieved_at": "2025-08-27T13:14:07.232Z"
  },
  "metadata": {
    "title": "Ayaz Sadiq meets president of Hungary",
    "author": null,
    "date_published": "2025-02-28T10:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 589,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 28 (APP): Speaker National Assembly Sardar Ayaz Sadiq, Friday reaffirmed Pakistan's commitment to a principled, non-aligned foreign policy during his meeting with the President of Hungary, Mr. Tamas Sulyok, in Budapest. According to the message received from Budapest, Hungary, Ayaz Sadiq is leading a high-level parliamentary delegation on an official visit to Hungary to strengthen bilateral ties and celebrate 60 years of diplomatic relations between the two nations. NA Speaker was warmly received at Sandor Palace, the historic residence of the President of Hungary. In the meeting, he expressed gratitude for Hungary's support in Pakistan's successful election to the United Nations Security Council, acknowledging it as a recognition of Pakistan's impartial and balanced foreign policy. He highlighted that Hungary's vote was a testament to the strong bilateral relations between the two nations. Sardar Ayaz Sadiq termed Pakistan and Hungary as \"naturally aligned partners\" and appreciated Hungary's independent stance on global issues. He acknowledged the Hungarian leadership's wisdom in safeguarding national interests while praising President Tamas Sulyok's stance on non-alignment, which is crucial in preventing global conflicts and ensuring peace and stability. While reviewing the geopolitical situation, Speaker Sardar Ayaz Sadiq drew attention to the long-standing Afghan crisis, highlighting that Pakistan continues to host 4.6 million Afghan refugees, bearing the consequences of prolonged regional instability. He also underscored the global parliamentary community's responsibility in facilitating a peaceful resolution for Kashmir and Palestine as per the aspirations of the people of Kashmir and Palestine. Both sides also discussed the situation in Europe following the Ukraine war and expressed hope for its peaceful resolution, bringing political and economic stability to the world. NA Speaker praised Hungary's initiative of offering 500 scholarships annually to Pakistani students. He noted that over 1,500 Pakistani students are currently pursuing higher education in Hungary, further strengthening bilateral ties and people-to-people contacts. He reaffirmed Pakistan's commitment to deepening its partnership with Hungary and expressed optimism for continued collaboration across multiple sectors to ensure mutual prosperity and regional stability. Speaker Sardar Ayaz Sadiq commended Hungary's decision to join the Belt and Road Initiative (BRI) as the only European country to do so, emphasizing the importance of connectivity for global prosperity. Moreover, he highlighted Pakistan's strategic role in the initiative, particularly the significance of Gwadar Port as a key trade gateway linking Europe, China, and Central Asia. He stressed that enhanced trade routes and infrastructure development were crucial for mutually beneficial economic growth. He also appreciated Hungary's recognition of Pakistan's democratic and economic progress and highlighted the potential for collaboration in agriculture, infrastructure, railways, and water security. In addition, he called for increased trade and investment partnerships between the two nations. President Tamas Sulyok commended Pakistan's principled stance on global issues, noting that it upholds moral values without aligning with or against any particular side. He emphasized that non-alignment is crucial in preventing the world from further descending into war and conflict. The President also highlighted the significant potential for expanding bilateral cooperation in key sectors such as agriculture, infrastructure development, railway enhancement, and water security. Additionally, President Tamas Sulyok expressed satisfaction with Pakistan's recent progress in strengthening its democratic institutions and economic stability, reaffirming Budapest's positive outlook on the country's ongoing developments. This visit marks the 60th anniversary of Pakistan-Hungary diplomatic relations. Speaker Sardar Ayaz Sadiq is accompanied by a distinguished 7-member parliamentary delegation, including MNAs former Prime Minister & former NA Speaker Raja Pervez Ashraf, Ms. Shazia Marri, Mr. Rafique Ahmed Jamali, Mr. Nadeem Abbas, Ms. Munaza Hassan, Mr. Saleem Rehman, and Mr. Arshad Abdullah Vohra.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}