{
  "article_id": "2025-02-28_538f66e129e482daaf278114014baf2b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fde-announces-ramazan-timings-for-educational-institutions/",
    "retrieved_at": "2025-08-27T13:13:40.545Z"
  },
  "metadata": {
    "title": "FDE announces Ramazan timings for educational institutions",
    "author": null,
    "date_published": "2025-02-28T13:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 232,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 28 (APP): Federal Directorate of Education (FDE) has issued new operational timings for all educational institutions under its jurisdiction during the holy month of Ramazan. In a recent announcement, the FDE emphasized the necessity for schools and colleges to adhere to these adjusted hours to accommodate the observance of fasting. According to the official notification, single-shift institutions will operate from 8:00 AM to 12:30 PM from Monday to Thursday. On Fridays, these institutions will have slightly adjusted hours, opening from 8:00 AM until 12:00 PM. For educational institutions that follow a double-shift schedule, the timings are set from 8:00 AM to 12:30 PM (Monday to Friday) for the first shift. The second shift is scheduled from 12:30 PM to 4:30 PM from Monday to Thursday, concluding early on Fridays from 1:30 PM to 4:30 PM. Similarly, Ex-F.G Colleges will operate from 8:00 AM to 12:30 PM from Monday to Thursday, while from 8:00 AM until 12:00 PM on Fridays. Islamabad Model Schools and colleges, including the F.G. Colleges for Boys and Girls, are directed to implement these changes promptly and communicate the timings to all involved stakeholders. The FDE has urged all heads of institutions to ensure compliance with the approved schedule in an effort to streamline operations during this significant month. This announcement aims to create a supportive environment for students and staff observing Ramazan while maintaining educational standards.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}