{
  "article_id": "2025-02-28_644a3bd6efbd0fc0d08ca5e4c0e3d196",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fia-books-etpb-official-for-alleged-rs-3-mln-fraud/",
    "retrieved_at": "2025-08-27T13:14:07.036Z"
  },
  "metadata": {
    "title": "FIA books ETPB official for alleged Rs. 3 mln fraud",
    "author": null,
    "date_published": "2025-02-28T11:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 28 (APP):The Federal Investigation Agency (FIA) has booked Deputy Administrator (Plazas) of the Evacuee Trust Property Board (ETPB), Imran Arif Janjua over allegations of extortion and misappropriation of Rs. 3 million. According to the FIR (No. C/08/2025) registered at the FIA Anti-Corruption Circle, the complainant, Muhammad Shabbir, a resident of Sector I-10/1, Islamabad, alleged that Janjua took Rs. 3 million from him in 2014. The accused reportedly promised to secure a government job for Shabbir's nephew, Shehroz Iqbal, as a Naib Tehsildar in ETPB. However, neither the job was provided nor was the money returned. The incident reportedly took place in front of witnesses, including Muhammad Rafique, and Muzammil Hussain, at various locations in Islamabad and Rawalpindi. Following an internal inquiry, FIA secured approval from the competent authority to proceed with legal action. The case has been registered under Section 161 of the Pakistan Penal Code (PPC) and Section 5(2) of the Prevention of Corruption Act, 1947. FIA Sub-Inspector Shams Khan Gondal will lead the investigation. The reliable sources within the FIA informed that mobile data records indicate the accused's involvement in large-scale corruption. In response, the agency has decided to form a team of experienced officials to conduct a thorough investigation and intensify the crackdown on corrupt elements within the organization. Sources further revealed that the authority has received additional complaints against the accused, who is allegedly involved in fraudulently extorting large sums of money from complainants. Further developments in the case are awaited.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}