{
  "article_id": "2025-02-28_568f938927e137eaad508ce5ef9e8b48",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/five-more-judges-nominated-for-scs-constitutional-benches/",
    "retrieved_at": "2025-08-27T13:13:12.447Z"
  },
  "metadata": {
    "title": "Five more judges nominated for SC’s constitutional benches",
    "author": null,
    "date_published": "2025-02-28T18:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 250,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 28 (APP): The Judicial Commission of Pakistan nominated five more judges for the constitutional benches of the Supreme Court of Pakistan, by majority of its total membership. As per the declaration of the meetings, the judges from SC including Mr. Hashim Khan Kakar, Justice Salahuddin Panhwar, Mr. Shakeel Ahmad, Mr. Aamer Farooq and Mr. Ishtiaq Ibrahim are nominated for the constitutional benches of the top court. The three meetings of the Judicial Commission of Pakistan were held in the Conference Room of the Supreme Court Building at Islamabad. In the first meeting, the commission appointed district and session judges included Raja Ghazanfar Ali Khan, Tanveer Ahmed Sheikh, Tariq Mahmood Bajwa and Ms. Abher Gul Khan as Additional Judges of Lahore High Court, by majority of its total membership. The Commission unanimously decided that nominees who did not secure the required majority of the total membership of the Commission for finalization of their nominations this time may be renominated for future vacancies. In the second meeting the Judicial Commission of Pakistan also nominated Justices of Sindh High Court including Riazat Ali Sahar, Abdul Hamid Bhurgri and Nisar Ahmed Bhandbro for constitutional benches of the said court. However, in third meeting the commission nominated judges of the top court for the constitutional benches of SC. The Chairperson decided to constitute the committees for setting criteria for appointment of Judges of all High Courts and also for nomination of Judges for Constitutional Benches of Supreme Court and all the High Courts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}