{
  "article_id": "2025-02-28_689666faaa87faf8e468edaa579191ba",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/maritime-security-exercise-sea-guard-25-concludes/",
    "retrieved_at": "2025-08-27T13:13:14.236Z"
  },
  "metadata": {
    "title": "Maritime Security Exercise SEA GUARD-25 concludes",
    "author": null,
    "date_published": "2025-02-28T16:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 184,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 28 (APP): Maritime Security Exercise SEA GUARD-25 concluded with a debrief session held in Karachi. Deputy Chief of the Naval Staff (Operations), Vice Admiral Raja Rab Nawaz, graced the occasion as the Chief Guest. The exercise aimed to rehearse and validate maritime information sharing and response mechanisms among various national organizations, said a news release. While addressing the session, the Chief Guest commended the role of the Joint Maritime Information and Coordination Centre (JMICC) as a vital platform for fostering collaboration among national maritime stakeholders. He also lauded Pakistan Navy's continued commitment to ensuring a secure maritime environment through coordinated efforts with national partners. During the debrief session, recommendations based on a review of various scenarios and tabletop discussions were presented for implementation. As the second in its series, Exercise SEA GUARD-25 brought together representatives from Pakistan's diverse maritime sector. Senior officials from the Pakistan Maritime Security Agency, Pakistan Coast Guards, Pakistan National Shipping Corporation, Anti Narcotics Force, Federal Investigation Agency, Karachi Port Trust, and Port Qasim Authority, along with prominent figures from private sector and fishing community, attended the closing session.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}