{
  "article_id": "2025-02-28_f4dc7cc7b7f5b70148d90d1ba709f9b4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/secretary-health-examines-facilities-at-pims/",
    "retrieved_at": "2025-08-27T13:13:40.253Z"
  },
  "metadata": {
    "title": "Secretary Health examines facilities at PIMS",
    "author": null,
    "date_published": "2025-02-28T13:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 28 (APP): Secretary, Ministry of National Health Services Regulations and Coordination, Nadeem Mahbub on Friday carried out a surprise visit to the Outpatient Department (OPD) of Pakistan Institute of Medical Sciences (PIMS) to review healthcare services and administrative arrangements. During his visit, the secretary inspected the attendance of doctors and medical staff. He emphasized that hospital administration must ensure the availability of doctors and paramedical staff at all times, stating that negligence and inefficiency would not be tolerated and reaffirmed zero tolerance policy over absenteeism matters. Nadeem Mahbub urged the medical professionals to provide the best possible healthcare services to patients, acknowledging that PIMS hospital faces a significant patient load. He highlighted that as per the Prime Minister's directives, full support is being given to the PIMS. The Federal Health Secretary also inspected the newly established patient assistance booths and visited the hospital rooftop to assess ongoing repair work. He directed the Executive Director of PIMS to ensure the swift completion of these repairs and renovation of washrooms. He expressed satisfaction with the hospital's cleanliness and maintenance. Reaffirming the commitment of the government, Nadeem Mahbub said that providing quality healthcare services to every citizen remains a top priority. He emphasized that significant measures are being taken to upgrade healthcare facilities and improving hospital infrastructure.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}