{
  "title": "Labor day being observe to pay homage to sacrifices of Chicago workers",
  "link": "https://www.app.com.pk/national/labor-day-being-observe-to-pay-homage-to-sacrifices-of-chicago-workers/",
  "date_published": "2024-05-01T09:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): Like other parts of the globe, labor day being observed across the country to pay homage to the sacrifices of 1886 Chicago workers who sacrificed their lives demanding eight hours duty a day.\nPeople gathered at roads and streets to renew their pledge sending a message to employers to provide proper wages and healthy environment under this year’s theme of “ensuring laborers’ safety and health at work place.”\nOn the occasion of International Labor Day, Speaker of the Khyber Pakhtunkhwa Assembly Babar Salim Swati Wednesday highlighted the pivotal role of labor in the national economy.\nRecognizing the significance of Labor Day, Swati underscored the service rendered by the working class towards national progress and prosperity.\nIn his statement, Babar Saleem Sawati emphasized the divine recognition of labor, stating that Allah Almighty has designated labor as his friend, and urged for timely compensation for their efforts.\nSwati reiterated the indispensable contribution of laborers and workers, irrespective of their educational background or skill level, in the development of any country and society.\nHe commended the past efforts of the PTI government in Khyber Pakhtunkhwa towards the welfare and prosperity of laborers, assuring that such initiatives will persist in the current administration.\nChief Minister Khyber Pakhtunkhwa Ali Amin Khan Gandapur on Wednesday emphasized the importance of honoring the dignity and rights of the hardworking class for societal progress and prosperity.\nIn a message on the occasion of International Labor Day, he highlighted the pivotal role of the labor force in national development and emphasized the need to ensure their well-being and rights protection.\nThe Chief Minister underscored that the prosperity and protection of workers are integral to any state’s priorities, as they are the backbone of national advancement.\nHe stressed the importance of providing dignified employment opportunities for workers by integrating industrial training institutions and industries, further stating that the current provincial government recognizes the pivotal role of the labor class in the country’s progress.\nHe said that the day calls for a renewed commitment from all sectors of society to address the welfare and issues facing workers, ensuring their active participation in decision-making processes.\nSindh Chief Minister Syed Murad Ali Shah on Wednesday said the provincial government was working hard for the economic stability of the labourers and also ensuring the provision of education and health facilities to their children.\nGreeting the workers in his message on the occasion of 1st May Day, the Chief Minister said that the workers are the wheels of the country’s economy.\nShah said that our workers have played an important role in the development and prosperity of the country.\nThe CM said that the provincial government was planning to launch a program for the uplift of the industrial as well as agricultural labourers, farmers and women workers.\nHe said that the People’s Party government was registering all the workers and including them in the social security program.\nFederal Minister for Kashmir Affairs & Gilgit Baltistan and States and Frontier Regions (SAFRON) Engr Amir Muqam has said that laborers deserved special attention not only from the government but also from all the concerned sections of the society.\nIn his message on International Labor Day, the Federal Minister said that it was imperative to take steps to protect workers’ rights by strictly enforcing labor laws.\nEngr Amir Muqam paid rich tributes to the working class for their important role in the country’s development and assured that the federal government would take all possible measures for their welfare.\nHe said that the labor force is the backbone of our country’s economy.\nEngr Amir Muqam said that a stronger and more prosperous laborer class would result in a developed and prosperous nation.\nHe said that International Labor Day is not only a reminder of the struggle of workers but also an acknowledgment of their contribution towards economic development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:14:15.535Z"
}
