{
  "title": "PM wants wealthy, businessmen, industrialists to prioritize improving conditions of labour class",
  "link": "https://www.app.com.pk/national/pm-wants-wealthy-businessmen-industrialists-to-prioritize-improving-conditions-of-labour-class/",
  "date_published": "2024-05-01T10:18:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 01 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday said that they were fully cognizant of the value of the labourers and workers in the national economy and stressed upon the wealthy, businessmen, investors and industrialists to prioritize improving the conditions of the workers.\nAddressing a gathering of labourers and workers from different sectors at his residence in connection with the observance of International Labour Day, the prime minister said that country’s economic situation was challenging but they were striving to turn it around, with collectively efforts and sincerity.\nHe said that Pakistan would soon become a powerful country through a functioning of a fair system and on the basis of hard work by the employers and the employees including workers.\nThe prime minister said that the government was striving to bring about substantial changes in the national economy and to recover billion of rupees being wasted due to corruption.\nReferring to his recent visit from the Kingdom of Saudi Arabia, he said that the Crown Prince Mohammed bin Salman and other leadership desired to see Pakistan moving on the path of progress.\nThe Saudi business and investors’ delegation would soon visit Pakistan which would increase businesses and job opportunities in the country, he added.\nThe prime minister said that in the upcoming fiscal budget, they would try to provide further relief to the the labour class.\nCalling upon the business people and well to do class, the prime minister said that they should also think beyond their families and businesses and invest in certain education and health projects for the deprived classes like those established in the developed countries.\n“It was not an objective behind the creation of Pakistan that there would be a difference between the rich and the poor. Quaid-e-Azam Muhammad Ali Jinnah led the massive movement in which the people had offered huge sacrifices. The motive was the establishment of a welfare state in which everyone would have the equal opportunities to excel in life on the basis of one’s capacity and ability and take the country forward,” he added.\nThe prime minister reiterated that they were striving to end corruption and promised that all the organs of government and other state institutions, with their collective efforts, would carve a niche for Pakistan among the comity of nations.\nHe said that the labourers and workers worked hard in the most difficult conditions and helped their employers generate their businesses. Both were like the wheels of the same carriage and their work lead to progress and prosperity of the nation and country.\nHe said if the workers were deprived of their due rights, a country could not achieve progress.\nThe prime minister opined that due to price hike and inflation, the life for the common man had become hard.\nThe prices of petroleum products had been reduced but it could not be a substitute for the daily price hike as the labour class had to meet the requirements of education for their sons and daughters, treatment for their parents, and other daily expenditures and were living from hand to mouth, he observed.\nThe prime minster emphasized that under the teachings of the Holy Quran and the Prophet’s (Peace Be Upon Him) messages, it was their abiding duty to bridge the differences between the rich and the poor.\nThe prime minister recollected that his father was also a worker who attained his earlier education in Amritsar and during 30s settled in Lahore, where he worked along with his brothers in a steel factory.\nHe also recited Dr Allama Iqbal’s verse about plight of labourers and workers and said that these couplets represented a powerful message, reflecting voice of millions of workers in Pakistan.\nThe labour day started after Chicago incident and then the movement became global, he said, adding that the Quranic teachings and the Seerah of Holy Prophet (PBUH) highlighted the value of hard work.\nThe prime minister also welcomed the workers and labourers at his residence and said that he felt immense pleasure in hosting them at the residence of late Mian Muhammad Sharif.\nEarlier, Chairman PM Youth Programme Rana Mashhood Ahmed Khan highlighted the personal loan scheme for the deserving children of workers and said that under prime minister’s tenure as chief minister of Punjab, Danish schools and Educational Endowment Funds were established.",
  "retrievedAt": "2025-08-11T02:14:14.787Z"
}
