{
  "title": "President for strict action against criminals in Sindh",
  "link": "https://www.app.com.pk/national/president-for-strict-action-against-criminals-in-sindh/",
  "date_published": "2024-05-01T17:35:00.000Z",
  "source": "APP",
  "content": "KARACHI, May 01 (APP):President Asif Ali Zardari on Wednesday urged Sindh Chief Minister Syed Murad Ali Shah to take strict actions against the criminals in Karachi, dacoits in Kacha area and the drug traffickers in close collaboration with the federal government and other provinces to ensure law and order situation in the province.\nHe expressed these views  while chairing a meeting here on security, and law and order situation in Sindh Province.\nThe representatives of the law enforcement agencies briefed the president about the crimes in Karachi, the Kacha area, and the overall security situation of the province.\nThe president called for devising a system for effective monitoring of the city’s all entrances and exits. Emphasizing the need to complete the Karachi\nSafe City Project on an urgent basis, he said Police should ensure effective tracking of stolen property and take appropriate legal action in this regard.\nHe said all kinds of support should be provided to ensure the security of Chinese citizens. Besides, the president also stressed the need to continue the ongoing operation in the Kacha area with full force. He also directed the establishment of more Police check posts to improve the security situation of the Kacha area.\nPresident Zardari also asked to ensure the provision of the necessary equipment to the Sindh Police with the support of the federal government. The president, emphasizing the need to expedite work on the development projects in various areas of Sindh province said, development projects on both sides of the River Sindh should be launched.\nHe instructed to take support from the local leaders and the community members to solve the issues of tribal and Kacha areas. He said a system should be evolved for effective communication between Sindh, Punjab, and Balochistan to prevent crimes in the country.\nThe president, expressing concern over the spread of drugs in educational institutions, said Karachi must be made a drug-free city.\nA special law can be made for conducting compulsory tests of students and establishing rehabilitation centers, he said adding that the Sindh government should create awareness about drugs among the parents. He said proposals for necessary amendments in federal anti-narcotics laws could be made to provide jurisdiction to the police in drug cases.\nFurther, he said effective measures to prevent the spread of drugs in educational institutes were inevitable adding that the Police must take strict action against the drug mafia.\nChief Minister Syed Murad Ali Shah, briefing the president about the overall security situation in Karachi and the rest of the province, said that after strict actions taken by the provincial government against street crimes in Karachi, and operations against dacoits in the Kacha area, the law and order situation had significantly improved.\nHe informed that the number of crimes had significantly reduced during the current year as compared to the previous year.\nThe president was told that crimes in Karachi were less than those recorded in the big cities across the world.\nThe Sindh CM pointed out that the law and order situation across the province was being reviewed regularly.\nHe said the Sindh government was ensuring the provision of necessary equipment to enhance the capacity of the Police.\nSindh Police, he said had taken important steps to control street crime besides the law enforcement agencies were also conducting operations in the Kacha areas.\nInterior Minister Mohsin Naqvi and Minister for Science and Technology Khalid Maqbool Siddiqui participated in the meeting. While provincial ministers Sharjeel Memon, Nasir Shah and Ziaul Hasan Linjar also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:14:11.899Z"
}
