{
  "title": "President Zardari pledges commitment to upholding labourers’ dignity",
  "link": "https://www.app.com.pk/national/president-zardari-pledges-commitment-to-upholding-labourers-dignity/",
  "date_published": "2024-04-30T19:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): President Asif Ali Zardari has reiterated the commitment to upholding the dignity of labourers and paid tribute to their historic struggle.\n“This day serves as a reminder for all of us to safeguard labourers’ rights, and work for their social protection, fair wages, and safe working conditions,” the president said in a message on the observance of International Labour Day on May 1.\nOn this day, the president said, they deeply acknowledged and appreciated the contributions of their workers who had played a commendable role in the country’s development.\nHe said today, the International Labour Day was being observed to pay tribute to their workers and labourers whose tireless efforts had driven the country’s socio-economic development.\nThe president said the theme for this year’s International Labour Day was to ensure workplace safety and health amidst climate change.\n“The labourers and the working class in Pakistan are facing unprecedented challenges, such as inflation, rising cost of living, unemployment, and the adverse impacts of climate change,” a press release quoted the president as saying.\nIn order to ameliorate the lot of working classes, the president said, it was highly essential to initiate measures for their welfare by providing adequate wages, safe working conditions, health coverage and educational facilities to their children.\n“The state also has a crucial role to play in protecting the rights of workers, implementing and enforcing policies to end labour exploitation, protect their rights, and provide social support,” he observed.\nThe president called upon the employers to adopt fair wage practices, take steps for worker safety and health and ensure the provision of necessary training and protective equipment to labourers working in hazardous environments.\nThe president expressed the hope that the federal and provincial governments would also play their role to protect the rights of labourers, take steps to eliminate exploitative practices and implement social security programs for them.\n“Let’s pledge to create a conducive environment for workers in Pakistan where they are valued and respected,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:14:59.779Z"
}
