{
  "title": "Mayor extends olive branch to JI for development of Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Mayor Murtaza Wahab of the Pakistan Peoples Party has offered an olive branch to the opposition Jamaat-i-Islami, emphasising the importance of putting aside political differences to improve the city.\n\nHe was speaking at the inauguration of the Jigar Muradabadi Road within the jurisdiction of the JI-controlled Jinnah Town.\n\n“From here, we convey a joint message that we will continue to work together for the city’s development, despite ideological differences,” the mayor told reporters after inaugurating the road project.\n\nAccompanied by Jinnah Town chairman Rizwan Abdul Sami of the JI and Deputy Mayor Salman Abdullah Murad, he stressed the importance of forming an alliance between his party and the opposition JI, saying that both the parties were jointly running the administration of the city’s 25 out of 26 towns and a united stance was needed from the top leadership of the two parties to take up Karachi issues with Islamabad.\n\nInaugurates Jigar Muradabadi Road\n\nHe said that the PPP and the JI would work together for the development and progress of the city and emphasised that political differences must be set aside to work together for the betterment of Karachi.\n\n“The PPP and Jamaat-i-Islami have come together to initiate this effort, setting an example for unity of Karachi,” he said.\n\n“Both the parties will work together for the city’s development, and that the federal government have to listen to their concerns. There are several issues to be addressed with the federal government, but when voices like that of [JI chief] Hafiz Naeemur Rehman and [PPP chairman] Bilawal Bhutto-Zardari unite, the federal government will have no choice but to listen to us.”\n\nHe said that he and his PPP colleagues had visited Jinnah Town on JI’s invitation and that JI chief Hafiz Naeem had met the PPP’s chairman regarding issues like Palestine.\n\nThe mayor also made a veiled criticism of the past city government of the Muttahida Qaumi Movement-Pakistan (MQM-P) and its mayor Waseem Akhtar, saying those who had been complaining of the “lack of power” had caused significant damage to the city.\n\n“Now the KMC will take the first step for the city’s improvement,” he claimed.He acknowledged that the KMC had worked on development projects in various areas through the schemes initiated under the annual development programme.\n\nHe said the severe problems of gas and electricity loadshedding in Karachi needed to be addressed by the federal government.\n\nResponding to a question, Mayor Wahab acknowledged the issue of street vendors and encroachments, which have become a shared problem of Karachi affecting both the city’s administration and the residents.\n\nHe vowed that there would be no tolerance for illegal encroachments in any part of the city.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:22:11.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889791/mayor-extends-olive-branch-to-ji-for-development-of-karachi",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:23:25.000Z"
}
