{
  "title": "IHC judges want changes to seniority list undone - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Five justices file representation, say seniority should be determined from date of new oath\n• Justice Kayani loses another coveted portfolio to successor Justice Dogar\n\nISLAMABAD: The Islamabad High Court judges approached Chief Justice of Pakistan Yayha Afridi and IHC Chief Justice Aamer Farooq to reclaim their seniority in light of changes to the ranking following the transfer of new judges, particularly Justice Sarfraz Dogar from the Lahore High Court who became the senior puisne judge replacing Justice Mohsin Akhtar Kayani.\n\nBesides losing his coveted position, Justice Kay­ani lost his representation in the Depart­m­e­ntal Promotion Commi­ttee and the Administra­tion Committee on Mon­day. In another order on Tuesday, the judge was stripped of the Inspection Judge of the Special Courts position.\n\nA notification issued by the high court administration following the CJ’s approval stated that the charge had been assigned to Justice Dogar. Justice Dogar was appointed as LHC judge in June 2015, while the date of the appointment of Justice Kayani is Dec 23, 2015.\n\nThe administration also revi­sed its seniority list and the changes were impleme­nted after receiving appro­val from Chief Jus­tice Farooq, with separate notifications issued by the registrar’s office.\n\nThe updated seniority list is as follows: Justice Dogar, Justice Kayani, Justice Miangul Hassan Aurangzeb, Justice Tariq Mehmood Jahan­giri, Jus­tice Babar Sattar, Jus­tice Sardar Ejaz Ishaq Khan, Justice Arbab Muhammad Tahir, Justice Saman Rif­fat Imtiaz, Justice Khadim Hussain Soo­mro, Justice Mohammad Azam Khan, Justice Mohammad Asif and Justice Inaam Ameen Minhas.\n\nBefore these transfers, five out of 10 IHC judges had penned a strongly worded letter to the president and the CJP besi­des other high courts’ chief justices, opposing these transfers.\n\nOn Tues­day, these judges sent a representation to the chief justice of the IHC and CJP Afridi against placing them down on the seniority list.\n\nA central concern raised by the judges was that a transferred judge would be required to take a fresh oath under Article 194, which would place them at the bottom of the seniority list within the IHC.\n\nThis would render them ineligible for immediate consideration for the CJ’s position, contradicting the Judicial Commission of Pakistan’s (JCP) Appointment Rules 2024, which mandated that the chief justice of a high court must be appointed from among the three senior-most judges of that court.\n\nAccording to the representation submitted by the judges, a judge takes an oath for the high court in which they are appo­inted. It further emphasised that according to the constitutional intent, a judge must take a fresh oath when transferred to another high court.\n\nBased on this principle, the seniority of a judge transferred to another high court should be determined from the date of their new oath.\n\nThe judges clarified that their representation strictly concerned the seniority issue and was unrelated to the transfer of judges.\n\nThe development, however, sparked discussions within the legal community regarding judicial appointments and seniority criteria.\n\nAccording to legal experts, since the appointing authority of the judges was the President of Pakistan, the judges could app­roach him for the redressal of their grievances.\n\nThey also believed that a judge could file the representation individually, as there was no concept or law for seeking to resolve any dispute related to service matters through a combined representation.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/05074215e7ce28b.jpg",
  "retrievedAt": "2025-10-12T01:17:03.364Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889851/ihc-judges-want-changes-to-seniority-list-undone",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:20:55.000Z"
}
