{
  "title": "Jenin camp going in ‘catastrophic direction’, says UN agency - World - DAWN.COM",
  "author": null,
  "content": "• UNRWA reports 100 houses destroyed, 13 schools closed\n• Hamas says talks start on second phase of ceasefire deal; Israel commits to dialogue\n• Two Israeli soldiers killed in West Bank shooting\n\nGENEVA: The Jenin refugee camp in the occupied West Bank is heading in a “catastrophic direction”, the UN agency for Palestinian refugees said on Tuesday, adding that residents had “endured the impossible”.\n\nThe Israeli military launched a major offensive in the West Bank on January 21 aimed at rooting out Palestinian groups from the Jenin area.\n\nOn Sunday, the army said that it had killed at least 50 fighters since it launched the operation, while the Palestinian health ministry in Ramallah said Israeli forces have killed 70 people in the territory since the start of the year.\n\nThe operation has also seen troops levelling buildings in a refugee camp adjacent to Jenin.\n\n“The camp is going into a catastrophic direction,” UNRWA spokeswoman Juliette Touma told reporters in Geneva.\n\n“Large parts of the camp were completely destroyed in a series of detonations by the Israeli forces.\n\nIt is estimated that 100 houses were destroyed or heavily damaged,” she said, speaking from Amman. “The residents of this particular camp have endured the impossible.”\n\nShe added: “This detonation that happened on Sunday was when children were supposed to go back to school. When it comes to UNRWA, 13 schools in the camp and the surrounding areas continue to be closed. That affected 5,000 kids in that area.”\n\nTouma said UNRWA’s services inside Jenin camp have been interrupted for several months and stopped completely in early December.\n\nUNRWA said it received no prior warning of the detonations, as contact between staff and Israeli authorities is no longer permitted.\n\nSecond phase of talks\n\nTalks have started on the second phase of the Gaza ceasefire deal, a spokesperson for Hamas said on Tuesday.\n\nThe first phase of the ceasefire between Israel and Hamas went into force on Jan 19 after 15 months of war. Phase two of the three-phase deal is intended to focus on agreements on the release of the remaining prisoners and the withdrawal of Israeli troops from Gaza.\n\n“Contacts and negotiation on the second phase have begun,” Hamas spokesperson Abdel-Latif Al-Qanoua said, without providing further details.\n\nIsraeli Prime Minister Benjamin Netanyahu’s office said earlier on Tuesday that Israel was preparing to send a high-level delegation to the Qatari capital Doha to discuss continued implementation of the deal.\n\nThe initial six-week truce, agreed with Egyptian and Qatari mediators and backed by the US, has remained largely intact but prospects for a durable settlement are unclear.\n\nHamas and Netanyahu’s government, which includes hardliners who opposed the ceasefire deal, say they are committed to reaching an agreement in the second phase although each has criticised the other over its implementation.\n\nIsraeli leaders say Hamas cannot remain in Gaza, but the movement has taken every opportunity it could to show the control it still exerts despite the loss of much of its former leadership and thousands of fighters during the war.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a298ee44965.jpg",
  "retrievedAt": "2025-10-12T01:16:32.993Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889827/jenin-camp-going-in-catastrophic-direction-says-un-agency",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:22:34.000Z"
}
