{
  "title": "Salman Akram Raja fears military trial over killing of Rangers men - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Senior counsel Salman Akram Raja has expressed apprehension that he might be arrested and tried in a military court as he has been booked for the murder of three Rangers personnel during PTI’s Nov 26 protest.\n\nHe made these remarks before the Supreme Court Constitutional Bench on Wednesday while representing the father of Arzam Junaid, who was convicted by a military court in connection with the May 9 violence.\n\n“I may have to present my defence to the military court on allegations of killing Ranger personnel,” the counsel said.\n\nOn Tuesday, the seven-judge Constitutional Bench, headed by Justice Amin-ud-Din Khan, resumed the hearing on a set of challenges to the Supreme Court’s order of nullifying the military trial of civilians — involved in violence on May 9 — in Oct 2023.\n\nCompares army trials in Pakistan with India; judges question scope of PAA provisions about civilians\n\nWhile hinting at the “arbitrariness of the system”, Mr Raja said it was the “sweet will of the authorities” to try cases either in the military court or Anti Terrorism Court.\n\nDuring the hearing, judges continued to raise questions over the scope of Section 2(1)(d)(i) and (ii) of the Pakistan Army Act 1952.\n\nThe provisions state that any person outside the purview of the Act can be tried by a military court if they seduce or attempt to seduce an army personnel from his job or commit any offence under the Official Secrets Act, 1923.\n\nJustice Mandokhail observed that the vires of these provisions were never discussed exhaustively in the F.B. Ali judgment, adding these provisions were meant to maintain discipline in the armed forces.\n\nJustice Syed Hasan Azhar Rizvi asked where the trial of civilians — exploited by the enemy intelligence agencies to seduce or commit terrorism — would be conducted in case sections 2(1)(d)(i) and (ii) were set aside.\n\nDuring the hearing, Justice Khan referred to the cases of blasphemy, where an SSP-level officer has to be appointed for investigation.\n\nHe said there had been a lot of “hue and cry” over the misuse of such laws and emphasised that laws were never struck down on the basis of mere misuse.\n\nThe counsel, Mr Raja, argued that Article 175(3) of the Constitution was applied across the board and then compared Pakistan with the Indian military justice system, where a tribunal consisting of retired judges of the Supreme Court and high courts and a retired major general was set up to hear appeals against the military trials of civilians.\n\nThe tribunals’ decision can also be challenged before the Indian Supreme Court, he said.\n\nBoth Pakistan and India shared a common British military justice system, but the Indian system has ensured the provision of an independent appeal forum, he added.\n\nIn India, the military justice system is open for judicial review, Mr Raja remarked, adding that tribunals issue speaking orders against which appeals are available. The military justice system is “no longer a dark hole in India”.\n\nHowever, Justice Muhammad Ali Mazhar observed that the Indian Army Act has no sections equivalent to sections 2(1)(d)(i) and (ii) of PAA.\n\nThey have also not done away with the court martial system even though they have provided the right to appeal through the tribunal.\n\nIn Pakistan, a commanding officer convenes court martial proceedings, the counsel replied but conceded that these sections were unique to Pakistan only.\n\nThe judicial functions should be performed only by tribunals, the counsel said, adding when the civilian trials were done by the military courts the way they were done in May 9 cases, the constitutional guarantee to fair trial under Article 10A and Article 175(3) goes away.\n\n“Heavens will not fall if Article 175(3) is invoked in favour of the civilians,” the counsel emphasised.\n\nJustice Mandokhail questioned whether the court could invoke Article 187 stipulating “complete justice” in appeals under consideration.\n\nIn reply, the counsel said the court always has the power to invoke Article 187 to do complete justice.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:22:47.980Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889815/salman-akram-raja-fears-military-trial-over-killing-of-rangers-men",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:21:35.000Z"
}
