{
  "title": "Stocks suffer fourth straight loss - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: On the eve of the Kashmir Day holiday, the stock market remained under institutional selling pressure amid a lack of positive triggers and uncertainty on the economic front, dragging the benchmark KSE 100 index below 112,000, extending the losing streak to a fourth consecutive session on Tuesday.\n\nAli Najib, Head of Sales at Insight Securities, said bulls came with a bang globally after Mr Trump’s tariff pause decision on Mexico and Canada. Worldwide equity markets welcomed it, and the PSX behaved similarly, commencing the day on a jubilant note.\n\nStrong investor sentiment was observed as across-the-board buying helped the benchmark index to gain 904 points, pushing the KSE100 index to an intraday high of 113,649.\n\nHowever, profit-taking by nervous investors turned this joy into a shortlived phenomenon and compelled the index to shed earlier gains.\n\nUltimately, the index settled at 111,935, losing 810 points or 0.72pc day-on-day.\n\nTopline Securities Ltd attributed this decline to local institutional selling.\n\nThe drop was primarily driven by Engro Holdings, Millat Tractors Ltd, Fauji Fertiliser, Bank Al-Habib AHL, and Pakistan Petroleum, which wiped out 430 points from the index.\n\nConversely, Sazgar Engineering, National Bank, Mari Energies, Adamjee Insurance Company Ltd and TRG Pakistan cumulatively added 186 points.\n\nAhsan Mehanti of Arif Habib Corporation said stocks closed bearish on global trade war worries after US tariffs and a slump in international crude oil prices.\n\nHe added that political noise, rupee instability, suspension of USAID, and concerns for foreign outflows kept fuelling bearish sentiments.\n\nDespite the downturn, the overall market activity remained strong as the trading volume recovered 8.68pc to 436.32 million shares while the traded value rose 14.12pc to Rs23.22bn day-on-day.\n\nStocks contributing significantly to the traded volume included WorldCall Telecom (54.61m shares), Cnergyico PK 21.09m shares), K-Electric (20.62m shares), National Bank (16.34m shares) and The Bank of Punjab (16.29m shares).\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a296aca28b0.jpg",
  "retrievedAt": "2025-10-12T01:16:49.160Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889816/stocks-suffer-fourth-straight-loss",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:22:12.000Z"
}
