{
  "title": "Kashmir question - Newspaper - DAWN.COM",
  "author": null,
  "content": "ALMOST eight decades since Pakistan and India became sovereign states, the Kashmir issue remains unresolved, bedevilling ties between the neighbours, with the people of the disputed region unable to exercise their right to self-determination.\n\nMoreover, since the events of August 2019, India has tightened its grip over the occupied territory, removing the limited rights the held region had under the Indian constitution. Though the hard-line BJP government may think the Kashmir dispute is a thing of the past, the fact is that the territory remains internationally disputed, and no amount of constitutional tinkering and attempts to alter occupied Kashmir’s demography by New Delhi can change this reality.\n\nThe BJP government may like the world to think that it has transformed held Kashmir into a proverbial heaven on earth, but the dark reality of the Indian occupation cannot be hidden.\n\nWhile Pakistan has long been raising the Kashmir issue at international forums, neutral observers, too, have pointed out the Indian state’s excesses in the disputed region.\n\nFor example, Human Rights Watch has said that journalists in IHK remain vulnerable to state violence, including physical assault and the threat of “fabricated criminal cases”. It adds that “hundreds of Kashmiris”, including journalists and human rights activists, remained in detention.\n\nOn the other hand, Amnesty International has also criticised India’s “arbitrary detentions” and “stringent anti-terror laws” in IHK. It also says that repression in the region has escalated since Article 370 was scrapped in 2019. These descriptions are a mere glimpse of the ugly reality of the occupied region.\n\nThe fact is that the only principled and peaceful solution to the Kashmir dispute remains the plebiscite the UN Security Council called for in 1949, after India had taken the Kashmir case to the world body.\n\nOver the decades, no Indian government has taken any serious steps to implement the UN’s resolution, with the result that the Kashmir dispute has become a source of permanent discord in the subcontinent.\n\nHowever, until there is a long-term solution in light of the aforementioned resolution, an alternative option for peace in Kashmir and the entire subcontinent would be the implementation of the four-point plan hammered out during the Musharraf era.\n\nThat scheme envisaged a ‘soft’ LoC, with free movement of people and goods across Kashmir, and eventual demilitarisation.\n\nIf both sides, particularly India, are serious about peace, reviving this formula could be the starting point for fresh negotiations. The important thing is to continue the dialogue process, on bilateral disputes as well as the Kashmir issue, and move beyond rigid positions.\n\nOn Kashmir Solidarity Day today, Pakistan should reaffirm its support for the people of Kashmir. It should also keep the door open for India in case it decides to resolve the Kashmir question through dialogue.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:16:06.455Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889857/kashmir-question",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:34:55.000Z"
}
