{
  "title": "Teachers protest abolition of 25pc tax rebate - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Teaching and non-teaching staff of Federal Directorate of Education (FDE)-run schools and colleges on Tuesday staged a protest demonstration against the federal government for the abolition of a 25pc tax rebate and seeking education allowance for all employees working in the education sector of Islamabad.\n\nThe massive protest demonstration was staged by Joint Action Committee (JAC) headed by President of Schools Heads Association Fazal-i-Mola.\n\nTeachers from various universities, including QAU, IIUI and Arid Agriculture University also participated in the protest.\n\nHolding placards and wearing black armbands, the protesters demanded the government revive the 25pc tax rebate and provide education allowance to all employees of FDE-run institutions.\n\nSpeaking on the occasion, Fazal-i-Moula said that it was unfortunate that the government instead of increasing salaries of teachers had abolished the 25pc tax rebate. He said in other departments, employees get several allowances, but education sector was being ignored.\n\nGeneral Secretary Federal Government College Teachers Associations Tahir Bhatti also demanded the government for reversal of the decision to abolish the tax rebate.\n\nHe said at a time when salaries and allowances of lawmakers had been increased manifold, the 25pc tax rebate for teachers had been abolished. He said on the pattern of the health allowance, all teaching and non-teaching staff of FDE-run institutions should be given an education allowance.\n\nHe said that currently teachers get only Rs1000 per month teaching allowance which should be increased to 50pc of the basic salary while transport allowance, which is only Rs5000 per month, also needs an increase.\n\nRepresenting Central Academic Staff Association of Model College (CASA), Professor Rasheed Ahmed Khan demanded the government to resolve issues being faced by teaching and non-teaching employees and immediate restoration of the tax rebate.\n\nBesides others, former president of School Teachers Association Malik Ameer Ahmed Khan and president of non-teaching staff Sardar Sadique also spoke on the occasion.\n\nThe protesters demanded the government resolve their issues within a week otherwise they would go for a boycott of classes.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:22:15.155Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889782/teachers-protest-abolition-of-25pc-tax-rebate",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:22:56.000Z"
}
