{
  "title": "The pursuit of Kashmir - Herald",
  "author": null,
  "content": "Prime Minister Nawaz Sharif takes the floor at the United Nations General Assembly (UNGA) and makes a speech far more direct than most in the audience expect. “Since 1947, the Kashmir dispute has remained unresolved. [The] UN [United Nations] Security Council resolutions have remained unimplemented. Three generations of Kashmiris have only seen broken promises and brutal oppression. Over 100,000 have died in their struggle for self-determination. This is the most persistent failure of the United Nations,” he states.\n\nThis is not the only time in recent weeks that Pakistan has raised the Kashmir issue. On October 22, 2015, when Sharif meets President Barack Obama at the White House, the K word makes a conspicuous entry into their joint statement: “The leaders emphasised the importance of a sustained and resilient dialogue process between the two neighbors aimed at resolving all outstanding territorial and other disputes, including Kashmir, through peaceful means and working together to address mutual concerns of India and Pakistan regarding terrorism.”\n\nIndia’s reaction has been predictably dismissive to this renewed vigour in Pakistan’s pursuit of Kashmir. “India has always desired resolution of all issues with Pakistan bilaterally through dialogue and peaceful means,” is how a spokesman of India’s Ministry of External Affairs reacts to the joint statement issued after the Sharif-Obama meeting. The curt rejection of suggestions that outsiders may have a role in the resolution of the Kashmir issue is quite obvious in the spokesman’s rejoinder.\n\nIslamabad and New Delhi are certainly saying nothing new as far as their respective stances on Kashmir are concerned. Yet it is quite clear that the conflict in and about this long-disputed region is back on centre stage — and not entirely because of Pakistan’s efforts. Kashmiris have launched a non-violent agitation movement since 2010 amid arrests, custodial deaths and relentless military oppression. They have, indeed, paid a very heavy price for many decades to get their story across to the world.\n\nFor the most part, Kashmir has been known to people through state representations. This is true for Kashmir’s history and perhaps equally so for the policies of the two states towards it. Both Islamabad and New Delhi ceaselessly try to expunge from public imagination anything that questions, albeit remotely, their official narratives on Kashmir even when the two narratives sometimes are as divergent from truth as they are from each other. Some of their most glaring contradictions and lies came to the surface for the first time when India’s Ministry of External Affairs recently declassified its archived documents, covering 50 years of the country’s foreign relations starting with 1947.\n\nKashmir’s story, as presented here on, is mainly reconstructed through those declassified documents. Where the documents are not available, especially for the post-1997 era, the narrative is continued by citing other primary sources. What follows is a historical account of the tragedy of Kashmir. A tragedy that stems from a ceaseless contestation for a pursuit based on two arbitrary – and conflicting – claims put forth by Pakistan and India.\n\nIt was supposed to be a new world that Lord Mountbatten traversed in those last months of 1947 as British India’s last viceroy. The Indian subcontinent, so long the jewel in Great Britain’s imperial crown, had been born anew and transformed into two sovereign states. And yet, as he made his way from Delhi to Karachi, it must have occurred to Mountbatten how little things had actually changed. Decades of nationalist struggle, two world wars, a formal transfer of power and millions of deaths later, he still had to mediate between the leaders of the new subcontinent. They were still grappling with – and fighting over – a number of unanswered questions. Perched on the very top of those questions was the one of Kashmir.\n\nThe British Raj in the Indian subcontinent had always been a highly complicated affair. To run an imperial enterprise spread over half a continent, the British authorities had to create and maintain several types of territorial arrangements, much like the Mughals before it. The British had to weave an intricate web of local collaborations that included a buffer zone between India and Afghanistan, hundreds of princely states of various sizes, that had a certain degree of legal and administrative autonomy from the Raj within their borders, and many directly administered provinces and territories. The decolonisation process spelled the unravelling of this web.\n\nThe two new states – India and Pakistan – that emerged from the decolonisation process could not operate under the same legal, political and administrative paradigm which the British had. The geographical unity of the two states could only be maintained if they came up with new political and legal arrangements to integrate swathes of territory, both big and small, that once belonged to the princely states. In order to deal with this challenge, the two states embarked on projects to absorb such territories into their respective borders as quickly as possible. There was no universally acknowledged single instrument to achieve this. Both states used a similar repertoire of techniques — negotiating accession treaties, making deals with local elites and, in certain cases, sending in troops to snuff out opposition.\n\nThe Kashmir crisis was born out of the discontents of the twin processes of decolonisation and territorial integration by India and Pakistan. Jammu and Kashmir was a princely state which the East India Company had annexed in 1846 and then transferred to Gulab Singh of the Dogra dynasty for a payment of 7,500,000 rupees. As the British exit from the subcontinent became apparent, the then ruler of Jammu and Kashmir, Hari Singh, wished to remain independent. This was obviously not going to be acceptable to either India or Pakistan. Four major rivers originate from the Himalayas located in Kashmir and it also shares a border with China — the two factors that make it a strategically crucial region. In other words it is a prized territory. Both states, therefore, formed strategies to lay claim to it.\n\nIndia’s deputy prime minister Sardar Vallabhbhai Patel received an urgent letter from Prime Minister Jawaharlal Nehru regarding the situation in Kashmir. Nehru was convinced that Pakistan was preparing to infiltrate the region and foster an insurgency. He also knew Maharaja Hari Singh’s forces could not do much to stop infiltration without help from India. More importantly, Nehru realised, Hari Singh’s regime could not be sustained if its own people went against it.\n\nSheikh Abdullah headed the largest political party in Kashmir – the National Conference – but he was a staunch opponent of the Dogra dynasty. He had initiated a “Quit Kashmir” movement before the British left India in 1947 and, hence, was imprisoned in May 1946. Nehru wanted him freed. He noted in his letter that Sheikh Abdullah was eager not to join Pakistan. His opposition to Hari Singh, therefore, was not tantamount to support for accession to Pakistan. If the Indian government could work out a rapprochement between Hari Singh and Sheikh Abdullah, Nehru suggested to Patel, Kashmir’s accession to India would become easier.\n\n“It seems to me urgently necessary, therefore, that the accession to the Indian Union should take place early. It is equally clear to me that this can only take place with some measure of success after there is peace between the Maharaja and the National Conference and they co-operate together to meet the situation,” Nehru wrote. “…Abdullah is very anxious to keep out of Pakistan and relies upon us a great deal for advice.” But, at the same time, he “cannot carry his people with him unless he has something definite to place before them. What this can be in the circumstances I cannot define precisely at the present moment. But the main thing is that the Maharaja should try to gain the goodwill and cooperation of Abdullah,” Nehru added. “It would be a tragedy if the National Conference remains passive owing to frustration and lack of opportunity.”\n\nNehru’s predictions about a likely infiltration into Kashmir were proven true. By October 1947, tribal militias from Murree, Hazara and parts of the Federally Administered Tribal Areas (Fata) raided the valley through the Poonch area and began a widespread campaign to destabilise the Maharaja’s regime. The Maharaja looked to India for help which he got only after promising to sign an instrument of accession in favour of New Delhi.\n\nWriting to British Prime Minister Clement Attlee, Nehru argued that the Indian intervention in Kashmir was a response to an urgent appeal from the government of Jammu and Kashmir for help against tribal invaders who, he claimed, were aided and abetted by the Pakistani government.\n\nPakistan denied any involvement. Prime Minister Liaquat Ali Khan insisted the actions by the tribesmen were an almost instinctive response to the atrocities being committed against Muslims in Kashmir. In his correspondence with Nehru, he argued that the tribesmen were helped by local Kashmiri Muslims who sought liberation. Liaquat Ali Khan also pointed out that the government in Kashmir had manipulated the situation in order to accede to India against the wishes of its own people. For Governor General Muhammad Ali Jinnah, the accession was nothing short of a coup d’etat.\n\nA different story hid behind these public statements. On November 1, 1947, Mountbatten and his chief of staff, Lord Ismay, travelled to Lahore and met separately with both Jinnah and Liaquat Ali Khan. When he recorded the daily proceedings in his notebook, Mountbatten could not help but say the tribesmen had been acting on the express and direct command of the Pakistani leadership. Implicitly, Jinnah accepted as much to Mountbatten. “When I asked him how the tribesmen were to be called off, he said that all he had to do was to give them an order to come out and to warn them that if they did not comply, he would send large forces along their lines of communication. In fact, if I was prepared to fly to Srinagar with him, he would guarantee that the business would be settled within 24 hours. I expressed mild astonishment at the degree of control that he appeared to exercise over the raiders,” Mountbatten wrote.\n\nPakistani strategy was to create enough pressure on the Maharaja to abdicate, to then claim that the region should become a part of Pakistan because most people living in Jammu and Kashmir are Muslims. The Pakistani government knew only an indigenous revolt could preclude India from holding on to Kashmir. But therein lay Pakistan’s greatest challenge: The Muslim League had virtually no presence in the state of Jammu and Kashmir and Pakistan had no guarantee that the people of Kashmir would overwhelmingly vote to be part of Pakistan.\n\nPakistani leadership was aware of the problem which is why both Jinnah and Liaquat Ali Khan consistently rejected a plebiscite in Kashmir as long as Indian troops were there. “If the India Government [is] allowed to act…unfettered as [it pleases] by virtue of having already occupied Kashmir and landed their troops there, then, this El Dorado of plebiscite will prove a mirage,” read an official Pakistan statement. During negotiations with Mountbatten, Jinnah strongly objected to having a plebiscite even under the auspices of the UN, maintaining that the presence of Indian troops as well as Sheikh Abdullah’s tilt towards India would deter the average Muslim in Kashmir from voting for Pakistan. In a letter to Attlee, Liaquat Ali Khan described Sheikh Abdullah as a “quisling” and a “paid agent of the Congress for the last two decades”.\n\nIn a December 1947 meeting with his Indian counterpart, Liaquat Ali Khan also questioned the efficacy of a voting process in Kashmir while it was under an India-sponsored administration. “…[T]he people of Kashmir were bound to vote, in the plebiscite, in favour of whatever administration was then in power. The Kashmiris were an illiterate and oppressed people, and they would be bound to favor the authority in possession. If an Englishman went as administrator, they would vote to join the United Kingdom,” he said.\n\nThat not only the Maharaja but also the National Conference favoured India was the advantage Nehru wanted. In his correspondence with Indian politicians, he pointed out that any activity by Pakistan would look illegal and unacceptable after Kashmir had acceded to India. He was right. After the Maharaja acceded to India on October 26, 1947, New Delhi was successful in portraying to the rest of the world that Pakistan-supported militant activity was an act of belligerence. This would remain the thrust of India’s case against Pakistan for the times to come.\n\nThe accession also formed the basis for a justification of India’s military presence in Kashmir. The Indian government argued it was well within its right to send troops to drive away outsiders from what it considered Indian territory. When Pakistan contended that it would only attempt to ensure the withdrawal of tribal militias if that coincided with a simultaneous withdrawal of Indian forces from Kashmir, the Indians simply refused, arguing that the presence of the two forces could not be treated the same way.\n\nBy the end of 1947, India decided to apprise the world of what it called Pakistani intrusion in Kashmir. In a meeting with Mountbatten in December that year, Nehru suggested India should raise the issue at the United Nations Security Council (UNSC), “charging Pakistan with aggression and asking UNO [United Nations Organization] to call upon Pakistan to refrain from doing so”. If the Security Council failed to make Pakistan stop its “aggression”, he warned, “we would have to take action ourselves in such a manner as we thought fit to stop this aggression at the base.”\n\nWhen Mountbatten suggested that the “UNO [should] supervise and carry out a plebiscite as we had previously declared” once “law and order has been restored”, Nehru replied with a definitive no. When India had made a unilateral offer for a plebiscite after partition, he argued, Pakistan rejected it and instead chose to support chaos in the valley. It was that chaos that made the plebiscite unfeasible, he declared.\n\nPakistan’s early policy in Kashmir obviously failed to result in any legitimacy for Pakistan’s claim. Within its borders, however, the Pakistani state was incredibly successful in cementing Kashmir as an invaluable, indispensable and eternal part of the Pakistani national imagination. Primarily, this was a function of fervent propaganda campaigns carried out by newspapers such as Dawn, Jang, Nawa-i-Waqt and Zamindar as well as through radio broadcasts and publishing special pamphlets, books and plays. Several films produced in this era also carried an explicit message that Kashmir belonged to Pakistan and it was incumbent on the Pakistani state and society to take necessary measures to realise its integration within Pakistan.\n\nBoth Islamabad and New Delhi ceaselessly try to expunge from public imagination anything that questions, albeit remotely, their official narratives on Kashmir even when the two narratives sometimes are as divergent from truth as they are from each other.\n\nThe overarching theme pervading this propaganda was the two-nation theory that Muslims were different from the Hindus and, therefore, the two cannot live together. Within a few short years after independence, the Pakistani media had convinced the citizenry that pursuing Kashmir through any means was not only legitimate, it was also noble.\n\nThe argument was simple: Kashmir was a Muslim majority area and hence could not be ruled by Hindus. By promoting such a narrative, the Pakistani state ensured that the Kashmir question was enmeshed with the question of Pakistani identity and that both questions were framed in religious terms.\n\nThis narrative, however, translated into little bargaining power during negotiations with India. Unsurprisingly, when Liaquat Ali Khan exchanged letters with Indian and British leaders, he seldom made a reference to Islam or jihad. His arguments, instead, rested entirely on the Kashmiris’ right to self-determine their political future. Pakistan posited that India had forcibly and undemocratically annexed Kashmir without taking the will of the people into account.\n\nIn the age of decolonisation, self-determination was considered a universal right and carried far more weight than the two-nation theory. Highlighting its absence as the core reason for the problem in Kashmir, indeed, forced India on the defensive. On several occasions, Nehru had to give assurances that a plebiscite would eventually take place and that the mandate of the Kashmiri people will be respected.\n\nThis apologetic Indian reaction convinced the Pakistani ruling elite that if it needed to force India to a negotiating table, it needed help — from powerful friends.\n\nSir Gladwyn Jebb, the British representative to the UN, handed a draft resolution on Kashmir to his Indian counterpart Vijaya Lakshmi Pandit who hurriedly wrote to Nehru, telling him that Britain and the United States were prepared to take the matter to the UNGA if India did not move within the next 30 days. A debate in the General Assembly and a possible resolution against India could be a national embarrassment, she said.\n\nNehru was aghast. “Have the English learnt nothing at all during the last few years? I am not thinking so much of their draft resolution, although that is bad enough, but rather of the way they think they can bully us. If there is one thing that all the powers in the world cannot do, it is to bully us,” he wrote in his feverish reply to Pandit.\n\nNehru’s frustration with Britain and the US had been growing for the past couple of years. He believed British and American patronage was the chief reason why Pakistan was being abrasive towards India. The Pakistani establishment, indeed, was seeking political and military support from the two countries in return for strategic loyalty. Quickly though, the Pakistani elite realised that its efforts would have to be directed mostly towards the US as Britain had little economic and political clout left in the post-World War II era. While the sun was setting on the British Empire, the American pursuit of hegemony in the postcolonial world had just begun.\n\nThis period was also the beginning of the Cold War, the ideological conflict between the US and the Soviet Union that would last for the rest of the 20th century and engulf the entire world. Policymakers in the White House and the State Department were deeply anxious to enlarge the American sphere of influence to ensure that newly formed states did not gravitate towards the Soviet camp.\n\nThe American reaction to the first phase of the Kashmir crisis was to impose an arms embargo on both Pakistan and India. But this policy had to change with the beginning of the 1950s. As the realities of the Cold War took centre stage, American policymakers aggressively pursued the policy of “containment” against the “communist virus” and they found in Pakistan a willing partner in their pursuit of this policy in the subcontinent.\n\nIn 1950, Liaquat Ali Khan publicly admitted that Pakistan would “seize the opportunity eagerly” should the US decide to give it as much importance as it gave to Turkey. Keen on developing a stronghold in the Middle East, the Americans were planning a multilateral security arrangement among Iran, Iraq and Turkey, their allies in the region. Given its geographical proximity to the Middle East, Pakistan could be included in this collective.\n\nWhile Britain had reservations about including Pakistan in a Middle East collective and warned the Americans about the possible negative effects it might have on the relations between Washington and New Delhi, policymakers in the US remained determined to make Pakistan a client state. For its part, Pakistan received strong warnings from Moscow and Beijing against such an arrangement but the Pakistani establishment was adamant on securing military aid from the US.\n\nWhen American Secretary of State John Foster Dulles visited Pakistan in the summer of 1953, he was deeply heartened to see Pakistan’s enthusiasm to ally with his country. In December that year, American Vice President Richard Nixon visited the subcontinent and concluded that America needed to sacrifice a potential relationship with India for one with Pakistan. In 1954, Pakistan became part of the South East Asian Treaty Organization (Seato) that also included Australia, France, New Zealand, the Philippines, Thailand, the UK and the US; in early 1955, it joined the Baghdad Pact along with Iran, Iraq, Turkey, Britain and the US.\n\nWhile the rebel in him might have been defiant, the politician in Nehru understood that these alliances had changed the power dynamics in South Asia. Equally importantly, the situation in Kashmir was changing and support for Pakistan was emerging among the Kashmiris. In 1953, Nehru acknowledged that a pro-Pakistan lobby was present in Kashmir valley alongside a pro-India one.\n\nA number of political actors, including Sheikh Abdullah – who, by then, had become the prime minister of Jammu and Kashmir – also started imagining a possibly independent Kashmir. He went to the extent of stating that his government was not bound by the accession treaty signed by the Maharaja. Many in India’s ruling Congress party, who considered him a friend, were shocked by the statement. New Delhi could simply not afford a popular challenge to the accession treaty. Sheikh Abdullah was, therefore, sentenced to 11 years in prison under what became the infamous “Kashmir conspiracy case”.\n\nAll these developments forced Indian leaders to seek a lasting, internationally-recognised agreement over Kashmir. In May 1955, Nehru met with Pakistan’s Prime Minister Mohammad Ali Bogra and his interior minister Iskander Mirza in Delhi. Senior Indian minister Maulana Abul Kalam Azad was also present during the talks which lasted for three consecutive days.\n\nDespite tumultuous relations between the two states, the air in the negotiation room was gracious, even hopeful. Nehru frankly admitted that the American military aid had changed security circumstances in the subcontinent since “it brought the prospect of world war to our door”. Bogra, however, assured his Indian counterpart that Pakistan desired nothing but friendliness with its neighbour to the east. At one point, he even said: “India [is] a big country, the big sister of Pakistan…India should, therefore, be generous and magnanimous”.\n\nWhile the two states were putting up a rare show of mutual understanding, the voice of the Kashmiris was conspicuously missing from their discussions. The real question being discussed was a partition of Kashmir. Before the Delhi meeting, Pakistan’s Governor General Malik Ghulam Muhammad had informally proposed that a large tract of land north of the Chenab River should be transferred to Pakistan and that Kashmir, as a whole, should come under some sort of a joint supervision by the two states.\n\nFor Nehru, these proposals were “completely impractical”. The Indian side could never give up territory because the Indian constitution stipulated that the government in Delhi could not alter the boundaries of the state of Jammu and Kashmir without the consent of the state’s own legislature.\n\nWhile Bogra agreed that the Governor General’s proposals were unfeasible, he emphasised that he could not return to Pakistan empty-handed. “Something had to be done to make [the people of Pakistan] feel that they had gained something,” is what Bogra told Nehru who said India could transfer only the Poonch district to Pakistan. Bogra and Mirza sombrely announced that “if they accepted the Indian proposal, they would be blown sky-high in Pakistan”.\n\nTheir concerns were not exaggerated. Many political and religious leaders in Pakistan were mobilising people for an Islamic war in Kashmir. On August 14, 1953, Chaudhry Khaliquzzaman, then governor of East Pakistan, exhorted the Pakistanis to “keep their swords shining and horses ready”. Feroz Khan Noon, the then chief minister of Punjab, said in a public meeting in Lahore, two days later, that the Indian government had gone “back on [the] international understanding between the two countries” by sending troops into “a predominantly Muslim country — Kashmir”.\n\nSuch provocations, mirrored relentlessly by the Pakistani press and radio, could only lead to an atmosphere full of deep acrimony where conflict was celebrated and peace was mocked as a manifestation of weakness. In 1954, a pamphlet entitled Fatwa was published in Pakistan which contained virulently anti-India contents with reference to Kashmir. The Indian High Commission in Pakistan requested the Pakistani government to withdraw the pamphlet. The request was turned down.\n\nAlso read: Enforced disappearances: The plight of Kashmir's 'half widows'\n\nIn these politically charged circumstances, Bogra and Mirza could not make any concessions without risking the fall of their government. The same militaristic narrative that the Pakistani state was actively promoting, thus, circumscribed its negotiating power.\n\nWhen the two sides returned to the negotiating table the next day, Bogra produced a map of Jammu and Kashmir. It was divided into two parts: the Hindu areas which amounted to a few districts around Jammu were coloured yellow while the rest of the map was coloured green to indicate the Muslim majority areas. The Pakistani delegates suggested a “large area of the Jammu province including Poonch, Riyasi, Udhampur” could go to India along with the “possible transfer of Skardu to India”.\n\nAzad, at that point, stated that India could at best agree to concede some parts of Mirpur district alongside Poonch to Pakistan. For Nehru, the acceptance of Pakistani proposals was as good as an Indian “defeat and the dictation of terms” by Pakistan which, he said, no Indian government could accept. Mirza responded by stating that all he could do was report back to his government in Karachi. And on that inconclusive note, the negotiations ended.\n\nAlthough the talks achieved nothing, they clearly depicted that Kashmir had turned into a territorial dispute. The ultimate object on the negotiating table was a map — a cartographic representation of space bereft of people and their history, identities, voices and relationships. The Kashmiri ‘self’ – which Pakistan ostensibly wanted to guard under the banner of Islam and which India wanted to protect under its constitution – was actually considered wholly fluid and expendable, something that could be cut up by the two states wantonly. The important question was not whether to cut Kashmir or not — it was how to go about cutting it. And so it has remained since then.\n\nA young Zulfikar Ali Bhutto was hunched over a sprawling map of Kashmir, surrounded by the delegates he was leading as Pakistan’s foreign minister. They were in the middle of the third round of talks with their counterparts from India. The first two rounds had taken place in Rawalpindi and Delhi. The agenda was now a familiar one — the drawing of a boundary that could divide Kashmir between India and Pakistan.\n\nThe Pakistani delegation was anxious. “We must draw lines on the map,” they insisted. As ever, it seemed an impossible exercise. Swaran Singh, India’s foreign minister and the head of the Indian delegation, drew a line on the map indicating his side’s “readiness to concede in favor of Pakistan the rich forest areas in the north, on both sides of the Kishenganga River”. He also suggested that India was ready to concede some more areas in the west and north of the Kashmir valley.\n\nThe Pakistani negotiators appeared shocked at the meagreness of his offer. Bhutto prepared a counter offer — only Kathua, a district on the border with Punjab, and some adjoining areas from other districts would go to India while Pakistan would be entitled to all the others areas up to Ladakh in the north-east and including Srinagar, Jammu, Udhampur and Riyasi districts. The Indians immediately shot down these suggestions as “ridiculous”.\n\nThe invasion by the “Azad Forces” led to massive retaliation by the Indian military not only against Pakistan but also within the state of Jammu and Kashmir. An intense military campaign was started to rid Kashmir of outside elements as well as any local pro-Pakistani activists.\n\nBhutto perhaps believed that placing such a huge demand would compel the Indians to revise their original offer, convincing them to give up more territory. Singh, however, was determined not to cede anything more than he had offered. He said he was willing to accept an end to the talks, seeing little point in another round scheduled in Calcutta that March.\n\nThe angst, the arguments and the outcome — nothing that happened in Karachi was unexpected but the world in which these talks took place was being critically transformed.\n\nIn 1958, Field Marshal Ayub Khan launched a coup d’état against the civilian government and set himself in power as the Chief Martial Law Administrator of Pakistan. His martial law regime was bent upon consolidating the central authority in Pakistan, reigning in recalcitrant provinces and establishing its writ at all costs. And, despite all the trouble at home, Kashmir figured prominently in the military government’s imagination. Critical to this pursuit was the acquisition of military aid and international support against India. The US remained a crucial supporter in this regard and the Pakistani state continued to identify itself as a strategic ally of the West against the “menace of communism”. Relations between India and Pakistan also soured further under the martial law regime despite some high-level talks, including a one-on-one meeting between Nehru and Ayub Khan. By 1961, public confrontations between the two states peaked with accusations flying between them.\n\nThat year also marked the inauguration of John F Kennedy as the 35th president of the United States. His administration was keen on a rapprochement with India. Pakistan, obviously uncomfortable with such a policy, realised it could not rely merely on the United States and needed to expand its international support base. The Soviet Union was across a vast ideological gulf from Pakistan and, more importantly, had very friendly relations with India. Pakistan, therefore, began courting the People’s Republic of China. Beginning with Nikita Khrushchev’s denunciation of Stalin’s legacy, China-Soviet relations had been rapidly worsening. By 1961, there was an official parting of ways. During this time, relations between China and India also experienced a sharp decline owing to a series of conflicts on the Himalayan border between the two countries. These conflicts eventually resulted in the 1962 Sino-Indian War.\n\nChina’s anti-India stance as well as its victory in the 1962 war made China a possibly important ally for Pakistan. Internal correspondences among Indian officials in the early 1960s show their anxiety over a possible Pakistan-China secret deal and a possible Chinese involvement in Kashmir. Rajeshwar Dayal, India’s high commissioner in Pakistan, went to the extent of warning Ayub Khan against befriending China. “I warned the President [of Pakistan] that if China was no friend of ours, it was much less a friend of Pakistan’s. Bringing China into the Kashmir dispute would make the problem completely insoluble, for the Chinese would be playing only their own game.” He then reminded Ayub Khan of “his own views regarding China’s aggressiveness and expansionism” and his declaration in November, 1959, “that Pakistan would not take advantage of India’s difficulties with China”.\n\nIndian fears were confirmed when, during the very first round of Pakistan-India talks in early 1963, the Pakistani side announced having reached an agreement with China on Kashmir’s border with the Chinese region of Sinkiang (now spelled Xinjiang). The Indian delegation was shocked not only at the nature of the announcement but also over its odd timing.\n\nTensions rose between India and Pakistan exponentially when the China Pakistan Boundary Agreement was officially signed on March 2, 1963. The agreement sought to “delimit and demarcate” the boundary between China’s Xinjiang region, and its proximate regions, which formed part of Kashmir under Pakistan’s control and resulted in the demarcation of a new international border and a territory exchange between Pakistan and China. As a result of these developments, China ended up controlling all of the present-day Xinjiang region.\n\nThrough the agreement with China, Pakistan made two noteworthy gains. Firstly, it consolidated its relationship with China, signalling to both India and the United States that Pakistan had a powerful friend in the region. Secondly, by negotiating – and reaching an agreement – with China on a border in Kashmir, Pakistan was able to establish its sovereignty over those parts of Kashmir which it controlled. This was a major setback to Indian claims that the entirety of Kashmir was an indivisible whole and an unquestionable part of India. Once China established its writ over the areas it had received through the agreement with Pakistan, it became virtually impossible for India to reclaim them without going to war with China.\n\nPolitical leadership in India, therefore, was appalled by the Pak-China agreement and saw it as a proof of Pakistani insincerity. Almost immediately the matter was taken up in Lok Sabha, India’s lower house of parliament. Nehru told the parliamentarians that Pakistan’s official claims of having given up just over 2,000 square miles of territory to China were not correct. China, indeed, had gained control over 13,000 square miles — almost all those parts of Xinjiang region which during the British Raj in India had been included in Kashmir. This, he said, became possible because Pakistan had surrendered “that part of the Indian territory in Jammu and Kashmir which is under Pakistan’s illegal occupation”.\n\nCountering the speeches being made in the Indian parliament, Bhutto addressed Pakistan’s National Assembly and argued that the Indian attitude “confirms our genuine apprehensions that there has been no real desire on the part of India to reach an honourable and equitable settlement with us on Kashmir”.\n\nAs the stalemate continued, the political situation within Pakistan was rapidly deteriorating. Indian intelligence concluded, and rightly so, that Ayub Khan’s regime found itself in hot waters. In a secret letter written to Commonwealth Secretary Y D Gundevia, India’s high commissioner in Pakistan, G Parthasarathy, quoted a highly credible Pakistani source – mentioned in the letter as Colonel Mohtarram – as saying that Ayub Khan was increasingly becoming unpopular among the masses as well as in the army. His unpopularity in the army could have been because of his corrupt dealings, his involvement in partisan politics and his ill treatment of senior officers. The Pakistani source believed an underground campaign against Ayub Khan was being run from England and was gaining strength. Given his desperate position within Pakistan, the source apprehended, Ayub Khan “might start the so-called ‘Jihad’ against India in the hope of consolidating his own position.” The Indians, the colonel suggested, “should therefore be prepared to meet such a situation”. He also warned that Pak-China relations were likely to deepen.\n\nThese reports caused grave apprehensions in New Delhi. An unstable regime in Pakistan could create trouble in Kashmir, especially if there had been some secret arrangement between Pakistan and China. On July 24, 1963, Bhutto gave a long and fiery speech in the National Assembly and claimed that “an attack by India on Pakistan would involve the territorial integrity and security of the largest State in Asia”. This strengthened suspicions in New Delhi that a secret pact actually existed between China and Pakistan.\n\nAlso read: Neelum Valley: The sapphire trail\n\nThe Indians took the matter to the Americans, raising alarm over how a Pak-China alliance could wreak havoc in Kashmir. The Americans, however, assured the Indians that they had been guaranteed by the Pakistanis that there was no secret deal between Pakistan and China.\n\nThe American assurances did little to assuage Indian concerns. Over the course of the next year, relations between India and Pakistan plummeted even further. In early 1964, India redesignated the heads of state and government in Jammu and Kashmir as “governor” and “chief minister” – instead of Sadr-e-Riasat and Prime Minister – and called for the hoisting of the Indian flag on government buildings in the state instead of the state’s own flag. In September that year, Pakistan followed suit in its part of Kashmir by replacing the Azad Kashmir flag at the President’s House in Muzzafarabad with the Pakistani flag.\n\nTensions burst forth in the summer of 1965 when guerrilla fighters – hailed as “mujahideen” in the Pakistani press – invaded Indian-controlled parts of Kashmir. According to Indian sources, “5,000 armed men, trained and supported by the Pakistani army had been sent in across the cease-fire line to commit arson and sabotage, to strike at our security forces and to incite the local people to rise against the Government”. Pakistan vehemently denied having designed the infiltration, arguing that the “Azad Forces” which had invaded the Indian-controlled part of Kashmir was an organic and indigenous response to the Indian occupation. Pakistan also maintained that Pakistani military action in support of the “Azad Forces” was only an act of self-defence undertaken after India had violated the ceasefire line.\n\nThe UN, however, saw Pakistan as the aggressor and directed it to observe the ceasefire line and abide by the status quo. In a letter to the UN Secretary General, Ayub Khan refused to comply. “I fear that your present appeal will only serve to perpetrate that injustice by leaving the people of occupied Kashmir to the mercy of India. What is to become of the brave people of Kashmir who are fighting for their freedom? I cannot believe that it would be the intention of the United Nations to permit India to liquidate them and to consolidate its stranglehold over occupied Kashmir,” he wrote.\n\nThe invasion by the “Azad Forces” led to massive retaliation by the Indian military not only against Pakistan but also within the state of Jammu and Kashmir. An intense military campaign was started to rid Kashmir of outside elements as well as any local pro-Pakistani activists. Regular Pakistani military units also entered the Indian-administered Kashmir, citing Indian atrocities there and as a declaration of support for the Kashmiri people. Concomitantly, India launched a full scale attack on Pakistan’s western border near Lahore and Sialkot. The Pakistani authorities were not expecting this attack.\n\nPakistan immediately looked towards its allies, particularly the US and Britain, for help but the State Department did not find it prudent to support Pakistan. Ayub Khan invoked the assurances given by America in 1959, which made it incumbent on the US to provide support to Pakistan in the event of a war but the American government refused to entertain this plea and “did not accept Pakistani denials of infiltration across the ceasefire line”. Shortly thereafter the American government imposed a military embargo on both India and Pakistan.\n\nPakistan vehemently protested against the embargo. In repeated discussions with the American ambassador to Pakistan as well as the British high commissioner, Bhutto pleaded for a re-evaluation of the policy. India, he argued, was still receiving aid from the Soviet Union whereas Pakistan was getting no arms since it relied solely on weapons from its Anglo-American allies. The embargo, thus, disproportionately affected Pakistan, greatly weakening its position. But all his pleas fell on deaf ears.\n\nAnglo-American indifference was not for want of sympathy for the Pakistani case. Indeed, the September 6, 1965, attack on Lahore and Sialkot had convinced many in London and Washington that, while Pakistan might have initiated the conflict, it was Indian belligerence which had exacerbated it. There was also some recognition that Pakistan would need some guarantee regarding the resolution of the Kashmir issue for it to agree to a ceasefire.\n\nThe war, however, made it clear that India was far stronger militarily than Pakistan and was willing to hold onto Kashmir even at the cost of an indefinite war of attrition. And important international players knew this. On September 16, 1965, the British high commissioner in New Delhi wrote to the Commonwealth Relations Office in London asking for a reappraisal of British policy on Kashmir: “I feel it must be recognized that our historic policy of holding the balance between India and Pakistan no longer accords with the facts: By her action in August 1965, Pakistan in effect abandoned her attempt to secure a political and diplomatic solution of the Kashmir dispute in favour of a military solution. This has now probably failed. India appears from here to be on the way to achieving substantial military superiority over Pakistan through the attrition of Pakistan armour and aircraft. If that assessment proves to be correct, I am convinced that India would not submit to a political settlement at this stage which appeared to favour Pakistan’s claims.”\n\nAfter recognising India’s military superiority, he dwelt on the China connection. “If a political settlement enabled Kashmir to opt into Pakistan, Pakistan and China would then have a common land frontier of several hundred miles accessible by a main motor road within easy striking distance of one of the most thriving industrial areas of India, the Punjab … I do not believe that India could now accept the self-determination of an area which permitted Pakistan and China to develop direct land communications through Ladakh. Nor, as I see it, would this be in the interests of the West.”\n\nThe prospects of a close Pak-China collaboration right next to India caused considerable anxiety within the Soviet Union too. Moscow, indeed, pressurised New Delhi to accept a ceasefire with Pakistan by raising the spectre of Chinese aggression.\n\nBut its Western allies made it clear to Pakistani interlocutors that any secret Pak-China endeavour would lose Pakistan all Western support for its stance on Kashmir. The Pakistani government was, therefore, keen to dispel such misgivings. After meeting Ayub Khan, Iran’s ambassador to Pakistan told his British counterpart that the Field Marshal contemptuously dismissed the “possibility of Chinese intervention in [an] Indo-Pakistan war”. The Iranian ambassador quoted the Pakistani president as saying that “Pakistan would never be [a] Chinese satellite” even though it was “prepared if necessary to be [a] United States Satellite”. Ayub Khan also assured the Americans and the British that he had unofficially asked the Chinese to show restraint on the China-India border.\n\nAlso read: Borders that separate: A daughter’s lament\n\nOn September 19, 1965, however, China issued an official message to India, demanding that the, “Indian Government dismantle all its military works for aggression on the Chinese side of the China-Sikkim boundary or on [the] boundary itself before midnight of September 22, 1965.” China also demanded the return of four kidnapped Tibetan inhabitants, 800 sheep and 51 yaks alleged to be captured by Indian troops.\n\nThe Indians responded to these Chinese demands with deep agitation. “…[T]he Government of India cannot but observe that China taking advantage of the present unfortunate conflict between India and Pakistan is concocting without any basis casus belli in order to commit aggression against India.” These protestations clearly suggested that India could not afford a simultaneous conflict with China and Pakistan.\n\nOn September 22, 1965, Indian Prime Minister Lal Bahadur Shastri accepted an offer by Soviet President Kosygin to broker a ceasefire agreement between India and Pakistan.\n\nA defeated Amir Abdullah Niazi officially surrendered to his Indian counterpart General Aurora and in doing so announced the end of Pakistani sovereignty over what had been East Pakistan since 1947.\n\nIndia’s victory was complete. Militarily, the Indian army had enjoyed tremendous success and 93,000 Pakistani soldiers and officers were now in its custody. In the West, India had thwarted the Pakistan Army’s initial advances in Chhamb and other parts of Kashmir and, instead, occupied several territories in Pakistan including Thar.\n\nOn the political front, India successfully dealt a debilitating blow to the religious basis of Pakistan as more Muslims lived in what became Bangladesh than in what remained of Pakistan. Internationally, too, New Delhi was hailed as a champion of democracy, freedom and humanitarianism that helped Bangladeshis get rid of an oppressive state.\n\nThe cataclysmic events of 1971 were obviously incredibly significant. Equally noteworthy is what did not happen. India, for instance, did not try to take over the Pakistani-controlled part of Kashmir. The reason was American pressure on the Indian government to refrain from taking the war into Kashmir. The Americans argued that any Indian action in Kashmir could precipitate a much larger war involving China, the US and the Soviet Union. D P Dhar, chairman of India’s Policy and Planning committee and a key part of India’s diplomatic endeavours before, during and after the 1971 war, admitted that the American intervention had prevented India from making territorial gains on the western front.\n\nWashington, however, did nothing beyond making attempts to avoid a wider conflagration about Kashmir. It did not show any interests in intervening during the war on Pakistan’s behalf. China, too, stayed out of the war. Bhutto, then serving as the president of the truncated Pakistan, made a frank and candid admission of his country’s severely weakened position in a speech to the parliament on July 14, 1972: “Because circumstances were really impossible, India had all the cards in her hands and India is not a generous negotiator. They had Pakistani territory. They had East Pakistan separated from Pakistan. They had 93,000 prisoners of war. They had the threat of war trials and so they were sitting pretty, as the saying goes. What did we have in our hands? Riots, labour troubles and all sorts of internal dissensions … It was a nation completely demoralized, shattered.”\n\nThe cataclysmic events of 1971 were obviously incredibly significant. Equally noteworthy is what did not happen. India, for instance, did not try to take over the Pakistani-controlled part of Kashmir. The reason was American pressure on the Indian government to refrain from taking the war into Kashmir.\n\nHe was speaking immediately after the signing of the Simla Agreement.\n\nEarlier that year, Dhar met with the French foreign minister who asked him about the chance of a durable peace between India and Pakistan. Dhar was unequivocal. He said India wanted to sign a definitive peace agreement with Pakistan on all issues, including Kashmir. He made it clear to the French minister that “the package of peace related to overall settlement of all elements of tension and friction and that included Kashmir also”.\n\nThree days later, Dhar reiterated the centrality of the Kashmir issue to an enduring Pak-India peace during his meeting with Soviet President Kosygin. “…[I]n Kashmir we are faced with the question whether we leave this artificial line where trouble breaks out frequently or whether we should address ourselves to this problem also once and for all. Even if all other issues between the two countries are resolved but the Kashmir issue is allowed to fester like an open wound, there can be no hope of permanent peace in the sub-continent,” Dhar said.\n\nThe war had drastically changed the power dynamics in the subcontinent and Indian leaders were eager to take advantage of the changes. “Our presentation (on Kashmir) … should bear the stamp of our new prestige and authority,” noted Dhar after his visits to France and the Soviet Union in February 1972. Indian diplomats insisted that the 1971 war rendered the 1949 ceasefire line in Kashmir obsolete. They knew they could make a beleaguered Pakistan agree to the new ceasefire line as a secure, inviolable international border.\n\nPakistan, too, was acutely aware of the asymmetry of power. When the negotiation started on June 28, 1972, Pakistan’s newly appointed Foreign Minister Aziz Ahmed insisted that the peace agreement must demonstrate parity between the two sides. For any agreement to be accepted by the Pakistani public, he repeatedly argued, Pakistan must avoid giving the impression that it capitulated on the issue on Kashmir.\n\nBut the Indian delegation was unflinching in its demand that the ceasefire line be turned into an international border and Pakistan cease insisting on the Kashmiris’ right to self-determination. Indira Gandhi and Dhar, who were heading the Indian delegation, implied that there could be no movement on the prisoners of war and the withdrawal of Indian troops from parts of Pakistan’s mainland unless Pakistan accepted the ceasefire line as the new border in Kashmir. With his “back against the wall,” Bhutto had little choice but to acquiesce, though he was successful in convincing the Indians that the ceasefire line should be called something short of an internationally recognised border. The final agreement thus read: “In Jammu and Kashmir, the line of control resulting from the cease-fire of December 17, 1971 shall be respected by both sides without prejudice to the recognized position of either side. Neither side shall seek to alter it unilaterally, irrespective of mutual differences and legal interpretations. Both sides further undertake to refrain from the threat or the use of force in violation of this Line.”\n\nThe Simla Agreement was transformative in two respects. Firstly, it laid down bilateralism as a principle underpinning all future negotiations between Islamabad and New Delhi. India has always resisted interference and mediation by other states as well as by the UN when it comes to discussing and settling disputes with Pakistan. On the other hand, Pakistan would often ask the international community to intervene. With the Simla Agreement, Pakistani efforts to involve the rest of the world in dispute resolution in the subcontinent would have only weak moral and legal authority, if any at all. At least this is how India has been interpreting the agreement since 1972. Secondly, the agreement prevented both India and Pakistan from interfering in the territories owned or controlled by the other side.\n\nEven though the Simla Agreement was put into effect, Dhar was not excited about its ability to maintain peace in the long run. What made him particularly pessimistic was the ever-present possibility of a military coup in Pakistan. Indeed, just five years after the agreement, Pakistan experienced its third coup, inaugurating the reign of the most protracted and arguably the most repressive martial law regime in the country — under General Ziaul Haq.\n\nOver the next decade, Pakistan became a crucial player in the America-led proxy war in Afghanistan. The Pakistan Army fostered, facilitated and trained Afghan mujahideen not just militarily but also ideologically. A generation of military officers and soldiers, working with these mujahideen, came of age espousing ideas for a global jihad in general and the one in Kashmir in particular. It was during this era that the Zia regime encouraged the massive growth of Islamic fundamentalist organisations within Pakistan and actively supported the emergence of militant outfits for guerrilla warfare in Afghanistan and Kashmir.\n\nIn 1989, the Red Army began its historic retreat from Afghanistan, initiating the end of the Soviet Union and the Cold War. Emboldened by this victory, the Pakistani establishment cast its eyes on Kashmir, yet again.\n\nThe sound of gunfire and explosives reverberated in the valley mingled with vociferous chants of ‘azadi’. Young men, their faces often covered, carried Kalashnikov rifles and roamed the streets of Indian-administered Kashmir, demanding freedom from New Delhi.\n\nThe roots of the 1989 insurgency in Kashmir lay in a highly problematic history of electoral politics of Jammu and Kashmir. In 1987, Farooq Abdullah, son of Sheikh Abdullah and the leader of the National Conference, struck a deal with the Indian government led by Prime Minister Rajiv Gandhi for the resumption of the electoral process in Indian-administered Kashmir. The election that followed resulted in an easy victory for Farooq Abdullah. The only problem was that a large part of the Kashmiri population deemed the voting to be rigged. By 1989, a huge number of Kashmiri youth had risen in anger to protest against what they considered an unrepresentative government. Many of them soon joined an insurgency against the Indian state.\n\nIndia was quick to respond, deposing Farooq Abdullah, installing Jagmohan Malhotra as governor and deploying 700,000 military and paramilitary soldiers in Kashmir to counter the insurgency. The insurgents received immense support – militarily, diplomatically and financially – from Pakistan. The Pakistani military, particularly the Inter-Services Intelligence (ISI), was eager to take advantage of anti-Indian sentiments within Kashmir. Jihadi outfits, including the Lashkar-e-Taiba (LT), Hizbul Mujahideen and Harkat-ul-Ansar, were propped up to recruit young Kashmiri men, bring them into Pakistan for training and then send them back into Indian-administered Kashmir.\n\nA generation of military officers and soldiers, working with these mujahideen, came of age espousing ideas for a global jihad in general and the one in Kashmir in particular.\n\nThese developments were taking place as democracy returned to Pakistan in 1988 after an 11-year hiatus and Benazir Bhutto became prime minister. But even though she headed a civilian government, the military establishment tenaciously held on to its influence, particularly on subjects such as Kashmir. Managing relations with India, thus, became a reflection of the conflicting tendencies in Pakistani politics. While the civilian government claimed to work towards a diplomatic solution to the Kashmir issue, the military ardently supported jihadist outfits. This was not lost on the Indian government which rightly considered Benazir Bhutto’s government vulnerable to pressure from the military.\n\nIt was only in January 1994 that the two sides finally agreed to resume their formal dialogue process as Pakistan’s foreign secretary presented a series of non-papers – so called because the positions stated therein are not considered official – to his Indian counterpart. These non-papers proposed “measures required to create a propitious climate for peaceful resolution of the Jammu and Kashmir dispute and other issues”. These measures ranged from finding the modalities for the holding of a plebiscite in Jammu and Kashmir to the resolution of other territorial conflicts such as Siachen and Sir Creek.\n\nThe Indian reply was dismissive: “India categorically states once again that Jammu and Kashmir is an integral part of India. The question or the need for conducting any plebiscite in any part of India including in the State of Jammu and Kashmir simply does not arise.” The Indian side also claimed that Pakistan had only restated its preconditions for talks through the non-papers. The stalemate thus persisted.\n\nIn 1996, Farooq Abdullah once again formed a government in Indian-administered Kashmir with support from Congress. Meanwhile in Pakistan, Benazir Bhutto’s second government was toppled and Nawaz Sharif became prime minister, for the second time, in 1997. Amid all these changes, relations between India and Pakistan were following what by then had become a familiar pattern: talk of peace ran parallel to talk of war.\n\nThis pattern continued when Sharif met his Indian counterpart Atal Bihari Vajpayee in September 1998 in New York on the sidelines of the UNGA. The two sides reaffirmed their commitment to bilateral dialogue during the meeting. But when, a few days later, Sharif supported Kashmir’s right to independence during his address at the UN, his remarks elicited strong objections from New Delhi.\n\nHis address marked two critical changes. For the first time, Pakistan supported a “third option” — of letting Kashmir become an independent state if it did not want to remain a part of India but also did not want to join Pakistan. As late as 1995, Benazir Bhutto had rejected the third option, arguing that “it would mean the balkanization of both India and Pakistan, which was not in their interest”.\n\nSecondly, both India and Pakistan became nuclear states by 1998 and their nuclear capabilities meant that the next war could lead to an unprecedented degree of destruction. The age-old question of Kashmir thus operated in a drastically new paradigm – to put it in the words of some American pundits and officials, the dispute over Kashmir became the world’s most dangerous nuclear flashpoint.\n\nIt was only after many years that India was willing to come back to the negotiating table. In a historic moment, Prime Minister Vajpayee travelled by bus to Lahore. The world applauded what appeared to be a significant breakthrough. But in the ultimate manifestation of Pakistan’s paradoxical and often parallel policies, the Pakistan Army started sending troops into Kargil on the Indian-controlled side of Kashmir, leading to the fourth India-Pakistan war.\n\nThe Kargil War was envisioned as a covert operation; which is why Pakistan initially stressed that an Indian assault was aimed at the Kashmiri mujahideen and that Pakistan had sent its troops to the border only in self-defence. But the massive retaliation by India – known as Operation Vijay – compelled Pakistan to seek American mediation for an immediate ceasefire. This showed India that it could neutralise a military attack by Pakistan, the latter’s nuclear capability notwithstanding.\n\nThe American Secretary of State Colin Powell did not seem happy. In a meeting with Khurshid Kasuri, Pakistan’s foreign minister, he expressed concern over the continued infiltration across the Line of Control (LoC) in Kashmir. Summer was around the corner which would make movement across the LoC easier, pushing Pakistan and India towards the brink of another violent conflict. “We would have a real mess on our hands,” Powell told Kasuri. India and Pakistan, he insisted, would have to take “difficult decisions” were they to avoid war.\n\nThe American concerns were well founded. Pakistan and India had been on the precipice of a war in 2001/2002 following a terrorist attack on the Indian parliament. While the US had strengthened its relationship with India tremendously over the 1990s, a post-9/11 Pakistan was once again required as a key strategic ally in the War on Terror. America’s strategic interests in South Asia and the Middle East dictated that Washington did whatever it could to keep both India and Pakistan on its side and stop them from engaging in a war. Condoleezza Rice, Powell’s successor as the Secretary of State, informed Kasuri that “American regional interests were linked to stability in South Asia”.\n\nIn his recently published memoir, Neither a Hawk Nor a Dove, Kasuri credits the Bush administration with facilitating the peace process between India and Pakistan. Pressure from the US, Kasuri reveals, compelled President Pervez Musharraf to reign in a hawkish policy towards India and create conditions conducive for something extraordinary — a chance to settle the Kashmir dispute for all times to come.\n\nBeginning in June 2004, India and Pakistan resumed their Composite Dialogue — a process of negotiations that requires simultaneous progress on eight contentious subjects including Kashmir, terrorism, water sharing, nuclear weapons and territorial disputes. In September that year, the two sides decided to set up a mechanism for holding backchannel negotiations on Kashmir. Over the next couple of years, serving and former diplomats and officials from the two countries would hold secret meetings to come up with a formula for a negotiated settlement of the conflict. Publically, too, the two governments sought to mend relations and appeared happy with the progress they were making.\n\nManmohan Singh, who became India’s prime minister in 2004, however, made it clear to Pakistan that the border in Kashmir could not be redrawn. It could be allowed to become “irrelevant”, though, by letting the Kashmiris travel across it with ease. This eventually led to the historic opening of the Muzaffarabad-Srinagar Bus Service in April 2005.\n\nMeanwhile, local and foreign interlocutors agreed that Pakistan’s overtures for peace could only amount to something if its establishment agreed to unravel the infrastructure it had so meticulously constructed over the past decade and a half for an insurgency in Kashmir. Murmurs in 2005 and 2006 within Islamabad’s most powerful circles suggested that Musharraf was indeed considering that. While active infiltration into Kashmir decreased during and after those years, terrorist incidents elsewhere in India, such as the serial train bombings in Mumbai in July 2006, still haunted the bilateral negotiations. The terrorist attack which claimed over 200 lives led to severe criticism of Pakistan, and public support in India for the dialogue process plummeted rapidly. Pakistan’s official denial of any involvement in the attack as well as Musharraf’s insistence that Pakistan was no longer supporting terrorist outfits creating trouble in India did little to improve the situation.\n\nThis is how an official Indian spokesman summed up the situation: “If Pakistan really wants to convince the people of India that we are working against terrorism then it can take some action immediately. For example, the self-styled chief of Hizbul Mujahideen, Syed Salahuddin … should be arrested and handed over to India.” The spokesman also called for an action against Jamaatud Dawa. “Instead of their saying that Jamaat-ud-Dawa is being kept under close watch, the organization should be banned and its leader should be arrested.” A few months later, Musharraf met Singh in Havana and the two sides agreed to set up a joint antiterror mechanism.\n\nIn December 2006, Musharraf announced something unprecedented. Pakistan, he said, was willing to give up its claim on Kashmir should India agree to his four-point proposal which suggested that: (a) borders between Pakistan and India remain the same; (b) Kashmir be given autonomy but not independence; (c) a steady withdrawal of troops take place from both Indian and Pakistani administered parts of Kashmir and (d) a joint supervision mechanism be set up with representatives from India, Pakistan and Kashmir to ensure a smooth implementation of these proposals. Pakistan said it was even ready to take back its demand for a plebiscite if India was willing to negotiate on the proposals.\n\nIt remains a matter of conjecture if Musharraf was truly committed to a peace deal but the undemocratic nature of his regime allowed him to exhibit flexibility that a civilian government could not afford. At one stage, a bilateral agreement appeared extremely possible. “We were down to the commas,” Kasuri later told Steve Coll of the New York Times. While Pakistan insisted it had to take into account Kashmiris’ sentiment, the conspicuous absence of any Kashmiri representation in the process was hard to miss. After 60 years of going through political suppression, geographical and social divisions and wars, the Kashmiris were still largely absent from a negotiation table laid down to decide their destiny.\n\nIt would appear that Pakistan and India were on the precipice of a “deal on Kashmir” when the peace process was thwarted by the political turmoil that engulfed Pakistan in 2007 and continued well into 2008.\n\nOn November 26, 2008, 10 young men launched a massive terrorist attack in Mumbai, leading to the killing of 164 people over a period of three days. India later claimed the attackers were members of the Pakistan-based LT. The attack would extinguish the prospects of an India-Pakistan peace for many years to come.\n\nWhile driving on The Mall, one is likely to spot autorickshaws carrying a certain poster on their backs proclaiming that Pakistan has the right to get Kashmir back from India. The poster also exhorts: “Pakistan can only survive if it keeps its ideology intact.” Together, the two slogans have long served as the bedrock of a state-driven national narrative that sees Islam and Kashmir as its twin foundational pillars.\n\nThe pursuit of Kashmir remains embedded in popular and official imagination as strongly as the perception that a nuclear Pakistan has a special status within the Muslim countries. Both these views were manifest – and with a lot of celebratory chest thumping – as Pakistan commemorated the 50th anniversary of the 1965 War with India – a war that Pakistan still claims it won. General Raheel Sharif, Chief of the Army Staff and arguably the most powerful man in the country, partook in the celebrations, announcing that “Kashmir remains the unfinished business of partition”.\n\nAcross the LoC, India’s grip on Kashmir has never been stronger. With half a million soldiers stationed there, Kashmir is the most densely militarised area in the world. And enjoying an across-the-board political support for counterinsurgency measures, Indian governments of different ideological persuasions have felt no qualms in perpetuating a reign of terror against the Kashmiri civilians found protesting on the streets.\n\nChauvinistic and jingoistic rhetoric and policies prevail in both India and Pakistan as far as their stances on Kashmir are concerned. The two governments keep assuring their electorate of the legitimacy of their position as well as their preparedness for war.\n\nThe rest of the world, meanwhile, remains a faithful, but passive, audience to a Kashmiri spectacle, in which the same characters are condemned to perform the same acts with the same tragic outcomes.\n\nThis article was originally published in Herald's November 2015 issue. To read more subscribe to Herald in print.\n\nThe writer is a Teaching Fellow at the Lahore University of Management Sciences (LUMS).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2016/02/56b322b66f8e4.jpg",
  "retrievedAt": "2025-08-25T19:22:06.879Z",
  "source": "Dawn",
  "link": "https://herald.dawn.com/news/1153341",
  "dateList": "2025-02-05",
  "date_published": "2016-02-05T04:39:08.000Z"
}
