{
  "title": "US military plane deporting Indian immigrants lands in India - World - DAWN.COM",
  "author": null,
  "content": "A US military plane carrying illegal Indian immigrants landed in India’s northern city of Amritsar on Wednesday, a Reuters witness said, deporting an unspecified number of people as part of President Donald Trump’s immigration agenda.\n\nSome local media reported that the flight was bringing 205 people back, while others put the number at 104, and that they were mainly from the northern state of Punjab, where Amritsar is located, and the western state of Gujarat.\n\nThe Trump administration has increasingly turned to the military to help carry out its immigration agenda, using military aircraft to deport migrants and opening military bases to house them.\n\nAlthough illegal Indian immigrants have been deported home by previous US administrations, it is the first time Washington has used a military aircraft for the purpose. It is also the farthest destination so far for such flights using a military aircraft.\n\nReuters reported on Tuesday that the C-17 aircraft with migrants on board had departed for India but would not arrive for at least 24 hours. The flight did not show up on public flight trackers but local news TV channels showed the aircraft taxiing after it landed in Amritsar.\n\nMigration has been among the key issues discussed by India and the US since Trump took charge last month, and is also expected to come up during Trump’s meeting with Indian Prime Minister Narendra Modi, likely to take place in Washington next week.\n\nUS Secretary of State Marco Rubio also “emphasised” the Trump administration’s desire to work with India to address “concerns related to irregular migration” when he met Indian Foreign Minister Subrahmanyam Jaishankar last month.\n\nNew Delhi has since said it will take back such illegal immigrants after verifying their details.\n\nThe US is India’s largest trading partner and the two countries are forging deeper strategic ties as they look to counter China.\n\nIndia is also keen to work with the US to make it easier for its citizens to get skilled workers visas.\n\nThe Pentagon has said it plans to deport more than 5,000 migrants held by US authorities, and Reuters reported last week that a flight to Guatemala used for the purpose likely cost at least $4,675 per migrant.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/0515215550820cf.jpg",
  "retrievedAt": "2025-08-25T19:22:06.340Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889916/us-military-plane-deporting-indian-immigrants-lands-in-india",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T10:25:06.000Z"
}
