{
  "title": "Modi takes ‘holy dips’ at Kumbh Mela, week after stampede killed dozens - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi took holy dips in sacred river waters in the northern city of Prayagraj on Wednesday as he joined millions of people at the Maha Kumbh Mela, a week after dozens died in a stampede at the event.\n\nAuthorities said 30 people were killed in the stampede on the six week-long Hindu festival’s most auspicious day on January 29, as more than 76 million people converged on the river to take a ‘royal dip’. Sources said the death toll was more than 50.\n\nDevout Hindus believe that taking a dip during the Maha Kumbh at the confluence of three sacred rivers — Ganga, Yamuna and the mythical Saraswati, which is believed to flow underground — absolves people of sins and brings salvation from the cycle of birth and death.\n\nLive visuals broadcast on state and private news channels showed Modi — dressed in a saffron sweatshirt and black sweat pants with saffron stripes on the side — holding on to a thick yellow rope for support as he took three dips in the knee-deep water.\n\n“I had the supreme fortune of worshipping at the Maha Kumbh in Prayagraj today,” Modi later posted on X.\n\n“Receiving the blessings of Mother Ganga has brought immense peace and contentment to my heart. I prayed for the happiness, prosperity, health, and well-being of all countrymen.”\n\nSecurity personnel stood in the water nearby while thousands of people crowded the banks to watch the prime minister perform the rituals.\n\nModi arrived on a boat with Uttar Pradesh Chief Minister Yogi Adityanath and changed his clothes on a floating enclosure before wading into the water. Holy men chanted religious verses as he performed the dips.\n\nModi attended the smaller Kumbh Mela in 2019.\n\nMore than 400 million people are expected to attend this year’s Maha Kumbh Mela, making it the world’s largest gathering, officials say. More than 380m have already attended in its first three weeks, they said.\n\nAn investigation has been launched into last week’s stampede, which happened as devotees thronged the confluence of the rivers where a dip is believed to be particularly special.\n\nOpposition parties have blamed the tragedy on mismanagement and accused the state government of Modi’s Hindu nationalist Bharatiya Janata Party of hiding the real death toll.\n\nAuthorities have denied the claims and have since taken additional safety measures, including deploying more security personnel to manage the mammoth crowds.\n\nThe Maha Kumbh Mela is taking place at a 4,000-hectare temporary township — the size of 7,500 football fields — created on the river banks in Prayagraj.\n\nHome Minister Amit Shah, industrialist Gautam Adani, Bhutan King Jigme Khesar Namgyel Wangchuck and Coldplay’s Chris Martin have also joined this year’s festival.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/051731211b1dfd9.png",
  "retrievedAt": "2025-08-25T19:22:03.911Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889929/modi-takes-holy-dips-at-kumbh-mela-week-after-stampede-killed-dozens",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T12:40:00.000Z"
}
