{
  "title": "PM Shehbaz, President Zardari urge global action as country observes Kashmir Solidarity Day - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari and Prime Minister Shehbaz Sharif have urged the international community to put pressure on India to allow the Kashmiri people to freely determine their own future for lasting peace in the region, state-run Radio Pakistan reported.\n\nIn his message on Kashmir Solidarity Day being observed today (Wednesday), PM Shehbaz highlighted that a lasting peace could not be achieved by suppressing the genuine aspirations of the local people.\n\nThe recent developments in the Middle East amply showed that long-standing disputes should not be allowed to fester, the Associated Press of Pakistan (APP) quoted the premier as saying in a statement.\n\nHe said the government and the people of Pakistan annually observed the Kashmir Solidarity Day to renew their steadfast support for the Kashmiri people’s just and legitimate struggle for the realisation of their right to self-determination.\n\n“The right to self-determination is a fundamental principle of international law. Every year, the UN General Assembly adopts a resolution that stresses the legal right of people to decide their own destiny,” the premier said, according to a statement from his office.\n\n“Regrettably, despite 78 years having passed, the Kashmiri people have yet to exercise this inalienable right,” he lamented.\n\n“Today, the Indian Illegally Occupied Jammu and Kashmir (IIOJK) remains one of the most militarised zones in the world. Kashmiris are living in an environment of fear and intimidation,” PM Shehbaz highlighted.\n\nReiterating that the Jammu and Kashmir dispute would remain a key pillar of Pakistan’s foreign policy, the premier reaffirmed the country’s “unwavering moral, diplomatic and political support to the Kashmiri people till the realisation of their right to self-determination”.\n\nPresident Asif Ali Zardari said the day reminded the global community of its responsibility towards the oppressed Kashmiri people, according to Radio Pakistan.\n\nThe president stated that the United Nations should honour the promises made to the Kashmiris 78 years ago and support their struggle for their right to self-determination.\n\nSeparately, PM Shehbaz arrived on a one-day visit today in Muzaffarabad, the capital of Azad Jammu and Kashmir (AJK), to reaffirm Pakistan’s unwavering commitment and support for the people of India-occupied Kashmir (IoK).\n\nAddressing the AJK Legislative Assembly, the premier reiterated Pakistan’s offer to India to hold a dialogue to resolve the Kashmir issue.\n\n“India should come out of their August 5, 2019 thinking, and implement the approved UNSC resolutions, fulfil their promises to the Kashmiris and the world and come towards a meaningful and consequential dialogue,” the premier said.\n\n“We want that through dialogue — while following the diplomatic and democratic rules — all conflicts, including the Kashmir issue, should be resolved peacefully,” he added.\n\nHowever, at the same time, the prime minister asserted that Pakistan would not hesitate to use power for its national interests. He stressed that Pakistan’s desire for peace was not its “weakness, rather it is due to our strong system”.\n\n“Our capabilities are the pride of our nation [… However,] whenever needed, for our national interest, we would not hesitate to use our complete strength,” he said.\n\nDuring his address, PM Shehbaz highlighted that the AJK Assembly was “people-appointed”, adding that it was an honour for him to be invited there.\n\n“February 5 is not just a day but the day of our firm belief because it is not just a slogan, but it is faith,” he said. The premier said that the day was one to remember the officers who made “unforgettable stories”.\n\nPM Shehbaz vowed that in the fight for Kashmir, Pakistan would stand alongside them until the people got their right to independence. He stated that while India was increasing its forces deployed in the disputed territory, the resilience of the Kashmiri people also rose.\n\nThe prime minister said the Kashmir Solidarity Day reminded India of Kashmir’s decision to “not become a part of India” due to its revocation of the disputed territory’s special status on Aug 5, 2019.\n\n“Neither the Kashmiris accept this nor the United Nations Security Council,” the premier said.\n\nRecalling former Indian prime minister Atal Bihari Vajpayee’s visit to Lahore, PM Shehbaz stressed that both sides agreed to resolve all conflicts, including the Kashmir issue, through dialogue.\n\n“The only way to move forward is what is written in Lahore [Declaration],” he added.\n\nPM Shehbaz was also scheduled to hold meetings with various Kashmiri leaders, APP reported, citing the PM Office Media Wing. AJK PM Chaudhry Anwarul Haq also spoke at the assembly earlier.\n\nThe premier was welcomed with a guard of honour upon his arrival at the AJK Legislative Assembly. Minister for Kashmir Affairs Engineer Amir Muqam, Planning Minister Ahsan Iqbal, Food Security Minister Rana Tanveer Hussain and Information Minister Attaullah Tarar accompanied the prime minister.\n\nVarious federal ministers reiterated their support for Kashmiris in their separate statements. Iqbal asserted that Pakistan would never backtrack from its principled position on the Kashmir dispute, while Tarar said the sacrifices of the Kashmiri people would not go in vain.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar said in a statement that India had made “consistent efforts to suppress the wishes” of Kashmiris for the past 77 years.\n\n“However, the genuine aspirations of the Kashmiri people cannot be undermined through domestic legislation, judicial verdicts or administrative actions,” Dar asserted.\n\nAccording to the Foreign Office’s statement on the occasion, ​Dar addressed letters to the president of the UN Security Council and General Assembly, the UN chief, the UN High Commissioner for Human Rights, and the Organisation of Islamic Cooperation (OIC) secretary-general on the situation in IoK.\n\nThe deputy PM urged the UN and OIC leadership to play their role in improving the human rights situation in IoK.\n\n​Ahead of the Kashmir Solidarity Day, a briefing was organised for Islamabad-based diplomats to apprise them of the situation in occupied Kashmir, the FO stated.\n\nIn a televised message, Defence Minister Khawaja Asif highlighted that the implementation of UN Security Council resolutions had been delayed due to Indian intransigence.\n\nRana Sanaullah, the PM’s aide on political affairs, called on the international community to raise its voice for the people of IoK. He said India should be “compelled to accept the right of self-determination of Kashmiri people”.\n\nMeanwhile, as the country marked Kashmir Solidarity Day, political leaders and ministers vowed in their speeches to continue the “struggle for the support of Kashmiri brethren”.\n\nA rally was held in Islamabad, where hundreds of participants — holding Kashmiri flags — walked from Constitution Avenue to D-Chowk, chanting slogans in support of the residents of IoK.\n\nAccording to the FO, officers and staff members of the foreign ministry also participated in the rally titled ‘Solidarity Day Walk’.\n\nAddressing the rally, Petroleum Minister Dr Musadik Malik said Pakistan stood in unwavering solidarity with the Kashmiri people, pledging unrelenting support for their struggle to achieve self-determination and fundamental human rights.\n\n“Kashmir, often called a ‘Heaven on Earth’, boasts breathtaking landscapes, abundant resources, and lush forests. However, the beauty of this paradise is starkly contrasted by the harsh realities faced by its people.\n\n“The ongoing conflict with our neighbouring country, India, has turned their (Kashmiris’) lives into a living hell, forcing them to endure unimaginable hardships,” Malik said.\n\nHe said the Kashmiris’ bravery and resilience in the face of oppression were a testament to their unshakeable spirit.\n\nHighlighting that the stark contrast between the quality of life in IoK and India was alarming, Malik said: “While Indian families prioritise education, sending their children, including daughters, to schools and universities, Kashmiri families are facing harassment and brutality.\n\n“The situation in Kashmir is dire, with families being beaten up and subjected to violence,” the minister said, adding that the brutality and violence against women, elders, and children was beyond bearing.\n\nNoting Pakistan had strong bonds with the Kashmiri brethren, Malik echoed Pakistan’s demand to implement the UN resolutions.\n\nTo commemorate the day, which is also declared a public holiday, posters and billboards have been displayed around important avenues, airports, and railway stations, Radio Pakistan reported.\n\nIt added that “human chains will also be formed at Mangla, Kohala, Bararkot, Azad Pattan, and Holar linking Pakistan and Azad Kashmir”. Other related events would be held at Mirpur district’s Mangla Bridge, as well as in the Kotli and Bhimber districts of AJK.\n\nMeanwhile, Chairman Joint Chiefs of Staff Committee (CJCSC) General Sahir Shamshad Mirza, the service chiefs, and the armed forces have also reaffirmed their “unwavering support for the resilient people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) in their just struggle for self-determination”.\n\nIn a statement, the Inter-Services Public Relations (ISPR) said the armed forces of Pakistan “strongly condemned the ongoing grave violations of human rights in IIOJK, including extrajudicial killings, enforced disappearances, and arbitrary detentions”.\n\n“These transgressions stand as a stark indictment of India’s blatant disregard for international law, humanitarian principles, and fundamental human rights.”\n\nThe armed forces paid tribute to the “indomitable spirit of the Kashmiri people, who have endured decades of oppression, state-sponsored brutality, and egregious human rights violations”.\n\nThe ISPR statement highlighted that Kashmiris’ “unwavering resolve in the face of tyranny remains a beacon of courage and inspiration for the entire nation”.\n\nThe armed forces urged the “international community, global human rights organisations, and the United Nations to take immediate and decisive action to address the plight of the Kashmiri people and ensure the implementation of United Nations Security Council resolutions in accordance with their aspirations”.\n\n“The Pakistan Armed Forces remain steadfast in their commitment to the just cause of Kashmir and resolute in their duty to safeguard Pakistan’s sovereignty and territorial integrity. We stand shoulder to shoulder with our Kashmiri brethren in their rightful pursuit of freedom and dignity,” it asserted.\n\nChief of Army Staff (COAS) General Syed Asim Munir also visited Muzaffarabad and paid homage and rich tributes to the “unparalleled sacrifices” of martyrs, the ISPR said.\n\nThe COAS expressed complete confidence in the “battle readiness” of the armed forces, reaffirming that “no act of aggression would go unanswered and underscored”.\n\nHe also integrated with the notables and veterans of Kashmir, reiterating steadfast support for IoK.\n\n“COAS stated that Indian atrocities and rising Hindutva extremism only strengthens the resolve of Kashmiri people in their struggle for self-determination,” the ISPR said, adding that the army chief reaffirmed that the military would always stand by Kashmiris in their “just and legitimate” cause against “state-sponsored repression and oppression”.\n\n“Without any doubt, Kashmir will be free one day and part of Pakistan as per the free will and destiny of the people of Kashmir,” the ISPR quoted him as saying.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/05125426ea1f4b9.jpg",
  "retrievedAt": "2025-08-25T19:22:11.931Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889889/pm-shehbaz-president-zardari-urge-global-action-as-country-observes-kashmir-solidarity-day",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T06:17:45.000Z"
}
