{
  "title": "Owners of Kurram medical stores protest medicine shortage - Pakistan - DAWN.COM",
  "author": null,
  "content": "KURRAM: Owners of medical stores closed their outlets in protest against non-supply of medicines as two more bunkers were demolished in restive Kurram district here on Tuesday.\n\nThe district administration officials said that the bunkers were demolished in Lower Kurram, bringing the total number of bunkers destroyed to 28. The officials said that various measures were being taken to implement the 14-point peace agreement reached between the warring groups and to provide relief to the people.\n\nThe office-bearers of the drugs’ association closed medicines stores across Parachinar and other towns of the district, causing suffering to citizens, who are also hit by the shortage of food and other daily necessities.\n\nAddressing a press conference in Parachinar, office-bearers of the association, including Syed Mohammad Hasnain, Rashid Ali, Syed Iftikhar, Sajid Hussain, Iqbal Hussain and others, said that suspension of medicines supply to medical stores had put the patient care at risk.\n\nThey said vehicles loaded with medicines were not being included in the convoy of trucks carrying flour, ghee, sugar, vegetables, fruits and other essential items to the district, forcing them to shutter their stores. The protesters vowed to keep medical stores closed until the supply of medicines resumed.\n\nOn the other hand, students continued their protest, demanding the reopening of all roads. They said that due to road closures, they were unable to reach Peshawar and other parts of the country to seek admissions in educational institutions. They regretted that they were losing their academic year.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:17:04.131Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889764/owners-of-kurram-medical-stores-protest-medicine-shortage",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:23:06.000Z"
}
