{
  "title": "Haj expenses reduced - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Minister for Religious Affairs and Interfaith Harmony Chau­dhry Salik Hussain on Tuesday announced a reduction in this year’s Haj package costs, providing financial relief to pilgrims.\n\nSpeaking at a press conference, the minister said the cost of the 40-day Haj package has been reduced by Rs25,000, bringing the total to Rs1,050,000 while the 25-day short Haj package has been reduced by Rs50,000 and it will now cost Rs1,100,000.\n\nThe minister said that all rooms and tents will be air-conditioned in this year’s Haj.\n\nMr Hussain said the government’s Haj quota has been filled, and no additional applications will be accepted.\n\nThe Haj quota for Pakistan is 179,000 for the year 2025 allocated by the Saudi government based on the country’s population.\n\nThe government has divided this Haj quota into two parts. Half of the quota has been retained by the government under the official Haj scheme, while the remaining half has been kept for private tour operators.\n\nEach pilgrim will rece­ive a specially designed bag containing a Pakistani flag, a QR code for identification, and relevant information.\n\nA special mobile app, Pak Haj, will provide all information to pilgrims on their mobile phones, enabling them to stay updated about their Haj group’s information, training sche­dule, flight details, accommodation in Saudi Arabia, and live maps and locations of sites during Haj.\n\nThe minister said that all pilgrims are required to submit their third installment at the designated banks between February 6 and 14, adds APP.\n\nThe ministry has ensured that every pilgrim will receive a notification regarding their payment status through the Pak Haj mobile application, he added.\n\nIn another major development, Mr Salik announced a refund of over Rs4.75 billion to the pilgrims of 2024. He said the refunds have been categorised into seven different groups, based on factors such as accommodation in Mina, lodging in Makkah, and Maktab C allocation.\n\nAdditionally, savings from Qurbani refunds and air fare reductions are also being passed on to the pilgrims.\n\nHighlighting the statistics of the refund process, the minister said that 14 per cent of pilgrims (9,588 individuals) will receive Rs20,000, five per cent (3,358 individuals) will rec­eive Rs35,000, 19pc (12,981 individuals) will receive Rs50,000, 23pc (16,037 individuals) will receive Rs75,000, 26pc (17,828 individuals) will receive Rs90,000, 10pc (6,784 individuals) will receive Rs110,000, and 3pc (2,228 individuals) will receive Rs140,000. The refunds will be transferred through the designated bank branches.\n\nHe said the transfer of funds to nominated banks will commence within the next two days, ensuring timely financial relief for the pilgrims.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:16:17.260Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889812/haj-expenses-reduced",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:21:35.000Z"
}
