{
  "title": "Pause on US foreign assistance to affect 1.7m Pakistanis, including 1.2m Afghan refugees - Pakistan - DAWN.COM",
  "author": null,
  "content": "The pause on US foreign assitance by the Trump administration would affect 1.7 million people in Pakistan, including 1.2m Afghan refugees, who would be cut off from “lifesaving sexual and reproductive health services” with the closure of over 60 facilities, UN News reported on Tuesday.\n\nThe United States is the world’s largest provider of official development assistance, according to the Organisation for Economic Cooperation and Development (OECD).\n\nMost of its support is channelled through the United States Agency for International Development (USAID), an independent government agency established by Congress in 1961.\n\nHours after coming into office on January 20, Trump ordered a sweeping review of almost all US foreign aid and tasked billionaire Elon Musk, who has falsely accused USAID of being a “criminal” organisation, with scaling down the agency.\n\nAccording to the report by UN News, the US announcement would affect 1.7m people in Pakistan who would not receive health services after the closure of 60 facilities.\n\nFor Bangladesh, around 600,000 people, including Rohingya refugees, face losing access to critical maternal and reproductive health services, it said.\n\n“This is not about statistics. This is about real lives. These are literally the world’s most vulnerable people,” the report quoted United Nations Population Fund (UNFPA) Asia-Pacific Regional Director Pio Smith as saying.\n\nWhile briefing journalists in Geneva on Tuesday, Smith said the UNFPA “has suspended services funded by US grants that provide a lifeline for women and girls in crises, including in South Asia”.\n\nHe warned that without US support, from 2025 to 2028, Afghanistan is likely to suffer from “1,200 additional maternal deaths and 109,000 additional unintended pregnancies”.\n\nSmith said that the agency had sought “more clarity” from the administration “as to why our programmes are being impacted, particularly those which we would hope would be exempt” on humanitarian grounds.\n\nAccording to the report, in Bangladesh, nearly half of all births at Bangladesh’s Cox’s Bazar refugee camp complex — residing one million Rohingya refugees — take place in health facilities with UNFPA’s support.\n\n“This progress is now at risk,” Smith said, adding that the agency needed $308m “to sustain essential services in Afghanistan, Bangladesh and Pakistan”.\n\nFor Afghanistan, around nine million people were expected to lose access to health and protection services because of the US funding crisis, UN News reported.\n\nThis will impact nearly 600 mobile health teams, family health houses and counselling centres, whose work will be suspended, Smith said.\n\n“Every two hours, a mother dies from preventable pregnancy complications, making Afghanistan one of the deadliest countries in the world for women to give birth. Without UNFPA’s support, even more lives will be lost at a time when the rights of Afghan women and girls are already being torn to pieces,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/052117452f9757a.jpg",
  "retrievedAt": "2025-08-25T19:22:00.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889947/pause-on-us-foreign-assistance-to-affect-17m-pakistanis-including-12m-afghan-refugees",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T16:54:03.000Z"
}
