{
  "title": "CAA to build cargo complex at Quetta airport - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Civil Aviation Authority (CAA) will build an international-standard cargo complex, equipped with all modern facilities, at the Quetta International Airport.\n\nThe announcement was made by CAA Terminal Manager Sardar Sadiq and Deputy Facilitation Manager Sabir Ali during a meeting with officials and members of the Quetta Chamber of Commerce and Industry (QCCI), on Tuesday.\n\nPrior to this, senior members of QCCI, including Haji Abdullah Achakzai and Haji Agha Gul Khilji, highlighted the lack of cargo terminal facilities at Quetta airport.\n\nThey pointed out that despite the promising expansion project at the airport, exporters and importers from Balochistan currently rely on Karachi airport to send goods abroad via air.\n\nThis has led to delays in the transportation of commercial goods, with perishable items such as fresh fruits, vegetables, meat, dates, and seafood at risk.\n\n“Historically, cargo services from Quetta have not been available on a large scale. If a modern, international-standard cargo complex is built, it will greatly benefit Balochistan’s business community and further boost business activities,” said one of the senior QCCI members.\n\nDuring the meeting, the CAA officials emphasised that their visit was aimed at understanding the business community’s needs concerning cargo services.\n\nOnce the volume of commercial goods being exported from Quetta is estimated, they will prepare a feasibility report for the cargo complex and include the project in the Annual Development Plan.\n\nThey assured that the cargo complex at the Quetta airport would be equipped with state-of-the-art facilities, ensuring the quick dispatch and receipt of goods. They also expressed their commitment to breaking the current stalemate and engaging in discussions with the business community to move the project forward.\n\nThe CAA officials requested the QCCI to send a letter to the airport manager and other relevant authorities to facilitate the reception of commercial delegations.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:22:41.567Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889843/caa-to-build-cargo-complex-at-quetta-airport",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:22:01.000Z"
}
