{
  "title": "NAB restrained from arresting Qaim Ali Shah, Sharjeel in Bahria Town Karachi land grab case - Pakistan - DAWN.COM",
  "author": null,
  "content": "• SHC constitutional bench also suspends summons issued by accountability court against ex-CM, senior Sindh minister\n• Allows trial court to proceed against all other accused in Rs708bn graft reference\n\nKARACHI: The Sindh High Court on Tuesday restrained the National Accountability Bureau (NAB) from arresting two Pakistan Peoples Party leaders, former chief minister Syed Qaim Ali Shah and senior Sindh minister Sharjeel Memon, in the Bahria Town Karachi land grab reference.\n\nMr Shah and Mr Memon filed petitions before the SHC and challenged the jurisdiction and summons issued by an accountability court after NAB filed the graft reference.\n\nA two-judge constitutional bench comprising Justice Mohammad Karim Khan Agha and Justice Adnan-Ul-Karim Memon also suspended the summons issued by the accountability court and asked the petitioners to furnish solvent surety of Rs100,000 each.\n\nPetitioners’ counsel Barrister Zamir Ghumro and Raj Ali Wahid Kunwar argued that no reference can be made against their clients and NAB should not have added their names in the reference following certain amendments to the National Accountability Ordinance (NAO) 1999.\n\nAfter a preliminary hearing, the bench observed that a number of references had been filed in the past against former CM Shah (respondent No 5) and Mr Memon (respondents No 6) “as such this new reference against them might be based on malafides which we find gives them grounds to approach directly to this court in respect of this issue to determine whether the accountability court has jurisdiction to take up the matter in respect of the petitioners”.\n\n“For the time being, summons against respondent No5 & 6 are suspended and they shall not be arrested until the next date of hearing subject to them each providing solvent surety in the amount of Rs100,000 to the satisfaction of the nazir of this court.\n\n“In the meantime, the accountability court shall proceed against all other persons in the reference in accordance with law until such time as the jurisdictional issued is determined by this bench,” it added.\n\nThe bench issued notices to NAB and other respondents as well as to the additional attorney general and special prosecutor of NAB for March 5.\n\nThe petitioners submitted that the reference was filed on Feb 1, and the trial court had not only taken cognizance of the matter but also issued summons against them.\n\nThey added that the assumption of jurisdiction and taking of cognizance were “ex facie without lawful authority and coram non judice”, particularly in the light of the explicit exclusion of the petitioners from the ambit of the NAO, as amended under Section 4(2)(d) & (e).\n\nBesides Mr Shah and Mr Memon, NAB had named property tycoon Malik Riaz, former Sindh Board of Revenue member Ahmed Baksh Narejo, land utilisation department’s secretaries Saqib Ahmed Soomro and Javed Hanif Khan, then MDA director general Mohammad Sohail, Sindh Building Control Authority (SBCA) directors general Manzoor Qadir and Agha Maqsood Abbas, deputy commissioner-East Kazi Jan Mohammad, various assistant commissioners, Bahria Town CEO Ahmed Ali Riaz, vice chairman Zain Malik and others as accused persons.\n\nNAB alleged that the entire hierarchy of the executive, the revenue board and MDA had conspired to cede valuable public property to an individual for some gains and in active connivance grabbed 17,671.87 acres under the grab of “adjustment/exchange/consolidation in 2013-14 in sheer violation of law for Bahria Town, causing a colossal loss of over Rs708.08 billion to the national exchequer”.\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:16:49.952Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889795/nab-restrained-from-arresting-qaim-ali-shah-sharjeel-in-bahria-town-karachi-land-grab-case",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:23:24.000Z"
}
