{
  "title": "‘We will not leave’, say Gazans as Trump meets Netanyahu - World - DAWN.COM",
  "author": null,
  "content": "RAFAH: Like most Palestinians, Hatem Azzam, a resident of the southern Gaza city of Rafah, was incensed by US President Donald Trump’s remarks suggesting Gazans should relocate to Egypt or Jordan.\n\n“Trump thinks Gaza is a pile of garbage — absolutely not,” the 34-year-old said, attacking Trump’s choice of words when he told reporters last week of his plan to “clean out the whole thing”.\n\nCalling him “delusional”, Azzam said that Trump “wants to force Egypt and Jordan to take in migrants, as if they were his personal farm”.\n\nBoth Egypt and Jordan have flatly rejected Trump’s idea, as have Gazans and other neighbouring countries.\n\nAzzam’s outrage comes as Trump and Israeli Prime Minister Benjamin Netanyahu are set to meet in Washington later Tuesday and discuss plans for the Palestinian territory ravaged by more than 15 months of war.\n\n“Trump and Netanyahu must understand the reality of the Palestinian people and the people of Gaza. This is a people deeply rooted in their land — we will not leave,” Azzam told AFP.\n\nIhab Ahmed, another Rafah resident, deplored that Trump and Netan­yahu “still don’t understand the Palestinian people” and their attachment to the land.\n\n“We will remain on this land no matter what. Even if we have to live in tents and on the streets, we will stay rooted in this land,” the 30-year-old said.\n\nAhmed told AFP that Palestinians had learned lessons from the 1948 war that followed the British mandate, when hundreds of thousands of Palestinians were chased from their homes at the creation of Israel, and never allowed to return.\n\n“The world must understand this message: we will not leave, as happened in 1948.”\n\nPublished in Dawn, February 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/050937005495604.jpg",
  "retrievedAt": "2025-08-25T19:22:47.129Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889814/we-will-not-leave-say-gazans-as-trump-meets-netanyahu",
  "dateList": "2025-02-05",
  "date_published": "2025-02-05T02:21:35.000Z"
}
