{
  "title": "March 23 calls national unity, coherence to curb COVID-19",
  "link": "https://www.app.com.pk/national/march-23-calls-national-unity-coherence-to-curb-covid-19/",
  "date_published": "2020-03-23T06:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP):Special Assistant to the Prime Minister on Information and Broadcasting (SAPM) Dr Firdous Ashiq Awan Monday said Pakistan day celebrated on 23 March calls the nation to revitalize the same national unity and coherence as expressed eighty years back to curb the pandemic of COVID-19 or coronavirus.\nAddressing a press conference here, she said Pakistan Day was the bright day of history when the Muslims of sub-continent gained a clear code of life.\nFirdous said, “Our great leader and founding father Quaid e Azam Mohammad Ali Jinnah and his team after numerous sacrifices and untiring efforts created Pakistan. Today, March 23 proves the credence of two nations theory where minorities of the sub-continent especially Muslims are being mercilessly killed and persecuted. It is the day to salute the vision of Quaid e Azam and our heroes of Pakistan movement.”\nThe SAPM said Quaid had read and understood the Hindutva ideology and extremism and then came to the conclusion that Hindus and Muslims were two separate nations with different cultures and religions and could not live together.\nThe single step of our that leadership had been noted with golden words in history that had proved their far sighted observations true and genuine, she added.\n“At present, over 8 million Muslims are under siege for the last many months and this shows the mentality and ideology of Hindutva zealots,” Firdous said.\nThe SAPM added that currently the country was facing serious challenge of coronavirus which needed to be addressed with same solidarity and unity that was expressed under the leadership of Quaid e Azam Mohammad Ali Jinnah for an independent Muslim state.\nDr Firdous said, “We need to promote this spirit further to develop national cohesion for fighting the pandemic. We re-validate our resolve today that under the leadership of Prime Minister Imran Khan we will inherit a prosperous, strong and developed country to our coming generations.”\nShe noted that a day earlier after the Prime Minister’s speech many politicians and media anchors had expressed their opinions where all of them proposed for a lockdown across the country.\n“There is need to understand the definition of lockdown given by Prime Minister Imran Khan in his address to the nation. He quoted that in order to implement your directions you keep people inside their homes by applying force through Army, law enforcement agencies and police,” she said.\nThe Prime Minister under article 131A of Code of Criminal Procedure (CrPC) after requisition had moved a summary from the provincial governments and special authority would be conferred under article 242 to call the armed forces upon their request when needed or as per the conditions of law and order in their domains.\nShe informed that the prime minister had given the approval whereas after the federal cabinets approval the summary would be notified.\n“The discretionary powers of putting a partial lockdown has already been given to the provinces,” she added.\nThe Prime Minister intended to overcome the challenge of COVID-19 with incremental lockdown, stepwise social distancing and public support, the SAPM said.\nShe mentioned that no government could impose measures without public cooperation and this war against coronavirus could not be won without public agreement.\n“Therefore Prime Minister Imran Khan is active for ensuring public rights and has also appealed to the nation for fulfilling their duties,” she added.\nWhile criticizing Pakistan Muslim League Nawaz (PML-N) leader Shehbaz Sharif, she said some political leaders were using coronavirus as a political tool and they should abstain from using COVID-19 for their political survival.\n“There are 99 percent chances for recovering from coronavirus where the media should highlight the recovered patients so that it could create a hope among the masses to fight back the pandemic,” she said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:59:12.106Z"
}
