{
  "title": "Command and Control Centre confirms 875 coronavirus cases",
  "link": "https://www.app.com.pk/national/ccc-confirms-805-coronavirus-cases/",
  "date_published": "2020-03-22T23:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP):Command and Control Centre on Corona, Ministry of National Health Services on Monday said that the total number of coronavirus (COVID-19) related cases reached 875 in the country with addition of 99 new positive cases.\nAccording to spokesperson of the centre, six deaths have been reported from the disease so far while 394 cases were reported from Sindh, 246 from Punjab, 38 from Khyber Pakhtunkhwa, 110 from Balochistan, 15 from Islamabad Capital Territory, 71 in Gilgit Baltistan and one in Azad Jammu and Kashmir.\nHe said that new patients were being treated at hospitals besides, old ones while six patients have been discharged after complete recovery.\nSpecial Assistant to Prime Minister on National Health Services Dr Zafar Mirza said that the government has prepared a list of hospitals for initial support to the coronavirus patients.\nIn a media talk, he said that Federal General Hospital is being allocated for coronavirus patients in Islamabad while private sector hospitals will also be allocated for the purpose. He added the government has made future strategy in case of increasing number of cases.\nDr Mirza said that the federal government, provinces and all stakeholders are working on war footing for safety and wellbeing of people of Pakistan.\nAll resources are mobilized and measures taken for prevention and mitigation. He advised citizens to clean hands regularly with an alcohol-based hand rub, or wash them with soap besides cleaning surfaces regularly with recommended disinfectants, he added.\nHe asked citizens to avoid touching your eyes, nose and mouth with contaminated hands and practice respiratory hygiene by coughing or sneezing into a bent elbow or tissue and then immediately dispose off.\nHe said that citizens should wear a medical or surgical mask if they have respiratory symptoms and perform hand hygiene after disposing off of the mask. He asked to maintain a minimum of mandatory one meter distance from individuals with respiratory symptoms.\nHe said that the government will issue an advisory for citizens of federal capital. He added ensuring foolproof protective measures is the responsibility of the government.\nMeanwhile, according to data shared by National Institute of Health (NIH), total travelers screened at points of entry were 12,301 in last 24 hours while so far 1,089,933 passengers have been screened. Total 217 suspected were reported from screening at points of entry.\nThe National Emergency Operation Centre helpline 1166 received so far 84,700 calls since January 31, 2020 with 9,654 new calls.",
  "retrievedAt": "2025-08-11T18:59:07.812Z"
}
