{
  "title": "No new regulations or taxes imposed on tobacco crop or landowners: Azam Nazeer",
  "author": null,
  "content": "ISLAMABAD, May 16 (APP):Federal Law Minister Azam Nazeer Tarar Friday said that no new regulations or taxes have been imposed on the tobacco crop or landowners in Khyber Pakhtunkhwa.\nThe government is committed to the promotion of agriculture and to providing all necessary facilities to farmers.\nSpeaking in the National Assembly on Friday in response to concerns raised by Syed Waseem and Asad Qaiser regarding the tax on tobacco crop, the minister informed the House that under the leadership of Prime Minister Muhammad Shehbaz Sharif, the government believes in the development of agriculture and in supporting farmers.\nHe said that two major multinational tobacco companies pay Rs 250 billion in taxes and hold a 44% market share, while local companies hold a 56% share but contribute only slightly more than 3% in taxes.\nThe minister said that there is an estimated tax gap of Rs 200–300 billion in the tobacco sector.\nAzam Tarar reiterated that no new regulations or taxes have been imposed on tobacco crops or landowners. However, government oversight begins when the crop moves into the processing phase.\nHe mentioned that there are some proposals regarding raw tobacco and assured that the government is aware of the challenges faced by farmers.\nThe minister emphasized that agriculture plays a vital role in the national economy and that the prime minister has given special attention to improving seeds and plant protection.\nAzam said that industries earning profits have a responsibility to contribute their fair share to the national treasury.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:33:32.676Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/no-new-regulations-or-taxes-imposed-on-tobacco-crop-or-landowners-azam-nazeer/",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T09:40:00.000Z"
}
