{
  "title": "PCP playing proactive role in countering fake news in print media: Jadoon",
  "author": null,
  "content": "ISLAMABAD, May 16 (APP): Chairman of Press Council of Pakistan (PCP) Muhammad Arshad Jadoon said on Friday that his organization had been playing a proactive role in the prevention of the publication of false news in the print media.\n“Pakistani media has played a responsible role during the recent standoff with India”, he told APP during an exclusive interview.\nArshad Jadoon said that the PCP, which came into existence under an ordinance in 2002, was a big organization, but unfortunately, it was facing multiple problems, the main being a lack of funds.\nHe said that after assuming office as chairman in February 2024, steps were taken to make the organisation fully functional.\nHe said its office was shifted to new premises and an executive room of the Press Council was set up there.\n“In addition, we have made a media ethics law so that action can be taken against those who publish fake news according to the law”.\nHe said that besides the federal capital, the Press Council of Pakistan was functioning in all four provinces, Gilgit-Baltistan and Azad Kashmir.\n“We have organized seminars in different universities to sensitise the masses on the enactment of media laws and prevention of fake news.”\nThe PCP chairman said that his organization was in contact with all journalistic organizations, including Pakistan Federal Union of Journalists, the All Pakistan Newspaper Society and action was taken against those who published fake news as per law.\nArshad Jadoon said that he had visited various press clubs of Pakistan and informed the journalistic community about the effectiveness of the PCP.\nHe informed that 1800 newspapers were registered with the Press Council of Pakistan, but many newspapers were also being published with the registration process not completed yet.\n“In this regard, we have written to the Chief Secretaries and Deputy Commissioners to ensure the registration of all newspapers. We have also received such complaints that many traders or people doing any work have published dummy newspapers and published bogus news against certain persons to blackmail them. Action will be taken to rectify this”, he remarked.\nHe said that action has also been taken against a property dealer who was blackmailing traders by publishing fake news in a newspaper.\nHe said that any newspaper registered with the Press Registrar had to be registered with the Press Council of Pakistan after charging a small fee.\nHe said that the Press Council of Pakistan has taken suo motu notice regarding several fake news reports and action was started against them by sending a 15-day notice.\nThe PCP said that the organisation has started an internship program for students from different universities.\nHe said seasoned journalists, including former PFUJ General Secretary Nasir Zaidi, former National Press Club President Anwar Raza and Chairman of Hazara Journalists Association Taimur Jadoon, had given detailed lectures.\nTo a question, the Chairman of the PCP said that the government has made excellent legislation to regulate social media.\nHowever, he clarified that the regulation of social media was not the job of PCP; it could only play its role in the regulation of print media.\nArshad Jadoon said that during the recent Indo-Pak tensions, most of the fake news was spread by Indian media, whereas Pakistani media had played a responsible role.\nHe said that the whole world has condemned the Indian media for spreading fake news, propaganda and promoting sensationalism.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:33:34.474Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pcp-playing-proactive-role-in-countering-fake-news-in-print-media-jadoon/",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T08:34:00.000Z"
}
