{
  "title": "People, Parliament stand shoulder to shoulder with armed forces: Ayaz Sadiq",
  "author": null,
  "content": "ISLAMABAD, May 16 (APP):Speaker National Assembly Sardar Ayaz Sadiq has extended heartfelt congratulations to the entire nation on the historic victory against India, expressing profound gratitude to Almighty Allah for His countless blessings.\n“No amount of gratitude is sufficient for the favour bestowed upon us,” he said while paying glowing tribute to the martyrs who laid down their lives for the defense of the motherland.\nThe Speaker honored their supreme sacrifices and bravery and said “The valorous response of our courageous armed forces to the India’s shameful aggression has made the entire nation proud,” he added.\nAyaz Sadiq has said that Pakistan has emerged stronger and more united after the victorious day of 10th May, with a renewed sense of national pride and optimism prevailing across the country.\n“Pakistan at present is reflecting a revived spirit of resilience and joy, echoing our triumph in the battle for truth and justice,” he added.\nHe emphasized that Pakistan has attained a unique and distinguished stature on the global stage as a result of its principled stand and unwavering commitment to sovereignty.\nAyaz Sadiq lauded the unwavering support and unity demonstrated by the Parliament and the people of Pakistan, standing shoulder to shoulder with the Armed Forces like a fortified wall.\n“Every Pakistani is willing to sacrifice their life for the defense of our homeland,” he affirmed.\nAyaz Sadiq also appreciated the role played by Pakistani media and youth, the Speaker said that their exemplary contributions during this critical juncture would be remembered as a hallmark of national unity and strength.\nHe also praised the patience and discipline shown by the people of Pakistan in the face of unprovoked Indian aggression.\nAyaz Sadi commended both the political and military leadership for displaying unity and commitment during testing times.\n“Our armed forces gave a resolute and befitting response to the enemy, thwarting its malicious designs and safeguarding the dignity and sovereignty of Pakistan.”\nHe reiterated that the sacrifices of the martyrs will never be forgotten, and that the entire nation remains a symbol of solidarity and collective resolve.\n“The courage and morale demonstrated by the soldiers of the Pakistan armed forces has proven that determination can defeat even the most formidable adversaries.”\nThe Speaker further underscored that all political parties, setting aside their differences, have stood united with the armed forces, reinforcing the spirit of national unity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:33:41.332Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/people-parliament-stand-shoulder-to-shoulder-with-armed-forces-ayaz-sadiq/",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T08:41:00.000Z"
}
