{
  "title": "Session held to combat MIL challenges",
  "author": null,
  "content": "ISLAMABAD, May 15 (APP): In a significant step toward fostering a digitally responsible and informed society, UNESCO, in collaboration with Media Foundation 360, the Department of Digital Media at the University of the Punjab and the Pakistan Institute for Parliamentary Services (PIPS) organized a high-level technical session in Islamabad titled “Shaping National Policy: Enhancing Policymakers’ Understanding of Media and Information Literacy (MIL) Challenges.”\nThe session held at PIPS brought together members of the National Assembly, parliamentarians from the Standing Committee on Information and Broadcasting, media professionals, communication strategists, and academic experts to discuss the integration of Media and Information Literacy into Pakistan’s national policy frameworks.\nThe event served as a platform to deliberate on how MIL can serve as a tool to combat disinformation, foster critical thinking, and build democratic resilience among citizens, particularly youth.\nThe event commenced with welcoming remarks from Executive Director of PIPS Asim Khan Goraya, who emphasized the importance of equipping policymakers with strategic insights into the risks posed by misinformation in the digital age.\nChairperson of the Department of Digital Media and the lead for the strategy development Prof. Dr. Savera Mujib Shami presented the key elements of the draft National MIL Strategy. She highlighted the strategy’s focus on embedding MIL into Pakistan’s educational curricula, media practices, and governance systems, with an emphasis on youth empowerment, gender inclusion, and ethical digital engagement.\nThe Officer-in-Charge of the UNESCO Office in Pakistan Antony Kar Hung Tam addressed the gathering and underlined UNESCO’s commitment to supporting Pakistan in building inclusive knowledge societies. He reiterated the organization’s vision of empowering citizens to navigate the complex digital information landscape safely and responsibly through Media and Information Literacy.\nThe session featured an interactive panel discussion and roundtable dialogue, chaired by the Member of the National Assembly Syeda Shehla Raza. The conversation revolved around the urgent need to empower youth with critical thinking skills, promote civic education, and instill democratic values to counter the growing threat of disinformation.\nParticipants discussed how MIL could be used beyond classrooms to strengthen public discourse and social cohesion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:34:04.580Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/session-held-to-combat-mil-challenges/",
  "dateList": "2025-05-16",
  "date_published": "2025-05-15T19:05:00.000Z"
}
