{
  "title": "Youm-e-Tashakur celebrated by MOFEPT with heartfelt art exhibition “The Silent Expression”",
  "author": null,
  "content": "ISLAMABAD, May 16 (APP): The Ministry of Federal Education and Professional Training (MOFEPT) marked Youm-e-Tashakur with fervor and national pride by organizing a moving art exhibition titled “The Silent Expression” at the Pakistan National Council of the Arts (PNCA).\nThe exhibition featured artwork created by hearing-impaired children, offering a unique platform for these young artists to share their emotions, dreams and perspectives through visual expression.\nThe event was graced by Minister of State for Federal Education and Professional Training, Ms Wajiha Qamar, who served as the chief guest.\nCommending the children’s artistic talent, she remarked, “Today, I am not the chief guest -these special children are. Their creativity and resilience are a source of inspiration for us all.”\nIn her address, Ms Qamar also reflected on the significance of Youm-e-Tashakur, extending heartfelt gratitude to Pakistan’s armed forces. “It is because of their sacrifices that we sleep peacefully at night,” she said, honoring their role in safeguarding national security and peace.\nParliamentary Secretary for MOFEPT, Ms Farah Naz Akbar, also spoke at the occasion, reaffirming Pakistan’s commitment to peace and unity. “Pakistan is a peace-loving nation, but it will never succumb to aggression,” she stated.\nDrawing a heartfelt parallel, she expressed the same love for the country as she does for children with special needs, emphasizing inclusivity and compassion.\nThe event was hosted by Captain Asif Iqbal, Director General of Special Education at MOFEPT, and was attended by a wide array of participants including educators, parents, students, and members of civil society.\n“The Silent Expression” stood as a compelling testament to the voices of children who often remain unheard. By highlighting their creativity and strength, the exhibition served not only as a celebration of talent but also as a powerful call for empathy, understanding, and national cohesion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:32:19.096Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/youm-e-tashakur-celebrated-by-mofept-with-heartfelt-art-exhibition-the-silent-expression/",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T14:35:00.000Z"
}
