{
  "title": "NUML pays tribute to National Heroes on Youm-e-Tashakur",
  "author": null,
  "content": "ISLAMABAD, May 16 (APP):The National University of Modern Languages (NUML) commemorated Youm-e-Tashakur with solemnity and patriotic fervor to honor the valiant heroes of the Pakistan Armed Forces who courageously defended the nation during    Marka-i-Haq.\nA series of events were organized to express gratitude and unity as a nation, said a press release.\nThe day began with Qur’an Khwani at the NUML Masjid, followed by a special Dua for the martyrs who laid down their lives in defense of the country against Indian aggression. Prayers were also offered for the swift recovery of those injured during the conflict.\nSubsequently, a solidarity rally was held on the university campus in support of the Pakistan Armed forces. The rally witnessed enthusiastic participation from NUML leadership, faculty members, and a large number of students. Participants carried placards with patriotic slogans, reaffirming their unwavering support for the Armed Forces and expressing their resolve to stand united with them in every challenging time.\nTo further honor the sacrifices and bravery of the nation’s defenders, a seminar was organized in NUML’s Main Auditorium. The event served as a powerful reminder of the courage and resilience exhibited by the Pakistan Armed Forces during Marka-i-Haq.\nAddressing the gathering, Director General NUML, Brigadier Shahzad Munir, paid tribute to the armed forces and expressed gratitude to Almighty Allah for blessing the nation with victory. He remarked that since the befitting response by Pakistan Air Force on May 7, Indian aircraft have not dared to violate Pakistani airspace again. He emphasised that Marka-i-Haq has strengthened national unity and demonstrated Pakistan’s commitment to peace. However, he made it clear that any act of aggression will be met with full force.\n“You are the future of this nation,” he told the students, “and this is your victory. With Allah’s help, no force on earth can defeat or harm Pakistan.”\nThe event concluded with chants of “Pakistan Zindabad” echoing through the auditorium, reinforcing the spirit of patriotism and unity among the participants.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:31:54.971Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/numl-pays-tribute-to-national-heroes-on-youm-e-tashakur/",
  "dateList": "2025-05-16",
  "date_published": "2025-05-16T17:21:00.000Z"
}
