{
  "title": "Exhibition titled ““A tribute to the people of Pakistan” on June 05",
  "link": "https://www.app.com.pk/national/exhibition-titled-a-tribute-to-the-people-of-pakistan-on-june-05/",
  "date_published": "2024-06-03T11:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP): Pakistan National Council of the Arts (PNCA) in collaboration with the ForArt’sSake will organize an art exhibition titled “A tribute to the people of Pakistan” by renowned artist and social worker Jimmy Engineer on June 05.\nSpeaker National Assembly Sardar Ayaz Sadiq will be the chief guest in the opening ceremony of the exhibition.\nJimmy Engineer, is an internationally acclaimed artist and social worker and his canvases have been exhibited extensively in Pakistan and abroad.\nAround sixty to seventy countries have the artworks of Jimmy Engineer. His paintings are in various private collections in Italy, France, Denmark, Switzerland, Russia, China, Germany, and the USA.\nA curated show by Dr. Rahat Naveed and Amna I Pataudi, of Jimmy‘s 100 canvas prints will be exhibited in the national art gallery, for the viewer’s delight.\nThe exhibition is titled “A Tribute to the People of Pakistan by artist and social worker “Jimmy Engineer( servant of Pakistan ).”\nHis work ranges from landscapes, sea scape ,still life to cultural, abstract, color philosophy series, poverty series and historical paintings on the partition of India and creation of Pakistan, drawings on various aspects of social injustice. In his philosophical series he painted “Javednama.”\nThe architectural series was completed in 13 years. He painted 90 paintings out of which 35 to 40 are on display. Historical series, based on the 1947 partition of India, he started painting in the 1970s, The work is striking in its detail, and its amazing color palette captures the viewer’s heart.\nThe selection from his works was not easy but to give viewers a taste of his genius the curators have managed to get hold of a few.\nThe most mind-blowing fact about Jimmy’s dedication towards his mission is donating 700,000 canvas prints to charity all over the world.\nThe exhibition will remain open till June 14, the viewer will have the opportunity to meet the artist and get inspired by his passion and dedication.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:56:23.834Z"
}
