{
  "title": "Edu ministry providing meal to 32000 students of 102 ICT schools",
  "link": "https://www.app.com.pk/national/edu-ministry-providing-meal-to-32000-students-of-102-ict-schools/",
  "date_published": "2024-06-03T17:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP):Ministry of Federal Education and Professional Training on Monday said that National Nutrition Initiative was gaining momentum daily, with 102 schools covered for school meal programs in Islamabad.\nAccording to the Ministry, under meal initiative more than 32,000 students were daily getting nutritious meals in their schools.\nThese meals are found to be beneficial in attracting Out of School Children to regualr schooling and reducing dropouts thus, increasing daily attendance and retention.\nAs per details the number of children in schools benefiting from school meals program including Islamabad Model School F-6/3 Kohsar Market 400 children getting meal under (School Khana Program), Islamabad Model School G-9/1 185, Islamabad Model School F-6/4 St # 46, 400, Islamabad Model School F-10/2, 300, Islamabad Model School G-10/2 (1) 340, Islamabad Model School G-10/2 (2), 270, Islamabad Model School Sihala Kurd 180,\nIslamabad Model School G-8/1 (1) 359, Islamabad Model School G8/1 (2) 250,\nIslamabad Model School G-8/1 (3) 350, Islamabad Model School G-10/1, 555, Islamabad Model School G-11/1, 760\nIslamabad Model School I9/1 (1) 425, Islamabad Model School I9/1 (2), 431, Islamabad Model School I-9/4 (1) 460, Islamabad Model School I9/4 (2) 430, Islamabad Model School G-9/3 (1) 262, Islamabad Model School G-9/4 (1) 255, Islamabad Model School G-9/4 (2) 136, Islamabad Model School G-9/3 (2)483, Islamabad Model School F10/4, 340, Islamabad Model School G-9/3 (3)260, Islamabad Model School I-10/1 (2) 370, Islamabad Model School F-10/1 (1) 240, Islamabad Model School G-8/3 (PIMS) 140, Islamabad Model School G-8/2 (2) 220, Islamabad Model School G-8/2 (1) 309, Islamabad Model School G-8/4 (1)341,Islamabad Model School G-8/4 (2)305, Islamabad Model School Sohan Boys 525, Islamabad Model School Swan Garden245, Islamabad Model School CBR Town 293, Islamabad Model School Lohi Bhair 335, Islamabad Model School PWD299, Islamabad Model School Dhok Mai Nawab 210, Islamabad Model School Darwala 55, Islamabad Model School AIOU 168, Islamabad Model School G-10/4, 170, Islamabad Model School Boora Bangial boys 145, Islamabad Model School G-7/2, 370, Islamabad Model School E-7/4, 128, Islamabad Model School G6/1-4490, Islamabad Model School G-6/1-1, 520, Islamabad Model School Bora Bangial Girls 180, Islamabad Model School Gangota 170, Islamabad Model School Sihala Girls 230, Islamabad Model School Sihala Boys 60,\nIslamabad Model School Sihala Mirzian Boys 188, Islamabad Model School Sihala Mirzian Girls 270,\nIslamabad Model School Herno 195, Islamabad Model School Siri40, Islamabad Model School Dhok Fatial 60\nIslamabad Model School Mohra 63, Islamabad Model School Tumair 180, Islamabad Model School Chappar85,\nIslamabad Model School Kalia180, Islamabad Model School Chira Boys75, Islamabad Model School Chira Girls 240,\nIslamabad Model School Nilore Boys 105, Islamabad Model School Nilore Girls 430 students.\nFurthermore, IMS G IV Shakrial 304, IMS G IV Khana Nai Abadi 160, IMS B IV Khana Kak 90, IMS B IV Tarlai 433, IMS G IV Tarlai 240, IMS G IV Tamma210, IMS G IV Ali Pur Farash268, IMS G IV Ali Pur South 225,IMS G IV Panjgran 290, IMS G IV Frash Town 310, IMS B IV Jhang Syedan430, IMS G IV Jhang Syedan290, IMS G IV Ali Pur (MV) 350 IMS B IV CH Bangial100, IMS G IV CH Bangial 95, IMS IV I-10/1 (1) 800, I-MS IV I10/2 800, Islamabad Model School Sohan Girls (School Khana Program) 530, IMS IV Chakhtan 60, IMS IV Pindmistrian 200, IMS IV Severa25, IMS IV Ara 200, IMS IV Sharif Abad 25,IMS IV Biath 30, IMS IV Mohra Silona 30, IMS IV I-8, 900, IMS G11 (2)470, G-9/2(1) 850, G-9/2 (2) 300,\nG-9/2 (3) 500, G-6/1 (2) 500, G-6/4, 550, G-6/2 LHR 350, G-7/1, 900, G-7/4750, G-7/2 (2) 600, IMS IV E-8/1, 500, IMS IV E-8/2300, IMS IV F-6/1 550, BECS Sohan 1,250, BECS Sohan 2170, and BECS Sohan 380 students will get the meal.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:55:35.679Z"
}
