{
  "title": "Anti-Corruption awareness seminar held at AIOU",
  "link": "https://www.app.com.pk/national/anti-corruption-awareness-seminar-held-at-aiou/",
  "date_published": "2024-06-03T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP):Allama Iqbal Open University (AIOU) is ready to collaborate with NAB to raise its voice against corruption at national level and to create awareness among the youth against this scourge, said Dean, Faculty of Social Sciences and Humanities, AIOU, Prof. Dr. Abdul Aziz Sahir in his address at the anti-corruption awareness seminar held in the university.\nDr. Sahir said that we have campuses in 54 cities of the country, we can introduce short courses, organize seminars, workshops and walks with the cooperation of National Accountability Bureau (NAB) to raise awareness against corruption.\nDr. Abdul Aziz Sahir said that corruption is the root of all evil, so it is considered as a pest for socio-economic development. He added that by following the path of the Holy Prophet (PBUH), corruption and other crimes can be completely eradicated from the society.\nThis seminar was organized by the Directorate of Student Affairs, AIOU, in collaboration with NAB Rawalpindi. Other speakers included Director, NAB, Abdul Khaliq, Dean, Faculty of Arabic and Islamic Studies, Prof. Dr. Mohyuddin Hashmi and Dr. Syed Imran Haider. Dr. Sadia Anwar Pasha hosted the seminar. The speakers said that corruption is as dangerous as a termite for any society.\nDr. Mohyuddin Hashmi said that corruption is our internal enemy, which is causing us more damage than the external enemy.\nHe highlighted the moral and religious aspects of corruption in detail. Director NAB, Abdul Khaliq said that the only solution to eradicate corruption lies in raising awareness among the youth and raising their voices against corruption.\nTwo female students and two male students gave speeches in Urdu and English languages on the topic of corruption.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:56:00.641Z"
}
