{
  "title": "Pak-China ink agreements in IT, industry, ports sectors at 10th CPEC JCC",
  "link": "https://www.app.com.pk/national/pak-china-ink-agreements-in-it-industry-ports-sectors-at-10th-cpec-jcc/",
  "date_published": "2021-09-23T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): Pakistan and China Thursday agreed to form a new Joint Working Group (JWG) on Information Technology besides signing lease deed of Gwadar Expo Center, Framework agreement of cooperation between Ningbo Port and Gwadar Port and Memorandum of Understanding (MoU) Karachi Coastal Comprehensive Development Zone (KCCDZ).\nAt the virtually held, the much-awaited 10th Joint Coordination Committee (JCC) on China Pakistan Economic Corridor (CPEC), both sides also signed a letter of exchange for providing solar power lighting equipment to Balochistan and medical equipment and materials to the government of Pakistan as a grant.\nThe meeting was co-chaired by Minister for Planning, Development & Special Initiatives Asad Umar and Vice Chairman of the National Development and Reform Commission (NDRC) of the People’s Republic of China Ning Jizhe.\nThe JCC is the apex body for all joint China-Pakistan decisions related to CPEC. Addressing a press conference here after the conclusion of the meeting, Asad Umar, who was flanked by Special Assistant to Prime Minister on CPEC affairs Khalid Mansoor, said both Pakistan and China expressed satisfaction over the mega project’s progress and with the passage of time its scope, as well as importance, was expanding.\n“The most exciting part of today’s meeting was the formulation of a new JWG on IT because the future of the country is directly linked to this sector,” he said.  The minister said China was directly competing with the United States in this sector so its experience and technology would help Pakistan a lot and the youth would take benefit of the vast opportunities coming of this sector.\nHe said Pakistan was developing fast in the IT sector as during last year the IT export had increased by 47% to over $2 billion and the cooperation under CPEC would further accelerate the development.  Concerning security, the minister added that not only the Chinese investment was coming to the Special Economic Zones (SEZs) but outside the zone, too many industries were being established by the Chinese investors so the government had decided to form a special cell under the Interior Ministry to look after the security matters of Chinese investors.\nHe said the world powers especially the hostile neighboring country were not happy with the project therefore they were leaving no stone unturned to sabotage the project. But he said our security forces were fully capable of protecting the foreign investors.\n“We have reached a tipping point as CPEC has gained momentum which is destined to further expand and flourish,” he added.  To a question about the ML-1 railway project, the minister informed that there were certain issues, and once they’re resolved, the project would start in no time.  He said China wanted transactions in its currency while Pakistan was preferring dollars in the railway project.\nSimilarly, he said negotiation on interest rate was also in progress.  Earlier the meeting was also addressed by all Chief Ministers and Prime Minister of Azad Jammu and Kashmir. Speaking in the JCC meeting Chief Minister Balochistan Jam Kamal invited China to take benefit from the unexplored natural resources in Balochistan.\nBalochistan is a resource-rich country, he said adding the province was also rich in oil and gas resources as 85% of Balochistan land has not been explored yet.  Finance Minister Khyber Pakhtunkhwa Taimur Khan said Peshawar Dera Ismail Khan Motorway would provide the shortest route to Gwadar and access to Afghanistan.\nHe also proposed some new projects to be included in CPEC including Chashma right bank canal and 500 KW Chitral transmission line.  CM Sindh Syed Murad Ali Shah urged to include the Karachi Circular Railway project in CPEC.  “We request that all the requisites be fulfilled for early finalizing the project”, he added.\nHe said the Sindh Government was keen to engage the Chinese investors in a range of sectors in Dhabeji SEZ.  CM Punjab Sardar Usman Buzdar said economic relations were touching new heights under the leadership of Prime Minister Imran Khan.  He said Allama Iqbal Industrial city was already operational under CPEC.\nHe invited the Chinese investors to take maximum benefit of the potential that exists in the Special Economic Zone in Punjab.  PM AJK Sardar Abdul Qayum urged for the inclusion of the project for the construction of Mansehra Muzafarabad Mangla road in the CPEC.\nHe said the  AJK government had already allocated land for SEZ at Mirpur, which must also be prioritized in CPEC.  CM GB Khalid Khursheed said GB was the gateway to CPEC with over 400 km of the border area with China.\nHe called for including Gilgit-Baltistan Shandoor road and hydel power projects in the CPEC. He also proposed to add a new JWG on tourism in CPEC JCC to promote tourism between the two countries and beyond.",
  "retrievedAt": "2025-08-11T21:18:53.036Z"
}
