{
  "title": "Secretary Sports Punjab and DG, SBP inaugurate Youth Helpline",
  "link": "https://www.app.com.pk/national/secretary-sports-punjab-and-dg-sbp-inaugurate-youth-helpline/",
  "date_published": "2021-09-23T15:16:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 23 (APP):Secretary Sports and Youth Affairs Punjab Fuad Hashim Rabbani and Director General Sports Punjab Adnan Arshad Aulakh inaugurated Sports and Youth Affairs Department Punjab’s first Punjab Youth Helpline at Punjab Stadium here on Thursday.\nCountry Representative UN Population Fund Dr Bakhtior Kadirov, Additional Secretary Sports Maria Tariq, Deputy Secretary Admin M Ashraf, Khubaib Kayani (Director Youth), Mohammad Arsalan (Youth Coordinator), Shoaib Ahmed Shahzad, Ms Sabrina Khan, Ms Saliha Ramay and Ms Dilshad Pari were also present on this occasion.\nSecretary Sports and Youth Affairs Punjab Fuad Hashim Rabbani, Director General Sports Punjab Adnan Arshad Aulakh and UNFPA Representative Dr Bakhtior Kadirov were also given souvenirs on this occasion.\nTalking to media, Secretary Sports and Youth Affairs Punjab said the helpline was established with the collaboration of Rahnuma Family Planning Association of Pakistan to provide effective guidelines to youth for the redressal of their multiple issues.\nAnswering a question, he said through this helpline the talented youth of the province will be provided counseling service regarding health, education, sports and career selection issues.He said new software has been developed and installed at Helpline for data recording and reporting. “This software is capable of producing pre-defined consolidated reports, exportable to excel reports and graphical reports”.\nDirector General Sports Punjab Adnan Arshad Aulakh, on this occasion said that the Sports and Youth Affairs Department Punjab is taking important measures for the welfare of youth of the province. “Now our talented youth could be able to choose their career quite comfortably through Punjab Youth Helpline”.\nHe said: “Our doors are open for all talented youth of the province and young people both male and females between age bracket of 15-29 from different districts of Punjab can avail these counseling services through a telephone call at Toll Free Number 0800-88812”.\nHe said our country has been blessed with a large number of youth and now we will be able to resolve key issues of our youth through this helpline. “Meaningful youth participation is key to achieve national sustainable development goals”.\nEarlier, Country Representative UN Population Fund Dr Bakhtior Kadirov gave a thorough briefing to Secretary Sports Punjab and DG, SBP about Punjab’s first ever Youth Helpline.",
  "retrievedAt": "2025-08-11T21:18:53.025Z"
}
