{
  "title": "GSP+ status for Pakistan to continue",
  "link": "https://www.app.com.pk/national/gsp-status-for-pakistan-to-continue/",
  "date_published": "2021-09-22T19:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP): The European Commission has decided to maintain the Generalized Preferential System Plus (GSP-Plus) status for Pakistan, with introduction of new six conventions for the low income countries.\nThe commission, in a statement on Wednesday, said that it has introduced six new conventions related to providing facility to people with physical disability, tackling climate change, and child labour for the .\nFurthermore, it has also introduced new GSP rules in order to facilitate the low-income countries.\nThe Commission, which reviewed the status of several other countries along with Pakistan, said talks would continue with the EU-Pakistan Joint Commission. Today’s review related to the EU Regulation establishing the EU’s GSP framework, which expired at the end of 2023.\nThe Commission in a statement said that it adopted the legislative proposal for the new EU’s Generalised Scheme of Preferences (GSP) for the period 2024-2034. “The Commission is proposing to improve some of the key features of the scheme to better respond to the evolving needs and challenges of GSP countries as well as reinforce the scheme’s social, labour environmental and climate dimension,” it added.\nThe GSP Regulation is a unilateral trade tool that removes or reduces import duties from products coming into the EU from vulnerable low-income countries, supporting poverty eradication, sustainable development, and their participation in the global economy.\nThe Commission’s proposal makes the EU’s GSP more focused on reducing poverty and increasing export opportunities for low-income countries. It aims to incentivise sustainable economic growth in low-income countries and offers new room for engagement on environmental and good governance issues.\nThe new GSP framework strengthens the EU’s possibilities to use trade preferences to create economic opportunities and to advance sustainable development.\nThe modernised framework also expands the grounds for the withdrawal of EU GSP preferences in case of serious and systematic violations. Beyond the core human rights and labour conventions already covered, the proposal incorporates environmental and good governance conventions.",
  "retrievedAt": "2025-08-11T21:18:58.667Z"
}
