{
  "title": "Model `Panagahs’ to be established soon to help poor people, labourers: PM",
  "link": "https://www.app.com.pk/national/model-panagahs-to-be-established-soon-to-help-poor-people-labourers-pm/",
  "date_published": "2021-09-23T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): Prime Minister Imran Khan on Thursday said that under a comprehensive project, model Panagahs (shelter homes) will be established across the country soon.\nThe establishment of Panagahs had nothing to do with politics, and was aimed at serving the poor people, he added.\nThe Prime Minister was talking to Special Assistant on Poverty Alleviation and Social Safety Dr. Sania Nishtar, who called on him here.\nManaging Director Pakistan Bait-ul-Maal and Chairman Capital Development Authority were also present in the meeting.\nThe Prime Minister directed for paying special attention to the already existing overcrowded Panagahs.\nHe said the objective behind establishing Panagahs was to protect the honor of the economically weaker and poor segments of the society.\nPrior to the establishment of Panagahs, labourers were compelled to sleep on roadsides, he added.\nThe Prime Minister was briefed in detail about the comprehensive project to improve the condition of existing Panagahs.\nHe was told that under the project, which will be implemented in three phases, facilities at the existing Panagahs will be improved and the staff of Panagahs will be given hospitality training with the cooperation of a private international hotel.\nThe Prime Minister was further told that with the formation of a central board for policy implementation, a four-member board will be established at each Panagah to look after the administrative matters.\nRegarding the facilities, digital dashboard will be created to help monitor the Panagahs. The digital dashboard will also be able to be operated through a mobile phone.\nThe Prime Minister was told that the problems in existing Panagahs will be identified and addressed. Shifting of Panagahs to the buildings constructed for this purpose was also part of the project.\nHe was further informed that Ehsaas One-Window Centers will also be opened alongside the Pangahs. It will enable the deserving people living at Panagahs to get facilities from other programmes under Ehsaas.",
  "retrievedAt": "2025-08-11T21:18:51.938Z"
}
