{
  "title": "NAB requests IHC to conduct day to day hearing in Maryam Nawaz appeals",
  "link": "https://www.app.com.pk/national/nab-requests-ihc-to-conduct-day-to-day-hearing-in-maryam-nawaz-appeals/",
  "date_published": "2021-09-23T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): The National Accountability Bureau (NAB) on Thursday requested the Islamabad High Court (IHC) to conduct day to day hearing in appeals of Vice President Pakistan Muslim League Nawaz (PML-N) Maryam Nawaz and her husband Captain (R) Muhammad Safdar in Avenfield Property reference.\nIn an application filed to the court, the NAB stated that the accused repeatedly using delaying tactics deliberately. Maryam Nawaz’s lawyer had been giving excuses for a year to delay the hearing.\nIt prayed the court to conduct day to day hearing and decide the appeals within a month.\nA division bench comprising Justice Aamer Farooq and Justice Mohsin Akhter Kiyani heard the appeals in graft reference. PML-N’s leader Maryam Nawaz appeared before the court.\nAt the outset of hearing, PML-N leader Atta Tarar Advocate arrived at the court rostrum and informed the bench that Maryam Nawaz had hired Irfan Qadir as her new counsel.\nHe prayed the court to grant one month time to the new lawyer for preparing a petition on behalf of Maryam Nawaz.\nAtta Tarar argued that there was no delay from their side, adding that Amjad Pervaiz, the previous counsel, was unable to attend the proceeding due to illness.\nAt this, Justice Aamer Farooq expressed concern on the request and said it was giving the impression that you were using delaying tactics. Irfan Qadir should have appeared himself to get time. Justice Farooq said Amjad Pervaiz should have also appeared before the bench along with his medical certificate.\nNAB prosecutor objected that Amjad Pervaiz had not taken back power of attorney yet while the new counsel of the accused was also not appearing.\nAfter this, the court adjourned hearing of the case till October 6, and instructed the appellants to present their new counsel on next date.",
  "retrievedAt": "2025-08-11T21:18:56.182Z"
}
