{
  "title": "Platinum Jubilee of Diocese to be celebrated whole year around",
  "link": "https://www.app.com.pk/national/platinum-jubilee-of-diocese-to-be-celebrated-whole-year-around/",
  "date_published": "2021-09-23T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP):To mark the Platinum Jubilee of Diocese of Islamabad-Rawalpindi, the Archbishop Dr. Joseph Arshad has announced to celebrate the 75th anniversary with full passion and zeal for the whole year around, from October 2021 to October 2022. \tThe jubilee year would officially begin on October 1 and will conclude in October 2022, Archbishop Dr. Joseph Arshad said in a statement issued here. \tThe opening of the Jubilee year would begin with Eucharistic celebration which will be presided over by Archbishop Christophe Zakhia El-Kassis (Apostolic Nuncio in Pakistan) and con-celebrated by Archbishop Dr. Joseph Arshad and all the priests of the Diocese.\tThe verse chosen for the jubilee year is taken from the Gospel of St. John “I came so that they might have life and have it more abundantly (John 10:10)”. The main theme of the Jubilee Year is “Evangelization, Service and Witness”. During the year, various activities and programs will be held in the diocese to strengthen the faith and spiritual awakening of the faithful.\tIt may be mentioned here that the diocese was originally erected in 1887, as the Apostolic Prefecture of Kafiristan and Kashmir. In 1947, the Apostolic Prefecture was elevated to the status of Diocese, and named as the Diocese of Rawalpindi. In 1979, the name was renamed to the Diocese of Islamabad-Rawalpindi.\tArchbishop Dr. Joseph Arshad said God has bestowed innumerable blessings upon the diocese of Islamabad-Rawalpindi over the years. At present, there were 24 parishes which comprises 216,500 catholic faithful. There were a total of 40 priests, 9 brothers, about 100 religious sisters from different congregations serving the diocese and about 100 full time and part time catechists who are actively engaged in spreading the Good News. \tThere are about 64 Educational institutions with their continued service to the nation and about 28 Charitable and social institutions and organizations that were serving the poor and needy people of the society. \tHe said the Jubilee year is certainly a year of giving thanks to the Almighty God and remembering all the people who devoted their lives to spread the Gospel on the footsteps of the Apostles, sowing the seed of Christian faith in the diocese of Islamabad-Rawalpindi. \t“During this year of Jubilee we recall and appreciate the services of all the Bishops, missionaries, priests, sisters, catechists and the faithful who served with dedication for the spiritual, social, and educational uplift of our Christian community and the society.May God bless Pakistan and each one of us abundantly,” he said.\\9329/23/2021 2:48:30 PM\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:18:59.076Z"
}
