{
  "title": "Covid-19 national tally of active cases drops below 62,000",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-drops-below-62000/",
  "date_published": "2021-09-23T09:43:00.000Z",
  "source": "APP",
  "content": "Fifty-eight corona patients died during past 24 hours, 55 of whom were under treatment in different hospitals and three of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Punjab followed by Khyber Pakhtunkhwa (KP).\nOut of the total 58 deaths occurred, 20 of them died were under treatment on ventilators.\nThere were 4,561 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 4.89 percent.\nThe maximum ventilators were occupied in four major cities including Sargodha 73 percent, Bahawalpur 43 percent, Lahore 54 percent and Multan 86 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of Covid patient) was also occupied in four major cities of Swabi 59 percent, Sargodha 46 percent, Faisalabad 51 percent and Multan 56 percent.\nAround 485 ventilators were occupied elsewhere in the country while no Covid affected person was on ventilator in Azad Jammu and Kashmir (AJK), Balochistan and Gilgit Baltistan (GB).\nSome 48,151 tests were conducted across the country on Wednesday, including 14,751 in Sindh, 15,395 in Punjab, 11,962 in Khyber Pakhtunkhwa (KP), 4,349 in Islamabad Capital Territory (ICT), 609 in Balochistan, 415 Gilgit Baltistan (GB) and 670 in AJK.\nAround 1,143,605 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,232,595 cases were detected that also included the perished, recovered and under treatment Covid-19 patients so far, including AJK 33,923, Balochistan 32,812, GB 10,277, ICT 104,619, KP 172,210, Punjab 425,703 and Sindh 453,051.\nAbout 27,432 deaths were recorded in country since the eruption of the contagion.Around 7,310 people perished in Sindh, 15 of them died in the hospitals on Wednesday.\n12,490 people died in Punjab with 20 deaths occurred during past 24 hours. Some 17 individuals died in the hospitals and three out of the hospitals.\nAs many as 5,463 people expired in KP, 19 of them died in hospitals on Wednesday, 907 individuals died in ICT, two of them died in the hospital on Wednesday, 345 people died in Balochistan, 183 infected people perished in GB, one of them died in the hospital on Wednesday and 734 people died in AJK, one of them succumbed to the deadly virus in the hospital on Wednesday.\nA total of 19,049,329 corona tests have been conducted so far, while 640 hospitals are equipped with Covid facilities across the country. Some 4,816 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:18:58.687Z"
}
