{
  "title": "President for institutional framework to encourage foreign investment in ICT sector",
  "link": "https://www.app.com.pk/national/president-for-institutional-framework-to-encourage-foreign-investment-in-ict-sector/",
  "date_published": "2021-09-23T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): President Dr Arif Alvi on Thursday called for establishing an institutional framework to encourage the multinational companies and the Pakistani diaspora to extend their business setups in Pakistan, particularly in the Information and Communication Technology (ICT) sector.\nAddressing a meeting via video-link with the Pakistani diaspora from Silicon Valley, USA, the president underlined the need to improve the business environment by simplifying the procedure for registration of companies and capital movement to attract foreign investments in Pakistan.\nThe president said the government was taking serious measures to provide an enabling environment to foreign investors.\nHe said the ICT sector was being strengthened owing to its great potential to put the country on fast-track development.\nHe emphasized the need to develop a comprehensive and coordinated strategy to cope with the cyber threats by ensuring the safety of cyberspace for citizens and businesses.\nThe president highlighted that Pakistan produced 30 thousand IT graduates every year, of whom only 5,000 got employment while the rest faced difficulties in getting jobs due to lack of marketable skills.\nHe also emphasized the need to improve the skills of IT experts and graduates by training them as per market requirements.\nThe president assured the Pakistani diaspora of his support to help address their concerns by providing them a business-friendly environment.\nThe meeting deliberated upon the issues being faced by the foreign investors and Pakistani diaspora while setting up businesses and making investments in Pakistan.\nThe leading IT experts of the Pakistani diaspora from Silicon Valley highlighted the issues being faced by them such as the complicated procedure for registration of companies, lengthy process of opening of bank accounts and lack of one-window operation, which hindered foreign businesses and investors coming to the country.\nThe experts suggested various measures to improve the business environment to make Pakistan an attractive destination for investments in the IT Sector.\nThe Securities and Exchange Commission of Pakistan (SECP) informed the meeting that the registration process for companies had been simplified, and it took only four hours to register a company with SECP.\nThe Secretary Board of Investment (BoI) informed that Commercial Courts had been set up in 23 districts of the country to resolve commercial and trade disputes.\nGovernor State Bank of Pakistan (SBP) Dr Reza Baqir informed the meeting that the State Bank was making efforts to provide an enabling environment to businesses and foreign investors.\nThe meeting also stressed the need to amend and simplify the existing notarization procedure to facilitate foreign investors.\nMinister for Information Technology and Telecommunication Syed Amin-ul-Haque, Secretary IT&T Sohail Rajput, Secretary Finance Yusuf Khan, Secretary Commerce Muhammad Sualeh Ahmad Faruqui, Secretary BOIFareena Mazhar, Additional Secretary Ministry of Interior Momin Agha, Registrar SECP Mubashar Saddozai, and member Inland Revenue of Federal Board of Revenue Qaiser Iqbal attended the meeting.\nGovernor SBP Reza Baqir, Ambassador of Pakistan to the USA Asad Majeed Khan along with the members of the Pakistani diaspora, including Moazam Chaudhary, Saleem Ahmad, Zia Chishti, Najeeb Ghauri, Naveed Shervani, Aly Fahd, Raghib Hussain, Idris Kothari, Safwan Shah, Riaz Siddiqi, Ahsan Sohail, Waheed Qureshi, Amir Khan, Ahmad Ayub, Mamoon Hamid and Faisal Sohail participated in the meeting via video-link.",
  "retrievedAt": "2025-08-11T21:18:57.029Z"
}
