{
  "title": "Pakistan down France 3-2 in penalty shoot-out to reach FIH Hockey Nations Cup final - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan qualified for the finals of the FIH Hockey Nations Cup after defeating France on Friday in the first semi-final match in Kuala Lumpur.\n\n“Excellent goals in the second half, followed by amazing goalkeeping in the shootout,” said the International Hockey Federation while praising the team.\n\nThe national hockey team defeated France 3-2 in a penalty shootout after the match tied at 3-3 till regulation time.\n\nRana Waheed Ashraf was declared the man of the match.\n\nAfraz Hakeem, Sufyan Khan and Muhammad Hammaduddin also scored goals for the national team. The final match will be played tomorrow (Saturday).\n\nPakistan Hockey Federation (PHF) President Mir Tariq Hussain Bugti and Secretary General Olympian Rana Mujahid Ali Khan congratulated the national team on winning the game and expressed their best wishes for the final, according to a PHF statement.\n\nIn the second semi-final, New Zealand will take on South Korea at 6pm PKT. The tournament holds high stakes as the winner earns promotion to the elite FIH Hockey Pro League for the 2025–26 season.\n\nFrance and S. Korea earned their spots in the last four from Pool A, with France topping their group. New Zealand and Pakistan emerged from Pool B, with New Zealand securing the top position.\n\nPakistan finished second in Pool B with four points after three matches. Their journey to the semi-finals included a victory against Japan (3-2) and a hard-fought 3-3 draw against host nation Malaysia.\n\nTheir only defeat in the group stage came against New Zealand in a close 4-3 encounter. Despite the loss to New Zealand, Pakistan secured their semi-final berth due to a superior goal difference over Malaysia, who also finished on four points.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/20175937604442c.png",
  "retrievedAt": "2025-08-20T04:20:43.201Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918448/pakistan-down-france-3-2-in-penalty-shoot-out-to-reach-fih-hockey-nations-cup-final",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T13:24:06.000Z"
}
