{
  "title": "Process begins to name advisers for four power companies, two plants - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Privatisation Commission has taken significant steps in advancing its reform agenda by initiating the process for the appointment of financial advisers for four power distribution companies and two power generation plants, while also receiving expressions of interest (EoIs) from eight parties seeking management control of Pakistan International Airlines Corporation Ltd (PIACL).\n\nThese developments mark a major push to accelerate privatisation in key sectors, with the commission aiming to enhance private sector participation, improve efficiency, and reduce the government’s financial burden.\n\nAt its meeting on Wednesday, the Board of the Privatisation Commission approved the process to appoint financial advisers for four power distribution companies — Hyderabad Electric Supply Company (Hesco), Sukkur Electric Power Company (Sepco), Peshawar Electric Supply Company (Pesco), and Hazara Electric Supply Company (Hazeco) — all of which are slated for privatisation in the second phase. Financial advisers will also be appointed for two power generation plants: the 747MW Guddu Power Plant and the 525MW Nandipur Power Plant.\n\nThe board meeting, chaired by Ad­­v­i­ser to the Prime Minister on Privati­sation Muhammad Ali, also reviewed ongoing transactions. Financial advisers for three other distribution companies — Faisalabad Electric Supply Company (Fesco), Gujranwala Electric Power Company (Gepco), and Islam­abad Electric Supply Company (Iesco) — have already been appointed and these companies are part of the first phase of privatisation.\n\nPIA attracts five potential buyers\n\nThe board further examined the status of the Roosevelt Hotel in New York, another strategic asset under consideration.\n\nExpressions of interest\n\nRegarding PIACL, the deadline for submitting EoIs and statements of qualification (SOQs) expired on Thursday for acquiring management control of the national carrier, with a stake ranging from 51 to 100pc of its share capital. This is the second attempt to privatise the airline, with the submission deadline previously extended from June 3.\n\nEight interested parties submitted EoIs, and five of them submitted SOQs by the deadline. These include consortia comprising Lucky Cement Ltd, Hub Power Holdings Ltd, Kohat Cement Company Ltd, and Metro Ventures (Pvt) Ltd; Arif Habib Corporation Ltd and Fatima Fertiliser Company Ltd; City Schools (Pvt) Ltd and Lake City Holdings (Pvt) Ltd; Air Blue Ltd; and a consortium of Augment Securities & Investments (Pvt) Ltd and Serene Air (Pvt) Ltd, joined by Bahria Foundation, Mega C&S Holding, and Equitas Capital LLC. Other parties expressing interest include the AKD Group, Fauji Fertiliser Company Ltd, Habib Rafique Engineering (Pvt) Ltd, and Sardar Muhammad Ashraf D. Baloch (Pvt) Ltd.\n\nThe submitted SOQs will now be evaluated by the commission according to its prequalification criteria. Prequalified parties will proceed to the next phase, where they will be granted access to the virtual data room for buy-side due diligence.\n\nIn addition to these developments, the board also approved the audited financial statements of the Privatisation Commission for 2022-23 and 2023-24, as well as budget estimates for 2025-26 to support the commission’s operations and ongoing transactions.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/20095411f2aad29.jpg",
  "retrievedAt": "2025-10-12T03:40:30.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918277/process-begins-to-name-advisers-for-four-power-companies-two-plants",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:32.000Z"
}
