{
  "title": "Why Iran matters - World - DAWN.COM",
  "author": null,
  "content": "IRAN is one of the world’s oldest civilisations, one of the few that was never formally subject to European colonial rule.\n\nToday as bloodthirsty Zionist warplanes hover over its skies, and beg the US empire to add its bombs to those already being wantonly dropped on the country, it is no exaggeration to suggest that the outcome of this latest act of Zionist aggression will affect us all.\n\nThere is no secret to what the Empire and its Israeli outpost want — to eliminate the one challenger to their power in the Muslim world. By platforming Reza Pahlavi, scion of the imperialist puppet Shah who was toppled in the 1979 revolution, the Western mainstream is no longer even masking its regime change intentions.\n\nWhat would regime change in Iran look like? Very much like the disastrous imperialist interventions in Afghanistan, Iraq, Syria, Libya and ongoing ones in Yemen and Lebanon.\n\nIf today the argument is that the repressive, theocratic regime that rules Iran must be removed, yesterday the same was said about the Afghan Taliban, Saddam Hussein, the Assad dynasty and Muammar Qadhafi. One need not be a historical revisionist and whitewash the excesses of those regimes to see that imperialist interventions in those countries led only to unprecedented bloodshed, hate and endless war.\n\nIran is much bigger than all of the above-mentioned countries that have been ravaged by imperialism. It exercises huge influence over Shia militant organisations, including Hezbollah, whilst explicitly supporting Hamas and the Palestinian cause more generally. It controls major waterways like the Strait of Hormuz, through which at least 20 per cent of global oil supply travels on a daily basis.\n\nWhat would regime change in Iran look like?\n\nLet there be no confusion: no matter the complicity of Arab sheikhs, the attempt to subjugate Iran by Washington and Tel Aviv will further destabilise the region and world. US imperialist wars since World War II have always been fought in the name of a larger ‘Pax Americana’, which, in fact, has been catastrophic for large parts of the Muslim world, East Asia, Latin America and Africa.\n\nWhich brings me to Pakistan. The ‘unexpected’ meeting between the army chief and Donald Trump in Washington suggests that Pakistan’s militarised ruling class may be in line to make the country a ‘front-line state’ in another US war, presumably in exchange for crypto and mineral exploration contracts. The dictatorships of Ziaul Haq and Pervez Musharraf immensely damaged Pakistani society by aligning with Washington to prosecute wars in Afghanistan. The widespread influence of the militant right-wing, and the ‘Kalashnikov culture’ are enduring legacies.\n\nIn case we’ve forgotten, this disastrous legacy continues to play out in Kurram, the only Shia-majority district in KP, where the state remains unwilling to secure roads that have been closed for the best part of a year. What the mainstream lazily calls ‘sectarian’ violence would only spike further if the Pakistani state puts in its lot with the war on Iran.\n\nIn the short term, we in Pakistan are already seeing huge fallouts of Zionist aggression.\n\nIran shares an almost 900 kilometre-long border with Pakistan, which has been closed since Israeli raids started. Cross-border trade is arguably the biggest livelihood source for a vast majority of ordinary people across Balochistan, especially its western parts. Even by conservative estimates, goods worth $3 billion move across this border annually.\n\nMost of Balochistan uses Iranian diesel and petrol. A range of other products also come in from across the border. While economic ‘experts’ and bureaucrats lam­ent the supposed loss to the exchequer from this ‘black’ economy, they conveniently neglect the fact that Balo­chistan has been pillaged for its rich mineral resources by the nexus of state and capital while the local population, select middlemen exclu­ded, has gotten only deprivation and subjugation.\n\nThe daily lifeline of trade having been suspended, and with mass repression at its peak, more young Baloch are likely to join an already raging insurgency. Of course, the regime in Iran has also brutalised ethnic Baloch on that side of the border, along with women, non-Shia minorities and political dissidents more generally. Like the Kurds, the Baloch continue to be subjugated by states whilst treated as pawns in geopolitical games, pushed to the wall and then criminalised to no end.\n\nYet whatever their similarities, Iran and Pakistan are different because the former is standing up to the Empire while the latter seeks deals with it. The truth is that most Muslim rulers have already abandoned the people of Iran, forget its regime. These rulers sell tales about the wisdom of realpolitik, but from the perspective of the most oppressed people in our region and world, we need another politics entirely.\n\nThe writer teaches at Quaid-i-Azam University, Islamabad.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6854d2abe9f9a.jpg",
  "retrievedAt": "2025-08-20T04:20:49.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918334/why-iran-matters",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T03:17:58.000Z"
}
