{
  "title": "Israeli forces mow down another 72 Palestinians - World - DAWN.COM",
  "author": null,
  "content": "• 21 of them killed trying to reach aid distribution points\n• Military resorts to gunfire, tank shelling and bombs\n\nGAZA CITY: Gaza’s civil defence agency said Israeli forces killed at least 72 people on Thursday, including 21 who had gathered near aid distribution sites as famine looms after more than 20 months of war.\n\nCivil defence spokesman Mahmud Bassal told AFP that six people were killed while waiting for aid in the southern Gaza Strip and 15 others in a central area known as the Netzarim corridor, where thousands of Palestinians have gathered daily in the hope of receiving food rations.\n\nThe Israeli army told AFP that its troops in Netzarim corridor — a strip of land militarised by Israel that bisects the Palestinian territory — had fired “warning shots” at “suspects” approaching them, but that it was “not aware of any injured individuals”.\n\nThe army did not comment on the incident reported in the south.\n\nIn northern Gaza, Bassal said that nine separate Israeli strikes killed another 51 people, updating earlier tolls provided by his agency.\n\nBassam Abu Shaar, who witnessed the shooting incident in the Netzarim area, said thousands of people had gathered there overnight in the hope of receiving aid at the US- and Israeli-backed distribution site when it opened in the morning.\n\n“Around 1:00am (2200 GMT Wednesday), they started shooting at us,” he told AFP by phone, reporting gunfire, tank shelling and bombs dropped by drones.\n\nAbu Shaar said that the size of the crowd had made it impossible for people to escape, with casualties left lying on the ground within walking distance of the distribution point, which is run by the Gaza Humanitarian Foundation.\n\n“We couldn’t help them or even escape ourselves,” he said.\n\nAt least 300 Palestinians have been killed in recent weeks while trying to reach aid distribution points in Gaza, which is suffering from famine-like conditions, the territory’s health ministry has said.\n\nIsraeli restrictions on media in the Gaza Strip and difficulties in accessing some areas mean AFP is unable to independently verify the tolls and details provided by rescuers and authorities in the Palestinian territory.\n\nIn early March, Israel imposed an aid blockade on Gaza amid a deadlock in truce negotiations, only partially easing restrictions in late May.\n\nAfter Israel loosened its blockade, the privately run Gaza Humanitarian Foundation (GHF) began distributing aid, but its operations have been marred by chaotic scenes.\n\nUN agencies and major aid groups have refused to cooperate with the foundation — which has the support of Israel and its ally the United States — over concerns it was designed to cater to Israeli military objectives.\n\nOn Wednesday, the head of a UN inquiry said that the use of GHF to distribute food in the Palestinian territory is “outrageous”. “In every war, the siege and starvation surely leads to death,” Navi Pillay, who chairs the UN’s Independent International Commission of Inquiry on Israel and the Palestinian territories, told journalists.\n\n“But this initiative of what’s called a foundation, a private foundation, to supply food, is what I see as outrageous, because it involves the United States itself, the government, and it turns out, as we watch daily, that people who go to those centres are being killed as they seek food.”\n\nPillay said the commission would “have to look into… the policy purpose and how it’s being effected.\n\n“We have to spell out what is the motive of, right now, the killing of people who are coming for humanitarian aid from this so-called foundation — and that lives are being lost just in trying to secure food for their children.”\n\nThe UN humanitarian office OCHA said that its humanitarian partners, including the World Food Programme (WFP), pointed out fuel in Gaza was reaching “critically low levels”.\n\n“Without immediate resupply, essential services — including the provision of clean water — will grind to a halt very soon,” it added.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6854c9879e421.jpg",
  "retrievedAt": "2025-08-20T04:20:50.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918319/israeli-forces-mow-down-another-72-palestinians",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T02:37:17.000Z"
}
