{
  "title": "Prosecutor appointed to challenge May 9 convicts’ appeal - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The federal government has informed the Islamabad High Court (IHC) of its decision to appoint a special prosecutor to challenge the appeals of convicts in May 9 attack and siege of the Ramna Police Station case.\n\nDuring the hearing on Thursday, a division bench comprising Justice Khadim Hussain Soomro and Justice Muhammad Azam Khan was told by the State Counsel that the Advocate General’s Office had finalized the decision to bring in a special prosecutor to in this case.\n\nAppearing on behalf of the convicts, Advocate Babar Awan pressed the court to immediately suspend the sentences, stating, “My only request is the suspension of the sentence.”\n\nHowever, the court opted to grant time to the government for the appointment, with Justice Soomro directing that the special prosecutor be named without further delay.\n\nThe case was subsequently adjourned until June 25, allowing the government time to complete the formal appointment and ensure effective prosecution in the appeals.\n\nArrest warrants of KP CM suspended\n\nThe non-bailable arrest warrants against Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur were suspended on Thursday after he appeared before the Islamabad’s District and Sessions Courts in two separate cases: one related to alleged recovery of illegal arms and liquor, and the other involving an audio leak.\n\nIn the illegal arms and liquor case registered at Bhara Kahu police station, Gandapur appeared before Judicial Magistrate Mubashir Hassan Chishti along with his counsel, Raja Zahoorul Hassan. The defence informed the court that the Peshawar High Court had already granted Gandapur interim bail until July 3, and requested the suspension of the non-bailable arrest warrant issued earlier.\n\nThe court directed that Gandapur must submit his response under Section 342 of the Criminal Procedure Code. The Chief Minister informed the court that he would file the response after the presentation of the Khyber Pakhtunkhwa budget. Following this assurance and his appearance, the court suspended the arrest warrants and adjourned the case until July 2.\n\nLater, in a separate hearing of the audio leak case before Additional District and Sessions Judge Nasruminallah Baloch, Gandapur again appeared with his legal team.\n\nHis counsel reiterated that the Peshawar High Court had granted bail in the matter as well.\n\nDuring the hearing, Gandapur addressed the court directly, asking, “Sir, am I allowed to speak? Is it a crime to ask for a licence? I should be given an award, not a case.”\n\nThe judge remarked that the matter would be decided on merit and emphasised the importance of the accused’s presence for formal indictment proceedings.\n\nThe court subsequently suspended Gandapur’s arrest warrant in the audio leak case and adjourned the hearing until July 19, instructing the accused to ensure his appearance for the indictment.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:20:52.352Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918235/prosecutor-appointed-to-challenge-may-9-convicts-appeal",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:47:00.000Z"
}
