{
  "title": "COAS Munir stresses potential for ‘broader, multidimensional’ ties with US built on mutual respect - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) Field Marshal Asim Munir has stressed the “immense potential for a broader, multidimensional relationship built upon mutual respect” with the United States, the military’s media wing said on Friday.\n\nCOAS Munir is on a five-day official visit to the US, where he met with President Donald Trump over luncheon, becoming the first serving army chief to have a face-to-face meeting with a sitting US president. National Security Advisor Lt Gen Muhammad Asim Malik — also the intelligence chief — has accompanied Field Marshal Munir.\n\nCOAS Munir held an interaction in Washington DC with prominent US think tanks and representatives of the strategic affairs institutions, the Inter-Services Public Relations (ISPR) said in a press release.\n\nSenior scholars, analysts, policy experts and representatives of leading international media outlets were also part of the “comprehensive and candid exchange”, ISPR added.\n\nThe army chief “underscored the immense potential for a broader, multidimensional relationship built upon mutual respect, shared strategic interests, and economic interdependence”, the statement said.\n\nEvaluating the Pakistan-US partnership, Field Marshal Munir underlined the “historical convergences between the two nations, particularly in areas such as counterterrorism, regional security and economic development”.\n\nIn his remarks, the army chief also highlighted Pakistan’s “unwavering commitment to regional peace and stability, and its constructive role in fostering a rules-based international order”.\n\nThe army chief also noted the “malign influence of certain regional actors in sponsoring and perpetuating terrorism as a tool of hybrid warfare”, the statement added.\n\nHe mentioned this as he alluded to the details and analysis of the Marka-i-Haq and Operation Bunyanum Marsoos during the recent conflict with India and “elaborated on Pakistan’s perspective on terrorism”.\n\nField Marshal Munir emphasised that Pakistan had been on the “front lines of the global war against terrorism, having rendered immense sacrifices — both human and economic — in pursuit of a safer and more secure world”.\n\nPrime Minister Shehbaz Sharif has repeatedly noted that Pakistan lost 90,000 valuable lives and incurred $150 billion worth of economic losses over the past few decades.\n\nDuring the session, COAS Munir also invited international partners to explore collaborative opportunities in various sectors to “unlock shared prosperity”.\n\nHe highlighted Pakistan’s “remarkable untapped potential, particularly in the domains of information technology, agriculture, and its vast and underexploited reserves in the mining and mineral sectors”, echoing topics discussed in his meeting with Trump and previous Pak-US interactions.\n\nThe army chief also provided a detailed exposition of Pakistan’s “balanced approach to regional and global conflicts, advocating for dialogue, diplomacy, and adherence to international law”, the ISPR stated.\n\nHe reaffirmed that Pakistan continues to play a “responsible and proactive role in mitigating regional tensions and promoting cooperative security frameworks”. The statement comes amid heightened tensions in the Middle East amid the Israel-Iran war as the US weighs whether to intervene militarily or not.\n\nParticipants, the ISPR said, noted the “openness and clarity of the COAS’s perspectives and appreciated Pakistan’s consistent and principled policies”. “The interaction was marked by a spirit of mutual understanding and was widely regarded as a positive step toward enhancing strategic dialogue between Pakistan and the United States,” it added.\n\nThe interaction also provided an opportunity to articulate Pakistan’s principled stance on key regional and global issues, and to deepen understanding of Pakistan’s strategic outlook, the military’s media wing noted. It reflected the country’s “commitment to transparent diplomacy, international engagement, and the pursuit of peaceful coexistence through principled and proactive dialogue”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/201157053fa6e18.png",
  "retrievedAt": "2025-08-20T04:20:45.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918382/coas-munir-stresses-potential-for-broader-multidimensional-ties-with-us-built-on-mutual-respect",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T08:14:27.000Z"
}
