{
  "title": "PM orders early finalisation of industrial policy - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Thursday directed the authorities concerned to finalise a national industrial policy at the earliest, aiming to increase production and provide sustainable solutions to challenges facing the sector.\n\nPresiding over a meeting on the promotion of the industrial sector, the premier stressed that the policy must be completed in consultation with all relevant stakeholders. “Uncertain industrial policies have hindered industrial growth,” PM Shehbaz said. “Through an effective policy, we will take industrial development to new heights.”\n\nDescribing the industrial sector as the backbone of the country’s exports, the prime minister said the development of industries is essential to achieving export-led economic growth.\n\n“It is our top priority to equip local industries with a skilled workforce and modern technology to international standards. Investment in the country will be promoted through tariff rationalisation,” he said.\n\nStresses need for stakeholder consultation in policy drafting\n\nThe move comes as inconsistent government policies hamper Pakistan’s industrial growth, often changed for political reasons or due to flawed information.\n\nDuring the meeting, officials told the prime minister that an effective industrial policy would revive the country’s manufacturing sector.\n\nMinister for Economic Affairs Ahad Khan Cheema, Special Assistant Haroon Akhtar, and other top officials attended the meeting.\n\nIntermittent energy crises and high costs have hindered industrial growth, Dawn reported in an article.\n\nInefficiency in government-run power companies and circular debt from impractical IPP agreements are the root causes, the article said.\n\nBusiness groups argue that energy prices in Pakistan far exceed those in similar countries.\n\nThey urged the government to tackle this structural issue and take action against influential power thieves and bill defaulters.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/20091024163f63e.jpg",
  "retrievedAt": "2025-08-20T04:20:58.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918275/pm-orders-early-finalisation-of-industrial-policy",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:32.000Z"
}
