{
  "title": "Three tourists die after glacial slide in Khyber Pakhtunkhwa’s Naran: Rescue 1122 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three tourists lost their lives on Friday after they were buried under a glacial slide in Khyber Pakhtunkhwa’s Mansehra district, according to officials.\n\nMansehra Rescue 1122 spokesperson Amir Khadam Khan told Dawn.com that the incident occurred near Sohni Waterfall in the Naran area.\n\n“[The] tourists, hailing from Lahore, were taking selfies near the glacier when it slid down, burying them underneath.”\n\nHe added that the bodies of the tourists were recovered from the glacier and moved to a nearby hospital, where they were identified as 35-year-old Mohammad Tahir, 22-year-old Mohammad Tayyab, and 13-year-old Abubakar.\n\nAdviser to Chief Minister KP on Tourism, Zahid Chanze,b extended his condolences to the bereaved families and said, “Arrangements were being made to dispatch the bodies to Lahore.”\n\nIn a statement, he urged tourists to avoid taking selfies near dangerous spots and glaciers, saying glaciers were rapidly melting due to the hot weather.\n\nHe also said that they would launch a campaign across the province for the tourists to adapt and abide by safety precautions while visiting the places.\n\nLast month, four tourists from Gujrat who went missing in Gilgit-Baltistan on May 16 were found dead at the bank of the Indus River near Istak village in Skardu’s Roundu valley.\n\nIn March, a UN report warned that rapidly melting glaciers and snow have imperilled the global ecosystem and billions of people who rely on freshwater from these sources.\n\nThe report said glaciers were at extreme risk due to global warming, pollution, and unsustainable human activities, and if not properly managed, they could become a source of perpetual conflicts.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/20182442fe633aa.jpg",
  "retrievedAt": "2025-08-20T04:20:43.455Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918447/three-tourists-die-after-glacial-slide-in-khyber-pakhtunkhwas-naran-rescue-1122",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T14:03:09.000Z"
}
