{
  "title": "Pakistan sees over 99pc decline in polio cases, says health minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Federal Minister for Health, Syed Mustafa Kamal, on Thursday claimed that Pakistan has witnessed over 99 per cent decline in polio cases.\n\nHe was addressing the joint session of the Gavi Board and the Polio Oversight Board (POB), where he represented the Government of Pakistan and shared key updates on national progress in the fight against polio, according to a statement issued by the ministry.\n\n“Polio eradication remains top priority of the Government of Pakistan, and we are fully committed to achieving a polio-free future for our children,” said the health minister.\n\nHe highlighted that the Prime Minister of Pakistan was personally overseeing the polio eradication efforts and chairs monthly stocktake meetings to review progress.\n\nSharing the latest progress, the minister claimed, “Pakistan have witnessed over a 99pc decline in polio cases—evidence of our coordinated strategy, dedication of frontline workers, and the collective efforts of all stakeholders.”\n\nHe emphasised the implementation of a joint strategy to reach zero-dose children, with mobile biker teams mobilised to access nomadic and hard-to-reach populations.\n\nUnderscoring the importance of global partnerships, he added, “Strengthening the integrated immunisation system requires continued support from both Gavi and the POB. We need additional investments to ensure the training and retention of vaccinators.”\n\nHe further noted that enhanced synergy between the polio and EPI (Expanded Programme on Immunisation) initiatives was improving immunisation coverage, while coordinated microplanning and effective monitoring were delivering tangible results in the field.\n\nIt is worth mentioning that this year so far, 11 cases have been reported as compared to 74 cases last year and only six cases in 2023.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:20:53.953Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918236/pakistan-sees-over-99pc-decline-in-polio-cases-says-health-minister",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:59.000Z"
}
