{
  "title": "Thai PM Shinawatra faces calls to quit after phone call leaked - World - DAWN.COM",
  "author": null,
  "content": "BANGKOK: Thai Prime Minister Paetongtarn Shinawatra apologised on Thursday for a leaked phone call with former Cambodian leader Hun Sen that provoked widespread anger and threatened to topple her government.\n\nHer main coalition partner quit and she faced calls to resign or hold an election, throwing the kingdom into a fresh round of political instability as it seeks to boost its spluttering economy and avoid US President Donald Trump’s swingeing trade tariffs.\n\nThe conservative Bhumjaithai party pulled out on Wednesday, saying Paetongtarn’s conduct in the leaked call had wounded the country and the army’s dignity.\n\nAs pressure grew on Thursday, Paetongtarn apologised at a news conference alongside military chiefs and senior figures from her Pheu Thai party. “I would like to apologise for the leaked audio of my conversation with a Cambodian leader which has caused public resentment,” Paetongtarn told reporters.\n\nIn the call, Paetongtarn can be heard discussing an ongoing border dispute with Cambodia’s Hun Sen, and even calling Thai military leader ‘her opponent’\n\nLeaders of the Chartthaipattana, United Thai Nation and Democrat parties held urgent talks on the crisis on Thursday afternoon. Afterwards, Chartthaipattana leader Varawut Silpa-archa told reporters his party would remain in government and meet Paetongtarn to decide what to do.\n\nIn the leaked call, Paetongtarn is heard discussing an ongoing border dispute with Hun Sen, who still holds significant power in Cambodia despite leaving office in 2023. She addresses the veteran leader as “uncle” and refers to the Thai army commander in the country’s northeast as her opponent, a remark that sparked fierce criticism on social media.\n\nThe Thai foreign ministry summoned the Cambodian ambassador on Thursday to deliver a letter complaining about the leaking of the call.\n\nThailand’s military said in a statement that army chief General Pana Claewplodtook “affirms commitment to democratic principles and national sovereignty protection”.\n\nThailand has suffered a dozen coups since the end of absolute monarchy in 1932.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/201015194ba28ed.jpg",
  "retrievedAt": "2025-08-20T04:20:51.152Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918315/thai-pm-shinawatra-faces-calls-to-quit-after-phone-call-leaked",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T02:29:44.000Z"
}
