{
  "title": "Suspect arrested as another case of child pornography comes to light in Punjab’s Muzaffargarh - Pakistan - DAWN.COM",
  "author": null,
  "content": "A suspect was arrested in yet another case of child pornography in Punjab’s Muzaffargarh, Police said on Friday.\n\nEarlier in the month, the government claimed to have dismantled an international child exploitation network operating out of a so-called gaming club in Muzaffargarh, where children aged six to 10 were lured, abused and filmed for the sake of selling their videos on the dark web.\n\n“Several children were sexually abused and filmed in Sardarabad village,” a police statement said today.\n\nThe matter came to light when one of the victims contacted the police. According to the statement, the suspect had been blackmailing the children using compromised videos.\n\nA first information report (FIR) of the incident was lodged at Saddar police station in Muzaffargarh district under section 292 (sale, distribution, and public exhibition of obscene material) and section 355 (assault or criminal force with intent to dishonour a person) of the Pakistan Penal Code.\n\nAccording to the FIR, a boy was sexually abused and filmed by his older brother’s former employer when he went to collect his brother’s pending wages. The older brother had previously worked for the suspect as an animal caretaker.\n\nThe statement added that the Sadar police station has arrested the suspect, while the victims were being contacted for legal action.\n\nIn Pakistan, the punishment for sexually abusing a minor can range from seven years to life imprisonment, while rape of a child carries the death penalty or life term. Laws such as the Criminal Law (Amendment) Act, 2016 and the Zainab Alert, Response and Recovery Act, 2020 were enacted to address rising cases of abuse, strengthen penalties, and ensure timely action. Offences related to child pornography are punishable by up to 14 years in prison, along with hefty fines.\n\nDespite existing laws, cases of child sexual abuse continue to surface across the country.\n\nAs many as 3,364 child abuse cases were reported from all four provinces, Islamabad Capital Territory (ICT), Azad Jammu and Kashmir (AJK), and Gilgit-Baltistan (GB) in the year 2024, according to the civil society report ’Cruel Numbers 2024’ by Sahil that was prepared based on data collected from 81 national and regional newspapers across the country.\n\nThese included reported cases of child sexual abuse, abduction, missing children, and child marriages. It shows that nine children were abused per day during the year. A gender-divide analysis indicates that out of the total reported cases, 1,791 (53 per cent) victims were girls and 1,573 (47pc) boys.\n\nIn April, Punjab police arrested five suspects for their alleged involvement in the gang rape of a child in Muzaffargarh, according to an official statement.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:20:45.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918395/suspect-arrested-as-another-case-of-child-pornography-comes-to-light-in-punjabs-muzaffargarh",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T08:53:04.000Z"
}
