{
  "title": "PM Shehbaz pushes health reforms with digitisation, WHO accreditation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Sheh­baz Sharif on Thursday called on all local pharmaceutical companies to seek World Health Organisa­tion (WHO) accreditation and ordered the use of advanced technology to eliminate the illegal trade of medicines.\n\nChairing a high-level meeting on nat­ional health affairs, the prime minister praised the Ministry of National Hea­lth Services for its proactive approa­­ch under Federal Min­ister Syed Mustafa Kamal.\n\n“Providing the best possible healthcare facilities to the pe­­ople remains the governme­n­t’s top priority,” PM Shehbaz said, according to a statement from the Prime Minister’s Office.\n\nThe directives are part of a zero-tolerance policy on hea­l­­th sector violations, with the prime minister calling for stri­ngent oversight mechanisms.\n\nUrges global solidarity and peaceful solutions for refugees on World Refugee Day\n\nPM Shehbaz directed the creation of a collaborative roadmap with welfare organisations and the private sector to improve health services in Islamabad.\n\n“In order to meet internati­onal standards, Pakistani pha­­rmaceutical companies are se­­eking accreditation from the WHO. It would not only enh­ance the quality of local medicines but also open doors to export opportunities,” he said.\n\nThe prime minister stressed that there could be “no compromise on the quality of medical education” and ordered third-party validation of all medical colleges in Pakistan.\n\nHe also called for a comprehensive review of the nursing sector to strengthen its capacity and service delivery.\n\n“No political interference would be tolerated in the implementation of health reforms,” PM Shehbaz said, promising a merit-based and transparent approach.\n\nOfficials briefed the premier that the entire process for registering medicines and medical devices is being digitised and will be completed by the end of next month, reducing the registration timeline from one year to just three months.\n\nEfforts to operationalise new Health Units, Blood Centres, and the IHITC in Islamabad are underway with philanthropist support.\n\nWorld Refugee Day\n\nSeparately, in his message on World Refugee Day, PM Shehbaz said conflicts are the primary driver of forced displacement and called for peaceful resolution through diplomacy.\n\n“Conflict, being the primary driver of forcibly displaced and refugee situations, must be stopped, prevented and resolved with dialogue and diplomacy paving the way for international peace and security,” the prime minister said.\n\nHe highlighted Pakistan’s role in hosting millions of Afghan refugees for over four decades, despite limited international support.\n\n“By opening our home and hearts, the people of Pakistan have demonstrated exemplary hospitality towards their Afghan sisters and brothers,” he said, adding that Pakistan provided them access to education and healthcare.\n\n“On the World Refugees Day let us recommit ourselves to the core values of humanity, compassion and international cooperation,” PM Shehbaz said. “The return of the refugees to their beloved homeland was the best and most durable solution that we must collectively strive to achieve.”\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:40:27.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918304/pm-shehbaz-pushes-health-reforms-with-digitisation-who-accreditation",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:27.000Z"
}
