{
  "title": "Hunt for HEC chief begins as higher education sector navigates choppy waters - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif has formed a search committee to appoint a new Chairman of the Higher Education Commission (HEC), as the tenure of the incumbent, Dr Mukhtar Ahmed, is set to expire on July 30.\n\nThe eight-member search committee is headed by Federal Education Minister Dr Khalid Maqbool Siddiqui and comprises Minister of State Wajiha Qamar, Special Investment Facilitation Council Apex Committee Secretary Jahanzeb Khan, Aga Khan University, Karachi, Provost Dr Anjum Halai, former University of Balochistan dean Dr Muhammad Nasir Qureshi and the secretary of the Ministry of Federal Education.\n\n“The search committee has been notified and will start its work soon, as it has to complete the task within a few weeks. The incumbent chairman is set to complete his tenure on July 30. So, now it is a race against time,” said an official of the education ministry.\n\nDr Mukhtar, who previously served as a member and executive director of the HEC, was appointed in 2014 for a four-year term as chairman. His first tenure ended in 2018.\n\nPM constitutes search committee; incumbent HEC chairman’s tenures set to end on July 30\n\nThen, in 2022, he was appointed chairman for a second time, this time for a two-year term, which lapsed in July last year. However, the federal government reappointed him for one more year, until July 30, 2025.\n\nNow, the government has decided to appoint a new chairman.\n\nPlanning Minister Ahsan Iqbal, in a strongly worded letter addressed to Prime Minister Shehbaz Sharif last year, had raised concerns about the performance of the country’s higher education institutions.\n\nHe urged the prime minister to replace the leadership of the HEC with a new team possessing experience and a bold vision to tackle prevailing challenges.\n\nDespite this, the prime minister expressed confidence in Dr Mukhtar and reappointed him for another year.\n\nIn the letter, the planning minister highlighted that nearly two-thirds of Pakistan’s population was below the age of 30 and must play a pivotal role in shaping the nation’s future.\n\n“This significant youth bulge presents both an opportunity and a risk. On one hand, it offers the potential for a robust workforce that can drive development, provided these young individuals are equipped with quality education, good health, and essential skills,” he said in the letter.\n\nMr Iqbal further stated that if these young entrants into the labour force do not receive quality education and remain poorly skilled, they will struggle to find decent employment, leading to adverse socioeconomic consequences.\n\nThe planning minister, in his letter, regretted that the HEC had failed to achieve its targets.\n\nMeanwhile, the higher education sector in the country continues to struggle due to a shortage of funds.\n\nFor the fiscal year 2025-26, the government imposed cuts on the development budget and approved only a meagre increase in the recurring budget for universities. As a result, university faculty members have been protesting, demanding an increase in the HEC budget.\n\nRecently, Chairman of the Senate Standing Committee on Foreign Affairs and Parliamentary Leader in the Senate, Senator Irfan Siddiqui, in a written proposal submitted to the Senate Standing Committee on Finance, demanded a substantial increase in the HEC budget.\n\nHe pointed out that the proposed recurring budget for FY 2024-25 was approximately Rs66 billion—the same level allocated six years ago in FY 2017-18. While Rs70 billion was allocated in FY 2023-24 and Rs66 billion in the previous FY, the proposed development budget stands at just Rs39 billion, marking a decrease of around 40 per cent.\n\n“In the current budget proposals, there is only a nominal increase proposed for HEC’s recurring expenditure. The allocated amount remains almost unchanged from what it was five years ago, in 2021. This stagnation fails to account for inflationary adjustments or the growing number of public sector higher education institutions falling under the HEC’s ambit,” he stated in his letter.\n\n“Particularly concerning is the sharp decrease in the development grant. For the fiscal year 2024-25, an allocation of Rs66.315 billion was approved. However, the proposed allocation for the upcoming budget has been drastically reduced to Rs39.488 billion—reflecting a substantial cut of Rs26.82 billion,” read Senator Siddiqui’s letter.\n\nIn his written proposal, he also highlighted that regional countries, including India, Maldives and Bhutan, were investing significantly more in higher education relative to their size and economy than Pakistan.\n\nHe urged the finance committee to amend the budget proposals to allocate at least Rs80 billion for HEC’s recurring expenses and Rs80 billion for the development budget.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:20:54.555Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918238/hunt-for-hec-chief-begins-as-higher-education-sector-navigates-choppy-waters",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:59.000Z"
}
