{
  "title": "Govt flags risks to budgetary targets - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government has flagged a series of critical risks to next year’s budget and medium-term outlook, including slower than targeted GDP gro­wth, inflation shocks, exchange rate volatility, lower revenue buoyancy, debt servicing costs, poor performance of state-owned entities (SOEs) and unexpected climatic and other natural disasters.\n\nIn a written statement on fiscal risks placed before parliament, Finance Minister Muhammad Aurangzeb and Finance Secretary Imdadullah Bosal divided these risks into seven categories — macroeconomic, revenue, debt, SOEs, climate change, natural disasters, and other contingent liabilities — and quantified their possible impact on fiscal deficit.\n\nThey suggested mitigation measures in case one or more of these risks materialise during 2025-26.\n\nAccording to the statement, the macroeconomic risks arise from slower-than-expected GDP growth, inflation shocks, and exchange rate volatility. “A one percentage point slowdown in GDP growth could reduce government revenues due to lower tax collection and increase exp­enditures on automatic stabilisers such as social safety net programmes,” it said.\n\nInflation, debt servicing, inefficient SOEs and climate disasters seen as major hurdles\n\nThe combined effect of slower than targeted economic growth, inflation sho­cks and exchange rate variation could widen the fiscal deficit by roughly 0.13pc of GDP in FY26. This is important given that the Federal Board of Revenue (FBR) has been given a collection target of Rs14.13 trillion for next year and in view of a record Rs1.161tr shortfall during the current fiscal year on a budget target of Rs12.97tr.\n\n“Inflation spikes and currency depreciation may further strain public finan­ces, though these effects are more challenging to quantify precisely,” it said.\n\nRevenue collection faces hurdles\n\nTalking about revenue risks, the statement said the revenue collection remained vulnerable to lower tax buoyancy, slower economic growth, and underperformance in key sources.\n\n“Should tax revenues grow at only half the anticipated rate, the fiscal deficit could increase by 0.4pc of GDP.”\n\nAdditional revenue risks include a potential 30pc decline in State Bank profits transferred to the government, which alone could widen the deficit by 0.32pc of GDP, and a 20pc shortfall in petroleum levy collections, increasing the deficit by about 0.2pc.\n\nThe government has set a Rs2.4tr target from SBP profits for the next fiscal, slightly lower than Rs2.62tr for this year on the back of historically high interest rates. Petroleum levy is projected at Rs1.47tr for the next fiscal, up from Rs1.28tr budget target for current year, missed by Rs121bn to Rs1.16tr.\n\n“These factors indicate the government’s reliance on volatile revenue streams and the importance of improving tax administration and compliance,” the statement said.\n\nIt also pointed out that debt servicing costs represented a significant fiscal vulnerability. A two-percentage point increase in domestic interest rates and a one percentage point rise in external interest rates could lead to higher interest payments, raising the fiscal deficit by an estimated 0.42pc of GDP.\n\nLoss-making SOEs\n\nAccording to the statement, SOEs posed fiscal risks through potential shortfalls in dividend payments and increased government support. A decline in SOE dividends by 6.1pc relative to projections could add around 0.02pc of GDP to the deficit.\n\nIncreased government financial support to SOEs, amounting to 1.5pc of GDP, could exacerbate the fiscal gap by a margin of 0.4pc.\n\nIn contrast, the more severe scenario anticipates lower short-term fiscal impact, but greater long-term costs due to increased frequency and severity of climate-related disasters.\n\nThese projections highlight the growing fiscal burden of climate adaptation and mitigation policies.\n\nLikewise, natural disasters represent the largest fiscal risk identified in the statement. “Without dedicated disaster risk financing mechanisms, an average disaster event could increase the fiscal deficit by as much as 1.03pc of GDP,” it said.\n\nHowever, with effective disaster risk financing tools such as catastrophe bonds or insurance funds, this impact could be reduced to about 0.44pc per cent of GDP.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:20:57.557Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918272/govt-flags-risks-to-budgetary-targets",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:32.000Z"
}
