{
  "title": "Govt spending on education ‘hits new low’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government spending on education in Pakistan has fallen to a new low in the past year despite being declared a national emergency with 26 million children — or more than one in three — out of school, one of the highest percentages globally, Save the Children said in a statement on Thursday.\n\nSince the start of the current fiscal year in July 2024 to March 2025, education expenditure fell by 29 per cent. The percentage of GDP spent on education has fallen consisten­tly since 2018 when it was 2pc to 0.8pc, according to the latest Pakistan Economic Survey.\n\nThe UN-backed Incheon Declaration recommends that governments allocate 4pc to 6pc of their GDP to education.\n\nThe INGO says Pakistan needs urgent investment to get 26m children into school. In 2024, the government said it aimed to increase the education budget to 4pc of GDP by 2029. The government cannot break that promise to Pakistan’s children.“\n\nSave the Children says more than one in three kids out of school\n\n“Children in the poorest areas of Pakistan will be hit the hardest, and these are children who already face enormous hurdles to stay in schools. With these cuts, those hurdles have got even higher, the NGO said.\n\nChildren in Pakistan urgently need more funding from international donors to be able to rebuild their communities in a way that withstand future climate shocks. Save the Children is calling on all stakeholders, governments, donors, and civil society organisations to urgently invest in education in Pakistan, especially for marginalised and climate-impacted children.\n\nEducation in Pakistan is free and compulsory for all children aged five to 16 but a total of 38pc of school age children are out of school, with more girls than boys not attending classes. In Balochistan, 75pc of girls are missing out on education.\n\nThe organisation said that PM Shehbaz Sharif had declared an education emergency in May last year to increase school attendance, with only 60pc of people in the country able to read or write.\n\nAs well as missing vital education, being out of school increases the risk of children being forced into work and early marriage. Nearly one in 10 children aged 10 to 14 are working in Pakistan, according to government data from 2021, and an estimated 19m girls are married before their eighteenth birthday — the sixth highest number of child brides globally.\n\nSchools in Pakistan have been affected repeatedly by closures, many driven by climate fueled emergencies such as heatwaves in 2024, which shuttered classrooms for about half of all school age children, and catastrophic flooding in 2022, which disrupted learning for about 2.9m children.\n\nCountry Director for Save the Children Pakistan, Khuram Gondal, said: “When a government spends less than one per cent of the GDP on education, it’s not just cutting spending, it is contradicting the prime minister’s commitment to tackling the education emergency in Pakistan and get children into school.\n\n“Education is one of the most powerful tools to break generational poverty — investing in children is investing in Pakistan’s future,” he said.\n\nPublished in Dawn, June 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:21:05.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1918310/govt-spending-on-education-hits-new-low",
  "dateList": "2025-06-20",
  "date_published": "2025-06-20T01:46:27.000Z"
}
