{
  "title": "Ahsan Iqbal, Jiang Ziadong honor CPEC team for achievements",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-jiang-ziadong-honor-cpec-team-for-achievements/",
  "date_published": "2024-12-13T16:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal, along with Chinese Ambassador Jiang Ziadong on Friday awarded the staff working on the China-Pakistan Economic Corridor (CPEC) here at the Chinese Embassy for their outstanding performance and contributions to the success of the initiative.\nSpeaking at the ceremony, the minister emphasized the significance of recognizing the exceptional contributions of employees working on CPEC projects, said a news release.\nThe event reflected the hard work, commitment, and collaborative spirit that have defined the bilateral cooperation between Pakistan and China, he added.\nAhsan highlighted that CPEC stands as a symbol of the deep and enduring friendship between the two nations, fostering economic collaboration, people-to-people ties, and strategic partnerships over the past decade.\nThe minister commended the employees for their tireless efforts, which have been instrumental in the success of CPEC. He acknowledged their contributions across various domains, including infrastructure development, energy projects, logistics, and technology, which have collectively shaped Pakistan’s future. Their work has significantly boosted the economy, created jobs, and improved the quality of life for millions of people.\nAhsan Iqbal praised the professionalism, expertise, and dedication of both Pakistani and Chinese workers, engineers, technicians, and project managers, who have played a pivotal role in completing numerous key projects and laying the foundation for future endeavors.\nHe stressed that CPEC is not merely about infrastructure but also about fostering sustainable growth and shared prosperity for both countries.\nHighlighting the achievements of CPEC, he shared that the first phase has successfully concluded with the completion of 43 projects worth approximately USD 25 billion. These projects have added 8,800 MW of electricity to Pakistan’s national grid through 17 completed power projects, two coal mines, and a +660 kV HVDC transmission line.\nIn the transport sector, eight projects costing USD 6.7 billion have been completed, resulting in the construction of 888 km of motorways and highways, with an additional 853 km currently under construction.\nHe noted that the Karakoram Highway (Havelian-Thakot) project has received international acclaim by winning the ENR award. CPEC has generated around 200,000 direct jobs, with the potential for manifold indirect employment. He announced that the second phase of CPEC will focus on business-to-business cooperation in areas such as manufacturing, agriculture, mines and minerals, Gwadar Port, and the free zone.\nThis phase will be more employment-intensive and aims to bring greater economic benefits to both nations. The minister revealed plans to upgrade CPEC in its second phase, with the inclusion of new corridors focused on growth, innovation, sustainability, livelihood, and regional connectivity. To implement this vision, a seminar will be held in Beijing from 17th to 30th December to define the scope and implementation strategy for the upgraded CPEC.\nAhsan Iqbal extended heartfelt congratulations to the employees recognized during the event, commending their dedication to excellence and their integral role in strengthening the bonds between Pakistan and China.\nHe also expressed gratitude to the Chinese government, the Chinese Embassy, and other partners for their unwavering support in realizing the vision of CPEC.\nIn his concluding remarks, the Minister acknowledged the immense contributions of Chinese workers who worked tirelessly day and night, often far from home, to ensure the success of CPEC.\nHe reiterated that their safety and security are as vital as Pakistan’s own, reaffirming the enduring friendship between the two nations, which he described as stronger than mountains.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:45:27.541Z"
}
