{
  "title": "Amnesty calls for probing Israeli attacks on Lebanon’s health sector as war crimes - World - DAWN.COM",
  "author": null,
  "content": "• Urges Lebanese govt to provide ICC with jurisdiction to prosecute crimes\n• South Africa accuses Israel of using ‘starvation’ in Gaza as weapon of war\n\nBEIRUT: Amnesty International said on Wednesday that Israel’s attacks on ambulances, paramedics and health facilities during its recent war with Hezbollah should be investigated as war crimes.\n\nA Nov 27 truce agreement largely halted more than a year of hostilities between Hezbollah and Israel, including two months of full-blown war in which Israel sent in ground troops.\n\nDuring the conflict, the Israeli military accused Hezbollah of using ambulances belonging to the Islamic Health Committee for transporting fighters and weapons, accusations the group denied.\n\nAccording to Amnesty, “the Israeli military’s repeated unlawful attacks during the war in Lebanon on health facilities, ambulances and health workers, which are protected under international law, must be investigated as war crimes.”\n\nIt urged the Lebanese government to provide the International Criminal Court with “jurisdiction to investigate and prosecute crimes within the Rome Statute committed on Lebanese territory, and ensure victims’ right to remedy”.\n\nThe Israeli military did not immediately respond to an AFP request for comment on Amnesty’s report.\n\nIn December, Lebanon’s then health minister Firass Abiad said that during the hostilities, there were “67 attacks on hospitals, including 40 hospitals that were directly targeted”, killing 16 people. “There were 238 attacks on emergency response organisations, with 206 dead,” he said, adding that 256 emergency vehicles, including fire trucks and ambulances were also “targeted”.\n\nAmnesty said it investigated four Israeli attacks on health facilities and vehicles in Beirut and south Lebanon from October 3 to 9 last year that killed 19 healthcare workers, wounded 11 and “damaged or destroyed multiple ambulances and two medical facilities”.\n\n“Amnesty International did not find evidence that the facilities or vehicles were being used for military purposes at the time of the attacks,” the statement said.\n\nThe rights group said it wrote to the Israeli military in November with its findings but had not received a response by the time of publication.\n\n“The Israeli military has not provided sufficient justifications, or specific evidence of military targets being present at the strike locations” to account for the “repeated attacks, which weakened a fragile healthcare system and put lives at risk”, Amnesty said.\n\nAccording to Lebanese authorities, more than 4,000 people were killed in the hostilities. Swathes of the south and east and parts of Beirut’s southern suburbs were heavily damaged in the Israeli bombardment, with reconstruction costs expected to top $10 billion, Lebanese authorities have said.\n\nStarvation as weapon of war\n\nSouth Africa on Wednesday denounced Israel’s restriction of aid into war-ravaged Gaza since the weekend, saying it amounted to using starvation as a weapon of war.\n\nA fragile ceasefire since January saw an influx of humanitarian aid into Gaza, before Israel on Sunday announced it was blocking deliveries until Hamas accepted its terms for an extension of the truce.\n\n“Preventing food from entering Gaza is a continuation of Israel’s use of starvation as a weapon of war as part of the ongoing campaign of what the ICJ ruled to be plausible genocide against the Palestinian people,” the South African foreign ministry said in a statement, referring to Pretoria’s case against Israel at the International Court of Justice.\n\n“The people of Gaza are experiencing immeasurable suffering and urgently need food, shelter and medical supplies,” it added.\n\n“South Africa calls on the international community to hold Israel accountable,” it said.\n\nWhile Israel has said it wants to extend the first phase of the ceasefire until mid-April, Hamas has insisted on a transition to the deal’s second phase, which should lead to a permanent end to the war.\n\nSouth Africa had in December 2023 brought a case before the ICJ, arguing that the war in Gaza breached the 1948 United Nations Genocide Convention, an accusation Israel has strongly denied.\n\nSeveral nations have added their weight to the proceedings, including Spain, Bolivia, Colombia, Mexico, Turkiye, Chile and Libya.\n\nSouth Africa also said it condemned Israel’s offensive in the occupied West Bank which has expanded to more areas of Jenin city.\n\nThe offensive was “a dangerous escalation, and which further threatens the Palestinian quest for self-determination and statehood,” South Africa said.\n\n“The expanded Israeli military presence, now at its highest levels in the West Bank since 2002, signals an intent to re-establish full-scale military occupation,” it said.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c8cd7641d6a.jpg",
  "retrievedAt": "2025-08-25T14:59:15.803Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896050/amnesty-calls-for-probing-israeli-attacks-on-lebanons-health-sector-as-war-crimes",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T07:40:21.000Z"
}
