{
  "title": "Iran appoints new envoy to UN nuclear watchdog - World - DAWN.COM",
  "author": null,
  "content": "Iran has appointed Reza Najafi as its new ambassador and permanent representative to several Vienna-based international organisations, including the UN nuclear watchdog, local media reported.\n\nHe will be replacing Mohsen Naziri-Asl who served in the role since 2022, ISNA news agency said on Wednesday.\n\nNajafi, a former deputy foreign minister, previously held the post from 2013 to 2018 — a period marked by Iran’s signing of a landmark nuclear deal with the United States and world powers.\n\nThe deal — known as the Joint Comprehensive Plan of Action (JCPOA) —imposed curbs on Iran’s nuclear programme in return for sanctions relief.\n\nIt fell apart after the US withdrew from the agreement in 2018 during President Donald Trump’s first term. Tehran adhered to the deal until a year after Washington pulled out, but then began rolling back its commitments.\n\nTrump, who returned to the White House in January, reinstated his “maximum pressure” policy of sanctions against Iran over allegations the country is seeking nuclear weapons capability.\n\nTehran has consistently denied the claims and repeatedly expressed a willingness to revive the accord but efforts to that end have faltered.\n\nLast month, UN atomic agency chief Rafael Grossi said Iran was “enriching (uranium) at 60 per cent, so almost weapon level” and that the 2015 deal was an “empty shell” that was “no longer fit for purpose”.\n\nTrump has also recently called for striking a new deal with Iran, but Iranian supreme leader Ayatollah Ali Khamenei has said “no problem will be solved by negotiating with America”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:59:15.750Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896158/iran-appoints-new-envoy-to-un-nuclear-watchdog",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T08:12:02.000Z"
}
