{
  "title": "Army chief vows to bring planners, facilitators of Bannu Cantt attack to justice soon - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) General Asim Munir on Thursday vowed to bring the planners and facilitators of the recent terrorist attack on Bannu Cantonment to justice “wherever they may be”, the military’s media wing said.\n\nA statement issued from the Inter-Services Public Relations (ISPR) said the army chief visited Khyber Pakhtunkhwa’s Bannu district today in the wake of Tuesday’s attack.\n\nTwo explosive-laden vehicles were rammed into the cantonment’s perimeter by a group of terrorists who wanted to breach it. As a result of the blasts, several houses and a mosque adjacent to the boundary wall were damaged.\n\nThe death toll in the attack increased to 18 on Wednesday as Pakistan claimed that 16 terrorists who attacked the high-security zone were getting instructions from their handlers in Afghanistan. The ISPR had said the security forces engaged the terrorists with precision, eliminating all 16 terrorists, including four suicide bombers. The military media wing added that during the intense exchange of fire, five soldiers, after putting up heroic resistance, embraced martyrdom in the line of duty.\n\nThe ISPR said COAS Munir, during his visit today, expressed “profound condolences to the families of innocent civilians who lost their lives in this heinous and cowardly terrorist incident”.\n\nHe also assured that while the incident’s perpetrators were neutralised instantly, the “planners and facilitators of the dastardly attack would also be brought to justice soon, wherever they may be”.\n\nThe army chief underscored that the “barbaric targeting” of civilians, including children, women and the elderly, “exposed the true intentions” of terrorists as enemies of Islam.\n\n“Emphasising the pivotal role of the local community, he reiterated that national unity is imperative in the fight against terrorism and assured that the armed forces would spare no effort in ensuring the safety and security of the people of Pakistan.”\n\nThe COAS was briefed on ongoing operations during his visit and the overall security situation of the area. He also visited Combined Military Hospital Bannu to check up on the health and well-being of the injured soldiers, acknowledging their “resilience and unwavering dedication”.\n\nThe army chief commended the “high morale and steadfast resolve” of the troops, reaffirming that the military would continue to serve as a bulwark against terrorism to ensure the state’s security and stability.\n\nAddressing the troops, COAS Munir “lauded their heroic actions, recognising their swift and decisive response in neutralising the attackers and thwarting their nefarious designs”, adding that the fight against terrorists and their facilitators, “acting on the behest of hostile elements”, would continue until its logical conclusion.\n\nThe army chief highlighted that terrorist groups, including the proscribed Tehreek-i-Taliban Pakistan (TTP), continued to operate from Afghan soil against Pakistan. He underscored that the use of foreign weapons and equipment in recent terrorist attacks was “clear evidence that Afghanistan remained a safe haven for such elements”. He reaffirmed that no entity would be allowed to disrupt Pakistan’s peace and stability.\n\nIn its statement a day ago, the ISPR had noted that intelligence reports “unequivocally confirmed the physical involvement of Afghan nationals in this heinous act, with evidence also pointing to the fact that the attack was orchestrated and directed by Khwarij ring leaders operating from Afghanistan”.\n\n“Pakistan expects the interim Afghan government to uphold its responsibilities and deny its soil for terrorist activities against Pakistan. Pakistan reserves the right to take necessary measures in response to these threats emanating from across the border,” the military had said.\n\nIslamabad has consistently voiced concerns that the banned TTP uses Afghan soil to launch attacks in Pakistan, asking the Afghan interim government to rein in the group. Kabul denies the allegations.\n\nLast month, the ISPR said an Afghan national “involved in terrorism inside Pakistan” was killed during an operation in KP’s North Waziristan district.\n\nThat came within a month of Pakistan repatriating the body of an Afghan national involved in terrorist activities who was killed in a counterterrorism operation in Balochistan’s Zhob district.\n\nIn a press conference in December last year, ISPR Director General (DG) Lieutenant General Ahmed Sharif Chaudhry said terrorist outfits were being provided “sanctuaries, support, and are allowed unrestrained activities on Afghan territory”.\n\nKP Minister for Public Health Engineering Pakhtoon Yar Khan, Chief Secretary Shahab Ali Shah and Inspector General of Police Zulfiqar Hameed also visited the incident site to assess the damage and express solidarity with the victims.\n\nThe delegation was accompanied by Bannu Division Commissioner Muhammad Ali Shah, Deputy Inspector General of Police Imran Shahid, Bannu Deputy Commissioner Abdul Hameed Khan and District Police Officer Ziauddin Ahmed.\n\nThe officials inspected the affected area, including the damaged mosque, and assured the residents of its reconstruction and compensation for all losses.\n\nThe minister later met with the families of those who lost their lives in the tragic incident, offering condolences and prayers for the deceased.\n\nSpeaking to the media, he expressed deep sorrow over the incident, stating that the provincial government was committed to addressing the losses and providing relief to the victims.\n\nHe confirmed that a survey team had already assessed the damage and that compensation packages would soon be provided to the families of the martyrs.\n\nHe emphasised that the KP government was making all possible efforts to maintain peace and security in the region. Appealing to the public, he urged cooperation with the authorities to make Bannu a symbol of peace.\n\nThe minister reaffirmed the government’s dedication to preventing such tragedies in the future.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/06180742e6dc526.jpg",
  "retrievedAt": "2025-08-25T14:59:13.530Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896182/army-chief-vows-to-bring-planners-facilitators-of-bannu-cantt-attack-to-justice-soon",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T12:51:28.000Z"
}
