{
  "title": "Tensions ease around Lal Masjid amid signs of rapprochement - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Tensions began to ease around Lal Masjid in the G-6 sector of Islamabad on Wednesday after the blockade of roads leading to the mosque was relaxed by the capital police following an apparent patch-up between the government and the mosque management led by Maulana Abdul Aziz.\n\nNot only Maulana Abdul Aziz has toned down his ‘jihadist’ rhetoric against the government but the followers of his wife Ume Hassan have also apparently turned their faces from the root cause of the trouble that led to her arrest, sources said.\n\nMr Aziz said a day earlier that the operation by the Capital Development Authority (CDA), which razed portions of the Jamia Hafsa seminary adjacent to Lal Masjid, was part of a deal for the release of Ume Hassan and around eight of her students.\n\nThe Anti-Terrorism Court (ATC) in Islamabad on Wednesday granted bail to Ume Hassan and others in a case related to interference in government affairs and intimidating government officials.\n\nDuring the hearing, the accused were presented before the ATC Judge Tahir Abbas Sipra.\n\nThe police requested an extension of the remand for further investigation, but the court rejected the request and instead ordered judicial custody. Following this decision, the defence lawyers filed a post-arrest bail application on behalf of Ume Hassan and the other accused.\n\nAfter hearing arguments from both sides, the court approved the bail against surety bonds of Rs5,000 each and ordered their release.\n\nLater in the afternoon, police lifted the blockade of the roads in G-6 where around 150 police personnel had been posted for almost 10 days, restricting Maulana Abdul Aziz from gathering a sizeable crowd and pressuring the government for the release of his spouse.\n\nFollowing Wednesday’s rapprochement, the residents of G-6 breathed a sigh of relief and welcomed the reopening of roads.\n\n“Everything gets off the track. Even going to the market is a challenging task due to either roadblocks by the police or by the seminary students,” said Shahid Khan, a local resident.\n\nUme Hassan was arrested on the night of February 19 from Margalla Town after she and a group of around eight female students tried to occupy a mosque recently allocated to a group affiliated with the Jamiat Ullema-i-Islam-Fazl (JUI-F).\n\nThe mosque was being allocated to the JUI-F-affiliated group by the ICT administration instead of a mosque established illegally on a green belt on the main Muree Road.\n\nDuring the events leading up to the arrest of Ume Hassan, the firebrand cleric reached Margalla Town to occupy the said mosque and place an administrator of her choice. But the female police personnel arrested her.\n\nLater, Maulana Abdul Aziz tried to instigate the residents of Islamabad as well as invite seminary students from other areas to hold mass protests in Islamabad.\n\nAs Ume Hassan’s bail was rejected on February 24 for the second time, female students from the Lal Masjid held a sit-in at Aabpara Chowk and blocked the traffic at two spots on Khayaban-i-Suharwardy Road and Srinagar Highway.\n\nHowever, as the government remained firm, Maulana Aziz toned down his aggressive rhetoric. Meanwhile, the mosque in Margalla Town was handed over to the JUI-F-affiliated group.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c8c3bc16d02.jpg",
  "retrievedAt": "2025-08-25T14:59:16.890Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896012/tensions-ease-around-lal-masjid-amid-signs-of-rapprochement",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T07:36:15.000Z"
}
