{
  "title": "Trump among 300 nominees for Nobel Peace Prize - World - DAWN.COM",
  "author": null,
  "content": "OSLO: Over 300 people are nominated for this year’s Nobel Peace Prize, organisers said on Wednesday, with politicians claiming they had put US President Donald Trump and Pope Francis forward for the award.\n\nIn line with Nobel statutes, the identity of the candidates is kept confidential for 50 years — but the two are among the big names floated this year, along with former Nato chief Jens Stoltenberg.\n\nThe 338 overall nominations comprise 244 individuals and 94 organisations, the Norwegian Nobel Institute said in a statement. That was a significant increase from the previous year’s 286 nominations, but shy of the record 376 nominations registered in 2016.\n\nAlthough the prize committee is always tight-lipped about the nominees, those eligible to nominate — including former laureates, lawmakers and cabinet ministers from any country in the world, and some university professors — are free to reveal the name of the person or organisation they have proposed.\n\nOn Monday, US Congressman Darrell Issa declared in a post on X that he too would nominate Trump for the prestigious prize, adding: “No one deserves it more.” Issa’s office was later cited by US media as saying that the nomination was motivated by Trump’s efforts in the Middle East.\n\nIssa’s nomination would be submitted after the submission deadline, but Ukrainian parliamentarian Oleksandr Merezhko also nominated Trump back in November in a move to grab the then president-elect’s attention, according to Ukrainian media.\n\nTrump has been proposed as a candidate in previous years too, but a nomination this year would be particularly eye-catching. He has sparked controversy by opening talks with Moscow about its war in Ukraine and rattled European allies with changes to US foreign policy.\n\nIn January, thousands of people signed a UK petition calling for Frenchwoman Gisele Pelicot to receive the Nobel Peace Prize. She won praise for her open, public stance during the trial of her ex-husband, who was convicted of letting strangers rape her while she was drugged.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:59:41.590Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896053/trump-among-300-nominees-for-nobel-peace-prize",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T05:05:52.000Z"
}
