{
  "title": "Three Chinese company workers die on road in Kohistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Three employees of a Chinese company working on the Dasu hydropower project were killed when a truck plunged into the Indus River in Upper Kohistan district on Wednesday.\n\n“We have retrieved the bodies from the river and shifted them to a health facility in Dasu,” Mian Zahir, the district emergency officer of Rescue 1122, told reporters.\n\nThe vehicle, carrying employees of the Chinese company, was heading to the project’s construction site in the Kass Camp area for a survey when the driver while negotiating a sharp turn lost control of the vehicle. As a result, the truck skidded off the Karakoram Highway and plunged into the Indus River.\n\nLocal residents and Rescue 1122 personnel recovered three bodies and shifted them to the District Headquarters Hospital. According to the Chinese company, the deceased were identified as Zaboor Hussain, a surveyor helper from Mansehra; Attaullah, a surveyor, and Mashooqur Rehman, the truck driver — both residents of Upper Kohistan.\n\nZahir stated that the bodies were handed over to their respective families after completing medico-legal formalities at the health facility.\n\nMeanwhile, the Mansehra police busted a gang of extortionists in Datta area on Wednesday.\n\nA police team, led by DSP Javed Khan, rushed to the scene after receiving reports that an armed group was robbing people at gunpoint in Datta area here. The police arrested the outlaws, identified as Assad Shah, Mehmood Shah, Umar Shah, and Abbas Shah.\n\nThe DSP told reporters that locals had informed district police officer Shafiullah Khan Gandapur about a gang of extortionists. “This gang has been involved in such activities in the past. Whenever the police acted, they managed to flee,” he said.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c8c1b34135e.jpg",
  "retrievedAt": "2025-08-25T14:59:29.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896005/three-chinese-company-workers-die-on-road-in-kohistan",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T05:50:34.000Z"
}
