{
  "title": "Sudan launches genocide case against UAE at ICJ for alleged RSF support - World - DAWN.COM",
  "author": null,
  "content": "Sudan has filed a case against the United Arab Emirates at the World Court for allegedly violating its obligations under the Genocide Convention by arming the paramilitary Rapid Support Forces (RSF), the International Court of Justice (ICJ) said on Thursday.\n\nThe UAE said it would seek immediate dismissal of the case, which it said lacked “any legal or factual basis”, an Emirati official said in a statement to Reuters.\n\nThe charges are in connection with intense ethnic-based attacks by the RSF and allied Arab militias against the non-Arab Masalit tribe in 2023 in West Darfur, documented in detail by Reuters. Those attacks were determined to be genocide by the United States in January.\n\nThe Sudanese foreign ministry did not immediately respond to a request for comment. Reuters has seen a copy of the government’s application.\n\nSudanese officials have frequently accused the UAE of supporting the RSF, the government’s rivals in an almost two-year-old civil war, charges the UAE denies but UN experts and US lawmakers have found credible.\n\nAt the ICJ, Sudan alleges the RSF committed “genocide, murder, theft of property, rape, forcible displacement, trespassing, vandalism of public properties and violation of human rights”, according to a statement by the World Court.\n\n“According to Sudan, all such acts have been ‘perpetrated and enabled by the direct support given to the rebel RSF militia and related militia groups by the United Arab Emirates’,” it said.\n\nThe UAE official said: “The UAE is aware of the recent application by the Sudanese Armed Force’s (SAF) representative to the ICJ, which is nothing more than a cynical publicity stunt aimed at diverting attention from the established complicity of the SAF in the widespread atrocities that continue to devastate Sudan and its people.”\n\nThe war between the Sudanese army and the RSF, which erupted after a power struggle over integrating the forces in April 2023, has devastated the country, spreading hunger and disease while risking its fragmentation and drawing in several foreign powers.\n\nIt has sparked ethnic attacks in multiple areas, but the bloodiest were in West Darfur, where survivors told Reuters that Masalit boys were targeted for killing while young women were targeted for rapes over waves of attacks soon after the war began.\n\nThe ICJ is the UN’s highest court that deals with disputes between states and violations of international treaties. Sudan and the UAE are both signatories of the 1948 Genocide Convention.\n\nSudan is asking the court to impose emergency measures and order the Emirates to prevent such genocidal acts.\n\nWhile a hearing on the emergency measures should come before the ICJ within weeks, it will take years before the court will issue a final ruling, which could determine if a genocide had been committed in Darfur.\n\nThe RSF and allied political groups are in the process of setting up a parallel government to the army-aligned one, which has taken Port Sudan on the Red Sea, a move rejected by Egypt, Saudi Arabia and Qatar.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/06221030b7622a9.jpg",
  "retrievedAt": "2025-08-25T14:59:10.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896196/sudan-launches-genocide-case-against-uae-at-icj-for-alleged-rsf-support",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T17:19:35.000Z"
}
