{
  "title": "PM Shehbaz reiterates govt’s resolve to purge country of poliovirus - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Wednesday reiterated the government’s resolve to purge the country of poliovirus and said that the downward trend in February this year evidenced the effectiveness of the polio vaccination campaigns in the country.\n\nPresiding over a meeting on polio vaccination drive, the prime minister appreciated the administrations of all provinces for their efforts to timely identify polio cases which has led to gradual downward trend, said a PM Office press release.\n\nPM Shehbaz said that the cooperation between the federation and the provinces was inevitable to eradicate poliovirus.\n\nAppreciating the cooperation extended by security personnel during polio campaigns, he directed digitisation of polio data and strict monitoring.\n\nWelcomes Arab League’s Gaza reconstruction plan\n\nThe participants of the meeting were informed that the polio vaccination campaign is going on with full momentum in all provinces.\n\nThe meeting was informed that in polio vaccination drive in February this year, 42.5 million children were administered polio drops and nearly 90 per cent of the child population in the polio-affected districts was vaccinated.\n\nThe meeting was further informed that six polio cases have been reported so far this year.\n\nThe meeting was told that three polio campaigns during the first six months was part of the plan. Of this, the first one was conducted in February while the other two are scheduled to be carried out in April and May.\n\nAll aspects of the polio campaign are being continuously monitored through an IT dashboard, the meeting was told.\n\nArab Gaza plan\n\nIn a separate development, Prime Minister Shehbaz Sharif welcomed the Arab League’s approval of Egyptian President Abdel Fattah Al-Sisi’s plan for Gaza’s reconstruction and the League’s firm rejection of any plan displacing Palestinians from their homeland.\n\nIn a post on his official X account, the prime minister endorsed the Gaza reconstruction plan approved by the Arab League.\n\nThe prime minister said: “I reiterate Pakistan’s call that the United Nations must ensure implementation of its Resolutions affirming a two-state solution, with a viable, sovereign State of Palestine based on pre-1967 borders, with Al-Quds Al-Sharif as its capital.”\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/061000260abc691.jpg",
  "retrievedAt": "2025-10-12T01:47:16.498Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896065/pm-shehbaz-reiterates-govts-resolve-to-purge-country-of-poliovirus",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T07:41:12.000Z"
}
