{
  "title": "First FIR for speeding registered in Punjab in bid to reduce motorway accidents - Pakistan - DAWN.COM",
  "author": null,
  "content": "A First Information Report (FIR) was registered against a driver for speeding on the M-4 motorway near Multan as Punjab increases efforts to reduce motorway accidents, an official said on Thursday.\n\nThe National Highways and Motorway Police had warned motorists of lodging FIRs for exceeding speed limits to 150 kilometres per hour.\n\nThe police were instructed to give a clear warning to the drivers that they would have to face criminal cases for reaching or exceeding the speed limit on motorways. FIRs would be registered against the drivers, and the vehicle would be impounded.\n\nGenerally, the speed limit on motorways is 120 km/h for cars, jeeps and LTV vehicles and 110 km/h for heavy transport vehicles.\n\nMotorway Police Spokesperson Syed Imran Ahmed said, “The first FIR was registered for speeding on the motorway, and the driver had been arrested.”\n\n“A speeding incident occurred on the motorway near Multan when a vehicle was travelling at an illegal speed of 173 kilometers per hour on the M-4 motorway.”\n\nHe further said that a case was registered at the Badlah-e-Sant Police Station, Multan, under the provisions of negligence and speeding.\n\nThe driver was taken into custody and handed over to the local police, the spokesperson added.\n\nHe also said that strict measures against speeding will continue.\n\nFatal road accidents on highways occur frequently in Pakistan, mainly due to overspeeding, hazardous overtaking, and disregard for traffic rules.\n\nAt least eight passengers lost their lives, and 41 were injured after the bus they were travelling in met an accident on Islamabad-Lahore Motorway near Neelah-Dullah Interchange on Friday.\n\nOn Jan 22, one person died and 11 others were injured after a fatal accident occurred near Nooriabad on the M-9 Karachi-Hyderabad motorway.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/0613084454f3e40.jpg",
  "retrievedAt": "2025-10-12T01:46:56.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896149/first-fir-for-speeding-registered-in-punjab-in-bid-to-reduce-motorway-accidents",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T07:52:58.000Z"
}
