{
  "title": "The last mile - Newspaper - DAWN.COM",
  "author": null,
  "content": "HERE it comes. The coming IMF review is going to be successful, but the government is likely to emerge significantly more hamstrung at the other end.\n\nWe should expect an embattled budget drawing up process as the search for more innovative means to address business community concerns collides with a fiscal effort that needs to try and plug a Rs600 billion gap in the revenue target before June.\n\nA number of recent moves are giving the game away. For example, the finance minister is on record assuring the country that the review will be successful. Usually these assurances mean much has already been squared out between the authorities and the Fund staff, so it’s a safe bet that the review will be successful considering there is over-performance on the primary balance targets, which are a central plank of the programme.\n\nMeanwhile, the induction of Humayun Akhtar as an adviser to the prime minister is intended to make him a player in the coming bargaining between the business community and government over tax burden sharing. It is unclear how much influence Akhtar will be able to wield, but he will certainly serve as a release valve for the hot air bubble that is building up in the business community with the ongoing stabilisation.\n\nThe country’s apex chamber recently renewed its call for a sudden, 500 basis point cut in the policy rate after seeing inflation drop to a nine-year low.\n\nMr Akhtar’s job will be to listen to all that these business leaders have to say, to nod along, feign empathy convincingly, issue the right assurances, keep both feet planted firmly in the corner of the business community, and commit to do his utmost to carry their pleadings to the prime minister. And then, he will fail roundly to move the needle in any appreciable way. It’s a tough job and somebody’s got to do it. Mr Akhtar has the perfect credentials for it.\n\nDemands for rate cuts and rolling back of the tax burden will rise in the coming months. Meanwhile, the government will pass the Fund’s review, but will be left with a significant tax effort to put up in the closing months of this fiscal year. This is the environment in which next fiscal year’s budget will be drawn up, with the process having kicked off already.\n\nIf businesses are not taxed, taxes on salaried people will either have to be raised very sharply, or taxes on fuel and electricity will have to do the job.\n\nBut in the meantime, there will be the matter of the Rs600bn gap in the revenue numbers, which, according to a report in this newspaper, could grow to Rs1 trillion by the end of the fiscal year in June.\n\nPlugging this will require new taxes, and according to the same report, those tax measures have already been agreed to. They include higher advance income tax on imports, a one per cent raise in withholding tax on supplies, services, and contracts, and a 5pc hike in the federal excise duty on soft drinks, according to the same report in this paper.\n\nThis, in a nutshell, means burdening business activity further with more taxes, which is better than burdening the common citizenry or, worse still, burdening salaried individuals. Consider for a moment that the collection of direct taxes has increased by more than Rs630bn in the first six months of this fiscal year by comparison to the same period last year. This is the juice being squeezed out of salaried individuals, who are the most easily juiced group in the entire tax system.\n\nIf businesses are not taxed, taxes on salaried people will either have to be raised very sharply, or taxes on fuel and electricity will have to do the job, fuelling inflation and burdening the poor at a time when they have already been crushed by the inflationary fire that raged from 2021 till 2024, wrecking their purchasing power.\n\nIt is a tough reality and someone has to bear it, and the most fit and proper place to put the burden of the next round of taxes is on the business community. This is the job that gets going once the IMF review ends successfully. The job will involve some skilful politics. And eventually, it will take nothing less than those two dreaded words in Islamabad: ‘structural reforms’.\n\nThese words are acquiring the status in our time that the words ‘do more’ had back in the ‘war on terror’ heyday. So often are they repeated, without any actionable specifics, that those running things in Islamabad betray a slight sense of irritation upon hearing them. They’re not wrong. These words have now almost been reduced to a mantra. Like a prayer, they are good words with which to end a policy conversation.\n\nBut look at where we are without them! Not even at the midway mark of our latest Fund programme, and already talking about more revenue measures, more taxes, more spending cuts and more wrangling between business and industry.\n\nSo what is more irritating here? Watching our economic conversation devolve into a ritualistic invocation of mantras? Or watching our economy go round and round the same peg, but with the leash shortening, with the cycles getting tighter? What is worse? The déjà vu our economy gives us? Or the déjà vu that the language we use to discuss it with?\n\nFor now, there is no sign of any structural reform on the horizon. Yes, they have passed legislation on agriculture income tax, but there is no work being done on the machinery with which to actually activate this revenue line. Services has failed to step into the net when offered incentives under the last budget.\n\nProperty and real estate is left, but this sector is notoriously undocumented so no telling how much can credibly be squeezed out of them. If they don’t get going with the tax reforms, then there will be one exercise with which to close this fiscal year, and another in the forthcoming budget with which to open the next fiscal year. This is what the last mile of this year will look like.\n\nThe writer is a business and economy journalist.\n\nkhurram.husain@gmail.com\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c910fbbc261.jpg",
  "retrievedAt": "2025-10-12T01:48:06.123Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896093",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T03:06:59.000Z"
}
