{
  "title": "Beijing’s plans to combat climate change - World - DAWN.COM",
  "author": null,
  "content": "BEIJING: China said on Wednesday it would develop a package of major projects to tackle climate change as it moves to bring its carbon dioxide emissions to a peak before 2030 and become carbon neutral by 2060.\n\nThe world’s largest producer of climate-warming greenhouse gas said it would develop new offshore wind farms and accelerate the construction of “new energy bases” across its vast desert areas, the National Development and Reform Commission, the country’s economic planner, said in an official report published on Wednesday.\n\n“China will actively and prudently work towards peaking carbon emissions and achieving carbon neutrality,” the report read.\n\nAmong the proposed projects cited in the report by the state planning agency was a controversial hydropower facility on the Yarlung Tsangpo river in Tibet, which has raised concerns in India about its potential impact on downstream water flows.\n\nChina to develop new offshore wind farms, accelerate construction of energy bases\n\nIt also said it would develop a direct power transmission route connecting Tibet with Hong Kong, Macao and Guangdong in the southeast.\n\nHowever, coal will remain a key fuel, with the NDRC report saying the country will continue to increase coal production and supply this year even as it plans for trials of low-carbon technology at its coal-fired power plants and to promote initiatives aimed at substituting fossil fuels with renewables.\n\nChina has been struggling to strike a balance between fostering economic growth and meeting its environmental goals.\n\nThe NDRC said the 3.4 per cent reduction in the amount of carbon emissions per unit of economic growth last year “fell short of expectations”, blaming rapid growth in energy consumption as well as extreme weather.\n\nChina is not expected to meet its five-year goal to bring carbon intensity down by 18pc by the end of this year, and it has not yet announced an annual target for 2025.\n\nIt will also struggle to meet a separate target to cut the amount of energy consumed per unit of growth by 13.5pc by the end of this year, despite exceeding expectations with a 3.8pc reduction last year, analysts said.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:47:34.918Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896073/beijings-plans-to-combat-climate-change",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T04:38:40.000Z"
}
