{
  "title": "Torture, murder of trans man in US shines light on rising fears - World - DAWN.COM",
  "author": null,
  "content": "US prosecutors gave a graphic account on Wednesday of the torture and murder of a transgender man whose case has highlighted the growing dangers faced by the trans community.\n\nSam Nordquist was abducted, beaten and sexually assaulted for weeks before his body was hidden, prosecutors said, announcing seven adults had been indicted for the Black 24-year-old’s murder.\n\nNordquist travelled from Minnesota to New York to meet an online contact who was among those indicted Wednesday.\n\nNordquist’s family had not heard from him since January, and the last time he was seen was in early February.\n\nThe seven suspects had previously been indicted for lesser crimes, with the charge of first-degree murder — the state’s most serious and carrying possible life imprisonment without parole — added Wednesday.\n\nTwo children were also allegedly involved in the beating of Nordquist, who was brutalised in a motel in Canandaigua, located in upstate New York.\n\n“Sam was beaten, assaulted, sexually abused, starved, held captive, and we cannot make sense of that,” said Ontario County Assistant District Attorney Kelly Wolford at a briefing.\n\nWolford said hate crime charges had not been brought because “we cannot put that on his gender, and we cannot put that on his race”.\n\n“Sam was confined. He was forced to kneel and stand against a wall. He was physically assaulted,” Wolford added as she recounted the two children were believed to have been involved in Nordquist’s beating.\n\n“We have a seven-year-old and a 12-year-old who are also victims. They may have been forced to participate, but their lives are forever changed by what they saw,” she said.\n\nThe seven adult suspects are alleged to have starved Nordquist, fed him faeces, and forced him to drink urine.\n\n“They forced him to obey their commands, treating him like a dog,” said Wolford.\n\nThe case has rocked the trans community and outraged activists.\n\n“We refuse to let Sam’s story fade into silence. We demand accountability, we demand justice, and we demand a world where transgender people are safe, respected, and able to live freely,” Sarah Kate Ellis, the president of the Glaad LGBTQ campaign group, said in a statement last month.\n\nGlaad reported that there had been more than 800 anti-trans incidents in the US since June 2022.\n\nTrump campaigned on a promise to ban transgender people from the military, outlaw federal funding for trans healthcare and remove trans people from sports teams.\n\nSince coming to office, he has passed a slew of executive orders targeting the community, including purging mentions of transgender people from government websites and slashing LGBTQ programmes.\n\nOn his first day back in power, Trump signed an executive order recognising only “two genders, male and female”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:59:13.422Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896172/torture-murder-of-trans-man-in-us-shines-light-on-rising-fears",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T10:55:31.000Z"
}
