{
  "title": "36 civil servants promoted to grade 22 - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A high-powered selection board on Wednesday approved the promotion of 36 senior civil servants from BS-21 to BS-22 across the Pakistan Administrative Service (PAS), Police Service of Pakistan (PSP) and Foreign Service of Pakistan (FSP).\n\nIn its 29th meeting, the board recommended the promotion of 19 PAS officers, eight PSP officers and nine FSP officers.\n\nThe meeting was chaired by Deputy Prime Minister Ishaq Dar and held at the Establishment Division’s Committee Room — marking the first time it was convened outside the Prime Minister’s Secretariat.\n\nOther attendees included Defence Minister Khawaja Asif, Minister for Establishment Ahad Khan Cheema and secretaries of the Cabinet and Establishment divisions.\n\nAccording to a statement issued by the Establishment Division, PAS officers promoted in BS-22 included Secretary Food Security Waseem Ajmal Chaudhry, Additional Secretary Science and Technology Ambreen Raza, Ali Tahir (awaiting posting), Secretary Privatisation Commission Usman Akhtar Bajwa, Special Secretary Economic Affairs Division Mohammad Humair Karim, Additional Secretary Ministry of Religious Affairs Syed Ataur Rehman, Secretary Energy Sindh Musaddiq Ahmed Khan, FBR Chairman Rashid Mehmood Langrial, Additional Secretary In-charge Petroleum Division Momin Agha, Secretary National Health Services Nadeem Mahbub, Secretary Federal Education Mohyuddin Ahmed Wani, former AJK chief secretary (now awaiting posting) Dawood Mohammad Barech, Special Secretary Commerce Shakeel Ahmed Mangnejo, Additional Secretary National Security Division Saadia Sarwat Jawaid, Principal Secretary to the Prime Minister Asad Rehman Gillani, Trade Ambassador to the US Ali Sarfraz Hussain, Chief Secretary Punjab Zahid Akhtar Zaman, Planning and Development Board Chairman Nabeel Ahmed Awan, and Additional Chief Secretary Punjab Ahmed Raza Sarwar.\n\nThe PSP officers promoted to BS-22 are Additional Secretary Commerce B.A. Nasir, IG Sindh Ghulam Nabi Memon, Mohammad Farooq Minhas (posted to the Punjab government), Abdul Khaliq Sheikh (who was transferred to the Establishment Division from Balochistan where he was serving as IG), Additional IG Motorway Mohammad Zubair Hashmi, Moha­mmad Shahzad Sultan (currently posted in the National School of Public Policy), and IG Railway Mohammad Tahir.\n\nThe FSP promoted to BS-22 are Ahmed Naseem Warraich, Rahim Hayat Qureshi, Asim Iftikhar Ahmed, Rizwan Saeed Sheikh, Syed Ahsan Raza Shah, Faisal Niaz Tirmizi, Nabeel Munir, Saqlain Sayedah, and Shafqat Ali Khan.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:47:02.451Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896074/36-civil-servants-promoted-to-grade-22",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T04:44:00.000Z"
}
