{
  "title": "Mob lynches suspected robber after trader’s murder in Karachi’s Quaidabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A trader was shot dead by a robber in the Quaidabad area on Wednesday afternoon, police said.\n\nDIG-East Usman Ghani told Dawn that a lone armed robber entered the office of a beverage firm dealer in Quaidabad, held some people there at gunpoint and demanded their valuables.\n\nHe said that the people put up resistance to which the robber resorted to firing, resulting in bullet injuries to the shop owner, Babar Gul, 35, who died on the spot.\n\nHe said that the robber was about to flee when the people captured him and subjected him to a severe beating. He suffered serious injuries and was taken to the Jinnah Postgraduate Medical Centre (JPMC), where doctors declared him dead.\n\nDIG warns police will not tolerate vigilante justice; says criminal case will be registered against people involved in suspect’s killing\n\nPolice surgeon Dr Summaiya Syed said the trader’s body was taken away by his relatives without allowing doctors to carry out a post-mortem examination. He suffered a bullet wound in the chest, she added.\n\nThere were reports that the suspected robber was alive when he was brought to the JPMC, from where the victim’s relatives took him away.\n\nDIG Ghani expressed his ignorance about any such incident and said that the robber was expired at the JPMC.\n\nHowever, DIG-South Syed Asad Raza told Dawn that the suspected robber was severely beaten by the mob and was presumed dead when he was brought to the emergency of the JPMC by a rescue service.\n\nHe said that when a large number of people, including the victim’s heirs, arrived there, volunteers from the rescue service apprehended that the mob might get hold of the suspect’s body and mutilate it, so they drove it away.\n\nLater, the ambulance driver, along with the police, brought back the body for medico-legal formalities, he said.\n\nCase to be registered against mob\n\nDIG Ghani said the police have adopted a ‘zero tolerance’ policy against vigilante justice.\n\nHe said that a criminal case would be registered against all those people who were involving in the lynching of the suspected robber.\n\nHe said that the police were already filing FIRs against the people who set heavy vehicles on fire after any fatal accident.\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:47:19.290Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896031/mob-lynches-suspected-robber-after-traders-murder-in-karachis-quaidabad",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T05:13:16.000Z"
}
