{
  "title": "Record total takes NZ to decider as spinners mesmerise South Africa - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The spin web proved too tough for South Africa to handle as they looked to climb a mountainous target against New Zealand.\n\nThough David Miller did entertain the crowd in the end with a rearguard 67-ball unbeaten century which he achieved on the very last ball of the innings, the writing was always on the wall for Temba Bavuma and his brigade in the ICC Champions Trophy semi-final here at the Gaddafi Stadium on Wednesday night.\n\nAs South African wickets started to fall regularly after the departure of Rassie van der Dussen who was undone by an unplayable delivery from New Zealand captain Mitchell Santner in the 27th over with the scoreboard at 161-2, it gradually became obvious that the Black Caps carried out the day’s task better than managed by their opponents in a partially-filled stadium.\n\nWith a four-pronged spin attack led by their left-arm spinning captain Mitchell Santner sharing seven wickets among them, New Zealand were never going to let the game slip away from their hands after posting a gigantic 362-6 — a record Champions Trophy team total — thanks to robust centuries from Rachin Ravindra and Kane Williamson. Ravindra was named player-of-the-match.\n\nThe previous highest total in the event history was 356 which was made by Australia while chasing 352 against England in the ongoing tournament at the same venue.\n\nSouth Africa did not have ideal start when they lost opener Ryan Rickelton who was caught by Michael Bracewell off pacer Matt Henry in the fifth over with 20 on the board.\n\nTop-order batter Rassie van der Dussen joined captain Temba Bavuma as both cautiously started rebuilding the innings with selected strokeplay while avoiding any undue risks. South Africa reached the 50 mark in 9.2 overs and ended the powerplay at 56-1.\n\nWhile Van der Dussen continued to play a run-a-ball knock, Bavuma’s knock slowly gathered pace as South Africa reached hundred in the 18th over.\n\nBavuma, who completed his half-century off 64 balls which was his seventh in ODIs, was finally dismissed for 56 by Santner as the batter while coming down the wicket to play was caught by Kane Williamson at backward point. The departure of the skipper who faced 71 balls and struck four fours and a six, ended the run-a-ball partnership of 105 with Van der Dussen.\n\nA well-set Van der Dussen, who struck 69 off 66 balls with the help of four boundaries and couple of maximums, was stunned by an absolute jaffa by left-arm spinner Santner as the right-hander looking to play through the on-side completely missed the ball only to see it straighten a bit and crash into the middle stump.\n\nIt was a huge blow to Proteas who never recovered.\n\nSantner deceived hitter Heinrich Klaasen (seven) could not stay for long as he tried to play a lofted shot but only succeeded in giving Henry a catch at long-on as South Africa slid to 167-4 in the 29th over as the asking scoring rate crossed eight per over.\n\nWhen Aiden Markram was caught and bowled by Ravindra’s slow left-arm spin after contributing a 29-ball 31, South Africa’s score read 200-5 in 33 overs and the required run-rate got close to 10.\n\nWiaan Mulder (eight) was caught by Ravindra at deep square leg off the bowling of off-spinner Michael Bracewell.\n\nMulder was soon followed by Marco Jansen (three) and Keshav Maharaj (one), both dismissed by part-time off-spinner Glenn Phillips. Jansen was given out lbw after New Zealand took a review and Maharaj was caught by wicket-keeper Tom Latham down the leg-side.\n\nWith another 145 needed off 63 balls, it was almost all over for South Africa who were reeling at 218-8.\n\nTailender Kagiso Rabada’s departure made it 256-9. But left-handed Miller made sure his team did not surrender so easily as the last-wicket unbeaten stand with Lungi Ngidi (one not out) produced an entertaining 56 off just 27 balls. Miller struck 10 fours and four sixes in his belligerent knock which enabled him to record his seventh ODI century in the last over, which was bowled by Kyle Jamieson and produced 18 runs. For South Africa, however, it was too late too late.\n\nSanter claimed 3-43 and was well supported by his spinning team-mates Phillips (2-27 in three overs), Bracewell (1-53) and Ravindra (1-20 in five). Henry took a couple.\n\nWILLIAMSON, RAVINDRA SMASH TONS\n\nEarlier, Ravindra and veteran Williamson cracked fast centuries as New Zealand posted a mammoth total after electing to bat first on a batting-friendly track in bright sunshine.\n\nAfter losing Will Young (21), who was caught at mid-off by Markram off a slow ball of paceman Lungi Ngidi in the eighth over, fellow opener Ravindra and Williamson took charge of the New Zealand innings.\n\nDemonstrating superb strokeplay, the in-form pair maintained a healthy scoring rate as New Zealand touched hundred in 17.3 overs.\n\nRight-handed Williamson, 34, looked a bit busier compared to southpaw Ravindra as the former made a 94-ball 102 laced with 10 fours and two sixes. This was former captain’s 15th ODI ton.\n\nThe 25-year-old Ravindra struck his fifth ODI century, and the second of the ongoing event having made 112 against Bangladesh in Rawalpindi, while adding an invaluable 152 runs with Williamson.\n\nRavindra reached the three-figure mark off 93 balls in the 34th over as New Zealand touc­hed 200 in 32 overs. He smashed 13 fours and a six during his 108 off 101 before finally being dismissed by pacer Rabada whose slower ball deceived the batter making him getting caught by wicket-keeper Klaasen.\n\nHaving completed a sedate fifty off 61 balls, Williamson accelerated his scoring rate plundering his next fifty in just 30 balls. When he was eventually caught by Ngidi at short fine leg off a full-pitched ball from Mulder, New Zealand became 251-3 in the 40th over, South Africa must have taken a much-needed sigh of relief.\n\nHowever, it was not to be as New Zealand cracked 110 off the final 10 overs.\n\nTom Latham (four) was bowled by Rabada but middle-order batter Daryl Mitchell (49 off 37) and Glenn Phillips (49 not out off 27) kept their team going as both added a quick 57 off just 30 balls for the sixth wicket. Bracewell (16 off 12) enabled his side to register a massive total that proved too tough to chase for South Africa.\n\nExcept for off-spinner Markam (4-23 in four overs), all other bowlers proved expensive. Ngidi took three wickets but conceded 72 while Rabada (2-70), Jansen (0-79), Mulder (1-48 in six overs) and Maharaj (0-65) also failed to stop the flow of runs.\n\nScoreboard\n\nNEW ZEALAND:\n\nW. Young c Markram b Ngidi 21\n\nR. Ravindra c Klaasen b Rabada 108\n\nK. Williamson c Ngidi b Mulder 102\n\nD. Mitchell c Rabada b Ngidi 49\n\nT. Latham b Rabada 4\n\nG. Phillips not out 49\n\nM. Bracewell c Rickelton b Ngidi 16\n\nM. Santner not out 2\n\nEXTRAS (LB-5, W-6) 11\n\nTOTAL (for six wickets, 50 overs) 362\n\nFALL OF WICKETS: 1-48 (Young), 2-212 (Ravindra), 3-251 (Williamson), 4-257 (Latham), 5-314 (Mitchell), 6-360 (Bracewell)\n\nDID NOT BAT: M. Henry, K. Jamieson, W. O’Rourke\n\nBOWLING: Jansen 10-0-79-0 (2w), Ngidi 10-0-72-3 (2w), Rabada 10-1-70-2 (1w), Mulder 6-0-48-1 (1w), Maharaj 10-0-65-0, Markram 4-0-23-0\n\nSOUTH AFRICA:\n\nR. Rickelton c Bracewell b Henry 17\n\nT. Bavuma c Williamson b Santner 56\n\nR. van der Dussen b Santner 69\n\nA. Markram c&b Ravindra 31\n\nH. Klaasen c Henry b Santner 3\n\nD. Miller not out 100\n\nW. Mulder c Ravindra b Bracewell 8\n\nM. Jansen lbw Phillips 3\n\nK. Maharaj c Latham b Phillips 1\n\nK. Rabada c Phillips b Henry 16\n\nL. Ngidi not out 1\n\nEXTRAS (W-7) 7\n\nTOTAL (for nine wickets, 50 overs) 312\n\nFALL OF WICKETS: 1-20 (Rickelton), 2-125 (Bavuma), 3-161 (van der Dussen), 4-167 (Klaasen), 5-189 (Markram), 6-200 (Mulder), 7-212 (Jansen), 8-218 (Maharaj), 9-256 (Rabada)\n\nBOWLING: Henry 7-0-43-2 (1w), Jamieson 7-1-57-0, O’Rourke 8-0-69-0, Bracewell 10-0-53-1 (3w), Santner 10-0-43-3 (2w), Ravindra 5-0-20-1, Phillips 3-0-27-2 (1w)\n\nRESULT: New Zealand won by 50 runs.\n\nPLAYER-OF-THE-MATCH: Rachin Ravindra\n\nPublished in Dawn, March 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67c8ca9823777.jpg",
  "retrievedAt": "2025-08-25T14:59:29.504Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896045/record-total-takes-nz-to-decider-as-spinners-mesmerise-south-africa",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T06:02:32.000Z"
}
