{
  "title": "PM reaffirms govt’s full support to develop KP amid complaints by CM Gandapur - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Muhammad Shehbaz Sharif on Thursday reaffirmed the federal government’s full support in the development and welfare of Khyber Pakhtunkhwa’s populace.\n\n“We are committed to the development of KP,” the prime minister said while talking to PML-N KP General Secretary Murtaza Javed Abbasi who called on him at the PM House.\n\nAbbasi invited the prime minister to visit KP and lay the foundation stone for an additional interchange on the Hazara Motorway to facilitate the people of Abbottabad and surrounding areas.\n\nThe prime minister’s statement comes a day after KP Chief Minister Ali Amin Gandapur complained that the centre was not releasing due funds to the province.\n\nHe criticised the federal government last month for “avoiding its Constitutional responsibility over the delayed National Finance Commission (NFC) Award” and warned that if the federal government failed to announce the new NFC Award by April, then a ‘decisive action’ would be taken in May.\n\nCM Gandapur had said that the KP-Fata merger increased the province’s population by 5.7 million (a three per cent rise) and expanded its land area by 22,000 square kilometres (3.8pc) adding that per the statistics, KP’s share in the NFC Award should have increased from 14pc to 19.6pc, yet the province had not received its due share.\n\nGandapur said that the federal government had pledged an annual allocation of Rs100 billion for the accelerated development of the merged districts, amounting to Rs600bn over six years, but only Rs132bn was disbursed so far.\n\nHe said that the province received only Rs66bn annually instead of the committed Rs88bn for operational expenses in these districts.\n\n“This neglect by the federal government was fostering distrust among the people of the merged areas,” he had said.\n\nThe chief minister had said that the provincial government increased its revenue by 55pc, cleared Rs75bn in outstanding dues from the previous administration, and established Pakistan’s first Debt Management Fund, initially allocating Rs30bn with plans to raise it to Rs150bn.\n\nHe said that while the province continued to bear the brunt of terrorism, its contributions ensure the safety of the rest of the country, while lamenting at the same time that instead of receiving due recognition, the province faced injustices.\n\nSeparately, Punjab Information Minister Azma Bukhari strongly criticised the KP government over its alleged failure in governance, infrastructure development and public service delivery.\n\nIn a press conference in Lahore, she compared KP’s performance with Punjab’s recent initiatives.\n\nBukhari highlighted the sharp fare hike in the Peshawar Bus Rapid Transit (BRT) system, which increased from Rs110 to Rs510, while Punjab’s electric bus fares remain at Rs20. She further said that the cost of Peshawar BRT surpassed Rs120 billion, whereas Punjab implemented three transport projects for less than that amount.\n\nThe information minister also accused the KP government of taking credit for old projects, pointing out that the Chashma Right Bank Canal (CRBC) project was initiated by Wapda in 1995 and that the Peshawar-DI Khan Motorway was a China-Pakistan Economic Corridor (CPEC) project, not a provincial initiative.\n\nAdditionally, she revealed that the contractor of Peshawar BRT filed a Rs57bn compensation claim against the KP government in an international court.\n\nBukhari criticised KP’s employment record, adding that only 173 jobs were created in the technology sector, whereas over 100,000 people were employed under the Suthra Punjab Programme.\n\nShe also claimed that KPs “Ikhtiyar Awam Ka” mobile app was a copy of Punjab’s “Maryam Ki Dastak” app, with a low registration rate of just 0.04pc.\n\nRegarding healthcare, Bukhari noted that KP built only 25 dialysis units in the past 12 years, most of which were now non-functional. She also condemned the government’s failure to meet housing targets, adding that out of a promised 5m homes, only 200 were completed.\n\nThe Punjab minister criticised the KP government’s “Taleem Card” initiative, saying that it was scheduled for 2027 but had been included in its current performance report.\n\nIn contrast, she highlighted Punjab’s “Honhaar Scholarships” programme, which had already awarded scholarships to 30,000 students, with plans to expand to 50,000.\n\nShe also noted that Punjab Chief Minister Maryam Nawaz was providing electric bikes and scooters to students, building thousands of homes under the “Apni Chhat Apna Ghar” programme and distributing Green Tractors and Kisan Cards to support farmers.\n\nShe accused the KP government of failing to handle security issues, added that while violence escalated in Kurram, CM Gandapur was more focused on political activities in Islamabad.\n\nComparing welfare efforts, she said that Punjab set up 80 Ramazan markets across the province, offering goods at prices lower than the official rates, and launched a Rs30bn Ramazan relief package.\n\nBukhari concluded by adding that the KP government was attempting to take credit for projects it did not initiate while failing to deliver on its promises in key sectors such as transport, education and healthcare.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/062206426e3bf87.jpg",
  "retrievedAt": "2025-08-25T14:59:09.177Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896200/pm-reaffirms-govts-full-support-to-develop-kp-amid-complaints-by-cm-gandapur",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T17:53:00.000Z"
}
