{
  "title": "Banking data theft attacks on smartphones triple in 2024: report - World - DAWN.COM",
  "author": null,
  "content": "The number of Trojan banker attacks on smartphones surged by 196 per cent in 2024 compared to the previous year, according to Kaspersky, a global cybersecurity company.\n\nIn its report called “The mobile malware threat landscape in 2024”, the company said that cybercriminals were “shifting tactics, relying on mass malware distribution to steal banking credentials”.\n\n“Over the past year, Kaspersky detected more than 33.3 million attacks on smartphone users globally, involving various types of malware and unwanted software,” the report said.\n\nAdditionally, it noted that the number of “Trojan banker attacks on Android smartphones increased from 420,000 in 2023 to 1,242,000 in 2024”.\n\n“Trojan banker malware is designed to steal user credentials for online banking, e-payment services and credit card systems,” according to the report.\n\nIt added that victims are tricked into downloading Trojan bankers through links via SMS or messaging apps — as well as through attachments in messengers — and by directing users to malicious web pages.\n\nCybercriminals “can even send messages from a hacked contact’s account, making the fraud appear more trustworthy,” the report noted. “To deceive users, attackers often exploit trending news and hype topics to create a sense of urgency and lower victims’ guard.”\n\nAnton Kivva, a security expert at Kaspersky, said, “Scammers have started to scale down their efforts to create unique malware packages, focusing instead on distributing the same files to as many victims as possible.\n\n“It is more important than ever to be cyberliterate and educate your loved ones — from children to the elderly — because no one is completely safe from well-crafted scams and psychological tricks designed to steal banking data, “ he added.\n\nAlthough Trojan bankers are the fastest-growing type of malware, they rank fourth in terms of the share of attacked users at 6 per cent, according to report.\n\n“The most widespread category remains AdWare, accounting for 57pc of attacked users, followed by general Trojans (25pc) and RiskTools (12pc),” it said.\n\nIn 2024, cybercriminals launched an average of 2.8 million malware, adware, and unwanted software attacks on mobile devices each month. Over the year, Kaspersky products blocked a total of 33.3 million attacks.\n\nShahzad Shahid, policy advocate and expert on IT and digital economy in Pakistan, commented that the alarming rise in mobile banking malware attacks called for a “multi-faceted approach to cybersecurity”.\n\nHe noted that awareness and education were the first lines of defence.\n\n“The public must be educated on safe digital practices, such as avoiding suspicious links, using multi-factor authentication, and installing security updates regularly,” he said, adding that the government should also “play a proactive role by integrating cybersecurity education into academic curricula, and ensuring strict regulatory measures for financial institutions and digital service providers”.\n\nKaspersky warned that downloading apps from official stores was not always risk-free.\n\n“To stay safe, always check app reviews and download numbers when possible, use only links from official websites, and install reliable security software,” it said, recommending Kaspersky Premium, which can detect and block malicious activity in an application.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:59:13.171Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896168/banking-data-theft-attacks-on-smartphones-triple-in-2024-report",
  "dateList": "2025-03-06",
  "date_published": "2025-03-06T10:12:48.000Z"
}
