{
  "title": "High Commissioner holds virtual interaction with Pakistani community in Birmingham",
  "link": "https://www.app.com.pk/national/high-commissioner-holds-virtual-interaction-with-pakistani-community-in-birmingham/",
  "date_published": "2021-02-16T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):High Commissioner Moazzam Ahmad Khan held a virtual interaction with the Pakistani community in Birmingham on Monday and discussed a wide range of issues pertaining to the community.\nThe event was organized by the Consulate of Pakistan, Birmingham in line with the vision of Prime Minister Imran Khan to keep close contact with the Pakistani community abroad.\nThe Diaspora members belonging to various walks of life including politics, health, education, business, social service and media attended the meeting, a press release issued by Pakistan High Commission in London on Tuesday said.\nIn his remarks, the High Commissioner said that welfare of the community was his priority and briefed the participants about the continued efforts of Pakistan Mission and its Consulates to provide efficient and seamless consular services to the community.\nThe High Commissioner appreciated the role of Pakistani community in strengthening ties between Pakistan and the UK.\nHe also thanked the Diaspora for their continued support to the cause of Kashmir and assured that Pakistan would always stand with the Kashmiris in their just struggle for right to self-determination.\nThe High Commissioner reiterated his advice to the community to avail COVID-19 vaccine at the earliest opportunity and not to pay heed to any disinformation being spread in that regard.\nHe said vaccination was the only way to overcome the challenges posed by the COVID-19 pandemic. He also urged the community to fully participate in the upcoming census in the UK.\nThe community members appreciated the High Commission’s outreach efforts and gave useful suggestions to further improve the services.\nThey particularly gave ideas about developing linkages between the two countries in the fields of education, health and business, which the High Commissioner welcomed and assured all possible assistance.\nHe also appreciated the suggestions regarding preservation and promotion of Pakistani culture and language for the young generation of the British Pakistanis in the UK.\nSince, face to face meetings were not possible during the pandemic; the High Commissioner had started virtual interactions with the community living in various parts of the UK.",
  "retrievedAt": "2025-08-11T20:21:57.169Z"
}
