{
  "title": "Multinational Maritime Exercise AMAN-21 culminates",
  "link": "https://www.app.com.pk/national/multinational-maritime-exercise-aman-2021-culminates-amid-conduct-of-intl-fleet-review/",
  "date_published": "2021-02-16T15:21:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 16 (APP): The 45-country Pakistan Navy Multinational Maritime Exercise AMAN-21 culminated in the North Arabian Sea on Tuesday with a spectacular International Fleet Review (IFR), followed by AMAN Formation; comprising Pakistan Navy and foreign warships.\nPresident Dr Arif Alvi congratulated the Pakistan Navy for successfully hosting AMAN-21 and reaffirming Pakistan’s resolve for promoting peace and security in the region.\nHe thanked the participating regional and extra-regional navies for displaying their commitment to collaborative maritime security despite the COVID-19 pandemic. The President emphasized that AMAN-21 would pave the way to make the region more peaceful and secure with combined efforts by all stakeholders.\nEarlier the President, the Chief Guest, was received by Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi upon arrival on board the Pakistan Navy Ship MOAWIN.\nAccording to the defense experts the AMAN-21 maritime exercises served as an endorsement for Pakistan as a proponent of peace, with around 45 countries participating in the six-day manoeuvers; under, over, and above the raging seas.\nThe 7th exercise of the biannual series – Aman -21 from February 11 to 16 was designed to serve as a forum for information sharing, mutual understanding, and identifying areas of common interests.\nAccording to the vision of Prime Minister Imran Khan Pakistan has consistently been pursuing its mission for a peaceful resolution of all conflicts; including the recent US -Taliban Doha peace efforts and its quest for peaceful resolution of conflicts in the Gulf.\nThe event also helped develop and practice response tactics, techniques and procedures against asymmetric and traditional threats during the sea phase of the exercise.\nThe objectives of the grand exercise were a display united resolve against terrorism and crimes in the maritime domain, contributing towards regional peace and stability and enhancing interoperability between regional and extra-regional navies thereby acting as a bridge.\nThe exercise also helped in building new ties, establishing innovative relationships while strengthening existing ones.\nGwadar port’s strategic location overlooking the Strait of Hormuz and the North Arabian Sea linked with the development of China Pakistan Economic Corridor (CPEC) has also enhanced the importance of the Indian Ocean for Pakistan, China, Afghanistan, and also for the Central Asian states, in the days ahead.\nPakistan has emerged as one of the important stakeholders in the Indian Ocean security framework facing challenges from piracy, maritime terrorist activities, gun running, human and narcotics trafficking.\nPakistan Navy is a firm believer in the concept of having collaborative maritime security had been actively participating in maritime and counter-piracy operations along with other partner navies since 2004.\nPakistan Navy ships maintain a near-permanent presence in vital sea areas in the Indian Ocean Region to contribute towards maintaining good order at sea.\n#PakNavy Multinational Ex AMAN-21 culminated in North Arabian Sea with conduct of Intl Fleet Review followed by spectacular forming up of AMAN Formation comprising PN & foreign warships. President of Islamic Republic of Pakistan, Dr Arif Alvi graced occasion as Chief Guest.(1/4) pic.twitter.com/UsepQETUUz\n— DGPR (Navy) (@dgprPaknavy) February 16, 2021\nThe Chief Guest, Dr Arif Alvi observed various operational maneuvers and drills during the IFR. The Fleet Review also featured an impressive Fly Past by Pakistan Navy, Pakistan Air Force, and participating foreign aircraft, followed by Man and Cheership by participating ships.\n\"Pakistan will ensure that Indian Ocean not to be used for confrontation and exploitation rather to remain centre for the regional peace.\" President Dr. @ArifAlvi@PakistanNavy @nimaisb @WorldPTV pic.twitter.com/2WteqZ51qI\n— The President of Pakistan (@PresOfPakistan) February 16, 2021\nThe Exercise culminated with the participating ships, forming up in traditional `AMAN Formation’ to signify unity and collective resolve.\nThe Chief of the Naval Staff thanked the President for gracing the International Fleet Review with his presence.\nThe Naval Chief said Pakistan Navy would continue to play active role in enhancing regional maritime security individually and in collaboration with partner navies.\nThe navies participating in the multinational maritime exercise AMAN 2021 participated with their naval warships, aircraft, Special Operation Forces and a large number of observers.\nMinister for Maritime Affairs Syed Ali Zaidi, Minister of Defence Production Zobaida Jalal, Chief Minister Sindh Murad Ali Shah, Chairman Joint Chiefs of Staff Committee General Nadeem Raza, Chief of Army Staff General Qamar Javed Bajwa and Chief of Air Staff Air Chief Marshal Mujahid Anwar Khan were also present on the occasion.\nAmbassadors, high commissioners, senior military officers, Defence and Naval Attaches from various countries also witnessed the event.",
  "retrievedAt": "2025-08-11T20:21:58.299Z"
}
