{
  "title": "Maqbool Bhat remembered with renewed commitment to achieve his dream of freedom",
  "link": "https://www.app.com.pk/national/maqbool-bhat-remembered-with-renewed-commitment-to-achieve-his-dream-of-freedom/",
  "date_published": "2021-02-16T06:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):Kashmiri diaspora commemorated the 37th anniversary of the martyrdom of Kashmiri icon Maqbool Butt with a renewed commitment to achieve the hero’s dream: self-determination as prescribed by the United Nations, international law, and moral justice. Since his execution, February 11 has been observed by all Kashmiris as a black day of mourning for the martyr of a brave Kashmiri statesman. This year’s webinar was attended by speakers from the United States and abroad.\nDr. Ghulam Nabi Fai, Secretary General, World Kashmir Awareness Forum said, “11 February is a somber day but at the same time a day of remembrance and a day to revitalize our resolve to be true to the mission of Martyr Maqbool Bhat. Maqbool Bhat’s life has inspired countless Kashmiris to persist in the struggle for self-determination against India’s intransigence.\nHis vision of a free and fair Kashmiri self-determination on its sovereign destiny did not die with his death. He gave his life for the cause because he believed in it with all sincerity and honesty.”\nMaqbool Bhat gave a lesson to the generations to come that it is very hard but only choice to accept martyrdom instead of slavery.\nHis courage demonstrated such savagery would backfire, and intensify the Kashmir resistance. Dr. Fai added, while we must pay rich tributes to the memory of this great martyr, our true tribute will be emancipation of the Kashmiri people from under the Indian brutal occupation and senseless subjugation.\nJaved Rathore, , President of Kashmir Solidarity Council said that this year, the observance featured webinars because of Covid 19 pandemic and prayer meetings around the world to advance the Kashmiri cause of self-determination mandated by international law, and the principles of simple justice.\nJaved Rathore continued: “Indian authorities could jail Maqbool Bhat and silence him by execution but they could not silence his ultimate desire – the struggle for the people of Kashmir. The spirit of Maqbool Bhat is alive. Today, he is an inspiration to millions of Kashmiris and those striving for human rights and human dignity.\nClaire Bidwel, Chairperson, “Let Kashmiris Decide” Scotland,discussed in detilas her initiative to shake the conscience of the world leaders to come to rescue the leader of Kashmiri political resistance movement – Mohammad Yasin Malik. Her signature campaign has already received thousands of responses all over the world.\nAriful Haq Arif, senior most journalist who knew Maqbool Bhat personally when he met him in Karachi, quoted him saying, “We faced every form of torture with the belief that this (new) challenge we are facing will ultimately bring revolution to our thinking.” Arif said that Maqbool Butt was certainly a charismatic leader who gave his today for the betterment of tomorrow. His dastardly death will inspire living Kashmiris for ages.\nDr. Zulfiqar Kazmi, a well-known scholar said that Maqbool Butt was undoubtedly, a selfless leader and we, the people of Kashmir miss him dearly. His dastardly death will inspire living Kashmiris for the ages, just as Reverend Martin Luther King, Jr.’s assassination did in the United States.\nSardar Shoaib Irshad, the organizer of the webinar, quoted Maqbool Bhat Shaheed, “The children of oppressors are provided with all the luxuries and comfort of the world, but the children of resistance leaders are not attracted to these kinds of luxuries and comfort. They get satisfaction from struggling against the system of oppression.”\nDr. Akhlaq Barlas, prominent Kashmir scholar and leader said, Maqbool Butt was hanged by India’s authorities for protesting their illegal and iron-fisted occupation of Kashmir since 1947. Kashmiri diaspora must get united and seek representation from all zones of the State of Jammu & Kashmir.\nMohammad Arshad Shah, (Canada) said, Maqbool Bhat had previously been tortured and inhumanely imprisoned as part of India’s state sponsored terrorism in the disputed territory of Kashmir. We must intensify our activities so that his mission remains alive.\nSardar Naseem Iqbal (England), a well-known community leader, urged everybody to take a leaf from the long history of Kashmir which is full of trials and tribulations. Those who contemplate on the past will ultimately come closer to achieve their objective – the freedom for the people of the State of Jammu & Kashmir.\nSardar Zulfiqar Roshan Khan spoke from Islamabad that the sacrifice of Shaheed Maqbool Bhat will never be wasted. The blood of Kashmiri martyrs brings the goal for freedom and justice nearer.\nSardar Zubair Khan said that the lesson of the martyrdom of Bhat Sahib is that we should be consciously ready to give sacrifices for the cause as was demonstrated by our leader.\nSardar Aftab Roshan Khan said that Maqbool Bhat has given us an important message that we may have to give more sacrifices till the whole nation is liberated.\nTariq Khan, Canada said that the decision of Raja Farooq Haider, the prime minister of Azad Kashmir to announce February 11th a holiday is the right step in the right direction. But on this day, we must highlight the contribution of Maqbool Bhat to our younger generation through organizing seminar, debates and conferences.\nSaleem Qadri from Indian Occupied Kashmir voiced his optimism that the political resistance in Kashmir is alive despite the brutal tactics of Indian Occupation forces. He emphasized that Kashmiri diaspora need to pursue the goal of right of self determination as a United front. United we stand but divided we fall, Saleem Qadri added.\nRaja Liaqat Kiyani, President, Kashmir House, Washington said that people of Azad Kashmir are united in pursuing the mission of Maqbool Bhat irrespective of their party affiliations and political beliefs.\nSardar Zarif Khan, President, Washington Chapter of Kashmir Solidarity Council and the emcee of the event, said Maqbool Butt was undoubtedly, a selfless leader and we, the people of Kashmir miss him dearly. While paying tribute to Shaheed Maqbool Bhat, Zarif said that worldly luxuries meant nothing to Bhat. He always preferred a day of freedom to a life of luxuries without any freedom.\nAt the conclusion of the event, it was demanded that the Government of India return the mortal remains of Shaheed Maqbool Bhat and Shaheed Afzal Guru to their relatives in Kashmir. It has been a sacrilege to have kept them in India for thirty-seven callous years respectively.\nOther speakers included: Hamid Malik; Shakeel Ahmed Janjua ; Sajjad Baloch; Zahid Khan; Aftab Khan; Azmat Khan; Mujeeb Kazi ; Raheel Shaikh",
  "retrievedAt": "2025-08-11T20:21:52.283Z"
}
