{
  "title": "Pakistan keen to promote economic diplomacy with Egypt: FM",
  "link": "https://www.app.com.pk/national/pakistan-keen-to-promote-economic-diplomacy-with-egypt-fm/",
  "date_published": "2021-02-16T03:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Tuesday said Pakistan was keen to promote economic diplomacy with Egypt and other African countries.\nIn a video message before departing for Egypt on a two-day visit, the Foreign Minister said strengthening trade ties with African region was one of the government’s top priorities.\nTerming Egypt the ‘gateway to Africa’, he said it was also an important country in the Muslim world.\nQureshi said there existed immense potential for the development of economic cooperation between Pakistan and Egypt.\nDuring the visit, he said, he would hold in-depth discussions with the Egyptian Foreign Minister on bilateral relations.\nQureshi said he would also visit Al-Azhar University, the cradle of knowledge, and expressed desire to benefit from the experiences in the field of education.\nThe Foreign Minister said he would meet the business community in Egypt and also interact with media persons.\nThe visit of the Foreign Minister is taking place in the backdrop of the meetings between Prime Minister Imran Khan and President Abdel Fattah Al Sisi; first, on the sidelines of Organization of Islamic Cooperation (OIC) Makkah Summit in 2019, and then on the sidelines of the 74th Session of the UN General Assembly in New York in 2019.\nDuring these meetings, the two leaders agreed to further strengthen bilateral cooperation and enhance high-level exchanges.\nMore than 40 agreements signed between the two sides in diverse fields provide a firm basis for enhanced cooperation.\nLast year, the Prime Minister also had a telephone conversation with Egyptian President regarding his ‘Global Initiative on Debt Relief’ for developing countries, which was supported by Egypt.\nThe Foreign Office said: “Pakistan and Egypt enjoy close fraternal relations firmly anchored on common faith, culture and values. The two countries have similar perceptions on a range of regional and global issues.”\nBilateral cooperation is advanced through strong institutional mechanisms, including the Joint Ministerial Commission, Annual Bilateral Consultations, and Joint Business Council.\nPakistan and Egypt also work closely in the multilateral arena, in particular the United Nations, OIC and the Non-Aligned Movement (NAM).\nEgypt is an important country in the Middle East and Africa. Egypt plays a key role in the Middle East, while its deep linkages with the African Continent make it a gateway to Africa.\n“In line with Pakistan’s desire to forge stronger ties with the Islamic world, as well as the government’s ‘Engage Africa” initiative, Pakistan accords high importance to its partnership with Egypt,” the FO statement added.",
  "retrievedAt": "2025-08-11T20:21:52.442Z"
}
