{
  "title": "CM Murad’s ‘harsh’ words draw ire of teachers - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Teachers held protests at several public sector universities on Friday, condemning what they described as “chief minister’s harsh speech” made a day earlier at a programme.\n\nThe remarks also attracted severe criticism from the Pakistan chapter of the Federation of All Pakistan Universities Academic Staff Association (Fapuasa) which announced its support to the ongoing strike of its Sindh chapter against the appointment of bureaucrats as heads of universities and hiring of teachers on a contractual basis.\n\nAt the programme, Sindh Chief Minister Murad Ali Shah had warned vice chancellors (VCs) “of universities experiencing protests” to stop them or get ready to be held “accountable”.\n\nHe had also justified the government move of changing the criteria for appointment of VCs while accusing some of them of sexual harassment and corruption, criticising the Higher Education Commission (HEC) for backing the protesting teachers’ demand.\n\n“There is a public outcry against his remarks. We are deeply hurt and disappointed. The chief minister is a highly educated individual, always showing great regard to his friend who heads a prominent public sector university. This was not expected of him,” regretted Dr Mohsin Ali heading the Karachi University Teachers’ Society.\n\nOn Friday, the teachers vented out their disapproval of those remarks and held demonstrations at different institutions, including Karachi University; Sindh Madressatul Islam University, Karachi; Sindh University, Jamshoro; Sindh Agricultural University, Tandojam; Mehran University of Engineering and Technology, Tandojam, and its Khairpur campus; Govt College University, Hyderabad; Shah Abdul Latif University, Khairpur, and Sukkur-IBA University.\n\nIn a statement, Fapuasa Pakistan chapter stated that it fully supported the ongoing strike by the Fapuasa Sindh, which was a legitimate protest against “Sindh government’s illogical and detrimental decision”.\n\n“We denounce the statement made by the chief minister, Sindh, in which he justified the change (in appointment criteria of vice chancellors) by alleging moral and financial corruption among vice chancellors,” Fapuasa Pakistan President Dr Amjad Abbas Magsi said.\n\nThe chief minister’s remarks, he said, not only undermined the dignity of the vice chancellors but also disregarded the role of the HEC tasked with setting the criteria for the appointment of the VCs and faculty members.\n\nThe association emphasised that the HEC’s role remains valid under the Constitution and the NFC (National Finance Commission) Award meetings, as the HEC hadn’t been fully dissolved.\n\nIt called upon the provincial government to take appropriate punitive action against a vice chancellor if he was found in immoral conduct and financial mismanagement.\n\n“We call upon the chief minister, Sindh, to act responsibly and uphold the sanctity of academic institutions by restoring the original criteria for appointment of vice chancellors,” it said.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:00:04.901Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887500/cm-murads-harsh-words-draw-ire-of-teachers",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:50.000Z"
}
