{
  "title": "Changes to cybercrime law land in Senate amid outcry - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Joint session passes four bills in 11 minutes, as many deferred\n• PTI accuses PPP of hypocrisy, slams its support for ‘controversial legislation’\n\nISLAMABAD: Amid a strong protest by the PTI-led opposition and a walkout by journalists from the press gallery, a controversial bill seeking to amend the Prevention of Electronic Crimes Act (Peca) was presented in the Senate on Friday.\n\nIn total, four bills were tabled in the House and referred to standing committees following the suspension of the question hour on a motion moved by PPP Parliamentary Leader Sherry Rehman, citing lawmakers’ travel plans to their constituencies.\n\nHowever, Leader of the Opposition Senator Shibli Faraz criticised the suspension of the question hour, calling it a frivolous excuse. He accused the PPP of hypocrisy and slammed its support for what he termed “controversial legislation”.\n\nMr Faraz particularly called out the PPP’s role in advancing the Peca amendment bill, saying: “They have supported all controversial laws in recent past, whether it was the 26th constitutional amendment or this yet-to-be-passed Peca amendment.”\n\nPTI lawmakers staged a noisy protest during the brief Senate session, which lasted just over 15 minutes. Chanting slogans like “Black laws unacceptable,” “Peca amendments unacceptable,” and “Free Imran Khan,” PTI members gathered near the chairman’s podium to express their dissent.\n\nAlongside the Peca amendment bill, the session also saw the introduction of the Digital Nation Pakistan Bill, the Pakistan Telecommunication (Re-Organi­sation) (Amendment) Bill, and the National Commission for Minorities Bill. All four bills were referred to the relevant standing committees by Senate Deputy Chairman Syedaal Khan.\n\nLaw Minister Azam Nazeer Tarar, who introduced the bills, criticised the opposition for disrupting proceedings, chiding it for even opposing the bill on the minorities commission.\n\n“Instead of opposing these bills without understanding, the opposition should participate in committee discussions to provide their input,” he said.\n\nHe said the PTI’s sole objective was to somehow secure the release of their incarcerated leader. “If you commit a crime, you will have to go behind bars,” he remarked.\n\nSoon after the bills were referred to the standing committees, the Senate deputy chairman adjourned the house to meet again on Monday, ignoring two calling-attention notices on the agenda, which included one by the leader of the opposition.\n\nJoint session\n\nEarlier, lawmakers passed four bills and deferred another four bills within the span of 11 minutes during the joint sitting of the parliament amid a noisy protest by the opposition members belonging to the PTI.\n\nIgnoring the opposition’s protest, Speaker Ayaz Sadiq hurriedly put the bills before the house for passage. All these bills had already been passed by the two houses of the parliament, but they had been returned by the president for various reasons.\n\nThe bills passed during the joint sitting are the Trade Organisation (Amendment) Bill 2021, the Imports and Exports Control (Amendment) Bill 2023, the National Institute of Technology Bill 2024, and the National Excellence Institute Bill 2024. The speaker then adjourned the joint session till Feb 12.\n\nOpposition, journalists protest\n\nAfter the adjournment of the session, the opposition PTI members staged a protest outside the Parliament House, condemning the government over the passage of controversial bills about social media and demanding the release of Imran Khan.\n\nSpeaking on the occasion, PTI leaders termed Peca as a “black law against freedom of expression”.\n\nThe journalists, after staging a walkout from the Senate’s press, staged a sit-in close to Gate No. 1 of the Parliament House, which was also joined by the opposition lawmakers.\n\nThe Rawalpindi-Islamabad Union of Journalists (RIUJ) also rejected the amendments, announcing plans to launch a campaign against the bill. In a joint statement, RIUJ President Tariq Usmani and other office-bearers criticised the government for using measures to combat fake news as a cover to impose censorship.\n\nIt said the government wanted to conceal facts, hide the truth and impose stringent censorship on media against the spirit of Article 19 of the Consti­tution, which guarantees freedom of expression.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67940e5188471.jpg",
  "retrievedAt": "2025-08-26T07:56:29.668Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887489/changes-to-cybercrime-law-land-in-senate-amid-outcry",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:14.000Z"
}
