{
  "title": "Djokovic retirement rocks Australian Open, Zverev and Sinner book title clash - Sport - DAWN.COM",
  "author": null,
  "content": "MELBOURNE: Novak Djokovic retired injured after losing the opening set of his clash with Alexander Zverev on Friday, sending the German to a first Australian Open final where he will take on defending champion Jannik Sinner for a maiden Grand Slam title.\n\nSinner later overcame cramp to book an intriguing battle for the Norman Brookes Challenge Cup by beating American Ben Shelton 7-6(2), 6-2, 6-2 to reach his second successive final in Melbourne and third at hardcourt majors after his US Open triumph.\n\n“I’m just happy to put myself in this position again, to play for a big trophy again,” Sinner told reporters.\n\n“At the end of the day, Grand Slams are the most important tournaments we have in our sport ... Finals are a bit different, but very exciting days.\n\n“When you arrive on Sunday, it doesn’t really matter how big the tournament is, but when you play there’s a nice feeling. Two men standing. You just try to play the best tennis possible.”\n\nWhile the Italian guns for a third Grand Slam title of his sparkling career, Djokovic will stay locked with Margaret Court on 24 major trophies until at least the French Open, as he quit against Zverev after losing the first set 7-6(5).\n\nThere were doubts about Djokovic’s left thigh following his taxing quarter-final victory over Carlos Alcaraz when he took a lengthy medical timeout after a high-octane opening set against the Spaniard.\n\nThe 37-year-old Serb skipped a training session on the eve of the semi-final and entered Rod Laver Arena for the afternoon match with the thigh strapped.\n\nBut there was little indication that he was struggling until late in the set when he began trudging slowly between points and muttering in frustration at his players’ box.\n\nHe gave up the set by hammering a regulation forehand volley into the net and promptly walked to Zverev’s side to shake hands and embrace the German, leaving the crowd gasping.\n\nWith a rueful expression, Djokovic held two thumbs up and clapped at the terraces but there was a round of boos as the 10-times champion made his exit.\n\nDjokovic later said he had been trying to nurse a torn muscle and he was in increasing pain as the set wore on.\n\n“I knew even if I won the first set, that it’s going to be a huge uphill battle for me to stay physically fit enough to stay with him in the rallies, you know, for another God knows what, two, three, four hours,” the Serb told reporters.\n\n“I don’t think I had that, unfortunately, today in the tank.”\n\n‘SHOW SOME RESPECT’\n\nZverev said he was also surprised by Djokovic’s retirement but noted the Serb’s movement had fallen away in the tiebreak.\n\n“I thought it was a high level first set,” he added.\n\n“Of course there are some difficulties ... in the tiebreak he was not moving. I did see him struggle a bit more.”\n\nZverev also admonished sections of the crowd for jeering Djokovic, who has dominated the year’s opening Grand Slam since winning his first trophy at Melbourne Park in 2008.\n\n“The very first thing I want to say is, please guys, don’t boo a player when he goes out with injury,” Zverev said.\n\n“I know everyone paid for tickets and everyone wants to see hopefully a great five-set match.\n\n“But ... Djokovic is someone who has given this sport for the past 20 years absolutely everything of his life.\n\n“He has won this tournament with an abdominal tear, won this tournament with a hamstring injury. So please show some respect.”\n\nThe truncated semi-final win is a huge boost for Zverev’s hopes of finally winning a major, having missed out to Alcaraz in last year’s French Open final and surrendering a two-set lead before losing to Dominic Thiem in the 2020 US Open decider.\n\nThe rangy 27-year-old has been tipped for Grand Slam success since his teen years but was often thwarted by the likes of Djokovic and the now-retired Roger Federer and Rafa Nadal.\n\nZverev was strong on serve on Friday and appeared content to wage attritional rallies with the Serb while biding his time for chances.\n\nThough failing to convert all five break points he had over Djokovic, Zverev was rock-solid in the tiebreak.\n\nHe thrashed a forehand down the line to bring up set point with a 24th winner before Djokovic made his stunning exit, a year after being shocked by Sinner in the semi-finals.\n\nSinner came under fire from Shelton in a tight opening set in which he battled from 2-0 down and then saved two set points at 6-5 to clinch it in the tiebreak, before blowing away the 21st seed in the next to tighten his grip.\n\nThe top seed began experiencing problems in his left leg and needed treatment in a tense third set, but Shelton was unable to capitalise and allowed Sinner to run away with the match with some extraordinary winners.\n\nSinner said that there would be no favourites when he plays Zverev on Sunday.\n\n“It’s going to be a tough match for both. It’s going to be physical. Then we’ll see,” he said.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679422895a6a7.gif",
  "retrievedAt": "2025-08-26T07:56:09.001Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887510/djokovic-retirement-rocks-australian-open-zverev-and-sinner-book-title-clash",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:39.000Z"
}
