{
  "title": "Stalled talks - Newspaper - DAWN.COM",
  "author": null,
  "content": "ONE step forward, two steps back. That had been the progress so far in long-awaited negotiations between the opposition PTI and the ruling coalition, but all talks have now been called off by the PTI’s incarcerated founder after a ‘raid’ on an allied lawmaker’s residence.\n\nFollowing the raid, former prime minister Imran Khan decided on Thursday that the government was being ‘non-cooperative’ and, therefore, there was little to be gained from continuing negotiations with it. One wonders if he was a tad impatient in making that call.\n\nAfter all, his party had previously announced that talks would be given a chance at least till the end of January, after which it would take decisions regarding its next steps forward. The government, too, had promised to respond to the PTI’s written demands by Jan 28 and had repeatedly asked the party not to abandon the committee set up for parleys between the two political camps.\n\nIt was, no doubt, a poor play by the authorities to sanction a raid on the residence of Sunni Ittehad Council Chairman Hamid Raza, who also serves as the PTI’s spokesperson for the talks committee. The PTI chief saw it as an attack on the negotiating committee, noting that “negotiations based on ill intentions cannot succeed.”\n\nHowever, Mr Khan should not have let the incident distract him from the bigger picture. Any negotiation with the government was never going to be easy, given the chasm between the two camps. His party has also been aware that there are spoilers who were unhappy with the process from the start. It would have been wiser, therefore, not to react to the provocation. However bitter their differences, both parties need something from each other if they hope to keep their share in the country’s political future. They should have remained committed to the process.\n\nPerhaps there is an opportunity yet to salvage the talks. Though he has ended negotiations, the PTI founder still wants judicial commissions to probe the events of May 9 and Nov 26. Given the government’s confidence and conviction regarding its position, it does not make sense for it to delay the matter any further. It should let independent arbitrators investigate the facts so that these chapters may be closed and the country can move on.\n\nThere is a dire need for all national leaders to act sensibly if they wish the best for the country’s future. Much damage has been done by their inability to resolve their differences through political channels, and yet it seems that the temptation to keep looking to the ‘third umpire’ has not yet gone. A mutually acceptable solution must be found to return executive power back to the people, where it rightfully belongs. The status quo is not sustainable.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:55:52.505Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887530",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:03:39.000Z"
}
