{
  "title": "PHC directs election commission to decide Senate polls issue in 60 days - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has directed Election Commission of Pakistan (ECP) to decide through a clear order within 60 days the issue of holding Senate polls in Khyber Pakhtunkhwa.\n\nA bench consisting of Justice Syed Mohammad Attique Shah and Justice Sahibzada Asadullah issued the order while disposing of a petition filed by leader of Pakistan Tehreek-i-Insaf and former senator Azam Khan Swati seeking directives for the ECP to hold Senate polls in the province.\n\nMr Swati had requested the court to declare as illegal two orders of the ECP of March 26 and April 2, 2024, through which the commission had first hinted at postponing the Senate polls in the province if oath was not administered to opposition MPAs-elect on reserved seats and subsequently ordering the postponement of the polls in the province.\n\nOn March 28, the ECP declared in response to the applications of five women MPAs-elect of the opposition parties in the province that if the speaker of the provincial assembly fails to comply with the directions of the high court to administer oaths to the lawmakers elected to reserved seats, it [the commission] will be constrained to postpone the Senate election in the province until the administration of oaths to the applicants.\n\nDisposes of Azam Swati’s plea against postponing polls in province\n\nSubsequently on April 2, 2024, when Senate elections were held in other provinces and Islamabad, the commission announced postponing the Senate polls in the KP till administering oath to the MPAs-elect on reserved seats.\n\n“Whatever the case may be, we without going into nitty gritty, in the peculiar facts and circumstances of the case and in the larger interest of justice, deem it appropriate to send the matter to the worthy Election Commission of Pakistan to freshly decide the issue qua holding of the Senate Elections in the Province of Khyber Pakhtunkhwa, in accordance with law through a speaking order, within sixty working days as much water has flown under the bridge since 02.04.2024.\n\n“With these observations, this writ petition is disposed of in the above terms,” the bench said in its six-page judgment.\n\nAdvocate Ali Zaman appeared for the petitioner stating that his client was a contesting candidate for Senate Elections 2024 on general as well as technocrat seats.\n\nHe stated that instead of holding the polls in KP the ECP passed the impugned order on March 26 and April 2, 2024 on application of five of females who were at that time declared elected on seats reserved for women.\n\nHe pointed out that Supreme Court of Pakistan had set to rest on Sept 14, 2024, the issue of reserved seats for women and non-Muslims by setting aside the order of the ECP of awarding seats to candidates of other parties and a judgment of the PHC in that regard.\n\nHe contended that after the apex court judgment no justification was left with the ECP to further delay the holding of Senate polls in the KP.\n\nHe contended that that non-holding of Senate polls here was discriminatory and an injustice to Khyber Pakhtunkhwa.\n\nMr Zaman stated that 11 Senate seats from this province had been lying vacant as the ECP had not been conducting polls on it.\n\nThe bench in one of previous hearings in December had directed the respondents to place the matter before meeting of the ECP for its decision on the matter.\n\nThe bench, which heard the petition on Jan 16, was informed by the special secretary (law) of the ECP, Mohammad Arshad, that due to pendency of the review petition of the ECP against the apex court order of Sept 14, 2024, in respect to dispute of allocation of reserved seats for women and non-Muslims, the Senate elections in the province could not be held.\n\nThe bench ruled that the special secretary couldn’t submit any plausible reason about deciding the matter/controversy by the commission.\n\nThe respondents in the petition were the ECP through its secretary and five candidates, who were later declared MPAs-elect on reserved seats and on whose applications the commission postponed the polls.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:55:52.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887473/phc-directs-election-commission-to-decide-senate-polls-issue-in-60-days",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:03:10.000Z"
}
