{
  "title": "PPP demands local govt polls, relief for Balochistan flood victims - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakist­­an Peoples Party (PPP) has demanded that the government hold local government polls in Punjab and Islamabad, provide relief to Balochistan’s flood-affected people and farmers.\n\nThe party made these dem­ands in its Central Executive Committee (CEC) meeting, presided over by its chairman Bilawal Bhutto-Zardari, on Friday.\n\nThe CEC meeting was held amid Mr Bilawal’s reservations that the government did not take PPP on board in decision making and backed out its promises made with the party.\n\nAccording to the PPP media wing, the CEC demanded immediate local government elections in Punjab and Islamabad as per the agreement between the PPP and the government.\n\nBilawal claims Trump has invited him to breakfast, says official meetings with US authorities not scheduled during his Washington tour\n\nA resolution passed by the CEC voiced concern over the construction of controversial canals, demanded the immediate convening of the Council of Common Interests (CCI) me­­­­eting, which has been pen­ding for 11 months, and called for the controversial canal issue to be urgently raised in the CCI.\n\nThe resolution expressed concern over anti-worker measures in institutions such as PWD, Karachi Dock Labor Board, Utility Stores, Pasco, Genco, NFC, and others.\n\nIt criticised the governm­e­nt’s agricultural policies, expr­essing concern over the lack of any assistance for farmers.\n\nThe meeting demanded the immediate release of funds by the federal government for the rehabilitation of flood-affec­ted people in Balochistan.\n\nAtrocities in held Kashmir\n\nThe PPP CEC also condemned Indian oppression and atrocities in occupied Jammu and Kashmir and demanded that Kashmiris be granted the right to self-deter-mination in accordance with United Nations resolutions.\n\nThe party resolution called for serious measures to implement the demands of the people of Gilgit-Baltistan regarding ownership rights and self-governance.\n\nIt appreciated the efforts of the Governor of Khy­ber Pakhtunkhwa, Faisal Kar­im Kundi, in convening a multiparty conference, endorsed its proposals and demanded that the provincial government of Khyber Pakh­tunkhwa and the federal government implement all recommendations of the conference.\n\nThe resolution expressed deep concern over the tense situation in Kurram and called for the immediate restoration of peace, along with the urgent reopening of routes for the delivery of relief goods.\n\nBreakfast in Washington\n\nEarlier, while talking to mediapersons, PPP chairman Bilawal Bhutto-Zardari said he was invited to a breakfast by US President Donald Trump. He said he would ‘definitely attend’ it as his family and late mother Benazir Bhutto used to attend the event.\n\n“I don’t have an official position, so I do not have any programme to hold official meetings with US authorities. I intend to meet Shaheed Mohtarma Benazir Bhutto’s friends,” Mr Bhutto-Zardari added.\n\nResponding to a question, the former foreign minister said Pakistan’s foreign policy was intact, adding that the nuclear and missile technology were gifts to the Pakistani nation from the PPP founder Zulfikar Ali Bhutto and his mother Benazir Bhutto.\n\nAsked if the PPP was planning to join the government in near future, he answered in the negative.\n\nPPP ‘opposes’ Peca law\n\nRegarding the Peca Ordinance, he said that it was on record that the PPP opposed it at the time of PTI’s government.\n\n“The PPP continuously remained engaged with the government and brought several amendments, which have improved the law more than before,” he added.\n\n“It would have been better for this legislation that journalists’ organisations should have been consulted to forge a consensus, and it would have been better to have consulted the representative of media and digital media at the time when the legislation was at the committee level,” he said.\n\nRegarding the Supreme Court’s take on the 26th Amendment controversy, the PPP chairman said, “Only parliament has the power to roll back the 26th Amendment, and no one will accept it if any other institution tries “the Supreme Court, whether a regular bench or the constitutional bench, will have to accept and follow the Constitution,” he added.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:59:49.426Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887544/ppp-demands-local-govt-polls-relief-for-balochistan-flood-victims",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:27.000Z"
}
