{
  "title": "Registration for Ramazan package open till Feb 15: Punjab govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government announced on Friday that those seeking assistance under the Nighaban Ramazan package should get themselves registered by Feb 15.\n\nIt also announced that registration with the Punjab Socioeconomic Registry (PSER) is a prerequisite for availing the package, for which people can apply from home through online portal — pser.punjab.gov.pk.\n\nMeanwhile, presiding over a meeting here on Friday, Chief Minister Maryam Nawaz directed the officials concerned to ensure transparency in the provision of the package meant for deserving families.\n\n“Nighaban Ramzan Package is a right of the poor, and a duty of the government. People should get their right with respect and dignity. People should not be made to stand in queues to get the package,” she said.\n\nThe CM also reviewed various recommendations regarding the package.\n\nMoU SIGNED: A memorandum of understanding (MoU) was signed between Beijing AI Force Tech and Daewoo Pakistan for purchase of AI-based machinery for solid waste management at a ceremony held at the CM office here on Friday.\n\nThe MoU was signed by AI Force Tech CEO Dr Han Wei and Daewoo Pakistan’s Muhammad Khalid.\n\nLater, during a meeting of the CM with a delegation led by Dr Wei, it was agreed to set up an assembling and manufacturing plant for e-agriculture mechanisation in Punjab.\n\nThe CM was told that China’s AI Force Tech company will set up a plant to manufacture robotic agricultural equipment in the province.\n\nThe meeting also reviewed the usage of transportation and harvesting robots for the agriculture sector.\n\nModern automated AI technology will also be promoted in the solid waste management sector in Punjab, the meeting was told.\n\nIt was informed that the Chinese company will develop an e-mechanised model farm on the outskirts of Lahore.\n\nThe 17-acre model farm will use electric tractors, harvesters, land levelers and other machinery. The company will install a solar energy system at the farm’s greenhouse.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:00:05.970Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887447/registration-for-ramazan-package-open-till-feb-15-punjab-govt",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:58.000Z"
}
