{
  "title": "Chinese nationals move SHC against Sindh police harassment - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Court issues notices to Ministry of Foreign Affairs and others on a plea filed by six foreigners\n• The foreign investors say ‘disturbing incidents’ compelling them to leave the country\n\nKARACHI: A constitutional bench of the Sindh High Court on Friday issued notices to the Ministry of Foreign Affairs and others on a petition filed by six Chinese nationals against harassment and restrictions on their movement in the name of “security issues”.\n\nThe two-judge bench comprising Justice Mohammad Karim Khan Agha and Justice Adnan-ul-Karim Memon also put the Chinese Embassy in Pakistan and its consulate in Karachi, and federal and provincial law officers on notice.\n\nMr Xu Hui, Ms Deng Huan and four other Chinese nationals have petitioned the SHC through their counsel Peer Rehman Mehsud and submitted that they along with thousands of other Chinese citizens came here after fulfilling all required legal formalities and invested a significant amount of money and resources in various business ventures and sectors in Pakistan.\n\nThey maintained that it was the responsibility of the respondents concerned to protect and provide a secure environment to all foreign nationals legally residing and investing in the country, including the petitioners.\n\nThe petitioners said that the Sindh police had engaged in repeated acts of harassment over the last six to seven months, including unjustifiably restricting movements of Chinese nationals in Karachi and Sindh, particularly while they had also been subjected to unjustified detainments within their residences on the pretext of “security issues” without any clear legal grounds or specific incidents that warranted such actions.\n\nThey also contended that the policemen, deployed at petitioners’ residences, had literally locked them in their houses and restricted their movement within the boundaries of their houses on the directions of their high-ups and when the petitioners bowed to their illegal demands of paying Rs30,000 to Rs50,000 then they used to let them go.\n\nThe petitioners further said that recently the officials of the Sukhan police station had sealed seven industrial units of some other Chinese nationals without any prior notice, due to “security reasons”, who were now preparing for investing in Lahore or leaving the country at all, in view of the said unjustified restrictions.\n\nThey also claimed that in fact, their miseries started from arriving at the airport as the officials concerned did not let them enter the country without having been bribed despite them having all legally required documentation.\n\nIn the second phase the petitioners had to wait for hours under directions of these officials as they could not leave for their houses without bulletproof vehicles for which they themselves had to pay handsome amounts, they maintained.\n\nThey further blamed the police for allegedly throwing stones at Chinese nationals’ cars, smashing their rear screens and contended that the deployed policemen seemed highly indecent and not professionally trained since there were complaints against them for disturbing privacy of the petitioners and demanding “tip” ranging from Rs15,000 to Rs50,000.\n\nThe petitioners argued that they were also not allowed to lodge complaints/FIRs against such offences. They said that an incident of theft of Rs2 million had taken place at the house of one of the petitioners in October 2024, but the police station concerned had refused to register an FIR while the police detained the petitioners’ translators without any lawful justification.\n\nThey also submitted that voices had been raised before for redressal of their grievances, but no positive response had so far been given by the respondents.\n\nThey maintained that alleged harassment, unlawful detainments, unjustified restrictions on movement and even taking illegal gratifications directly infringed upon the petitioners’ universally recognised fundamental rights which were also guaranteed under the Constitution of Pakistan. Such incidents had severely impacted the petitioners’ ability to conduct businesses and engage in essential professional and personal activities, they added.\n\nThey asked the court to declare alleged detention, harassment and restriction on their movement illegal and unconstitutional as well as issue directives to the relevant authorities to devise and implement appropriate protective measures to ensure the lawful movement and security of Chinese nationals residing/working here in line with Pakistan’s commitment to investor protection and international obligations.\n\nThe petitioners further sought directions for respondents to conduct a high-level joint inquiry against the officials/personnel concerned involved in such illegal acts and take strict and exemplary actions against the culprits in accordance with law.\n\nThey also cited the chief secretary of Sindh, provincial home secretary, inspector general of police of Sindh and various other senior police officers as respondents.\n\nAfter a preliminary hearing, the bench issued notices to the three respondents as well as the deputy attorney general and advocate general of Sindh for a date to be fixed after four weeks.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:00:21.960Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887503/chinese-nationals-move-shc-against-sindh-police-harassment",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:50.000Z"
}
