{
  "title": "West Indies earn slender lead over Pakistan in 2nd Multan Test after Noman hat trick - Sport - DAWN.COM",
  "author": null,
  "content": "The West Indies gained a slender nine-run lead over Pakistan on Saturday as spinners dominated the opening day of the second Test in Multan, with Noman Ali achieving a hat trick for the home side.\n\nJomel Warrican took 4-43 and Gudakesh Motie 3-49 as Pakistan were bowled out for 154 at the close, replying to the West Indian first innings total of 163.\n\nLeft-armer Noman became the first Pakistan spinner to register a Test hat trick during his 6-41 as the West Indies were bowled out at the stroke of lunch in 41.1 overs, having won the toss and batted.\n\nBut the visitors hit back with a blitz of their own as 16 wickets fell to spinners — the most by that type of bowling on the opening day of a Test.\n\nThe previous record was 14 between England and South Africa at Leeds in 1907.\n\nOnly Mohammad Rizwan (49) and Saud Shakeel (32) batted with confidence for the home side, adding 68 for the fifth wicket before Pakistan slumped from 119-4 to 154 all out —losing the last six wickets for 35 runs.\n\nFast bowler Kemar Roach dismissed openers Muhammad Hurraira (nine) and Shan Masood (15), while Motie sent back Babar Azam (one) and Kamran Ghulam (16) to leave Pakistan at 51-4.\n\nIn the post-tea session, Shakeel was smartly caught in the deep by Roach — who hurt his groin but completed the catch — while Rizwan was stumped, both falling to Warrican.\n\nMotie had Salman Agha for nine while the last man Kashif Ali was run out without scoring.\n\nEarlier, the West Indies were left reeling at 7-38 with Sajid Khan 2-64 and Noman doing the damage.\n\nIt could have been worse for the tourists had Motie who top scored with a career-best 55 — not added an invaluable 68 runs for the last wicket with Warrican, who scored 36 not out with two sixes.\n\nMotie also added 41 for the ninth wicket with Roach (25) to delay the lunch break before Noman grabbed the last two wickets for his eighth five-wicket haul in an innings.\n\nPakistan employed the same spin-heavy tactics which earned them a 127-run win in the first Test — also in Multan — with the ball turning from the first over.\n\nNoman came on to bowl as the first change, and trapped West Indian skipper Kraigg Brathwaite leg before for nine to spark a collapse which saw the tourists slump from 32-2 to 38-8 off just 14 deliveries.\n\nNoman dismissed Justin Greaves for one, then Tevin Imlach and Kevin Sinclair off successive deliveries to become the fifth Pakistan bowler to grab a Test hat trick.\n\nFast bowlers Wasim Akram (two hat tricks against Sri Lanka in 1999), Abdul Razzaq (against Sri Lanka in 2000), Mohammad Sami (also against Sri Lanka, in 2002), and Naseem Shah (against Bangladesh in 2020) achieved the feat for Pakistan previously.\n\nOff-spinner Sajid dismissed debutant Amir Jangoo and Alick Athanaze — both without scoring — while Abrar Ahmed accounted for Kavem Hodge for 21.\n\nDebutant pacer Kashif had Mikyle Louis for four in his first over.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/25180034ebd9a98.jpg",
  "retrievedAt": "2025-08-26T07:55:49.801Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887581/west-indies-earn-slender-lead-over-pakistan-in-2nd-multan-test-after-noman-hat-trick",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T05:56:03.000Z"
}
