{
  "title": "242m students’ schooling disrupted by climate crises, Unicef says - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Over 242 million students in 85 countries had their schooling disrupted by extreme climate events last year, including heatwaves, tropical cyclones, storms, floods, and droughts, exacerbating an existing learning crisis, according to a Unicef analysis released on Friday.\n\nThe report finds for the first time, Learning Interrupted: Global Snapshot of Climate-Related School Disruptions in 2024 — released on International Day of Education — examines climate hazards that resulted in either school closures or the significant interruption of school timetables, and the subsequent impact on children from pre-primary to upper secondary level.\n\nAccording to the analysis, South Asia was the most affected region with 128 million students facing climate-related school disruptions last year, while in East Asia and the Pacific, 50 million students schooling was affected.\n\nEl Nino continued to have a devastating impact on Africa, with frequent heavy rainfall and floods in East Africa, and severe drought in parts of Southern Africa.\n\n74pc of affected pupils hailed from lower-middle income countries\n\nRising temperatures, storms, floods, and other climate hazards can damage school infrastructure and supplies, hamper routes to school, lead to unsafe learning conditions, and impact students’ concentration, memory, and mental and physical health.\n\nIn fragile contexts, prolonged school closures make it less likely for students to return to the classroom and place them at heightened risk of child marriage and child labour.\n\nGirls pay dearly\n\nEvidence shows that girls are often disproportionately affected, facing increased risks of dropping out of school and gender-based violence during and after disasters.\n\nGlobally, education systems were already failing millions of children. A lack of trained teachers, overcrowded classrooms, and differences in the quality of and access to education have long been creating a learning crisis that climate hazards are exacerbating.\n\nThe analysis shows almost 74 per cent of affected students last year were in low and lower-middle income countries, but no region was spared.\n\nTorrential rains and floods hit Italy in September, disrupting schooling for over 900,000 students, as well as Spain in October, halting classes for 13,000 children.\n\nThe report notes that schools and education systems are largely ill-equipped to protect students from these impacts, as climate-centred finance investments in education remain strikingly low, and global data on school disruptions due to climate hazards is limited.\n\nPublished in Dawn, January 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:14:28.450Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887554/242m-students-schooling-disrupted-by-climate-crises-unicef-says",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T02:02:45.000Z"
}
