{
  "title": "Am I being censored? Some US TikTok users say app feels different after ban lifted - World - DAWN.COM",
  "author": null,
  "content": "US TikTok users who once saw the app as a haven for free speech say they see signs of censorship after the platform, which is owned by China’s ByteDance, was revived by an executive order from President Donald Trump.\n\nTikTok users are noting a difference in the short-video app following its revival after going dark on Saturday under a new law — enacted over US national security concerns during the Biden administration with bipartisan support — that requires it to be sold to a US buyer.\n\nTrump has vowed to find a solution to the ban, with several bidders in the mix, including people with close relationships to the new Republican president.\n\nUsers say they are seeing fewer live streams, and some activity is being removed or flagged at higher rates for violating community guidelines, including for behaviour that was previously permitted.\n\n“Our policies and algorithms did not change over the weekend,” TikTok said in a statement to Reuters. “We are working hard to restore our US operations back to normal and expect some temporary instability as we restore our services, which could impact TikTok features or users’ access to the app.”\n\nBut some users said they now see more content moderation, like limited search results, as well as warnings about misinformation and prompts for users to check their sources.\n\nSome claimed TikTok was striking comments that used phrases like “Free Palestine” and “Free Luigi,” a reference to Luigi Mangione, who is accused of killing a UnitedHealth executive, which had been previously allowed.\n\nTikTok said it does not allow content that promotes violent or hateful individuals on the platform.\n\nOn Monday, Trump signed an executive order that he said aims to restore freedom of speech and end censorship, referring specifically to social media platforms.\n\nContent creator, comedian and veteran Pat Loller, 36, said a satirical video he created in response to billionaire Elon Musk’s hand gesture at an inauguration event that appeared to some as a Nazi salute was first tagged as misinformation. Loller was then limited in how widely he could share the video, which garnered over a million views.\n\n“I’ve never seen this before, and it is still there. It says ‘sharing is limited to one chat at a time,’” said Loller, who has 1.3 million followers.\n\nTrump on Tuesday said that he was open to Musk, who is a close ally of the president and helping oversee his new initiative on government efficiency, buying TikTok, if he wanted to do so.\n\nTikTok user Lisa Cline said on Meta’s Threads that she was having issues posting a video to TikTok criticising Trump.\n\n“I tried to post this six times to TikTok and it wouldn’t let me because of censorship, here’s (to) hoping it works here,” Cline said. The video referenced Trump’s response to Episcopal Bishop Mariann Edgar Budde after she asked him, at an inaugural prayer service at Washington’s National Cathedral, to show mercy on people who are “scared.”\n\nDanisha Carter, 27, said her account, which has 2 million followers, was permanently suspended shortly after TikTok went dark on Saturday. She was told it was due to “multiple policy violations” when she tried to log in after the ban was lifted.\n\n“This has been very politically targeted,” said Carter, a political and social commentator, who said TikTok won’t explain its decision, which it said was final. Her final livestream called out wealthy tech executives for their influence over the American presidential campaign and US businesses.\n\nOthers say they are getting flagged for comments unrelated to politics, sparking concerns that users are being targeted based on other criteria including identity or previous content.\n\nAda “Mila” Ortiz, a data analyst and content creator, said she received strikes after leaving innocuous comments on other videos, with a warning that another violation would prevent her from accessing some features.\n\n“It was just so sudden and so random I thought they are trying to get me out of here,” she said. Ortiz has since deleted about 15 videos that were pro-Vice President Kamala Harris and anti-Trump.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/25191044ffb1da9.jpg",
  "retrievedAt": "2025-08-26T07:55:46.175Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887622/am-i-being-censored-some-us-tiktok-users-say-app-feels-different-after-ban-lifted",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T14:43:05.000Z"
}
