{
  "title": "BYC holds Dalbandin rally amid reported network suspensions - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Baloch Yakjehti Committee (BYC) held a large gathering in Balochistan’s Dalbandin area on Saturday, amid reported suspension of mobile networks in the area.\n\nAuthorities have said that Section 144 is in place in the region and organisers are fearful of a potential crackdown on the event.\n\nTalking to Dawn, Balochistan government spokesperson Shahid Rind said that while it was the constitutional right of every citizen in Pakistan to assemble, the BYC is holding its event in spite of the fact that Section 144 is imposed in Balochistan. In this case, it is up to the local administration to allow permission for the rally.\n\n“Keeping in view the security situation of the province and to prevent untoward incidents to take place, the internet has been shut down in Dalbandin,” Rind said.\n\nBeeburg Baloch, one of the BYC organisers, told Dawn.com today that mobile services in Dalbandin, Chagai and Noshki have been suspended for three days.\n\n“Today, mobile service is completely suspended in Dalbandin, while there is no contact with the convoys coming from Noshki,” the organiser said. “We feel that mobile service has been completely suspended in Noshki as well.”\n\nBYC leader Dr Mahrang Baloch addressed the crowd alongside Dr Sabiha Baloch, Shahji Sibghatullah, Sammi Deen Baloch and other BYC figures.\n\n“We will not allow anyone to loot the mineral resources of Balochistan,” she said. “No mega projects will take place without the will and intentions of the Baloch people.”\n\nDuring her speech, she called on human rights organisations to take notice of “atrocities” committed in the province.\n\n“Injustices have united the Baloch today,” she said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/25174227d4deb85.jpg",
  "retrievedAt": "2025-08-26T07:55:47.683Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887611/byc-holds-dalbandin-rally-amid-reported-network-suspensions",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T15:03:00.000Z"
}
