{
  "title": "US freezes almost all aid except for Israel, Egypt arms - World - DAWN.COM",
  "author": null,
  "content": "The United States, the world’s biggest donor, froze virtually all foreign aid on Friday, making exceptions only for emergency food, and military funding for Israel and Egypt.\n\nSecretary of State Marco Rubio sent an internal memo days after President Donald Trump took office vowing an “America First” policy of tightly restricting assistance overseas.\n\n“No new funds shall be obligated for new awards or extensions of existing awards until each proposed new award or extension has been reviewed and approved,” said the memo to staff seen by AFP.\n\nThe sweeping order appears to affect everything from development assistance to military aid — including to Ukraine, which received billions of dollars in weapons under Trump’s predecessor Joe Biden as it tries to repel a Russian invasion.\n\nThe directive also means a pause of at least several months of US funding for Pepfar, the anti-HIV/AIDS initiative that buys anti-retroviral drugs to treat the disease in developing countries, largely in Africa.\n\nLaunched under president George W. Bush in 2003, Pepfar is credited with saving some 26 million lives and until recently enjoyed broad popular support along partisan lines in Washington.\n\nBut the memo explicitly made exceptions for military assistance to Israel — whose longstanding major arms packages from the United States have expanded further since Tel Aviv’s military offensive in Gaza — and Egypt, which has received generous US defence funding since it signed a peace treaty with Israel in 1979.\n\nRubio also made an exception for US contributions to emergency food assistance, which the United States has been contributing following crises around the world including in Sudan and Syria.\n\nLawmakers from the rival Democratic Party said that more than 20m people relied on medication through Pepfar and 63m people on US-funded anti-malaria efforts including nets.\n\n“For years, Republicans in Congress have decried what they see as a lack of U.S. credibility vis-a-vis countries like China, Russia, and Iran,” said Representative Gregory Meeks, the top Democrat on the House Foreign Relations Committee, and Representative Lois Frankel.\n\n“Now our credibility is on the line, and it appears we will cut and run from American commitments to our partners around the world,” they wrote in a letter.\n\nWashington has long leveraged aid as a tool of its foreign policy, saying it cares about development and drawing a contrast with China, which is primarily concerned about seeking natural resources.\n\nMeeks and Frankel also noted that foreign assistance is appropriated by Congress and said they would seek its implementation.\n\nThe US Senate narrowly confirmed former Fox News co-host Pete Hegseth as Pentagon chief on Friday, despite allegations of alcohol abuse, sexual misconduct and other fears about his ability to lead the world’s most powerful military.\n\nThree Republican senators voted against Trump’s pick as secretary of defence, resulting in a 50-50 tie that required J.D. Vance to cast the deciding ballot — only the second time in history a vice president has had to intervene to save a cabinet nominee.\n\nThe razor-edged result underscored concerns about Hegseth, who will take over the Pentagon with war raging in Ukraine, the Middle East volatile despite ceasefires in Lebanon and Gaza, and as Trump expands the military’s role in security on the US-Mexico border.\n\nThe 44-year-old is a former Army National Guard officer who until recently worked as a co-host for Fox News — one of Trump’s favoured television channels. Hegseth has a combative media personality, fierce loyalty and telegenic looks — common hallmarks in Trump’s entourage.\n\nSupporters say Hegseth’s deployments in Afghanistan and Iraq give him the insight to run the Defence Department better than more experienced officials who would normally be considered for the job.\n\nHe has pledged to focus the military on “lethality” and to bring back “warrior culture” to the Pentagon.\n\nIn confirming him, Republicans brushed aside his lack of experience leading an organisation anywhere near the size of the Defence Department — the country’s largest employer with some three million personnel.\n\nThey also approved Hegseth despite allegations of financial mismanagement at veterans’ nonprofits where he previously worked, reports of excessive drinking, and allegations that he sexually assaulted a woman in California.\n\nAsked during his confirmation hearing last week about criticism he has faced, Hegseth said there was a “coordinated smear campaign” against him, and that he is “not a perfect person, but redemption is real”.\n\nTrump has stood by him, telling reporters on Friday: “Pete’s a very, very good man.”\n\nBut three Republicans — senators Susan Collins, Mitch McConnell and Lisa Murkowski — were unconvinced and voted against him.\n\nMurkowski said on X the day before the Friday vote that “past behaviours Mr Hegseth has admitted to, including infidelity on multiple occasions, demonstrate a lack of judgment that is unbecoming of someone who would lead our armed forces”.\n\nPrior to his approval by the full Senate, lawmakers received an affidavit from Hegseth’s former sister-in-law Danielle Hegseth that added to the allegations against him.\n\n“I believe Hegseth has an alcohol abuse problem and was abusive to his ex-wife Samantha,” the affidavit said, though it noted that Danielle Hegseth did not personally witness physical or sexual abuse by the incoming defence secretary.\n\nDanielle Hegseth however said she “personally observed… Hegseth’s erratic and aggressive behaviour over many years,” that she was subjected to emotional abuse by him, and that she was told by his ex-wife that she once hid from him in a closet because she “feared for her personal safety”.\n\nAccording to the affidavit, Hegseth also told his ex-sister-in-law that women should not work or have the right to vote, and said that “Christians needed to have more children so they can overtake the Muslim population”.\n\nDuring his combative confirmation hearing, Hegseth stuck to his opposition to diversity, equity and inclusion policies — long a bugbear for Republicans — saying they are “dividing troops inside formations, causing commanders to walk on eggshells, not putting meritocracy first”.\n\nBut he sought to soften past remarks opposing women serving in combat, telling lawmakers that “women will have access to ground combat roles… given the standards remain high”.\n\nThree more of Trump’s most contentious nominees will soon be grilled by lawmakers.\n\nKash Patel — Trump’s nominee to lead the FBI — Tulsi Gabbard, his pick for director of national intelligence, and Robert F Kennedy Jr, the president’s choice for secretary of health and human services, are expected to have Senate hearings next week.\n\nThe memo allows the State Department to make other case-by-case exceptions and temporarily to fund salaries to staff and other administrative expenses.\n\nThe memo called for an internal review of all foreign assistance within 85 days.\n\nIn justifying the freeze, Rubio — who as a senator was a supporter of development assistance — wrote that it was impossible for the new administration to assess whether existing foreign aid commitments “are not duplicated, are effective and are consistent with President Trump’s foreign policy.”\n\nThe United States has long been the world’s top donor in dollar terms, although a number of European nations, especially in Scandinavia, give significantly more as a percent of their economies.\n\nThe United States gave more than $64 billion in overseas development assistance in 2023, the last year for which records were available, according to the Organisation for Economic Cooperation and Development, which advises industrialised countries.\n\nTrump had already on taking office Monday signed an executive order suspending foreign assistance for 90 days, but it was not immediately clear how it would be implemented.\n\nAnti-poverty group Oxfam said that Trump was abandoning a longstanding consensus in the United States for foreign assistance.\n\n“Humanitarian and development assistance accounts for only around one percent of the federal budget; it saves lives, fights diseases, educates millions of children and reduces poverty,” Oxfam America president Abby Maxman said in a statement.\n\n“Suspending and ultimately cutting many of these programmes could have life or death consequences for countless children and families who are living through crisis,” she said.\n\n“This is lunacy,” Reuters quoted Jeremy Konyndyk, a former USAID official who is now president of Refugees International, as saying.\n\n“This will kill people. I mean, if implemented as written in that cable […] a lot of people will die.\n\n“There’s no way to consider this as a good-faith attempt to sincerely review the effectiveness of foreign assistance programming. This is just simply a wrecking ball to break as much stuff as possible,” Konyndyk said.\n\nKonyndyk said emergency food assistance was just a minority of all humanitarian assistance, adding that nutrition, health and vaccination programs will have to stop, as would relief aid to Gaza and Syria as well as services to refugee camps in Sudan.\n\nAn official of the US Agency for International Development (USAID) official, who requested anonymity, said officers responsible for projects in Ukraine have been told to stop all work, Reuters reported.\n\nAmong the projects that have been frozen are support to schools and health assistance like emergency maternal care and childhood vaccinations, the official said.\n\n“It’s manufactured chaos,” said a former senior official with the USAID, speaking on condition of anonymity.\n\nAdditional input from Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2509420120b577a.jpg",
  "retrievedAt": "2025-08-26T07:55:52.343Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887579/us-freezes-almost-all-aid-except-for-israel-egypt-arms",
  "dateList": "2025-01-25",
  "date_published": "2025-01-25T04:37:56.000Z"
}
