{
  "article_id": "2025-09-05_39934e954a5d5811fdec316d2d8efe56",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hurriyat-leaders-pay-glowing-tributes-to-pakistans-armed-forces-on-defence-day/",
    "retrieved_at": "2025-09-06T10:56:52.502Z"
  },
  "metadata": {
    "title": "Hurriyat leaders pay glowing tributes to Pakistan’s armed forces on Defence Day",
    "author": null,
    "date_published": "2025-09-05T11:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 05 (APP):Kashmiri Hurriyat leaders Friday paid glowing tributes to Pakistan's armed forces and martyrs of the nation, terming September 06 as a historic day of courage, unity, and sacrifice when the entire nation stood shoulder to shoulder with its military to defend the motherland. Hurriyat leader, Abdul Hameed Lone, in his special message, said that September 06 marks a historic day when the Armed Forces of Pakistan gave a befitting response to the enemy. He said the day is celebrated with the spirit that the Armed Forces stand as the true guardians of the state, while the nation and the military remain united like a fortified wall. Referring to May 10 as a continuation of that valor, he added that the sacrifices of the martyrs and the services of the Army will always be remembered with great pride. Meanwhile, Secretary General of All Parties Hurriyat Conference (APHC), Advocate Parvez Shah paid rich tributes on behalf of APHC and the Kashmiri people to the armed forces of Pakistan. He said it is a day to remember the martyrs who laid down their lives for the motherland, adding that the core reason behind all wars between India and Pakistan has been Kashmir. He reaffirmed that the people and the armed forces of Pakistan have always sent a clear message to the world that they are ready to go to any length for the cause of Kashmir. In his separate message, Hurriyat leader, Manzoor Hameed Shah said that September 06 is a defining day in Pakistan's history when the Armed Forces demonstrated unmatched courage. He said this spirit was once again revived on May 10, when the nation witnessed another display of military strength, blessed with success by Allah Almighty.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}