{
  "article_id": "2025-09-05_58b6c760147b36cb5e725f49a6c70244",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/teachings-of-prophet-muhammad-pbuh-are-a-guiding-light-for-building-just-compassionate-society-minister-yousaf/",
    "retrieved_at": "2025-09-06T10:55:55.152Z"
  },
  "metadata": {
    "title": "Teachings of Prophet Muhammad (PBUH) are a guiding light for building just, compassionate society: Minister Yousaf",
    "author": null,
    "date_published": "2025-09-05T16:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 349,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, September 05 (APP):Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf, on Friday, said the teachings of Prophet Muhammad (Peace Be Upon Him) provide a guiding light for Muslims in building a society based on compassion, justice, and moral excellence. He was addressing a grand Naat gathering and awards ceremony held in connection with Rabi-ul-Awwal and the upcoming 50th International Seerat-un-Nabi (PBUH) Conference, which also coincides this year with the commemoration of 1,500 years of the blessed birth of the Holy Prophet (Peace Be Upon Him). The minister welcomed Parliamentary Secretary for Religious Affairs, Sardar Shamsher Ali Khan Mazari, members of parliament, religious scholars, and other distinguished guests, noting that their participation reflected the deep love and reverence for the Prophet (Peace Be Upon Him) shared by the nation. Highlighting the importance of the event, Yousaf said Naat recitation is not just a poetic expression but a spiritual act that renews faith, inspires love for the Prophet (Peace Be Upon Him), and spreads the light of his noble character. He paid tribute to Pakistani scholars, researchers, and Naat reciters who were recognized during the ceremony for their outstanding contributions to Islamic literature and Seerat studies. \"Celebrating the birth of the Prophet Muhammad (Peace Be Upon Him) is not only an expression of devotion but also a renewal of faith. The Seerat Conference will help to spread his universal message of peace, mercy, and humanity,\" he added. The minister stressed that the Prophet's exemplary morals, tolerance, forgiveness, and compassion should serve as a model for individual and collective life. \"Our duty as Muslims is to embody the Prophet's teachings by promoting brotherhood, respect, sacrifice, justice, and kindness in society,\" he said. The event also featured recitations of classical and contemporary Naats, with references to the legacy of early Islamic poets such as Hazrat Hassan bin Thabit (RA), who was honored by the Prophet (Peace Be Upon Him) himself for his poetic defense of Islam. The minister concluded with prayers for the progress and stability of Pakistan, urging citizens to carry forward the Prophet's mission of peace and unity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}