{
  "article_id": "2025-09-05_c8ddca2d80fd474b054c077282061aee",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/defence-day-marks-nations-resolve-to-protect-homeland-aurangzeb-khichi/",
    "retrieved_at": "2025-09-06T10:57:11.778Z"
  },
  "metadata": {
    "title": "Defence Day marks nation’s resolve to protect homeland: Aurangzeb Khichi",
    "author": null,
    "date_published": "2025-09-05T11:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 213,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 5 (APP):Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi Friday said that Defence Day is not only about paying tribute to the martyrs but also about renewing the pledge that the sovereignty and integrity of Pakistan will never be compromised. Talking to APP in connection with the Defence Day, the federal minister congratulated the nation and said that September 06 is remembered as the day when the valiant armed forces, alongside the entire nation, defended the motherland by confronting a bigger enemy and safeguarding the country's borders with their lives. He saluted the young soldiers and martyrs of the Pakistan Army. He recalled that in May this year, the enemy once again attempted aggression, which was met with a strong and befitting response by the armed forces with the full support of the people. He added that unity, courage, and patriotism are the keys that have always enabled Pakistan to stand strong in difficult times. He reaffirmed that in the future as well, if the enemy dares to cast an evil eye, the brave forces of Pakistan, with the backing of the nation, will give a powerful reply. \"Our martyrs are our pride, and their sacrifices will always inspire us to protect the homeland at any cost,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}