{
  "article_id": "2025-09-05_d0e164bde8b36e35a3aaacf2d25c1bda",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-reaffirms-commitment-to-regional-peace-connectivity-at-sco-summit-fo-spokesperson/",
    "retrieved_at": "2025-09-06T10:56:19.237Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms commitment to regional peace, connectivity at SCO Summit: FO Spokesperson",
    "author": null,
    "date_published": "2025-09-05T14:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 982,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 5 (APP):Foreign Office Spokesperson Shafqat Ali Khan on Friday said Pakistan remains firmly committed to advancing regional peace, economic connectivity, and multilateral cooperation under framework of the Shanghai Cooperation Organization (SCO). In his weekly press briefing, he provided an extensive briefing on Prime Minister Muhammad Shehbaz Sharif's recent visit to China to attend the SCO Council of Heads of State (CHS) and SCO CHS Plus meetings held in Tianjin from August 31 to September 1. The Prime Minister's visit, undertaken at the invitation of Chinese President Xi Jinping, saw high-level engagements with SCO member states and key regional leaders. During the summit, Prime Minister Shehbaz Sharif highlighted Pakistan's perspectives on pressing regional and global issues and called for a comprehensive and structured dialogue to resolve longstanding disputes in South Asia. He strongly condemned terrorism in all forms, including state-sponsored terrorism, and cited irrefutable evidence of foreign involvement in recent terrorist incidents such as the Jaffar Express hostage crisis and attacks in Balochistan and Khyber Pakhtunkhwa. FO Spokesperson said the prime minister also voiced firm condemnation of Israel's military offensive in Gaza, describing it as \"inhuman\" and calling for an immediate and unconditional ceasefire. He also denounced the recent attack on Iran, a fellow SCO member state. He stated that the PM stressed the importance of meaningful engagement with Afghanistan, noting that instability in Afghanistan undermines development across the entire SCO region. The PM also highlighted the significance of regional connectivity and economic integration, pointing to Pakistan's strategic geographical location as a potential trade and transit hub for the SCO. He underscored the China-Pakistan Economic Corridor (CPEC) as a cornerstone for regional integration under President Xi Jinping's Belt and Road Initiative (BRI). Shafqat Ali Khan said on the sidelines of the summit, the prime minister held a series of bilateral meetings with the Presidents of China, Russia, Turkiye, Iran, Azerbaijan, and Tajikistan. These discussions focused on enhancing political, economic, trade, energy, and defense cooperation. Notably, the PM congratulated Azerbaijani President Ilham Aliyev on the signing of the historic peace agreement with Armenia, marking a significant step toward peace in the South Caucasus. In his meeting with President Xi Jinping, the PM reaffirmed Pakistan's unwavering support for China's territorial integrity and praised its achievements in economic development. Discussions with Chinese Premier Li Qiang focused on deepening cooperation in emerging sectors and supporting President Xi's multilateral initiatives, including the Global Development, Security, and Civilization Initiatives. He said the prime minister also addressed the Pakistan-China Business-to-Business Investment Conference, attended by over 800 companies, where he identified agriculture, mining, IT, textiles, and industrial development as key areas for future collaboration. Shafqat Ali Khan noted that Prime Minister Sharif also participated in China's 80th Victory Day Anniversary Parade, celebrating its World War II victory alongside other global leaders. Turning to other diplomatic developments, the Foreign Office Spokesperson confirmed that Pakistan and Armenia formally established diplomatic relations during a meeting between Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar and Armenian Foreign Minister Ararat Mirzoyan. Both sides affirmed their commitment to the UN Charter and discussed cooperation in economy, education, tourism, and culture. He shared further updates on high-level interactions. Senator Ishaq Dar held bilateral talks with the foreign ministers of Germany and the European Union, both of whom expressed solidarity over the recent flood devastation in Pakistan. Discussions focused on climate action, resilience-building, and sustainable recovery, with the EU reaffirming its support for Pakistan's relief efforts.The Foreign Minister also extended condolences to Afghanistan following the recent earthquake and reiterated Pakistan's readiness to provide support. Highlighting scientific progress, Shafqat Ali Khan noted that a high-level delegation from CERN visited Pakistan from August 24-28 to assess the country's contributions as an Associate Member. The delegation met with officials from the Pakistan Atomic Energy Commission (PAEC) and toured various scientific institutions, including NCP, PIEAS, PINSTECH, INMOL, and NILOP. On the diplomatic front, he said the 14th round of Pakistan-Japan Bilateral Political Consultations was held in Islamabad on September 4. The two sides reviewed the full range of bilateral relations and explored new avenues of cooperation in trade, education, development, and people-to-people exchanges. Regional and global security issues were also discussed, he added. In response to recent developments in Gaza, Shafqat Ali Khan condemned the Israeli airstrike on Nasser Hospital in Khan Younis, which resulted in the deaths of 21 people, including four journalists and a rescue worker. He called the strike a heinous violation of international humanitarian and human rights laws and demanded immediate accountability. He reiterated Pakistan's full support for the sovereignty and territorial integrity of Syria and urged the international community to prevent further escalation by Israel in the region. The FO Spokesperson reaffirmed Pakistan's commitment to peace, regional connectivity, multilateral cooperation, and principled diplomacy.\"Pakistan's voice was heard clearly and firmly on the world stage standing for peace, justice, and shared prosperity,\" he said. Responding to a series of questions during the weekly media briefing, Ambassador Shafqat confirmed that India has shared some flood-related information through diplomatic channels, but emphasized that it lacked the detail and timeliness previously seen. He said India should fully comply with the Indus Waters Treaty (IWT), following rising concerns over unilateral water releases by India amidst devastating floods in Pakistan's Punjab and Khyber Pakhtunkhwa provinces. \"The Indian side has indeed shared some information about the floods in different rivers through diplomatic channels. However, it is not as detailed as it was in the past,\" the spokesperson stated. He further noted that India has not used the established channel of the Indus Water Commissioners, as outlined in the Treaty. \"The established channel of Indus Water Commissioner has not been used. In that context, we reiterate that India should fully comply with all the provisions of the Indus Water Treaty,\" he added. However, he acknowledged that the situation on the ground, including losses running into billions, raises serious questions about India's conduct.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}