{
  "article_id": "2025-03-04_c3bcdafaac2bfd7534691cbb6ab5b7e9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cadet-college-to-benefit-south-punjab-youths-gilani/",
    "retrieved_at": "2025-08-27T13:20:56.590Z"
  },
  "metadata": {
    "title": "Cadet college to benefit south Punjab youths: Gilani",
    "author": null,
    "date_published": "2025-03-04T12:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 224,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "MULTAN, Mar 04 (APP):Senate Chairman Syed Yousuf Raza Gillani said on Tuesday there would be no compromise on uplift of underdeveloped areas and the Syed Yousuf Raza Gillani Cadet College project would largely benefit south Punjab youths. During a visit to the site of the cadet college, he witnessed the ongoing work and said that development of South Punjab remained a priority while he was serving as the Prime Minister and reiterated his commitment to continue to strive for uplift and prosperity of less developed areas, including Multan. He termed the cadet college a revolutionary project in the education sector and promised an all-out effort for its timely completion to enable students of South Punjab to avail the best education facility at their doorstep. He said that deprivations of people of South Punjab would be addressed on priority. Earlier, commissioner Amir Kareem Khan called on the Senate chairman at Gilani House and gave a detailed briefing on development projects of Multan division including Syed Yousuf Raza Gillani Cadet College. MPA Rana Iqbal Siraj and former MPA Dr. Javed Siddiqui were also present. Commissioner Khan apprised the Chairman Senate about status of ongoing work on the project and the schedule for its completion. Gillani said that providing all basic facilities to the people in health, education and other sectors was top priority of the government.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}