{
  "article_id": "2025-03-04_20d4ee2fa218d7d47f9ac6acde3e71ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/obesity-crisis-hits-global-tipping-point-experts-call-for-policy-reform/",
    "retrieved_at": "2025-08-27T13:21:01.155Z"
  },
  "metadata": {
    "title": "Obesity crisis hits global tipping point: experts call for policy reform",
    "author": null,
    "date_published": "2025-03-04T12:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 401,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 04 (APP):The IMPACT Research International (IRI) and the School of Leadership Foundation (SoLF) on Tuesday convened a hybrid seminar here, in which they spotlighted urgent policy reforms to curb obesity-linked diseases threatening economies and healthcare systems worldwide. The seminar was attended by over 75 experts from Peshawar, Quetta, and online platforms. In the seminar, the speakers highlighted that the Global obesity rates have surged threefold since 1975, with childhood cases rising fivefold, impacting nations at all economic levels. During the opening remarks, Managing Director of SoLF, Mariyam Irfan said in 2022, over 890 million adults and 160 million children globally lived with obesity. She warned that one in three individuals could face obesity by 2034, with 10% developing type-2 diabetes. \"This crisis spares no age group. A systemic overhaul is critical,\" she added. UNICEF Nutrition Officer Ms. Meike Siemonsms said Pakistan mirrors this trend: 58% of its population is obese, per WHO data, while other estimates suggest 72% are overweight. Women and children are disproportionately affected due to cultural norms and aggressive marketing of unhealthy foods. She linked the rise to urban lifestyles conflicting with health guidelines. \"Our environments promote sedentary habits and poor diets, fueling noncommunicable diseases (NCDs),\" she noted, praising the seminar's focus on actionable solutions. Executive Director of IMPACT Research International (IRI) Zubair Faisal Abbasi shared that theNational Nutrition Survey data reveals alarming jumps: childhood obesity nearly doubled from 2011 to 2018, while 48% of Pakistani women could be overweight by 2024. \"Ultra-processed items-sugary drinks, fast food-dominate our diets. Without stricter policies, obesity will keep rising,\" he asserted. Nutritionist Ms. Mishaal Khan highlighted obesity's health ripple effects: diabetes, hypertension, and heart disease. \"Early intervention through diet, exercise, and medical care can reverse risks,\" she advised, urging public education campaigns. Dr. Asma Umer Khayam of Islamabad's Health Services Academy pointed to digital tools-apps, wearables, AI-as potential game-changers. \"Personalized health tracking can empower individuals to manage weight effectively,\" she said. Experts endorsed WHO's anti-obesity strategies, urging Pakistan to tax sugary drinks and ultra-processed foods. -and mandate warning labels on unhealthy products. While, regulate school meals and restrict junk food ads. Discussions also addressed corporate influence on policy. \"Food and beverage companies increasingly lobby governing bodies, undermining public health goals,\" Abbasi cautioned. The seminar underscored obesity as a societal, not individual, challenge. With coordinated policies, public awareness, and tech-driven solutions, Pakistan-and the world-can stem a crisis endangering future generations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}