{
  "article_id": "2025-03-04_685bed70fd853f2a14b71f73c22c3b7d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pak-japan-parliamentary-group-discusses-strengthening-of-expanding-economic-development-cooperation/",
    "retrieved_at": "2025-08-27T13:21:22.517Z"
  },
  "metadata": {
    "title": "Pak-Japan parliamentary group discusses strengthening of expanding economic, development cooperation",
    "author": null,
    "date_published": "2025-03-04T11:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 369,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 4 (APP):Pak-Japan Parliamentary Group meeting on Tuesday focused on strengthening bilateral relations and expanding economic and development cooperation between Pakistan and Japan. Chaired by Senator Nadeem Ahmed Bhutto, the meeting highlighted the mutual benefits of strong diplomatic ties between the two countries. Senator Bhutto, along with senior officials from the Senate Secretariat, warmly welcomed Ambassador of Japan, Akamatsu Shuichi. During the discussion, Senator Bhutto informed about the Pakistan's rich natural landscapes, particularly in the northern regions, suggesting that the country could leverage its scenic beauty to boost the tourism sector. He also underscored Japan's strong ties with the World Bank and other economic institutions that have supported Pakistan's economic stability. The Senator said that bilateral trade between Pakistan and Japan currently stands at $1.72 billion, stressing the need to further enhance economic collaboration. He was of the view that platforms such as the Japan International Cooperation Agency (JICA) and Foreign Investment Support Center (FISC) could facilitate increased foreign investments in Pakistan. He further highlighted Pakistan's reliability as an economic partner and encouraged greater Japanese investment, citing the 2023 Tokyo Investment Board, which saw participation from over 127 major investment groups. He reaffirmed Pakistan's commitment to exploring new opportunities for trade expansion and investment growth. On skills development, he mentioned the signing of technical internship and special skill work programs, acknowledging the contributions of the 25,000-strong Pakistani diaspora in Japan in fostering bilateral relations. Ambassador Akamatsu Shuichi expressed gratitude for the warm reception and recalled his recent meeting with the Chairman of the Senate, calling it a privilege. He reaffirmed Japan's commitment to strengthening ties with Pakistan, highlighting that diplomatic relations have spanned over 73 years, with Japan providing economic cooperation for more than 70 years. The Ambassador said that over 80 Japanese companies are currently operating in Pakistan, significantly contributing to its economic and social development. He also pointed out that around 1,000 Japanese tourists visit Pakistan annually, with expectations of increased numbers as security concerns stabilize. He highlighted the 2025 Osaka Conference as an important platform for Pakistan to showcase its economic potential and attract investment. He praised the ongoing parliamentary exchanges between the two nations and expressed hope for further engagement following Japan's upcoming elections.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}