{
  "title": "Shelter Homes help labourers save Rs 6, 000 per month for families: PM Focal Person",
  "link": "https://www.app.com.pk/national/shelter-homes-help-labourers-save-rs-6-000-per-month-for-families-pm-focal-person/",
  "date_published": "2021-01-12T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP): There are no two opinions that Pakistan is one of the most charitable countries in the world, and when it comes to giving, everybody gives to the poor in the shape of Zakat, charity and in-kind donations.\nPrime Minister’s Focal Person on Shelter Homes Naseem ur Rehman called this spirit a major driving force in running the affairs of ‘Panahgahs’ (shelte homes) that have served around 150,000 poor people to this day by providing nutritious food and night stay in neat and clean settings.\nCredit for the ‘Panahgahs’ programme goes to Prime Minister Imran Khan as he is the first leader in tthe country’s history, who has taken multiple initiatives for improving living standards of the downtrodden segments of the society.\nNaseem ur Rehman, in an exclusive chat with APP on Tuesday, said there were around 93 dedicated places and a large number of Langar Khanas (food centers) across the country, where the poor people including women, daily wage earners and old citizens were being offered free meal two times a day and night stay.\nHe said Rs 300 was being spent on each dweller every day, helping the poor people, especially migrant workers to save Rs 6,000 per month that obviously provided him an opportunity to directly spend the hard earned money on his family welfare.\nCiting the example of the twin cities of Rawalpindi and Islamabad’s ‘Panahgahs’, he said 600 people were getting food and shelter at each shelter home, which manifested Prime Minister Imran Khan’s vision of transforming the country into Madina-like state, where all citizens irrespective of their caste, religion, race and social status were treated equally.\nHe said once there was starvation, and helpless people were forced to sleep on pavements and in public parks. “Now I can say, in the long run, this Panagahs project will prove a remarkable initiative to alleviate poverty in an effective manner,” he maintained.\nExplaining the policy to ensure sustainability of the programme, Naseem said it was providing an organized and strategic approach to the ‘giving’. It also make the ‘giving’ a dignified process by keeping in mind respect and dignity of the receiver, he added.\n“This is the first time in history of Pakistan that a programme has come up which is trying to tap into the people’s goodwill as well as the existing resources, and through this process, a major overlapping, wastage and duplications have been reduced,” the prime minister’s focal person noted.\nNow the country, he said, had a system which could help distribute the donations among the poor in a more organized manner.\nFor instance, Naseem said the management had launched a free shuttle service to facilitate daily wage earners for reaching the ‘Panahgahs’, located in the city’s outskirts. The move was meant to ensure optimum use of the resources, he added.\nBefore that initiative, he said occasionally the poor people ended up in sleeping under open sky as they were unable to bear the travelling expenses to reach other shelter homes due to rush at the Panahgahs located at the central locations of the twin cities.\nHe said the initiative had been receiving tremendous response as the people from all over the world were providing in-kind donations to the shelter homes programme.",
  "retrievedAt": "2025-08-11T20:14:02.791Z"
}
