{
  "title": "COVID-19 claims 41 more lives, over 2,408 new cases reported",
  "link": "https://www.app.com.pk/national/covid-19-claims-41-more-lives-over-2408-new-cases-reported/",
  "date_published": "2021-01-12T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP): The national tally of total active COVID-19 cases in Pakistan on Tuesday reached 34,007 as 2,408 more people tested positive for the deadly virus and 3,606 people recovered from it during the last 24 hours.\nForty-one corona patients had lost their lives out of which 36 were under treatment in hospitals and five three others in their respective homes or quarantines, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Sindh. It added that out of the total 41 deaths during last 24 hours 27 patients died on ventilators.\nNo COVID-19 affected person was on ventilator in Azad Jammu and Kashmir (AJK) and Balochistan while 320 ventilators were occupied elsewhere in Pakistan.\nThe maximum ventilators were occupied in four major areas including Multan 58 percent, ICT 36 percent, Bahawalpur 50 percent and Peshawar 32 percent.\nThe maximum oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID-19 patient) was also occupied in four major areas of Peshawar 51 percent, Multan 32 percent, Karachi 37 percent and Rawalpindi 30 percent.\nSome 40,088 tests were conducted across the country on Monday, including 14,137 in Sindh, 14,499 in Punjab, 5,001 in Khyber Pakhtunkhwa (KP), 5,277 in Islamabad Capital Territory (ICT), 574 in Balochistan, 367 in GB, and 233 in AJK.\nAround 461,977 people have recovered from the disease so far across Pakistan making it a significant count with over 86 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 506,701 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 8,501, Balochistan 18,429, GB 4,882, ICT 39,340, KP 61,648, Punjab 146,016 and Sindh 227,885.\nAbout 10,717 deaths were recorded in country since the eruption of the contagion. Around 3,708 perished in Sindh among nine of them died on Monday, Six of them died in hospital and Three out of the hospital. 4,299 in Punjab had died with 27 deaths in past 24 hours, 25 of them perished in the hospital and two out of the hospital on Monday. 1,743 in KP where three of them died in hospital on Tuesday, 443 in ICT where two of them died in the hospital on Tuesday, 188 in Balochistan, 101 in GB and 235 in AJK succumbed to the deadly virus.\nA total of 7,162,626 corona tests have been conducted so far, while 630 hospitals are equipped with COVID facilities. Some 2,843 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:14:08.053Z"
}
