{
  "title": "Hazardous pollutants recorded in Federal Capital’s air quality",
  "link": "https://www.app.com.pk/national/hazardous-pollutants-recorded-in-federal-capitals-air-quality/",
  "date_published": "2021-01-12T16:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 12 (APP): Health experts have warned citizens to avoid unnecessary outdoor exertion as hazardous pollutants were recorded much beyond permissible limits in the Federal Capital’s air quality on Tuesday.\nThe air with high pollutant ratio was injurious to the health of children, teenagers and old people while the patients of lungs and heart diseases were at high risk, the medical practitioners said.\nAcoording to the data released by Pakistan Environmental Protection Agency (Pak-EPA), the particulate of 2.5 (PM2.5) microns, which was a hazardous ambient air pollutant causing chronic respiratory diseases and premature deaths, was higher than safer limits in the Capital’s air.\nPM2.5 was recorded 74.82 micrograms per cubic meter in Islamabad, which is much higher than the National Environmental Quality Standards (NEQS) of 35 micrograms and the World Health Organization (WHO) standard of 20 micrograms per cubic meter.\nThe air quality data revealed the presence of 45.65 micrograms sulphur dioxide and 37.92 micrograms nitrogen dioxide per cubic meter against the NEQS of 120 micrograms and 80 micrograms per cubic meter respectively.\nAccording to an EPA official, prevailing dry weather was the main reason for the bad air quality, caused due to presence of PM2.2 above the NEQS limit. It was the most health damaging environmental pollutant causing chronic respiratory diseases and premature deaths as it could easily penetrate into human blood through lungs cells, she said while talking to APP.\nThe official said sulphur dioxide and nitrogen dioxide were released from industrial emissions and car engines at different concentrations that accumulated into the ambience causing air pollution.\nShe mentioned that the Federal Capital’s air quality was commendable during the lockdown as vehicular emissions had drastically reduced.\nThe main reason of air pollution was a large number of vehicles on the Capital’s roads emitting combustion gases, she added.\nShe said the EPA regularly monitored the Capital’s air quality, which was found was unhealthy during dry weather, storm or pre-rain like situation. The people should wear face masks and sunglasses during outdoor visits when the pollution level was recorded high, she added.\nA senior pulmonologist of Pakistan Institute of Medical Sciences expressed his serious concern over the presence of hazardous pollutants in Islamabad’s air as they caused respiratory diseases and serious health complications.\nHe said the people should be careful during the dry weather and avoid unnecessary outdoor activities.\nUse of face mask or covering was the best remedy to avoid air pollution contact, while sunglasses during day time helped prevent eye rashes or allergy due to dust and pollutants, he added.",
  "retrievedAt": "2025-08-11T20:14:02.793Z"
}
