{
  "title": "Pakistan, Tajikiostan sign agreements, MOUs for cooperation in diverse fields",
  "link": "https://www.app.com.pk/national/pakistan-tajikiostan-sign-agreements-mous-for-cooperation-in-doverse-fields/",
  "date_published": "2021-09-17T18:06:00.000Z",
  "source": "APP",
  "content": "DUSHANBE, Sep 17 (APP): Pakistan and Tajikistan Friday signed various agreements and Memoranda of Understanding (MOUs) for cooperation in diverse areas including trade, investment, banking, tourism, information and broadcasting etc.\nPrime Minister Imran Khan and President Emomali Rahmon witnessed the signing of documents at a ceremony held here at Qasr-e-Millat after holding one-on-one meeting and delegation level talks.\nForeign Minister Makhdoom Shah Mahmood Qureshi, Advisor to PM on Commerce Abdul Razak Dawiood and Pakistan’s Ambassador in Dushanbe Imran Haider and their counterparts from Tajikistan signed the documents on behalf of their respective countries.\nFollowing is the detail of agreements and MOUs:\n1) MOU of Mutual Cooperation for Archives and Libraries Development between the Government of Pakistan and Tajikistan.\n2) Protocol to Amend the Existing Convention between Pakistan and Tajikistan for Avoidance of Double Taxation and the Prevention of Fiscal Evasion with respect to Taxes on Income.\n3) MOU for Cooperation in Industrial Property between the Ministry of Economic Development and Trade and IPO of Pakistan.\n4)  MOU between Financial Monitoring Department under the National Bank of Tajikistan and Financial Monitoring Unit of Pakistan concerning cooperation in the exchange of financial intelligence related to money laundering-related predicate offences and financing of terrorism.\n5) MOU between the National Bank of Tajikistan and State Bank of Pakistan on Supervisory Cooperation.\n6) MOU on Cooperation between the National Information Agency of Tajikistan “Khovar” and the Associated Press of Pakistan (APP).\n7)  MOU between the Government of the Republic of Tajikistan and the Government of the Islamic Republic of Pakistan for Cooperation in the Sphere of Tourism, Hospitality and Investment in the Tourism Sector.\n8)  Action Plan for the year 2022 on the Implementation of the Agreement between the Government of the Republic of Tajikistan and the Government of the Islamic Republic of Pakistan on Cooperation in the field of Physical Training and Sports.",
  "retrievedAt": "2025-08-11T21:15:42.283Z"
}
