{
  "title": "UNHCR warns of dire consequences for refugees from COVID-19 underfunding",
  "link": "https://www.app.com.pk/national/unhcr-warns-of-dire-consequences-for-refugees-from-covid-19-underfunding/",
  "date_published": "2021-09-17T13:59:00.000Z",
  "source": "APP",
  "content": "The COVID-19 emergency tops the list of UNHCR’s top-10 underfunded situations in 2021, said a press release.\nAccording to UNHCR, only one third of the budgeted requirements of US$ 924 million has been received, leaving a yawning gap in UNHCR’s ability to protect the most vulnerable from the fallout of the pandemic.\nDespite progress in many locations where UNHCR is working, we continue to see new cases and people continue to die.\nWhile safe and effective vaccines can relieve pressures on health systems and save lives, vaccine inequity continues to hit the hardest in many refugee-hosting states. We know that 86 per cent of refugees are hosted in developing countries.\nHowever, some 80 per cent of all vaccine doses have been given in high- and upper middle-income countries.\nAt the same time, low-income countries, hosting the bulk of the world’s refugees, have the least resilient health systems and are struggling to cope with the needs of their own populations – before we add the extra needs posed by hosting refugees.\nAs UNHCR, we reiterate our call on states to share excess doses with COVAX in a timely way, to address the global vaccine inequity and avoid prolonging the pandemic.\nUntil now, we have been very encouraged by the overwhelming response of hosting states in including refugees in the vaccine roll-out and urge them to continue to do so. However, we have seen that many barriers to vaccine access remain.\nUNHCR stands ready to support states to overcome some of these barriers – provided we have the means to do so – for example, by creating information materials in refugee languages suitable for low literacy levels.\nThe pandemic hurts forcibly displaced and stateless people in ways that reach far beyond the risk posed by the virus itself. And the failure to adequately fund the response only deepens their plight.\nThey have borne the full impact of the economic repercussions of the pandemic. As business and workplaces have closed, their precarious livelihoods were often the first to go. Where governments have provided subsidies to offset the economic impact, or helped school children with distance learning, forcibly displaced people often did not have access to such measures.\nThis economic fallout means that people cannot afford to pay rent or cannot afford daily necessities, such as food, which in turn increases the risk of exploitation and gender-based violence. UNHCR calls on states to include refugees in national social safety nets and on donors to support us, in order to help fill that gap.\nOur COVID-19 response covers every region and encompasses the whole spectrum of needs – reflecting the wide-reaching ramifications of the pandemic on the lives of those forced to flee. At the end of August 2021, the largest areas of unmet needs included a shortfall of US$ 74 million in cash assistance, and smaller but significant gaps in funding to alleviate the pandemic’s impact on primary health care, primary education, and services for people with specific needs.\nOn health grounds alone, the sheer number of forcibly displaced people, who constitute 1 per cent of the world’s population, indicates that failing to integrate them into the global pandemic response would be reckless. But it is not too late. We are thankful to donors who have already pledged or provided funding to cover COVID-19 needs and call on others to help us channel funds to where they are most urgently in need.",
  "retrievedAt": "2025-08-11T21:15:46.881Z"
}
