{
  "title": "UN High Commissioner for Refugees lauds Pakistan’s humanitarian operations in Afghanistan",
  "link": "https://www.app.com.pk/national/un-high-commissioner-for-refugees-lauds-pakistans-humanitarian-operations-in-afghanistan/",
  "date_published": "2021-09-17T17:31:00.000Z",
  "source": "APP",
  "content": "Addressing a press conference here, he said that during his three-day visit to Pakistan, he holds meetings with senior government officials, refugee representatives and other partners.\nHe said that this was his fourth visit to Pakistan as UN High Commissioner for Refugees.\nUN Higher Commissioner for Refugees said that as usual Pakistan will play very important role to support humanitarian operations inside Afghanistan.\nHe said that whether it was Pakistani or international donations coming through Pakistan and he was grateful for it to Pakistan.\nHe appealed that Pakistan to facilitate Afghan citizens of specific needs or minority if they don’t have proper documentation, so that may be facilitated.\nHe said that we also understand the position of Pakistan as got so many refugees for 40 years and the international community should do more.\nHe said that on the decision of Secretary General, UN is engaging with the interim Taliban administration in Afghanistan especially on humanitarian matters.\nHe said that he spent three days in Afghanistan and also paid field visit to Mazar Sharif.\nHe also holds meetings with different ministers of interim government of Afghanistan.\nFilippo Grandi said that the meetings were constructive and cordial were focused on human issues. He said that he had got assurance of security of the humanitarian operations in Afghanistan. He said that Taliban expressed the wish that humanitarian assistance be ruled out quickly as possible as the country condition is very difficult.\nHe said that this was not just after 15th August but humanitarian situation was bad already.\nHe said that after this new development people were in dire need of food, medicines, shelter and other first necessities of life. He said that there were three and half million people displaced by the conflict. He said that half million were displaced very recently.\nHe said that with the assurance of Taliban there was improvement in the overall security situation as of course the fighting ended.\nHe said that UN will never leave the country, however we reduced the presence because of the situation after 15th August.\nHe said that he has not seen big refugee movement but of course if the state collapses we could see a lot of people trying to seek refugees in other countries because of the situation in Afghanistan.",
  "retrievedAt": "2025-08-11T21:15:42.279Z"
}
