{
  "title": "Pakistan off the UK’s Red List; Decision widely welcomed",
  "link": "https://www.app.com.pk/national/pakistan-off-the-uks-red-list/",
  "date_published": "2021-09-17T18:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 17 (APP): The United Kingdom on Friday removed eight countries; including Pakistan, Turkey and the Maldives from the international travel ‘red list, to make “travel easier” for fully vaccinated people.\nTransport Secretary Grant Shapps said double-vaccinated travellers coming from non-red list countries will no longer have to take pre-departure tests from 4 October.\nThe measure has been taken to “reduce costs, take advantage of higher levels of vaccination and keep us all safe,” Transport Secretary Grant Shapps was quoted by the UK Sky News and said he was delighted to tell holidaymakers the UK government were making “testing easier for travel”.\nShapps said he hoped the new measures would “strike the right balance to manage the public health risk as No.1 priority”.\nIn a tweet, he said: “We’re making testing easier for travel. From Mon 4 Oct, if you’re fully vax you won’t need a pre-departure test before arrival into England from a non-red country and from later in Oct, will be able to replace the day 2 PCR test with a cheaper lateral flow.”\nThe eight countries that got the relief include Turkey, Egypt, the Maldives, Sri Lanka, Oman, Bangladesh, Pakistan and Kenya from Wednesday 22 Sept at 4 am.\n“We’ll also be introducing a new simplified system for international travel from Mon 4 Oct, replacing the current approach with a single red list and simplified measures for the rest of the world – striking the right balance to manage the public health risk as No.1 priority.”\nPakistan was placed on the red list by the UK on April 9. Travellers from Pakistan had to face a mandatory 10-day hotel quarantine with costs as high as 2,250 British pounds if they arrived in the UK.\nPakistan welcomed the decision saying the scientific data shared with the UK was duly acknowledged and played a key role in lifting the curbs.\nForeign Minister Shah Mehmood Qureshi in a video message congratulated the people who have been unable to travel and to meet their family members for months and hoped it would ease their sufferings. He said the removal of Pakistan from the UK red list would also ease the heavy cost the travellers between the two countries had to bear, due to the restrictions.\nHe was in particular appreciative of the former British Foreign Secretary Dominic Raab, who during his last visit to Pakistan, was apprised in detail about the problems of the British Pakistani citizens and how Pakistan was tackling the Covid19 pandemic in a  scientific manner.\nAsad Umar termed it as “the right decision” taken to take Pakistan off red list. He said the UK high commission to Pakistan has been supportive throughout.\n“Support for conveying facts about the covid situation in Pakistan by UK parliamentarians is also highly appreciated.”\nBritish High Commissioner to Pakistan in a tweet said that he was pleased to confirm that Pakistan was off the red list.\n“I know how difficult the last 5 months were for so many who rely on close links between the UK and Pakistan.”\nHe said he was grateful to Dr Faisal Sultan and Asad Umar, NCOC and all others for their close collaboration. He said the United Kingdom would continue to work closely with Pakistan to ensure data sharing and safeguard public health in both countries.\n“No one is safe until everyone is safe,” the ambassador said.\nMinister for Human Rights Dr Shireen Mazari in response to a tweet by Ambassador Turner attributed it to the strong stance by Prime Minister Imran Khan on the issue and also the UK MPs including Naz Shah and Afzal Khan, besides the scientific data provided by Dr Faisal Sultan and NCOC. She was also appreciative of the support of the British High Commissioner to Pakistan. However, she pointed that since “Pak[istan] was dealt with unfairly so it was time for [the] UK govt to put things right!”\nDr Faisal Sultan termed it great news for those waiting to travel. He also expressed gratitude to Ambassador Turner and others in the UK gov who engaged with the team in Pakistan “for an in-depth understanding of our epidemic response and systems as well as the ongoing sharing of data and information to enable disease security.”\nUnder the new system simpler, cheaper rules for fully vaccinated travellers coming from non-red list countries have been adopted.\nNow the fully vaccinated passengers will be able to replace day 2 PCR tests with cheaper lateral flow tests – from the end of October – and no longer need to take pre-departure tests (PDTs) and the UK government would recognise full vaccinations from a further 17 countries and territories including Japan and Singapore.",
  "retrievedAt": "2025-08-11T21:15:46.603Z"
}
