{
  "title": "GC Asghar Mall opens admissions for BS programmes with best co-curricular activities",
  "link": "https://www.app.com.pk/national/gc-asghar-mall-opens-admissions-for-bs-programmes-with-best-co-curricular-activities/",
  "date_published": "2022-10-23T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): The Government Graduate College Asghar Mall has opened admissions for its four-year bachelors programmes in over 14 disciplines welcoming students from across the country with best educational and sports facilities.\nHead of Geography Department and In-charge Co-Curricular Activities Associate Professor Sajid Mahmood Farooqi told APP that after the Higher Education Commission (HEC) policy guidelines for implementing BS programme across the country; the college, being a post graduate institution, started the admissions.\nProf Sajid informed the college had received the affiliation and no objection certificates (NOCs) for more than 14 BS programmes namely Economics, English, Chemistry, Botany, Zoology, Statistics, Geography, Physics, Mathematics and Urdu from the University of the Punjab.\nHowever, after receiving the pending university affiliations for BS programmes in Psychology, History, Education, and Islamic Studies, the admissions were also opened in these disciplines, he added.\nHe informed that the admissions had commenced from October 22, 2022, and all eligible and interested candidates were requested to apply in the BS programmes.\nMoreover, Principal Prof Dr Abdul Kabir Mohsin, keeping in view the sports potential of the institution, has vowed to hold full-blooded sports activities in the college. The college in the past have won many sports and co-curricular contests like debates and declamation at the district, division and provincial levels and won prestigious prizes conferred by the chief ministers of Punjab in various decades, he added.\nHe pointed out that the Central Library of the College was a treasure house of knowledge that was yet unexplored by the students due to their reading habits and priorities. “The college has posted a proper librarian who is capable enough to maintain the precious stocks of centuries old books that were lying under the dust of time due to no proper bookkeeper in the past,” he said.\nThe library was shifted to the main block with proper space and facilities equipped with computers to ensure a complete university-level environment for the BS students.\nProj Sajid said the current administration, under the supervisions of Prof Dr Abdul Kabir Mohsin, initiated various projects of construction, rehabilitation and repair in the college. Moreover, repair of old sewage system of the college was also started whereas a proper parking shed was constructed for students and the teachers, he added.\nHe informed that many initiatives like installation of new cameras and shifting the connectivity of entire college over WiFi were also in the pipeline.\nTo another query, he said former fast bowler Shoaib Akhtar aka Rawalpinid Express was the alumnus of the Government Post Graduate College Asghar Mall.\nHe also noted, “Majority of the faculty members are MS and PhDs and hold a vast experience in teaching with best personal abilities for sharpening students interpersonal and extracurricular skills.”\nProf Sajid told that there was an advisory committee that was guiding and counseling the new entrants for better selection of subject combination as per their aptitude which was also another facility in the college.\nHe also informed that the college’s various departments like English and Islamiat were overburdened due to limited teaching staff and increased workload after the start of BS programmes whereas the college faculty was making all-out efforts to ensure quality education.\nHe urged the provincial government to look into the matters pertaining to lack of structural amenities like furniture and others in the college.",
  "retrievedAt": "2025-08-11T15:46:55.383Z"
}
