{
  "title": "Islam rejects sectarianism, extremism, terrorism in all forms: Ashrafi",
  "link": "https://www.app.com.pk/national/islam-rejects-sectarianism-extremism-terrorism-in-all-forms-ashrafi/",
  "date_published": "2022-10-23T09:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP):Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mahmood Ashrafi said Islam rejected sectarianism, extremism, and terrorism in all their forms and manifestations.\nAddressing an ‘International Tahzeem-e-Harmain Al-Sharifain Conference’ in Abuja (Nigeria) the other day, he said to get rid of these social evils, it was necessary to disseminate the message of Islam in its actual context, which we received from the holy lands of Makkah and Madinah.\nAshrafi who is also the Chairman of Pakistan Ulema Council and Secretary General of International Tahzeem-e-Harmain Al-Sharifain Council said there was no room for such myths in Islam as it was a religion of peace, security, and moderation.\nHe said the situation of unrest in some Islamic countries was due to external interference which could be stopped by forging unity in the Muslim Ummah.\nHe said the union would help contain Islamophobia and resolve the issues confronting the Muslim Ummah on the global level. He also endorsed the stance of Saudi Arabia on the oil issue. He said that Pakistan and the entire Islamic world were standing by its narrative for global economic stability.\nAshrafi said the entire Muslim Ummah’s message was loud and clear that they would not compromise on the security, sanctity, and stability of the soil of Harmain Al-Sharifain at all costs.\nHe said Kashmir and Palestine were the two burning issues of Muslim Ummah, and they should be resolved as per the will of the Kashmiris and Palestinians.\nHe said interfaith dialogue was also the need of the hour adding that Pakistan had prepared a document, titled ‘Paigham-e-Pakistan’ (Message of Pakistan) to get rid of sectarianism, extremism, and terrorism.\nTerming Harmain Al-Sharifain as the center of Muslim Ummah, he said the way Saudi Arabia serves humanity was admirable and praiseworthy.\nBesides leading Ulema, Mashaykh and religious scholars from all over the Islamic world, Dr Ibrahim Jamia Otoyo, Dr Dawood Abdul Baqi Muhammad, Dr Imam Issa Abdul Kareem, Dr Sulaiman Usman, Dr Muhammad Abdullah Al-Thani, Dr Sharafuddin Badibur Aji, Dr Muhammad Munir Ilyas, Dr Muhammad Al-Haaj Abu Bakr, Dr Abu Bakr Muhammad Al-Thani, and Dr Al-Khizar Abdul Baqi Muhammad also addressed the conference.",
  "retrievedAt": "2025-08-11T15:46:58.910Z"
}
