{
  "title": "Arrangements made to counter COVID-19 during its peak period: Chairman NDMA",
  "link": "https://www.app.com.pk/national/arrangements-made-to-counter-covid-19-during-its-peak-period-chairman-ndma/",
  "date_published": "2020-06-10T20:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP):Chairman National Disaster Management Authority (NDMA) Lt Gen Muhammad Afzal on Thursday said all adequate measures had been taken to counter COVID-19 pandemic during its peak period anticipated from third week of June to the last week of July and that the NDMA was actively involved in need based operational activities across the country.\nHe said the Authority was assigned operational task besides its role of disaster management since the inception of National Command and Control Center (NCOC) on March 27, for taking strategic decisions against the fatal viral disease.\nIn an exclusive talk with a private news channel, the chairman NDMA said up to March 14, even normal face masks were unavailable in the country but today, health workers had been provided personal protection equipments (PPEs) besides increasing the number of Labs from five to 107. Similarly, he told, our testing capacity had been enhanced from 500 to 100000 along with making arrangements of around 550 portable and ICU ventilators in the country. The number of oxigenated beds and ventilators would also be enhanced to 1000 plus this month, he added.\nTo a question about the NDMA’s public portal for integrated information, Gen Afzal told that currently, the Authority’s portal was accessible for hospital authorities, Rescue 1122 and other relief organizations only, which would be also be made accessible to general public soon to get hands on information about the facilities available at all hospitals across the country.\nTo yet another question about the Sindh government’s complaint about having not received any ventilator, he told the Authority has so far provided 74+25 portable, 26 ICU ventilators and 26 y-pipes to the province, all to the respective district administration through systematic way of Pak Army’s Corps office by getting its receipts. He also added that the Authority would share its documented proof and videos with media today.\nUpdating about the Authority’s measures ahead of critical period for corona next month, he said the Authority had plan to arrange 1000 oxigenated beds by the end of this month and additional 1000 similar beds during next month.\nWe will also have provision to increase it in accordance with needs and time, he added.",
  "retrievedAt": "2025-08-11T19:19:38.410Z"
}
