{
  "title": "PM’s concept of smart lockdown acknowledged by world: Fawad",
  "link": "https://www.app.com.pk/national/pms-concept-of-smart-lockdown-acknowledged-by-world-fawad/",
  "date_published": "2020-06-10T20:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP):Minister for Science and Technology Chaudhry Fawad Hussain Thursday said Prime Minister Imran Khan’s concept of smart lockdown amid coronavirus acknowledged by the world.\nTalking to a private news channel, he said many countries including Pakistan had eased in lockdown to facilitate their people especially daily wagers.\nHe said the present government had announced hefty economic relief package in the shape of Ehsaas programme to financially empower common man.\nHe said the prime minister had clear policy and strategy towards the deadly virus that the standard operating procedures (SOPs) should be followed including maintaining social distancing and adopting other precautionary measures.\nThe government was giving priority to the national economy, because complete lockdown could have serious implications and adverse effects on the economy, he added.\nThe minister said the Pakistan Muslim League-Nawaz (PML-N) was opposing and criticizing his suggestion of National Assembly’s virtual session for political point-scoring while many members of the Parliament were suffering from the deadly virus.\nHe also offered the provincial assemblies to take services of Ministry of Science and Technology for virtual session and Sindh Information Minister Syed Nasir Hussain Shah, in a television talk show, had accepted the offer.\nHe said he would prefer to watch fiscal budget 2020-21 on television amid threats of COVID-19 pandemic.\nHe further said Pakistan would be self-sufficient in manufacturing ventilators soon as many universities were conducting research as within a week testing kits had been made in the country to diagnose the coronavirus patients.",
  "retrievedAt": "2025-08-11T19:19:38.407Z"
}
