{
  "article_id": "2025-02-26_a5ca7ee40d28001188e26d1a37c47e4e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-finance-minister-aurangzeb-meets-governor-kundi-to-discuss-economic-issues-of-kp/",
    "retrieved_at": "2025-08-27T13:09:14.254Z"
  },
  "metadata": {
    "title": "Federal Finance Minister Aurangzeb meets Governor Kundi to discuss economic issues of KP",
    "author": null,
    "date_published": "2025-02-26T13:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Feb 26 (APP): Federal Finance Minister Muhammad Aurangzeb and Minister of State for Finance Ali Pervaiz Malik visited the Governor House here on Wednesday, and discussed economic issues of the province with Governor Khyber Pakhtunkhwa Faisal Karim Kundi. During the meeting, they held detailed discussions on the province's political, social, and economic situation, along with the financial challenges it faces. Governor Kundi raised concerns regarding the release of National Finance Commission (NFC) Award funds and developmental funds for the merged districts from the federal government. The discussion also covered the business community's and tribal residents' reservations regarding the implementation of taxes in the merged districts. Governor Kundi emphasized that the timely release of promised development funds is crucial to integrating the merged districts into the national development framework. He expressed disappointment that the funds allocated for these districts were not fully utilized for their intended purpose by the provincial government. Furthermore, the Governor presented economic and financial proposals from the province's business community to the finance minister. In response, Finance Minister Aurangzeb reaffirmed the federal government's commitment to supporting KP's economic growth. He acknowledged the concerns of the business community and stressed that the federal government wants to see all provinces progress economically. He also highlighted that KP's business community has been given representation in the former FATA and PATA committees. The meeting concluded with a shared commitment to ensuring economic stability and financial support for the province, particularly for the development of the merged districts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}