{
  "article_id": "2025-02-26_7a2bb0319ec14f6359066ec0dff533ed",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sustainable-investments-must-for-social-enterprise-ecosystem-rana-mashood/",
    "retrieved_at": "2025-08-27T13:09:00.571Z"
  },
  "metadata": {
    "title": "Sustainable investments must for social enterprise ecosystem: Rana Mashood",
    "author": null,
    "date_published": "2025-02-26T13:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 278,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 26 (APP):Chairman Prime Minister Youth Programme Rana Mashood Ahmed Khan on Wednesday said that the future of country's social enterprise ecosystem lies in sustainable investments for long-term change and innovation. He was addressing the first international summit on building a thriving social enterprise ecosystem in Pakistan, organized by Social Innovation Academy. He said that inaugural international summit marks a historic milestone. \"We have welcomed esteemed investors from the Kingdom of Saudi Arabia and the Kingdom of Thailand.\" He said that this unprecedented gathering bridges the gap between investors and the social enterprise ecosystem, fostering a dynamic exchange of ideas and opportunities. Rana Mashhood that said this is a very first international summit where all the investors from kingdom of Saudi Arabia and kingdom of Thailand have joined us and it's that kind which is connecting the bridge between the investors and social surprises ecosystem. He said the partnership between the Social Innovation Academy and the Prime Minister's Youth Program has been instrumental in shaping this conference into a vibrant platform. By bringing together academia, ecosystem, partners, stakeholders, investors, and policymakers under one roof, the conference fosters a unique environment for collaboration, innovation, and social impact, he said. He said Pakistan has taken a significant step towards empowering its youth by actively involving them in the country's policy-making process, adding that this strategic move not only shapes the social entrepreneurship culture in Pakistan but also ensures that the country's future leaders are well-equipped to drive positive change. He highlighted that Pakistan is at a pivotal stage, now ready to receive investment in social impact projects, signaling a significant shift in the country's approach to solving social problems.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}