{
  "article_id": "2025-02-26_e851ccb176576d0950ea6bfde9298c57",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-uzbekistan-pledge-to-deepen-strategic-partnership/",
    "retrieved_at": "2025-08-27T13:08:29.125Z"
  },
  "metadata": {
    "title": "Pakistan, Uzbekistan pledge to deepen strategic partnership",
    "author": null,
    "date_published": "2025-02-26T15:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1045,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "TASHKENT, Feb 26 (APP): Prime Minister Shehbaz Sharif and President of Uzbekistan Shavkat Mirziyoyev have reaffirmed their commitment to strengthening bilateral ties, expanding trade, and enhancing regional connectivity during the prime minister's official visit to Uzbekistan. According to a joint declaration on the outcomes of the visit of PM Shehbaz Sharif to President Shavkat Mirziyoyev issued on Wednesday, both leaders expressed satisfaction over the progress made in Pakistan-Uzbekistan relations since the establishment of diplomatic ties 33 years ago. During the talks, the two leaders discussed the ways and means to further strengthen the strategic partnership; exchange views on the current state and prospects of bilateral cooperation in all spheres, and on issues of regional and international importance. The two leaders reaffirmed their commitment to further strengthen relations and elevate cooperation to a qualitatively new-level, that meets the fundamental interests of both countries and serves to ensure peace and stability in our regions. They noted the steady progress in bilateral relations and reiterated their dedication to the Strategic Partnership Declarations of July 16, 2021, and March 4, 2022. The two sides strongly determined to comprehensively develop and strengthen cooperation in order to support each other's sovereignty, independence and territorial integrity. They expressed their support for the development and expansion of regular political dialogue, including in the format of formal and informal summits. In this regard, they positively assessed the outcomes of the talks held within the framework of the Astana Conference on Interaction and Confidence Building Measures in Asia on 13 October 2022 and the Baku COP-29 Summit on 12 November 2024. The two sides emphasized the importance of further expanding inter-parliamentary ties, which contribute to a steady enhancement of the potential of political, economic, cultural and humanitarian cooperation, as well as to the development of traditional ties of friendship between the peoples of the two countries. The two leaders underlined the outcomes of the 9th Session of the Joint Inter-Governmental Commission on Trade-Economic and Scientific-Technical Cooperation between the Uzbekistan and Pakistan, held in Tashkent on November 3-4, 2024. Uzbekistan and Pakistan also agreed to expand trade and economic relations and industrial cooperation aimed at strengthening the economic potential of the two countries and improving the well-being of their populations, as well as to increase the trade turnover up to $2 billion over next four years through among other things successfully implementing the Transit Trade Agreement (2021) and Preferential Trade Agreement (2023), encouraging and facilitating investment in each other's Special Economic Zones and promoting the B2B collaboration . The two leaders underscored the importance of connectivity as a means of regional integration and economic development. They noted that Uzbekistan-Afghanistan-Pakistan corridor was the most efficient and economical trade route for the entire region. In this context, they underscored the importance of Uzbekistan-Afghanistan-Pakistan (UAP) Railway Project and reiterated their commitment for the same. The two leaders emphasized the need to intensify efforts on expanding cooperation between the countries in order to increase the efficiency of the use of transport routes, in particular to develop the Uzbekistan-Afghanistan-Pakistan multimodal transport corridor, as well as to broaden the opportunities for facilitating transport services. In this regard, the two leaders underscored the significance of implementation of the Trans-Afghanistan Railroad construction project. Both sides reiterated their willingness to implement the Uzbekistan-Afghanistan-Pakistan (Mazar-e-Sharif to Kharlachi) Railway Project. Uzbekistan and Pakistan will continue to strengthen cooperation in the international arena and provide each other with comprehensive support in promoting peace initiatives. The two leaders agreed to expand multifaceted bilateral cooperation in all areas of mutual interest and emphasized the importance of closer coordination of positions in the international arena. To this end, they decided to utilize existing political and economic mechanisms between the two countries, including political consultations between the Ministries of Foreign Affairs. The two sides also agreed to continue to coordinate their actions within the framework of the United Nations and its specialized bodies, the Organization of Islamic Cooperation, the Economic Cooperation Organization, the Shanghai Cooperation Organization, the Non-Aligned Movement and other international and regional structures. In the context of complex international situation, the two sides expressed a shared opinion on the importance to enhance the role of the United Nations and its institutions in solving global problems, ensure sustainable development, and strengthen security and stability in the world. Uzbekistan and Pakistan pledged to consider favorably each other's candidatures for various positions within international organizations, enhancing their shared efforts to uphold international law and strengthen cooperation. Pakistan warmly welcomed the holding of the 43rd session of the UNESCO General Conference in Samarkand in 2025. In addition, the Pakistani side noted its regular participation in the meetings of working groups on Uzbekistan's accession to the WTO and its support for Uzbekistan's early accession to the organization. The two leaders emphasized the importance of efforts aimed at facilitating the transformation of Afghanistan into a peaceful and prosperous state that effectively confronts terrorist groups and prevents threats to any country, particularly to its neighbors. The two leaders also exchanged views on their respective regional situations including issues of their core concern and of mutual interest. They agreed that peaceful resolution of all issues in accordance with UN General Assembly, and Security Council Resolutions would lead to progress and prosperity of both Central and South Asia regions, and beyond. Both sides expressed their support for the people of Palestine in their just struggle for self-determination, as well as for the establishment of a sovereign, independent, and contiguous Palestinian state based on pre-1967 borders. The two sides agreed to continue promoting the ideas of inter-faith, cultural and inter-ethnic harmony, mutual respect and religious tolerance, in supporting international efforts to combat Islamophobia, and in strengthening solidarity among Muslim countries. The two leaders expressed readiness to consistently expand cooperation in education, science, health care, tourism, information technology and sports. The two sides underscored that the talks held during the visit and bilateral documents signed will serve to further strengthen the strategic partnership between the two countries. Prime Minister Shehbaz Sharif expressed gratitude to President Shavkat Mirziyoyev and the people of Uzbekistan for their hospitality and invited the leader of Uzbekistan to visit Pakistan at a convenient time in order to further develop comprehensive cooperation, to which he accepted. The date of the visit will be agreed upon through diplomatic channels.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}