{
  "article_id": "2025-02-26_a0837fe64e548e7018a62d716f125e3c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndu-nust-win-ict-round-of-university-debating-contest/",
    "retrieved_at": "2025-08-27T13:09:14.107Z"
  },
  "metadata": {
    "title": "NDU, NUST win ICT round of university debating contest",
    "author": null,
    "date_published": "2025-02-26T13:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 377,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 26 (APP):National Defence University (NDU) Islamabad and the National University of Sciences and Technology (NUST), Islamabad have respectively won the Urdu and English debate contests in the ICT Regional Round of Pakistan University Debating Championship 2024-25. The Championship was held on Wednesday at the Higher Education Commission (HEC) Secretariat. The winners of the Debating Championship were awarded trophies and cash prizes. The first position holders in both Urdu and English won cash prizes of Rs. 100,000 each, while the second and third position holders respectively received Rs. 80,000 and Rs. 60,000. In the Debating Championship, University of Baltistan, Skardu clinched second position in the Urdu debate, followed by University of Ponch, Rawalkot which secured third position. Similarly, Air University, Islamabad clinched the second position in the English debate, while Capital University of Sciences & Technology won the third position. Addressing the participants, Chairman HEC Dr. Mukhtar Ahmed congratulated the winning teams. He also congratulated the HEC team and university representatives in making this event a success. Dr. Mukhtar Ahemd said that Pakistani youth have a great potential and capabilities. Youth bulge is a blessing for the country and we're trying our best to provide them maximum facilities to help them contribute to nation building, he added. \"A large portion of our population is youth and they're the future of this country,\" he concluded. Earlier in her opening remarks, Managing Director National Academy of Higher Education (NAHE) Ms. Noor Amna Malik said that the Debating Championship is a healthy activity from HEC for the students to say their heart out. She concluded saying that youth are the future of the country and we believe in helping them to be successful in every walk of life. \"I believe that today each and every participating team is a winner,\" she added. Prof. Dr. Hussain Shaheed Soharwardi, Professor, University of Peshawar, Dr. Ghani Rehman, Associate Professor, Hazara University, and Mr. Arsalan, English News Head, PTV World rendered their services as judges of English debates, while for the Urdu judges, the judges were Mr. Amjad Iqbal, Associate Professor/ National Syllabus Writer, Islamabad College for Boys G-10, Islamabad, Dr. Ahmad Usman, Associate Professor/ All Pakistan Debating Champion, University of the Punjab, Lahore, and Mr. Ikram Chaudhary, Senior News Editor, PTV News.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}