{
  "article_id": "2025-02-26_7d3f1387fb2a60d2760bad2b78d8fad0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ethiopian-ambassador-meets-with-punjab-governor-to-strengthen-bilateral-ties/",
    "retrieved_at": "2025-08-27T13:09:04.528Z"
  },
  "metadata": {
    "title": "Ethiopian Ambassador meets with Punjab Governor to strengthen bilateral ties",
    "author": null,
    "date_published": "2025-02-26T12:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 183,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 26 (APP): Ethiopian Ambassador to Pakistan Dr. Jemal Beker Abdula, Wednesday called on Punjab Governor Sardar Saleem Haider Khan at the Governor House in Lahore. The meeting aimed to bolster bilateral relations between Ethiopia and Pakistan, exploring avenues for cooperation in business, trade, investment, health, education, science, technology, and climate change, said a press release issued by Ethiopian Embassy. Ambassador Dr. Jemal highlighted Ethiopia's strategic position as a gateway to Africa, facilitating Pakistan's \"Look Africa and Engage Africa\" policy. He noted the launch of Ethiopian Airlines in Karachi, with plans to commence operations in Lahore, enhancing business-to-business and people-to-people ties. The Ambassador extended an invitation to the Governor to attend the Single Country Exhibition of Pakistan in Addis Ababa, Ethiopia, scheduled for May. Governor Khan appreciated Ambassador Dr. Jemal's efforts in promoting bilateral relations and assured his support for strengthening ties between the two nations. The meeting also underscored the importance of addressing climate change, with the Governor expressing his desire to collaborate with the Ambassador on initiatives like the Green Legacy Initiative launched by Ethiopian Prime Minister Dr. Abiy Ahmed.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}