{
  "article_id": "2025-02-26_4191eb5316420d008c6bb8ab4e6d205f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-for-timely-completion-of-projects-2/",
    "retrieved_at": "2025-08-27T13:08:26.102Z"
  },
  "metadata": {
    "title": "NA body for timely completion of projects",
    "author": null,
    "date_published": "2025-02-26T17:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 26 (APP):The National Assembly Standing Committee on Energy (Power Division) on Wednesday endorsed all the budgetary proposals of Ministry of Energy (Power Division) and its attached departments for the financial year 2025-26. Chaired by MNA Muhammad Idrees, the Committee directed that M/o Energy (Power Division) may complete the ongoing projects before initiating new projects and ensure the completion of all projects within given time frame as it had been observed that unnecessary delay escalate the costs of the projects. The Committee expressed concern over the poor performance of Lahore Electric Supply Company (LESCO) and directed that LESCO may strengthen its accountability system to penalized the black sheep of their department to overcome the theft of electricity. The Committee also expressed concern for imposing 78 lac extra units on the electricity consumers of District Kasur on the presumption of theft. The Committee therefore, constituted a four members sub-committee headed by Rana Muhammad Hayat Khan, MNA to probe into the matter. The sub-committee would submit its report within 30 days. Earlier, Secretary, Ministry of Energy (Power Division) briefly apprised the Committee about the efforts made by the present government to reduce the electricity bills and to overcome the line losses and the problems faced by them in this regard. The meeting was attended by the MNA's, Sheikh Aftab Ahmed, Ch. Naseer Ahmed Abbas, Rana Muhammad Hayat Khan, Malik Anwar Taj, Mr. Sher Ali Arbab, Syed Mustafa Kamal (through video link) Syed Waseen Hussain, Haji Imtiaz Ahmed Ch., Mr. Ali Afzal Sahi.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}