{
  "title": "Kundi seeks Centre’s intervention for Kurram peace - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Amid ongoing unrest in Kurram district, Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Saturday called for urgent intervention from the federal government and armed forces to restore stability attributing the area’s current turmoil to the ‘failure’ of the PTI-led government, which he said had contributed to the escalating crisis.\n\nThe governor also highli­g­h­ted his “efforts” to foster consensus among political parti­­es in the province, emphasising his role in working tow­a­rds lasting peace. He revealed that he would soon lead a delegation of political leaders from his province to meet PM Shehbaz Sharif and President Asif Ali Zardari to further these discussions.\n\n“The situation still remains extremely critical and concerning,” Mr Kundi said when asked if there was any improvement in the Kurram situation following the recent deal between rival groups.\n\nKP governor blames PTI govt’s failure to handle situation for escalating crisis\n\n“There are bunkers and sophisticated weapons that our police are unable to manage or combat. The peace deal has not yielded significant results because those working to resolve the issues lack support from the government. Without that backing, peace cannot be achieved,” he said.\n\nAfter months of violence that killed more than 130 people, a peace agreement was signed between the warring sides last week. But despite a lull in fighting, the route connecting Parachinar with the rest of the province remains blocked.\n\nAsked about the way forward, given the failure of the accord to bring peace, Mr Kundi promptly shared his perspective. “I believe the only way forward is for the federal government and armed forces to intervene and bring peace,” he said.\n\nThe KP governor raised concerns over the PTI government’s handling of provincial resources, questioning its spending of substantial funds since 2013 while failing to strengthen the police force.\n\n“The PTI government must explain how it spent the Rs500 billion it has received from the Centre for the war on terror since 2013,” he said. “This province is at the forefront of terrorism, yet it lacks a police force capable of combating it. Our police are under-equipped, with inadequate weapons, technology, and training. It’s a waste of public money, and the PTI government should be held accountable for this failure.”\n\nHe also suggested inclusion of leader of the opposition in the KP Assembly in the provincial apex committee, which formulates strategies against terrorism.\n\nGovernor Kundi also criticised CM Ali Amin Gandapur, noting that his role in cases related to terror, murder, and violence undermines his ability to address the KP’s deteriorating security situation.\n\n“How can the CM, who is himself implicated in these cases, explain the worsening crisis due to the security administration? He is part of the problem,” he added.\n\nPublished in Dawn, January 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:38:25.590Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884639/kundi-seeks-centres-intervention-for-kurram-peace",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T02:04:07.000Z"
}
