{
  "title": "Commission sought for release of children trapped in blasphemy cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Human rights activists have demanded of the government to form an independent investigation commission to get children trapped in blasphemy cases released.\n\nThe demand came from lawyer Usman Warraich, Rana Abdul Hameed Advocate and Iman Mazari Advocate and the parents of the affected children at a news conference here at the National Press Club.\n\nLawyer Usman Warraich said that according to a report by the Special Branch last year, a suspicious religious extremist group is trapping Muslim boys and girls into sharing blasphemous content online under specific plan.\n\nSo far, more than 450 Muslim youth have been victims of false cases, including more than 150 in Adiala Jail, more than 170 in Lahore Camp Office Jail and Kot Lakhpat Jail and 55 youths in the call cells of Karachi Central Jail.\n\nHe said that a group has recruited young boys and girls for trapping innocent -who befriend innocent youths on social media and lure them by pretending to be in love with them.\n\nUnder various pretexts including friendship, job, date or spending the night, they go to the Safe House located in G-8 area of Islamabad. They call where the members of this group brutally torture these boys, which includes hanging them upside down and beating them with sticks, making their videos, etc.\n\nThe number of people associated with this group is 25 to 30 who become plaintiffs after trapping young people from all over Pakistan, and each plaintiff is involved in trapping more than 20 young people. These plaintiffs also write their incorrect addresses in the FIR.\n\nThe lawyers have demanded that until a commission is formed in this regard proceedings over such cases should be stopped and minor children should be released.\n\nPublished in Dawn, January 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:37:58.809Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884587/commission-sought-for-release-of-children-trapped-in-blasphemy-cases",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T02:04:50.000Z"
}
