{
  "title": "PM urges global efforts to boost girls’ education - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Shehbaz seeks collective efforts to remove sociocultural impediments\n• Muslim World League chief highlights need to counter misconceptions\n• Malala attends conference snubbed by Afghan Taliban\n\nISLAMABAD: Prime Minister She­h­baz Sharif has called for collective effo­rts to remove cultural or social impediments to ensure women’s access to education, as education leaders from Muslim countries convened in Islamabad to collaborate on initiatives for advancing girls’ education.\n\nA two-day international confere­nce, ‘Girls Educa­tion in Muslim Com­m­u­nities: Challenges and Opportu­nities,’ commenced in Islam­abad on Saturday to foster dialogue and find actionable solutions to address problems in this regard.\n\nThe summit brou­ght together leaders from Muslim-majority countries, including Nobel Laureate Malala Yousafzai, but without Afghanistan — the only country where girls are banned from pursuing higher education. Education Minister Khalid Maqbool Siddiqui told AFP that Islamabad had extended an invitation to Kabul, “but no one from the Afghan government was at the conference”.\n\nIn his address at the conference, Prime Minister Shehbaz Sharif called upon global and local organisations, philanthropists, and entrepreneurs to join them in creating scalable and sustainable opportunities for ensuring women’s education.\n\nThe premier said that in the next decade, millions of young girls would enter the job market. As they do so, they have the potential not to just lift themselves, their families, and the nation out of poverty but also to enrich the global economy and find innovative solutions to their shared challenges, he added.\n\nPM Shehbaz stressed that they should assure the women that their rights would be respected, their ambitions would be met, and that no cultural or social impediment would stand in the way of their dreams. He said that despite their rich legacy, the Muslim world, including Pakistan, was facing numerous challenges in ensuring equitable access to education for girls. He said denying education to girls was tantamount to denying them their right to a bright future.\n\nIn Pakistan, the prime minister said, women comprised half of the population, but the female literacy rate stood at 49 per cent, while alarmingly around 22.8 million children, in the age bracket of five to eight years, were out of school. The premier said inadequate infrastructure, safety concerns, as well as deeply entre­nched societal norms further exacerbated this problem, creating a cycle of deprivation, spanning generations.\n\nHe also extended gratitude to the Muslim World League for its unwavering commitment to education and announced the signing of the ‘Islamabad declaration’ in line with the UN objectives and as a collective aspiration for the Muslim Ummah.\n\n‘Countering misconceptions’\n\nMuslim World League (MWL) Sec­r­e­tary General Muhammad Bin Abdul Karim Al-Issa stressed the need to counter misconceptions propagated by certain groups regarding girls’ education per Islam. He said misconceptions existed in some Islamic societies, but this con­­­ference had brought toge­ther scholars to refute these beliefs and publish a unified declaration. “We aim to spread this message globally, particularly in Islamic countries, to counter the misinterpretation propagated by certain groups,” he explained.\n\nHe said the event, organised by the MWL in collaboration with Pakistan, aimed to highlight the significance of women’s education in Mu­­slim societies and addr­ess misinformation surrounding the issue. Dr Al-Issa stated that this conference was part of an initiative by the Muslim World League to promote women’s education and underline its importance.\n\nHe said a session with scholars from various Islamic schools of thought was held on Friday in which they unanimously agreed that education was equally essential for women as it was for men. Dr Al-Issa highlighted that the conference would culminate in the ‘Islamabad declaration’, which would dispel misconceptions about women’s education in Muslim countries.\n\nThis declaration will be a message to the world that all Islamic scholars and schools of thought were in agreement on the necessity of women’s education for societal progress, he said, adding that Islam strongly supported women’s education and that those opposing it had no valid basis.\n\nSheikh Dr Nazir Muham­mad Ayad, Mufti of the Arab Republic of Egypt, stressed the Quranic and prophetic emphasis on education as a universal right. “Educating women is not a privilege; it is an obligation deeply rooted in Islamic jurisprudence and essential for the advancem­ent of society,” he remarked.\n\nProfessor Hina Tayyaba Khalil, vice-chancellor of Pakistan Institute of Fashion and Design, Lahore, stressed the economic and social gains of empowering women through education.\n\nDrawing on examples from Pakistan, she pointed out that investment in girls’ education leads to long-term benefits for families and communities. “International and Islamic charters toge­ther create a robust framework for advocating women’s education as a fundamental right and a social necessity,” she noted.\n\nMalala in limelight\n\nNobel Peace Prize laureate Malala Yousafzai said she was “overwhelmed” to be back in her native Pakistan on Saturday, as she attended a summit on girls’ education in the Islamic world that has been snubbed by Afghanistan’s Taliban government. Ms Yousafzai, who was shot by the TTP militants in 2012 when she was a schoolgirl, will address the conference today.\n\n“I’m truly honoured, overwhelmed and happy to be back in Pakistan,” she told AFP as she arrived at the co­­nference with her parents. On Friday, she posted on so­­cial media that she would speak about “why leaders must hold the Taliban accou­ntable for their crimes aga­inst Afghan women & girls”.\n\nSince returning to power in 2021, the Afghan Taliban government has imposed an austere version of Islamic law that the United Nations has called “gender apartheid”.\n\nPublished in Dawn, January 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6783152a3cb69.gif",
  "retrievedAt": "2025-10-12T01:11:41.706Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884629/pm-urges-global-efforts-to-boost-girls-education",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T02:03:54.000Z"
}
