{
  "title": "Exports to Europe rise to $3.8bn in July-Nov - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Exports to European countries grew 8.62 per cent in the first five months of the current fiscal year, mainly due to higher shipments to western states.\n\nThe resurgence in exports to Europe in the current fiscal year was due to a slight increase in demand for Pakistani goods in western, eastern and northern Europe.\n\nIn absolute terms, Pakistan’s exports to the European Union (EU) reached $3.866 billion in July-November FY25 from $3.559bn in the same period last year, according to data compiled by the State Bank of Pakistan.\n\nIn FY24, Pakistan’s exports to the EU dipped 3.12pc to $8.240bn despite its GSP+ status, which allows duty-free entry into most European markets.\n\nIn October 2023, the European Parliament unanimously voted to extend the GSP+ status for another four years until 2027 for developing countries, including Pakistan, to enjoy duty-free or minimum duty on European exports.\n\nWestern Europe, which includes countries such as Germany, the Netherlands, France, Italy, and Belgium, accounts for the largest portion of Pakistan’s exports to the EU. The exports to this region increased by 11.67pc to $1.933bn in 5MFY25, up from $1.731bn in 5MFY24.\n\nThere is also a slight increase in exports to eastern and northern Europe during the period under review. The exports to the north of Europe saw a rise of 10.44pc to $288.351m in 5MFY25, up from $261.092m in the corresponding months last year.\n\nExports to southern Europe saw a paltry decline of 2.89pc to $1.273bn in 5MFY25 from $1.311bn in the corresponding period last year. In this region, exports to Spain dipped 5.94pc to $600.87m in 5MFY25 from $638.85m in the preceding year.\n\nExports to Italy declined 5.24pc to $480.73m in 5MFY25 compared to $501.99m in the same period last year. Exports to Greece recorded a marginal increase of 15.43pc to $59.17m during the year under review against $51.26m over the previous year.\n\nHowever, exports to eastern Europe witnessed a growth of 44.95pc. The export value to this region stood at $372.24m, up from $256.87m in the corresponding period last year.\n\nBefore Brexit, Pakistan’s major export destination was the United Kingdom. In the post-Brexit period, Pakistan’s exports to the UK slightly went up to $935.02 in 5MFY25 from $863.48m over the corresponding period of last year, indicating an increase of 8.25pc.\n\nIn FY24, Pakistan’s exports increased by 2.33pc to $2.014bn to the UK from $1.968bn in the preceding year.\n\nThe British government, however, has assured Islamabad that there will be no change in the post-Brexit scenario, as evidenced by Pakistan’s inclusion in its preferential market access scheme.\n\nPakistan’s exports to Western Europe increased by 11.67pc to $1.933bn in 5MFY24 from $1.731bn last year.\n\nExports to Germany surged 15.29pc to $707.65m in 5MFY24 from $613.77m. Similarly, exports to the Netherlands, the second biggest market for Pakistani goods, increased 10.86pc to $621.16m in 5MFY24 from $560.26m over the corresponding period of last year.\n\nExports to France rose 11.42pc to $230.86m in 5MFY24 from $207.18m, followed by a 9.17pc rise to Belgium’s $257.89m against $236.21m over the same period last year.\n\nPublished in Dawn, January 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:48:32.489Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884643/exports-to-europe-rise-to-38bn-in-july-nov",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T02:04:14.000Z"
}
