{
  "title": "PTI ready for third round of talks: SIC chairman - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sunni Ittehad Council (SIC) Chairman Sahibzada Hamid Raza said on Sunday that the opposition’s negotiation committee was prepared for a third round of talks with the government but expected concrete progress on their demand for a judicial commission ahead of the meeting.\n\nTalks between the government and the PTI commenced in the last week of December to bring down political temperatures, but despite weeks of negotiations, the dialogue process has hardly moved forward on major issues — the formation of a judicial commission and the release of PTI prisoners.\n\nClaim and counter-claim between the government and the opposition continued on Saturday despite the initiation of dialogue after months of deadlock, with the PML-N-led coalition and the PTI accusing each other of derailing negotiation and lacking seriousness.\n\nSpeaking to the media after meeting Imran Khan at Adiala Jail, flanked by PTI leaders Omer Ayub and Asad Qaiser, the SIC chairman said the PTI’s negotiation committee would inform the government that it was ready for another session of talks.\n\nHe, however, added that the government would be urged to make progress on the opposition’s demand for the formation of a judicial commission to investigate the events of May 9 and November 26.\n\n“Even after several weeks, there has been no progress in the negotiations,” he said.\n\n“You would have to show progress in the third meeting,” he said, adding that they would talk about the “nitty gritties” of the judicial commission in the meeting.\n\nSIC chairman Raza said that while both parties were blaming each other for the events that took place on May 9 and November 26, the “civilised” way to deal with the issue was by forming an independent judicial commission.\n\n“We also want to clarify that we don’t want the judge of our choice, we are talking about the senior-most judges of the Supreme Court,” he said.\n\n“We’re talking about an independent judge to lead the commission.”\n\nHe added that the government should show the authority they had been claiming for so long and form a judicial commission.\n\nHowever, he said that if the government failed to form a judicial commission then the negotiations would not move forward.\n\n“Our final date is January 31,” he said.\n\nEarlier in the day, National Assembly Speaker Sardar Ayaz Sadiq said that the government and the opposition should indulge in constructive and positive conversation while respecting each other to yield the desired outcome, according to a statement issued by the lower house of the parliament.\n\nIn the last meeting between the sides, Speaker Sadiq opened the doors to his office for the members of the negotiation committees on a rolling basis, the NA spokesperson said in the statement.\n\n“Ayaz Sadiq not only claimed that he would give the opposition more time than the government, but he acted on it as well,” the spokesperson said.\n\nThe speaker believes in resolving issues through dialogue with understanding and always talks about respecting each other, the spokesperson said, adding that Sadiq was still facilitating the dialogue with sincerity.\n\n“It is the success of the speaker that those who did not shake hands with each other are sitting at a table today,” the statement said quoting the spokesperson, adding that it was the responsibility of the government and the opposition to take advantage of the speaker’s facilitation and work for the betterment of the country.\n\n“The speaker has provided the members a forum and he wants the dialogues to be successful,” it said.\n\nSince Imran’s incarceration last year based on several cases, his party’s relationship with the government, as well as the establishment, has turned exceedingly sour. The PTI has held several protests over the last year, most of which escalated into violence after facing state repression.\n\nFollowing the PTI’s ‘Final Call’ power show last month, tensions escalated as there were renewed calls to ban the party and task forces formed against an alleged “malicious campaign” as the PTI claimed a dozen deaths of its supporters, which the government officially denies.\n\nHowever, after Imran formed a five-member committee to hold talks with “anyone” and his lawmakers had a softened stance in the parliament, the government constituted its own committee comprising ruling coalition members.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/121836189902fe1.png",
  "retrievedAt": "2025-08-26T07:37:55.534Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884705/pti-ready-for-third-round-of-talks-sic-chairman",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T09:54:54.000Z"
}
