{
  "title": "Biden describes Meta decision to do away with fact-checking as shameful - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: US President Joe Biden blasted Meta on Friday for scrapping fact-checking on Facebook and Instagram in the United States, calling the move “really shameful” after a global network warned of real-world harm if the tech giant expands its decision to other countries.\n\nMeta chief executive Mark Zuckerberg triggered alarm Tuesday when he announced the Palo Alto company was ditching third-party fact-checking in the United States and turning over the task of debunking falsehoods to ordinary users under a model known as “Community Notes,” popularised by X.\n\nThe decision was widely seen as an attempt to appease President-elect Donald Trump, whose conservative support base has long complained that fact-checking on tech platforms was a way to curtail free speech and censor right-wing content.\n\n“I think it’s really shameful,” Biden told reporters at the White House when asked about the announcement.\n\n“Telling the truth matters,” he said, adding that the move was “completely contrary to everything America’s about.” The International Fact-Checking Network has warned of devastating consequences if Meta broadens its policy shift beyond US borders to the company’s programs covering more than 100 countries.\n\n“Some of these countries are highly vulnerable to misinformation that spurs political instability, election interference, mob violence and even genocide,” IFCN, which includes dozens of news agencies as members, said in an open letter to Zuckerberg.\n\n“If Meta decides to stop the program worldwide, it is almost certain to result in real-world harm in many places,” it added.\n\nZuckerberg doubled down in an interview Friday with podcaster Joe Rogan, comparing the fact-checking programme with “something out of 1984,” in a reference to George Orwell’s dystopian novel.\n\nHe added that the programme, which began in 2016, was “destroying so much trust, especially in the United States.” Zuckerberg also expressed regret for giving “too much deference” to the traditional media, criticising it for pushing the narrative that social media misinformation had swung the 2016 election in favour of Trump.\n\n‘Consequences’\n\nZuckerberg stunned many when he said on Tuesday that fact-checkers were “too politically biased,” and added that the program had led to “too much censorship.” IFCN’s letter rejected the claim as “false,” insisting that Meta’s fact-checking partners underwent “rigorous” verification to meet its strict nonpartisanship standards.\n\nFar from questioning those standards, it added, Meta had “consistently praised their rigor and effectiveness.”\n\nThe United Nations rights chief Volker Turk also insisted on Friday that regulating harmful content and hate speech online “is not censorship.”\n\nPublished in Dawn, January 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:48:33.048Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884650/biden-describes-meta-decision-to-do-away-with-fact-checking-as-shameful",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T02:04:29.000Z"
}
