{
  "title": "Two security personnel martyred in North Waziristan - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Two security personnel were martyred and six terrorists killed in an exchange of fire in tehsil Datta Khel of North Waziristan district on Saturday, sources said.\n\nThe clash occurred in the Zangoti area, where around a dozen terrorists stormed a security checkpoint with light and heavy weapons.\n\nTwo security personnel were also injured in the crossfire. The injured, along with the bodies of the martyrs, were airlifted to Miramshah.\n\nThe sources said that four security personnel were injured after a hand grenade exploded in Fort Biji in Mir Ali area. The injured were airlifted to the Combined Military Hospital in Bannu district.\n\nKidnap victim issues video statement\n\nNo statement was issued by the Inter-Services Public Relations, the military’s media wing, till late in the night.\n\nIn a separate development, one of private workers of Pakistan Atomic Energy Commission (PAEC) has urged the government to take immediate steps for their release.\n\n“The government is requested to immediately accept the [militants’] demands. Our release is conditional upon the fulfillment of the Taliban’s demands,” said Bashir, one of the abductees, in a video message recor-ded and released from an undisclosed location.\n\nOn Jan 9, a senior police official from Lakki Marwat district confirmed that at least 17 PAEC contractual workers, along with their driver, were kidnapped by armed militants while travelling along the Lakki-Darra Tang Road in a private vehicle.\n\nA rescue operation was immediately launched, resulting in the recovery of eight workers, including one who was injured, he said.\n\nSources said the PAEC contractual workers were en route to a project site in the Qaboolkhel area of the district when their coach was intercepted by armed assailants.\n\nThe kidnappers took the hostages to an undisclosed location before abandoning and setting fire to the coach in a forested area along the Kurram River.\n\nOn Saturday, Mr Bashir, who shared some demands from the militants, appealed to the government to immediately meet these.\n\n“Today is January 11, 2025 — our third consecutive day [in captivity]. Now some demands have come from them [referring to the kidnappers],” he said in the video message.\n\nThe Taliban, arrested in Lakki Marwat, should be immediately released, and their [Taliban’s] houses should not be demolished in the future, Mr Bashir shared, detailing the demands.\n\nAccording to Mr Bashir, the Taliban also demanded that the owners of demolished houses be compensated. While addressing his senior officers, Mr Bashir appealed that the demands be considered, as their release was contingent upon accepting these conditions.\n\nHe also clarified that rumours circulating in the media suggesting that the captive contractual workers had been released were false. “There is no such thing; 10 persons are still in captivity,” he added.\n\nPublished in Dawn, January 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:38:24.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884636/two-security-personnel-martyred-in-north-waziristan",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T02:04:07.000Z"
}
