{
  "title": "Government committed to steer country out of economic crisis: PM Shehbaz",
  "link": "https://www.app.com.pk/national/government-committed-to-steer-country-out-of-economic-crisis-pm-shehbaz/",
  "date_published": "2024-03-08T09:28:00.000Z",
  "source": "APP",
  "content": "MUZAFARABAD, Mar 8 (APP):Prime Minister Shehbaz Sharif on Friday reiterated the government’s resolve to steer the country out of the challenge of economic crisis by bringing structural reforms in the economic sector to provide maximum facilities to the people of the country.\nHe said that the government was fully committed to increase tax to GDP ratio, tap the huge potential of natural and agriculture resources, stop smuggling, power theft, and losses of the State Owned Entities.\nAddressing a cheque distribution ceremony among the affected people by torrential rains and snowfall in the area, the prime minister called for setting aside all the differences in the larger national interest to work as a nation to ensure that the country was developing at a faster pace.\nCurrently, he said the country’s tax collection target for the current fiscal year was 1.2 trillion which was not up to the true potential due to tax evasion by certain sections. He said tax evasion was one of the biggest challenge that would to be resolved to increase the country’s resources. “If we have no resources, how we will build the infrastructure of health, education and other important sectors,” he maintained.\nHe said even the salaries of the federal employees were being paid with the borrowed money. Therefore, he said this was the right time to take tough and important decisions to resolve all the key challenges, the country was facing.\nAs regards the losses of SOEs, the prime minister informed that the SOEs were incurring losses of hundreds of billions rupees as the loss of only Pakistan International Airlines (PIA) was around Rs 825 billion. Similarly, he said the country lost Rs 500 billion every year to power theft.\nTalking about the losses and damages occurred due to recent rains, snowfalls and land sliding in AJ&K, the prime minister expressed his grief and sorrow over the loss of eight precious lives and prayed for the grant of eternal peace to the departed soul and early recovery of those injured in the incidents.\nHe said that the government of Pakistan always stood with its Kashmiri brothers and sisters in the hour of need.\nOn the occasion, he also distributed cheques among the affected people.\nHe said Rs 2 million each would be distributed among the families of the deceased and Rs 500,000 each to those injured in the recent incidents.\nSimilarly, Rs 700,000 each would be given to those whom houses were completely damaged while Rs 350,000 would given to those whom houses were partly damaged.\nHe directed the Prime Minister AJ&K to complete the survey as soon as possible so that the funds be distributed by March 13.\nOn the request of the AJ&K prime minister, PM Shehbaz also announced to keep a helicopter of NDMA available for the region in case of emergencies to immediately reach out to the affected people in the hilly areas.\nHe said Jammu and Kashmir was the jugular vein of Pakistan and it would not leave alone the people of Kashmir in this hour of difficulty.\nPM Shehbaz maintained that almost over 20 million children were out of school across the country. He said mosques would be utilized to provide education to such children.\nOn the occasion, Fatiha was also recited for those who passed away in the recent rains and snowfall in the area.\nPrime Minister Azad Jammu and Kashmir Chaudhry Anwaar-ul-Haq thanked Prime Minister Shehbaz Sharif for his support in this hour of difficulty.\nHe informed that during the recent rains, snowfall and landsliding in AJ&K, eight people were died while 88 houses were completely damaged.",
  "retrievedAt": "2025-08-11T01:12:46.405Z"
}
