{
  "title": "Envoy urges Pakistani investors to invest in Ethiopia",
  "link": "https://www.app.com.pk/national/envoy-urges-pakistani-investors-to-invest-in-ethiopia/",
  "date_published": "2024-03-08T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 08 (APP): Ambassador of Ethiopia to Pakistan, on Friday urged the Pakistani business community to invest in Ethiopia that offered comparative advantage in form of important geographical location, cheap and clean energy and skilled human resources.\nAddressing a Business Forum on Ethiopia-Pakistan Bilateral Trade at Federation of Pakistan Chambers of Commerce & Industry, Lahore, the ambassador said his country was hosting the Invest Ethiopia Conference from April 28-30 in Addis Ababa to showcase extraordinary investment opportunities in Ethiopia, said a press release issued here.\nAccording to Ambassador Jemal Beker, it was a high time for the business community of Pakistan to explore the lucrative market of Ethiopia which was a gateway to the African continent of more than 1.4 billion people.\nHe said Ethiopia was a signatory to the African Continental Free Trade Area Agreement which meant that whatever produced in Ethiopia could easily be traded to the entire Africa.\nThe ambassador highlighted the economic reforms carried out by the reformist Government of Ethiopia to build a home grown economy to achieve a robust and sustainable economic growth by creating an enabling environment for business community and foreign investors.\nHe said under its economic reforms, Ethiopia had laid a major focus on its five economic sectors including agriculture and agro-processing, manufacturing, mining, Information and Communication Technology (ICT) and tourism.\nThe government had set up a one-window facility and introduced multiple incentives to attract the foreign direct investment, he said, adding “do not mislocate yourself, Africa is the business, trade and investment destination of the 21st century.”\nHe said Dr. Abiy Ahmed, Prime Minister of Ethiopia, had charted the country on the path of progress and prosperity with his visionary reforms paving the way for Ethiopia to become a manufacturing hub of Africa.\nThe ambassador said Ethiopia was producing cheap, clean and green energy close to 98 per cent from hydro and geothermal sources.\n“We are exporting energy to Kenya, Djibouti, Sudan and other neighbouring countries since our prime focus is to foster regional integration by sharing our resources,” he added.\nAs regards the efforts for boosting trade volume between Ethiopia and Pakistan, he said the Embassy of Ethiopia in Islamabad last year in March mobilized a 75-member trade delegation to Ethiopia that helped connect both countries business community.\n“Now, we are planning Hijra Trip II to Ethiopia for the traders and investors of Pakistan this year in May,” the ambassador said, exhorting the participants to register themselves for the delegation before end of April.\nThe ambassador also briefed the Pakistani business community about export potential of different products to Ethiopia including rice, pharmaceutical products, medical equipment, sports items and construction material.\nLikewise , Pakistan could import agricultural products such as coffee, tea, pulses, oilseeds and vegetables from Ethiopia.\nVice President of FPCCI and Regional Chairman Zaki Aijaz also informed the business community about Ethiopia’s business, trade and investment potential while recalling his visit to Ethiopia as part of the 75-member business delegation went to Addis Ababa last year.\nHe also lauded the role played by Ambassador Jemal Beker Abdula for advancing bilateral relations including trade ties between the two countries.",
  "retrievedAt": "2025-08-11T01:12:22.483Z"
}
