{
  "title": "Mushahid terms seeking membership of BRICS a right step in right direction",
  "link": "https://www.app.com.pk/national/mushahid-terms-seeking-membership-of-brics-a-right-step-in-right-direction/",
  "date_published": "2024-03-08T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 08 (APP):Chairman Senate Standing Committee on Defence, Senator Mushahid Hussain Sayed Friday said that Pakistan’s application for the membership of BRICS is a step in the right direction.\nHe was delivering a keynote address organized by the NUST Institute of Policy Studies (NIPS) on “Pakistan, BRICS and the Dawning Multipolar World” at the main campus of the university.\nLt General (retired) Engr Javed Mahmood Bukhari, Rector NUST, greeted the distinguished guest upon arrival.\nModerated by Dr Ashfaque Hasan Khan, Director General, NIPS, the keynote saw the participation of foreign diplomats, veteran and current high-level state officials, senior academics, think tank experts, scholars and students.\nDuring his keynote, Senator Mushahid Hussain Sayed stated that contemporary international system is undergoing climacteric changes that offer countries in the global South unprecedented opportunities for peace, growth and development. The senator stressed that the extraordinary peaceful development of China is a massive boon for the world.\nHe further said that together with the upward growth trajectories of various nations in Africa, Asia, and Latin America, it represents the dominant, positive contemporary global trend. The senator identified the reaction of the advanced world to China’s status as the first non-western global power of the 21st century.\nHe said the rise of Hindutva, and continuing human rights violations committed by Israeli against Palestinians as some of the negative drivers that affecting  global peace and stability.\nThe senator highlighted that expansion of BRICS has ushered in a new era of inclusiveness, participation, and equality among nations with the potential to establish a true rules-based international order that benefits not just a few powerful countries but all countries of the world.\nHe stressed that making South Asia a functional region, characterised by peace, development, and stability, requires that regional states like India outgrow the narrow 19th-century mindset of zero-sum quest for hegemony.\nThe Senator praised Pakistan’s efforts in consistently seeking to foster constructive relations with Afghanistan, India, and Iran. He said that Pakistan’s application for the membership of BRICS is a step in the right direction.\nIn his opening remarks, Dr Ashfaque Hasan Khan highlighted that BRICS is aiming to promote economic cooperation, sustainable development, inclusive growth, political cooperation, interstate understanding, and mutual respect.\nAmong others, Pakistan’s former Ambassador to Mexico Lt Gen (retired) Masood Aslam, former Secretary Senate Iftikhar Ullah Babar, former caretaker Interior Minister Malik Mohmmad Habib Khan, Pakistan’s former Ambassador to China Masood Khalid, the incumbent ambassadors of Brazil and Ethiopia, and the diplomatic representatives of Egypt, Japan and Russia, were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:12:50.173Z"
}
