{
  "title": "ISSI hosts “Next-Generation Strategic Cohort 2024”",
  "link": "https://www.app.com.pk/national/issi-hosts-next-generation-strategic-cohort-2024/",
  "date_published": "2024-05-09T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 09 (APP): The India Study Centre at the Institute of Strategic Studies Islamabad (ISSI) organized a one-day workshop, titled “Next-Generation Strategic Cohort 2024” as part of the series of events aimed at engaging young academics and scholars in the policy discourse relating to foreign policy and strategic issues in South Asia.\nThe workshop was attended by more than 28 young researchers and experts from various think-tanks and Universities from different parts of Pakistan, a news release said.\nIn his opening remarks, Director India Study Centre Dr. Khurram Abbas welcomed the participants and introduced the theme, objectives and pattern of the event. The workshop was divided into two working sessions.\nIn his remarks on the occasion, Director General ISSI Ambassador Sohail Mahmood lauded the young scholars for their enthusiastic participation in the event. He highlighted that the ISSI’s new vision prioritised youth engagement and that the Institute was now proactively drawing the next generation experts into the process with new ideas and fresh perspectives.\nHe stressed the importance of developing a deeper and more nuanced understanding of the intricate issues at hand, making more informed and insightful evaluations, and suggesting more innovative approaches to addressing the longstanding challenges and realizing the emerging opportunities.\nThe first session consisted of three lectures, viz. ‘India-Pakistan Bilateral relations: Prospects and Challenges for Normalization’; ‘Understanding Indian Strategic Culture and Political Thought Process’; and ‘Emerging Technologies and Comprehensive National Security’.\nIn the second session, the young scholars were divided into six groups with each group tasked to debate various issues — ranging from security and foreign policy to trade and non-traditional threats in South Asia — and propose a way forward.\nThe ‘Mentors’ for the young scholars in this session included Altaf Hussain Wani, Chairman Kashmir Institue of International Relations; Ambassador Riffat Masood, former Ambassador of Pakistan to Iran; Dr. Neelum Nigar, Director Centre for Strategic Perspectives (ISSI); and Dr. Shaheen Akhtar, Professor Department of IR, National Defence University (NDU).\nThe Mentors lauded the efforts of young academics and researchers and emphasized the importance of in-depth and rigorous thinking on issues of national security and foreign relations.\nChairman Board of Governors ISSI, Ambassador Khalid Mahmood, delivered concluding remarks. Certificates were distributed among participants as a token of appreciation for their active participation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:25:06.621Z"
}
