{
  "title": "Kanz-ul-Madaris board grand convocation held",
  "link": "https://www.app.com.pk/national/kanz-ul-madaris-board-grand-convocation-held/",
  "date_published": "2024-05-09T13:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP): A grand convocation here on Thursday was held here at the Pakistan China Friendship Center under the Kanz-ul-Madaris board in which Muftian-e-Kiram (Islamic Legal experts), Islamic scholars, Shura members, guardians of students and female students attended the graduation ceremony.\nThe devotees of the Prophet (PBUH) from various walks of life participated in the convocation whereas certificates and shields were also conferred upon the position holders to encourage them, a news release said issued here.\nOn the occasion, Rukn-e-Shura Maulana Abdul Habib Attari informed the audience about the aims and objectives of the establishing  Kanz-ul-Madaris board.\nHe said that the ceremony was organized in the honour of the students who got the first, second and third positions in Quran memorization, Tajweed and Qira’at, Dars-e-Nizami and specializations in 2022 and 2023.\nMufti Qasim Attari, explaining the virtue of knowledge of religion, said that Madaris were the source from which interpretations of the Qur’an and hadiths were being written.\nHe motivated the students to acquire more education.\nIn the grand ceremony of distribution of certificates, Maulana Muhammad Imran Attari said that the life of the Holy Prophet (PBUH) was the way to success, we had to follow the blessed character in every aspect of life.\n“When life is in accordance with Islam and religion, then one will get the success he desires. We have got religion from the elders, if we adopt the beautiful style in which the Prophet trained each one and adopt a beautiful social style, then they will be successful,” he added.\nThe guests of honor were Mufti Qasim Attari, Mufti Sajjad Attari, Mufti Hasan Attari, Mufti Ali Asghar Attari, Mufti Hashim and Haji Waqar-ul-Madinah Attari. At the end of the Convocation, Salat-o–Salam, was recited and, Dua, was offered.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:25:25.443Z"
}
