{
  "title": "COMSTECH celebrates World Food Day",
  "link": "https://www.app.com.pk/national/comstech-celebrates-world-food-day/",
  "date_published": "2022-10-14T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): Speakers at a webinar held here Friday emphasized on finding out viable solutions to address the challenge of food insecurity due to the climate change and other threats.\nThe webinar was arranged by COMSTECH in partnership with UPSIGN, SAWIE, ICCFS, IFS and Pakistan Science Foundation (PSF) to mark the World Food Day.\nThe slogan for world food day this year was “Leave No One Behind”.\nKeynote talks and panel discussions were arranged with experts from all over the world with several years of experience in agri-food research systems.\nThe experts said, “We are faced with shortage of food, due to which many, particularly the children were suffering from malnutrition.” The debate uncovered how sustainable use of natural resources could help enhance productivity, soil health, water, and the role of biodiversity.\nThe question of how we could address the food production crisis, protecting the soil microbes, plants, animals and natural capital, and produce healthy food to support a healthy life and a healthy planet was discussed.\nThe panelists also discussed the way forward to address the impact of COVID-19 and recent floods in Pakistan on food security.\nThey talked about how the research on and knowledge exchange of good practices could be translated to develop climate change adaptation strategies, mitigation, and what specific measures could be taken to support the climate crisis victims.\nThe panelists pondered upon creating the resilient growth that would not leave anyone behind.\nThe experts noted that Pakistan was one of the top ten countries which were most vulnerable to the climate change.\nThey agreed that the food system was affected with extreme heat, droughts, unpredicted rain patterns, and attacks from invasive species of pests and diseases, all of which were being caused by climate change.\nCOMSTECH, the OIC Ministerial Standing Committee on Scientific and Technological Cooperation, joined hands with the leading research, academic and farming organizations from Pakistan and around the world for hosting the World Food Day celebration.\nThese partners were UPSIGN, SAWIE, ICCFS, IFS and Pakistan Science Foundation (PSF). UPSIGN is an educational charity based in the UK supporting collaborations between the UK and Pakistan. SAWIE is a digital platform based in the UK and Pakistan offering farm advisory and data insights.\nInternational Center for Climate Change, Food Security and Sustainability (ICCFS)/Consortium on Climate Change, Sustainability and Conservation (CCSC), The Islamia University Bahawalpur are leading research organizations.\nThe International Foundation for Science (IFS), is an international, non-governmental organization.",
  "retrievedAt": "2025-08-11T15:43:37.369Z"
}
