{
  "title": "No concrete outcome of talks with TTP: Khawaja Asif",
  "link": "https://www.app.com.pk/national/no-concrete-outcome-of-talks-with-ttp-khawaja-asif/",
  "date_published": "2022-10-14T12:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): Minister for Defence, Khawaja Muhammad Asif on Friday said the recent talks with the outlawed Tehreek-e-Taliban Pakistan (TTP) bore no concrete outcomes whereas the armed forces were fully capable to contain any threat to national security.\nAddressing the Arab News Pakistan Annual Conference 2022 as a keynote speaker, the Minister said the situation in Khyber Pakhtunkhwa (KP) was under control and would be tackled amicably in case of any untoward situation.\nKhawaja Asif made it clear that the KP government should take cognizance whereas the federal government would support it in any case to counter terrorism.\n“It is very heartening to see public coming to streets on their own for their rights. I feel confident that the situation will be controlled. However, the recent revival of few terrorists is an expected spillover from Afghanistan,” he said.\nThe Minister added that the success of relationship between Pakistan and Afghanistan was of great significance as Pakistan could not remain oblivious to what was happening in Afghanistan. “Peace in Pakistan is dependent on peace in Afghanistan. We will use peaceful means to resolve the matter and we will use force if it’s inevitable to purge the country from the menace of terrorism.”\nHe mentioned that the defence forces of Pakistan were fully equipped and the most battle hardened anywhere in the world. “The frontline forces for the last three decades are fighting against extremism. Our experiences and sacrifices are unmatchable.”\nThe Defence Minister also shed light on the role of media in national security lens and said the importance of media for the national security was of huge significance in the present era. The Kingdom of Saudi Arabia (KSA) had undergone very fundamental changes under the leadership of Crown Prince Muhammad Bin Salman and media was playing fundamental role in this regard.\n“Any change in departure from traditional way of governance to modern era practices is something like a paradigm shift which has occurred in the KSA.”\nThe Minister added that it was not only welcomed in the KSA rather in the region and beyond. He mentioned that media and change went hand in hand during the transformation triggered in any society as media played a lead role in bringing about that change.\nKhawaja Asif said the national Security at present was fundamentally the economic security of a state.\nMedia, he said was always the precursor of wars in the previous times as it was always the media which brought to the forefront the strategic stance of warring parties. “I personally feel media is playing a critical part in Pakistan. The electronic and social media underwent a drastic increase exponentially.”\nThe Minister underlined that the usage of media by the politicians especially the social media which was misused need to be understood in the current scenario. “It’s playing havoc with wars, policies and strategies through fake news. I personally feel that the place of media is absolutely fundamental. It has become the most important part of the national life.”\nHe added that the failure or success of politicians being political workers or part of any strategic government not in Pakistan rather elsewhere relied on the media as how it handled it. “The media wars during USSR and USA cold war have been fought between them on print media and a bit on electronic media. The ideological part of these wars have diminished over the years. The commercial considerations of the media houses is also a reason for it as it has gained much precedence.”\nHe also mentioned that the country was facing terrorism for decades where the extremists were also using media very effectively for recruitment, explaining their reasons to opt extremism and perpetrating their narratives among the masses.\nThe Minister also responded to various queries of international and local mediamen. He said the change of command in the armed forces was a matter of sanctity which should be kept sacred. However, when this matter was taken into the realm of politics then this sanctity was obliterated, he added.\n“I had held the process of appointments of two Army Chiefs in my tenure as defence minister and it had never been such discussion on this issue. I have very high hopes that all institutions will perform their roles as defined by the Constitution.”\n“We wish to have good ties with US. Our Foreign Minister, Prime Minister and Chief of Army Staff (COAS) visits remained good and fruitful.”\nHe added that the country’s relations with KSA were decades old and it was very important and had a pivotal role in our foreign policy. “The Kingdom has helped us at very critical times. Moreover, the Crown Prince’s visit to Pakistan will strengthen the bilateral ties further as it will help improve in the domain of defence and investment. We need investment in Pakistan to revitalize our economy. So, it is a very important visit.”\nReplying a query on Israel, he said, “We treat the issue of Palestine as dear to us as Kashmir. Israel is an apartheid state that believes in denying very fundamental rights to Palestinians. I have very strong views on Kashmir and Palestine. The Israeli treatment of Palestinians is what Nazis did to them. The victims are the tyrannizers of today”, he added.",
  "retrievedAt": "2025-08-11T15:43:41.277Z"
}
