{
  "title": "SC issues written order on Article 63-A’s interpretation",
  "link": "https://www.app.com.pk/national/sc-issues-written-order-on-article-63-as-interpretation/",
  "date_published": "2022-10-14T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): The Supreme Court on Friday issued a written order regarding the interpretation of Article 63-A of the Constitution with regard to the counting of the vote of a dissident member against the party policy in the House of Parliament.\nA 95-page majority judgment issued by the top court said a dissident member’s vote cast against his party guidelines would not be counted, however, the period of disqualification of a dissident member should be determined by the Parliament.\nIt further said the Constitution had mentioned the parliamentary party for the instructions, not the party head. “The members of Parliament have complete freedom of expression but this could not be demonstrated at the time of exercising the vote in the light of Article 63-A.”\nThe majority judgment rejected the objections raised on the admissibility of the presidential reference, saying the court had already given answers to the objections in another case.\nThe decision said that if the prime minister or chief minister lost confidence in the parliamentary party then he had to face a vote of no-confidence. A member voting against party directives was destructive to the parliamentary democratic system, the apex court added.\nThe right of assembly members to express their opinion had also been protected in the lawyers’ front case, the verdict said. Members of the Assembly could discuss, agree or disagree within the party on the issue of vote, however, when “it comes to the voting, the situation would be different”.\nThe judgment said the parliamentary party’s instructions had to be followed while voting under Article 63A. It was argued that not counting the dissident member’s vote would give rise to authoritarianism in the parliamentary party but “we didn’t agree with the argument”.\nCounting votes cast against party policy was a threat to the democratic system, it added.\nChief Justice of Pakistan Umar Ata Bandial, Justice Ijaz ul Ahsan and Justice Munib Akhtar had decided not to count the vote of the defiant member, while Justice Mazhar Alam Miankhel and Justice Jamal Khan Mandokhail had contradicted with the majority decision..",
  "retrievedAt": "2025-08-11T15:43:40.303Z"
}
