{
  "title": "Governor opens free food facility, water filtration plants at Multan railway station",
  "link": "https://www.app.com.pk/national/governor-opens-free-food-facility-water-filtration-plants-at-multan-railway-station/",
  "date_published": "2022-10-14T11:53:00.000Z",
  "source": "APP",
  "content": "MULTAN, Oct 14 (APP): Punjab Governor Muhammad Baligh Ur Rahman on Friday inaugurated a free food facility for porters (Qulees) and two water filtration plants at Multan cantonment railway station.\nLIVE #APPNews : Governor Punjab Baligh Ur Rehman addresses ceremony #Islamabad  https://t.co/fb5zHLdLsD\n— APP  (@appcsocialmedia) October 14, 2022\nSpeaking at the post-inauguration ceremony, the Governor said that recent floods were a big challenge for the country that not only rendered almost four million people homeless but also affected the national economy.\nSuch challenging situations demand society’s humane attitude in aid of the troubled communities, he said and heaped praise on noted industrialist Khawaja Jalaluddin Rumi for adding free food, ration and clean drinking water facilities at the railway station in continuation of his social service activities.\nPunjab Governor commended Pakistan Army and Disaster Management Authorities for playing an active role in rescuing people stranded in flooded areas, and providing them relief.\nBaligh Ur Rahman held philanthropists in high esteem for their swift response in support of the people who suffered immense losses in floods.\nHe said that floods had also suspended train operations that had left Qulees without earning means and added free ration for Qulees was a step in the right direction.\nKhawaja Jalaluddin Rumi said that the facility would serve free meals to 300 Qulees daily and pledged to continue philanthropic activities under the Rumi Foundation.\nRumi said the foundation was also providing free lunch daily at Fatima Jinnah and DHQ hospitals in Multan and added that a chiller water filtration plant would also be made functional at Khanewal railway station within a month.\nEarlier, divisional superintendent railways Multan division Hammad Hassan Mirza said that railways Multan provided ration to 1000 flood hit families besides medical aid to 3000 affectees.\nPunjab Governor also distributed ration bags among the Qulees of Multan, Bahawalpur, Dera Nawab, and Lodhran railway stations.",
  "retrievedAt": "2025-08-11T15:43:42.882Z"
}
