{
  "title": "ECP registers transgenders, disables at their doorstep to include them in political processes; DG",
  "link": "https://www.app.com.pk/national/ecp-registers-transgenders-disables-at-their-doorstep-to-include-them-in-political-processes-dg/",
  "date_published": "2022-10-14T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP):For the first time, the Election Commission of Pakistan (ECP) in collaboration with National Database and Registration Authority (NADRA) has made it mandatory for the Mobile Registration Vans (MRVs) to ensure registration of transgender persons and people-with-disabilities at their doorstep and include them in political processes.\nThis was stated by Nighat Siddique, Director General Gender Affairs, ECP here at Lok Virsa during the 2nd day of 15th Annual Rural Women Conference organized by Potohar Organization for Development Advocacy (PODA) here Friday.\nHowever, there are other facilities like preferential voting procedure and postal ballot facility which can be used actively by old people, transgender persons and people-with-disabilities, she told.\nThe rural women representing 120 districts of the country urged all political parties to allocate 50 percent ticket to women candidates in elections from national, provincial to local level.\nPODA-Pakistan has been organizing annual rural women conference since 2008 in connection with the International Rural Women Day that is observed on 15th of October every year. The conference provides platform to rural women and their leadership to bring their issues and solutions on the front vocally for change to reduce gender gap in every sphere of life.\nThis is the consecutive 15th conference in which rural women from 120 districts of the country have gathered urging policymakers to optimize women’s role and contributions in the overall progress of the country.\nMs. Nighat Siddique applauded the role of the civil society and the government institutions which played crucial role in reducing the gender gap in voter registration from 10 percent to 8.6 percent.\n“To reduce the existing gap of seven hundred thousand between women and men voters, the ECP in collaboration with NADRA has decided to extend the Computerized National Identity Card (CNIC) and voter registration facilities to 13 more districts in Balochistan.\nWith this, we are also focusing on enhancing registration in newly merged districts in Khyber Pakhtunkhwa,” said Nighat Siddique while addressing a vibrant audience of rural women over 600 hundred representing 120 districts of the country.\nThe session was focused on “Developing Rural Women’s Linkages with Disability Working Group of the Election Commission”. For this session, the ECP partnered with PODA-Pakistan. The ECP has setup a stall to demonstrate entire voting process at the conference venue.\nIt is pertinent to mention here that Pakistan is one of the most unequal countries in the world for women, ranked at 153 out of 156 countries (WEF 2021).\nEarlier, representing four provinces and regions of Azad Kashmir and Gilgit-Baltistan, wide range rural women leaders shared their testimonies to highlight problems and suggest indigenous practical solutions. Rural women who shared their local issues with the ECP representative included, Sughra Bano from Sahiwal, Bismillah Irum, Khanewal, Veru Kolan, Hyderabad, Naheeda Abbasi, Chakwal, Raheema Sultana, Rawapindi, Shazia Jamil Lasbela, Saima Batool, Vehari, Mehak Butt, Multan, Qaisra Isamil, Nosheen, NMDs, KPK, and Shahida Irshad from Quetta.\nLater, during the second half of the day’s proceedings, Dr. Robina stressed the need to set minimum age of 18 years for marriage to save girls from a wide range of emotional, physical and psychological illnesses. She narrated a dismal picture of the girls who get married at early age in all regions of Pakistan. “At the moment, there are 35000 girls with fistula that is an implication of early age marriages among girls.\nThe girls affected by this condition during child birth are forced to live with animals because  they are not able to control their urine. This happens among due to early marriages.” Dr. Robina advocated strongly saving girls from the social of curse of child marriage especially in flood-affected areas. “\nSharing miseries of flood victims of people of Swat, Rukhsana Jahengir said “my Swat is in pain due to the sufferings and loss caused by current floods in the area. People are in dire need of help of all kinds.” Amna Jamali briefed about the situation of the flood-affected areas of Balochistan.\nObserving International Rural Women Day tomorrow, the 15th Annual Rural Women Conference will be concluded with the pledge to work for an inclusive society. Speakers and panelists  lauded the efforts of PODA-Pakistan to connect rural women of four provinces and regions of AJK and GB.\nMuzhat Shirin, Chairperson Sindh Commission on the Status of Women also shared information about the flood victims.",
  "retrievedAt": "2025-08-11T15:43:38.939Z"
}
