{
  "title": "First-ever mobile control room set up in Islamabad for Ashura security, says Interior Ministry",
  "author": null,
  "content": "ISLAMABAD, Jul 04 (APP): On the directions of Federal Interior Minister Mohsin Naqvi, a mobile control room has been established for the first time in Islamabad as part of the Ashura security plan.\nThe mobile control room is capable of operating even without mobile signals, ensuring uninterrupted monitoring and coordination.\nMinister of State for Interior Talal Chaudhry, accompanied by Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry, visited the central Imambargah Asna Ashri in G-6 sector. They inspected the main hall and reviewed the implementation of the security plan in detail.\nBoth ministers also visited the newly set-up mobile control room by Islamabad Police and expressed satisfaction over the security measures in place.\nTalal Chaudhry stated that 1,762 personnel have been deployed for security, with 350 traffic officials assigned to manage entry points at four main access routes. He assured that foolproof arrangements have been made to protect mourners.\nAdvanced surveillance through drones and modern technology will be used to monitor Majalis and processions.\nCCTV cameras have been installed along procession routes for real-time monitoring.\nTo prevent the spread of hateful content, the National Cyber Crime Investigation Agency is actively monitoring social media platforms.\nInspector General of Islamabad Police, Ali Nasir Rizvi, briefed the officials, stating that a sector-wise security plan has been developed. Volunteers will assist the police in managing the security of Majalis and processions.\nAccording to the plan, mourners will travel from Rawalpindi to Islamabad on the 9th of Muharram and return on the 10th. An integrated security network has been established to ensure the safety of all religious gatherings.\nChief Commissioner Islamabad Muhammad Ali Randhawa, Deputy Commissioner Islamabad, DIGs, Chief Traffic Officer, and other senior police officers were also present during the visit.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:14:50.189Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/first-ever-mobile-control-room-set-up-in-islamabad-for-ashura-security-says-interior-ministry/",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T11:26:00.000Z"
}
