{
  "title": "KSrelief launches third cycle of food security support project in Pakistan",
  "author": null,
  "content": "ISLAMABAD, July 04 (APP):The King Salman Humanitarian Aid and Relief Center (KSrelief) on Friday officially launched the third cycle of its Food Security Support Project in Pakistan for 2025 reinforcing its global commitment to humanitarian assistance.\nKSrelief will distribute 30,000 food packages across 34 of Pakistan’s most vulnerable districts, benefiting over 210,000 Individuals.\nThe launch ceremony was attended by Ambassador of the Kingdom of Saudi Arabia to Pakistan, Nawaf bin Said Al-Malki, Federal Minister for National Food Security & Research, Rana Tanveer Hussain, and Director of KSrelief’s Pakistan Office, Abdullah Al-Baqami.\nThis initiative follows the successful completion of the first two cycles, during which 60,000 food packages were distributed in 61 districte spanning Balochistan, Sindh, Punjab, Khyber Pakhtunkhwa (KP), Gilgit-Baltistan, and Azad Jammu and Kashmir (AJK) over a five-month period.\nEach food package weighs 95 kilograms and contains essential staples including 80 kg of flour, 5 liters of cooking oil, 5 kg of sugar, and 5 kg of Daal Chana. Designed to meet the monthly nutritional needs of a family, the packages will be distributed under the direct supervision of KSrelief to ensure transparency and efficiency.\nThe project is being implemented with the collaboration of National Disaster Management Authority (NOMA), Provincial Disaster Management Authorities (PDMAs), and other local partners. It aims to address food insecurity, enhance nutritional well-being, and support disaster affected and underserved communities throughout Pakistan, Beneficiaries will be identified in coordination with local authonties to ensure the aid reaches the most deserving households.\nThis project, under the humanitarian initiatives of the Kingdom of Saudi Arabia, will be carried out under the supervision of the King Salman Humanitarian Aid and Relief Center in Pakistan. The aid will be distributed transparently to those in need, in coordination with the local government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:15:11.345Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ksrelief-launches-third-cycle-of-food-security-support-project-in-pakistan/",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T10:29:00.000Z"
}
