{
  "title": "Fruit & veg sellers master excuses to outwit customers, evade regulation",
  "author": null,
  "content": "ISLAMABAD, Jul 4 (APP)::The colorful piles of fresh fruits and vegetables at Islamabad’s stalls may look inviting, but beneath the surface lies a well-practiced game of evasion and profiteering. From blaming rising transport costs to claiming high prices at the mandi, shopkeepers craft clever excuses to outsmart customers daily and dodge government price lists, hiking rates at will. These tactics not only squeeze the average shopper’s wallet but also leave price control committees in a constant chase, turning regulation into an uphill battle.\nEvery morning, the city administration issues official rate lists to protect consumers from sudden price hikes. These lists cover essentials, from onions and tomatoes to mangoes and poultry, yet on the ground, they’re often ignored or hidden from view.\nAt F-8 this morning, a middle-aged man haggled over tomato prices. The vendor insisted on Rs. 90 per kg, despite the government’s list—clearly displayed nearby—fixing the price at Rs. 55. It might as well have been invisible.\nThis wasn’t an isolated case. A quick survey of five stalls in the same market showed tomato prices ranging from Rs. 65 to Rs. 100, while the official rate remained Rs. 55. Mangoes listed at Rs. 200 per kg were being sold for as high as Rs. 450. Prices seemed to hinge more on customer awareness than any regulation.\nMany shoppers, unaware of their rights, don’t even know that these price lists exist.\n“I honestly didn’t know there was a daily rate list,” said a G-9 resident. “I just assumed prices changed by area.” Others echoed similar confusion.\n“It feels like every shop runs on its own rules,” said a student from F-8 sector. “Nobody follows the list, and we don’t know how or where to complain.”\n“We have to buy these things regardless,” added a housewife from I-11. “No one takes these lists seriously. We’re just at their mercy.”\nLow public awareness plays directly into vendors’ hands.\nWhen questioned, shopkeepers offer a familiar rotation of excuses: transport strikes, fuel prices, poor harvests, or inflated mandi rates. “Humain peechay se mehngi mil rahi hain,” is the default line. While some reasons occasionally hold merit, they’re often exaggerated to justify random markups, especially during high-demand days.\nBut Deputy Commissioner Islamabad Irfan Nawaz Memon talking to APP dismissed these justifications. In a conversation, he confirmed that Sabzi Mandis across the city were complying with official rates. “The shopkeepers’ complaints are baseless,” he said, urging people to verify by visiting the mandi themselves.\nThis disconnect raises a key question: if wholesale markets are following official prices, why are retailers allowed to flout them so openly?\nLegally, vendors may add a justified profit over wholesale rates, but not inflate prices arbitrarily. Yet enforcement of the Price Control and Prevention of Profiteering and Hoarding Act, 1977 remains weak.\nDeception is common. Some vendors display the rate list as a formality; others hide it behind crates or omit MRPs from packaged goods. Many simply quote different prices to different customers based on how informed or unaware they seem.\nAlthough price control officers are tasked with daily inspections, active monitoring usually spikes only around Ramzan and Eid. The rest of the year, overcharging continues with little pushback. Many shoppers remain unaware that they can file complaints through the Pakistan Citizen Portal, call their local Assistant Commissioner, or contact the DC Control Room at 051-9108084, a number printed daily on the rate list, but rarely noticed.\nBut fixing this isn’t out of reach. Ensuring fair prices in markets isn’t just about daily lists or occasional inspections, it requires a culture of compliance, stronger systems, and an informed public. When both vendors and buyers understand their roles within a transparent pricing structure, the space for confusion and manipulation naturally shrinks.\nWith consistent monitoring, smarter tools, and greater awareness, price stability can move from being a seasonal effort to a year-round standard. The use of simple tech solutions, like mobile apps, digital rate boards, and instant reporting can further bridge the gap between regulation and everyday practice. Like in well-regulated economies, small steps, taken consistently, can lead to lasting improvements that benefit everyone involved.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:15:15.675Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fruit-veg-sellers-master-excuses-to-outwit-customers-evade-regulation/",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T10:02:00.000Z"
}
