{
  "article_id": "2025-06-25_f28233d5878b2718fce3742b7982b859",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-us-embassy-host-webinar-to-promote-investment-in-mining-sector/",
    "retrieved_at": "2025-08-27T16:28:01.495Z"
  },
  "metadata": {
    "title": "Pakistan, US embassy host webinar to promote investment in mining sector",
    "author": null,
    "date_published": "2025-06-25T08:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 618,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 25 (APP):Government of Pakistan in collaboration with the USA Embassy in Pakistan, hosted a high-level webinar aOpportunities in Pakistanas Mining Sector a Unlocking Mineral Potentiala aimed at promoting investment opportunities in Pakistanas minerals and mining sector to American investors and companies. This direct line virtual event was hostedA together by Federal Minister of Energy (Petroleum Division) Ali Pervaiz Malik and U.S. ChargA daAffaires to Pakistan Natalie Baker at Oil & Gas Development Company (OGDCL) Head Office in Islamabad. According to a news release of the ministry, the webinar brought together senior officials from Pakistanas Ministry of Energy (Petroleum Division), leading Pakistani mineral and energy companies, representatives of the Special Investment Facilitation Council (SIFC), and top USA diplomats and energy sector stakeholders. Secretary Petroleum Momin Agha, MD OGDCL Ahmed Hayat Lak, Managing Directors of GHPL and Mari Energies, DG Mines, MD PMDC, and senior representatives from Ark Metals, BMEC, BMRL, and PPL, US Embassyas Economic Counsellor, and Energy Officer participated, along with various American business representatives who virtually attended the event. On the occasion,A Ali Pervaiz Malik highlighted the vast potential of Pakistanas mining sector. aPakistan is richly endowed with mineral resources, including gold, copper, coal, rare earth elements and other critical minerals essential for renewable energy transition,a he said. The Minister noted the international significance of the Reko Diq copper-gold project and pointed to recent discoveries in Balochistanas Chaghi district and Khyber Pakhtunkhwaas Waziristan region. He emphasized Pakistanas role in global transition towards clean energy, citing the countryas abundant reserves of critical minerals as a foundation for its green transition. aRenewable energy development is central to our climate goals and economic future. We are facilitating this shift by supporting the mining of essential minerals and improving ease of doing business,a he added. The Minister also acknowledged the success of the Pakistan Minerals Investment Forum 2025 (PMIF25), held earlier this year, which attracted over 5,000 participants and brought global attention to Pakistanas mineral wealth. aPMIF25 marked a turning point, showcasing Pakistan as a serious player in the global minerals economy,a he said, while inviting USA companies to explore public-private partnerships and joint ventures. He stressed how Prime Minister Shehbaz Sharif & COAS Field Marshal Syed Asim Munir are personally leading the development of mining sector in Pakistan. The Minister emphasised that Government of Pakistan and SIFC are fully committed to provide all kinds of facilitation to international companies in building partnerships aimed at unlocking Pakistanas vast mineral reserves. USA ChargA daAffaires Natalie Baker reaffirmed the long-standing economic partnership between the United States of America and Pakistan. aPakistan offers immense opportunities in the minerals sector. With one of the worldas largest undeveloped copper and gold deposits at Reko Diq, and a strong commitment to economic reforms, this is the right time for USA investors to explore and engage,a she said. Ms. Baker commended Pakistanas recent policy efforts to unlock the mining sectoras potential and underscored the USA Embassyas commitment to supporting American businesses looking to invest in Pakistan. aWe are here to facilitate connections and create win-win partnerships. USA investors have long contributed to Pakistanas development, and we see great promise in this sector,a she added. Participants were briefed on ongoing regulatory reforms, including the development of a National Minerals Harmonisation Framework aimed at streamlining investment procedures and aligning federal and provincial regulations. The digitalization of geological data and the upgrading of the Geological Survey of Pakistan are also underway to improve transparency and data access for investors. In her closing remarks, Ms. Baker reiterated the USA governmentas commitment to supporting Pakistanas economic development and deepening bilateral economic ties. aWe believe in Pakistanas potential, and we see shared opportunity in its journey toward inclusive, sustainable growth,a she concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}