{
  "article_id": "2025-06-25_88f9f9c26a5468623f8934f9c2b354a2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rs12b-approved-to-transform-gadani-into-model-green-ship-breaking-yard-junaid-anwar/",
    "retrieved_at": "2025-08-27T16:27:19.438Z"
  },
  "metadata": {
    "title": "Rs12b approved to transform Gadani into model green ship-breaking yard: Junaid Anwar",
    "author": null,
    "date_published": "2025-06-25T10:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 367,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 25 (APP): Federal Minister for Maritime Affairs, Muhammad Junaid Anwar Chaudhry has announced the approval of Rs12 billion for the transformation of Gadani Ship-Breaking Yard into a model green facility, aligning maritime sector with international climate and environmental standards. Chairing a high-level meeting on the Gadani redevelopment, the minister underscored the ship-breaking industry's contribution to economy and its potential role in the country's climate resilience strategy, said a press release. \"Ship recycling must evolve to meet global sustainability standards. This transformation is essential to reduce pollution, manage hazardous waste responsibly, and contribute to a greener maritime future,\" he said. The minister said this major initiative focuses not only on modernizing infrastructure and safety mechanisms but also on addressing the climate crisis through green shipping and environmentally responsible ship recycling. Secretary Maritime Affairs, Syed Zafar Ali Shah informed the minister that a 30-bed hospital, residential blocks for medical staff and labor colonies would be constructed as part of the social uplift component of the project. Additionally, 32 kilometers of road, a school, a public park, and modern water supply and treatment systems will be installed to support the workforce and local community, he added. The minister instructed relevant authorities to put in place a robust monitoring mechanism to ensure transparency and timely implementation of the project, stressing that the Hong Kong International Convention for the Safe and Environmentally Sound Recycling of Ships (HKC) must be strictly observed. He noted that Gadani produces over 1.2 million tonnes of steel annually, making it a critical part of scrap and steel supply chain. However, due to years of stagnation, the industry is now facing serious challenges in keeping pace with regional competitors. \"Gadani was once among the world's largest ship-breaking hubs. Today, it stands at a crossroads-either we modernize it in line with green shipping goals or risk further decline,\" he warned. The minister emphasized that the revitalization of Gadani will contribute to Pakistan's broader climate goals, support the green economy, and reposition the country as a regional leader in sustainable ship recycling. He reaffirmed his commitment to working with provincial governments, and industry stakeholders to establish Gadani as a model yard for safe, climate-resilient, and economically viable ship-breaking.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}