{
  "article_id": "2025-06-25_f6475e01ced6f28c676f0d5228af4740",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minister-calls-for-equitable-green-financing-as-pakistan-exceeds-global-climate-commitments/",
    "retrieved_at": "2025-08-27T16:25:55.353Z"
  },
  "metadata": {
    "title": "Minister calls for equitable green financing as Pakistan exceeds global climate commitments",
    "author": null,
    "date_published": "2025-06-25T18:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 211,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 25 (APP): Federal Minister for Climate Change, Dr. Mussadiq Malik on Wednesday stressed the need for equitable climate funding, urging the international community to prioritize Pakistan given its vulnerability and proactive efforts. The minister during briefing informed the Senate Standing Committee on Climate Change that Pakistan has exceeded its global climate responsibilities by reducing carbon emissions by 37%. Despite this achievement, he emphasized that Pakistan remains among the countries most severely impacted by climate change. Dr. Malik highlighted the disproportionate contribution of major economies to global emissions, stating that just seven countries account for 70% of global carbon emissions while receiving 85% of green financing. He pointed out that two of Pakistan's neighboring nations are among the world's top carbon emitters, though he did not name them explicitly. He assured the committee that the ministry is focused on completing ongoing projects and supporting young environmental entrepreneurs by connecting them with global investors. \"Pakistan is committed to empowering its youth as champions of a green economy,\" Dr. Malik stated, underscoring the government's vision for sustainable development. The Senate committee echoed calls for fairer climate financing to help Pakistan mitigate and adapt to climate challenges effectively. The ministry will continue to advocate for global climate justice while advancing domestic green initiatives.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}