{
  "article_id": "2025-06-25_518a1cd6c5422cafe931bb986b443c57",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nlpd-organises-literary-meet-up-mushaira-held-in-honour-of-renowned-poet-journalist-rashid-noor/",
    "retrieved_at": "2025-08-27T16:25:57.057Z"
  },
  "metadata": {
    "title": "NLPD organises literary meet-up, Mushaira held in honour of renowned poet, journalist Rashid Noor",
    "author": null,
    "date_published": "2025-06-25T18:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 280,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 25 (APP): National Language Promotion Department (NLPD) with the collaboration of literary and cultural organization Zavia and the Ahmed Faraz Trust held a literary meetup and mushaira (poetic symposium) in honour of the renowned US-based Urdu poet, journalist, and intellectual Rashid Noor. The event was held at the NLPD auditorium and attended by poets and writers from across the country. The session was presided over by the eminent literary figure Haleem Qureshi, while Prof Dr Muhammad Saleem Mazhar, Director General of NLPD, and Dr Arshad Mahmood Nashad were the guests of honour. Afshan Abbasi also graced the event as a special guest. The proceedings were moderated by Mehboob Zafar. On behalf of the Faraz Trust, Saadi Faraz presented a shield to Rashid Noor in recognition of his literary contributions and extended thanks to the participating guests. The mushaira featured both established and emerging poets who presented their poetry and received warm applause from the audience. Poets who recited their work included Haleem Qureshi, Syed Tahir, Wafa Chishti, Mehboob Zafar, Salman Basit, Talib Ansari, Anjum Saleemi, Abdul Qadir Taban, Arshad Mahmood Nashad, Rehman Hafeez, Shamsheer Haider, Irfan Jameel, Khursheed Anjum, Dar Shehwar, Afshan Abbasi, Nasir Aqeel, Madiha Arslan, Aqeel Shah, Shahid Zaman, Akhtar Raza Saleemi, Shahid Iqbal, Roshi Malik, Rubina Shad, Azam Nusrat, Mehnaz Anjuman, Umair Ali Anjum, and Jamal Zaidi. Rashid Noor presented some of his latest literary creations, which deeply moved the audience and added a memorable charm to the evening. Speaking at the event, Prof Dr Muhammad Saleem Mazhar, Director General of the NLPD, stated, \"Literature and culture define our identity, and such events are essential for connecting the younger generation with their language and heritage.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}