{
  "article_id": "2025-04-23_70123ead4c7f7b45c70dc989fe4e2cb4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/10-land-grabbers-held-in-grand-operation-against-land-mafia/",
    "retrieved_at": "2025-08-27T14:48:32.089Z"
  },
  "metadata": {
    "title": "10 land grabbers held in grand operation against land mafia",
    "author": null,
    "date_published": "2025-04-23T16:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 283,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 23 (APP):Senior Superintendent of Police (SSP) Operations Muhammad Shoaib Khan held a press conference on Wednesday at the Rescue-15 office regarding the grand operation against the land mafia and their accomplices. On this occasion, SSP Shoaib stated that following special directives from the Inspector General of Police (IGP) Islamabad Syed Ali Nasir Rizvi the Islamabad Police carried out indiscriminate actions against land grabbers. In the jurisdiction of Nilore police station 10 accused involved in illegal occupation of citizens land and harassment at gunpoint were arrested. The arrested accused have been identified as Syed Ahmed, Shahid, Wasif Zahoor, Latif, Raja Shehraz, Akhtar Gul, Amir Hussain, Nasir Mehmood, Shabbir Ahmed and Faisal. Cases have been registered against them. Police also recovered 6 SMG rifles, one pistol, 800 bullets, magazines, mobile phones and five bundles of wire from their possession. During the press conference, SSP Shoaib stated that Islamabad Police is actively cracking down on the land mafia and their associates. Such criminal elements will be brought to justice under any circumstances. \"No individual will be allowed to illegally occupy citizens property. The very idea of grabbing someone else land will now be eliminated from Islamabad.\" If there is any complaint against the land mafia bring it to us. If your claim is legitimate then why do you need so many weapons, said SSP Shoaib. SSP Shoaib further said that, these people bring outsiders with no connection to the area to occupy land. If a police station fails to handle a case properly the matter reaches us through open courts. No one is allowed to sit on land with weapons. The presence of armed individuals in any area leads to a rise in crime.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}