{
  "article_id": "2025-04-23_9125ad502f288bb1b3eaae490337e405",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bosnia-stands-side-by-side-with-pakistan-rana-mashood/",
    "retrieved_at": "2025-08-27T14:48:45.865Z"
  },
  "metadata": {
    "title": "Bosnia stands side by side with Pakistan: Rana Mashood",
    "author": null,
    "date_published": "2025-04-23T12:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 345,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 23 (APP): Chairman Prime Minister Youth Program (PMYP) Rana Mashood Ahmed Khan has said that bilateral relations between Pakistan and Bosnia Herzegovina were based on mutual respect, shared values and solidarity. He said, Bosnia stands side by side with Pakistan in the moment of Hermes, promoting diplomacy, humanitarian aid and cultural exchanges through the cooperation between the important partners, we are emphasizing the public's relations with the people, especially with their leadership. Addressing the screening ceremony of Ayda film by Bosnia here Wednesday, he said today, we are not only celebrating the national day of Bosnia under the banner of the Prime Minister's Youth Program but also ensuring the participation of the youth in the promotion of cinema's culture. He said, this is not just about sharing a powerful cinema experience, but also about cultural understanding, building peace, and strengthening our commitment to the united relations. The Chairman PMYP said that Bosnia and Herzegovina were the countries rich in history and beauty adding that his event is a great opportunity for Pakistan and Bosnia and Herzegovina. The bilateral relations between the two countries are based on mutual respect, shared values and solidarity, he said and added, we do not see cultural exchange only as a tradition, but also see lasting partnerships as a bridge for peace and understanding. Rana Mashood said in Pakistan, more than 70 percent of our people are under 30 years of age,similarly, in Bosnia, more than one -third of the population is comprised of young people who are full of energy, creativity. He said that both Sarajevo and Islamabad were not only forming the future of their own countries but also becoming global citizens, innovators and peace makers. What unites them is their elasticity, seeking to learn, and their hope for building a better world. The role of the media is precious in promoting cultural dialogue and the role of the media is important in spreading messages of peace, cooperation, and understanding. This is an opportunity that brings our cultures, dates and generations closer to each other, he expressed.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}