{
  "article_id": "2025-04-23_bf54ff623cad34812bfb04ecdc35a2bf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nest-peef-award-scholarships-to-students-pursuing-careers-in-tourism-and-hospitality-management/",
    "retrieved_at": "2025-08-27T14:47:41.934Z"
  },
  "metadata": {
    "title": "NEST-PEEF award scholarships to students pursuing careers in Tourism and Hospitality Management",
    "author": null,
    "date_published": "2025-04-23T17:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 524,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 23 (APP):In a significant step toward empowering youth through education and skill development, the Pakistan Education Endowment Fund (NEST-PEEF) awarded scholarships to students pursuing careers in Tourism and Hospitality Management during a prestigious ceremony held here Wednesday at the Hashoo School of Hospitality Management Bahria University Islamabad. The event was graced by the Minister of State for Education & Professional Training, Ms. Wajiha Qamar, the CEO of PEEF, Parliamentary Secretary Ministry of Defence Miss. Zeb Jaffar, the Chief Operating Officer of Hashoo Hospitality and Education Division, Mr. Haseeb A. Gardezi, CEO hashoo group Bastien Blanc along with distinguished officials, dignitaries, and students. The ceremony marked a collaborative effort between the public and private sectors to promote education, create employment opportunities, and foster economic growth in Pakistanas tourism and hospitality industry. In keynote address, Ms. Wajiha Qamar said that Education is the foundation of a strong, progressive society, it empowers individuals, uplifts communities, and drives national development. aThe Pakistan Education Endowment Fund (PEEF), a flagship initiative, reflects the governmentas unwavering commitment to inclusive and merit-based education.a, She added. She added that todayas gathering is a celebration of what becomes possible when financial access through PEEF scholarships, visionary government backing, and skill-based education by institutions like the Hashoo School of Hospitality come together. When public-private partnerships align for educational advancement, we unlock new avenues for growth and opportunity. aThe potential for economic uplift is immense in the hospitality industry. With tourism growing globally, the hospitality sector is expected to create numerous new jobs in the coming years.a, she added. She said that the Government of Pakistan is committed to strengthening the synergy between education, skill development, and employability. Addressing the ceremony the CEO of PEEF shed light on the organizationas initiatives. She stated, through programs like the Tourism and Hospitality Scholarship, PEEF is committed to promoting education and strengthening sectors such as tourism in Pakistan, which holds immense potential for employment generation. aOur focus is to nurture talent and remove financial barriers for students, especially from underserved areas, by providing them with fully funded scholarships to excel in their fields and equip them with the skills to thrive in a competitive job market.a Mr. Haseeb A. Gardezi, in his remarks, expressed his enthusiasm for the initiative and reaffirmed the industryas support in training future professionals: The hospitality sector in Pakistan is on the rise, and there is a growing need for skilled, passionate professionals. We at the Hashoo School of Hospitality are proud to be the partners of PEEF in nurturing talent that will not only serve the industry but also elevate Pakistanas image on the global stage. The event concluded with the awarding of scholarships to deserving students who will now embark on their academic and professional journeys in the vibrant and growing field of tourism and hospitality. Hashoo School of Hospitality Management (HSHM) is a key partner Institute of Pakistan Education Endowment Fund (NEST PEEF) and renowned in Pakistanas hospitality and tourism education sector. Through campuses in Islamabad, Peshawar, Karachi, and Lahore, HSHM plays a pivotal role in producing skilled professionals who will drive the future of Pakistanas tourism and hospitality industry.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}