{
  "article_id": "2025-04-23_e855389ae622548d6641b7d1dbfb5ddd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pm-shehbaz-president-erdogan-reaffirm-to-take-pak-turkiye-bilateral-cooperation-to-new-heights/",
    "retrieved_at": "2025-08-27T14:49:33.604Z"
  },
  "metadata": {
    "title": "PM Shehbaz, President Erdogan reaffirm to take Pak-Turkiye bilateral cooperation to new heights",
    "author": null,
    "date_published": "2025-04-22T19:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1001,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "ISLAMABAD, April 22 (APP): Prime Minister Muhammad Shehbaz Sharif and President of Turkiye Recep Tayyip Erdogan on Tuesday reiterated to further foster, deepen and diversify the bilateral strategic cooperation between the two brotherly countries by enhancing cooperation in diverse fields. Addressing a joint press stakeout in Ankara, the prime minister said that his today's visit to historic and vibrant city of Ankara, enabled them to review the progress made on their targets set during the 7th Pakistan-Turkiye high level strategic council meeting held in Islamabad this year. They agreed to work closely to translate these targets into actions, with further investment in energy, IT, infrastructure and mines and minerals, he said and expressed the confidence that with joint efforts, they would achieve the mutually agreed targets of enhancing their bilateral trade to US$5 billion. The prime minister, who had arrived in Turkiye with a high-level delegation, further said that defence and security cooperation remained a vital pillar of Pakistan-Turkiye cooperation. He thanked Turkiye's consistent support to Pakistan in its counter-terror efforts, and said that recently in Balochistan, a train full of people traveling to their destinations had been attacked and seized by terrorists. The perpetrators killed dozens of innocent people and behind this incident were the terrorists of BLA and TTP, he said stressing that it was high time that they should team up their efforts to beat the menace for all the times to come; not only in Pakistan and Turkiye but all over the world, so that the world have the sigh of relief and move forward with a sense of peace. Prime Minister Sharif, referring to his meeting with the President, said that they both had exchanged views on the regional and global issues, including the rapidly evolving and the worrying situation in the Middle East. \"They stressed upon the need of unity among the Muslim Ummah. And expressed their deep concerns over the worsening situation in Gaza, and strongly condemned the brutal killing of over 50,000 innocent Palestinians including the women and children,\" he added. The prime minister further said that they called for immediate ceasefire and unhindered flow of humanitarian assistance to the Palestinian people. \"They also renewed their call for viable and independent and contiguous Palestinian State with pr-1967 borders with Al-Quds Al-Shareef as its Capital. This will be the only just and comprehensive, fair and lasting solution to the Palestinian question in accordance with the UN and OIC resolutions,\" he added. Prime Minister Sharif said \"Long standing alliances are shifting; giving rises to new partnerships, as nations carefully navigate the path to safeguard their national interests.\" He appreciated the people of Turkiye for their bold and courageous stance for the Muslims Ummah amid the global turbulences. He also expressed the confidence that under President Erdogan's leadership the people of Turkiye would achieve new heights of progress and prosperity. The prime minister said that President Erdogan had both the qualities of boldness and winning the hearts of his people which made him a great leader. President Erdogan symbolized the role of a great leader in galvanizing his people that was a wonderful story of great struggle and a source of inspiration for all, the prime minister said, adding president's political struggle over decades had transformed Turkiye into a robust and strong economy, and a strong voice at the global diplomatic stage. The prime minister said by overcoming natural disasters and navigating the complex geo-political struggle, was a miracle achieved by the Turkish people. He also expressed his gratitude to President Erdogan and his spouse for visiting Pakistan during disastrous floods of 2010 and 2022 and for their generous assistance and relief goods besides, establishment of rehabilitation centers, mobile hospitals and schools in Punjab and Sindh provinces. The prime minister also expressed his sincere gratitude to Turkiye's unwavering support to Pakistan on Kashmir issue and reiterated Pakistan's support to the Turkish people of Northern Cyprus and agreed to continue their close cooperation at multilateral fora including UN and OIC. He said that his visit reinforced their resolve to further deepen and diversify the strategic partnership and he was looking forward to translating their vision into tangible outcomes for the mutual benefits of the people of the two countries. Prime Minister Shehbaz Sharif conveyed his condolences on loss of lives in a road accident in Turkiye and prayed for the early recovery of the injured. President Recep Tayyip Erdogan, in his remarks, telecast live on Pakistan's national Tv channels, warmly welcomed the prime minister and his delegation. He recalled his visit to Pakistan during the 7th high level strategic council meeting in Islamabad. He said that these mutual contacts demonstrated exceptional level of cooperation reached between the two nations. President Erdogan said that they had exchanged views on the bilateral, regional and global issues. He also expressed his condolences over the Pakistanis killed during terrorism related incidents and reaffirmed Turkiye's support to Pakistan in its fight against all forms of terrorism. The president said that during his visit to Pakistan in February, both countries had signed 25 agreements in energy, water, science education, health and defence etc; and expressed the optimism that these were being implemented by the relevant quarters. He expressed Turkiye's keen interests in the joint projects in Pakistan and stressed upon promotion of mutual investment and free economic zones in Pakistan. President Erdogan said that they also discussed peace and stability in the region and he was pleased that they acted in complete harmony with Pakistan on every issue. He said that they always appreciated Pakistan for its resolute stance on Palestine, its strongest reaction to genocide of Palestinian people and its staunch support to their just cause at the UN and other world fora. The president said both countries would continue their cooperation for the establishment of free and independent Palestine with pre1967 borders with East Jerusalem as its capital. He said that they would take new steps of collaboration among Pakistan, Azerbaijan and Turkiye in diverse fields of cooperation with mutual consultations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}