{
  "article_id": "2025-04-23_70747cb3d0893cacf1e589f5687301e7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/zimbabwe-air-chief-calls-on-air-marshal-zaheer-sidhu/",
    "retrieved_at": "2025-08-27T14:47:17.642Z"
  },
  "metadata": {
    "title": "Zimbabwe Air Chief calls on Air Marshal Zaheer Sidhu",
    "author": null,
    "date_published": "2025-04-23T18:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 491,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 23 (APP): A high-level delegation led by Air Marshal John Jacob Nzvede, Commander of the Air Force of Zimbabwe, called on Chief of the Air Staff, Pakistan Air Force (PAF) Air Marshal Zaheer Ahmed Baber Sidhu here Wednesday. During the meeting both dignitaries engaged in extensive and fruitful discussions on matters of mutual interest, said a press release issued by Inter Services Public Relations (ISPR). The talks underscored a shared commitment to fostering defence collaboration with a particular focus on training, modernization and technical expertise. On his arrival, a smartly turned-out contingent of PAF presented Guard of Honour to Air Marshal John Jacob Nzvede. During the meeting, Chief of the Air Staff shared insight into various ongoing modernization projects of Pakistan Air Force's operational construct, force goals and plans for the force structure with a keen focus on future warfare. The Air Chief reiterated PAF's unwavering support to provide capacity-building assistance to the Air Force of Zimbabwe in up gradation of it's human resource, maintenance parameters and operational training. Chief of the Air Staff also highlighted Zimbabwe's enduring role as an integral partner, noting Pakistan's historical support in structuring and training of its pioneers. He further said that both the countries have long-standing military to military ties, which are based on convergence on all important issues related to regional peace and security. Air Marshal John Jacob Nzvede expressed his sincere gratitude for the warm hospitality extended to him underscoring the long-standing bond of friendship between Pakistan and Zimbabwe. He shared his earnest desire as regards to restructuring Zimbabwean Air Force's training framework from the ab-initio stage, seeking PAF's comprehensive support. Recognizing PAF's globally acknowledged training standards, Commander of the Air Force of Zimbabwe also conveyed his desire for the training of Zimbabwe Air Force cadets at the prestigious PAF Academy Asghar Khan to benefit from its state-of-the-art training modules. He also articulated Zimbabwe's request for the deployment of PAF pilots, engineers and technical personnel to assist in modernizing Zimbabwe Air Force. Both sides agreed to explore the potential for joint exchange programs to facilitate knowledge transfer and skill development, aligning Zimbabwe Air Force with contemporary air force standards. The meeting also focused on the timely procurement and delivery of 12 Super Mushak trainer aircraft to bolster Zimbabwe Air Force's operational training capacity. The Zimbabwean delegation was highly impressed by the advanced technological infrastructure witnessed at the National Aerospace Science & Technology Park, particularly in the domains of ISR, Cyber, Space Technology, Electronic Warfare and Unmanned Aerial Systems. The visiting dignitaries expressed a strong desire to leverage PAF's expertise in these fields in order to enhance futuristic aerospace and aviation capabilities of the Republic of Zimbabwe. The meeting between Air Chief Marshal Zaheer Ahmed Baber Sidhu and the Commander of the Air Force of Zimbabwe, is a testament to the mutual resolve of both the air forces to expand their partnership through capability sharing, joint exercises and tailored training exchanges.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}