{
  "article_id": "2025-04-23_2deaeccc410edee8c1cad325b0a829db",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/oracle-corporation-delegation-calls-on-awais-leghari/",
    "retrieved_at": "2025-08-27T14:49:06.501Z"
  },
  "metadata": {
    "title": "Oracle Corporation delegation calls on Awais Leghari",
    "author": null,
    "date_published": "2025-04-23T12:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 251,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 23 (APP): The delegation of Oracle Corporation led by Vice President of Industry Strategy Mike Ballard called on Federal Minister for Power Division, Sardar Awais Ahmad Khan Leghari to explore opportunities for collaboration on the digitization and automation of Pakistan's power sector. The meeting focused on modernizing the energy sector through the adoption of digital technologies, with the aim of improving operational performance, increasing transparency, and providing better services to consumers, said a press release issued here Wednesday. Minister Leghari emphasized the importance of embracing the rapid growth of information technology. He stated that IT capabilities are advancing swiftly across the world, and Pakistan must move beyond traditional systems and adopt a logical, data-driven approach. He said that partnerships with global technology firms like Oracle can help build an efficient, transparent, and consumer-friendly system. He further said that the purpose of digitization is not merely to ensure returns on investment, but to enhance transparency, improve accountability, and promote long-term performance. The Oracle delegation welcomed the government's vision. The representatives shared modern solutions such as smart metering and data analytics, which not only improve system performance but also deliver quality services to consumers. Mike Ballard highlighted Oracle's extensive experience in addressing non-technical losses in countries such as the United Kingdom, Turkey, and Japan, and expressed confidence that Pakistan could benefit from this expertise. The Ministry of Energy reaffirmed its commitment to adopting modern digital solutions and forging global partnerships to ensure a sustainable, advanced, and consumer-centric power sector in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}