{
  "title": "HEC announces medical scholarships in University of Dhaka",
  "link": "https://www.app.com.pk/national/hec-announces-medical-scholarships-in-university-of-dhaka/",
  "date_published": "2024-04-04T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 4 (APP): The Higher Education Commission (HEC) has announced education scholarships and admission to M.Sc. in rehabilitation Science in the University of Dhaka Bangladesh (8th Batch, July 2024 Intake).\nAccording to HEC, Bangladesh Health Professions Institute (BHPI),Centre for the Rehabilitation of the Paralysed (CRP) under the Faculty of Medicine, University of Dhaka, Bangladesh is inviting applications from the SAARC member countries for scholarships and admission for its eighth batch of M.Sc. in Rehabilitation Science (2 years) program funded by SAARC Development Fund (SDF).\nAs per eligibility criteria, the candidates must be citizens of any of the SAARC member countries and must have a bachelor’s degree in Physiotherapy/Occupational Therapy/ Speech and Language Therapy, Medicine, Nursing, Prosthetics & Orthotics or an equivalent degree in health-related subjects from a public university or recognized by relevant government authority.\nThe candidates must have completed at least one year internship training/work experience in a recognized hospital/institute/centre approved by the relevant government authority.\nSharing the details of application and document requirements, the admission-related information will be available on the webpages of CRP(http://crp-bangladesh.org/crp-project/regional-inter-professional-masters-program-rehabilitation-science-funded-saarc), and BHPI (https://www.bhpi.edu.bd/department/rehabilitation-science-international-program/).\nThe desire students are asked to submit their application forms [hard copies – (1) Admission and Scholarship Application Form and (2) Application form – Ministry of Health & Family Welfare, BD] in triplicate along with academic documents (attested by Foreign Ministries of your country) at the Bangladesh missions (Embassies or high commissions) in your country.\nThey are asked to send scan copies of your application forms and academic documents (attested by Foreign Ministries of your country) to bhpi.mrs@gmail.com.\nThe application deadline is April 30, 2024 (Application should be received no later than April 30, 2024, 17.00 Hours, Bangladesh time), while notification of admission will be issued on June 15, 2024 and admission deadline is July 15, 2024\nRegarding visa, the Ministry of Foreign Affairs (MOFA), Islamabad, has made mandatory for Pakistani Students proceeding to Bangladesh to obtain a ‘No Objection Certificate’ (NOC) from the Ministry of Interior (MOI) prior to applying for Bangladeshi Student Visa. For information, please contact Section Officer Political External (P.E) Wing-I, Ministry of Interior at Tel.No.051- 9208310.\nIt is to be mentioned here that HEC has only announced this scholarship program received through the official channel. Potential applicants may apply directly to the respective mission/university and queries may also be directed to the respective institute.\nFurther, HEC will have no financial liability regarding this scholarship. The donor institute/agency reserves all rights to amend and update any of the information and instructions that may be in force from time to time.\nIt is the sole responsibility of the students applying for any professional degree (Medical, Engineering, Nursing, Architecture, Law, Veterinary Medicine etc.) to first get confirmed its accreditation from the respective Councils i.e. Pakistan Medical and Dental Council (PMDC), Pakistan Engineering Council (PEC), Pakistan Nursing Council (PNC), Pakistan Council for Architects and Town Planners (PCATP), Pakistan Bar Council (PBC), Pakistan Veterinary Medical Council (PVMC), Pakistan Technology Council etc.",
  "retrievedAt": "2025-08-11T01:43:37.123Z"
}
