{
  "title": "Government launching several projects to fast track process youth’s empowerment: Rana Mashhood",
  "link": "https://www.app.com.pk/national/government-launching-several-projects-to-fast-track-process-youths-empowerment-rana-mashhood/",
  "date_published": "2024-04-04T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 4 (APP): Chairman Prime Minister’s Youth Programme Rana Mashhood Ahmed Khan on Thursday said that the government was striving for the empowerment of youth and it had planned to launch several projects to fast track this process.\nAddressing a press conference here, he said that Pakistan was facing multiple economic and political challenges and that all political forces and institutions should work together to overcome these challenges.\nHe said after the signing of an agreement with the International Monetary Fund, the economy was being put back on the right track and investors’ confidence was restored.\nHe said out of the 240 million population of Pakistan, about 70 percent comprised below 30 years. Rana Mashhood said it meant that 170 million of Pakistan’s population consisted of youth.\nHe said that the government was working on several programmes to engage the youth and to provide them with suitable platforms to show their talent and skills. “It is vital to provide the youth of the country platform and engage them positively to bring prosperity”, he added.\nHe said that the new generation will have to be given confidence that if they work hard, they will get the reward.\nMashhood said that in the field of education, sports and IT skills, the youth will have to come forward to contribute to nation building process.\nThanking the Pakistan Muslim League-Nawaz leadership for appointing him as Chairman of the Prime Minister’s Youth Programme, he said Shehbaz Sharif had launched many youth related projects in the Punjab as chief minister and now they would be replicated at the federal level.\nHe said that this year the scope of the youth programme would be expanded and information technology would be included in it. He said it was the vision of the PM that the IT industry should be transformed into a $ 15 to 25 billion industry and for this purpose the programmes launched by Punjab Information Technology Board would also be launched at the federal level.\nRana Mashhood said that three sectors including IT, skill development and agriculture were identified for getting short and mid-term progress results.\nHe said that the National Vocational and Technical Training Commission was joining hands with provincial technical education and vocational authorities to impart skill development to the youth. He said besides technical and vocational courses, the youth would also attend language classes for the countries they intended to go to.\nHe said in this era of IT, artificial intelligence and digitalization e-gaming or e-sports had become an industry worth billions of dollars. He said unfortunately in Pakistan, there was no organisation of Electronic sports.\nThe government was planning to formulate an e-sports organisation and train players for e-sports World Cup to be held in Saudi Arabia in July or August, he said adding that as per an estimate over 6 to seven million Pakistani youth were involved in e-sports and the government would now support them in their pursuit.\nHe said like education and IT skills development, sports had become a big industry which was neglected in the past. He said national games would be held this year with much fanfare and the talent identified in these games would be encouraged to participate in SAF games to be hosted by Pakistan next year.\nHe said that steps were being taken to promote local artisans and their crafts and for this purpose, they would be given opportunities to show their skills at national and international levels. He said that modern scientific facilities would be provided to these artisans so that they could further hone their talent.\nHe said that the tourism industry of Pakistan had the potential of $ 10 to 15 billion per year and the government would hold conferences to showcase the rich heritage of the country. He announced that double decker t buses would be run on tourist routes in Islamabad to attract both local and foreign tourists.\nHe said that all ministries of the present government were striving day and night for the revival of the economy. He said it was the hallmark of the PML-N to revive the ailing economy and despite multiple challenges, it will deliver again.\nHe said that the Punjab Endowment Fund and Danish Schools programmes launched by Prime Minister Shehbaz Sharif in the Punjab as chief minister would be expanded at the federal, AJK, GB, Sindh and Balochistan levels.\nHe said that Shehbaz Sharif as chief minister of Punjab had made the province a role model for other provinces and now that vision was being implemented in Pakistan and its impact would be visible in a few months.\nTo a question he said that the government was planning to patronise 12 sports and revival of hockey was part of the plan. He said the government was planning a hockey league.",
  "retrievedAt": "2025-08-11T01:43:28.433Z"
}
