{
  "title": "Israel’s adventurism in region unacceptable; must be held accountable: FO",
  "link": "https://www.app.com.pk/national/israels-adventurism-in-region-unacceptable-must-be-held-accountable-fo/",
  "date_published": "2024-04-04T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 4 (APP): Foreign Office spokesperson Mumtaz Zahra Baloch on Thursday strongly condemning the recent attack on the Iranian consulate in Syria said the Israeli “adventurism” in the region was unacceptable.\nThe Foreign Office spokesperson, in her weekly press briefing, said Israel must be held accountable for its irresponsible attack for its unabated atrocities in Gaza as well as the attack in an already volatile region.\n“Israel’s adventurism in the region reached a new height with its irresponsible attack this week on the consular section of the Iranian Embassy in Damascus, Syria. The attack is a violation of the UN Charter, international law, and Conventions,” she remarked.\nShe said over the past six months, Israeli authorities had been involved in cross and systematic violations of international humanitarian law by repeatedly targeting UNRWA, humanitarian relief organisations, and unarmed civilians.\n“The deliberate targeting of a humanitarian convoy bringing food to people facing famine is a serious violation of international humanitarian law.”\nCondemning the Israeli attacks on humanitarian convoys in Gaza, she called for international accountability of Israel for its crimes besides seeking “immediate, full, and effective” implementation of the provisional orders of the International Court of Justice.\n“We also reiterate our call for the full and expeditious implementation of the UN Security Council Resolution 2728, adopted on 25th of March, leading to a permanent ceasefire, lifting of all barriers to the provision of humanitarian assistance, and ensuring protection of civilians throughout the Gaza Strip,” the spokesperson commented.\nShe also condemned Thursday’s terrorist attack in the cities of Rask and Chabahar in Iran’s southeastern province of Sistan and Baluchestan, and conveyed Pakistan’s solidarity with the government and people of Iran.\nMentioning the ongoing visit of a high-level Iranian delegation to Pakistan, she said both countries had “re-engaged and re-established” all communication channels as existed before January this year.\nShe said the government and the people of Pakistan looked forward to the visit of Iranian President Ebrahim Raisi’s visit to their country.\nDiscussing the terrorist attack in Bisham that had killed Chinese nationals, the spokesperson said the law enforcement agencies were probing the incident and reiterated Pakistan’s commitment to fighting terrorism.\nShe said the projects being executed by Chinese firms faced a temporary freeze following the terrorist attack but the work was resumed following the security audit.\nTo a question, she reiterated that Pakistan would not hold any talks with TTP and expected the Afghan interim government to take action against the militant groups or forces involved in carrying out terror activities inside Pakistan.\nAbout the repatriation of illegal foreign nationals, the spokesperson said the policy was not Afghan-specific rather it featured the repatriation of all foreign nationals illegally staying in Pakistan. She said a limited number of foreigners were deported as the majority had returned voluntarily.\nShe said there was no change in Pakistan’s one-visa policy as all foreigners coming to Pakistan should carry valid passports and visas.\nShe told the media that Secretary of National Security Division Waqar Ahmed visited Astana, Kazakhstan to attend the 19th meeting of the Secretaries of the Security Council of the Shanghai Cooperation Organization (SCO) which discussed the strategic security issues affecting the SCO member states with a focus on terrorism, extremism, human and transnational crimes.\nIn his statement, the Secretary warned about the far-reaching impacts of the terrorist acts in the region and called for a comprehensive strategy to address the root causes of terrorism.\nThe spokesperson informed the media that Pakistan’s deputy permanent representative of Pakistan to the UN Ambassador Usman Jadoon was elected as Chairman of the UN Disarmament Commission for the year 2024.\nShe expressed the hope that during his chairmanship, Ambassador Jadoon would uphold the principles multilateralism, dialogue, and collaboration, and promote the mandate of the UN Disarmament Commission to consider and make recommendations on various problems in the field of disarmament.\nHighlighting the situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), the spokesperson said the Indian occupation authorities had once again decided to deny permission to hold Eid ul-Fitr prayers at Eidgah in Srinagar.\nShe said the chief cleric of Srinagar’s historic Jamia Mosque and senior Kashmiri leader Mirwaiz Umer Farooq had been placed under house detention to prevent him from attending an event held in the memory of his ancestors.\n“We urge the Indian authorities to respect the right of the people of IIIOJK to peaceful assembly and to freely practise their religion. Pakistan will continue to extend political, diplomatic, and moral support to our Kashmiri brothers and sisters for the just and peaceful settlement of the Jammu and Kashmir dispute in accordance with the UN Security Council resolutions,” she remarked.",
  "retrievedAt": "2025-08-11T01:43:27.090Z"
}
