{
  "title": "NCOC directs RSPN to help ICT administration to curb COVID-19 spread",
  "link": "https://www.app.com.pk/national/ncoc-directs-rspn-to-help-ict-administration-to-curb-covid-19-spread/",
  "date_published": "2020-05-05T00:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 05 (APP):The National Command and Operation Center (NCOC) Tuesday directed the Rural Support Programme Network (RSPN) to extend support to the Islamabad Capital Territory (ICT) administration in curbing the spread of coronavirus.\nIn its meeting, the NCOC asked the ICT administration to engage the NRSP volunteers to carry out relief activities in the city in view of COVID-19.\nSince a tendency was being developed among the citizens that the virus was not as deadly as it was being projected, the community mobilization was imperative to create massive awareness among the citizens on the coronavirus, the NCOC noted.\nDeputy Commissioner Islamabad Hamza Shafqaat said the volunteers would be informed about their assignments on Wednesday and provided required trainings before they commence community mobilization campaign in their respective Union Councils.\nThe assignments for the NRSP volunteers included implementation of Standard Operating Procedures (SOPs) in Mosques and commercial area, tracing of suspected COVID-19 cases, awareness creation, identification of deserving people in the community and others.\nThe NCOC was told that there were some 25,000 households in five Union Councils of the ICT rural areas. The NRSP volunteers had access to some 19,000 households.\nThe district administration official also apprised the NCOC about the initiatives taken to stem the coronavirus spread in the federal capital. The members of Prime Minister’s Corona Relief Tiger Force from Islamabad were also being imparted trainings to carry out relief activities in the city.\nThe meeting was attended by officials of the Ministry of National Health Services, Regulation and Coordination, district administration and RSPN.\nIt is pertinent to mentioned here that the NCOC have already directed all the Rural Support Programmes, spreading across the country, to enhance community mobilization to contain the spread of coronavirus in an effective manner.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:03.775Z"
}
