{
  "title": "Turkish Defence Minister visits Pakistan to bolster strategic ties",
  "author": null,
  "content": "ISLAMABAD, Sep 10 (APP): Minister of National Defence of Türkiye, Yasar Güler, concluded his three-day official visit to Pakistan from 8–10 September 2025, aimed at deepening bilateral cooperation and further enhancing strategic and defence ties between the two brotherly nations.\nDuring his visit, the Turkish minister led the Turkish delegation for the 16th Session of the Pakistan-Türkiye Joint Ministerial Commission (JMC).\nMinister Güler also called on Prime Minister Muhammad Shehbaz Sharif and held meetings with Defence Minister Khawaja Muhammad Asif and Field Marshal Syed Asim Munir during his 3-day visit, a press release issued by the Foreign Office Spokesperson said.\nDuring the call on Prime Minister Shehbaz Sharif, the two sides shared their commitment to further deepen the bilateral cooperation between the brotherly countries in all areas of mutual interest.\nThe prime minister underscored the importance of enhancing cooperation in trade and investment, joint research and development, IT, agriculture, energy, education, and cultural exchanges. During the meetings of Minister Güler with Defence Minister Khawaja Asif and Field Marshal Syed Asim Munir, both sides reaffirmed their commitment to further strengthening the strategic and defence cooperation.\nThe 16th JMC was co-chaired by Pakistan’s Commerce Minister Jam Kamal Khan and Minister Güler. The meeting provided an opportunity to follow-up on agenda of the High-Level Strategic Cooperation Council (HLSCC).\nKey outcomes of the meeting focused on strengthening cooperation in trade, investment, pharmaceuticals, information technology, e-commerce, connectivity and transport, energy, education, mining, agriculture, media, and tourism.\nThe visit provided an opportunity to take a stock of wide range of bilateral collaboration between the two countries. Both sides remained committed to transforming their fraternal ties into a multifaceted partnership.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:46:43.020Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/turkish-defence-minister-visits-pakistan-to-bolster-strategic-ties/",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T16:47:00.000Z"
}
