{
  "title": "Cabinet declares climate, agriculture emergencies: Dr. Tariq Fazal",
  "author": null,
  "content": "ISLAMABAD, Sep 10 (APP): Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry said Wednesday that the federal cabinet has declared both a Climate Emergency and an Agriculture Emergency in the country.\nSharing details of the cabinet meeting along with Petroleum Minister Ali Pervaiz Malik, he said the Prime Minister had decided — and the cabinet endorsed — the immediate enforcement of a climate emergency.\nClimate change, he said is already one of the most debated subjects globally and has been severely affecting Pakistan through shifting weather patterns.\n“Unfortunately, in past decades, we failed to protect our forests and trees, while encroachments narrowed natural waterways — rivers, streams, and channels that once allowed easy passage of rainwater. This has worsened the flooding situation we see today,” he said.\nThe minister added that the Climate Minister had been tasked with submitting a comprehensive report to the Prime Minister within 15 days. The cabinet will deliberate on the report, how Pakistan can cope with these climatic challenges and prepare effective strategies to protect the nation from such devastating losses in the future.\n“Since 2022, we have witnessed the devastation caused by floods in Khyber Pakhtunkhwa, Gilgit-Baltistan, and Punjab. Now, this water is flowing into Sindh from the five-river basin, and our prayers and efforts are focused on minimising the losses there as well,” he said.\nThe minister said the floods had caused massive destruction, particularly to agriculture, along with human and financial losses — a matter discussed in detail during the cabinet meeting. The Prime Minister expressed deep concern over the situation.\nAn agriculture emergency, he said, will help assess the extent of damage to agriculture across the country and determine how farmers can be compensated for their losses.\nDr. Tariq stressed that climate and agriculture challenges cannot be addressed without the cooperation, support, and consultation of provincial governments.\nTherefore, the Prime Minister has decided to convene an immediate meeting of all provincial stakeholders under the leadership of their respective Chief Ministers. “This country belongs to all of us, and together we must overcome its challenges,” he said, adding that stakeholders from Gilgit-Baltistan and Azad Kashmir will also participate.\nTurning to foreign relations, he termed the Prime Minister’s recent visit to China “highly successful,” saying the achievements made during the trip belong to the entire nation.\n“China is our great friend, which has always stood by us in every difficulty. Whether on economic fronts in the past or in our recent Marka-e-Haq, China’s role has been fundamental. The world witnessed how China supported us, and for that, we have expressed our sincere gratitude,” he said.\nHe added that following this visit, Pakistan is entering a new phase of relations with China. The China-Pakistan Economic Corridor (CPEC), which had faced hurdles in recent years, is now being revived with full commitment.\n“China, with clarity and dedication, is once again standing alongside Pakistan. Under the leadership of Prime Minister Shehbaz Sharif, the team is fully prepared to restart this journey with renewed determination, bringing good news for Pakistan,” he said.\nHe said the Prime Minister’s interactions with heads of state and government during his visit to China were held in an atmosphere of confidence, dignity, and mutual respect. “The way he was received and engaged in discussions is a matter of pride for the entire nation,” he added.\nPaying tribute to Major Adnan, who was martyred in Khyber Pakhtunkhwa a day earlier, the minister said the Prime Minister personally attended his funeral and shared the grief of his family.\nHe praised the courage of the martyr’s parents, who expressed pride that their son sacrificed his life for the country’s defense. “Their resolve is a beacon of strength for the entire nation,” he remarked.\nReaffirming the government’s stance against terrorism, he said the cabinet assured that Pakistan, as in the past, would stand shoulder-to-shoulder with its armed forces, martyrs, and ghazis until the last terrorist is eliminated.\n“This is a war for Pakistan’s security, survival, and progress,” he emphasized, adding that those who malign state institutions for political gains were acting irresponsibly and would be rejected by the nation.\nHe further said the Prime Minister had decided to lift the ban on domestic gas connections imposed in 2021, addressing a longstanding public demand.\nHe expressed gratitude to the Prime Minister and Petroleum Minister for resolving a major issue that households had been facing for years. “The difficulties caused by the suspension of gas connections will now be resolved,” he assured.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:46:19.068Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cabinet-declares-climate-agriculture-emergencies-dr-tariq-fazal/",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T18:05:00.000Z"
}
