{
  "title": "Canada, Pakistan discuss flood relief, climate cooperation",
  "author": null,
  "content": "ISLAMABAD, Sep 10 (APP):Federal Minister for Climate Change and Environmental Coordination Dr. Musadik Malik met with Luke Mayers, Chargé d’Affaires of the Canadian High Commission, on Wednesday to discuss Pakistan’s ongoing flood crisis and opportunities for enhanced bilateral cooperation in climate resilience and food security.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/09/PC.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nExpressing solidarity with Pakistan, Mayers conveyed Canada’s empathy over the loss of lives and widespread destruction caused by recent flooding.“Canada stands with the people of Pakistan in this difficult time,” he said.\nDr. Malik briefed the Canadian envoy on the scale of the disaster, noting that nearly 3.6 million people have been displaced.He stressed that while relief operations were underway, the greater challenge would come once floodwaters recede, leaving behind large-scale devastation to communities and infrastructure.The discussion also touched on the floods’ impact on food security, including the role of trade, food regulations, and the possible introduction of genetically modified (GMO) seeds to boost agricultural resilience.Highlighting future priorities, Dr. Malik said the Ministry was digitizing the Environmental Protection Agency (EPA) to streamline processes and improve transparency in environmental monitoring.Both sides reaffirmed their commitment to strengthening cooperation in climate resilience, sustainable development, and food security.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:47:05.327Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/canada-pakistan-discuss-flood-relief-climate-cooperation/",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T16:34:00.000Z"
}
