{
  "title": "Hot & dry weather likely to prevail across most parts of country",
  "author": null,
  "content": "ISLAMABAD, Sep 10 (APP):The Pakistan Meteorological Department (PMD) has forecast mainly hot and dry weather conditions in most parts of the country during the next 24 hours, with chances of rain-wind/thundershowers at isolated places in coastal areas of Sindh and Balochistan.\nAccording to the forecast, Thursday is expected to remain hot and dry in most regions. However, partly cloudy weather with rain-wind/thundershowers may occur in Kashmir and adjoining hilly areas during the afternoon.\nIn Islamabad and adjoining areas, the weather will remain mainly hot and dry, though there is a 35 percent chance of rain-wind/thunderstorm during the afternoon.\nIn Punjab, most districts will experience hot and dry weather, while the Pothohar region may witness isolated rain-wind/thundershowers.\nIn Khyber Pakhtunkhwa, hot and dry conditions will prevail in most districts, with chances of afternoon rain in Kohistan, Mansehra, Abbottabad, and adjoining areas. Sindh is likely to remain hot and dry overall, but Karachi, Hyderabad, Thatta, Jamshoro, and Dadu may receive isolated rain and thunderstorms.\nCoastal areas of Balochistan may also witness similar conditions, while the rest of the province will remain dry.\nKashmir is expected to remain partly cloudy with chances of isolated rain-thunderstorms in the afternoon, while Gilgit-Baltistan will likely experience hot and dry weather.\nThe Met Office noted that hot and dry weather will continue to prevail over most flood-affected districts of Punjab in the coming days.\nDuring the past 24 hours, rain-wind/thundershowers with scattered heavy falls were recorded in Sindh and at isolated places in Murree, Balochistan, and Gilgit-Baltistan, while other areas remained hot and dry.\nThe highest recorded rainfall was reported from Karachi’s Surjani Town (130mm), DHA (102mm), North Karachi (76mm), and Gulshan-e-Hadeed (74mm). Thatta received 72mm, Khairpur 45mm, and Tando Jam 40mm. In Balochistan, Uthal recorded 39mm, Ormara 34mm, and Lasbella 24mm, while Babusar in Gilgit-Baltistan received 10mm and Murree 3mm.\nThe highest temperatures were recorded in Nokundi at 43 C, Dalbandin at 42 C, and Chilas at 40 C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:45:50.131Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/hot-dry-weather-likely-to-prevail-across-most-parts-of-country/",
  "dateList": "2025-09-10",
  "date_published": "2025-09-10T22:06:00.000Z"
}
