{
  "title": "POA, Federations, Associations responsible for Pakistan’s poor performance in Olympics: Dr. Fahmida Mirza",
  "link": "https://www.app.com.pk/national/poa-federations-associations-responsible-for-pakistans-poor-performance-in-olympics-dr-fahmida-mirza/",
  "date_published": "2021-09-26T15:51:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sep 26 (APP):Federal Minister for Inter-Provincial Coordination Dr. Fahmida Mirza has said that the Pakistan Olympic Association, Federations, and Associations were responsible for Pakistan’s poor performance in the Tokyo Olympic-2020-21.\nTalking to media men she blamed the POA for taking no steps as far as winning back name and fame for Pakistan. “Sitting from the last 17 years but did nothing for the promotion of sports in Pakistan rather working for their own interest instead of sports betterment,” she added.\n“We are working to have a new sports policy and after the implementation of the same, sports related issues will be resolved in a better way and through that Policy the government would be able to bring the derailed sports back on track to progress,” Dr. Femida Mirza added.\nSearch for talent at schools and college levels would be made to promote sports and bring talent to the fore besides under the new sports police proper mechanism would be established so that we could be able to bring back our talented youth to the mainstream.\n“Pakistan is blessed with full of God gifted talent in all Games but the international politics and like dislike vanishes all such talent before it comes to the provincial and national level. It must be stopped and that is why steps have been taken in light of the vision of the Prime Minister who instructed us to take and safeguard the talented youth of Pakistan from such sports politics.”\n“We are going to introduce equal opportunities for the youth of Pakistan irrespective of indulging into Punjabi, Sindhi or Pashtun Politics,” Dr. Fahmida Mirza said. She said practical steps were being taken to promote sports across the country as per the vision of Prime Minister Imran Khan, Federal Minister for Inter-Provincial Coordination Dr. Fahmida Mirza said.\nTrials were underway in all provinces to bring out new talent. Introducing a transparent system which will promote sports across the country, she said. Federal Minister for Inter-Provincial Coordination Fahmida Mirza said that the graph of Pakistan Sports had gone down for many years but the PTI Government has sincerely taken the steps to bring it up.\n“Before our government, there was no structure for sports governance in the country and we have worked on it to streamline a lot of things,” she said. Search for Talent has been started at schools and college level while a systematic policy for sports is being formulated at the national level which will be made public very soon.\nAfter the implementation of the new policy in the country, sports related issues would be resolved in a better way. Asked about the worst performance in the Olympics, the Federal Minister said that the Pakistan Olympic Association was responsible for the poor performance in the Olympics.\n“It is unfortunate that personalities have taken over the institutions here but it would not happen now,” she said, adding that no sports policy has been formulated in the country since 2005. Due to lack of communication, no proper steps have been taken to bring talent to the fore that is why the Prime Minister of Pakistan Imran Khan was bringing a new policy by taking personal interest so as to make everyone accountable, she added.\nShe said all the provinces have been taken into confidence and held meetings with every stakeholder, even at the provincial level so that to take every one suggestion for a better sports policy. It was unfortunate that the personalities in the country consider themselves superior to the institutions, if the government makes a policy against their interests, it becomes a question against the government, she said.\n“The elites who have been in the Olympic associations for 17 years are oblivious to their responsibilities,” she said.\nShe said this year would be the year of sports and national level events would be organized in every province while concrete steps would be taken to find talent at the grassroots level. Appreciating the inaugural KP National Hockey League-2021, she said that such games at the provincial level and involving hockey international and Olympians would provide ample opportunities to the upcoming players to play side-by-side with them and learn better things out of the League. The contest would bring out the talent as well, she added.\nShe also assured all possible help to the Directorate General Sports for taking most steps in the right direction for bringing talented youth in different Games besides some key steps taken for development of international standard infrastructure in the province. She also appreciated Chief Minister Khyber Pakhtunkhwa Mahmood Khan for taking keen interest toward promotion of sports besides his decision of awarding sports scholarships to more than 1250 male and female medalists’ athletes.\nLater, she was accompanied with Additional Secretary Sports Tashfeen Haider, DG Sports KP Asfandyar Khattak, DG Sports PSB Col. Asif Zaman, visited Hayatabad Sports Complex Cricket Stadium, international standard gymnasium, Qayyum Sports Complex athletic track, badminton and martial art gymnasium and also witnessed the ongoing rehabilitation work at the PSB Coaching Center Peshawar and expressed satisfaction over the construction work.",
  "retrievedAt": "2025-08-11T21:19:49.159Z"
}
