{
  "title": "President urges national players to focus on their performance",
  "link": "https://www.app.com.pk/national/president-urges-national-players-to-focus-on-their-performance/",
  "date_published": "2021-09-26T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): President Dr Arif Alvi Sunday while expressing his confidence in the capabilities of national sports teams, stressed upon players to focus on their performance in the field, so as to bring further laurels to the country.\nAddressing a closing ceremony of DTA 14th Chief of Naval Staff (CNS) Amateur Golf Cup here at the Margalla Greens Golf Club, the president observed that sports always contributed to healthy activities, develop urge for competing and excelling while maintaining maximum performance.\nThe president also hoped that sports like golf would be promoted in the country, adding sports helped in learning different things about life.\nThe ceremony was attended by Chief of Naval Staff Admiral Muhammad Amjad Khan Niazi and a large number of civil and military dignitaries and participating golfers.\nReferring to the national cricket team, the president said the national players had experienced an era of bias in the past.\nThe current Pakistan cricket squad had visited the United Kingdom during Covid-19 pandemic, he said while citing the cancellation of foreign teams’ visit of Pakistan.\nHe said the prime minister had rightly urged the national team to focus on performing in the field which was vital.\nThe president further observed that Pakistani nation was blessed with capabilities and talents. The national teams, he said, by keeping up their performance, dignity and self ego, would bring more success to the country.\nThe president also narrated a historical incident of the cricket world when West Indian star Vivian Richards pummeled England legendary bowler Bob Willis with his superb batting.\nThe president appreciated the Margalla Golf Club for maintaining a lush green environment by constantly planting trees. He also shared his memories of Karachi golf club.\nHe said the human beings are in the habit of looking for greenery and crave for getting a glimpse of natural scenery wherever they went.\nThe president congratulated the prize winners for their well earned success and commended the high standards of sports displayed by all the participants.\nThe president, later, gave away trophies and awards among the winning players in the amateur, senior amateur and ladies categories.\nMajor Saleem of Quetta Golf Club was given the winner’s trophy for clinching the title.\nPakistan Navy has always actively pursued the cause of nurturing various sports activities and raise overall standards of sports at the national and international levels. The four-day long CNS Amateur Golf Cup is an annual feature of PGF and Pakistan Navy sports calendar.",
  "retrievedAt": "2025-08-11T21:19:51.573Z"
}
