{
  "title": "Zabiullah appreciates Pakistan for supporting Afghanistan",
  "link": "https://www.app.com.pk/national/zabiullah-appreciates-pakistan-for-supporting-afghanistan/",
  "date_published": "2021-09-26T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Acting Deputy Information Minister of Afghanistan Zabihullah Mujahid Sunday appreciated Pakistan for supporting Afghanistan before the international community.\nIn an interview with Pakistan Television, he said Pakistan had been vocal and has urged the international community to engage with Afghanistan.\nPakistan was a neighbour and Afghanistan was thankful for Pakistan’s stance regarding Afghanistan, he added.\nThe minister said Afghanistan wanted good relations with the international community and desired to expand trade and economic ties.\n“We hope that neighbouring countries will continue to extend support to Afghanistan before the international community.”\nHe said many countries had raised voices in our favour before the international community and the United States.Qatar, Uzbekistan and other countries had also adopted a positive stance towards Afghanistan, he said adding six days back China and Russia talked in our favour at the United Nations General Assembly.\nThe relations of Afghanistan will its neighbours and the international community were important, he noted.\nHe said the war had ended in Panjshir and “we do not desire war with anybody”.\nTime had come that the Afghan nation should work for the progress and prosperity of Afghanistan, he added.\nAfter peace in Afghanistan our priority was to expand trade with other countries, he told.\nHe warned that if any group would attack Afghanistan or would fight with the government, action would be taken.\nHe said Afghanistan would be further connected by road to Peshawar and different cities of Pakistan.\nTo a question, he said the desecration of the Pakistani flag at the Afghan border was an unfortunate incident and assured that action would be taken against anybody who would damage relations between Pakistan and Afghanistan.\nTo a question, he said if an invitation was extended to Afghan leadership for a visit to Pakistan, it would be considered.\nZabihullah said the Afghan government condemned the human rights violations in Indian Illegally Occupied Jammu and Kashmir.\nThe Afghan government would continue to provide diplomatic and political support to oppressed Muslims in different parts of the world, he concluded.",
  "retrievedAt": "2025-08-11T21:19:49.164Z"
}
