{
  "title": "PTI saves billion of rupees by ensuring transparency in road projects: Murad",
  "link": "https://www.app.com.pk/national/pti-saves-billion-of-rupees-by-ensuring-transparency-in-road-projects-murad/",
  "date_published": "2021-09-26T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP):Minister for Communications and Postal Services Murad Saeed on Sunday said that Pakistan Tehreek Insaf (PTI) government constructed National Highways and Motorways at a low cost as compared to previous government of Pakistan Muslim League (PML-N).\nAddressing a presser with Minister for Information and Broadcasting Chaudhry Fawad Hussain, he said PML-N government minted around one trillion rupees in awarding highways and motorways contracts, while PTI government saved billion of rupees by ensuring transparency in road infrastructure projects.\nHe said that despite of the rise in the value of dollar and the cost of other construction material, PTI was constructing motorways and highways with low cost.\nThe minister shared the details of per kilometers cost based on factors – increase/decrease of PML-N and PTI governments which were showing huge difference in the cost.\n“Prime Minister Imran Khan adopted zero tolerance against corruption and introduced culture of transparency and merit imperative for good governance and supremacy of law”, he said.\nHe said that present government was constructing historic roads and highways networks on the Build Operate Transfer and through investment instead of loans.\nThe minister said that nation was asking question, whether the past rulers should not have spent money on the welfare of people instead of committing corruption, accumulating debts and causing damages to national exchequer.\nMurad said that present government saved precious money of the nation in every sector transparently, whereas the previous governments caused huge damages to the national exchequer by looting and signing expensive contracts on huge loans.\nHe said that today under the leadership of of PM Imran Khan motorways were being built on investment and public private partnership.\nHe said that details about the roads contracts were made available on the website. He said that PTI government had completed planning for construction of additional 6118 km roads, highways and motorways including Peshawar –Dera Ismail Khan and Swat Motorways phase-II and many others mega projects.",
  "retrievedAt": "2025-08-11T21:19:49.161Z"
}
