{
  "title": "Rs 109.03 mln minority scholarships conferred to 8,688 students",
  "link": "https://www.app.com.pk/national/rs-109-03-mln-minority-scholarships-conferred-to-8688-students/",
  "date_published": "2021-09-26T12:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP):Ministry of Religious Affairs and Interfaith Harmony had granted scholarships worth of Rs 109.03 million to 8,688 students of minorities in last three years in order to provide financial assistance for their education.\nAccording to an official of the Ministry of Religious Affairs and Interfaith Harmony, these scholarships were awarded from fiscal year 2018-19 to FY 2020-2021 on the basis of need-cum-merit criterion in view of the financial status of the family of the minority applicant.According to year wise details, Some 2,934 students were conferred scholarships worth of Rs 37.59 million during fiscal year 2018-19.\nSimilarly, some 2,888 students were conferred Rs 34.44 million scholarships during FY 2019-20.Likewise, 2,866 students were given Rs 37 million scholarships during FY 2020-21.According to the criteria, the regular students of Hindu, Sikh, Christian, Buddhists, and other communities, having at least 50 percent marks in their last annual examination are eligible for the scholarships.\nThe minority students of the public sector universities in the country have been mostly the beneficiaries of these scholarships.\nThe students enrolled in the privately run educational institutions were not eligible for this scheme.\nHe said that these scholarships were awarded on the meritorious basis to help out the students of minority communities for continuance of their education and enable them to contribute to the cause of national development.\nThe functions performed by the religious ministry include financial assistance, award of scholarships, marriage dowry assistance for deserving families of the religious minorities, repair and maintenance of the worship and important places of the minority communities in country.\nHe said the ministry had executed some 47 minority welfare development schemes with the cost of Rs 61.802 million for the repair/renovation/ maintenance and protection of worship places of minorities from Minority Welfare Fund (MWF) in last two years.\nOut of total amount some Rs 35.8 million were spent on 28 minority development schemes during financial year 2019-20.\nSimilarly, Rs 26.002 million were spent executing 19 development schemes during financial year 2020-21.",
  "retrievedAt": "2025-08-11T21:19:51.482Z"
}
