{
  "title": "US launches $4 mln initiative for ‘Improving Girls’ Education Activity’  in KPK",
  "link": "https://www.app.com.pk/national/us-launches-4-mln-initiative-for-improving-girls-education-activity-in-kpk/",
  "date_published": "2022-12-10T08:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):The government of the United States (US) on Saturday launched a $4 million initiative on ‘Improving Girls’ Education Activity’ which aims to provide quality education to girls in remote areas of Khyber Pakhtunkhwa.\nThe US Ambassador Donald Blome and Khyber Pakhtunkhwa Minister for Elementary and Secondary Education Shahram Khan Tarakai inaugurated the U.S. government-funded $4 million initiative for ‘Improving Girls Education Activity’, said a news release of US embassy in Pakistan on Saturday.\n“The U.S. government supports Pakistan’s goal of ensuring a prosperous future for all its citizens-particularly girls,” said Ambassador Blome. “We look forward to a strong partnership and fruitful collaboration with the Khyber Pakhtunkhwa Education Department to strengthen education for Pakistani children, especially girls, through this activity”, he said.\nMinister Tarakai appreciated Ambassador Blome’s comments, noting: “The private sector, in recent years, has emerged as a key supporter of the government’s efforts to address challenges in the social sector. The successful partnerships in KP’s health sector are a testimony to that. We are positive that with the support from the U.S. government’s ‘Improving Girls’ Education Activity’, we will be able to make school management more efficient, thereby improving school quality.”During his trip to Peshawar, Ambassador Blome also visited the Eleanor Roosevelt Corner at Shaheed Benazir Bhutto Women’s University, the largest Women’s University in Khyber Pakhtunkhwa. The Eleanor Roosevelt Corner is one of the two American Spaces in the province that provides education and learning opportunities to youth.Ambassador Blome discussed combating gender-based violence through education and entrepreneurship with a panel of educators and female entrepreneurs as part of the “16 Days of Activism against Gender-Based Violence” campaign. “Advancing women’s economic security not only reduces their risk of experiencing gender-based violence – it is an effective development strategy for the whole community. The United States is proud to invest in and support the safety and prosperity of women and girls throughout Pakistan, including Khyber Pakhtunkhwa,” said Ambassador Blome during the event.Since 2008, the US government has provided over $2 billion in development assistance to Khyber Pakhtunkhwa to support education, health, economic growth, governance, and humanitarian needs.",
  "retrievedAt": "2025-08-11T15:59:44.124Z"
}
