{
  "title": "OIC secretary-general in Islamabad on a three-day visit",
  "link": "https://www.app.com.pk/national/oic-secretary-general-in-islamabad-on-three-day-visit/",
  "date_published": "2022-12-10T06:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): Secretary-General of the Organization of Islamic Cooperation (OIC) Hissein Brahim Taha on Saturday arrived here on a three-day visit.\nTaking place at the invitation of Foreign Minister Bilawal Bhutto Zardari, this is his first country visit since assuming office in November 2021.\nAt the airport, he was received by Pakistan’s Permanent Representative to OIC Rizwan Saeed Sheikh and Director General OIC Farrukh Iqbal Khan.\nDuring the visit, the OIC chief would hold a meeting with Prime Minister Shehbaz Sharif and hold talks with Foreign Minister Bilawal Bhutto Zardari.\nAccompanied by a five-member delegation, Hissein Brahim Taha will also visit Azad Jammu and Kashmir.\nThe meetings with ministers for Kashmir and Gilgit Baltistan Affairs, information technology, and commerce isalso on his agenda.\nThe Foreign Office said that during bilateral talks, the OIC secretary-general and the foreign minister would discuss inter alia issues on the agenda of OIC including the Jammu and Kashmir dispute, Islamophobia, and the humanitarian situation in Afghanistan.\nPakistan as a founding member of OIC will continue to make efforts to promote Islamic solidarity, unity, and dialogue in the organization.\nAs Chair of the Council of Foreign Ministers, Pakistan has worked towards fully activating the OIC peace and security architecture to resolve disputes and conflicts, established the OIC Trust Fund to channel dire humanitarian assistance to Afghanistan, provided a leadership role to address the abhorrent phenomena of Islamophobia and promote cooperation between OIC member states in the domain of trade, commerce, food security, science, and technology.\nThe OIC endeavors to safeguard and protect the interests of the Muslim world in the spirit of promoting international peace and harmony among various people of the world. It always raised voice against the Indian atrocities in IIOJK and supported the right to self-determination of Kashmiris as per UN resolutions.\nIn the 48th session of the OIC Council of Foreign Ministers (CFM) held in Islamabad in March this year, the Muslim world body had adopted a joint action plan on Kashmir issue. Under the plan, the OIC countries agreed to raise the Kashmir issue in their bilateral engagements with India and underscore respect for the fundamental human rights of the Kashmiri people, as well as lend support to monitor human rights violations in the IIOJK.\nOn May 16, 2022, OIC General Secretariat expressed deep concern over India’s attempts to redraw the electoral boundaries of the IIOJK altering the demographic structure of the territory and violating the rights of the Kashmiri people.\nThe OIC in a strongly worded statement condemned the Indian illegal move in IIOJK which is an internationally accepted disputed territory. The “delimitation” exercises are in direct contravention of the relevant UN Security Council resolutions and international law, including the 4th Geneva Convention.",
  "retrievedAt": "2025-08-11T15:59:37.318Z"
}
