{
  "title": "Imran led ‘propaganda group’ used Daily Mail to hamper Pakistan’s foreign aid",
  "link": "https://www.app.com.pk/national/imran-led-propaganda-group-used-daily-mail-to-hamper-pakistans-foreign-aid/",
  "date_published": "2022-12-10T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Saturday said the PTI was not a political party but a “propaganda group” which was led by a “foreign funded Fitna agent Imran Khan” who used the Daily Mail to hamper Pakistan’s foreign aid.\nAddressing a press conference here, she said that Imran Khan’s announcement of dissolution of Punjab and Khyber Pakhtunkhwa provincial assemblies was only a bluff. She dared him to make public the resignations of his party’s members of the two assemblies.\nThe minister alleged that the Pakistan Tehreek-e-Insaf (PTI) ran dirty trends on social media through the foreign funding received by its leader for fulfilling his anti-Pakistan agenda.\nImran Khan had been accusing others of gulping the money received in the name of natural disasters, but he himself utilized the charitable donations for his personal and political gains.\n“Imran Khan himself has been convicted for all the crimes for which he sent all his political opponents behind the bars during the last four years,” she said. He was accusing others of wrongdoings which he himself committed, she added.\nThe minister said that the “foreign agent led party” was a propaganda group which had not only harmed the country’s foreign policy and economy while being in power but also continued pursuing that “nefarious agenda” even after ouster from the government.\nShe said that in 2018, Pakistan’s growth rate was 6.2 percent while inflation rate was only 3 per cent. The China Pakistan Economic Corridor (CPEC) had been launched by 2016 and due to which the new generation was getting job opportunities while load shedding problem was overcome by completion of several power projects, she added.\nBut unfortunately, political instability was brought in the country as the thrice popularly elected prime minister was sent home on a ludicrous claim of not taking salary from his son’s firm, she added.\nThe minister said the failure of DRS during the 2018 general elections was part of the conspiracy to impose Imran Khan on the country. It was important to tell the facts to those who were hypnotised by the propaganda of “foreign funded agent”.\nWith Imran Khan being in power, she added, the country’s growth rate nosedived as his focus was only on victimization of the political opponents.\nA smear campaign was launched for the character assassination of opponents, who were also sent to jails by instituting bogus cases, as the PM House was turned into a kidnapping centre, she lamented.\nMarriyum said the Asset Recovery Unit headed by Shehzad Akbar became an Asset Making Unit, which was also used to malign Imran Khan’s opponents, who were kept in death cells during their incarceration.\nNo allegations of wrongdoings were proved against the opponents in the courts of law as the National Accountability Bureau sought adjustments instead of providing any evidences, she recalled.\nThe minister said David Rose of the Daily Mail was brought to Pakistan and he held meetings with Imran Khan at the PM House.The story against Shehbaz Sharif was planted in the newspaper by the PTI government.\nTaking a dig at Imran Khan, she wondered what type of video he had of David Rose.\nShe said the allegations that Shehbaz Sharif as Punjab chief minister had misappropriated DFID grant for the 2005 earthquake victims, were against national interests. In animosity towards Shehbaz Sharif, the PTI leadership forgot that such baseless allegations would harm Pakistan’s national interests and tarnish its image internationally, she added.\nThe very next day of publication of the story, despite being Sunday- a holiday, the DFID strongly rebutted the allegations of corruption in its funds use and provided details of standard operating procedures of its grants release, she added.All the foreign funded projects during Shehbaz Sharif’s chief ministership in Punjab were implemented in an exemplary manner, the minister remarked.\nShe said by misusing the powers, David Rose was provided access to the accused in jails and also given documents of the references (filed by NAB), which though had not yet achieved finality.\nNo allegation was proved against the Pakistan Muslim League-Nawaz leaders in any court and all the arrested ones had gotten bails, she said, adding the courts’ observations while hearing the bail pleas should be enough for the PTI leadership to feel ashamed for targeting the opponents.\nMarriyum said Shehbaz Sharif filed a defamation suit in the London High Court and its proceedings continued for three years. During the period, the management of Daily Mail sought adjournments for nine times.Despite those extensions and excuses of Covid-19 and law and order situation, no proof of corruption or misappropriation in the DFID grant was presented in the court, she added.\nThe Daily Mail management, she said, had confessed in the court that they did not have any evidence of the allegations against Shehbaz Sharif and had to tender an unconditional apology.\nShe said Justice Matthew of Queen’s Court in February last year asked the defendants to present any evidences but they failed to do so.\nThe minister recalled that the PTI used the fake story planted in the Daily Mail for its smear campaign and splashed it in local newspapers. David Rose was used to speak in many talk shows.\nLamenting the PTI’s mindset, she said even after the Daily Mail’s unconditional apology, many excuses were being made by the propaganda gang by saying that it apologized for only NAB’s part. She asked why Daily Mail had offered an unconditional apology and removed the entire story from its website and informed the court of removing its entire links in coordination with Google.\nMarriyum said the leaders were now making clamour about inflation, but in 2018 when they were brought in to power Pakistan’s GDP growth was over 6 per cent, which should have been touching 10 percent in next few years. But their four years misrule resulted in the recent economic crisis and high inflation as their only focus was on targeting the political opponents. Had the previous government any development agenda, 10 million people would not have lost jobs and the country would not have been facing economic catastrophe, she maintained.\nThe PTI regime, she said, had frozen the economic growth process and ruined the national economy as its only focus was how to fix the political opponents in fake cases.\nShe said the former rulers had failed to provide any evidences not only in the Pakistani courts, but also in the British ones. The latter, which were Imran’s favorite ones, had given the observation that Shehbaz Sharif was not indulged in money laundering, misuse of power and corruption.\nShe said during four years, the PTI was working on an the agenda of ruining the country and when out of power its leaders conspired to write a letter to the International Monetary Fund (IMF) to hamper the agreement.\nSimilarly, she said, the PTI played havoc with the foreign policy by playing with the cipher about which Imran Khan had recently stated that that issue was now over.\nThose who believed in Imran’s claims should realise that whatever happened to the country in the past four years was not an “accidental process” but was being done through a well planned plot which was being acted upon even today, she added. They were still out to destabilize the system and the government, the process which they had started with the 2014 sit-in, the minister said.\nMarriyum said Imran Khan would have to answer about the foreign funding of his party, BRT and Toshakhana cases, cipher and others. If thrice elected prime minister Nawaz Sharif, PM Shehbaz Sharif, Shahid Khaqan Abbasi, Khwaja Asif, Khwaja Saad Rafique, Salman Rafique, Hanif Abbasi and other PML-N leaders could respond to the allegations levelled against them, then Imran Khan and his party leaders could not be spared.\nWhenever the PTI leaders were asked to give answer for their wrongdoings, they started terming it political victimization, she added.\n“What sort of the mindset is this?” she questioned, adding the PTI was formed under a “nefarious plan” against the country and “the Daily Mail is one of the tool its leader has used to destroy Pakistan and its image across the world.”\nShe said Imran Khan abused the courts and launched malicious campaigns against the martyrs on the social media whenever the verdicts were given against him. It was the foreign funding which was used for spreading propaganda against the institutions to destabilize the country.\nImran Khan had been leading such campaigns against the institutions for the last couple of years, she alleged.\nThe minister said Imran Khan had no right to hurl allegations against others as his all opponents were being vindicated by the courts.\nShe said the country was facing massive problems and was brought to that situation under a conspiracy hatched by Imran Khan, who had created both political and economic instability by design.\nImran Khan had done nothing except polarization, chaos, conspiracies and allegations, she said, adding the people would have gotten 10 million jobs and five million homes if his government had focused on giving them relief.\nShe said the Daily Mail’s apology to Shehbaz Sharif had in fact restored the respect of 220 million Pakistanis who could now say with pride that they did not siphon off the aid money.\nMarriyum said contrarily Imran Khan had humiliated the country in the entire world by selling an expensive wrist watch with the image of Makkah Mukarrama, which he had received from a friendly and brotherly country.\nShe also announced during the presser that Minister for Interior Rana Sanaullah had been exonerated from the fake drug case made up by the PTI government against him.\nThe minister regretted that the PTI leaders had taken false oaths to justify the case in the media and crafted a story in which it was portrayed that an international drug mafia was operating in Faisalabad.\nShe asked whether Rana Sanaullah did not have a family as he was not defamed with the false case. “Who should be held accountable for the unimaginable cruelty meted out to him in jail?” she questioned.The minister said no defamation case was filed by the PTI chief when the foreign newspapers reported his corruption. Only consultations with the lawyers had been underway for the last many days, she added.\nMarriyum said Imran Khan had failed to submit his response in the court over the defamation cases filed by the PML-N leadership against him for churning out lies and levelling allegations against them.\nImran Khan and Shehzad Akbar should apologize to the 220 million people of Pakistan who were ridiculed by him across the globe, she maintained.\nThe minister also congratulated the nation on exoneration of Rana Sanaullah in a false case.\nShe said the media was also stifled and political opponents were sent behind bars to silence every voice which was raised against Imran Khan during his four year rule.\nTo a query, she said the double-digit inflation during the last six months was the result of the economic mess created by the PTI in the last four years.\nShe said the PML-N had fixed the economy during its previous government and brought down the inflation to the lowest level in the country’s history. “We will bring the inflation down again because we have the capability and experience,” she added.\nShe said the coalition government had been restoring the image of the country at international level through an effective diplomacy.\nMarriyum said Imran Khan had proven that he was a liar, incompetent, conspirator and disqualified person. All those who had looted the national exchequer, did foreign funding and stole gifts from the Toshakhana would be held accountable at all costs.\nTo another query, she took a dig at the PTI members who had approached the court after resigning from the National Assembly.\nShe dared Imran Khan and his party to dissolve the provincial assemblies where they were in majority. She said they would never tender en mass resignation from the assemblies.\nThe people needed to understand that Imran Khan had a mindset of hatching conspiracies, spreading chaos and anarchy, and hurling allegations on others, she noted.\nThe minister reiterated that the general election would be held in October 2023.To another query, she said there was no exchange of hot words between AJK Prime Minister Sardar Tanvir Ilyas and PM Shehbaz Sharif. The PTI would love to do anything which made it a headline in India.",
  "retrievedAt": "2025-08-11T15:59:40.244Z"
}
