{
  "title": "Pakistan a leading voice on protection against racism, Islamophobia: Bilawal",
  "link": "https://www.app.com.pk/national/pakistan-a-leading-voice-on-protection-against-racism-islamophobia-bilawal/",
  "date_published": "2022-12-10T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): As the world observes International Human Rights Day on Saturday, Foreign Minister Bilawal Bhutto Zardari said that Pakistan was a leading voice on issues such as the right to development, and protection against racism, Islamophobia, and xenophobia.\nThe foreign minister, in his message, said that Pakistan joined the international community in commemorating the 74th anniversary of the Universal Declaration on Human Rights (UDHR).\nHe said on the Day, Pakistan celebrated its achievements and reaffirmed its resolve to uphold the universally agreed human rights norms, principles and values.\nHe said the 1973 Constitution guaranteed equal rights for all and equal protection of law.\n“We are proud of our many achievements and the advancements made in women empowerment, child rights and the freedom of speech in Pakistan. Every successive generation has contributed to upholding of equality, dignity and human rights,” he remarked.\nHe said Pakistan had consistently made contributions including to global efforts, including at UN human rights bodies, to advance the ideals of human dignity, freedom and justice for all.\nThe foreign minister said that Pakistan had been at the forefront of the development of global human rights agenda – from its contribution in development of Universal Declaration on Human Rights and the International Convention on Elimination of Racial Discrimination to the landmark International Conferences on Human Rights in Vienna and the Beijing Conference on Women.\nHe said Pakistan had also been a champion of the rights of people living under colonialism and foreign occupation. It supported freedom movements of peoples living under colonialism in Africa and Asia, advocated against Apartheid and has been a leading voice against genocide, he added.\nForeign Minister Bilawal said Pakistan continued to be a firm advocate for the right of self-determination of the peoples of Palestine and Jammu and Kashmir as they had every right to realize their aspirations for dignity, liberty and human rights.\nHe urged the international community to join hands to bring an end to the suppression of the people of Indian Illegally Occupied Jammu & Kashmir (IIOJK) and the violation of their human rights. They have an inalienable right to enjoy the same rights and freedoms as any other free people, he added.\n“The people of Pakistan will continue to support them in their struggle for their right to determine their own future as guaranteed to them in international law and the UNSC resolutions,” the foreign minister resolved.",
  "retrievedAt": "2025-08-11T15:59:42.055Z"
}
