{
  "title": "UN chief, in a message for Human Rights Day,  calls for ensuring human dignity, justice",
  "link": "https://www.app.com.pk/national/un-chief-in-a-message-for-human-rights-day-calls-for-ensuring-human-dignity-justice/",
  "date_published": "2022-12-10T07:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP): UN Secretary-General Antonio Guterres has underscored the need for a recommitment to human rights, which, he said, are central to solving global problems.\n“Human rights are the foundation for human dignity, and the cornerstone of peaceful, inclusive, fair, equal and prosperous societies,” he said in a message for Human Rights Day on Saturday.\n“They are a unifying force and a rallying cry. They reflect the most fundamental thing we share – our common humanity.”\nThe annual commemoration celebrates the UN General Assembly’s adoption of the Universal Declaration of Human Rights on 10 December 1948.\nThe world is currently facing unprecedented and interlocking challenges to human rights, the UN chief said, such as increased hunger and poverty, shrinking civic space, and a “dangerous decline” in media freedom and the safety of journalists.\nMeanwhile, trust in institutions is evaporating, especially among young people, while the COVID-19 pandemic has led to increased levels of violence against women and girls.\nRacism, intolerance and discrimination are running rampant, the UN chief continued, and new human rights challenges are emerging from what he called “the triple planetary crisis” of climate change, biodiversity loss and pollution.\n“And we are only beginning to grasp the threat posed to human rights by some new technologies,” he added. “These trying times call for a reignition of our commitment to all human rights – civil, cultural, economic, political and social.”\nGuterres reminded that two years ago, he issued a Call to Action which put human rights at the centre of solutions to the challenges facing the international community.\n“This vision is further reflected in the Our Common Agenda report, with its appeal for a renewed social contract, anchored in human rights.”\nHe said the 75th anniversary of the landmark Universal Declaration on Human Rights next year must be an opportunity for action.\n“I urge Member States, civil society, the private sector and others to put human rights at the heart of efforts to reverse today’s damaging trends,” he said.\n“On this Human Rights Day, we reaffirm the universality and indivisibility of all rights, as we stand up for human rights for all.”",
  "retrievedAt": "2025-08-11T15:59:37.105Z"
}
