{
  "title": "Tarar for regulation of housing sector to curb unplanned growth of housing societies",
  "link": "https://www.app.com.pk/national/tarar-for-regulation-of-housing-sector-to-curb-unplanned-growth-of-housing-societies/",
  "date_published": "2022-12-10T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 10 (APP):Minister for Law and Justice Senator Azam Nazeer Tarar Saturday stressed the need of proper regulation of the housing sector to curb the unplanned growth of housing societies.\nHe expressed these views during his visit to the 1st International Housing Expo here.\nThe minister also visited the stalls of the Expo and appreciated the products and projects displayed at the occasion.\nHe said that despite multiple laws, unorganized growth of housing societies is on the rise, which is not a good trend and added that instead of helping in regulation, multiple laws are creating confusion.\nThe minister emphasized that regulated activity in the housing sector is important to meet the growing housing needs of people.\nAzam Nazeer said that the Federal Capital should be developed into a model city for the future generations.\nHe assured to fully cooperate with ICCI in amending the building bylaws for commercial and industrial buildings to cater to the needs of current business requirements.\nThe minister lauded the initiative of the Ministry of Housing & Works and Islamabad Chamber of Commerce & Industry for organizing the 1st International Housing EXPO to bring all stakeholders to one platform.\nSpeaking at the occasion, Ahsan Zafar Bakhtawari, President, Islamabad Chamber of Commerce & Industry said that the building bylaws of CDA were made many years ago and are not helping in construction of commercial and industrial buildings as per need of the current times.\nHe stressed that the government should cooperate in amending and upgrading these bylaws to meet the needs of current businesses.\nAhsan Zafar also invited the Federal Minister for Law & Justice to ICCI, which was accepted by Azad Nazeer Tarar.\nSecretary, Ministry of Housing & Works Iftikhar Shallwani said that the agricultural land is being converted into housing societies, which should be a cause of concern.\nHe stressed that this trend should be discouraged and vertical constructions should be encouraged through policy measures for optimum use of land.\nM. Madikiza, High Commissioner of South Africa, Senator Seeme Ezdi, Ms. Nilofar Bakhtiar Chairperson National Commission on the Status of Women, Dr. Akbar Nasir Khan Inspector General Police Islamabad, Hanif Abbasi former SAPM, Sardar Yasir Ilyas Khan CEO Centaurus Mall also visited the Expo and lauded the efforts of exhibitors for putting up high quality products and high-profile projects.\nOn the third day various sessions were held on the sidelines of the Expo including “Sustainable Post Disaster Rehabilitation and Reconstruction” in collaboration with UN Habitat Pakistan, “Urban Planning and Hydrology” in collaboration with NED University of Engineering & Technology Karachi and “Smart Growth and Vertical Development, Challenges and Way forward in collaboration with PHA Foundation.",
  "retrievedAt": "2025-08-11T15:59:38.211Z"
}
