{
  "article_id": "2025-08-29_b464cb606adc88b0a635b242f01cff22",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nchrs-commitment-to-minority-rightsachievements-and-progress-shared-with-na-speaker/",
    "retrieved_at": "2025-09-06T10:39:12.759Z"
  },
  "metadata": {
    "title": "NCHR’s commitment to Minority Rights:Achievements and Progress shared with NA Speaker",
    "author": null,
    "date_published": "2025-08-29T15:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 444,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 29 (APP): The National Commission for Human Rights (NCHR) has drawn attention to significant interventions for the protection of Pakistan's minority communities during a meeting between Member Minorities of the Commission, Manzoor Masih, and Speaker of the National Assembly, Sardar Ayaz Sadiq. Masih was accompanied by Assistant Director, Mamoona Malik, said a press release Friday. Masih presented the Commission's latest report, \"Upholding Inclusivity: Minority Rights Initiatives,\" which documents systemic challenges faced by minorities in Pakistan while outlining reforms and interventions carried out by the Commission. During the meeting, Masih briefed the Speaker on NCHR's ongoing efforts to confront discrimination in employment, education, and labor rights. One of the key cases discussed was the Commission's action against discriminatory job advertisements which included the phrase that \"only non-Muslims are eligible for the posts of sanitary workers\". Following NCHR's intervention, such advertisements were banned, a move that not only set a precedent domestically but also earned recognition internationally. The United Kingdom's House of Lords formally acknowledged NCHR's efforts in a letter of appreciation, terming it a positive step towards equality and dignity at work. The report also highlights NCHR's role in pressing for enforcement of the 5 percent quota for minorities in government jobs. Despite being mandated by law, the quota had remained largely unimplemented across various departments. NCHR pursued several cases, corresponded with relevant ministries, and succeeded in securing appointments under the quota in different institutions, while continuing to push for broader compliance. Educational inclusion was another focus area. After receiving complaints, NCHR investigated the implementation of the 2 percent quota for minorities in higher education. In response to the Commission's inquiry, around 42 universities nationwide shared data showing compliance with the quota, though NCHR noted the need for greater consistency and monitoring to ensure equal opportunities in access to higher education. In the labor sector, NCHR intervened where workers were being denied the minimum wages fixed by the government. Many of these cases involved minority workers in low-income roles. The Commission's follow-up with departments led to enforcement of wage laws in several instances, though it acknowledged that further oversight is necessary to protect vulnerable workers across the board. Speaker Ayaz Sadiq lauded NCHR's proactive approach, praising the Commission's efforts to highlight minority concerns and ensure their rights under the Constitution. He assured that the National Assembly would extend its support to the Commission's recommendations and work towards strengthening legislation and policy reforms that promote equality, harmony, and social justice in Pakistan. The meeting concluded with an understanding that closer collaboration between Parliament and NCHR was essential to amplify minority voices, safeguard their constitutional rights, and reinforce Pakistan's commitments under international human rights frameworks.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}