{
  "article_id": "2025-08-29_790f1ae8ef861058b3988d2f49dfca84",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-panel-applauds-app-md-vows-full-support-in-corruption-probe-2/",
    "retrieved_at": "2025-09-06T10:39:33.118Z"
  },
  "metadata": {
    "title": "NA Panel applauds APP MD, vows full support in corruption probe",
    "author": null,
    "date_published": "2025-08-29T15:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 732,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 29 (APP):The National Assembly Standing Committee on Information and Broadcasting on Friday commended Muhammad Asim Khichi, Managing Director of the Associated Press of Pakistan (APP), for exposing a major financial scandal involving billions of rupees within the organization. The meeting, chaired by MNA Pullain Baloch paid glowing tribute to MD APP's integrity and principled stance as a whistleblower, acknowledging his role in uncovering a deeply entrenched network of corruption. Chairman Pullain Baloch emphasized that the accountability process must not be unnecessarily prolonged and assured the committee's full support in bringing to justice those responsible for looting public funds. Secretary Ministry of Information and Broadcasting, Ms Ambreen Jan, also commended APP Managing Director Muhammad Asim Khichi for his integrity and decisive role in exposing the corruption scandal, reaffirming the ministry's support for transparency and institutional accountability. Member Kiran Dar reaffirmed the committee's backing for the MD's reform agenda aimed at enhancing institutional integrity. Committee member Syed Amin ul Haq (MQM) inquired whether the MD had received threats from elements linked to the corrupt mafia. He, along with other members, pledged unwavering support for Khichi's efforts to uphold transparency and resist external pressure. The committee unanimously reaffirmed its commitment to institutional accountability across all media-related departments and directed the APP Managing Director to take all necessary measures for the recovery of embezzled funds. Earlier, while briefing the committee, APP Managing Director Muhammad Asim Khichi stated that an internal inquiry had uncovered embezzlement exceeding Rs 1.24 billion in a Public Sector Development Project (PSDP) funded project. Additional irregularities were also detected in Employees Related Expenses, fake appointments, and Provident Fund accounts, leading the Federal Investigation Agency (FIA) to register a case against 16 individuals, including former executive directors, managers, and clerical staff. The Managing Director informed the committee that the organization's official website is generating annual revenue of Rs 2.4 million, reflecting its growing digital monetization potential. The organization's website has been successfully migrated to a local server, resulting in an estimated annual saving of $9,000. He further briefed the committee on APP's expanding digital footprint, noting that the website has recorded 85 million impressions. Facebook has reached 10.3 million users, TikTok 10 million, X (formerly Twitter) 1.5 million, Instagram 319,000, and YouTube 137,000. In terms of editorial output, APP maintains a consistent publishing pace, releasing between 350 to 400 news stories daily across its web platforms. MD informed members that cabinet approval is awaited for signing Memoranda of Understanding (MoUs) on news exchange with 11 foreign news agencies. The degree verification committee of the Associated Press of Pakistan (APP) has nearly completed its scrutiny process. MD confirmed that no individual found holding a fake or unverified academic credential will be spared, and strict disciplinary action will be taken in accordance with service rules. He informed the committee that submission of a life certificate has been made mandatory for pensioners every six months to ensure continued disbursement. Additionally, a demand of Rs 300 million has been placed before the Finance Division to incorporate pension enhancements announced in the last three federal budgets. MD said the management has outlined multiple strategic initiatives aimed at boosting revenue, with projections indicating potential annual earnings of up to Rs. 200 million. Secretary Information Ambreen Jan informed the Committee gradual reforms are being introduced in Pakistan Television Corporation (PTV) to improve operational efficiency. Following the earlier approval of Rs 11 billion to settle outstanding dues of PTV employees, the Ministry is now set to request an additional Rs 4.5 billion from the Finance Division to settle outstanding dues of PTV employees. The salaries of regular, contractual, and daily-wage PTV employees has been cleared till June 25. A representative of the Press Information Commission (PIC) informed the committee that over the past eight years, the commission registered a total of 6,340 complaints. Of these, 5,435 have been disposed of, while 905 remain under process. Additionally, 268 appeals are currently pending in various high courts. The official added that the PIC regularly ensures the training of its designated focal persons stationed at each ministry to strengthen institutional coordination and improve complaint handling. Principal Information Officer (PIO) said outstanding dues 2024-25 of newspapers will be cleared by September this year. The meeting was attended by MNAs Sehar Kamran, Amin ul Haq, Asia Naz Tanoli, Rana Ansar, Kiran Imran Dar, Shaheen, and Salahuddin Junejo. Mehtab Akbar Rashdi participated virtually via online platform.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}