{
  "title": "QAU Alumni leads nationwide Tree Plantation drive through planting 10,000 plants",
  "link": "https://www.app.com.pk/national/qau-alumni-leads-nationwide-tree-plantation-drive-through-planting-10000-plants/",
  "date_published": "2024-09-01T06:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): In a remarkable display of environmental stewardship and patriotism, the alumni of Quaid-i-Azam University (QAU) Islamabad, successfully planted approximately ten thousand trees across Pakistan from August 10 to 30, this year.\nThis extensive plantation drive, part of the 77th Independence Day celebrations, was conducted in collaboration with a wide range of stakeholders, particularly higher education institutions, according to a press release received here.\nThe tree plantation campaign, an annual tradition initiated by QAU Alumni in 2017, saw active participation in various regions of Pakistan, including Murree, Swat, Peshawar, Faisalabad, Lahore, Abbottabad, Karachi, Rawalpindi, Quetta, Wah, Multan Division, Gujjar Khan, and Islamabad.\nNotably, trees were also planted in federal colleges affiliated with QAU and in four newly established fruit orchards at the university, the release said.\nThis year’s drive was made possible through collaborations with key partners, including the Capital Development Authority (CDA) in Islamabad, the University of Lahore, Ibadat International University Islamabad, Chaon, Envoy Pakistan, Sidra Foundation, and other partner institutions.\nThe QAU Alumni also announced the next phase of the plantation drive to plant an additional twenty-five thousand trees in various cities across Khyber Pakhtunkhwa, South Punjab, northern Sindh, and Balochistan, reinforcing the QAU Alumni’s ongoing commitment to environmental sustainability and the greening of Pakistan.\nThis collective effort not only marks a significant contribution to the nation’s environmental goals but also strengthens the bonds between QAU Alumni and the wider community, fostering a spirit of unity and shared responsibility towards a greener future for Pakistan.",
  "retrievedAt": "2025-08-10T20:38:46.147Z"
}
