{
  "title": "Pak always raises Kashmiri voice at all global forums: Amir Muqam",
  "link": "https://www.app.com.pk/national/pak-always-raises-kashmiri-voice-at-all-global-forums-amir-muqam/",
  "date_published": "2024-09-01T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP):Federal Minister for Kashmir Affairs & Gilgilt Baltistan and SAFRON Engr Amir Muqam has said that considering its national duty, Pakistan has always raised its voice for Kashmiris right to self-determination at every international forum and continue to raise its voice till realisation of the Kashmiris goal of freedom.\nAddressing Kashmiri Diaspora in Toronto, Canada, Engr Amir Muqam said that Prime Minister of Pakistan Muhammad Shehbaz Sharif effectively advocated Kashmir dispute in his address at UN General Assembly forum and all international forums, said a press release.\nThe participants given standing ovation to Federal Minister Engr Amir Muqam on arrival to stage. They also chanted slogans Pakistan Zindabsd and PML N leadership Zindabad.\nHe said that Pakistan and particularly present government will continue to lend its unstinted moral, political and diplomatic support to the rightful and just cause of the freedom struggle of Kashmiris.\nThe Indian actions of 5th August 2019 a blatant violation of the UN Charter, the 4th Geneva Convention and international laws. For the last three years India had tried every tactic of oppression against the Kashmiris but their resolve and passion for freedom could not be weakened.\nThe barbaric and brutal occupation of IIOJK by India not only violates international law, but also makes a mockery of the globally accepted norms of fundamental rights and freedoms. The international community can no longer remain silent while India continues to perpetrate its oppression in Kashmir. Despite more than seven decades of Indian occupation, including four painful years of continuous military siege and media blackout, India has failed to silence the voices of the brave Kashmiri people, whose just freedom struggle has further intensified. Three successive generations of innocent Kashmiris have sacrificed their lives and liberties, but courageously continued to defy the increasing coercion of the Indian occupation forces.\nPakistan salutes these brave Kashmiri men and women and assures them of its continued resolute support in their cause for freedom from Indian subjugation. India’s failure to honour its commitments to the Kashmiri people and to the international community as well as to the United Nations, brings into question its standing as a responsible member state The people of Pakistan stand firmly behind their brothers and sisters in Kashmir and Pakistan’s moral, diplomatic and political support to the Kashmiris shall continue until India ends its gross and systematic violations of human rights in Indian Illegally Occupied Jammu and Kashmir revokes its illegal actions of August 5, 2019 and grants the Kashmiris their inalienable right to self-determination.\nTime has not diminished our resolve and support for Kashmiri brothers and sisters who are facing extreme atrocities at the hands of Indian occupation forces”.\nIndia’s refusal to grant the Kashmiris their inalienable right to self-determination has serious implications for South Asia and beyond. Pakistan will continue to lend its unstinted moral, political and diplomatic support to the rightful and just cause of the freedom struggle of the Kashmiri people.\nFederal Minister also paid glowing tributes to the life and struggle of prominent Kashmiri leader Syed Ali Gilani on his death anniversary. Engr Amir Muqam said that the government is actively working to bring an end to the economic crisis in the country.\nHe said the government took difficult decisions to stabilize the economic condition of the country by reducing expenses.\nHe said that process of development has been resumed with renewed spirit and devotion under the dynamic leadership of Prime Minister Shehbaz Sharif.\nOn this occasion, Raja Shafiq, Chairman Kashmir Committee Canada, Community Leader Murtaza Joya, High Commissioner of Pakistan in Canada Shah Faisal Kakar, Raja Muhammad Shafiq, Member of Parliament Canada Shafqat Ali, Pir Adnan Boudla, President Muslim League-N Canada Sohail Waraich, Dr. Regional Councilor Sami Ijaz, Council General Khalil Ahmed Bajwa and other Kashmiri leaders were also present. The hosts of the program, Raja Muhammad Shafiq and Murtaza Joya gathered the gathering in a short time and lit the flag of Pakistan and Kashmir. Federal Ministrr Engr Amir Muqam thanked both the hosts and highly praised overseas Pakistanis for contributing to Pakistan economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:38:02.658Z"
}
