{
  "title": "APHC-AJK, KLC remembers Syed Ali Gilani on his martyrdom day",
  "link": "https://www.app.com.pk/national/aphc-ajk-klc-remembers-syed-ali-gilani-on-his-martyrdom-day/",
  "date_published": "2024-09-01T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): All Parties Hurriyat Conference Azad Jammu and Kashmir (APHC-AJK) chapter and Kashmir Liberation Cell organized a conference here on Sunday on the third martyrdom anniversary of veteran Hurriyat leader Syed Ali Gilani. Chairman of Kashmir Parliamentary Committee Rana Qasim Noon was the special guest of the conference.\nThe speakers on the occasion paid glowing tributes to Syed Ali Gilani for his valuable services regarding the freedom of Kashmir and Islam and for sticking to his right-based stance till the last breath of his life.\nThey threw light on various aspects of Gilani’s life. In the conference, while reiterating the determination to continue the struggle under the guidance of Shaheed Gilani, they said the United Nations Security Council resolutions will be of primary importance for achieving the right to self-determination and no other formula will be accepted for settling the dispute.\nThe speakers said there will be no compromise on the right to self-determination and the main focus will be on it.\nThe speakers also strongly condemned the illegal and unilateral Indian action of August 5, 2019 when the Modi regime repealed the Kashmiris’ special status. They also denounced the illegal detention of Hurriyat leaders, including APHC Chairman Masarat Alam Butt, Shabbir Ahmad Shah, Muhammad Yasin Malik, Naeem Ahmad Khan, Dr Abdul Hameed Fayyaz, Ayaz Muhammad Akbar, Muhammad Qasim Faktoo, Aasiya Andrabi, Naheeda Nasreen and Fahmeeda Sufi and demanded their immediate release.\nThey appealed to the international human rights organizations to take notice of the plight of Kashmiri political detainees.\nAt the end of the conference, prayers were offered for the elevation of the ranks of Syed Ali Gilani and all the martyrs of occupied Jammu and Kashmir.\nMember of Parliament and Chairman of Kashmir Parliamentary Committee Rana Qasim Noon, Secretary General of Motamar Alam Islami, Raja Zafarul Haq, JI former ameer Sirajul Haq, Ajk former prime minister Sardar Atiq Khan, Ameer Jamaat-e-Islami Azad Kashmir, Dr. Mushtaq Khan, President of Pakistan Muslim League-Nawaz Azad Kashmir, Shah Ghulam Qadir, PPP Senator Sahar Kamran, Abdullah Gul, Farzana Yaqoob, Muhammad Farooq Rahmani, Mahmood Ahmed Saghar, General Secretary Advocate Parvez Shah, Fatihullah Khan, Sardar Khan Afsar Khan, Altaf Hussain Wani, Mushtaq Ahmed Butt, Najeef Al Ghafoor, Mian Muzaffar, Shamim Shawl, Ijaz Rahmani, Haji Muhammad Sultan, Syed Faiz Naqshbandi, Sheikh Abdul Mateen, Sheikh Muhammad Yaqoob, Dawood Khan, Zahid Ashraf, Zahid Safi, Raja Khadim Hussain, Hasan Al Banna, Nazir Karnai, Zahid Mushtaq. Hussain, Mohammad Ashraf Dar, Syed Gulshan, Imtiaz Wani, Sanaullah Dar, Abdul Hameed Lone, Adeel Mushtaq Wani, Manzoor Ahmed Dar, Sheikh Abdul Majid, Abdul Majeed Lone, Abdul Majeed Mir, Manzoor Ahmed Shah, Benazir, Attaullah, Raies Ahmad Mir, Khalid Shabbir, Afsar Khan, Bashir Usmani, Shaukat Abuzar and Zakirullah participated in the conference.",
  "retrievedAt": "2025-08-10T20:38:18.967Z"
}
