{
  "article_id": "2025-09-28_610066095e1b905ea5f3ce40d971f217",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/chinese-ambassador-attends-disaster-relief-supplies-handover-ceremony/",
    "retrieved_at": "2025-10-11T23:34:38.913Z"
  },
  "metadata": {
    "title": "Chinese ambassador attends disaster relief supplies’ handover ceremony",
    "author": null,
    "date_published": "2025-09-28T22:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 600,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 28 (APP):Chinese Ambassador Jiang Zaidong on Sunday attended the handover ceremony of the first batch of disaster relief supplies donated by the Chinese government to the government of Pakistan. Federal Minister Engr. Ameer Muqam and Chairman National Disaster Management Authority (NDMA) Lt Gen Inam Haider Malik were also present. Addressing the handover ceremony at Nur Khan Air Base, Jiang Zaidong said that President Xi Jinping, during his meeting with Prime Minister Shehbaz Sharif, stated that China and Pakistan are friends in need and that true friendship is shown in times of adversity. He said to support Pakistan's response to the floods, China has continuously provided cash and material assistance, vividly demonstrating the spirit of a community with a shared future, where mutual assistance and sharing weal and woe are essential. He expressed confidence that under the leadership of the Pakistani government and with the support of all sectors of society, the people in the disaster-stricken areas will overcome the impact of the floods and rebuild their beautiful homes. He said that since this summer, Pakistan has been hit by torrential rains and floods, destroying houses and inundating farmland in many areas, resulting in casualties and property damage. He said when the devastating Wenchuan earthquake struck China in 2008, Pakistan mobilized all of its strategic transport aircraft to immediately transport its entire strategic reserve of tents to the disaster area. He added to save space, the accompanying medical team removed the airplane seats and sat on the floor throughout the journey. \"We will never forget this.\" He said that when Pakistan suffered devastating floods in 2010, China immediately provided comprehensive assistance by land and air, dispatching the largest medical rescue team in history, setting a precedent in China's foreign aid and a fact that Pakistan still frequently recounts. This vividly embodies the spirit of a China-Pakistan community with a shared future, mutual assistance and sharing weal and woe. It was in this spirit that, following the recent floods, the Chinese government immediately provided US$2 million in cash assistance to help Pakistan meet its most urgently needed relief supplies, he added. He said as the disaster situation developed, and based on Pakistan's needs, China decided to provide an additional RMB 100 million in material assistance. He said today, two Y-20 aircraft delivered the first batch of 300 tents and 9,000 blankets to Islamabad, hoping they can be quickly distributed to the disaster area to provide shelter for the local people. \"We will continue to deliver additional supplies via air and sea transport. Natural disasters are merciless, but humanity is full of compassion.\" He said, \"We believe that under the strong leadership of the Pakistani government and with the active support of all sectors of society, the people in the affected areas will overcome the impact of the floods and rebuild their beautiful homes.\" He said, \"Please also rest assured, Pakistani brothers, that we are always here for you when you need us.I wish China and Pakistan prosperity, happiness, and well-being for our people, and that our friendship will be passed down from generation to generation and our strategic cooperation will flourish.\" Ameer Muqam stated that the Chinese government and people have always provided timely assistance to Pakistan in its most difficult times. He said that this aid package has once again elevated the ironclad friendship between China and Pakistan, providing shelter and protection for flood victims. The Pakistani government and people are sincerely grateful for this and will make good use of China's assistance to restore normal production and life in the affected areas as soon as possible, he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}