{
  "title": "Crackdown on illegal indoor sheesha cafés: 3 sealed, 10 arrested in night operation",
  "author": null,
  "content": "ISLAMABAD, Jun 24 (APP): The Islamabad Capital Territory (ICT) administration has continued its campaign against illegal indoor cafés serving sheesha and in late-night raids three sheesha cafés were sealed while 10 violators arrested.\nOn the instructions of Islamabad’s Deputy Commissioner Irfan Nawaz Memon, a surprise operation was conducted late at night in Bahria Enclave to clamp down on illegal indoor sheesha cafés.\nThe local administration sealed a café during the raid and arrested eight individuals on the spot. All of them were shifted to the police lock-up, while a formal case was registered against the café owner, said the spokesman of ICT administration here.\nAccording to officials, the raid was part of a wider campaign launched by the district administration to enforce existing laws and health regulations, which prohibit indoor smoking and unauthorized hookah services. The operation was led by field staff under the direct supervision of senior administrative officers.\nIn a related move, Assistant Commissioner Industrial Area took similar action in Islamabad’s Sector I-8, where two more illegal indoor cafés were sealed. These cafés were reportedly offering sheesha in violation of public health and safety rules. The administration stated that such places operate without legal licenses and ignore warnings issued by the authorities.\nThe DC Islamabad has also directed officials to arrest those found smoking sheesha at these venues. In earlier statements, he emphasized that indoor cafés offering sheesha create health risks and disturb the peace in residential and commercial areas.\nDistrict authorities said more actions are expected in the coming days as they tighten enforcement across Islamabad. Teams are being formed to inspect cafés, rooftop lounges, and indoor spots operating in violation of the law.\nThe Islamabad Capital Territory (ICT) administration has previously warned all owners of indoor smoking cafés to halt operations or face legal consequences. Despite this, several operators have resumed business, prompting the administration to carry out unannounced inspections.\nOfficials confirmed that the recent raids will be followed by regular checks across various sectors of the city, including F-10, F-11, G-9, and G-11, where similar violations have been reported. The district administration is coordinating with the police to ensure swift legal action in case of non-compliance.\nResidents in nearby areas have also raised concerns over the increasing number of such indoor spots. Many complain about the loud music, late-night gatherings, and the health hazards associated with indoor sheesha smoking. Complaints from the public have been one of the main reasons behind the ongoing action.\nThe administration said it will continue to follow a zero-tolerance policy against unauthorized sheesha cafés and similar indoor establishments. In future operations, those facilitating such services and even customers found violating the rules will be booked under relevant laws.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:23:45.504Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/crackdown-on-illegal-indoor-sheesha-cafes-3-sealed-10-arrested-in-night-operation/",
  "dateList": "2025-06-24",
  "date_published": "2025-06-24T12:09:00.000Z"
}
