{
  "title": "Qalam Karwan explores Hazrat Abu Bakr Siddique’s legacy as Amir-ul-Hajj",
  "author": null,
  "content": "ISLAMABAD, Jun 23 (APP): Qalam Karwan, a literary organization, recently hosted a virtual session of “Aalmi Halqa Mutalia Seerat-un-Nabi” focused on the significant role of Hazrat Abu Bakr Siddique (RA) as Amir-ul-Hajj.\nTitled “Hajj under the Leadership of Hazrat Abu Bakr Siddique (RA),” this special session was part of a monthly series aimed at delving into pivotal episodes from the life of the Prophet Muhammad (PBUH), with a particular emphasis on those associated with the month of Dhul-Hijjah, said a press release on Monday .\nRenowned scholar, researcher, and poet Syed Muhammad Akhtar from Karachi delivered the keynote address, shedding light on the importance of Hazrat Abu Bakr Siddiq’s leadership during the Hajj pilgrimage.\nThe session was presided over by senior columnist and poet Mir Afsar Aman from Islamabad.\nThe program opened with the recitation of the Holy Quran by Dr Sajid Khakwani, followed by a reading of Hadith by Ghazala Ambareen, and the review of the previous session by Naheed Afshan from Rawalpindi.\nSyed Muhammad Akhtar began by highlighting the personality, virtues, and merits of Hazrat Abu Bakr Siddiq (RA), citing several verses from the Qur’an and Hadith that honor his status.\nHe gave a brief overview of significant events from both the Makkah and Madinah periods in which Hazrat Abu Bakr (RA) played a pivotal role.\nThe scholar focused in detail on the historic appointment of Hazrat Abu Bakr (RA) as Amir-ul-Hajj in the year 9 AH, following the conquest of Makkah in 8 AH.\nThe speaker explained that the choice of Hazrat Ali (RA) for this role was in line with Arab tribal customs, where such declarations were traditionally made either by the leader himself or a close family member.\nSyed Muhammad Akhtar briefly touched upon key events of Hazrat Abu Bakr Siddiq’s (RA) caliphate, reflecting on his wisdom, leadership, and sacrifices for the Muslim Ummah.\nNaheed Afshan noted the credible use of references, calling it a hallmark of strong academic preparation, while Amber Zaman appreciated the historical chronology in the narration.\nShahzad Alam Siddiqi highlighted Hazrat Abu Bakr’s (RA) immense generosity, recalling how he once donated his entire wealth for the cause of Islam.\nDr Sajid Khakwani added that after becoming Caliph, Hazrat Abu Bakr (RA) deliberately chose to lead prayers from a slightly behind position on the Prophet’s pulpit out of respect, even sealing off the exact spot where the Prophet (PBUH) used to stand.\nSeveral attendees praised the scholarly depth and structured delivery of the speech.\nConcluding the session, President of the gathering Mir Afsar Aman declared Hazrat Abu Bakr Siddiq (RA) as the greatest human after all prophets.\n“The Prophet’s (PBUH) trust in Abu Bakr’s leadership as Amir-ul-Hajj is a testament to his towering character,” he stated.\nHe also mentioned the Prophet’s instruction to a woman to meet Hazrat Abu Bakr after his death, highlighting the continuity of leadership.\nHe concluded by praising Hazrat Abu Bakr’s (RA) foresight during critical moments of the early Caliphate and led a heartfelt closing prayer.\nThe spiritually enriching session ended on a note of reverence and reflection.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:24:13.198Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/qalam-karwan-explores-hazrat-abu-bakr-siddiques-legacy-as-amir-ul-hajj/",
  "dateList": "2025-06-24",
  "date_published": "2025-06-23T19:06:00.000Z"
}
