{
  "article_id": "2025-05-15_6795c88a0540fc76b59facac6cc371a0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/international-hawala-hundi-network-busted-three-arrested/",
    "retrieved_at": "2025-08-27T15:30:57.898Z"
  },
  "metadata": {
    "title": "International hawala-hundi network busted, three arrested",
    "author": null,
    "date_published": "2025-05-15T10:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 205,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, May 15 (APP):The Federal Investigation Agency (FIA) exposing an international hawala-hundi network operating in Lahore, arrested three suspects red-handed with large amounts of local and foreign currency. The raid was carried out by the FIA's Corporate Crime Circle on Racecourse Road and the arrested individuals have been identified as Muhammad Mohsin, Mubeen Rasheed and Zahid, said a spokesperson for the agency. According to initial investigations, the suspects were actively involved in illegal currency exchange and hawala-hundi transactions and were linked to international networks operating from Dubai. The suspects were apprehended while managing and accounting for funds received through hawala-hundi. During the operation, the FIA recovered PKR 12.38 million, 20,110, 457 Saudi Riyals and $167. In addition to the currency, the FIA also seized crucial evidence, including checkbooks, rubber stamps, receipts and mobile phones, which are believed to be connected to the illegal operations. The suspects failed to provide a satisfactory explanation regarding the origin and purpose of the recovered currency. They are currently in custody and being interrogated, while further raids are being conducted to apprehend their accomplices. \"No leniency will be shown to those damaging the national economy,\" said FIA Lahore Director Sarfraz Khan Virk, emphasizing the agency's commitment to curbing financial crimes.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}