{
  "article_id": "2025-05-15_d25bfc4b81be1784a8a5555c15f6a6fb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-taking-measures-to-improve-global-ranking-of-green-passport-tariq-fazal/",
    "retrieved_at": "2025-08-27T15:30:32.912Z"
  },
  "metadata": {
    "title": "Pakistan taking measures to improve global ranking of Green Passport: Tariq Fazal",
    "author": null,
    "date_published": "2025-05-15T10:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 256,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): Federal Minister for Parliamentary Affairs, Dr. Tariq Fazal Chaudhry, informed the National Assembly on Thursday that the government was actively taking steps to improve the international ranking of Pakistan's green passport. Responding to a question from MNA Sharmila Faruqi during the question hour, he said that Afghan nationals who mistakenly received Pakistani passports due to system errors are now being blocked. \"NADRA's system is among the best in the world, and several countries have expressed interest in adopting it,\" he added. He stressed that Pakistan's passport will only gain international respect when internal systems are improved. He criticized overseas individuals who, according to him, contribute to negative perceptions of Pakistan by supporting anti-Pakistan resolutions in foreign parliaments. Explaining the methodology behind global passport rankings, the minister said that 50% of the criteria depend on the number of countries a passport holder can travel to without a visa. \"Pakistan currently has visa-free agreements with 33 countries, while Japan enjoys such arrangements with 197 nations. Our lower ranking is a direct reflection of fewer international agreements,\" he explained. He further elaborated that taxation policies, global perception, and citizenship freedoms also influence passport rankings. Dr. Chaudhry mentioned that the launch of the new e-passport system is a significant step forward. In response to a question from MNA Samina Ghurki, he reiterated that passports issued to Afghan nationals in error are being cancelled. He concluded by stating that the status of Pakistan's passport has improved significantly in the aftermath of Indian aggression, boosting its global recognition.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}