{
  "article_id": "2025-05-15_50242ceb67589bceebd4fbc0c6f65f3e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kayani-meets-azerbaijani-officials-to-strengthen-bilateral-ties-in-railways-agriculture/",
    "retrieved_at": "2025-08-27T15:29:33.892Z"
  },
  "metadata": {
    "title": "Kayani meets Azerbaijani officials to strengthen bilateral ties in railways, agriculture",
    "author": null,
    "date_published": "2025-05-15T14:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): Minister of State for Railways Bilal Azhar Kayani on Thursday met with Azerbaijani officials in Baku to enhance cooperation between the two brotherly nations in the fields of railways and agriculture. During his meeting with Chairman of Azerbaijan Railways, Rovshan Rustamov, he emphasized the need to expand collaboration in the railway sector, said a news release received here. Chairman Rustamov assured full support and expressed interest in deepening cooperation in this area. Both sides agreed to continue discussions on matters related to rail transport in future. In a separate meeting with Azerbaijan's Deputy Minister of Agriculture, Sarvan Jafarov, Bilal Kiani conveyed gratitude on behalf of Prime Minister Shehbaz Sharif, the Government of Pakistan and the people of Pakistan for Azerbaijan's steadfast support during recent conflicts with India. They agreed to enhance agricultural cooperation between Pakistan and Azerbaijan. It was also agreed to strengthen partnerships between agricultural companies from both countries and to explore joint opportunities in trade, business and investment across all sectors. Further, both the sides expressed commitment to boosting collaboration in agricultural research, particularly in the development of high-quality seeds. Kayani reiterated Pakistan's deep appreciation for its fraternal ties with Azerbaijan, saying that frequent high-level visits and official engagements are a testament to the growing strength of bilateral relations. Deputy Minister Jafarov extended best wishes for Prime Minister Shehbaz Sharif and the Government of Pakistan and thanked Bilal Kayani for his visit to Azerbaijan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}