{
  "article_id": "2025-05-15_c947f17af46bc978725d19378f1d5626",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/1st-hajj-flight-through-road-to-makkah-initiative-lands-in-jeddah/",
    "retrieved_at": "2025-08-27T15:31:02.118Z"
  },
  "metadata": {
    "title": "1st Hajj flight through “Road to Makkah” initiative lands in Jeddah",
    "author": null,
    "date_published": "2025-05-15T07:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 284,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Jeddah, Saudi Arab, May 15 (APP): The first Pakistani Hajj flight to Jeddah, part of the Road to Makkah initiative, touched down at King Abdul Aziz International Airport in Jeddah on last Wednesday. Honorable Minister of Religious Affairs & Interfaith Harmony Mr. Sardar Muhammad Yousaf, Consul General of Pakistan in Jeddah, Mr. Khalid Majid, DG Hajj Mr. Abdul Wahab Soomro and the senior officers of the Consulate General of Pakistan, Jeddah were present at the airport to receive the Pakistani pilgrims who were presented with bouquets upon arrival at Jeddah. The inaugural Pakistani Hajj flight to Jeddah, carrying 310 passengers, arrived from Islamabad via the Road to Makkah initiative. This initiative allows immigration and other formalities of intending pilgrims travelling to holy land are being completed at Islamabad airport. It is noteworthy that Approximately 50,500 Pakistani pilgrims will travel to Saudi Arabia under the Road to Makkah initiative, with 28,000 departing from Islamabad and 22,500 from Karachi. This initiative will involve a total of 180 flights, comprising 100 from Islamabad and 80 from Karachi. As of now, around 18,000 Pakistani pilgrims have already arrived in Makkah for the Hajj pilgrimage. A significant number of pilgrims perform Hajj under the government Hajj scheme, while others travel through private Hajj tour companies. The Pakistani Hajj delegation has arranged suitable housing for all its pilgrims, provided essential facilities, and deployed service personnel. This includes a Medical Mission consisting of medical staff, doctors, and specialists, as well as moavineen and officials from the Ministry of Religious Affairs, who have joined the Hajj mission in the Kingdom of Saudi Arabia to support Hajj operations and services across the Holy City of Makkah Mukarramah and the city of Madinah Al-Munawwarah.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}