{
  "article_id": "2025-05-15_1f009ba5052f34cd4691fc840ce17851",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dasu-hydropower-project-chairman-wapda-reviews-construction-on-main-dam-power-house/",
    "retrieved_at": "2025-08-27T15:29:26.963Z"
  },
  "metadata": {
    "title": "Dasu Hydropower Project: Chairman WAPDA reviews construction on Main Dam, Power House",
    "author": null,
    "date_published": "2025-05-15T17:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 404,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP):Chairman Water and Power Development Authority (WAPDA) Engr Lt Gen Sajjad Ghani (Retd) visited Dasu Hydropower Project, being constructed on River Indus in Upper Kohistan district of Khyber Pakhtunkhwa. During his day-long visit, the Chairman reviewed construction progress on key sites, which include River Diversion System, Main Dam, Power House and relocated Karakoram Highway (KKH-1), said a press release issued on Thursday. The Project team, comprising GM/PD Dasu Hydropower Project, the Consultants and the Contractors, briefed the Chairman about site-wise targets and achievements. It was briefed that construction activities on 20 work fronts are progressing at a good pace. Several critical targets have recently been completed, while a number of milestones are about to be achieved. As per the details, excavation of right and left abutment of the Main Dam has been completed. Likewise, extended right bypass tunnel and right-side open channel are also ready for operation to pass excess water during the high flow season. After completion of the upstream and downstream starter (coffer) dams, excavation of the Main Dam's foundation is in progress and will be completed in August 2025. Yet another critical activity of placing Roller Compact Concrete (RCC) in the Main Dam is likely to be started by December this year. Excavation of the Power House will be completed in January 2026, while 25 Km-long KKH-1 with seven tunnels and three bridges will also be completed in February 2026. Electricity generation from the Project is scheduled in 2027. Speaking on the occasion, the Chairman urged upon the Consultants and the Contractors to expedite their efforts for completion of the Project as per the timelines. In second leg of the visit, the Chairman participated in a Jirga with local elders. Detailed deliberations were made on payment issues under Enhanced Self-Managed Relocation (ESMR) Package and implementation of Local Area Development Schemes (LADS). The Chairman said that WAPDA stands committed for socio-economic development of the people hailing from the Project area. He added that WAPDA is spending hefty amount on resettlement of the locals, environmental management and social development in the Project area. He directed the Project Management to keep close liaison with the locals to address grievances. It is important to note that the 4320 MW-Dasu Hydropower Project is planned to be completed in two stages. At present, WAPDA is constructing stage-I of 2160 MW and annual energy generation of 12 billion units of clean, green and affordable electricity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}