{
  "article_id": "2025-05-15_7c0aec79c269f4a079d2bcf41fd3b1bb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/intense-heat-wave-grips-pakistan-pmd/",
    "retrieved_at": "2025-08-27T15:31:26.775Z"
  },
  "metadata": {
    "title": "Intense heat wave grips Pakistan: PMD",
    "author": null,
    "date_published": "2025-05-15T17:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 380,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): Mainly hot and dry weather is expected in most parts of the country, with very hot conditions prevailing in the plains during daytime. However, isolated areas in Kashmir and nearby hilly regions may experience partly cloudy weather with light rain, wind, or thunderstorms in the afternoon. An intense heat wave is expected to affect the country over the next three to four days as per forecast of the Pakistan Meteorological Department (PMD). In the upper half of the country including central and upper Punjab, Islamabad, Khyber Pakhtunkhwa, Kashmir, and Gilgit-Baltistan, day temperatures are likely to remain 5 to 7C above normal from May 16 to 19. In the southern regions, including Sindh, southern Punjab, and Balochistan, temperatures are forecast to remain 4 to 6C above normal from May 16 to 20. In Islamabad, very hot and dry weather is expected, with chances of partly cloudy skies and gusty winds in the afternoon. Khyber Pakhtunkhwa is likely to witness predominantly hot and dry weather, with very hot conditions in southern and central districts. Light rain or thunderstorms may occur in Mansehra, Abbottabad, Battagram, and Kohistan during the afternoon. In Punjab, severe heat wave conditions are expected across most districts. However, isolated areas such as Murree, Galliyat, Rawalpindi, Talagang, Chakwal, Jhelum, Gujrat, Sialkot, Narowal, Gujranwala, Sheikhupura, and Lahore may receive light rain and dust-raising winds in the afternoon. Sindh will continue to experience very hot and dry conditions throughout the province. Hot and dry weather is also expected in most parts of Balochistan, with very hot conditions in the southern districts. Gusty winds are likely during the period. In Kashmir and Gilgit-Baltistan, mainly dry weather is expected, though isolated areas in Kashmir may receive light rain, wind, or thunderstorms during the afternoon. Over the past 24 hours, hot and dry weather prevailed over most parts of the country, with very hot conditions in the plains. The highest temperatures recorded were 48 C in Dadu and Turbat, 47 C in Dera Ghazi Khan, and 46 C in Noor Pur Thal, Bhakkar, Bahawalnagar, Rahim Yar Khan, Bahawalpur, and Nokkundi. The residents are advised to take necessary precautions against the extreme heat, stay hydrated, avoid sun exposure during peak hours, and look out for vulnerable individuals including children and the elderly.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}