{
  "article_id": "2025-05-15_cf6f12a77e2a308febd029b023bea73a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/date-sheet-rescheduled-for-postponed-ssc-hssc-annual-exams/",
    "retrieved_at": "2025-08-27T15:30:45.534Z"
  },
  "metadata": {
    "title": "Date sheet rescheduled for postponed SSC-HSSC annual exams",
    "author": null,
    "date_published": "2025-05-15T11:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 301,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, May 15 (APP):The Board of Intermediate and Secondary Education (BISE) Rawalpindi has announced revised dates for the postponed Matric practical and Intermediate theory examinations of the First Annual 2025 session. According to Controller of Examinations Tanveer Asghar Awan, the decision was made following directives from the Punjab Higher Education Department and the Chairman BISE Rawalpindi. According to the details the Matric practical examinations for Chemistry, Food & Nutrition, and Tailoring (for deaf and mute students), originally scheduled for 7th May 2025, will now be held on 27th May 2025, while the practical exams for subjects of Chemistry, Dress Making & Fashion Designing which were postponed on 9th May will take place on 29th May 2025. For Intermediate students, the theory papers originally scheduled for 7th May have been rescheduled to 16th June 2025, and those planned for 9th May will now be conducted on 31st May 2025. The Board has clarified that no changes have been made in allocated examination centers. \"All candidates must appear at their previously allocated examination centers and should arrive at least 30 minutes before the commencement of each exam\", said controller examination andding that the revised roll number slips are now available on the Board's official website, with regular candidates instructed to collect them from their respective institutions while private candidates can download them directly. The Board has confirmed that previously issued roll number slips will remain valid for use during the examinations. The Board has cancelled the 'Civics' Part-II examination for non-Muslim students since the prescribed textbook couldn't be published. Affected candidates will instead be evaluated based on their performance in Civics Part-I. The spokesman BISE Rawalpindi urged the students, parents, and teachers seeking additional information to visit the Board's official website or contact the helpline numbers 051-5450917-18, 051-5450923, 051-5450920, and 051-5450932 for assistance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}