{
  "article_id": "2025-05-15_99bf5aa1e30ff7cbc84ba87099561958",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-and-uk-step-up-cooperation-against-illegal-immigration-online-child-harassment/",
    "retrieved_at": "2025-08-27T15:30:28.252Z"
  },
  "metadata": {
    "title": "Pakistan and UK step up cooperation against Illegal immigration & online child harassment",
    "author": null,
    "date_published": "2025-05-15T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 375,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP):Pakistan and the United Kingdom have agreed to enhance their cooperation to tackle illegal immigration, online child harassment, and other serious crimes. The commitment was reaffirmed during a high-level meeting in Islamabad, chaired by Federal Interior Minister Mohsin Naqvi, where officials from both countries reviewed progress under the UK-Pakistan Serious Crime and Law Enforcement Programme (UPSCALE). The meeting focused on reviewing progress under the UK-Pakistan Serious Crime and Law Enforcement Programme (UPSCALE). Officials from UPSCALE, including Neil Fowler, Ken Daines, Habib Gul, and Fizza Waheed, participated in the session along with senior officers from Pakistan's Ministry of Interior and the Federal Investigation Agency (FIA). The participants reviewed actions taken to address key issues such as illegal immigration, online child harassment, mutual legal assistance, extradition, criminal record sharing, illegal funding, and anti-narcotics measures. Interior Minister Mohsin Naqvi emphasized the need for stronger coordination and joint actions to curb illegal immigration and drug trafficking. \"Illegal immigration is a top priority, and coordinated efforts must be made to prevent it,\" he said. The minister also stressed the importance of dealing firmly with online child harassment. \"Immediate and strict action must be taken in such cases, and all available resources will be used to protect children online,\" Naqvi stated. To tighten border control, Minister Naqvi announced that deported individuals involved in illegal migration would now be included in the passport control list for five years. The proposal to add sex offenders to this list is also under consideration. Acknowledging the UK's support, Naqvi welcomed continued collaboration. \"Mutual cooperation is essential to combat illegal immigration. We value British assistance in this regard,\" he noted. He also highlighted improvements made in mutual legal assistance rules between the two countries, which have led to more effective outcomes. The meeting was briefed on the progress of the UPSCALE programme, including the operational status of a dedicated delivery unit and the establishment of Pakistan's first sex offender registry. Naqvi pointed out that the Anti-Narcotics Force's capabilities have significantly improved under the programme and stressed the need to maintain the UPSCALE initiative on a long-term basis. The meeting concluded with a decision to conduct monthly progress reviews of the programme to ensure consistent advancement in combating organized crime and strengthening law enforcement.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}