{
  "article_id": "2025-05-15_6684d2974558c8bc1d590e55315d4e0a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pic-orders-ogdcl-to-make-public-csr-fund-details/",
    "retrieved_at": "2025-08-27T15:29:36.486Z"
  },
  "metadata": {
    "title": "PIC orders OGDCL to make public CSR fund details",
    "author": null,
    "date_published": "2025-05-15T14:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 363,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): The Pakistan Information Commission (PIC) on Thursday has directed the Oil and Gas Development Company Limited (OGDCL) to disclose comprehensive details about its Corporate Social Responsibility (CSR) Fund. The order was issued in response to an appeal filed by a citizen under the Right of Access to Information Act, 2017. During the hearing, Advocate Abdul Basit appeared on behalf of OGDCL and submitted a written reply claiming exemption from disclosure of the requested information under Section 16(c) of the Act. The order of the commission states that the reply had already been shared with the appellant on March 11, 2025. Despite no response being received from the appellant, the Commission deemed it appropriate to adjudicate the matter on its merits. The appellant had sought detailed information regarding the allocation and utilization of the CSR Fund. Specifically, the requested information includes the policy, rules, and regulations governing the CSR fund, the criteria for its allocation, and identification of its beneficiaries. Additionally, the appellant asked for details on the sectors and areas selected by OGDCL for CSR activities, analysis of the benefits derived from the fund distribution, and the mechanism in place to evaluate whether the objectives of the CSR initiatives were met. The appeal also demanded disclosure of any vendors hired under CSR initiatives and their qualifications, as well as a year-wise and district-wise breakup of the fund distribution over the past five years. Rejecting OGDCL's plea for exemption under Section 16(c), the PIC ruled that the requested information does not fall within the scope of any exemptions provided in the Act. On the contrary, the Commission held that the information must not only be disclosed but also proactively published in accordance with Section 5(g). The appeal was accordingly allowed. The Managing Director of OGDCL has been directed to furnish the complete information sought by the appellant, and to submit the same to the Commission, within ten days of receiving the order. The Commission has adjourned the matter to June 25, 2025, for the submission of a compliance report. The Commission also sent copy to the Secretary, Ministry of Petroleum and Natural Resources, and the Secretary to the Prime Minister.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}