{
  "article_id": "2025-05-15_0ad4683f16855020ef8828fe3943198e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aious-online-workshops-for-bs-and-b-ed-programs-to-begin-from-may-19/",
    "retrieved_at": "2025-08-27T15:30:19.684Z"
  },
  "metadata": {
    "title": "AIOU’s online workshops for BS and B.Ed programs to begin from May 19",
    "author": null,
    "date_published": "2025-05-15T12:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 243,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP):Allama Iqbal Open University(AIOU) has announced the commencement of workshops for BS and B.Ed (ODL programs) offered in the Spring Semester 2025. The schedule for the workshops and assignment submissions is available on the university's official website: www.aiou.edu.pk. According to the Directorate of Regional Services (DRS), these workshops will begin on May 19, 2025 and will be held online. Students can check their workshop schedule through the Aaghi LMS portal. The DRS has clarified that examinations will also be ongoing during this period, so if any student is unable to attend a workshop on a particular day, there is no need to worry. However, it is mandatory to complete the quiz associated with the workshop. The quiz will be available on the student portal from 8:00 AM on the fifth day of the workshop and will remain accessible for 72 hours (three days). In a special message to students, Vice Chancellor Professor Dr. Nasir Mahmood emphasized that workshops are a vital part of the educational journey, providing students with practical training and deeper understanding of their subjects. He urged students to actively participate in these sessions and complete the quizzes on time to further enhance their academic performance. Director General Regional Services, Dr. Malik Taqi Ahmad Khan stated that regional heads and the DRS team are always ready to provide full support. For further information and guidance, students are advised to carefully read the instructions available on the Aaghi portal.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}