{
  "article_id": "2025-05-15_3b98ecb367b0cc83072bfd25bc84493e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/five-reports-laid-before-senate/",
    "retrieved_at": "2025-08-27T15:29:37.231Z"
  },
  "metadata": {
    "title": "Five reports laid before Senate",
    "author": null,
    "date_published": "2025-05-15T13:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 277,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): Five reports from various standing committees, including Finance and Revenue, Law and Justice and Federal Education and Professional Training were presented in the Senate on Thursday. Senator Anusha Rahman, on behalf of the Chairman Standing Committee on Finance and Revenue Senator Saleem Mandviwalla, presented a report of the Committee in the House on the Money Bill to impose an off the grid levy on natural gas based captive power plants [The off the Grid (Captive Power Plants) Levy Bill, 2025], while Senator Shahadat Awan on behalf of Farooq Hamid Naek Chairman, Standing Committee on Law and Justice presented the report of the Committee on a Bill further to amend the Civil Courts Ordinance, 1962 [The Civil Courts (Amendment) Bill, 2025] in the House. Chairperson, Standing Committee on Federal Education and Professional Training Senator Bushra Anjum Butt presented report of the Committee on a Bill to establish the Nexus International University of Health Emerging Sciences and Technologies, Islamabad [The Nexus International University of Health Emerging Sciences and Technologies, Islamabad Bill, 2025], laid by Senator Nasir Mehmood on 17th February, 2025. Minister for Human Rights, Senator Azam Nazeer Tarar laid before the Senate the Annual Reports of the National Commission for Human Rights for the years 2023 and 2024, as required by sub-section (2) of section 28 of the National Commission for Human Rights Act, 2012. Minister for Parliamentary Affairs, Dr. Tariq Fazal Chaudhry, on behalf of Minister for Establishment, Senator Ahad Khan Cheema, laid before the Senate the Federal Public Service Commission Annual Report for the year 2023, as required by sub-section (1) of section 9 of the Federal Public Service Commission Ordinance, 1977.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}