{
  "article_id": "2025-05-15_dc6e69a140ae37846f1756bc26fd305e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-passes-resolution-praising-armed-forces-for-defending-countrys-territorial-integrity/",
    "retrieved_at": "2025-08-27T15:29:30.532Z"
  },
  "metadata": {
    "title": "Senate passes resolution praising armed forces for defending countryâs territorial integrity",
    "author": null,
    "date_published": "2025-05-15T16:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 453,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): The Senate on Thursday unanimously passed a landmark resolution paying rich tribute to the Armed Forces of Pakistan for the successful execution of Operation Bunyan-um-Marsoos, in response to unprovoked and unjustified Indian aggression. The resolution, moved by Federal Minister for Law and Justice Azam Nazeer Tarar in the House. The resolution hailed the Pakistan Army, Air Force, and Navy for their unwavering professionalism, strategic foresight, and steadfast dedication in defending the sovereignty and territorial integrity of the motherland. The resolution emphasized that the operation, conducted with exceptional restraint and maturity, reaffirmed Pakistanas status as a responsible nuclear state. It said that the nation bows its head in humility before the Almighty for granting the Pakistani nation the dignity and honour in defending the motherlandas territorial integrity against naked Indian aggression. It congratulated the entire nation, which rose above all differences and stood united behind its leadership across the political spectrum with one voice a Pakistan. The resolution paid glowing tribute to the valor and sacrifice of the armed forces, particularly commending the Pakistan Air Force for its combat excellence in repelling aggression and decisively shattering the myth of enemy military superiority, thereby restoring strategic balance in the region. Honouring the ultimate sacrifices of the martyrs, the Senate stated that their heroism and selflessness shall remain forever etched in the nationas collective memory. The resolution also condemned in the strongest terms the brutal Indian attacks on innocent civilians, including women, children, and mosques. The resolution expressed heartfelt condolences to the bereaved families of civilian martyrs and extended sincere gratitude to Pakistanas brotherly nations for their steadfast support during this time of trial. Reiterating its pledge to regional and global peace with dignity and honour, the House emphasized that democracies are committed to dialogue, not conflict. It underscored that a secure neighbourhood and long-term stability in South Asia could only be achieved through sincere and structured negotiations. The resolution urged authorities to actively engage the international community to resolve the Jammu and Kashmir dispute in accordance with the aspirations of the Kashmiri people and relevant United Nations Security Council resolutions. It further stressed the importance of ensuring the full implementation of the Indus Waters Treaty and affirmed that safeguarding Pakistanas water rights is a critical component of national security. The resolution further stressed the sanctity of the Indus Waters Treaty, warning that any Indian attempts to violate or obstruct Pakistanas rightful share of water would be treated as a grave breach of international lawaamounting to a war crime with severe regional and global consequences. The House reaffirmed that it would continue to play its constitutional role in protecting national interests and promoting peace, unity, and security for the people of Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}