{
  "article_id": "2025-05-15_d7f5e48a1295ceb26af2aed5e80f6a81",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ulemas-approve-quran-app-back-armed-forces-declare-friday-as-day-of-gratitude/",
    "retrieved_at": "2025-08-27T15:29:38.962Z"
  },
  "metadata": {
    "title": "Ulema approve Quran app, call for religious harmony at high-level conference",
    "author": null,
    "date_published": "2025-05-15T13:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 633,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, May 15 (APP): The Ministry of Religious Affairs and Interfaith Harmony on Thursday held a significant conference of the National Ulema and Mashaikh Council and brought together prominent religious scholars from across the country, representing various schools of thought, to deliberate on crucial national and religious matters at a local hotel. The conference featured extensive discussions on the proposed National Ulema and Mashaikh Council Bill. In a notable development, the participants approved the English translation of the Holy Quran, and the official launch of a dedicated Quran mobile application also took place during the event. Prominent religious figures including Shabbir Ahmed Usmani, Maulana Hanif Jalandhri, Maulana Abdul Haq, and Central Ruet-e-Hilal Committee Chairman and Badshahi Mosque Khateeb, Maulana Syed Abdul Khabir Azad addressed the gathering. The scholars paid tribute to the sacrifices made by the armed forces of Pakistan and emphasized national unity. Speaking at the occasion, Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf announced that all recommendations put forward during the conference would be conveyed to the prime minister. aThe Ministry of Religious Affairs and Interfaith Harmony takes the suggestions presented today seriously and will work towards implementing them,a he stated announcing plans to revive the existing Cell for the Protection of the Sanctity of the Holy Prophet (Peace Be Upon Him), and to organize similar conferences across other provinces and cities. Sardar Yousaf also strongly condemned the ongoing oppression in Palestine and Indian Illegally Occupied Jammu and Kashmir, urging the global academic and religious community to play their role in advocating for the oppressed. He reaffirmed Pakistanas support for the Kashmiri people in accordance with UN resolutions. Expressing gratitude to all scholars who traveled from distant areas to attend the event, he noted that while the conference was originally expected to be held after Hajj, efforts by the ministryas team enabled its early convening. He expressed hope for a successful Hajj season ahead and reassured the religious community that the ministry belongs to them. Calling for religious harmony, the minister urged scholars from all sects to promote peace and brotherhood in the Muslim Ummah and refrain from issuing divisive Fatwas. Shabbir Ahmed Usmani, while addressing the gathering, praised the role of religious leaders, mosques, and seminary students in uniting the nation during times of aggression. aWhen Modi attacked our madaris, I declared then his game was over,a he said, attributing Pakistanas recent defensive success to the prayers and resolve of scholars and citizens alike. Usmani assured that all recommendations from the conference, including those related to the Madaris Bill, would be conveyed directly to the prime minister. Maulana Abdul Haq expressed gratitude to scholars and called the conference athe need of the hour.a He emphasized the historical importance of such gatherings in promoting peace and urged prompt implementation of the recommendations made, including the launch of the Quran mobile application. Maulana Syed Abdul Khabir Azad said the nation had achieved a major victory in the battle for truth, crediting Pakistanas courageous armed forces for delivering a strong and decisive response to enemy aggression. He condemned recent Indian attacks that claimed innocent civilian lives and targeted mosques and religious seminaries, stressing that Pakistan had responded in self-defense while demonstrating to the world that it remains a peace-loving nation. Quoting the Holy Quran, he said, aTruth will always prevail, and falsehood is destined to perish.a Maulana Hanif Jalandhri praised Operation Bunyan-ul-Marsoos for thwarting the enemyas hostile ambitions. He affirmed the Councilas unwavering support for the armed forces and called for global condemnation of acts targeting civilians, mosques, and religious institutions. The conference concluded with a unanimous decision to observe May 16 (Friday) as Youm-e-Tashakur (Day of Gratitude) and Youm-e-Pakistan. Special prayers will be offered across mosques nationwide for the countryas defense and the success of its armed forces.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}