{
  "title": "Govt determined to implement institutional reforms: Fawad",
  "link": "https://www.app.com.pk/national/govt-determined-to-implement-institutional-reforms-fawad/",
  "date_published": "2020-07-22T03:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):Minister for Science and Technology Chaudhry Fawad Hussain Wednesday assured his government was determined to implement a comprehensive reforms agenda to bring the country’s institutions including media out of current challenges.\nTalking to a private news channel, Fawad said the government believed in freedom of expression and did not want to impose any curbs on media’s freedom but there was dire need to create a regulatory authority for all types of media including print, electronic and digital. He further stressed for digitalization of premier news agency “Associated Press of Pakistan (APP)” and state tv “Pakistan Television(PTV)”, saying these two organizations should be reformed on modern lines and should be taken out of financial crisis under a comprehensive plan.\nHe said that i had also suggested to make APP a digital news agency when i was serving in the capacity of Minister of Information adding that PTV should also have more entertainment channels in this age of information.\nFawad said the government under the vision of Prime Minister Imran Khan was concentrating on taking the country forward in the field of digital media.\nFawad said that a strong, vibrant and responsible media play a pivotal role in development of the country and keep the people well informed, adding there should be a media court where media related issues should be heard.\nHe said links with the media should be further strengthened in order to discourage the trend of baseless stories.\nReplying to a question, he said “Opposition is not an issue, the issue is that people have a lot of expectations from PTI. People hope that PTI will bring a sea of change in country and that is a real challenge for us”.\nReplying to another question regarding moon sighting issue, he said his ministry had formalized a system for moon sighting and sent its plan to the religious affairs ministry for approval; adding that the ministry sent the matter to Council of Islamic Ideology (CII).\n“Now the matter is in their court and its cabinet’s job either they want to implement this system or not,” said the minister.\nThe minister said that if people continued to rely on sighting of the moon with naked eye, the country will “never be able to determine Eid on the same day” and the problem will persist.\n“If you say you want to see it with the naked eye, then the Ruet-e-Hilal Committee should comprise men and women of 20 to 22 years age whose eyesight (is perfect),” said the minister.\nFawad was of the opinion that the Zilhaj moon was born on Monday night at 10:33 pm and yesterday was present for “more than 24 hours” but the moon sighting committee said they did not see it “as there were clouds in Karachi”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:31:42.322Z"
}
