{
  "title": "Pakistan committed to fraternal ties with Bangladesh: PM",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-fraternal-ties-with-bangladesh-pm/",
  "date_published": "2020-07-22T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):Prime Minister Imran Khan on Wednesday said Pakistan was committed to deepening fraternal relations with Bangladesh on the basis of mutual trust, mutual respect and sovereign equality.\nThe prime minister expressed these view in a telephone call made to Bangladesh’s Prime Minister Sheikh Hasina.\nImran Khan underscored the importance Pakistan attached to closer ties with Bangladesh and highlighted the significance of regular bilateral contacts and people-to-people exchanges.\nReaffirming Pakistan’s commitment to SAARC, Prime Minister Imran Khan underlined the importance of both countries’ working for enhanced regional cooperation for sustainable peace and prosperity.\nImran Khan offered condolences to Sheikh Hasina on loss of lives due to COVID-19 in Bangladesh, however commended the measures taken by her leadership to contain the spread of virus.\nThe two leaders exchanged views on their respective steps to deal with the myriad challenges posed by COVID-19.\nPrime Minister Imran Khan apprised of his government’s measures to save lives and livelihoods and also his “Global Initiative on Debt Relief” for developing countries.\nHe extended commiserations on the material and human losses due to the recent flooding in Bangladesh and prayed for early recovery of the people affected by this natural calamity.\nPrime Minister Imran Khan shared Pakistan’s perspective on the grave situation in the Indian Occupied Jammu and Kashmir (IOJ&K) and stressed the importance of peaceful resolution of the Jammu and Kashmir dispute for a safe and prosperous region.\nHe also reiterated his cordial invitation to Prime Minister Sheikh Hasina to visit Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:31:33.660Z"
}
