{
  "title": "Trade facilitation priority of PTI govt: Arbab Shahzad",
  "link": "https://www.app.com.pk/national/trade-facilitation-priority-of-pti-govt-arbab-shahzad/",
  "date_published": "2020-07-22T02:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):Special Assistant to the Prime Minster on Establishment Shahzad Arbab Wednesday said that trade facilitation and ease of doing business was priority of the PTI government.  He said that COVID-19 had damaged the interests of traders and businessmen especially in and around Chaman area.  He said that exporters and importers facilitation will increase bilateral trade between Afghanistan and Pakistan.\nHe expressed these views while addressing the meeting here on the closure of Chaman border and the difficulties being faced by common people of Chaman District. The meeting proposed to coordinate with the provincial authorities on the issues faced by the traders and businessmen in and around Chaman border as people of the same tribe were settling across the border. The meeting also decided to recommend the provincial and district authorities to facilitate the locals immediately in this regard.\nThe meeting was attended by members National Assembly Shandana Gulzar, Mohsin Darwar, Ali Wazeer, Muhammad Sadiq Shaikh, Nafisa Khattak and officers from Ministry of Commerce, Interior, Health and officers of finance.  The task force of Pak-Afghan Parliamentary Friendship Group on Tracking and Scanning of Containers destined for Afghanistan deliberated that scanning and tracking should not be a hurdle for traders.\nThe task force decided to make proposals for making scanning and tracking of the containers at border upto international standards keeping in view facilitation of the exporters and importers at Afghanistan border.  Mohammad Sadiq Khan, Pakistan’s Special Envoy to Afghanistan said that both Pakistan and Afghanistan could take benefit from mutual trade. He suggested to make scanning easy and comfortable for the traders especially the scanning of perishable items.\nThe task force meeting was chaired by MNA Muhammad Yaqoob Sheikh.\nSecond Task force of Pakistan Afghanistan Parliamentary Friendship Group on Customs related issues recommended giving one time waiver to containers on exponential demurrage charges owing to COVID-19 pandemic. The task force recommended that regional trade was imperative for the prosperity of the common man in both countries and suggested that special concession be given to exporters and importers at this time of emergency due to COVID-19 pandemic.\nThe task force also recommended to take provincial authorities and all government stakeholders on board immediately to resolve the issues of demurrage charges.\nThe participants appreciated the initiative of Speaker National Assembly Asad Qaiser who believed in parliamentary initiative to resolve the all issues faced by traders and businessmen especially in the trade with Afghanistan.",
  "retrievedAt": "2025-08-11T19:31:41.572Z"
}
