{
  "title": "Govt. facilitating construction of housing units for salaried, low income groups",
  "link": "https://www.app.com.pk/national/govt-facilitating-construction-of-housing-units-for-salaried-low-income-groups/",
  "date_published": "2022-01-25T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Prime Minister Imran Khan Tuesday said that the government was facilitating construction of affordable housing units for the salaried and low income groups through provision of subsidies and waver of interest rates on the house financing.\nThe prime minister appreciated the ministry of housing to complete the decade old stalled housing projects for the government employees, and stressed that the authorities should also ensure timely completion of further 88,000 housing units.\nThe prime minister was addressing the inauguration ceremony of the Pakistan Housing Authority (PHA) Officers Residencia, Kurri Road. The project was conceived in 2008 on 90 acres of land provided by the Capital Development Authority.\nThe total cost of the project was Rs6.5 billion, consisting of 588 grey structure housing units in the three categories. The project was launched for the federal government employees.\nA full-scale physical work initiated on the stalled project in 2018 in the light of prime minister’s vision of providing shelters to the citizens of Pakistan. The project also includes 88 commercial shops, 66 apartments, community center etc, having all the basic amenities.\nThe prime minister further observed that the construction served as an industry and driving force which could lift the country’s economy.\nWhen the construction industry thrived, about 30 more allied industries also moved on, he said, adding that during the last two years, the construction industry in Pakistan was booming with record cement and steel sales.\nThe prime minister said that completion of housing projects for the government servants was of significance as they had no capacity to purchase and own their houses.\nHe also commended the ministry for the completion of stalled projects in the short period of three years.\nThe prime minister said there was shortage of housing units in Pakistan. The people could own residences if they had cash, otherwise, in the past, there was no option for seeking bank loans for the construction of homes on easy installments due to pending foreclosure law before the courts. Moreover, the banks had no trained people to entertain the loan seekers.\nHe said the said law had been decided by the courts and now it smoothened the procedure for seeking bank credits.\nHe said for the first time in country’s history, housing projects worth Rs124 billion through bank loans had been approved and a loan of Rs40 billion had already been released by the banks.\nThe banking mortgage law would now enable the people to divert the rent of their rented houses to pay easy installments for the construction of their residences, he added.\nThe prime minister said contrary to mortgage financing in the US and Europe which stood around 80 per cent, in Pakistan, it was less than one per cent to the GDP.\nThe prime minister referring to the global price hike due to coronavirus pandemic said that the World Bank’s report had confirmed Pakistan growth rate at 5.37 per cent.\nHe said due to boom in the construction industry, about 40 to 60 per cent increase in the income of labour class was witnessed. An amount of Rs1400 billion was earned by the farmers in the last year due to record five bumper crops.\nThe World Bank report over the four indicators for the country showed that poverty had been reduced, he opined, adding that during coronavirus pandemic, they had not shut down the construction industry.\nCountry’s exports had surged whereas record remittances and tax collection was witnessed, he said.\nThe prime minister said that the future of the country had been set on the right direction as indicated by the Bloomberg, which acknowledged that Pakistan’s economy was put on the high trajectory.\nThe prime minister expressed the confidence that the economic situation of the country would improve further.\nHe also admitted that the price hike had hit the salaried class. It was his cherished dream to enable the low income groups and salaried class to get their houses on affordable prices.\nEarlier, the prime minister also inspected multi-storey apartments project at Sector I-16/3, which was initiated at the total cost of Rs8 billion.\nThe project includes 43 blocks with 1,584 apartments. It was conceived in 2011 spanning over 15.6 acres of land. The construction work at the project had been substantially completed.",
  "retrievedAt": "2025-08-11T14:11:01.278Z"
}
