{
  "title": "Pakistan’s CPI ranking dropped due to weak rule of law, state capture: Fawad",
  "link": "https://www.app.com.pk/national/pakistans-cpi-ranking-dropped-due-to-weak-rule-of-law-state-capture-fawad/",
  "date_published": "2022-01-25T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain on Tuesday said the country’s ranking on the Corruption Perception Index (CPI) of Transparency International was dropped due to weak implementation of law and ‘state capture’.\n“The concrete and specific report has not yet been published, only score was reported. The criteria of Transparency International for assessment is based on different issues pertaining to financial corruption, accountability, rule of law and state capture,” he said while addressing the media after the Federal Cabinet meeting.\nFawad said it was told that the score of Pakistan was not brought down due to financial corruption, but weak ‘rule of law’ and ‘state capture’ were the reasons. The report did not include any kind of financial corruption.\nCiting names of different institutions and non-governmental organizations that took part in preparing the report, he said only The Economist Intelligence Unit lowered Pakistan’s score while assessment of all others remained unchanged. The media, he added, should check with the head of Economist Intelligence Unit in Pakistan as to why the country’s ranking was dropped on the basis of rule of law.\n“I am not getting into controversy whether it is correct or not. Undoubtedly, there is a need to take steps for strengthening rule of law in Pakistan,” he said, adding Prime Minister Imran Khan had time and again stressed on establishing rule of law. There was an impression that there were two different laws for the rich and the poor, and “such impression severely hurts any kind of perception about the country”, he remarked.\nThe minister said all the institutions needed to work collectively for establishing the rule of law in letter and spirit. He reiterated his demand of allowing the cameras in the court for live broadcast of the cases of national importance. “I have made an appeal in the news conference the other day that the cases of Shehbaz Sharif and Asif Zardari should be telecast live so that the people can assess themselves whether the same are factually correct or not,” he added.\nThere was no problem in that regard as such steps would improve Pakistan’s perception at international level, he maintained.\nFawad said a comprehensive response would be given once Transparency International released its complete report.\nDivulging the details of cabinet meeting, he said it endorsed the Economic Coordination Committee (ECC) decision for utilizing Rs 5 billion to carry out fresh census in the current year.\nThe whole census process was likely to be completed by December, with the result of its pilot project finalized by April or May and  and then the Election Commission would be able to start working on new delimitation in January next year, he added.\nHe expressed the confidence that the general election 2023 would be held under fresh delimitation, as the process for holding the census was expedited for the purpose.\nThe minister said the cabinet was informed that despite increase in the cases of new coronavirus variant – Omicron, the hospitalization rate in the country had risen by only one and a half times. “There is no pressure on the health system.”\nThe government, he said, had decided not to close the businesses. “All activities will continue and with the help of Almighty we will be able to defeat the current wave as well.”\nHe said the workers going abroad for earning livelihood would be given subsidy in conducting corona tests and a summary in that regard would be presented in the ECC.\nThe minister said the entire world had appreciated Pakistan’s policy of smart lock-down and The Economist, an international weekly newspaper, had also praised the government’s policy on handling Covid-19 pandemic.\nBritish Prime Minister Boris Johnson, he said, also adopted the smart lock-down strategy on the pattern of Pakistan.\nSince the first corona virus wave, it was only Prime Minister Imran Khan who had focused on saving lives and livelihoods, and opted the smart lock-down strategy.\nHe stressed the need of vaccination of maximum number of people to fight the pandemic.\nFawad said the cabinet accorded approval to the draft comprehensive legal reforms, which would be presented to the Parliament. Under the reforms, it would be mandatory for the courts to dispose off criminal cases within nine months and in case of delay, presiding judges and prosecutors would be bound to give reasons to the chief justices of concerned high courts.\nThe police’s power of bail under suo moto would be strengthened, while a plea bargain clause had been suggested for the accused in criminal cases, he added.\nThe minister said under the new law, the station house officer would have to be a graduate and an officer of the rank of sub-inspector.\nHe said an independent prosecution service would be launched, forensic laboratories upgraded, and the latest equipment and devices introduced for investigation of cases.\nIt was proposed for the police to file a challan in the court within 45 days instead of 14, which often compromised the investigation process, he added.\nThe minister said that during the briefing by the Ministry of Planning and Development, the cabinet was informed that overall economic situation was stable. Exports had increased by 29%, with the textile sector having the largest share, while the import of petroleum products and palm oil was the main reason for increase in the import bill.\nFawad said 35 per cent increase in the machinery import was a positive development which showed that long term expansion in the textile sector was being done successfully.\nAbout the PSDP projects, he said, as compared to the last year, about 18 per cent more funds had been utilized so far during the current fiscal year.\nHe said the overseas Pakistanis had again proved their worth as evident from 11.3 per cent increase in their remittances.\nThe foreign exchange reserves were stable, while the rate of tax revenue had increased by 32.5%, Fawad added.\nThe cabinet, he said, approved the approval of additional charge of Chief Executive Officer at Diamer Basha Dam to Muhammad Yousuf for three months.\nIt endorsed the ECC’s decisions, including the removal of 45 percent regulatory duty on import of pine nuts from Afghanistan. The government abolished the duty to provide relief to the people of war-torn neighbour, he noted.\nHe said the government would pay $11.6 million compensation to the Chinese nationals, the victims of Dasu Hydropower Project terror attack.\nThe cabinet, the minister said, approved a list of some items exported by Afghanistan to trade in rupees.\nHe said it gave its consent for formulation of a special advisory committee regarding the matters related to 5G licenses.\nThe cabinet also endorsed the decision of the Cabinet Committee on Disposal of Legislative Cases. It included the Elections (Second Amendment) Bill 2021, aimed at preventing corrupt practices in Senate elections.\nThe minister said the cabinet also approved composition of PBS Governing Council, and Hajj and Umrah Act.\nHe said Faisal Sherjan was appointed as Executive Director of Pakistan Electronic Media Regulatory Authority.\nThe cabinet was given a briefing on awarding bonuses to federal ministries and divisions for showing good performance to improve the affairs of government, the minister added.\nTo a query about the PDM’s latest huddle, Fawad said the multi-party opposition alliance of Pakistan Democratic Movement (PDM) posed no threat to the government, citing a famous Urdu couplet:\n‘Na Khanjar Uthay Ga, Na Talwaar Unn Sey\nYeh Bazu Mere Azmaye Hue Hain”",
  "retrievedAt": "2025-08-11T14:10:59.643Z"
}
