{
  "title": "Railway accidents decline drastically during 2021-22 first half: PR",
  "link": "https://www.app.com.pk/national/railway-accidents-decline-drastically-during-2021-22-first-half-pr/",
  "date_published": "2022-01-25T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Pakistan Railways has beefed up precautionary measures that helped in drastically reducing accidents from 145 in 2020 to 53 in the first half of year 2021-2022 due to the efforts being undertaken to reduce trespassing at un-manned level crossings and un-authorized locations.\nThe safety of train operations as per the performance agreement signed with the prime minister by the Federal Minister for Railways, Railways has shown considerable progress owing to safety of trains, an official told APP.\nThe present government was taking several steps to improve the Railway services including the issues related to track maintenance that were given top priority, the official added.\nIn this regard, the official said that 40 un-manned level crossings were upgraded and manned and 1,561 un-authorized locations (trespassing sides) were closed.\nHe said the punctuality of trains was improved and all the trains were being monitored, reviewed and rectified. To facilitate passengers, a mobile application “Pak rail live” has also been launched for real time tracking of trains.\nThe official said due to close monitoring of trains at Divisional Headquarters and Ministry level, the punctuality of trains has improved from 63 percent in financial year 2019-20 to 80 percent in financial year 2020-21.\nTo a question, he said that first aid posts are established in Assistant Station Masters offices and Police Help Line Centres at all Railway Stations where para-medical staff/staff trained in first aid is available along with first aid box/emergency kits round the clock.\nHe said the first aid box/emergency kits were available with In-charge Guards in all running trains who were trained in first aid and provide first aid to ill passengers.\nThe official said that in case of serious illness In-charge Guard call the doctors at next coming station for providing further medical care.\nDue to consistent efforts by the present government, the freight sector had also shown considerable improvement and an average of 25,054 tons per day had been transported from Karachi during 2020-21 as compared to 23,051 tons per day during 2019-20, he added.\nHe said the competitive freight rates to attract more traffic have been introduced and high capacity/ high speed hopper trucks have been inducted in the current fleet for swift movement/unloading of coal.\nThe official said that outsourcing of freight trains has also been initiated under Pakistan Railways Freight Transportation Company (PRFTC) to earn more revenue for the department.",
  "retrievedAt": "2025-08-11T14:11:04.062Z"
}
