{
  "title": "Govt under ‘Ehsaas umbrella’ bringing poor into mainstream, computerized all projects: Sania Nishtar",
  "link": "https://www.app.com.pk/national/govt-under-ehsaas-umbrella-bringing-poor-into-mainstream-computerized-all-projects-sania-nishtar/",
  "date_published": "2022-01-25T08:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection Dr Sania Nishtar Tuesday said that the government under ‘flagship Ehsaas umbrella program’ was bringing deprived segments of society into mainstream of development and computerized all projects to ensure transparency.\nIn an exclusive interview with PTV news channel, the SAPM said that multifaceted Ehsaas programmes are aligned with the manifesto of Pakistan Tehreek-e-Insaf (PTI) government to fulfill the basic needs of the deserving people and to give students financial access to education.\nShe said such historic steps were real services of masses, adding, all the projects under Ehsaas are corruption free.\nSania further explained that the government had recently launched the ‘Ehsaas Taleemi Wazaif’ mobile application to easily register their eligible children for different scholarship programs under the Ehsaas Taleemi Wazaif. Using Taleemi Wazaif app of Ehsaas, families can easily enroll their children without visiting any office, she added.\nThis landmark step will also help poorest families in saving their time and costs,” SAPM mentioned.\nUnder the Ehsaas Taleemi Wazaif, male primary students will receive a quarterly stipend of Rs. 1,500 females will receive Rs. 2,000. Male secondary students will get Rs. 2,500 and females will get Rs 3,000. Male higher secondary students will receive Rs. 3,500 and females will receive Rs. 4,000, she added.\nShe said female students to get double scholarship amount as compared to male, adding, Ehsaas Taleem wazaif program was being expended all over the country to enrolled more students and encourage them to get education.\nSania also laid emphasis on educating women to enable them to advance in society and grow economically. She said an educated mother can resolve half of problems in society, however, equal education opportunities under Ehsaas Taleem wazaif program is our topmost priority.\nWhile explaining another project of Ehsaas Rashan, the SAPM said that more than one million and fourty thousand eligible persons have been registered successfully with Ehsaas Rashan Program.\nThe low-income families and Karyana merchant’s registration has started on Ehsaas Ration Discount Portal, she said, adding, on daily basis three to four review meetings were being conducted to speed up this program.\nSania Nishtar added that for ‘Ehsaas Kafalat program’ at every district level ‘Registration Ehsaas desk’ was being established all over the country to facilitate people who were missed in previous survey, people can directly contact to Ehsaas desk centers near to their doorsteps and can registered themselves.\nEhsaas Tahafuz is Pakistan’s another powerful safety program and is centered on protecting the deserving patients from catastrophic health expenditures, adding, we are expanding the scope of this program in next 16 hospitals where almost 90 percent of work completed.\nEhsaas Tahafuz is being implemented in collaboration with the Holy Family Hospital to identify patients facing catastrophic health expenditures, who are not covered by Sehat Sahulat Card or are in hospital not registered with Sehat Sahulat programme; they are evaluated by the system, and if eligible, are provided funding by allocating donations to the patient, she added.",
  "retrievedAt": "2025-08-11T14:11:05.185Z"
}
