{
  "title": "NA climate body takes serious notice of illegal housing societies in Capital",
  "link": "https://www.app.com.pk/national/na-climate-body-takes-serious-notice-of-illegal-housing-societies-in-capital/",
  "date_published": "2023-03-29T14:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): The National Assembly Standing Committee on Climate Change on Wednesday took serious notice and expressed its concerns over illegal housing societies causing serious damage to the environment of the federal capital.\nThe 33rd meeting of the Standing Committee on Climate Change was chaired by MNA Nuzhat Pathan.\nThe Committee directed that in order to protect the environment, the Ministry of Climate Change should adopt more crystal clear criteria for giving approval to these housing societies.\nThe Chairman Capital Development Authority (CDA) briefed the Committee about the illegal societies, water sewerage and outsourcing of waste management.\nThe Committee appreciated the efforts of Chairman CDA for taking measures on this very sensitive issue and demand for expediting the efforts in a more disciplined manner. The Committee also recommended installing water consumption meters to save water resources.\nThe Directors of National Institute of Health (NIH) and Pakistan Institute of Medical Science (PIMS) apprised the Committee about the efforts they are making for the allergy patients suffering due to mulberry trees.\nThe Committee directed to Ministry of Climate Change to take steps for eradicating these trees causing serious respiratory ailments and pollen allergy.\nThe Committee took serious notice and expressed its displeasure on IG Islamabad for not attending the meeting in person and directed that in the next meeting of the Committee, he must ensure his presence and brief the Committee on the follow-up of the issue of the attack on DG EPA in Savour Foods in 2019.\nThe Secretary Climate Change apprised the NA Committee about bringing new regulations to ban not only plastic bags but also disposable plastic.",
  "retrievedAt": "2025-08-11T08:09:14.161Z"
}
