{
  "title": "829,549 emigrants registered for overseas employment in 2022: NA told",
  "link": "https://www.app.com.pk/national/829549-emigrants-registered-for-overseas-employment-in-2022-na-told/",
  "date_published": "2023-03-29T09:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP):Parliamentary Secretary for Overseas Pakistani and Human Resource Development Syed Agha Rafiullah on Wednesday informed the National Assembly that as many as 829,549 emigrants were registered for overseas employment through the Bureau of Immigration and Overseas Employment (BE&OE) during the calendar year 2022, the highest since last five years.\nIn response to various questions, he said that since 1971 12.45 million Pakistani workers had been registered with BE&OE for employment abroad till 2022. However, a declining trend was observed in the years 2020 & 2021 as only 224,705 and 286,648 emigrants were registered by BE&OE respectively due to Covid-19 restrictions, he said.\nHe said that BE&OE has taken several measures to explore and tap the international job markets for intending emigrants.Diversification Strategy adopted to shift focus to new labour markets and the declaration of Intent on Migration & Mobility has already been signed with Greece and the UK and soon would be signed with Germany.\nThe Parliamentary Secretary said 12 memoranda of understanding (MoUs) on manpower export with different countries including Belgium, Denmark, Germany, Greece, Iran, Italy, Kuwait, Lebanon, Libya, Portugal, Romania and Uzbekistan were under bilateral discussion. The overseas minister visited Romania and Portugal to explore new regular labour migration avenues, he said.\nRafiullah said the government had appointed 24 Community Welfare Attaches in 16 different countries to explore new avenues for Pakistani manpower through Labour Market Analysis (LMA) of the host country so that skilled Pakistani intending emigrants could be imparted required training as per labour market requirements of the host country.\nHe said approximately 9 million Pakistanis were working/residing in different countries around the world and contributing towards the socio-economic development of the country.\nHowever, the Parliamentary Secretary said that there was no dedicated mechanism for providing solutions to the protection of their properties. In order to address the issue, the Ministry/OPF undertook the initiative of proposing a bill that would address their grievances and provide protection to overseas Pakistanis with regard to their properties.\nTo another question, he said all the regular employees of OPF schools and colleges were getting minimum remuneration as prescribed by the government. Furthermore, contract employees were being paid a salary as per the terms and conditions of contractual employment rules/polices and as per advertisements published in newspapers at the time of hiring, he said.\nHowever, he said, the remuneration of some contract employees was still less than the minimum wages as declared by the Federal government. Furthermore, up to a 10% annual increment was also granted to the contractual employees upon renewal of their annual contracts, he said.",
  "retrievedAt": "2025-08-11T08:09:25.398Z"
}
