{
  "title": "Judge threatening case: Court issues non-bailable arrest warrants against Imran",
  "link": "https://www.app.com.pk/national/judge-threatening-case-court-issues-non-bailable-arrest-warrants-against-imran/",
  "date_published": "2023-03-29T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): A lower court on Wednesday issued non-bailable arrest warrants against Pakistan Tehreek-e-Insaf Chairman Imran Khan in a woman judge-threatening case.\nThe court instructed the police to produce the accused before it on April 18, after arresting him.\nCivil judge Malik Aman issued the non-bailable arrest warrants against the former prime minister on his non-appearance. During the hearing, Imran’s lawyer prayed the court to maintain the bailable arrest warrants against his client as there were threats to his life. He said that a case regarding the withdrawal of his security was pending with the high court.\nSpecial Prosecutor Rizwan Abbasi opposed the exemption from appearance requested by Imran Khan and prayed the court to issue his non-bailable arrest warrants due to non-appearance. “We are fed up by hearing the excuse of Wazirabad incident,” he said.\nThe special prosecutor said that there were also no signatures of Imran Khan on the application for exemption from attendance. The defence didn’t tell the solid reasons for the PTI chief non-appearance, he said.\nEarlier, the court reserved its judgment and later converted his bailable arrest warrants into non-bailable ones while dismissing his exemption request.\nIn a four-page written order, the court said that the accused was summoned first time on October 1, 2022. The court had accepted four exemption applications of the accused but he never appeared before the court, it said.\nThe order said that the conduct of the PTI chairman showed that he didn’t want to face the trial in this case. It said that a non-application was filed by the defence counsel to cancel the arrest warrants. Imran Khan should be produced in a personal capacity on the next hearing, it added.",
  "retrievedAt": "2025-08-11T08:09:12.634Z"
}
