{
  "title": "Saudi-Iran relations to usher in new era of peace, prosperity in region: Dr. Qibla",
  "link": "https://www.app.com.pk/national/saudi-iran-relations-to-usher-in-new-era-of-peace-prosperity-in-region-dr-qibla/",
  "date_published": "2023-03-29T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): Chairman Council of Islamic Ideology (CII) Dr. Qibla Ayaz on Wednesday said that the recent diplomatic development in Saudi Arabia and Iran relations would usher in a new era of peace and prosperity in the region.\nIn an exclusive talk with APP, he said it was a good omen that both the brotherly countries had resumed their diplomatic relations and agreed to reopen their embassies after a seven-year of estrangement.\nDr. Qibla appreciated the unwavering efforts of Chinese President Xi Jinping’s in bridging the gap and building an enabling environment for brokering a rapprochement deal between Riyadh and Tehran.\nHe said that this positive move was warmly welcomed by the entire Muslim Ummah at every nook and cranny of the world including Pakistan as it would help unite and strengthen Muslim countries and, resolve issues of common interests with mutual understanding in near future.\nHe said that the fraternal ties between the Kingdom of Saudi Arabia and Iran would also help normalize the circumstances in Yemen and at the later stage in Syria.\n“Both the brotherly countries were in dire need of ceasing the hostilities and healing the wounds,” he said expressing the hope that the recent diplomatic development in Saudi-Iran relations would have positive impact on Pakistan as well and Pakistani break-up of the society along with ethnic lines would definitely become better.\nDr. Qibla said it would also help Iran to improve its economic situation and decrease the negative impact of sanctions with the passage of time.\nLauding the visionary leadership of Saudi Crown Prince Muhammad bin Salman in the regional and global politics, he said His Highness had special doctrine for the future because the world was no longer to be dependent on oil that was why; the Kingdom was opting for new alternative resources for generating the revenue.\nHe further hoped that the betterment in Saudi-Iran relationship would create a new space particularly, for the Kingdom of Saudi Arabia in the world politics.",
  "retrievedAt": "2025-08-11T08:09:17.585Z"
}
