{
  "title": "Incumbent govt restored departmental appointment quota of players: NA told",
  "link": "https://www.app.com.pk/national/incumbent-govt-restored-departmental-appointment-quota-of-players-na-told/",
  "date_published": "2023-03-29T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): Minister of State for Law and Justice Shahadat Awan on Wednesday informed the National Assembly that the incumbent government under the leadership of Prime Minister Shehbaz Sharif has restored the departmental appointment quota of players on October 27, 2022.\nIn response to various supplementary questions during Question Hour, the minister said that the government was committed to restoring the glory of national game hockey in the country. The government was providing funds for the promotion and revival of the national game of hockey, he added.\nHe said in past the department appointment quota was abolished but now it has been restored to support national players.\nThe minister said there was no denying the fact that hockey in Pakistan has shown a downtrodden fall. The decline has not happened overnight, but it has spanned over the last three decades, he said.\nAs far as the government’s responsibility to steer the affairs of Pakistan hockey was concerned, the government has taken various steps including the provision of infrastructure, financial assistance, training facilities/camps, and facilitation in getting NOC and other arrangements for international events.\nSome over 25 synthetic hockey turfs were operational across the country and over 10 projects of laying the new turfs were underway, he said.\nHe said the government has provided an amount of Rs. 443 million during the last 10 years to the Pakistan Hockey Federation. Moreover, the Federation has also received an amount of Rs. 395 million from Sindh Government. Rs. 50 million from the Army Chief as a grant during the last 5-years, he said.\nHe said apart from the said steps, a hefty amount has been incurred on the training camps and participation of the Hockey team in mega/international events. Services of the foreign coach were also provided to the national hockey team on a huge salary of $ 8,000/- per month, he said.",
  "retrievedAt": "2025-08-11T08:09:25.318Z"
}
