{
  "title": "NA approves Lawyers Welfare & Protection Bill 2023",
  "link": "https://www.app.com.pk/national/na-approves-lawyers-welfare-protection-bill-2023/",
  "date_published": "2023-03-29T11:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): The National Assembly on Wednesday approved the Lawyers Welfare and Protection Bill 2023 with consensus. The bill was tabled by Federal Minister for Law and Justice Azam Nazeer Tarar.\nThe federal minister presented the legislation that stated that the profession of lawyers plays a pivotal role in the administration of justice, the defense of human rights, democracy, and the rule of law.\nHowever, the recent incidents of assault, criminal force, intimidation, and threats caused to advocates, while they discharge their professional duties, have reached alarming heights, it said.\n“This has also resulted in law and order situations and deficiencies in rendering professional services by advocates to their clients apart from causing a deep sense of fear in the minds of advocates,” the Bills said.\nThe Bill intended that in order to protect advocates from the said assaults, criminal force, intimidation and threats, it is necessary to enact legislation to protect advocates while discharging their professional duties.\nIn this regard, the Bill titled “The Lawyers Welfare and Protection Bill, 2023” was prepared wherein, a mechanism has been devised to ensure that the advocates can render professional services without fear or external influence for the ultimate cause of the administration of justice and the rule of law.\nMoreover, the law was also in consonance with the various UN General Assembly Resolutions and in line with the Eighth United Nations Congress held in September, 199O at Havana, Cuba, where it adopted the “Basic Principles on the Role of Lawyers” which provides that the Governments shall ensure that layers are able to perform all of their professional functions without intimidation, hindrance, harassment or improper interference and where the security of lawyers is threatened as a result of discharging their functions, they shall be adequately safeguarded by the authorities.\nThe Bill was designed to achieve the aforesaid objectives, it said.",
  "retrievedAt": "2025-08-11T08:09:17.148Z"
}
