{
  "title": "BISP disburses over Rs. 23 billion among flood hit families in shortest time",
  "link": "https://www.app.com.pk/national/bisp-disburses-over-rs-23-billion-among-flood-hit-families-in-shortest-time/",
  "date_published": "2022-09-11T11:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Benazir Income Support Programme (BISP) has so far disbursed over Rs. 23 billion among the flood-hit families in a short span of time under the Flood Relief Cash Assistance, to mitigate the sufferings of flood affected population.\nEmerged as the most effective and reliable social protection intervention during the recent floods devastation, the BISP is executing the challenging task of disbursing cash relief of Rs. 25,000 per family to the flood affected families in devastated areas.\nThe task of disbursing Flood Relief Cash Assistance among the flood-hit people was assigned to the BISP by the Prime Minister, Shehbaz Sharif which is being carrying out speedily.\nUnder the leadership of Federal Minister of Poverty Alleviation and Social Safety and Chairperson BISP, Shazia Marri, BISP rolled out its operations in the flood affected areas within no time and presently the flood relief activities are operational in 69 districts by establishing more than 400 payment sites.\nSince August 19 till September 11 (Sunday) 3:00 pm, BISP has disbursed a total amount of Rs. 23,063,125,000 has been disbursed among 922,525 affected families under this programme.\nA total of 112,301 affected families have received Rs.2,807,525,000 in Balochistan; 548,979 families have received Rs.13,724,475,000 in Sindh; 114,029 families have received Rs. 2,850,725,000 in Khyber Pakhtunkhwa and 147,216 families have received Rs.3,680,400,000 in Punjab.\nAzra Bibi from Qambary, Swabi said, “My husband is a factory worker. I have seven children, four sons and three daughters. My house is made of mud so rain is a big problem and whenever it rains, water gets inside our house. Now my house has been destroyed due to the rains”\n“I got a message from BISP to come and collect flood relief money from their center. I borrowed some money for commute and reach BISP Center where they checked my CNIC and got my biometric. After all the clearance, they gave me the flood relief money of Rs. 25,000. With this money, we will fulfill our basic needs as we don’t have the groceries at home. I thank Benazir programme with all my heart; May Bless her”, she said.\nRazzaq Mehmood, Deputy Director BISP who is supervising the cash disbursement process at Flood Relief Camp set up in Government Boys School, Taunsa Sharif said the camp has been established on the directions of Chairperson BISP, Shazia Marri to disburse Rs. 25,000 among the flood affected families.\nHe said that the payment process is going on smoothly and the staff is vigilantly extending all possible support and guidance to the visitors.\nIrfana, mother of two children visited the same camp for receiving her payment said, “My husband is a piece rate worker. The recent flood has completely destroyed our house and we have nothing to survive”.\nShe thanked the government and BISP for providing cash assistance of Rs.25, 000 through which she intends to buy ration to feed her family.\nAmina Bibi from Sukkur, said, “My house is made of mud and has been destroyed due to the floods like other houses in surroundings. My husband is suffering from illness. I thank BISP for providing Rs. 25,000 much-needed cash relief which I would spend on buying medicine of my husband and ration”.\nAll the payment centers are kept open on holidays for the disbursement of payment to the affectees. The administration of BISP has directed the concerned staff present at the campsites to fully cooperate and facilitate the people in their respective regions.\nThe affected families can send their CNIC number to 8171 for registration in Flood Relief Cash Assistance program and upon receiving payment message they can visit their nearby campsite to receive their payment. A control Room has also been established at BISP headquarters to ensure smooth payments.\nIt is also worth mentioning that the federal minister, Shazia Marri has announced that the flood affected pregnant mothers and children will be covered under the Benazir Nashonuma Programme in collaboration with World Food Programme (WFP).\nFor this purpose, an additional amount of one billion rupees has been allocated for the flood affected mothers and children apart from the existing beneficiaries.\nPrime Minister Shehbaz Sharif has also announced to increase the flood relief assistance under BISP from the existing Rs. 28 billion to Rs. 70 billion in view of gross damages of lives, infrastructure and crops in the wake of flash floods.",
  "retrievedAt": "2025-08-11T15:33:24.977Z"
}
