{
  "title": "Water level in rivers, reservoirs constantly rising as seasonal routine",
  "link": "https://www.app.com.pk/national/water-level-in-rivers-reservoirs-constantly-rising-as-seasonal-routine/",
  "date_published": "2022-09-11T09:54:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK ) Sep 11 (APP): As a result of torrential rains, besides melting of glaciers at various upper reaches, the water level in the country ‘s major rivers and reservoirs was constantly rising as seasonal routine. Resultantly, the position of the river inflows and outflows at AJK~ based Mangla dam, Tarbela dam as well as Chashma barage along with the reservoirs levels and the barrages was reported on Sunday as under, official sources told APP here on Sunday :~\nRivers: Indus at Tarbela: Inflows 165400 cusecs and Outflows 164600 cusecs, Kabul at Nowshera: Inflows 40700 cusecs and Outflows 40700 cusecs, Khairabad Bridge: Inflows 190300 cusecs and Outflows 190300 cusecs, Jhelum at Mangla: Inflows 27100 cusecs and Outflows 15000 cusecs, Chenab at Marala: Inflows 63400 cusecs and Outflows 32900 cusecs.\nBarrages: Jinnah; Inflows 165000 cusecs and Outflows 157000 cusecs, Chashma’ Inflows: 197300 cusecs and Outflows 179100 cusecs, Taunsa; Inflows 181300 cusecs and Outflows 164300 cusecs, Guddu; Inflows 163000 cusecs and Outflows 156100 cusecs Sukkur; Inflows 177700 cusecs and Outflows 176100 cusecs Kotri; Inflows 626200 cusecs and Outflows 600000 cusecs Trimmu: Inflows 23400 cusecs and Outflow 8100 cusecs Panjnad; Inflows 23300 cusecs and Outflows 9300 cusecs.\nReservoirs (Level and Storage): Tarbela: Minimum operating level 1398 feet, present level 1550.00 feet, maximum conservation level 1550 feet, live storage today 5.827 million acre feet (MAF).\nMangla; Minimum operating level 1050 feet, present level 1191.80 feet, maximum conservation level 1242 feet, live storage today 3.836 MAF. Chashma; Minimum operating level 638.15 feet, present level 648.60 feet, maximum conservation level 649 feet, live storage today 0.258 MAF.\nThe inflows and outflows of River Indus at Tarbela, Jinnah and Chashma, River Kabul at Nowshera and River Jhelum at Mangla have been reflected as mean flows of 24 hours, whereas the other flows have been gauged at 6.00 a.m on Sunday. Ends/app/ahr",
  "retrievedAt": "2025-08-11T15:33:27.224Z"
}
