{
  "title": "U.S State Department Counselor, senior U.S govt officials visit Pakistan to demonstrate support",
  "link": "https://www.app.com.pk/national/u-s-state-department-counselor-senior-u-s-govt-officials-visit-pakistan-to-demonstrate-support/",
  "date_published": "2022-09-11T11:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Counselor of the U.S Department of State, Derek Chollet and a delegation of senior U.S government officials from the Department of State, Department of Defense, U.S Agency for International Development and the White House National Security Council visited Islamabad and Karachi Sept 7-9 to meet with senior government officials,  civil society members and private sector leaders to commemorate 75 years of diplomatic relations between the United States and Pakistan, highlight the importance of bilateral partnership, and reaffirm shared goals.\nWhile in Pakistan, Counselor Chollet discussed a wide range of issues, including strengthening trade and investment ties, cooperating to mitigate the impacts of the climate crisis, advancing the bilateral health partnership, expanding our people-to-people connections, and conveying U.S. solidarity with the Pakistani people in addressing the humanitarian crisis caused by destructive flooding throughout the country. Counselor Chollet serves as a senior policy advisor to U.S. Secretary of State Anthony Blinken, said a press release issued by the U.S. Embassy in Islamabad on Sunday.\n“This has been a very productive visit to Pakistan, and I’m honored to help commemorate the 75th anniversary of U.S.-Pakistan bilateral relations,” said Counselor Chollet. “The United States and Pakistan have a robust partnership based on decades of bilateral cooperation and support. We look forward to strengthening our relationship in trade, investment, clean energy, health, security, education, and other shared priorities.”\nDuring his meetings, Counselor Chollet offered condolences on behalf of the United States on the devastation caused by widespread flooding in Pakistan and emphasized U.S. sympathy and support for people who have lost loved ones, livelihoods, and homes.\nIn his meeting with Foreign Minister Bhutto-Zardari, Counselor Chollet discussed the $53.1 million dollars in humanitarian assistance provided by the United States this year to support disaster resilience and flood response, with $50.1 million for emergency flood relief in addition to $3 million in programming provided earlier to bolster disaster resilience.\nThis funding from the United States will provide Pakistani communities with urgent humanitarian supplies for those most affected, while also building resilience against future natural disasters and helping to mitigate the impacts of the climate crisis.\nIn Islamabad, Counselor Chollet met with Prime Minister Shehbaz Sharif to discuss strengthening the U.S.-Pakistan bilateral relationship, including increased cooperation on trade and investment, climate, and health. The Counselor highlighted the strong bilateral health partnership between the United States and Pakistan, particularly the U.S. commitment to donate more than 77 million COVID-19 vaccine doses to Pakistan.\nIn a meeting with Minister of Finance Ismail, Counselor Chollet discussed the importance of entrepreneurship and Pakistan’s economic potential, emphasizing the promise offered by Pakistan’s youth. At a roundtable with civil society representatives, the Counselor heard about their activism in upholding democracy, defending marginalized populations, and empowering women.\nMeeting with Army Chief General Bajwa, Counselor Chollet discussed opportunities for the United States to support Pakistan’s flood response and U.S.-Pakistan security cooperation. As an example of that cooperation, the Counselor informed Pakistani leadership that the Department of State had formally notified Congress of a $450 million Foreign Military Sales case for sustaining Pakistan’s F-16 fleet.\nThe investment would retain interoperability with U.S. and partner forces in ongoing counter terrorism efforts and in preparation for future contingency operations and signifies enduring U.S.-Pakistani partnership.\nWhile in Karachi, Counselor Chollet met with the Chief Minister of Sindh to discuss opportunities to expand U.S.-Pakistan commercial partnerships and other shared priorities. They also discussed current conditions in Sindh province, including the extensive damage caused by ongoing flooding and how U.S. and assistance is reaching the people in need.\nThe Counselor also visited the Jamia Islamia Clifton madrasa in Karachi, which is operating a distribution center for humanitarian relief. He was joined by the Karachi Administrator and a diverse group of local religious leaders with whom he discussed how assistance packages will directly aid the people of the province and the need for unity in this difficult time.\nThe Counselor later met with a group of NGOs and individual volunteers to gauge firsthand the enormity of the crisis and learn about ongoing relief efforts. One of these NGOs was co-founded by a U.S. exchange alumnus, who is working with partners to administer several IDP camps in and around Karachi.\nThe United States is proud of the leadership skills and compassion displayed by these and countless other USG exchange alumni in Pakistan who have been working to help their communities and country throughout this natural disaster.\nTo promote U.S.-Pakistan trade and commercial linkages and international maritime sector cooperation, the Counselor met with the General Manager of Karachi Port Trust Rear Admiral Zubair Shafique and toured Karachi Port.\nCounselor Chollet emphasized the depth of our existing commercial ties, noting that our bilateral trade reached nearly $9 billion in 2021, and that the United States is Pakistan’s largest single export market and one of its largest sources of foreign investment, with U.S. direct investment growing by 50 percent in the past year.\nIn his engagements with Karachi women entrepreneurs and business leaders, he underscored that the United States remains committed to bolstering our economic partnership, increasing bilateral trade, and promoting additional U.S. business and investment in Pakistan through a wide range of cutting-edge services, partnerships, and programs.\nThe U.S. government is dedicated to expanding the full range of trade, security, education, people-to-people, and clean energy and health-related cooperation and ties between the Pakistani and American people to promote a more stable, secure, and prosperous future for both our nations, he added.",
  "retrievedAt": "2025-08-11T15:33:26.433Z"
}
