{
  "title": "Railways incur Rs 90m losses per day due to floods",
  "link": "https://www.app.com.pk/national/railways-incur-rs-90m-losses-per-day-due-to-floods/",
  "date_published": "2022-09-11T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 11 (APP): Pakistan Railways had been suffering losses of around Rs 90 million per day due to unexpected monsoon rains and flash floods across the country.\n“The relentless monsoon rains and floods have not only destroyed the many railway tracks, but also damaged the bridges which disconnected Sindh and Balochistan with other parts of the country,” officials in the Ministry of Railways told APP on Sunday.\nThey said during the last month, Quetta was disconnected from the rest of the country after bridge collapse at Mach Station, which had resulted in the cancellation of seven important trains between Karachi and Quetta.\nPakistan Railways had also announced suspension of operations of five express major trains on the Main Line-I (ML-I) a few days ago until the rehabilitation of railway tracks, they said.\nThey said the main line of Pakistan Railways was under the flood-water between Tando Masti Khan-Gambat and Mehrabpur-Lakhro sections. Similarly, the track was sub merged at various spots in Balochistan. The sources said that furthermore, Pakistan Railways had already asked the passengers who want their tickets refunded can contact the respective reservation offices.\nThey said that the flood water would drain in the next 7 to 10 days, which would allow for the rehabilitation and eventual resumption of operations while the freight van operations have been resumed on a few tracks at a slow pace of 10-20 kilometers per hour.\nOn the other hand, they said Pakistan Railways and district administrations of Sindh, Balochistan had utilized all available resources to restore the rail service in flood affected areas across the country. “On the direction of Minister for Railways Khawaja Saad Rafique, the department is putting maximum efforts for rehabilitation of railway track in Sindh, Balochistan and other affected parts of the country shortly,” they said.\nThey said Pakistan Railways also directed to complete the ongoing survey of the affected installations on a war footing and speed up the rehabilitation process.\n“The technical and non-technical staff of the department was working in three shifts to restore the tracks once the flood water recedes,” the sources added.",
  "retrievedAt": "2025-08-11T15:33:26.469Z"
}
