{
  "article_id": "2025-01-26_948e138ea8bcd148b1162a5c08851f0a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/engro-fertilizers-establishes-markaz-centres-to-provide-quality-fertilizers/",
    "retrieved_at": "2025-08-27T12:02:54.532Z"
  },
  "metadata": {
    "title": "Engro fertilizers establishes Markaz Centres to provide quality fertilizers",
    "author": null,
    "date_published": "2025-01-26T10:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 26 (APP):To support the Government's efforts in ensuring the availability of high-quality fertilizers at official prices, Engro Fertilizers has inaugurated a Markaz Centre in Muridke. With this addition, the Company now operates four Markaz Centres in Muridke, Bahawalpur, Sargodha, and Sahiwal, benefiting farmers across these regions said a news release. Rana Tanveer Hussain, Federal Minister for Industries & Production, and National Food Security & Research, launch event of the Markaz Centre as the chief guest. The event was also attended by National Food Security & Research officials, provincial administrators, senior members of the farming community and Engro Fertilizers officials. Addressing the gathering, Federal Minister Rana Tanveer Hussain reiterated the Government's commitment to the growth of Pakistan's agriculture sector and improving the livelihoods of farmers. He said that the Government and fertilizer industry are working together to ensure uninterrupted availability of fertilizers at controlled prices for the farmers. He appreciated Engro Fertilizers for supporting the Government's initiative of setting up Markaz Centres in various districts to help curb hoarding and price manipulation by intermediaries. Speaking at the occasion, Ali Rathore, CEO of Engro Fertilizers, lauded the Government's focus on development of the agriculture sector and well-being of farmers. \"To benefit our hardworking farmers and enhance the food security of Pakistan, Engro Fertilizers has always partnered with the Government for initiatives that uplift the agriculture sector. These Markaz Centres will offer relief to the farmers by ensuring timely availability of high-quality fertilizers at official prices. Additionally, these Markaz Centres will serve as hubs for creating awareness about innovative products and technologies being offered by Engro Fertilizers that can help improve our crop yields and bring them in line with global benchmarks,\" he said. He further highlighted the recent launch of the UgAi app by Engro Fertilizers, Pakistan's first integrated agri e-commerce platform. Besides enabling direct purchase of fertilizers at official prices from the Company, the UgAi app also integrates advanced drone technology and satellite imagery. These features allow farmers to monitor crops with precision, reduce input costs, and increase crop yields.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}