{
  "title": "Musk’s xAI sues Apple, OpenAI alleging antitrust violations - World - DAWN.COM",
  "author": null,
  "content": "Elon Musk’s companies xAI and X filed a sweeping US antitrust lawsuit on Monday against Apple and OpenAI, alleging the tech giants formed an illegal partnership to stifle competition in artificial intelligence and smartphone markets.\n\nThe 61-page complaint, filed in federal court in Texas, accuses Apple and OpenAI of entering an exclusive deal that makes OpenAI’s ChatGPT the only generative AI chatbot integrated into Apple’s iPhone operating system, while blocking rivals like xAI’s Grok.\n\n“This is a tale of two monopolists joining forces to ensure their continued dominance in a world rapidly driven by the most powerful technology humanity has ever created: artificial intelligence,” the lawsuit states.\n\nThe plaintiffs claim Apple holds 65 per cent of the US smartphone market, while OpenAI controls at least 80pc of the generative AI chatbot market through ChatGPT.\n\nApple and OpenAI announced their partnership in June 2024, making ChatGPT the exclusive AI assistant accessible through Apple’s Siri voice assistant and other iPhone features.\n\nThe lawsuit alleges this arrangement gives ChatGPT exclusive access to “billions of user prompts” from hundreds of millions of iPhone users. The complaint also accuses Apple of manipulating App Store rankings to favour ChatGPT while delaying approval of updates to the Grok app.\n\nMusk’s companies are seeking billions in damages and a permanent injunction to stop the alleged anticompetitive practices. They have demanded a jury trial.\n\nNeither Apple nor OpenAI immediately responded to requests for comment.\n\nThe lawsuit follows threats Musk made earlier this month that triggered a fiery exchange with OpenAI CEO Sam Altman.\n\nAltman called Musk’s accusation of ranking manipulation “remarkable,” charging that Musk himself “manipulates X to benefit himself and his own companies and harm his competitors and people he doesn’t like.”\n\nMusk called Altman a “liar” in the heated exchange.\n\nBoth men were original founders of OpenAI before Musk’s departure in 2018 and now have a highly conflictual relationship. Musk founded xAI in 2023 to compete with OpenAI and other major AI players.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/252105354e97a2b.webp",
  "retrievedAt": "2025-08-26T11:19:30.876Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937160/musks-xai-sues-apple-openai-alleging-antitrust-violations",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T16:12:52.000Z"
}
