{
  "title": "Crop data to be augmented using satellite technology - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: In an effort to settle disputes over crop data, especially in Punjab, a new programme aims to use satellite technology to obtain accurate crop cultivation figures.\n\nUnreliable figures on total acreage and production of a specific crop have remained a persistent issue for the country.\n\nThe lack of accurate information makes it difficult for stakeholders, including government departments, to frame import and export strategies to meet national needs.\n\nThe new satellite-based system, set to be launched next year, is expected to resolve this long-standing problem.\n\nInitiative may help streamline discrepancies between data released by crop reporting body and cotton ginners\n\nThis initiative, a brainchild of the Special Investment Faci­li­tation Council (SIFC), will involve a collaboration between China and the country’s Land Info­rmation and Management System (LIMS), launched in 2023 to optimise agricultural production through innovative technologies, and sustainable agricultural practices.\n\nThis move is likely to help settle a major controversy, surrounding the methodology used by the Punjab Crop Reporting Service (CRS) to determine provincial cotton output, which has been dogged by allegations of inflated and misleading statistics.\n\nCRS authorities, however, accuse cotton ginners of under-invoicing and calculating only the raw cotton arriving at the factory gate, instead of estimating harvests directly from fields.\n\nAccording to its detractors, the service is allegedly estimating total cotton production using hypothetical calculations — extrapolating yields based on the number of bolls per plant across an acre or, in some districts, from small sample plots as small as eight feet by six feet.\n\nThis has exposed a long-standing discrepancy between the figures reported by CRS Punjab and those of the Pakistan Cotton Ginners Association (PCGA), with the former consistently reporting significantly higher production.\n\nThis variance has long complicated decision-making for stakeholders in the cotton industry. While some attribute the CRS’ inflated figures to unrecorded lint sales by certain ginners, the presence of two conflicting national datasets has damaged Pakistan’s credibility in international cotton forums.\n\nIn FY25, the CRS said that seed cotton production in Punjab had reached 609,000 bales based on harvesting data recorded up to July 31. In contrast, PCGA reported only 301,000 bales, less than half the official figure.\n\nThe CRS defended its data saying the figures are derived using internationally recognised, scientifically proven methods – including randomised sampling and ground truthing techniques widely adopted for yield estimation in various countries.\n\nCRS DG Dr Abdul Qayyum explained that the service employs GPS-enabled tools and FAO-endorsed methodologies, supported by a real-time digital dashboard that ensures transparency and facilitates evidence-based policy decisions.\n\nHe argued that the PCGA figures reflect only the cotton arriving at operational ginning factories in Punjab, regardless of its origin.\n\nThe PCGA figures also do not account for the seed cotton still held at the farm level, transferred to other provinces, or stored by stockists, he insists. “The persistent under-invoicing in recent years has also significantly undermined the accuracy of cotton reporting at ginning factories,” he added.\n\n“We emphasise that the official record of national cotton production is based on crop reporting estimates compiled from all provinces. Therefore, comparing these figures with PCGA’s fortnightly ginning data is unjustified,” he stressed.\n\nTo avoid any confusion, the CRS official asked the Federal Board of Revenue (FBR) to implement a foolproof mechanism at all operational ginning factories to ensure accurate and real-time reporting of the cotton received and processed.\n\n“This step is essential for enhancing transparency, strengthening data integrity, and supporting coordinated efforts across institutions involved in cotton monitoring and policy formulation.”\n\nAPTMA ready to take over PCCC\n\nIn another development, the All Pakistan Textile Mills Association (APTMA) has expressed interest in taking over the Pakistan Central Cotton Committee (PCCC).\n\nThe move follows a recent meeting on cotton revival chaired by Deputy Prime Minister Ishaq Dar, during which a long-standing issue regarding billions of rupees in outstanding funds from APTMA to PCCC was resolved. Sources indicate that the PCCC has agreed to the proposal.\n\nIf the takeover goes ahead, it is expected to accelerate cotton research in the country, leading to the development of new, high-yielding, and climate-resilient varieties, said Cotton Ginners Forum Chairman Ihsanul Haq. This, in turn, could significantly increase Pakistan’s per-acre cotton yield.\n\nMeanwhile, recent rains across most cotton-growing regions of Pakistan have led to a shortage of high-quality cotton, pushing prices higher. Cotton prices rose by Rs200 to Rs300 per maund, reaching Rs16,400 to Rs16,600 per maund in various local markets.\n\nMr Haq warned that if the Pakistani rupee continues to depreciate against the US dollar, cotton prices may rise even further.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:32:00.404Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936967/crop-data-to-be-augmented-using-satellite-technology",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:29:44.000Z"
}
