{
  "title": "Pakistan Weightlifting Federation’s bank account blocked over lack of transparency - Sport - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Bank of Pakistan (NBP), on a request of the Pakistan Sports Board (PSB), has blocked the bank account of the suspended Pakistan Weightlifting Federation (PWLF).\n\n“The action is in line with the agenda of PSB director general Yasir Pirzada [which is] to ensure transparency, accountability and good governance in all sports organisations across Pakistan,” a PSB spokesman said in a press statement issued on Sunday.\n\nThe PSB emphasised that no body which fails to meet constitutional and legal requirements will be allowed to operate under the country’s banner.\n\n“The step was taken after the PSB informed NBP that the PWLF, which stands suspended by the PSB, is not incorporated under Section 42 of the Companies Act 2017, and is operating in violation of [the] national laws and regulations. Moreover, the PWLF has failed to comply with the constitution of the International Weightlifting Federation (IWF), which requires a national body to be a separate and legally incorporated entity,” added the PSB release.\n\nThe PSB further stated that the PWLF was suspended during the 25th PSB Board meeting held on July 6, 2022, based on the report of a delegate appointed pursuant to a judgment of the Lahore High Court. The suspension was imposed due to alleged irregularities in its functioning, corrupt practices and violations of the anti-doping code. A detailed inquiry regarding the wrongdoings allegedly committed by the suspended PWLF office-bearers is still ongoing.\n\nFurthermore, according to an International Testing Agency (ITA) report, dated March 10, 2025, it was confirmed that PWLF’s top officials committed Anti-Doping Rule Violations (ADRVs).\n\nThe PSB pointed out that only the sports organisations recognised or affiliated with the PSB and incorporated under Section 42 of the Companies Act 2017 are entitled to regulate a sport in Pakistan, use the country’s name, or represent Pakistan internationally.\n\nSince the PWLF did not fulfill these legal and regulatory requirements, the PSB formally requested the NBP to suspend its bank account (account No. 2200026441 at Samanabad Branch, Lahore, now shifted to Allama Iqbal Town, Lahore). Following the PSB’s request, an email from NBP’s operations manager confirmed that the account has been debit blocked with immediate effect.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:53:14.989Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937023/pakistan-weightlifting-federations-bank-account-blocked-over-lack-of-transparency",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:12.000Z"
}
