{
  "title": "May 9 riots: Faisalabad ATC sentences key PTI leaders Omar Ayub, Shibli Faraz, 57 others to 10 years in jail - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Faisalabad anti-terrorism court (ATC) on Monday sentenced key PTI leaders Omar Ayub, Shibli Faraz and Zartaj Gul, along with 56 others, to 10 years in jail and acquitted 34 in the case of an attack on former interior minister Rana Sanaullah’s house during the May 9, 2023 riots.\n\nOn May 9, 2023, military installations and state-owned buildings were vandalised as PTI supporters protested the arrest of ex-premier Imran Khan, who was released later but has been imprisoned in various cases since August 2023. Following the riots, thousands of protesters, including the party’s top leadership, were arrested.\n\nJudge Javed Iqbal Sheikh presided over today’s hearing of the case registered at the Samanabad police on May 9, 2023.\n\nPTI legal team head Malik Khalid Shafiq confirmed the convictions to Dawn.com. He said that out of the total 109 accused, 59 were handed 10 years’ rigorous imprisonment and 16 were given three years’ jail time.\n\nAyub, Faraz and Gul, as well as Muhammad Ahmad Chattha, were recently disqualified from their parliamentary seats following their convictions in other May 9 cases.\n\nOther PTI leaders included Sheikh Rashid Shafique (nephew of former interior minister Sheikh Rasheed), Ashraf Khan Sohna, Rai Hassan Nawaz, Rai Murtaza Iqbal, former MNA Kanwal Shauzab and former Punjab MPA Farah Agha. They were also convicted in other May 9 cases on July 31.\n\nFormer information minister Fawad Chaudhry, who quit PTI in the wake of the May 9 incidents, and MNA Zain Qureshi (son of PTI Vice Chairman Shah Mahmood Qureshi) were among those freed of the charges today.\n\nFawad and Zain had also been acquitted in three other Faisalabad cases pertaining to the May 9 riots.\n\nPTI parliamentarians convicted would face automatic disqualification under Article 63(1)(g) of the Constitution, which bars members convicted of crimes involving moral turpitude or corrupt practices.\n\nReacting to the court verdict, Gul said on X that she was innocent.\n\nShe contended that the verdict was based on the argument that she was present in a meeting held at Imran’s Zaman Park residence in Lahore on May 7, 2023, where plans for the protest were reportedly made.\n\nHowever, according to Gul, she was present in her Dera Ghazi Khan constituency on that day, attending a “fateha, inauguration, wedding and other events”. She also shared screengrabs of social media posts that showed her activities that day, adding that she had presented this evidence in court.\n\nThe deadline given to ATCs to decide various May 9 cases had already passed earlier this month. Therefore, day-to-day hearings were being held in the case, according to PTI lawyer Shafiq.\n\nLast week, the Kasur Crime Control Department (CCD) presented former Faisalabad Civil Lines station house officer Zeeshan Khalid Randhawa as a witness during the trial. The former SHO was already under arrest in a separate kidnap and murder case of a Kasur resident.\n\nA joint investigation team probing the case had been summoned by an ATC in July 2024 to submit the charge sheet.\n\nToday’s convictions are the latest in a slew of ATC sentences, wherein over 100 PTI leaders and workers have been handed lengthy jail terms.\n\nOn July 22, a Lahore ATC had handed Yasmin Rashid, Omar Sarfraz Cheema, Mian Mehmoodur Rasheed and other PTI leaders 10 years of rigorous imprisonment in a case related to vandalism at Sherpao Bridge. However, incarcerated Shah Mahmood Qureshi and five others were acquitted.\n\nThe same day, a Sargodha ATC had sentenced as many as 32 accused, including then-Punjab Assembly opposition leader Malik Ahmed Khan Bhachar, in a case registered at the Musakhel police station.\n\nOn July 31, a Faisalabad ATC had senten­ced over 100 PTI leaders and workers to up to 10 years’ imprisonment in three cases. Omar Ayub, Shibli Faraz, Zartaj Gul and Sunni Ittehad Council chief Hamid Raza were among key opposition leaders handed 10 years’ jail time.\n\nIn one case, 60 out of 67 accused were convicted, while seven were acquitted. In another case, 107 out of 108 accused were sentenced to 10 years of rigorous imprisonment, while one person received a three-year sentence and 77 were acquitted.\n\nOn August 1, a Sargodha ATC sentenced PTI worker Muham­mad Ismail to rigorous life imprisonment in May 9 cases related to an attack on the judicial complex in Mianwali and declared 50 others as proclaimed offenders.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/251603587ab4243.webp",
  "retrievedAt": "2025-08-25T13:31:47.213Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937111/may-9-riots-faisalabad-atc-sentences-key-pti-leaders-omar-ayub-shibli-faraz-57-others-to-10-years-in-jail",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T09:23:21.000Z"
}
