{
  "title": "Energy poverty — a crisis of access, not supply - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan’s energy sector is once again in reform mode. Tariff rationalisation, circular debt restructuring, privatisation of distribution companies, and market liberalisation dominate the headlines. Yet, behind this technocratic momentum lies a largely invisible crisis: the everyday reality of millions of Pakistanis trapped in energy poverty.\n\nWhile governments and donors remain focused on cost recovery and fiscal stabilisation, countless households continue to struggle with unreliable access, unaffordable bills, and steadily declining living conditions. Unless energy poverty is placed at the centre of the reform agenda, Pakistan’s energy transition risks widening existing social and economic divides.\n\nThe problem is not just about having an electric connection. Official figures, citing a national electrification rate above 97 per cent, obscure a stark disconnect between grid connectivity and meaningful use. According to the World Bank’s 2023-24 Pakistan Energy Access Survey, only around 3pc of households meet Tier-4 access under the Multi-Tier Framework — a level that denotes electricity supply that is adequate, reliable, and affordable.\n\nLacking standard indicators or a dedicated strategy, well-intentioned programmes often miss their mark without a clear understanding of who is energy-poor and why\n\nIn rural areas, over 7pc of households remain without any electricity. Among those connected, outages of 12 to 17 hours a day are common. Even when power is available, it is expensive. Around 10pc depend on informal connections, often dangerous and unreliable. The result is a multidimensional failure.\n\nApril’s record-setting heatwaves exposed this reality. Even middle-income households struggled to power fans or refrigerators. In many cases, monthly electricity bills exceeded the cost of rent — a symptom of extreme energy stress. Globally, spending over 10pc of income on energy defines energy poverty. In Pakistan, many cross this threshold routinely but are rarely acknowledged.\n\nDespite its scale, energy poverty remains institutionally invisible. Pakistan lacks a national definition, standard indicators, or a dedicated strategy. This absence undermines subsidy targeting and off-grid electrification, as well-intentioned programmes often miss their mark without a clear understanding of who is energy-poor and why.\n\nOne example of this policy mismatch is how residential consumers are categorised. Lifeline users consuming under 100 kWh monthly are eligible to get subsidised rates, while protected consumers using up to 200 kWh also receive some relief. But households crossing 200 kWh are reclassified as unprotected, facing steep tariff hikes. This shift disproportionately impacts low- and lower-middle-income families, whose consumption often rises in summer for basic cooling needs or due to larger household sizes.\n\nThese families are not being extravagant; they are merely meeting essential needs amid extreme weather. Yet the tariff structure penalises them, imposing unaffordable rates that treat their vulnerability as excess.\n\nThe outcome is both economically and morally untenable. Despite spending over PKR 1.19 trillion annually on electricity subsidies, energy poverty remains widespread, with support often missing those who need it most. What Pakistan needs is a shift to vulnerability-based targeting—support that considers actual household needs, structural constraints, and geographic disparities, rather than consumption alone. The redirecting subsidies through this lens would not only protect the energy-poor, but also advance equity, uphold energy justice, and reduce fiscal and grid stress.\n\nEnergy poverty is not just an energy issue; it intersects with public health, education, housing, and gender equity. Poor housing insulation and inefficient appliances drive up electricity use. In rural areas, women and children bear the brunt — collecting firewood for cooking, enduring extreme indoor heat, and relying on unsafe lighting.\n\nAddressing this demands an integrated approach. Newly mandated building codes for thermal insulation must be enforced, financial incentives for efficient appliances (LED lights, inverter fans) and embedding energy justice across social policy. These climate-resilient measures will not only lower energy burdens but also build long-term household resilience to improve efficiency as well as equity.\n\nMeanwhile, solar adoption is surging nationwide — not due to state incentives, but because grid electricity has become unaffordable. Pakistan now ranks among the world’s top solar panel importers. Rooftop systems are spreading in urban areas benefiting from net metering, while rural and off-grid communities remain limited to basic solar setups for lighting or phone charging. Without enabling policies, this necessary yet informal shift risks creating a two-tier energy system, where clean and reliable power remains a privilege of the affluent.\n\nRecent policy choices have deepened this divide. New import duties on solar equipment in the 2025 budget have raised costs for end-users, undermining one of the few viable coping strategies for low-income households.\n\nThere are promising models, however. The government has introduced programmes to incentivise adoption of solar home systems in off-grid areas, offering basic electrification to underserved communities. Yet these often fail to power entire households or support small enterprises. A shift towards decentralised, community-scale solutions is needed. Microgrids — particularly powered by solar or micro-hydropower — can offer affordable, reliable electricity independent of the national grid. Yet institutional inertia remains a key barrier. Outdated data, fragmented mandates, and poor federal-provincial coordination stall progress.\n\nSaadia Qayyum is a strategy consultant and former energy specialist for the World Bank, and Shafqat Hussain Memon is an academic researcher in energy based in Jamshoro\nHe can be reached at: hussainshafqat.memon@gmail.com.\n\nPublished in Dawn, The Business and Finance Weekly, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:32:11.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936957/energy-poverty-a-crisis-of-access-not-supply",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:06.000Z"
}
