{
  "title": "World’s first commercial CO2 ‘graveyard’ opens in Norway - World - DAWN.COM",
  "author": null,
  "content": "The world’s first commercial service offering carbon storage off Norway’s coast has carried out its inaugural CO2 injection into the North Sea seabed, the Northern Lights consortium operating the site said on Monday.\n\nNorthern Lights, led by oil giants Equinor, Shell and TotalEnergies, involves transporting and burying CO2 captured at smokestacks across Europe.\n\nThe aim is to prevent emissions from being released into the atmosphere, and thereby help halt climate change.\n\n“We now injected and stored the very first CO2 safely in the reservoir,” Northern Lights’ managing director Tim Heijn said in a statement. “Our ships, facilities and wells are now in operation.”\n\nIn concrete terms, after the CO2 is captured, it is liquified and transported by ship to the Oygarden terminal near Bergen on Norway’s western coast.\n\nIt is then transferred into large tanks before being injected through a 110-kilometre (68-mile) pipeline into the seabed, at a depth of around 2.6 kilometres, for permanent storage.\n\nCarbon capture and storage (CCS) technology has been listed as a climate tool by the UN’s Intergovernmental Panel on Climate Change (IPCC) and the International Energy Agency (IEA), especially for reducing the CO2 footprint of industries like cement and steel that are difficult to decarbonise.\n\nThe first CO2 injection into the Northern Lights geological reservoir was from Germany’s Heidelberg Materials cement plant in Brevik in southeastern Norway.\n\nBut CCS technology is complex and costly. Without financial assistance, it is currently more profitable for industries to purchase “pollution permits” on the European carbon market than to pay for capturing, transporting and storing their CO2.\n\nNorthern Lights has so far signed just three commercial contracts in Europe.\n\nOne is with a Yara ammonia plant in the Netherlands, another with two of Orsted’s biofuel plants in Denmark, and the third with a Stockholm Exergi thermal power plant in Sweden.\n\nLargely financed by the Norwegian state, Northern Lights has an annual CO2 storage capacity of 1.5 million tonnes, which is expected to increase to five million tonnes by the end of the decade.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:45.502Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937115/worlds-first-commercial-co2-graveyard-opens-in-norway",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T12:00:05.000Z"
}
