{
  "title": "200 tourists stranded at Saiful Muluk Lake evacuated to Naran - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Around 200 tourists, who were stranded at Saiful Muluk Lake in Kaghan Valley following a heavy landslide, were safely evacuated to Naran, while five families facing an imminent threat of glacial lake outburst flood (Glof) in the mountainous Kandia Valley were relocated to safer locations, an official of the Kaghan Development Authority (KDA) said on Sunday.\n\n“The tourists, who had thronged the Saiful Muluk Lake in 25 four-wheel jeeps, were stranded after a landslide struck the area. We moved machinery and cleared the debris to shift them to Naran,” KDA assistant director Assad Shahzad told reporters on Sunday.\n\nHe said the main artery connecting Saiful Muluk Lake with Naran, the commercial hub of Kaghan Valley, was blocked by the landslide on Saturday night.\n\n“The tourists, who were returning to Naran were stranded after the landslide. After clearing the road, we shifted them to their respective hotels in Naran through their jeeps,” Mr Shahzad added, saying that no visitor was injured.\n\nFamilies facing Glof threat in Kandia Valley relocated to safer places\n\nChairman of hoteliers association in Kaghan, Hussandeen Khan Swati, said the Mansehra-Naran-Jalkhad Road was open to all sorts of traffic up to the neighbouring Chilas (Gilgit-Baltistan).\n\n“The lake road, which had been blocked, was reopened within an hour,” he said.\n\nMeanwhile, the Upper Kohistan district administration set up a camp in the Karang area of Kandia Valley to relocate families facing possible Glof threats.\n\n“We have stationed revenue officials, other departments’ staff and volunteers under the leadership of assistant commissioner at that camp to cope with any emergency,” a press release issued by deputy commissioner Tariq Ali Khan stated.\n\nIt said five families comprising 43 individuals had so far been shifted to safer places.\n\n“The relocation process of households still under Glof threat is underway in the entire Kandia Valley,” the press release added.\n\nMeanwhile, the MNJ Road was blocked to all sorts of traffic for many hours in the Hassa area of Balakot due to landslides.\n\nAccording to Rescue 1122, the tehsil municipal administration moved machinery and cleared the artery to traffic after removing landslides.\n\nSCHOLARSHIPS: A company executing the Suki Kinari hydropower project in Kaghan Valley gave away cheques of educational scholarship to 41 deserving students, including girls, on Sunday.\n\nMansehra deputy commissioner Mian Behzad Adil and army’s commanding officer Lt-Col Naveed Aslam distributed the cheques among the students.\n\nThe cheques were distributed under the dream becoming reality programme.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab78676472c.jpg",
  "retrievedAt": "2025-08-25T13:32:03.725Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936932/200-tourists-stranded-at-saiful-muluk-lake-evacuated-to-naran",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:44.000Z"
}
