{
  "title": "Agriculture: Half-baked wheat market reforms - Newspaper - DAWN.COM",
  "author": null,
  "content": "The sowing season of wheat — Pakistan’s primary staple crop grown on over 22 million acres — is just two months away, yet uncertainty prevails across the sector. Farmers incurred losses in 2025 as their produce fetched only Rs2,100–2,300 per 40kgs, well below production costs as well as import parity prices. As a result, many growers with alternative crop options are now reluctant to sow wheat, deepening last year’s six per cent drop in acreage.\n\nThis crisis is the inevitable outcome of Pakistan’s wheat sector policies, shaped largely by international financial institutions and mounting fiscal pressures. The federal and provincial governments have not only ceased setting a minimum support price but have also discontinued public procurement since the last crop season.\n\nHistorically, both these measures helped stabilise the market, maintain strategic reserves, and guarantee farmers a basic profit. Yet, structural inefficiencies in procurement and storage, entrenched corruption, and the heavy reliance on commercial bank loans burdened the public exchequer, which eventually triggered demands for reforms.\n\nPunjab, which alone contributes nearly 77 per cent of Pakistan’s wheat, is reviewing its wheat policy for 2026, according to August 2025 media reports. With wheat central to national food security, the government’s challenge is threefold: arrest the decline in acreage, stabilise the market for fair farmer returns, and encourage large-scale private sector procurement.\n\nAfter a slew of anti-farmer policies over the past two years, the agri sector braces for the impending wheat policy\n\nTo this end, the government is banking mainly on three measures: distributing free tractors to a select number of farmers, strengthening the electronic warehouse receipt system (EWR) that lets farmers and others store crops in accredited warehouses and use them as collateral for bank loans, and extending a financing facility of Rs100 billion to flour mills and green licence holders.\n\nHowever, the opinion leaders of the agriculture sector caution that farm machinery schemes based on balloting may draw in a few thousand farmers but fail to influence them on a wider scale.\n\nSimilarly, when it comes to EWR, hardly a few hundred tonnes of wheat were stored in warehouses during the last season. The government attributes the poor uptake to its late launch, unclear operational rules, and delays in linking with the Pakistan Mercantile Exchange for wheat trading.\n\nNevertheless, storage capacity under EWR systems remains alarmingly low. As of August 2025, accredited storage for all crops across Pakistan stood at roughly 340,000 tonnes, with active capacity barely a quarter of that. Most of this storage (godown and silos) is owned by rice and feed mills, likely used to finance their own stocks if government incentives under EWR systems are offered.\n\nThe government is banking on three measures: distributing free tractors, strengthening EWR systems, and extending financing worth Rs100bn to flour mills and green licence holders\n\nConcerns are also mounting over the Rs100 billion financing facility. Experts warn that it could create a new “wheat mafia”, much like those already entrenched in the sugar and other sectors. Backed by political clout and financial muscle, such groups could manipulate the market, engineer artificial shortages, and drive up prices. With wheat as the core staple food, any market manipulation or delay in imports in times of shortage could spell disaster.\n\nNotably, profit — not market stability or national food security — would primarily drive private sector procurement. After factoring in warehouse rent, bank charges (since the financing facility is unlikely to last long), and storage losses, procurement makes sense for private operators only if prices rise 30–35pc between harvest and crop year-end. Otherwise, they will withdraw, leaving the government to prop them up year after year with subsidised loans or similar incentives — a clear case of replacing one problem with another. Worse still, such profits will come at the farmers’ expense, deepening the rural-urban and rich-poor divide.\n\nAlready, anti-farmer policies over the past two years have diverted wealth from the agriculture sector into the hands of a few thousand traders, stockists, processors, input manufacturers, and dealers, who have typically parked their gains in real estate, overseas investment, or in such assets that do not contribute to Pakistan’s economic growth. In contrast, the agriculture sector, with its 11.7m units, is likely to reinvest in farming or spend on construction, consumables, durables, and services that drive growth across the retail, manufacturing, and service sectors.\n\nIn the given situation, a more sustainable path lies in empowering farmers to avoid distress sales during peak harvest days. It is worth noting that EWR systems — by their very nature and design — offer little appeal for small- and medium-sized farmers, the majority of whom are not well-educated. Addressing this challenge requires a two-pronged strategy: first, subsidised loans to help farmers build on-farm or in-house storage (a 300-square-foot room suffices for 20 acres of produce); and second, affordable agricultural credit to finance the next crop.\n\nIn addition, instead of depending on the private sector, the federal and provincial governments should maintain strategic wheat reserves of around 4m tonnes, with half rotated each year. This would limit annual procurement to about 2m tonnes only — down from the previous 5-7m tonnes.\n\nIn conclusion, market reforms are not inherently flawed; what matters is how they are designed and implemented. A truly deregulated market cannot function on selective principles. If the state withdraws from setting support prices and procuring directly from farmers, it must also refrain from distorting the market through administrative interventions, such as controlling roti prices or imposing district-specific wheat rates.\n\nKhalid Wattoo is a development professional and a farmer, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad.\n\nPublished in Dawn, The Business and Finance Weekly, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:48.419Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936954",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:06.000Z"
}
