{
  "title": "Karachi residents face traffic jams due to repair work on tattered roads in flood aftermath - Pakistan - DAWN.COM",
  "author": null,
  "content": "Karachi residents faced disruptions in their daily commute on Monday morning due to traffic jams caused by repair work on tattered and flooded roads in the aftermath of last week’s heavy rains.\n\nTorrential rains on August 19 had flooded neighbourhoods, severely strained Karachi’s fragile infrastructure, left people stranded on roads for hours, disrupted industrial operations and led to prolonged power outages.\n\nThoroughfares are still riddled with potholes, exposing the devastation of Karachi’s road network and posing serious dangers to commuters across the metropolis.\n\nSubsequently, as Karachiites left their homes for offices and schools this morning, they faced hurdles caused by accumulated rainwater and “development work” being carried out to repair the ruined roads, as reported by the traffic police.\n\nAreas in the Malir, East and Korangi districts were affected, with locations including the busy thoroughfare of Dr Ziauddin Ahmed Road near Shaheen Complex.\n\nDawn.com staffers also reported traffic congestion near Shaheen Complex and on Sharea Faisal at around 10am.\n\nTo avoid hassle and inconvenience, the Karachi Traffic Police (KTP) urged commuters to call the 1915 helpline for alternative routes.\n\nAt around 12pm, Google Maps showed most main arteries as having light traffic flow. However, multiple road blockages were reported across the city, notably in locations where roads had been inundated due to rainwater.\n\nFollowing the recent heavy downpour, roads located within the territorial jurisdictions of the Karachi Metropolitan Corporation, cantonment boards, Karachi Development Authority, various town municipal corporations and other land-controlling agencies are in damaged condition.\n\nVital arteries impacted include both tracks of Shahrah-i-Sher Shah Suri, Shahrah-i-Pakistan, University Road, S.M. Taufiq Road, Jahangir Road, Manghopir Road, Shahrah-i-Qaddafi.\n\nOther key arteries, including M.A. Jinnah and I.I. Chundrigar Road, also have cracks.\n\nOn the stretch adjacent to Burns Garden on Dr Ziauddin Ahmed Road, rains have created a deep crater, raising questions about the authorities’ ability to maintain some of the busiest and most vital thoroughfares of the metropolis.\n\nIn an update at 7:37am, the traffic police said “development work on potholes” was being done on the second track of Natha Khan Bridge going towards the airport.\n\nHowever, the statement said there was “no traffic problem” as vehicles passed through the sides.\n\nIn the Malir district, Madras Chowk heading to Sachal Goth and Muhammad Khan Goth and on Suparco Road, was blocked for traffic at 8:43am as “drain development work” was underway.\n\n“Traffic is being diverted to other roads on both sides. Due to both roads being blocked, there’s traffic pressure at Madras Chowk,” the KTP said.\n\nFor similar work, both roads in front of Huma Lawn near Shaheen Chowk on Dr Ziauddin Ahmed were also closed for traffic at around 9am.\n\nCommuters were being diverted towards Jang Press from Shaheen Complex and from S.M. Law College as well.\n\nAt the same time, slow traffic flow was reported at Munawar Chowrangi in Gulistan-i-Johar as developmental work was being carried out on the underpass.\n\nAnother point impacted by accumulated rainwater and potholes was Checkpost No. 6 towards Tank Chowk near Malir Cantonment. The traffic police said it was managing the “slow” traffic flow.\n\nSlow traffic flow was also reported at the main Superhighway in front of Sachal Mor before the Punjab Adda bus stand. The Frontier Works Organisation was carrying out cleaning on the first track, the KTP said.\n\nRainwater accumulation and potholes also caused traffic delays on Kashif Shaheed Chowk going towards Jamali Bridge on Maulana Ubaidullah Sindhi Road at 9:18am, as vehicles were moving via a single track.\n\nBagh-i-Korangi Road from Awami Cut to Mazaar Cut was closed for traffic at 9:20am due to damage and flooding. “Traffic is being diverted to another road with double traffic,” the police said.\n\nAt 10:35am, traffic was moving at a slow speed on EBM Causeway heading towards Baloch Colony and Brookes Chowrangi, with KTP citing rainwater accumulation and potholes on the road as the reasons.\n\nSlow traffic was also witnessed at Drigh Road Underpass, which had been closed for traffic due to rainwater last week, at 11:33am as Karachi Cantonment Board was doing drainage work.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/25130407a6c777a.webp",
  "retrievedAt": "2025-08-25T13:31:48.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937093/karachi-residents-face-traffic-jams-due-to-repair-work-on-tattered-roads-in-flood-aftermath",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T06:58:51.000Z"
}
