{
  "title": "Fake FIRs being circulated on FIA’s behalf, used for blackmail: agency - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Federal Investigation Agency (FIA) on Monday warned that criminals are circulating fake first information reports using the agency’s name to blackmail people, according to a press release.\n\n“FIA has received information that criminal elements are harassing people by sending fake and fabricated FIRs on WhatsApp in the name of” the agency, the press release, available with Dawn.com, stated. “Citizens are named in fake FIRs and terrorised.”\n\n“These elements try to present themselves as FIA officials by using fictitious and misleading names,” the agency added. “In such messages, attempts are being made to blackmail citizens by making serious allegations like ‘cybercrimes and terrorism’.”\n\nThe FIA stated that it does not send messages of this nature to people via WhatsApp and urged the public to file complaints about suspicious messages with the National Cybercrime Investigation Agency (NCCIA), which is the “authorised agency to investigate cybercrime”.\n\n“Beware of fake messages, and never share your personal and financial information,” the FIA said.\n\nA copy of the fake FIR was also shared with Dawn.com, registered under Sections 11H (fundraising), 11N (punishment under Sections 11H to 11K) and 11Q *(forfeiture) of the Anti-Terrorism Act, 1997, read with Section 3 (offence of money laundering) of the Anti-Money Laundering Act, 2010 and Sections 109 (punishment of abetment if the act abetted is committed in consequence and where no express provision is made for its punishment) and 120B (punishment of criminal conspiracy) of the Pakistan Penal Code.\n\nOn August 8, the agency warned citizens against “fake emails and WhatsApp messages” being sent in its name.\n\n“The FIA has received reports that some unknown individuals are harassing the public by sending fake emails and WhatsApp messages in the name of the DG FIA,” a statement issued by the agency’s spokesperson, Abdul Ghaffar, read.\n\n“In these fake messages, the public is being terrorised by using the name and position of DG FIA,” the statement said, adding that fraudsters put a fake stamp of “Top Secret” on these messages to make them appear authentic.\n\nOn August 5, the Digital Rights Foundation issued an alert warning against an ongoing scam aiming to compromise WhatsApp accounts via fake calls requesting a code.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:45.647Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937122/fake-firs-being-circulated-on-fias-behalf-used-for-blackmail-agency",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T11:52:03.000Z"
}
