{
  "title": "Centre, KP seem to be on ‘same page’ on NFC tweaks - Newspaper - DAWN.COM",
  "author": null,
  "content": "• First meeting of 11th NFC scheduled for Friday\n• PTI’s Muzammil Aslam says KP will seek disincentivising population, propose prosperity and forestation as criteria for resource distribution\n• KP minister rues imbalance in Centre’s approach to smaller provinces\n\nNATHIA GALI: For a change, the federal government led by the PML-N and the Khyber Pakhtunkhwa government headed by the PTI seem to be in agreement on changes to the oversized population factor in determining the share of the federation and its federating units under the new National Finance Commission (NFC), set to hold its introductory meeting later this week.\n\n“We will demand that population and backwardness should be disincentivised for resource distribution among the provinces,” said KP Mini­ster for Finance Muzammil Aslam while speaking at the first two-day ‘Prosper Pakistan’ conference organised by the FPCCI Regional Office Peshawar in collaboration with KP’s Board of Investment and Trade.\n\nThe federal ministers, particularly development minister Ahsan Iqbal, had been publicly calling for disincentivising the population for NFC shares, although no political party in any province has ever called for the population to secure more funds from the divisible pool. However, the allegations of irregularities in the population census have cropped up in the past, which required improvement in census methodologies. The first meeting of the 11th NFC, constituted last week, has been scheduled for August 29 (Friday) to set the stage for subsequent deliberations.\n\nThe apparent converging stance of the two arch rivals — the PML-N and the PTI — is likely to put the two larger provinces, Punjab and Sindh, under immense pressure for disincentivising population as the key determinant for the distribution of divisible pool resources. The revision, however, also benefits Balochistan, the sparsely populated largest province by area.\n\nLed by President Asif Ali Zardari and Prime Minister Shehbaz Sharif, the political partners at the Centre and backed by the relevant quarters, it would be very challenging for junior leaderships of the ruling parties in Sindh and Punjab to resist reducing the importance of population to work out vertical shares of the federation and its federation units and then decide horizontal shares of the provinces.\n\nMr Muzammil said the KP government would demand changes in the formula of the horizontal resource distribution within the federating units during the upcoming NFC deliberations. He said 82pc resource distribution among the provinces was based on the population criterion and 10.6pc on the basis of backwardness, but the KP government would now stipulate reduction in population, prosperity, and forestation as criteria for the distribution of resources.\n\nHe said the new NFC had been constituted to evolve a consensus on the vertical and horizontal distribution of financial resources. The provinces currently receive 57.5pc share under the vertical formula, while the remaining amount goes to the federal government. He said the KP would demand changes in the criteria for the horizontal distribution as well.\n\n‘Imbalance in development approach’\n\nKP’s finance minister, who hails from Karachi, criticised the federal government, saying the National Highway Authority (NHA) was used for the road and highway projects in Punjab and Sindh, but it ignored the KP and Balochistan.\n\n“This imbalance in the development approach has aggravated the situation in the smaller provinces”, while the planning minister Ahsan Iqbal was talking about the collapse of the federal government in five years due to its financial constraints as the development budgets of Sindh and Punjab exceeded that of the Centre.\n\nHe told the participants that 12 hydropower projects were currently under construction in KP capable of producing 1,000MW at an estimated supply cost of 8 US cents per unit. However, he said the government had increased the wheeling charges to Rs27 per unit that would block cheaper electricity from the province.\n\nHe regretted that the Left Bank Canal could not be constructed in more than three decades since the water apportionment accord was signed in 1991.\n\nUnder the 7th NFC award delivered in 2009 and still in force after 15 years instead of a five-year constitutional term, the provincial share had increased to 57.5pc from about 47pc which further increased to about 59pc given special allocations to Balochistan, KP and Sindh on different grounds and reduced the federal share to 42.5pc.\n\nIn subsequent years, the Centre imposed a petroleum levy (about Rs1.5 trillion) on petroleum products and secured about Rs1.5tr cash balances from the provinces on an annual basis, effectively reversing the financial balance to its favour. The Centre, however, has been advocating disincentivising the population factor and provincial shares to common responsibilities like dams, natural disasters, climate change and national security etc.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:32:00.452Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936966/centre-kp-seem-to-be-on-same-page-on-nfc-tweaks",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:29:44.000Z"
}
