{
  "title": "Evacuated villagers in Kasur reluctant to stay in flood relief camps - Pakistan - DAWN.COM",
  "author": null,
  "content": "KASUR: In response to high flood in the Sutlej river, the district administration on Sunday started evacuating people from their villages.\n\nEvacuated villagers, however, refused to stay at the flood relief camps set up by the district administration at public schools, including at Sheikhpura Nau, Sahjra, and the camps at schools are giving a deserted look.\n\nAccording to villagers, including Muhammad Hanif, Baqar Ali and Naveed Ahmed, evacuated people preferred to go to their relatives for shelter, showing distrust in the administration regarding availability of food and fodder.\n\nThey said the residents of villages who were not yet disconnected from the main road were reluctant to leave their homes. They said that they were facing hardships in getting fodder for their animals as the crops were damaged by the flood. The situation is forcing them to move to better places than the relief camps.\n\nWater gauge at Ganda Singh was 20.80 with 122,000 cusecs of water flow. According to the local irrigation department, flood is considered at low level when the water depth gauge in the river measures 18ft water, it is at medium level at 19.75ft, the flood is at high level if the gauge goes beyond 20.75 while in the Sutlej, the gauge has crossed the mark of 21.80ft.\n\n72 villages affected in Kasur; 30 stranded fishermen rescued; minister warns of worse situation in next 24 hours\n\nProvincial Health Minister and Chairman Cabinet Committee on Disaster Management Khawaja Salman Rafiq visited Kasur on Sunday and warned of the situation getting worse in the rivers of Punjab, including the Sutlej, in the next 24 hours.\n\nAccording to Rescue 1122, 1,686 people and 967 animals have so far been evacuated from their villages and shifted to safer places. It claims to have provided transportation to 4,468 people to help them manage food and other necessities for their families.\n\nAbout 72 villages in Kasur have so far been affected by the flood and crops standing on hundreds of acres were submerged by the floodwater released into the Sutlej by India. It is pertinent to mention that India has the right over the Sutlej according to the Indus Waters Treaty but the country releases water into the river in the monsoon.\n\nRescuers and army personnel on Sunday rescued over 30 fishermen stranded at village Kamalpura. The land where the fishermen were sitting for fishing was suddenly engulfed by floodwater turning the spot into an island.\n\nThe district administration declared three villages, including Talwar post, Sahjra and Walaywala, as sensitive areas. The villages, including Bhikiwind, and Chanda Singh, were isolated and surrounded by floodwater while the villages, including Rajowal, Sadar and Najabat, are facing land erosion due to high speed of river water.\n\nMinister Khawaja Salman Rafique was accompanied by Punjab Assembly Speaker Malik Muhammad Ahmed Khan when he reached Kasur to review the flood situation. Both chaired a meeting at the Kasur DC Office which was also attended by PDMA Director General Irfan Ali Kathia, the irrigation secretary and chief engineer Lahore Zone.\n\nThe commissioner Gujranwala, DCs of Gujarat, Sialkot and Emergency Services Department Secretary Dr Rizwan Naseer attended the meeting through a video link. The secretary irrigation, DC and PDMA DG briefed the meeting on the current flood situation.\n\nThe meeting also reviewed measures to deal with possible floods in Sialkot and Gujrat in the Chenab River.\n\nAddressing the meeting, Khawaja Salman Rafique said relief operations had been reviewed on the spot to deal with the flood situation while relief activities had been intensified in the affected areas.\n\n“A large stream of water from the Jammu Tawi River will enter the Chenab River from Marala. The administration of Sialkot and Gujarat has been instructed to remain alert. Immediate evacuation of citizens from the banks of the river is being ensured.”\n\nThe minister said that so far, more than 17,000 citizens had been shifted to safer places from the river banks and 26 flood relief camps had been established for the convenience of citizens.\n\nSpeaking on this occasion, Malik Muhammad Ahmed Khan said all citizens from the Sutlej area around Ganda Singhwala should be safely shifted to safe places. Evacuation of the populations located in the Ravi and Sutlej river basins was being ensured while all resources were being used to protect the citizens in the affected areas.\n\nPDMA DG Irfan Ali Kathia said awareness was being provided to the population along the rivers in view of the possible danger while the citizens living in dilapidated buildings were also being shifted to safe places.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab8e458eb45.gif",
  "retrievedAt": "2025-08-25T13:32:04.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937000/evacuated-villagers-in-kasur-reluctant-to-stay-in-flood-relief-camps",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:30.000Z"
}
