{
  "title": "Sinner starts title defence at US Open, Swiatek and Gauff in action - Sport - DAWN.COM",
  "author": null,
  "content": "The US Open’s first round continues on Tuesday, with men’s top seed Jannik Sinner beginning his title defence, while Iga Swiatek and Coco Gauff launch their bids to dethrone women’s defending champion Aryna Sabalenka.\n\nIt has been over 13 months since a men’s Grand Slam final took place without Jannik Sinner. The Italian has since won three out of four majors, and is favourite to defend his title at Flushing Meadows.\n\nThe 24-year-old’s rivalry with world number two Carlos Alcaraz, whom he faced in the last two slam finals, is now a major storyline in the game.\n\nIn last week’s Cincinnati Open final, they met again, and an uncomfortable Sinner retired due to illness after 23 minutes, trailing 5-0.\n\nSinner said on Friday he was fit for the US Open, but his health is still a concern ahead of the world number one’s first-round clash with Kopriva.\n\n“At the moment, me and Carlos, we are sharing big trophies, but at the same time, things can change … you never know,” Sinner told reporters.\n\n“There are great, great players out there … the way to the final, it’s very difficult to get there.”\n\nMeanwhile, world number two Iga Swiatek has had a good year despite failing to win a fourth straight French Open title, reaching the two Grand Slams semi-finals before winning Wimbledon to add a sixth major to her trophy cabinet.\n\nThe 24-year-old Pole won the Cincinnati Open and although known as the “Queen of Clay” for her dominance at Roland Garros, most of Swiatek’s WTA titles have been won on hard courts.\n\n“For sure, I feel really a positive vibe after this tournament, because in Cincinnati I feel like my tennis really progressed match by match,” Swiatek said.\n\n“Honestly, I already think it doesn’t make sense to call anyone the favourite. Women’s tennis, I wouldn’t say it’s unpredictable because there are some girls that are constantly in the top … but there are many players that play really good and can win the tournament.”\n\nArango, a US Open main draw debutant, reached the final of the Merida Open in March, which she lost to Emma Navarro.\n\nCoco Gauff won the French Open in June despite her struggles on serve, as she leads the Tour for most double faults this season.\n\nThe 21-year-old served nine double faults during her shock first-round exit at Wimbledon and she collected another 16 during her loss to Jasmine Paolini at the Cincinnati Open.\n\nGauff split with her coach, Matthew Daly, days before the US Open and hired Gavin MacMillan, Sabalenka’s former serving coach.\n\n“It was a very sudden decision. Gavin became available. I just felt this was the best decision for my game, at least, and I had to go with what I was feeling,” world number three Gauff said.\n\nGauff won her first major at the 2023 US Open, and two years on, the world number three believes she is nearly back to her best.\n\n“I’m obsessed with the process of getting better. Yeah, sometimes maybe it hurts because I get obsessed with it too much,” she said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T11:19:29.910Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937172/sinner-starts-title-defence-at-us-open-swiatek-and-gauff-in-action",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T18:47:20.000Z"
}
