{
  "title": "Trump may deploy National Guard troops in Chicago - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The Trump administration has been planning for weeks to deploy National Guard troops in Chicago as part of an expanded crackdown on crime and immigration, according to reports in US media.\n\nThe Pentagon has been sketching out plans that could mobilise several thousand National Guard members to the nation’s third-largest city as early as September, The Washington Post reported, quoting unidentified officials familiar with the matter.\n\nThe Pentagon refused to confirm the reports. “We won’t speculate on further operations,” a defense official said.\n\n“The Department is a planning organisation and is continuously working with other agency partners on plans to protect federal assets and personnel,” the official said on condition of anonymity.\n\nPresident vows to make Democrat-led cities ‘very, very safe’ as mayor rejects idea\n\nThe reports come after President Donald Trump deployed National Guard troops this month in the capital Washington, DC, where another defense official said personnel would soon be carrying weapons.\n\nTrump said on Friday that Chicago and New York — major Democrat-led cities — were set to receive similar treatment.\n\n“We’re going to make our cities very, very safe,” Trump told reporters at the White House. “I think Chicago will be our next and then we’ll help with New York.” The potential deployment in Chicago would follow a similar pattern to Trump’s controversial June operation in Los Angeles, where he sent 4,000 California National Guard members and 700 active-duty Marines over state objections, unidentified sources told CNN.\n\nIt would also complement the expanded Immigration and Customs Enforcement crackdown targeting undocumented migrants.\n\nChicago mayor reacts\n\nIllinois Governor JB Pritzker and Chicago Mayor Brandon Johnson, both Democrats, strongly rejected the idea.\n\n“Donald Trump and MAGA Republicans are trying to paint their party as one of ‘law and order,’” Pritzker posted on social media platform X.\n\n“That couldn’t be further from the truth.” Pritzker said in remarks reported by WBEZ Chicago that “public safety is under attack by the Trump administration.”\n\nJohnson said the city had received no formal communication from Trump’s administration about military deployments, calling such action “uncoordinated, uncalled for, and unsound.” Chicago recorded 573 homicides in 2024, according to the city’s police, eight per cent lower than the year before.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/25091633990abeb.webp",
  "retrievedAt": "2025-08-25T13:32:23.035Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936963/trump-may-deploy-national-guard-troops-in-chicago",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:29:52.000Z"
}
