{
  "title": "Fitch maintains its rating on India, citing strong growth - Business - DAWN.COM",
  "author": null,
  "content": "Credit-rating firm Fitch on Monday maintained its long-term foreign-currency issuer default rating on India at ‘BBB-’, citing the country’s strong economic growth and resilient external finances.\n\n“India’s economic outlook remains strong relative to peers, even as momentum has moderated in the past two years,” Fitch said in a statement.\n\nThe agency forecast GDP growth of 6.5 per cent for the fiscal year ending March 2026 (FY26), unchanged from FY25, and well above the ‘BBB’ median of 2.5pc.\n\nFitch’s rating comes days after S&P Global Ratings lifted its sovereign credit rating on India, citing strong economic growth, marking its first upgrade in 18 years.\n\nEconomic Affairs Secretary Anuradha Thakur had then said she expects other rating agencies to take note of the factors behind S&P’s upgrade and follow suit.\n\nDomestic demand will remain “solid”, helped by the government’s ongoing capital spending drive and steady private consumption, Fitch said, but flagged that private investment will remain moderate due to risks from US tariffs.\n\nUS President Donald Trump has threatened to double tariffs on Indian goods to 50pc — among the highest rates imposed on Washington’s trade partners — targeting India’s oil purchases from Russia. The 50pc tariffs are set to kick in from August 27.\n\n“US tariffs are a moderate downside risk to our forecast,” Fitch said, adding that they will reduce India’s ability to benefit from supply chain shifts out of China if tariff levels fail to be negotiated lower.\n\n“Proposed goods and services tax (GST) reforms, if adopted, would support consumption, offsetting some of these growth risks,” Fitch added, referring to the tax restructuring promises made by Indian Prime Minister Narendra Modi earlier this month.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:48.334Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937109/fitch-maintains-its-rating-on-india-citing-strong-growth",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T09:07:40.000Z"
}
