{
  "title": "Quetta moves to tackle alarming water shortage - Newspaper - DAWN.COM",
  "author": null,
  "content": "QUETTA: A high-level meeting chaired by Quetta Division Commissioner Shahzeb Khan Kakar decided on Sunday to immediately disconnect illegal and multiple water connections, regulate private water suppliers and ensure car wash stations, livestock farms, tanneries and marble factories use treated water, as the city grapples with an escalating water crisis.\n\nThe meeting, attended by the chief engineers of Wasa and the Irrigation Department, as well as representatives of the Pakistan Red Crescent and other officials, reviewed the worsening shortage of clean drinking water in the provincial capital.\n\nOfficials briefed the meeting that underground water levels in Quetta had dropped to alarming depths due to over-extraction and wasteful consumption.\n\nThey proposed several measures, including introducing a metering system, reviving traditional karez channels, installing rooftop rainwater harvesting systems in government buildings, sealing illegal tube wells and establishing recharge points to replenish groundwater.\n\nCommissioner Kakar described Quetta’s water shortage as a “dangerous stage” requiring urgent intervention. He stressed the need for a comprehensive water policy to guarantee the supply of clean water while curbing misuse. He also urged public awareness campaigns to encourage responsible consumption.\n\nIllegal connections to be cut, private suppliers to be regulated\n\nHe warned that strict action would be taken against those involved in illegal water extraction and directed Wasa to repair damaged pipelines without delay. Legal measures would also be enforced against those found wasting water.\n\n“Water survival depends on our collective responsibility,” he emphasised, urging citizens, institutions and authorities to play their part in conserving the resource.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:54.210Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937044",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:29:58.000Z"
}
