{
  "title": "SpaceX postpones Starship test flight over ground system issue - World - DAWN.COM",
  "author": null,
  "content": "Elon Musk’s SpaceX on Sunday called off the launch of Starship’s tenth mission from Texas over an issue at its launch site, delaying an attempt to achieve several long-sought development milestones missed due to past tests ending in early failures.\n\nThe 70.7-metre-tall Super Heavy booster and its 52m-tall Starship upper half sat stacked on a launch mount at SpaceX’s Starbase rocket facilities as it was being filled with propellant ahead of a liftoff time of 7:35pm ET (4:35am PKT).\n\nBut roughly 30 minutes from liftoff, SpaceX said on X that it was standing down to allow time to troubleshoot an issue with ground systems.\n\nMusk had been poised to provide an update on Starship’s development progress prior to the rocket’s launch on Sunday, but a placeholder live stream indicated it had been cancelled.\n\nSimilar postponements in the past have been resolved in a matter of days. SpaceX is now targeting as soon as Monday, August 25, for Starship’s next launch attempt, according to its website.\n\nDevelopment of SpaceX’s next-generation rocket, the centre of the company’s powerful launch business future and Musk’s Mars ambitions, has faced repeated hiccups this year.\n\nTwo Starship testing failures early in flight, another failure in space on its ninth flight and a massive test stand explosion in June that sent debris flying into nearby Mexican territory have tested SpaceX’s test-to-failure development approach.\n\nStill, the company has continued to swiftly produce new Starships for test flights at its sprawling Starbase production facilities. Nasa hopes to use the rocket as soon as 2027 for its first crewed moon landing since the Apollo programme.\n\nThe setbacks underscore the technical complexities of Starship’s latest iteration, packed with far more capabilities such as increased thrust, a potentially more resilient heat shield and stronger steering flaps crucial to nailing its atmospheric reentry — key traits for Starship’s rapid reusability that Musk has long pushed for.\n\nThe stacked system had been expected to blast off from Texas around sunset on Sunday before its Starship upper stage separated from the Super Heavy booster dozens of miles in altitude. Super Heavy, which has returned for a landing at its launch pad in giant mechanical arms in past tests, would have instead targeted the Gulf of Mexico for a soft water landing in order to test a backup engine configuration.\n\nStarship was to briefly ignite its own engines to blast further into space, where it would have attempted to release its first batch of mock Starlink satellites and reignite an engine while on a suborbital path around the planet.\n\nAfter that phase, the ship targets an atmospheric reentry over the Indian Ocean, a crucial flight phase that tests a variety of prototypical heat shield tiles and engine flaps designed to endure a barrage of blazing heat that has largely shredded the rocket’s exterior during past flights.\n\n“Starship’s reentry profile is designed to intentionally stress the structural limits of the upper stage’s rear flaps while at the point of maximum entry dynamic pressure,” SpaceX said on its website.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/25185414cca76e1.webp",
  "retrievedAt": "2025-08-26T11:19:30.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937146/spacex-postpones-starship-test-flight-over-ground-system-issue",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T14:05:13.000Z"
}
