{
  "title": "FO confirms India’s flood warnings, notes use of diplomatic channel over IWC - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Foreign Office on Monday said India had shared flood warnings with Pakistan but stressed that the alerts were routed through diplomatic channels rather than the Indus Waters Commission, as stipulated under the Indus Waters Treaty (IWT).\n\nIndia in April held the IWT in abeyance following the attack in occupied Kashmir’s Pahalgam that killed 26 — an incident New Delhi blamed on Islamabad without evidence. Pakistan termed any attempt to suspend its water share an “act of war”, noting the IWT had no provision for unilateral suspension.\n\nUnder paragraph 8 of Article IV of the IWT, “each party agrees to communicate to the other party, as far in advance as practicable, any information it may have in regard to such extraordinary discharges of water from reservoirs and flood flows as may affect the other party”.\n\nPunjab is on high alert for floods before the arrival of a fresh monsoon spell as the provincial government on Saturday evacuated thousands of people along the Sutlej River, as the river surged to a high flood level at Ganda Singh Wala, recording a dangerous flow of 129,866 cusecs.\n\nAmid the situation, a missive on Sunday from the Indian High Commission in Islamabad, a copy of which is available with Dawn.com, notified the government of a high flood in Jammu’s Tawi River that flows into the Chenab River.\n\nConfirming the development today, FO Spokesperson Shahfqat Ali Khan said: “On August 24, 2025, India communicated flood warnings through diplomatic channels, rather than through the IWC as required under the IWT.\n\n“We reaffirm that India is obligated to fully comply with all provisions of the treaty. India’s unilateral declaration to hold the treaty in abeyance constitutes a serious violation of international law and could have significant negative consequences for peace and stability in South Asia.”\n\nAn Indian government source told Reuters today that the country shared the warning on possible cross-border flooding on “humanitarian grounds” and not under the IWT.\n\nThe Indian High Commission in Islamabad shared the warning following heavy rains in occupied Kashmir, the source said. India’s foreign ministry did not immediately respond to a request for comment.\n\nThe source declined to be named as they are not authorised to speak to the media.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:45.490Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937121/fo-confirms-indias-flood-warnings-notes-use-of-diplomatic-channel-over-iwc",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T11:50:30.000Z"
}
