{
  "title": "Mandated morality — the problem with the CSR Bill - Business - DAWN.COM",
  "author": null,
  "content": "What happens when social behaviours become economic policy?\n\nAccording to a Harvard study, when social markets move into the economic realm, people stop acting altruistically and begin engaging in cost-benefit analysis. In one experiment, when parents were fined for picking up their children late from daycare, tardiness ironically increased — and remained high even after fines were discontinued.\n\nThis phenomenon suggests that monetary incentives corrupt social motivations permanently, further turning genuine acts of goodwill into mechanical obligations. As Pakistan debates making Corporate Social Responsibility (CSR) mandatory by law, it is worth asking: will mandating philanthropy eradicate its sincerity?\n\nProposed in February 2025, the CSR Bill emphasises the integration of social and environmental initiatives into corporate governance. It calls on the private sector to contribute to the welfare of the underprivileged and address environmental challenges — particularly urgent given Pakistan’s climate crisis. With the country’s Sustainable Development Goals (SDG) index dropping to 57.02 and its global ranking falling to 137 out of 166 countries, the country’s situation is worrying.\n\nHowever, Pakistan’s failure can be attributed to a combination of deep-rooted political and structural challenges. Long-term planning is frequently derailed by power struggles and unstable tenures in government. Moreover, Pakistan has yet to meaningfully integrate the SDGs into its national development agenda despite long-standing plans by the Planning Commission and the Ministry of Planning & Development.\n\nThe 18th Amendment has further complicated matters, leading to policy overlaps and conflicts between the provincial and federal governments. Corruption, red tape, and bureaucratic inefficiency continue to erode public trust and the impact of development spending.\n\nBy proposing a one-size-fits-all obligation, the government risks alienating the very actors it hopes to mobilise\n\nThe CSR Bill aims to move Pakistan toward greater welfare — but it may be a step off the cliff. By proposing to impose a one-size-fits-all obligation without acknowledging existing corporate initiatives, the government risks alienating the very actors it hopes to mobilise. Rather than fostering collaboration, it could deepen the regulatory divide and reduce the chance for meaningful private-public partnerships.\n\nBy suggesting the imposition of a flat one per cent of net profits companies must allocate to CSR spending, this bill may place financial pressure on low-margin sectors. Additionally, quarterly reporting and mandatory committees will add not only to the corporate administrative burden but also increase bureaucratic overhead for the state. With an already overtaxed private sector and a country that significantly falls behind on the ease-of-doing-business scale, the government continues to make business activities cumbersome, ultimately steering away foreign investment and economic growth.\n\nPakistan may look to India — as it is the only other country in the world to make CSR spending mandatory for firms of certain size and profitability — as a model. But how effective has this approach been? Research on India’s mandated CSR showed that voluntary spenders reduced their CSR spending after the regulations were implemented.\n\nMany firms came to view the policy as a form of ‘triple taxation’: first on profits, then on dividends, and now through enforced post-tax CSR spending. Similarly, the new mandate had multiplier effects as firms had to bear additional evaluation and monitoring costs. Firms no longer turned to CSR for brand or reputation building but now perceived it as a quasi-tax that destroyed the firm’s value. Given its limited success, both the effectiveness of India’s CSR mandate and the rationale behind such top-down policymaking have come under increasing scrutiny.\n\nMany multinational and local firms in Pakistan — such as the banking, telecom, and fast-moving consumer goods sectors — already engage in CSR spending voluntarily.\n\nGlobally, Unilever, for example, has committed to investing 1 billion in meaningful climate, nature, and resource efficiency projects. Swiss multinational food giant Nestlé S.A. has committed Rs2bn in renewable energy initiatives under its sustainability efforts in Pakistan. Similarly, Engro Corp in Pakistan has spent roughly 2pc of its cumulative profits over the past three years. A flat mandated approach could also then penalise genuine, high-efficiency actors.\n\nEven though the concept of CSR is not foreign to Pakistan, it is understandable that the state seeks alternative revenue streams for welfare in a country with a low tax-to-GDP ratio. But coercion is not the solution — it rarely ever has been.\n\nUnder the guise of an additional regulatory requirement, the government appears to shift its responsibility of social welfare onto the private sector — making taxpayers question where exactly their own contributions are going. Instead of an additional burden, the private sector can instead be urged to embed the United Nations’ SDG framework into its operations, which many are already doing.\n\nMany companies are already engaged in philanthropic work, but the government can benefit from encouraging them to record, report, and connect their efforts to broader developmental goals. Together, the private sector and public sector can align their projects for meaningful impact.\n\nCSR can be a powerful tool for social good — but only when it is collaborative, not coercive. Regulating charity without securing the foundations of governance and business structure risks undermining both trust and impact. Mandating morality may tick boxes — but it may fail to build a better Pakistan.\n\nThe writer is an economics undergraduate student at the Lahore University of Management Sciences\n\nPublished in Dawn, The Business and Finance Weekly, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab87dcb8f4c.gif",
  "retrievedAt": "2025-08-25T13:32:12.837Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936972/mandated-morality-the-problem-with-the-csr-bill",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:06.000Z"
}
