{
  "title": "Top official replaced amid controversy over KP gas field award - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government has removed a senior petroleum division official on orders from the PM Office, following a controversy involving the award of a majority government-owned gas field to third party, sources told Dawn.\n\nDirector General Petroleum Concessions Kashif Ali, a grade 20 officer, has been transferred to the administration/policy wing of the petroleum division.\n\nIn his stead, Imran Ahmad, who currently serves as director general (oil), has been given ‘look after charge’ of this post, in addition to his existing responsibilities.\n\nThe removal comes as a deal neared finalisation to allow gas to flow from a majority government-owned field in Kohat to a private party through a negotiated sale, a process that has drawn scrutiny from multiple government bodies and private stakeholders.\n\nPetroleum division had cleared the transfer of govt-owned gas field to third party despite objections from KP govt\n\nThe petroleum division had cleared the allotment of the field, but gas flows had yet to begin, pending the completion of third-party access (TPA) procedures.\n\nIn the meantime, behind-the-scenes scrutiny took its due course and reached the table of a top government office holder, on whose directives action was ordered against the official in charge of petroleum concessions.\n\nHowever, insiders suggested that Mr Ali could be a “scapegoat”, as many others in the administrative and political chain, including some seniors, had survived immediate axing, but may be held accountable once the due process was completed.\n\nThe matter has also come up on the radar of the Special Investment Facilitation Council (SIFC), which has noted delays in the submission of a TPA framework and a lack of sufficient data on the matter.\n\nDawn sent written queries to all public sector stakeholders, including petroleum secretary Momin Agha and the managing directors of the Oil and Gas Development Company, Pakistan Petroleum Limited and Government Holdings Pvt Ltd, but did not receive a response.\n\nConcerns over the proposed sale of gas from a new gas field in Kohat without bidding were first raised in January by the PM Office and the Khyber Pakhtunkhwa government.\n\nMian Nasim Javed, KP’s director in the Directorate General of Petroleum Concessions, had formally objected to the process in writing.\n\n“The process being adopted is a clear departure from the decision taken by the Council of Common Interests…which envisages a competitive process for the sale of gas to third parties and also stipulates that provincial rights under Article 158 should be protected in letter and spirit,” he wrote.\n\nMr Javed made it clear that “any arrangement which goes against the aforementioned Article of the Constitution and the decision of CCI will not be acceptable to the Government of Khyber Pakhtunkhwa”.\n\nOther private gas companies also protested the negotiated deal, arguing that a natural resource in which SOEs hold a majority 65 per cent stake could not be legally sold to a third party without competitive bidding and that they were ready to offer a higher price.\n\nPakistan Oilfields Limited (POL), a private joint venture partner with a 25pc share in the field, has also voiced its concerns.\n\nIn a written complaint to its partners, the company said it was “unfair to have been kept in dark over the negotiations or the concluded terms” and demanded a “competitive bidding process”.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:54.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937039",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:29:58.000Z"
}
