{
  "title": "Two FC personnel martyred, 18 injured in Hangu terrorist attack: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least two Federal Constabulary (FC) personnel were martyred and 18 others were injured in a terrorist attack in Khyber Pakhtunkhwa’s Hangu district, police said on Monday.\n\nKohat Regional Police Officer Abbas Majeed confirmed the incident to Dawn.com, saying that terrorists attacked an FC fort in the Torah Wadi area of ​​Doaba. “The terrorist fired and martyred two FC personnel and injured 18 others,” he said.\n\nThe officer said that the FC soldiers retaliated to the attack, “resulting in the death of six terrorists”. He added, “The terrorists managed to escape with the bodies of their accomplices.”\n\nHe also said that the martyred and injured personnel were taken to CMH Hospital after being provided with first aid.\n\nMeanwhile, Interior Minister Mohsin Naqvi condemned the terrorist attack on the Federal Reserve Police fort in Hangu by Fitna al Hindustan, state media APP reported.\n\nIn May, the government designated all terrorist organisations in Balochistan as Fitna al Hindu­stan — a new phrase aimed at framing India’s alleged role in terrorism as a deliberate destabilisation strategy, potentially to galvanise domestic support.\n\nIn a statement today, Naqvi paid tribute to the FC personnel “who embraced martyrdom while bravely resisting the assault” and directed authorities to ensure the best medical treatment for the injured personnel.\n\n“The brave officers of the Federal Reserve Police [the term used for FC personnel] sacrificed their lives to foil the attack of India-sponsored terrorists,” Naqvi was quoted as saying. “The sacrifices of our martyrs will never go in vain.“\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the proscribed Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.\n\nRecent terrorist attacks have predominantly targeted the police, law enforcement agencies’ personnel and security forces. In response, the state has also intensified its counterterrorism operations.\n\nEarlier this month, five cops were martyred and another eight left injured as militants attacked police checkpoints at different locations across KP, including Peshawar, Upper Dir and Lower Dir.\n\nLast month, nine terrorists were killed and three security officers were injured in an exchange of fire during an operation in Hangu.\n\nThree “wanted terrorists” were killed during a joint operation between the regional police and the Counter Terrorism Department in KP’s Bannu district on the night of July 16.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:31:45.431Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937112/two-fc-personnel-martyred-18-injured-in-hangu-terrorist-attack-police",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T10:50:09.000Z"
}
