{
  "title": "Karachi citizens face water shortage as Wapda repairs damaged Hub Canal - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A critical water crisis hit the city on Sunday when emergency repairs to the Hub Canal slashed Karachi’s water supply from Hub Dam by a staggering 60 per cent, plunging millions into a severe shortage.\n\nFollowing the recent heavy monsoon rains, “significant erosion and damage” have been reported in the Hub Canal within the jurisdiction of the Water and Power Development Authority (Wapda), said a statement issued by the Karachi Water and Sewerage Corporation (KWSC).\n\nAccording to KWSC officials, the recent damage to the Hub Canal did not occur in the old or new Hub Canal. Instead, the damage took place in an eight-kilometre stretch that falls under the jurisdiction of Wapda.\n\nThey said that the section is managed entirely by Wapda, and after this stretch, the canal connects to the section overseen by the KWSC. The point where the canal transitions from Wapda to KWSC control is known as the “Zero Point,” they said.\n\nIn an urgent move to prevent further destruction, the statement said that Wapda has drastically reduced the flow from the dam, sending shockwaves across the city’s water distribution system.\n\nKWSC says city receives only 40 MGD instead of 100 MGD from Hub Dam\n\n“Karachi is currently receiving only 40 million gallons per day (MGD) from the Hub Dam, down from the usual 100 MGD,” the KWSC statement confirmed while quoting the chief engineer of bulk.\n\nThis sharp drop in supply is already being felt across the western, central, and Keamari districts, where taps have started to run dry. Residents are bracing for extended hours without water as the city struggles to cope.\n\nAlthough the emergency repair work was expected to be completed by 4pm on Sunday, the water supply is unlikely to return to normal immediately.\n\n“The repairs are expected to take until 4pm on Sunday, though it takes around 12 hours for water to travel from the dam to the Hub Pumping Station,” said the KWSC statement, confirming delays to any immediate relief while urging the public to act responsibly.\n\n“We apologise for the inconvenience and urge citizens to use water sparingly. All available resources are being deployed to expedite the restoration process,” said the KWSC chief engineer.\n\nMQM-P pins blame on Sindh govt, KWSC\n\nAs the city reels under the water shortage due to emergency repairs at the Hub Canal, political tempers have flared. Senior MQM-Pakistan leader and Member of the National Assembly, Syed Aminul Haque, launched a scathing attack on the Sindh government and KWSC, accusing them of “criminal negligence” and “systemic corruption” that has left citizens “thirsting for every drop.”\n\nIn a strongly worded statement, Mr Haque alleged that despite the much-publicised 100 MGD Hub Canal water supply project, the water board has failed to deliver water to large swathes of the city.\n\n“The people in Orangi Town, Surjani Town, Baldia Town, Keamari, Korangi, Landhi, North Karachi, Malir, and Shah Faisal Colony are struggling without water,” he said.\n\nHe further accused the Pakistan Peoples Party (PPP) and the Sindh government of growing mismanagement.\n\n“Their incompetence has written a new chapter of urban failure. Even after the recent rains, areas like Orangi remain submerged in sewage water,” he said.\n\nThe MQM leader also criticised Jamaat-i-Islami, saying their role has been limited to slogans without action.\n\n“Drainage and sanitation projects exist only on paper. Central Karachi and other districts flood every time it rains,” he added.\n\nThe MQM-P leader demanded immediate, practical solutions and accountability.\n\n“People pay taxes, but receive garbage, sewage, and broken promises in return. Karachi needs action, not speeches,” he said.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab91c50c66e.gif",
  "retrievedAt": "2025-08-25T13:32:09.396Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937011/karachi-citizens-face-water-shortage-as-wapda-repairs-damaged-hub-canal",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:24.000Z"
}
