{
  "title": "Afghanistan name spin-heavy T20 squad for tri-series, Asia Cup - Sport - DAWN.COM",
  "author": null,
  "content": "KABUL: Fast-rising Afghanistan announced a spin-heavy squad on Sunday led by Rashid Khan for the T20 tri-series and Asia Cup to be played in the United Arab Emirates.\n\nAlong with Rashid, Afghanistan will have Noor Ahmad, Mujeeb Ur Rahman, AM Ghazanfar and Mohammad Nabi in the spin department as they play their first Twenty20 Internationals this year.\n\nThe tri-series, also involving Pakistan and hosts the UAE, starts in Sharjah on Friday, while the six-nation Asia Cup begins on Sept 9.\n\nThe 19-year-old Ghazanfar has yet to play a T20I but has made rapid strides in domestic matches in that format and ODIs.\n\nAfghanistan lost in the semi-finals at last year’s men’s T20I World Cup in the US and West Indies but have not played a single T20I since the start of 2025.\n\nFazlhaq Farooqi, Naveen-ul-Haq, Azmatullah Omarzai and Gulbadin Naib are the fast-bowling options.\n\nAfghanistan face Pakistan in the opening match of the tri-series on Friday.\n\nFor the Asia Cup, Afghanistan are drawn in Group ‘B’ with Bangladesh, Hong Kong and Sri Lanka while defending champions India, Oman, Pakistan and UAE are in Group ‘A’.\n\nAfghanistan face Hong Kong in the opening match of the Asia Cup in Abu Dhabi on Sept 9.\n\nAfghanistan also announced a series of three one-day internationals and three T20Is with Bangladesh after the Asia Cup, also in the UAE.\n\nThe T20Is are on Oct 2, 3 and 5 in Sharjah, while the ODIs will be played from 8-14 in Abu Dhabi.\n\nSquad: Rashid Khan (captain), Rahmanullah Gurbaz, Ibrahim Zadran, Darwish Rasooli, Sediqullah Atal, Azmatullah Omarzai, Karim Janat, Mohammad Nabi, Gulbadin Naib, Sharafuddin Ashraf, Mohammad Ishaq, Mujeeb Ur Rahman, AM Ghazanfar, Noor Ahmad, Fareed Ahmad, Naveen-ul-Haq, Fazalhaq Farooqi.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:53:09.169Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937018/afghanistan-name-spin-heavy-t20-squad-for-tri-series-asia-cup",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:12.000Z"
}
