{
  "title": "Fatima Sana to lead women’s side as PCB announces 15-member squad for ICC World Cup - Sport - DAWN.COM",
  "author": null,
  "content": "Fatima Sana will lead the women’s side in the upcoming ICC Women’s World Cup as the Pakistan Cricket Board (PCB) on Monday announced a 15-member squad for the tournament set to take place in India and Sri Lanka in September.\n\nPakistan will play all their matches of the 50-over World Cup in Sri Lanka’s capital Colombo when India hosts this year’s tournament from Sept 30 to November 2. Following India’s refusal to travel to Pakistan for the Champions Trophy earlier this year, a “hybrid model” was decided upon whereby India would play all its matches in Dubai, chosen as a neutral venue.\n\nThe women’s national selection committee named the squad for the tournament, and announced that the same squad will also feature in a three-match ODI series against South Africa, scheduled at the Gaddafi Stadium in Lahore from Sept 16-22.\n\n“Uncapped right-handed batter Eyman Fatima, who recently made her T20I debut against Ireland, is part of the ODI squad,” PCB said.\n\n“Fatima Sana, who represented Pakistan in the previous edition of ICC Women’s Cricket World Cup, will lead the side for the first time in the mega event,” it added.\n\nThe 23-year-old had previously captained the side in the ICC Women’s CWC Qualifier held in Lahore this year, where the team maintained a 100 per cent win record to secure qualification for this year’s ICC Women’s Cricket World Cup set to take place in India and Sri Lanka, the statement added.\n\nSix players are set to feature in their maiden ODI World Cup, namely: Natalia Parvaiz (8 ODIs, 24T20Is), Rameen Shamim (8 ODIs, 11 T20Is), Sadaf Shamas (15 ODIs, 12 T20Is), Sadia Iqbal (27 ODIs, 50 T20Is), Shawaal Zulfiqar (3 ODIs, 9 T20Is) and Syeda Aroob Shah (2 ODIs, 15 T20Is).\n\nMoreover, 21-year-old Aroob, 20-year-old Shawaal alongside 20-year-old Eyman featured for Pakistan in the inaugural edition of ICC Women’s U19 T20 World Cup held in South Africa in January 2023.\n\n“Additionally, two changes have been made from the 15-member squad that featured in the ICC Women’s CWC Qualifier,” PCB said.\n\n“Eyman and Sadaf come into the squad in place of Gull Feroza and Najiha Alvi, who have been named in the five-member non-travelling reserves alongside Tuba Hassan, Umm-e-Hani and Waheeda Akhtar.”\n\nThe 15 players alongside five reserves players will take part in a 14-day pre-South Africa series camp from August 29. “The players under the coaching staff led by Muhammad Wasim will undergo practice sessions as well as 50-over practice matches.”\n\nSouth Africa women’s cricket team will arrive in Lahore on Sept 12.\n\nPakistan became the fourth side to announce their squad after Bangladesh, England and India announced their squads earlier this month.\n\n15-member squad:\n\nFatima Sana (captain), Muneeba Ali Siddiqui (vice-captain), Aliya Riaz, Diana Baig, Eyman Fatima, Nashra Sundhu, Natalia Parvaiz, Omaima Sohail, Rameen Shamim, Sadaf Shamas, Sadia Iqbal, Shawaal Zulfiqar, Sidra Amin, Sidra Nawaz (wicket-keeper) and Syeda Aroob Shah.\n\nNon-traveling reserves:\n\nGull Feroza, Najiha Alvi, Tuba Hassan, Umm-e-Hani and Waheeda Akhtar.\n\nPlayer support personnel:\n\nHina Munawar (manager), Muhammad Wasim (head coach), Junaid Khan (assistant coach bowling), Tahir Khan (assistant coach bowling), Abdul Saad (fielding coach), Muhammad Rafi Ullah (media manager), Muhammad Asfand Yar (strength and conditioning coach), Waleed Ahmed (analyst), Tehreem Sumbal (physiotherapist), Kiran Shahzadi (masseuse) and team doctor (tbc).\n\nPakistan v South Africa women series (all matches at Gaddafi Stadium)\n\nSept 16: First ODI\n\nSept 19: Second ODI\n\nSept 22: Third ODI\n\nPakistan team fixtures in Women’s World Cup (All matches at R. Premadasa ICS, Colombo; All matches to begin at 3pm local time)\n\nOct 2 — vs Bangladesh\n\nOct 5 — vs India\n\nOct 8 — vs Australia\n\nOct 15 — vs England\n\nOct 18 — vs New Zealand\n\nOct 21 — vs South Africa\n\nOct 24 — vs Sri Lanka",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/251112132675dea.webp",
  "retrievedAt": "2025-08-25T13:31:52.915Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937081/fatima-sana-to-lead-womens-side-as-pcb-announces-15-member-squad-for-icc-world-cup",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T05:40:57.000Z"
}
