{
  "title": "Hotelier booked after two girls die of ‘toxic’ food intake in Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Sattokatla police lodged a case against the owner of a restaurant after the death of two minor girls who had taken ‘toxic’ food from the outlet.\n\nA first information report was registered on the complaint of Azeem Ahmad who alleged that his two minor girls Tehreem (6) and Irha (4) had gone to the hotel on PIA Road some two days back where the staff served them ‘toxic’ food.\n\nHe said as they returned home, the condition of both of them got critical and were rushed to a local hospital where they were admitted for critical care.\n\nDuring treatment, he said, it transpired that his girls had a ‘toxic’ food from the hotel on PIA Road.\n\nAfter some time, both of them expired, Azeem said alleging that they died of adulterated food provided by the hotel’s staff.\n\nCCD: Two more suspects were allegedly shot dead in an ‘encounter’ with the Crime Control Department (CCD) in Nishtar Colony area.\n\nThe police claimed that the CCD police team was taking the suspects, the hardened criminals, including Naveed and Salman for the purpose of recovery.\n\nAs they reached Ashiana Road, the accomplices of the arrested suspects attacked and opened fire on the police which led to an armed clash between the two sides for 10 minutes or so.\n\nA police official claimed that as the guns went silent, they found the both suspects killed ‘by the firing of their own accomplices.’\n\nHe further claimed that a police constable also got bullet injuries in his arm and he was shifted to a local hospital for treatment.\n\nThe CCD Kahna lodged an FIR against the attackers and launched raids for their arrests, the police official said.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:32:04.293Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936998/hotelier-booked-after-two-girls-die-of-toxic-food-intake-in-lahore",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:31.000Z"
}
