{
  "title": "Swat residents reel under the rigours of flood devastation - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWAT: In the aftermath of the last week’s devastating flash floods, residents of Mingora and adjoining localities are struggling to reclaim their lives, with many spending nights on rooftops and days shoveling mud from their wrecked homes.\n\nLocalities including Landaykas, Bangladesh, Makanbagh and Mulababa remain caked in thick layers of mud and debris, leaving streets unrecognisable and homes uninhabitable. Furniture lies overturned, cooking utensils are buried, and a pungent smell of damp earth hangs in the air.\n\n“Our homes are unrecognisable,” lamented Muhammad Riaz, a resident of Landaykas. “We spend the entire day clearing mud, but by evening it feels like nothing has been achieved. At night, we sleep on the roof with our children because inside, there is only filth.”\n\nWomen and children have largely been sent to stay with relatives, while men remain behind to clean the wreckage. “We shifted our families to safer places. Now it is just us men here, working day and night to clean what is left of our homes,” said Gulzar Khan of Mulababa.\n\nThe residents also voiced frustration over the lack of government support. “Our streets are full of mud and water, but no machinery has come to help us. The children are falling sick—skin infections, diarrhoea, and fevers are spreading. We need urgent help,” said Shahida Bibi of Makanbagh.\n\nThe human and economic toll of the disaster is immense. Years of savings vanished as household belongings including beds, cupboards, carpets and stoves, were ruined within hours. “Everything we owned is gone,” said Abdul Mateen of Bangladesh locality.\n\nDespite the despair, signs of solidarity are visible. Volunteers from across Swat, including mosque committees and youth groups, have joined clean-up efforts. “These are our people. Today it’s them; tomorrow it could be us. We must stand together,” said Usman, a young volunteer, whose clothes and body were covered with mud as he was in relief work throughout the day.\n\nAccording to the initial damage assessment by the Malakand commissioner office, torrential rains and flash floods during August claimed at least 20 lives in Swat, injuring two others. The floods fully destroyed 67 houses and partially damaged 1,849 more. Only 1,075 homes have so far been cleared of debris.\n\nInfrastructure has also suffered heavily. Around 42 kilometres of roads were washed away, while just 12 kilometres have been reopened. Four bridges collapsed, while restoration is under way. In agriculture, 27,348 kanals of cultivated land was destroyed and 487 cattle perished, aggravating the hardships of already struggling families.\n\nThe education sector saw 128 schools partially damaged, while five health facilities were left in poor shape. Power supply was cut off after 10 feeders and 92 electric poles were washed away; so far, five feeders and 35 poles have been restored. Commercial losses were also severe, with 343 shops damaged and 76 vehicles swept away.\n\nThe authorities have described the situation as dire, urging both provincial and federal governments to expedite relief and rehabilitation efforts.\n\nFor now, however, Mingora’s residents continue to endure sleepless nights on rooftops and exhausting days in the mud, holding onto resilience and the hope of urgent state intervention.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab78761272e.jpg",
  "retrievedAt": "2025-08-25T13:32:02.089Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1936933/swat-residents-reel-under-the-rigours-of-flood-devastation",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T00:30:44.000Z"
}
