{
  "title": "AIOU holds a seminar on ‘Modern Trends in Islamic Research’",
  "author": null,
  "content": "ISLAMABAD, Jan 10 (APP):Allama Iqbal Open University (AIOU) has hosted a faculty seminar on the topic of ‘Modern Trends in Islamic Research’ the other day.\nThe event featured Dr Mustafeez Ahmad Alvi, a prominent scholar from the Department of Islamic Thought and Culture, National University of Modern Languages (NUML), Islamabad, as the keynote speaker.\nThe session was presided over by Prof. Dr Shah Mohayyuddin Hashmi, Dean, Faculty of Arabic and Islamic Studies, AIOU.\nIn his keynote address, Dr Mustafeez Ahmad Alvi emphasized the importance of looking beyond the past in research.\nHe stated, “Our research often draws lessons from the past, which is not entirely appropriate. We should take guidance from the past but not let it dominate our work.\nThe focus of research should be on the present and future, aligning with contemporary needs and challenges.”\nHe further highlighted the modern era’s intellectual shift, noting, “The West is gradually returning to spirituality through rational arguments.”\nAddressing the seminar, Prof. Dr Shah Mohayyuddin Hashmi stressed the need for impartiality in research.\n“Instead of adopting a confrontational approach, we must develop a neutral and balanced attitude. The Holy Quran encourages research in several places and the process of research is universal, rooted in scientific and global principles. Ijtihad (independent reasoning) and research lead to the creation of new knowledge, which drives national progress,” he stated.\nProf. Dr Ghulam Shams-ur-Rehman, Chairman, Department of Interfaith Studies, AIOU, delivered the opening and concluding remarks, expressing gratitude to the speakers for their participation and thought-provoking insights.\nThe seminar was moderated by Dr H.M Farooq Abdullah from the Department of Interfaith Studies, AIOU.\nThe event witnessed a large turnout of university faculty members and students.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:31:39.809Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aiou-holds-a-seminar-on-modern-trends-in-islamic-research/",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T14:00:00.000Z"
}
