{
  "title": "Secretary General OIC emphasizes collaboration in science and technology to overcome key challenges",
  "author": null,
  "content": "ISLAMABAD, Jan 10 (APP):The Secretary General of the Organization of Islamic Cooperation (OIC), Hissein Ibrahim Taha Friday emphasized the importance of collaboration among OIC member states in the critical fields of science and technology to overcome the key challenges faced by the Muslim Ummah.\nHe was speaking during his visit to the Secretariat of the OIC’s Ministerial Standing Committee on Scientific and Technological Cooperation (COMSTECH).\nThe high-profile event was attended by Assistant Secretary Generals of the OIC, Ambassadors of OIC member states, diplomats, vice-chancellors, government officials, scientists, and researchers from various OIC countries.\nIt marked the announcement of transformative initiatives aimed at advancing science and technology across the OIC region.\nAlongside the Federal Minister for Science and Technology and the Coordinator General of COMSTECH, Taha launched the COMSTECH Expert Service for Technological Cooperation.\nThis strategic initiative is designed to enhance technological self-reliance, foster sustainable development, and mitigate brain drain within OIC member states.\nThe program aims to mobilize expertise from across the Muslim world to address pressing challenges in healthcare, agriculture, energy, and education, embodying the spirit of collaboration and mutual progress among OIC countries.\nThe Secretary General OIC also commended the COMSTECH Fellowships and Scholarships Program for Palestinian nationals, praising its profound impact on empowering Palestinian youth through education and skill development.\nThis initiative reflects the OIC’s commitment to uplifting disadvantaged communities.\nTaha further highlighted the upcoming 16th COMSTECH General Assembly, scheduled to be held in Islamabad during  2025, as a vital platform for discussing the future of science and technology in the OIC region.\nHe also underscored the importance of the 2nd Ministerial Meeting of the OIC-15 Dialogue Platform, scheduled for this year, and the Emergency Conference on Education in Palestine, as critical efforts to foster scientific and educational progress.\nExpressing gratitude to the government and people of Pakistan for their warm hospitality, Taha lauded COMSTECH’s exceptional contributions to science, technology, and innovation.\n“COMSTECH is a beacon of hope, empowering individuals and communities through groundbreaking initiatives. I urge all member states to support and actively engage in these programs to collectively create a brighter and more prosperous future for the OIC community,” he further stated.\nFederal Minister for Science, Technology, and Education, Khalid Maqbool Siddiqui, welcomed the Secretary General and reaffirmed the importance of science and technology as fundamental pillars for sustainable development within the OIC. He termed the launch of the COMSTECH Expert Service as a pivotal step in uniting expertise across the Muslim world to address shared challenges and build resilience.\nIn his address, Prof. Dr. M. Iqbal Choudhary, Coordinator General OIC-COMSTECH, highlighted the organization’s efforts in fostering collaboration, building capacities, and promoting scientific excellence among OIC member states.\nHe noted that COMSTECH’s initiatives have empowered researchers, fostered innovation networks, and driven advancements in critical areas, with a particular focus on Africa and Palestine.\nCOMSTECH, headquartered in Islamabad, continues to serve as a cornerstone of the OIC’s mission to promote scientific excellence and technological innovation across its member states.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:32:02.692Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/secretary-general-oic-emphasizes-collaboration-in-science-and-technology-to-overcome-key-challenges/",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T12:42:00.000Z"
}
