{
  "title": "ISSI signs MoU with Center for International Strategic Studies, Azad Jammu and Kashmir",
  "author": null,
  "content": "ISLAMABAD, Jan 10 (APP):The Institute of Strategic Studies Islamabad (ISSI) has signed a Memorandum of Understanding (MoU) with the Center for International Strategic Studies, Azad Jammu and Kashmir (CISS AJK), based in Muzaffarabad.\nThe signing formalizes the institutional partnership aimed at enhancing collaboration in research, policy development, awareness, and advocacy-related to the Kashmir dispute as well as regional and international strategic issues. The MoU was signed by Ambassador Sohail Mahmood, Director General, ISSI and Dr. Asma Shakir Khawaja, Executive Director, CISS AJK, said a press release issued here on Friday.\nSpeaking on the occasion, Ambassador Sohail Mahmood emphasized the importance of this partnership in highlighting issues of national importance and promoting national discourse on the Kashmir cause and its just solution. He lauded CISS AJK for their excellence in research and acknowledged their active engagement on key subjects of national security. While CISS AJK and ISSI have been actively engaged, “This MoU marks a new chapter in our collaboration,” stated Ambassador Mahmood. He also underscored the importance of research and academic work on India’s conduct, including its internal and external drivers, both for enhanced public understanding and awareness as well as informed policy-formulation. The partnership between the two think-tanks envisages pooling resources to present Pakistan’s policies and actions in the right perspective to the regional and international audiences.\nDr. Asma Shakir Khawaja warmly welcomed the prospects of enhanced collaboration with ISSI within the framework of the MoU. She introduced several publications by CISS AJK and emphasised areas of mutual research interest between the two institutes, including emerging technologies and Jammu and Kashmir dispute. She underscored the importance of joint academic research on issues impacting national security. She emphasised that it is pertinent to include the indigenous voices of Kashmiris, particularly the Kashmiri youth. In this regard, she opined that collaboration between ISSI and CISS AJK can be impactful in reaching the decision-makers and concluded by underscoring the importance of unified efforts in addressing the pressing challenges.\nEarlier, Dr Khurram Abbas, Director India Study Centre at ISSI, briefed the participants regarding the ISSI and its five Centres. Ms. Tayaba Khurshid, Research Officer, outlined CISS AJK’s mission, outreach, publications, and capacity-building efforts.\nThe event concluded with a series of recommendations by both teams, and a commitment to\npaving the way for informed policy-making and enhanced public engagement and awareness of the Kashmiri perspective on the Kashmir cause.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:32:04.935Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/issi-signs-mou-with-center-for-international-strategic-studies-azad-jammu-and-kashmir/",
  "dateList": "2025-01-10",
  "date_published": "2025-01-10T12:05:00.000Z"
}
