{
  "title": "Kohat civil society condemns dragging national institutions into politics",
  "link": "https://www.app.com.pk/national/kohat-civil-society-condemns-dragging-national-institutions-into-politics/",
  "date_published": "2020-11-11T16:46:00.000Z",
  "source": "APP",
  "content": "KOHAT, Nov 11 (APP): Members of political and civil society Wednesday while condemning the ongoing tirade by some political leaders, said dragging the security institutions into politics was tantamount to appeasing the enemy.\nAddressing a joint press conference at Kohat Press Club, Provincial Joint Secretary of Pakistan Muslim League-Nawaz and Vice President Lawyers Wing Advocate Asif Paracha accompanied by lawyers, representatives of civil society and religious organizations and youth leaders, said the irresponsible statements, even at the floor of the National Assembly were an attempt to destabilize the country.\nParacha said the nation was proud of Pakistan Army for its invaluable sacrifices to safeguard the country. He said the people of Pakistan today feel protected because of its armed forces and all such state institutions need to be given due respect and honour.\n“We stand with the armed forces and condemn all those who are critical of them,” and added there was no point in dragging these institutions.\nLawyer Haroon Advocate said through their immature statements at floor of the parliament, some political figures were proving their anti-state posture.\nSocial activist Saleem Altaf said handing over of captured Indian pilot Abhinandan was Pakistan’s peace gesture to the world and those targeting the national institutions were in fact toeing Narendra Modi’s agenda. The Pakistan Army and other security institutions must be kept away from politics, he added.\nHe said the great success of Pakistan in downing the Indian air craft and later releasing the arrested pilot who intruded into our air space was a peace gesture, hailed by the world.\nMansoor Paracha of Ahl-e-Sunnat Wal Jamaat also called political leaders’ statements against security institutions was “enmity with the state” and viewed that the Pakistan Democracy Movement was pursuing an agenda for country’s instability, for petty personal gains.\nLabor Minister of KPK Youth Assembly Usman Shah joined other participants’ voice to stand by the security institutions and said ex-National Assembly Speaker Ayaz Sadiq’s statement was aimed at appeasing India, while undermining efforts of Pakistan for peace.",
  "retrievedAt": "2025-08-11T20:00:07.302Z"
}
