{
  "title": "1,708 new coronavirus cases reported; 21 deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/1708-new-coronavirus-cases-reported-21-deaths-in-past-24-hours/",
  "date_published": "2020-11-11T07:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): The total active COVID-19 cases in Pakistan on Wednesday were recorded 21,098 as 1,708 more people tested positive for the deadly virus during the last 24 hours.\nTwenty one corona patients, 20 of whom were under treatment in hospital and one out of hospital died on Tuesday, according to the latest update issued by the National command and Operation Center (NCOC).\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), and Balochistan, while 197 ventilators were occupied elsewhere in Pakistan, out of 1,855 allocated for COVID-19 patients.\nSome 31,989 tests were conducted across the country on Tuesday, including 9,273 in Sindh, 11,388 in Punjab, 3,877 in Khyber Pakhtunkhwa (KP), 5,453 in Islamabad Capital Territory (ICT), 688 in Balochistan, 372 in GB, and 938 in AJK.\nAround 320,065 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 348,184 cases were detected so far, including AJK 4,911, Balochistan 16,195, GB 4,394, ICT 22,432, KP 41,069, Punjab 107,831 and Sindh 151,352.\nAbout 7,021 deaths were recorded in country since the eruption of the contagion, including 2,690 Sindh among three of them died in hospital on Tuesday, 2,429 in Punjab eight of them died in hospital and one out of hospital on Tuesday, 1,294 in KP four of them died in hospital on Tuesday, 2,47 in ICT among three of them died in hospital on Tuesday, 154 in Balochistan, 93 in GB and 114 in AJK two of them died in hospital on Tuesday.\nA total of 4,773,496 corona tests have been conducted so far, while 736 hospitals are equipped with COVID facilities. Some 1,237 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:00:14.109Z"
}
