{
  "title": "U.S embassy apologizes over retweeting political message",
  "link": "https://www.app.com.pk/national/u-s-embassy-apologizes-over-retweeting-political-message/",
  "date_published": "2020-11-11T12:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): The U.S. Embassy Islamabad on Wednesday apologized over its post on Twitter, saying it did not endorse posting or retweeting of political messages.\n“The U.S. Embassy does not endorse the posting or retweeting of political messages. We apologize for any confusion that may have resulted from the unauthorized post,” the embassy said in a tweet.\nDear Followers: The U.S. Embassy Islamabad Twitter account was accessed last night without authorization. The U.S. Embassy does not endorse the posting or retweeting of political messages. We apologize for any confusion that may have resulted from the unauthorized post.\n— U.S. Embassy Islamabad (@usembislamabad) November 11, 2020\nThe U.S. embassy also mentioned about the unauthorized access of its twitter account.\n“The U.S. Embassy Islamabad Twitter account was accessed last night without authorization,” it said.\nMinister for Human Rights Shireen Mazari in a tweet seemed not to be satisfied with the explanation and said “This not good enough esp after great delay! Account was clearly not hacked so someone who had access to it used it “without authorisation”. Unacceptable that someone working in US Embassy pushing a particular pol party’s agenda – has serious consequences incl staff visas scrutiny.”\nThis not good enough esp after great delay! Account was clearly not hacked so someone who had access to it used it “without authorisation”. Unacceptable that someone working in US Embassy pushing a particular pol party’s agenda – has serious consequences incl staff visas scrutiny https://t.co/IWqYtRjVna\n— Shireen Mazari (@ShireenMazari1) November 11, 2020\nThe U.S. embassy a day earlier had retweeted a post of Opposition leader Ahsan Iqbal, who made a statement against Prime Minister Imran Khan.\nThe sharing of the comment by the PMLN leader by the Twitter account of the US embassy Islamabad evoked a strong reaction from the twitterati who demanded an apology from the US embassy with a hashtag #ApologiseUSEmbassy.",
  "retrievedAt": "2025-08-11T20:00:11.101Z"
}
