{
  "title": "Establishment of `Cyber Crime Control Wing’ for secure Ehsaas payment a priority: Dr. Nishtar",
  "link": "https://www.app.com.pk/national/establishment-of-cyber-crime-control-wing-for-secure-ehsaas-payment-a-priority-dr-nishtar/",
  "date_published": "2020-11-11T12:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 11 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Wednesday said the efforts to establish a “Cyber Crime Control Wing” to protect Ehsaas payments against cyber-attacks will be accelerated.\n“Cyber Crime Transparency is personally a priority for me; a multipronged effort is underway to ensure fast-tracked action in this regard”, Dr. Nishtar shared while chairing the 43rdboard meeting of Benazir Income Support Program (BISP), which is one of the 34 implementing agencies of Ehsaas, held here.\nThe board deliberated upon an extensive 19-item agenda including expansion of Ehsaas Nashonuma, opening of mobile wallets for Ehsaas One Woman One Account initiative, establishment of Cyber Crime Control Wing, agreement with NADRA to ensure easy payments to next of kins under Ehsaas Kafaalat, constitution of steering committees for Ehsaas Nashonuma and Ehsaas Taleemi-Wazaef and accident insurance coverage for monitoring teams of Ehsaas Talemi-Wazaef.\nA vibrant discussion took place, deep dive analysis was carried out and many important decisions were taken in the meeting.The board approved the expansion of Ehsaas Nashonuma program from currently 09 to 12 districts to enhance its outreach.\nBriefing the board about the flagship program, Dr. Nishtar said, “Districts with the highest stunting rates are being included.\nFor now, 22 Nashonuma Centers have already opened in nine districts. Overall, 52 Ehsaas Nashonuma centers will be established in 12 districts.”\nThe board also gave go ahead for “Ehsaas One Woman One Account initiative”, to enable opening of mobile wallets for Ehsaas Kafaalat beneficiaries.\n“We will invest in financial literacy to promote uptake and believe this will significantly impact on individuals’ abilities to escape poverty”, Dr. Nishtar shared.\nEnabling real time validation of eligibility of next of kin appeals in Ehsaas Kafaalat, the board approved an agreement with NADRA.\nThis agreement was necessary to ensure that applications of next of kin of dead beneficiaries are processed quickly.\nOther important decisions included approval for the establishment of Steering Committees of Ehsaas Nashonuma and Ehsaas Talemi-Wazaef for oversight, policy enhancement and accountability and accident insurance coverage for monitoring teams of Ehsaas Talemi-Wazaef.\nThe board meeting was attended by Yusuf Khan Secretary BISP, Muhammad Ali Shahzada Secretary Poverty Alleviation and Social Safety Division, Ghufran Memon Secretary Ministry of Inter Provincial Coordination, Additional Secretary (Exp.) Finance Division, and representatives of NADRA and EAD.\nAmongst private sector members, Zaffar A. Khan, Qazi Azmat Isa and Khawar Mumtaz attended the meeting. The members of the board joined the meeting both physically and virtually.\nThe board meeting concluded with the vote of thanks by SAPM Dr. Sania Nishtar.\nShe thanked all the board members for their time, continued support and trust.",
  "retrievedAt": "2025-08-11T20:00:09.792Z"
}
