{
  "title": "PPP, PML-N have already accepted defeat in GB election: Murad",
  "link": "https://www.app.com.pk/national/ppp-pml-n-have-already-accepted-defeat-in-gb-election-murad/",
  "date_published": "2020-11-11T13:53:00.000Z",
  "source": "APP",
  "content": "SKARDU, Nov 11 (APP): Minister for Communications and Postal Services Murad Saeed Wednesday said the Pakistan Peoples Party (PPP) and the Pakistan Muslim League-Nawaz (PML-N) had already accepted their defeat in the Gilgit-Baltistan (GB) election as an overwhelming majority of the people of the area supported the Pakistan Tehreek-e-Insaf (PTI).\nAddressing a public meeting here, he said both Bilawal Bhutto Zardari and Maryam Nawaz knew that their parties would be defeated in the GB election due to their past governments’ bad performance and that was why they were making a hue and cry about rigging.\nMurad Saeed said the GB people would now enjoy all constitutional rights like other parts of the country with representation in the Parliament as Prime Minister Imran Khan had already announced provisional provincial status for the area.\nHe regretted that both the PPP and the PML-N ruled the GB for decades but instead of working for its development, their leaders plundered its resources and built personal properties.\nHe said the GB people had been demanding the status of province, but the two parties did pay heed to their demand, and the credit went to Prime Minister Imran Khan for fulfilling it.\nGiglit-Baltistan, which was the starting point of China Pakistan Economic Corridor (CPEC), was neglected by the previous regime, and it was the PTI government that had announced many CPEC projects for the area, besides allocating economic and industrial zones, he added.\nMurad said the GB people kept deprived of health and education facilities, and proper roads by the previous rulers. Bilawal Bhutto even admitted that the PPP and PML-N governments had done nothing for the GB people by saying that all the healthcare and education facilities, and roads were in a dilapidated condition in the region.\nThe minister said Babusar Top remained closed for over eight months in the year but now the PTI had approved an all-weather road link for the area and its work would start next year as its feasibility process was underway.\nThe Karakoram Highway, he said, was in a dilapidated condition and the PTI government had given approval for its up-gradation project which would facilitate safe and comfortable journey and attract a large number of tourists to the GB.\nHe said the Gilgit-Shandoor-Chitral Road had been made part of CPEC and it would be linked with the Swat Motorway to provide modern road facilities to the GB people.\nHe said the GB people wee being given Insaf Health Cards, under which every family would be provided medical cover of upto Rs 1 million.\nHe said the PPP’s misrule had resulted in poverty in Sindh as the most of the country stunted children were born in its Thar district .\nHe said those, who had looted the national resources, had no right to talk about the people’s problems.\nHe expressed the hope that on November 15, the PTI would win a landslide majority in the GB Legislative Assembly election.\nMurad Saeed said the Jewish lobby had launched a campaign against Prime Minister Imran Khan who was advocating the case of not only Pakistan but that of the entire Ummah at the international forums like the United Nations also.\nMinister for Kashmir Affairs and Gilgit Baltistan Ali Amin Gandapur and Special Assistant to the Prime Minister on Overseas Pakistanis Syed Zulfiqar Bukhari also addressed the rally.",
  "retrievedAt": "2025-08-11T20:00:09.412Z"
}
