{
  "article_id": "2025-06-23_b51b8688022198af349dc92273961244",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/speaker-urges-lawmakers-for-mutual-respect/",
    "retrieved_at": "2025-08-27T16:21:51.709Z"
  },
  "metadata": {
    "title": "Speaker urges lawmakers for mutual respect",
    "author": null,
    "date_published": "2025-06-23T17:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 238,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 23 (APP): National Assembly Speaker Sardar Ayaz Sadiq on Monday called for mutual respect and responsible behavior among lawmakers, after a clash broke out between members of the Pakistan Peoples Party (PPP) and the Sunni Ittehad Council (SIC) during the budget session. When the session resumed, SIC member Dr. Nisar Jatt expressed regret over the incident. \"I have always respected the dignity of this House. I've been elected three times and never used emotional language. If my words hurt anyone, I apologize. We should move forward with grace,\" he said. PPP's Agha Rafiullah said his party had made great sacrifices for democracy. \"Our leaders gave their lives for this Parliament. We forgive and want to move on from what happened today,\" he added. Speaker Ayaz Sadiq reminded the House that the National Assembly staff works for all members equally. \"I've asked staff to step in if they see members about to fight. Their job is to keep order-not take sides,\" he said. \"They are answerable to everyone, and it's our shared duty to protect them.\" He stressed that Parliament belongs to both the government and the opposition. \"We are like two wheels of the same cart. We must work together, with respect and understanding, to solve the people's problems.\" The Speaker ended with a hopeful message: \"I pray that Parliament moves in a positive direction, and that we focus on the real issues facing the public.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}