{
  "article_id": "2025-06-23_ffdd5a04a7c957ae66bed1bc13acbbb8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/journalists-hold-walk-out-from-na-against-termination-of-employees-from-media-house/",
    "retrieved_at": "2025-08-27T16:21:23.724Z"
  },
  "metadata": {
    "title": "Journalists hold walk-out from NA against termination of employees from media house",
    "author": null,
    "date_published": "2025-06-23T18:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 346,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 23 (APP): Journalists on Monday staged a walk-out from the press gallery of the National Assembly (NA) during the session against termination of employees from a leading media house, non- provision of allowances to the employees of Radio Pakistan and non-payment of salaries in PTV. Speaker National Assembly Ayaz Sadiq sent a delegation of parliamentarians on the behalf of the government including all political parties to sort out the issues of journalists. The parliamentary delegation met the journalists and assured to resolved all problems. Talking to the journalists at the press gallery lobby, Minister of State for Interior Talal Chaudhry assured that the problems of Radio and PTV employees will be resolved soon. The minister said that the issues of sacked employees of a media house would be addressed after talking to its top management. Information Minister Attaullah Tarar would soon hold a meeting with the journalists. Minister of State for Finance Bilal Kayani assured the full cooperation to journalists. \"We will solve the problems of journalists together. We will discuss this matter with the Minister of Information,\"Bilal Kayani assured the protesting media persons. Stating that employees should get their salaries in time, Bilal Kayani requested journalists to end their walkout. MNA Barrister Aqeel said that lesding political figures were standing with journalists on this issue. PPP leader Abdul Qadir Patel said his party had spoken to Information Minister Attaullah Tarar about leading newspaper employees issue. \"We are with you and will remain with you till the proper solution of this issue,\" he added. Abdul Qadir Patel also suggested a committee could be formed to sort out this issue. The government has released billions of rupees to journalistic institutions, MQM member Syed Hafeezuddin revealed. He said he strongly protested against the dismissal of employees from a private media group. Paksitan Tehreek-e-Insaf Chairman Barrister Gohar said journalism was the fourth pillar of the state. \"We are with journalists, media workers should get their salary on time,\" Barrister Gohar remarked. He also said that the sacked journalists should also approach the High Court against their dismissal.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}