{
  "article_id": "2025-06-23_4c7704602f6b6328e9ed1ac8c7567b34",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-formation-of-3-specialized-committees-to-promote-cashless-economy/",
    "retrieved_at": "2025-08-27T16:22:23.379Z"
  },
  "metadata": {
    "title": "PM directs formation of 3 specialized committees to promote cashless economy",
    "author": null,
    "date_published": "2025-06-23T09:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 441,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 23 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the formation of three specialized committees: the Digital Payments Innovation and Adoption Committee, the Digital Public Infrastructure Committee, and the Government Payments Committee to promote cashless economy across the country. These special sub-committees will present recommendations to facilitate payments between citizens and businesses, raise awareness about digital systems, activate the Pakistan Digital Authority, formulate a national digital master plan, and streamline transactions between the government and the private sector. Prime Minister Shehbaz Sharif was chairing a high-level meeting focused on promoting a cashless economy in Pakistan. He emphasized the importance of making digital transactions more affordable and accessible for the public compared to cash, as a means to promote a cashless system. He also instructed that the RAAST digital payment system be established at the federal as well as across all provinces levels. \"Establishing a digital transaction system is crucial for bringing transparency to the economy,\" the prime minister said adding that cashless systems are being prioritized in developed and successful economies around the world, and modern technology must be used to implement a robust digital payments infrastructure. The prime minister noted that funds circulating through the banking system can be used for investment in government development projects. He also directed the transition of all transactions between the public and private sectors to a cashless model. During the briefing, the prime minister was updated on progress made toward implementing a nationwide cashless system. It was shared that currently, over 40 million users are benefiting from the RAAST system, and various initiatives are underway to increase this number. All financial transactions of the federal government are now conducted through the RAAST system, and steps are being taken to expand it to the provincial level. The briefing also highlighted that Fintech is a key component of this ecosystem. The Pakistan Digital Authority has been established and is actively working to transition the national economy toward a cashless model. It was also informed in the meeting that the Digital Public Infrastructure Committee will function under the leadership of the Federal Ministry of IT, while the Cashless Pakistan Steering Committee has been established within the Prime Minister's Secretariat. As part of the Smart Islamabad Pilot Project, the Ministry of IT is taking steps to make Islamabad Pakistan's first cashless city, the meeting was told. The meeting was attended by Minister for Economic Affairs Ahad Khan Cheema, Minister for Petroleum Ali Pervaiz Malik, Minister for IT Shaza Fatima Khawaja, Minister for Climate Change Dr. Musadik Malik, the Governor of the State Bank of Pakistan, the Chairman of FBR, and senior officials from relevant institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}