{
  "article_id": "2025-06-23_17238183e74b13bdfe46b455dcf2c5d5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/uk-trade-envoy-visits-pakistan-to-strengthen-bilateral-economic-ties/",
    "retrieved_at": "2025-08-27T16:22:18.076Z"
  },
  "metadata": {
    "title": "UK trade envoy visits Pakistan to strengthen bilateral economic ties",
    "author": null,
    "date_published": "2025-06-23T14:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 320,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 23 (APP): The United Kingdom's Trade Envoy to Pakistan, Mohammad Yasin MP, has embarked on a three-day visit to Karachi and Islamabad, aimed at boosting trade relations and encouraging long-term investment between the two countries. The visit comes on the heels of the UK's recent launch of its Growth Mission and Modern Industrial Strategy, under the Invest 2035 initiative - a ten-year vision designed to provide stability and strategic direction for businesses operating in high-growth sectors including clean energy, digital technologies, life sciences, and advanced manufacturing. Speaking about the visit, Mohammad Yasin MP remarked: \"The UK and Pakistan already enjoy deep commercial ties, but there is much more we can achieve together. It is a place close to my heart, and I have seen over many years the enormous potential to help both our countries prosper. During my visit, I look forward to supporting efforts that unlock new opportunities and drive growth.\" Currently, over 200 British companies operate across Pakistan, with the top five contributing approximately one percent of Pakistan's GDP. The UK remains Pakistan's largest European trading partner and the top source of foreign direct investment (FDI). During his visit, Mr. Yasin will hold meetings with key government officials, including Jawad Paul, Secretary for Commerce, and Chaudhry Salik Hussain, Federal Minister for Overseas Pakistanis. He is also scheduled to engage with business leaders and stakeholders to explore avenues for trade expansion and collaboration in sectors of mutual interest. This high-level visit is expected to lay the groundwork for the UK-Pakistan Trade Dialogue, set to launch later this year. The forthcoming Dialogue aims to enhance bilateral exports, increase investment flows, and address regulatory and market access issues to improve the overall business environment. The UK government views Pakistan as a vital partner in its global trade strategy and sees this visit as a pivotal step toward deepening economic cooperation, fostering innovation, and supporting sustainable development across both nations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}