{
  "title": "Chairman of Presidency of Bosnia & Herzegovina arrives on 2-day visit",
  "link": "https://www.app.com.pk/national/chairman-of-presidency-of-bosnia-herzegovina-arrives-on-2-day-visit/",
  "date_published": "2020-11-04T07:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP): Chairman of the Presidency of Bosnia and Herzegovina Sefik Dzaferovic arrived here Wednesday on a two-day visit.\nState Minister for Climate Change Zartaj Gul received the President of Bosnia and Herzegovina and his delegation including the minister for security and presidential advisers.\nSefik Dzaferovic is visiting Pakistan on the invitation of Prime Minister Imran Khan.\nDuring his stay, the Chairman of the presidency of Bosnia and Herzegovina will call on President Dr Arif Alvi and Prime minister Imran Khan.\nHe will also hold separate interactions with the speaker of National Assembly, foreign minister, adviser to the PM on Commerce and Investment, and other dignitaries.\nThis is Sefik Dzaferovic’s first visit to Pakistan in his capacity as Chairman of the Presidency of Bosnia and Herzegovina. Earlier, Prime Minister Imran Khan had met him on the side-lines of 14th OIC Summit in Makkah in May 2019.\n“Pakistan enjoys traditionally warm and friendly relations with Bosnia & Herzegovina. The two countries have extended support to each other in times of need. During the years 1994-95, Pakistan was a significant contributor of troops to the UN Peacekeeping Mission. Bosnia & Herzegovina provided assistance during the 2005 earthquake and 2010 floods in Pakistan,” the Foreign Office said.\nThe Foreign Office said the two sides were committed to further deepen and broaden cooperation in diverse fields – including trade, commerce, education, culture and people-to-people exchanges.\n“The visit of the Chairman of the Presidency of Bosnia & Herzegovina will serve to enhance bilateral relations and strengthen cooperative bonds between the peoples of the two countries,” the Foreign Office said.",
  "retrievedAt": "2025-08-11T19:58:28.362Z"
}
