{
  "title": "Housing sector revival, ray of hope for lower middle class",
  "link": "https://www.app.com.pk/national/housing-sector-revival-ray-of-hope-for-lower-middle-class/",
  "date_published": "2020-11-04T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP):The revival of pro-poor housing facilities under Prime Minister Imran Khan’s “Naya Pakistan” initiative is a ray of hope for the lower middle income groups yearning to live a dignified life in their own shelter.\nUnlike the previous regimes, the present government showed strong commitment and launched comprehensive efforts for providing five million housing units to the low-income group in pursuance of Pakistan-Tehreek-e-Insaf (PTI)’s manifesto.\nTo achieve the objective, Federal Government Employee Housing Authority (FGEHA) has been tasked which already launched different schemes in line with the targets set by the government.\nThe authority is pursuing joint venture on private land, government to government programs on government land.\nThe situation was not ideal as the state was already facing financial crunch, but Prime Minister Imran Khan proved himself as ‘Man of Commitment’ and no obstacle on his way could deter him from facilitating poor in the country.\nHe remained personally engaged by chairing meetings of Naya Pakistan Housing Development Authority (NPHDA) and getting regular updates on the project.\nThis unflinching commitment and untiring efforts of the Prime Minister made way for materializing a dream that was apparently a far cry for his political opponents.\nThe Prime Minister stood firm to his commitment made in the manifesto to start this mega and flagship project leaving his rivals in dismay and with no reason to criticize him anymore.\nThe government revived various impeded projects including Green Enclave-I Bhara Kahu project in December 2019 to allot 3,282 plots to the applicants.\nThe authority allotted 5,198 plots under Sky Garden project after its revival in July 2020 and allotted 3,240 plots under Lifestyle Residency Apartments G-13 scheme.\nThe prime minister inaugurated Kashmir Avenue G-13 Islamabad scheme under to build 1,467 apartments; 3,432 apartments to be built under Chaklala Heights Rawalpindi scheme, 3,945 apartments under SkyLine Apartments Islamabad scheme and 1258 under Lifestyle Residency Lahore scheme.\nThe federal government signed Memorandum of Understandings (MoUs) with provincial governments under government to government housing schemes projects targeting (798 apartments) in Azad Jammu and Kashmir, 16,000 apartments for fishermen, 18,000 apartments and 12,000 plots for general people in Balochistan 750 apartments in Khyber Pakhtunkhwa.\nThe government would spend around Rs18 billion during the current fiscal year for physical planning and housing programs.\nDespite various challenges, the PTI-led government is striving to provide low cost houses to the deserving people under Prime Minister Imran Khan’s vision to develop Pakistan on the model of Madina Welfare State.\nIn order to boost the housing and construction activity, the incumbent government announced heavily incentivized relief package for the construction industry during COVID-19 pandemic which was bearing fruit.\nAccording to Federal Board of Revenue (FBR), during last month a total of 127 construction projects have been registered valuing Rs.63 billion. Moreover, 108 persons were also in the process of registering 114 projects costing Rs109 billion.\nAmong these projects, as many as 61 would be developed in Karachi, Lahore 44, Islamabad 30, Rawalpindi 19, Faisalabad 10 and rest from other cities.\nThe construction industry package included tax incentives, waivers and subsidies in sales tax, capital gain tax and withholding tax. “Fixed tax at rate of per sq yard or per sq meter will be charged from investors. Those investing in Naya Pakistan Housing Program will be given 90% rebate in fixed tax.”\nThe package contained subsidy on five and 10 marla houses, allocation of 5 percent banks’ financing for house-building and a one-window operation to facilitate builders.\nA subsidy of Rs 30 billion has been allocated initially for construction of affordable houses for middle and lower classes under the Naya Pakistan Housing Project.\nThe National Coordination Committee is working hard to remove hiccups in the process relating to the State Bank of Pakistan and commercial banks on house-building finance.\nThe number of No Objection Certificates (NOCs) has been reduced besides a web portal for one window operation.\nThe Housing Authority would help address the country’s annual requirement of 400,000 units. Prime Minister Imran Khan has stressed for providing all kinds of facilitation to poor people in getting bank loans and particularly taking care of their self-respect.\nThe State Bank of Pakistan governor briefed a high-level meeting about the provision of loans to the poor and middle class segments of the society on easy installments.\nHeads of the National Bank of Pakistan, Allied Bank Limited, Meezan Bank, Bank Al-Habib, Habib Bank and Bank of Punjab apprised the prime minister of the provision of loans under the Naya Pakistan Housing Programme.\nThe meeting was told that with the setting up of special desks at their respective branches, the process of getting loans had been made very easy. The private banks would provide loans both under the Islamic and conventional banking.\nThe heads of banks assured their full support and cooperation to the government in the promotion of construction sector and facilitating the poor segments of the society for the construction of their own houses.\nThey lauded the prime minister and the government’s economic team for taking measures for business community including the banks keeping in view the situation of COVID-19 pandemic.\nThe meeting was told that technology was being used to make the process of providing loans in short time so that the documents of loan applicants could also be verified early and speedily.\nThe prime minister was told that more private banks would also start providing loans. The Punjab chief secretary told the meeting that an online portal had been established for the constructors and builders. The portal had so far received 6,994 applications and 54 percent of those had been approved.\nThe meeting was told that in order to avoid delay in approval process, the institutions concerned had also been linked with the online portal. With the provision of a time-line for the approval of applications, the applicant also remained updated about his/her case through the mobile application.\nThe prime minister urged all the provinces to fully utilize the online portal so that the process of approvals could be made early and transparent.\nCommending the pro-poor housing policy of the government, Minister for Information and Broadcasting Senator Shibli Faraz said, welfare of poor and vulnerable segments of the society was prime focus of the prime minister and the historic construction industry package was a timely step to benefit more than 40 allied industries.\nHe reiterated the government’s seriousness in promoting housing sector and said, National Coordination Committee on Housing headed by General Hyder has been created to remove bottlenecks. “Our target is to construct 100,000 houses in the first phase,” the minister said.\nThe commercial banks have directed to allocate five per cent of their lending portfolio for the construction industry that would make over Rs 300 billion while the government would also provide Rs 130 billion subsidy to poor.",
  "retrievedAt": "2025-08-11T19:58:30.380Z"
}
