{
  "title": "EU, Pakistan call for lasting humanitarian ceasefire in Afghanistan",
  "link": "https://www.app.com.pk/national/eu-pakistan-call-for-lasting-humanitarian-ceasefire-in-afghanistan/",
  "date_published": "2020-11-04T17:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP): The European Union and Pakistan Wednesday urged all the parties concerned in Afghanistan to observe lasting humanitarian ceasefire for complete elimination of violence to clearly demonstration their genuine commitment to lasting peace and reconciliation.\n“The EU and Pakistan, therefore, call on the parties to observe a lasting humanitarian ceasefire, in response to the global appeal by UN Secretary General Guterres, and to strive towards complete elimination of violence as a clear demonstration of their genuine commitment to lasting peace and reconciliation,” a joint declaration between EU and Pakistan issued here by Foreign Office.\nThe EU and Pakistan welcomed the mutual Eid ceasefire between the Afghan government and the Taliban, as a highly relevant confidence-building measure between the two sides.\n“Continued violence in Afghanistan is in sharp contradiction with regional aspirations for peace. It also complicates the efficient tackling of the exceptional threat Afghanistan and the region face with the COVID-19 pandemic,” the declaration said.\nThey reaffirmed their determination to strengthen in a strategic way their long-term, forward-looking and broad-based partnership for peace, development and prosperity.\nIt said “The Strategic Engagement Plan” signed by the two sides in June 2019 provided a framework for their bilateral engagements and ambitions in this area.\nThe document said that the EU and Pakistan wished to jointly reflect on the current state of play of the Afghan Peace Process, and encourage its unwavering continuation.\nThe two sides reaffirmed their strong support for an Afghan-led and Afghan-owned peace process and welcomed the progress made in the last two years, including the US-Taliban agreement on February 29, 2020 and parallel declaration between the Afghan government and the US, in Doha and Kabul respectively.\nBoth the documents are important, but initial steps, towards the start of genuine Intra-Afghan Peace negotiations in order to find a just and durable solution to the conflict, the document said.\nThe EU and Pakistan welcomed the start of the process of direct Intra-Afghan Negotiations.\n“Since Intra-Afghan Negotiations are Afghan-led and Afghan-owned, therefore, its success depends primarily upon the Taliban and the Afghan Government, and both sides should make earnest efforts for achieving lasting peace and stability in Afghanistan,” it said.\nThe two sides viewed that the negotiations should be held with the aim of protecting and strengthening the achievements of the last 19 years in the areas of socio-economic development, human rights and fundamental freedoms of all Afghans, notably women and youth, and lay the democratic foundation of a peaceful and prosperous Afghanistan.\nThey urged the international community to support Afghanistan for creating conditions for the timely and early return of Afghan refugees.\nThe two sides also underline the importance of cross-border and intra-regional activities and initiatives that promote the region’s economic integration and development, and expressed their willingness to engage in constructive initiatives thereon.\nThey were convinced that combating terrorism, the illicit economy, including drug trafficking and illegal mining, opposing money laundering and financing of terrorism, and preventing smuggling of human beings would serve the cause of peace in Afghanistan as well as the betterment of the whole region.",
  "retrievedAt": "2025-08-11T19:58:31.178Z"
}
