{
  "title": "EU lauds Pakistan’s progress on ‘meaningful implementation’ of FATF action plan",
  "link": "https://www.app.com.pk/national/eu-lauds-pakistans-progress-on-meaningful-implementation-of-fatf-action-plan/",
  "date_published": "2020-11-04T17:54:00.000Z",
  "source": "APP",
  "content": "The European Union (EU) has lauded Pakistan’s progress made towards the meaningful implementation of the action plan of Financial Action Task Force (FATF).\nIn a Joint Communiqué issued Wednesday following the fifth round of Pakistan-European Union Strategic Dialogue, the EU encouraged Pakistan to complete the Action Plan as acknowledged by the FATF plenary meeting held this October.\nJoint Press Communiqué: Fifth Round of Pakistan-European Union Strategic Dialogue held on 3 November 2020    https://t.co/ojHjQRZZOw\n— Spokesperson  MoFA (@ForeignOfficePk) November 4, 2020\nTo further their engagement, both sides agreed to hold the first meeting of the new EU-Pakistan Security Dialogue in 2021, including on the fight against terrorism\nThe Pak-EU dialogue was held via video-conference between Foreign Minister Shah Mehmood Qureshi and High Representative for Foreign Affairs and Security Policy of the EU and Vice-President of the European Commission Josep Borrell, focusing on diverse range of issues.\nThe two sides discussed the growing momentum of Pakistan-EU relations based on the Strategic Engagement Plan signed in June 2019 and agreed to make efforts towards its comprehensive implementation in all areas of cooperation, including through strengthening of existing and new institutional engagements.\nForeign Minister Qureshi and High Representative Borrell reviewed the ongoing cooperation on security between Pakistan and the EU.\nForeign Minister Qureshi expressed Pakistan’s deep concerns about human rights violations by India in Jammu and Kashmir, and its attempts to change the demography of the disputed territory.\nHigh Representative Borrell remarked that the EU was following the human rights situation in Jammu and Kashmir closely.\nHe underlined the need for restraint, de-escalation of tensions and resolution of the dispute through dialogue and constructive political and diplomatic engagement.\nForeign Minister Qureshi recognized the EU’s financial support of Euro 150 million to help address the COVID-19 pandemic in Pakistan.\nThe EU appreciated Pakistan’s assistance in repatriation of stranded EU citizens due to flight disruptions.\nBoth sides discussed ways to further alleviate the social and economic consequences of the ongoing pandemic.\nIn this context, they exchanged views on promoting international cooperation to mitigate the impacts of the pandemic and recognized the significance of international debt relief for developing countries.\nThe High Representative/Vice-President and the Foreign Minister expressed a strong political commitment towards the GSP+ preferential trade regime, through which the EU provides significantly reduced customs duties for countries that implement 27 international conventions related to human rights, labour rights, protection of the environment and good governance.\nThey agreed to utilise the GSP+ to its full potential, including by addressing the demand side contraction due to COVID-19 pandemic.\nThe High Representative raised concerns including on the death penalty and the misuse of the blasphemy law. He expressed appreciation for the intention to adopt the anti-torture bill.\nForeign Minister Qureshi raised deep concerns over the resurgence of Islamophobic acts in some EU Member States that had hurt the sentiments of Muslims across the world, including in Pakistan.\nHigh Representative Borrell raised deep concerns about recent terrorist acts in Europe.\nBoth sides deplored the killing of innocent people and reaffirmed their resolve to strengthen and protect human rights as well as fundamental freedoms, and further promote inter-faith harmony, religious tolerance and co-existence.\nThe EU informed about its New Pact on Migration and Asylum. The EU and Pakistan agreed to work towards a comprehensive dialogue on migration and mobility, as envisaged under the Strategic Engagement Plan.\nHigh Representative Borrell and Foreign Minister Qureshi also discussed ways to enhance their bilateral cooperation to address climate change.\nHigh Representative Borrell and Foreign Minister Qureshi exchanged views on regional issues and agreed on a Joint Declaration on Afghanistan, that called for efforts for restoration of peace in the country.\nForeign Minister Qureshi and High Representative Borrell exchanged views on other regional issues and reaffirmed their endeavor for promoting peace and prosperity through collaborative efforts.\nForeign Minister Qureshi and High Representative Borrell agreed to further enhance Pakistan-EU mutual collaboration and engagement.",
  "retrievedAt": "2025-08-11T19:58:30.074Z"
}
