{
  "title": "Targeting state institutions not in country’s interest: PML-N SVP",
  "link": "https://www.app.com.pk/national/targeting-state-institutions-not-in-countrys-interest-pml-n-svp/",
  "date_published": "2020-11-04T14:47:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 04 (APP):Provincial Senior Vice President (SVP) of PML-N Intikhab Khan Chamkani Wednesday said that targeting state institutions was not in the interest of the country.\nAddressing a press conference here at Press Club, Intikhab Chamkani said PML-N was an ideological political party working for prosperity and development besides strengthening democracy in the country.\nHe said the country was currently confronted with various challenges including price hike and could not afford aimless criticism on state institutions.\n“If we fight with each other on petty issues, not tolerate political opponents and continue criticizing state institutions including establishment, it would serve no purpose rather please the inimical forces and democracy would ultimately suffer,” he added.\nThe PML-N leader said he disagreed with the present narrative of the party against establishment. He said our security forces have rendered matchless sacrifices in war against terror and restored peace, law and order in the country.\nHe urged the party leadership to utilize their energies for strengthening the democratic institutions. He suggested the party leadership to perform the role of an active and responsible opposition by making constructive criticism on the government for solution of people’s problems and addressing the existing challenges confronted to the country.\n“My voice of dissent does not mean that I left PML-N,” he said and added that he would continue to work for strengthening the party.\nTo a question, Chamkani said he will participate in upcoming Pakistan Democratic Movement (PDM) public meeting in Peshawar.\nKhyber Pakhtunkhwa PML-N Vice President Fazalullah, Provincial Organizer Mujeebur Rehman, Deputy Secretary Information Rafia Saeed, Azmat Khan and Zakaullah were also present on the occasion.",
  "retrievedAt": "2025-08-11T19:58:32.972Z"
}
