{
  "title": "Celebrities’ board to play advisory role on Kashmir Cause",
  "link": "https://www.app.com.pk/national/celebrities-board-to-play-advisory-role-on-kashmir-cause/",
  "date_published": "2020-11-04T11:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 04 (APP): Kashmir Committee Chairman, Shehryar Afridi Wednesday constituted a multi-faceted board comprising top celebrities of Pakistan to play an advisory role on Kashmir Cause.\nAll the prominent media and sports personalities were invited to join cultural, heritage and sports advisory board for Parliamentary Committees on Kashmir.\nThe due to be notified advisory board would be a creative alliance of some of Pakistan’s top media personalities from the country’s television, cinematic and sporting spheres, aimed at promoting Pakistan’s cultural richness both at home and abroad in a bid to project a soft image of the country.\nArtists who have been invited to join were Humayun Saeed, Saba Qamar, Fahad Mustafa, Atif Aslam, Anwar Maqsood, Shaan Shahid, Ali Azmat, Yousaf Salahuddin, Saira Kazmi, Rahat Fateh Ali, Hadika Kiani, Shehzad Roy, Humaima Malick, Yousaf Salahuddin, Shaniera Akram, Adnan Siddiqui, Bilal Ashraf, Samina Peerzada and Shafqat Amanat Ali.\nFilm Producers Jerjees Seja, Momina Duraid and Ammara Hikmat have been chosen for the advisory role.\nFilm directors Syed Noor, Nadeem Baig and Bilal Lashari were also on the list.\nFrom the field of sports Aisam ul Haq, Jahangir Khan, Jansher Khan, Maria Toorpakai, Wasim Akram, Sana Mir and Karishma Ali have been invited to join and would be notified soon.\nAhsan Mashkoor has been notified as the focal person for the advisory board.\nIn a letter addressed to one of the advisory board members, Shehryar Afridi mentions, “To promote our cultural heritage and preserve our cultural legacy, we have decided to make you part of our advisory board on culture, heritage & sports.”\nFurther course of action, roles and responsibilities to be shared with the board before the first meeting which is due to be held mid November, the letter said.",
  "retrievedAt": "2025-08-11T19:58:34.370Z"
}
