{
  "title": "SCCI chief inaugurates Facilitation Desk for provision of grant to SMEs",
  "link": "https://www.app.com.pk/national/scci-chief-inaugurates-facilitation-desk-for-provision-of-grant-to-smes/",
  "date_published": "2024-08-20T15:46:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 20 (APP):Fuad Ishaq, president of the Sarhad Chamber of Commerce and Industry on Tuesday inaugurated a Facilitation Desk for provision of a grant to small and medium scale businesses and industries announced by International Organization of Migration.\nThe initiative aims to facilitate business community regarding availing of a cash grant of International Organization of Migration (IOM) for Small and Medium Enterprises (SMEs), said in a statement here.\nIt is mentioned here that the International Organization for Migration (IOM), a UN body, has announced a cash grant for small and medium enterprises (SMEs) through their Enterprise Development Fund (EDF).\nThis grant is for business expansion, boosting productivity and especially creating jobs.\nPresident of the WCCI Peshawar Azra Jamshed, members, women entrepreneurs, members of the business community and others were present on the occasion.\nFuad Ishaq, President SCCI in his remarks on the occasion appreciated the IOM and asked small scale businesses and industries to take full benefit from this grant.\nHe said SCCI has always been on the front foot for safeguarding interests of small and medium enterprises and will keep on supporting this important sector of the economy.\nThe chamber president said federal and provincial governments take pragmatic steps for ease of doing business and provision of interest-free loans to the business community.\nLater in the day, members of the business community visited the chamber house wherein officials of IOM briefed them about the procedures for availing cash grant for launching of small businesses and industries.\nOfficials on the occasion said a grant up to Rs5million will be given to more than 120 SMEs of Khyber Pakhtunkhwa.\nThey furthermore said grants will be available for companies and the business community affected by war or natural disasters in various trades, aimed at reviving and promoting these businesses.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:48:32.716Z"
}
