{
  "title": "Al-Shifa Chakwal Eye Hospital to treat 500 patients daily",
  "link": "https://www.app.com.pk/national/al-shifa-chakwal-eye-hospital-to-treat-500-patients-daily/",
  "date_published": "2024-07-22T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP):President of Al-Shifa Trust Eye Hospital Maj. Gen. (Retd) Rehmat Khan has said that as many as 500 eye patients would be treated at the Chakwal Eye Hospital.\nHe said this while on the completion of the extension block of the Chakwal Eye Hospital here on Monday.\nMaj. Gen. (Retd) Rehmat Khan briefed the media that Chakwal Eye Hospital was designed to cater for 250 patients daily but the influx forced the hospital administration to make temporary arrangements.\nThe trust was concerned about providing better facilities to the patients but was unable to extend and upgrade the hospital due to a lack of funds, at this juncture, Dr Nasir Baz, a Pakistani doctor serving in Fresno, California, met him and expressed concern about the hospital in Chakwal.\nMaj. Gen. Rehmat Khan said that he informed Dr Baz, who hails from a village in Chakwal about the financial constraints hindering expansion plans.\nDr. Nasir Baz on my request showed confidence in the ability and integrity of officials of the Al-Shifa Trust and donated Rs 150 million to complete the hospital’s expansion and upgrade within two years.\n“Our Chakwal hospital can now accommodate 500 patients daily and provide round-the-clock emergency eye care services due to Dr Baz’s generosity,” Maj Gen (Retd) Rehmat Khan explained.\nHe added that the number of retinal and glaucoma surgeries will now reach 40 per day, in addition to the daily treatment of 30 to 40 glaucoma patients who do not require surgery.\nRehmat Khan announced the deployment of an outreach team in Chakwal villages to conduct school screenings and provide pick-up and drop-off facilities for serious patients.\nThe Al-Shifa President said that over the last 30 years, the trust has treated 30 million patients free of charge at Rs 13 billion including thousands of surgeries for glaucoma, retina, and cancer, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:02:00.050Z"
}
