{
  "title": "59.322mn registered female voters to decide fate of 175 political parties in election 2024",
  "link": "https://www.app.com.pk/national/59-322mn-registered-female-voters-to-decide-fate-of-175-political-parties-in-election-2024/",
  "date_published": "2024-01-13T18:13:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 13 (APP):Despite cold weather conditions, the electioneering campaigns have started gearing up in the country including Khyber Pakhtunkhwa where over 128.585 million registered voters including 59.322 million females and 69.263 million males would decide the fate of 175 political parties in the general election 2024.\nIn Khyber Pakhtunkhwa, a total of 21.928 million voters including 11.437 million males and 9.983 million females would exercise their right of franchise in favour of their political parties and independent candidates for the next five years.\nProf Dr. A.H.Hilali, former Chairman of the Political Science Department, University of Peshawar told APP on Saturday that female voters’ role during the election 2024 would be crucial and any political party.\n“I eagerly await to poll my first vote on February 8, 2024 election,” said Sidra Qaiser, a young voter/school teacher of Nowshera district while talking to APP.\nShe said the casting of the vote was a national obligation and she would vote for a political party’s candidate after seeing its manifesto.\nProfessor Dr. HIlali said all eyes would be on voters’ turnout in the 2024 election after the overall turnout rates for the elections in 2008, 2013, and 2018 were 45 percent, 54 percent, and 50 percent, respectively.\nHe said the women voters’ turnout in the 2018 general elections stood at 40 percent with 21 of 46 million registered women voters participating in polling.\n“The political parties need a lot of work to mobilize women voters as about 40% of female vote on the average which is considerably low as per international standards.”\nHe said PPP leadership was taking credit for BISP, 1973 constitution, development works in Sindh and 18th constitutional amendment besides a new slogan of constructing three million houses for the poor.\nHe said PMLN was advocating for constructing motorways, lawari tunnel, restoration of peace in KP, Karachi and atomic tests at Chagi in 1998.\nSimilarly, ANP was trying to attract voters about renaming NWFP as Khyber Pakhtunkhwa and the construction of universities in the province.\nDr Malik said that free and transparent elections are very important for the continuity of democracy and addressing the country’s challenges like economy, climate change issues besides controlling price hike and inflation that adversely affected the common man.\nHe said women were about 50pc of the country’s population and their women participation in elections provides the citizens with a uniform way to voice their opinions and choose who and what is best for them.",
  "retrievedAt": "2025-08-10T23:35:44.643Z"
}
