{
  "title": "AJK-wide 05-day national polio-eradication campaign concludes",
  "link": "https://www.app.com.pk/national/ajk-wide-05-day-national-polio-eradication-campaign-concludes/",
  "date_published": "2024-01-13T07:38:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Jan 13 (APP) ::After administering the polio vaccine to a large chunk of the targeted number of children under 5 years of age, the 5-day integrated national polio eradication drive successfully concluded in Azad Jammu and Kashmir (AJK) by the end of the stipulated time on Friday, official sources said.\nLike the rest of the country, the integrated anti-polio campaign started across AJK State on January 8, 2008, and continued till the stipulated timeframe of 4.00 p.m. on Friday, Jan. 12, without any pause, immunizing a major portion of the total targeted total of 7,42,500 children under 5 years of age, administered the polio vaccine in all 10 districts of the liberated territory, the AJK State Health sources told APP late Friday.\nThe sources continued that in AJK’s metropolis, Muzaffarabad, over 1.20 lakh children up to five years of age were targeted to be administered the polio vaccines during the drive, which lasted by the stipulated last day of January 12 without any break.\n“At least 3995 mobile teams of paramedical staff were constituted to visit door to door to administer the polio vaccine drops during the campaign across AJK, with a total of 448 fixed centers at the local government.”\nHospitals and subordinate health facilities were set up by the State Polio Eradication Committee of the AJK State Health Services Department with the coordination of the World Health Organization  (WHO), the sources said.\nThe total staff involved in the AJK-wide national drive includes mobile teams comprising over 5000 workers who visited door-to door to immunize children under 5 years of age with the polio vaccine drops during the campaign, the sources pointed out.\nThe fixed centers were set up at state-run hospitals, basic health units, rural health centers, and various other spots to vaccinate the children with the anti-polio drops, the sources said.\nA total of 169 transit points were also set up for conducting the drive-by under the supervision of the concerned area in charge, the sources said.\nThe state health department’s Polio Eradication Committee was given adequate arrangements to execute the polio-eradication campaign in a befitting manner, the sources asserted, adding that a total of 844 areas in charge supervised the drive at the union council’s level across AJK in 35 tehsils and besides a total of 245 Union Council throughout AJK State.\nA central polio control room was set up in the office of the Provincial Program Manager, EPI, in AJK State’s metropolis, Muzaffarabad, to monitor the drive and to receive any complaints by official phone number 05822-920791.\nIn the lake district of Mirpur, at least 73082 children under 5 years of age were targeted to be administered the polio vaccine. District Health Officer Dr. Fida Hussain told APP here on the eve of the conclusion of the nation-wide campaign that ended on Friday across this lakeside district successfully.\nIn Mirpur district, over 400 mobile teams of paramedics in all 28 zones visited door to door besides serving at the 41 fixed centers and the 14 transit points to administer the polio vaccine drops to under~05-year-old children during the ongoing 5-day national polio eradication campaign, the DHO added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:36:21.803Z"
}
