{
  "title": "AJK PM seeks int’l community’s role to help resolve Kashmir issue without further delay",
  "link": "https://www.app.com.pk/national/ajk-pm-seeks-intl-communitys-role-to-help-resolve-kashmir-issue-without-further-delay/",
  "date_published": "2024-01-13T07:46:00.000Z",
  "source": "APP",
  "content": "MIRPUR  (AJK)Jan 13 (APP):Azad Jammu Kashmir (AJK) Prime Minister Chaudhry Anwar ul Haq, while voicing his serious concern over the worsening political and human rights situation in the Indian-illegally occupied Jammu and Kashmir (IIOJK) state, urged upon the international community to play its due role to help resolve the lingering dispute without further loss of time.\n“The much-delayed global Kashmir conflict has been the main cause and consequence of rights violations in the region,” the AJK Prime Minister said while talking to the AJK Muslim Conference chief former Prime Minister of AJ&K Sardar Atique Ahmed Khan, who called on him at Jammu Kashmir House in the federal metropolis late Friday.\nSpeaking on the occasion, the PM said that the situation in IIOJK has further deteriorated since the Modi government stripped the region of its special status. The Indian government’s unilateral move, he said, was in violation of the UNSC resolutions.\nHe said that the Indian Supreme Court’s verdict on 370 has further compounded the issue of Kashmir.\nThe PM said that the Kashmiri people have neither accepted India’s belligerent military occupation nor do they accept the biased verdict of the Indian Supreme Court. He said that the government of Azad Kashmir would utilize all available resources to promote the Kashmiris’ just cause at the international level, besides sensitizing the world about the early resolution of the Kashmir issue in line with the UNSC resolutions.\nReferring to the recently held conference in Kotli, the PM said that the massive gathering held in support of Kashmiris’ right to self-determination was organized against the backdrop of the All Parties Kashmir Conference, which was attended by the representatives of all the political parties of Azad Kashmir and the All Parties Hurriyat Conference (APHC).\nAnwaar said that besides highlighting the Kashmir cause, the government had stepped up its efforts to establish good governance and rule of law in the state. He said that the welfare of people was among the government’s top priorities.\nFormer Prime Minister Sardar Atique Ahmed Khan assured the PM of his party’s full support to strengthen Kashmir’s ongoing freedom struggle.\nHe also appreciated the good governance initiatives taken by the Prime Minister.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:36:21.148Z"
}
