{
  "title": "SC adjourns Bhutto reference till March 5",
  "link": "https://www.app.com.pk/national/sc-adjourns-bhutto-reference-till-march-5/",
  "date_published": "2024-02-27T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): The Supreme Court on Tuesday adjourned hearing of presidential reference pertaining to the ‘judicial murder’ of Zulifkar Ali Bhutto till March 5.\nA nine-member bench headed by Chief Justice of Pakistan Qazi Faez Isa and comprising Justice Tariq Masood, Justice Mansoor Ali Shah, Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Hasan Azhar Rizvi and Justice Musarrat Hilali heard the reference.\nPPP’s Chairman Bilwal Bhutto Zardari attended the hearing.\nAt the outset of hearing, Amicus Curiae Justice (Retd) Manzoor Ahmed Malik informed the court that he had prepared a summary of the case.\nHe said the murder incident took place between the night of November 11 and 12, 1974 at Shadman Chowk in Lahore.\nThe investigation into the murder case registered at the Achhra Police Station, Lahore was closed by saying that the accused could not be traced.\nHe said that Zulfikar Ali Bhutto was not named as an accused in the case.\nHe said the record of the case was obtained by the police for re-investigation on August 8, 1977 without any written permission from the magistrate.\nHe said that the magistrate had issued a formal order to close the case which was not challenged anywhere. “This order remains in field till date. The Federally Investigation Agency, however, conducted a separate investigation despite there was no provision in the law to transfer the investigation from the police to the former,” he added.\nJustice (Retd) Manzoor said that Zulfikar Ali Bhutto had accused the then chief justice of being biased.\nHe referred to the statement Ahmed Raza Kasuri in the Shafiur Rehman case that the purpose of naming Bhutto in the case was not that he had murdered his father himself.\nThe amicus curiae said that it was claimed that a conspiracy was hatched to kill Ahmed Raza Kasuri but he was still alive. Sessions Judge Ijaz Nisar had sought a report from the public prosecutor on the matter but the very next day, the case was transferred to the high court.\nHe argued that Bhutto’s lawyer could not appear in the first hearing and the court sought evidence on next date which was a clear violation of the legal process. The accused were also charged separately while ignoring the rules, he said, adding that if there were more than one accused, the charge would be one.\nThe chief justice remarked that he was looking at the order sheet and it seemed that it was a civil case. As per the charge sheet, the elements of conspiracy to murder were added to the charge. Surprisingly, it was not clarified that where that conspiracy had taken place.\n“In this case, the basis of murder is said to be a conspiracy,” he said.\nLater, the court adjourned the reference till March 5.\nIt may be mentioned here that former president Asif Ali Zardari had referred the Zulfikar Ali Bhutto murder reference in 2011 to the apex court.",
  "retrievedAt": "2025-08-11T00:57:34.372Z"
}
