{
  "title": "ECP merges SIC reserve seats petitions, defers hearing until Wednesday",
  "link": "https://www.app.com.pk/national/ecp-merges-sic-reserve-seats-petitions-defers-hearing-until-wednesday/",
  "date_published": "2024-02-27T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): The Election Commission of Pakistan (ECP) combined all petitions related to minority and women reserve seats of Sunni Ittehad Council (SIC) on Tuesday and postponed the hearing until Wednesday.\nA four-member panel, headed by Chief Election Commissioner (CEC) Sikandar Sultan Raja and including members Nisar Ahmed Durrani, Shah Muhammad Jatoi, Babar Hassan Bharwana, and Justice (R) Ikram Ullah Khan heard the petition.\nBarrister Farough Naseem represented Muttahida Qaumi Movement (MQM) leader Khalid Maqbool Siddiqui.\nBarrister Ali Zafar represented the Sunni Ittehad Council, stating they were there to secure their allocated seat.\nAzam Nazir Tarar from Pakistan Muslim League Nawaz (PML-N) and Farooq H. Naik from Pakistan People’s Party (PPP) asserted that they were representing their respective political parties. They emphasized that it is up to the commission to determine whether the Sunni Ittehad Council (SIC) can secure reserve seat or not.\nBarrister Ali Zafar emphasized that his party’s reserved seat cannot be claimed by anyone else, highlighting that the SIC has already submitted a petition to the ECP for the allocation of reserved seats.\nBarrister Gohar urged the bench to allocate reserved seats to the SIC.\nThe Chief Election Commissioner mentioned that the Election Commission has scheduled the applications for a hearing, and asked Ali Zafar, if he is a party to all of these cases.\nAzam Nazir Tarar countered by asking how independent members affiliated with the Sunni Ittehad Council, which failed to win even a single seat, could be granted reserve seats.\nHe argued that these members, originating from a party rejected by the electorate, did not initially apply for reserved seats. Furthermore, given that the Sunni Ittehad Council is not recognized as a parliamentary party, he questioned their entitlement to reserved seats.\nThe Chief Election Commissioner advised them to leave the matter of reserve seats to the Election Commission for decision.\nBarrister Ali Zafar stated that they have not yet received copies of the applications and requested the commission to provide them. He assured that they would submit their response today.\nFarooq H. Naik urged the Election Commission to convene and hear from all parties involved.\nIt is a legal issue, not a political one.\nBarrister Gohar said that their opponents did not win a seat in Lahore and are asking for SIC seat.\nAzam Nazir Tarar responded to Barrister Gohar, suggesting that they should reserve these comments for private discussion, media outside the commission premises.\nTalking to media, the leader of Pakistan Tehreek-e-Insaf, Barrister Gohar Ali Khan, said that the meeting of the National Assembly will be illegal until a decision is taken on reserve seats.\nBarrister Gohar said that no assembly session can be held until the reserved seats are decided. He hoped that the decision of the Election Commission will be based on justice.\nBarrister Gohar Ali Khan said that 86 MNAs-elect have joined the Sunni Ittehad Council, and the council has forwarded 4 applications to the Election Commission. He expressed hope that a decision to allocate minority and women reserve will be reached by Wednesday.\nBarrister Gohar disclosed that 90 MPAs elect in KP and 7 elected MPAs in Balochistan have joined the Sunni Unity Council, while 107 elected MPAs in Punjab have also pledged their support to the council.",
  "retrievedAt": "2025-08-11T00:57:37.702Z"
}
