{
  "title": "Tech-based vision a must to transform Gwadar into energy hub: Experts",
  "link": "https://www.app.com.pk/national/tech-based-vision-a-must-to-transform-gwadar-into-energy-hub-experts/",
  "date_published": "2024-02-27T10:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP):The experts at a policy dialogue have said that Gwadar may be made an energy hub, but it is only possible through a technology-based development, vision and a community-centric social development approach.\nThe policy dialogue titled: ‘Gwadar as an Energy Hub of Pakistan: Pathways for Sustainable Development’, was organized by Sustainable Development Policy Institute (SDPI) under its Network for Clean Energy Transition (NCET) here.\nIn his opening remarks, SDPI Executive Director, Dr Abid Qaiyum Suleri said the discourse on a unique subject like Gwadar as an energy hub was pertinent and crucial at a time when the new government is about to take office.\nHe further said the development of Gwadar as a port and a modern city has co-benefits that need to be identified. “Due to COVID-19 and unavoidable geopolitical circumstances, Gwadar has not been made functional at its full scale. It is still dependent on electricity imported from Iran whereas to make export zone functional will require more energy,” he maintained.\nSince, the global community has demanded to make three-fold increase in renewable energy (RE) share by 2030 at the COP-28, Pakistan is looking for renewable energy support from China as an excellent candidate for solar and offshore wind energy potential, he said.\nGwadar has the potential to become mix of all traditional and renewal energy generation projects, Dr Suleri said, adding that working on this end holistically, particularly its consumption aspects, an efficient utilization and best use of infrastructure should be worked out through discourse.\nNaghman Chaudhry, the former advisor and Strategic Analyst, said  that keeping in view the recent developments in the Indian Ocean Region and global geopolitical landscape, it is important for the country to embrace a change of mindset.\nHe underlined that Gwadar is an alternate port that could be used to degravitate Central Asian Republics (CARs) from Russian influence as the Gulf oil reserves were to last not beyond 40 years.\n“Since Karachi and Qasim Ports are susceptible to air and land attacks due to close proximity to hostile neighbouring country, Gwadar lied outside the potential war zone and was an ideal hub for trade and investment,” he suggested.\nDr Scarlet Xiang Yang, Director, China Study Center, National University of Science and Technology, stressed the need to improve regulations, taxation regime, and governance mechanisms to have efficient and well-defined potential forums facilitating investors and navigating dividends for better output.\nDr Hassan Daud Butt, Associate Professor, Bahria University and former Director CPEC at the Ministry of Planning and Development, stressed the  need to find a middle ground between opportunities and challenges to get an alternative plan for a speedy  development of Gwadar under CPEC.  “Women of Balochistan are more pragmatic and participate in decision-making processes whereas the Baloch female students at Quaid-i-Azam University are passing their exams with flying colours, and thus they should be given voice in the policy-making process,” he said.\nHe said the progress in Pakistan under CPEC is far better than all other countries that were part of the Belt and Road Initiative. He suggested mobilizing resources towards the simultaneous development of the port and the city in Gwadar for a holistic outcome starting from energy and water.\nShakeel Ahmed Ramay, Chief Executive Officer, of the Asian Institute of Eco-civilization Research and Development, said the total gross regional product of Shenzhen city alone is $482 billion started its journey from a few million dollars.\nHe stressed the need to study its policy decisions and resource mobilization methods for learning good development models. The life of local people needs to be improved so that they might support strategic initiatives like CPEC in their areas, he said, adding that only the socio-economic development of Gwadar can ensure sustainable development in the region.\nDr Eram Ashraf, Research Scholar, said data are scarce on CPEC that needs to be resolved to ensure a credible flow of information for better reporting on the game-changer project. “Gwadar is not connected to the national grid, so how it can become an energy hub the policy initiatives must be inclusive which means not only power players but also local communities should have their input and stakes in the decision-making process.\nThe problems of protesting people, including women, needs to be addressed on a priority basis,” she added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:58:26.117Z"
}
