{
  "title": "No ‘refugee status’ given to anyone so far: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/no-refugee-status-given-to-anyone-so-far-sheikh-rashid/",
  "date_published": "2021-08-30T17:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Minister for Interior, Sheikh Rashid Ahmad on Monday clarified that so far no ‘refugee status’ had been granted to anyone in wake of foreigners’ evacuation and takeover of the Taliban in Afghanistan.\nAddressing a press conference, he said that on daily basis, many people come and return back from the Chaman border as per past practice related to the trade activities while there was no extra burden on borders.\nHe added as per official data so far some 1,627 people from Afghanistan had to face Federal Investigation Agency’s (FIA) immigration process in Pakistan at Islamabad airport besides 2,192 those who moved after clearance from FIA immigration at the Torkham border.\nThe minister said, “Pakistan is a responsible state and will fulfill its responsibility of national security while meeting international expectations as a major country of the region with the objective to strengthen peace in Afghanistan.”\n“We had sacrificed more than any country of the world with loss of lives of 80,000 Pakistanis and over 100,000 those who got different disabilities but still our morals are high with having world’s most professional and sound army,” the minister added.\nSheikh Rashid said “We expect great respect and honour from the international world on these sacrifices just for maintaining peace and stability for the entire world. We are the major contributor for maintaining peace in the region and no one can even think of bypassing us.”\nReplying to a question, he said that the Afghan Taliban had assured that they would not allow Tehreek-e-Taliban Pakistan (TTP) to use their soil against Pakistan while they had already rivalry with Daesh as they fought against each other in many places in Afghanistan.\nThe minister said that the Pakistan army was proficiently accomplishing its responsibility to safeguard the country and performing duties on borders to protect every inch of this motherland.\nHe said that mostly Pakistanis had been evacuated from Afghanistan while around 30 to 40 Pakistanis were still in Afghanistan and were not ready to come back due to various reasons like the presence of their family members there.\nHe said that the government had fixed August 30 as the last date for those who were overstaying Pakistan on the expiry of visas.\nThe minister said the government had issued visas for a further 21 to 30 days while around 600 to 700 people did not apply for visas or immigration.\nHe said as a major player in international politics Pakistan had responsibilities to manage things as we had enemies like India who could use any sort of terrorist set up against Pakistan.\nRashid termed Indian TV channels program on the prevailing situation as awkward, one-sided, and foolish.\nHe said that Pakistan was becoming the focus of international politics while on other hand Pakistan Democratic Movement’s (PDM) leadership was busy in domestic politics.\nHe made it clear that there was no threat to the government as it was so strong with having the full support of its country’s people.\nThe minister said that JUI-F chief Maulana Fazalur Rehman should play a responsible role and avoid giving baseless statements like giving Pakistan’s land to other countries. “We as a responsible country offer our support on humanitarian grounds to those leaving Afghanistan,” he added.\nHe said that Pakistan would welcome all those foreign nationals stranded in Afghanistan whether they were American or citizens of any other country. He added the government of Pakistan was providing them visas on arrival.\nHe contradicted this wrong impression being displayed by PDM leaders that many places had been vacated for foreigners coming from Afghanistan.\nThe minister said foreigners were staying at hotels, not any public place while bearing their own expenses.\nHe said that opposition leaders had no vision to understand the prevailing changing international scenario as this region had been the focal point of international politics but Pakistan’s opposition parties had no acumen to realize this.\nResponding to the PDM’s announcement of a march to Islamabad, while inviting PDM leaders including JUI-F Chief to come to Islamabad, Sheikh Rashid said, “They will be treated as per law and constitution, which they truly deserve. This is new Pakistan with having a lot of responsibilities in changing trends in international politics.”\nCommenting on PDM’s public gathering, he said that the timing and place of their gathering were not appropriate as they were unaware of the prevailing changing political situation.\nHe said that the opposition had no capability to stand against the politics of Prime Minister Imran Khan who was serving the nation honestly and with a dedication to change the destiny of the country.\nHe added opposition had nothing to convince people if they go for an election campaign and they had to face historical defeat.\nHe reminded the opposition leaders that still two years were left for the next elections and many decisions of National Accountability Bureau (NAB) cases were expected in these two years.\n“I appeal all political forces particularly religious parties and Ulema to play a responsible role for such state which was created in the name of Allah Almighty and his Prophet Hazrat Muhammad (peace be upon him).\n” He said that Ulema should come forward and manage minor factional issues themselves to jointly face the major challenges being faced by the country.",
  "retrievedAt": "2025-08-11T21:09:01.877Z"
}
