{
  "title": "Pakistani, other international students visit Xi",
  "link": "https://www.app.com.pk/national/pakistani-other-international-students-visit-xi/",
  "date_published": "2021-08-30T06:54:00.000Z",
  "source": "APP",
  "content": "BEIJING, Aug 30 (APP)::Pakistani and other international students from North-Western Polytechnical University (NPU) visited the Chinese high-tech companies based in Xi, an and experienced their latest products.\t “The visit to the local high-tech companies is a good experience, which inspired me to work hard on my study and build Pakistan well”, said Shabih ul Hassan, a Pakistani student from NPU.\t Hassan, along with other international students of NPU, visited Micron (Xi’an), LONGi Wafer BU and Xi’an Research Institute of Huawei during the summer vacation in 2021.\t The students experienced the latest products of Huawei, and its Intelligent Eco system. Hassan showed special interest in Huawei’s product as he is a major in information and communication.\t “I once worked for Huawei on 4G LTE-A in Pakistan during 2017-2018”, Hassan told China Economic Net (CEN).\t Due to his interest in wireless mobile communication, Hassan chose to pursue his study in NPU in September 2018.\t He has written two research papers, which have been submitted in IEEE journals. He also has completed more than 10 international certifications during the past three years.\t Hassan who has successfully obtained the master’s degree in 2021 said, “I will study for a doctorate at University of Science and Technology of China in Hefei, Anhui province”.Â\t Besides good performance in his study, Hassan has always been helpful to others.During the outbreak of COVID-19 in 2020, Hassan worked for International Student office, NPU and voluntarily assisted teachers and students fighting against the pandemic.\t “I just did the routine work, like disinfection of the dormitory, shopping for groceries and doing distributions for other students. Nothing special”, said Hassan.\t “Weren’t you afraid of the novel coronavirus then”, facing this question, Hassan said he was also afraid of being infected by the virus. But he and team members still braved the coronavirus risk to facilitate other international students.\t “The risk we faced would be lower than that of letting everyone going outsides”, said Hassan.\t His performance is recognized by teachers and students so that Hassan was awarded by NPU for making outstanding individual contribution in fighting against epidemic in 2020. \t \t “As a Pakistani, I know that China and Pakistan are Iron-brothers. China’s donation was a tremendous help to Pakistan in the fight and prevention and control of COVID-19. Long live China-Pakistan friendship,” said Hassan.\t After studying and living in China for three years, Hassan thought that the young generation of China and Pakistan should spend time together to better understand each other’s culture and thoughts.\t In this way, the ironclad friendship can go from one to the next generation.APP/asg\\9328/30/2021 11:51:04 AM\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:09:09.443Z"
}
