{
  "title": "Banks to develop links with universities for conducting researches at par with market trends: President",
  "link": "https://www.app.com.pk/national/banks-to-develop-links-with-universities-for-conducting-researches-at-par-with-market-trends-president/",
  "date_published": "2021-08-30T10:59:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 30 (APP):President Dr Arif Alvi on Monday advised the banks to develop links with universities for nurturing the trend of conducting research on latest trends and demands of the market.\t  Speaking as a chief guest in the 4th Roundtable conference on Islamic Banking here, the President said why there was a need to establish separate organization for research when the students of universities were carry out studies on a variety of topics as a requirement of Mhil and Ph.D studies. \t He said the research students should be given guidance and patronage by the banking sector so as to align their efforts with the market requirements and modern trends. \t The banks would get the required researches while the students would be encouraged to work with more dedication, he added.\t Dr. Arif Alvi said the concentration of capital was painful and was too against the teachings of Islam as a good Islamic society opposed the accumulation of wealth.  \t Transfer of inheritance of wealth and property immediately after death of a person was the also spirit of the teachings of Islam, he noted.\t  He also called for establishing Islamic Shariah Compliance Instruments in Pakistan.The President observed that the discrepancies between the rich and poor sections had largely increased during the period of 2014 to 2018.\t The President said the institutions and organizations all over the world were being compelled to safeguard the interests of their customers, workers, society and also ensure justice. \t Dr Alvi also called for dedicating a proportion of loans by the banking sector for financing on women empowerment to enable them contribute positively in the sustainable development of the country.\t Earlier, Federal Minister for Finance and Revenue, Shaukat Tarin, Advisor to the Prime Minister, Dr. Ishrat Hussain, Governor State Bank of Pakistan, Dr. Reza Baqir, Chairperson Pakistan Stock Exchange, Dr. Shamshad Akhter, Chairman Shariah Board of Sindh Bank – Islamic Banking Division Mufti Muhammad Najeeb Khan also spoke while Governor of Sindh, Imran Ismail and other notables were also in attendance. \t Addressing the occasion, Dr. Ishrat Hussain said that Islamic Banking system got the potential to meet the modern challenges and it could appear as an alternative to the conventional system.\t He said both the parties got equitable shares in profit under the Islamic banking which, he termed as a beauty of the system. \t Dr. Ishrat Hussain also called for need to pay attention by the Islamic banking to the neglected sectors.\t Governor State Bank of Pakistan, Dr. Reza Baqir apprised the participants that the Islamic banking facility was available in over 60 countries and said it was moving in the right direction.\t He told the gathering that the Pakistani nationals settled aboard took keen interests in Shariah-complaint system. The response of the people on all the schemes which had been launched in the past two years in line with the Shairah-complaint were remarkable, he recalled.\t He also called for designing products for the agriculture and Small and Medium Enterprises (SME) sectors under the Shariah-Complaint system, to facilitate the people attached to these sectors.\t Speaking on the occasion, Mufti Najeeb said efforts were being made all over the world to promote the Islamic banking.\t Mufti Najeeb also suggested that the Islamic banking should be incorporated in the education curriculum of the country. \t He called for need to take steps to create awareness among the masses about the Islamic banking and promotion of Halal industry.\\9328/30/2021 3:55:39 PM\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:09:09.297Z"
}
