{
  "title": "Fawad urges world, regional powers to support for formatting inclusive Afghan government",
  "link": "https://www.app.com.pk/national/fawad-urges-world-regional-powers-to-support-for-formatting-inclusive-afghan-government-3/",
  "date_published": "2021-08-30T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain on Monday said an inclusive government was imperative for Afghanistan urging the world and regional powers to support the process.\nTalking to Turkish news channel TRT World, he said if mistakes of the past would be repeated in Afghanistan, the situation would get worse.\nThe government in Afghanistan has to be formed by Afghans, he said adding, the regional and the world powers have a heavy responsibility in facilitating this process. Pakistan was trying for installation of an all-inclusive broad based government in Afghanistan, he said adding, the country had been left alone in the past, and now the world was repeating the same mistakes.\n“If the same mistakes are repeated again, that means we will create a hub of extremists organizations right at the border of Pakistan which is obviously hugely worrisome for us.”\nHe said when erstwhile Soviet Union withdrew from Afghanistan in 1988, Pakistan had to deal with the situation and now the United States and NATO forces have withdrawn rapidly from Afghanistan, and Pakistan again was at the quagmire of the situation and dealing with the issue.\nNow Pakistan was keeping a close eye on this issue, said the minister adding that if the Afghanistan situation did not stabilize, millions of people would start moving towards Pakistan.\nHe said that Pakistan has already been hosting 3.5 million Afghan refugees for decades and Pakistan’s economy could no longer bear the burden of more refugees.\nThe efforts of the international community were necessary to solve the Afghan problem, said Chaudhry Fawad Hussain.\nHe said Pakistan was playing the role of a responsible country and striving for a stable Afghanistan was working with regional and international powers. Unrest in Afghanistan, he said, was detrimental not only to Pakistan but to the entire world.\nTo a question, he said as the change was bloodless, there was no crisis for refugees at the moment and borders were normal right now.\n“We have evacuated foreigners and those working in foreign companies from Kabul”, he said adding that over 4500 people have been evacuated from Kabul through Pakistan International Airlines. He said arrangements have been made for refugees at the border.\nThe minister said a comprehensive strategy has been formulated with regard to Afghan refugees as the government did not want to repeat the 1979 situation. It would not allow the refugees to move inside Pakistan. The world, he said, should come forward to help Pakistan for meeting the challenge.\nHe said the world did not pay heed to Pakistan Prime Minister Imran Khan’s advice, adding, the former Afghan President Ashraf Ghani did not hold general elections in the country which resulted in present crisis due to lack of the consensus government.\nHe said that two tracks including the troika plus including Russia, China, US and Pakistan and the other track comprising regional countries Turkey, Pakistan, Central Asia and Iran should take the leadership.\nThe minister said Pakistan and Turkey were in close cooperation on the issue as they were partners in peace in Afghanistan.",
  "retrievedAt": "2025-08-11T21:09:09.310Z"
}
