{
  "title": "Adopting austerity policy of KP Govt – just a Swing in the Air",
  "link": "https://www.app.com.pk/national/adopting-austerity-policy-of-kp-govt-just-a-swing-in-the-air/",
  "date_published": "2024-04-17T09:42:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 17 (APP):The tall claims of the Khyber Pakhtunkhwa government of adopting simplicity and austerity policy is just a Swing in the Air when a summary has been prepared for the purchase of Fortuner vehicle of worth Rs. 10.71 million for the adviser of the Social Welfare Khyber Pakhtunkhwa Mashal Yousafzai.\nOn one side the province is facing a financial crunch and on the other side the summary of buying cars for Social Welfare Advisor Mashal Yousafzai and Secretary Social Welfare Department is ready.\nAccording to the summary, a retail vehicle worth Rs 10. 71 million would be purchased for adviser Mashal Yousafzai. It has been mentioned in the summary that the 7-year term of the official vehicle of the Secretary of the Department has also been completed so another vehicle should be bought for the Secretary Social Welfare of worth Rs 7.3 million, the detail revealed.\nThe vehicles of Zakat and the Social Welfare Department are outdated, said the summary. Cabinet decided to buy cars for ministers, advisers, and assistants on October 17 2013, the summary said. In view of the austerity policy, the finance department has banned the purchase of new vehicles.\nThe ban on buying new vehicles should be removed, a request has been made to the Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur in the summary. It has been requested in the summary for giving approval to buy 2 vehicles – one for the Adviser to the Chief Minister on Social Welfare Mashal Yousafzai and the other for the Secretary Social Welfare Department.\nThe summary, singed by Dr Aneela Mahfooz Durrani, Secretary to Govt of KP Zakat, Usher, Social Welfare Special Education and Women Empowerment, Department on March 29, 2924 that including a request for the purchase of a Toyota Fortuner V 4X4 2694 CC Automatic Transmission of Rs. 17, 107,000 and Kia Sportage Alpha 1999 CC, Automatic Petrol.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:54:38.934Z"
}
