{
  "title": "Audit Report released by AGP discloses irregularities in BRT project",
  "link": "https://www.app.com.pk/national/audit-report-released-by-agp-discloses-irregularities-in-brt-project/",
  "date_published": "2024-04-17T12:50:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, April17 (APP):Audit Report 2022-23 released by the Auditor General of Pakistan disclosed irregularities worth billions of rupees in BRT project.\nThe Auditor General of Pakistan’s audit report related to BRT project 2022-23 has been released wherein expenditure of 13 billion rupees in Trans Peshawar was done without technical approval.\nExpenditure incurred under various contracts of BRT and unnecessary payments of Rs 7.7 million were made in the form of salaries and allowances.\nAccording to Audit Report, KP government has provided huge subsidy in projects built on loans and unjustified expenditure incurred in BRT project despite SSB.\nThe report highlighted the company does not have details of income from rental and other sources and Trans Peshawar made illegal payments of Rs 13 billion to companies without getting approval from the competent authority.\nContractors are benefiting from the contract for not getting approval from the law department and purchase and other records from Trans Peshawar sought but not provided, said the audit report.\nSavings due to increase in dollar value have not been deposited in the government treasury and due to non-increase in rent, the government exchequer has suffered a loss of 3 billion rupees in the form of subsidy, the audit report said.\nFares not hiked despite hike in petroleum product prices, the reports said. The provincial government had claimed to run the project without subsidy, the reports said. Income from the project has not been deposited in the government treasury, the reports further said.\nThe record of income earned in the interest of money kept in banks for the project has not been provided, the report added. Due to the non-completion of the construction of the project depot, the government suffered a loss of Rs 22 million, the report said.\nToken taxes of buses are being paid by Trans Peshawar instead of private companies and a loss of Rs 3 million was incurred in paying token taxes of BRT buses, the report said. Trans Peshawar paying sales tax instead of contractors, said the report.\nPenalty was not charged as per the contract for late delivery of buses from the supplier and due to not providing buses on time, there was a loss of Rs. 30 million.\nThe report further highlighted the irregularities in the project, which should be identified and recommended in the audit report, the Audit report said. The issue of loss of heavy amount faced by the government department should be addressed, the audit report recommended.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:54:32.135Z"
}
