{
  "title": "IFA inspects 80 food outlets, issues fines worth Rs 0.3 mln",
  "link": "https://www.app.com.pk/national/ifa-inspects-80-food-outlets-issues-fines-worth-rs-0-3-mln/",
  "date_published": "2024-04-17T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Deputy Director Operations (DDO) of Islamabad Food Authority (IFA), Dr. Tahira Saddique, while sharing a last week report of the authority, stated that the authority inspected 80 food outlets and imposed fines totaling Rs 307,000 on\nerrant shopkeepers found flouting regulations.\nTalking to APP, she said that with an unwavering commitment to quality assurance, the authority’s latest report underscored its relentless pursuit of adherence to food safety standards across the Federal Capital.\nOn the directions of Director Food, Irfan Nawaz Memon, she accompanied by the Food Safety Teams (FSTs) inspected\n80 establishments and sealed 17 outlets due to substandard food quality and inadequate arrangements, she said.\nAdditionally, she said a staggering total of 61 oral warnings were issued, signaling a zero-tolerance approach towards violations. Responding promptly to citizens’ concerns, the authority diligently addressed public complaints, ensuring accountability and responsiveness in its operations, Dr Tahira said.\nHighlighting its commitment to combating adulteration, Dr Tahira said the IFA disposed of 100 liters of milk, 109 liters of fake cold drinks, 35 kg of defective expired items to upholding stringent quality standards and protecting consumer welfare.\nOn the occasion, she appealed to the masses to cooperate with the food department in identifying illegal food production units that were operating in small houses to ensure public safety.\nNotably, the authority imposed a complete ban on the sale of Chinese salt, and gutka, emphasizing its commitment to upholding stringent standards of food safety and hygiene.\nDr Tahira Saddique reiterated the IFA’s dedication to fostering a healthy environment for the citizens of the federal capital.\nShe emphasized that strict action would be continued against those food outlets that were involved in selling adulterated\nor unhygienic food items. The safety of citizens was the topmost priority of the IFA and no negligence would be tolerated\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:54:37.393Z"
}
