{
  "title": "Bahawalpur police lodge FIR over Millat Express incident",
  "link": "https://www.app.com.pk/national/bahawalpur-police-lodge-fir-over-millat-express-incident/",
  "date_published": "2024-04-17T09:07:00.000Z",
  "source": "APP",
  "content": "BAHAWALPUR, Apr 17 (APP): On the complaint of the brother of deceased, Mariam Bibi who was allegedly thrown out from Millat Express Train and died on the spot, Bahawalpur district police have registered FIR against the employees of Railway Police.\nAPP received copy of FIR from police sources here. According to the FIR registered by PS Chani Goth, the body of the deceased woman identified as Mariam Bibi, the resident of Jaranawala Tehsil of Faislabad and living in Karachi was found in area Bait No. 5, Arain Wala/Dhaiwala/Lalo Naich/Chak.No. 158,159 and 160 NP lying wihtin jurisidction of Chani Goth police station of Ahmadpur tehsil of Bahawalpur district.\nPlaintiff, Muhammad Afzal, son of Muhammad Shoaib, the resident of tehsil Jaranwala of district Faisalabad submitted his application with Chani Goth police station on 16th April 2024.\nHe submitted that his real sister, Ms Mariam Bibi, 29-years-old had been living in C Area, Qayyumabad, Karachi to earn livelihood at a beauty parlour. “My sister had fast of 27th of Ramazanul Mubarak and along with her nephews includng 11-years-old Muhammad Ghalib and 9-years-old Kanwal rode train Millat Express on 7th April 2024 to proceed to Faisalabad,” he narrated in the application.\nThe plaintiff submitted that Mir Hassan, constable of Railway police harassed and misbehaved with his sister, Mariam Bibi and subjugated her of violence. “A passenger had captured the incident of torture in video which had gone viral across Paksitan,” the FIR said.\nThe plaintiff claimed that Mir Hassan took away her sister, Mariam Bibi to another biggie of the train and deprived her of cash and gold jewelry and later, threw her out of train in Chani Goth area.  “Mariam Bibi received fractures in bones of hands and feet and received critical wounds in head which caused her death,” the plaintiff submitted.\nFIR was also registered on two other employees of Railway Department for allegedly being accomplices of major accused, Mir Hassan. The plaintiff o the FIR submitted that the accused pushed Mariam Bibi out of train intentionally.\nInspector, Muhammad Javed posted at PS Chani Goth had put his signature on the FIR. Chani Goth police have launched investigation into the incident. It is being mentioned here that postmortem of the deceased woman was carried out by a lady doctor at Tehsil Headquarters Hospital in Ahmadpur tehsil of Bahawalpur district and later, the body was handed over to the heirs who took it away to Jaranwala tehsil of Faislaabad district. According to the postmortem report, the woman received critical wounds which caused her death.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:54:56.246Z"
}
