{
  "title": "QS Ranking: QAU top among Pak universities, 315th globally",
  "link": "https://www.app.com.pk/national/qs-ranking-qau-top-among-pak-universities-315th-globally/",
  "date_published": "2024-04-17T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Quaid-i-Azam University (QAU) Islamabad has been ranked top in Pakistani Universities, while 315th globally, demonstrating its excellence by securing impressive rankings in the QS Subject Ranking 2024.\nThe institution has shone with exceptional performances across various subjects, solidifying its position as one of the premier institutions of higher learning in Pakistan.\nThe Mathematics, Statistics & Operational Research, Physics, Chemistry, Materials Science, and Biological Sciences departments have achieved a world ranking between 201 to 351 and secured first positions in Pakistan in their respective subjects. The Pharmacy & Pharmacology department has also excelled by securing the 201th position globally and 2nd position in Pakistan.\nIn addition, Environmental Sciences , Agriculture & Forestry have secured a global ranking between 251 to 450.\nThe Computer Science & Information System, Economics & Econometrics, and Business & Management Studies departments have also achieved impressive rankings (351-451) as per the QS Subject Ranking 2024.\nProf. Dr. Niaz Ahmad Akhtar Vice Chancellor of the university congratulated everyone on this  outstanding achievement which is a testament to the hard work and dedication of the brilliant faculty, hardworking students, staff, ranking committee and alumni of the university.\nHe added that this is matter of pride that Quaid-i-Azam university secured “globally 40th position in citation index , 315th position and ranked No. 1 in Pakistan by QS ranking and other ranking agencies”.\n“We aim to maintain our reputation for excellence and continue improving and producing outstanding results in the future Great job, Quaid-i-Azam University, Pakistan”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:54:08.943Z"
}
