{
  "title": "CEC Raja leads delegation to study Brazil’s EVM system",
  "link": "https://www.app.com.pk/national/cec-raja-leads-delegation-to-study-brazils-evm-system/",
  "date_published": "2024-04-17T07:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP): A high-ranking delegation, headed by Chief Election Commissioner (CEC) Sikandar Sultan Raja traveled to Brazil to assess the viability and examine the electoral procedures related to Electronic Voting Machines (EVMs).\nThe delegation comprising Provincial Election Commissioner Aijaz Anwar Chohan, Director General (IT) Muhammad Khizer Aziz, and Director Nadeem Zubair, is implementing electronic voting machines (EVMs) across the country, following the example of Brazil and India,according to ECP spokesperson.\nThe Election Commission of Pakistan (ECP) acknowledges Brazil’s electoral process as one of the most advanced and technologically superior globally. Consequently, the ECP has opted to visit Brazil and engage in discussions with high-ranking officials from the Brazilian Superior Electoral Court (TSE).\nAcross a span of three days, numerous sessions were convened with various department heads of Brazil’s Election Management Body, the Tribunel Superior Electoral (TSE). These gatherings featured engagements with the Secretary of Communication & Multimedia, the Secretary of Information Technology, and the Head of Identification Management, each delivering in-depth presentations on their electoral methodologies and the Brazilian Electronic Voting Machine (EVM).\nThe demonstration of the EVM was also conducted. The major topics which were discussed include ‘Initiatives for strengthening the social confidence on the electoral processes’, “Introduction to the Brazilian EVM”, “Identification System being used in polling process”, and ”Special Advisory for fighting Disinformation”.\nFinally, an important meeting was held between the Chief Election Commission Sikandar Sultan Raja and the Chief Justice of Superior Court of Brazil /President Tribunal Superior Electoral (TSE) Alexender de Moraes on various vital topics including use of EVM.\nThe Election Commission plans to delve deeper into Brazil’s electoral system, particularly regarding EVMs, with the aim of implementing pilot projects in Pakistan. To accomplish this task, the ECP’s Information Technology Wing and Project Management Unit will collaborate.",
  "retrievedAt": "2025-08-11T01:54:36.330Z"
}
