{
  "title": "Pakistan, Azerbaijan relations based on historical, cultural, religious commonalities: Ayaz Sadiq",
  "link": "https://www.app.com.pk/national/pakistan-azerbaijan-relations-based-on-historical-cultural-religious-commonalities-ayaz-sadiq/",
  "date_published": "2024-04-17T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP): Speaker of the National Assembly Sardar Ayaz Sadiq on Wednesday said that Pakistan highly values its close brotherly relations with Azerbaijan that are based on historical, cultural, and religious commonalities.\n“Pakistan was committed to expanding its parliamentary and economic cooperation with Azerbaijan by expanding cooperation in all areas of mutual interest to attain the shared goal of progress and prosperity” The speaker expressed these views during a meeting with the Ambassador of Azerbaijan Khazar Farhadov, who called on him, said a news release.\nThe Ambassador presented a congratulatory letter from the Speaker of the National Assembly of Azerbaijan Sahiba Gafarova to Speaker Ayaz Sadiq on his successful election and invitation to visit Azerbaijan.Ayaz Sadiq thanked the Ambassador for conveying congratulations and invitation.\nThe Speaker underscored that the unanimity of views shared by both nations on different issues and forums was the manifestation of strong ties between Pakistan and Azerbaijan.\nHe appreciated Azerbaijani support to Pakistan on the principled stand of Kashmir. He also reminded that the Parliament of Pakistan passed a resolution to condemn Armenian Aggression in the Karabakh region of the Republic of Azerbaijan.\nWhile emphasizing strengthening the parliamentary relations between both nations, the Speaker said that parliamentary diplomacy between the two countries had always remained pivotal in fortifying the good relations and now it would be used more actively to support government efforts.\nThe Speaker also stressed the need to revive parliamentary friendship groups between the parliaments of the two countries for better collaboration. The two sides also discussed the contours of the trilateral conference to be held in Pakistan.",
  "retrievedAt": "2025-08-11T01:54:10.679Z"
}
