{
  "title": "32 people died, 41 other injured in rain, flood related incident in KP: PDMA",
  "link": "https://www.app.com.pk/national/32-people-died-41-other-injured-in-rain-flood-related-incident-in-kp-pdma/",
  "date_published": "2024-04-17T07:25:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 17 (APP): Provincial Disaster Management Authority (PDMA) on Wednesday issued a report of loss of life and property in the province due to heavy rains and flood related incident as many 31 people have died with 41 injured in different districts across Khyber Pakhtunkhwa.\nAccording to the report issued by PDMA, 15 children, 12 men and 5 women are among the dead, while the injured include 6 women, 28 men and 7 children. A total of 1370 houses were damaged due to the collapse of walls and roofs in different districts, in which 160 houses were completely damaged and 1210 houses were partially damaged, PDMA report said.\nDue to heavy rains, life and financial accidents occurred in various districts of Khyber including Dir Upper and Lower, Chitral Lower and Upper, Swat, Bajaur, Shangla, Mansehra, Mohmand, Malakand, Karak, Tank, Mardan, Peshawar, Charsadda, Nowshera, Bunir, Hangu, Bataghram, Bannu, North and South Waziristan, Kohat, Dera Ismail Khan and Orakzai District, the report of the PDMA said.\nOn the special instructions of the Chief Minister of Khyber Pakhtunkhwa Ali Amin Gandapur, the PDMA released Rs. 50 million to the administration of 12 affected districts for financial assistance to the families of those who lost their lives in the recent rains, the PDMA report said.\nRs 20 million for Nowshera, Dir Lower Rs 5 million, Swat and Malakand Rs 3.3 million, Dir Upper and Tank Rs 2.2 million, and Rs. 1 million each for Chitral Lower, Bitaghram, Karak, Peshawar and Charsadda.\nThe PDMA also released 10 million rupees in general relief to Chitral Lower and Rs. 81 million to the administration of various districts since March 29 to deal with the emergency situation, the report said.\nAccording to the relief policy, the said funds can be used for the financial support and relief activities of the victims, PDMA said. Help and rehabilitation of the affected family due to rains is our first priority, PDMA said.\nMeanwhile, Complex Emergency Wing PDMA has released an amount of Rs. 80 million for tribal areas, said Subia Hassam, Director PDMA. The said amount has been given to the concerned district administration for relief activities in tribal areas, Director PDMA informed.\nThe North and South Waziristan were given Rs. 20 million, Kurram five million, Khyber 1.5 million, Bajaur one million and Mohmand also one million respectively, Director PDMA Complex Emergency Wing said.\nIn any emergency situation, more funds will be given to the concerned district administration immediately, said Subia Hassam.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:55:02.801Z"
}
