{
  "title": "Political parties advised to adhere to ECP rules, regulations in by-elections",
  "link": "https://www.app.com.pk/national/political-parties-advised-to-adhere-to-ecp-rules-regulations-in-by-elections/",
  "date_published": "2024-04-17T13:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 17 (APP):The Election Commission of Pakistan (ECP) has urged all political parties and candidates participating in the upcoming by-elections to uphold Pakistan’s Constitution, avoid actions that could harm national interests or institutions, comply with Election Commission regulations, and refrain from defaming the commission.\nAccording to the code of conduct, high-ranking officials including the President, Prime Minister, Speaker/Deputy Speaker of assemblies, federal and provincial ministers, governors, mayors, and their deputies are prohibited from participating in election campaigns. However, members of the Senate and local government could participate in the campaign while observing strictly the Election Commission’s code of conduct.\nExceptions apply to speakers, deputy speakers, and local government office bearers contesting elections from their constituencies, provided they refrain from using official resources or announcing development schemes during their campaign.\nContestants must respect people’s rights as per the constitution and law, refrain from actions undermining Pakistan’s ideology, sovereignty, integrity, security, morality, public order, or judiciary and armed forces.\nViolations may result in contempt under Section 10, of the Elections Act 2017.\nThe code prohibits the offering of gifts or inducements to influence candidates, mandates cooperation with law enforcement for election security, and requires political parties to ensure equal opportunity for men and women in the selecting of candidate, with a minimum representation of five percent women candidates.\nAdditionally, they must adhere to Election Commission directives, maintain public order and morality, and refrain from maligning the Election Commission, with violations subject to contempt under the Elections Act 2017.\nContestants must cooperate with law enforcement for election security. Parties must provide equal opportunities for men and women in candidate selection, ensuring a minimum of five percent representation of women candidates as mandated by Section 206 of the Act.\nPolitical parties, candidates, election agents, and their supporters are prohibited from barring any individual from becoming a candidate or exercising their right to vote based on gender identity. Parties must promote women’s participation in the electoral process. Destruction of election materials is considered a corrupt practice, and parties should discourage such actions among their workers.\nSoliciting support from public servants or hindering the election process through their influence is illegal. Public servants are also prohibited from supporting any political party or candidate in a manner that could impact the election outcome. Contesting candidates and their supporters must avoid incitement to violence during the campaign and polling, condemn violence, and refrain from language that could lead to violence or cause harm to individuals or property.\nOn polling day, the code says contesting candidates can appoint polling agents at each polling station and three election agents for the entire constituency. However, during the counting and result consolidation, only one authorized agent per candidate will be present.\nAccording to Section 133 of the Elections Act 2017, candidates must open a dedicated bank account for election expenses or designate an existing account, submitting a statement to the Returning Officer when filing nomination papers.\nAll donations and expenditures related to the election must be deposited and made from this account, and candidates are prohibited from conducting any transactions other than election expenses from the nomination filing to the submission of the election expense return.\nAll election expense transactions should ideally involve GST registered entities. Candidate election expenses encompass costs incurred by individuals, political parties acting on the candidate’s behalf, or specifically for the candidate by a political party.\nPolitical parties, candidates, and election agents must ensure that their workers do not influence print or electronic media or resort to violence against them. A complete ban on carrying and displaying weapons in public gatherings, processions, and on polling day until twenty-four hours after official result consolidation must be strictly adhered to, except for security personnel with valid licenses and permission from the Deputy Commissioner or relevant authority. Any form of firing, including aerial firing and use of explosives, at public meetings or near polling stations is prohibited and considered an illegal practice.\nSecurity personnel assigned to protect political leaders or candidates are exempt from the ban on carrying weapons, provided they possess valid licenses and obtain prior permission from the Deputy Commissioner or relevant authority. All forms of firing, including aerial firing, use of crackers, and explosives, at public gatherings and near polling stations, are strictly prohibited, with violations considered illegal practices.\nA complete ban is imposed on holding public meetings or processions within a constituency for forty-eight hours before the poll’s conclusion, marking the end of the election campaign. Political parties must ensure discipline among their candidates and supporters, guiding them to follow the code, laws, and regulations, abstain from irregularities, and adhere to election rules.\nPolitical parties are prohibited from using public funds for publicity campaigns in print, social, and electronic media. Misuse of official mass media by governments for partisan coverage during the election campaign is also prohibited.\nDoor-to-door canvassing is permitted for political parties, candidates, and election agents, including the distribution of voter’s perchee containing complete voter details from the electoral rolls. However, distributing voter’s perchee at polling stations on polling day is allowed, but printing the candidate’s name and election symbol on it is strictly prohibited.\nPolitical parties and individuals are restricted from affixing or distributing posters, handbills, pamphlets, leaflets, banners, or portraits larger than the sizes prescribed by the Election Commission. The name and address of the printer/publisher must be printed on these materials.\nAdditionally, to preserve the sanctity of Quranic verses, sayings of the Holy Prophet (Peace Be Upon Him), or scriptures of other religions, parties, candidates, and election agents are urged to avoid printing them on publicity materials and maintain discipline among members to uphold this sanctity.\nPolitical parties, candidates, election agents, or supporters cannot affix posters on walls or buildings without prior approval of the owner/institution. Affixing posters on public places, bridges, national institutions, and installations is strictly prohibited.\nHoardings, billboards, wall chalking, and panaflexes of any size are completely banned. Pictures of government officials cannot be printed on any publicity material. Once affixed, posters, portraits, and banners by one party cannot be removed, and distribution of handbills and leaflets cannot be prevented by workers of another party. Party flags cannot be hoisted or fixed on any public building or property without permission.\nPrivate land, buildings, or compound walls cannot be used for erecting flagstaffs or pasting notices without owner permission. Executive authorities at all levels must refrain from using state resources to unfairly advantage a particular candidate or political party or exercise undue influence affecting the interest of any candidate or party in elections.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:54:31.742Z"
}
