{
  "title": "PM directs timely release of funds for NHA highway projects",
  "link": "https://www.app.com.pk/national/pm-directs-timely-release-of-funds-for-nha-highway-projects/",
  "date_published": "2021-09-22T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP): Prime Minister Imran Khan on Wednesday directed timely release of funds for the highway projects to ensure connectivity, trade and employment opportunities for rural and urban areas.\nChairing a meeting to review the progress on projects under National Highway Authority (NHA), the prime minister said roads played a vital role in economic development.\nThe prime minister said the roads of good standard would also reduce the cost of vehicle maintenance and import of petroleum products.\nHe said he would personally review the progress on important and major communication projects on a daily basis.\nThe meeting was attended by Federal Minister for Communications Murad Saeed, Minister for Planning Asad Umar, Special Assistant Dr Shahbaz Gill, Deputy Chairman Planning Commission Jahanzeb Khan, the Chairman NHA and senior officials.\nGiving a comparative review, Federal Minister for Communications Murad Syed said only 645 km of roads were constructed by the previous government during 2013 and 2014. A total of 1,753 km of roads have been completed in the three years of the present government.\nHe said in terms of planning, only 858 km of roads were completed in three years of the previous government compared to the 6,118 km of roads completed during the same period of the present government.\nThe meeting was informed that NHA would complete 27 projects during this fiscal year. More than 3,000 km long roads are being constructed in Balochistan province.\nIt was highlighted that as per the prime minister’s vision of self-reliance, the projects were being completed through public-private partnerships instead of loans.\nThe meeting was given a detailed briefing on the progress on highways including from Rawalpindi to Kharian, Mianwali to Muzaffargarh and Hyderabad to Sukkur.",
  "retrievedAt": "2025-08-11T21:18:29.070Z"
}
