{
  "title": "Govt strives for expatriates’ inclusion in policy making: Qureshi",
  "link": "https://www.app.com.pk/global/govt-strives-for-expatriates-inclusion-in-policy-making-qureshi/",
  "date_published": "2021-09-22T16:17:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 22 (APP):Foreign Minister Shah Mahmood Qureshi Wednesday said the government was striving for inclusion of overseas Pakistanis in country’s policy making process as efforts were underway despite all odds.\nThe foreign minister, addressing the Pakistani community members here during his visit mainly to attend the UN General Assembly session, said Imran Khan always advocated for granting voting right to the expatriates.\nChairman of Parliamentary Committee on Kashmir Shahryar Afridi, Permanent Representative of Pakistan to UN Ambassador Munir Akram, Pakistan Ambassador to US Asad Majeed also attended the event.\nThe government has also made legislation in this regard and would keep up efforts despite all odds.\nHe told the gathering that Imran Khan always desired to specially focus the welfare of the overseas Pakistanis.\nHe thanked Chairman of National Database and Registration Authority for taking measures to facilitate the Pakistani community enabling them to obtaining official documents without any hassle.\nThe foreign minister thanked the community for sending $29.4 billion remittances despite COVID pandemic and its adverse impacts on businesses. Around $3 billion remittances came from the US, he added.\nHe highlighted that an FM Portal had been introduced initially in five countries including the US which would be expanded to 21 countries in next phase.\nQureshi said having its influence in US politics, the Pakistani community could play a role to serve Pakistan’s national interests.\nHe said the government had also introduced an FM Honors List to recognize the services of Pakistanis expatriates particularly during the COVID-19 for their countrymen.\nHe told the community that the government had also introduce various measures to facilitate the investment of expatriates in Pakistan as they had already deposited over $2 billion though Roshan Digital Account.\nTouching the Afghanistan situation, he said Pakistan had fully supported the diplomatic personnel and citizens of various countries for evacuation from Kabul but unfortunately the gesture was not given due recognition.\nThe foreign minister said no one should impede the process of granting voting right to expatriates as the government was taking steps to make the system error-free. The foreign minister also inaugurated a NADRA Center at Pakistan’s NEW York Consulate to provide the facilities like issuance of NICOP, family registration certificate and succession certificate as well as a land record center and new website.",
  "retrievedAt": "2025-08-11T21:18:44.292Z"
}
