{
  "title": "Ehsaas Undergrad Scholarship portal to reopen on Sep 30",
  "link": "https://www.app.com.pk/national/ehsaas-undergrad-scholarship-portal-to-reopen-on-sep-30/",
  "date_published": "2021-09-22T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP):The steering committee of Ehsaas Undergraduate Scholarship programme during its ninth meeting held here Thursday decided to reopen the Ehsaas scholarship application portal on September 30.\nThe online portal will remain open for next two months to receive new applications for the academic year 2021-22.\nSpecial Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar and Executive Director, Higher Education Commission (HEC), Dr. Shaista Sohail co-chaired the meeting.\nDr. Sania stressed on the need for timely payments to students so that they do not have to take loans.\n“This is not a reimbursement model. Students have to be paid on time, to facilitate them”, she said.\nShe also instructed HEC to strictly reprimand universities who do not pay students on time and those who deduct money from the Ehsaas scholarship stipend amount on account of other expenses.\nFurther, she instructed that full visibility should be made of those universities which have done this and that they should be blacklisted.\nDr. Sania also instructed staff to make a visibility dashboard and stressed on the need for each participating university to be transparent about when they receive money from Ehsaas, vis-à-vis, the cheque numbers and dates on which students have been given stipends.\n“This is very much in line with the transparency policy of Ehsaas where all benefits going to beneficiaries are publicly posted online, as for Ehsaas Kafaalat”, Dr. Sania added.\nAll students with family income of less than Rs. 45,000 a month studying in the undergraduate programme across any of the 129 public sector universities recognised by HEC will be eligible to apply. In the last two academic years, over 142,000 need-cum-merit based Ehsaas undergraduate scholarships have been awarded. This year also, 50,000 scholarships will be awarded to deserving students.\nStudents will be able to apply through the online portal: https://ehsaas.hec.gov.pk/.The need cum merit-based undergraduate scholarship of Ehsaas covers hundred percent tuition fee of the university and a living stipend.\nEhsaas undergraduate Scholarship programme will support 200,000 students from low-income backgrounds over four years. Total budget is Rs. 24 Billion.The programme covers all the four provinces, Azad Jammu and Kashmir, Gilgit Baltistan and Islamabad Capital Territory.\nAs part of the undergraduate scholarship policy of Ehsaas, fifty percent of awardees are girls.For already enrolled awardees, their academic performance will be tracked, and subject to satisfactory academic progress, they will continue to receive the Ehsaas scholarship till the completion of their undergraduate degree.",
  "retrievedAt": "2025-08-11T21:18:29.040Z"
}
