{
  "title": "Cancellation of NZ tour outcome of Indian hybrid war against Pakistan : Fawad",
  "link": "https://www.app.com.pk/national/cancellation-of-nz-tour-outcome-of-indian-hybrid-war-against-pakistan-fawad/",
  "date_published": "2021-09-22T11:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain said on Wednesday that cancellation of New Zealand Cricket Team’s tour of Pakistan was result of fifth generation hybrid war against Pakistan as fake news was generated by India to scuttle the tour.\nAddressing a joint press conference along with Minister for Interior Sheikh Rashid Ahmed here, he said India had been hatching conspiracies against Pakistan but like the past it would fail to weaken Pakistan’s standing at international level.\nHe said that India had done huge investment in Afghanistan to use its soil for operating terrorists in Pakistan but after fall of Kabul all its investment was wasted.\nThe minister disclosed that the threatening email was generated from a secure service Proton mail and Pakistan has requested Interpol to assist for further probe.\nHe said that on August 19, a Facebook post was circulated from fabricated account made in the name of Ehsan Ullah Ehsan (ex spokesman of Tehreek e Taliban Pakistan) on social media asking New Zealand Cricket Board and government not to send the team to Pakistan, as plan had been made to target the New Zealand team but the post was not found on Facebook.\nHe said that after  two days, Indian newspaper Sunday Guardian, Bureau Chief Abhinandan Mishra wrote an article claiming that the New Zealand cricket team may face a terrorist attack in Pakistan. The article was based on the fake post of Ehsan Ullah Ehsan.\nMishra was also found in contact with former Afghan Vice President Amrullah Saleh, he said.He said that projection of threat by publication of an article by the Bureau Chief of a reputed Indian paper based on a fake social media post suggested an orchestrated campaign to scuttle the tour.\nFawad said that on August 24, Martin Guptill’s wife received a threat email from email ID : tehreekelabaik@protonmail.com, threatening to kill Martin Guptill while on tour. The email ID was not associated with any SMN.\nInterestingly the said email account was generated at 01:05 am, on Aug 24 and emailed on the same day at 11:59 am, he pointed out. It was obvious that the email was generated purposefully as no other activity was found from the same email.\nHe said that despite all these tactics, New Zealand tour was not cancelled and its team arrived in Pakistan on September 11 and 12 in two chartered flights. The team attended practice sessions at Rawalpindi Cricket Stadium on September 13 and 14 from 4:30 to 7:30 pm and no threat alert was reported.\nBoth the teams again carried out practice in the evening on September 16.  He said on September 17, NZ team/ government expressed concern over the reported credible threat and cancelled the tour unilaterally without sharing the details of the threat.\nHe said that on September 18, 2021, Interpol Wellington informed Interpol Islamabad about receipt of a threat email to New Zealand Police from hamzaafridi7899@gmail.com at 06:25 am (NZ time), requesting further probe.\nHe said that New Zealand police received a threat email at 06:25 am on Sep 18, according to Pakistan Standard Time 23:25 (11:25 pm on Sep 17).Fawad said Email hamzaafridi7899@gmail.com was generated at 18:10 hrs, Sep 17 (UTC); 2310 hrs/ 11:10 PM (PST).\nFawad said that email was sent 15 minutes after the ID was created and it was generated for a specific purpose.\nThe minister said email was sent from an associated device in India using VPN showing IP address/ location of Singapore.\nThe device RMX 1971 (Realme) used thirteen  email IDs; except Hamza Afridi all other 12  email IDs have Indian/ Hindi names. Apparently, Hamza Afridi was purposefully used to malign Pakistan which hints at involvement of Indian agencies.\nHe said that the subject mobile phone was launched in August 2019 in India and Reliance Jio mobile SIM was registered on this mobile phone on September 25, 2019 indicating single user.\nHe said that social media co-relation and exploitation revealed that the possible user of this email ID is an Indian Omparkash Mishra from Mumbai.\nHe said that timing and text of the threat email suggest that this threat was not the reason for cancellation of the tour but was issued just after the cancellation to malign Pakistan and substantiate the security concerns of New Zealand and other touring countries.\nHe said that Abhinandan Mishra wrote another column on Sept 18 titled “Threat of Kabul Airport-like attack led NZ to cancel Pak tour”.\nFawad said that involvement of Indian media and Intelligence Agencies in a systematic campaign to malign Pakistan based on a concocted/ orchestrated social media campaign indicate mala fide intent.\nHe said  that  FIA would  contact Interpol/ Proton mail for provision of detail out tehreekelabaik@protonmail.com. He said Pakistan was sure that the same agencies were behind this email ID which had sent the threat mail form Hamza Afridi account.\nHe said that FIA was in contact with Interpol to provide further details of email IDs and Pakistan would also request other cricket teams to share security related concerns, if any.He said that the Indian Disinformation campaign based on false threat alert led to unilateral cancelation of tour by New Zealand.\nThis, he said, was  a very serious trend and ICC must take notice of these nefarious and  malicious acts of Indian nationals, otherwise it will adversely impact the “Gentleman’s Game” for many years to come.\nHe said that Pakistan has learnt  that a similar threat has been sent to West Indies cricket board from another concocted email ID ehshanullahehshan@protonmail.com. We are in the process of investigating, however, it is interesting to note that nobody in knowledge of Urdu can spell “ehsan” as “ehshan”. This spelling mistake in the ID reflected concocted involvement of Indian hands.\nHe said that during Shanghai Cooperation Organisation (SCO) summit the information reached there at a time when PM Imran Khan was to make his speech.\nHe said that after the speech, the prime minister was informed about the New Zealand’s decision to abandon the tour. He was requested by Chairman Pakistan Cricket Board (PCB) Rameez Raja to call his New Zealand counterpart to assure her about security of its players. Prime Minister told the New Zealand’s Prime Minister that cancellation of the tour would result in people’s frustration and anger.\nBut she insisted that she had critical information about the plot to attack New Zealand cricketers.He said that British High Commissioner has categorically stated that no change in green advisory for Pakistan has been made. Fawad said that if the government had no objection, the England Cricket Board had no right to cancel the tour. Reference to fatigue factor was a frivolous plea by the England and Wales Cricket Board (ECB).\nHe said that PCB chairman Rameez Raja, foreign ministry and Interior ministry would take up the issue at all concerned forums. The minister thanked Cricket fraternity including international players and cricket lovers from all over the world for supporting Pakistan.",
  "retrievedAt": "2025-08-11T21:18:35.064Z"
}
