{
  "title": "Pakistan calls for effective strategy to meet D-8 Roadmap 2020-2030",
  "link": "https://www.app.com.pk/global/pakistan-calls-for-effective-strategy-to-meet-d-8-roadmap-2020-2030/",
  "date_published": "2021-09-22T16:41:00.000Z",
  "source": "APP",
  "content": "NEW York, Sep 22 (APP): Pakistan on Wednesday called for the need to adopt an effective strategy and monitoring mechanisms to ensure implementation of the decisions and initiatives of the D-8 Decennial Roadmap 2020-2030.\nAddressing an informal luncheon of D-8 Ministers hosted by Bangladesh, as Chair of the D-8, on the sidelines of the 76th session of the UN General Assembly here, the foreign minister reaffirmed Pakistan’s commitment to D-8 objectives and vision.\nHe also highlighted the country’s role in achieving the goals of the Organization.\nQureshi noted that, among other meetings, Pakistan hosted the 8th D-8 Summit in 2012 which adopted two landmark documents including the D-8 Charter and its Global Vision. The 15th and 16th sessions of the D-8 Council of Foreign Ministers (CFM) were also hosted by Pakistan in 2012 and 2013, he added.\nThe foreign minister also reiterated the five-pronged roadmap proposed by Prime Minister Imran Khan at the 10th D-8 Summit including (i) mobilizing resources to recover robustly from the economic and health crises induced by the COVID pandemic; (ii) taking concrete actions to take intra D-8 trade to US$ 500 billion by 2030; (iii) developing a “Youth Engagement Strategy”; (iv) intensifying cooperation for technological development; and (v) making D-8 more relevant to the lives of D-8 citizens by promoting food security, enhancing health and sports cooperation.\nForeign Ministers and Representatives of D-8 Member States including Bangladesh, Egypt, Indonesia, Iran, Malaysia, Nigeria, Pakistan and Turkey attended the luncheon meeting.\nD-8 Secretary General briefed the participants on the activities and new initiatives undertaken by D-8 Secretariat since the last CFM held in April 2021.\nD-8 was established in Istanbul in 1997 to promote development cooperation among its member countries.",
  "retrievedAt": "2025-08-11T21:18:42.324Z"
}
