{
  "title": "Sheikh denies any ‘real threat’ to NZ cricket team",
  "link": "https://www.app.com.pk/national/sheikh-denies-any-real-threat-to-nz-cricket-team/",
  "date_published": "2021-09-22T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP):Minister for Interior Sheikh Rashid Ahmad on Wednesday categorically said that there was no ‘real threat’ to the New Zealand cricket team, terming it all just a “drama’ created for the purpose.\n“Abrupt abandonment over security fear and deciding to return back shows there is a conspiracy behind the cancellation of this tour as foolproof security was provided to the squad,” Sheikh Rashid said while addressing a joint press conference along with Minister for Information and Broadcasting Chaudhry Fawad Hussain.\nSheikh said, “We are a strong nation and always ready to face any tough situation. I am sure time will come when all these international teams will come and play in Pakistan.”\n“I assure you the government of Pakistan will make its utmost efforts under the leadership of Prime Minister Imran Khan for the prosperity and progress of the state,” he added.\nHe said that the Pakistan Army was proficiently accomplishing its responsibility to safeguard the country and performing duties on borders to protect every inch of the motherland. He said that Pakistan’s security agencies were vigilant to respond to any threat from enemies.\nThe minister said, “When the New Zealand team members were staying in Pakistan there were many other important personalities present in Pakistan at that time.”\nSheikh said that India was running 66 terrorist camps against Pakistan in Afghanistan. He added India always remained busy in planning terrorist activities in Pakistan as it releases and trains prisoners from its jails to engage them for terrorism in Pakistan.\n“We had sacrificed more than any country in the world with the loss of 80,000 lives and over 100, 000 who received injuries and disabilities, but still our morals are high with having the world’s most professional and sound army.”\nHe said that Pakistan had a historical role for ensuring safe evacuation of foreigners from Afghanistan and the country played its role for regional peace. He added Pakistan helped evacuate over 10,000 people, including the NATO forces, International Monetary Fund, World Bank officials and Americans from Afghanistan.\nSheikh said, “Our borders are safe, peaceful, and protected including Torkham and Chaman. Our enemies are trying to defame Pakistan through hybrid war and media propaganda,” he added.He made it clear that there was no Afghan refugees’ camp in Pakistan. He said that Pakistan had an important role in the region.\nSheikh said India was spreading negative propaganda against Pakistan as all its conspiracies failed after the Taliban took control of Afghanistan. He said that no one could hurt Pakistan’s sovereignty and its armed forces were always prepared to give a befitting reply to the enemy.",
  "retrievedAt": "2025-08-11T21:18:33.543Z"
}
