{
  "title": "President urges corporate sector to promote Brand Pakistan",
  "link": "https://www.app.com.pk/national/president-urges-corporate-sector-to-promote-brand-pakistan/",
  "date_published": "2021-09-22T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP):President Dr Arif Alvi Wednesday urged the corporate sector of the country to promote Brand Pakistan by achieving distinction through their trustworthiness and vision.\nThe president, addressing the “Leaders in Islamabad Business Summit” here, said currently the vested interests dominated the morality in international relations and Pakistan could emerge as leader by making up this deficiency.\nHe said despite massive human rights abuses by Indian Occupation Forces in Indian Illegally Occupied Jammu and Kashmir, there was no action from the international community to address the agonies of Kashmiri people, mainly because of economic interests.\nHeld by Nutshell Conferences and Martin Dow, the moot was attended by representatives of various corporate sector organizations from banking, telecom, IT, business solutions and others.\nThe president said the western powers, advocating the human rights, let the homeless people drown in the Mediterranean but contrarily, Pakistan set an example of morality by hosting around four million refugees.\nHe lauded the corporate sector for carrying out the welfare works under corporate social responsibility during the distressing times.\nHe said having faced defeat in Vietnam War, the United States did not learn lesson rather entered into another war in 90s.\nReferring to the fake news phenomenon, the president said the same phenomenon was said to be behind the New Zealand’s decision to abandon the Pakistan tour recently. The very tendency would have huge impact on the future generations as it impacted even the US elections, he added.\nThe president called for improving the communication skills to leave no room for any misunderstanding.\nHe said the successful elimination of terrorism, welfare works during floods and discipline showed during the COVD-19 were in fact the strengths of Pakistan which would also define the future course for the country.\nThe president told the gathering that no nation could progress merely on the basis of resources rather it was the broad mindedness and intellect which led them to the point.\nHe said on the basis of very intellect of its scientists, Pakistan became an atomic power within a span of seven years.\nEarlier, Founder of Nutshell Conferences Azfar Hassan said they planned to make the summit as an annual feature and prove it as one of the biggest moots in the region.",
  "retrievedAt": "2025-08-11T21:18:25.836Z"
}
