{
  "title": "Australia announces additional A$5 million financial support for flood relief operations",
  "link": "https://www.app.com.pk/national/australia-announces-additional-a5-million-financial-support-for-flood-relief-operations/",
  "date_published": "2023-02-15T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):The Government of Australia has announced to double its support to the Pakistan flood response by providing an additional A$5 million in immediate humanitarian assistance, bringing its total support to A$10 million.\nThis new funding will complement government efforts to address the serious nutrition situation facing communities affected by the devastating flooding in Pakistan. According to a press release issued here by the Australian High Commission in Islamabad, Australia’s Minister for Foreign Affairs, Senator the Hon Penny Wong, said, “The growing scale of food insecurity and human suffering is deeply concerning. The Australian Government is committed to ensuring our humanitarian assistance responds to the greatest needs.”\nMeanwhile, Australia’s High Commissioner to Pakistan, Neil Hawkins, in a meeting with the Chairman of the National Disaster Management Authority, Lt Gen Inam Haider Malik on 14 February said, “This additional funding will help alleviate the poor food security and nutrition situation, particularly focusing on women and children.”\nLast month, the High Commissioner visited Sindh and met with flood-affected communities, and toured their villages. Reflecting on the visit, Mr. Hawkins said, “Thousands of people in Sindh are still suffering from the impacts of the floods. I was pleased to witness our assistance reaching directly into the hands of the most vulnerable. We are determined our support continues to be distributed rapidly and targeting the poorest.”\nIt is pertinent to mention here that Australia’s assistance to date has supported cash-based transfers, minor rehabilitation works, and logistics in partnership with the World Food Programme. Australia will channel this new support through trusted UN and NGO partners.",
  "retrievedAt": "2025-08-11T06:05:37.305Z"
}
