{
  "title": "Experts for ‘aggressive response’ to counter Indian attempt to modify Indus treaty",
  "link": "https://www.app.com.pk/national/experts-for-aggressive-response-to-counter-indian-attempt-to-modify-indus-treaty/",
  "date_published": "2023-02-15T15:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): In order to counter India’s attempt to modify the Indus Waters Treaty, the water experts on Wednesday stressed the need to retaliate with a pragmatic response and strong projection of its legal stance.\nThe experts made the remarks during a roundtable discussion titled “Indus Water Treaty Arbitration – Battle over Water Sharing” organized by the Institute of Policy Studies (IPS) here.\nSpeaking on the occasion, Secretary of Water Ministry Mirza Hamid Hassan said India designed its water projects with storages of a higher level and obstructing river flows more than what was permitted under the Treaty.\nHe said that India upheld the neutral expert’s decision on using silt clearance technology in Baglihar Dam and ignored the subsequent decision of the International Court of Arbitration in 2013 which refuted the use of silt technology for more water storage and overturned the neutral expert’s decision as far as live storage is concerned.\nPutting forward his recommendations, he stressed that a very calculated response and a comprehensive action plan on the part of the government were required, coupled with the capacity building of relevant institutions.\n“Pakistan must be ready to take the matter to the UN if India continues to boycott the proceedings of the International Court of Arbitration,” he added.\nFormer federal secretary Water Ministry Ashfaq Mahmood underscored that India’s attempt to make amendments to the IWT would not be fruitful as the modification which India was claiming already present in Article IX of the IWT on the “settlement of differences and disputes”, which mentioned the ways and means to resolve issues.\nOn the shortage of information and scholarly intelligence on Pakistan’s point of view on this issue, Legal expert Ameena Sohail highlighted and stressed the need for an in-depth study of IWT for a stronger projection and enhanced capability to interpret its provisions to present argumentative assertions, develop academic content, and convince the international community of Pakistan’s stance.\nWhile concluding the session, Chairman IPS Khalid Rahman said it was critical that despite Pakistan’s case being true and proactive, its projection was still in a passive and defensive mode.\nHe said that institutional incapacities and professional inadequacies were the underlying causes, it is all related to a vicious cycle of poor governance in Pakistan.\nThe chairman suggested that Pakistan required comprehensive preparations for developing an action plan, projecting its narrative, and retaliating with a pragmatic and reasoned response that encompasses all dimensions of the water dispute.",
  "retrievedAt": "2025-08-11T06:04:51.731Z"
}
