{
  "title": "India warned against fiddling with demographic composition of IIOJK",
  "link": "https://www.app.com.pk/national/india-warned-against-fiddling-with-demographic-composition-of-iiojk/",
  "date_published": "2023-02-15T10:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): The All Parties Hurriyat Conference leadership while reiterating the appeal for a complete shutdown against the ongoing eviction and demolition campaign by the Modi regime in Indian illegally occupied Jammu and Kashmir on Wednesday has warned India against fiddling with the demographic composition of the territory.\nAccording to Kashmir Media Service, Senior APHC leader and Jammu and Kashmir Democratic Freedom Party Chairman Shabbir Ahmad Shah in a message from New Delhi’s Tihar Jail while voicing his party’s serious concern over the land eviction drive said that after stripping Jammu and Kashmir of its special status, the Modi regime is now hell-bent on snatching livelihoods from Kashmiris and depriving them of land and properties they have inherited from their fathers and forefathers.\nUrging people to come forward in a big way to thwart the RSS-influenced apartheid regime’s nefarious designs, Shabbir Shah said it was high time that the Kashmiris regardless of their political affiliations should unite to resist New Delhi’s move to settle non-Kashmiris in the territory.\nThe APHC leader said the land eviction campaign is a deep-rooted conspiracy aimed at diluting the specific identity of the indigenous people and reducing them to second-class citizens in their own homeland. Backing the APHC’s call for a widespread strike tomorrow, the DFP chief appealed the masses to observe a complete strike on the day to express their resentment against the move.\nAnother senior APHC senior leader and Insaf Party chairman Ghulam Ahmed Gulzar, in a statement in Srinagar, said the RSS-led regime is hell-bent on turning Jammu and Kashmir into another Palestine.",
  "retrievedAt": "2025-08-11T06:05:27.212Z"
}
