{
  "title": "Shazia Marri commiserates with Turkish, Syrian ambassadors",
  "link": "https://www.app.com.pk/national/shazia-marri-commiserates-with-turkish-syrian-ambassadors/",
  "date_published": "2023-02-15T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):Federal Minister for Poverty Alleviation and Social Safety (PA&SS) Shazia Marri visited the Turkish and Syrian Embassy in Islamabad on Wednesday to offer heartfelt condolences and sympathies to peoples of both the countries on the devastating earthquake that struck Turkiye and Syria.\nShazia Marri, who is also Benazir Income Support Programme (BISP) Chairperson, expressed her heartfelt sympathies with the ambassadors and said “there are no words that can console and soothe the anguish of peoples of both the countries.”\nShe said that her heart “goes out to all the victims of this natural calamity.”\nShe conveyed the solidarity of the government and people of Pakistan to their brothers and sisters in Turkiye and Syria. The minister stated that in this hour of need, the people of Pakistan were standing by their Turkish and Syrian brothers and sisters.\nShe prayed for the speedy recovery of those who were injured in the devastating earthquake.\nShazia noted her thoughts in the visitor’s book at both embassies. She commended the resilience of Syrian people who stood tall in face of overwhelming odds in recent years. She hoped that the Syrian people and leadership would show the same resilience in this difficult hour.\nShazia Marri said that people of Syria, especially women and children were facing gargantuan difficulties already.\nTurkish and Syrian ambassadors expressed their gratitude towards the people and government of Pakistan for their outpouring support and sympathies. They took the opportunity to thank Shazia Marri for her profound condolences and sympathies.\nThe minister also visited the home of Peace Activist Samana Malaika Raza to offer condolences on the death of her mother.\nSamana’s brothers Syed Ahsen Raza Kazmi, Deputy Attorney General of Pakistan and Mohsin Raza Kazmi received Shazia Marri at the house. She prayed for the higher ranks of the departed soul.",
  "retrievedAt": "2025-08-11T06:05:18.551Z"
}
