{
  "title": "IAEA intends to expand cooperation with Pakistan: DG Rafael Grossi",
  "link": "https://www.app.com.pk/national/iaea-intends-to-expand-cooperation-with-pakistan-dg-rafael-grossi/",
  "date_published": "2023-02-15T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):Director General (DG) of the International Atomic Energy Agency (IAEA), Rafael Mariano Grossi Wednesday said that the IAEA intended to expand cooperation with Pakistan in different fields, especially in its efforts to provide latest treatment facilities to the cancer patients.\nHe was speaking during the inauguration ceremony of the latest Cyberknife facility at Pakistan Atomic Energy Commission (PAEC)’s flagship cancer-care hospital in the capital, namely Nuclear Medicine, Oncology and Radiotherapy Institute (NORI).\nThe IAEA DG was accompanied by PAEC Chairman Dr Raja Ali Raza Anwar.\nSpeaking on the occasion, the IAEA DG hoped that the newly inaugurated Cyberknife facility was multiplying theuropic capacities in Pakistan to treat the cancer patients.\nVisiting the  Nuclear Medicine Oncology & #Radiotherapy Inst., an important @IAEAorg partner & a perfect example of peaceful nuclear uses. Proud to inaugurate Cyberknife, a #CancerCare4All milestone. Pakistan will support its neighbors as a regional centre in Rays of Hope. pic.twitter.com/Sz31z96q7B\nHe said that the IAEA had launched a global programme called Rays of Hope more than a year ago, which was aimed at increasing the availability of radiotherapy facilities in particular in the developing countries, with a huge deficit in this area.\nRafael said that Rays of Hope project was aimed at bringing radiotherapy facilities for those who did not have it. “Pakistan has top notch facilities in NORI and wonderful professionals to treat cancer patients while many other countries lack such facilities”, he said adding, “This hospital in Pakistan is equipped with the latest technology and has the potential to even extend this facility to the other countries.”\nReferring to the example of Africa, he said that 70 percent population in that country lacked access to the radiotherapy facilities.\n“Although we have been focusing on COVID-19 pandemic in the past but cancer is one of those diseases which are tremendously affecting largest population globally. IAEA is trying to correct such imbalances to improve the healthcare facilities in the world”, he added.\nHe acknowledged the contribution of the team of the NORI hospital especially a good number of women professionals who are doing immensely excellent job in providing state of the art treatment facilities to the cancer patients and hoped that “We intend to further increase our cooperation in future.”\nHe also highlighted the IAEA’s assistance in strengthening cancer hospitals in developing countries to provide treatment to patients at par with international standards.\nThe DG IAEA was also briefed about the role of Pakistan Atomic Energy Commission’s 19 cancer hospitals established in all provinces of Pakistan that are shouldering the responsibility of diagnosing and treating over 80 percent of the country’s cancer-affected patients in line with the IAEA’s slogan – ‘Cancer Care for All.’\n“I am glad to see latest facilities at the Commission’s NORI hospital. I am pleased to see a lot of women working in NORI in field of nuclear oncology”, he said.\nWith the inauguration of this facility, NORI became the first public sector cancer hospital of the country to provide cyberknife treatment.\nDuring his stay at NORI hospital, he visited various departments and facilities and appreciated the services of the 19PAEC cancer hospitals, especially NORI, in diagnosis and treatment of cancer in line with the IAEA’s ‘Rays of Hope’ initiative.\nIt is to mention here that ‘Rays of Hope’ focuses on prioritizing a limited number of high-impact, cost-effective and sustainable interventions in line with national needs and commitment.\nThe initiative aims at contributing to the fulfillment of the 2030 Agenda and the Sustainable Development Goal-3 (SDG-3) i.e. Good Health and Well-Being.",
  "retrievedAt": "2025-08-11T06:05:32.953Z"
}
