{
  "title": "Pakistan for nurturing ties with African countries under “Engage Africa” policy: Sanjrani",
  "link": "https://www.app.com.pk/national/pakistan-for-nurturing-ties-with-african-countries-under-engage-africa-policy-sanjrani/",
  "date_published": "2023-02-15T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): On Wednesday, Chairman Senate Muhammad Sadiq Sanjrani said Pakistan wanted to nurture its ties with the African countries under the “Engage Africa” policy.\nIn a meeting with a Parliamentary delegation of Ivory Coast, headed by the President of the National Assembly of Cote D’Ivoire, Adama Bictogo, Chairman Senate Muhammad Sadiq Sanjrani has emphasized that parliamentary diplomacy plays a key role in fostering relations between the nations, and both Pakistan and Cote D’lvoire needs to effectively utilize this conduit to improve collaboration, a news release said.\nAn Ivorian delegation, headed by Adama Bictogo had called on Chairman Senate here at International Parliamentarian Congress (IPC) in Islamabad.\nDuring the meeting, both sides agreed to enrich cooperation in the fields of agriculture, trade, and investment and promote people-to-people contacts through high-level exchanges between the two countries.\nThe Chairman welcomed the delegation and said that Pakistan considered Ivory Coast an important country and wanted to promote ties with African countries under its “Engage Africa” policy.  He stated that both countries enjoyed good relations in various fields and need to help each other in the development process.\nSanjrani remarked that both countries have great potential for promoting political and economic cooperation, and urged the need for the businessmen of the Ivory Coast to visit and invest in Pakistan, particularly in Gwadar.\nThe chairman underscored that the business community of Ivory Coast should work together with the Pakistani business community to promote trade and economic ties that will benefit the economy of both countries.\nAdama Bictogo underlined that the leadership of his country wanted to improve relations with Pakistan in all areas of mutual interest. He briefed the Chairman Senate about the steps taken by his country for the transformation of its economy.\nChairman Senate while briefing the delegation about the business and functions of the Senate of Pakistan extended legislative assistance to the Parliament of Ivory Coast, adding that Parliamentarians from Ivory Coast can be trained at the Pakistan Institute of Parliamentary Services (PIPS).\nAdama Bictogo said that Ivory Coast faces security challenges, adding that his country wanted to increase cooperation with Pakistan forces to counter security challenges. “The policy of Ivory Coast is now open to all countries, Pakistan can also benefit from investment opportunities in Ivory Coast”, he added.\nAdama Bictogo on behalf of the President of Ivory Coast expressed condolences over the sad demise of the former president of Pakistan Pervez Musharraf.\nDeputy Chairman Senate Mirza Muhammad Afridi, Senators Naseebullah Bazai, Fida Muhammad, Fawzia Arshad, MNA Naz Baloch and officers of the Senate Secretariat accompanied the Chairman during the meeting.",
  "retrievedAt": "2025-08-11T06:04:56.505Z"
}
