{
  "title": "IHC bars decision on Imran Khan’s bail, seeks fresh medical reports",
  "link": "https://www.app.com.pk/national/ihc-bars-decision-on-imran-khans-bail-seeks-fresh-medical-reports/",
  "date_published": "2023-02-15T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):The Islamabad High Court (IHC) on Wednesday stopped the banking court to decide the interim bail of Imran Khan in prohibited funding case and sought his fresh medical report on next hearing.\nA two-judge bench, comprising Justice Mohsin Akhter Kayani and Justice Tariq Mehmood Jahangiri, heard the petition of Imran Khan, challenging the orders of banking court regarding summoning him in personal capacity. The division bench heard the case along with the objections raised by the Registrar office against the plea.\nPetitioner’s lawyer Barrister Salman Safdar took the stance that his client had already appeared in the court of special judge central and he also wanted to appear again. He said that if an accused appeared before the court, then he could be granted exemption from appearance in next hearing as per the recent judgment of the top court.\nThe lawyer said that his client couldn’t travel due to the injuried leg, adding that the Registrar office raised objection of biometric verification. Imran Khan would be able to walk till the end of this month as per his doctors, he said.\nThe court temporarily removed the objection of Registrar office and instructed it to fix the case again for hearing after adding diary number.\nJustice Jahangiri observed that PTI’s chief had sought eight times adjournment in the case. Justice Kayani asked whether the petitioner wanted this court to stop the decision of banking court.\nThe petitioner’s lawyer said that his client was given interim bail on October 17, while the incident of Wazirabad had taken place on November 3. He said that his client had given applications for exemption from attendance two times before the incident and six times after it.\nThe lawyer said that Imran Khan never hesitated to appear before the courts but now medical ground was before the court.\nAfter the arguments, the court stopped the banking court from taking decision till the next date and also sought the fresh medical report of Imran Khan on February 22.\nIt may be mentioned that the Registrar office had raised three objections on the petition of Imran Khan including biometric, unverified affidavit of Imran Khan and adding the name of special judge central in the case.\nThe bench temporarily granted exemption from biometric and also instructed the petitioner to verify his affidavit from Lahore High Court (LHC) instead of oath commissioner.\nThe banking court had granted the last opportunity to Imran Khan for appearing in prohibited funding case, lodged by FIA against him and others. However, the former prime minister had challenged the orders before IHC.",
  "retrievedAt": "2025-08-11T06:05:09.848Z"
}
