{
  "title": "Agreements with IMF should be presented in parliament: Noor Alam Khan",
  "link": "https://www.app.com.pk/national/agreements-with-imf-should-be-presented-in-parliament-noor-alam-khan/",
  "date_published": "2023-02-15T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Public Accounts Committee Chairman Noor Alam Khan on Wednesday urged the government to present the agreements with the International Monetary Fund (IMF) in the parliament.\nSpeaking on the supplementary budget in the National Assembly, he said the parliamentarians should be taken on board about the agreements with IMF, whether inked by the previous regime or being signed by the incumbent government.\nReferring to the burgeoning inflation, Pakistan Tehreek-e-Insaf’s Noor Alam Khan said the rate of Urea was gradually increasing, as the subsidy was given to industrialists who had nothing to do with farmers.\nSimilarly, he said, medicines had gone out of the purchasing power of common people as their prices had increased many folds. It was quite difficult for a daily wager earning Rs 800 to make both ends meet.\nTalking about default bills of electricity, he proposed the government to withdraw the facility of provision of free electricity to certain government officials.\nIt was not fair that on one side, the electricity price was being increased for the poor consumers, and on the other, some people were provided electricity free of charge, he added. Moreover, unscheduled load-shedding, that also of long hours, was being carried out in the rural areas of the country, he said.\nNoor Alam Khan said hefty salaries with perks and privileges were being drawn by officials. Tax was always imposed on the poor, while the rich were given immunity, he said, adding the majority of officials in the tax department were allegedly involved in corrupt practices.\nIt was also the state’s responsibility to provide basic facilities of life to the taxpayers, he stressed.\nHe said the farmers had been affected by the recent torrential rains and flash floods in various areas of the country, but they had not yet been given any financial relief.\nHe pointed out that there was a shortage of flour and Urea in the country as the two commodities were being exported to Afghanistan.\nHe asked the government to review its policies and provide maximum relief to the less-privileged class of society.",
  "retrievedAt": "2025-08-11T06:05:27.232Z"
}
