{
  "article_id": "2025-09-26_4c199401d7ee0c0e743a16212cbf4031",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/circular-debt-to-be-eliminated-within-six-years-awais-leghari/",
    "retrieved_at": "2025-10-11T23:31:43.991Z"
  },
  "metadata": {
    "title": "Circular debt to be eliminated within six years: Awais Leghari",
    "author": null,
    "date_published": "2025-09-26T19:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 450,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 26 (APP):Federal Minister for Power, Sardar Awais Ahmed Khan Leghari on Friday said Pakistanas long-standing circular debt crisis will be eliminated within six years following a landmark financing agreement with 18 banks, achieved on favorable terms without adding burden on consumers. Addressing a press conference here, the minister strongly criticized the previous government for exacerbating the circular debt crisis. He stated that when the Pakistan Muslim League (PML-N) left office in 2018, the circular debt stood at Rs1,100 billion. However, during the tenure of the PTI-led government, it surged to Rs 2.28 trillion by 2022. Leghari termed circular debt as a acursea for Pakistan and recalled that when the incumbent government took charge last year, circular debt had reached around Rs2.4 trillion. The government secured savings of Rs242 billion through controlled theft, improved recoveries, and managed financial discipline, while an improving economy and reduced interest rates brought another Rs175 billion in relief. In addition, renegotiated contracts with Independent Power Producers (IPPs) saved Rs 363 billion, leading to a total reduction of Rs780 billion. aNow, through record reforms, renegotiated contracts with IPPs, and favorable banking terms, we have reduced the stock to Rs1614 billion as of June 2025,a he added. Leghari said the government has signed a Rs1.225 trillion scheme to reduce circular debt with 18 banks on favorable terms. aThis achievement, negotiated transparently, will ensure that within six years there will be no trace of circular debt,a he said. The minister added that the Rs 3.23 per unit surcharge currently paid by consumers would also be phased out within five to six years as part of the plan. The minister highlighted that the financing has been secured at KIBOR minus 0.9 percent a a first in Pakistanas history a saving 3.5 to 5 percent in interest costs. aThis achievement, based on Islamic banking principles, demonstrates confidence of the financial sector in government reforms,a he said, adding that the program was fully discussed and agreed upon with the IMF. The minister stated that reforms in power sector governance, particularly improved performance of DISCOS boards, are showing tangible results, with losses decreasing and the burden on industrial and domestic consumers reducingaup to 38% for industries and 50% for over 18 million households. Leghari credited Prime Minister Shehbaz Sharifas leadership and the joint efforts of federal institutions and DISCO boards, saying their improved performance was reflected in reduced losses. He stressed that eliminating circular debt would not only strengthen the energy sector but also bolster Pakistanas overall economy. aThis is the first time in Pakistanas history that circular debt is being addressed through a structured plan, transparency, and discipline. Prime Minister Shehbaz Sharif has already formally launched this initiative,a Leghari concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}