{
  "article_id": "2025-09-26_5411458577d4affa1630d6b61a72daef",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/geneva-seminar-denounces-global-silence-on-sexual-violence-in-iiojk/",
    "retrieved_at": "2025-10-11T23:32:19.105Z"
  },
  "metadata": {
    "title": "Geneva seminar denounces Global silence on sexual violence in IIOJK",
    "author": null,
    "date_published": "2025-09-26T14:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 454,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 26 (APP): Speakers at a seminar decried the passivity and criminal silence of world powers over the use of sexual violence by the Indian occupying forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), stressing that this silence has emboldened the occupying authorities with a sense of total impunity. Recalling heart-wrenching incidents of sexual violence and mass rapes that shook the entire region, they said Kashmir remains one of the world's most volatile regions, where protracted conflict and massive militarization have enabled such crimes, said a press release received from Geveva here Friday. Citing the Kunan-Poshpora mass rape, the speakers underscored that Indian occupation forces have systematically employed sexual violence as a weapon of war to subjugate the Kashmiri population that has consistently resisted India's narrative and control. They referred to the United Nations High Commissioner for Human Rights (UNHCHR) reports on Kashmir (2018 and 2019), which contain graphic documentation of human rights violations committed by Indian military and paramilitary forces. The speakers further highlighted reports by Amnesty International and other global watchdogs that expose the state's failure to investigate or prosecute sexual violence cases, thereby perpetuating impunity for such crimes. These reports, they added, have stripped away the veil of secrecy from India's crimes against humanity in Kashmir. The seminar, attended by international law experts, academics, and Kashmiri voices, drew global attention to the injustice, oppression, and cruelty endured by Kashmiri women throughout decades of turmoil. It was noted that women have borne the heaviest brunt of repression-facing rape, torture, loss of family members, and incarceration. \"Horrific violence has been inflicted upon women, with rape used as a weapon of war to punish, intimidate, coerce, humiliate, and degrade,\" the speakers said. They lamented that the Indian army personnel directly involved in mass rape incidents enjoy blanket impunity under special laws. \"Not a single soldier has been punished for these crimes in Kashmir,\" they added. Urging the international community to hold India accountable for war crimes, the speakers demanded that the issue of sexual violence in Kashmir be linked to global efforts aimed at ending its systematic use in conflict zones. Pertinently, the seminar titled \"Sexual Violence in Armed Conflicts\" was jointly organized by the Kashmir Institute of International Relations and the International Muslim Women Union. It was addressed by Lord Duncan McNair, founder and CEO of Peaceful Planet, Dr. Carrie Pemberton Ford, ED at CCARHT Counter Trafficking Centre, Hans H. Dube, senior policy and development advisor, Ms. Carolyn Handschin Moser, Ms. Zarin Hainsworth, Chair of Widows Rights International, Ms. Rehana Ali, lawyer and human rights activist, Syeda Tahreem Bukhari, representative of CAPSDH and Dr. Shagufta Ashraf, representative of CHRAC. The event was moderated by Ms. Shamim Shawl, representative of IMWU.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}