{
  "article_id": "2025-09-26_5ff2e0cc0b2ae6cbd1a962a66641df5b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/firdous-ashiq-praises-field-marshals-diplomacy-efforts/",
    "retrieved_at": "2025-10-11T23:31:22.691Z"
  },
  "metadata": {
    "title": "Firdous Ashiq praises Field Marshal’s diplomacy efforts",
    "author": null,
    "date_published": "2025-09-26T21:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 255,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 26 (APP):Senior leader of Istehkam-e-Pakistan Party (IPP), Dr Firdous Ashiq Awan praised Field Marshal Asim Munir for successfully repairing the strained relations between Pakistan and the United States through his visionary diplomacy, which had been lacking in previous years. Speaking to the media on Friday at an event organized by the National Police Foundation at the Flagship Campus Headquarters, where she was the chief guest, Dr Awan expressed optimism about the meeting between the Prime Minister, Field Marshal Munir, and the American President. She said the meeting is expected to usher in a new era of bilateral relations based on equality.\"The personality of the Field Marshal and his successful diplomacy have earned Pakistan great prestige worldwide,\" she said. Addressing economic concerns, Dr Awan acknowledged that Pakistan's economy was in a dire state a few years ago.However, she credited the prudent policies of the current government and other stakeholders for setting the country on a path to recovery. Highlighting the critical role of law enforcement, she stressed the police's pivotal contribution to maintaining peace and security in society and regretted that the institution has not received due recognition for its efforts. Dr Awan also underscored the moral responsibility involved in ensuring public safety, stating, \"Every sincere effort to protect citizens is an act of worship. Every person is accountable to their own conscience, as no other court is greater than the conscience.\" She congratulated the Pakistan Cricket Team on reaching the final of the Asia Cup and wished them success in the upcoming match.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}