{
  "title": "CJP appealed to take Suo Moto notice of PPP’s involvement in heinous crimes",
  "link": "https://www.app.com.pk/national/cjp-appealed-to-take-suo-moto-notice-of-ppps-involvement-in-heinous-crimes/",
  "date_published": "2020-07-07T04:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP):Federal Minister for Maritime Affairs Ali Haider Zaidi on Tuesday appealed to the Chief Justice of Pakistan (CJP) to take Suo Moto notice against Pakistan Peoples Party’s involvement in the crimes committed by notorious Lyari gangster, Uzair Baloch.\nAddressing a joint press conference with Federal Minister for Information and Broadcasting Shibli Faraz, he said that everyone had seen how Karachi had been systematically destroyed by the PPP.\n“Sindh Assembly’s contribution to Pakistan has been phenomenal. But PPP destroyed the biggest city of the province with unimaginable bloodshed”, he added.\nHe said that PPP’s propagated version of JIT report was unsigned. JIT report with signatures of ISI, IB and other officials directly implicated PPP’s leaders for abetting and using Uzair Baloch, he said adding “Uzair Baloch’s gang used to behead rival gangsters and throw away their heads, this is not made-up or a story from Mexico, this was happening within Karachi, my city” .\nThe minister said that JIT report signed by officers of IB, ISI etc mentioned that Uzair Baloch disclosed that Abdul Qadir Patel tasked him to kill Razzaq Commando, adding that Sindh government’s version omitted all this conveniently.\nHe said that one signed JIT report mentioned names of some “Friends”, including Zulfiqar Mirza, Faryal Talpur, Dr. Nisar Morai, Sharjeel Memon also.\nZaidi said that Sindh High Court ordered JIT reports on Uzair Baloch and Baldia Factory fire to be made public but Sindh govt did not do so.\n“I approached SHC again for contempt of Court case, next day PPP went to SC with an appeal” he added.\nThe minister said that a known target killer involved in all sorts of criminal activities, according to JIT, was involved in police transfers, as a citizen of Karachi, should that not affect me that my area SHO was sheltering a criminal like Uzair Baloch.\nHe said Uzair Baloch confessed that “My life and my family is in danger from Asif Zardari and PPP. They can die to silence me. I did everything at the behest of PPP leadership”. He also showed a video about PPP and Uzair Baloch alliance in politics.",
  "retrievedAt": "2025-08-11T19:27:44.043Z"
}
