{
  "title": "Govt making all out efforts to bring deadly disease under control: Sanjrani",
  "link": "https://www.app.com.pk/national/govt-making-all-out-efforts-to-bring-deadly-disease-under-control-sanjrani/",
  "date_published": "2020-07-07T04:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 7 (APP):Senate Chairman Muhammad Sadiq Sanjrani Tuesday said the government is making all out efforts to bring the deadly disease COVID-19 under control through lockdown, testing, tracing and quarantine.\n“COVID-19 pandemic carries long term economic repercussions for global economies specially the developing world and more coordinated efforts are required to overcome the diseases and work together for economies to flourish” he expressed these views during a meeting with British High Commissioner Dr Christian Turner, said a news release.\nHe said developed as well the developing world is facing the similar challenge, however, the developing countries lack infrastructure and resources to effectively flatten the COVID-19 curve.\nSanjrani also expressed deep condolences on behalf of the Parliament for the loss of human lives due to corona virus.\nRegarding bilateral relations, the chairman expressed satisfaction that both sides enjoy good relations at different level and there is need to further enhance mutual collaboration in different sectors including frequent parliamentary exchanges and other high level visits.\nHe said Pakistan highly values it bilateral ties with United Kingdom (UK) and we desire to further expand our relations in different sectors.\nSanjrani said enhanced parliamentary linkages and institutional collaboration would help in building consensus on many issues.\nThe Senate chairman said Balochistan and specially Gwadar offering abundant opportunities for investment as Gwadar is being regarded as future of regional development.\nHe further said United Kingdom has provided huge assistance to Pakistan for social sector development.\nHe also thanked the government and parliament of the UK for adopting stance on Kashmir issue.\nThe newly appointed high commissioner thanked the chairman for his candid views on bilateral relations. He also emphasized the need to further strengthen mutual cooperation.",
  "retrievedAt": "2025-08-11T19:27:44.152Z"
}
