{
  "title": "Over 7494 violations of SOPs, health guidelines noted: NCOC",
  "link": "https://www.app.com.pk/national/208828-2/",
  "date_published": "2020-07-07T04:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP):National Command and Operation Centre (NCOC) Tuesday said over 7494 violations of health guidelines were noted during last 24 hours across Pakistan.\nAccording to NCOC, in consequence of the violations more than 604 markets and shops and 981 transporters were fined and sealed as per the violation. However, the provincial governments including AJK, GB and ICT were making all out efforts to enforce health guidelines and instructions‘s compliance for public safety and well being to contain Corona virus spread.\nThe details of violations of health guidelines across Pakistan and enforcement measures were as in AJK 1102 violations were recorded and in response 28 markets and shops were closed and sealed, 182 transport vehicles were fined as per violations.\nIn GB, 135 violations of health guidelines were observed, 44 markets and shops were closed and sealed and seven transport vehicles were fined as per violations.\nIn KP, 3,323 violations were observed where in consequence 147 markets and shops were closed and sealed and seven transport vehicles were fined as per the violation.\nIn Punjab, a total of 1925 violations were recorded whereas in consequence 324 markets and shops were closed and sealed, and 531 transport vehicles were fined as per the violation.\nIn Balochistan, 434 violations were observed where 44 markets and shops were closed and sealed 167 transport vehicles were also fined as per the violation.\nIn Islamabad Capital Territory (ICT), 30 violations of SOPs and health guidelines were noted whereas in consequence 3 markets were closed and sealed and 2 transport vehicles were fined as per the violation.\nIn Sindh, 545 violations were recorded whereas in consequence 32 markets shops were sealed and closed and 105 transport vehicles were fined as per the violation.\nSimilarly, as many as 352 smart lockdown are imposed in 55 districts with 2.6 million population.\nMoreover, 23 areas in Punjab with population of 621,236 persons, 33 areas in Sindh with 893,821 persons, 244 areas in KPK with 836390 persons, 30 areas in AJK with 87,478 persons, 5 areas in Islamabad with 65,000 persons and 17 areas in GB with 151,317 persons were kept under smart lockdown.",
  "retrievedAt": "2025-08-11T19:27:44.217Z"
}
