{
  "title": "Pandemic caries long term economic repercussions for global economies: Sadiq Sanjrani",
  "link": "https://www.app.com.pk/national/pandemic-caries-long-term-economic-repercussions-for-global-economies-sadiq-sanjrani/",
  "date_published": "2020-07-07T02:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP):Chairman Senate Muhammad Sadiq Sanjrani here on Tuesday said that COVID-19 pandemic carried long term economic repercussions for global economies specially for the developing world and more coordinated efforts were required to overcome the diseases and work together for economies to flourish.\nHe expressed these views in a meeting with British High Commissioner Dr. Christian Turner , said a press release.\nHe said that developed as well the developing world were facing similar challenge, however, the developing countries lacked infrastructure and resources to effectively flatten the COVID- 19 curve.\nThe chairman observed that the virus was spreading in Pakistan, however, the government was making all out efforts to bring the deadly disease under control through lockdown, testing, tracing and quarantine. He also expressed deep condolences on behalf of the Parliament for the loss of human lives due to corona virus.\nRegarding bilateral relations, Sanjrani expressed satisfaction that both sides enjoyed good relations at different level and there was need to further enhance mutual collaboration in different sectors including frequent parliamentary exchanges and other high level visits.\nHe said that Pakistan highly valued it bilateral ties with United Kingdom and desired to further expand the relations in different sectors.\nSadiq Sanjrani said that enhanced parliamentary linkages and institutional collaboration would help building consensus on many issues.\nThe chairman stated that Baluchistan and specially Gwadar offering abundant opportunities for investment as it was being regarded as future of regional development.\nHe further said that United Kingdom had provided huge assistance to Pakistan for social sector development.\nSadiq Sanjrani also thanked the government and parliament of UK for adopting stance on Kashmir issue.\nThe newly appointed High Commissioner thanked the chairman Senate for his candid views on bilateral relations. He also emphasized the need to further strengthen mutual cooperation.",
  "retrievedAt": "2025-08-11T19:27:47.090Z"
}
