{
  "title": "COVID-19: Vehicle owner asked to pay token tax at NADRA e-sahulat centres",
  "link": "https://www.app.com.pk/national/covid-19-vehicle-owner-asked-to-pay-token-tax-at-nadra-e-sahulat-centres/",
  "date_published": "2020-07-07T04:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 07 (APP):The Excise and Taxation department has asked the Islamabad registered vehicle owners to pay their token tax at any National Database and Registration Authority’s (Nadra) e-sahulat centres across the country to avoid long queues amid COVID-19.\nThe motorists can avail the opportunity after getting them registered on City Islamabad app, developed by National Information Technology Board (NITB) for the federal capital dwellers to provide them public services of local administration department through online.\nThe visitor would show the code at the e-sahulat center, received on the app so the payment could be done. The system was connected with all e-sahulat centre of NADRA, said Director Excise Bilal Azam while talking to APP on Tuesday.\nTo a query, he said there would be no gathering as there were multiple e-sahulat centres working across the country.\nThe department was also considering direct online payment methods to pay vehicle token fee, registration and transfer fee through integrating credit cards, bank accounts and other payment methods, he said while responding to another query and hoped that the things would be done soon.\nMeanwhile, the federal capital citizens have complained about the issues being faced while visiting e-sahulat centres and using the app.\nThey urged the authorities to resolve their grievances on war footing to relief the masses and make the whole payment system online so the people may submit their fees without visiting the offices.\nHaider ali, a visitor at e-sahulat franchise sector I-8 said it took about twenty to thirty minutes to submit his vehicle token fee. Similarly all the centres in Islamabad were also not operational and some still unaware of the service. Why can’t we have direct deposit through internet banking, he regretted.\nThe app should be regularly updated to keep the users well informed about the ICT departments and make it available for all smart phones, he added.\nKhurrum Shehzad, another visitor at e-sahulat centre Bahria town asked the city administration to make this service available for all type of vehicles as the NADRA centre were only entertaining to smart card holders.",
  "retrievedAt": "2025-08-11T19:27:46.654Z"
}
