{
  "title": "Foreign Secretary, Ethiopian minister review bilateral ties",
  "link": "https://www.app.com.pk/national/foreign-secretary-ethiopian-minister-review-bilateral-ties/",
  "date_published": "2022-02-21T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): Foreign Secretary Sohail Mahmood held wide-ranging talks with Ambassador Redwan Hussien, the Minister of State for Foreign Affairs of Ethiopia, in the inaugural round of Bilateral Political Consultations (BPC) on Monday and reviewed the full gamut of bilateral relations and exchanged views on regional and international issues of mutual interest.\nThe Foreign Secretary reiterated that Pakistan attached high importance to its relations with Ethiopia and looked forward to exploring new areas for mutually beneficial cooperation, particularly in the economic, trade and agricultural domains. He welcomed Ethiopia’s decision to open its Embassy in Islamabad.\nThe Foreign Secretary highlighted Pakistan’s “Engage Africa” vision aimed at deepening political, trade, economic, investment, cultural and security engagement with the African Continent. In this regard, he noted that Pakistan was expanding its diplomatic footprint in Africa by opening five new resident missions and upgrading others.\nAmbassador Hussien said that Ethiopia’s decision to establish its diplomatic presence in Islamabad was a reflection of the importance it attached to strengthening its engagement with Pakistan.\nThe Foreign Secretary recalled that Pakistan had a long history of working together on multilateral forums in support of international peace and stability. He also shared Pakistan’s perspective on the situation in Afghanistan, stressing the need for enhanced international actions to address the humanitarian and economic crises.\nThe Foreign Secretary also highlighted the serious human rights situation in IIOJK since India’s illegal and unilateral actions of 5 August 2019 and stressed the imperative of resolving the Jammu and Kashmir dispute.\nThe two sides expressed satisfaction at the overall trajectory of bilateral relations, reinforced by regular interaction at the leadership level.Ambassador Hussien is visiting Pakistan as the Special Envoy of Ethiopian Prime Minister Dr. Abiy Ahmed Ali.",
  "retrievedAt": "2025-08-11T14:22:52.248Z"
}
