{
  "title": "FM Qureshi, German counterpart discuss bilateral, regional issues",
  "link": "https://www.app.com.pk/national/fm-qureshi-german-counterpart-discuss-bilateral-regional-issues/",
  "date_published": "2022-02-21T10:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi and Minister for Foreign Affairs of Germany Annalena Baerbock on Monday exchanged views on the bilateral relations as well as important regional issues.\nForeign minister Qureshi, during a telephonic call, said that Germany was a valued, longstanding partner of Pakistan.\nPakistan was committed to further enhancing bilateral relations in all dimensions, particularly in the fields of trade and investment, energy, climate change, radicalization etc, he added.\nDiscussing Afghanistan, the foreign minister reaffirmed Pakistan’s resolve in supporting the international community in its efforts to strengthen peace and stability in Afghanistan.\nHe also highlighted Pakistan’s role in evacuation operations from Afghanistan.\nThe foreign minister informed that Pakistan had so far facilitated over 90,000 evacuations.\nThe urgent need was to avert a humanitarian crisis and economic meltdown in Afghanistan, which would adversely impact stability in the region and beyond, he stressed.\nThe two foreign ministers exchanged views on the situation in Ukraine.\nForeign minister Qureshi also briefed his German counterpart on the grave human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK), being committed by India after its illegal, unilateral action of 5 August 2019.\nForeign Minister Annalena Baerbock appreciated Pakistan’s assistance in its evacuation operations from Afghanistan and hoped for Pakistan’s continued support in this regard.\nThe foreign minister invited the German foreign minister to visit Pakistan at the earliest convenience, adding that her visit would be helpful in preparing for the Prime Minister’s visit to Germany.\nHe also congratulated his German counterpart on recently assuming her office.\nPakistan and Germany have maintained a good trajectory of bilateral relations and remain committed to further enhance our cooperation. The two countries celebrated 70 years of establishment of diplomatic relations in 2021.",
  "retrievedAt": "2025-08-11T14:23:01.060Z"
}
