{
  "title": "Samina Alvi calls for concerted efforts to empower persons with disabilities",
  "link": "https://www.app.com.pk/national/first-lady-calls-for-concerted-efforts-to-empower-persons-with-disabilities/",
  "date_published": "2022-02-21T13:39:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 21 (APP):Begum Samina Arif Alvi on Monday called for collective efforts by all segments for the welfare of the persons with disabilities (PWDs) for their positive contribution for the society.\nShe said in her address on the occasion of wheel chairs and financial assistance cheques distribution ceremony organized by Network of Organizations Working with Persons with Disabilities (NOWPDP) here.\nShe said that present federal government is making all out efforts to facilitate the PWDs through trainings so as to help them get job and serve them with assistance as well as necessary facilities to ensure their easy mobility.\nAppreciating the welfare activities of NOWPDP, she said that the team of NOWPDP is doing a great job for PWDs because these special persons need support to cope with the challenges they face due to disabilities.\nShe also referred her recent visits to the Kiran Hospital and IBA Campus Karachi and said that she is trying hard to create awareness among the masses about breast cancer through her nationwide breast cancer awareness campaign.\nShe also urged upon the students to play their vibrant role to create awareness in the society about the breast cancer.\nBegum Samina Arif Alvi said that though the PWDs were being provided financial assistance but making them self-reliant is more important.\nSpeaking on the occasion, Member of the Sindh Assembly MPA Khurram Sher Zaman lauded the efforts of Begum Samina Arif Alvi for welfare of PWDs and for creation of awareness about breast cancer.\nHe called upon all segments of the society to realize the problems and challenges of PWDs and play due role to help them.\nSpeaking on the occasion, Director Pakistan Bait-ul-Mal (PBM) Sindh, Dr. Adnan Majeed said that as many as Rs 57 million have so far been distributed this year in terms of financial assistance of PWDs.\nHe assured every possible support on behalf of PBM for assistance of PWDs.\nLater, Begum Samina Arif Alvi distributed financial assistance cheques among the persons with disability on the occasion and also talked to some of the persons with disability on the occasion.\nBegum Samina Arif Alvi also visited “the Inclusion Academy”, the school for children with and without disabilities between the ages 5-9 established by NOWPDP.\nEarlier, a video was also screened to brief the Begum Samina Arif Alvi and audience with regard to the welfare activities of NOWPDP.",
  "retrievedAt": "2025-08-11T14:22:57.213Z"
}
