{
  "article_id": "2025-10-22_d5be3d58b982d3c48fed5bff5c5d3b0e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nbf-hosts-punjabi-literary-seminar/",
    "retrieved_at": "2025-10-22T17:14:09.963Z"
  },
  "metadata": {
    "title": "NBF hosts Punjabi literary seminar",
    "author": null,
    "date_published": "2025-10-22T17:07:32.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2024/08/NBF.jpg",
    "categories": [
      "National"
    ],
    "word_count": 489,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 22 (APP):National Book Foundation (NBF), operating under the Federal Ministry of Education and Professional Training, in collaboration with the American Institute of Pakistan Studies (AIPS), organized a one-day Punjabi literary seminar titled aPunjabi Apni Dharti Se Beganay.a The event took place at the Ahmed Faraz Hall of NBF, according to a press release issued on Wednesday. The seminar featured in-depth discussions on various aspects of Punjabi language and literature. It was presided over by Dr. Aftab Maroof, a renowned scholar and Rector of FAST University, Islamabad. The chief guest was Dr. Arshad Mahmood Nashad, while the list of prominent speakers included Professor Saeed Farani, Professor Tahreem Zafar, and Naeem Fatima Alvi. The session was skillfully moderated by Aamir Zaheer Bhatti. In his presidential address, Dr. Aftab Maroof highlighted the rich Sufi tradition in Punjabi literature, referencing great mystic poets such as Waris Shah, Shah Hussain, and Sultan Bahu. He emphasized the need to preserve this literary heritage and pass it on to future generations. He also stressed the importance of adapting Punjabi language and literature to modern formatsasuch as drama and digital mediaato better engage younger audiences. Dr. Kamran Jahangir, Managing Director of the NBF, thanked the distinguished guests and participants. He noted that Punjabi comprises four core elements: writing, reading, speaking, and listening. While reading and writing can be challenging, he pointed out that speaking and listening are more accessibleaespecially for the younger generation, which can play a vital role in promoting the language. He acknowledged that current efforts have fallen short and called for a renewed focus on nurturing mother tongues at home. Dr. Jahangir also announced that similar seminars would be held for the promotion of other regional languages across Pakistan. Dr. Aalia Sohail, Director at AIPS, expressed gratitude to the panelists and audience on behalf of her organization. She emphasized that Punjabi is not just a mother tongue, but a vital part of Pakistanas cultural identity and a national treasure. She praised the contributions of legendary literary figures such as Baba Farid, Waris Shah, Sultan Bahu, Shah Hussain, Mian Muhammad Bakhsh, and Khawaja Ghulam Farid, whose works have elevated Punjabi literature to global prominence. Professor Saeed Farani discussed the role and contributions of Sufi saints in Punjabi literature, shedding light on the spiritual wisdom of Punjabi mystics. He remarked that these saints, without formal planning, played a pivotal role not only in the development of literature and language but also in spreading the message of Islam through their character and teachings. Professor Tahreem Zafar, an educationist, delivered an engaging and insightful talk titled aCustodians of Punjabi Language and Tradition,a exploring Punjabias linguistic and cultural heritageaincluding storytelling, lullabies, and traditional customs. The seminar was described as a remarkable and dignified event, where meaningful dialogue took place on the promotion and preservation of the Punjabi language. A large number of participants from Islamabad, Rawalpindi, and other citiesaincluding scholars, literary enthusiasts, and cultural expertsaattended the event.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}