{
  "article_id": "2025-10-22_8c9f056d57fd96778299f27aa7cb3046",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/un-resident-coordinator-highlights-importance-of-working-together-to-meet-challenges/",
    "retrieved_at": "2025-10-22T12:46:11.559Z"
  },
  "metadata": {
    "title": "UN Resident Coordinator highlights importance of working together to meet challenges",
    "author": null,
    "date_published": "2025-10-22T12:09:08.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/UN-Resident-and-Humanitarian-Coordinator-Mohamed-Yahya.jpg",
    "categories": [
      "National"
    ],
    "word_count": 266,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 22 (APP):UN Resident and Humanitarian Coordinator Mohamed Yahya on Wednesday emphasized the importance of working together to meet the challenges and realize the universal aspiration to peace, prosperity and happiness. He said this while talking to media here at a local hotel and also announced that the United Nations in Pakistan was set to celebrate its 80th anniversary with a family-oriented event in Lahore on October 25, 2025. The event, titled \"UN Day,\" will take place at the Alhamra Arts Council on Mall Road and will feature live performances by Pakistani artists, including Farhan Saeed, Urooj Fatima, and Nazakat Ali Shad. Tje event will feature music and entertainment by renowned Pakistani artists and also learn about career opportunities at the UN and get tips from UN Human Resources teams. This would also provide opportunity to meet representatives from 22 UN agencies operating in Pakistan and learn about their activities. Explore the shared history between the UN and Pakistan. Enjoy activities for children, selfie corners, food stalls, and giveaways. The UN is celebrating its 80th anniversary with a plan for change, \"Building Our Future Together,\" which focuses on global cooperation to address challenges such as climate change, inequality, and conflict. Pakistan has a long-standing relationship with the UN, having joined the organization in 1947. The country is currently serving its eighth term as a non-permanent member of the UN Security Council and is one of the largest contributors to UN peacekeeping missions. Several Pakistanis have played instrumental roles in the development of the UN and its values, including Begum Shaista Ikramullah and Ahmad Shah Bokhari.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}