{
  "article_id": "2025-10-22_c61ae7615584f20ce4fa5565ef4ab0e6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dpm-dar-orders-urgent-reforms-to-revive-cotton-sector-enhance-private-stakeholders-role/",
    "retrieved_at": "2025-10-22T17:05:00.046Z"
  },
  "metadata": {
    "title": "DPM Dar orders urgent reforms to revive Cotton Sector, enhance private stakeholders’ role",
    "author": null,
    "date_published": "2025-10-22T16:40:14.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/DPM-1-1.jpeg",
    "categories": [
      "National"
    ],
    "word_count": 242,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 22 (APP):Deputy Prime Minister and Foreign Minister (DPM/FM), Senator Mohammad Ishaq Dar on Wednesday directed the immediate implementation of comprehensive reforms aimed at reviving Pakistan's struggling cotton sector. Chairing a high-level meeting of the Cabinet Committee on Essential and Cash Crops, Dar emphasized stronger public-private collaboration and greater private sector representation in policymaking bodies, a DPM's Office news release said. The meeting focused primarily on the challenges faced by the cotton industry, including declining productivity, weak supply chains, and insufficient research support. In attendance were Minister for National Food Security and Research Rana Tanveer Hussain, SAPM Tariq Bajwa, senior officials from the Ministry of National Food Security & Research, and representatives from the All Pakistan Textile Mills Association (APTMA), cotton growers, and ginners. A key decision taken was to increase the involvement of APTMA and other private sector stakeholders in the Pakistan Central Cotton Committee (PCCC), with the goal of improving coordination and decision-making for sustainable growth in cotton production. Dar instructed the Ministry of National Food Security & Research to work in close coordination with all stakeholders to ensure swift execution of the proposed reforms. \"The cotton sector is a backbone of our economy. Immediate and coordinated action is required to address its challenges and ensure its long-term viability,\" Dar stated. The meeting concluded with consensus on key strategies to boost productivity, streamline the supply chain, and expand research capabilities to support the cotton crop and broader agricultural development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}