{
  "article_id": "2025-10-22_a02b57f7d21b61462019a8c65f8cca9e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/foreign-correspondent/airbus-opens-second-a320-family-final-assembly-line-in-china/",
    "retrieved_at": "2025-10-22T12:45:13.223Z"
  },
  "metadata": {
    "title": "Airbus opens second A320 Family Final Assembly Line in China",
    "author": null,
    "date_published": "2025-10-22T08:33:00.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/Airbus.avif",
    "categories": [
      "National"
    ],
    "word_count": 263,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "BEIJING, Oct 22 (APP):: Airbus opened its second Final Assembly Line (FAL) for the A320 Family aircraft in Tianjin on Wednesday, a testimony of the plane manufacturer's confidence in the prospering Chinese aviation market and the strong and solid capabilities of its supply chain. This milestone follows an earlier agreement signed in April 2023 by Airbus CEO Guillaume Faury and the Tianjin Free Trade Zone Investment Co and Aviation Industry Corporation of China Ltd. Preparations to assemble the first aircraft are underway and full operation of the facility is targeted for early 2026, according to the information the company sent to the Global Times. \"We welcome the addition of Tianjin's second line to our global production system, as it provides us with the necessary flexibility and capacity to deliver on our plan to assemble 75 A320 Family aircraft per month in 2027,\" said Airbus CEO Guillaume Faury. The new line will enable Airbus to significantly increase production close to its customers in China and beyond. It complements the global Airbus production network of- now 10 FALs - four in Hamburg (Germany), two in Toulouse (France), two in Mobile (the US) and two in Tianjin (China). Inaugurated in 2008, the Airbus Tianjin FAL was the first Airbus production line for commercial aircraft outside Europe. It has assembled and delivered 780 A320 Family aircraft since then, making the facility a symbol of successful China-Europe cooperation. The year 2025 marks the 40th anniversary of cooperation between Airbus and China's civil aviation sector, when the first Airbus aircraft - an A310 - was delivered back in 1985.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}