{
  "article_id": "2025-10-22_112f5fbb539a0ac5b1e0270aa72e3ff8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/muqam-reviews-preparations-for-kashmir-black-day-observance/",
    "retrieved_at": "2025-10-22T12:44:46.161Z"
  },
  "metadata": {
    "title": "Muqam reviews preparations for Kashmir Black Day observance",
    "author": null,
    "date_published": "2025-10-22T12:37:13.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/Engr-Amir-Muqam.webp",
    "categories": [
      "National"
    ],
    "word_count": 374,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 22 (APP):A high-level meeting chaired by Federal Minister for Kashmir Affairs Gilgit-Baltistan and SAFRON Engineer Amir Muqam was held at the Azad Jammu and Kashmir Council where preparations were finalised for observing Kashmir Black Day being marked on October 27. The meeting unanimously resolved to commemorate the day with full zeal and fervor across Pakistan, reaffirming solidarity with the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK). Muqam paid tribute to the people of Indian Illegally Occupied Jammu and Kashmir for their steadfast resistance against Indian oppression. Muqam stated that India's brutalities in Kashmir persist, resulting in the martyrdom and imprisonment of thousands of innocent Kashmiris. He further remarked that the recent movement for truth and justice has reignited international focus on the Kashmir issue. The Federal Minister said that the Ministry of Kashmir Affairs has devised a comprehensive plan to observe Kashmir Black Day in a befitting manner. He added that this year, the day will be marked with greater zeal and passion than ever before. The observance marks the anniversary of October 27, 1947, when Indian forces entered and occupied Jammu and Kashmir - an act denounced annually by Kashmiris as Black Day. Muqam commended the All Parties Hurriyat Conference (APHC) for its continued advocacy and emphasized that a unified message will be delivered on Black Day. APHC leader Sheikh Abdul Mateen echoed the sentiment, stating, \"Kashmiris and Pakistanis are one. The APHC leadership will actively participate in all rallies, and Pakistani embassies abroad will also organize events to mark the day.\" Mateen assured that all activities will be promptly shared with national media to amplify the message of solidarity. Muqam directed all relevant departments to finalize arrangements for the day's observance. The meeting was attended by senior officials including Additional Secretary Kamran ur Rehman Khan, APHC leadership, and representatives from key ministries and departments - including Foreign Affairs, Interior, Information and Broadcasting, Communications, Education, Information Technology, PIA, ICT Administration, Islamabad Police, Motorway Police, CDA, MCI, and provincial governments including Azad Jammu and Kashmir and Gilgit-Baltistan. It may be recalled that on October 27, 1947, Indian forces entered and illegally occupied Jammu and Kashmir - an act that Kashmiris denounce every year by observing October 27 as Black Day.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}