{
  "title": "Indian forces kill 22 Maoist rebels, one soldier dead - World - DAWN.COM",
  "author": null,
  "content": "At least 22 Maoist rebels were killed in the jungles of central India on Thursday in one of the deadliest clashes since the government ramped up efforts to crush the long-running insurgency.\n\nMore than 10,000 people have been killed in the decades-long “Naxalite” rebellion, whose members say they are fighting for the rights of marginalised people in India’s resource-rich central regions.\n\nAn Indian paramilitary soldier was also killed in one of two separate skirmishes that broke out in Chhattisgarh state, both of which carried on through the day, according to police.\n\n“22 Naxalites were killed in 2 separate operations of our security forces,” Amit Shah, Indian interior minister, wrote on social media platform X, using the common Indian name for the insurgent movement.\n\nPolice said the soldier had been killed during a skirmish that broke out soon after dawn in Bijapur district, where 18 guerrillas had also been killed.\n\nAnother four rebels were killed in a separate clash in the state’s south. Searches were continuing at both battle sites, with security forces recovering caches of arms and ammunition from both areas.\n\n“The (Narendra) Modi government is moving forward with a ruthless approach against Naxalites and is adopting a zero tolerance policy against those Naxalites who are not surrendering,” Shah wrote on social media platform X.\n\nThe rebels, known as Naxalites after the district where their armed campaign began in 1967, were inspired by the Chinese revolutionary leader Mao Zedong.\n\nShah has repeatedly vowed that India’s government would crush the remnants of the rebellion by the end of March next year.\n\nA crackdown by security forces killed around 287 rebels last year, an overwhelming majority of them in Chhattisgarh, according to government data.\n\nMore than 80 Maoists had already been killed so far this year, according to a tally on Sunday by the Press Trust of India news agency.\n\nThe Maoists demand land, jobs and a share of the region’s immense natural resources for local residents.\n\nThey made inroads in a number of remote communities across India’s east and south, and the movement gained in strength and numbers until the early 2000s.\n\nNew Delhi then deployed tens of thousands of troops in a stretch of territory known as the “Red Corridor”.\n\nThe conflict has also seen scores of deadly attacks on government forces. A roadside bomb killed at least nine Indian troops in January.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:19:05.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899173/indian-forces-kill-22-maoist-rebels-one-soldier-dead",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T10:18:57.000Z"
}
