{
  "title": "Record 2024 temperatures accelerate ice loss - World - DAWN.COM",
  "author": null,
  "content": "SINGAPORE: Record greenhouse gas levels helped bring temperatures to an all-time high in 2024, accelerating glacier and sea ice loss, raising sea levels and edging the world closer to a key warming threshold, the UN weather body said on Wednesday.\n\nAnnual average mean temperatures stood at 1.55 degrees Celsius (2.79 Fahrenheit) above pre-industrial levels last year, surpassing the previous 2023 record by 0.1C, the World Meteorological Organisation (WMO) said in its annual climate report.\n\nCountries agreed in the 2015 Paris Agreement to strive to limit temperature increases to within 1.5C above the 1850-1900 average. Preliminary estimates put the current long-term average increase at between 1.34-1.41C, closing in on but not yet exceeding the Paris threshold, the WMO said.\n\n“One thing to point out very clearly is that one single year above 1.5 degrees doesn’t mean that the level mentioned in the Paris agreement had been formally exceeded,” said John Kennedy, WMO’s scientific coordinator and lead author of the report. But uncertainty ranges in the data mean that it cannot be ruled out, he said during a briefing.\n\nThe report said other factors could also have driven global temperature rises last year, including changes in the solar cycle, a massive volcanic eruption and a decrease in cooling aerosols.\n\nWhile a small number of regions saw temperatures fall, extreme weather wreaked havoc across the globe, with droughts causing food shortages and floods and wildfires forcing the displacement of 800,000 people, the highest since records began in 2008.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:58.708Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899060/record-2024-temperatures-accelerate-ice-loss",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T00:40:12.000Z"
}
