{
  "title": "FM Dar discusses consular issues with US envoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Deputy Prime Minister and Foreign Minister Ishaq Dar on Wednesday chaired a high-level meeting with officials from the United States Embassy in Islamabad to discuss consular issues, as the Trump administration reviews its visa policies and pushes ahead with deportation of illegal immigrants.\n\n“Deputy Prime Minister/Foreign Minister, Senator Mohammad Ishaq Dar today chaired a meeting to discuss ongoing collaboration between Pakistan and the US on consular issues with US Chargé d’affaires Natalie A. Baker,” the Foreign Office said in a statement.\n\nThe meeting was attended by Foreign Secretary Amna Baloch, Interior Secretary Khurram Agha and other senior officials from the Pakistani side.\n\nThe timing and high-level participation in the meeting suggested it was more than a routine discussion on consular matters, particularly as it came amid the US administration’s visa policy review following an executive order issued on Jan 20.\n\nAn official, speaking on background, said a wide range of consular affairs were discussed and hinted that the meeting was initiated by Mr Dar.\n\nConsular issues typically encompass a broad spectrum of services, including passport and visa processing, citizen services, travel advisories, victim assistance, and emergency response.\n\nThe consular relationship between Pakistan and the US is shaped by significant ties, including a large Pakistani diaspora in the US, security concerns, and mutual interests in trade, education, and regional stability. Accordingly, the most critical consular issues involve visa processing, immigration, citizen services and travel advisories.\n\nAn official confirmed that discussions also covered matters related to returns and readmissions.\n\n“The governments of Pakistan and the United States remain in active collaboration with each other for processing cases of illegal ordered removed migrants and their subsequent deportation. This is an ongoing process carried out in coordination with the Ministry of Interior,” FO spokesman Shafqat Ali Khan had said in a previous briefing.\n\nLast month, Pakistan accepted the return of eight nationals who had been staying illegally in the US, marking the first batch under the deportations initiated by the Trump administration. Cracking down on illegal immigration has been a key priority for President Trump, who took immediate steps to enforce stricter policies soon after his inauguration.\n\nAt that time, the FO spokesman stated that Pakistan and the US were engaged in talks on the broader repatriation process.\n\nSome observers viewed the rarely publicised consular meeting as a signal of Islamabad’s seriousness in addressing US concerns, particularly ahead of a possible travel ban that could impact Pakistan.\n\nHowever, both the US and Pakistani officials have described such reports as speculative. Those reports had indicated that Pakistan could be given 60 days to address shortcomings to avoid travel restrictions.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/200831488870911.jpg",
  "retrievedAt": "2025-10-12T02:04:47.634Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899036/fm-dar-discusses-consular-issues-with-us-envoy",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T00:39:48.000Z"
}
