{
  "title": "Pakistan Business Forum calls for reducing GST, abolishing super tax - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Business Forum (PBF) has called for reduction in general sales tax (GST), elimination of super tax and fixed tax for traders in the coming federal budget to rev up economic activities and create job opportunities in the country.\n\nIn a set of budget proposals submitted to the Ministry of Finance, the PBF — a non-profit association of countrywide trade and industry — called for a reduction in the advance tax slabs for filers and fair treatment of local and imported cotton in terms of taxes. “There is currently an 18pc tax on domestic cotton, unlike imported cotton. This should be immediately abolished in the budget.”\n\nIt proposed a seven-year tax exemption for mining and mineral sectors to attract investment. For industry promotion, the PBF proposed reducing the minimum tax to 0.25 per cent annually.\n\nThe forum also recommended providing facilities for the construction sector in the budget to stimulate economic growth. In this regard, they proposed the cancellation of Section 7E in the Income Tax Ordinance and reducing withholding tax to one per cent for first-time homebuyers.\n\nFixed tax of Rs20,000 for big traders and Rs10,000 for smaller ones suggested\n\nFurthermore, they suggested an amendment to Section 8B to allow the manufacturing sector to engage in exports.\n\nIt proposed that the income tax rate for companies be set at 25pc annually, and super tax should be reviewed. To provide more convenience to taxpayers, the PBF suggested implementing a fixed tax on traders to increase the tax base, proposing a tax of Rs20,000 per month for large traders and Rs10,000 per month for smaller ones.\n\nThey also proposed allocating funds in the budget for development of districts in southern Balochistan. According to the document, the Pakistan Business Forum recommended the federal government allocate funds for the development of these areas.\n\nThe Forum also proposed a reduction in corporate tax rates to align with the private sector in neighbouring countries and the removal of tax exemptions granted to industries in the former Federally Administered Tribal Area and PATA from the budget.\n\nThe PBF called for simple, predictable and supportive of business growth and formalisation of the economy. The aim should be for higher tax revenues to flow from the combination of improved profitability of existing taxpayers and from a broadening of the tax base. “Wealth creation through fair means should be encouraged, not penalised.”\n\nIndustry, which presently contributes taxes disproportionate to its share of GDP, must be facilitated to create more jobs, boost value-added exports and promote sensible import substitution.\n\nThe impact of taxes on manufacturing versus commercial importers should be reviewed, as should the impact on corporates vis-a-vis other forms of business.\n\nSimilarly, provinces have little incentive to check smuggling as customs duty and GST evaded are federal taxes and do not directly hurt their revenues.\n\nProvinces may be incentivised to facilitate raids on shops that deal in smuggled goods President Khawaja Mehboobur Rehman said PBF’s recommendations for the federal budget have been prepared in the backdrop of a major crisis confronting the economy, import curbs which were put in place to manage the current account deficit have severely impacted the manufacturing sector.\n\nHigh energy rates\n\nHigh energy rates and a weak currency, which is at the highest level over the last 50 years, have led to closure of many manufacturing units and unemployment. As a result, large sections of the population are finding it hard to make ends meet.\n\nThe current economic environment affords an opportunity to bring about the major structural changes that the economy needs, according to the PBF.\n\nThese include increasing the tax base, reducing government expenditures and ensuring that general subsidies currently being offered are targeted towards those who need them the most.\n\nThis year’s tax proposals look to save jobs in the manufacturing and formal services sectors and to lay the groundwork for a sustained economic recovery driven not by imports but by exports and domestic manufacturing, backed by a robust agriculture sector.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:04:31.373Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899088/pakistan-business-forum-calls-for-reducing-gst-abolishing-super-tax",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T02:56:51.000Z"
}
