{
  "title": "IOC presidency race heats up on Greece’s sunlit shores - Sport - DAWN.COM",
  "author": null,
  "content": "PYLOS (Greece): The slow-burn race for the most powerful job in world sport roared into life on Wednesday, set against the dazzling backdrop of the Ionian Sea, where the seven contenders for the International Olympic Committee presidency made their final moves ahead of a vote that will shape the sporting landscape for the next decade.\n\nBehind the gilded facades and five-star hospitality of the Costa Navarino resort in Greece’s southwestern Peloponnese, whispers of alliances and voting tactics swirled as IOC members met for the 144th Session the last with Thomas Bach at the wheel.\n\nThe winner of the presidential election will lead the world’s wealthiest multi-sports organisation with revenues of about $7 billion per four-year cycle.\n\nWith the Mediterranean breeze carrying hints of salt and ambition, the seven seeking to replace Bach had to navigate a gauntlet of flashing cameras and microphones as they were ushered to lunch on a terrace overlooking the sea.\n\n“I’m still here,” quipped Britain’s Sebastian Coe, considered one of the frontrunners, as he walked briskly past the bank of reporters, flashing a smile but making no further comment.\n\nKirsty Coventry, considered another frontrunner and believed to be Bach’s preferred candidate, was similarly circumspect, stopping only to make one brief comment to German media before the Zimbabwean headed to the terrace.\n\nCoventry, a swimming great who has contributed seven of Zimbabwe’s eight Olympic medals in history, would be the first woman and first African to head the IOC and at 41 the youngest ever president.\n\n“I’m excited!” she said. “I think it’s the athlete spirit kicking back in with all the adrenaline and that final strength of the last 200 metres, that 25 metres. I am just staying focused and staying in my lane.”\n\nLast to leave the Session Hall was Spain’s Juan Antonio Samaranch Jr, son of the IOC’s seventh president who led the body from 1980 to 2001.\n\n“It’s very easy in this [Olympic] world, so close, to confuse a smile for a vote, a friendship for a vote, a nice word for a vote,” smiled the Spaniard when asked how he felt the race was going. “We all have to be very careful in making that translation.\n\n“It’s a very good system. All the IOC members have one thing which is extraordinarily precious, which is a vote and its confidentiality. That gives each one of us the full independence to decide whatever we think is better. And that we will only know, it’s only possible to know when the real votes are cast. So we will see.”\n\nCHINA LINKS\n\nSamaranch Jr, 65, dismissed suggestions that it was unfair two Chinese members who sit on a foundation board with the Spaniard could vote for him.\n\nIf he is successful on Thursday, he would make history in following in the footsteps of his father of the same name, who led the IOC from 1980 to 2001.\n\nTwo Chinese IOC members, Yu Zaiqing and Li Lingwei, are on the board of the Juan Antonio Samaranch Foundation, which is based in China and aims to promote political and economic opportunities between the country and Spain.\n\nThough they are free to vote for the urbane Spaniard, members from the same country cannot vote for a candidate.\n\nSamaranch Jr, who like the two other favourites Coe and Coventry have been subjected to personal attacks — some unattributed — in the past week, said he saw nothing improper about the voting rules.\n\n“The foundation was created more than 12 years ago and it’s a Chinese foundation that carries my family name,” Samaranch said. “It’s within the rules and I wish it would be an advantage, but I don’t think that it’s going to be the case.”\n\nFrench candidate David Lappartient, head of the world cycling federation, insisted the race was wide open, and that he expects multiple rounds of voting before a decisive winner emerges.\n\nWith just over 100 ballots set to be cast at the Greek seaside resort the winner will need an outright majority. If nobody secures a majority, the lowest scorer is axed, triggering another round of voting until one candidate emerges victorious.\n\n“In the race, still in the race,” Lappartient smiled, before leaning on a cycling analogy. “I think that it’s riding fast, but I’m still in the first part of the bunch. I’ve not been dropped from the bunch, so I still believe it’s possible. I respect my fellow colleagues, also candidates, but I think I’m one of the potential options to be the winner tomorrow.”\n\n‘GLOBAL COMMUNITY’\n\nOther candidates Johan Eliasch and Morinari Watanabe would not speculate.\n\nJapanese Watanabe, head of the world gymnastics federation, smiled and simply said: “I am waiting.”\n\nSki federation chief Eliasch said the electorate of 100-plus members realised how big a decision they faced given the turbulent geopolitical situation.\n\n“I mean, every moment is going to be pivotal because we are 3,000 years old,” he said. “The membership takes this election very seriously, and the serious implications that this choice will have for the future of the movement.\n\n“So in my case, my mission is accomplished if I’ve been able to positively contribute to the movement through this campaign process. I am sure the outcome will be a good one we have seven good candidates.”\n\nPrince Feisal Al-Hussein, a rank outsider in the race, cut a dignified figure as the 61-year-old Jordanian declared: “I am in it to win it”.\n\n“The key for me is the issue of integrity,” he said. “A lot of youth in the world have lost trust in global institutions, and whether we like it or not, the IOC is a global institution.\n\n“How do we regain the trust of both athletes, of fans, and more importantly also from the safeguarding of parents? We need to make sports accessible, we need to make it fun, we need to make people feel that this is contributing to their development.\n\n“I have spoken to more members in the last 3-4 months than in the last 4 years, and that for me has been the great takeaway of this engagement. This is a global community and we should use that for our advantage.”\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/20111047a0c98c1.jpg",
  "retrievedAt": "2025-10-12T02:04:26.183Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899048/ioc-presidency-race-heats-up-on-greeces-sunlit-shores",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T00:40:05.000Z"
}
