{
  "title": "Abdullah wary of tough batting conditions ahead of New Zealand ODIs - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan opener Abdullah Shafique, who is set to make a comeback to the national One-day International side, after missing the recent ICC Champions Trophy, has acknowledged that the upcoming series against New Zealand will be held in tough playing conditions.\n\nThe right-hander, however, emphasised that despite being a young side, Pakistan will give their best effort in the three-match series against the Black Caps, which starts from March 29.\n\nSpeaking to reporters on the first day of a short preparatory camp at the LCCA ground here, Abdullah, who had been dropped from recent back-to-back events including the tri-nation series and the Champions Trophy due to a poor run in the preceding tour of South Africa, admitted the fans were disappointed with the team’s recent performances. He, however, reassured that the team would strive to improve, despite the challenges posed by the New Zealand conditions.\n\n“The playing conditions in New Zealand are never easy, especially for Asian teams,” he said. “The bouncy pitches often make a significant difference, and we will focus on this aspect during the camp to adapt accordingly.”\n\nAbdullah, 25, has represented Pakistan in 22 Test matches, amassing 1,504 runs at an average of 38.36, including five centuries, one of which was a double century, and five half-centuries. In ODIs, he has played 21 matches, scoring 612 runs at an average of 32.21, with one century and six fifties. His performance in T20Is, however, has been underwhelming, having scored just 64 runs in six matches.\n\nWhen asked about his versatility across formats, Abdullah said he wanted to be remembered as an all-format player.\n\n“It’s not ideal for a cricketer to be labeled as suitable for only one format,” the Sialkot-born batter noted. “A player should be ready and available for all formats of the game.”\n\nReflecting on his recent struggles, Abdullah acknowledged that poor patches were a part of every player’s journey.\n\n“The key is to come out of those bad patches quickly by addressing the mistakes,” he said. “I played in the Quaid-e-Azam Trophy, worked on my flaws, and now, I’m hopeful of performing to the best of my ability and meeting the national team’s expectations.”\n\nCommenting on his relationship with former captain Babar Azam, Abdullah expressed that being rated highly by Babar boosted his confidence. “Babar’s support gives me a lot of confidence and motivates me to play impactful knocks that can lead to victories for the team,” he observed.\n\nAbdullah also stressed the importance of taking criticism positively, especially when the team fails to secure a win.\n\n“Criticism is a natural part of cricket, but it’s essential to accept it and use it as a tool for improvement,” he added.\n\nAbdullah highlighted the importance of Saim Ayub’s inclusion in the national squad, suggesting that the opener’s addition would benefit the team.\n\nThe opener admitted that his past performances had not been up to the required standard for the team’s success.\n\n“There were times when the team’s strike rate was low, but that’s in the past now,” Abdullah admitted. We are focused on improving in that crucial department, especially in New Zealand.“\n\nAfter a disappointing performance in the Champions Trophy, Pakistan are currently engaged in a five-match T20I series against New Zealand. The team has lost both of the first two matches by significant margins.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67db4f28d186c.jpg",
  "retrievedAt": "2025-08-25T15:19:22.116Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899047/abdullah-wary-of-tough-batting-conditions-ahead-of-new-zealand-odis",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T00:40:05.000Z"
}
