{
  "title": "Iran FM says Trump’s nuclear talks letter ‘more of a threat’ - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Foreign Minister Abbas Araghchi said on Thursday that a recent letter sent by US President Donald Trump calling for new nuclear talks was “actually more of a threat”, and that Tehran would respond soon.\n\nAraghchi told Iranian state television that while the letter purported to offer up opportunities, it was “actually more of a threat”, adding that Iran was now studying its contents and would respond “in the coming days”.\n\nOn March 7, Trump said he had written to Iran’s supreme leader Ayatollah Ali Khamenei calling for negotiations and warning of possible military action if Iran refused.\n\nKhamenei said the US invitation to talks was aimed at deceiving world public opinion by portraying the United States as ready to negotiate and Iran as unwilling.\n\nIran’s foreign ministry has said it will conduct a “thorough assessment” before responding to the letter, which was delivered by a senior United Arab Emirates diplomat on March 12.\n\nAraghchi said the response “will be sent through the appropriate channels”, without elaborating.\n\nOn Wednesday, US news website Axios, citing a US official and other sources, reported that the letter included a “two-month deadline for reaching a new nuclear deal”.\n\nTrump, who returned to the White House for a second term in January, has reinstated his “maximum pressure” policy of sanctions against Iran, mirroring his approach during his first term.\n\nAt the time, Trump unilaterally withdrew from a landmark 2015 nuclear deal between Iran and world powers, and reimposed sweeping economic sanctions. Tehran adhered to the 2015 deal for a year after Washington’s withdrawal but then began rolling back its own commitments.\n\nThere were brief efforts to revive the agreement under the Joe Biden administration but these went nowhere.\n\nTehran has repeatedly ruled out direct talks with Washington while US sanctions remain in place.\n\nToday, Araghchi reiterated that Iran “definitely will not negotiate directly while facing pressure, threats, and increased sanctions”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/20225716873c252.jpg",
  "retrievedAt": "2025-08-25T15:19:00.142Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899198/iran-fm-says-trumps-nuclear-talks-letter-more-of-a-threat",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T18:20:06.000Z"
}
