{
  "title": "LHC top judge gives govt ‘last chance’ to explain blockage of X - Pakistan - DAWN.COM",
  "author": null,
  "content": "Lahore High Court (LHC) Chief Justice Aalia Neelum on Thursday said she was giving the “last chance” to the federal government to explain the entire situation regarding the blockage of social media platform X in the country.\n\nAccess to X has been disrupted since February 17, 2024, when former Rawal­pindi commissioner Liaquat Chattha accused the chief election commissioner and a top Supreme Court judge of being involved in rigging the February 8 general elections.\n\nRights bodies and journalists’ organisations have condemned the muzzling of social media, while internet service providers have also lamented losses due to disruptions. The United States had also called on Pakistan to lift restrictions on social media platforms.\n\nToday’s hearing was taken up by a three-member bench headed by Chief Justice Aalia Neelum, who heard the petitions of journalist Shakir Mahmood and others. The federal government, the Ministry of Law, the Ministry of Information and others had been made parties in the petitions.\n\n“How was the closure of X carried out? The federal government is being given the last chance [to explain]. The government should respond in court.\n\n“After this, the head of the cabinet will be summoned,” Justice Neelum ordered in the hearing.\n\nIn the last hearing, the LHC had sou­ght a detailed report from the interior ministry and the Pakistan Telec­om­mu­n­ication Aut­h­o­rity (PTA) on the petitions challenging the ban with a directive to explain which government institutions were still using the banned app.\n\nPTA Chairman Major General (retired) Hafeezul Rehman appeared before the bench today and submitted a written response to the court.\n\nDeputy Attorney General (DAG) Asad Bajwa informed the court that the interior ministry had no mechanism to know who was using which social media platform or application through virtual private networks (VPNs), to which Justice Neelum observed that the ministry had the mechanism to block X but not to find out who was using it.\n\nHe said the PTA had formed a committee to probe the use of VPNs to which the LHC top judge said it was only to distract the court.\n\nBajwa said a letter was also written to the social media platform’s authorities, at which Justice Neelum asked if X had any agreement with the government.\n\n“The government has no agreement with X,” Bajwa responded, to which the judge asked why X authorities would answer to the government when they had no agreement with it.\n\n“This bench is not sitting just so that an answer is submitted and an eyewash is given,” Justice Neelum remarked while Justice Ali Zia questioned if the PTA’s own X account was operational.\n\nUpon being informed by the PTA chairman that it was, the judge noted: “What is this? You are banning it and then using it yourself?”\n\nAt this, the PTA chairman said all X users in the country were using VPNs, to which Justice Neelum asked him if he himself was using a VPN to which Rehman responded that he personally was not but the authority itself was.\n\n“This is illegal,” Justice Neelum remarked at the PTA chairman’s admission to which he apologised and said he was just informed that the body was not using VPNs.\n\n“You don’t know what you came here for and you gave such a big statement,” the LHC top judge told him.\n\nMeanwhile, Justice Farooq Haider questioned the PTA chairman if VPNs could be blocked to which Rehman said not immediately and it would take some time.\n\nJustice Neelum said to the PTA chairman that it had been a year and he had done nothing, yet was still requesting one more month.\n\nJustice Haider questioned how VPNs were operating when X was curtailed to which Rehman said they were used in software, banking and freelancing industries.\n\nJustice Zia remarked that the court had a simple question about PTA itself blocking access to X while simultaneously using it itself.\n\nMeanwhile, DAG Bajwa contended that the use of VPNs was legal to some extent.\n\nJustice Neelum subsequently asked for data on how much VPNs were being used to access X to which Rehman said he could not give the exact figures at this time, prompting her to remark: “You are occupying such a big position but you do not have any data.”\n\nJustice Zia pointed out that Rehman had said the PTA would immediately restore X if the court ordered it to do so to which the authority chairman again expressed his willingness to comply.\n\n“This means that PTA has done something wrong and now you are looking for help,” the judge observed.\n\n“Under the rules, content can be blocked to some extent but the platform cannot be closed. You can stop the inappropriate use of X but you cannot block X,” the judge added.\n\nMeanwhile, Justice Neelum said: “Why did the government not fulfil its responsibility? We were disappointed to summon the PTA chairman, he does not know [anything]. We do not have time to waste, why not take contempt of court action for wasting the bench’s time?”\n\nThe bench adjourned further proceedings till April 8.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/201834328ea1ca1.jpg",
  "retrievedAt": "2025-08-25T15:19:00.148Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899185/lhc-top-judge-gives-govt-last-chance-to-explain-blockage-of-x",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T16:16:34.000Z"
}
