{
  "title": "Corruption, inefficiency hallmarks of Maryam’s one-year rule: PTI report - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Tehreek-i-Insaf’s Punjab parliamentary party on Wednesday launched a report on Chief Minister Maryam Nawaz’s one year in power, alleging the period was replete with corruption, inefficiency and copying of the PTI government’s projects.\n\nThe report, in a book form, presented by Opposition Leader in Punjab Assembly Malik Ahmad Khan Bhachar at an iftar dinner on Wednesday, claims “with facts and figures” that the Maryam government copied several projects launched during PTI rule.\n\n“The PTI Punjab parliamentary party has prepared this report after intensive research and can hold a debate on its authenticity with the Punjab government,” Mr Bhachar asserted.\n\nContesting Punjab government’s claim that it launched the Journalist Housing Scheme Phase-II and was paying Rs40 million to the Ravi Urban Development Authority (RUDA) for 3,200 residential plots, the opposition leader stated that this project was approved and launched by the PTI government on Dec 10, 2022, allocating 700 kanal land for the purpose.\n\nHe stated that the Maryam government boasts of enacting the Punjab Defamation Act 2024, without realising that the whole journalists’ community called it a black law and protested against it. He said the opposition in the Punjab Assembly submitted 23 amendments to the law, but none of them was considered.\n\nParty claims credit for almost all the initiatives of Punjab govt\n\nHe said the Maryam government claimed it increased Lahore Press Club grant from Rs10 million to Rs50m, saying the PTI government had increased the club’s grant from Rs5m to Rs20m in July, 2019.\n\nMr Bhachar said the PML-N government claimed launching the Chief Minister Kissan Card and giving interest-free loans to farmers. He rejected the claim, saying that the scheme for farmers was launched by PM Imran Khan in April 2021, and pointed out “anomalies” in the project.\n\nHe also contested the Punjab government claim of launching the CM’s Green Tractor programme in the agriculture sector, saying the scheme was launched by his party in January 2019.\n\nAbout the Punjab government’s Rs15 billion Honahar Scholarship programme for 30,000 students of public and private universities, the opposition leader said the PTI government had launched four such scholarship schemes. He added that in Nov 2019, PM Khan launched Undergraduate Scholarship programme and disbursed Rs50,000 scholarships to 200,000 students.\n\nQuestioning CM Maryam’s claim of launching a free medicines project for cancer and heart patients, Mr Bhachar said the PTI government under its National Sehat Card provided free medicines to the entire population of Punjab.\n\nThe opposition leader also contested PML-N government’s CM dialysis programme, Health Clinic scheme, Air Ambulance service, expanding Rescue 1122 service and Apni Chhat Apna Ghar scheme, claiming that the Maryam government had only copied the PTI projects “already launched in Punjab”.\n\nTrashing the government’s claim of constructing 10 underground water storage tanks in Lahore, the PTI leader said his party had launched the project and constructed three such tanks, one each at Lawrence Garden, Alhamra and Aik Moriya Pul. He said the paperwork was also complete for the Gaddafi Stadium tank, meant to drain water and divert it to the city canal. However, he said, the caretaker government stopped funds for the scheme in April 2023.\n\nMr Bhachar also refuted Maryam government’s claims of introducing programmes like eco-friendly buses, new mass transit system and Himmat Card, saying these were originally PTI’s projects.\n\nThe opposition leader said the PML-N government promised to launch Socioeconomic Registry at a cost of Rs9 billion, claiming that the PTI government in its three-year tenure had collected data of some 34.4 million families through door-to-door surveys.\n\nHe also claimed that the Livestock Card, Plant For Pakistan, Punjab Special Planning Authority, Shrimp Farming, CM Asaan Karobar Card and Mazdoor Card projects were originally launched by the PTI government and were merely copied by the PML-N.\n\nBhachar rapped the Maryam government for low budget utilisation for the announced projects, citing budgets for higher education, National University in Murree, CM Roshan Gharana Programme, tube-wells’ solarisation, agriculture, road infrastructure, CM skills programme, Garments City scheme, playgrounds in all provincial constituencies, youth affairs and sports, free Wifi, 40,000 laptops, school for autistic children, school meal programme and Nawaz Sharif Cancer Hospital.\n\nHe also questioned the use of public resources for the publicity of the Sharif family, CM’s new camp offices, besides non-utilisation of health, environment protection and women development departments’ budgets.\n\nThe PTI’s report also castigates the government for poor law and order, human rights violations, increase in poverty, corruption and terrorism and weakening of democracy.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/201039410b7016e.png",
  "retrievedAt": "2025-08-25T15:19:07.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899110/corruption-inefficiency-hallmarks-of-maryams-one-year-rule-pti-report",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T03:23:34.000Z"
}
