{
  "title": "India detains hundreds of farmers as police bulldoze protest sites - World - DAWN.COM",
  "author": null,
  "content": "Police in India’s northern state of Punjab detained hundreds of farmers and used bulldozers to tear down their temporary camps in a border area where they had protested for more than a year to demand better crop prices.\n\nThe farmers had camped on the border with adjoining Haryana since last February, when security forces halted their march toward the capital, New Delhi, to press for legally-backed guarantees of more state support for crops.\n\n“We did not need to use any force because there was no resistance,” Nanak Singh, a senior police officer, told the ANI news agency about Wednesday night’s clearance action. “The farmers cooperated well and they sat in buses themselves.”\n\nThe farmers had been given prior notice, he added.\n\nTelevision images showed police using bulldozers to demolish tents and stages, while escorting farmers carrying personal items to vehicles.\n\nMedia said among the hundreds detained were farmers’ leaders Sarwan Singh Pandher and Jagjit Singh Dallewal, the latter carried away in an ambulance as he had been on an indefinite protest fast for months.\n\n“On one hand the government is negotiating with the farmer organisations and on the other hand it is arresting them,” Rakesh Tikait, a spokesperson for farmer group Bhartiya Kisan Union said on X.\n\nPunjab’s ruling Aam Aadmi Party (AAP), which authorised the eviction, said it stood by the farmers in their demands, but asked them to take up their grievances with the federal government.\n\n“Let’s work together to safeguard Punjab’s interests,” said the party’s vice president in the state, Tarunpreet Singh Sond, adding that the blockage of key roads had hurt the state’s economy. “Closing highways is not the solution.”\n\nPrime Minister Narendra Modi’s government was forced to repeal some farm laws in 2021 after a year-long protest by farmers when they camped outside Delhi for months.\n\nFederal government officials met the farmers’ leaders on Wednesday, said Fatehjung Singh Bajwa, the vice president of Modi’s Bharatiya Janata Party (BJP) in Punjab.\n\n“It is clear that this arrest is a deliberate attempt to disrupt the ongoing dialogue between farmers and BJP leadership,” he added in a post on X.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:19:05.178Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899140/india-detains-hundreds-of-farmers-as-police-bulldoze-protest-sites",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T06:26:45.000Z"
}
