{
  "title": "South Africa, Pakistan to deepen defence cooperation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakis­tan and South Africa on Wednesday agreed to dee­pen their defence cooperation, focusing on joint ve­­ntures, technology tra­ns­fer and capacity building.\n\nThe understanding was reached during the second meeting of the Pakistan-South Africa Joint Defen­­ce Committee (JDC) held in Islamabad from March 17-19.\n\nDefence Secretary reti­red Lt Gen Muhammad Ali led the Pakistani delegati­on and Dr Thobekile Gam­ede, acting secretary of defence, represented South Africa.\n\nBoth sides discussed fu­­ture avenues to strengthen their partnership in def­e­nce innovation, cyber and sp­ace technologies, artificial intelligence, research and development and def­ence industry capacity building.\n\nMr Ali emphasised the importance of broadening coo­peration in light of eme­rging global security challenges. “It is imperative to further expand this collaboration by exploring new avenues through joint ventures in defense innovation and niche technology,” he stated.\n\nDr Gamede conveyed South Africa’s keen interest in joint ventures, technology transfer, training exchanges and exploring opportunities for defence industrial cooperation.\n\nThe third round of the JDC meeting will be held in South Africa.\n\nA key milestone in the defence cooperation betw­een Pakistan and South Africa came in March 2017, when both countries signed a memorandum of understanding to enhance collaboration in defence production, technology transfer and equipment acquisition. This agreement paved the way for military training exchanges, joint exercises and potential arms trade.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/20082021b3e9c13.jpg",
  "retrievedAt": "2025-08-25T15:19:38.717Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899037/south-africa-pakistan-to-deepen-defence-cooperation",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T00:39:48.000Z"
}
