{
  "title": "Predatory taxation - Newspaper - DAWN.COM",
  "author": null,
  "content": "TWENTY-FIVE IMF programmes, and at least 17 high-powered tax reform commissions, task forces and donor-funded programmes later, the country still finds itself struggling to raise revenue. Once again, another government has announced its intention to raise the tax-to-GDP ratio. The pattern of repeated failure over decades should be a moment for pause and introspection — both for the government and the IMF.\n\nThe need for additional revenue cannot be denied. Against an estimated tax revenue potential of around 20-22 per cent of GDP, government revenue totals 12.5pc of GDP, significantly below the average for low- and middle-income countries as a whole. Looked at from another perspective, the country is unable to fund its substantial spending needs with regards to public service delivery, ballooning pension liabilities or building climate resilience.\n\nDespite the imperative to raise revenue, the country’s tax effort has focused predominantly on a shrinking, already compliant formal sector. Even with a large, thriving informal economy, the country has failed to bring untaxed and lightly taxed sectors into the tax net, and instead, has relied largely on existing taxpayers for mobilising additional revenue.\n\nEnforcement failures of tax authorities have been reinforced by IMF programme design weaknesses. Making tax collection the lynchpin of programme conditionality, compounded by the ‘need for speed’ built into a three-year programme, has generated perverse incentives for FBR. Instead of encouraging innovation and a fundamental change in its flawed model, the IMF programme design incentivises over-taxation of the already documented formal sectors of the economy to meet quarterly targets.\n\nPakistan’s tax regime is anti-growth and investment, anti-documentation and inequitable.\n\nThis not only leaves the large informal sector untouched, documenting which should be a key tax policy objective, but has further widened the tax arbitrage between formal and informal sector firms, increasing the incentive for formal sector firms to informalise — and for informal players to stay outside the tax net. This outcome is the exact opposite of what Pakistan’s tax reform objective demands.\n\nApart from the revenue leakage, informal sector firms typically do not invest in building economies of scale, nor do they invest in training and productivity improvement of their workforce. For obvious reasons, informal sector firms are rarely recipients of foreign direct investment as well. Hence, the wider economic consequences of FBR policy and IMF conditionality on the tax front include not just more strain on documented firms and an erosion of the tax base in the longer run, but worst of all, a loss of competitiveness for formal firms. And this loops back to a small, and declining, export base — the primary cause of Pakistan’s balance-of-payments problem in the first instance.\n\nThe less-than-optimal tax policy pursued historically has failed two of the most foundational objectives of taxation: promoting equity as well as efficiency. ‘Equity’ refers to fairness in the tax system, embodying both horizontal as well as vertical equity. ‘Efficiency’ in tax policy, on the other hand, focuses on minimising economic distortions and ensuring that the tax regime causes the least possible cost to economic activity, growth of firms and investment. By failing to meet the foundational objectives of a ‘good’ tax policy, Pakistan’s tax regime has imposed large deadweight costs for documented businesses.\n\nA perfect example of the limits as well as costs of our failed tax strategy is provided by the tobacco industry. With a total of over 40 cigarette manufacturers operating in the country, only two (the two multinational firms) are fully tax- and public health regulations-compliant. With an estimated 44pc market share, these two firms account for over 98pc of the entire tax revenue collected from the sector. The rest of the industry is free-riding.\n\nDespite the roll-out of the Track and Trace System by FBR to improve compliance in tax evasion-prone sectors, market surveys indicate that TTS compliance is very low. A recent survey conducted by the Institute for Public Opinion Research found only 19 cigarette brands out of 413 openly available in the market to be fully compliant. The compliance rate is only 4.6pc.\n\nInstead of increasing the tax coverage of the entire industry via ‘base capturing’ of the illicit segment through improved enforcement, the government took the route of increasing the federal excise duty — with its entire incidence on the two formal firms — by an average of 212pc since June 2022. The excise taxation regime for the sector has undergone major ad hoc changes since 2017.\n\nFrequent and unsustainable changes to the excise taxation regime, coupled with weak tax enforcement and lax compliance of tobacco-related government regulations, have shrunk the sales of legitimate cigarettes. For the first time, sales of illicit cigarettes outstripped legitimate brand sales for two consecutive years in 2022-23 and 2023-24. Illicit brands now dominate the market, with an estimated 56pc of market share, up from 26pc just five years ago. On current trends, illicit sales will account for 100pc of the cigarette market by 2030, if left unchecked.\n\nWith the major share of cigarettes industry volume in the country now captured by the illicit sector, the annual revenue loss to the government is projected at a staggering Rs300 billion, or nearly 0.3pc of GDP. To put this in context, the potential increase in tax revenue by Rs300bn could cover around 25pc of the projected shortfall in FBR tax collection in 2024-25. At the prevailing exchange rate, the potential revenue loss to the government equals over $1bn.\n\nThis pattern of over-taxing formal firms, and tolerating a flourishing illicit trade, is repeated across industry after industry in the country, be it tea, tyres, footwear, fast-moving consumer goods, beverages etc. The Pakistan Business Council estimates the value of annual illicit trade at a staggering $68bn, which directly undercuts government revenue as well as survival of compliant formal firms.\n\nThe standout features of the country’s tax regime are excessive taxation of the compliant few, weak enforcement, and discriminatory treatment. Without a fundamental rethink and reset, Pakistan’s catastrophic tax regime will drive the country’s already shrinking formal sector towards extinction.\n\nThe writer has been a member of several past economic advisory councils under different prime ministers.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67db828dd4f1f.jpg",
  "retrievedAt": "2025-08-25T15:19:06.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899087",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T02:51:58.000Z"
}
