{
  "title": "Residents block Karachi’s Mauripur Road against anti-encroachment operation - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: At least three residents of the Younisabad area were taken into custody when they blocked the Mauripur Road and put up resistance against an anti-encroachment operation launched by the Karachi Port Trust (KPT) on Wednesday.\n\nA spokesperson for the KPT said that the operation at Younisabad was launched under the supervision of Pakistan Rangers, Sindh.\n\nDIG-South Syed Asad Raza told Dawn that police and district administration were not informed about the action.\n\nHe said area residents pelted KPT administration and law enforcers with stones and blocked the main Mauripur Road. He said that three suspects were briefly detained.\n\nKPT claims to have retrieved seven acres in Younisabad\n\nA Rangers spokesperson told Dawn that the paramilitary force had been taking part in the anti-encroachment drive on the directives of the federal government.\n\nHe said the prime minister had directed all law enforcement agencies, including Rangers, to ‘facilitate’ the KPT to get their 1,100 acres of encroached lands vacated.\n\n“The KPT conducted the operation on illegally encroached land and did not disturb the allottees of Younisabad. The fishermen, who were allotted land in 1993, were not disturbed,” the spokesperson said, adding that during the operation, “a recovery of seven acres illegally encroached by land mafia has been made”.\n\nThe spokesperson clarified that the operation was carried out against two land grabbers, who cut mangroves and reclaimed land from the sea to set up illegal housing schemes.\n\n“In the last two and a half months, about 80 acres of prime land worth Rs 60 billion has been recovered,” he claimed.\n\nMNA condemns action\n\nPakistan Peoples Party MNA from the area Abdul Qadir Patel condemned the action against the residents including women.\n\nIn a statement, he said that he contacted the KPT chairman and Karachi commissioner and asked them to call a meeting to this effect immediately.\n\nHe said any action without giving a legal notice to the residents would be deemed as “illegal”.\n\nHe added that local administration should be taken into confidence prior to such an operation.\n\n“The KPT should get its land vacated but people should not be displaced from their homes,” he said.\n\nPublished in Dawn, March 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67db4bf02a769.jpg",
  "retrievedAt": "2025-10-12T02:04:51.224Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899027/residents-block-karachis-mauripur-road-against-anti-encroachment-operation",
  "dateList": "2025-03-20",
  "date_published": "2025-03-20T00:40:19.000Z"
}
