{
  "title": "Minister for Housing&Works Riaz Hussain chairs meeting to address legal disputes on Constantia Estate in Muree",
  "author": null,
  "content": "ISLAMABAD, Apr 04 (APP):Federal Minister for Housing and Works Mian Riaz Hussain Pirzada Friday chaired a special meeting to discuss the way forward to address the legal disputes on Constantia Estate situated in District Murree.\nFederal Minister for Law and Justice Azam Nazeer Tarar, Secretary Housing and Works, Additional Commissioner Rawalpindi and other senior officers attended the meeting.\nThis meeting was convened on the directions of the Prime Minister of Pakistan Shehbaz Sharif to make concerted efforts for the early settlement of litigation issues on the state owned property.\nAdditional Secretary Housing and Works and Additional Commissioner Rawalpindi gave briefings on the property details and occupation status of Constantia Lodge, bearing estate number 43 and 44, situated at Kashmir Point in Murree. It is a high-value evacuee property measuring 4.6-acre.\nIt was apprised that there were three claimants of the property with several encroachments. In the past, the lodge remained under the use of the Foreign Office for accommodation of foreign missions and was also leased to the Brazilian embassy but later it was transferred to Pak PWD in 1999.\nWhile briefing on the ongoing litigation, it was informed that there were six ongoing cases in different courts of law and recently Lahore High Court Rawalpindi Bench has remanded the case to Commissioner Rawalpindi to decide the matter at the earliest.\nIt was decided in the meeting that the commissioner would rule on the case after hearing all parties and perusing the revenue records.\nCommissioner’s ruling would clear the right of all claimants on merit and after that an aggressive action would be taken by initiating criminal proceedings against all those who have been misleading courts and state offices for years through false claims and forged documents.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:13:09.386Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/minister-for-housingworks-riaz-hussain-chairs-meeting-to-address-legal-disputes-on-constantia-estate-in-muree/",
  "dateList": "2025-04-04",
  "date_published": "2025-04-04T14:23:00.000Z"
}
