{
  "title": "Fehmida urges treasury, opposition to run Parliament as per constitution",
  "link": "https://www.app.com.pk/national/fehmida-urges-treasury-opposition-to-run-parliament-as-per-constitution/",
  "date_published": "2021-03-06T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 06 (APP): Minister for Inter Provincial Coordination Dr Fehmida Mirza on Saturday urged the treasury and opposition benches to play responsible role to run the Parliament in accordance with the Constitution.\nSpeaking in the National Assembly, the minister said that today the opposition benches were empty and requested to give respect to Leader of House, Leader of Opposition and party heads of all the political parties.\nCongratulating Prime Minister Imran Khan on obtaining vote of confidence, Dr Fehmida said the government’s allies would always stand with the premier whenever there was a threat to the supremacy of democracy.\nThe minister said that all the allies were fully supportive of the government from the day first and today the prime minister has obtained more votes as compared to August 2018.\nThe minister criticized the way in which the recently Senate elections were held, raising question whether corrupt practices were stooped and ensured transparency.\nShe said the allied parties from all the four provinces have once again reposed their confidence in the leadership of the Prime Minister.\nDr Fehmida stressed the need for electoral, judicial and political reforms besides reformation in Federal Board of Revenue (FBR) to address all the challenges confronting by the country.\nShe questioned ”Why the leadership of Pakistan Muslim League (PML-N) and Pakistan Peoples Party (PPP) remained unsuccessful in truly implementing the Charter of Democracy (CoD) signed between them.”\nThe minister said no one is asking about seven proxy votes which were cast in Senate polls in Sindh Assembly.\nDr Fehmida said the allies were fully aware of challenges being faced by the present government like Covid-19, FATF and other outstanding issue which would be resolved with joint efforts.\nShe appealed the PM Imran Khan to visit Sindh and Balochistan to personally observe the living standard of people with an objective to change their lives with starting development projects for them.",
  "retrievedAt": "2025-08-11T20:27:11.447Z"
}
