{
  "title": "President for online education, industry experts’ inclusion in advisory boards of varsities",
  "link": "https://www.app.com.pk/national/president-for-online-education-industry-experts-inclusion-in-advisory-boards-of-varsities/",
  "date_published": "2022-07-21T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): President Dr Arif Alvi on Thursday said that shifting the universities from physical to online education system, setting up university advisory boards with members from industry, agriculture and services sectors was essential for speedy progress and development of the country.\nThe president, during a follow-up briefing on International Islamic University, Islamabad (IIUI), at Aiwan-e-Sadr, urged the universities to offer short-term online and hybrid courses to exponentially increase the supply of human resource equipped with marketable skills.\nRector of IIUI, Professor Dr Masoom Yasinzai, and senior officials of the University attended the meeting.\nDuring the meeting, the president called upon the varsities to activate their senates to perpetually provide visionary and strategic guidance, in addition to setting up advisory boards with members from industry, manufacturing, agriculture and services sectors.\nThis, he said, would help them to continuously improve upon their curricula and to undertake focused research and development activities for helping the private sector align with current and future market-driven needs.\nIt would also help meet the ever-changing customers’ needs and demands, and competing in the regional and international markets in terms of quality and cost-effectiveness of our products and services.\nThe president said that the public sector universities should change their behaviour from a secured job attitude to pro-active. They should also endeavour to continuously improve their skills and knowledge base and carry out market-driven research and development in coordination with private sector industry leaders.\nHe further emphasized that universities, in addition to four-year degree courses and PhD programmes, should also offer short skill-based degrees and diploma programs framed and modulated in coordination and input from the Chambers of Commerce and Industry and industry leaders to increase the supply of skilled and educated human resources to speedily narrow the supply and demand gap.\nPresident Alvi highlighted that globally, educational institutions were rapidly shifting from physical education systems to hybrid and online education systems to increase the pace of learning and exponentially increase the number of students.\nHe said that Pakistani universities should benchmark the best online practices of the universities from the developed world and emulate and adopt these best practices for transforming the education systems to remain competitive and relevant.\nThe president said that Higher Education Commission (HEC) should continuously review its Online and Distance Learning policy and take concrete and time-bound actions to encourage the universities to shift to the online mode of education.\nHe also advised HEC to proactively market its 24,000 courses of discounted Coursera Programs to institutions under its purview for their faculty members and students in a time-bound manner.\nPresident Alvi said that Allama Iqbal Open University and the Virtual University of Pakistan should further improve their curriculum and processes, and offer their academic and learning products to those countries where the online and virtual education system was either in infancy or didn’t exist, especially the Islamic countries.\nHe said that the universities should take a critical review of their curriculum and their education and learning system in a holistic and thorough manner to identify behavioural, attitudinal and learning issues to eliminate the underlying reasons behind conflict, discomfort and polarization in students and faculty members to ensure that both the faculty and students were fully focused on gaining knowledge, which was the main purpose of universities.\nPresident Alvi appreciated the role of IIUI in promoting education, research, technology and innovation for the benefit of society and the Muslim Ummah.\nEarlier, Rector IIUI thanked the president for his continuous patronage and guidance to IIUI and briefed the meeting on steps taken by the university to implement various directions and advice given by the president to bring about marked improvement in its performance in all disciplines.",
  "retrievedAt": "2025-08-11T15:16:31.631Z"
}
