{
  "title": "Tourism industry to be promoted through Tourism Authority: AJK PM",
  "link": "https://www.app.com.pk/national/tourism-industry-to-be-promoted-through-tourism-authority-ajk-pm/",
  "date_published": "2022-07-21T16:05:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK) : Jul 21 (APP): Azad Jammu Kashmir Prime Minister Sardar Tanveer Ilyas Khan has said that tourism industry would be promoted in Azad Kashmir, however no compromise would be made on forest conservation and protection of the environment.\nWhile talking to media in the State metropolis on Thursday, the AJK PM while highlighting the objectives of establishment of Tourism Authority (TA) said that the authority was being formed to provide better facilities to investors through one-window operation.\nPromotion of tourism, he said, would not only help to enhance the region’s economy but also provide dignified employment opportunities to the unemployed and educated youth.\n“The government will provide full protection to the local population and investors, at tourist spots”, the PM said adding that the government has stepped-up its efforts to provide facilities and easy access to visitors at tourist destinations.\nHe said besides introducing new tourist spots, tourist and recreational places would be built around the rivers and lakes in the state to further boost tourism.\nThe AJK PM categorically stated that any project affecting the wildlife and natural environment would not be allowed.\nThe officials of the tourism department had been instructed to provide good accommodation, organic foods, adventure tourism, water sports, safari parks and horse riding for the interest of the tourists visiting Azad Kashmir, he added.\nSardar Tanveer said special tourism economic zones would be created at district and tehsil levels.\nRegarding the promotion of information technology, the PM said that a comprehensive policy was being introduced under which thousands of youngsters would be trained.",
  "retrievedAt": "2025-08-11T15:16:22.224Z"
}
