{
  "title": "SC directs PTI to submit substantial evidence for contempt of court proceedings against interior minister",
  "link": "https://www.app.com.pk/national/sc-directs-pti-to-submit-substantial-evidence-for-contempt-of-court-proceedings-against-interior-minister/",
  "date_published": "2022-07-21T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): The Supreme Court on Thursday directed the Pakistan Tehreek-e-Insaf (PTI) and the Pakistan Muslim League Quaid-e-Azam (PML-Q) to submit substantial evidence for initiation of contempt of court proceedings against Interior Minister Rana Sanaullah.\nA two-member SC bench comprising Justice Munib Akhtar and Justice Ijaz Ul Ahsan heard the petition filed by PML-Q leader Chaudhry Pervez Elahi, praying the apex court to initiate contempt of court proceedings against Rana Sanaullah for his alleged threatening statement in violation of the July 1 order of the SC.\nDuring the course of proceedings, Justice Ijaz Ul Ahsan asked PML-Q’s counsel Faisal Chaudhary to explain the specific SC directions which were violated by the interior minister.\nHe further asked whether the petitioner had approached the Election Commission of Pakistan (ECP) against the violation of election laws.\nThe counsel submitted three affidavits of PTI’s provincial assembly members (MPAs), who, he claimed, had been offered millions of rupees to change their loyalties.\nFaisal Chaudhary said Rana Sanaullah had allegedly declared that he would shift PTI lawmakers around. He alleged that PTI MPA Masood Majeed had gone to Turkey after being ‘bought for Rs 400 million’.\nHe claimed that Pakistan Muslim League-Nawaz (PML-N) worker Raheela had contacted three PTI MPAs, who were offered Rs 250 million by Punjab government’s spokesperson Atta Tarar.\nUpon this, Justice Munib Akhtar asked as to when Raheela had contacted the PTI MPAs. He also sought the original affidavit.\nThe counsel replied that the original affidavit was in Lahore.\nTo which, Justice Munib Akhtar remarked that the wording on all three affidavits was the same. He observed the MPAs had not mentioned the specific date in their affidavits when they were given the offer.\nHe asked the counsel to submit additional material to substantiate their allegations in the matter.\nThe court stated that the case against Raheela and Tarar was not one of contempt of court.\nThe counsel pleaded the court to take a suo moto action against the alleged accused. Upon which Justice Munib Akhtar responded that that it was the prerogative of the chief justice to take a suo moto notice.\nJustice Ijaz said no crime could be prejudged. It would be a criminal offence when a crime occurred,\nThe bench also heard Punjab Assembly Speaker Chaudhry Pervaiz Elahi’s contempt of court petition against Rana Sanaullah and directed his lawyer to bring more evidence on record in relation to it.\nJustice Ijaz asked the counsel to prove the allegation of contempt of court. The court’s July 1 order had not been violated, he noted.\nHe observed that the petitioner’s apprehensions were based on assumptions. He advised the counsel to make a contempt case which should not be based on assumptions.\nLater, the case was adjourned till date in office.",
  "retrievedAt": "2025-08-11T15:16:24.309Z"
}
