{
  "title": "Shah for due importance to construction of dams, water reservoirs",
  "link": "https://www.app.com.pk/national/shah-for-due-importance-to-construction-of-dams-water-reservoirs/",
  "date_published": "2022-07-21T17:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): Federal Minister for Water Resources Syed Khursheed Shah on Thursday said it was imperative for the country to give due importance to the construction and maintenance of dams and water reservoirs.\nPakistan country was facing a water crisis as it was everyone’s subject, need and remedy for the protection of natural environment, he said while addressing the workshop on ‘National Water Policy 2018 – Implementation Framework’.\nThe minister said the future water conservation strategies would be conceived keeping in view the plans to meet the requirements of growing population.\nKhursheed Shah said there was also need to create awareness among the masses about the importance of water conservation and judicious use of water in day to day life.\nHe said sufficient availability of water was also important to improve productivity of national agriculture sector. In the past the country had 9,000 gallons of water per capita available, which at present was far less than it, but there were disagreement among various stakeholders on the construction of new dams and water reservoirs.\nHe regretted that no government had taken any initiative for the protection of underground water reservoirs. The provinces should establish a regulatory authority to monitor and protect groundwater reserves.\nThe rapid increase in population, he said, was also another major crisis which was further aggravated by unbridled deforestation.\nHe said, “Water is not free in the world and meters are installed for provision of water but unluckily we are wasting water without any check.”\nHe said population and water were interrelated and Pakistan’s population was growing at a fast pace. Agriculture sector would be affected this year due to scarce water.\n“Water of Balochistan and Sindh is salty, which is not drinkable and dropped below several hundred feet underneath. The problem is compounded by cutting down of trees.”\nHe said the wheat yield was up to 27 to 28 Munds that could be augmented to 110 Munds through rigorous efforts. “Excess of water can increase the yield of wheat and its export. We cannot afford to export the wheat at the moment.”\nThe minister said the agricultural land was converting turning into urban areas, which was causing food security issues. He said water availability could make the country progress and it could become a strong economic power.\nThere was no concept of acute water access and availability for all without proper conservation and judicious distribution of water, he concluded.",
  "retrievedAt": "2025-08-11T15:16:35.300Z"
}
