{
  "title": "“National Curriculum of Pakistan” as new name of curriculum reforms: Rana Tanveer",
  "link": "https://www.app.com.pk/national/national-curriculum-of-pakistan-as-new-name-of-curriculum-reforms-rana-tanveer/",
  "date_published": "2022-07-21T17:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP): Federal Minister for Education and Professional Training Rana Tanveer Hussain Thursday said that the National Curriculum of Pakistan (NCP)” will be the new name of the curriculum reforms in the country.\nChairing the closing session of the two-day National Curriculum Workshop, he said that the NCP will be a comprehensive exercise, covering all four aspects of a quality curriculum, adding that this includes Standards, Textbooks, Teachers Trainings, and Examinations reforms.\n“Going forward, there will be a special focus on Teacher Training, without which reforms are incomplete” he added, said a press release.\nThe two-day workshop was organized by Ministry of Education and Professional Training in collaboration with its development partners with representation by all Federating Units to promote an inclusive approach on the national curriculum and its implementation.\nThe minister emphasized that most importantly, we will spearhead examination reforms. “Our children must move away from rote memorization in exams to concept-based understanding,” he added.\nRana Tanveer said that it was imperative to highlight that the true vision of education reforms began in the previous tenure of the PML-N government in 2013 to 2018. “After the tragic attack on school children at an Army Public School in 2014, a national consensus was evolved to counter violent extremism through a National Action Plan,” he said, adding that development of a national curriculum with consensus to set minimum standards all public and private schools and religious madaris is a part of this serious effort from the government.\nFederal Minister said that the establishment of the National Curriculum Council (NCC) Secretariat, with consensus from all provinces, in 2015 was the first major step in this regard, adding that the purpose was to make minimum standards of quality education for all children in Pakistan, given Article 25A of the Constitution which makes it the state’s responsibility to provide education to every child.\nHe continued that present government was the first one to make a National Curriculum Framework for the country in the year 2017. “A Minimum National Standards Framework document was also released at the time,” he said.\nHe said that to ensure progressive and concept-based religious education, a historic Compulsory Teaching of Holy Quran Act was passed in 2017, adding that Pakistan has not had an education policy since 2009. However, it was our government that devised and released a new National Education Policy draft in 2017, he added.\nRana Tanveer said that curriculum reforms should not be forced on provinces, adding that Sindh separated from this important initiative because of this reason. “Similarly, private sector was alienated because what was supposed to be a minimum standard was treated as maximum standard,” he added.\nHe said that many private publishers went bankrupt due to this unfortunate step, adding that finally, the word “single” caused confusion and excluded the diversity education that is an asset to our country’s rich heritage.The minister said that “we are now ready for getting back on track”.\nRana Tanveer said that our focus is on Inclusivity, where representation from all sectors is to be ensured. He said that we will keep the National Curriculum a living document which will be consistently updated in light of research findings from schools and international best practices.\nThe minister said that to ensure deeper engagement and a truly consultative process for making the National Curriculum, a calendar of country-wide curriculum workshops will be released soon. He said that the Ministry of Federal Education was committed to providing a supporting role to all provinces for capacity building in education and inter-provincial harmony, respecting the 18th Amendment.\nRana Tanveer said that special focus will be put on issues related to Out of School Children, quality of education at school, tertiary and Higher Education level which mainly includes teachers training, missing facilities, girls’ education, improving adult literacy and accelerated learning programs and last but least the skills education.\nRana Tanveer said that it is a matter of great satisfaction that development partners are working with the government in uplifting education standards for the entire country.\nHe said that it is encouraging to see stakeholders from all provinces and Areas participating in this workshop. He said that this will promote collaboration between all federating units of the country post 18th amendment to ensure harmony and quality education across the country.\nAt the end, he thanked all the participants, including provincial education secretaries, heads of provincial curriculum departments, textbook boards, teacher training institutions, and examination bodies present.",
  "retrievedAt": "2025-08-11T15:16:36.341Z"
}
