{
  "title": "Pakistan export to Italy, remittances to Pakistan cross US$ 2 billion",
  "link": "https://www.app.com.pk/national/pakistan-export-to-italy-remittances-to-pakistan-cross-us-2-billion/",
  "date_published": "2022-07-21T11:22:00.000Z",
  "source": "APP",
  "content": "Posting multiple records of growth, Pakistan’s earnings from Italy in exports and remittances crossed $ 2 Billion in Financial Year 2021-2022.\nA substantial growth in Foreign Direct Investment (FDI) from Italy was also witnessed during the record breaking year, said a press statement issued here.\nItaly became the seven billion dollar export country for Pakistan in the world during the year with a record growth of export volume to $ 1146 million, while the remittances from Italy were also on the path to touch billion dollars soon with a total of $ 857 million during the year.\nJune 2022 also set the record for highest export volume ever to Italy in a single month crossing $ 144 million.Italy posted the highest growth both in workers remittances among all countries with high numbers of Pakistan diaspora and for exports among the top ten export destinations of Pakistan.\nThis phenomenal growth in exports and remittances has come at a time when European economies in general and Italian economy in particular is slowing down and facing multiple challenges due to Ukraine war.\nThe exports to Italy of $1.15 billion in FY 2021-22 are 46% higher than the previous year, while the remittances are 41 % higher for the same period than the last year.\nWhile talking to media, Pakistans Ambassador to Italy, Jauhar Saleem paid glowing tributes to the Pakistani exporters for their initiative and hard work and to the Pakistani diaspora in Italy for standing by the country in a most challenging economic environment.\nHe also shared that Pakistan had posted a record trade surplus of $ 573 million during the financial year 2021-22 which is 91% higher than the previous year.\nAccording to the envoy, the value added sectors were the main drivers of the exceptional export growth with exports of plastic products increasing by 208%, sports goods 80%, leather 42%, home textiles 36% and garments 35%. The ambassador also shared that even as the pandemic hit global footwear market witnessed a contraction of shrank demand during the year, Pakistan’s exports of footwear to Italy increased by 19% in the year and Italy has become the 3rd largest export destination for Pakistani footwear. Italy is also the 5th largest destination for Pakistani home textiles and ranks No.6 in garments exports.\nAmbassador Saleem also informed that with the revival of market activities after removal of pandemic related restrictions in Italy, the Pakistan Embassy in Italy was further pacing up its activities to connect Pakistani businesses with Italian firms to sustain the exports and FDI growth.\nDuring the just concluded financial year, Pakistan received Italian investment in the sectors of food processing, chemicals, construction, leather, footwear, energy related equipment and IT. The Ambassador also shared that some of the recent joint ventures between leading Pakistani and Italian footwear firms were enabling technology transfer, international marketing skills and supply chain management to Pakistani firms.\nMoreover, Italy was also providing technical support in agriculture sector especially related to olive and olive products. Similarly, Italy is supporting the efforts for reduction of risks of Glacial Lake Outburst Floods (GLOF) and hydrogeological hazards in mountainous areas by establishing an evidence-based assessment and monitoring system for glaciers in Gilgit Baltistan.\nAmbassador Jauhar Saleem also informed the media that Italy has announced to allow 69,700 seasonal workers from selected countries in 2022 to come to Italy for work. Pakistan has already been included in the Italian Seasonal Work Visa Programme for 2022, which would offer many opportunities to our workers in agriculture and services sector to work in Italy.\nHe added that Italian government has recently reduced the timelines for work visa processing which has been a long standing demand from Pakistani workers. With the record increase in remittances during the last 3 years, Italy has become the largest contributor to this financial sector from the European Union.\nIn 2021-22, around 25% of the total Pakistan workers remittances from the EU came only from Italy. The envoy stated that the dynamic diaspora in Italy had helped post highest growth in workers remittances among all remittances destinations in the world making Italy Pakistans 8th largest destination for remittances globally and number one within the EU.\nKeeping in view the Italian labour market conditions and employment opportunities for Pakistani workers, the growth momentum would be maintained by connecting more Pakistani workers with Italian job market.",
  "retrievedAt": "2025-08-11T15:16:31.945Z"
}
