{
  "title": "FS co-chairs 3rd meeting of CPEC Joint Working Group",
  "link": "https://www.app.com.pk/national/fs-co-chairs-3rd-meeting-of-cpec-joint-working-group/",
  "date_published": "2022-07-21T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 21 (APP): Pakistan and China on Thursday reviewed continued implementation of the China Pakistan Economic Corridor (CPEC) and its expansion to jointly agreed priority areas.\nReview was made during the 3rd meeting of the CPEC Joint Working Group (JWG) on International Cooperation and Coordination (JWG-ICC) held in the virtual mode.\nThe meeting was co-chaired by Foreign Secretary Sohail Mahmood and China’s Assistant Foreign Minister Wu Jianghao, a press release issued here by the Ministry of Foreign Affairs said.\nSenior officials of the Ministries of Foreign Affairs on both sides as well as relevant organs including Pakistan’s Ministry of Planning, Development and Special Initiatives and the Board of Investment, and China’s National Development and Reform Commission (NDRC) also participated.\nThe Foreign Secretary underscored the centrality of the time-tested Pakistan-China All-Weather Strategic Cooperative Partnership in Pakistan’s foreign policy.\nHe added that, manifesting the historic choice of both countries and peoples, the vitality and dynamism of CPEC reflected the deep-seated mutual goodwill that lay at the heart of the bilateral relationship.\nThe Foreign Secretary underlined that the timely completion of CPEC projects and steady progress on realizing important projects in the pipeline was energizing bilateral cooperation and further strengthening the foundation for Pakistan’s economic modernization and enhancing the capacity for sustained progress and prosperity.\nIt was agreed that CPEC’s development had reached a new point, with increasing emphasis on high-quality development of industry, agriculture, IT, and science and technology, while ensuring tangible socio-economic benefits for the people.\nIt was further noted that as a flagship of the Belt and Road Initiative, CPEC had broken new ground in strengthening international and regional connectivity, especially in the context of its extension to Afghanistan.\nAs an open and inclusive platform, both sides welcomed interested third parties to benefit from avenues for mutually beneficial cooperation opened up by CPEC.\nThe two sides also agreed to support and encourage the media and think tanks to highlight CPEC’s contributions as a high-impact case study of international cooperation for sustainable development.",
  "retrievedAt": "2025-08-11T15:16:35.189Z"
}
