{
  "title": "Almost 88% per unit subsidy being given to gas consumers of two lowest slabs: NA informed",
  "link": "https://www.app.com.pk/national/almost-88-per-unit-subsidy-being-given-to-gas-consumers-of-two-lowest-slabs-na-informed/",
  "date_published": "2022-06-09T11:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): Minister of State for Petroleum Dr Musadik Malik on Thursday informed the National Assembly that the government is giving around 68-88 percent per unit subsidy to domestic gas consumers of two lowest slabs, which constitutes 91 percent and 80 per cent of total households connected with the networks of SNGPL and SSGC respectively.\n“If the consumers of third slab are included, the overall percentage stood at 99,” he said responding to a Calling Attention Notice moved by MNAs Aliya Kamran, Syed Mehmood Shah, Muhammad Anwar, Muhammad Jamal-ud-Din and Dr Shazia Sobia Aslam Soomro regarding ban on new domestic gas connection and Compressed Natural Gas (CNG) stations.\nDr Musadik said the government would lift the ban once the local gas deposits and the commodity supply and transmission network improves in due course of time and with discovery of significant hydrocarbon reservoirs.\nHe said the ban was imposed by the previous government due to inadequate reservoirs of indigenous gas that were depleting at the rate of 10 percent annually.\n“If the depletion continues at the same ratio, by the year 2030, the LNG share in the total energy-mix of the country would be around 76 per cent and natural gas 24 percent” said the minister adding that during the peak winter season, almost 97 per cent of imported LNG was supplied to the domestic consumers to meet their needs, selling the commodity below the purchase price that had been putting an extraordinary burden on the national exchequer.\nHe said it was unjustified that the government was importing the LNG that cost almost four times more than the natural gas being supplied to different consumers with massive subsidies.\nThe minister said around Rs 162 billion subsidy was being given to the domestic gas consumers, Rs 81 billion to the zero-rated industry and Rs 18 billion to the fertilizer sector annually on account of LNG supply.\nDue to massive subsidies, he said the gas sector’s circular debt had reached Rs 1.4 trillion figure because of the wrong policies of the PTI government, which was at zero when the PML-N government completed its five-year democratic term in 2018.\nCommenting on the demand-supply gap, the minister said at present the country was producing around 3,460 Million Cubic Feet per Day (MMCFD) gas against the demand of 6,653 MMCFD gas, adding if looked at the ‘system gas’ that could be injected in the supply lines it stood at 1600-1700 MMCFD. While, around 1,200 MMCFD Re-gasified Liquefied Natural Gas (LNG) was being injected in the system through two LNG terminals, established during the previous tenure of the Pakistani Muslim League-Nawaz government, he added.\nDr Musadik said around 800 MMCFD gas was provided to consumers at the network of Sui Northern Gas Pipelines Limited (SNGPL) and 825 MMCFD at the system of Sui Southern Gas Company (SSGC), adding it reached 950 MMCFD and 1,350 MMCFD in winter at the transmission system of the two companies respectively.\nThe minister said the government was making all out efforts to effectively tackle challenges confronted in the gas sector with collective wisdom, putting the country on a consistent path of progress and prosperity.\n“First, we will attain stability and strengthen the national kitty, and then the relief will be given to poor segments of the society. The subsidy to the downtrodden people will be given at every cost,” he said.\nIn coming days, he said the government would share a complete road-map to achieve the much needed self-reliance in the energy sector, giving a special focus on increasing the oil and gas exploration activities in potential areas of the country and encouraging the private sector in the LNG business.\nAnswering a question, the minister assured the House that the government would reconsider the Iran-Pakistan gas pipeline project and look into the possibilities, keeping in view the international sanctions imposed on the commodity exporting country.\nTo another question, he said the government would make a formal announcement in the next few days about the discovery of hydrocarbon deposits in tribal areas of the country.\nReplying to a query of MNA Syed Mehmood Shah, the petroleum minister cautioned that no province would be able to give gas to others, if any ‘major discovery’ was not made in the coming years.\nHe said the government had directed the Pakistan Petroleum Limited and Oil and Gas Development Company Limited to prepare a plan exploring ways and means to utilize alternative energy resources to meet the needs of domestic consumers.\nThe minister also reiterated in a categorical term that there were no ‘minutes, MOU or any contract at government-to-government level’ signed by the previous PTI government with Russia for import of oil at 30 per cent reduced rate.\nHe regretted that the public was being hoodwinked by the PTI leadership in that regard as it had been doing in the matter of international conspiracy.\nThe minister asked the elements, who were talking about availability of oil at 30 percent reduced rate from Russia, to bid in the tenders floated by the Pakistan State Oil every fortnight.",
  "retrievedAt": "2025-08-11T15:03:33.091Z"
}
