{
  "title": "Govt revives work on CPEC with full speed: Senate informed",
  "link": "https://www.app.com.pk/national/govt-revives-work-on-cpec-with-full-speed-senate-informed/",
  "date_published": "2022-06-09T07:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): Federal Minister for Board of Investment (BOI) and Special Initiatives Chaudhry Salik Hussain on Thursday informed Senate that the government has revived work on China Pakistan Economic Corridor (CPEC) project with full speed.\nReplying queries during Questions Hour session in the Senate, he said a long term plan is being considered into an implementation matrix on CPEC, adding that joint working groups are being convened to pave the way for 11th Joint Cooperation Committee (JCC) meeting in this regard.\nHe said that the Chinese investment has decreased by 10 percent in last two years (FY2020- FY2021).\nIn written reply, the minister said that the decrease in Chinese investments was due to various reasons including COVID-19. He said that COVID-19 outbreak caused a sharp decline in global economic activity.\n“As majority of Chinese investments fall under the CPEC ambit, the economic disruptions and social restrictions caused by COVID-19 also impacted the pace of CPEC, thus impacting the overall Net FDI” he added.\nThe minister said that the decrease in Chinese investment in the last two years is partly due to the conclusion of CPEC Phase-1 which has overall impacted the outlay of Chinese investments in Pakistan.\nThe minister said that unfortunately during previous government’s tenure CPEC was not assigned priority in either allocation of resources or implementation.\nChaudhry Salik said that creation of CPEC authority created confusion and duplication in functions of Ministries and Departments.\nHe said that most of the early harvest projects under the first phase of CPEC relating to power and infrastructure have completed and CPEC has entered the second phase (2020-2025) which focuses on industrial cooperation which is a long-term endeavor and dependent on industrialization through industrial relocation from China, particularly in the Special Economic Zone (SEZs). Sites for Nine SEZs were identified but not a single SEZ was readied, in fact work on five SEZs was never started.\nHe said that the decrease in Chinese investments in the last two years is also due to decrease in the FDI inflows in the manufacturing sector; electrical machinery (-36.41 percent) and ceramics (-63.83 percent) being the top two sectors with major decline.\nHe said that despite all the aforementioned facts, the country-wise FDI data confirms that China has the largest share of foreign investment in Pakistan.\nReplying another question, in written reply the minister said that as per State Bank report, Net Foreign Direct Investment (FDI) has been recorded at $1,056.6 million during first half (July-December) of the Current Financial Year 2021-22.\nHe said that the same is 20.1% higher than the corresponding period of preceding Financial Year 2020-21 i-e.879.7 million.\n“However, last ten year trend regarding Foreign Direct Investment (FDI) in the country shows that since financial year 2017-18 onwards net FDI has decreased todate” he said, adding that FDI from July to April, 2021-22 has decreased, being US$ 1455.6 million as compared to the same period of last financial year 2020-21, being US$ 1480 million dollars.",
  "retrievedAt": "2025-08-11T15:03:42.476Z"
}
