{
  "title": "Rs. 6.505 billion allocated for PBM during FY 2022 to assist needy",
  "link": "https://www.app.com.pk/national/rs-6-505-billion-allocated-for-pbm-during-fy-2022-to-assist-needy/",
  "date_published": "2022-06-09T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 9 (APP): An amount of Rs 6.505 billion has been allocated to Pakistan Bait-ul-Mal (PBM) during the Fiscal Year 2022 to provide assistance to the destitute and needy persons through executing various pro-poor schemes, according to the Economic Survey 2021-22.\nThe Survey unveiled by the Federal Minister for Finance, Miftah Ismail, Federal Minister for Planning, Development and Reforms, Ahsan Iqbal and Federal Minister for Power, Engineer Khurram Dastgir during a press conference on Thursday.\nAn amount of Rs 1.5 billion has been disbursed to support poor, widows, destitute and orphans for medical treatment, education and general assistance from July-March Fiscal year 2022 under the Individual Financial Assistance (IFA) initiative.\nThe PBM has utilized an amount of Rs 524.080 million under its initiative of Schools for Rehabilitation of Child Labour for the period July-March while an amount of Rs 335.797 million has been utilized under the initiative of Women Empowerment Centers (WEC) aimed at providing skills based trainings to the women during July to March.\nAn amount of Rs 441.649 million has been spent through the Dar-ul-Ehsaas (orphanages) initiative up to month of March to provide free food, nutrition, medical treatment, boarding and lodging, as well as, free education through well reputed educational institutes.\nThe PBM has utilized an amount of Rs 7.100 million under the initiative of Ehsaas Kada (for shelter less senior citizen) for the period from July-March. The initiative aimed at providing free of cost boarding/lodging, messing and medical care of excellent standard to the senior citizens.\nAn amount of Rs 183.015 million has been utilized under Ehsaas Panahgahs initiative up to March, since inception while an amount of Rs 161.088 million has been utilized under Ehsaas Koi Bhooka Na Soye (EKBNS) initiative till March.\nPBM has disbursed an amount of Rs 22.174 million under the initiative of Isntitutional Rehabilitation for NGOs till March.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:03:27.533Z"
}
