{
  "title": "Senate passes Fiscal Responsibility and Debt Limitation (Amendment) Bill 2022",
  "link": "https://www.app.com.pk/national/senate-passes-fiscal-responsibility-and-debt-limitation-amendment-bill-2022/",
  "date_published": "2022-06-09T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP):The Senate on Thursday passed the Fiscal Responsibility and Debt Limitation (FRDL) (Amendment) Bill, 2022 with a majority vote.\nThe bill was moved by Minister of State for Finance, Aisha Ghaus Pasha in Upper House of the Parliament amid protest by the members of Pakistan Tehreek-e-Insaf (PTI). National Assembly has already passed the bill.\nThe amendments would strengthen the debt office with the mandate and resources for effective planning and execution of debt management functions of the government.\nAccording to the statement of Objects and Reasons, the bill will provide reduction in the federal fiscal deficit and ratio of public debt to gross domestic products by effective debt management.\nIt is pertinent to mention that the Debt Policy Coordination Office was also established under this Act.\nThis Amendment Bill proposes main amendments in the prevailing version of the Act (Amended in 2017).\nThe bill generally seeks to achieve key objectives including; limit the stock of government guarantees at 10 percent of GDP; Publication of Medium Term National Marco-Fiscal Framework; Institutionalize debt management functions in a single office reporting to the Finance Secretary; Assignment of additional functions to Debt Officer and create two additional senior management positions with Debt Office.\nEarlier, Leader of the Opposition, Dr Shahzad Waseem urged the Chairman to refer the bill to the concerned committee for detailed vetting and discussion.\nLaw Minister, Azam Nazir Tarar asked for passage of the bill. Minister for Federal Education, Professional Training, National Heritage and Culture, Rana Tanveer Hussain said the previous PTI government had passed 36 billion within 15 minutes without holding any debate.",
  "retrievedAt": "2025-08-11T15:03:40.673Z"
}
