{
  "title": "VC AIOU for welfare, facilitation of employees",
  "link": "https://www.app.com.pk/national/vc-aiou-for-welfare-facilitation-of-employees/",
  "date_published": "2022-06-09T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): Vice-Chancellor, Allama Iqbal Open University (AIOU), Prof. Dr. Zia Ul-Qayyum has  said that the welfare of the employees and provision of a conducive environment to the faculty members were top priorities of the organization.\nWhile addressing the General Body meeting of the newly elected Academic Staff Association (ASA), the Vice-Chancellor said that policy was being considered to increase the medical allowance while ODL is being made conditional on performance.\nHe said that a uniform policy was also being formulated to address the issues and legitimate demands of the employees and teachers.\nAll the steps have been taken following the rules and regulations of the university.\nFaculty members have been provided with a conducive environment for teaching and learning due to which 29 faculty members have completed their Ph.D. in the last three years and they deserve appreciation for this achievement.\nPresident, ASA, Dr. Shah Moinuddin Hashmi said that AIOU stood out across the globe after its digitization.\nHe said that all the recent steps taken for the development of the university and the welfare of employees including digitalization were commendable and congratulated VC.\nHe pointed out several points for the professional development and well-being of faculty members and requested the Vice-Chancellor to advertise vacancies in various university departments.\nSecretary-General, ASA, Dr. Salman Qureshi presented the mission and manifesto of the association and welcomed newly inducted faculty members.\nAt the beginning of the meeting, a collective prayer was offered for the relatives of the faculty members who have passed away since Covid 19.\nMoreover, shields were presented to those 29 faculty members who completed their Ph.D. in the last 3 years.",
  "retrievedAt": "2025-08-11T15:03:39.203Z"
}
