{
  "title": "NAB chairman to be appointed through selection committee: Shahadat",
  "link": "https://www.app.com.pk/national/nab-chairman-to-be-appointed-through-selection-committee-shahadat/",
  "date_published": "2022-06-09T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): State Minister for law and Justice Senator Shahadat Awan on Thursday said the appointment of new National Accountability Bureau (NAB)’s chairman would be made through a selection committee with the consultation of the leaders of the house and opposition.\nResponding to supplementary query raised by Pakistan Tehreek-e-Insaf’s Senator Azam Khan Swati , he made it clear that the appointment of NAB chairman could not be made at the whim of any individual.\nAssuring at the floor of the upper house of the parliament, he said whosoever would be appointed in the chair, he would be neutral, competent, and independent with a good character and he would treat all the people equally without any prejudice.\nReplying to Senator Mushtaq Ahmed of Jamaat-e-Islami who pointed out the credibility and impartiality of NAB in the past, Shahadat said the aim of this institution was to remove corruption from all segments of the society but it could not perform its professional obligations in accordance with its mandate in the previous government’s tenure.\nHe assured that in this regime, the justice would prevail and those who had misused their authority in the past would be held accountable across the board.\nHe said the legislation would be made in the NAB ordinance with the consultation of all parliamentary parties and they would be in the larger interest of the country and the nation.\nThe NAB reforms would be introduced in a bid to make the country corruption free, he added. Senator Saleem Mandviwala of Pakistan Peoples Party raised the question about the NAB officials’ assets declarations and urged to make them public as legislators’ assets go viral through media.\nOn this, the state minister for law and justice said the government employees submitted their assets declarations on yearly basis if some specific department like NAB was showing negligence would be questioned through proper channel.\nHe informed the house that as per NAB’s record, it had taken departmental action against its 300 employees in various cases of misconduct, disciplinary and criminal ones.\nHe said it would take some time to clean the dirt of previous government and bring the NAB to run its affairs within the constitutional parameters.",
  "retrievedAt": "2025-08-11T15:03:38.994Z"
}
