{
  "title": "Majlis-e-Shoora passes elections amendment bill",
  "link": "https://www.app.com.pk/national/majlis-e-shoora-passes-elections-amendment-bill/",
  "date_published": "2022-06-09T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): The Joint Session of Parliament (Majlis-e-Shoora) on Thursday passed a bill to amend the Elections Act, 2017, and suggested the Election Commission of Pakistan to conduct pilot projects for utilization of electronic voting machines and biometric verification and share the results with the government.\nMinister for Parliamentary Affairs Javed Murtaza Abbasi moved the Elections (Amendment) Bill, 2022.  Earlier, this bill was forwarded to the president for his assent after passage from the National Assembly and the Senate, but was sent back to the parliament for reconsideration.\nNA Deputy Speaker Zahid Durrani and Senate Chairman Sadiq Sanjarni formally apprised their houses about the bill returned by the president for reconsideration. The bill was reconsidered in the parliament’s joint sitting and passed without any further amendment.\nThe Article 75 of the Constitution of Pakistan says that when a bill is presented to the president for assent, the president shall, within [ten] days will give assent to the bill; or in the case of a bill other than a Money Bill, return the bill to the Majlis-e-Shoora (Parliament) with a message requesting that the bill or any specified provision thereof, be reconsidered and that any amendment specified in the message be considered.\nIt further states that when the president has returned a bill to the Majlis-e-Shoora (Parliament), it shall be reconsidered by the Majlis-e-Shoora (Parliament) in joint sitting and, if it is again passed, with or without amendment, by the Majlis-e-Shoora (Parliament), by the votes of the majority of the members of both houses present and voting, it shall be deemed for the purposes of the Constitution to have been passed by both houses and shall be presented to the president, and the president shall give his assent within ten days, failing which such assent shall be deemed to have been given.\nMurtaza Javed Abbassi said the president’s advice to reconsider the returned bills was violation of clause 2 of Article 75. The former government did not take any practical steps for i-voting. A consultant firm had carried out a complete audit of NADRA’s system, which gave three years time for introducing an effective system for the purpose.\nNeither resources were provided to update the system nor registration process for the overseas Pakistanis was started, he said. He responded to all the objections raised from the President’s Office on the bill.\nThe chair did not allow Senator Mushtaq Ahmed of the Jamaat-e-Isalmi to move  amendments in the Elections (Amendment) Bill 2022. He demanded reserved seats for the overseas Pakistanis and other segments of the society.\nMinister for Law Azam Nazeer Tarar said there was need to amend the Constitution for the purpose and a parliamentary committee would be constituted for electoral reforms at a broader level. “We don’t want to show only our efforts but will take serious steps for electoral reforms in the larger interest,” he added.\nSenators Mian Raza Rabbani and Farooq H. Naek said amendments to the bill, which had been returned to the parliament for reconsideration, could not be presented in the house.\nAfter passage of the bill earlier form both houses of the parliament, it was being propagated that the overseas Pakistanis had been deprived of the voting right under the Elections (Amendment) Bill 2022. However, the government slammed those propagating against it and rejected the opinion of depriving overseas Pakistanis from voting.\nThe Islamabad High Court also said that none of the amendments made to the Elections Act, 2017 by the incumbent coalition government deprived the overseas Pakistanis of the right to vote.\nIn the Elections (Amendment) Bill 2022, the joint sitting passed the insertion of new section 72B, Act XXXIII of 2017. Now in the said bill, after 72A, the new section 72B will be inserted namely ‘72B.\nAs per amendment in section 94, Act XXXIII of 2017: “The Commission may conduct pilot projects for voting by overseas Pakistanis in bye-elections to ascertain the technical efficacy, secrecy, security and financial feasibility of such voting and shall share the results with the government, which shall, within fifteen days from the commencement of a session of House after the receipt of the report, lay the same before both Houses of Majlis-e-Shoora (Parliament).”\nAs per amendment in section 103, Act XXXIII of 2017 namely Electronic Voting and Biometric Verification: “The Commission may conduct pilot projects for utilization of electronic voting machines and biometric verification, casting and counting of votes to assess the technical efficacy, secrecy, security and financial feasibility of the electronic voting machines and biometric verification system and shall share the results with the Government, which shall, within fifteen days from the commencement of a session of a House after the receipt of the report, lay the same before both Houses of Majlis-e-Shoora (Parliament).”",
  "retrievedAt": "2025-08-11T15:03:28.781Z"
}
