{
  "title": "Incumbent govt taking steps for uplift of South Punjab: Governor",
  "link": "https://www.app.com.pk/national/incumbent-govt-taking-steps-for-uplift-of-south-punjab-governor/",
  "date_published": "2022-06-09T16:44:00.000Z",
  "source": "APP",
  "content": "MULTAN, Jun 09 (APP):Punjab Governor Muhammad Baligh-ur-Rehman on Thursday said the incumbent government was keenly interested in uplift of South Punjab with an aim to resolve the problems of the people at their doorsteps. He expressed these views  while addressing a meeting held at Governor House Lahore regarding South Punjab Secretariat.\nAdditional Chief Secretary South Punjab Saqib Zafar gave briefing to Governor. He said all the departments will be transferred to South Punjab gradually and South Punjab Secretariat will be made fully empowered.  Baligh said that immediate steps were required for the development of various sectors of South Punjab.\nHe said the agriculture was one of the most important sectors and it was the need of hour to introduce modern technology in this sector to put the country on way to progress and prosperity. The Punjab governor said that a permanent strategy was also required in Cholistan to deal with the effects of drought.\nHe said that work would be made for the promotion of livestock and tourism in South Punjab. Giving briefing, Additional Chief Secretary South Punjab Saqib Zafar said the performance of various departments of South Punjab Secretariat was improved due to monitoring.\nHe said the department of Education, South Punjab has established first ever Transgender School and Subh-e-Nau school and it has also the distinction of holding schools Olympics and elections of Student Council.\nHe said the Department of Agriculture, South Punjab has played a vital role in increasing the production of cotton and wheat. Similarly, monitoring of health centers and THQs has increased their service delivery.\nLikewise, steps have been taken for uplift of Livestock in South Punjab and tree-plantation, he added.\nSaqib Zafar said the Planning and Development Department had the unique honor of conducting “Development Dialogue” in which representatives of  international organizations participated.\nIt was further informed in the briefing that construction work on building of South Punjab Secretariat Multan was underway with rapid pace while 400 kanals of land has been acquired for Bahawalpur Secretariat.",
  "retrievedAt": "2025-08-11T15:03:19.390Z"
}
