{
  "title": "Buzdar inaugurates Rs 900 m uplift projects of Fort Munro",
  "link": "https://www.app.com.pk/national/buzdar-inaugurates-rs-900-m-uplift-projects-of-fort-munro/",
  "date_published": "2021-08-29T16:15:00.000Z",
  "source": "APP",
  "content": "RAJANPUR, Aug 29 (APP): Punjab Chief Minister Sardar Usman Buzdar Sunday inaugurated eight uplift projects worth Rs 900 million for the development of Fort Munro.\nThe chief minister inaugurated four uplift projects including solar lights network, parks and horticulture projects at a cost of Rs 100 million, inauguration of Fort Munro to Langar Khund Sar road at a cost of Rs 290 million during his visit to Fort Munro on Sunday.\nSimilarly, upgradation of Fort Munro resort with cost of Rs 50 million.\nLikewise, Mr Usman Buzdar also performed ground breaking of another four development projects including Rs 90 million would be spent on restoration of Fort Munro water supply scheme and water issue would be resolved on permanent basis at the tourist site through this scheme.\nChief Minister also laid foundation stone of new project to promote tourism in Koh-e-Suleman area with estimated cost of Rs 100 million.\nHe also performed ground breaking of Rescue 1122 station at Fort Munro on the longstanding demand of people with cost of Rs 50 million and others.\nOfficials gave briefing to CM on Fort Munro cadet college, welfare complex and other projects.\nPunjab CM Sardar Usman Buzdar accompanying by Chairman Senate Sadiq Sanjrani and minister of state for Climate Change, Zartaj Gul planted saplings in connection with clean and green drive.\nThey also made prayer for the progress and prosperity of the country.\nMeanwhile, addressing the notables of tribal areas at Fort Munro, CM Usman Buzdar said that Koh-e-Suleman development authority has been restored and made fully operational. He said that the funds Rs 5.70 billion have been earmarked for the development of Koh-e-Suleman.\nHe said that the provincial government has fixed 100 acres land for Fort Munro cadet college as Rs 2.80 billion would be spent on the project.\nHe announced that another cadet college would be built in Koh-e-Suleman area and the feasibility study of the project was underway.\nHe said that admissions to the kids of Koh-e-Suleman area would be provided free of cost while government would also bear the boarding and other expenses.\nThe work was underway to establish solid waste management company to resolve the cleanliness issue in Fort Munro area on permanent basis.\nHe said that the work on 108 kilometres roads in Fort Munro and Koh-e-Suleman areas was also underway.\nPunjab CM also announced a hospital at Rakni Barkhan area of Balochistan province as Punjab government would bear the expenses of state of the art hospital.\nHe said that the historical buildings in Fort Munro area would also be restored in actual condition.\nUsman Buzdar said that the steps were being taken to expand tourism at recreational site Fort Munro with special focus as per vision of Prime Minister Imran Khan.\nHe said that the further mega uplift projects would be announced after completion of ongoing schemes.\nPunjab CM said that he would personally monitor the ongoing uplift projects.",
  "retrievedAt": "2025-08-11T21:08:50.780Z"
}
