{
  "title": "Governor emphasize upon preventive measures for thalassemia",
  "link": "https://www.app.com.pk/national/governor-emphasize-upon-preventive-measures-for-thalassemia/",
  "date_published": "2021-08-29T16:02:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 29 (APP): Sindh Governor Imran Ismail Sunday said thalassemia was a contagious disease and it is necessary to be tested to be safe from the disease, because testing can save future generations from anguish and suffering.\nHe expressed these views while addressing a Thalassemia Screening Camp organized by Kashif Iqbal Thalassemia Career Center at Governor House.\nWife of Sindh Governor, Kashif Iqbal Thalassemia Career Center’s Chairman Muhammad Iqbal and others were also present on the occasion.\nThe governor and his wife had also given their blood samples for tests at the camp.\nThe governor said sincere and honest leadership does everything for its people so that their people do not have to go through pain and suffering. Prime Minister Imran Khan is working for the betterment of the country and the nation with the same thinking and passion.\nHe said the legislation exist in the country regarding thalassemia but unfortunately it was not being fully implemented, adding, the prime minister has formed committees at the federal level for its effective implementation.\nWe are trying to set up as many test camps as possible but wherever it is available people should definitely get themselves tested.\nThe governor expressed the hope that media would play its role in creating awareness among masses regarding thalassemia.\nHe said the Green Line project is being constructed with federal funding. For this project, 40 buses would reach Karachi from China within a month. The journey in these buses will be very comfortable. The fare of these buses would be kept low while the completion of project would also resolve traffic congestion issue of the city.\nUnfortunately the provincial government has not been able to bring even a single bus to Karachi in 13 years and people are forced to travel in old and outdated buses.\nReplying to a query regarding health cards, Imran Ismail said the federation has distributed health cards in Tharparkar and Umerkot. The health cards could only be distributed throughout the province through joint ventures between the federation and the province.\nThe part of it has to be paid by the federal government while rest by the provincial government, he informed.\nThe federal government also made an offer to the Sindh government but the provincial government turned down the offer. “It hurts when I see people all over Pakistan are getting health cards but people of Sindh are deprived of it.”\nAt present, 100 per cent people in Khyber Pakhtunkhwa and Balochistan while 60 per cent people in Punjab have been issued health cards.\nAddressing on the occasion, Governor Sindh’s wife said thalassemia is a hereditary disease which is transmitted from generation to generation.\nShe added that with precautionary measures and awareness, it might be prevented. Proper and timely blood tests could save future babies from this deadly disease.\nShe expressed the hope that her efforts will create awareness among the masses and help in the eradication of thalassemia disease from the country.",
  "retrievedAt": "2025-08-11T21:08:50.767Z"
}
