{
  "title": "COVID-19 national tally of active cases recorded highest during fourth wave",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-recorded-highest-during-fourth-wave/",
  "date_published": "2021-08-29T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): The national tally of total active COVID-19 cases was recorded 93,504 one of the highest during fourth wave of pandemic on Sunday with 3,909 more people testing positive for the deadly virus and 3,443 people recovering from the disease during the last 24 hours.\nSixty-nine corona patients have died during past 24 hours, 62 of whom were under treatment in the hospitals and seven of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Punjab followed by Khyber Pakhtunkhwa (KP).\nOut of the total 69 deaths occurred, 31 of them died were under treatment on ventilators.\nThere were 5,639 Covid infected patients under treatment in critical condition with 43 infected people admitted during past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 6.21%.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 40%, Bahawalpur 47%, Lahore 48% and Multan 70%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Abbottabad 76%, Swabi 83%, Swat 66%, and Gujranwala 60%.\nAround 517 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan and Azad Gilgit Baltistan (GB).\nSome 62,918 tests were conducted across the country on Saturday, including 18,895 in Sindh, 21,878 in Punjab, 11,601 in Khyber Pakhtunkhwa (KP), 6,330 in Islamabad Capital Territory (ICT), 2,031 in Balochistan, 706 Gilgit Baltistan (GB) and 1,477 in AJK.\nAround 1,033,373 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,152,481 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 31,861, Balochistan 32,157, GB 9,855, ICT 98,739, KP 160,759, Punjab 389,688 and Sindh 429,422.\nAbout 25,604 deaths were recorded in country since the eruption of the contagion.\nAround 6,812 people perished in Sindh, eight of them died in the hospitals and one out of the hospital on Saturday.\n11,799 people died in Punjab died with 40 deaths occured in past 24 hours. Some 34 individuals died in the hospitals and six out of the hospitals.\nAs many as 4,927 people expired in KP, 18 of them died in hospitals on Saturday, 861 individuals died in ICT, 338 people died in Balochistan, 173 infected people perished in GB, one of them died in the hospital on Saturday and 694 people died in AJK, one of them succumbed to the deadly virus in the hospital on Saturday.\nA total of 17,647,941 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 6,173 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:08:54.132Z"
}
