{
  "title": "PM’s prudent foreign policy dramatically changes Pakistan’s global relevance, face",
  "link": "https://www.app.com.pk/national/pms-prudent-foreign-policy-dramatically-changes-pakistans-global-relevance-face/",
  "date_published": "2020-07-12T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP):The transformation of Pakistan’s image as peacemaker state, recognition as the best tourist destination, awaking the slumbering world to the Indian atrocities in Kashmir and thwarting the Indian designs of isolating Pakistan are the offerings of Prime Minister Imran Khan’s successful and prudent foreign policy to the countrymen.\nThe Pakistan Tehreek-e-Insaf-led government had inherited a Pakistan with badly tarnished image due to machination of antagonistic forces, flawed diplomacy and mistaken priorities of the ruling parties.\nPrime Minister Imran Khan’s charismatic personality, visionary policies and unequivocal narrative has dramatically turned things in favour of Pakistan.\nBe it a vile Indian plan of diplomatically isolating Pakistan or the evil conspiracy of sending the issue of Kashmir to back burner, unholy plan to label Pakistan as “terror state” or a nefarious scheme to push Pakistan in FATF blacklist, every design has been thwarted by the successful, measured and prudent diplomacy of Prime Minister Imran Khan.\nAccording to a video released on its social media pages by Prime Minister’s Office, the dynamic leadership of the prime minister has dramatically changed the global relevance and face of Pakistan.\nPakistan thwarted Indian designs of diplomatically isolating Pakistan and putting it on FATF list but Imran Khan-led government made the country sail through all the challenging circumstances.\nFulfilling his commitment to become an ambassador of the people of Indian Occupied Jammu and Kashmir, Imran Khan boldly presented their case to the UN General Assembly which made the human rights watchdogs as well as the international media awake from the slumber. Resultantly, the foreign media started covering Kashmir issue including atrocities by the Indian forces.\nThe US Congress held hearing on the issue and the world leaders including Donald Trump and Turkish President Recep Tayyip Erdogan made public statements. Trump also repeatedly offered to mediate on the issue brushing aside Indian stance of considering the matter purely bilaterally.\nThe prime minister made Pakistan a linchpin in the region with frequent foreign head-level visits including Abdu Dhabi Crown Prince, Saudi Crown Prince, British Royal Couple, Afghan President and several others.\nThe credit for the revival of Pak-US ties based on trust also goes to the prime minister who also played a key role to facilitate US-Taliban peace agreement, making the world acknowledge country’s positive contribution. US Special Envoy on Afghanistan Zalmay Khalilzad also admitted of positive change in Pakistan’s foreign policy.\nWhile refusing to join any alien war, the prime minister committed that Pakistan would now play a role of peacemaker and played key role to resolve tension between Saudi Arabia and Iran.\nSuch dramatic changes in Pakistan’s image abroad also led to the revival of international sports in Pakistan like international test cricket in December 2019, Kabaddi World Cup in 2020 and Pakistan Super League played locally.\nPakistan was ranked as the best holiday destination for 2020 by Conde Nast Traveller, a luxury and lifestyle travel magazine. Forbes Magazine listed Pakistan among the best under-the-radar places to visit in 2020.\nThe British Backpacker Society declared the country as the world’s 3rd highest potential adventure destination for 2020. Travel advisories to Pakistan were also eased by the UK, USA, Norway and Portugal.",
  "retrievedAt": "2025-08-11T19:28:49.556Z"
}
