{
  "title": "Welfare of poor, vulnerable segments focus of PM’s policies: Shibli",
  "link": "https://www.app.com.pk/national/welfare-of-poor-vulnerable-segments-focus-of-pms-policies-shibli/",
  "date_published": "2020-07-12T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP):Minister for Information and Broadcasting Shibli Faraz on Sunday said welfare of the poor and vulnerable segments of the society was the focus of Prime Minister Imran Khan’s policies.\nThe new housing policy was one of such initiatives aimed at helping the poor people build their own houses, he said while addressing here a press conference flanked by Naya Pakistan Housing Authority Chairman Lt Gen (retd) Anwar Ali Hyder.\nThe minister urged the resourceful people to take full advantage of the Pakistan Tehreek-e-Insaf government’s policy as they would not be asked about their source of investment in the construction sector till December.\nAll-out efforts were being made to remove all the hurdles being faced by the construction industry, he said.\nShibli Faraz said announcement of the historic package for the construction industry was a timely step as the sector had the potential to lift the entire economy because over 40 industries were related to it.\nHe said the government was serious in promoting the housing sector and for the purpose the National Coordination Committee on Housing headed by General Hyder, was set up on the pattern of NCOC (National Control and Operation Centre).\nHe said for the removal of impediments in the house building process, a one-window operation system was devised to reduce the time required for clearance of documents.\nHe said meetings were held with all the stakeholders, including the high-ups of provincial governments, State Bank of Pakistan and Federal Board of Revenue to achieve the target.\nShibli Faraz said under the new housing policy, the commercial banks had been issued directives to allocate 5 per cent of their lending portfolio for the construction industry, which at present was less than one percent whereas in neighbouring India it was 27 percent.\nDue to the change in the banks’ lending policy, Rs 330 billion would be available for the construction industry, while the government would also give Rs 130 billion subsidy on the such financing, which would benefit the lower income groups, he added.\nHe urged the builders and developers to take full advantage of the package and start their projects before December 31.\nThe minister said the government’s responsibility was to provide facilities and remove hurdles in the house building process, besides giving incentives in the shape of tax reduction and the relaxation of not disclosing source of funding.\nThe initiative, he said, would not only boost the industry and create employment opportunities but also overcome the shortage of housing units in the country.\nHe said in the first phase, the target was to build about 100,000 new housing units in Pakistan.\nTo a question, he said the scheme was not limited to some areas or cities but could be availed in all parts of the country.\nIt was the objective of the government to materialize the dreams of lower income people of having houses by easing the cumbersome process of getting no-objection certificates, approval of house designs, power and gas connections and above all bank financing.\nHe said the new policy would not only promote the real estate business but also the entire housing industry which would have a far reaching impact on the whole economy.\nIt would institutionalize the mortgage facility, he added.\nTo another question, the minister said after the outbreak of coronavirus, the anti-polio campaign was affected. However, now the drives would be launched with a renewed vigour to completely root out the deadly disease from the country, he added.",
  "retrievedAt": "2025-08-11T19:28:49.562Z"
}
