{
  "title": "Sahibzada Mehboob Sultan, MPAs call on CM Punjab",
  "link": "https://www.app.com.pk/national/sahibzada-mehboob-sultan-mpas-call-on-cm-punjab/",
  "date_published": "2020-07-11T22:38:00.000Z",
  "source": "APP",
  "content": "LAHORE, July 12 (APP):-:Federal Minister Sahibzada Mehboob Sultan and Members Punjab Assembly met Chief Minister Punjab Sardar Usman\nBuzdar here on Sunday.\nMatters pertaining to mutual interests, political situation, development projects and problems of various constituencies came under discussion during the meeting, says a handout.\nTalking on the occasion, Usman Buzdar said,”We would not let the progress journey of Punjab halt and added that consultations of assembly members would be given due importance in development projects. He maintained the journey of making real progress in Punjab had set off and lamented that show off was done in the past instead of doing progress.\nThe CM underscored that those hatching conspiracies would lag behind\nas before and new Pakistan would keep on advancing forward under the\nvibrant leadership of Prime Minister Imran Khan.\nThe CM said that elements doing undue criticism were creating obstacles\nin the journey of progress from the outset. He regretted that such elements\ncaused immense loss to the national interests for the sake of their vested\ninterests. He vowed that under construction projects of health and education\nwould be completed on priority basis.\nHe said that game changer projects like Jalalpur Canal and Greater Thal Canal\nwere also being launched and stressed that we would change destiny of the\nunder developed areas.\nThe CM maintained that progress was everyone’s right adding that every city\nand corner of Punjab would be benefited from the fruits of progress.\nThose Punjab Assembly Members who called on Chief Minister included Rana\nShahbaz Ahmed, Syed Abbas Shah, Muhammad Ali Qureshi and Sahibzada\nGhazeen Abbasi while Principal Secretary to CM was also present on this occasion.",
  "retrievedAt": "2025-08-11T19:28:57.324Z"
}
