{
  "title": "Police fire tear gas as clashes erupt with Sost protesters in GB, organisers claim - Pakistan - DAWN.COM",
  "author": null,
  "content": "A clash broke out between police and protesters in the early hours of Thursday, leaving several injured, protest organisers claimed, as traders continued to block routes in Gilgit-Baltistan’s Sost Valley.\n\nLast month, Pak-China Tajeer Etihad Action Committee launched a protest against the suspension of border trade via the Khunjerab Pass, blaming the federal government’s inaction over unresolved tax-related issues, which have inflicted heavy losses on importers and exporters over the year.\n\nOne of the organisers, Muhammad Ismail, claimed that the police had launched a crackdown against peaceful protesters, stating: “Police resorted to tear gas and aerial firing to disperse protesters from the venue.”\n\nSpeaking to reporters, Hunza Superintendent of Police Nabeel Ahmed said that there was no plan to launch a crackdown on the sit-in.\n\n“Police were deployed only to arrest a suspect who is allegedly extorting traders at the customs and immigration area upon their return from China,” he said. “The sit-in organisers had been asked to hand over the suspect for investigation, but they have not done so yet.”\n\nThe protest organisers said that the police and district administration had warned the protesters to disperse from Sost.\n\nAddressing an emergency press conference, Ismail, Ebadullah, Gul Sher and other committee members claimed that the police launched “an attack on protesters at midnight to sabotage the peaceful protest for the rights of GB people”.\n\nThe protest organisers said they had been engaged with various committees, including one constituted by the prime minister for negotiations, but claimed that “the government resorted to using force”.\n\nThe organisers highlighted that the GB traders were protesting for one month for their genuine demands, including customs clearance of 280 consignments which have been stranded at the Sost Dry Port for 10 months.\n\nOpposition Leader in the GB Assembly, Kazim Mesum, issued a statement condemning the use of force, warning the government that suppressing peaceful demonstrations could ignite a larger movement across GB.\n\nSeparately, the Sost Bazaar Association held a shutter-down strike and protest rally against the shelling and firing by police and FC.\n\nDuring a press conference, the association’s President, Ulfat Karim, said, “Sales tax and income tax are not applicable as GB was not constitutionally part of Pakistan.”\n\nThe association condemned the authorities’ action against the traders and denounced the indiscriminate shelling of shops, petrol pumps, hotels, and other properties, announcing its full support for the ongoing sit-in.\n\nOn July 28, traders in GB blocked Sost dry port, halting all trade and travel between Pakistan and China. The protest on the Kara­k­oram High­w­­ay (KKH) has paralysed the regional economy and stranded travellers, including Chinese nationals who also staged a protest demanding passage into China through the Khunjerab pass.\n\nIn June, thousands of passengers and tourists remained stranded at KKH for many hours after traders had blocked the road. The protesters vowed that the road connecting Pakistan with China would remain closed to traffic till the acceptance of their demands.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/21130621a806f63.jpg",
  "retrievedAt": "2025-08-22T00:32:16.238Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932291/police-fire-tear-gas-as-clashes-erupt-with-sost-protesters-in-gb-organisers-claim",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T10:47:16.000Z"
}
