{
  "title": "Feeding few, failing many - Newspaper - DAWN.COM",
  "author": null,
  "content": "HOW does a nation blessed with the Indus, fertile plains and bumper harvests fail to feed its people? How does a country that claims agriculture as its economic backbone leave 40 per cent of its population food-insecure and nearly half its children malnourished? The truth is that Pakistan’s agricultural policy is not broken by accident; it is broken by design, and the cracks are widening under the twin pressures of climate change and debatable governance choices. For decades, food security has been treated as a slogan, trotted out in budget speeches and policy documents, yet never elevated to the level of a national emergency. The 2022 floods that drowned a third of the country and the 2024 drought that starved the wheat crop should have been clarion calls for transformation. Instead, we saw a reactive state, stumbling from subsidies to bans, from imports to exports, without producing a coherent strategy.\n\nThe numbers are brutal. Agriculture growth has ricocheted from 4.4 per cent in FY2022 to a dismal 1.55pc the following year, only to bounce to 6.25pc before collapsing again to 0.56pc in FY2025. Wheat, the nation’s staple, touched a record 31.4 million tonnes in 2024, yet the government chose to abandon its decades-old practice of announcing a support price. Instead, policymakers flirted with the idea of a purely market-based price mechanism. In theory, such a shift appears modern and market-oriented; in practice, in a country like Pakistan, where agricultural markets are frequently captured by cartels and food mafias, it is tantamount to surrendering farmers to predatory middlemen. Such market liberalisation may be conceivable over a 10- to 20-year horizon, after gradual reforms in transparency and competition, but as an abrupt experiment, it is reckless. The immediate effect was predictable: farmers, deprived of certainty, reduced sowing just as drought slashed rainfall by nearly half. The result is a policy that destabilised farmers in the name of efficiency while strengthening the very mafias it purported to sideline.\n\nThe budgetary trail tells an equally dismal tale. Between FY2022-23 and FY2025-26, irrigation absorbed a staggering 460 billion in allocations, dwarfing the paltry sums allotted to agriculture itself. Food allocations hovered around 20-23bn, while forestry and fisheries were left to starve on scraps of 2bn each. And yet, despite the torrent of funds poured into irrigation, canal losses remain endemic, water use efficiency is pitiful, and small farmers are still at the mercy of the monsoon. Forestry, which could provide crucial buffers against floods and carbon sinks against climate chaos, continues to be an afterthought. Fisheries, with untapped export potential, languish in neglect. This is not merely inefficiency; it is deliberate misdirection. Successive governments have chosen the optics of irrigation projects and wheat procurement over structural reform. Billions are burned on subsidies that often benefit middlemen and factory owners, not the farmers they are meant for. Direct support to smallholders, who make up 90pc of the sector, remains an afterthought.\n\nWhen corporate farming is presented as the solution, while forestry, fisheries and nutrition languish, it betrays skewed priorities.\n\nIt is within this vacuum of coherent policy that the Green Pakistan Initiative (GPI) has been launched, heralded as the silver bullet to modernise agriculture. Nearly 4.8m acres of state land, much of it pastoral or fallow, is being leased to corporate entities, with the army as the majority shareholder. Gulf states have been courted to invest, with promises of mechanisation, exports and prosperity. By mid-2024, 864,000 acres had already been parcelled out.\n\nThis experiment is a gamble with Pakistan’s food sovereignty. The project may enrich investors and produce impressive export figures, but at what cost? The official assurance that “60 per cent of produce will stay in Pakistan” is cold comfort when history tells us that contracts follow profit, not patriotism. Whose food security will these farms ultimately serve? Islamabad’s or Riyadh’s? Critically, GPI repeats a familiar sin: privileging spectacle over substance. It may modernise agriculture for the few, but it does nothing for the many. It cannot deliver certified seed to the smallholder in Bahawalpur, or affordable fertiliser to the tenant farmer in Sindh, or a reliable canal supply to the sharecropper in Balochistan. Instead, it risks displacing them, stripping away their customary land and grazing rights in the name of “efficiency”.\n\nTo be clear, corporate farming is not inherently malign. Pakistan does need investment, technology transfer and better supply chains. But when corporate farming is presented as the solution, while forestry, fisheries and nutrition languish, it betrays skewed priorities. When the military, not the farmer, is the central stakeholder, it indicates power consolidation more than agricultural reform.\n\nWhat, then, must change? First, the government must put its money where its mouth is. Agriculture allocations of 14bn are risible against the enormity of the challenge. Forestry and fisheries, neglected for too long, require a trebling of funds. Irrigation spending must pivot from megaprojects to efficiency and conservation, especially solar-powered pumps and modern drip systems. Second, subsidies must be honest. The recent abolition of cheap gas for fertiliser factories long a windfall for industry barons, was overdue. Redirecting those subsidies directly to farmers through digital Kissan Cards is the right path, but only if transparency is guaranteed. Third, climate-smart agriculture must move from rhetoric to reality. Drought-resistant seeds, crop insurance and water governance reforms are not luxuries; they are lifelines.\n\nAbove all, Pakistan must decide whose agriculture it is nurturing. Is it the agriculture of the multinational and the Gulf investor, or the agriculture of the smallholder and the landless labourer? Is food security to be treated as a national security priority, or a line item in an IMF-negotiated budget? These are questions of political will, not technical feasibility.\n\nPakistan has no dearth of plans; it has a dearth of priorities. Unless it corrects course, it risks a future where corporate farms flourish, exports dazzle, but its own citizens remain malnourished. The call to action is urgent: centre the small farmer, reorient subsidies, and treat food security as existential, not optional. Only then can Pakistan hope to escape the cycle of feast and famine, of flood and drought, of promise and betrayal.\n\nThe writer is a PhD scholar in plant sciences at Montana State University, US.\n\nPublished in Dawn, August 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/201415210bdfd53.png",
  "retrievedAt": "2025-10-12T03:52:00.644Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931985/feeding-few-failing-many",
  "dateList": "2025-08-21",
  "date_published": "2025-08-20T00:22:34.000Z"
}
