{
  "title": "Balochistan lawyers decry raid on former judge’s home - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The legal community in Balochistan on Wednesday raised alarm over the alleged abduction of a former judge’s son, calling it “a violation of the sanctity of privacy and the rule of law”\n\nAddressing a presser at the Balochistan High Court Bar Room, Advocate Zahoor Ahmed Shahwani claimed that masked security personnel conducted a warrantless raid on his home and took away his son, also a lawyer, who was later released.\n\nMr Shahwani was accompanied by Attaullah Langove Advocate, former Supreme Court Bar Association President and Senator Amanullah Kanrani Advocate, Nazir Agha Advocate and others.\n\nHe said such raids reflect a worsening situation in Balochistan over the past four years.\n\n“Despite lawyers raising their voices for judicial independence, they are being picked up,” he said. “Such actions are breeding hatred among the people, and authorities must realise the consequences.”\n\nHe added that if any cases exist against lawyers, they should be brought before the courts instead of being handled through unlawful detentions. Announcing plans to file a police report and pursue legal action, Mr Shahwani insisted that constitutional requirements must be met before any detention.\n\nAttaullah Langove, president of the Balochistan High Court Bar Association, said that constitutional violations have become routine.\n\n“If there is evidence against a lawyer, they should be arrested in broad daylight, not in the darkness of night,” he said, warning that midnight raids on the homes of lawyers would not be tolerated.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-22T00:32:38.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932175/balochistan-lawyers-decry-raid-on-former-judges-home",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:31.000Z"
}
