{
  "title": "PTI taps Achakzai and Swati for opposition leader slots - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The PTI chief on Wednesday nominated party outsider Mahmood Khan Acha­kzai — the head of the Pasht­unk­hwa Milli Awami Party and a PTI-led opposition alliance — and party veteran Azam Swati as oppo­sition leaders in the Nati­onal Assembly and the Senate, respectively.\n\nPTI Secretary General Salman Akram Raja told reporters that they had received a message from party founder Imran Khan nominating Mr Achakzai as the NA opposition leader and Senator Swati as the Senate opposition leader. Tehreek Tahafuz Ayeen-i-Pakistan, a PTI-led opposition alliance, is also headed by the PkMAP chief.\n\nMr Achakzai is a veteran political figure from Balochistan, particularly known for his outspoken stance against the establishment. If all goes as per Mr Khan’s plan, this would be the first time the PkMAP chief will be leading the opposition in the lower house of parliament.\n\nSwati, a PTI veteran who joined the party before the 2013 elections, was jailed and allegedly tortured for his tweet against then army chief Qamar Javed Bajwa. He was also embroiled in a controversy after the PTI abruptly postponed its Aug 22 gathering in Tarnol last year, prompting Aleema Khan to question his loyalties.\n\nImran seeks five names for Punjab Assembly Opp leader, orders party meeting for by-polls decision\n\nAbout the opposition leader in the Punjab Assembly, he said, Mr Khan had sought five names from the parliamentary party to make his decision. It may be noted that the Election Commission of Pakistan had disqualified NA Opposition Leader Omar Ayub, Senate leader Shibli Faraz, and Punjab opposition leader Malik Ahmad Bhachar following their conviction in the May 9 cases.\n\nThe instructions from Imran Khan came through party lawyer Ali Bukhari, who met the former premier in Adiala jail, said sources.\n\n“During the conversation, Imran Khan shared the extremely difficult conditions he is currently enduring in custody. He noted that, in violation of jail regulations, he has been provided only four books over the past month, and is being denied access to television, newspapers, and even a private medical doctor, among other basic facilities,” the sources said.\n\nThey said Imran Khan also asked the party’s public committee to convene immediately and deliberate on whether or not to contest by-elections.\n\nIt is worth mentioning that political observers believed that the PTI would be making a “strategic and political mistake” if it did not nominate new opposition leaders in the Senate and the National Assembly, even on a temporary basis.\n\nThey believed that a failure to fill these posts would not only provide the government an opportunity to establish a complete hold in parliament, but would also give them carte blanche in appointments to key constitutional offices.\n\nOn August 8, after the ouster of its opposition leaders in both houses of parliament, the PTI declared it would not nominate new opposition leaders and would challenge the decision in a court of law.\n\nFollowing the move, Omar Ayub Khan had told Dawn he would file a contempt application, as declaring his seat vacant was a clear violation of a Peshawar High Court (PHC) order, which had restrained the ECP from proceeding with his disqualification.\n\nAccording to the NA rules, the speaker shall declare a member as leader of the opposition having the greatest numerical strength after verification of the signatures of the members: provided that any member who is not signatory to the proposal, if he presents himself before the count, and signs the proposal, shall be included in the count.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-22T00:32:22.482Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932198/pti-taps-achakzai-and-swati-for-opposition-leader-slots",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:17.000Z"
}
