{
  "title": "Nato chiefs confirm support for Ukraine - World - DAWN.COM",
  "author": null,
  "content": "BRUSSELS: Nato military chiefs on Wednesday discussed the details of eventual security guarantees for Ukraine, pushing ahead the flurry of global diplomacy aiming to broker an end to Russia’s war.\n\nNato military leaders had a “great, candid discussion” during a video conference on the results of recent talks surrounding the conflict in Ukraine, the chair of the alliance’s military committee said on Wednesday.\n\n“On #Ukraine, we confirmed our support. Priority continues to be a just, credible and durable peace,” Admiral Giuseppe Cavo Dragone wrote in a post on social media platform X.\n\nMeanwhile, a small group of military leaders is continuing discussions in Washington to work out options for security guarantees for Ukraine, a Western official told Reuters on Wednesday, shortly after a bigger virtual meeting wrapped up. The source said US General Dan Caine, chairman of the Joint Chiefs of Staff, was holding the talks that also involved around half a dozen other Nato chiefs of defence.\n\nRussia says it must be part talks on security guarantees\n\nThe Western official said there were no results yet since the topic of security guarantees had not been discussed in detail at a video conference of all Nato chiefs of defence earlier in the day.\n\nThe source expected further meetings of the chiefs of defence in the broader format to be called, in order to discuss any options worked out in the smaller group.\n\nNo time frame has been set for discussions as the final decision will lie with political leaders, the official said.\n\nFew details leaked on the virtual meeting of military chiefs from Nato’s 32 member countries. But on Tuesday evening, Dan Caine held talks with European military chiefs on the “best options for a potential Ukraine peace deal,” a US defence official told AFP.\n\nUS President Donald Trump brought Ukrainian President Volodymyr Zelensky and European leaders to the White House on Monday, three days after his landmark encounter with Russian President Vladimir Putin in Alaska.\n\nTrump, long a fierce critic of the billions of dollars in US support to Ukraine since Russia invaded in 2022, earlier said European nations were “willing to put people on the ground” to secure any settlement. He ruled out sending US troops but suggested it would provide air support instead.\n\nBut while Trump said Putin had agreed to meet Zelensky and accept some Western security guarantees for Ukraine, Kyiv and Western capitals have responded cautiously, as many of the details remain vague.\n\nRussia wants in\n\nRussia said on Wednesday it had to be part of any discussion on security guarantees for Ukraine and downplayed the likelihood of an imminent summit with Zelensky, tempering hopes for a quick peace deal.\n\nRussia’s Foreign Minister Sergei Lavrov warned that “seriously discussing security guarantees without the Russian Federation is a utopia, a road to nowhere”.\n\nLavrov also cast doubt on an imminent meeting between the sworn enemies, saying that any summit between Putin and Zelensky “must be prepared in the most meticulous way” so it does not lead to a “deterioration” of the situation surrounding the conflict.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-22T00:32:43.622Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932161/nato-chiefs-confirm-support-for-ukraine",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:23.000Z"
}
