{
  "title": "Donors push for polio eradication as funding becomes scarce - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Security threats continue to hinder Pakistan’s nationwide polio vaccination efforts as officials reported on Wednesday that nearly 800,000 children continually miss their vaccinations, and in response to pressure from donors, a new goal is set to halve this number in hard-to-reach areas of the country.\n\nThe challenge was outlined by a high-level Rotary International delegation visiting Pakistan, which announced that concerted efforts would be made to improve coverage during the upcoming polio campaign starting Sept 1.\n\nThe delegation has held meetings with Prime Minister Shehbaz Sharif, the Chief of General Staff, PM Focal Person Senator Ayesha Raza Farooq, Federal Health Minister and others.\n\nDelegates stressed a growing urgency from international donors to complete the eradication effort as financing becomes more difficult to arrange.\n\nSecurity issues hamper vaccination campaigns; over 768 have lost lives\n\n“Over 1pc i.e. less than 800,000 children are missed during polio campaigns. We can understand that it is not possible to reach every child but efforts need to be made to reduce the number of missed children,” said Francesco Arezzo, a member of the delegation. “On the other hand we also realise that 768 people have sacrificed their life during last 10 years.”\n\nHolger Knaack, another delegate, said the pressure from funders is increasing.\n\n“We have been releasing US $150 million every year but this year US $500m have been released just because we want to finish the job,” Mr Knaack said, revealing the heightened investment. He noted that all donors are asking “when every missed child will be reached”.\n\n“India eradicated the virus by focusing on sanitation,” he explained. “We are not here to push the government and army but we want that they should focus more.” Aziz Memon, a local Rotary leader, confirmed the pressure from donors and reiterated the new target for the September campaign.\n\n“Efforts will be made to reduce the number of missed children by 50pc,”Mr Memon said. He said that security was “the major barrier and efforts were being made to address the issue”.\n\nMr Memon recalled that Pakistan was on the brink of eradication in 2019, with no positive environmental samples for 14 months, until a controversy in the Bajaur district led to a resurgence of the virus.\n\nBrigadier retired Abul Hasan, who handles security for the program, detailed the human cost of the vaccination drives, saying that Rs 1m in compensation was given to the families of martyred polio workers and security officials, with up to Rs 500,000 provided to those injured.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/210934079f0f759.png",
  "retrievedAt": "2025-08-22T00:32:41.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932180/donors-push-for-polio-eradication-as-funding-becomes-scarce",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:31.000Z"
}
