{
  "title": "Lahore man accused of ‘sextortion’ of minor sent on 5-day physical remand - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Lahore man accused of “sextortion” of a minor via social media platform Snapchat was handed over to police for a five-day physical remand, the National Cyber Crimes Investigation Agency (NCCIA) said on Thursday.\n\nAs per the court order given by a district and sessions court in Lahore, it was notified that the accused should be handed over to the police for a five-day investigation.\n\nAccording to NCCIA’s application for the remand, a copy of which is available with Dawn.com, the accused was arrested after NCCIA received a tip-off from an international organisation. He was booked for sharing pornographic material via the social media application Snapchat and engaging in “sextortion” of a minor.\n\nUpon arrest, NCCIA confiscated the phone of the accused and found pornographic material on the phone, in its “screenshot” and “screen-recording” folders.\n\nDuring the initial interrogation conducted by the NCCIA, the accused confessed to the crimes.\n\nSubsequently, a first information report (FIR) was registered against the accused under Section 22 (unauthorised use of identity information) of the Prevention of Electronic Crimes Act, 2016 (Peca).\n\nThe court ordered the accused to be presented on 26 August.\n\nThe investigation officer, NCCIA sub-inspector Shafqat Ehsan, had requested a 14-day physical remand, which was denied.\n\nAccording to a report by a child rights organisation, Sahil, as many as 3,364 child abuse cases were reported from all four provinces, Islamabad Capital Territory (ICT), Azad Jammu and Kashmir (AJK), and Gilgit-Baltistan (GB) in the year 2024. A gender-divide analysis indicated that out of the total reported cases, 1,791 (53 per cent) victims were girls and 1,573 (47pc) boys.\n\nOf the 200 cases of child sexual abuse reported, 93 of the child victims were male and 108 were female.\n\nEarlier this week, the interior ministry informed the Senate that of the 567 cases of sexual abuse registered in Islamabad between 2021 and June 2025, 200 of them involved children.\n\nIn July, police [arrested 2] a man after footage showing him allegedly molesting a minor girl in Punjab’s Kasur district went viral online.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-22T00:32:16.056Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932330/lahore-man-accused-of-sextortion-of-minor-sent-on-5-day-physical-remand",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T10:43:08.000Z"
}
