{
  "title": "CJP Afridi puts onus on prosecution in Imran’s bail denial appeal - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Justice of Pakistan (CJP) Yahya Afridi has asserted that the prosecution bears the burden of proving why the Supreme Court should uphold the lower courts’ decisions denying post-arrest bail to PTI founder Imran Khan in eight cases related to the May 9 violence.\n\nCJP Afridi, who was heading a three-judge Supreme Court bench, also asser­ted the court would not allow an undue delay in hearings after the bench was informed that Punjab’s Special Prose­cutor Zulfikar Naqvi was hospitalised due to food poisoning and requested to adjourn proceedings for another week.\n\nEarlier on Aug 12, the CJP had directed Punjab’s special prosecutor to come prepared to explain how the Lahore High Court (LHC) could delve into the merits of the case and then deliver a final opinion on a matter still sub judice.\n\nThe SC bench, which also comprised Justice Muhammad Shafi Siddiqi and Justice Miangul Hassan Aurangzeb, took up a set of appeals filed by former prime minister Imran Khan but postponed Wednesday’s proceedings until Thursday.\n\nSays undue delay will not be allowed, puts off hearing till today\n\nAt the outset, the bench declined a re­­quest from Advocate Salman Safdar — senior counsel for Imran Khan — to allow Mr Khan’s sisters, who were present in the courtroom, to address the bench.\n\nHowever, CJP Afridi made it clear that the court would only hear arguments from legal counsel and not from family members.\n\nAs the hearing commenced, the court was informed about the illness of Punjab’s special prosecutor. A lawyer informed the court that he had a six-minute phone conversation with the ailing prosecutor.\n\nHowever, Advocate Safdar argued that further postponement was unwarranted, urging the bench to allow the petitioner’s side to begin its arguments.\n\nCJP Afridi clarified that the prosecution must present its case first, particularly to demonstrate why the LHC’s bail rejection should be upheld.\n\nAdvocate Safdar, however, highlighted that the LHC had denied bail in November 2024 after the case lingered in the court for months — with sixteen hearings, eight changes in prosecutors, and repeated adjournments requested by the state.\n\n“We are now fed up with this state of affairs,” the counsel remarked in frustration. While acknowledging the concern, CJP Afridi maintained that the Supreme Court would not permit long adjournments and put off the hearing until Thursday.\n\nOn Nov 27, 2024, an anti-terrorism court had rejected bail for Imran Khan in eight cases linked to the May 9 violence. The allegations included involvement in attacks on Askari Tower in Liberty, the PML-N offices in Model Town, Shadman Police Station, the torching of police vehicles near Jinnah House, and unrest at Sherpao Bridge. The LHC later upheld the anti-terrorism court’s decision.\n\nMr Khan’s appeal to the SC argues that he is the target of a politically motivated campaign following his ouster from office in 2023. The petition claims that the current case is yet another attempt to implicate him in criminal proceedings based on vague allegations of abetment, without concrete evidence linking him to the alleged incidents.\n\nAccording to the petition, after Khan’s “unlawful” arrest from the Islamabad High Court premises, multiple FIRs were registered in Lahore and Islamabad. These, it argues, lack specific allegations or evidence and rely on supplementary police statements that were introduced later as an afterthought to implicate the PTI founder.\n\nThe petition further questions why, if the authorities knew of a conspiracy as early as May 7, 2023, they took no preventive action — asserting that this in­­action highlights the alleged mala fide and politically driven nature of the charges.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-22T00:32:42.240Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932182/cjp-afridi-puts-onus-on-prosecution-in-imrans-bail-denial-appeal",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:30.000Z"
}
