{
  "title": "At least one dead on 3rd day as NDMA issues rain emergency alert for Karachi, Hyderabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "A man was killed in a rain-related incident on Thursday as parts of Karachi received rain again for a third day with the National Disaster Management Authority (NDMA) issuing an emergency alert.\n\nTuesday’s rains had severely strained Karachi’s fragile infrastructure, causing stormwater drains and sewers to burst, and also disrupting industrial operations across the economic hub. Several areas experienced extended power and internet service outages, which continued late into Wednesday, disrupting everyday life and adding to citizens’ misery. The rain-related death toll rose to 14. Most of the deaths occurred due to collapsing structures, drowning and electrocution during the past three days, according to hospital officials.\n\nParts of Karachi intermittently received rain today as well, beginning after 2pm.\n\nPolice surgeon Dr Summaiya Syed told Dawn.com that the body of a 30-year-old, who died from an electric shock, was brought from Karachi’s Defence Housing Authority to the medico-legal section of Jinnah Postgraduate Medical Centre today. The death toll is now 15.\n\nAn emergency alert from the NDMA at 8:24pm said that heavy rain with thunder was expected in Hyderabad in the next hour or two, which may lead to urban flooding. It said heavy rain was also expected in Karachi within the next 60-90 minutes.\n\n“Torrential rain may cause urban flooding and power outages. This system may affect again from August 24 to 28.”\n\nThe NDMA urged citizens to avoid travelling on flooded roads, stay away from electric poles, secure electrical appliances and take safety precautions while using them and check drainage systems in areas to prevent water accumulation.\n\nIt said residents of low-lying areas should keep an emergency kit ready and follow the instructions of the local administration.\n\nMeanwhile, the Karachi Traffic Police issued alerts stating that thunderstorms and heavy rain had begun in the city.\n\n“All passers-by and passengers are requested to stay away from dilapidated buildings, signboards, trees and electricity poles during their journey to avoid any possible accident,” the alert read, adding that citizens could contact the 1915 helpline in case of an emergency.\n\nA separate alert urged people to be careful while travelling and discouraged unnecessary movement.\n\nRainfall figures from the Met Department at 8pm showed that Gulshan-i-Hadeed received the most rainfall with 18 millimetres (mm), followed by PAF Base Faisal (17mm), Saadi Town (13.3mm), Airport Old Area (11.2mm), PAK Masroor Base (10mm), Keamari (8mm), Orangi Town (7.8mm), Gulshan-i-Maymar (7.5mm), Surjani Town and North Karachi (7mm), Defence Housing Authority Phase VII (6.4mm), Korangi (4.4mm), University Road (4.2mm) and tracefall in Nazimabad.\n\nIn an advisory at 5pm, the Pakistan Meteorological Department (PMD) warned of torrential rains with wind/thundershower predicted in the country’s upper and central parts from Aug 23-27 and heavy rains expected in Sindh and eastern/southern Baluchistan from Aug 27-29.\n\nIn its daily weather forecast at 5:30pm, the PMD said rain-wind/thundershowers with isolated heavy falls were expected in Mithi, Tharparker, Umerkot, Mirpurkhas, Hyderabad, Shaheed Benazirabad, Karachi, Thatta, Badin, Sajawal, Tando Allayar, Tando Muhammad Khan, Sanghar, Jamshoro and Dadu with possible urban flooding as well.\n\nIn a 6:48pm alert on Karachi’s situation, the PMD said more rain with thundershowers and strong winds at most places and heavy rain at places was likely during the next one to three hours, due to which there was a risk of flooding in low-lying areas.\n\n“All concerned agencies are directed to remain on high alert. The public is advised to take precautionary measures and stay informed during bad weather.”\n\nKarachi city administration issued a handout today outlining the drainage of water and traffic movement at various markets, underpasses and causeways, stating that rainwater has been drained from most city markets, including Jodia Bazaar, Allah Wali Market, and Jamia Cloth Market.\n\n“More than four underpasses have been cleared of water and have been opened for traffic,” the handout read.\n\nAccording to the handout, all deputy commissioners were working to drain rainwater from underpasses and roads and improve traffic flow, with assistant commissioners present in the field and collaborating with the relevant departments to resolve issues.\n\nKarachi Commissioner Syed Hassan Naqvi was quoted as saying that all departments were working together with “strong coordination and cooperation”.\n\nThe handout stated that drainage work had been completed at Nazimabad Underpass, Tariq Road Underpass, Golimar Underpass and Sohrab Goth Underpass, with all four passages open for traffic.\n\nNipa and the Old Sabzi Mandi Road, from Civic Centre to Mazar-i-Quaid, were also opened for traffic. However, the commissioner has requested citizens to avoid using the road due to traffic congestion caused by a sewage issue.\n\n“Traffic is flowing normally on Sharea Faisal and Jam Sadiq Bridge, where drainage work was previously completed and vehicular traffic was allowed,” the commissioner was quoted as saying.\n\nAdditionally, the Korangi Causeway and EBM Causeway, which were closed due to waterlogging, were opened for traffic after complete drainage.\n\nWork was progressing rapidly at Drug Road Underpass and Sohrab Goth Underpass, where pumps have been installed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/21205835264d1cc.jpg",
  "retrievedAt": "2025-08-22T00:32:14.301Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932716/at-least-one-dead-on-3rd-day-as-ndma-issues-rain-emergency-alert-for-karachi-hyderabad",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T17:06:29.000Z"
}
