{
  "title": "Salah wins PFA Player of the Year award for third time - Sport - DAWN.COM",
  "author": null,
  "content": "MANCHESTER: Mohamed Salah was named the Professional Footballers’ Association Player of the Year on Tuesday, with the Egyptian becoming the first player to win the award three times after guiding Liverpool to Premier League glory.\n\nSalah, who joined Liverpool in 2017, was the Premier League’s top scorer last season, with his 29 goals, along with 18 assists, playing a key role in the Reds winning a record-equalling 20th English top-flight title with four games to spare last season, finishing 10 points ahead of runners-up Arsenal.\n\nThe 33-year-old had already clinched the Premier League Player of the Season award, the Golden Boot for most goals scored and the Playmaker award for most assists, making him the first player to win all three awards in the same season.\n\nSalah first won the PFA award in 2018 after his first season at Liverpool, and again in 2022, and this year came out on top of a six-man shortlist, voted for by PFA members from the 92 Premier League and Football League teams.\n\nThat shortlist included his Liverpool team-mate Alexis Mac Allister, along with Newcastle United’s Alexander Isak, Manchester United’s Bruno Fernandes, Arsenal’s Declan Rice and Chelsea’s Cole Palmer.\n\nSalah signed a two-year contract extension with Liverpool in April, ending months of speculation linking him with a move to the Saudi Pro League.\n\nAston Villa and England midfielder Morgan Rogers was voted Young Player of the Year, after the 23-year-old scored eight league goals in his 37 starts last season and netted four goals in the Champions League including a hat-trick against Celtic.\n\nSalah is joined in the 2024/25 PFA Premier League team of the year by Liverpool team-mates Virgil van Dijk, Ryan Gravenberch and Mac Allister.\n\nMilos Kerkez, who moved to Anfield from Bournemouth in June, is also selected, as are the Arsenal trio of William Saliba, Gabriel Magalhaes and Rice.\n\nMatz Sels and Chris Wood are recognised for their fine campaigns at Nottingham Forest, while wantaway Newcastle striker Isak is included after finishing second to Salah in the Golden Boot race.\n\nArsenal midfielder Mariona Caldentey was named Women’s Player of the Year. The Spaniard scored nine league goals in her first season with the club along with eight goals in the Champions League where Arsenal beat her former club Barcelona to win the trophy.\n\nCanadian 21-year-old forward Olivia Smith, Liverpool’s leading scorer last season across all competitions with nine goals, picked up the Young Player of the Year award.\n\nSmith has since joined Arsenal for a reported fee of one million pounds ($1.35 million), making her the first female player to break the seven-figure barrier.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/112208069a9c52a.jpg?r=223323",
  "retrievedAt": "2025-08-22T00:32:32.576Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932151/salah-wins-pfa-player-of-the-year-award-for-third-time",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:46.000Z"
}
