{
  "title": "Murtaza Solangi’s appointment as Zardari’s spokesperson raises eyebrows - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Murtaza Solangi, a member of the caretaker cabinet that ran the country before the Feb 8, 2024 elections, has returned to the corridors of power, becoming the spokesperson for President Asif Ali Zardari.\n\nA former head of the Pakistan Broadcasting Corporation, Mr Solangi’s appointment has raised eyebrows, as sources close to the president said Mr Zardari was quite annoyed with him a few years ago, after he (Solangi) wrote an article criticising the PPP leader.\n\nA notification issued by the Presidency on Wednesday said: “Mr Murtaza Solangi is appointed as Spokesperson of the President of Pakistan on honorary/pro bono basis with immediate effect until further orders.”\n\nMurtaza Solangi wrote later on X: “I have been appointed the Spokesperson of the President of Pakistan. I will assume my new responsibilities starting tomorrow (Thursday). Thank you.”\n\nPolitical circles offered mixed opinions on Mr Solangi’s new assignment, as some believed that his appointment was a negation of an impression that “some big change” was about to take place in the presidency.\n\nOthers said his appointment had strengthened the belief that a change was imminent in the country’s highest office.\n\n“Yes, once President Zardari was annoyed with Mr Solangi when the journalist-turned-politician had written against him in Friday Times and in some other publications,” a senior PPP leader told Dawn.\n\n“I don’t know when and why Mr Zardari changed his mind and agreed to seek Solangi’s assistance.”\n\nThe source said that Mr Zardari and his party “usually forgave their enemies”, and recalled how former prime minister Benazir Bhutto had also relented and made Hussain Haqqani her adviser, despite his criticism of her.\n\nAnother politician said the appointment of Murtaza Solangi had opened “closed gates of the presidency for journalists”.\n\nPublished in Dawn, August 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2109583525e4b29.png",
  "retrievedAt": "2025-08-22T00:32:38.852Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1932176/murtaza-solangis-appointment-as-zardaris-spokesperson-raises-eyebrows",
  "dateList": "2025-08-21",
  "date_published": "2025-08-21T00:37:31.000Z"
}
